{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-confirms-first-covid-reinfection-as-china-shows-vaccine-progress-165544325.html", "published": 1598616200.0, "headline": "Coronavirus update: US confirms first COVID reinfection as China shows vaccine progress", "body": "The potential for recovered COVID-19 patients to become reinfected has created a new and worrisome wrinkle, as a confirmed case in Nevada revealed on Friday converged with fears from an isolated instance in Hong Kong.The Nevada man first confirmed positive for the virus in April, and was confirmed again 48 days later in June. Some experts have said that patients can remain positive for months, even without symptoms and post-recovery. However, the latest developments confirm that even those who recover aren’t protected by antibodies indefinitely.Researchers confirmed the Nevada reinfection through genetic data in the two positive results, which were different. The case is amplifying concerns about a coming second wave in the fall and winter — set to collide with the annual flu season.The global pandemic has reached nearly 24.5 million cases and killed more than 832,000. The U.S., India and Brazil top the charts with millions of cases, while Russia is nearing a million cases. Domestic cases are closing in on nearly 6 million, and more than 180,000 are dead.Cases are down in the U.S. week over week. (Graphic: David Foster/Yahoo Finance)Countries around the world continue to battle the global pandemic as major companies pursue treatments and vaccines at unprecedented speeds.While Western countries like the U.S., U.K. and Germany are working on frontrunner vaccine candidates, Russia has already claimed to have a vaccine ready to use, and China has been issuing emergency use authorizations for several candidates.Sinovac’s candidate, CoronaVac, was authorized last month, and a SinoPharm candidate was authorized recently, according to reports. But China has not officially provided many details.Last month, the country authorized use of trial vaccines on high risk populations, and CanSino’s candidate has been authorized for use by the military for one year.CanSino has been looking outside China, however, as the Canadian-Chinese company seeks emergency use authorizations for its candidate by other countries, according to the Wall Street Journal.Story continuesWhile the race for a vaccine has sowed seeds of nationalism, putting a question mark on which countries could gain access to a vaccine, it remains to be seen who signs on with China.Whether or not other countries will trust the regulatory and safety process in China is a concern, as pharmaceutical companies find it much easier to have free and open conversations with China’s regulatory bodies than in the U.S. or Europe.Zeke Emanuel, Vice Provost for Global Initiatives and chair of the Department of Medical Ethics and Health Policy at the University of Pennsylvania, said the race to be first is not the ideal strategy.“Both China and Russia, and the U.K., view this first across finish line as a test of their science and abilities. I keep saying...being first across the finish line reflects how easy it is to produce samples, not how effective they are likely to be,” Emanuel told Yahoo Finance, adding that there are likely to be many versions of the coronavirus vaccine as durability and effectiveness will be weaker in the first round.When asked if the U.S. could be using Chinese vaccines, National Institute of Allergy and Infectious Diseases director Anthony Fauci said it wouldn’t be necessary to consider. He said in a recent interview with Yahoo Finance that “my prediction would be that we would have more than one candidate that ultimately gets to the point of proven to be safe and effective.”Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}