{"article": [{"url": "https://finance.yahoo.com/news/iata-international-travel-2024-to-recover-from-covid-19-103216023.html", "published": 1600321220.0, "headline": "International travel could take until 2024 to recover from COVID-19", "body": "The Centers for Disease Control and Prevention (CDC) relaxed coronavirus screening guidelines for international travelers entering the United States this week but The International Air Transport Association (IATA) says it will take at least three years for international airline travel to recover from the COVID-19 pandemic.“It's a very challenging situation right now,” IATA’s Regional VP for the Americas Peter Cerda told Yahoo Finance’s On the Move. “The forecast that we have is about $84 billion collectively on a global scale in terms of losses.”North American carriers are estimated to lose close to $24 billion this year after making $17 billion in 2019 according to IATA.“We're hoping for domestic service to recover in about 2023 timeframe, but it is going to be a challenging period of time,” Cerda says. He pointed out that airlines are reducing their capacity and reducing their destinationsAnalysts at Raymond James recently surveyed 661 people to gauge how they expect to change their travel plans due to COVID-19. The results indicate that of the 65% of people who plan to travel in the next year, 58% will only go somewhere they can reach by car and 54% said they would look to travel to less crowded areas.Trends like this are one of the reasons Cerda says, “International transport is going to be the last segment of travel that we're going to see recuperate.”When will air travel fully recover?Recent moves by airlines“Airlines are seeing a faster demand recovery in leisure/VFR (visiting friends and relatives) and domestic travel in contrast to business and international [travel],” Raymond James analysts said in a note to clients this week.Southwest Airlines (LUV), in a recent 8K filing said the company, “Continued to experience a modest improvement in leisure bookings, thus far, for the remainder of September and for October 2020.” But Southwest is cutting some of its November flights because, “The Company continues to expect its third quarter 2020 capacity to decrease in the range of 30 to 35 percent, year-over-year.”Story continuesDelta Air Lines (DAL) was able to raise $9 billion this week after selling a record amount of debt. United Airlines (UAL) set the previous record last June when it sold $6.8 billion in bonds. Both airlines were able to use their lucrative frequent flyer miles programs as collateral.Southwest and Delta have said they will be able to avoid layoffs through the end of the year. United is furloughing roughly 16,000 employees and American Airlines (AAL) is planning to furlough 19,000 at the end of the month when deals they made with the U.S. Treasury Department under the Coronavirus Aid, Relief, and Economic Security (CARES) Act expire.U.S. airlines were provided close to $50 billion in loans and grants in return for guarantees they would not layoff employees through September 30. Those deals expire in two weeks and the industry is lobbying Congress for an extension and additional support.“This is the worst time in our history. Most airlines have capital for about four or five months. Not more than that,” Cerda said.Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.Airline stocks keep rising despite 'highly depressed' ticket sales amid pandemicSouthwest CEO: Bookings 'have recently stalled' because of coronavirus spikeDelta posts massive Q2 earnings loss'The corporate tax rate — I’m actually OK at 28%': Gary CohnJ&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}