{"article": [{"url": "https://finance.yahoo.com/news/terry-mc-auliffe-on-why-business-should-be-happy-that-joe-biden-is-coming-in-210216039.html", "published": 1597680620.0, "headline": "Terry McAuliffe on why ‘business should be happy that Joe Biden is coming in’", "body": "Terry McAuliffe has been a leader of the business-friendly wing of the Democratic party for decades, first as a close advisor to President Bill Clinton and then as governor of Virginia. He’s more comfortable in both worlds than most politicians all the way back to starting his first business (a driveway sealing service) when he was just 14 years old.Now he’s a top surrogate for Joe Biden and sat down virtually with Rick Newman for Yahoo Finance’s convention coverage as Democrats kick off their event this week.Terry McAuliffe (D-VA) was a close advisor to the Clintons and served at the Governor of Virginia. (Win McNamee/Getty Images)“This is a shared economy that we have” McAuliffe said Monday adding that “going forward, business should be happy that Joe Biden is coming in.”Here’s his case for why business leaders should embrace the Biden/Harris ticket.‘Infrastructure, infrastructure infrastructure’McAuliffe has been a Democratic insider for decades and helped to run presidential campaigns for both Bill and Hillary Clinton. He developed a close relationship with Biden ever since he was serving as Virginia’s governor and Biden was Vice President across the Potomac river.He says he has spoken with Biden many times in recent months and they’ve tended to center around one topic: “infrastructure, infrastructure infrastructure, we've got to rebuild America.”Former Virginia Governor Terry McAuliffe and Democratic presidential candidate Joe Biden appeared together in Virginia in 2019. (REUTERS/Aaron P. Bernstein)In recent years, “Infrastructure week” has been a running joke as the hope for a focus on serious issues like crumbling roads has inevitably been overwhelmed by a short-lived controversy that often emanates from President Trump’s Twitter account.Biden has proposed a $2 billion infrastructure plan focused on green energy and jobs to “build a modern, sustainable infrastructure now and deliver an equitable clean energy future.” Trump has intermittently focused on the issue, including a short-lived deal with Democrats last year to spend $2 billion. It quickly fell apart.But infrastructure has remained a more durable issue among state governments and in the business community. At the biggest meeting of the nation’s governors in February, infrastructure was much more likely to be discussed among governors than Trump’s unfolding impeachment trial.Story continuesA recent report estimated that America’s crumbling infrastructure could be responsible for a loss of almost $4 trillion in GDP and 2.5 million jobs by 2025 unless new investments are made.‘People are going to have to pay more taxes’McAuliffe wasn’t shy about what Biden’s plans would mean: higher taxes. “Yeah, people are going to have to pay more taxes,” he said, but added they “are fine with that as long as the government is very wise about spending and taking and protecting taxpayer dollars.”A recent analysis of Biden’s tax plans found that he would be “increasing taxes for the top 1% of earners by 13% to 18% of after-tax income, while indirectly increasing taxes for most other groups by 0.2% to 0.6%.”Biden would also raise the corporate tax rate to to 28%, toward the level it was during the Obama administration from the current rate of 21%.Gov. Terry McAuliffe during a visit to the White House in 2016. (Mark Wilson/Getty Images)While it might be bitter medicine, McAuliffe says that the national debt is a much worse problem for the business community in the coming years.The deficit is set to break records for the coming decade and the debt could hit $30 trillion by next year. McAuliffe says everyone should support measures to pay it down for economic stability.“I’m not going to pay it, but my five kids certainly are,” he says.Biden can ‘rebuild the American economy’The currently pandemic, even as tragic as it’s been, “is an opportunity for Joe Biden to come in and rebuild the American economy,” says McAuliffe.He says that the convention will show Americans and business leaders alike that Democrats have a real plan of how to build the post-COVID economy. “I think people are yearning for leadership,” he says.The former governor, who’s also run two national conventions during his career, pushed back on the idea that the virtual nature of the convention will blunt its impact. “I think you're going to get a lot more eyeballs” on the key speeches later in the week, McAuliffe says, as people look for answers from Biden and Kamala Harris.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Graphic by Yahoo FinanceRead more:Michigan’s governor on whether Biden has her state sewn up: ‘I don't buy it for a second’Joe Biden’s road to the Democratic presidential nominationSummers says stocks 'do better' during Democratic administrationsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}