{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-mask-mandate-doctor-says-141731162.html", "published": 1599297920.0, "headline": "Coronavirus keeps spreading across the U.S. ‘because there’s no mask mandate,’ doctor says", "body": "It’s been over six months since the coronavirus pandemic hit the U.S., and transmission continues across the country as communities open up and schools start class.Making things worse, according to one doctor, is because of the lack of a federal policy on masks.“It is going through the country because there's no mask mandate,” Dr. Andre Campbell, a trauma surgeon at the Zuckerberg San Francisco General Hospital, said on Yahoo Finance’s The Ticker (video above). “And there should be, in my opinion, a universal mask mandate, because data shows that we can save 70,000 lives if we mask everybody up right now. Because we're going to be, by the election and the end of the year, we're going to be north of 300,000 deaths, because about 1,000 people are dying a day from this terrible pandemic.”There are more 6 million confirmed coronavirus cases in the U.S. and over 184,000 deaths. Those numbers are expected to keep growing, at least until there is a COVID-19 vaccine widely available.Confirmed coronavirus cases. (David Foster/Yahoo Finance)Saving 70,000 livesA model from the Institute for Health Metrics and Evaluation (IHME) found that if 95% of people in the U.S. began wearing masks every time they were outside their homes, the number of projected deaths from coronavirus by December would drop 49%. That would save nearly 70,000 lives.Mask use could save 70,000 lives. (Chart: IHME)The lack of a federal mask mandate is one of the criticisms that the Trump administration has received regarding their response to the pandemic as the president largely left it up to the states to decide how to approach the virus. (President Trump has also opted out of wearing a face mask in most public settings.)“I'm a surgeon,” Campbell said. “I wear a mask all the time. And I don't like wearing a mask outside, but we have to do it now. And people are getting tired of it, and when they do, they let their guard down, and that's when people become infected.”Campbell reiterated that the primary issue “is you don't know if you can get a mild case or you're going to get a severe case or you're going to die, and you don't know that. It could be young people. It could be old people. They said first, older people over 65, but now, people are teenagers, younger kids, 20's, 30's, who get the infection and they actually die.”Story continuesPeople protest against mandates to wear masks amid the coronavirus disease (COVID-19) outbreak in Austin, Texas, U.S., June 28, 2020. REUTERS/Sergio Flores TPX IMAGES OF THE DAY‘The epidemic is changing’Last month, the World Health Organization (WHO) issued a warning about younger people becoming spreaders of the virus.“People in their 20s, 30s and 40s are increasingly driving the spread,” Takeshi Kasai, the WHO’s Western Pacific regional director, said. “The epidemic is changing.”Part of it has to do with college students returning to campus and not adhering to social distancing or face mask guidelines. There are reportedly more than 20,000 cases of coronavirus among college students and staff across the country. The University of Iowa alone has over 1,000 confirmed cases.A student walks to her dorm as her belongings are being brought in by professional movers in Medford, MA on Aug. 27, 2020. (Photo by David L. Ryan/The Boston Globe via Getty Images)“Now, what has happened is those outbreaks in Arizona and Texas and Iowa over the weekend were 79% of the tests that were done in Iowa, right, were positive,” Campbell said. “Now, when you have, when the virus is going crazy like it is in Iowa right now, right? That's what you got, and that's where we're not even testing enough people. It should be more people we should be testing.”According to Campbell, it comes down to three things that have become clear throughout this pandemic.“It's the masking, the social distancing, we're watching as that actually works,” he said. “And what has happened in the country is that at first there was an outbreak in New York and New Jersey and the Northeast and then on the West Coast and then everything got shut down, the numbers went down. But what happened was as the country started opening up, the things started happening and the virus started doing what it does. It spreads.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Coronavirus vaccine development 'is just like Diana Ross and The Supremes,' expert saysHarvard doctor: America 'needs to regroup' to fight coronavirusDoctor casts doubt on COVID plasma treatment: ‘No breakthrough here’Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}