{"article": [{"url": "https://finance.yahoo.com/news/docu-sign-ceo-shift-to-digital-accelerated-by-covid-19-pandemic-155148539.html", "published": 1591959560.0, "headline": "DocuSign CEO: Shift to digital accelerated by COVID-19 pandemic", "body": "The future of work won’t just be a daily regimen of Zoom calls and Slack messages from a new home office, it will very likely include a host of e-signatures on important papers.Bye-bye paper, hello more DocuSign (DOCU) links.“Yeah, we absolutely do,” DocuSign’s long-time CEO Dan Springer said on Yahoo Finance’s The First Trade on whether COVID-19 has permanently shifted how work is done. “I think we feel what happened is a lot of people accelerated the digital transformations they already had planned on the road map, particularly for enterprise customers.”DocuSign’s first quarter underscores Springer’s point.The company’s sales rose an impressive 39% from the prior year. Billings surged 59% from a year ago. Average contract value for customers that spend more than $300,000 annually with the company gained 46%. Average retention rate was an unworldly 119%, the highest ever for a single quarter for DocuSign.BRAZIL - 2019/07/11: In this photo illustration a DocuSign logo seen displayed on a smartphone. (Photo Illustration by Rafael Henrique/SOPA Images/LightRocket via Getty Images)DocuSign’s stock has been one of the hotter work-from-home plays this year, posting gains of 101%. The company’s stock has gone from being priced at $29 before its April 2018 IPO to more than $155 today as businesses ditch paper and transition to e-signatures. The company’s market cap of $27 billion is more than Slack (WORK) and DropBox (DBX) combined ($25 billion or so).Many on the Street are with Springer in believing the pandemic will only spur a wave of further business for DocuSign.“DocuSign is one of my favorite names,” Wedbush analyst Dan Ives tells Yahoo Finance. Ives rates DocuSign an Outperform with a $165 price target. Of the 15 sell-side analysts that cover the company, 60% rate DocuSign a Buy.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Coca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}