{"article": [{"url": "https://finance.yahoo.com/news/more-than-3-in-5-parents-say-remote-learning-would-negatively-impact-finances-040033566.html", "published": 1597273700.0, "headline": "More than 3 in 5 parents say remote learning would negatively impact finances: survey", "body": "According to a new Bankrate survey, more than 3 in 5 parents say that remote learning as a result of the coronavirus would negatively impact their finances. In addition, 42% believe remote learning would be detrimental to their children’s education.“This is clearly a top-of-mind issue for a lot of parents this summer and early fall,” Ted Rossman, an industry analyst at Bankrate.com tells Yahoo Finance. He also notes that the pandemic has created a Catch-22 scenario for many parents with school-age children.“I think a lot of districts are figuring this out as they go and may see changes along the way too. And that’s stressful for parents because what they really want is predictability. And it’s really hard to organize your work schedule if you don’t know what’s happening with your kid’s school.”According to Bankrate, 30% of parents surveyed said they would likely incur additional miscellaneous expenses, including for technology, tutoring, and meals. Twenty-three percent believe their career opportunities could be limited by balancing work and childcare; 22% would have to cut back on their work hours; 16% would have to pay for additional childcare; and 15% would have to stop working entirely.Northeastern parents are the most likely to say they’ll be negatively impacted (64%) versus 61% in the West and 59% in the Midwest and South.(Getty Images)Rossman reminds Yahoo Finance that school reopenings and virtual learning are a hyperlocal issue and should be looked at through that lens rather than nationally.One survey finding that surprised Rossman is that Republican parents (65%) are also more likely to foresee negative impacts versus Democrats (57%) and Independents (59%).However, that was not the only surprising find of this particular survey. Bankrate found that households with higher incomes ($80K+) see more negatives when it comes to online learning than positives. This is compared to middle-income households of $40K to $80K and lower-income households that made under $40K.Story continuesReggie Wade is a writer for Yahoo Finance. Follow him on Twitter at @ReggieWade.Read more:Nike responds to George Floyd attack: Don’t do it — ‘Don’t turn your back on racism’Nike sells out of Kobe Bryant kicks and merchandiseNike exec explains why the company broke up with AmazonAlmost half of teachers work a second job: survey96% of teachers personally pay for students’ supplies: SurveyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}