{"article": [{"url": "https://finance.yahoo.com/news/explainer-affected-trump-suspension-foreign-182639887.html", "published": 1592919260.0, "headline": "Explainer: Who is affected by Trump’s suspension of foreign work visas?", "body": "By Ted HessonWASHINGTON (Reuters) - President Donald Trump temporarily suspended the entry into the United States of certain foreign workers on Monday despite strong opposition from business groups, including major tech companies.The ban (https://www.reuters.com/article/us-usa-immigration-workers/trump-suspends-entry-of-certain-foreign-workers-despite-business-opposition-idUSKBN23T2ZW), which the White House said was necessary to make jobs available for Americans, will go into effect on Wednesday and last until the end of 2020.WHICH VISA CATEGORIES ARE BLOCKED?- H-1B visas for skilled workers, which are often used by the tech industry- L visas for executives, managers and specialized workers being transferred within a company- H-2B visas for seasonal workers, many of which are in the landscaping business- J visas for cultural exchange, including interns, trainees, teachers, camp counselors, au pairs and people participating in a summer work travel programThe proclamation also blocks family members who would accompany workers on such visas.DOES THE TEMPORARY BAN APPLY TO VALID VISA HOLDERS?Foreign workers already in the United States with a valid visa will not be affected. People outside the United States with valid visas and travel documents also will be exempt from the suspension, according to the proclamation.A spokesman for U.S. Citizenship and Immigration Services said the proclamation would not prevent a visa holder inside the United States from extending the visa duration or changing to a different type of visa.Whether people with these types of visas outside the United States will be able to renew visas and travel documents was not immediately clear.ARE THERE OTHER EXEMPTIONS?The proclamation excludes spouses and children of U.S. citizens.Foreigners working in the food supply industry will be exempted.The proclamation also exempts the entry of foreign workers whose admission is deemed to be \"in the national interest.\"Story continuesThe visa suspension narrows an exemption for medical workers made by Trump in April to include only people working on research into the novel coronavirus and those involved in health care for COVID-19 patients.HOW MANY PEOPLE WILL BE BLOCKED BY THE PROCLAMATION?The Washington-based Migration Policy Institute estimates that 167,000 workers and their dependents would be blocked between July 1 and Dec. 31, including 72,000 with J-1 visas and 29,000 with H-1B visas.WHICH COUNTRIES WILL BE MOST AFFECTED?The vast majority of H-1B visas - one of the more high-profile categories affected - go to people from India and China.Indians made up 72 percent of the approximately 388,000 H-1B visa petitions approved in fiscal year 2019, which began on Oct. 1, 2018, according to U.S. Citizenship and Immigration Services data. Chinese applicants were 13 percent of the total.WHICH WORK VISAS ARE NOT COVERED?The most notable exempted category of temporary work visas are H-2A visas for agricultural workers. The proclamation does not affect a number of smaller non-immigrant work visas categories, including O visas for people of \"extraordinary ability or achievement.\"(Reporting by Ted Hesson in Washington; Additional reporting by Mica Rosenberg in New York; editing by Ross Colvin and Grant McCool)"}]}