{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-2-2020-233620408.html", "published": 1599059480.0, "headline": "Stock market news live updates: Wall Street aims to defy September curse; Amazon, Google set new records", "body": "After beginning a traditionally grim month on strong footing, stocks advanced on Wednesday, with markets encouraged by some constructive U.S. economic data and moderating COVID-19 infections. Both the S&P 500 and Nasdaq sailed to fresh record closing levels.[Click here to read what’s moving markets heading into trading Thursday, September 3] Equities held a firm tone even after a closely watched report on monthly private payroll gains sharply missed expectations Wednesday morning. Tech stocks once again led the charge, with industry bellwethers like Amazon (AMZN) and Google (GOOG) all opening at new record highs — but Apple (AAPL) and Tesla (TSLA) pulled back sharply from their post-stock split highs.Meanwhile, Macy’s (M) temporarily alleviated fears with an encouraging earnings report, while AMC’s (AMC) news that it would be reopening more theaters this weekend sent the stock on a tear.Hopes of more support directly to individuals and businesses also helped buoy equities further. Treasury Secretary Steven Mnuchin said Tuesday during a congressional hearing of the Select Subcommittee on the Coronavirus Crisis that he believed a bipartisan agreement on further fiscal stimulus “still should be reached.”Historically, September tends to be a weak month for stocks. In fact, according to LPL Financial, it has been the worst-performing for markets, on average, since 1950. The S&P 500 (^GSPC) has dropped about 1% on average that month since 1950, LPL data shows.U.S. data continues to show resilience, with construction spending nearly flat in July, but with the prior month revised sharply higher. Meanwhile, the manufacturing sector continues to rebound, with the ISM Manufacturing Index hitting its highest levels since August 2018. New orders jumped during the month, but the employment component remained in recession territory — in line with still fragile labor market.“The August global manufacturing data is slightly uneven across countries, but by region the message is entirely consistent with continued recovery,” noted Alan Ruskin, Deutsche Bank’s chief international strategist, on Tuesday. He added that the sector “is adjusting to the new abnormal” as lockdowns began to ease earlier in the summer.Story continuesHowever, reports on the labor market have showed a more tepid recovery, with ADP reporting that private payroll gains in August totaled 428,000, or less than half the 1 million jobs expected to have come back during the month. Still, the report has recently consistently undershot the job gains reported by the Department of Labor in its own monthly jobs reports. Investors largely shrugged off ADP’s print in pre-market trading.Following the best month in decades for stocks, investors are now hopeful that a combination of support from the Federal Reserve, rising optimism for a COVID-19 vaccine that may backstop economic growth, and a new stimulus package will keep the rally going.According to Goldman Sachs, “while equities have never been as expensive since the Tech bubble, based on a 24-month [price/earnings basis], the equity risk premium is close to an all-time high, suggesting that equities have rarely been as attractive relative to bonds.”—4:02 p.m. ET: S&P 500, Nasdaq end at record levels for another session; Dow gains 450 pointsHere’s where the three major indices settled at the end of trading Wednesday:S&P 500 (^GSPC): 3,580.73, +54.08 points (+1.53%)Dow (^DJI): 29,099.38, +453.72 points (+1.58%)Nasdaq (^IXIC): 12,056.44, +116.78 points (+0.98%)—1:21 p.m. ET: Stocks hit session highs, Dow adds 300+ pointsThe three major indices extended gains in afternoon trading Wednesday, with the Dow adding more than 300 points, or 1%. Coca-Cola and IBM led gains in the 30-stock index.The utilities sector led advances in the S&P 500, followed closely by the internet tech giant-heavy communication services sector.—12:14 p.m. ET: Fed’s Mester says ‘strong employment is not a concern and monetary policy will not react to it,’ doubling down on new frameworkA strong labor market will not deter the Federal Reserve from keeping monetary policy accommodative, so long as major inflationary pressures or risks to financial stability remain off the table, said Cleveland Fed Bank President Loretta Mester on Wednesday.“The benefits of a strong labor market in fostering economic inclusion for all Americans are clear and we need to be humble about our abilities to assess maximum employment in real time,” Mester said in prepared remarks for The Nabe Foundation. “The new statement language clarifies that in the absence of inflationary pressures or risks to financial stability, strong employment is not a concern and monetary policy will not react to it.”Mester’s comments reaffirm the Fed’s updating thinking around its handling of inflation, with officials recently signaling they would allow inflation to rise “moderately” above their 2% target after years of undershooting this goalpost. In recent public remarks, multiple Fed officials suggested they had hiked interest rates too quickly following the Global Financial Crisis for fear of rising inflation as employment levels improved during the recovery.—10:00 a.m. ET: Factory orders rise 6.4% in July, topping expectationsNew orders for US manufactured goods rose for a third straight month in July, the Commerce Department said Wednesday, adding to a string of positive developments around the recovery in the manufacturing sector.Factory orders climbed 6.4% in July, versus a 6.1% gain expected, based on Bloomberg consensus data. This matched June’s month on month pace of advances.Excluding transportation orders, factory orders rose a more muted 2.1% in July, decelerating from June’s 4.8% gain. New orders for non-defense capital goods, excluding aircraft, rose about 2% in July after a 4.3% rise in June. This metric is watched closely as a proxy of future business investment plans.—9:31 a.m. ET: Stocks open higher despite disappointing private payrolls reportHere were the main moves in markets as of 9:30 a.m. ET:S&P 500 (^GSPC): 3,539.41, +12.76 points (+0.36%)Dow (^DJI): 28,756.55, +110.89 points (+0.39%)Nasdaq (^IXIC): 12,017.98, +78.32 points (+0.7%)Crude (CL=F): $42.80 per barrel, +$0.04 (+0.09%)Gold (GC=F): $1,964.00, -$14.90 (-0.75%)10-year Treasury (^TNX): 0.679%, +0.8 bps—8:30 a.m. ET: DraftKings shares soar after Michael Jordan takes equity stakeNewly public fantasy sports platform DraftKings (DKNG) saw its stock jump 13% in early trading Wednesday after announcing Michael Jordan joined as special advisor to the company’s board of directors.“The NBA Hall of Fame inductee, six-time NBA Finals MVP and Chairman of Hornets Sports & Entertainment has agreed to take an equity interest in DraftKings in exchange for providing guidance and strategic advice to the board of directors on key business initiatives undertaken by the sports technology and entertainment company that went public earlier this year,” DraftKings said in a statement.—8:15 a.m. ET: US economy adds 428,000 private payrolls in August, vs. 1 million expected: ADPThe US economy regained fewer than expected private jobs in August, according to ADP’s closely watched monthly payrolls report.Private payroll gains totaled 428,000 in August, falling below consensus economist estimates for 1 million, according to Bloomberg-compiled data. July’s private payroll gains, however, were upwardly revised to 212,000, from the 167,000 previously reported.The service-providing sector added back a net 389,000 payrolls in August, led by the leisure and hospitality industries with a gain of 129,000. Education and health services industries added 100,000 payrolls. Information jobs were the only ones to have lost payrolls on net, with this industry seeing 1,000 net job losses.The goods-producing sector added 40,000 payrolls during the month. Construction industries added 28,000 jobs, after losing payrolls in July.—7:17 a.m. ET Wednesday: Stock futures rise, setting stocks up for back-to-back sessions of gainsHere were the main moves in markets, as of 7:18 a.m. ET:S&P 500 futures (ES=F): 3,550.75, up 23.75 points or 0.67%Dow futures (YM=F): 28,823.00, up 201.00 points or 0.7%Nasdaq futures (NQ=F): 12,433.25, up 120.75 points, or 0.98%Crude (CL=F): $42.99 per barrel, +$0.23 (+0.54%)Gold (GC=F): $1,972.20, -$6.70 (-0.34%)10-year Treasury (^TNX): 0.685% (+1.4 bps)—7:30 p.m. ET Tuesday: Stock futures gain as September mood brightensHere were the main moves in equity markets, as of 7:30 p.m. ET:S&P 500 futures (ES=F): 3532.75, +5.75Dow futures (YM=F): 28674, +52Nasdaq futures (NQ=F): 12343.75, +31.75—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}