{"article": [{"url": "https://finance.yahoo.com/news/amazon-asks-employees-to-delete-tik-tok-amid-security-concerns-171228616.html", "published": 1594383620.0, "headline": "Amazon tells employees to delete TikTok, then says email was 'sent in error'", "body": "This story was updated at 5:25pm EST on July 10.Amazon on Friday morning sent an email to all employees demanding they remove the video app TikTok from their phones by the end of the day.Five hours later, Amazon told media the email was a mistake.Around noon EST on Friday, in an email obtained by Yahoo Finance, Amazon told U.S. employees to delete TikTok from all mobile devices connected to Amazon email by the end of the day, or lose access to their email. Amazon employees in Europe received the same email a few hours later.The email read: “Due to security risks, the TikTok app is no longer permitted on mobile devices that access Amazon email. If you have TikTok on your device, you must remove it by Jul-10 to retain mobile access to Amazon email. At this time, using TikTok from your Amazon laptop browser is allowed.”Amazon regularly tells its employees to comply with software updates by a certain date or risk losing access to work email. But giving them less than one day to comply is highly unusual, and suggests that Amazon security has serious concerns about TikTok.The story got stranger on Friday just before 5pm EST, when an Amazon spokesperson emailed out this statement: “This morning’s email to some of our employees was sent in error. There is no change to our policies right now with regard to TikTok.”The spokesperson would not explain further, or answer questions beyond the statement.Tiktok app logo can be seen, Kolkata, India, 30 June, 2020. India bans 59 Chinese mobile apps including Tiktok and WeChat amid border crisis erupted between India and China, this month according to an Indian media report. (Photo Illustration by Indranil Aditya/NurPhoto via Getty Images)TikTok is owned by ByteDance, which is based in Beijing. TikTok has a U.S. office in L.A., and hired former Disney executive Kevin Mayer as its new CEO in May. On Thursday, the Wall Street Journal reported that TikTok is considering corporate changes to further distance itself from China, including moving its global headquarters to the U.S. and creating an independent TikTok board separate from ByteDance.Tiktok has been downloaded close to 2.3 billion times globally, according to research firm Sensor Tower; 185.3 million of those downloads, about 8.2%, were in the U.S.Story continuesThe Trump administration has voiced its concerns about Chinese tech firms, most notably Huawei, and their aggressive gathering of user data. In January, an analysis of TikTok by Check Point Research found “multiple vulnerabilities that could have allowed attacks to manipulate content on user accounts and even extract confidential personal information saved on these accounts.”In response to Pompeo’s comments on Tuesday, TikTok said in a statement to Yahoo Finance, “TikTok is led by an American CEO, with 100s of employees and key leaders across safety, security, product, and public policy here in the U.S. We have no higher priority than promoting a safe and secure app experience for our users. We have never provided user data to the Chinese government, nor would we do so if asked.”And in response to the Amazon ban on Friday, TikTok sent this statement to Yahoo Finance: “User security is of the utmost importance to TikTok – we are fully committed to respecting the privacy of our users. While Amazon did not communicate to us before sending their email, and we still do not understand their concerns, we welcome a dialogue so we can address any issues they may have and enable their team to continue participating in our community. We're proud that tens of millions of Americans turn to TikTok for entertainment, inspiration, and connection, including many of the Amazon employees and contractors who have been on the frontlines of this pandemic.”—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is affecting the entertainment industry:Quibi cannot blame all its problems on the pandemicCoronavirus is forcing Quibi, NBC Peacock to change their plans at launchCoronavirus puts 'extreme pressure' on all three pillars of Disney's business'Trolls World Tour' rental success does not spell death for movie theatersBethenny Frankel predicts coronavirus will level the Hollywood playing fieldDisney+ streaming during coronavirus is boosting Hasbro’s Baby Yoda toy salesMovie theaters seek bailout as coronavirus devastates business"}]}