{"article": [{"url": "https://finance.yahoo.com/news/job-openings-levi-earnings-what-to-know-in-markets-tuesday-194341609.html", "published": 1594047080.0, "headline": "Job openings, Levi earnings: What to know in markets Tuesday", "body": "Tuesday morning, the U.S. Labor Department will release its latest monthly Job Openings and Labor Turnover (JOLTS) survey for May. Economists polled by Bloomberg expect that job openings fell again in May to 4.5 million.The number of U.S. job openings fell in April to 5.1 million, down from 6 million in March, according to the Labor Department’s monthly report. It was the second monthly decline in a row and the lowest level since December 2014.“The JOLTS report for April showed what you would expect: a collapse in openings and hiring and a surge in layoffs. While some industries like leisure & hospitality unsurprisingly saw large declines in openings, the pain was widespread, as not a single major industry had more job openings in April than there were in February,” Wells Fargo Securities economist Jay Bryson said in a note July 2.It wasn’t good, but it could’ve been worse, according to Bryson. “Openings ‘only’ declined to 2014 levels, and based off of the May employment report as well as other economic data, it seems likely that openings and hiring bottomed out in April. If additional data continue to come out in a way that signals April was the bottom in economic activity, this should cement the view that fears of an unemployment rate north of 20% were overblown. The question now shifts to how long of a road it will be back to February levels for job openings, unemployment and other labor market data. A good first sign would be a jump in openings in May for hard hit industries,” Bryson explained.The JOLTS report lags the BLS’s monthly jobs report by one month; however, the it captures data for the entire of the month. Meanwhile, the BLS nonfarm payrolls number measures data through the 12th of the month.SAN FRANCISCO, CALIFORNIA - FEBRUARY 13: The Levi's logo is displayed on Levi's 501 jeans on February 13, 2019 in San Francisco, California. (Photo Illustration by Justin Sullivan/Getty Images)On the earnings calendar for Tuesday, Levi’s (LEVI) is the only major company scheduled to release quarterly results. The denim brands is expected to report an adjusted loss per share of 48 cents on $519.29 million in revenue during its second quarter, according to analysts surveyed by Bloomberg.Story continuesShares of Levi’s have been getting hammered this year and have fallen more than 20% so far. The ETF tracking retail, XRT, fell 3% and the broader market (^GSPC) was down 1% in the same time period.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.43 million Americans file for unemployment benefitsWhite Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance news"}]}