{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-sees-steady-resurgence-as-fda-puts-nail-in-coffin-of-hydroxychloroquine-debate-184944215.html", "published": 1592229440.0, "headline": "Coronavirus update: US sees steady resurgence as FDA puts nail in coffin of hydroxychloroquine debate", "body": "The coronavirus extended its grip across the world on Monday, hitting Brazil particularly hard as both the U.S. and China grappled with a surge of new cases that called into question the recent wave of gradually easing restrictions.Separately, the Food and Drug Administration appeared to end a polarizing debate over hydroxychloroquine by yanking its emergency use designation. The drug was once touted as a potential “game changer” by President Donald Trump in the fight against COVID-19, but has since been linked to deadly side effects.Overall, the virus has now affected nearly 8 million globally, with more than 433,000 reported dead. In the U.S., more than 2 million cases have been reported and more than 115,000 have died amid a case spike in over half a dozen states showing worrying multi-day trends of increases.In China, where the virus first appeared, Beijing reported a modest rise in cases tied to a food market, prompting the government to adopt a “wartime” posture. Meanwhile, Brazil has become an avatar of a Latin American region that’s rapidly emerged as a global hotspot.Though many public health officials maintain the surges in the U.S. are part of the first wave of the virus, stocks and oil slid Monday on fears a second wave could hit sooner than the expected fall/winter timelines.Public officials have noted concerns over states like Texas, Florida, Arizona and California — which has some of the most restrictive orders on the books yet has still seen COVID-19 diagnoses spike recently. The Golden State has now seen 5,000 deaths and nearly 150,000 cases, according to state data.There are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)FDA yanks emergency use for anti-malarial drugOn Monday, the FDA revoked the emergency use authorization (EUA) of hydroxychloroquine, a highly controversial treatment which was touted by Trump as a potential coronavirus treatment— but questioned by his own coronavirus task force and other public health officials.In a letter to Monday, the FDA said it no longer considers hydroxychloroquine and chloroquine safe for use to treat COVID-19. In a recent interview with Yahoo Finance, one former FDA official said the initial EUA “was unnecessary...(and) probably politically motivated.”Story continuesThe FDA said “it is no longer reasonable to believe that oral formulations of (hydroxychloroquine) and (chloroquine) may be effective in treating COVID-19, nor is it reasonable to believe that the known and potential benefits of these products outweigh their known and potential risks,” in a letter to the Biomedical Advanced Research and Development Authority (BARDA), a branch of the U.S. Health and Human Services Department (HHS).A bottle and pills of Hydroxychloroquine sit on a counter at Rock Canyon Pharmacy in Provo, Utah, on May 20, 2020. - US President Donald Trump announced May 18 he has been taking hydroxychloroquine for almost two weeks as a preventative measure against COVID-19. (Photo by GEORGE FREY / AFP) (Photo by GEORGE FREY/AFP via Getty Images)While the revocation is not unprecedented, the controversy surrounding the drugs and political undertones have made it a focus during the pandemic. The surge in demand created by the rise in publicity also led to shortages for patients most in need of the drug. The anti-malarial drug is commonly used off-label by rheumatoid arthritis and lupus patients.Prior to revoking the EUA, the FDA had already sent warnings to health care professionals about the risks and use of hydroxychloroquine.The drug has played a significant role in disputes in the federal government. It was perceived as the alleged reason behind the ouster of whistleblower and former BARDA director Rick Bright, and sparked internal disagreements among White House officials and NIAID director Dr. Anthony Fauci, whom has cautioned against the use of it.The drug has had a brief but unusually turbulent time in the public eye. Trump continuously touted it, and recently revealed he has been taking it himself as a preventative measure.Meanwhile, a study in The Lancet touting the drug’s effectiveness was recently retracted after the underlying data came into question. Previously, a study in the New England Journal of Medicine concluded it was ineffective and carried a risk of death.Companies like Novartis (NVS) and Bayer (BAYRY) had donated millions of doses of both drugs to the federal stockpile earlier this year. Neither immediately returned requests for comment from Yahoo Finance Monday.The COVID-19 treatment space at-large has been seeing progress with some potential candidates— from small and large players alike.Treatments have largely focused on reducing hospital time and reducing the body’s potential to attack itself — called a cytokine storm— which has been a trend among those who have died. In addition, some are looking to reduce acute respiratory distress syndrome (ARDS).Among these, smaller biotechs are also in the race. To-date, companies like Gilead (GILD) Eli Lilly (LLY), Regeneron (REGN) and Roche (RHHBY) have all announced potential treatment candidates, with Gilead’s the furthest along in trials.But the smaller biotechs are also pushing ahead, and partnerships are emerging at an unprecedented volume, according to BIO president and CEO Michelle McMurry-Heath.“What we’ve seen with COVID is an amazing unified response,” she told Yahoo Finance in a recent interview.Some of those small biotech names include Athersys, CytoDyn and Immunic, all of which are in various trial stages of producing treatment regimens.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}