{"article": [{"url": "https://finance.yahoo.com/news/trump-is-sabotaging-his-own-reelection-bid-143849530.html", "published": 1592905580.0, "headline": "Trump is sabotaging his own reelection", "body": "President Trump prefers to think the economy is recovering like a rocket ship. In reality, his passive approach to the coronavirus outbreak and his aversion to a muscular testing program are prolonging a huge spending contraction and imperiling his own reelection.At his Tulsa rally on June 20, Trump said he has ordered federal officials to slow down coronavirus testing, because it increases the case count and makes the spread of the virus seem more pronounced. The White House later said that’s not true, yet Trump has repeatedly declined to establish a national testing program, as many top health experts have called for. Instead, he has deferred to state and local officials on testing, while calling on states to relax coronavirus restrictions and allow businesses to quickly reopen.The problem with reopening is that while lockdowns are easing, customers aren’t returning. New research led by Harvard economist Raj Chetty finds that business reopenings aren’t enough to lure shoppers worried about the virus. In states that reopened early, such as Minnesota, spending hasn’t picked up more robustly than in states that stayed closed longer, like neighboring Wisconsin. And spending fell the most before lockdown orders went into effect, suggesting consumers were locking themselves down because of health concerns, a trend that seems to be continuing even as restrictions ease.“If health concerns are the core driver of reductions in spending rather than government-imposed restrictions, governments may have limited capacity to restore economic activity through reopenings,” the Harvard study finds. “Especially if those reopenings are not interpreted by consumers as a clear signal of reduced health risks.”Lisa Wiley, of Walmart, sets up for the opening at a new drive-up self-administered COVID-19 testing site run by Quest Diagnostics at the Walmart store in Boynton Beach, Fla,, Tuesday, June 16, 2020. (Joe Cavaretta/South Florida Sun-Sentinel via AP)The coronavirus pandemic is not abating, even though virtually all states that imposed lockdowns are in the process of lifting them. The latest tracking data shows caseloads rising in 26 states, flatlining in 16 states and declining in just 8 states. Health concerns relating to the virus have ticked down since peaking in April, but still, nearly two-thirds of Americans are concerned they or someone they know will become infected.Story continuesWithout a vaccine, robust testing is perhaps the best way to rebuild confidence and make people comfortable going out again. Testing doesn’t eliminate the virus, obviously. But it identifies those who have it and can pass it to others, so they can self-quarantine until they’re not contagious any more. Some health experts say routine testing is essential for businesses bringing workers back to the job, since it’s the best way to identify virus spreaders and protect everybody else.Getting back to normalTrump seems to think that if people don’t hear negative news about rising infection rates, they’ll return to normal work and shopping patterns by default. But word gets out when workers get sick, as happened earlier this year at several meat-packing plants. Producers such as Tyson Foods have since instituted widespread coronavirus testing, which has helped identify hundreds of asymptomatic virus carriers who would have spread it to many others had they not been tested. More robust testing of workers at restaurants and retail outlets can likewise build confidence about the safety of those establishments and lower the risk of going there.The United States is now conducting about 500,000 coronavirus tests per day, a sharp improvement over testing rates in April and May. But fully reopening the economy without a resurgence of the virus could require 20 million to 25 million tests per day, according to experts at Harvard’s Safra Center and Nobel-winning economist Paul Romer. The House of Representatives has passed a bill containing $75 billion for widespread testing. But the Republican-controlled Senate is highly unlikely to pass that bill and Trump has shown no enthusiasm for it.There are over 2.3 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Trump may think the economy is bouncing back just fine without any federal boost on testing. Retail sales soared in May, rising by a record 17.7%. But that came after two months of nauseating declines, and sales are still well below pre-virus levels. A tracking tool developed by Chetty’s team at Harvard finds that total monthly spending is still 11% lower than it was in January. Hard-hit sectors fare much worse, with sales down 55% in entertainment and recreation, 54% in transportation and 38% in hospitality. No incumbent president has been reelected during a recession in the last 80 years, and Trump’s reelection hinges on a sustained recovery across the economy, not just sporadic improvements.The Harvard research also shows that the wealthy have cut their spending by more than those who earn less, accounting for the biggest decline in economic activity. “Higher-income households spend less time outside,” the study finds. “High-income people apparently self-isolate more, perhaps by working remotely or because they have larger living spaces.” To bring that spending back, Trump can’t just pretend the virus is gone. He needs to persuade people able to decide for themselves that they’re safe going out, especially in the service economy, where workers and customers interact. And do it soon, if he wants it to register by November.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Election Night in November could last for daysBiden’s age might work in his favorSome nightmare scenarios for the November electionsThe risk to Biden if he picks a black running mateHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}