{"article": [{"url": "https://finance.yahoo.com/news/amazon-jeff-bezos-hearing-congress-house-judiciary-committee-110805943.html", "published": 1596003380.0, "headline": "Amazon CEO Jeff Bezos will 'try to win over hearts and minds’: What to expect at the antitrust tech hearing", "body": "Today marks a significant milestone for Jeff Bezos: it’s the first time he’s testifying before Congress.The chief executive of Amazon (AMZN), alongside his counterparts at Alphabet (GOOG), Apple (AAPL) and Facebook (FB), faces the House Judiciary Subcommittee on Antitrust, Commercial and Administrative Law for a hotly anticipated hearing on antitrust concerns facing each of the big four. His traditionally tight-lipped nature coupled with Amazon’s particularly expansive and multi-dimensional business model have put a bright spotlight on Bezos’ performance.Bezos released a written statement Tuesday evening, outlining the purpose of Amazon, which he founded 26 years ago — to make it “Earth’s most customer-centric company” and rattling off the many ways the company has elevated small- and medium-sized businesses. It’s a sentiment that’s frequently echoed in his annual letters to shareholders. It can also be argued that this self-proclaimed “obsessive customer focus” has been at the expense of Amazon’s work culture — both white and blue collar employees.And as Bezos points out, while “third-party sales now account for approximately 60% of physical product sales on Amazon,” being both a platform and a player immediately creates an uneven playing field — in terms of selection, speed and pricing. And in order to garner prominent placement, these third-party sellers are incentivized to pay for advertisements and sponsored spots on the platform.Beyond the retail business, a New York Times investigation found that Amazon’s cloud computing service (AWS) had been used to copy open-source software from smaller firms and the company masqueraded it as its own.Jan 24, 2020 Sunnyvale / CA / USA - Amazon headquarters located in Silicon Valley, San Francisco bay areaFrances Frei, a professor of technology and operations management at Harvard Business School, lays out the two key challenges that Bezos faces.“He essentially has to communicate and convince us that the benefits outweigh the harm...one as a retailer — does he have safe work conditions and fair wages..[and] is he taking unfair advantage of his platform? Is Amazon disproportionately benefiting from the platform? And those are varsity sports to be able to convince people on that,” Frei said in a Tuesday interview on Yahoo Finance’s On the Move.Story continuesStill, even taking into account the inevitable tense grilling, the investor community overwhelmingly believes there will be very little material impact, given how influential the mega-cap tech names have been for the U.S. economy and stock market. As Charles Schwab chief investment strategist Liz Ann Sonders points out, the top five stocks by market cap (Apple, Microsoft, Amazon, Google and Facebook), now make up nearly 23% of the S&P 500. “That means 1% of the stocks—measured in simple, equally-weighted terms—now practically make up their own quartile in market cap terms. That is significantly higher than the prior 2000 peak of about 18%,” she wrote in a recent note to clients.Amazon’s meteoric rise has made Bezos the richest man in the world in recent years, also likely fueling the ire and criticism of lawmakers.“We've had the social media platforms really in the limelight because of the issues regarding the degree with which they have editorial control and responsibility and liability, all of that stuff...But I think it’s going to be a lot of theater. I think there’s a lot of things that really do need to be worked out, we’ve got a legal framework that’s pre-internet age, it was kind of applied as best it could, but it really needs to be overhauled for the internet age, but I don't think you’re going to see that,” said CFRA vice president of research John Freeman in an interview with Yahoo Finance’s The Final Round Monday. “I don’t think you’re going to see any of the solutions or anything like that...Even if anything gets resolved or any legislation gets talked about, it’s going to have to wait until after the election. Whatever gets written will have to get rewritten.”‘Try to win over hearts and minds’Bezos’ tone and delivery will likely be scrutinized just as much if not more than the content of his answers.“I definitely think that you can have something good to say and communicate it badly. So, you want to have something good to say and communicate it well...We are losing trust and their ability to persuade us...I think a lot of people are going to use tomorrow as a learning and a lot of people make up their minds and this is super high stakes,” said Frei, who previously served as Uber’s senior vice president of leadership and strategy. “The rules of the game could change and that wasn't true a year ago or two years ago or three years ago. Jeff Bezos is a brilliant communicator in the written word. So, can he translate that to here? I expect him to be quite smart and quite humble and try to win over hearts and minds.”Meanwhile, it would likely be in the best interest of all parties if lawmakers learned from the cringe-worthy moments during Mark Zuckerberg’s 2018 Senate grilling after the Cambridge Analytica scandal. Rather than showing a united, astute effort, lawmakers peppered a potpourri of random questions at Zuckerberg, and perhaps the biggest takeaway was just how little Senators understand Facebook’s business model.“I think lawmakers would do well to ask simple questions because the most fundamental questions are the ones whose answers are most interesting. When they get into that high varsity gotcha, they get it wrong and it doesn't create a good dynamic. I would keep it super simple like, ‘Is our data safe?’ ‘Is democracy better off or worse off?’ My advice to lawmakers is keep it very simple,” added Frei.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:WNBA Commissioner: 'There is nothing political about Black Lives Matter'The US saw the highest rate of new women CEOs so far this yearDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperity"}]}