{"article": [{"url": "https://finance.yahoo.com/news/did-credit-score-just-drop-160000639.html", "published": 1601809700.0, "headline": "Did your credit score just drop? Blame it on COVID-19", "body": "Did your credit score just drop? Blame it on COVID-19The shaky COVID-19 economy has forced people to be much more cautious when it comes to debt. The same goes for lenders.Credit card companies have been looking to reduce their risk by lowering the amount of money they make available to borrowers, just in case unemployed people start defaulting en masse amid the pandemic.Some issuers will notify you before they decrease your limit — but they don’t have to do that. Your credit limit could plummet without you even knowing it, and so could your credit score.If you haven’t checked your score in a while, it’s time to figure out whether you’re an unwitting victim, and take steps to fix that.Why would a lower limit hurt my credit score?Bacho / ShutterstockA lower limit might force you to be more conservative with your debt, but it can also sap your power to borrow money for things you need, like a home or car.One of the biggest factors that makes up your credit score is your credit utilization ratio. This measurement of credit used versus credit available is responsible for 30% of your FICO score (the most popular scoring method).Credit bureaus like people who borrow less than they’re able. For a good score, your credit card balance shouldn’t exceed 30% of your spending limit. Using 10% percent or lower is even better.But when your credit limit drops, the amount you’re currently borrowing suddenly becomes a much higher percentage of your available credit. Your utilization ratio spikes, which then hurts your credit score.If you’re concerned about this happening to you, consider signing up for a free credit monitoring service that will tell you when your score drops for any reason, like a mistake on your credit report.What can I do if my credit limit gets slashed?fizkes / ShutterstockAsk for it to be restored. The first step is to simply ask your credit card company to reverse the change. Call the number on your card and ask why your limit was cut. It wouldn’t hurt to remind them how long you’ve been a customer. If you’ve always paid your bills on time, you should leverage that, too. And saying “please” still goes a long way.Story continuesUse a balance transfer card. If you already have more than one credit card, you might be able to shift your balances between accounts to bring down your credit utilization rate. If you only have one card, now would be the time to seek out a second one. Look for a better limit and a promotional 0% interest period that will help you pay off your debt fast. Keep in mind that opening new cards leads to credit checks, and too many checks can harm your score, as well.Automate your bill payments. Another way to salvage your utilization ratio is to automate your payments with the help of a snarky budgeting app. That way you can ensure you never stray past the 30% mark and also save yourself from any accidental late fees. Consider paying your balance down bi-weekly, rather than once a month.Consolidate your debt. If you’re juggling multiple credit cards and struggling to overcome their high interest rates, you should look into a debt consolidation loan. By taking out one low-interest loan, you can pay off all of your credit cards and only have one bill to worry about each month. Make sure you use an online comparison tool to find the lender that will offer you the best deal.As you can see, you have plenty of options if COVID-19 took a bite out of your credit. You may not be able to stop your limit from falling, but you can always fight your way back to a good score."}]}