{"article": [{"url": "https://finance.yahoo.com/news/heres-every-pro-sports-leagues-current-plan-to-return-from-coronavirus-lockdown-180011546.html", "published": 1592226500.0, "headline": "Here's every sports league's current plan to return from coronavirus lockdown", "body": "Three months after the NBA, NHL, and MLS suspended their in-progress seasons due to coronavirus, none of those leagues have yet returned and the MLB season never started. But sports are slowly starting to come back: UFC, Nascar, boxing, and PGA Tour have all started up again.The rest of the big team sports all have their own plans for returning—barring a sudden nationwide spike in COVID-19 cases.Here’s every U.S. pro league’s current return planNational Women’s Soccer League (target return date: June 27)Samantha Mewis #5 of the North Carolina Courage celebrates scoring with teammates during a game between Chicago Red Stars and North Carolina Courage at Sahlen's Stadium at WakeMed Soccer Park on October 27, 2019 in Cary, North Carolina. (Photo by Andy Mead/ISI Photos/Getty Images).The NWSL season usually starts in mid-April, so its 2020 season never began.Despite media reports that declared MLS will be the first pro league to return from lockdown, in fact the NWSL will return first, with a one-month, 25-game tournament called the 2020 NWSL Challenge Cup, starting on June 27 in Utah. NWSL players are set to get 100% of their usual salaries.All nine NWSL teams will play four games each to determine seeding, leading into an eight-team knockout tournament.NWSL players from all nine teams will stay in Salt Lake City hotels; the games will happen at Zions Bank Stadium, with the semifinals and finals at Rio Tinto Stadium, all with no fans present. CBS will stream the games on its CBS All Access app.Major League Soccer (July 8)SEATTLE, WA - MARCH 01: Chicago Fire Robert Beric (27) and Zavier Arreaga (3) go up for a header during a MLS match between the Chicago Fire and the Seattle Sounders at Century Link Field in Seattle, WA. (Photo by Jeff Halstead/Icon Sportswire via Getty Images)MLS was only two weeks into its season when it shut down on March 12; each team had played just two games. And this was the league’s 25th season, originally meant to be a special celebration year. Two new expansion franchises started this year, in Miami and Nashville.Instead, MLS will pick back up on July 8 at the ESPN Wide World of Sports complex at Walt Disney World in Orlando, Fla., for a 26-day, 54-game tournament – called the MLS is Back Tournament – with no fans in the stands.MLS aims to then continue its regular season continues in home markets after the tournament. The results of the tournament at Disney World will count toward regular season points, and the tournament winner will earn a spot in the 2021 CONCACAF Champions Cup.Story continuesPlaying any tournament with no fans present is particularly damaging for MLS, which is heavily reliant on revenue from game days (ticket sales, concessions), compared to the NFL, which gets the bulk of its revenue from television rights.Major League Baseball (July 23)Major League Baseball Commissioner Robert D. Manfred Jr. announces the 28th pick of the 2020 MLB Draft is Austin Wells by the New York Yankees during the 2020 Major League Baseball Draft at MLB Network on June 10, 2020 in New Jersey. (Photo by Alex Trautwig/MLB Photos via Getty Images)For weeks after the other leagues had concrete return plans agreed upon by their players, MLB stood alone without a finalized return plan, and its 2020 season in doubt. Now, after weeks of contract disputes, MLB plans to return to play before the NBA and NHL.The issue was player compensation; multiple proposals from the team owners were rejected by the MLB Players Association. As the situation dragged on, any possible 2020 MLB season looked shorter and shorter.The key issue: MLB players want 100% of their prorated salaries, regardless of how many games get played; club owners, citing their expected revenue losses from holding games with no fans, repeatedly proposed scenarios in which players get less than the full prorated amounts. And the timing is unlucky because the MLB and MLBPA are set to negotiate a new collective bargaining agreement for 2021; players are hesitant to agree to anything for 2020 that might set a precedent for the next CBA.An offer from the league on June 12, for a 72-game season where players would get 70% of their prorated salaries, was rejected by the players. MLBPA executive director Tony Clark responded in a statement: \"It unfortunately appears that further dialogue with the league would be futile. It's time to get back to work. Tell us when and where.”On June 15, MLB Commissioner Rob Manfred told ESPN he was “not confident” there will be a season.Finally, on June 23, MLB implemented its right to force a 60-game season, based on a March 26 agreement with the MLB Players Association. The league does not need the MLBPA’s approval; the MLBPA already consented to this last resort option on March 26. Players will earn their full pro-rated salaries, and it will end up being 37% of what they’d make in a typical full season.MLB players returned to their home cities on July 1 and began spring training 2.0. The 60-game schedule will start on July 23, COVID-19 allowing.Women’s National Basketball Association (July 25)WASHINGTON, DC - OCTOBER 10: Elena Delle Donne #11 of the Washington Mystics handles the ball against Alyssa Thomas #25 of the Connecticut Sun in Game 5 of the 2019 WNBA Finals at St Elizabeths East Entertainment & Sports Arena on October 10, 2019 in Washington, DC. (Photo by G Fiume/Getty Images)The WNBA season was supposed to begin on May 15, and normally runs until October. In April, the league held its virtual draft, and the New York Liberty took University of Oregon star Sabrina Ionescu with the first pick, which could bring new eyeballs to that team and the sport.Now the league and the players’ union have agreed to play a 22-game season, starting on July 25, at IMG Academy in Bradenton, Fla., which has four available courts. An original proposal from the league had the players getting just 60% of their usual salaries, but after players pushed back, they will now be receiving 100% of their salaries.The WNBA plan is not at all set in stone—players still need to vote to approve the latest proposal.Premier Lacrosse League (July 25)Whipsnakes LC defense Tim Muller (36) and Redwoods LC attack Jules Heningburg (7) in action during the Premier Lacrosse League Championship game between Redwoods LC and Whipsnakes LC on September 21, 2019, at Talen Energy Stadium in Chester, PA. (Photo by M. Anthony Nesmith/Icon Sportswire via Getty ImagesThe PLL just wrapped up its inaugural season in September, and its 2020 season would have started in June. But on May 6, the upstart lacrosse league became the first league to announce a detailed plan to return to play after lockdown.From July 25 through Aug. 9, the PLL will stage a 16-day, 20-game, fully quarantined tournament with no fans; all games will take place in Zions Bank Stadium in Utah, the same site where the NWSL will play one month earlier. The PLL has said that the entire tournament will require fewer than 300 people.The games will air on the various platforms of NBC Sports, which is the exclusive broadcaster of the PLL.National Basketball Association (July 30)Zion Williamson #1 of the New Orleans Pelicans dunks the ball over JaVale McGee #7 of the Los Angeles Lakers during the second half at the Smoothie King Center on March 01, 2020 in New Orleans, Louisiana. (Photo by Jonathan Bachman/Getty Images)The NBA plans to bring 22 of its 30 teams to the ESPN Wide World of Sports complex at Walt Disney World in Orlando, Fla., to finish its season and its postseason with no fans present. Each team will play eight games to finish the regular season and determine the playoff seeding. The NBA is targeting a July 30 start date, according to ESPN.Under the current schedule, the season would end Oct. 12. That could push the start of the 2021 NBA season until December. And there are still potential hurdles to the plan, including a vocal group of players, led by Kyrie Irving and including Dwight Howard, who reportedly take issue with the Disney World plan and believe the NBA’s return would be a “distraction” from the larger nationwide conversation happening right now about social justice reform.National Hockey League (August 1)Connor McDavid #97 of the Edmonton Oilers battles against Tucker Poolman #3 of the Winnipeg Jets at Rogers Place on March 11, 2020, in Edmonton, Canada. (Photo by Codie McLachlan/Getty Images)The NHL was deep into its 2019-2020 season when it paused play in March; each team had played between 68 and 71 games of the usual 82 games.At the end of May, the league announced its plan to go right to the postseason when it returns: 24 of the 31 teams will start the playoffs in one of two hub cities; the final hub cities have yet to be named, but both are expected to be in Canada.The NHL is currently in Phase 2 of its plan, which allows teams to practice in small groups. On July 6, the NHL and NHLPA announced a tentative agreement on the return-to-play plan, with target dates of July 13 for training camps (Phase 3), July 26 for when teams will head to the two hub cities, and August 1 for the start of qualifying round games (Phase 4).Teams will be limited to bringing 50 personnel to the hub cities. The top four teams (Boston, Tampa Bay, Washington, and Philadelphia in the East; St. Louis, Colorado, Vegas, and Dallas in the West) will begin with a round robin tournament to determine seeding. NHL Commissioner Gary Bettman said he thinks the league can get through the first two rounds of the playoffs in one month.Football (college and pro) still hopes to start on timeNEW ORLEANS, LOUISIANA - JANUARY 13: Grant Delpit #7 of the LSU Tigers raises the National Championship Trophy with Joe Burrow #9, left, Rashard Lawrence #90, and Patrick Queen #8 after the College Football Playoff National Championship game at the Mercedes Benz Superdome on January 13, 2020 in New Orleans, Louisiana. The LSU Tigers topped the Clemson Tigers, 42-25. (Photo by Alika Jenner/Getty Images)NCAA football and the NFL were not yet delayed by coronavirus. Both plan to begin their seasons at the usual time, despite reports of a number of college football players and NFL players have tested positive for COVID-19. The positive tests should not hypothetically derail the leagues, which have said they will simply quarantine anyone who tests positive for 14 days.In college football, the Power 5 conferences (ACC, SEC, Big Ten, Big 12, and PAC-12) appear likely to shift to a conference-only schedule so that schools would play other schools in their geographic area.The biggest issue now for college football is fans in the stands—whether to allow them, when, and how many to allow. Since social distancing guidelines will vary state by state, some schools could have some fans at games right at the outset, while others will likely have to start with empty stadiums. But since the bulk of football revenue for most schools comes from ticket sales, one sports media executive tells Yahoo Finance, “Even at 50% attendance, it’s an economic disaster” for most big Division I schools.The NFL may also have to start its season without fans, or with reduced fans, but that league gets the bulk of its revenue from broadcast rights, so it can withstand the financial hit of fan-less games much better than leagues like MLS, MLB, and the NHL.These sports have already returnedHOMESTEAD, FLORIDA - JUNE 14: Denny Hamlin, driver of the #11 Toyota, celebrates in Victory Lane after winning the NASCAR Cup Series Dixie Vodka 400 at Homestead-Miami Speedway on June 14, 2020 in Homestead, Florida. (Photo by Chris Graythen/Getty Images)NASCAR, mixed martial arts, boxing, and golf—all individual sports that can more easily adjust to social distancing rules—have all returned to play with no fans present.After more than two months without live sports in the U.S. (apart from horse-racing), the UFC was the first to return, with UFC 249 in Florida on May 9.NASCAR’s Cup Series returned on May 17 at Darlington Raceway in South Carolina, after hitting pause in mid-March, and has since held eight races. The first seven all had no fans at the tracks; NASCAR allowed 1,000 fans (mostly members of the military and their families) on June 14 at Homestead-Miami Speedway, and will allow 5,000 fans at Talladega on June 21.Pro boxing returned on June 9 in Las Vegas with two nights of fights without fans in the arena.On June 11, the PGA Tour returned for socially-distanced golf, beginning with the 2020 Charles Schwab Challenge at Colonial Country Club in Texas. It was a dramatic return: 27-year-old Daniel Berger and 23-year-old Collin Morikawa faced off in a playoff that Berger narrowly won.(This post will be updated as new information comes out; the last update was at 7:40pm EST on July 10.)—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is hitting the sports world:College football will return, but a huge financial question remains: fans in the standsNHL Commissioner Gary Bettman: Money 'is not what's driving' return planNHL return plan could set the model for other sports leagues to followKevin Durant’s agent doesn’t expect fans at NBA games for at least a yearCoronavirus could have long-lasting impact on live sports ticket salesMLS Commissioner: Playing in empty stadiums would be particularly bad for usKorean baseball's return is a bitter pill for American sports, but a win for ESPNCoronavirus hits sports leagues: March Madness canceled; NBA, NHL, MLS seasons on hold"}]}