{"article": [{"url": "https://finance.yahoo.com/news/kraft-heinz-ceo-warren-buffetts-top-two-lieutenants-on-our-board-liked-our-32-billion-deal-153151409.html", "published": 1600252760.0, "headline": "Kraft Heinz CEO: Warren Buffett's top two lieutenants on our board liked our $3.2 billion deal", "body": "One of Kraft Heinz CEO Miguel Patricio’s first big moves since taking the top job in July 2019 got the blessing of two of the food giant’s arguably most important board members.At the company’s long-awaited investor day Tuesday, Patricio revealed Kraft would sell part of its cheese business for $3.2 billion to France’s Groupe Lactalis. The sale — reflecting Patricio’s efforts to refocus investments on stronger brands, cut costs and reduce debt — will hand Kraft shredded cheese, blocks of cheese, Breakstone’s cottage cheese and the Cracker Barrel brand over to Groupe Lactalis.Patricio told Yahoo Finance’s The First Trade that Berkshire Hathaway’s Greg Abel and Tim Kenesey — whose job is it to protect Warren Buffett’s 26% investment in the cheese maker from coming under anymore pressure — backed the deal.“Look Berkshire Hathaway has two board members in Greg Abel and Tim Kenesey who are very active board members and very important. They provoke me, they inspire me. They give me their advice, which is what you would expect from great board members. So the relationship has been great during this close to 12 months that I've been leading the company. They gave their support behind this transaction. And they've been supporting me from the beginning.”Not bad to have that type of support. Kraft Heinz shares rose 2% on Tuesday in response to the deal.Packages of Kraft parmesan cheese are displayed on a grocery store shelf. (Photo by Justin Sullivan/Getty Images)The former Anheuser-Busch marketing wizard officially took over as Kraft Heinz CEO last year on July 4. Without question, Patricio assumed a house on fire.The company for years slashed investments in key brands in order to meet aggressive operating profit targets by backer 3G Capital. Top talent left the company. Buffett himself expressed displeasure in his investment — the stock has been down about 60% since Kraft merged with Heinz back in July 2015 (Buffett played a hand in the merger).One of the final black eyes came in February 2019, when Kraft Heinz took a $15.4 billion write-down on its natural cheese, Oscar Mayer cold cuts and Canadian retail businesses.Story continuesBut Patricio has started to get some wins under his belt after an extensive deep review of the business. Besides the new cheese business sale, Patricio outlined a much more streamlined business at investor day on Tuesday. He promised to boost marketing by 30% in top brands while also cutting $2 billion in costs through 2024.The investor day should go a long way in starting to restore confidence in Kraft Heinz’s future.Meantime, the company’s top and bottom lines have gotten tailwinds in the form of consumers eating more at home during the COVID-19 pandemic.Kraft Heinz said third quarter organic sales are expected to increase by a mid-single digit percentage, not too far removed from a 7.4% gain in the second quarter. Adjusted earnings before interest, taxes and depreciation are expected to improve by a high-single digit percentage in the third quarter.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}