{"article": [{"url": "https://finance.yahoo.com/news/biggest-election-loser-americas-national-debt-140313282.html", "published": 1602065480.0, "headline": "Biggest election loser: America’s national debt", "body": "If fiscal probity is your top election issue, there’s no candidate for you this year, according to a new report by deficit hawks in Washington.The Center for a Responsible Federal Budget estimates that Republican Donald Trump and Democrat Joe Biden would each send the federal debt spiraling higher during the next several years. If Trump wins and enacts his agenda, it would push the national debt $5 trillion higher by 2030. Biden’s plan, if fully enacted, would push the deficit up by $5.6 trillion. The national debt held by the public is already equal to 98% of GDP. It would rise to 125% of GDP under Trump and 128% under Biden.This kind of analysis is a bit of a political parlor game, because no president ever gets his entire agenda passed into law, and sometimes it’s not even clear what their policies are. Trump’s second-term agenda, for instance, is nothing more than a list of 54 bullet points on the campaign website, with no cost estimates or documentation. So CRFB researchers had to hunt around for Republican proposals in Congress or elsewhere that indicate what Trump seems to be proposing.Biden’s agenda is far more thorough, with 48 discrete plans and more than 800 individual proposals. But those aren’t always spelled out either, with Biden explaining how he’d pay for some plans, but not others.Biden wants to ramp up spending on education, health care, child and elder care, affordable housing and infrastructure. He’d pay for much of that with higher taxes on businesses, households earning more than $400,000 per year and wealthy investors. Overall, Biden has outlined about $7 trillion in new spending over a decade, along with $4 trillion in new taxes.Trump’s plan is harder to summarize because of the scarce detail in bullet points such as “return to normal in 2021” and “create 10 million new jobs.” Trump’s main economic idea seems to be to cut or eliminate payroll taxes, but that’s very unlikely because those taxes fund Social Security and Medicare. Trump would presumably continue to axe regulations and press trading partners such as China for better trade deals.Story continuesDemocratic presidential candidate former Vice President Joe Biden boards his campaign plane at New Castle Airport in New Castle, Del., Tuesday, Oct. 6, 2020, to travel to Gettysburg, Pa. (AP Photo/Andrew Harnik)Biden gets an edgeMost analysis of the two candidates’ plans give Biden an edge. The whole point of a sound spending-and-taxing plan is to boost economic growth and make more people better off. The Penn Wharton Budget Model finds that Biden’s plan would do that, boosting GDP by 1.4% by 2040, while pushing federal debt 1.5% lower than it would otherwise be.Moody’s Analytics analyzed four election scenarios—a Democratic sweep, a Republican sweep, a Biden win with split control of Congress, and a Trump win with split control of Congress—and found that a Democratic sweep would be best for the economy. If Biden were able to largely enact his policies, the research firm found, GDP growth would average 2.9% during the next decade and the economy would add 21.7 million jobs. Under the status quo—with Trump as president and Congress split—growth would average just 2.4%, with 13.9 million new jobs.Oxford Economics found that “Joe Biden’s fiscal policy proposals would provide the U.S. economy with a booster shot as it recovers from the global coronavirus recession.” Even if Democrats controlled both houses of Congress, Oxford argues that Biden’s full plan couldn’t pass in the Senate, where a narrow Democratic advantage is the party’s best scenario. But a more modest “Biden lite” plan might be able to pass, and if it did, it could boost GDP growth by a couple of percentage points and push employment back to pre-pandemic levels sooner.Another element of a Biden presidency would probably be a large stimulus bill in early 2021. Stocks sank on Oct. 6 as President Trump said he was done negotiating with Democrats on a fourth stimulus bill, and would now wait until after the election. But if Biden wins and Democrats take the Senate, Congress would probably pass a much larger bill than the parties have been negotiating this fall—most likely similar to the $3.4 trillion package House Democrats passed all the way back in May. That would send the 2021 deficit soaring, without a doubt. But most economists think it’s better for Uncle Sam to borrow now and juice the economy than to risk chronic recession and the ongoing misery that entails.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:A business operating like the White House would be in big troubleHow Democrats can save ObamacareTrump’s health care shamTrumpworld is implodingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}