{"article": [{"url": "https://finance.yahoo.com/news/fed-chair-says-economy-faces-new-phase-as-covid-deaths-top-150000-214426447.html", "published": 1596041540.0, "headline": "Fed chair says economy faces 'new phase' as coronavirus deaths top 150K, data soften", "body": "Federal Reserve Chairman Jerome Powell warned on Wednesday that rising coronavirus cases in the U.S. are already showing signs of thwarting the economic recovery.The Fed on Wednesday held interest rates at near-zero as the central bank continues efforts to support an economic recovery. But Powell said high-frequency data pointed to an economy that appears to have slowed since COVID-19 cases began rising anew in mid-June.There have been well over 4 million reported cases of COVID-19 in the U.S., and Johns Hopkins University reported Wednesday that the death toll from the virus passed 150,000. In holding rates steady, the Federal Open Market Committee statement included a new sentence noting that “the path of the economy will depend significantly on the course of the virus.\"In his press conference, Powell said that the Fed “can’t say it enough.”Powell told reporters that “on balance, it looks like the data are pointing to a slowing in the pace of the recovery. But I want to stress: It is too early to say both how large that is and how sustained it will be.”The Fed chief noted that credit and debit card spending, hotel occupancy rates, and visits to restaurants and bars appear to have flattened out as virus cases rose. Powell added that consumer surveys appear to be “softening again,” while labor market indicators pointed to a slowing of job growth, particularly among small businesses.Not all parts of the economy appeared weak, however, with Powell pointing to housing and motor vehicle sales as areas of strength. In opening remarks, Powell pointed to optimism over household spending recovering about half of its decline, and the labor market regaining about a third of the jobs lost.But with the economy still well below pre-pandemic health, the Fed chairman suggested that the economic recovery now faces an inflection point that will rely heavily on stopping the spread of the virus itself.“We have thus entered a new phase in containing the virus which is essential to protect both our health and our economy,” Powell said.Story continuesHe added that social distancing and quickly reopening the economy work hand-in-hand, telling Americans that “all of us have a role to play.”What will the Fed do?New York City, Chicago, Florida, and southern California were major hotspots. (Graphic: David Foster/Yahoo Finance)The Fed has already slashed interest rates to near-zero and restarted its crisis-era policy of asset purchases through quantitative easing. The central bank has also leaned heavily on its lender of last resort powers by setting up 11 liquidity facilities designed to backstop financial markets, ranging from corporate debt to municipal bonds.Powell said the Fed still has tools it can deploy, if needed. For example, policymakers have been discussing the use of explicit forward guidance, in which the Fed would commit to keeping rates at the zero bound until unemployment and/or inflation reach certain targets.The central bank has ruled out tools like negative interest rates, and today swatted down the prospect of the Fed purchasing equities.Even with forward guidance, the Fed appears to have little urgency to unveil that tool soon. Powell said the committee plans on deliberating over the use of forward guidance in “future meetings.”Responding to a question from Yahoo Finance, Powell said the Fed wants to work through another project first: Completion of its monetary framework review. Prior to the COVID-19 crisis, the Fed was in the process of auditing its monetary policy tools to see if it could tweak elements like the approach it uses to target inflation.Powell hinted that completing that review, which would be done in the “near future,” would help set itself up for strategies to address the current crisis.“It is important to go back and finish that and that will inform everything that we’re doing going forward,” Powell said.JPMorgan’s Michael Feroli wrote Wednesday that the July meeting was largely a “placeholder event” for September, where Feroli expects the framework review to be completed.The FOMC’s next meeting will take place September 15 and 16.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed: Economic recovery will depend 'significantly on the course of the virus'FOMC Preview: 'Probably nothing' new as Fed weighs guidance amid coronavirus surgeWells Fargo's Mary Mack: 'We have more to do' on rebuilding reputationSenate panel advances Trump nominees Shelton, Waller for spots at FedA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}