{"article": [{"url": "https://finance.yahoo.com/news/kb-home-offers-buyers-dedicated-home-offices-for-the-first-time-102521491.html", "published": 1596605600.0, "headline": "KB Home offers buyers custom home offices for the first time", "body": "Most home offices are extra bedrooms that are converted into a workspace. But for the first time, one of the biggest residential construction companies in the U.S., KB Home (KBH), will offer dedicated home office construction, the company announced Wednesday morning.KB Home joins a slew of smaller architects and builders that are custom designing spaces for work-from-home trends. Los Angeles-based architecture firm HKS, Chicago-based design firm Gensler and French-Moroccan architectural design practice Studio Belem are among the firms that have adapted, according to reports.“The work from home phenomenon was already growing, but COVID accelerated it — and some companies have announced that certain employees can work from home permanently. It changes the dynamic of having to trod into the office every day,” said KB Home CEO Jeff Mezger, adding that the custom-home builder began working on the KB Home Office package in April.The KB Home Office will include a built-in workstation and shelving. Image provided by KB Home.The KB Home Office, which will cost about $2,000 to $3,000 and can vary in size, will include a built-in workstation and an upgraded electrical package including extra outlets and ultra-fast charging stations. Homeowners can also work with KB Home’s design studio to add soundproofing, custom lighting, a half-bath, extra windows, a built-in coffee bar or even a private patio to their home office.“People have asked about it in the past, but it was more aspirational,” said Mezger, who explained that a dedicated office space is important because it’s “tough to put in electrical upgrades after the home is built.”The KB Home Office will cost about $2,000 to $3,000 — or $12 to $15 a month. Images provided by KB Home.The Los Angeles builder’s home office option comes as the U.S. shifts to a semi-permanent work-from-home model. Some 54% of Americans worked from home during the coronavirus pandemic, and it’s becoming clear that at least some of the shift to remote work will be permanent, said Mezger.Google announced Monday that most of its employees could continue working from home until June 2021, joining Twitter, Square and Facebook in semi-permanent work-from-home commitments. And three-fourths of CFOs say some employees will continue to work from home after the pandemic, according to a survey of over 300 CFOs by Gartner, a Connecticut-based research and advisory firm.Story continues“We are seeing homebuyers purchasing larger homes and wanting private places to work, or for their kids to do homework. Buyers are mentioning that more. I think it’ll be a big thing for the consumer,” said Mezger.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Rent growth hits lowest level in about 6 yearsReal estate is no longer Americans' favorite long-term investment: surveyHow office leasing fared during the coronavirus pandemic: exclusive data"}]}