{"article": [{"url": "https://finance.yahoo.com/news/nikola-releases-more-detailed-rebuttal-to-shortseller-report-addresses-rolling-down-hill-video-162632650.html", "published": 1600083260.0, "headline": "Nikola releases more detailed rebuttal to short-seller report, addresses 'rolling down hill' video", "body": "This morning Nikola (NKLA) released a rebuttal addressing some the most damning allegations of a short-seller report which had sent the company’s stock spiraling on Thursday and Friday of last week.The stock flipped into green territory mid-morning on Monday, up about 7%, after initially opening up lower.Nikola’s statement is in response to a report by short-seller Hindenburg Research which last Thursday called the company an “intricate fraud” and made numerous claims against the electric truck start-up and it’s founder Trevor Milton.Nikola stated the short-seller report was “designed to provide a false impression to investors and to negatively manipulate the market in order to financially benefit short sellers, including Hindenburg itself.”The Nikola One claimsThe company refuted what it calls “false and misleading statements,” including one in which Hindenburg alleged the 2016 Nikola One \"was not a real truck and was, in fact, a pusher.\"In response Nikola stated, “The Nikola One is a real truck that sits in Nikola's showroom. A pusher means a vehicle that was not designed to be moved by its own propulsion system. The Nikola One was, in fact, designed to be powered and driven by its own propulsion.”Nikola states the gearbox, batteries, inverters, power steering, suspension, infotainment, air disc brakes, plus high voltage and air systems were all functional.However it stated, “As Nikola pivoted to the next generation of trucks, it ultimately decided not to invest additional resources into completing the process to make the Nikola One drive on its own propulsion.”Italian-American industrial vehicle maker CNH's truck unit Iveco presents its new full-electric and hydrogen fuel-cell battery trucks in partnership with U.S. Nikola, at an event in Turin, Italy, December 2, 2019. REUTERS/Massimo Pinca‘Rolling down a big hill’ claimNikola says a video of a Nikola One prototype, which the short-seller cited in its report as \"simply filmed rolling down a big hill,” was distorted.It acknowledged, “Nikola never stated its truck was driving under its own propulsion in the video, although the truck was designed to do just that (as described in previous point).”Story continuesIt went on to say, “Nikola described this third-party video on the Company's social media as ‘In Motion.’ It was never described as ‘under its own propulsion’ or ‘powertrain driven.’ Nikola investors who invested during this period, in which the Company was privately held, knew the technical capability of the Nikola One at the time of their investment.”“Any reports intended to suggest that Nikola's trucks do not drive are erroneous, and recent videos of Nikola vehicles driving can be found here,” said the company.Quotes by a Bosch employeeNikola also states the short-seller mischaracterized quotes by a Bosch employee. (Bosch is one of its partners)“Following the publication of the short seller report, Bosch stated, \"Specific instances in the [Hindenburg] report quoting a Bosch employee were taken out of context,” the report said.The statement went on to say, “Nikola and Bosch are aligned on the product roadmap for the Tre truck ... Hindenburg either recklessly misunderstands or willfully misrepresents the vehicle pre-production process to fit its narrative.”Yahoo Finance reached out to Hindenburg Research for a response to Nikola’s rebuttal, but has yet to hear back.Tech newsletterThe company reiterated it contacted and briefed the U.S. Securities and Exchange Commission regarding Nikola's concerns pertaining to the Hindenburg report.Today’s response follows an initial statement released on Friday denying the Hindenburg report and calling it a “hit job.” Friday’s response from the company left investors wanting a more detailed rebuttal, and the stock ended 14% lower at the end of the session.Last Tuesday, Nikola and GM (GM) announced a partnership to make the Badger pick-up truck which will take on Tesla (TSLA) using the established automaker’s Ultium battery systems.The stock soared more than 40% the day of the announcement.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreNikola calls short-seller report a 'hit job,' shares still fallWhy Tesla shares are tanking todayTesla analyst is bullish on what the company is doing with its high-priced stock, raises price target to $550Apple analyst says record-breaking share price rally is about 'MOMO' not 'FOMO'Tesla shares surge 12% on day of stock split"}]}