{"article": [{"url": "https://finance.yahoo.com/news/apple-analyst-share-price-rally-momo-fomo-181232518.html", "published": 1598966420.0, "headline": "Apple analyst says record-breaking share price rally is about 'MOMO' not 'FOMO'", "body": "Apple (AAPL) shares touched new intraday highs on Tuesday, continuing Monday’s rally amid the stock’s 4-for-1 split.Year-to-date Apple is up 80%, while the S&P 500 (^GSPC) is up about 8%. The move has some analysts on their heels as they aim to explain what’s happening to their clients.In a research note to clients, BofA analyst Wamsi Mohan highlighted possible factors behind the stock’s “unprecedented strong run of outperformance vs. the broader market.”A recent “inflow of retail investors” suggests momentum as a factor, he said.“Our conversations with institutional investors suggest that Fear Of Missing Out (FOMO) is not yet at work given the relatively quick rerating and concern that fundamentals can't support continued upside,” he wrote.“Some investors cite that within the hardware universe, There Is No Alternative (TINA) to AAPL's cash flows and could be driving part of the price action although clearly there are other mega caps with strong cash flows as well (but different risk profiles),” wrote Mohan.With the note, the analyst raised his price target on the iPhone maker to $140 while maintaining a Neutral rating.“Analyzing the past few weeks of trading data suggests a strong inflow from retail investors, suggesting MOMO (momentum) is the strongest attributable factor,” he said, while warning that “momentum can cut both ways, especially given risk to Sep/Dec qtr estimates (particularly on high end iPhones).”Though he noted that “in the short term momentum can trump valuation.\"A view of an Apple Store at The Oculus as New York City continues Phase 4 of re-opening following restrictions imposed to slow the spread of coronavirus on August 13, 2020 in New York City.Apple is expected release its next generation 5G iPhone this fall.Following the tech giant’s latest quarterly results in July, WedBush’s Dan Ives told Yahoo Finance the “massive home-run type quarter” is a drumroll for what’s to come with the new iPhones. He specified that 350 million of 950 million global iPhone users have not upgraded their phones in three and a half years.Apple has reportedly asked suppliers to make 75 million 5G iPhone units for later this year, along with the launch of a new iPad air and new watches.Story continuesShare of Apple were trading at around $134 in afternoon trading, up 3.9% on the day.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*-Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}