{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-30-2020-221505732.html", "published": 1596121940.0, "headline": "Stock market news live updates: Stocks drop after grim GDP report, worsening jobless claims", "body": "Stocks fell Thursday after two new reports affirmed the worst quarterly drop in economic activity on record during the second quarter and showed a second straight increase in weekly unemployment insurance claims. Investors also continued to digest the Federal Reserve’s latest monetary policy statement, which was largely viewed as dovish as officials braced for weak growth due to the virus.[Click here to read what’s moving markets heading into Friday, July 31]Market participants on Thursday received the worst quarterly GDP print on record, with second-quarter GDP having contracted 32.9% on a quarter over quarter, annualized basis. The second-quarter report covered the months from April to June, with the beginning of this period marking the time when forced business closures and social distancing blanketed the US due to the coronavirus pandemic.Thursday morning also saw the release of the Labor Department’s weekly print on new unemployment insurance claims. The report showed a second straight increase in new jobless claims to 1.434 million, underscoring the US economy’s backslide as some states dealt with a resurgence in coronavirus cases and re-closed businesses in recent weeks.Big tech stocks Facebook, Amazon, Apple and Google-parent Alphabet were slightly higher Thursday afternoon, extending gains from Wednesday’s session. The moves came after CEOs of each of these companies testified on Wednesday in an hours-long hearing before the House Judiciary subcommittee on antitrust. The hearing covered a range of concerns on the powers these companies have wielded and allegedly used to take out competition.The hearing touched on thornier and more specific issues than in tech hearings past, and also marked Amazon CEO Jeff Bezos’ first appearance before Congress. However, many watching the event unfold pointed to a lack of cohesion between Democratic and Republican lawmakers’ lines of questioning, and took this as sign the hearing was more political grandstanding than a tangible step forward in enacting heightened regulation on these firms.Story continues“Yet again Congress is showing they don't understand tech. They are not aligned on their beef: Democrats are worried about consumer choice, Republicans are worried about censorship of conservative messaging,” Todd Jablonski, Chief Investment Officer of Principal Global Asset Allocation, said in an email Wednesday evening. “By lumping all these companies together – it's great theater, but it tells me they don't want to be serious about any individual company. I have a hard time imagining a single action that will solve antitrust issues across the board.”Each of Facebook, Amazon, Apple and Alphabet are set to report quarterly earnings results after market close on Thursday.—4:05 p.m. ET: Dow drops 226 points after reports of worst quarterly contraction on record, worsening jobless claimsHere were the main moves in markets as of 4:05 p.m. ET:S&P 500 (^GSPC): -12.20 (-0.37%) to 3,246.24Dow (^DJI): -225.92 (-0.85%) to 26,313.65Nasdaq (^IXIC): +44.87 (+0.43%) to 10,587.81Crude (CL=F): -$1.14 (-2.76%) to $40.13 a barrelGold (GC=F): -$6.50 (-0.33%) to $1,970.20 per ounce10-year Treasury (^TNX): -3.8 bps to yield 0.5410%—2:19 p.m. ET: Zoom shares fall after US senators call for DOJ to investigate companyShares of Zoom Video Communications (ZM) dropped about 1.5% in afternoon trading, after Democratic Sen. Richard Blumenthal and Republican Sen. Josh Hawley called for the Justice Department to investigate the video conferencing company along with TikTok. Shares were down as much as 5% shortly following initial reports of the letter.“We believe that it is imperative that the Department of Justice investigate and determine whether Zoom and TikTok’s business relationships, data handling practices, and operational connections to China pose a risk to Americans,” the senators wrote in the letter. “In addition to opening an investigation, we request that the Department of Justice and its partners in the Intelligence Community provide a briefing to Congress on this issue as soon as possible.”Shares of Zoom are still up more than 260% for the year to date.—12:07 p.m. ET: We’re in a ‘square-root recovery ... and that is of worry’: El-ErianMohamed El-Erian, chief economic adviser at Allianz, told Yahoo Finance’s On the Move Thursday that the recent economic data including second-quarter GDP and new data on weekly unemployment claims points to a “square-root” shaped recovery, with some leveling off now under way.“It is the square-root recovery in the sense that we came down very sharply, we saw that in today’s 32.9% annualized contraction in GDP that you mentioned,” El-Erian said. “We came back strongly initially — we saw that in last month’s jobs report and the initial improvement in jobless claims, and now we’re getting the leveling off.”“And that is of worry because not only do we have to deal with the damage that has been created to the economy, but also unfortunately we now become much more sensitive to any policy slippage,” El-Erian said. And I say that because …we also have continued disagreement on Capitol Hill as to what to do next with the relief package. “—10:00 a.m. ET: Stocks swoon as grim data shake investorsWall Street’s sell-off is picking up speed, after opening on the downside despite encouraging news on the vaccine front from Johnson & Johnson (JNJ). While positive COVID-19 cure news usually moves stocks higher, investors appear to be in a foul mood given rising joblessness and the record economic contraction — all of course connected to the coronavirus.—9:38 a.m. ET: What economists are saying about the record drop in Q2 GDPThe Q2 decline in economic activity was, as expected, the worst on record, underscoring the economic devastation induced by the coronavirus pandemic. Many economists noted that a third-quarter bounce is very likely, but may be more muted than previously anticipated given recent economic softening as virus cases rose again in some areas.Here are some comments from a handful of economists to Yahoo Finance this morning, following the Q2 GDP report:“Net, net, the economy fell hard in the second quarter as the pandemic virus locked Americans down at home, but although the collapse was the greatest in U.S. history, the damage to growth is limited as pent-up demand pushed spending right back up as the quarter came to a finish in June. Fed Chair Powell said Wednesday that high-frequency data such as credit card spending has shown the economy is slowing again after mid-June with the spreading second wave of the pandemic to new areas of the economy down South and out West. But we doubt the virus' second wind will drop the economy as low as it was in last quarter's sharpest downturn in economic history. This recession is over. Bet on it.” – Chris Rupkey, chief financial economist for MUFG Union Bank“The worst GDP number in our lifetime wasn't a surprise, due to consumer spending coming to a sudden halt last quarter. The good news is this number is backward looking and we can now look forward, as the rest of 2020 should show major improvement.” – Ryan Detrick, chief investment strategist for LPL Financial“Near-real-time data all show that the economy hit bottom in mid-April and then expanded rapidly through mid-June, before flattening. That means activity at the end of the quarter was much higher than the average across the quarter as a whole, so GDP growth in Q3 will benefit from a hugely favorable base effect.” – Ian Shepherdson, chief economist for Pantheon Macroeconomics:—9:31 a.m. ET: Stocks open lower after grim GDP, jobless claims reportsHere were the main moves in markets as of 9:31 a.m. ET:S&P 500 (^GSPC): -32.39 points (-0.99%) to 3,226.05Dow (^DJI): -319.51 points (-1.19%) to 26,224.06Nasdaq (^IXIC): -88.48 points (-0.85%) to 10,454.13Crude (CL=F): -$1.01 (-2.45%) to $40.26 a barrelGold (GC=F): -$6.00 (-0.3%) to $1,970.70 per ounce10-year Treasury (^TNX): -3.3 bps to yield 0.548%—8:30 a.m. ET: Jobless, GDP (almost) as ugly as everyone expectedInitial unemployment claims and second-quarter gross domestic product (GDP) painted yet another picture of an economy entering a “new phase” (Fed Chair Powell’s wording). However, both high-frequency releases checked in just below expectations — the 32.9% was a record contraction, yet below consensus estimates. Meanwhile, jobless claims clocked in above 1 million again, but a hair below forecasts. However, continued claims jumped above 17 million, and this is now nearly 5 months in a row that claims have posted a reading over 1 million.All told, the numbers show how grim things still are, and should concentrate the minds of lawmakers as they debate another stimulus package.—7:46 a.m. ET: UPS shares climb 10% after reporting record increase in shipping volume, as pandemic drove e-commerce boomShares of United Parcel Service (UPS) climbed more than 10% in pre-market trading, after the courier delivered second-quarter results that handily topped consensus expectations.Second-quarter adjusted earnings of $2.13 per share were nearly twice the $1.07 expected. Revenue of $20.5 billion climbed 13% over last year, and was better than the $17.47 billion expected.Overall shipping volumes jumped by a record 21% during the quarter, led by the US, where daily shipping volumes rose 23% to 21.1 million packages per day. Residential shipments in the US jumped 65% during the quarter, as Americans turned to e-commerce for at-home deliveries during the pandemic.“Our results were better than we expected, driven in part by the changes in demand that emerged from the pandemic, including a surge in residential volume, COVID-19 related healthcare shipments and strong outbound demand from Asia,” newly installed CEO Carol Tomé said in a statement.—7:15 a.m. ET Thursday: Stock futures drop ahead of GDP, jobless claims, earningsHere were the main moves in markets, as of 7:15 a.m. ET:S&P 500 futures (ES=F): 3,219.5, down 33 points or 1.01%Dow futures (YM=F): 26,200, down 240 points, or 0.91%Nasdaq futures (NQ=F): 10,551.75, down 122.5 points, or 1.15%Crude (CL=F): -$0.74 (-1.79%) to $40.53 a barrelGold (GC=F): -$7.80 (-0.39%) to $1,968.90 per ounce10-year Treasury (^TNX): -2.3 bps to yield 0.558%—6:02 p.m. ET Wednesday: Stock futures open higher, extending advancesStock futures kicked off the overnight session slightly higher, adding to gains during the regular session. Here were the main moves in equity markets, as of 6:02 p.m. ET:S&P 500 futures (ES=F): 3,255.00, up 2.5 points or 0.08%Dow futures (YM=F): 26,457.00, up 17 points, or 0.06%Nasdaq futures (NQ=F): 10,694.5, up 20.25 points, or 0.19%A trader makes a phone call outside the New York Stock Exchange (NYSE) on July 20, 2020 at Wall Street in New York City. - Wall Street stocks were mixed early July, 20, 2020 as markets awaited congressional debate on another round of stimulus spending and major earnings releases later in the week. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}