{"article": [{"url": "https://finance.yahoo.com/news/we-are-headed-to-a-vshape-housing-recovery-expert-175321226.html", "published": 1592398880.0, "headline": "We are headed to a V-shaped housing recovery: expert", "body": "As states reopen after coronavirus lockdowns, the homebuilding market is starting to bounce back.A measure of homebuilder confidence has ticked back up into the positive range, according to the National Association of Homebuilders/Wells Fargo Housing Market Index.“I gotta tell you, our economists predicted that we would have a V-shaped recovery in housing, and it sure looks like we’re well on our way right now,” said National Association of Homebuilders (NAHB) CEO Jerry Howard. “We were headed to a very very strong year before COVID, and it looks like we’re bouncing back and we’re going to be leading the economy out of this recession.”Homebuilder sentiment in June reached 58 points out of 100, up from 37 points a month earlier — the largest monthly increase ever recorded since the Housing Market Index began in 2009. A score over 50 is considered positive. The recovery comes after the Housing Market Index plunged 42 points to 30 in April and rose only 7 points in May.But pent-up demand from the spring homebuying season is bumping up summer sales, and mortgage rates are set to stay low through next year, incentivizing buyers into the market.“Couple that [pent-up demand and low mortgage rates] with the fact that a lot of people have had to suffer through quarantines in very tight quarters. People are looking to, some of them, get into their first single-family house, [and] others [want] a bigger house,” added Howard.In fact, housing demand was 25% above pre-pandemic levels in the first week of June, according to Redfin. Home purchase mortgage applications rose 8% the week of June 8 to its highest level in 11 years, and refinance applications rose 10% from the week prior, and up 106% from the same time last year, according to the Mortgage Bankers Association.The Southeast, Texas and the Rocky Mountains are leading in homebuilding sentiment, but even areas where homebuilding has been weak recorded an improvement in June, according to the Housing Market Index. The Northeast jumped to a score of 48 from only 17 points in May, which is very close to a positive market score.Story continues“The Northeastern states are among the most difficult to build in for any number of reasons, so we’re very very bullish right now,” said Howard.‘The more hammers we put to work, the more homes we can expect to build’While sentiment has skyrocketed, actual construction data missed estimates — but still show the beginning of a slow rebound, say economists. Construction began on 4.3% more homes in May after the dip in April, and building permits jumped 14.4%, according to the U.S. Census Bureau Wednesday morning.“Unless additional housing inventory is available, this increase in demand cannot be matched by the expected robust increase in home sales,” said MBA senior vice president and Chief Economist Mike Fratantoni in a statement.Construction began on 4.3% more homes in May after the dip in April. By the U.S. Commerce Department.U.S. homebuilders still face a few threats in the coming months, like supply chain disruptions. Some 28% of construction workers said they had a shortage of construction materials, equipment or parts, according to a survey of 742 construction workers the week of May 18 by the Associated General Contractors of America.“If we get locked down for several months and the supply chain truly gets disrupted, what we’d be most worried about is how it will impact us going into next spring’s building season,” because business slows down during the winter months regardless, said Howard, who said the supply chain is holding up better than he originally anticipated.Labor became an industry-defining problem for the construction industry after the Great Recession, and the shortage was exacerbated in May, when 995,000 construction employees lost their jobs. Some 25% of contractors said a shortage of craftworkers had delayed or disrupted projects, according to the AGC.But rising employment is alleviating labor shortages seen in March. In May, the construction industry recovered almost half of the jobs lost in April, the Commerce Department said Wednesday. And 16% of construction workers said their firm plans to add employees in the next four weeks, the AGC survey found.“Another sign that builders are ramping up construction of new homes is the May increase in residential construction employment,” said Odeta Kushi, chief economist of First American Financial Corporation, a California-based financial services company. “The more hammers we put to work, the more homes we can expect to build.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:More people are paying rent despite the coronavirus pandemicHouse flipping hits a record before the coronavirus pandemic swept the US: study‘Summer is going to be a good period for the housing market’: economist"}]}