{"article": [{"url": "https://finance.yahoo.com/news/asia-stocks-look-set-drift-214649601.html", "published": 1600182680.0, "headline": "U.S. Stocks Weather Late Slide to Finish Higher: Markets Wrap", "body": "(Bloomberg) -- U.S. stocks closed higher as gains in technology shares helped offset a late slide in financials. Crude oil pushed higher, while the dollar was little changed.The S&P 500 rose for a third consecutive trading session, led by communication services, real estate and consumer discretionary shares. JPMorgan Chase & Co., Citigroup Inc. and Bank of America Corp. pushed financials into the red.“The market’s trying to figure out what to do next, and in those times you always see volatility,” said Jerry Braakman, chief investment officer of First American Trust in Santa Ana, California, which has around $2 billion in assets under management. “We’ve been trying to figure out if this tech run is here to stay.”In Europe, Hennes & Mauritz AB led a rally among fashion retailers after beating profit estimates. Investors in Germany unexpectedly raised their expectations for the country’s economy. The offshore yuan climbed to the highest level in a year and stocks in Shanghai advanced on evidence that China is accelerating out of the virus slump.Investors are awaiting the Federal Reserve’s policy meeting Wednesday to gauge the outlook for markets following a slide of about 2% in global stocks this month. The Fed is expected to maintain its dovish stance after earlier saying it will shift to a more relaxed approach on inflation. Central bank largesse is shoring up sentiment in the face of risks from the pandemic, the U.S. presidential election and the possibility of a no-deal Brexit.Here are some key events coming up:Wednesday sees the FOMC policy decision and news conference from Chair Jerome Powell.Bank of Japan, Bank Indonesia and Bank of England policy decisions come Thursday.Friday sees quadruple witching -- the quarterly expiration of futures and options on indexes and stocks -- in U.S. marketsThese are the main moves in markets:For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}