{"article": [{"url": "https://finance.yahoo.com/news/el-erian-tech-valuation-is-a-real-question-mark-for-me-191028907.html", "published": 1596118700.0, "headline": "El-Erian: Tech valuation 'is a real question mark for me'", "body": "The economy is “leveling off,” following the worst drop in GDP on record amid the pandemic, says Mohamed El-Erian, chief economic advisor at Allianz.“It is the square root”–shaped recovery, El-Erian told Yahoo Finance’s On The Move.The economy contracted 32.9% in the 2nd quarter amid COVID related shutdowns, and then initially came back strongly as seen in last month’s jobs report and the initial improvement in jobless claims.“Now we’e getting the leveling off,” said El-Erian. “That is of worry because not only do we have to deal with the damage that has been created to the economy, but also unfortunately we have now become much more sensitive to any policy slippage.”The savings rate went up in the 2nd quarter as households received stimulus checks and grappled with uncertainty surrounding job security and COVDI-19.“Among the people standing in line for the food bank here in Orange County is a former baggage handler at the airport, he never thought he would not have a job,” said El-Erian. “My projection is when that person gets his job back, his savings rate is going to go up.”“We are going to see an increase in voluntary savings, even as jobs recover.”NEW YORK, NEW YORK - JULY 29: A USPS worker wears a face mask on the Upper East Side as the city continues Phase 4 of re-opening following restrictions imposed to slow the spread of coronavirus on July 29, 2020 in New York City. The fourth phase allows outdoor arts and entertainment, sporting events without fans and media production. (Photo by Noam Galai/Getty Images)On Thursday, the Nasdaq (^IXIC) climbed into green territory after opening lower this morning along with the other major indices. This comes a day after the CEOs of Amazon (AMZN), Facebook (FB), Apple (AAPL) and Alphabet (GOOGL, GOOG) appeared before Congress.“The theme underlying the performance of the Nasdaq, I like. The valuation I’m less excited about” said El-Erian.He points to tech companies’ strong balance sheets, positive cash flow, good management and increasing demand amid the pandemic.“They will do well and they will continue outperforming,” he said.“The overall valuation — and I have been wrong for the last three and a half weeks— I exited those names in my tactical exposure. That was the wrong thing to do,” said El-Erian.“But it’s the overall valuation that’s the real question mark for me, “ he said.Story continues“I can see them continuing to outperform because they have both the resiliency and agility to manage this economy. I just don’t know wether the valuation still make sense to tell you the truth,” he added.Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}