{"article": [{"url": "https://finance.yahoo.com/news/wrapup-1-u-consumer-spending-123358164.html", "published": 1600242080.0, "headline": "WRAPUP 4-Fading fiscal stimulus restraining U.S. consumer spending", "body": "(Adds Powell comments, updates markets)* Retail sales increase 0.6% in August; July revised down* Core retail sales fall 0.1%; July revised lowerBy Lucia MutikaniWASHINGTON, Sept 16 (Reuters) - U.S. consumer spending slowed in August, with a key retail sales gauge unexpectedly declining, as extended unemployment benefits were cut for millions of Americans, offering more evidence that the economic recovery from the COVID-19 recession was faltering.The report from the Commerce Department on Wednesday ramped up pressure on the White House and Congress to restart stalled negotiations for another fiscal package. At least 29.6 million people are on unemployment benefits. Consumer spending accounts for more than two-thirds of the U.S. economy.The Federal Reserve on Wednesday kept interest rates near zero, noting that the pandemic \"will continue to weigh on economic activity\" in the near term, \"and poses considerable risks to the economic outlook over the medium term.\"Fed Chair Jerome Powell told reporters more fiscal support is likely to be needed.\"Consumers are being increasingly cautious with their spending,\" said Gregory Daco, chief U.S. economist at Oxford Economics in New York. \"If Congress is unable to extend fiscal aid to households in the coming weeks, the economy will be particularly susceptible to a cutback in consumer spending, especially from the lowest-income families.\"Retail sales excluding automobiles, gasoline, building materials and food services dipped 0.1% last month after a downwardly revised 0.9% increase in July. These so-called core retail sales, which correspond most closely with the consumer spending component of gross domestic product, were previously reported to have advanced 1.4% in July.Economists polled by Reuters had forecast core retail sales rising 0.5% in August. Overall retail sales increased 0.6% in August, in part as sales at restaurants and bars continued to recover. Data for July was revised down to show retail sales increasing 0.9% instead of 1.2% as previously reported.Story continuesRetail sales account for the goods component of consumer spending, with services such as healthcare, education, travel and hotel accommodation making up the other portion. Services have been hardest hit by the coronavirus, which plunged the economy into recession in February, and spending on services remains about 10% below the pre-pandemic level.U.S. stocks were trading higher. The dollar was steady against a basket of currencies. U.S Treasury prices were lower.SLOWDOWN BROADENINGThe retail sales report followed data this month suggesting the labor market was losing speed after astounding employment gains in May and June as businesses reopened after being shuttered in mid-March to control the spread of the coronavirus.Job growth slowed further in August and new applications for unemployment benefits remained perched at extraordinarily high levels in early September. At the same time, manufacturing is also showing signs of tiring, with output slowing last month.A $600 weekly unemployment subsidy expired in July. It was replaced by a $300 weekly supplement, which was not available in all states, and funds for the program are expected to run out this month. Economists estimated that the reduced unemployment benefits supplement cut income by about $70 billion in August.Government money was credited for the sharp turnaround in economic activity that started in May. Still, consumer spending is expected to rebound strongly in the third quarter because of robust momentum in core retail sales at the tail end of the April-June quarter.Consumer spending suffered a record collapse in the second quarter. The pullback in core retail sales in August, if sustained, would set up consumer spending on a slower growth path in the fourth quarter. Growth estimates for the third quarter top a 30% annualized rate. The economy contracted at a historic 31.7% pace in the April-June quarter.\"We have concerns about how strong the recovery will be in the fourth quarter and our optimistic 7.0% real GDP growth looks on increasingly shaky ground unless more jobless workers can find a place in this economy,\" said Chris Rupkey, chief economist at MUFG in New York.The slowdown in spending last month was underscored by a 5.7% drop in sales at sporting goods, hobby, musical instrument and book stores. Receipts at food and beverage stores fell 1.2%, while online and mail-order retail sales were flat.Sales at electronics and appliance stores rose just 0.8% after surging 20.7% in July. Receipts at auto dealerships rebounding 0.2% after falling 1.0% in July.While sales at clothing outlets gained 2.9%, they remained 20% below the February level. Receipts at restaurants and bars rose 4.7%. Though sales at these establishments accounted for a chunk of overall retail sales last month, they were still more than 16% below their pre-pandemic level.Sales at building material stores rebounded 2.0% and receipts at furniture outlets rose 2.1%. The strength in these categories likely reflects a resilient housing market, which is being boosted by historically low mortgage rates and the migration to suburbs and lower-density areas as more workers continue to operate from home because of the pandemic.A report on Wednesday showed confidence among single-family homebuilders rose to a record high in September.(Reporting by Lucia Mutikani; Editing by Chizu Nomiyama and Andrea Ricci)"}]}