{"article": [{"url": "https://finance.yahoo.com/news/big-tech-earnings-surge-during-013452975.html", "published": 1596191000.0, "headline": "Big Tech Earnings Surge During Pandemic While Economy Slumps", "body": "(Bloomberg) -- The largest U.S. technology companies are thriving in a pandemic that has increased dependence on their products and services, while hammering much of the rest of the economy.Quarterly results from Apple Inc., Amazon.com Inc., Facebook Inc. and Alphabet Inc. on Thursday show the industry is capitalizing on the crisis as locked-down consumers use tech gadgets and the internet for entertainment, social connection, shopping, learning and work.Together, the four companies reported revenue of $206 billion and net income of $29 billion in the three months ending in late June.“Right now, it’s big tech’s world and everyone else is paying rent,” said Wedbush Securities analyst Dan Ives. “They are consumer staples now and this crisis has bought their growth forward by about two years.”The four companies’ results hit a day after their leaders faced congressional hearings into whether they have broken antitrust rules and need to be reined in. On Friday, most of them saw a surge in their shares. Apple and Facebook rose to records with the iPhone maker’s market valuation briefly surpassing Saudi Arabian Oil Co. Amazon gained as much as 6.4%. Only Google bucked the trend, sliding 4.3%.Apple executives were quick to recognize how their strong results contrasted with an economic collapse that has caused millions of job losses, hundreds of thousands of deaths and many bankruptcies.Earlier Thursday, U.S. government officials reported that gross domestic product contracted by the most on record -- 32.9% on an annualized basis -- and 17 million Americans claimed state unemployment benefits in mid-July.“We’re conscious of the fact that these results stand in stark relief during a time of real economic adversity for businesses, large and small, and certainly for families,” Chief Executive Officer Tim Cook said on a conference call. “We do not have a zero-sum approach to prosperity, and especially in times like this, we are focused on growing the pie, making sure our success isn’t just our success.”Story continuesCook cut back on his usual litany of praise for his company’s quarterly performance and instead devoted much of his scripted time on the call to discussing things like a contact-tracing partnership with Google, the deployment of masks, and the design of a face shield for medical workers.The numbers paint a clear picture, though. IPad and Mac sales surged on demand from people working and studying from home. The Mac had its second strongest quarter ever, while the iPad had its best June quarter in eight years, Cook noted in an interview with Bloomberg TV.Amazon posted a record quarterly profit as people avoiding physical stores shopped online. Unit sales at the largest online retailer surged 57%, the fastest pace of growth since the company began breaking out that metric.“The penetration of e-commerce is accelerating,” said Hari Srinivasan, a senior analyst with Neuberger Berman. Amazon a prime beneficiary of the shift, and “the changes are here to stay,” he added.Amazon executives, in the earnings release and on conference calls with analysts and the media, didn’t go out of their way to tout the company’s record sales and profit. Instead, they highlighted the company’s hiring during the pandemic, as well as investments in employee safety.A day after testifying to Congress about Amazon’s sometimes harsh treatment of small merchants, CEO Jeff Bezos noted in a statement that such sellers saw faster growth than Amazon’s own retail operation.Facebook reported better-than-expected results partly because so many small and medium-sized businesses are moving online right now to survive, Chief Operating Officer Sheryl Sandberg said.“A lot of businesses are struggling, but at the same time businesses have to pivot online,” she added. “We become a place you can set up a website, set up a digital storefront.”The company reported that it has more than 9 million advertisers, and over 180 million small businesses that use the free parts of its service, such as a Facebook or Instagram profile.CEO Mark Zuckerberg picked up where he left off at Wednesday’s antitrust hearing, referring to the tech industry as an ”American success story.” But he also took aim at President Donald Trump for the second time this month.“It is incredibly disappointing because it seems like the U.S. could have avoided this current surge in cases if our government had handled this better,” Zuckerberg said.Alphabet’s Google was the only big tech company to report a notable impact from the pandemic on Thursday. Revenue fell for the first time as advertisers spent less. The company is heavily exposed to the travel and retail industries, which have been particularly hard hit by the crisis.Still, other parts of Google’s business performed well. Sales at Google’s cloud business jumped 43%, while YouTube ad revenue rose 6% as more people watched online videos at home.CEO Sundar Pichai played down concern about a regulatory crackdown on Google, which is facing an imminent antitrust case from the Justice Department.“We’ve obviously been operating under scrutiny for a while,” he said. “We realize, at our scale, that’s appropriate.”(Updates with shares in fifth paragraph)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}