{"article": [{"url": "https://finance.yahoo.com/news/mortgage-applications-bed-bath-beyond-earnings-what-to-know-in-markets-wednesday-000736398.html", "published": 1594149320.0, "headline": "Mortgage applications, Bed Bath & Beyond earnings: What to know in markets Wednesday", "body": "Investors will be paying close attention to Bed Bath & Beyond (BBBY) earnings and weekly mortgage applications data Wednesday.The U.S. housing market continues to remain a bright spot within the economy as record low mortgage rates have lured homebuyers back into a housing market that was at a standstill as a result of the pandemic.“The strong growth [in the housing market] is consistent with robust growth in mortgage applications, the recovery of the home buying sentiment, and the sharp rebound in the NAHB housing survey foot traffic component,” Bank of America Securities wrote in a note July 2. “The resilient housing market should be helped by pent-up demand and increased migration from urban centers to the suburbs owing to the crisis. However, this tailwind won’t last forever and we are starting to see signs of modest slowing as MBA purchase applications declined in each of the past two weeks.”After seeing two months of strong demand, mortgage applications to purchase a home fell for the past two weeks, according to the Mortgage Bankers Association.MBA Mortgage Applications for the week ending June 26 fell 1.8% from the prior week.A person leaves Bed Bath & Beyond in Kips Bay as the city moves into Phase 2 of re-opening following restrictions imposed to curb the coronavirus pandemic on June 23, 2020 in New York City. (Photo by Noam Galai/Getty Images)Meanwhile, retail chain Bed Bath & Beyond will release fiscal first quarter financial results after the bell. Analysts surveyed by Bloomberg expect the company to report an adjusted earnings loss of $1.22 per share on $1.40 billion in revenue.Foot traffic has been improving at Bed Bath & Beyond, according to Placer.ai data. The alternative data firm noted that weekly visits for the company were down 22% year-over-year the week of June 15th, compared to being down 71.9% just a few weeks prior.“And visits were trending in the right direction on Saturdays, the most important day for the company’s offline visits. On Saturday, June 20th, visits were down just 15.3% year over year while shooting 38.2% above the daily baseline for the period from January 1st, 2019 through June 22nd, 2020, easily its best day since the pandemic,” Placer.ai said.Story continuesBed Bath & Beyond stock fell 36% this year, while the broader market was down less than 1%.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.43 million Americans file for unemployment benefitsWhite Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance news"}]}