{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-oversight-panel-democrats-ask-banks-for-info-docs-on-ppp-loans-163213326.html", "published": 1592221220.0, "headline": "Coronavirus oversight panel Democrats ask banks for info, docs on PPP loans", "body": "Democratic members of the Select Subcommittee on the Coronavirus Crisis are asking the Treasury Department, Small Business Administration and eight national banks to turn over documents and information about Paycheck Protection Program loan distribution.The lawmakers sent letters to the Treasury Secretary Steven Mnuchin, SBA Administrator Jovita Carranza and the CEOs of JPMorgan Chase, Wells Fargo, Citigroup, Santander, U.S. Bancorp, Bank of America, Truist and PNC on Monday.The committee said it’s investigating whether the program designed to keep small businesses afloat during the pandemic has favored large, well-funded companies over small businesses in underserved communities.“Media reports indicate that some large lenders apparently created a two-tier system for processing PPP loan applications. The banks’ wealthiest clients had access to a personalized application process that ensured their applications were processed first. Other applicants had to use poor-performing electronic portals, faced significant processing delays, and sometimes needed to find another lender to consider their application,” wrote the lawmakers.The House established the special panel to oversee coronavirus relief measures, including the roughly $2 trillion CARES Act, and make sure taxpayer dollars are being spent efficiently. House Speaker Nancy Pelosi tapped Majority Whip Jim Clyburn (D-SC) to lead the subcommittee.A page from the PPP loan application that people have to fill out for financial support due to the continuing outbreak of the coronavirus disease (COVID-19) is pictured on a desk in New York U.S., May 7, 2020. REUTERS/Lucas JacksonThe Democratic members are asking the banks to provide documents and information, including guidance from SBA and Treasury regarding PPP requirements, internal communication and communication with SBA and Treasury about the prioritization or exclusion of applicants and internal policies and training materials regarding procedures for processing or expediting PPP loans.The lawmakers also want a list of all the PPP applications each bank received and details on how the institutions made sure loans went to underserved and rural markets. The panel is asking banks to turn over the information and brief Congressional staff by June 29.Story continuesRep. Steve Scalise (R-LA), the top Republican on the subcommittee, accused the Democratic members of trying to hurt President Trump during an election year.“We already know that financial institutions were able to process applications from existing clients more quickly because of requirements to vet new clients under existing law. In fact, the banking industry warned Congress this would happen before the PPP even started processing applications,” said Scalise in a statement.“The indisputable fact is that PPP is working for American businesses,” he added.In a statement to Yahoo Finance, Truist said its PPP applications “were handled through a single application portal made available to clients on a first-come, first access basis, without any preference given to larger or more affluent clients.”Truist said will provide the information to lawmakers —and noted 92% of its PPP loans went to companies with fewer than 50 employees.Wells Fargo (WFC) told Yahoo Finance as of May 31, 80% of its loans went to companies with fewer than 10 employees and more than half of the loans were for $25,000 or less.“Wells Fargo continues to work as quickly as possible to prepare and submit Paycheck Protection Program applications from our small business customers to the U.S. Small Business Administration,” said a Wells Fargo spokesperson in an email.In the letter to Mnuchin and Carranza, the lawmakers also urged the administration to release the names of all PPP borrowers.“Contrary to Secretary Mnuchin’s recent testimony, there is nothing ‘proprietary’ or ‘confidential’ about a business receiving millions of dollars appropriated by Congress, and taxpayers deserve to know how their money is being spent,” the lawmakers wrote.In a Congressional hearing last week, Mnuchin signaled he would not release the names — though in a tweet on Monday he said he would be talking to the Senate Small Business Committee and others to “strike the appropriate balance for proper oversight of #ppploans and appropriate protection of small business information.”Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Sen. Menendez: May jobs report surprise ‘isn't solace' to unemployed workersFed, Treasury have failed to protect jobs so far: oversight panel memberLawmakers try to change Paycheck Protection Program to give businesses flexibilityWyden pushes for unemployment benefits tied to unemployment rates amid coronavirus pandemicNew bill would give essential workers $25K for tuition, student loans"}]}