{"article": [{"url": "https://finance.yahoo.com/news/these-5-states-are-showing-early-signs-of-a-job-market-recovery-155545374.html", "published": 1591873400.0, "headline": "These 5 states are showing early signs of a job market recovery", "body": "The number of jobs lost due to the coronavirus shutdown continue to mount, with the latest weekly total of Americans applying for unemployment benefits coming in above 1.5 million, yet again.The latest swath of applications brings the total amount of jobless claims to more than 44 million over the past three months, wiping out the 20 million jobs added over the last decade by a two-to-one margin.Read more: Coronavirus: How to find a job in a tough economyBut some states are beginning to show a recovery from the spike in unemployment applications as coronavirus lockdowns went into effect. A Yahoo Finance review of jobless claims data from the U.S. Department of Labor shows that Rhode Island, Montana, and Vermont have seen the strongest early signs of a bottoming out to a return to normal.Comparing each state’s average weekly jobless claims totals over the past six weeks to the six weeks beginning in mid-March, which brought a record amount of unemployment applications, reveals that some states are stopping the bleeding faster than others. Comparing those first six weeks of pain to the latest six-week period shows that Rhode Island, Vermont, Montana, Michigan and Pennsylvania have all seen their average weekly initial jobless claims number fall by 75% or more. While each state is still averaging more unemployment applications compared to weeks before the coronavirus pandemic rattled the employment picture in the U.S., the data shows a trend of unemployment applications relatively slowing.Idaho, Ohio, Utah, West Virginia, and Nevada round out the top 10 states showing the largest drop in average weekly unemployment claims.To be sure, even these states have a long ways to go to return to normal. Michigan, for example, shows the fourth most optimistic trend in slowing job losses, but after weeks of continued unemployment applications it has still racked up the country’s third highest insured unemployment rate in the country at 21.7%. That is to say, while the most recent job destruction might be getting less steep, the mountain it has to climb is still rather large.Story continuesMore worrisome, the data also reveals the trends aren’t slowing in some of the hardest hit states. As we’ve highlighted, Georgia and Florida have led the country in seeing average unemployment claims skyrocket the most over the past few weeks. But those states have also yet to show a sustained improvement in their unemployment picture, with their average weekly unemployment applications only coming down about 20% and 30%, respectively, over the past six weeks compared to the first six weeks since the U.S. coronavirus lockdowns began. That could be a result of Florida locking down its economy later, but it would seem at odds with the fact that Georgia reopened its economy sooner than others.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:The coronavirus just doubled the risk of mass bankruptciesObama economist on $2 trillion coronavirus stimulus: 'I'm still not sure if it's enough'Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}