{"article": [{"url": "https://finance.yahoo.com/news/biden-will-have-a-way-to-ban-fracking-despite-trump-lie-accusation-183930760.html", "published": 1599572840.0, "headline": "We'll 'have a way' to ban fracking in Biden administration: Sierra Club", "body": "Joe Biden said recently that he wouldn’t ban fracking in the U.S. if he were elected president, but many environmentalists are still vowing to support him.“With a possible Biden administration, we’ll have a way” to ban fracking, Ramon Cruz, president of the Sierra Club, told Yahoo Finance.The Sierra Club, one of the largest environmental groups in the U.S., opposes fracking, or hydraulic fracturing, which is the process of drilling beneath the earth to extract gas or oil, because of its negative environmental effects. (The Environmental Protection Agency has found that “hydraulic fracturing activities can impact drinking water resources under some circumstances.”)The issue of fracking has become a lightning rod in this year’s presidential election, particularly in the critical battle ground state of Pennsylvania, the second-largest natural gas producer in the nation.President Donald Trump board Air Force One at Andrews Air Force Base, Md., Tuesday, Sept. 8, 2020. (AP Photo/J. Scott Applewhite)In recent campaign stops in Pennsylvania, both President Trump and former Vice President Joe Biden reassured industry workers that their jobs were safe. Biden even accused Trump of spreading banning fracking “lies” about him.“I am not banning fracking. Let me say that again: I am not banning fracking. No matter how many times Donald Trump lies about me,” Biden said in Pittsburgh on Aug. 30.Trump has stated numerous times that Biden would harm the fossil fuel industry. “He’s already written it off. It’s gone. No fracking. That’s part of his platform,” Trump said in a speech in Texas on July 29.Biden’s comments sparked confusion over his fracking policy because in a March 15 debate with former presidential candidate Sen. Bernie Sanders (I-VT), he stated there would be “no new fracking” under his administration.So Biden wouldn’t support new fracking on federal lands, but he wouldn’t ban fracking on private land, a top policy priority for environmentalists – somewhat confusing, but likely also a strategy aimed at garnering votes from fossil fuel industry workers.Story continuesDemocratic presidential candidate former Vice President Joe Biden speaks during an event with local union members in the backyard of a home in Lancaster, Pa., Monday, Sept. 7, 2020. (AP Photo/Carolyn Kaster)Nonetheless, many environmentalists see an upside to the situation.“That means that [if Biden wins] we at least have a person in the White House that is at least listening to our concerns,” Cruz said, drawing a sharp contrast between Biden and Trump.“With the Trump administration, unfortunately, I mean, I could go on and on in terms of how this has benefited the fossil fuel industry in general, by putting together a battalion of coal, gas, and oil lobbyists in charge of the very agencies that are supposed to keep us safe,” he said. (Former Environmental Protection Agency chief Scott Pruitt resigned in 2018, in the wake of numerous ethics investigations.)“What is important here is that [Biden has a] platform that is focusing on transitioning to a fossil fuel free environment economy in the future, and actually, the plan that he has put forward is quite, you know, progressive in that way,” Cruz said.Biden’s $2 trillion climate plan aims to reduce fossil fuel use and transition the U.S. to carbon-free energy by 2035.More from Sibile:Job cuts come for white-collar workers: ‘There are no truly recession-proof’ occupationsThe Trump payroll tax break you won’t see on your paycheck‘Ghosting’ is not just for lovers. These job applicants say ‘cruel’ and ‘selfish’ employers do it too.Trump’s $300 per week unemployment boost ‘too little, too late’ to help August spending: GoldmanEconomist: Pay people $1K to take a coronavirus vaccine instead of forcing themFind live stock market quotes and the latest business and finance news"}]}