{"article": [{"url": "https://finance.yahoo.com/news/heres-a-running-list-of-companies-boycotting-facebook-185430503.html", "published": 1593007340.0, "headline": "Here's a running list of companies boycotting Facebook", "body": "Numerous businesses are pausing their advertising campaigns on Facebook (FB) – and Instagram, which is owned by Facebook – to boycott the company’s policies around what content it moderates and how.The campaign, called “Stop Hate for Profit,” and organized by the NAACP, Color for Change, the Anti-Defamation League, Sleeping Giants, Free Press, and Common Sense Media, already has some big names involved, including a large swath of the outdoor apparel industry and Yahoo Finance’s parent company Verizon (VZ).“From the monetization of hate speech to discrimination in their algorithms to the proliferation of voter suppression to the silencing of Black voices, Facebook has refused to take responsibility for hate, bias, and discrimination growing on their platforms,” writes the Color for Change website.Ben & Jerry's announced a new flavor, Justice Remix'd, at a press conference September 03, 2019 in Washington, DC. (Photo by Win McNamee/Getty Images)By targeting advertisers, the groups hope to get Facebook to change how it responds to misinformation and threats, something Twitter has done by taking a stronger hand when it comes to misinformation and threats. The most salient example of this was when President Trump in May, when protests against the killing of George Floyd began across the U.S., posted on Twitter and Facebook: “Any difficulty and we will assume control but, when the looting starts, the shooting starts.” Twitter placed a public interest notice on the tweet for breaking its rules on the “glorification of violence.”In a statement to various media outlets, Facebook has said that it respects brands' decisions and that it \"remains focused\" on removing hate speech and providing voting information. The company’s COO Sheryl Sandberg also wrote a post on the company’s website announcing commitments to support the Black community, though many of boycotting companies began after the post.On June 26, Facebook announced a few changes: providing info about voting during the pandemic, additional steps to fight voter suppression, a higher standard for hateful content in ads, and the labeling of newsworthy content in ads that may otherwise violate policies.Story continuesSleeping Giants, one of the organizers, has the full running list here.Below are some of the biggest companies that are participating in the boycott so far and their statements.Updated 6/30:PfizerIt’s time to #StopHateForProfit – learn more about our actions here: https://t.co/mr2pXPrbfa pic.twitter.com/4CbRyfjxau— Pfizer Inc. (@pfizer) June 29, 2020MicrosoftBloomberg reports Microsoft is pausing ads on Facebook and Facebook-owned Instagram until the end of the year.Clorox“The Clorox Company will stop advertising spending with Facebook through December.As a people-centered company committed to our values, we feel compelled to take action against hate speech, which we believe will increase through the balance of the year. This creates an increasingly unhealthy environment for people and our purpose-driven brands.We will maintain our planned level of advertising spending but shift to other media.We will continue to monitor this situation and revisit our position as needed. In the meantime, we will evolve our standards and guidelines for progress for all platforms and publishers to reflect our rising expectations for greater responsibility as these channels continue to become a more important part of people’s lives.” —The Clorox CompanyAdidas and ReebokInbox: Adidas and Reebok will pause advertising on Facebook and Instagram globally in July. pic.twitter.com/7gsId1vMPI— Scott Nover (@ScottNover) June 29, 2020Starbucks“We believe in bringing communities together, both in person and online, and we stand against hate speech. We believe more must be done to create welcoming and inclusive online communities, and we believe both business leaders and policy makers need to come together to affect real change.” — Starbucks statement to mediaDiageoDiageo statement on social media advertising pause. pic.twitter.com/kRIsdFjgzk— Diageo News (@Diageo_News) June 27, 2020Coca Cola“There is no place for racism in the world and there is no place for racism on social media. The Coca-Cola Company will pause paid advertising on all social media platforms globally for at least 30 days. We will take this time to reassess our advertising policies to determine whether revisions are needed. We also expect greater accountability and transparency from our social media partners.” – James Quincey, Chairman and CEO of The Coca-Cola CompanyThis statement came after Facebook announced some changes.Unilever“Continuing to advertise on these platforms at this time would not add value to people and society,” Unilever said in an emailed statement to Bloomberg “We will be monitoring ongoing and will revisit our current position if necessary.”Some of the global conglomerate brands include Dove, Axe, Hellmans, Lipton, and many ice cream brands, including Ben & Jerry’s, an early boycotter.Verizon“Our brand safety standards have not changed. We have strict content policies in place and have zero tolerance when they are breached, we take action. We're pausing our advertising until Facebook can create an acceptable solution that makes us comfortable and is consistent with what we've done with YouTube and other partners.\" — Verizon PRPatagonia Patagonia is proud to join the Stop Hate for Profit campaign. We will pull all ads on Facebook and Instagram, effective immediately, through at least the end of July, pending meaningful action from the social media giant.— Patagonia (@patagonia) June 21, 2020Arc’teryx We need a break @facebook. Effective immediately, we will be halting our global advertising with @Facebook & @Instagram until at least the end of July in support of the #stophateforprofit campaign & donating those dollars towards building more inclusive outdoors.— Arc'teryx (@Arcteryx) June 23, 2020The North Face We’re in. We’re Out @Facebook #StopHateForProfit Learn more: https://t.co/uAT7u7mjBG https://t.co/jVxTIH5ThQ— The North Face (@thenorthface) June 19, 2020REI For 82 years, we have put people over profits. We're pulling all Facebook/Instagram advertising for the month of July. #StopHateForProfit Learn more: https://t.co/XCQSnUO8XJ https://t.co/Jp1GaKdCUN— REI (@REI) June 19, 2020Eddie BauerIn support of the #StopHateForProfit initiative, Eddie Bauer will suspend all paid ads on Facebook and Instagram through the end of July, effective immediately. Learn more here: https://t.co/0oMnahL1Mh— Eddie Bauer (@eddiebauer) June 24, 2020Magnolia PicturesIn solidarity with the #StopHateForProfit movement, Magnolia Pictures has chosen to stop advertising on Facebook and Instagram, starting immediately, through at least the end of July. We are seeking meaningful change at Facebook and the end to their amplification of hate speech.— Magnolia Pictures (@MagnoliaPics) June 23, 2020Ben & Jerry’sWe will pause all paid advertising on Facebook and Instagram in the US in support of the #StopHateForProfit campaign. Facebook, Inc. must take the clear and unequivocal actions to stop its platform from being used to spread and amplify racism and hate. >>>https://t.co/7OpxtcbDGg pic.twitter.com/I989Uk9V3h— Ben & Jerry's (@benandjerrys) June 23, 2020Upwork Upwork is hitting pause on hate with no Facebook advertising in July. #StopHateForProfit Learn more at https://t.co/rBCCtMXJZlhttps://t.co/ZpRAL6iSZU— Upwork (@Upwork) June 19, 2020DashlaneDashlane is joining the #StopHateForProfit campaign, and is stopping all paid and organic posts on Facebook and Instagram through July at minimum. pic.twitter.com/U3EKXmqJgn— Dashlane (@dashlane) June 22, 2020Goodby SilversteinGoodby Silverstein is an ad agency with clients such as BMW, PayPal, and Pepsi.We will join #StopHate4Profit and stop posting on @Facebook for the month of July. We are taking this action to protest the platform’s irresponsible propagation of hate speech, racism, and misleading voter information. We encourage clients and our own people to join us.— Goodby Silverstein (@GSP) June 24, 2020Viber“Facebook’s data violations and failure to combat violent rhetoric have crossed the line, and Viber is taking relevant measures to cease ad spending, as well as remove product touchpoints, to protect its 1 billion users.” — Viber--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.'Robinhood is not behind the rally,’ Barclays says as retail demand surgesWant a 'slice' of a stock? Demand booms for fractional shares as markets soarLeisure and hospitality drive jobs numbers higherOverdraft fees have forced the poor out of banks: Former FDIC chairWhy pandemic insurance is impossible"}]}