{"article": [{"url": "https://finance.yahoo.com/news/us-suburbs-with-the-largest-apartment-sizes-152527527.html", "published": 1600252400.0, "headline": "Here are the US suburbs with the largest apartments", "body": "The average size of new apartments in the U.S. is less than 1,000 square feet — not quite big enough to shelter-in-place comfortably.A record number of Americans have uprooted from cities to find bigger homes in suburban and rural areas during the coronavirus — but they might not need to look very far. A new study shows the biggest apartments in the U.S.’s top metro areas. An Atlanta suburb, Johns Creek, topped the list, according to a the study by RentCafé, a subsidiary of Yardi Matrix, an Arizona-based real estate data company.Potential homebuyers are “looking for homes that will take them out of the city and into a more spacious home in the suburbs. The pandemic has been the great accelerator for the pre-COVID-19 trend of millennials looking to buy a home in less expensive and less densely populated suburbs and exurbs,” said Odeta Kushi, deputy chief economist at First American, a California-based financial services firm.In Fulton County, Georgia, the average size of apartments in Johns Creek is 1,225 square feet — 25% bigger than the average apartment in Atlanta, which is about 978 square feet, according to the study.Where you'll find the largest apartments in every metro, by RentCafé.The Miami, Fla. metro area offered the next biggest apartments several miles north in Wellington, with an average 1,208 square feet, a 35% improvement from Miami’s average of 890 square feet.The third largest apartments are found in Lake Wylie, a Charlotte, N.C. metro, and are about 1,205 square feet — 28% bigger than the average apartment size of 941 square feet in Charlotte.In every other metro area the study examined, the towns with the largest apartments averaged under 1,200 square feet. The metros that ranked the worst surrounded San Diego, San Antonio and Pittsburgh, all averaging under 975 square feet even in the suburbs with the largest apartments.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Story continuesMore from Sarah:This village is home to the tiniest apartments in the USThere’s a ‘staggering shortage of homes on the market’: economist‘New York and California are the land of the flee, and Texas is the land of the free’: real estate investor"}]}