{"article": [{"url": "https://finance.yahoo.com/news/us-home-construction-rebounds-4-123810229.html", "published": 1592379980.0, "headline": "US home construction rebounds 4.3% in May", "body": "WASHINGTON (AP) — US home construction rebounded 4.3% in May after steep declines caused by shutdowns due to the coronavirus.The Commerce Department reported Wednesday that new homes were started at a seasonally adjusted annual rate of 974,000 last month after steep declines in April and March. Compared with last year, however, construction activity remains 23.2% below last year's pace.Home builders are hoping that as the nation re-opens, housing will post a strong recovery, helped by super-low mortgage rates. Industry analysts caution that the fledgling rebound could be derailed if infections spike again, causing potential buyers to put off looking for a new home.Hot spots are popping up in regions of the country where building activity is increasing, but not in the South, where housing starts slid.Applications for building permits, a good indication of future activity, rose a sizable 14.4% in May to an annual rate of 1.22 million units.The report showed that construction of new single-family homes was up 5.4% while construction of apartments with five units or more increased 16.9%.Construction was up a huge 69.8% in the West and 12.8% in the Northeast but housing starts fell 16% in the South, the biggest market for home construction, and were down 1.5% in the Midwest.The National Association of Home Builders/Wells Fargo survey of builder confidence released Tuesday showed a record jump of 21 points in June to a reading of 58. Any reading above 50 indicates a positive market.However, analysts cautioned that the rebound in housing may not come as quickly as the industry is hoping.“We look for strong demand, improving homebuilder confidence and an ongoing shortage of supply to support growth in housing starts over the rest of the year, but we still expect starts to be down on average across 2020 overall,” said Nancy Vanden Houten, lead U.S. financial economist at Oxford Economics."}]}