{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-vaccine-president-trump-timeline-125517983.html", "published": 1600502600.0, "headline": "Coronavirus vaccine doesn't depend on President Trump's rhetoric, doctor explains", "body": "The search for an effective coronavirus vaccine is ongoing, with more than 20 companies (and five main U.S. candidates) involved in finding the first and most effective one.President Trump recently claimed that one could be available before the election.“This story is very simple: They started knocking the vaccine as soon as they heard that this actually may come out prior to election,” he said during a recent press briefing on Thursday. “Now, it may or may not, but it’ll be within a matter of weeks. It will be within a matter of weeks from November. It’s ready to go and it’s ready to — for massive distribution to everybody — with a focus, again, on seniors.”Most experts, and the director of the Centers for Disease Control and Prevention (CDC), believe earlier that it would likely take until at least the summer of 2021 until widespread vaccination is available to be distributed to the American public. (On Friday, the president proclaimed that “we expect to have enough vaccines for every American by April” 2021.)U.S. President Donald Trump delivers a speech during a tour of the Fujifilm Diosynth Biotechnologies' Innovation Center in Morrrisville, North Carolina, U.S., July 27, 2020. REUTERS/Carlos BarriaDr. Ezekiel Emanuel, vice provost of Global Initiatives at the University of Pennsylvania and former White House policy advisor under the Obama administration, said that the president’s claims seem to be wishful thinking from someone who is fighting to be re-elected.President Trump “may know something the rest of us don't,” Emanuel told Yahoo Finance’s The Ticker (video above). “We've already seen that that can be the case. But whether we get a vaccine really depends upon nature, not upon his rhetoric. It depends upon how many people who are in the trials are exposed, how many people convert, how protective the vaccine actually is. And that's determined by the environment, not by his rhetoric.”‘We’re getting a very bad return’The typical vaccine timeline can take more than 10 years to develop. With Operation Warp Speed, health experts, including Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases (NIAID), have estimated a vaccine could be accessible to the public within 12-18 months of the onset of the pandemic (which was March 2020).Story continuesThe most promising vaccine candidates so far are being developed by Moderna (MRNA) and AstraZeneca (AZN), which are both in phase three of their trials. Other pharmaceutical companies Johnson & Johnson (JNJ) and Novavax (NVAX) are in phase two.Robyn Porteous is injected with a vaccine as part of the country's human clinical trial for potential vaccines after being tested for the coronavirus disease (COVID-19), at the Wits RHI Shandukani Research Centre in Johannesburg, South Africa, August 27, 2020. REUTERS/Siphiwe SibekoIt is unclear if any of the vaccines will be fully effective even if they pass all the necessary trials. And scientists are unsure of the long-term effects of any vaccines that are granted emergency use authorization (EUA) by the Food & Drug Administration (FDA).“I don't think it's the rushing through stages” that’s the issue, Emanuel said. “I mean, we are going faster than normal. The size of the studies are smaller than normal. You know, 30,000 people in a randomized controlled trial, with 15,000 people getting the COVID vaccine is way smaller than any other previous vaccine trial. On the other hand, we have a pandemic. It has had trillions of dollars of impact on the U.S., not to mention the whole world.”Emanuel added that the U.S. response to this pandemic has been going “badly,” particularly compared to other countries around the world. President Trump has prioritized the U.S. economic recovery over social distancing and other recommended guidelines for containing the spread of the virus by pressuring states to reopen their economies, deciding against implementing a face mask mandate, and reportedly downplaying the dangers of the virus early on.“We're not in the top 10,” he said. “We're not the worst, but we're not in the top 10. And we're definitely, given how much we spend, we're getting a very bad return, and you can see that in the response to COVID.”There are over 6.6 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)‘There’s a lot of work to be done’Part of the problem is the public’s distrust of many of the nation’s health agencies due to the political pressure they are facing from the Trump administration.“I do think it's extremely important that any data that's submitted to the FDA, even if they're only going for an emergency use authorization, be viewed at and critically assessed by one of these advisory committees,” Emanuel said. “We gotta stop having Steve Hahn, the commissioner, make a decision on emergency use authorization all on his own. We need to see the data. We need an external advisory committee that actually is not beholden to President Trump actually evaluate the data, and only then make a decision, and that's not going to be rushed through.”A recent poll found that only one in 10 Americans trust the FDA and the pharmaceutical industry with regards to safety and effectiveness.“That is a very bad place to be,” Emanuel said. “And it also means that a new administration is going to have to spend some time rebuilding that kind of trust, doing things to increase transparency so people have the data, increase the prominence probably of the advisory committees that rule on drug approvals. So I think there's a lot of work to be done.”Billionaire philanthropist Bill Gates holds up a vaccine during a news conference at the Global Alliance for Vaccines and Immunisation (GAVI) conference in London June 13, 2011. REUTERS/Paul HackettAn added issue was highlight by a new report from the Bill & Melinda Gates Foundation that indicated that years of progress made on vaccine coverage, or estimated percentage of people who have received specific vaccines, has been erased by the coronavirus pandemic.“Consider vaccine coverage, which is a good proxy measure for how health systems are functioning,” the report stated. “Our data partner, the Institute for Health Metrics and Evaluation (IHME), found that in 2020, coverage is dropping to levels last seen in the 1990s. In other words, we’ve been set back about 25 years in about 25 weeks.”These findings, according to Emanuel, show why a vaccine is “very urgently needed.”“I think skipping some of the stages is not the problem,” he said. “The problem is do the data confirm effectiveness? Do we have a system in place to really assess safety over time, especially severe safety events? And that's, I think, where the public is really wary.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Coronavirus vaccine development 'is just like Diana Ross and The Supremes,' expert saysDoctor casts doubt on COVID plasma treatment: ‘No breakthrough here’Harvard doctor: America 'needs to regroup' to fight coronavirusRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}