{"article": [{"url": "https://finance.yahoo.com/news/trump-appointed-postmaster-general-plans-143000740.html", "published": 1595583500.0, "headline": "Trump-backed postmaster general plans to slow mail delivery", "body": "Our mission to help you navigate the new normal is fueled by subscribers. To enjoy unlimited access to our journalism, subscribe today.“Neither snow nor rain nor heat nor gloom of night stays these couriers from the swift completion of their appointed rounds.” So goes the unofficial motto of the United States Postal Service (USPS), adapted in 1912 from The Persian Wars by Herodotus and inscribed in the stone atop the main USPS building in New York City. The inscription, however, leaves out the quest for profit, which is currently threatening the “swift” delivery of mail.Americans have come to depend on the modern iteration of the Postal Service to quickly deliver lifesaving medicines, election ballots, bills, checks, and other goods through rough weather, world wars, natural disasters, and pandemics. Nearly 6,190 USPS employees, deemed essential workers, have tested positive for COVID-19, and more than 60 have died. But now, as the cash-strained Postal Service faces what union leadership is calling “Christmas every day for package delivery” and an impending November presidential election that will likely necessitate an unprecedented increase in vote-by-mail ballots, it appears that the 108-year-old credo may have met its match in new Postmaster General Louis DeJoy. “These changes are happening because there’s a White House agenda to privatize and sell off the public Postal Service,” said Mark Dimondstein, president of the American Postal Workers Union. “But there’s too much approval for the organization right now. They want to separate the service from the people and then degrade it to the point where people aren’t going to like it anymore.”The end of overtime work and other changes come as the Postal Service staff finds itself stretched thin. Nearly 40,000 workers have had to quarantine for two weeks after exposure to the virus, according to sources close to the USPS. Data obtained by the American Postal Workers Union, which represents about 200,000 postal workers, shows that nearly 20% of all work by mail handlers, city carriers, and postal drivers is done in overtime. Story continuesThere are no plans to hire more employees to make up for the cut in hours. Because the Postal Service is required by law to pre-fund 75 years’ worth of retiree health benefits for new hires, it is generally thought of as more cost-efficient to increase overtime rather than hire new employees. “Overtime will be eliminated…If the plants run late they will keep the mail for the next day,” reads an internal memo reviewed by Fortune. “If we cannot deliver all the mail due to call offs or shortage of people and you have no other help, the mail will not go out.”The memo warns that “this is the first wave of changes that will be coming to USPS this year,” and that “we all must have a different mindset to keep the USPS alive.” The memo points to Bethlehem Steel, GM, and Packard Electric (all corporations, not public services) as companies that faltered because they “did not want to change and be profitable.” Another memo, entitled, “Pivoting for Our Future,” warns that “one aspect of these changes that may be difficult for employees is that—temporarily—we may see mail left behind or mail on the workroom floor or docks, which is not typical.” But, the memo explains, “this is a critical time for us, when decisive, quick, and meaningful action is needed.” The mail left behind would presumably be delivered at a later date, though the document doesn’t clearly state that.Critics of the changes say they don’t see how minimizing mail delivery efforts will lead to an increase in revenue. Empirically, the opposite has occurred. In late 2011, the USPS announced nearly $3 billion in service cuts that slowed first-class mail delivery for the first time in 40 years. It ended the 2012 fiscal year with a record net loss of $15.9 billion, compared to a net loss of $5.1 billion for the same period the year before.“Every time we’ve slowed down mail, we’ve lost revenue,” said Dimondstein. The new postmaster general, he said, instituted sweeping policy change after just one month in his position and without consulting any unions or representatives with deep institutional knowledge.“These seem to be arbitrary decisions. If you slow down mail and packages, people are going to go elsewhere to get deliveries,” he said. The Postal Service was losing money at an unsustainable pace before the COVID-19 crisis, but it has seen a precipitous drop in revenue since. For this fiscal year, which ends Oct. 1, the USPS is predicting a revenue loss of $13 billion due to COVID-19. That’s on top of the nearly $9 billion the USPS had been losing annually before the pandemic. In order to keep the Postal Service afloat, advocates are asking Congress for $25 billion in immediate assistance, a $25 billion modernization grant to overhaul infrastructure, and $14 billion in debt forgiveness. The Postal Service Board of Governors, which consists of three Republicans (all appointed by President Donald Trump) and two Democrats, unanimously approved of the ask in April. But Trump has repeatedly said that he refuses to sign any legislation with a USPS bailout provision. “The Postal Service is a joke,” said the President in May. His administration nixed a bipartisan attempt to provide $13 billion to the Postal Service in March and previously recommended measures to privatize parts of the service. The Trump administration’s efforts have been met with backlash: The USPS is the most well-liked government agency in the country according to Pew, with a 91% favorability rating. Another poll found that 92% of American voters said they supported direct financial aid for USPS as part of the next coronavirus relief bill. Dimonstein took particular umbrage with comparisons to private institutions like Bethlehem Steel.“A private business can make arbitrary business decisions, but we’re not a private business. We’re a service,” he said, adding that even during the best of times the USPS wasn’t run with the goal of bringing in a big profit. “I guess that the postmaster general must think it’s the Wild West, and he’s the new sheriff.”The Postal Reorganization Act of 1970, he pointed out, requires “prompt, reliable, and efficient services to patrons in all areas,” in its first paragraph. The Postal Service is required by the Constitution to serve everyone in the country equally and with uniform rates. The USPS is the only universal provider of mail service and has been a low-cost anchor for the mailing industry, helping to keep private mail service rates down. A recent analysis by the Institute for Policy Studies found that, without the USPS, 70 million more Americans would have to pay hefty surcharges for deliveries. But the agency has been rapidly losing money since a 2006 law, passed with the support of the George W. Bush administration, required USPS to pre-fund employee retiree health benefits for 75 years in the future. That means the Postal Service must pay for the future health care of employees who have not even been born yet. The burden accounted for an estimated 80% to 90% of the agency’s losses before the pandemic. Critics call the law “draconian” and say that it was created with the intention of leading the Postal Service toward privatization. No other federal agency bears this burden. In a statement to Fortune, the Postal Service said that it was currently “developing a business plan to ensure that we will be financially stable,” which will be presented to the Board of Governors once finalized and will “focus on the Postal Service’s strengths to maximize our prospects for long-term success.” But for now, it is “taking immediate steps to increase operational efficiency by reemphasizing existing plans that have been designed to provide prompt and reliable service within current service standards.” Union leaders say they don’t understand how plans to slow mail delivery services lead to an increase in efficiency.Dimonstein points to a decision to cancel extra truck trips from processing stations to post offices. Each mail truck, he said, can only hold so many containers of mail. When volume goes up, as package volume has during shelter-in-place orders, workers will make an extra trip to make sure everything gets delivered on time. Without those extra trips, packages and mail will sit at the station for at least an additional day. But as volume continues, a snowball effect occurs where days can grow into weeks. “It’s outrageous. It’s an arbitrary act,” said Dimonstein.More politics coverage from Fortune:“Trump troops” in U.S. cities: What the law says about their rights—and yoursExtra $600 unemployment benefit likely to expire before the next stimulus bill passesWhat Trump means when he says he “aced” his presidential cognitive testWhy Republicans need a convention and Democrats can lay lowNo one tried to protect the U.K.’s Brexit referendum from Russian interference, long-awaited report showsThis story was originally featured on Fortune.com"}]}