{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-trump-says-vaccine-ready-within-weeks-as-novavax-boosts-manufacturing-191811526.html", "published": 1600181840.0, "headline": "Coronavirus update: Trump says vaccine ready within weeks; Pfizer says some patients show side effects", "body": "President Donald Trump reiterated his belief that a coronavirus vaccine may arrive before Election Day, even as top administration health officials have rebuffed such a timeline — and vaccine makers have vowed to wait for safety and efficacy data.In an interview with Fox & Friends, Trump said a vaccine could be ready to distribute in as little as four to eight weeks, a highly condensed timeline for approval and distribution that many experts have questioned.“We’re going to have a vaccine in a matter of weeks, it could be four weeks it could be eight weeks…will it be before the Election, it could be…we’ll start delivering it immediately upon getting it,” he said.The aggressive timetable has heightened the debate surrounding the deployment of a potential COVID-19 cure, which is perceived as crucial to restarting public life and ending the threat of lockdowns.While not referencing a specific date or timeline, Trump’s own health officials, including U.S. Food and Drug Commissioner Stephen Hahn, have reiterated a commitment to safety in approving any drug. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases has said a vaccine by Election Day was unlikely, but at least theoretically possible.Since the FDA exists under the executive branch, and therefore under the White House— as does the U.S. Department of Health and Human Services (HHS)— it is possible for the White House to exert pressure, and there are provisions that give HHS Sec. Alex Azar the authority to push for an emergency authorization.But in an article Tuesday in the New England Journal of Medicine, Operation Warp Speed officials, including director Moncef Slaoui, indicated a focus on January 2021 for vaccine distribution and approval.Still, complications in human trials may emerge as a hurdle to rapidly deploying any inoculation— an expectation in the clinical trial process. On Tuesday, Pfizer (PFE) said some of its trial subjects displayed mild-to-moderate after-effects to either the company's experimental coronavirus vaccine, or a placebo. The data showed that fatigue was the most common feeling, executives said on an investor call.Story continuesMany southern states are seeing a week-over-week drop in cases. (Graphic: David Foster/Yahoo Finance)The recent hiccup with AstraZeneca’s (AZN) clinical trials of Oxford University’s vaccine is another indicator of a possible delay — while U.K. Phase 3 trials have resumed, the U.S. remains on hold. The National Institutes of Health is concerned about the mysterious illness that put the U.K. trial on hold and says the company hasn’t been forthcoming with helpful information. The company has said it believes it can still have a vaccine approved by the end of the year.Moderna (MRNA), a key frontrunner heavily funded by federal reesearch dollars, has also committed to the end of the year. Meanwhile, collaborators Pfizer and BioNTech (BNTX) have said they are on track to at least have results by the end of October — but not in time for an October 22 FDA meeting that will hash out details of approval and distribution of vaccines.But Pfizer also said that the FDA has indicated it will weigh an emergency use authorization based on a subset of the trial population. Though trials are upwards of 30,000 for Phase 3, and Pfizer has said it will expand to 44,000, the FDA is only requiring safety data for 6,000— 3,000 vaccinated and 3,000 placebo, executives said on the call.Trump also referenced Johnson & Johnson (JNJ), which is using a similar technology to AstraZeneca, and has not even entered late-stage trials yet for its candidate, though the company has said they will this month. In the wake of the AstraZeneca scare, some participants in a Phase 2 study in Spain have backed out.Meanwhile, other players are ramping up their output potential. Novavax (NVAX), which is in Phase 2 trials, announced Tuesday the company signed a deal with the Serum Institute of India for 1 billion doses. That pushes Novavax’s output to 2 billion doses by mid-2021.The Serum Institute is the largest vaccine producer globally, and has been tapped by other companies, including AstraZeneca, to help with the global production of a Covid-19 vaccine. CEO Adar Poonawalla, recently told Financial Times that many vaccine companies have not ramped up quickly enough to meet the global demand, and it is likely the world won’t be fully supplied until 2024.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}