{"article": [{"url": "https://finance.yahoo.com/news/dicks-sporting-goods-is-wildly-outperforming-amid-the-pandemic-195504143.html", "published": 1598540600.0, "headline": "Why Dick's Sporting Goods is wildly outperforming amid the pandemic", "body": "Add Dick’s to the list of big-box retail chains reporting eye-popping online sales surges amid the pandemic.Dick’s Sporting Goods shares (DKS) rose more than 15% Wednesday after the chain shattered Wall Street expectations on both revenue ($2.71 billion vs. $2.46 billion expected) and earnings ($3.21 per share vs. $1.20 expected). Most notably, its online sales rose 194% in Q2. That stat comes one week after Target said its online sales rose 195% in Q2 and Walmart said its online sales rose 97%. Best Buy bested all of them, with online sales rising 242% in Q2, its biggest quarterly e-commerce growth ever.These four chains are sending a blaring signal of where the U.S. retail trend is heading, in case anyone still doubted it prior to the pandemic. If you need more examples, Urban Outfitter reported that new digital customers rose 70% in Q2, and online-only retailer Etsy’s Q2 sales rose 137%.U.S. e-commerce rose 44% in Q2 overall, the biggest quarterly gain ever, and e-commerce now makes up 16.1% of total U.S. retail spending One year ago, that figure was 10.8%. To dismiss all of this as purely a result of the pandemic would be short-sighted.But for Dick’s, the story isn’t just that Americans are shopping more online.An employee of Dick's Sporting Goods in Destiny USA mall delivers products to a shopper, as customers pick up goods from retailers offering curbside pick up as the coronavirus disease (COVID-19) restrictions ease in Syracuse, New York, U.S., May 15, 2020. REUTERS/Zachary KrahmerCurbside pick-up is here to stayDick’s online sales figure includes curbside sales, a service the chain launched in mid-March at most of its locations. (Dick’s reopened most of its stores to in-store shoppers in June, requiring masks, but the curbside option remains.) Dick’s curbside pick-up option along with its “ship from stores” option comprised 75% of online order fulfillment in Q2.On the earnings call, Dick’s CEO Ed Stack made clear that he thinks curbside will continue to grow for Dick’s beyond the pandemic.“I think the curbside piece is going to accelerate,” Stack said. “It started off as a safety piece. People wanted it because they didn't want to come in contact with anyone else. It's now becoming a convenience piece.”Story continuesDick’s president Lauren Hobart added, “We anticipated originally that we would see a large drop off when the stores reopened, but that is not the case.”Outdoor activities on the rise again—especially golfDuring the call, Stack spent a lot of time emphasizing that he believes Americans began venturing out of their homes for more fitness activities in Q2. But it wasn’t just fitness: camping, fishing, hiking, and boating were all strong categories for Dick’s in Q2 as well. That speaks to the broad array of product categories the chain sells.“I think the fitness business is going to be very good all over,” Stack said. “And people know that in order to fight the pandemic, or whatever comes next, people need to be healthy. And that doesn't mean that we're going to have a lot of marathon runners, but people are going to get out and they're going to walk, they're going to buy a treadmill, they're going to lift some weights, even if they're light weights, kettle bells, this whole fitness trend... We don't see that changing even when COVID-19 is in our rearview mirror for quite a while.”Stack also had high praise for the golf business right now—yes, golf, the industry that was in dire peril just four years ago. (In 2016 and 2017, respectively, Nike and Adidas both exited the golf equipment business.)“The golf business has been great,” Stack said, for both Dick’s and Golf Galaxy, which Dick’s bought in 2007. “There’s a number of young people who have come into the game because they’re not playing football or soccer or some other sport... Men, women, and kids have really all jumped into this game and we expect that to continue through the balance of the year.”It helps that national rounds of golf played rose 14% in June; Dick’s is a beneficiary of that spike.Success of DSG and CaliaFinally, Dick’s is having great success with its own in-house labels. “Our private brands are doing extremely well,” Stack said.Dick’s own DSG brand, which launched last year, has now surpassed Field & Stream to become the chain’s No. 1 private brand overall. Calia, Carrie Underwood’s apparel line under the Dick’s umbrella, was No. 2 women’s apparel brand at Dick’s in Q2, while DSG was No. 3.Of course, Dick’s isn’t the only large retailer that is gradually emphasizing its own private brands over outside brands. Amazon has been doing the same for a few years now.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Walmart and Target huge e-commerce gains are a blaring siren to brick-and-mortar retailAmid pandemic, Walmart says it’s seeing increased sales of tops—but not bottomsCompanies like Nike and Dick’s are ‘finding their woke values’Etsy CEO on huge Q2: Etsy is 'becoming much more mainstream'Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’Facebook ad boycott is ‘more noise than fundamental risk’"}]}