{"article": [{"url": "https://finance.yahoo.com/news/former-obama-advisor-valerie-jarrett-talks-protests-defunding-police-and-criminal-justice-reform-122130901.html", "published": 1592292560.0, "headline": "Former Obama advisor Valerie Jarrett talks protests, defunding police, and criminal justice reform", "body": "As Black Lives Matter protests continue to gain strength across the United States, former senior advisor to President Barack Obama Valerie Jarrett says the country might have reached “a turning point.”“It feels different this time,” Jarrett told Yahoo Finance.“And I'm hesitant to say we've reached the turning point, but I do think this is more than an inflection. I do think it's the beginning of a turning point. And the question will be, can we sustain this effort over time?”The top Obama official says that the protests and demonstrations have been “incredibly positive,” with people of all races, backgrounds, and ages participating.“I also think that those demonstrations have yielded results right away,” she said, citing the appointment of Minnesota Attorney General Keith Ellison to the George Floyd case and the increased severity of charges against the officers.“That's the kind of swiftness that I think people know resulted from the pressure. We've seen cities around the country already ban the chokehold, states do the same. The federal government is looking at a bipartisan bill at police reform -- something you would not have imagined six months ago.”“So I think those positive changes have actually encouraged protesters to continue this effort, recognizing that their pressure is yielding results.”‘Patterns and practices’ of discriminationIn the Obama administration, Jarrett also served as the president’s point person in the White House on criminal justice reform, including police reform efforts.She explained that law enforcement changes at police departments around the country will need to come primarily from local governments themselves.Michelle Artiaga of Los Angeles takes a picture of herself on Hollywood Blvd. a day after a large protest march there, Monday, June 15, 2020, in Los Angeles. Protests continue to be held in U.S. cities over the death of George Floyd, a black man who died after being restrained by Minneapolis police officers on May 25. (AP Photo/Chris Pizzello)“The federal justice department could do more to both support reforms within local law enforcement agencies and also look at whether there are patterns and practices of discrimination, as they did in the justice department of President Obama during his administration,” she explained.Story continues“And if there are patterns and practices, then take those agencies to court, have a court order supervise how those reforms are done.”Jarrett described these moves as “carrots and sticks,” referring to both rewards and punishments that could be “provided at the federal level.”In her role, Jarrett helped craft the White House’s initiatives on criminal justice reform, including increased commutations of sentences for people jailed for drug offenses, as well as moves to reduce mass incarceration and “banning the box,” which helped job applicants with a criminal record gain employment.But despite these moves, Jarrett said she doesn’t support renewed efforts to “defund police,” and instead called for “smarter funding” of police departments.“If somebody breaks into your home, you're going to call 9-1-1,” she said. “Let's be smart about this. Let's be thoughtful about it. And let's engage with the community, because what you really want, is an integrity to the system so that the residents buy into it.”“There are road maps out there, like the 21st century policing task force that was created under President Obama that has been continued under the umbrella of the leadership conference,” she continued.“These are the steps that make for a stronger bond of trust between police and communities of color.”Though Obama made strides in the areas of criminal justice reform, many have criticized his administration for not doing enough. But Jarrett says the president and his attorneys general had “very aggressive” agendas.President Barack Obama, joined by Vice President Joe Biden, left, and Senior White House Adviser Valerie Jarrett, right, speaks during a Democratic Governors Association Meeting in the Eisenhower Executive Office Building on the White House campus in Washington, Friday, Feb. 19, 2016. (AP Photo/Carolyn Kaster)“I will say, we pushed Congress hard to reform the mandatory minimums for nonviolent drug offenders,” she said.“And we had 80 votes, which, again, is unprecedented to see the Senate come up with that kind of a coalition. One person, Mitch McConnell... refused to bring it to a vote. So I think we could have gotten more done if we had simply been able to move the agenda forward.”Disputing TrumpJarrett had harsh words for President Trump, calling his assertion that he’s “done more for black people” than any other president a “ridiculous statement.”“The unemployment rate for the African-American community started coming down as a result of the steps that President Obama did to right our economy back in 2009,” she said. “President Trump has benefited from those steps and created the spur that got our economy going in the right direction.”“And the health disparities, which were intended to be addressed under the Affordable Care Act, he has been in court trying to repeal.”“So you look at the economic indicators, if you look at the health imperative, if you look at the language that he uses… I can't imagine why he would think anyone would believe what he is saying,” said Jarrett. “And if you look at the polling in terms of his standing in the African-American community, that speaks for itself as well.”Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:Coronavirus pandemic could wipe out Social Security 4 years earlier than predicted: Wharton ModelTrump’s ‘Operation Warp Speed’: No way it happens, says infectious disease expertRepublican states to see biggest economic boosts from reopening amid coronavirus crisisOver 4 million in US will contract coronavirus if states fully reopen: Wharton modelGreatest increases of COVID deaths projected in Republican statesProjected US coronavirus death toll rises to 138,000 as more states mull reopeningRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}