{"article": [{"url": "https://finance.yahoo.com/news/bidens-top-economic-priority-isnt-what-you-think-164035538.html", "published": 1599047300.0, "headline": "Biden’s top economic priority isn’t what you think", "body": "Democratic presidential nominee Joe Biden has plans to expand health care, rebuild infrastructure, help college students, address climate change and build more affordable housing. But none of those things is his top economic priority.Instead, Job 1 for Biden on the economy is corralling the coronavirus. “Virus control is step one, and there is no step two or three without step one,” Biden economic adviser Jared Bernstein told Yahoo Finance in a recent interview. “He takes that extremely seriously.”Biden unveiled a plan to combat the coronavirus in mid-March, when he was still battling Sen. Bernie Sanders for the Democratic nomination. Around the same time, President Trump declared a national emergency, to help speed the development of coronavirus testing and the production of protective equipment. At the time, it wasn’t obvious the virus would still be raging in the home stretch of the 2020 election, forcing business shutdowns that have cost millions of workers their jobs.Now, however, it’s apparent that the coronavirus will be a dark presence as Americans cast their votes this fall, and a weighty drag on the economy well into 2021. The U.S. death toll from the virus is on track to exceed 200,000 by November. Development of several vaccines looks promising, and Trump could very well declare a vaccine has arrived before Election Day on Nov. 3, whether true or not. But even if there is a vaccine by the end of the year, distribution will take months and the economy won’t return to normal for longer than that. The pandemic could even worsen in fall and winter as people move indoors.Biden’s pandemic plan is notably different from Trump’s. Trump has consistently downplayed the virus, shunned masks and shifted responsibility for testing to states and cities. Biden would consolidate pandemic response at the federal level, making free testing available everywhere, on Uncle Same’s dime, and covering the cost of care related to Covid-19 for anybody who needs it. Biden has called for a three-month national mask mandate for every American out in public, and said he’d restore the authority of federal health agencies such as the Centers for Disease Control, which has softened various pandemic guidelines on orders from Trump’s White House. Advising Biden are medical experts such as former FDA Commissioner David Kessler and former Surgeon General Vivek Murthy.Story continuesHealth policy has become economic policy because of huge state-by-state and even city-by-city variations in guidelines for containing the virus and reopening businesses. Single federal standards on things like masks and reopening thresholds wouldn’t please everybody, but they’d clear up uncertainty and in some cases give businesses needed procedures for operating safely and limiting legal liability. It might also eliminate or reduce ad-hoc decision-making in some states that has led to waves of business openings and closings as people try to get back to normal and the virus reasserts itself.There are over 6 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)If Biden wins and takes office next January, his next order of business after corralling the pandemic is marshaling new stimulus legislation to speed an economic recovery. Congress has been negotiating over a fourth coronavirus stimulus bill, but Democrats and Republicans remain far apart on the details. Congress could still pass a compromise measure this fall, but by next year there could be millions of Americans needing help paying for health care, rent and food, and thousands of shuttered businesses.Only when the virus is receding and the economy recovering would Biden pursue the bolder plans that have defined his candidacy, such as establishing a new public health care option, pushing more green energy, boosting U.S. manufacturing and helping more students pay for college. “That’s step three,” says Bernstein, who was Biden’s chief economist when Biden was vice president, and is now a senior fellow at the left-leaning Center on Budget and Policy Priorities. “That's the permanent, long-term new policy architecture to reconnect so many people who've been left behind to a growing economy.” Biden has also proposed a variety of tax hikes to pay for those plans, which would total about $4 trillion in new revenue over a decade if they went into effect.In addition to winning moderate voters and beating Trump in November, Biden would need Democrats to control both houses of Congress to pass even modest versions of his reform plans, which might come in Year 2 of a Biden presidency. At the moment, Biden leads Trump by about 7 percentage points in national polls, and by smaller margins in key swing states such as Wisconsin and Pennsylvania. So winning is within reach. But flipping the Senate from Republican to Democratic control is probably a stretch goal. Biden is undoubtedly stretching.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Biden would undo the Trump tax cuts5 campaign promises Trump has given up onThe Trump campaign’s bogus boom timesWhy Trump wants to shackle the postal service11 ways Trump is out of touch with votersEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}