{"article": [{"url": "https://finance.yahoo.com/news/nikola-nkla-stock-remains-show-221856373.html", "published": 1594142780.0, "headline": "Nikola (NKLA) Stock Remains a ‘Show Me’ Story, Says Analyst", "body": "It has been a wild ride in 2020 for electric heavy-truck maker Nikola (NKLA). Even after the recent heavy pullback, shares are still up this year by a towering 290%.With no working prototype, no revenue, and seemingly sentiment driven stratospheric gains, how can you measure Nikola’s value? This is an issue RBC's Joseph Spak grappled when initiating coverage on NKLA.“As meaningful revenue/EBITDA/CF are further out, NKLA is difficult to value and can remain a story stock untethered to trad’l valuation/fundamental metrics. We're intrigued by biz model prospect but remain on the sidelines given unproven biz model and significant tech, customer adoption, and execution risks,” the analyst said.The business model which Spak refers to is Nikola’s FCEV (Fuel Cell Electric Vehicle) bundled lease option (truck + fuel + S&M). The company plans on charging $665k for a 7-year lease (or 700,000 miles, if clocked beforehand). This would lead to roughly a total cost of ownership (TCO) of $0.95 per mile, which Spak estimates is $0.09 more than what you would pay for a traditional diesel vehicle. Add government incentives into the mix, the certainty of a locked price and the possibility of “greater fuel cell efficiencies as supply chain matures,” and Spak is intrigued by the “unique” approach.However, the success of this model, Spak argues, is dependent on “two key factors.” Spak explained, “Lease economics highly contingent upon further reduction in fuel cell costs and NKLA’s ability to cost-effectively produce hydrogen, both of which remain unclear. NKLA could increase truck/fuel price/mile to compensate for higher than expected fuel cell/electricity costs and preserve profitability, but this would likely weigh on value proposition vs. diesel and BEV in form of higher TCO.”Add to this the fact that deliveries for the first models are scheduled for 2H21 at the earliest, and the unproven nature of the EV industry, and Spak concludes that, as of now, Nikola is “more of a business plan than a business.”Story continuesTo this end, Spak initiated a Sector Perform (i.e. Hold) rating on Nikola with a $46 price target. There is 14% upside from current levels, should Spak’s target be met over the next 12 months. (To watch Spak’s track record, click here)Overall, Nikola’s Moderate Buy consensus rating is based on 1 Buy and 2 Holds. There’s upside of 41% in the cards, should the average price target of $56.67, be met in the year ahead. (See Nikola stock analysis on TipRanks)To find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights."}]}