{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-president-trump-wants-larger-numbers-than-the-democrats-for-new-round-213340351.html", "published": 1593621680.0, "headline": "Coronavirus stimulus: President Trump wants 'larger numbers than the Democrats' for new round", "body": "President Donald Trump expressed his support for more stimulus — potentially including a second round of checks and monetary incentives for Americans to return to work.When asked by Fox Business News on Wednesday whether he supports another round of direct payments to Americans, he said: “I do. I support it but it has to be done properly. And I support actually larger numbers than the Democrats.”Under the CARES Act enacted in March, the government has sent $270 billion in stimulus checks as of May 31 to over 160 million Americans. Each payment is worth up to $1,200 per qualifying adult, plus a $500 bonus for children under 17.US President Donald Trump signs the Paycheck Protection Program and Health Care Enhancement Act in the Oval Office of the White House in Washington, DC, on April 24, 2020. (Photo by Olivier DOULIERY / AFP) (Photo by OLIVIER DOULIERY/AFP via Getty Images)The $3 trillion HEROES Act, which passed the House in May and has been held up in the Republican-dominated Senate, proposed $1,200 direct payment per individual with a maximum amount of $6,000 per household.Read more: Coronavirus stimulus checks: What it means for your taxesThe president said he supports bigger payments for Americans, but didn’t specify in what form they would be available.“I want the money getting to people to be larger, so they can spend it,” he said. “I want the money to get there quickly and in a non-complicated fashion.”Yahoo Money sister site Cashay has a weekly newsletter.‘Disincentive to work’While the president expressed support for more stimulus, he criticized previous efforts for giving Americans “a disincentive to work last time,” likely addressing the fact that some jobless workers were paid more with the additional $600 weekly unemployment benefits provided under the CARES Act.“It was an incentive not to go to work, you'd make more money if you don't go to work,” Trump said. “We want to create a very great incentive to work, so we're working on that and I'm sure we'll all come together.”The Trump administration and some Republican lawmakers have previously signaled support for nationwide bonuses for returning to work.Read more: Coronavirus stimulus checks: How to use your payment debit cardHundreds of unemployed Kentucky residents wait in long lines outside the Kentucky Career Center for help with their unemployment claims on June 19, 2020 in Frankfort, Kentucky. (Photo by John Sommers II/Getty Images)White House economic adviser Larry Kudlow, who described the additional $600-a-week in unemployment benefits as “paying people not to work,” said that the White House is considering a return-to-work provision.Story continues\"The president is looking at a reform measure that would still provide some kind of bonus for returning to work,\" Kudlow told CNN on June 14. “But it will not be as large, and it will create an incentive to work.”Republican Senators have proposals for such bonuses including two prominent ones: a proposal from Sen. Rob Portman (R-OH) offering a $450-a-week incentive for people returning to work and another from the Ways and Means Republican Leader Kevin Brady (R-TX) that proposes turning unemployment benefits into a back-to-work bonus of $1,200.Denitsa is a writer for Yahoo Finance and Cashay, a new personal finance website. Follow her on Twitter @denitsa_tsekova.Read more:Rich Americans' pullback in spending is hurting the economic recoverySome Americans finally get a living wage — while unemployedRead more personal finance information, news, and tips on CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and Reddit."}]}