{"article": [{"url": "https://finance.yahoo.com/news/united-eyes-mass-layoffs-that-may-impact-up-to-36000-workers-150451961.html", "published": 1594203140.0, "headline": "United eyes mass layoffs as coronavirus creates 'worst crisis' in airline history", "body": "United Airlines Holdings (UAL) warned on Wednesday that it may be forced to furlough as many as 36,000 workers, or 45% of its workforce, as weak demand and travel restrictions in the wake of the coronavirus outbreak create “the worst crisis” the industry has ever faced.As the COVID-19 pandemic ravages global demand, United — along with other major carriers like Delta (DAL), Southwest (LUV), JetBlue (JBLU) and Alaska — have struck a deal with the federal government for a major cash infusion worth billions of dollars.The CARES Act, the omnibus coronavirus relief package, set aside $25 billion in loans for air carriers. Yet new domestic flare ups of the virus — along with international travel restrictions — are amplifying the threat, and forcing United to weigh cutting workers en masse.According to United, 36,000 workers — or 45% of U.S. positions — may be impacted or laid off by October 1. Although 3700 have already taken an early-out option, the potential losses affect 15,000 flight attendants, 11,000 airport staffers, 5500 maintenance positions and 2250 pilots, the company told reporters on a conference call.Fallout from the coronavirus pandemic is “the worst crisis to hit the airline industry and United Airlines,” a United executive said on Wednesday. “We can’t count on additional government support to survive.”The executive said United is burning through $40 million per day despite a schedule that’s been cut to 20% of its usual capacity. In order to mitigate the impact of layoffs, United will begin talks with all 5 labor unions, and encourage a voluntary retirement program, among other options.A provision of the CARES Act requires airliners to avoid furloughs or pay cuts. However, United suggested the bleak outlook leaves the airliner few other options.“The truth is none of the decisions so far have been more difficult than the decision we are announcing today,” the executive added. “Involuntary furloughs that we worked so hard to avoid are the last option left.”Story continues[Click here for more of Yahoo Finance’s coronavirus coverage: Personal finance tips, news, policy, graphics & more from Yahoo Finance]Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news."}]}