{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-vaccine-makers-ramp-up-manufacturing-as-debate-heats-up-nyc-to-delay-school-reopen-150035176.html", "published": 1600337300.0, "headline": "Coronavirus update: Vaccine makers ramp up manufacturing as Trump stirs debate; NYC to delay school reopen", "body": "Drug makers moved quickly to ramp up vaccine manufacturing capacity in order to get ahead of what is expected to be an aggressive timeline to develop an effective COVID-19 cure, as a new debate erupted over how quickly it could be deployed to the general population.On Wednesday, a new furor erupted after President Donald Trump contradicted the director of the Centers for Disease Control and Prevention (CDC), saying his top health advisor was “confused” when he told the Senate that masks were more effective than a vaccine.CDC Director Robert Redfield testified that masks were possibly more effective as a protection against the coronavirus, and that widespread availability of a vaccine was unlikely until at least mid-2021. “I might even go so far as to say that this face mask is more guaranteed to protect me against COVID than when I take a COVID vaccine,” Redfield said.However Trump — which is partly staking his reelection bid on the deployment of a successful inoculation — undercut Redfield by saying he must have been confused by the question. “The mask is not as important as the vaccine,” the president said.The conflict was the latest episode of mixed messages from the Trump administration, and is helping to fuel an erosion in the public’s trust in the government’s handling of the crisis. Recent polls show that many Americans would hesitate to take one of the first approved vaccines in light of the expedited timeline.The CDC and U.S. Health and Human Services Department (HHS) released an overview and strategy of vaccine distribution Wednesday, focusing on the prioritization of high-risk individuals and minority populations.Health experts have repeatedly committed to widespread availability by the second quarter of next year, at the earliest — and Redfield said Wednesday that it could even be Q3, with limited supplies available for high-risk individuals by the end of this year.Yet Trump acknowledged that high-risk individuals, specifically the elderly, were on the list of first vaccine recipients, but insisted widespread availability would arrive earlier.Story continuesThe search for effective treatments and inoculations have taken on a new urgency with the start of the school year, and the return of fall sports.New York City, which was scheduled to start in-person classes next week, partly reversed that decision on Thursday, delaying physical attendance for most students in a struggling attempt to phase in a reopening. The move has been highly controversial with the city’s teachers and their union representatives.Separately, vaccine companies are focusing on ramping up their production. BioNTech (BNTX), which is developing a vaccine with Pfizer (PFE) and is one of the frontrunners in the U.S., announced it was purchasing a manufacturing plant in Germany to boost production of its candidate.The manufacturing plant is an acquisition from Novartis, and would be one of the largest mRNA production facilities in Europe, BioNTech said, adding the plant would be fully operational in the first half of 2021 and will produce up to 750 million doses annually.An annual production outlook is crucial for vaccine companies now, as information about durability of vaccine is still unknown — even as the first set of candidates prepare to hit the market. Amid uncertainty about how effective a vaccine will be, some health experts believe the coronavirus outbreak could be a seasonal occurrence like the flu.Antibody treatments, however, remain a point of hope — with recent information from Eli Lilly (LLY) pointing to potentially reducing the viral load in patients in 11 days. But some analysts warn the update from Lilly was not enough to be convincing just yet.However, Amgen (AMGN) announced a manufacturing partnership with Lilly Thursday, saying it was “impressed with Lilly’s data, in particular the reduction in hospitalizations, and are enthusiastic about the potential for these neutralizing antibodies as a therapeutic for COVID-19,\" said David Reese, Amgen’s executive vice president of research and development.Meanwhlie, Sorrento (SRNE) has entered Phase 1 clinical trials of its antibody therapy, adding its name to a list of companies pursuing such a treatment.Separately, Moderna (MRNA) reported Thursday that it is nearly fully enrolled in its 30,000-participant Phase 3 vaccine trial. At least 10,000 individuals have received both doses of the vaccine, setting the company on track for a November efficacy reading.CEO Stéphane Bancel noted the vaccine candidate is putting the company on track to be commercial three to four years ahead of schedule, and has been a boost to its platform. Moderna will now be pursuing a seasonal flu vaccine using the mRNA technology.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}