{"article": [{"url": "https://finance.yahoo.com/news/fomc-july-29-2020-fed-monetary-policy-185540803.html", "published": 1595858600.0, "headline": "FOMC Preview: 'Probably nothing' new as Fed weighs guidance amid coronavirus surge", "body": "The Federal Reserve is expected to hold the line on its unprecedented monetary support for the U.S. economy, meaning the central bank will likely keep its powder dry by announcing little new when its policy-setting meeting concludes on Wednesday.The Federal Open Market Committee (FOMC) will release its statement at 2pm ET on Wednesday, followed by Fed Chairman Jerome Powell’s press conference at 2:30pm ET.UBS’s economics team predicts that the Fed meeting will likely yield “probably nothing,” as Fed officials wait for more information on the path of an economy still being walloped by the coronavirus pandemic.“Our baseline view is that the July FOMC has no major developments,” UBS wrote in a client note last week.Despite a surge in domestic COVID-19 cases since the FOMC’s last meeting on June 10, the central bank has signaled no urgency to provide further accommodation through the use of more explicit forward guidance.Interest rates are already near-zero, and the Fed has no intention to dip into negative territory. But the Fed could give financial markets more certainty in the future by offering a roadmap for how long it will commit to keeping rates near-zero (i.e. by saying the FOMC will not raise rates until the unemployment rate, or inflation, hit certain targets).New York Fed President John Williams told Yahoo Finance July 16 that, at the moment, the Fed does not need to move quickly on codifying forward guidance.“We do have some time to think about how we should evolve that guidance as we go forward,” Williams said.With little expectation for anything new in the July meeting, Wall Street banks say the Fed will wait until later in the year to announce any possible changes to its current policy.“We do expect the FOMC to adopt some form of explicit forward guidance, if not at its September meeting then at its November meeting,” Wells Fargo’s economics team wrote July 20.In the meantime, the Fed will likely continue to commit itself to “using its full range of tools” to support the economy, which includes the 11 liquidity facilities backstopping markets ranging from risky corporate debt to loans to Main Street.Story continuesUntil the public is confident…With no economic projections on tap for this meeting, Powell will face questions on the future path of Fed policy in his press conference.If the Fed makes little to no changes, Powell could pass the ball to Congress and the White House, where negotiations are continuing for a “Phase 4” deal. On the table: An extension of unemployment insurance, a fresh round of economic impact payment checks, and help to state and local governments.“Chairman Powell's press conference could serve as a forum to judiciously nudge lawmakers across the finish line on a Phase 4 deal,” Isaac Boltansky, Compass Point’s director of policy research, wrote this week.The Fed has emphasized since the beginning of the crisis that the public health response is the primary key to a rapid recovery. But with COVID-19 cases in the United States topping 4 million, the Fed will have to reiterate that the virus needs to be contained before the economy can get back on track — even as an effective vaccine comes closer to being a reality.As states paused on re-openings in late June, Powell told Congress that “a full recovery is unlikely until people are confident that it is safe to re-engage in a broad range of activities.”The Fed’s clearest read on the depth of the crisis will come the morning after its FOMC meeting, when the Bureau of Economic Analysis releases its advance estimate on second quarter GDP. Wall Street largely expects the Thursday morning print to show U.S. economic activity contracting by over 30% over the three-month period ended June 30.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Wells Fargo's Mary Mack: 'We have more to do' on rebuilding reputationSenate panel advances Trump nominees Shelton, Waller for spots at FedYahoo U: What are SPACs?Fed expands Main Street loan program to nonprofitsA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}