{"article": [{"url": "https://finance.yahoo.com/news/ballet-star-misty-copeland-george-floyd-protests-are-the-first-time-i-feel-like-im-truly-being-heard-215814000.html", "published": 1595351180.0, "headline": "Ballet star Misty Copeland: George Floyd protests are 'the first time I feel like I'm truly being heard'", "body": "Over the past five years, ballet dancer Misty Copeland has become a bona fide star outside of ballet. She performed the lead role in “Coppelia” at The Met in 2014, and in 2015 made history as the first black female principal dancer in the American Ballet Theatre. Along the way, she signed an endorsement deal with Under Armour, and in 2017 was among the brand’s sponsored athletes who spoke out on social media after founder Kevin Plank called President Trump “a real asset for this country.”Amid the pandemic, with theaters closed, she has focused on social activism and her charity effort Swans For Relief, which has raised nearly $300,000 for dancers in financial need.Now Copeland tells Yahoo Finance that the national racial justice protests in the wake of the killing of George Floyd in Minneapolis police custody created a “perfect storm” and a moment that she’s never seen in her career.“For me, it's the first time, in my position, that I feel like I'm truly being heard,” she says. “And to me, that's a step. You know, this has been my life's work as a dancer: speaking about racism in the world, and in ballet, speaking about the lack of diversity. And to have my company, to have the ballet world listening, and to have different panels to speak about this—in a way that I have before, but again, for the first time, people are really seeing it. And I think that’s what's different about this time, is that I feel like we have true allies and people from other communities and races that we've not had before.”LOS ANGELES, CALIFORNIA - JANUARY 26: Misty Copeland performs onstage during the 62nd Annual GRAMMY Awards at Staples Center on January 26, 2020 in Los Angeles, California. (Photo by Kevork Djansezian/Getty Images)Copeland also discussed why the pandemic has hit professional dancers so hard: it is an art form that happens in live performances, and not one that is, at first glance, very conducive to going virtual.But Copeland thinks the dance world can change that and even modernize, if it seeks to innovate post-pandemic.“We're very physical people,” Copeland says. “I mean, we spend hours at a time partnering one another in a very intimate environment. So to be yanked out of that, and not have that personal human connection, I think is a bit shocking emotionally, psychologically... There's no way of making money right now when the theaters are shut down... I think in the long run, the dance world is going to learn from this, because we've never really been pushed to have a virtual presence. This is an opportunity for us to step back and take a look at all of these things that are very old and very traditional, that we need to kind of reassess and revamp. And I think that our digital presence, this is the time that we need to be really venturing into those spaces and learning how to do it and how to change all of these restrictions that in the end, are only hurting us.”Story continues—Daniel Roberts is an editor-at-large at Yahoo Finance and focuses on sports business. Follow him on Twitter at @readDanwrite.Read more:NASCAR's only black driver Bubba Wallace changed the sport forever in 2 daysReebok ends its CrossFit sponsorship over CrossFit CEO's tweet about George FloydNike is setting the tone for sports brands in its response to the George Floyd protestsDrew Brees on potential return of NFL kneeling protests: 'I will never agree with anybody disrespecting the flag'George Foreman III: Pandemic will change the boxing business foreverEvery pro sports league’s current plan to return from coronavirus lockdown"}]}