{"article": [{"url": "https://finance.yahoo.com/news/u-retail-sales-increased-less-123308802.html", "published": 1600250120.0, "headline": "U.S. Retail Sales Rebound Slows After Extra Jobless Aid Lapses", "body": "(Bloomberg) -- The rebound in U.S. retail sales slowed by more than expected in August as federal relief for jobless Americans and small businesses dried up and the pandemic continued to weigh on activity.The value of overall sales increased 0.6% after a downwardly revised 0.9% increase the prior month, Commerce Department figures showed Wednesday. The median estimate in a Bloomberg survey of economists called for a 1% advance.So-called control group sales, which exclude food services, car dealers, building-materials stores and gasoline stations, fell 0.1%, also missing forecasts. The measure is often considered more reflective of underlying consumer demand.With many more stores and restaurants now open, the initial boost in spending driven by reopenings is moderating. At the same time, the expiration of the supplemental $600 weekly payments at the end of July as well as slowdowns in back-to-school spending likely weighed on retail activity during the month.Those benefits bolstered incomes during the pandemic, and without them, millions of unemployed Americans will have significantly less cash to support the nation’s retailers. Meanwhile, federal support for small businesses is running dry with the Paycheck Protection Program closing in early August. Lawmakers appear increasingly unlikely to approve additional stimulus until after the election, despite still-elevated joblessness.“These are disappointing numbers, and they’re probably a hint of what’s to come in the wake of the ending of enhanced unemployment benefits,” Ian Shepherdson, chief economist at Pantheon Macroeconomics, said in a note. “The key story here is that momentum has faded, but sales continue to rise.”Stocks rose as investors waited for the outcome of the Federal Reserve’s policy meeting later Wednesday, while Treasuries edged up and the dollar slipped.With total retail sales data above pre-pandemic levels, the data underscore a shift in where consumers are spending their money. Some categories, like restaurants and clothing stores, are still below year-ago levels. Meanwhile, purchases at nonstore retailers are up 22.4% from August of last year.Story continuesThe BreakdownNine out of 13 major categories increased in August, led by restaurants, clothing stores and furniture outlets. Receipts at motor vehicle and parts dealers posted a modest gain, while sales at nonstore retailers barely improved. Sporting goods and hobby stores posted the biggest percentage decline from the prior month and receipts at department stores weakened. Grocery store sales fell as well.What Bloomberg’s Economists Say:“Retail sales posted a modest increase in August, but with the Census Bureau making a larger-than-usual adjustment to the raw data, the results may have overstated consumer demand in the period. Referring to the impact of the pandemic, the agency cited its ‘effort to ensure that the published seasonally adjusted values fully include any immediate effects.’ Had the Census Bureau used a more ordinary technique, the reported data would have been “closer to zero.””-- Yelena Shulyatyeva, Eliza Winger and Andrew HusbyRead the full note here.On a non-seasonally adjusted basis, total retail sales declined in August from the prior month. In the previous four years, unadjusted total sales increased from July to August.Retail sales don’t capture all consumer spending though, and the pandemic continues to have a clear impact on services outlays. While the value of retail receipts exceeded February levels back in June, personal consumption -- which includes spending on goods and services -- was still below its pre-pandemic level in July, the latest available data. The Commerce Department will release the August figures Oct. 1.Another factor to keep in mind is the Lost Wages Assistance program. That’s the program President Donald Trump authorized in early August to temporarily offset part of the income gap unemployed Americans faced after the expiration of the extra $600 in weekly benefits. However, rollout of the program has been patchy across states.Meanwhile, a separate report out Wednesday morning showed a gauge of builder sentiment rose to a record high in September. The housing market continues to be a bright spot of the economy as low mortgage rates fuel demand.(Adds Bloomberg Economics’ reaction, further detail)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}