{"article": [{"url": "https://finance.yahoo.com/news/now-average-americans-can-invest-in-real-estate-through-jamestown-invest-startengine-partnership-173353789.html", "published": 1595248880.0, "headline": "Now average Americans can invest in real estate through this new partnership", "body": "StartEngine, which claims to be the largest equity crowdfunding platform in the U.S., is about to start offering real estate investment opportunities, in addition to its startup and early-stage company investment offerings.The crowdfunding giant, which has facilitated over $150 million in investments since 2015, will partner with Atlanta-based real estate investment firm Jamestown Invest to offer private equity real estate. Investors with at least $2,500 can claim a stake in Jamestown Invest’s portfolio of urban properties, including Southern Dairies, a historic five-building, 79,000-square-foot office campus in Atlanta.“We are connecting ordinary people to opportunities they wouldn’t have otherwise,” said Howard Marks, co-founder and CEO of StartEngine, explaining that the traditional vehicle for real estate investment, REITs (Real Estate Investment Trusts), don’t offer the asset classes wealthy investors have access to in the private equity market.“We are connecting ordinary people to opportunities they wouldn’t have otherwise,” said Howard Marks.The collaboration is part of a larger trend toward micro-investment in private equity real estate, especially among millennials. Other crowdfunding apps like Compound also facilitate investments in private equity, but the StartEngine-Jamestown collaboration is the biggest real estate crowdfunding opportunity yet, the companies said.“Millennials and Gen Z are maturing into active investors. They’re digitally native and proficient in ways that create opportunities — and require investment vehicles, managers and platforms to become more calibrated to the way they [young people] want to invest,” said Michael Phillips, principal and president of Jamestown, the parent company of Jamestown Invest.The collaboration also takes advantage of a wave of new investors during the pandemic. In the second quarter, StartEngine more than doubled the value of investments on its platform, adding 30,000 new investors, said Marks. The rising interest mirrors the rise of Robinhood, a California-based democratized investment app, which gained over 3 million funded accounts in 2020, according to its most recent blog post on May 4.Story continues“You could argue it’s the worst time to be investing, but it turns out it’s not — it’s one of the best times. During the pandemic, people are making investments and diversifying,” said Phillips. “The coronavirus has accelerated the use of technology in the choices we make today… All of this is an acceleration of trends that were happening already.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:How office leasing fared during the coronavirus pandemic: exclusive dataFormer MGM CEO Jim Murren lists desert mansion for $10.5 million22 million Americans delayed buying a home during the coronavirus: Bankrate"}]}