{"article": [{"url": "https://finance.yahoo.com/news/u-existing-home-sales-near-140752895.html", "published": 1600766120.0, "headline": "U.S. existing home sales approach 14-year high; prices scale record peak", "body": "By Lucia MutikaniWASHINGTON (Reuters) - U.S. home sales surged to their highest level in nearly 14 years in August as the housing market continued to outperform the overall economy, but record high home prices could squeeze first-time buyers out of the market.The report from the National Association of Realtors confirmed home sales had recovered after slumping when the economy almost ground to a halt as businesses were shuttered in mid-March in an effort to slow the spread of COVID-19.Demand for housing is being fueled by record-low mortgage rates and a pandemic-fueled migration to suburbs and low-density areas in search of more spacious accommodation as many people work from home. Federal Reserve Chair Jerome Powell told a congressional panel on Tuesday that the economy has shown \"marked improvement\" since plunging into recession in February, though the path ahead remains uncertain.\"The housing market has continued its remarkable recovery amidst an otherwise fraught economy that has been battered by the pandemic,\" said John Pataky, executive vice president at TIAA Bank in Jacksonville, Florida.\"However, we should continue to be paranoid about the sustainability of sales. With lack of housing supply, there is an upward pressure on home prices which threatens to detract the benefits accrued from low mortgage rates.\"Existing home sales increased 2.4% to a seasonally adjusted annual rate of 6 million units last month, the highest level since December 2006. August's increase in homes sales, which marked three straight months of gains, was in line with economists' expectations.The median existing house price jumped 11.4% from a year ago to a record $310,600 in August. Sales last month were concentrated in the $250,000 to $1 million and over price range, with transactions below the $250,000 price band down sharply.Existing home sales, which account for the bulk of U.S. home sales, jumped 10.5% on a year-on-year basis in August.Story continuesThe PHLX housing index increased more than 1.5%, outpacing a broadly firmer U.S. stock market. The dollar rose against a basket of currencies. U.S. Treasury prices were down.TIGHT INVENTORYThough the coronavirus crisis has left nearly 30 million people on unemployment benefits, joblessness has disproportionately affected low-wage workers in the services sector, who are typically young and renters.Home sales rose in all four regions last month. Demand for housing was skewed toward single-family homes as people sought larger spaces for home offices and schooling. The NAR reckons the migration to suburbs from city centers could become permanent even if a vaccine is developed for the respiratory illness.Single-family home sales advanced 1.7% in August. While multi-family home sales increased 8.6%, they accounted for 10.5% of sales, down from the 12% that is considered the norm for the housing market.The 30-year fixed mortgage rate is around an average of 2.87%, according to data from mortgage finance agency Freddie Mac. A persistent shortage of homes for sale and August's double-digit house price inflation growth are red flags.The shortage is concentrated in the single-family housing segment. Though single-family builders' confidence hit a record high this month and permits for single-family home construction jumped in August to their highest level since May 2007, the supply squeeze is unlikely to ease as fires in the West have boosted lumber prices.There were 1.49 million previously owned homes on the market in August, down 18.6% from a year ago. At August's sales pace, it would take 3.0 months to exhaust the current inventory, down from 3.1 months in July and 4.0 months a year ago.A six-to-seven-month supply is viewed as a healthy balance between supply and demand.\"The 11% gain in prices is far above income growth and threatens overall affordability especially for first-time buyers,\" said Joel Kan an economist at the Mortgage Bankers Association in Washington. \"It's clear that more inventory is needed to keep home prices from rising too quickly.\"Last month, houses for sale typically stayed on the market for 22 days, matching July, but down from 31 days in August 2019. Sixty-nine percent of homes sold in August were on the market for less than a month. According to the NAR, realtors were reporting multiple bids for houses on the market.First-time buyers accounted for 33% of sales in August, down from 34% in July 2020, but up from 31% in August 2019. Individual investors or second-home buyers, who account for many cash sales, bought 14% of homes in August. All-cash sales accounted for 18% of transactions.(Reporting by Lucia Mutikani; Editing by Paul Simao and Andrea Ricci)"}]}