{"article": [{"url": "https://finance.yahoo.com/news/americans-are-growing-concerned-about-losing-their-jobs-ny-fed-171543886.html", "published": 1600086200.0, "headline": "Americans are again growing concerned about losing their jobs: NY Fed", "body": "Americans are again fearful of losing their jobs, according to a survey from the Federal Reserve Bank of New York released Monday.For the month of August, the average respondent in the New York Fed’s survey of consumer expectations said there was an 18.0% chance of losing their job in the next 12 months. That figure is a noticeable increase from the 16.0% chance reported in July and marks the second consecutive month of job loss concerns rising.The New York Fed said worries over becoming unemployed were more pronounced among those without a college degree (21.3% perceived chance) and those with a household income below $50,000 a year (24.9% perceived chance).People line up outside a Kentucky Career Center hoping to find assistance with their unemployment claim in Frankfort, Kentucky, U.S. June 18, 2020. REUTERS/Bryan WoolstonThe trend marks a reversal of labor market optimism over the course of the summer. The average perceived probability of losing work fell to 15.0% in June. Following a spike in U.S. COVID-19 cases in late June and early July, economic data pointed to a slowing of the recovery in the labor market.Jobs reports through the summer have shown a resurgence of job gains after over 22 million Americans were laid off as businesses shut down to stop the spread of the virus. But the pace of those job recoveries has slowed, and the level of nonfarm workers as of August remains about 11.5 million below pre-pandemic levels.The New York Fed's survey of consumer expectations shows that the mean perceived probability of losing one's job rose to 18.0% in August.The Federal Reserve is paying close attention to the labor market as it heads into its next policy-setting meeting, taking place September 15 and 16. The central bank recently unveiled a new framework detailing a new emphasis on “the shortfalls of employment from its maximum level,” suggesting the Fed would wait longer when observing labor market recoveries before raising rates.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Lower-for-longer rates from the Fed point to a weaker-for-longer dollarSenate GOP sends mixed messages on need for Federal Reserve emergency loansFed Chair Powell: Wearing masks can lead to 'enormous' economic gainsFederal Reserve: We got it ‘wrong’ on post-crisis rate hikesA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}