{"article": [{"url": "https://finance.yahoo.com/news/stock-market-6-july-ftse-cac-dax-dow-sp-nasdaq-coronavirus-covid-19-074145387.html", "published": 1594003760.0, "headline": "Global stocks buoyed after government-backed rally in China", "body": "Asian markets rallied overnight. Photo: Vincent Yu/APStock markets around the world rose on Monday, taking a cue from surging Chinese markets.In Europe, the FTSE 100 (^FTSE) closed up 2%, while the DAX (^GDAXI) rose 1.6% and the CAC 40 (^FCHI) gained 1.5%.It came after a strong session in Asia overnight, particularly in China. Hong Kong’s Hang Seng index gained 3.7% (^HSI), the Shanghai Composite rose 5.8% (000001.SS), and the Shenzen Component (399001.SZ) climbed 4.1%. Japan’s Nikkei (^N255) rose 1.8%.“Those moves are being attributed to positive commentary on the stock market from Chinese state media, namely a front-page editorial in the Securities Times which suggested that a ‘healthy’ bull market after the pandemic is now more important to the economy than ever,” Jim Reid, a senior strategist at Deutsche Bank, wrote in a morning note to clients.READ MORE: Banks brace for £10bn hit as job losses increaseThe momentum in Asia and Europe helped propel Wall Street to a positive open. Shortly after European borses closed, the S&P 500 (^GSPC) was up 1.4%, the Dow Jones Industrial Average (^DJI) had gained 1.3%, and the Nasdaq (^IXIC) climbed 2.2%.It came despite Goldman Sachs downgrading its third quarter growth forecasts for the US economy and a continued rise in COVID-19 infections across the country.Sebastian Galy, a macro strategist at Nordea, said investors should “worry” about the “government sanctioned rally in China” supporting global markets.“The last phase of a rally is one of euphoria with blinders on dismissing negative data,” Galy wrote in a note to clients.“This optimism and economic recovery are aiding investors to overcome their fears about the resurgence of the coronavirus wave across the US and around the globe,” said Naeem Aslam, chief market analyst at Avatrade.In London, housebuilders topped the FTSE 100 after a report in the Sunday Times that UK chancellor Rishi Sunak is considering raising the threshold for stamp duty — a tax on property transactions — in a bid to kickstart growth.Story continuesBarratt Developments (BDEV.L) was the best performer, ending up 7.9%. The company put out a positive trading update on Monday saying it had seen “high customer interest levels” since reopening its sales centres. Forward orders are now ahead of where they were this time last year and chief executive David Thomas said the company was proceeding with “cautious optimism”.READ MORE: Sunak mulls handing out £500 vouchers to boost spending Rival house builders Persimmon (PSN.L) rose 6.1% and Taylor Wimpey (TW.L) climbed 5%. The sector was scored another boost after data pointed to a “strong rebound in UK construction”.Retailer Next (NXT.L) rose 1% and JD Sports (JD.L) added 3.3%. The Guardian reported over the weekend that Sunak is also considering giving Brits a one-off £500 voucher to spend in parts of the economy hardest hit by the COVID-19 shutdown, including physical retail.Boohoo (BOO.L) ended down 23% following reports of illegal working conditions at factories that supply it. The company has said it is investigating the matter."}]}