{"article": [{"url": "https://finance.yahoo.com/news/we-need-to-make-sure-young-men-dont-become-addicted-to-online-stock-trading-nyus-galloway-says-164708258.html", "published": 1598442920.0, "headline": "NYU professor: Make sure young investors 'don't become addicted' to online stock trading", "body": "With retail trading on an upswing, younger investors are at risk of getting “addicted” to online trading, NYU Stern business school professor and entrepreneur Scott Galloway told Yahoo Finance, as he urged investing apps to do more to contain the fallout.Read more: Here's what to consider before getting into day tradingGalloway attributed part of Tesla’s (TSLA) meteoric rise to the buying influence of “mostly young men, mostly spending their stimulus checks, levering up their purchases and juicing the stocks.”There are many great things about the internet and tech, Galloway told “On the Move,” but the focus on shareholders over the greater good has resulted in some collateral damage.“We’re at that point with trading,” he said.Galloway pointed to the tragic story of a young 20-year-old Robinhood trader named Alex Kearns who died by suicide after mistakenly thinking he was down hundreds of thousands of dollars while trading with options.“Like a lot of parents with young boys, I was rattled by the suicide of Alex Kearns,” Galloway said. But though Robinhood has taken steps in response, it’s not enough, the academic said.“They haven’t done anything to deprogram some of the addictive features built into this app, taking a page out of the endless scroll, taking a page out of the random rewards Facebook and Instagram offer,” Galloway said.Galloway said he loves online trading, and that fact that it has made it possible for anyone to get involved — he himself says he started investing at 13 with $200 from his mom’s boyfriend. But the straight-talking professor is concerned about what Robinhood is doing -- and his worries have prompted him to invest in a competitor called Public.The entrepreneur and professor said he has invested in the app, which is similar to Robinhood but a healthier version, in Galloway’s view.It has a \"financial literacy\" component that prioritizes education, and Galloway plans to do some seminars) as well as a social media platform for investing. Similar to Robinhood, it has commission-free trading and fractional share ownership, making it possible for someone to buy just $5 worth of a stock.Story continues“No options, no margin trading, 40% female investors who tend to be more long-term,” he said. “I think big tech is a wonderful thing, but I think with online trading we have an opportunity to go in very early and say, ‘how do we ensure young men do not become addictive and lead to mental health issues?”Galloway may be stumping for Public, but he also railed against trading too much -- something others have accused Robinhood’s users of doing. Generally, Galloway said that trading more leads to worse results.But the young company Galloway is backing may see headwinds as other more long-term-focused investing platforms like Vanguard, Fidelity, and robo advisors Betterment, and Wealthfront also prioritize education, risk management, and the big picture. Many banks even allow customers to buy stocks these days.According to Galloway, Public has a similar feel to Robinhood — that tech, user friendly feel that gets people comfortable. But Galloway sees it as something that isn’t mutually exclusive with responsibility.“How do we get the great taste without some of the calories,” the professor mused. “Public is trying to be the good guy in the [retail trading] space.”—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.How a stock gets added to the Dow Jones Industrial Average'A really tough spot' for employees: How companies are enforcing mask complianceCoronavirus has hurt the credit card businessYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteranMost companies plan to give raises and bonuses in 2021: surveyThe key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right now"}]}