{"article": [{"url": "https://finance.yahoo.com/news/why-joe-biden-still-has-work-to-do-to-catch-up-to-trump-on-the-economy-175816367.html", "published": 1597928780.0, "headline": "Why Joe Biden still has ‘work to do’ to catch up to Trump on the economy", "body": "In recent months, Joe Biden has consistently led President Trump by most polling measures with one big glaring exception: how he’d handle the economy.The former vice president came close in July. An analysis by Yahoo Finance found a range of nationwide polls that month which asked some version of the “who do you trust to do a better job on the economy” question.Biden was ahead or tied with Trump in almost all of them. A July 19 Fox News poll had it at 44% for Biden and 43% for Trump (within the margin of error). A July 15 Quinnipiac poll gave Biden a “slight lead” on the issue: 50% to 45%. All that after Trump had built his re-election campaign largely around his economic acumen. Other polls found similar results with the two candidates often tied on the economy (each outfit asks the question a bit differently).Fast forward to this month. Biden has maintained his edge on who people say they’ll actually vote for but the gap has narrowed and that shift has been the most pronounced on economic questions.An Aug. 17 CNN poll made waves showing the Biden/Harris ticket with just a 4-point lead overall. It also showed a clear deficit for Democrats on the economy. Trump led by 8 points – 53% to 45% – when respondents were asked about the economy and which candidate “would better handle that issue if they were elected President.”Former vice-president and Democratic presidential nominee Joe Biden at the end of the third day of the Democratic National Convention. (OLIVIER DOULIERY/AFP via Getty Images)Other recent polls have been similar with Trump leads on the economy ranging from 2 points to 3 points to as high as 10 points in recent days.“It's definitely an important piece of work to do,” Neera Tanden, president of the Center for American Progress, said in a Yahoo Finance interview this week. Tanden says her party’s convention “is a real opportunity for a lot of speakers to describe why a Biden-Harris administration will actually improve the country and improve the economy and keep people's public health safe.”In response to questions about the president’s rebound on the economy, the Trump campaign’s deputy national press secretary, Courtney Parella, pointed to “three straight months of record job growth with 9.3 million jobs created in just three months.” Prior to the gains in May, June, and July, employers cut 20.5 million jobs as the pandemic took hold.Story continuesParella added that Biden “embraces the far-left’s socialist manifesto” on things like taxes and China.‘COVID is the economy and the economy is COVID’The Democrats Wednesday night’s convention program included a section on “a more perfect economy,” capped off by a speech from Sen. Elizabeth Warren. The Democrats allocated a sizable chunk of the 10 p.m. hour to the issue, although Thursday’s headlines have largely been reserved for the speeches that followed from Barack Obama and Kamala Harris.Jim Kessler, executive vice president for policy at the center-left group Third Way, told Yahoo Finance that the polling deficit can be overcome. “I'd say my advice to Democrats is: COVID is the economy and the economy is COVID,” he said. “You just would have to tie those two things together at all times.”The coronavirus question is clearly better terrain for the Biden campaign. The CNN poll mentioned above – which found Trump ahead on the economy – showed the president down by 9 points (43% to 52%) when the same respondents were asked who would better handle the response to the coronavirus outbreak. Other polls have shown similar Biden advantages.“We have a demand problem in the economy right now,” Tanden said. “The first step is to get the virus contained.”President Donald Trump awaits the arrival of Iraqi Prime Minister Mustafa Al-Kadhimi outside the West Wing on Thursday. (Chip Somodevilla/Getty Images)The questions of ‘issue ownership’Polling experts often talk about the concept of “issue ownership,” which boils down to the different issues that voters typically associate with a party.Democrats traditionally take ownership when the questions turn to things like the social safety net, health care, and whether the candidate “cares about people like you.” Biden has commanding leads on all these fronts.Republicans traditionally take ownership when the topics turn to law and order, security, and the military. Trump – like most Republicans – is indeed polling stronger on these issues, if not ahead in many cases.Some polling experts think of economic questions as a traditional GOP strength but it’s far from universal in recent history.“Go back and look at Bill Clinton,” said Robert Shapiro, a polling expert and professor at Columbia University. Clinton oversaw a booming economy and considerable support from voters on the economy.On Trump, he said, “people are differentiating his misbehavior, his bad choice of words, his bullying and so forth, and they separate that out from this performance on the economy.” That's why “he's always been doing better on the economy than in general.”Trump’s economic numbers have rebounded in August, but the improvement – so far at least – has not been enough to pull him too much closer to Biden on the horse race numbers.RealClearPolitics shows a Biden lead in every national poll since April, and currently gives him a 7.6-point edge over Trump on who people say they’re planning to vote for.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Biden's tax plan: Eyes on the 1% and corporations like AmazonTerry McAuliffe on why ‘business should be happy that Joe Biden is coming in’Michigan’s governor on whether Biden has her state sewn up: ‘I don't buy it for a second’Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}