{"article": [{"url": "https://finance.yahoo.com/news/medical-science-workers-brace-for-election-day-in-the-shadow-of-covid-19-105357347.html", "published": 1601791280.0, "headline": "Doctors, scientists get political as COVID-19 swamps US: 'Public health is on the ballot'", "body": "The wrenching coronavirus crisis — which has now claimed the leader of the free world as its highest-profile victim — has elevated the profiles of scientists and doctors during an unprecedented period of uncertainty.It’s been less than a year since COVID-19 cast its shadow across the global economy, turning masks and social distancing into household words. As of Sunday, nearly 35 million have been sickened worldwide and over 1 million dead — the highest toll being in the world’s largest economy.In the intervening months, doctors and scientists have taken on the mantles of heroes, spokespeople, polemicists, and unlikely activists — with many becoming more vocal in ways they haven’t before, even as many lament the politicization of science.Now that President Donald Trump and numerous people within his orbit have contracted COVID-19, health experts are mulling how the crisis will shape the president’s stance about scientific matters, which are guiding his recovery, and how that may play out on Election Day.“Now, we’re in a situation where, for the first time in any of our lives...public health is on the ballot,” said Dr. Howard Forman, a radiologist, Yale University professor and health policy expert. “It’s impossible not to see that.”Prior to his shock disclosure on Friday, Trump was notoriously dismissive of policies designed to mitigate the virus’ spread, with politics informing his response to the pandemic. The president’s disposition has been widely criticized for informing the government’s response, which has been characterized by fumbled efforts to test, contact trace, and encourage widespread adoption of masking and social distancing.There are over 34 million cases worldwide. (Graphic: David Foster/Yahoo Finance)The federal government “has failed to lean on scientific leaders to manage the crisis; and it has not provided consistent, coordinated evidence-based messaging for the public,” Dr. Esther Choo and Dr. Aaron Carrol wrote in Lancet medical journal — underscoring how a normally staid and neutral industry has increasingly taken public officials to task.Story continues“This response would have been terrible under any circumstance, but...the USA has entered a perfect storm, the threat from which has universal reach,” the authors wrote. “From a health perspective, the upcoming U.S. election could be the most consequential in our lifetimes.”Even if Trump’s illness does change his position, the practical effects could be too late. Experts say the administration has badly undermined public confidence in the top health agencies, in the process galvanizing health and science experts to push back.Dr. Rob Davidson, a rural Michigan emergency room doctor and director of the Committee to Protect Medicare, said that health professionals have been more engaged in the political process in recent years — thanks to reforms like the Affordable Care Act.However, the federal response to the coronavirus outbreak crossed a line in the sand for many — in particular, the increased politicization of mask wearing. A growing number of public health and elected officials have called out mixed messages from the Centers for Disease Control and Prevention (CDC), which some have criticized as captive to the whims of the White House.“We always just assumed that if something like this were ever to come to pass one of the most respected public health entities in the world, the CDC, would be the shining beacon of truth,” said Davidson, a former Democratic Congressional candidate.However, the agency’s credibility — as well as that of the World Health Organization — has seen been badly diminished amid the crisis.Science, medicine get politicalThere are over 7.2 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)A recent decision by a few politically vulnerable Republican senators to lend support to a Democrat-led effort to oppose the Trump administration’s challenge of Obamacare symbolized how political health care has become.It’s just one reason why there was a rush of medical professionals running for Congress in the primaries, and why the Scientific American endorsed Democratic nominee Joe Biden, the publication’s first time doing so in its 175-year history.“This year we are compelled to do so. We do not do this lightly,” the editors wrote.Although similar efforts were seen in the lead-up to Barack Obama’s election in 2008, when insurance reform was a call to action, Yale’s Forman said this time is different.“It’s less partisan. There are a lot more physicians out there who would identify as Republican who will vote for Biden because they realize that’s the only option,” Forman said. “It’s an energized group right now.”‘Misinformation and disinformation’NEW YORK, UNITED STATES - 2020/10/02: Protesters wearing face masks gather in Times Square as they take part during the demonstration. Demonstrators gather in Times Square to demonstrate against the shooting of Roxanne Moore, a transgender woman. According to the Pennsylvania police, Moore a mentally ill woman, was shot 16 times while brandishing a gun in public. (Photo by John Lamparski/SOPA Images/LightRocket via Getty Images)Trump’s highly criticized response to the pandemic, which at various times saw the administration try and control the narrative at the expense of undermining the CDC, WHO and the U.S. Food and Drug Administration (FDA) — has been damaging to the health and science sectors, experts say. It’s also undermined the U.S.’s ability to get a handle on rising infections.“Right now we see deliberate misinformation and disinformation coming from, unfortunately, federal leadership, around science,” said Yahoo medical contributor Dr. Dara Kass.However, Forman credited some of Trump’s actions, such as halting cruise travel, funding vaccine research and backing Congress’ stimulus bills.Even if those initiatives haven’t been perfect, “it’s not like he’s gotten everything wrong. His behavior is probably the biggest challenge,” Forman said — especially on masking.The polarized environment has encouraged many professionals to pick sides. Doctors for Biden, a grassroots voluntary group of health and medical experts, represents a cross-section of Democratic, Republican and Independent members.The group’s organizers are largely the same as those who participated in Doctors for Obama, which helped push for the ACA.Another grassroots group, Doctors Organized to Communicate Science (DOCS), is focused on providing fact-checking and evidence-based information to battle misinformation through social media. The organization is an offshot of the Committee to Protect Medicare.Dr. Farhan Bhatti, a Michigan doctor who leads DOCS, said that “in order to save lives and do our jobs in the best way we can do them, we need to help protect the health of the public. Doctors have been forced to come out of their comfort zones and do something like this.”The scientific process itself is based on constantly learning new information to help with decisions, Bhatti said. It’s why recent retractions seen in medical journals for high profile issues, like taking hydroxychloroquine as a treatment, are fairly routine — but are now being amplified by a highly-charged, polarized environment.A journal retraction “means it’s more trustworthy because as more data comes that disproves it, scientists have no ego,” Bhatti said.“But in politics, people might have a belief and dig deeper..regardless of the fact that facts on the ground change over time,” he added, a point also echoed by Dr. Anthony Fauci, the well-respected director of the National Institute for Allergy and Infectious Diseases.Racial disparitiesThe current moment extends beyond the election cycle. Some physicians are also moving to influence public health debates that impact minorities, which have been disproportionately impacted by the COVID-19 crisis.Social determinants of health, the idea that your home environment, education and income level affect your health, has gained popularity amid the pandemic, as studies have shown minorities are disproportionately affected.It’s why Dr. Michael Williams, a surgeon and professor at the University of Virginia in Charlottesville — who previously avoided comments in public spaces — has become far more vocal on platforms like Twitter.“You can’t solve for redlining with chemotherapy,” Williams said, referring to unfair housing practices that have resulted in minority-majority neighborhoods with unhealthy living conditions. Those factors contribute to greater co-morbidities that put minorities at a higher mortality risk from illnesses.The erosion of minorities’ trust in the health system has spurred the National Medical Association (NMA), which represents Black doctors, to create a task force that will assess COVID-19 vaccine data, and help assuage mistrust about any approved vaccine.Dr. Uché Blackstock, a Yahoo medical contributor, said the move from NMA signals just how serious the issue is, and that Congress should tap the medical community to set better health policy.‘Playing the long game’Despite stress, burnout and frustration in having to battle the federal government and a deadly pathogen, doctors are meeting the moment. Dr. Pritesh Gandhi, who ended a tough race for a Congressional seat in Texas, told Yahoo Finance he believes the movement will last beyond the election this year.“We are playing the long game here. It may not convert into votes in 2020, and that’s OK,” Gandhi said.“What the last few years have demonstrated is that it is going to take a cross-section of American people to make gains,” he added, one that will be nonpartisan.“I don’t see a patient has a Republic sore throat or Democratic sore throat,” Gandhi said.Kass said a better cross-section of America is needed in Congress, and “physicians and other scientists running for office is a trend I hope to continue to see.”More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}