{"article": [{"url": "https://finance.yahoo.com/news/july-looming-economic-risk-enhanced-unemployment-benefits-morning-brief-101139856.html", "published": 1592284760.0, "headline": "July's looming economic risk: Morning Brief", "body": "Tuesday, June 16, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThe end of enhanced unemployment benefits is a turning point for the recovery.Slowly but surely, the U.S. economic picture is becoming clearer.The Federal Reserve last week suggested the worst of this economic crisis may be behind us.After shedding a record number of jobs in April, the economy added more than 2.5 million jobs last month. Retail sales data for May due out later this morning are expected to rise 8% after a record decline of 16.4% in April.And while the economy may not be roaring back to life to the degree implied by the stock market’s recent rally, progress is indeed being made.But in just six weeks, the most significant part of the $2 trillion CARES Act passed back in March will roll off the books when enhanced unemployment benefits expire.Last month, we highlighted work from economists at Goldman Sachs who circled this July 31 deadline as a potential risk to the recovery.And in a note to clients published Monday, Andrew Hunter at Capital Economics covered a similar theme, writing that “the potential expiry of the expanded $600 weekly unemployment insurance payments at the end of July could weigh on consumption.”Hunter notes that data from the Bureau of Economic Analysis shows personal incomes rose by some $132 billion in April as a result of these enhanced benefits. And in the firm’s view this likely understates the benefit to incomes seen in May as a backlog of unemployment claims were process.Data from Bespoke Investment Group published back in March outlined that when combined with the $1,200 stimulus check sent out as part of the CARES Act any household making less than $55,000 would receive more than all of their lost wages as a result of enhanced unemployment benefits.And so the expected rebound in consumer spending in May and encouraging trends seen so far in June were, of course, the point of this program. As Bespoke wrote back in March: “that's why this bill is ‘stimulus’; it's trying to encourage consumer spending.”Story continuesThese unemployment benefits and stimulus were also designed to keep workers at home. Stemming the spread of the coronavirus while keeping American workers afloat is what was needed back in March. And at least economically, this strategy appears to have worked.But at this stage in the recovery, some worry these benefits may keep employees needed to kickstart businesses now allowed to re-open on the sidelines.A sign stands outside the Department of Labor's headquarters in Washington. (AP Photo/Patrick Semansky)As Hunter wrote Monday, “There is also a risk that maintaining unemployment benefits at their current expanded level for too long could hold back the labor market recovery.”In the Fed’s latest Beige Book there were no fewer than a dozen references to employment benefits leaving workers with more take home pay than their typical wages.In the Atlanta Fed’s district, for example, “Several employers noted concern that the generosity of unemployment benefits may make it difficult to attract workers once demand improves especially among lower paid jobs.” In the St. Louis Fed’s district, “Contacts reported that reopening firms were limited by labor shortages, which they ascribed to increased unemployment benefits,” among other concerns including health and childcare demands.The balance, then, between bringing workers back and keeping cash-strapped consumers afloat will be a challenging one for Congress to strike next month.“With unemployment likely to remain elevated and the election only a few months away, it would be a surprise if the expanded payments were allowed to lapse entirely,” Hunter writes, adding that partial extensions which set benefits lower, tapering these benefits off over time, or linking them to wages are all possibilities.And while finding this right balance of support in hard times and incentive to go back to work is a challenge, considering the severity of the downturn and the economic shock endured this spring these are good problems to have.“The next round of [stimulus] measures won’t be as impressive as the first, and the unexpectedly positive May employment report may have further dissuaded some lawmakers of the need for another big stimulus,” Hunter writes.“But it’s hard to put too negative a spin on evidence that shows the economic recovery began sooner than most had previously assumed.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Retail Sales Advance month-on-month, May (+7.4% expected, -16.4% in April); Retail Sales excluding Autos month-on-month, May (+5.5% expected, -17.2% in April); Retail Sales excluding Autos & Gas month-on-month, May (+4.0% expected, -16.2% in April)9:15 a.m. ET: Industrial Production, May (+3.0% expected, -11.2% in April)9:15 a.m. ET: Capacity Utilization, May (66.8% expected, 64.9% in April)10 a.m. ET: NAHB Housing Market Index, June (43 expected, 37 in May)EarningsPre-marketNotable reports: Lennar (LEN)Post-market4 p.m. ET: Oracle (ORCL) is expected to report earnings of $1.17 per share on $10.85 billion in revenueOther notable reports: Groupon (GRPN)READ MORETop NewsNorth Korea blows up inter-Korea liaison office, raising tensions [AP]Supreme Court endorses gay, transgender worker protections [Reuters]Chesapeake Energy to file for bankruptcy as soon as this week [Reuters]Royalty Pharma IPO poised to raise $1.96 billion or more [Bloomberg]Fed to expand purchases of corporate bonds in secondary market [Yahoo Finance]KKR, former Dean Foods CEO win auction for Borden Dairy [Bloomberg]YAHOO FINANCE HIGHLIGHTSTrump administration 'doubled down on' converting private land for border wall amid coronavirus pandemicHere's every sports league's current plan to return from coronavirus lockdownBurger King's Impossible Croissan'wich goes national — and we tasted it—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}