{"article": [{"url": "https://finance.yahoo.com/news/boston-fed-president-eric-rosengren-yahoo-finance-transcript-september-2020-141908668.html", "published": 1600939640.0, "headline": "Boston Fed President Eric Rosengren speaks with Yahoo Finance [Transcript]", "body": "Eric Rosengren, president of the Federal Reserve Bank of Boston, spoke with Yahoo Finance to discuss fears over a second wave of the novel coronavirus and the Fed’s new approach to inflation.Below is a transcript of his appearance on September 24:-ALEXIS CHRISTOFOROUS: This morning's disappointing jobless claims numbers will certainly be on the minds of Fed leaders today. Chair Jerome Powell is due back on Capitol Hill this morning and our Fd correspondent Brian Cheung is here now with the president of the Boston Fed, Eric Rosengren. Hi Brian.BRIAN CHEUNG: Good morning Alexis, Good morning President Rosengren. How are you?ERIC ROSENGREN: Good morning, Brian. Good to be with you.BRIAN CHEUNG: So I want to chat a little bit about the jobless claims numbers that did come out this morning as Alexis was alluding to. We’re past six months into this pandemic, still over 800,000 turning to jobless claims another over 600,000 when you include gig and contract workers. I guess I'm wondering, you touched on this in a speech yesterday, how far away is the economy from maximum employment and do you worry that structural damage is going to make it hard to get back to 3.5% unemployment?The Federal Reserve Bank of Boston's President and CEO Eric S. Rosengren speaks during the \"Hyman P. Minsky Conference on the State of the U.S. and World Economies,\" in New York, April 17, 2013. REUTERS/Keith Bedford (UNITED STATES - Tags: BUSINESS POLITICS HEADSHOT)ERIC ROSENGREN: I am very worried that we're pretty far away from what we think of maximum employment and I think they're going to be significant headwinds to getting there quickly. So I have a somewhat more pessimistic forecast than my colleagues, that you could have seen from the summary of economic projections, that the FOMC recently put out. They're expecting that the unemployment rate will get below 6% by the end of next year. I'm not expecting that. And some of the headwinds include the problems with re-employing people, so I am worried that many of temporary layoffs are starting to turn to permanent as the pandemic drags on much longer than people expected earlier this year.So I think that's going to be a challenge and particularly the segments of the labor market that are being impacted. So if you think about travel if you think about tourism if you think about restaurants, if you think about retail, those are areas where a lot of payroll employment increased over the course of the summer, but continued progress is really going to require that the pandemic be tamed, to the degree that people can be fully employed people feel comfortable once again going to restaurants and hotels.Story continuesBRIAN CHEUNG: So President Rosengren, part of your more pessimistic outlook as you just said is maybe a second wave of the virus itself. You've also added though that fiscal policy might be the bigger tool in addressing that, if that is the case. In your district - in the northeast of this country - what is the biggest need for fiscal policy at this point is it, state and local government support with the shortfalls that they face? Is it a new round of stimulus checks? What is the need right now?ERIC ROSENGREN: Well, I think the need is in part - we wouldn't need it if the pandemic was under control, but since the pandemic is not fully under control, I think it has to be targeted to those sectors of the economy that's been most impacted by the pandemic. So that's low and moderate income individuals, that is small businesses, and that is state and local government spending. So those are the three areas that I think are going to be most challenged if this pandemic gets worse as we get into the fall and winter. Many epidemiologists are expecting that we're going to have a difficult fall and winter, we'll see if that's true - it partly depends on government actions, it partly depends on personal behavior actions around the country.BRIAN CHEUNG: President Rosengren, what does that mean for the Fed side of things you did say that there could need to be continued monetary stimulus. What might that look like with the Fed already having opened up those liquidity facilities having rates backed up to near-zero? Is that further bond purchases under quantitative easing or maybe even yield curve control?ERIC ROSENGREN: So I think activities like further quantitative easing would be supportive of the economy. I would say that the 10-year Treasury rate is below 70 basis points. We're already well below the lowest level that rates were in the middle of the financial crisis. So while I think it would help to do more quantitative easing, I'm not sure it would be nearly as supportive, for example, as fiscal policy. The other monetary policy tool that we have is the 13(3) facilities. So if we do have a second wave, I think it would be up to the Treasury Secretary and the Board of Governors to decide if that required additional changes to any of our facilities, but that's always an option.BRIAN CHEUNG: While the Fed’s reaction function is you just kind of alluded to, there is now also involving that framework change where the Fed would allow for moderately overshooting the 2% target. But it seems like there's been some confusion this week from Fed speak from your colleagues, that's birthed out of not knowing the time horizon over which you plan on assessing averaging 2%, in addition to the tolerance for how high you'd be willing to let inflation rise. So on both of those things: what is your personal comfort level with regards to the new framework?ERIC ROSENGREN: So I think people are worried about the details and to be honest I'm afraid we're a long way away from being anywhere near our 2% goal. So this is likely to be much more of an issue two or three years down the road. I think the market fully understands that we're not raising interest rates from the zero to 25 basis points that the federal funds is currently trading in for several years. And that's consistent with the forecasts that came out of the summary of economic projections. It's also very consistent with the guidance that we provided. So, exactly how we measure it when we're so far away from where we want to be I think is a secondary concern to just trying to get the economy moving more quickly. And again, I think that requires fiscal policy.BRIAN CHEUNG: And you have caution though that the Fed should wait on raising rates, unless there are other important risks that could become more significant. I took that to mean: financial stability risks. I just want to make sure that I'm reading that correctly. And does that also signal that the Fed could raise rates before you get to maximum employment? I know you said we're a long way away from 2% inflation, but does that mean that it is possible if there would be some sort of financial imbalances arising as a result of this current environment.ERIC ROSENGREN: I think the statement made clear that if there are significant imbalances that would hinder us getting to maximum employment and our inflation goal over time, that there is that caveat that then we would potentially raise interest rates. It would depend on the circumstances at that time. So the hope is that financial stability issues are not that serious and that we’re able to fully keep interest rates low in order to meet our inflation goal that’s set out in the statement. But that caveat i think is important because keeping interest rates low for a long period of time does have consequences.I think we're seeing some of the consequences now of the fact that we had fairly low interest rates, we're seeing problems in commercial real estate, we're seeing leveraged firms that are going into Chapter 11 or Chapter seven bankruptcy. So I think some of the concerns that people have had with corporate leverage and with commercial real estate are going to likely start being one of the headwinds that challenges the economic growth over the course of the next six to nine months.BRIAN CHEUNG: I want to shift now to the Main Street Lending Program. The Boston Fed has really taken the helm on that specific initiative. The message from Chairman Powell and yourself has really been that the Paycheck Protection Program might be better suited to keep those businesses whole because they can be forgiven - something that the Fed’s loans cannot do. But if there's no stimulus package, which kind of looks like those discussions are stalling and therefore no more PPP, would the Fed be open to further adjusting the terms of the program? Or are you pretty insistent that the program is tailored to the needs of the economy for right now and that that's basically it?ERIC ROSENGREN: Well, I think the program is tailored to mid-sized businesses, and if you look at the 30 day report highlighted all the loans that we've made. Most of the loans are in the $1 to $5 million range, there were very few loans at the lower limits of our lending already. So I think one of the challenges is that this program works through banks and for banks to make money on a much smaller denomination loan is very challenging in this program. You probably have to design a very different program than the Main Street Lending Program because there was significant legal documentation and other costs as well. So it's really intended for mid-sized businesses, larger small businesses, a million dollar loan is not all that big, a $500,000 loan is not that big. I think when you start dropping it down to a loan for example at $100,000, I think the challenge is that most banks don't want to do that unless they can do it in a more cost-effective way than through the Main Street program, and they normally require either real estate or personal guarantees from the borrower.BRIAN CHEUNG: Got it, so you're not advocating for lowering it to $100,000 at the moment?ERIC ROSENGREN: I would not- I don't think the Main Street program is particularly well-designed for really small businesses, I think the PPP program is much better designed and I don't think we should let fiscal policy go off the hook just because they're having a political roadblock.BRIAN CHEUNG: Got it. Well that was Boston Fed president Eric Rosengren joining us via the phone thanks so much for stopping by Yahoo Finance today.ERIC ROSENGREN: Good talking with you today.-Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}