{"article": [{"url": "https://finance.yahoo.com/news/movie-theaters-desperate-for-a-lifeline-as-mulan-joins-tenet-in-coronavirus-limbo-150529072.html", "published": 1595672000.0, "headline": "Movie theaters desperate for a lifeline as 'Mulan' joins 'Tenet' in coronavirus limbo", "body": "Following the indefinite delay of Christopher Nolan’s ‘Tenet’ earlier this week, Disney’s live action ‘Mulan’ (DIS) officially followed suit — putting some of Hollywood’s most bankable releases in deep freeze, and leaving desperate movie theaters stuck in limbo.The media giant removed the film from its theatrical release slate with no new date provided — a disastrous blow to theaters which were relying on the $200 million tentpole to revive business and quickly fill seats.AMC, one of the largest U.S. theater chains (AMC), postponed its mid-July reopening plan until mid-to-late August following ‘Tenet’s’ decision. Previously, the chain landed in hot water after it bowed to intense pressure over requiring face masks at reopened theaters.So far, the company has yet to react to ‘Mulan’s’ disappointing postponement. Yet it’s difficult to imagine that theaters can reopen without at least one blockbuster waiting on the other side.Meanwhile, coronavirus cases continue to balloon in several U.S. states as the nation grapples with a second wave. The stark reality has muddled the timeline of when it will even be possible for indoor entertainment venues to embrace the public once again.AMC can’t sustain the lockdown for much longer. Last month, the chain nearly filed for bankruptcy before receiving an infusion of $300 million in debt financing from Silver Lake Partners. That, coupled with the bottleneck of films waiting to air on the big screen, has contributed to an uncertain future.Both ‘Star Wars’ and ‘Avatar’ sequels, for example, have been delayed at least one year due to the myriad of slate changes and production delays.Movie theaters desperate for a lifeline as both 'Tenet' and 'Mulan' delay release dates indefinitelyAt the time of ‘Tenet’s’ announcement, rumors swirled that the sci-fi thriller could bypass the theatrical experience entirely and head straight to a streamer like HBO Max (T). But AT&T CEO John Stankey quickly shot down that theory during an analyst call on Thursday.“Is it going to happen with a movie like ‘Tenet’ or something like ‘Wonder Woman’? I’d be very surprised if that would be the case. In fact, I can assure you with ‘Tenet,’ that’s not going to be the case,” he added.Story continuesHBO Max off to slow start in streaming warsAs the streaming landscape continues to intensify, AT&T gave an update on the subscriber growth of its new service HBO Max — confirming that the platform received 4.1 million total installs in its first month since launch.According to the company, three million new users purchased the app directly from WarnerMedia via online signups, while another one million came from wholesale customers who had access to the app from AT&T wireless packages.AT&T also disclosed that HBO and HBO Max have a combined 36.3 million subscribers, up 5% from the end of 2019.Stankey praised the launch as “flawless” amid the backdrop of the coronavirus pandemic. While he added that customer engagement “exceeded our expectations,” those numbers suggest that the majority of HBO subscribers — who automatically received the HBO Max app for free — did not access its content.As of late June, 4.1 million users activated the HBO Max app, according to AT&TComparatively, it’s clear that the streaming newbie is off to a slow start. Disney+ nabbed 10 million subscribers on day one of its launch, while Netflix (NFLX) added an additional 10 million users just last quarter alone.Still, Netflix executives cautioned that, as the initial shock of the coronavirus pandemic wears off, users are expected to drop. The platform issued disappointing subscriber growth guidance for Q3 — a weary sign as other entertainment subsidiaries are hoping for a lifeline.Alexandra is a Producer & Entertainment Correspondent at Yahoo Finance. Follow her on Twitter @alliecanal8193Read more:A tale of two streamers: Netflix hits a rough patch as Peacock spreads its wingsDisney+'s 'Hamilton' gambit pays off, giving platform a big boost: DataWhy Kim Kardashian's $200M Coty deal might not make her a billionaire (yet)Hollywood plans post-coronavirus restart, but normal won't return 'for a long time'AMC on why it reversed course on face masks: 'We did not go far enough'"}]}