{"article": [{"url": "https://finance.yahoo.com/news/sp-case-schiller-home-price-june-2020-130011375.html", "published": 1598342900.0, "headline": "US home price growth unchanged in June; July new home sales highest since 2006", "body": "U.S. home sale price growth remains stable three months into the coronavirus pandemic. Meanwhile, new home sales hit its highest level in more than 13.5 years in July.Standard & Poor’s said Tuesday that its S&P CoreLogic Case-Shiller national home price index posted a 4.3% annual gain in June, unchanged from May. The 20-City Composite posted a 3.5% annual gain, down from 3.6% in the previous month — missing estimates of 3.6% compiled by Bloomberg. For the fourth straight month, transaction records for Wayne County, Mich., were unavailable due to the COVID-19 lockdown so it was not included in the results.Separately, the Commerce Department said Tuesday, new home sales, a leading indicator of the health of the market, rose 13.9% to a seasonally adjusted annual rate of 901,000 units last month — the highest level since December 2006.“After 10 years of very subdued housing activity by every metric except for home prices we are finally seeing new home sales... really starting to come to market,” Brad Dillman, Cortland chief economist, told Yahoo Finance’s The First Trade.Read more: Buying a house: What you need to know about home ownership“Housing prices were stable in June,” said Craig J. Lazzara, managing director and global head of index investment strategy at S&P Dow Jones Indices, in a press statement. “June’s gains were quite broad-based. Prices increased in all 19 cities for which we have data, accelerating in five of them.”Phoenix remained the top city for the 13th consecutive month, posting a 9% annual gain for June. Seattle and Tampa followed, reporting a 6.5% and 5.9% gain, respectively. “As has been the case for the last several months, prices were particularly strong in the Southeast and West, and comparatively weak in the Midwest and (especially) Northeast,” Lazzara said.“More data will be required to understand whether the market resumes its previous path of accelerating prices, continues to decelerate, or remains stable,” Lazzara said. “That said, it’s important to bear in mind that deceleration is quite different from an environment in which prices actually fall.”Story continuesFILE - In this March 6, 2018, photo a home is advertised as sold in Sunnyvale, Calif. U.S home prices rose rapidly in May 2018, a trend that is thwarting some would-be buyers and pulling down home sales. The S&P CoreLogic Case-Shiller 20-city home price index rose 6.5 percent in May from a year earlier. .(AP Photo/Marcio Jose Sanchez, File)“The June Case-Shiller numbers show the housing market continues to withstand the pandemic-driven blows that have caused so many other facets of the economy to suffer,” said Zillow Economist Matthew Speakman, in a statement. “Mortgage rates and for-sale inventory are each plumbing new lows, ratcheting up competition for the few homes on the market. That’s placed consistent upward pressure on home prices, a trend that has held through the summer.”According to the National Association of Realtors, home prices were on the rise during the summer. Median existing home price for all housing types in July was $304,100, up 8.5% from July 2019, marking 101 straight months of year-over-year of price gain. The NAR noted that prices rose in every region. For the first time ever, national median home prices breached the $300,000 level.The home price and new home sales results follow impressive data which indicate a sharp recovery in the housing market since COVID-19 first hit the nation in March. Pending home sales, a leading indicator of the health of the market, reached its highest level since 2006. For the second month in a row, existing home sales rose, increasing in July by 24.7% from a month earlier — a new record monthly increase, according to the NAR. Sales was up 8.7% from the same time last year.“The housing market is well past the recovery phase and is now booming with higher home sales compared to the pre-pandemic days,” said Lawrence Yun, NAR’s chief economist, in a press statement. “With the sizable shift in remote work, current homeowners are looking for larger homes and this will lead to a secondary level of demand even into 2021.”-Amanda Fung is an editor at Yahoo Finance.Read more:Coronavirus finally slows down US home price growth5 reasons why the housing market has recovered from COVID-19: BofALuxury real estate may be back as the housing market recovers but bewareHome price growth accelerated at the start of 2020 before coronavirus slammed the USEconomist on housing: 'You can't buy what's not for sale'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance news"}]}