{"article": [{"url": "https://finance.yahoo.com/news/mark-zuckerberg-on-why-facebook-is-actually-behind-its-competition-despite-monopoly-fears-184151756.html", "published": 1596116960.0, "headline": "Mark Zuckerberg on why Facebook is actually 'behind' its competition despite monopoly critique", "body": "Facebook (FB) CEO Mark Zuckerberg didn’t waste any time on Wednesday explaining to lawmakers why he believes the company is not an illegal monopoly, during what was billed as a Congressional hearing to probe antitrust concerns.However, the questioning veered far off course into a hodgepodge of issues that included data privacy, content moderation, corporate citizenship, election integrity, censorship and surveillance.In his opening statement the tech billionaire — flanked by fellow tech giants Tim Cook, Jeff Bezos and Sundar Pichai — said Facebook faces intense global competition in the connection and advertising markets in which it operates.“Many of our competitors have hundreds of millions or billions of users, some are upstarts, but others are gatekeepers with the power to decide if we can even release our apps in their app stores to compete with that,” Zuckerberg said.“In many areas, we are behind our competitors,” he argued.Facebook CEO Mark Zuckerberg testifies Wednesday, July 29, 2020 before the House Judiciary Subcommittee on Antitrust, Commercial, and Administrative LawZuckerberg added that Facebook also competes against the tech companies whose leaders sat in the hot seats beside him. Specifically, Alphabet’s Google (GOOG) as the largest advertising platform; Apple’s (AAPL) iMessage as the most popular messaging service in the U.S.; Alphabet’s YouTube as the fastest growing platform for video; and Amazon (AMZN) as the largest online retailer, all represent competitive threats.“For every dollar spent on advertising in the U.S.,” Zuckerberg said, “less than 10 cents is spent with us.”‘Weaponizing’ its platformStill, lawmakers were not convinced that Facebook’s dealings with potential competitors have remained above board enough to withstand antitrust scrutiny.The majority of anticompetitive allegations focused on Facebook’s acquisition of Instagram and WhatsApp aided its growth to share 20% of a duopoly with Google in the digital advertising industry.Rep. Pramila Jayapal (D-WA) accused Facebook of using its power to threaten rivals with cloning their products and with acquiring their companies, including Instagram founder Kevin Systrom and Snapchat (SNAP) founder Evan Spiegel.Story continuesJayapal pointed to communications between Facebook and Systrom, obtained by the subcommittee, that preceded Facebook’s 2012 acquisition of Instagram. The exchange showed the social network communicated to Systrom that it was developing its “own photo strategy,” and that Instagram’s engagement with Facebook would determine the extent to which the companies would operate as future partners versus competitors.Zuckerberg disagreed with the characterization of the correspondence as a threat, saying that at the time, the relationship between Facebook and Instagram was well documented. It was clear that the photo sharing space was one in which Facebook was going to compete “in one way or another,” the CEO said.He added that at time of the acquisition it was not clear that the platform would succeed, and that the Federal Trade Commission did not object to the acquisition.Rep. Joseph Neguse (D-CO) accused Facebook of becoming a monopoly by the time it acquired Instagram, and of compounding its dominance with its subsequent WhatsApp purchase in 2014. Zuckerberg argued alternatively that the acquisition introduced competition against telecommunications companies, by dropping text message charges from 10 cents per text to private messages for free.Along with Neguse, Rep. Matthew Gaetz (R-FL) questioned Zuckerberg about a 2014 message from Facebook CFO David Wehner that referenced the company’s mergers and acquisitions strategy as one of “land grabs,” and a 2012 message from Zuckerberg stating that “one thing about startups though is you can often acquire them.”Rep. Valdez Demings (D-FL) accused Facebook of “weaponizing” its policies to restrict competitors including Pinterest from accessing its main platform. Zuckerberg acknowledged Pinterest as a social competitor, stating that at the time in 2012, the company did have a policy to restrict competitors’ use.Lawmakers also questioned Facebook’s purchase of Onavo, which permitted the company to view the extent to which consumers were using WhatsApp before it bought the popular messaging app, and the company’s alleged actions to dismantle its programming interface or Application Programming Interface (API) in response to competitive threats.Against the broad scope of questioning, Zuckerberg and the other tech leaders made it obvious in their prepared statements that they were conscious about U.S.-China tensions, and the role that antitrust plays in their ability to compete with the country’s technology, and on a global scale.“Companies are created all the time all over the world, and history shows that if we don't keep innovating someone will replace every company here today,” Zuckerberg said.“That change can often happen faster than you expect. Of the 10 most valuable companies a decade ago, only 3 still make that list today. If you look at where the top technology companies coming from the vast majority were American today. Almost half are Chinese,” he added.Alexis Keenan is a legal reporter for Yahoo Finance. Follow on Twitter @alexiskweed.[Click the following links for more of Yahoo Finance’s coronavirus coverage: Personal finance tips, news, policy, graphics & more from Yahoo Finance]Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}