{"article": [{"url": "https://finance.yahoo.com/news/misty-copeland-coronavirus-will-impact-ballet-for-a-couple-years-to-come-170233531.html", "published": 1596629420.0, "headline": "Misty Copeland: Coronavirus will impact ballet for 'years to come’", "body": "While the spread of the coronavirus continues to devastate the performing arts, fans and experts are targeting a return next year as a potential vaccine becomes widely available.But star ballet dancer Misty Copeland told Yahoo Finance that her industry will feel the effects of the outbreak beyond 2021. She pointed to the enduring financial losses suffered by ballet performers as well as mental and physical strain, adding that ballet companies should consider outdoor performances amid the pandemic.“It's going to impact us for a couple of years to come,” says Copeland, who has danced for the American Ballet Theater for two decades and appeared in a 2018 movie adaptation of “The Nutcracker.”“I feel like a lot of the impact we haven't even seen yet,” she says.“It's been difficult for people who spend their days — spend their lives — invested in this art form,” she says. “We're very physical people. We spend hours at a time partnering one another and [in a] very intimate environment”“Getting out of that and not having that personal human connection,” she says, “is a bit shocking.”The American Ballet Theater, one of the nation’s most prominent ballet companies for which Copeland became the first Black principal dancer in 2015, has canceled its spring and fall seasons and said last month that it could not yet announce plans for reopening, the New York Times reported.The New York City Ballet and Pennsylvania Ballet have canceled the rest of their 2020 performances, including “The Nutcracker” — a top annual holiday event for many companies.“Outdoor performances are definitely something that we should all be looking at,” Copeland says, in an interview taped on July 16.NEW YORK, NY - MAY 21: Misty Copeland attends the 2018 American Ballet Theatre Spring Gala at The Metropolitan Opera House on May 21, 2018 in New York City. (Photo by Roy Rochlin/Getty Images)Copeland made the remarks in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.The prolonged ballet closures have caused financial pain for many dancers, Copeland said.“Just like so many people in the world, dancers have been furloughed,” she says. “There's no way of making making money right now when the theaters are shut down.”Story continuesIn May, Copeland joined 31 other ballet performers from 14 countries in the launch of “Swans for Relief,” a virtual performance that aims to raise $500,000 for dancers currently out of work. So far, the fund has received over $283,000 in donations.On top of financial challenges, quarantine has made training nearly impossible, she said.“It's been really difficult to be confined to these small places and not be able to keep up our training,” she says. \"Any professional football player [or] basketball player — and I know a lot of them — have training facilities in their homes and access to that,\" she says.“But dancers don't make that kind of money.\"Read more:Bill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearBill Gates: Spread of 'outrageous' coronavirus video shows flaw in social media platformsJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}