{"article": [{"url": "https://finance.yahoo.com/news/vaccine-manufacturers-testify-before-congress-earnings-bonanza-what-to-know-in-the-week-ahead-150954430.html", "published": 1595153840.0, "headline": "Vaccine manufacturers testify before Congress, earnings bonanza: What to know in the week ahead", "body": "This week, the second-quarter earnings season continues with a host of companies across industries slated to report results. Mid-week, a handful of pharmaceutical companies that are working to quickly develop a Covid-19 vaccine will testify before Congress.Vaccine manufacturers’ appearanceFive companies working to develop a coronavirus vaccine are set to appear before a US House of Representatives subcommittee to discuss their work in creating inoculations.Officials from Merck (MRK), Moderna (MRNA), Pfizer (PFE), AstraZeneca (AZN) and Johnson & Johnson (JNJ) are set to testify on July 21 before the House Committee of Energy and Commerce.“This hearing will provide an opportunity for both Congress and the American people to hear directly from some of the manufacturers currently developing potential COVID-19 vaccines,” the committee said in a statement earlier this month. “We look forward to hearing from each of the companies about their research and development efforts, safety and efficacy standards and their ongoing preparations to manufacture and distribute an eventual vaccine.”The hearing comes as infections from the coronavirus pandemic continue to march higher, with global cases topping 14.3 million and deaths surpassing 602,000, according to John Hopkins data as of Sunday. The US remains a global epicenter for the pandemic.The US is aiming to deliver a vaccine by year-end, and has invested more than $2 billion across a host of companies as part of Operation Warp Speed to achieve this goal. Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, recently said he “felt good about the projected timetable” for a vaccine, according to a recent interview with Reuters.CAMBRIDGE, MASSACHUSETTS - MAY 08: A view of Moderna headquarters on May 08, 2020 in Cambridge, Massachusetts. Moderna was given FDA approval to continue to phase 2 of Coronavirus (COVID-19) vaccine trials with 600 participants. (Photo by Maddie Meyer/Getty Images)Many of the individual drug-makers set to testify before the House have in recent weeks unveiled promising data on their own work in developing a vaccine. Moderna has been among the furthest along in its vaccine development so far, and data published last week in the New England Journal of Medicine showed that all 45 patients treated in a trial with Moderna’s potential vaccine produced neutralizing antibodies – an important factor in providing eventual virus protection. The company is set to begin its late-stage trial for the vaccine on July 27.Story continuesAs of mid-July, there were more than 135 vaccines in preclinical tests, and some 30 in clinical trial globally, according to data tracked by the New York Times.Earnings bonanzaCompanies comprising about 25% of the S&P 500 are set to deliver earnings results in the coming week, for one of the heaviest weeks of reports this quarter.So far, about 13.4% of the S&P 500’s market capitalization has reported second-quarter results.Second-quarter earnings per share are “projected to experience the greatest contraction of the current crisis, -43.0% versus the same quarter last year,” Credit Suisse strategist Jonathan Golub wrote in a note Friday. “That said, company results have been topping forecasts by +13.0%, more than any quarter since 1Q10.”The companies reporting this week will span industries, from airlines including American, Southwest and United, to tech giant Microsoft and social media companies Twitter and Snap.This next batch of airlines’ earnings comes following Delta Airlines’ disappointing Q2 report last week. The carrier reported a more than 90% slump in passenger revenues, as capacity was slashed 85% to reflect the drop-off in travel demand at the height of the coronavirus pandemic. Traffic for major airlines may not return to 2019 levels until 2023, Goldman Sachs analysts said in late June, in a downgrade from the firm’s previous forecast for a recovery by 2022.Another wave of tech earnings will also serve as banner reports this week. Expectations for this cohort of companies in particular have been high, as investors bet on the recovery of these stocks as more Americans work from home and lean on software companies. The tech-heavy information technology and communication services sectors have both strongly outperformed the broader market for the year to date.Still, ad-driven businesses including Snap and Twitter have faced a slide in advertising even as online engagement rose during the pandemic, as companies cut back on marketing spending. And Twitter’s results come on the heels of a massive data breach last week, wherein the accounts of notable individuals including Amazon CEO Jeff Bezos, presumptive Democratic presidential nominee Joe Biden and former President Barack Obama were all compromised.Tech giant Netflix saw its shares drop late last week after reporting disappointing third-quarter guidance, despite a solid beat against expectations in second-quarter results.Finally, investors will be closely eyeing Tesla’s quarterly results on Wednesday, after the stock’s more than 250% gain for the year to date. The company – which reported better than expected Q2 delivery results last month – is set to be eligible for consideration for S&P 500 inclusion if it ekes out a modest GAAP profit during the second quarter.Earnings calendarMonday: Halliburton (HAL), Lennox International (LII) before market openTuesday: Comerica Incorporated (CMA), Lockheed Martin (LMT), Synchrony Financial (SYF), The Coca-Cola Company (KO) before market open; Texas Instruments (TXN), Philip Morris International (PM), Capital One Financial (COF), Navient Corporation (NAVI), United Airlines (UAL), Avangrid (AGR), Snap (SNAP), iRobot (IRB) after market closeWednesday: Baker Hughes (BKR), KeyCorp (KEY), Nasdaq Inc. (NDAQ), Biogen (BIIB), HCA Healthcare (HCA), Teledyne Technologies (TDY) before market open; Chipotle (CMG), Whirlpool (WHR), Align Technologies (ALGN), Tesla (TSLA), Microsoft (MSFT), Equifax (EFX), Las Vegas Sands Corp (LVS) after market closeThursday: Southwest Airlines (LUV), Kimberly-Clark (KMB), Dow Inc. (DOW), The Travelers Corp (TRV), Quest Diagnostics (DGX), PulteGroup (PHM), Hershey (HSY), AT&T (T), Cintas (CTAS), Citrix Systems (CTXS), American Airlines (AAL), Alaska Air Group (ALK), Twitter (TWTR), Union Pacific (UNP), Intel (INTC), E-Trade Financial (ETFC), Boston Beer Co. (SAM), Skyworks Solutions (SWKS) after market closeFriday: Schlumberger (SLB), Verizon Communications (VZ), American Express (AXP), Bloomin’ Brands (BLMN), Honeywell (HON) before market openEconomic calendarMonday: N/ATuesday: Chicago Fed National Activity Index, June (4.00 expected, 2.61 in May)Wednesday: MBA Mortgage Applications, July 17 (4.1% expected)Thursday: Initial jobless claims, week ended July 18 (1.293 million expected, 1.3 prior week); Continuing claims, week ended July 11 (16.9 million expected, 17.338 million prior); Leading Index, June (2.1% expected, 2.8% prior); Kansas City Fed Manufacturing Activity, July (5 expected, 1 prior)Friday: IHS Markit US Manufacturing PMI, July preliminary (52.0 expected, 49.8 prior); Markit US Services PMI, July preliminary (51.0 expected, 47.9 prior); Markit US composite PMI, July preliminary (47.9 prior); New home sales, June (700,000 expected, 676,000 prior)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}