{"article": [{"url": "https://finance.yahoo.com/news/sector-style-rotation-rocking-stocks-market-morning-brief-100619474.html", "published": 1597295660.0, "headline": "Inside the massive rotation rocking markets right now: Morning Brief", "body": "Thursday, August 13, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeInvestors have been buying losers and selling winners.The last few days of market action have been among the most interesting in months.Everything that worked suddenly lagged.Everything that had been falling behind this market was quickly in a leadership role.After the Nasdaq hit a record high last Thursday, the sectors, styles, and factors that had been out of fashion for most of the summer became the stars of the show.And as Nomura strategist Masanari Takada said in a note published Tuesday, “The factor reversal observed over the past two trading days may well be just the beginning.”“Speaking as quants,” Takada adds, “we would point out that the factor reversal is strongly consistent with a variety of observed patterns, including imbalances that had accumulated in speculative positions. We therefore think that the factor reversal still has a way to go.”In other words, this day-in, day-out change in market leadership should hold as the predominating theme in markets for the next few weeks.At least as long as investors work off some of the pro-tech energy that bordered on mania through late July, when the year-to-date return for Facebook (FB), Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), and Alphabet (GOOGL, GOOG) had risen to 35% against a -5% return for the other 495 companies in the S&P 500.The team at Bespoke Investment Group on Wednesday highlighted just how quickly the fortunes of so many stocks across the market reversed late last week and into this week’s first two trading days.“Over the last three trading days, we've seen a clear rotation out of many mega-cap stocks that had been leading the market higher, while we've seen rotation into parts of the market that had been weak: Energy, Transports, Industrials, and Financials,” Bespoke said early Wednesday.“We actually began to notice this shift weeks ago when we speculated that the ‘re-open’ trade would gain traction again as COVID case counts around the country started to trend lower. But it wasn't until the last few days that the shift accelerated.”Story continuesAnd as the firm’s table shows below, cheap stocks, shorted stocks, stocks hated by analysts, and stocks that had lagged during this recovery all outperformed Friday through Tuesday.Almost all of the market themes that have worked during the pandemic rally were laggards over the last few days while factors, sectors, and styles that had been left behind were the stars of the show. (Source: Bespoke Investment Group)The cheapest stocks on a price-to-earnings ratio, for instance, gained the most, as did stocks with the worst analyst ratings. Even sorting by share price — which has nothing to do with a company’s value and is ultimately an arbitrary number — stocks with the lowest per-share price outperformed stocks with the highest per-share price. It seems investors in the last few days have stretched the definition of what it means to be a “cheap” stock amid this rotation.Recent market history, however, suggests the durability of this leadership change is an open question at best.“In recent years, we've seen a number of short periods like this where investors rotate out of winners into the most unloved areas of the market, but the trend has been unable to last for very long,” Bespoke writes. “It's too early to tell if this time is any different, and for now, we'd chalk it up to simple mean reversion given how hot the ‘growth’ area of the market had been.”Nomura is also taking a wait-and-see approach on declaring that this time is different for the rotation trade.“We think it should become clearer in late August whether this reversal ends as a mere technical consolidation (lasting about a month) or whether it transforms into a genuine factor rotation driven by some story rooted in fundamentals (lasting about three months),” Takada writes.But the firm notes that there is plenty of money lining up behind a more definitive view.“In terms of speculative supply and demand, we are seeing not only a shift in the preferences of trend-following investors in DM futures markets (exemplified by a shift away from NASDAQ 100 futures towards DJIA futures), but also a renewed liking for low-P/B stocks or high-beta stocks in cash equity markets,” Takada writes. “Global macro hedge funds in particular are looking enthusiastic about buying DM equities. Part of the reason for this, it seems, is that these funds have growing confidence that a sunny global economic growth scenario is likely to unfold.”And so, of course, on Wednesday this trend reversed yet again.Tech stocks outperformed as the Nasdaq rose more than 2% to close above 11,000 once again while financials were the only sector in the S&P that lost ground.As the old adage says, the market is designed to fool the largest number of people at any one time.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Initial jobless claims, week ended Aug. 8 (1.1 million expected, 1.186 million prior week)8:30 a.m. ET: Continuing jobless claims, week ended Aug. 1 (15.8 million expected, 16.107 million prior week)8:30 a.m. ET: Import price index, July MoM (0.6% expected, 1.4% in June)8:30 a.m. ET: Export price index, July MoM (0.4% expected, 1.4% in June)EarningsPre-market6:45 a.m. ET: Tapestry (TPR) is expected to report an adjusted loss of 58 cents per share on revenue of $656.21 millionPost-market4:00 p.m. ET: Applied Materials (AMAT) is expected to report adjusted earnings of 95 cents per share on revenue of $4.18 billionTop NewsEuropean stocks sink after four days of gains [Yahoo Finance UK]Palantir plans direct listing for late September [Reuters]Lyft revenue plummets 61% as pandemic crushes ride-sharing industry [Yahoo Finance]Lawsuit: COVID-contaminated meat packaged, carried to consumers [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSGoldman Sachs: The next big investment opportunityCheck this one thing in your 401(k) right nowHere's where VP pick Kamala Harris stands on Big Tech, taxes, marijuana—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}