{"article": [{"url": "https://finance.yahoo.com/news/has-your-bank-lowered-your-savings-rate-just-get-another-bank-account-or-three-153408078.html", "published": 1601289740.0, "headline": "Has your bank lowered your savings rate? Just get another bank account — or three", "body": "If you have an online savings account, chances are you’ve received a lot of emails in the past two years telling you your rates are being cut.Around two years ago, many online savings banks like Ally (ALLY), American Express (AXP), Barclays (BCS), Goldman Sachs’s Marcus (GS), CIT (CIT), Citi (C), Synchrony (SYF), and more were offering interest rates well over 2.00% for savings accounts.Read more: How to save money for short-, mid-, and long-term goalsBack then, interest rates were higher and online banks competed readily for deposits — as did many robo-advisors like Betterment, Wealthfront, and even the investing app, Robinhood.An interesting aspect of lower rates is that the order has also changed. The bank that offered the best in 2018 may be down the list today. For example, CIT was the most generous back then, but now Citi pays out the highest, with 0.90% APY.If you’re looking to maximize your interest so you’re earning as much as possible on your savings or emergency fund, it can pay to be proactive and move your money.A woman looks at Marcus, a new savings and loans app recently launched by Goldman Sachs in New York, U.S., January 10, 2020. REUTERS/Mike SegarToday, it’s very easy to set up an account with an online savings bank, and according to Greg McBride, Bankrate’s chief financial analyst, there’s no downside to having a bunch of accounts like there is with credit cards — “unless you consider keeping track of them a downside,” he said. Setting up an account doesn’t hurt your credit or make enemies with a bank.That means you could easily set up multiple accounts with various online savings banks and simply transfer money to the one that pays the most. Interbank transfers are generally done via ACH methods, which are easy to do through banks’ websites and are free, taking a couple days to clear.However, for most people, the upside to switching to a different high-yield account isn’t particularly high. The difference of 0.80% to 0.90% is far less than the difference between having a traditional savings account (they pay around 0.09% APY on average, according to Bankrate) and any of the high-yield online savings accounts in question.Story continuesFor example, if you have $5,000 in cash, you’ll only make $5 per year by going to Discover from Citizens Access (0.70% from 0.60%).So while people might get annoyed every time the bank notifies that the rates have fallen, the difference isn’t much.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Why savings accounts have fallen — and some more than othersIntergenerational conflict is getting worse, Deutsche Bank warns2 tax safe harbors that new traders need to know aboutNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggests5 rookie mistakes investors make: hedge fund veteran"}]}