{"article": [{"url": "https://finance.yahoo.com/news/heres-why-being-free-may-not-let-google-and-facebook-off-the-regulatory-hook-123804686.html", "published": 1596008780.0, "headline": "Here's why being 'free' may not let Google and Facebook off the regulatory hook", "body": "Four of the world’s most powerful CEOs are set to testify before lawmakers on Wednesday in a highly anticipated, politically charged confrontation over concerns that they’re illegally blocking competitors from their industries.And two of them — Alphabet’s Sundar Pichai and Facebook’s Mark Zuckerberg — may field questions presuming a popular red herring: That their companies are not illegal monopolies because their services are free. Yet antitrust experts say the theory isn’t one that holds water under the law.“Free is a price, just like $10 is a price, just like minus $10 is a price,” David Dinielli, former special counsel with the Antitrust Division of the U.S. Department of Justice, told Yahoo Finance.“There is an open question about whether free is the correct price for some of these services. It is not obvious from an economic standpoint, or a collective bargaining standpoint, that it is,” he added.If Google and Facebook are found to have behaved like monopolies, they could be dismantled in a way that allows for the entry of new competitors. One resulting scenario could be that both must pay users for the data they generate in order to remain competitive.Google (GOOG) and Facebook (FB) offer different products, yet the companies are under scrutiny for behavior that has led to their dominance in the digital advertising industry — the predominant forum where they monetize their legions of users.Google, which dodged a bullet back in 2013 when Federal Trade Commission regulators to drop their investigation and not take legal action against the company, has amassed users by cultivating its ubiquitous search engine that processes nearly 7 billion searches per day, amounting to more than 90% of the search market. Meanwhile, Facebook tapped into the success of its vast network that grew from 1 million users in 2004 to 2.6 billion active monthly users across its platforms today.The companies command a combined 57% market share of the $130 billion digital advertising industry — Google with 37% and Facebook with 20%. Their market positions have been bolstered by strategic acquisitions that folded swaths of the digital advertising ecosystem into their agglomerated platforms.Story continuesFILE - In this Tuesday, Oct. 4, 2016, file photo, Google CEO Sundar Pichai speaks during a product event in San Francisco. Pichai has declared artificial intelligence more important to humanity than fire or electricity. And yet the search giant is increasingly having to deal with messy people problems: from the need for human checkers to catch rogue YouTube posters and Russian bots to its efforts to house its burgeoning workforce in pricey Silicon Valley. (AP Photo/Eric Risberg, File)As one argument goes, Google’s search service — the foundation of its explosive growth — is incapable of harming consumers by alleged illegal monopolistic behavior, because a user’s cost to perform a search is $0. Likewise, users can establish and maintain Facebook accounts free of charge.Yet antitrust laws, and specifically Section 2 of the Sherman Act that sits at the heart of current concerns over the bigness of Big Tech, aren’t violated or adhered to based on whether consumers extrapolate value from a platforms’ use.Instead, the law prohibiting illegal monopolies assumes that if a dominant company either becomes dominant or maintains dominance by taking action that is not on the merits, whatever “price” consumers pay is causing them harm.For Google, the primary area of focus under the Sherman Act will include examining its acquisition and development of entities that participate in the digital advertising space — an area the company dominates. Multiple deals have let the search engine bulldoze its way into ad technology ecosystems, setting the terms for advertisers that purchase ads, publishers that sell them, as well as the platform that brings the parties together. In addition, the company will be pressed to account for terms it required in contractual relationships with computer and mobile products using its Chrome browser and Android operating system.Meanwhile, Facebook’s scrutiny will come with examination of its big deals like purchases of Instagram, and Onavo, which permitted the company to view the extent to which consumers were using WhatsApp before it bought the popular messaging app. Lawmakers are also expected to look at Facebook’s alleged actions to dismantle its programming interface in response to competitive threats, and use of default settings that make it difficult for some users to understand how their personal data is used.Why conduct matters(COMBO) This combination of pictures created on July 07, 2020 shows (L-R) Facebook CEO Mark Zuckerberg in Paris on May 23, 2018, Google CEO Sundar Pichai Berlin on January 22, 2019, Apple CEO Tim Cook on October 28, 2019 in New York and Amazon Founder and CEO Jeff Bezos in Las Vegas, Nevada on June 6, 2019. (Photos by AFP) (Photo by BERTRAND GUAY,TOBIAS SCHWARZ,ANGELA WEISS,MARK RALSTON/AFP via Getty Images)The politically charged environment in which the tech CEOs — also including Apple’s (AAPL) Tim Cook and Amazon’s (AMZN) Jeff Bezos — will make their historic appearance Wednesday is ripe for red herrings, despite the House subcommittee’s purported intent to evaluate the adequacy of existing antitrust laws to address anticompetitive conduct.George Hay, a law and economics professor at Cornell Law School, pointed out another red herring to Yahoo Finance’s The Ticker. Asked whether tech giants can successfully argue that there is strong evidence of competition in their respective markets, such as Facebook rival TikTok, and Google’s rival search and browser platforms, Hay said the antitrust lens can be narrowed somewhat.“There is always competition in a big sense,” said Hay, a former chief economist for the Department of Justice’s Antitrust Division.Maureen Ohlhausen, a former acting chair and commissioner of the Federal Trade Commission, cautioned House Judiciary members against amending and invoking antitrust law and its enforcement mechanisms to achieve political or policy outcomes.Safeguarding consumer privacy, the protection of small businesses, and notions of fairness should be undertaken through regulatory action or consumer protection laws, she wrote in a letter to the committee chairs in April.“Although we may sometimes think of an antitrust offense in terms of anticompetitive effects, an antitrust offense is better understood in terms of the alleged conduct’s impact on the “competitive process” through which a firm makes its decisions on price, quality, and the need to innovate, among other terms,” she wrote.“Our free market system rests on the conclusion that markets in which firms must endure competitive pressures will produce favorable outcomes in terms of price, output, quality and innovation in the long run. Enforcers should only intervene when there is evidence that firms are corrupting or are likely to corrupt the competitive process through means other than competition on the merits,” Ohlhausen added.Dinielli described some of those problematic and potentially illegal forms of competition to include deceptive company practices, acquisition of entities solely for the sake of cutting off perceived competition, and disabling competing companies from accessing customers.He also suggested that lawmakers not focus on the companies’ size, but whether they are using concentration in their respective markets to exclude new entrants. In doing so, he said, they’d be excluding ideas that have not yet been conceived.“Our American heritage, as well as our economic principles, which are then reflected in the law, do not prescribe bigness as something bad in and of itself,” Dinielli said.“To the contrary, I think we promote the promise that anyone who has a good idea ought to be able to reap the benefits of that good idea,” he added.Testimony is scheduled to get underway at 12:00pm Eastern Time and can be viewed here on the House Judiciary Committee’s website.Alexis Keenan is a legal reporter for Yahoo Finance. Follow on Twitter @alexiskweed.[Click the following links for more of Yahoo Finance’s coronavirus coverage: Personal finance tips, news, policy, graphics & more from Yahoo Finance]Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}