{"article": [{"url": "https://finance.yahoo.com/news/powell-pushes-on-very-strong-very-powerful-guidance-on-interest-rates-222455504.html", "published": 1600277540.0, "headline": "Powell pushes on 'very strong, very powerful' guidance on interest rates", "body": "Federal Reserve Chairman Jerome Powell unveiled new forward guidance on where interest rates are headed in the next few years.But even though Powell describes the guidance as “very strong, very powerful,” not all Fed officials were on board with the central bank’s wording on what it would take to raise the federal funds rate.In its policy statement Wednesday, the Federal Open Market Committee said it would not raise rates until “conditions have reached levels consistent with the Committee’s assessments of maximum employment and inflation has risen to 2 percent and is on track to moderately exceed 2 percent for some time.”The statement signals no rate hikes for a while, since the Fed is projecting that inflation will not touch 2% until the end of 2023.But Dallas Fed President Robert Kaplan dissented, arguing that the forward guidance may be taking away “flexibility” on lifting off from zero rates. Kaplan preferred to recycle the old language committing the Fed to near-zero rates “until the Committee is confident the economy has weathered recent events.”Minneapolis Fed President Neel Kashkari also dissented, but made the case for an even stronger commitment of keeping rates at near-zero until inflation has reached 2% “on a sustained basis.”Chairman Powell on Wednesday said the two voting members of the FOMC appeared to be on “two sides of the discussion” but welcomed the “different perspectives.”“There’s no cookbook and this is the first guidance under our new framework so of course there would be a wide range of views,” Powell said.Fed watchers were mixed on the efficacy of Powell’s message with the new forward guidance. Seema Shah, chief strategist at Principal Global Investors, said Wednesday that the markets were hoping for “explicit guidance” on the Fed’s new strategy to allow inflation to “moderately” overshoot its 2% target.“The Fed Chair chose not to share details,” said Shah. “He also failed to discuss how they will utilise the toolkit, leaving investors in the dark about how it will push inflation to 2%, let alone overshoot it.”Story continuesMinneapolis Federal Reserve president Neel Kashkari participates in the Yahoo Finance All Markets Summit at Union West on Thursday, Oct. 10, 2019, in New York. (Photo by Evan Agostini/Invision/AP)Powell acknowledged in the press conference that describing the mechanics of overshooting inflation are “challenging,” but emphasized that higher inflation expectations are key to giving the Fed more policy space on rates.“If inflation averages 2%, the public will expect that and that’ll be what’s built into interest rates. That’s all we want,” Powell said in response to a question from Yahoo Finance.‘It will take a while’Krishna Guha and Ernie Tedeschi at Evercore ISI wrote Wednesday that the forward guidance announced today is “bullish-dovish” given their expectations that guidance was not going to come until November or December. But an interesting wild card for future Fed policy could be its use of quantitative easing within the forward guidance.In its statement, the Fed now describes the expansion of its asset holdings as an effort to “help foster accommodative financial conditions,” a change from its previous insistence that the purchases were only for market functioning.In other words, the Fed could be keeping its powder dry for further enhancing its forward guidance.“Once again, Powell left the door open to further potential action, which would most likely involving additional QE,” wrote ING’s economics team Wednesday.Powell said the Fed would continue to purchase at least $80 billion a month in U.S. Treasuries and $40 billion a month in mortgage-backed securities. He reiterated the Fed could adjust its monetary policy stance if “risks emerge that could impede” its objectives as laid out in the guidance.“I certainly would not say that we’re out of ammo, not at all,” Powell said.The Fed has telegraphed that at least for the next few years, the central bank will not raise rates. The median member of the FOMC projected interest rates remaining in the target range of between 0% and 0.25% through the end of 2023.The Fed’s next policy-setting meeting will take place November 4 and 5.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed signals interest rates to stay near-zero through 2023Trump nominee Judy Shelton lacks votes for spot at the Fed, Sen. Thune saysFOMC Preview: Lack of fiscal stimulus casts shadow over FedAmericans are again growing concerned about losing their jobs: NY FedA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}