{"article": [{"url": "https://finance.yahoo.com/news/ap-fact-check-trumps-risk-153222384.html", "published": 1597315220.0, "headline": "AP FACT CHECK: Trump payroll tax cut is Social Security risk", "body": "BALTIMORE (AP) — President Donald Trump’s proposed payroll tax cut is a threat to Social Security no matter how he casts it.During a news conference Wednesday, he insisted he could eliminate the tax if he were reelected, and do it without undercutting retirement benefits or greatly adding to the deficit. He said economic growth would offset the revenue losses.That claim has little basis in reality.He also pointed to a manufacturing boom during the coronavirus pandemic but there isn’t one.A look at some of his economic claims:TRUMP: “At the end of the year, the assumption that I win, I’m going to terminate the payroll tax ... We’ll be paying into Social Security through the General Fund.\"THE FACTS: Trump, in effect, has proposed a dramatic restructuring of how Social Security is financed by not relying on the payroll tax as a dedicated source, but instead by tapping the general fund. Trump campaign officials stressed that the general fund consists of assets and liabilities that finance government operations and could do so for Social Security. The general fund is nicknamed “America's Checkbook” on the Treasury Department's website.The risk is that the loss of a dedicated funding source could destabilize an anti-poverty program that provides payments to roughly 65 million Americans. It also could force people to cut back on the spending that drives growth so they can save for their own retirement and health care needs if they believe the government backstop is in jeopardy.A 12.4% payroll tax split between employers and workers funds Social Security, while a 2.9% payroll tax finances Medicare. These taxes raised $1.24 trillion last year, according to the Congressional Budget Office. Over a 10-year period, Trump’s idea would blow a $16.1 trillion hole in a U.S. budget that is already laden with rising debt loads.Trump last week announced a payroll tax deferral through the end of the year, part of a series of moves to bypass Congress after talks on a broader coronavirus relief bill have stalled. He says he will eliminate the tax with the help of Congress. Democrats have described that idea as a nonstarter.Story continuesWhite House press secretary Kayleigh McEnany on Thursday suggested to reporters that Trump misspoke when he said he would eliminate the payroll tax if reelected. She said the president would only push to make the payroll tax deferrals permanent.Trump on Wednesday said at least four times that he would end the payroll tax. The president added that the tax would be eliminated after the “beginning of the new year,” while the deferral only applies to the closing months of 2020. Trump said his planned payroll tax reduction would be a “number that’s bigger than any of the numbers we talked about.” A typical family would get back $5,000 or more, Trump said.That average is so large that it suggests Trump either wants to eliminate the payroll tax or he did not understand his administration’s own policies.___TRUMP, asked how the general fund can sustain the payments: “We’re going to have tremendous growth. ... You will see growth like you have not seen in a long time.”THE FACTS: It is highly unlikely that economic growth would be enough to offset the loss of the payroll tax. Indeed, Trump suggested that his 2017 income tax cuts would propel economic growth as high as 6% annually. That never happened. Growth reached 3% in 2018, then slumped to 2.2% and the U.S. economy crumbled into recession this year because of the coronavirus.___TRUMP: “The manufacturing sector is booming and the production index is at the highest reading since October of '18, which was an extraordinary period of time.”THE FACTS: The pandemic crushed U.S. factories and the damage persists. There is no boom.Even after three months of job gains, the U.S. Bureau of Labor Statistics shows the manufacturing sector has 740,000 fewer jobs than before the outbreak. All the factory hiring gains under Trump have disappeared. There were 257,000 more manufacturing jobs on the day Trump became president than now. More important, the jobs recovery has shown signs of stalling. Just 26,000 factory jobs were added in July, down from 357,000 added jobs in June.The sector has been recovering. Yet after increases in production in June, the Federal Reserve said U.S. factory output was running 11.1% below pre-pandemic levels. Trump cited one component of an index composed by the Institute for Supply Management that indicates factory production grew in July as well. It was the best reading since August of 2018, not October as claimed by the president. But that same report showed that manufacturers are also cutting back on employment, suggesting that a boom has yet to begin.___Associated Press writer Aamer Madhani in Washington contributed to this report.___EDITOR'S NOTE — A look at the veracity of claims by political figures.___Find AP Fact Checks at http://apnews.com/APFactCheckFollow @APFactCheck on Twitter: https://twitter.com/APFactCheck"}]}