{"article": [{"url": "https://finance.yahoo.com/news/naacp-met-with-facebook-ceo-mark-zuckerberg-and-coo-sheryl-sandberg-and-we-got-nothing-164938355.html", "published": 1594209440.0, "headline": "We met with Facebook CEO Mark Zuckerberg and COO Sheryl Sandberg and we got nothing: NAACP CEO", "body": "Lots of listening, not much in the way of action.That is one of the main takeaways from a meeting NAACP CEO Derrick Johnson had with Facebook CEO Mark Zuckerberg and COO Sheryl Sandberg on Tuesday.“Well, after two years of having conversation with the top leadership at Facebook, including Sheryl and Mark, we walked away with the same thing we walked into the discussion with: nothing. We provided them with 10 things we think is fair and doable to ensure our society is safe and our democracy is protected. We provided that list three weeks ago. They asked for the meeting. We joined the meeting in order to get on the call for them. We wanted to discuss the progress being made or given timelines when they’ll make the necessary adjustments,” said Johnson on Yahoo Finance’s The First Trade.Facebook didn’t respond to Yahoo Finance’s request for comment on Johnson’s comments.The social media giant continues to be in hot water with advertisers amid a push by the NAACP and other groups to better police content on the platform. Unilever, Coca-Cola, Pfizer and Yahoo Finance parent company Verizon have disclosed plans to pause advertising spend on Facebook’s platforms until Zuckerberg lays out clear-cut measures to improve content policing.NEW YORK, NY - OCTOBER 25: Facebook CEO Mark Zuckerberg pauses while speaking about the new Facebook News feature at the Paley Center For Media on October 25, 2019 in New York City. Facebook News, which will appear in a new dedicated section on the Facebook app, will offer stories from a mix of publications, including The New York Times, The Wall Street Journal and The Washington Post, as well as other digital-only outlets.(Photo by Drew Angerer/Getty Images)It’s unlikely this growing group of advertising defectors will be too pleased by the results of Facebook’s two-year internal audit aimed at addressing its content policing issues. In the 100-page report out Wednesday morning, the auditors found Facebook has made “painful” decisions over the past nine months that have “real world consequences that are serious for civil rights.” While the auditors gave Facebook credit for efforts to improve voter suppression and census interference, the overarching takeaway is that the company is well behind the curve on controlling misinformation.Adds Johnson, “Here is the problem we have. We have a company where shareholders cannot hold them accountable because one person owns 67% of the stock. The board of directors cannot hold them accountable. The ad dollar revenue, although effective with this campaign, only males up about less than 10% of the total revenue. There’s no federal or state regulatory infrastructure in place holding them accountable. They have become such a large company, there are no competitors. So we have a problem on our hands. Either they decide to be good corporate citizens to keep communities safe and protect our democracy, or we are looking at a sovereign nation within our nation.”Story continuesBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}