{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-covid-weekly-initial-jobless-claims-july-4-173348831.html", "published": 1594280420.0, "headline": "Jobless claims: Another 1.31 million Americans file for unemployment benefits", "body": "Following the blowout June jobs report, market participants got another update on the state of the U.S. labor market Thursday morning with the release of the weekly initial jobless claims report.Another 1.314 million Americans filed for unemployment benefits in the week ending July 4, below economists’ expectations for 1.375 million initial jobless claims. The prior week’s figure was revised lower to 1.41 million from the previously reported 1.43 million. Weekly jobless claims have decelerated for 14 consecutive weeks; however, nearly 50 million Americans have filed for unemployment insurance over the past four months.Read more: Coronavirus: How to find a job in a tough economy(Yahoo Finance/David Foster)“While initial jobless claims remain historically high, at more than 1 million per week, this is a gross rather than net number. The actual number of people collecting unemployment continues to steadily decline, as shown by the move down in continuing claims,” Wells Fargo said in a note July 2.Closely watched continuing claims, which lag initial jobless claims data by one week, totaled 18.06 million in the week ending June 27 from 18.76 million in the prior week. Consensus expectations were for 18.75 million for the week.“Weekly initial jobless claims have come in a little lower than expected at 1.314mn for week of July 4th, but remain more than double the level seen during the Global Financial Crisis,” ING economist James Knightly wrote in a note Thursday. “However, the total number of people claiming benefits under ALL programs rose to 32.9mn - up 1.4mn on the week. That is because a broader range of people qualify for benefits under the Pandemic Unemployment Assistance program which had 14.4mn claimants as of week June 20. This only serves to illustrate the ongoing extreme stress in the jobs market and suggests unemployment is closer to 20% than the 11.1% currently listed as the ‘official’ rate.”Pandemic Unemployment Assistance (PUA) program claims, which include those who were previously ineligible for unemployment insurance such as self-employed and contracted workers, was also closely monitored in Thursday’s report.Story continuesPUA claims totaled 1,038,905 on an unadjusted basis in the week ending July 4, up from the prior week’s 996,842.As of Thursday morning, there were 12 million COVID-19 cases and 550,000 deaths worldwide, according to Johns Hopkins data. In the U.S., there were 3 million cases and 132,000 deaths.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.43 million Americans file for unemployment benefitsWhite Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance news"}]}