{"article": [{"url": "https://finance.yahoo.com/news/amazon-considers-relocating-employees-seattle-014906641.html", "published": 1597392500.0, "headline": "Amazon Considers Relocating Some Employees Out of Seattle", "body": "(Bloomberg) -- Amazon.com Inc. is offering Seattle-based employees a choice of smaller offices outside the city, suggesting the Covid-19 outbreak and a new local employers tax have pushed the e-commerce giant to consider alternatives to its hometown.In a message to employees Thursday, Amazon asked which communities near Seattle -- including Tacoma and Redmond, Washington -- they’d prefer. The title on the message, which was shared on Reddit and later deleted, was “office workplace options.” Amazon declined to comment on the matter.REI to Sell Its Never-Been-Used Headquarters Outside SeattleAmazon, which reported a total global workforce of almost 877,000 as of June 30, has been expanding beyond Seattle for years. It is building a second major office center in suburban Virginia near the nation’s capital and has satellite locations in cities including New York, Austin and Los Angeles.Companies across the U.S. are weighing changes to their office footprints after months of employees working from home. Finance firms in Manhattan have looked to New York’s suburbs for space, while Facebook has said as much as half of its employees may be working remotely in the next 10 years.Greenwich Offices Get a Boost With Finance Looking Outside NYCAmazon has threatened to focus employment growth outside Seattle due to a rocky relationship with city officials and new taxes imposed on big employers. The message suggests Amazon could significantly shrink its presence in its hometown, where it employs about 50,000 people in a mixture of offices it owns and leases. In 2019, it announced it would relocate its worldwide operations division, which oversees Amazon’s shipping and logistics, to nearby Bellevue where it currently employs 3,000 people.Even before the pandemic, Amazon considered building more satellite offices outside the city, according to a person familiar with the matter. The company plans to expand its Bellevue offices, which it has had since 2017. Such locations are seen as an amenity for employees tired of commuting to Seattle and as a way to reduce the company’s exposure to the city’s taxes targeting big employers, said the person, who asked not to be identified discussing private matters.Story continuesNYC Developer Silverstein Expands West Coast Bet With Loan DealTwo years ago, Amazon helped defeat an effort in Seattle to raise money for homeless services and affordable housing by levying a per-employee tax on large businesses. The “head tax” would have raised about $47 million a year.The political climate has since shifted against the company after Amazon’s big spending on a Seattle City Council election backfired last year. In July, the council passed a new levy that will tax large businesses on employees who make at least $150,000 per year. The tax is expected to raise more than $200 million annually and cost Amazon even more than the earlier proposal.(Updates with companies making office changes.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}