{"article": [{"url": "https://finance.yahoo.com/news/tesla-stock-plunges-snub-p-112027239.html", "published": 1599546500.0, "headline": "Tesla stock plunges after snub from S&P 500", "body": "Tesla Inc. shares were in bear-market territory after the company was excluded from joining the S&P 500.Shares of the Palo Alto, Calif.-based electric-car maker were trading lower by 10% early Tuesday, and were down 25% from their Aug. 31 close of $498.32. A bear market occurs when a stock is down 20% or more from a recent peak.“It was viewed as almost a consensus move based on all the metrics that Tesla was likely to get into the S&P 500 club this time around,” wrote Dan Ives, a New York-based analyst at Wedbush Securities. “The profitability metrics and forecast likely was the swaying factor that might have excluded Tesla this time around.”Tesla shares surged 56% from July 22 through Aug. 31, boosted by a surprise profit for the three months through June that sealed a fourth straight quarter of profitability and paved the way for the stock to be included in the S&P 500. To be eligible for S&P 500 inclusion, a company must also have a market cap of at least $8.2 billion, be listed on an eligible U.S. exchange, and be among the most actively traded.While Tesla didn’t make the S&P 500 this time around, investors may not have to wait long.BRUISING STOCK SELLOFF UNDERSCORES MARKET RISK DURING CORONAVIRUS TURBULENCE“TSLA's addition to the S&P 500 could come as soon as three weeks from now following an S&P Index Committee meeting on September 21, which we believe is likely to prompt a new wave of buying,” wrote CFRA analyst Garrett Nelson, who also points to a Sept. 22 event focused on the electric-car maker's battery technology as a near-term catalyst for shares.Tesla shares have been under pressure since closing at a record high $498.32 on Aug. 31, the first trading day since splitting 5-for-1.Nelson, who attributes the post-split selloff to Tesla's Sept. 1 announcement it would sell up to $5 billion of new stock and to the company’s largest outside shareholder, Edinburgh-based investment manager Baillie Gifford, reducing its stake to less than 5% in order to meet concentration guidelines, thinks shares are headed higher.Story continues“Risk/reward is now skewed to the upside,” he wrote while boosting his price target to $475 a share. “Importantly, the stock's year-to-date run-up has greatly reduced its cost of capital and helped strengthen its balance sheet.”CLICK HERE TO READ MORE ON FOX BUSINESSTesla shares were up 400% this year through Friday, outperforming the S&P 500’s 6.07% gain.Related ArticlesBest Buy Celebrates 50 Yrs With Saleathon; Will It Turn 60?Canadian Solar Is Facing More Challenges Than It AppearsTarget Adds Private Bathrooms to Quell Transgender Debate"}]}