{"article": [{"url": "https://finance.yahoo.com/news/nikola-candal-proves-even-gm-will-do-anything-to-catch-tesla-193531338.html", "published": 1600872200.0, "headline": "The Nikola scandal proves even GM will do anything to catch up to Tesla", "body": "Wednesday, September 23, 2020This article was first featured in Yahoo Finance Tech, a weekly newsletter highlighting our original content on the industry. Get it sent directly to your inbox every Wednesday by 4 p.m. ET. SubscribeTesla just keeps pulling awayEvery automotive company in the world is trying to catch up to Tesla (TSLA).Sure, the electric vehicle manufacturer controlled just 1.13% of total U.S. automotive market share in 2019, Cox Automotive told Yahoo Finance, but automakers ranging from Ford (F) to Honda (HMC) to Toyota (TM) are working feverishly to match something almost more important than Tesla’s sales: its technology.And yet Tesla seems to be moving ever further ahead of the competition. During its Battery Day event on Tuesday, Tesla CEO Elon Musk announced that the automaker plans to build a $25,000 electric car, something that would make electric vehicles far more affordable for average Americans. Tesla’s Model 3, its least expensive model, currently retails for $37,990.Alternative energy vehicle maker Nikola has been accused of committing a vast fraud by short-seller Hindenburg Research, prompting investigations by the SEC and DOJ. (Image: Nikola)“Tesla is really the dominant player, and of course, an electric vehicle pure play, and they are doing some really innovative things on the battery side to get better,” Garrett Nelson, CFRA senior equity analyst, told Yahoo Finance’s The Ticker following the Battery Day event.That kind of progress has automakers doing everything they can in the hopes of topping Musk. Ford originally teamed with EV upstart Rivian for an electric Lincoln SUV, but that has since been canceled. The company does, however, plan to launch an electric version of its Mustang later this year. Honda, meanwhile, tried to get its EV vehicles off the ground in the U.S., but has since killed its only offering, the Clarity EV, due to poor sales.Most recently, GM struck a seemingly outrageous deal with zero-emissions vehicle maker Nikola, which short-selling firm Hindenburg has accused of being a fraud.Yahoo Finance newsletter.A seemingly one-sided dealOn Sept. 8, GM (GM) announced that it was entering into a “strategic” partnership in which it would receive an equity stake in Nikola and manufacture the Nikola Badger pick-up truck.Story continuesThe terms of the deal seemed odd from the jump. Nikola (NKLA) had been touting its fuel cell and EV-powered tractor trailers and Badger pick-up truck, none of which have hit the market. But it wasn’t bringing any of its propulsion technology to bear as part of the tie-up.Instead, GM would take an 11%, roughly $2 billion, stake in Nikola, and then provide the company with its own hydrogen fuel cell and battery technologies. So Nikola was essentially bringing the shell and interior of the Badger and seemingly nothing else.Two days after the deal was announced, Hindenburg published its report and it all hit the fan. The company’s stock has since plummeted 24%.Under the terms of the Nikola and GM deal, GM would provide the propulsion technology and manufacturing capabilities for the Badger pickup. (Image: Nikola)The authors, who acknowledge taking a short position on Nikola, say they have proof of fraud. Hindenburg cites a now-infamous video showing a Nikola truck rolling down a hill rather than under its own power, as well as press conferences where supposedly functioning vehicles were, in fact, plugged into power cords hidden below a stage.Nikola initially pushed back against the claims, calling the Hindenburg report “false and defamatory,” but with founder and chairman Trevor Milton stepping down as of Sunday night, and investigations now reportedly underway by both the Securities and Exchange Commission and Department of Justice, it looks like Hindenburg may have exposed weaknesses in Nikola’s business.It’s an incredible story, and should make quite the best-seller someday, but for now, the problem is all GM’s.When the Hindenburg allegations came to light, just two days after GM announced the Nikola deal, the auto giant pushed back on questions that it didn’t investigate the EV firm enough, claiming it performed “appropriate diligence” prior to the agreement.Since then it has doubled down, saying that it “will work with Nikola to close the transaction we announced nearly two weeks ago to seize the growth opportunities in broader markets with our Hydrotec fuel cell and Ultium battery systems, and to engineer and build the Nikola Badger.”Everyone is racing to catch TeslaSo GM has, more or less, gotten access to a company with a name that apes Tesla’s, which got its own name from the famed electrical engineer, Nikola Tesla. GM also gets federal EV credits, which allow the company to offer tax savings of up to $7,500 on sales of its own electric cars making them more appealing to prospective customers. GM ran out of credits after selling 200,000 plug-in vehicles, which meant consumers were paying more for the company’s electrics than they might at rival services.Of course, beyond a name, credits, and a headache, GM can also use the Badger and Nikola’s trucks to prove its own fuel cell and EV technologies, which in and of itself is incredibly helpful for the automaker.More than anything, though, it proves how desperate massive automakers like GM are to catch up to Tesla’s technological prowess — mainly, its batteries. While Tesla can’t match GM or Toyota or Volkswagen in terms of vehicle output, investors don’t seem too bothered. Tesla’s stock has gone from $86.05 on Jan. 2 to $424.23 as of the market close on Tuesday.Say what you will about Tesla CEO Musk and his ridiculous, even offensive Twitter antics and tendency to overpromise. His firm has made traditional automakers so apoplectic with their inability to touch Tesla’s capabilities that they’re willing to team up with anyone who promises new technologies and gives them a chance to bring down Musk.By Daniel Howley, tech editor. Follow him at @DanielHowleyMore Tech NewsApple analyst explains why the stock is not a ‘buy’Tesla’s value dropped by $50B after Musk said cheaper battery is three years awayAmazon slammed in report for adding ‘largely low-quality' jobs amid coronavirusGoogle-Oracle $9 billion feud faces new uncertainty after Ginsburg's deathMicrosoft’s Bethesda deal is a $7.5 billion part of its plan to crush SonyWalmart hits a grand slam with its TikTok deal with Oracle—Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn,YouTube, and reddit."}]}