{"article": [{"url": "https://finance.yahoo.com/news/nursing-homes-coronavirus-and-funding-woes-155603997.html", "published": 1593501860.0, "headline": "U.S. nursing homes face 'a crisis on top of a crisis' with coronavirus and funding woes", "body": "About 43% of more than 125,000 U.S. coronavirus deaths are linked to nursing homes, according to a New York Times analysis.And even before the pandemic, many of those facilities suffered a lack of funding.“You layer COVID on top of that and... it’s a crisis on top of a crisis,” David Grabowski, a professor of health care policy at Harvard Medical School, told Yahoo Finance. “And that you started with a lot of nursing homes that didn’t have adequate staffing models, weren’t exactly strong at infection control, lacked resources in many, many regards, and then this hits, it’s definitely the industry.”Lori Spencer visits her mom Judie Shape, 81, who Spencer says has tested positive for coronavirus, at Life Care Center of Kirkland in Kirkland, Washington, U.S. March 11, 2020. REUTERS/Jason Redmond‘Underfunded so dramatically’The nursing home industry has been facing a financial shortfall since at least 2013, particularly for non-Medicare margins, according to the American Health Care Association (AHCA).Non-Medicare margins, which refer to “revenues and costs associated with Medicaid and private payers for all lines of business,” declined 3% in 2018, an increase from the year prior.Nursing home margins are declining. (Chart: AHCA)“Over 60% of people in the country that live in nursing facilities are dependent upon Medicaid,” AHCA President and CEO Mark Parkinson told Yahoo Finance. “And unfortunately in most states, the Medicaid rates have been set at less than the actual cost to take care of the residents. So, it makes it very difficult to provide the kind of care that providers want when they’re underfunded so dramatically.”Furthermore, Parkinson added, “most of the people don’t understand that Medicaid is really a middle-class benefit because if people live long enough to outlive their resources, it’s the only way that they can afford to be taken care of in a facility.”Medicaid is a federally-run program that provides health coverage to the elderly, pregnant women, children, people with disabilities, and eligible low-income adults. The federal government, though, allows states to set the payment amounts as long as they meet federal requirements.“The failure to adequately fund Medicaid is primarily a problem with the states,” Parkinson said. “Each state gets to make its own decision on what its reimbursement will be for Medicaid. Although the national average is around $200 a day, the rate varies dramatically by states, and some states are as low as less than $150 a day. In the low funding states, like Illinois and Texas, the politicians just haven’t decided it’s an important enough priority to adequately fund it.”Story continuesRobyn Esaw sits in her a wheelchair in her room at Hammonton Center for Rehabilitation and Nursing amid the coronavirus outbreak in Hammonton, New Jersey. (Robyn Esaw/Handout via REUTERS)The coronavirus effectAccording to the New York Times analysis, “the virus has infected more than 282,000 people at some 12,000 facilities” as of June 26 and killed more than 54,000. There are roughly 15,600 nursing homes in the U.S. with over 1.3 million residents and over 1.6 million staff members.“It’s important to note that COVID hasn’t discriminated so it’s not just those worst-quality nursing homes that have seen cases,” Grabowski said. “It’s been equally apparent across the high quality and low quality facilities, high Medicaid and low Medicaid facilities. We’ve found that it’s really about where you’re located that’s driven these cases.”Adding to the financial strain, testing for coronavirus in the thousands of nursing homes across the country can be extremely expensive: The AHCA and National Center for Assisted Living (NCAL) found that testing every U.S. nursing home resident and staff member just once would cost $440 million.There are over 2.4 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)And as the pandemic continues, more supplies are needed: A recent NCAL survey found that many assisted living communities are running low on PPE such as N95 masks, surgical face masks, face shields, gowns, and gloves.Grabowski stressed that “you really need those resources to manage the outbreak. And many nursing homes in this country lack that. They certainly lack the PPE and the testing to keep it out. But then once in there, they really lack the workforce to manage.”‘A conscious political decision’Why have these financial troubles received so little attention before and during the coronavirus pandemic? According to Parkinson, it’s a “failure to recognize the importance of the elderly.”“It’s a conscious political decision to underfund elder care,” he said. “It’s not defensible on any level, but it’s occurring in the vast majority of states.”Anthony Radzikowski visits his 95 year-old grandmother Ann Bradshaw at the Prospect House Assisted Living Facility where she lives and has been quarantined in Revere, Massachusetts. REUTERS/Brian SnyderGrabowski suggested that one way to put more dollars into Medicaid is by utilizing wage pass-through policies that pass money into the workforce.“There have been some instances with private equity-owned facilities or certain bad actors that haven’t always put all of the dollars back into direct patient care,” Grabowski said. “So I really think that’s important that we earmark or direct those dollars to the caregiver.”With more funding, Parkinson noted, nursing homes can be better prepared for the next health crisis.“If we have adequate funding, we can rebuild nursing homes so that residents aren’t sharing rooms,” he said. “That’s proven to be one of the real challenges of fighting the virus, is that you’ve got people in shared rooms, which makes it very difficult to isolate those that develop symptoms of the virus. So there are a lot of things that can happen, but the fundamental thing is the policymakers just need to decide that the elderly are a priority.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Primary care doctor: 'We should all be very worried' about plunging patient visits amid pandemicCoronavirus spread is like 'lighting a campfire,' doctor explainsHospitals itch to ramp up elective surgery amid coronavirus profit crunchRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}