{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-18-2020-222525471.html", "published": 1597763540.0, "headline": "Stock market news live updates: S&P 500 rises to a record close as stocks regain pandemic-related declines", "body": "The S&P 500 and Nasdaq each closed at record highs Tuesday, with tech shares leading the broader market to regain its pandemic-related losses.[Click here to read what’s moving markets heading into Wednesday, August 19]Walmart and Home Depot shares turned negative despite the companies reporting estimates-topping second-quarter results, after executive commentary around slowing sales growth in the current quarter drove investor jitters.Walmart (WMT) reported second-quarter results that easily topped consensus expectations on both sales and profit, with US comparable same-store sales up 9.3%. E-commerce sales nearly doubled, surging 97% as consumers increasingly turned online to shop during the pandemic. However, the stock traded choppily after gaining in the pre-market session, after company executives said sales growth was normalizing and decelerating during the current quarter, as government stimulus to consumers waned.Home Depot (HD) also delivered better than expected second-quarter results, with comparable sales growth of 23.4% in the three-month period, or more than double the 11.4% growth rate expected. Consumers and professionals alike flocked to the retailer for DIY projects while working from home, and as housing market activity and home-building picked up in late spring. Company executives said on their earnings call Tuesday morning that third-quarter earnings results were holding at second-quarter levels, extinguishing hopes of an extended gain for the home-improvement giant.The S&P 500 in recent days has closed in on, but not quite attained, a fresh record closing high, with the blue-chip index’s advance from its March lows now totaling around 50%. Equity trading over the past week or so has reflected a widening breadth in markets, with cyclicals vying for leadership after a months-long run of outperformance among big tech and “stay-at-home” stocks viewed as more insulated from the negative business impacts of the coronavirus pandemic.Story continues“The path of least resistance seems to be higher for US equities as of late,” Brian Price, head of investment management for Commonwealth Financial Network, said in an email Tuesday morning. “Markets are seemingly encouraged by a nationwide improvement in coronavirus data after a spike in various parts of the country last month. Big tech and certain consumer companies like Amazon continue to do well but we’ve also seen an improvement in relative performance of cyclical and value-oriented names as of late.”“This dynamic should be viewed as healthy for the equity market as wider breadth could be key to determining whether or not stocks will continue their advance,” he added. “There are plenty of risk factors that investors will continue to monitor, such as a resurgence in coronavirus cases, failure to pass another relief bill, and the upcoming elections. Investors are encouraged that we’re back near all-time highs in the market, but they’ll need to stay vigilant for what lies ahead over the coming months.”However, any signs of a full-fledged rotation out of tech names and into other areas of the market have lacked conviction, with the financials and energy sectors once again lagging during Tuesday’s session as investors considered ongoing uncertainty around the pandemic, fiscal stimulus prospects and the presidential elections.“I think the factors around quality – quality growth, strong balance sheets, positive cash flow, dominance in industries, management team – those factors have been leadership factors across all 11 sectors, and I think that will continue to define leadership in this environment,” Liz Ann Sonders, Charles Schwab’s Senior Vice President and Chief Investment Strategist, told Yahoo Finance’s The Ticker on Monday.“We’ve seen these multiple phases, and we had that first phase, that recovery phase from mid-May until the middle of June, when there was that hope that we were seeing a strong recovery. And you saw that leadership shift from just the Covid winners out to the more traditionally cyclical areas, and then more recently we seem to have tried that again,” she added. “We’ve had some fits and starts of tech profit-taking and a move into industrials, financials. But it’s been fleeting so far, and I think the market is sending – and rightly so – a mixed message, an uncertain message about what this next stage in the recovery looks like.”—4:02 p.m. ET: S&P 500, Nasdaq set fresh record closing highs as tech shares gain; Amazon advances 4% to a recordHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +7.78 (+0.23%) to 3,389.77Dow (^DJI): -67.19 (-0.24%) to 27,777.72Nasdaq (^IXIC): +81.12 (+0.73%) to 11,210.84Crude (CL=F): -$0.28 (-0.65%) to $42.61 a barrelGold (GC=F): +$13.00 (+0.65%) to $2,011.70 per ounce10-year Treasury (^TNX): -1.4 bps to yield 0.6690%—3:24 p.m. ET: Stocks mixed as tech shares gains; Amazon tracks toward a record highThe S&P 500 and Nasdaq were positive with less than an hour left in the trading day, as shares of big tech companies gained. Declines in shares of Chevron and JPMorgan Chase led a drop in the 30-stock Dow.Amazon jumped 4% in intraday trading, extending Monday’s 1% advance and putting the e-commerce giant’s stock on track for a record close. The consumer discretionary sector, which contains Amazon, led gains in the S&P 500.—10:44 a.m. ET: Stocks cut gains, S&P 500 and Dow turn negativeThe S&P 500 and Dow each traded lower Tuesday mid-morning, with investors taking some profits after the S&P 500’s record high earlier.Here were the main moves in equity indices, as of 10:44 a.m. ET:S&P 500 (^GSPC): -5.24 points (-0.15%) to 3,376.75Dow (^DJI): -128.98 points (-0.46%) to 27,715.93Nasdaq (^IXIC): +11.83 points (+0.11%) to 11,141.5—9:47 a.m. ET: S&P 500 posts fresh record intraday highThe S&P 500 rose to a fresh record intraday high Tuesday morning, reaching as high as 3,394.22 shortly after market open. This topped the index’s previous record high of 3,393.52 set on Feb. 19 this year. It also represented a rally of about 54% from the S&P 500’s record intraday low set in March.The gain put the S&P 500 on track to close at a record level on Tuesday as well, if advances hold through market close. The S&P 500’s current record closing level of 3,386.15 was also set on Feb. 19.—9:33 a.m. ET: Stocks open higher as earnings boost equitiesHere were the main moves in markets, as of 9:33 a.m. ET:S&P 500 (^GSPC): +7.57 points (+0.22%) to 3,389.56Dow (^DJI): +6.43 points (+0.02%) to 27,851.34Nasdaq (^IXIC): +46.47 points (+0.42%) to 11,176.50Crude (CL=F): -$0.72 (-1.68%) to $42.17 a barrelGold (GC=F): +$21.40 (+1.07%) to $2,020.10 per ounce10-year Treasury (^TNX): -0.8 bps to yield 0.675%—9:08 a.m. ET: Home Depot posts record Q2 sales as consumer DIY projects soarHome Depot’s second-quarter revenue of $38.1 billion marked a record quarterly sum for the company, as the country’s largest home-improvement retailer got a boost from customers doing DIY projects while working from home.Average ticket grew 10% in the second quarter, suggesting bigger trips each time customers went to make purchases from the retailer. Overall customer transactions rose 12.3% in the quarter.Home Depot also beat profit expectations even as it spent an incremental $1.3 billion in the second quarter on enhanced pay and benefits for its employees related to Covid-19. Second-quarter earnings were $4.02 per share, better than the $3.66 expected by consensus analysts.—8:31 a.m. ET: Housing starts surge 23% in July, rising by the most in four years as housing rebound extendsNew-home construction jumped by the most since 2016 in July, unexpectedly surging by double-digit percentages for a third straight month, according to Commerce Department data Tuesday morning.Housing starts rose 22.6% in July over June, following an upwardly revised 17.5% monthly gain in June. This marked the biggest jump since Oct. 2016, and brought housing starts to a seasonally adjusted annualized rate of 1.496 million, or just a bit below February’s pre-pandemic rate of 1.567 million.Building permits rose by the most in 30 years, posting an 18.8% monthly climb. Consensus economists expected building permits, which serve as an indicator of future homebuilding, to rise by just 5.4% in July.—7:29 a.m. ET: Stock futures point to a higher open after strong earningsHere were the main moves in equity markets, as of 7:29 a.m. ET:S&P 500 futures (ES=F): 3,385.5, up 5.75 points, or 0.17%Dow futures (YM=F): 27,870.00, up 95 points, or 0.34%Nasdaq futures (NQ=F): 11,323.75, up 37 points, or 0.33%Crude (CL=F): -$0.19 (-0.44%) to $42.70 a barrelGold (GC=F): +$14.50 (+0.73%) to $2,013.20 per ounce10-year Treasury (^TNX): -0.6 bps to yield 0.677%—7:17 a.m. ET Tuesday: Walmart Q2 results handily top expectations as e-commerce sales soar 97%Walmart (WMT) Tuesday morning reported second-quarter results that easily topped consensus analyst expectations, driven by an ongoing boost in consumer purchases during the pandemic and a near doubling in online sales.Second-quarter adjusted earnings were $1.56 per share on revenue of $137.7 billion, with both metrics better than the $1.24 per share on revenue of $135.6 billion anticipated. Closely watched comparable same-store sales were up 9.3%, also topping consensus estimates. E-commerce sales jumped 97%, reflecting the ongoing pivot in consumer trends toward online shopping.“Q2 sales started strong, both in-store and online, particularly in general merchandise, helped by government stimulus spending,” Walmart said in an investor slide deck Tuesday. “Grocery sales had another strong quarter. As stimulus funds tapered off, sales started to normalize, but July comps still grew more than 4%.”The estimates-topping results came even as the company took a $380 million charge. to restructure its business, including with moves like layoffs.—6:13 p.m. ET Monday: Stock futures open slightly lowerHere were the main moves in equity markets, as of 6:13 p.m. ET:S&P 500 futures (ES=F): 3,378.00, down 1.75 points, or 0.05%Dow futures (YM=F): 27,761.00, down 14 points, or 0.05%Nasdaq futures (NQ=F): 11,285.25, down 1.5 points, or 0.01%A trader makes a phone call outside the New York Stock Exchange (NYSE) on July 20, 2020 at Wall Street in New York City. - Wall Street stocks were mixed early July, 20, 2020 as markets awaited congressional debate on another round of stimulus spending and major earnings releases later in the week. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}