{"article": [{"url": "https://finance.yahoo.com/news/these-10-states-are-suffering-the-slowest-coronavirus-job-market-recoveries-152431815.html", "published": 1596105140.0, "headline": "These 10 states are suffering the slowest coronavirus job market recoveries", "body": "The number of jobs lost due to the coronavirus shutdown continue to mount, with the latest weekly total of Americans applying for unemployment benefits coming in at another 1.4 million.The latest swath of applications brings the total amount of jobless claims to more than 53 million over the past four months, wiping out the 20 million jobs added over the last decade by a near three-to-one margin.While some states have seen unemployment applications plummet from record highs after the coronavirus pandemic roiled America’s employment picture, some have suffered stubbornly high job losses months into the recovery. A Yahoo Finance review of jobless claims data from the U.S. Department of Labor shows that Alaska, Oklahoma, Georgia, Mississippi and California have seen the weakest signs of return to normal and a bottoming out in job losses.Comparing each state’s average weekly jobless claims totals over the past 10 weeks to the 10 weeks beginning March 14, which sparked a record amount of unemployment applications, reveals that those states are stopping the bleeding much slower than others. Contrasting those first 10 weeks of pain to the latest 10-week period shows that the five weakest states have only seen average weekly initial unemployment claims fall by less than 43%. On the complete opposite side of the spectrum, Rhode Island has seen weekly initial jobless claims fall roughly 81% over the same period.Rounding out the 10 states showing the softest recoveries over the period observed were Arkansas, Florida, Wyoming, Maryland and Virginia.Nationally, the total of Americans filing for new unemployment benefits rose for the second consecutive week.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:This $3 billion online education company is seeing a 'paradigm shift' due to coronavirusStory continuesNetflix co-founder brushes off NBC's new Peacock streaming competitorSmall US towns are neglected from coronavirus relief and it's a 'slap in the face': Georgia mayorWhy Costco could see a lasting boost from coronavirus panic buying"}]}