{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-whats-next-for-small-businesses-185249385.html", "published": 1596204020.0, "headline": "Coronavirus stimulus: What's next for small businesses?", "body": "After several days of bipartisan talks, lawmakers on Capitol Hill have yet to come to an agreement on the next round of coronavirus stimulus — leaving out-of-work Americans and struggling small-business owners wondering what will come next.Enhanced unemployment benefits expire on Friday and the Paycheck Protection Program is set to come to an end on Aug. 8. The program was originally scheduled to expire at the end of June, but Congress extended it earlier this summer.“The availability of the paycheck protection loan and all of the other government assistance has been absolutely critical to allow us to continue operating,” said Victoria Lai, owner of Ice Cream Jubilee.Lai owns Ice Cream Jubilee, an ice cream shop with two locations in Washington, D.C., and another in nearby Virginia. When the pandemic hit, she had to temporarily close — but quickly revamped her D.C. storefronts for socially distanced to-go sales and delivery. She applied for a PPP loan to pay her employees and an Economic Injury Disaster Loan to help cover other operating expenses. Lai told Yahoo Finance she’s using the loan to pay 32 workers.‘I can’t grow and sell and I can’t hire’But without more assistance, Lai said she won’t make it through the winter. While the stores remain open, her profit dips in the colder months.“There's a lot of uncertainty about what's going to happen in the second half of 2020,” said Lai. “I can't grow and sell and I can't hire because we just don't know what the virus will bring and what Congress will pass.”Many business owners have now used up their PPP loans and without further assistance may again face the possibility of laying off workers. This week, an NFIB survey found 71% of small-business owners have used their entire PPP loan and 46% will need additional help over the next 12 months.“If business owners like myself had the assurance that there was a second wave of PPP coming up, I could continue pivoting and trying to build my business and build sales, so I could have that cushion for the winter,” said Lai.Story continuesVictoria Lai, owner of Ice Cream Jubilee (Photo: Instagram/Ice Cream Jubilee)Senate Republicans unveiled their opening bid for the next stimulus package this week, calling it the HEALS Act. Part of that plan includes allowing some businesses to take a second PPP loan. On the Senate floor, Sen. Marco Rubio (R-FL) — Chairman of the Senate Small Business Committee — said the government has an obligation to help businesses it forced to shut down for the public good.“Otherwise we will lose not just the backbone of our economy, but the millions of jobs that come with it and the impact would be catastrophic,” said Rubio.Rubio’s plan would allow businesses with fewer than 300 employees and who have seen a 50% drop in revenue to take a second PPP loan. The Republican plan would also allow business owners to use PPP dollars for expenses like personal protective equipment, though 60% of the loan would still have to be used on payroll in order to be forgiven.Sen. Ben Cardin (D-MD), the top Democratic Senator on the Small Business Committee, has proposed allowing businesses with fewer than 100 employees and a 50% drop in revenue to qualify for a second loan. Earlier this week, he told Yahoo Finance he was optimistic that a second round of PPP loans would be included in the next package — though the relief would be much more targeted.“There’s a lot of similarities. I think we all want to do more for those businesses that really need it,” said Cardin on Yahoo Finance’s “On the Move.”But some business groups say the 50% revenue loss requirement is too high and will leave out other businesses that are still struggling. Other lawmakers and lobbying groups want to be sure the next package has a streamlined forgiveness process, so it won’t be costly or overwhelming to small-business owners and smaller lenders.“Businesses and lenders will have to spend billions of dollars to receive the forgiveness promised to them,” said Sen. Kevin Cramer (R-ND) on the Senate floor.The Consumer Bankers Association and other trade associations wrote a letter to congressional leaders on Friday, urging them to pass Cramer’s bipartisan legislation to simplify the forgiveness process. The CBA estimates the move could collectively save small businesses $7 billion.“Small businesses and their employees are the backbone of our nation’s economy and communities. Their time and resources would be better focused on getting the economy safely back up and running, not processing burdensome paperwork,” the associations wrote in the letter.Some Democratic lawmakers also worry that the Republican plan does not contain more money for the Economic Disaster Injury Loan program.“Had I not had the EIDL, I wouldn't have the cashflow to pay for those supplies to continue to have ice cream to sell once my employees did come back through the PPP loan,” said Lai.Rep. Nydia Velazquez (D-NY), the Chair of the House Small Business Committee, told Yahoo Finance the HEALS Act “does not meet the moment.”“But that is why we negotiate. The next COVID-19 relief bill must do more to prioritize and set aside PPP resources for our smallest and most vulnerable businesses, including pumping more capital into the Economic Injury Disaster Loan (EIDL) program—which the HEALS Act fails to do,” said Velazquez in a statement to Yahoo Finance.Sen. Jacky Rosen (D-NV) and Sen. John Cornyn (R-TX) have introduced legislation to put more funding toward EIDL loans and grants.The HEALS Act “fails to provide new funding for the EIDL and EIDL Advance programs, which are immediately in need of capitalization. These two programs have served as lifelines to many of our smallest and most vulnerable businesses, including our minority-owned small businesses across the country,” Rosen said in a statement.While Lai used PPP money to pay her employees, without the EIDL loan, she told Yahoo Finance she wouldn’t have been able to afford supplies she needed to continue operating through the pandemic.UNITED STATES - JULY 29: Sen. Susan Collins, R-Maine, and Sen. Marco Rubio, R-Fla., talk in the Senate subway on Wednesday, July 29, 2020. (Photo By Bill Clark/CQ-Roll Call, Inc via Getty Images)In addition to another round of PPP loans, Senate Republicans have proposed offering long-term, low-interest loans to certain small businesses with fewer than 500 employees. Seasonal employers and businesses in low-income areas would be eligible for the loans, which could be paid back over 20 years at a 1% interest rate. Rubio argues those loans would help minority and underserved communities.‘I hope negotiations fail in terms of new spending’It’s not just negotiations between Republicans and Democrats that Congressional leaders have to worry about. Some Republicans say the HEALS Act and its roughly $1 trillion price tag is too expensive. Sen. Ron Johnson (R-WI) told Yahoo Finance he won’t approve any additional stimulus money.“I hope the negotiations fail in terms of new spending. I hope they succeed from a standpoint of taking a look at what we've already done and just spending that money in a much more intelligent, more directed way,” said Johnson in an interview with Yahoo Finance.Johnson suggests the better way to help businesses is by repurposing money from the CARES Act, to give grants to employers who offer workers employee stock ownership plans.“I think this will reduce income inequality, I think ownership in a business by the people who work for it is a good thing,” said Johnson.Lai urges lawmakers to keep income inequality in mind as they consider their next move — especially after seeing the list of high-profile names that received the first round of PPP loans.“Take a close look at the recipients of the PPP and the employers and the employees that can help lessen the gap of inequality that's rising in our communities because of the pandemic and because of the shutdowns,” said Lai. “I think that small independent stores like Ice Cream Jubilee, that aren't corporate chains that don't have private equity backing, and you know, large cash flow lines that are family business is built on savings... Look at those and help those employers that help wage employees first.”Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:White House, Senate GOP continue to debate stimulus plan as jobless claims riseTwitter hack highlights concerns about disinformation, election securityThe $600 boost in unemployment benefits expires soon. What comes next?Most Americans would not sue over COVID-19 exposure: pollMajority of Americans think Congress should extend enhanced unemployment benefits past July: pollCoronavirus response: What Washington has accomplished and what's next"}]}