{"article": [{"url": "https://finance.yahoo.com/news/more-icloud-storage-125157013.html", "published": 1601107160.0, "headline": "How to get more iCloud storage", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's Tech Support tip:How to get more iCloud storage.Ah, Apple’s (AAPL) iCloud. Never has a service been so incredibly helpful and annoying at the same time. Sure, saving your photos and important documents in the cloud ensures their safety if your iPhone bites the dust, but those notifications that you’re running out of storage are insufferable.I get it, I’m low on space. Just let me Google when Reese’s Peanut Butter Cups were invented in peace!It was 1928, by the way.Thankfully, there are a few ways to free up your iCloud storage, and even get more, so you never have to deal with those notifications again.Yahoo Finance newsletter.Free up space by deleting photosWhen you create an iCloud account, Apple automatically gives you 5GB of free storage. That’s helpful when you’re just getting things started, but not nearly enough for most people who use their phones for everything from movies and games to taking thousands of photos.If you’re receiving notifications that you’re running low on storage, you’re likely filing your iCloud account up with too many pictures. There’s a way to get around that, though.On your iPhone, open the Settings app and tap Apple ID, iCloud, Media & Purchases at the top of the screen.Tap Apple ID, iCloud, Media & Purchases to access your iCloud settings. (Image: Howley)Tap the iCloud tab and you’ll be able to see which apps are eating into your storage the most.Tap iCloud to access your settings. (Image: Howley)If your pictures are the culprit, tap Photos and flip the slider next to iCloud Photos to the off position. This will keep your phone from automatically backing up all of your pictures to the cloud.If your photos are taking up too much space, adjust their settings. (Image: Howley)Fair warning, though. It’s incredibly risky to rely solely on your iPhone or any other single device to store all of your pictures. Leave it on a bus, or otherwise break your phone, and those photos are gone forever.Story continuesIf you’re worried about that, you can enable My Photo Stream, which saves your photos taken over the last 30 days. You can then access them from another device, like your Mac, and download them for safe keeping.Delete old iCloud backupsYou should always let your iPhone automatically back itself up to iCloud. This saves all of your information in case you lose your device, or want to transfer it to a new phone. But if you’ve had a few iPhones already, chances are you’ve also got old, unnecessary backups still taking up space in iCloud.To delete them, open the Settings app, select Apple ID, iCloud, Media & Purchases, and choose iCloud.Tap iCloud to access your settings. (Image: Howley)Tap Manage Storage, and select Backups.Your iCloud backups can take up a lot of storage space. (Image: Howley)From here you can see all of your previous iPhone and iPad backups. Delete the ones that are for your older phones or tablets, and you should end up saving a good amount of space.Delete old text messagesIf your text messages are being backed up, they can also take up plenty of storage.To deal with that, you can go into the same Manage Storage tap and select Messages.Messages use a lot of storage, but i you delete them, they're gone forever. (Image: Howley)From here, you can disable and delete iCloud backups, or view your top conversations to see which are using the most storage. Delete those—you’ll lose any images or videos sent back and forth—and you could free up several gigabytes worth of data.Remove apps from iCloudWhile removing your texts and photos from iCloud, you likely noticed that a number of apps are also using the service. Thankfully, you can delete those without much issue if you’re not using them.To do that, Go to the iCloud page in the Settings app, tap Manage Storage and select the app you want to remove. You can delete all of the data the app has backed up, or choose which documents you want to get rid of individually.Buy more iCloud storageThis might not be the answer you want to hear, but it’s much easier to simply buy more iCloud storage than risk losing photos or text messages. Doing so is also surprisingly inexpensive.To buy more iCloud storage, go to the iCloud tab under Apple ID, iCloud, Media & Purchases under settings and choose Manage Storage.Buying more storage is usually the best way to deal with the situation, and gives you peace of mind knowing that your data is secured in the cloud. (Image: Howley)Tap Change Storage Plan and select the plan you want to purchase.I subscribe to a 50GB plan for $0.99 per month, and haven’t had an issue with space since. If you need more, you can get 200GB for $2.99 per month or even 2TB of $9.99 per month.For most people, 50GB per month should be fine. If not, opt for the 200GB option. You’ll rarely need anything more than that unless you’re doing some serious file storage.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Microsoft’s Xbox boss: Video games undergoing the ‘same transformation’ as TV and music didThe Nikola scandal proves even GM will do anything to catch TeslaMicrosoft’s Bethesda deal is a $7.5 billion part of its plan to crush SonyPaying too much for cable? Here’s how to save.Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}