{"article": [{"url": "https://finance.yahoo.com/news/factbox-norwegian-oil-workers-pay-152620280.html", "published": 1602239660.0, "headline": "Factbox: How Norwegian oil workers' pay compares to other countries", "body": "By Bozorgmehr Sharafedin and Nerijus AdomaitisLONDON/OSLO (Reuters) - Oil and gas is seen as a sector that offers relatively attractive pay, although average wages vary significantly from one country to another.While workers in Norway are currently on strike over pay, they are among the highest paid in Europe, data shows, and receive double the salary of workers in Latin America. Still, they are far less well paid than Australian or American workers.Following are details of how pay compares.NORWAYThe average salary of full-time employees in oil and gas extraction, including support activities, in Norway was around 930,000 crowns, or $100,000, in 2019, according to Norway’s statistics office. The figure includes allowances and bonuses, and excludes overtime.Norwegian workers' union Lederne called a strike that began on Sept. 30, demanding higher wage rises this year than proposed by oil companies and equal pay and conditions for workers at onshore remote control rooms and offshore workers.Latest data from Lederne shows that oil and gas workers in Norway earned around 915,000 crowns, or $98,000, in 2018, and that its members employed at oil and gas firms earned around 25% more than the average salary of workers across all industries in Norway.WELDERS, ENGINEERS, RIGGERSData provided by Rystad Energy also showed oil engineers and welders in Norway were on a higher pay rate than workers in the United Kingdom and South Korea.Average pay for oil engineers was $50 per hour in Norway, while it was less than $30 in the United Kingdom, but more than $60 in the United States.Welders in Norway, with a $30 hourly rate, were paid more than U.S., British and South Korean workers.Riggers received less than $30 per hours in Norway, on a par with U.S. and South Korean workers.AUSTRALIA/NZ TOPOil and gas workers in Australia, New Zealand and neighbouring islands are the highest paid in the world, drawing an average annual salary of $140,000, according to staffing firm Airswift's Global Energy Talent Index Report for 2020.Story continuesWorkers in North America are the second highest paid in the world with an annual salary of $112,000, according to the Global Energy Talent Index Report, while average annual pay in Europe is around $82,500.Workers in Latin America on average receive $48,000, one of the lowest levels in the oil and gas sector worldwide.UNION INFLUENCE\"Regional unionisation has a big influence on salary fluctuations,\" said Matthew Fitzsimmons, vice president for cost analysis at Rystad Energy, an independent energy research firm.\"For example, while labour rates have come down in the United States, oil and gas labour rates have stayed constant for the majority of cases in Canada due to a high degree of unionisation in the country,\" he said.CURRENCY IMPACTEarnings of Norwegian oil and gas workers rose by nearly 10% from 2015 to 2019, according to Norway's statistics office.Although Norwegian workers are among the best paid in Europe, their salaries have fallen in recent years relative to other regions, mainly due to the weakening of the Norwegian crown against the U.S. dollar.Since the end of 2014, the year when oil prices collapsed, the Norwegian crown has weakened by 50% against the dollar.(Reporting by Bozorgmehr Sharafedin; Editing by Susan Fenton and Mark Potter)"}]}