{"article": [{"url": "https://finance.yahoo.com/news/smarkets-kenosha-portland-chaos-boost-trumps-chances-as-bidens-yawning-lead-falls-apart-153149210.html", "published": 1599238820.0, "headline": "How US recovery, chaos in Kenosha and Portland is helping Trump to blunt Biden 'steamroller'", "body": "A long, hot summer of unrest — and a resilient economy — may be helping President Donald Trump reclaim lost ground, with predictive market data suggesting that the “steamroller” effect once bolstering Democratic nominee Joe Biden has eroded.Currently, the former vice president enjoys a comfortable lead in national polls and is still broadly favored to win in November. However, the president has steadily narrowed his challenger’s advantage, with betting markets this week showing Biden and Trump moving into toss-up territory.Smarkets has both candidates locked in a virtual tie — a dramatic swing from last month’s 28-point Biden advantage — while US-Bookies.com data showed Trump was once again favored to win reelection, for the first time in nearly 3 months.U.S. President Donald Trump speaks during a news conference the White House on September 4, 2020 in Washington, DC. (Photo: Drew Angerer/Getty Images)‘This kind of steamroller of Biden’s momentum’The chaotic aftermath of the COVID-19 pandemic, combined with months of protests against social injustice, inverted what was once Trump’s strongest incumbent asset: A strong economy. However, riots currently roiling the cities of Portland, Seattle, and Kenosha have scrambled the race, highlighting the president’s emphasis on law and order.Meanwhile, a surprisingly durable recovery has turbocharged consumer spending — which is 70% of U.S. gross domestic product — and helped the jobs market to defy some of the gloomiest predictions made earlier in the crisis. The economy created a robust 1.37 million jobs in August, with the unemployment rate tumbling to 8.4%.Simultaneously, Trump has quietly retaken the offensive in several key swing states, according to a Real Clear Politics average, which has reflected a slow erosion in the advantage enjoyed by Democrats earlier this year.Democratic vice presidential candidate Senator Kamala Harris listens as presidential candidate and former Vice President Joe Biden speaks at a campaign event, their first joint appearance since Biden named Harris as his running mate, at Alexis Dupont High School in Wilmington, Delaware, U.S., August 12, 2020. REUTERS/Carlos Barria“What it looked like was this kind of steamroller of Biden’s momentum, taking us up to the election,” Sarbjit Bakhshi, Smarkets’ head of political markets, told Yahoo Finance in an interview. That impetus has now “fallen apart” with his chances now little more than a toss-up.Story continuesSmarkets projects Biden to win 302 electoral college votes to Trump’s 236, though that advantage has dwindled by 10 since last week.The violent unrest reverberating across major American cities has sparked some angst among Democrats. Ed Rendell, the former Pennsylvania governor and a Biden ally, suggested to The Washington Post that moderates and independents might recoil from a campaign that soft-pedaled the violence.A week after rioting in response to the police shooting of Jacob Blake, the rubble of burned cars still decorate downtown, September 2, 2020 on Kenosha, Wisconsin. (Photo by Andrew Lichtenstein/Corbis via Getty Images)“What we were afraid of is moderates saying, ‘I hate Donald Trump, but I need to be safe. I have to hold my nose and vote for him,’” Rendell told the publication.Trump’s revival among predictive investors is a reflection of polling data that show his numbers inching up, albeit from a low base, and raises the possibility of a photo finish in November.The data coincide with an economic recovery that, while having lost momentum, is still continuing to grow since the onset of the COVID-19 pandemic. In spite of the aftermath of the coronavirus crisis, Trump receives consistently higher marks on the economy than his predecessors, polling data show.“The U.S. unemployment deterioration in the face of lockdowns was sharper than most, and so has been the subsequent improvement,” said Alan Ruskin, Deutsche Bank’s macro strategist, in a note to clients on Friday. “Of developed economies, the U.S. has the best change in the unemployment rate over the last three months, but still the worst in the last year.”The US economy added a greater than expected number of payrolls in August, and the unemployment rate improved by a greater than expected margin. (David Foster/Yahoo Finance)A close election would likely amplify Trump’s unfounded accusations that fraud — stemming primarily from mail-in votes — was responsible for his loss. The market’s users estimate there’s a 30% chance that Trump will refuse to concede, something political watchers believe is a growing possibility.“If it’s a completely fair election, I think Biden has a 70% chance of winning,” Eurasia Group president Ian Bremmer said last week. “In other words, a significant lead, but it’s still close.”The ebb and flow of polling and predictive data have heightened what some observers fear could be a huge source of market anxiety. Investors are growing increasingly unnerved by political risk, and the prospect of a result that could drag beyond Election Day.Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news"}]}