{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-25-2020-221532895.html", "published": 1593098000.0, "headline": "Stock market news live updates: Stocks choppy after Texas halts reopening process, citing rising infections", "body": "Stocks rose heading into market close Thursday, with financials leading advances after regulators eased some post-financial crisis restrictions for big banks.[Click here to read what’s moving markets heading into Friday, June 25]Earlier, stocks traded choppily after Texas said it was pausing its reopening process due to a renewed surge in Covid-19 infections in the state. Investors also monitored incoming economic data, with a new report showing stubbornly high levels of new unemployment claims.New unemployment claims came in at 1.48 million for the week ending June 20, marking the fourteenth straight week that claims held above one million. Consensus economists had expected new claims to total 1.32 million. Since mid-March, new jobless claims totaled more than 47 million.“Jobless claims are not falling fast enough. Everything we have seen in the last week or two between rising case counts/hospitalizations, stalling economic progress in some important states, government job cuts, means one thing: the Phase 4 of fiscal stimulus must be bigger,” Neil Dutta, head of economics at Renaissance Macro Research, said in an email. “Things should be better in 3-4 weeks, but the news will get worse before it gets better.”The risk-off mood came after some states in the South and West reported more increases in new coronavirus cases.California reported more than 7,100 new cases – a one-day record by far for the state – while Florida and Texas also reported record jumps in new cases at more than 5,500 each as of Wednesday’s counts.New York, once the nation’s epicenter of new coronavirus cases, along with New Jersey and Connecticut called for a 14-day quarantine for visitors traveling from many of the states seeing major jumps in new cases.With the pandemic still ongoing, the International Monetary Fund on Wednesday slashed its outlook for 2020 global growth to a record low estimate of -4.9%, down from its April estimate of -3%. US global growth is expected to fall by 8.0% in 2020, down from a previous forecast of -5.9%, before rising by 4.5% in 2021.Story continues—4:03 p.m. ET: Stocks shake off earlier declines after Texas halts reopening, ending up for the dayHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +33.40 (+1.09%) to 3,083.73Dow (^DJI): +299.73 (+1.18%) to 25,745.67Nasdaq (^IXIC): +107.84 (+1.09%) to 10,017.00Crude (CL=F): +$1.02 (+2.68%) to $39.03 a barrelGold (GC=F): -$2.80 (-0.16%) to $1,772.30 per ounce10-year Treasury (^TNX): -1 bps to yield 0.6740%—3:19 p.m. ET: Apple set to close more stores in FloridaApple (AAPL) said it would be closing 14 retail locations in Florida starting on Friday due to rising coronavirus infections in the state. The company now has re-closed 32 stores across the country.Earlier this week, Apple said it intended to close seven stores in the Houston, Texas area, as that state grappled with a surge in new infections and hospitalizations. The iPhone-maker also announced re-closures of 11 stores across Florida, Arizona, South Carolina and North Carolina last week.—11:47 a.m. ET: Texas announces halt of phased reopening processTexas Gov. Greg Abbott said Thursday just before noon eastern that Texas will temporarily pause any further reopening of state businesses due to the recent increase in virus infections and hospitalizations.Texas had announced the third phase of its reopening process earlier this month, which allowed most businesses including restaurants, bars and amusement parks to open and expand some capacity.“As we experience an increase in both positive COVID-19 cases and hospitalizations, we are focused on strategies that slow the spread of this virus while also allowing Texans to continue earning a paycheck to support their families,” Abbott said in a statement. “The last thing we want to do as a state is go backwards and close down businesses. This temporary pause will help our state corral the spread until we can safely enter the next phase of opening our state for business.”—11:42 a.m. ET: Stocks fall anewHere were the main moves in markets, as of 11:42 a.m. ET:S&P 500 (^GSPC): -13.86 points (-0.45%) to 3,036.47Dow (^DJI): -110.35 points (-0.43%) to 25,335.59Nasdaq (^IXIC): -18.55 points (-0.19%) to 9,892.26Crude (CL=F): +$0.39 (+1.03%) to $38.40 a barrelGold (GC=F): -$7.70 (-0.43%) to $1,767.40 per ounce10-year Treasury (^TNX): -1.5 bps to yield 0.669%—10:40 a.m. ET: Texas Gov. Greg Abbott suspends elective surgeries in major cities across the state amid virus spikeTexas Gov. Greg Abbott issued an executive order suspending elective surgeries in major cities in Texas, as a resurgence of virus cases swept the state. The order applies to elective surgeries at hospitals in Bexar, Dallas, Harris, and Travis counties.“As Texas faces a rise in COVID-19 cases, we are focused on both slowing the spread of this virus and maintaining sufficient hospital capacity for COVID-19 patients,” Abbott said in a statement. “These four counties have experienced significant increases in people being hospitalized due to COVID-19 and today’s action is a precautionary step to help ensure that the hospitals in these counties continue to have ample supply of available beds to treat COVID-19 patients.—10:35 a.m. ET: Stocks turn positive, shaking off earlier lossesThe three major indices pushed into positive territory Thursday morning after opening lower. The Financial and Energy sectors led gains in the S&P 500, with each rallying more than 1.5%. Goldman Sachs, JPMorgan Chase and American Express led gains in the Dow.—9:36 a.m. ET: Stocks open lowerHere were the main moves in markets, as of 9:37 a.m. ET:S&P 500 (^GSPC): -6.06 points (-0.2%) to 3,044.27Dow (^DJI): -92.37 points (-0.36%) to 25,353.57Nasdaq (^IXIC): -9.06 points (-0.11%) to 9,896.84Crude (CL=F): -$0.2 (-0.53%) to $37.81 a barrelGold (GC=F): -$1.90 (-0.11%) to $1,773.20 per ounce10-year Treasury (^TNX): -2 bps to yield 0.664%—8:56 a.m. ET: New York hospitalizations drop below 1,000 for the first time since March 18New York Governor Andrew Cuomo said Thursday that the state hit a “new milestone,” with hospitalizations dropping below the 1,000-mark for the first time since mid-March.The state, once the US epicenter of the outbreak, has been gradually reopening businesses over the past several weeks, with new cases, hospitalizations and deaths trending lower state-wide and in New York City after more than two months’ worth of social distancing restrictions.BREAKING: Today NY reached a new milestone.Total hospitalizations fell to 996 — dropping below 1K for the first time since March 18th.Together we bent the curve. And we aren’t stopping now.Wear a mask. Keep 6 feet apart. Wash hands. Stay smart.#NewYorkTough— Andrew Cuomo (@NYGovCuomo) June 25, 2020—8:32 a.m. ET: Durable goods orders rise 15.8% in May, topping expectationsOrders for durable goods, or products intended to last three years or more, rose by a greater than expected margin in May, according to the Census Bureau’s preliminary monthly report. These orders rose 15.8% in May versus a 10.5% increase expected. The jump marked the biggest increase since July 2014.In April, durable goods orders fell by a downwardly revised 18.1%, which had been the biggest drop since August 2014.Core capital goods orders, which exclude aircraft and military goods and serve as a closely watched proxy for business spending plans, rose 2.3%, or more than double consensus expectations.—8:30 a.m. ET: New jobless claims totaled 1.48 million last week, vs. 1.32 million expectedNew weekly unemployment insurance claims totaled 1.48 million for the week ended June 20, the Labor Department said Thursday. This was above estimates for 1.32 million, according to Bloomberg consensus data.The previous week’s new unemployment insurance claims were revised up slightly to 1.54 million, from the 1.508 million previously reported.Continuing unemployment insurance claims fell more than expected for the week ended June 13. These declined to 19.522 million, from the previous week’s 20.289 million.—7:23 a.m. ET: Stock futures mostly lower ahead of the opening bellHere were the main moves in markets, as of 7:23 a.m. ET:S&P 500 futures (ES=F): 3,039.75, down 9.25 points or 0.3%Dow futures (YM=F): 25,285.00, down 108 points, or 0.43%Nasdaq futures (NQ=F): 10,014.75, up 4 points, or 0.04%Crude (CL=F): -$0.44 (-1.16%) to $37.57 a barrelGold (GC=F): -$2.90 (-0.16%) to $1,772.20 per ounce10-year Treasury (^TNX): -1.8 bps to yield 0.666%—6:05 p.m. ET: Stock futures slightly higher after selloffHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:05 p.m. ET:S&P 500 futures (ES=F): 3,051.5, up 2.5 points or 0.07%Dow futures (YM=F): 25,421.00, up 28 points, or 0.11%Nasdaq futures (NQ=F): 10,020.75, up 10 points, or 0.1%NEW YORK, NEW YORK - MARCH 20: Traders, some in medical masks, work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}