{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-novavax-gets-16-b-boost-in-vaccine-race-as-fda-vows-no-short-cuts-163518330.html", "published": 1594139060.0, "headline": "Coronavirus update: US moves to end WHO membership; Brazil's Bolsonaro tests positive", "body": "The Trump administration on Tuesday began the process of formally withdrawing from the World Health Organization, making good on its vow to revoke support for the embattled agency for botching its response to the coronavirus crisis that’s infected nearly 12 million globally.Multiple outlets reported that the White House gave notice to the WHO, the first step in what is expected to be a yearlong process of cutting aid to the United Nations-sponsored organization, as the world grapples with a pandemic that’s claims more victims on a daily basis.New Jersey Democratic Senator Bob Menendez appeared to confirm the move on Twitter, where he joined public health officials in blasting the administration’s actions.Congress received notification that POTUS officially withdrew the U.S. from the @WHO in the midst of a pandemic.To call Trump’s response to COVID chaotic & incoherent doesn't do it justice. This won't protect American lives or interests—it leaves Americans sick & America alone.— Senator Bob Menendez (@SenatorMenendez) July 7, 2020“Not only is this the WORST time do so, in the middle of a global public health emergency, let's not forget that the U.S. is driving the COVID-19 pandemic with [the number] of infections & deaths,” wrote Leana Wen, a physician and health policy expert at George Washington University, on Twitter. “Collaboration and learning is key,” she added.The move represented a sharp escalation in an increasingly acrimonious fight between the world’s largest economy and a high-profile international organization that even some proponents acknowledge has mishandled its response to the outbreak. President Donald Trump has been a fierce critic of the agency, accusing its leadership of being too deferential to China as the COVID-19 crisis leapfrogged around the world after being discovered in Wuhan.Story continuesHowever, even those supportive of the agency have faulted the WHO for its handling of the outbreak. Dr. Anthony Fauci, the top U.S. infectious disease specialist, told Yahoo Finance in a recent interview that the agency was “imperfect” but still essential in the fight against global health crises.The WHO has come under sustained criticism from within the scientific community for being slow to recognize the spread of COVID-19 by people who don’t manifest physical symptoms, as well as resisting evidence of the growing importance of airborne infections.Bolsonaro tests positiveSeparately, Brazilian President Jair Bolsonaro, a Trump ally who has shared his resistance to public health efforts to contain the novel coronavirus, revealed on Tuesday that he had tested positive for COVID-19.Brazil’s surging coronavirus infections has made the country a global epicenter of the pandemic, and the president is only the latest political official to contract the disease. British Prime Minister Boris Johnson had a severe case in April that required hospitalization; meanwhile in the U.S., Atlanta Mayor Keisha Lance Bottoms also revealed on Monday she had tested positive.Bolsonaro — who like Trump has repeatedly minimized the public masking and other measures associated with reducing the spread — announced to reporters that he got tested Monday evening, after experiencing symptoms associated with the virus.As the virus ravages Latin America’s largest economy, several Bolsonaro aides have also tested positive for the disease. His skepticism about its severity has put him in the same company as Trump — who is also under mounting pressure as U.S. deaths and diagnoses skyrocket.Brazil and the U.S. are two of the world’s largest COVID-19 hot zones, with nearly 5 million diagnoses combined, according to Johns Hopkins data. America’s inability to flatten its curve has put growing hopes on finding effective treatments.On Tuesday, those efforts got a boost as the U.S. government awarded Novavax (NVAX) $1.6 billion to test and manufacture a potential vaccine as part of “Operation Warp Speed” — a publicly-funded initiative to develop a treatment on an accelerated timetable.Novavax is considered one of the frontrunners in the global race to find a COVID-19 cure, and is pushing to have 100 million doses available by early 2021 — or as early as this year.“We're halfway through the trial. we expect to have human data, results, safety and response by the end of this month,” Stanley Erck, Novavax CEO & president, told Yahoo Finance in an interview. If all goes well in phase 3 of the vaccine trial, production could start by year’s end, he added.The urgency to produce a vaccine comes as investors are increasingly betting on a rebound, while U.S. officials are struggling to balance the restoration of public life against a case spikes that are threatening more lockdowns.The battle to contain COVID-19 has shifted from coastal epicenters to Sun Belt States like California, Texas, Florida and Arizona — which on Tuesday reported a record number of deaths on Tuesday — are seeing record cases and surging hospitalization rates.The end of restrictive stay-at-home orders has been complicated by data suggesting the virus spreads far more aggressively indoors than outdoors. If true, the dynamic has major implications to reopen dining establishments, gyms, theaters, and schools, among other venues.In the face of mounting pressure, the WHO on Tuesday acknowledged \"emerging evidence\" that the novel virus spreads via air — particularly in enclosed spaces with poor ventilation. WHO expert Benedetta Allegranzi told a group of reporters at a briefing that the agency was “open to the evidence on modes of transmission\" of COVID-19.Cases outside New York are spiking. (Graphic: David Foster/Yahoo Finance)FDA vows no ‘cut corners’ in vaccine raceAs the global vaccine race continues, a condensed timeline has spurred concerns about the safety of any successful candidate. Polls show Americans are concerned about the sped up timeline.But FDA Commissioner Stephen Hahn has repeatedly assured the American public that the regulatory body “will not cut corners” when it comes to the vaccine approval process.“We have not lost sight of our responsibility to the American people to maintain our regulatory independence and ensure our decisions related to all medical products, including COVID-19 vaccines, are based on science and the available data,” Hahn said in a recent statement.He reiterated the commitment at a Senate committee hearing last week, just as the FDA released its guidelines for what it would consider an acceptable vaccine. That included a 50% effectiveness rate, which is slightly better than the flu ( 40%-60%) but worse than the measles (97%), based on CDC data.While the guidelines back Hahn’s commitment, other officials have been far more optimistic and provided more aggressive timelines.President Donald Trump and Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, have both been optimistic about a vaccine by the end of the year.Fauci has repeatedly suggested a timeline for an “efficacy signal” anywhere from September to early winter. Yet Hahn has refused to commit to a timeline“I can’t predict when a vaccine will be available,” he told ABC’s “This Week” in an interview. “We want to be very clear, our solemn promise to the American people is we will make a decision based upon the data and science.”Former FDA official Henry Miller told Yahoo Finance that Hahn public remarks suggested a way to ward off White House pressure ahead of the November election.“This is Hahn’s bulwark against being pressured into approving a vaccine too early,” Miller said.The FDA guidelines being released was itself a “kind of insurance policy for Hahn, immunizing him from being pressured by the White House,” likely because Hahn doesn’t want to be part of a “pre-election October Surprise,” Miller said.Of course, there is also the small chance that none of the early vaccines are effective, or that newer generations of vaccines will be needed, even as research points to the virus already mutating."}]}