{"article": [{"url": "https://finance.yahoo.com/news/apple-new-mac-os-biggest-design-upgrade-since-introduction-of-mac-os-x-211013280.html", "published": 1592842700.0, "headline": "Apple: New macOS 'biggest design upgrade since introduction of Mac OS X'", "body": "Apple’s iOS may be the most important operating system that got updated, but it wasn’t the only one.At its WWDC event, held virtually this year due to the coronavirus, Apple (AAPL) launched new macOS and iPad OS upgrades.The new macOS, which Apple called the biggest update since “Mac Os X” launched is called Big Sur. Design-wise, the company redid much of the shapes, icons, and slightly tweaked the layout. But to many it may look incremental, given that some of the designs often added to the desktops and notebooks come from the mobile platform of iOS.The design is pretty and appears to enhance user-friendliness, but the bigger changes come in tweaks to many of the foundational apps in the operating system that aren’t really technically the operating system, like Safari, Mail, and Messages.Apple has an all-new iOS for iPad with some new features. (Apple)Apple says the new Safari browser is 50% faster than Google Chrome and that it has a new suite of features to help protect people’s data, a “privacy-first” experience that shows trackers.Messages, Mail, and the rest of Safari for desktop expand as they do for the new iOS features, narrowing the gap between devices.The new release of macOS and iPad OS takes the iPhone software and optimizes it for iPad by adding a suite of device-specific features, like a universal search feature that fuses web search, in-app search and on-device search all into one, and enhanced functionality for Apple’s stylus, the Pencil. Apple added better handwriting recognition and copy and paste abilities to allow people to avoid putting down the stylus, pausing their tasks, to do things like edit.There may have been nothing that will blow away a Mac or iOS user in these releases, but the incremental improvements have an increasingly powerful idea in common: the fact that devices are designed to work together smoothly, making product transitions more efficient.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Apple: use our stuff over Google’s if you care about privacyApple is ditching Intel to build its own processors for its MacBook and iMac systemsApple Watch finally gets sleep tracking, plus hand-washing featureApple debuts iOS 14, hitting iPhones later this yearFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"}]}