{"article": [{"url": "https://finance.yahoo.com/news/lyft-q2-earnings-2020-164346688.html", "published": 1597245380.0, "headline": "Lyft revenue plummets 61% as pandemic crushes ride-sharing industry", "body": "Lyft reported its Q2 2020 earnings after the bell on Wednesday, with revenue plummeting 61% during its first full quarter contending with coronavirus-induced lockdowns.These are the most important numbers from the quarter compared to what analysts were expecting as compiled by Bloomberg.Ride-sharing services like Lyft have been hit particularly hard by the pandemic. (Photo by Mario Tama/Getty Images)Revenue: $339.3 million versus $334.5 million expected.Losses per share: $1.41 versus $1.51 expected.Active riders: 8.69 million versus 10.5 million expected.Revenue per active rider: $39.06 versus $35.83 expected.Without entertainment options and with many offices still closed, there have been far fewer reasons to jump into a Lyft (LYFT) during the ongoing pandemic.“While rideshare rides in the quarter were down significantly year-over-year, we are encouraged by the recovery trends we are beginning to see, with monthly rideshare rides in July up 78% compared to April,” CEO Logan Green wrote in the company’s press release.“Lyft’s second quarter results reflect an operating environment that was not only challenging for our core ridesharing business, but also for our valued riders and drivers and the communities we serve. Our performance reinforces our belief that Lyft is taking on the critical work necessary to emerge from the crisis as a stronger company.”(AP Photo/Matt Rourke)Uber suffered a similarly rough quarter, with the company reporting a 73% drop in gross ride bookings in constant currency. But Uber (UBER) was able to buttress its report with growth in its Eats delivery segment, which grew an impressive 113% as consumers turned to take-out meals as an alternative to restaurant service.Lyft doesn’t have a food delivery arm, but the company did attempt to provide its drivers with additional revenue streams by setting up a program through which they could deliver essential goods to health-care workers, government officials, nonprofits, and businesses in need.As the pandemic sank its hooks into the U.S., Lyft, like Uber, made significant job cuts, reducing its workforce by roughly 17%, or 982 jobs, and furloughing another 288 employees as of April 29. Uber, meanwhile, cut 14% of its workforce, or about 3,700 jobs, with the bulk coming from its customer support and recruiting divisions.Story continuesUber and Lyft are also dealing with California’s Assembly Bill 5, which requires Uber and Lyft to treat their drivers like employees with benefits rather than contractors. On Monday, a California judge ruled that the two companies must comply with the law, which was passed last year and could have lasting impacts on so-called gig-economy workers.Uber and Lyft have said they will appeal the ruling. Uber CEO Dara Khosrowshahi took the step of writing an op-ed in The New York Times saying that lawmakers need to pass a new piece of legislation that would force all gig economy companies to pay into a pot that would provide benefits to gig workers.On Wednesday, Khosrowshahi said that Uber may temporarily halt operations in California due to the judge’s ruling.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Microsoft’s Surface Duo dual-screen smartphone coming Sept. 10 for $1,399Free time and ‘Fortnite’: How coronavirus changed video game industry foreverFacebook and Microsoft, smelling blood in the water, clash with Apple amid antitrust probesSamsung debuts Galaxy Note 20 and Note 20 Ultra smartphonesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}