{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-pfizer-starts-phase-3-trial-as-fauci-voices-optimism-on-vaccine-timeline-173341313.html", "published": 1595940080.0, "headline": "Coronavirus update: Pfizer starts Phase 3 trial as Fauci voices optimism on vaccine timeline", "body": "The global search for a coronavirus vaccine appears to be taking flight, with a number of drug companies pressing ahead with clinical trials — including a late announcement from Pfizer (PFE) entering Phase 3 with one of its candidates developed with BioNTech (BNTX).Progress on an effective COVID-19 inoculation comes as the virus continues to claim new victims worldwide, while the U.S. fights an uphill battle to contain a surge in confirmed cases. Vaccines remain a key to ending the severe restrictions on public life, which include public mask-wearing and social distancing — all of which have become flashpoints in U.S. political discourse.Yet the headway on vaccines has made Anthony Fauci, the federal government’s top infectious disease expert, “cautiously optimistic” that a potential vaccine candidate could emerge by late fall, he said on Tuesday. In a recent Yahoo Finance interview, Fauci said the accelerated push was “worth it” despite the inherent risks.On an earlings call Tuesday, Pfizer’s (PFE) CEO Albert Bourla said they company expects to have some sort of news and completed regulatory review by October 2020. The company had four potential candidates and has advanced one of those — a two-shot 30-microgram dose — into the final phase.Moderna (MRNA) also announced its Phase 3 trial yesterday, which it is doing with significant funding and support from the federal government. Johnson & Johnson (JNJ) also announced entering phase 1 of its candidate Monday.Pfizer executives told investors Tuesday they see the pandemic as a source of recurring revenue with the vaccine becoming a seasonal need, like the flu, and pricing adjusting accordingly. The current price of $19.50 is based on 100 million doses bought at $1.95 billion by the federal government, and is lower than the value the company believes the drug has for society, according to Bourla.Pricing has been a point of concern for some patient advocacy groups, who believe companies should be providing the vaccine at no-profit costs.Story continuesAngela Hwang, global president of biopharmaceuticals at Pfizer, said on Tuesday the company would not offer other countries a lesser price than the U.S., except for poorer countries.\"No country in the developed world will receive (COVID-19 vaccine) doses at a lower price than the U..S.\" for similar volume commitments, Hwang added.Moving to end a ‘dangerous’ dependencyManufacturing and logistics are proving to be the biggest hurdles the U.S. has to overcome to respond to the coronavirus outbreak.It’s why the U.S. Health and Human Services Department, through Operation Warp Speed, and the Department of Defense (DoD) have all invested in various strategies to help boost U.S. output.Shortages of protective gear, testing supplies, glass vials for vaccines and necessary refrigerated transportation for vaccines are all strained amid the pandemic. To date, the executive branch has either funded or used the Defense Protection Act (DPA) to produce N-95 masks and ventilators, and other critical equipment.It is also funding the production and research for COVID-19 vaccines. That includes announcements this week to tap Eastman Kodak (KODK) and FUJIFILM (FUJIY) with Texas A&M University for manufacturing.Under the DPA, Kodak has received a $765 million loan to pivot to producing generic drug active ingredients — a product that is largely produced in overseas facilities in India and China.Previously, HHS awarded an up to $812 million grant to startup Phlow Corporation to do the same, in keeping with the Trump Administration’s position that the U.S. is over-reliant on overseas products.“If we have learned anything from the global pandemic, it is that Americans are dangerously dependent on foreign supply chains for their essential medicines,” said Peter Navarro, White House advisor, in a statement announcing the Kodak loan.Separately, HHS announced a $265 million contract with FUJIFILM and Texas A&M to help increase the country’s vaccine production capabilities. That includes candidates like Novavax’s (NVAX), which recently announced a separate partnership with FUJIFILM.Warp Speed has previously given hundreds of millions for key medical material needs to companies like ApiJect, Corning and SiO2 Material. However, other companies are independently pursuing drug production without government money.Quartic.ai, a startup like Phlow, also recognized the need for domestic production of drug ingredients and began addressing the issue prior to the global pandemic. The company partnered with Bright Path Labs earlier this year to focus on continuous manufacturing of drug ingredients.Larry Taber, vice president of Life Sciences at Quartic, told Yahoo Finance that Bright Path had been in touch with the White House coronavirus task force about producing 25 ingredients.“This technology, continuous flow, has been around for a decade and a half, but it has not been well-received by the pharma industry” until a couple of years ago, Taber said.The technology requires a smaller footprint than traditional batch manufacturing, and would take just a few months to set up. An pharmaceutical veteran, Taber suggested the reason it hasn’t taken off, according to Taber, is because the existing, expensive infrastructure at those companies.“I’ve taken products outside the U.S. and I know we can bring them back in...and can make them just as competitively,” he said.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}