{"article": [{"url": "https://finance.yahoo.com/news/facebook-ad-boycott-is-more-noise-than-fundamental-risk-jefferies-analyst-183100524.html", "published": 1595511560.0, "headline": "Facebook ad boycott is 'more noise than fundamental risk': Jefferies analyst", "body": "Facebook is facing one of the largest ad boycotts in its history—but you wouldn’t know it from the stock.More than 250 major consumer companies have joined the Stop Hate For Profit campaign, an effort to pressure Facebook (FB) and CEO Mark Zuckerberg to better police hate speech on its platform, supported by the NAACP, Anti-Defamation League, Common Sense Media, and other groups.Starbucks, Microsoft, Adidas, Patagonia, Ford, and Yahoo Finance’s parent company Verizon have all hit pause on their Facebook ad spending in order to send a message.On June 26, the day Unilever joined the boycott, Facebook stock dropped 8%, hitting a low of $215. One month later, it’s back up to $235. Shares hit a 52-week high of $250 just last week, even as the boycott continues. The stock is up 14% in 2020 amid the pandemic.Various estimates have pegged the total ad revenue lost so far from the boycott at around $200 million, or barely more than 1% of Facebook’s $17 billion in ad revenue in Q1 2020. The company had $70 billion in ad revenue in 2019.In a town hall meeting at the end of June, Zuckerberg told Facebook employees, according to a transcript reported by The Information, “We’re not gonna change our policies or approach on anything because of a threat to a small percent of our revenue, or to any percent of our revenue... And my guess is all of these advertisers will be back on the platform soon enough.”The founder and CEO of Facebook Mark Zuckerberg speaks during the 56th Munich Security Conference (MSC) in Munich, southern Germany, on February 15, 2020. (Photo by Christof STACHE / AFP)That quote sounds pretty dismissive of the boycott, which arguably still creates very bad optics for Facebook. But analysts largely agree with Zuckerberg: the boycotting brands will be back.“Every one of these companies—Arcteryx, Patagonia—they’re all coming back,” says Brent Thill of Jefferies. “They all have to stand out in the short term, but they’re all going to come back. And we think that the press isn’t talking loudly enough about what Facebook has done for small businesses. There are 800 million global small businesses, 160 million use Facebook every day... so it doesn’t matter if Patagonia or Disney leaves. [Millions] of small businesses realize they can find a community on Facebook... So again, we think ultimately this is more noise than any fundamental risk.” (Thill has a Buy rating on the stock and a price target of $285.)Story continuesIndeed, Facebook says more than 160 million small businesses have a Facebook presence; 8 million companies pay to advertise on Facebook. 250 brands, even big public ones, aren’t going to make a dent—yet.Last week, the Wall Street Journal reported that Disney (DIS) has slashed its ad spending on Facebook, but the report did not say by how much or for how long, and Disney did not make any public comment about joining the boycott. It’s more likely that Disney, which was the No. 1 advertiser on Facebook in the first half of the year when it was pushing its new streaming service Disney+, is simply cutting back now that Disney+ is past its launch phase.Disney didn’t comment on the Journal’s report, but Facebook did. It said, “We invest billions of dollars each year to keep our community safe and continuously work with outside experts to review and update our policies. We know we have more work to do, and we’ll continue to work with civil rights groups, GARM, and other experts to develop even more tools, technology and policies to continue this fight.” It’s the same basic comment Facebook has given since the boycott began, and it will likely keep using the comment until the boycott goes away.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’Goya Foods faces consumer boycotts after CEO praises TrumpWarner Bros’ indefinite delay of ‘Tenet’ is major blow to movie theatersCoronavirus is forcing Quibi, NBC Peacock to change their plans at launchCoronavirus puts 'extreme pressure' on all three pillars of Disney's businessMovie theaters seek bailout as coronavirus devastates business"}]}