{"article": [{"url": "https://finance.yahoo.com/news/why-online-savings-accounts-interest-rates-have-fallen-and-some-more-than-others-185756569.html", "published": 1600869920.0, "headline": "Why online savings accounts interest rates have fallen — and some more than others", "body": "It seems like forever ago, but in the fall of 2018, online savings accounts paid an incredible amount in interest for having next to no risk. Back then the Federal Funds rate was at 2.25%–2.50%, and many accounts offered interest of over 2.20% APYs.The Federal Reserve began cutting rates that winter, and when the coronavirus hit, the Fed reacted in an emergency measure, slashing rates to zero. What was left of the crazy-good interest in savings accounts mostly vanished as well. The Fed this month suggested interest rates will likely stay at near-zero through the end of 2023.Today most of the key players like Ally Bank (ALLY), Goldman Sachs' (GS) Marcus, and American Express (AXP) pay 0.60% in interest.The Fed isn’t the only reason why savings accounts aren’t paying out as much in interest.Citibank logo seen in New York City. (Photo by Alex Tai/SOPA Images/LightRocket via Getty Images)“Aside from the overall interest rate environment, a particular bank’s deposit rates are a reflection of their desire – or lack thereof – to bring in additional deposits,” said Greg McBride, Bankrate’s chief financial analyst.Banks don’t need your moneyThe banks’ demand for money has fallen significantly because many customers are stashing their money into savings accounts instead of the stock market. Investors are hoarding trillions of dollars as people wait for the election outcome and for the stock market to retreat after missing the brief window when the market was cheaper.“Deposits are the lifeblood of banks and when loan demand is high, banks need to bring in more deposits and will often pay up to do so,” said McBride. “When banks are sitting on more deposits than they can profitably lend out – like is the case for many right now – this too puts a downward influence on deposit rates.”In other words, it’s not all Jay Powell’s fault.The rates turmoil has also shaken up the ranking of these institutions in terms of interest rates, as banks have had different needs for deposits.Goldman Sachs' Marcus and American Express' savings accounts pay 0.6% in interest. (Photo Illustration by Omar Marques/SOPA Images/LightRocket via Getty Images)Goldman’s Marcus product came on the market and had a stint near the top as a market leader, using the high APY to build market share. Similarly, both CIT and Citizens led the rankings two years ago, with Citizens’ account offering a 2.25% APY. CIT has fallen to 0.55%, on the low end of its competitors, and Citizens ranks below many of the banks it used to beat. Synchrony, which often led the rankings, has fallen down the list but not as far as CIT, still offering 0.75%.Story continuesThe most generous savings now is from Citi, which pays 0.90% in interest — for now.Rates don’t fall for every bank in lockstep, which is why many experts suggest shopping around or transferring cash reserves or emergency fund money to the most lucrative options.For a brief moment, online robo-advisors led online savings accounts. Wealthfront and Robinhood paid 2.24% and 2.69% APY, respectively, at their debuts, leading the market, and Robinhood paid 1.80% at its launch last year also leading the market. Now, Robinhood and Wealthfront pay 0.35% and Betterment pays 0.40% – no longer competitive.Update 9/23: Ally slashes APY to 0.60% from 0.80%.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Intergenerational conflict is getting worse, Deutsche Bank warns2 tax safe harbors that new traders need to know aboutNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}