{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-response-breaking-down-the-debate-over-liability-protections-175624855.html", "published": 1597151060.0, "headline": "Coronavirus response: Breaking down the debate over liability protections", "body": "Lawmakers and the White House still have not come to an agreement on the next phase of coronavirus relief and the prospects of a deal aren’t looking promising right now.One of the issues that has divided Republican and Democratic lawmakers throughout the pandemic is protection from COVID-19 lawsuits.“I won’t put a bill on the floor that doesn’t have liability protection in it,” Senate Majority Leader Mitch McConnell told reporters on July 21.Protecting businesses and other entities from “frivolous” lawsuits has been a top priority for McConnell and other Republicans. McConnell has called it his “red line.”“Almost anybody could become liable for almost anything – and there are enterprising trial lawyers all over the country, waiting to take advantage of it,” McConnell said on July 28.The HEALS Act – the Senate Republican plan for the next round of relief – includes five years of legal protections for businesses, hospitals, schools, colleges and nonprofits that make “reasonable efforts” to follow health and safety guidelines.House Speaker Nancy Pelosi of Calif., center, accompanied by Senate Minority Leader Sen. Chuck Schumer of N.Y., left, speak to reporters following a meeting with Treasury Secretary Steven Mnuchin and White House Chief of Staff Mark Meadows as they continue to negotiate a coronavirus relief package on Capitol Hill in Washington, Friday, Aug. 7, 2020. (AP Photo/Andrew Harnik)“In this national emergency, during this pandemic and during the time when our economy needs to safely reopen, liability protections are important for everybody,” said Sen. John Cornyn (R-TX) when Republicans unveiled the HEALS Act.‘They betrayed workers’ Democratic lawmakers say the Republican proposal doesn’t consider workers who may be put in harm’s way while on the job.“They [Republicans] tell them to go to work: ‘Go to work, you’re an essential worker, you must go to work. And when you go to work and have no protections, you have no recourse,” said House Speaker Nancy Pelosi (D-CA) at a press conference last month.“They choose corporate interests over workers,” said Sen. Sherrod Brown (D-OH) in an interview with Yahoo Finance. “Again, they betrayed workers.”Business groups argue liability protections will help put the economy back on track. The U.S. Chamber of Commerce and nearly 500 organizations recently wrote Congressional leaders a letter, urging them to include liability protections in the next coronavirus bill, “so they can continue to contribute to a safe and effective economic recovery from the COVID-19 pandemic.”Story continues“COVID-19-related lawsuits and their consequent exorbitant legal costs could deter entities from reopening and could ultimately cripple businesses, educational institutions, and non-profit organizations both large and small,” the letter goes on to say.School districts, colleges and Republican governors have also pressed Congress to put some form of lawsuit protections in place, while professional athletes’ unions have come out against a liability shield.“It is top of mind for not just businesses, but really a whole host of entities across our country,” Neil Bradley, executive vice president and chief policy officer at the U.S. Chamber of Commerce, told Yahoo Finance in an interview. “Employers across the country face a lot of uncertainty — the COVID crisis, the economic uncertainty — liability uncertainty adds to that confusion for employers.”Brown warned a liability shield could have serious consequences.Executive Chef Willie Brockington, left, and line chef Saul Sibri, work in the kitchen at Stokesay Castle in Lower Alsace Township, PA Thursday evening August 6, 2020 where they have made renovations to the Knight's Pub, the banquet room, the kitchen, and added a martini bar. (Photo by Ben Hasty/MediaNews Group/Reading Eagle via Getty Images)“More people will get sick because corporations won't have any liability, any responsibility, any accountability built into the system,” said Brown. “This administration doesn't ever want corporations to have to spend any money to protect workers.”‘There’s no blanket immunity here’ Republican lawmakers and supporters of the protections insist bad actors and corporations that are grossly negligent will still be held accountable.“There's no blanket immunity here,” said Bradley. “All this says is, if they follow those guidelines, if they follow the recommendations of the public health experts, they don't have to be worried about being dragged into court later by someone alleging that they should have done something different.”Instead of a liability shield, Democratic lawmakers and labor groups want the Occupational Safety and Health Administration to put an enforceable coronavirus safety standard in place.A liability shield is “the exact wrong approach to have,” Richard Trumka, AFL-CIO president, said in an interview with Yahoo Finance. “We need to have a standard that’s enforceable, before they ever talk about giving them liability relief from anything -- which incentivizes them to do less, than do more to protect workers.”Trumka and Brown said the clear, enforceable expectations would protect both workers and employers.“They [corporations] would say ‘we did everything that was required of us,’ but they want to have it both ways. They want to be able to do nothing and still have total protection,” said Trumka.AFL-CIO president Richard Trumka listens at the National Press Club in Washington, Tuesday, April 4, 2017. (AP Photo/Alex Brandon)“When corporations do what's required of them and follow the law on the environment on worker safety standards, they don't get sued,” said Brown. “I mean good lawyers don't bring lawsuits against corporations that behave and follow the law.”Bradley told Yahoo Finance more guidance would be helpful for the business community, but going through OSHA isn’t the way to do it.“Our understanding of this disease is constantly evolving and understanding what we need to do to prevent its spread is constantly evolving...we welcome federal guidelines,” said Bradley. “But it probably shouldn't take the form of traditional OSHA style, hundreds of pages of regulations, because those types of things don't have the flexibility to adjust as our understanding of the spread of this disease adjusts.”An avalanche of lawsuits? McConnell and other Republicans have warned that an “epidemic” of lawsuits could follow the pandemic – but so far, that hasn’t been the case. Less than one-third of Americans say they would sue over coronavirus exposure, according to a Yahoo Finance-Harris Poll.According to Hunton Andrew Kurth’s COVID-19 litigation tracker, roughly 4,200 coronavirus-related legal complaints have been made so far. Most of the filings deal with insurance claims, prisoner petitions or civil rights (including challenging stay-at-home orders). Few complaints are related to COVID-19 exposure or wrongful death.In mid-July, the American Association for Justice — which represents plaintiffs’ lawyers — analyzed the database and found personal injury cases made up less than 5% of the total COVID-related complaints. Supporters of the liability protections argue it’s better for Congress to take action now and be proactive.“I don't think we should wait to erect a safe harbor until after we already have thousands and thousands of lawsuits. That denies the very protection that small businesses and universities and public schools are looking for here. We're trying to get in front of this problem,” said Bradley. “We should erect these safe harbors now, not wait until we're dealing with the avalanche of lawsuits.”Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Coronavirus stimulus: What’s next for small business?White House, Senate GOP continue to debate stimulus plan as jobless claims riseTwitter hack highlights concerns about disinformation, election securityThe $600 boost in unemployment benefits expires soon. What comes next?Most Americans would not sue over COVID-19 exposure: pollMajority of Americans think Congress should extend enhanced unemployment benefits past July: poll"}]}