{"article": [{"url": "https://finance.yahoo.com/news/more-stimulus-is-the-key-to-trumps-reelection-161149575.html", "published": 1601378360.0, "headline": "More stimulus is key to Trump’s reelection", "body": "Four months ago, at the bottom of the coronavirus recession, President Trump’s reelection odds were dismal. Forecasting firm Oxford Economics plugged the economic numbers into its forecasting model, which predicted Democrat Joe Biden would beat Trump by the biggest landslide in 40 years.Oxford Economics has updated its model, and the race now looks closer. In the May analysis, Biden beat Trump in the popular vote by a whopping 65%-35% margin, largely because a wrecked economy thoroughly turned voters against the incumbent president. And Biden won the Electoral College 328-210, flipping 7 states Trump won in 2016: North Carolina, Pennsylvania, Ohio, Michigan, Wisconsin, Iowa and Florida.In the latest analysis, Biden wins the popular vote by a much narrower 52%-48%. Trump wins Missouri, while Biden retains the six other states and wins the Electoral College 318-220. Here’s the map:Source: Oxford EconomicsThis outcome would still be a convincing Biden win, but the tighter margin suggests developments of the last four months have favored Trump and left the possibility that a late surge can push Trump to victory.What changed? Congress pushed trillions of dollars of stimulus into the economy, triggering a faster recovery than many economists expected. “The stronger-than-expected fiscally driven economic rebound means economic fundamentals point to a tighter race than in May,” Oxford Economics now says.In March and April, Congress passed $3.7 trillion worth of stimulus programs meant to sustain businesses forced to shut down or scale back because of the coronavirus pandemic, keep furloughed workers afloat and help most Americans with a one-time $1,200 stimulus check. That was the biggest economic bailout Congress ever passed, and it largely worked. The unemployment rate soared from 4.4% in march to 14.7% in April, but has since fallen back to 8.4%. Retail sales plunged in March and April, but they’ve since rebounded to levels higher than before the virus arrived.Story continuesThe Oxford model is based on state-by-state economic conditions, including the unemployment rate and changes in per-capita income. A formula that has accurately predicted the winner in most presidential elections since 1948 then calculates the portion of the vote the incumbent president is likely to win in each state, arriving at an electoral-college tally. Oxford also models outcomes based on voter turnout that’s higher and lower than usual.WASHINGTON, DC - JULY 20: U.S. President Donald Trump talks to reporters while hosting Republican Congressional leaders and members of his cabinet in the Oval Office at the White House July 20, 2020 in Washington, DC. Trump and his guests talked about a proposed new round of financial stimulus to help the economy during the ongoing global coronavirus pandemic. (Photo by Doug Mills/Getty Images)The economy has recovered in key swing states such as Michigan, Wisconsin, Ohio and Pennsylvania, narrowing Biden’s likely margin of victory. But much of the stimulus spending has run out, with further economic gains likely to be slow and incremental. Unemployment remains abnormally high, coronavirus is still forcing restrictions on businesses, and the recovery isn’t strong enough to put those swing states back in Trump’s column. Polls show Biden leading by a margin of about 3 points in Ohio and about 5 points in the other three states.Since federal stimulus seems to have helped Trump’s reelection odds, it’s notable that a fourth large stimulus bill—which at one point seemed likely to pass over the summer—now seems stalled until after the election. House Democrats have passed one bill, the Heroes Act, but its enormous $3.4 trillion price tag guaranteed failure in the Republican-controlled Senate, which has signaled support for only about one-sixth as much spending.Democrats are now preparing to pass a slightly slimmer $2.2 trillion bill, which also seems destined to fail in the Senate. It would behoove Trump to badger his Senate allies into signing any kind of deal, since the economic boost in swing states can only help him. But with barely a month until the election, there may be no time, especially now that the Senate is consumed with the confirmation process for Amy Coney Barrett, Trump’s third Supreme Court nominee. And while Treasury Secretary Steven Mnuchin is supposedly working closely with House Speaker Nancy Pelosi on a fourth deal, Trump himself seems distracted by the usual cavalcade of controversies, including new revelations of epic tax avoidance and intensifying legal battles with New York state and city authorities. He has said little publicly meant to pressure Pelosi into a new deal or provide top cover for Senate Republicans worried about the cost.It’s safe to assume Pelosi understands swing-state economics very well. She may have offered Senate Republicans a deal they can only refuse in order to hold out on further stimulus until after the election, while trying to make Democrats look like the party able to save the economy. And it could work. “Should the next six weeks feature a significant economic relapse and the absence of a fiscal stimulus package, Trump’s reelection odds would fall even lower,” Oxford Economics predicts. That could yield a 347-191 electoral landslide for Biden, plus possibly give Democrats control of the Senate. That would be even worse for Trump than the forecast from May.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Democrats can save ObamacareTrump’s health care sham5 campaign promises Trump has given up onTrumpworld is implodingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}