{"article": [{"url": "https://finance.yahoo.com/news/u-crude-stockpiles-hit-record-151811795.html", "published": 1592994380.0, "headline": "U.S. crude stockpiles hit record high for a third week, gasoline demand jumps - EIA", "body": "(Reuters) - U.S. commercial crude oil stocks hit a record high for a third straight week, while gasoline stockpiles fell as demand jumped, the Energy Information Administration said on Wednesday.Crude inventories rose by 1.4 million barrels in the week to June 19 to 540.7 million barrels, the EIA said. Analysts had forecast in a Reuters poll a 299,000-barrel rise.Crude inventories also hit another record high on the Gulf Coast, where the bulk of the nation's refining capacity is located.Crude prices fell on the news. U.S. crude futures dropped 3.8%, or $1.54, to $38.83 a barrel by 10:48 a.m. ET (1448 GMT), while Brent was down 3.9%, or $1.67, at $40.96 a barrel.Crude stocks at the Cushing, Oklahoma, delivery hub for futures fell by 991,000 barrels in the last week, EIA said.U.S. gasoline stocks fell by 1.7 million barrels, compared with expectations for a 1.3 million-barrel drop.​Gasoline demand was stronger. Gasoline supplied, a proxy for demand, jumped by 9%, though for the recent four-week period, fuel demand is down 17% from the same time a year ago.\"The thing we should be encouraged by is the jump in gasoline demand week over week. The gasoline number would seem to suggest that we're definitely seeing an improvement in demand,\" said Phil Flynn, senior analyst at Price Futures Group in Chicago.Distillate stockpiles, which include diesel and heating oil, rose by 249,000 barrels in the week versus expectations for a 620,000-barrel drop. Distillate stocks were at a record in the U.S. Gulf Coast region.Net U.S. crude imports fell last week by 797,000 barrels per day in the last week, after several weeks of heavy imports, particularly from Saudi Arabia, stemming from a series of shipments booked in April when prices slumped and the kingdom ramped up exports.Crude production rebounded to 11 million bpd from 10.5 million bpd in the previous period when offshore facilities shut in advance of Storm Cristobal.(Reporting By David Gaffen; Editing by Marguerita Choy)"}]}