{"article": [{"url": "https://finance.yahoo.com/news/samsung-galaxy-buds-live-review-141845433.html", "published": 1597742780.0, "headline": "Samsung’s Galaxy Buds Live offer premium earbud features without the premium price", "body": "Samsung is coming for Apple’s (AAPL) AirPods Pro. The South Korean tech giant recently launched its new Galaxy Buds Live, and they’re aimed squarely at taking on Apple’s high-end earbuds.Like the AirPods Pro, the kidney bean-shaped Buds Live feature active noise-canceling technology, as well as water and sweat resistance, but Samsung is offering its earbuds at just $169, compared to Apple’s price of $249.That’s a major price gap that could seriously benefit Samsung. And considering they work with the iPhone, could take the fight to Apple on its home turf.A comfortable fit all aroundSamsung has been selling its own brand of Galaxy Buds for years. It’s prior iteration is the Galaxy Buds+, which feature silicon-covered pegs that slide into your ear canal. But I’ve never found designs like that to be particularly comfortable for long-term use. Instead, I’ve usually stuck with Apple’s AirPods or AirPods Pro, which I’ve been able to wear for hours without issue.But Samsung has significantly switched up the design of its Galaxy Buds Live. Rather than a peg that slips into your ear canal, the Buds Live sit on the outer portion of your ear. The unique design helps the buds remain in place, while interchangeable large and small wingtips ensure the buds fit comfortably without moving around.Samsung's Galaxy Buds Live offer impressive sound with active noise-canceling technology at a solid price. (Image: Samsung)The Buds Live’s shape has the added benefit of making them incredibly low profile, meaning they won’t jut out from your ear. Even head on, you can barely notice them in someone else’s ears.Crucially, I’ve found the Buds Live stay put while working out. I’ve used earbuds in the past that slide out when bending over or feel like they’re sliding when running, but I haven’t found that with the Buds Live.As a particularly prodigious perspirator (try saying that five times fast), I’ve also found that the Buds Live can stand up to sweat that pools in and around my ears. When I workout with the AirPods Pro, sweat ends up rolling down the side of my head and into my ears, which ends up muffling the audio.Story continuesA quick shake of the Pros and a wipe of my head usually fixes the issue, but I haven’t had the same problem with the Buds Live at all. I sweat more than most people I know, so this might not be something everyone regularly deals with, but this is my review, so there you have it.My one issue with the Buds Live is that their low profile makes them a bit difficult to take out of your ears. You’re going to really have to dig at them for a second to pop them out, unlike Apple’s AirPods, which you can grab by the stem to remove.The Galaxy Buds Live feature a charging case that provides up to 21 hours of battery. (Image: Samsung)Strong audio and active noise cancelingAudio for the Buds Live comes via 12mm speakers in each bud, and the sound quality is right up there with what I’ve experienced with Apple’s earbuds. Guitars and drums in rock songs shredded, while deep bass hits on the latest “Run the Jewels” pounded my eardrums.Importantly, the Buds Live come with active noise-canceling technology, which uses external microphones to capture outside sounds and feed the opposite sound wave into your ears.Normally, active noise-canceling technology is paired with closed headphones or earbuds to help create a seal around your ear that further blocks outside noise.But Samsung’s system uses what the company calls open active noise-canceling technology, which just means you won’t have to put anything around or in your ear for it to work.The company claims that the feature can reduce 97% of low-frequency sound from things like buses and trains while still allowing you to hear higher frequency sounds like station announcements.The Galaxy Buds Lives' kidney bean-style design helps them fit snuggly in your ears. (Image: Samsung)There’s no doubt that the open active noise-canceling tech on the Buds Live is less effective than the active noise-canceling feature included with the AirPods Pro, but there’s still enough audio blocked out that music and podcasts come through loud and clear.As you’d expect of premium earbuds, Samsung has equipped the Buds Live with touch controls that let you do everything from skip and pause songs to answer and hang up phone calls. The Buds also feature voice recognition technology via Samsung’s Bixby voice assistant, letting you make calls, check the weather, and more by just using your voice.As for battery power, Samsung says you’ll get 5.5 hours of use out of the Buds Live with active noise canceling and Bixby wake-up on. Turn those features off, and you’ll extend the battery life of the Buds Live to 8 hours.Like most of today’s earbuds, Buds Live feature a charging case that can give you an extra hour of listening time via a quick 5-minute charge. The case itself, according to Samsung, can hold as much as 21 hours worth of a charge.Should you get them?I was surprised at how much I liked Samsung’s Galaxy Buds Live. The Galaxy Buds+ weren’t exactly my cup of tea, and Apple’s AirPods have always been fantastic for me. But the Buds Live have proven to be an excellent pair of earbuds with powerful audio and decent noise-canceling technology.If you want a pair of earbuds with premium features without the premium price tag, I’d recommend checking out the Galaxy Buds Live.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Microsoft’s Surface Duo dual-screen smartphone coming Sept. 10 for $1,399Free time and ‘Fortnite’: How coronavirus changed video game industry foreverFacebook and Microsoft, smelling blood in the water, clash with Apple amid antitrust probesSamsung debuts Galaxy Note 20 and Note 20 Ultra smartphonesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}