{"article": [{"url": "https://finance.yahoo.com/news/college-football-cancellation-could-cost-espn-more-than-850-million-but-boost-nfl-opportunity-105242136.html", "published": 1597212020.0, "headline": "College football cancellations could cost ESPN more than $850 million, but boost NFL opportunity", "body": "The Big Ten and the Pac-12 became the first of the major college football conferences to postpone their seasons due to coronavirus concerns on Tuesday, sparking what could become a nearly $1 billion dollar loss in advertising revenue for Disney (DIS) across its ESPN and ABC channels.According to advertising data firm EDO, last year’s NCAA football broadcasts across ESPN, ESPN 2, and ABC during the full season attracted more than $850 million. That number excludes additional revenue that was attributable to SEC and ACC Network, as well as ESPNU, ESPN Classic, ESPN News, and ESPN Deportes.The fact that two of the largest conferences have already decided to forgo fall football adds pressure on the remaining so-called Power 5 conferences, including the Big 12, the ACC and SEC, to consider doing the same. The Big 12 for its part seems to be forging ahead with plans to play its conference games, according to Yahoo Sports.Nonetheless, the lost advertising dollars are quickly stacking up for Disney’s sports-focused broadcasting side of the media giant, according to EDO CEO Kevin Krim, who told Yahoo Finance’s YFi PM that college football is right up there with the other major leagues in terms of advertising importance.“When we look at the performance on an audience adjusted basis of the National Semifinals and the National Championship for NCAA football, these are some of the best programs on all of television,” he said. “They are right up there with the NBA Finals, with Monday Night Football, and even the Super Bowl.”FILE - In this Dec. 7, 2019, file photo, Ohio State quarterback Justin Fields (1) runs with the ball against Wisconsin during the first half of the Big Ten championship NCAA college football game, in Indianapolis. The Big Ten won't play football this fall because of concerns about COVID-19, becoming the first of college sports' power conferences to yield to the pandemic. The move announced Tuesday, Aug. 11, 2020, comes six day after the conference that includes historic programs such as Ohio State, Michigan, Nebraska and Penn State had released a revised conference-only schedule that it hoped would help it navigate a fall season with potential COVID-19 disruptions. (AP Photo/Michael Conroy, File)Adding on additional revenue from college football games broadcast on FOX, CBS, and NBCUniversal and the advertising totals easily surpass $1 billion. Yet, as bad as that sounds, things only stand to get worse if the collapse of college football is a precursor for what could happen to the NFL’s season. However, since the league is a paid, professional league, experts are still hopeful that the NFL will be able to cobble together a solution or perhaps a modified season like other major leagues have been able to do in 2020.Story continuesNFL TV rightsAccording to Krim, the NFL and its broadcasting partners could stand to gain quite a bit from the absence of college football by canalizing a much more coveted Saturday primetime spot normally reserved for the college level.“The reality of the NFL’s franchises — their various franchises whether its [NBC’s] Sunday Night Football, [ESPN’s] Monday Night Football, Thursday Night Football, or the Sunday day games, it’s the Sunday day games that have the most challenging requirements because they are doing regional matchups,” he said. ”If you can move some of those to Saturday primetime you’d get the benefits of the NFL’s premium performance in terms of advertising and you’d get less of a fragmentation of your audience so you could have a win-win for the NFL and the broadcasters.”That could be a boost for the NFL, which brings in more revenue by way of television rights versus ticket sales when compared to other leagues. Colleges, on the flip side, see a larger share of revenue come by way of ticket sales.Whether the NFL is able to avoid the same health issues impacting college football right now remains to be seen, but there is no overlooking the astronomical advertising importance football at both levels boasts for its broadcasters.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:This $3 billion online education company is seeing a 'paradigm shift' due to coronavirusNetflix co-founder brushes off NBC's new Peacock streaming competitorSmall US towns are neglected from coronavirus relief and it's a 'slap in the face': Georgia mayorWhy Costco could see a lasting boost from coronavirus panic buying"}]}