{"article": [{"url": "https://finance.yahoo.com/news/how-biden-threatens-trumps-fortune-151444744.html", "published": 1595413340.0, "headline": "How Biden threatens Trump’s fortune", "body": "President Trump doesn’t like hearing about Joe Biden’s lead in the polls, and he probably doesn’t like hearing about Biden’s tax proposals, either—because they could cost him a lot of money.Biden recently announced an elder- and childcare plan that would cost $775 billion over 10 years, while providing new benefits like free pre-kindergarten for millions of qualifying kids and better community services for Medicaid beneficiaries. Biden’s plan to pay for it: repeal tax breaks for real-estate developers, and stop wealthy people from cheating on their taxes.As the proprietor of the Trump Organization, a real-estate company, Trump has profited for years from longstanding tax breaks that benefit the commercial real-estate industry. Since Trump has never released his tax returns, it’s not clear how much money the tax breaks save him personally. But fragments of Trump’s financial documents that have become public suggest real-estate tax breaks have probably saved him hundreds of millions of dollars, and perhaps billions, over the years.Various records indicate Trump paid no federal taxes in 1978, 1979 and 1984, thanks to real-estate deductions. Leaked snippets of Trump’s 1995 tax return show he claimed a $916 million deduction, probably related to his casino bankruptcies in 1991 and 1992, that could have zeroed out his federal tax bill for up to 18 years. A leak of two pages of Trump’s 2005 tax return show he claimed another tax write-off of $100 million, although Trump did pay $38 million in taxes that year, on income of $150 million.Photo by: STRF/STAR MAX/IPx 2020 7/20/20 NYPD are seen around Trump International Hotel in New York City.The Republican tax-cut law Trump signed in 2017 contained $60 billion worth of tax breaks for developers, which may also have benefited Trump, according to a 2018 report by House Democrats. One tax expert called the 2017 law “a windfall for real-estate developers like Trump.” The New York Times estimated those tax breaks could save Trump an additional $11 million per year.Eliminating tax breaks for developersStory continuesBiden didn’t spell out exactly how he’d change tax breaks for developers, but there are several Democratic proposals for reining in tax breaks that defer or forgive federal taxes on capital gains from property sales, if they’re invested in another property. Biden could also reduce the ability to use real-estate losses to offset future tax payments.A study earlier this year by the Tax Policy Center found that eliminating those sorts of tax breaks for real-estate developers could generate an additional $294 billion in federal revenue over 10 years, or $29 billion per year. “If Biden wins the presidency and Democrats win the Senate majority, the Democratic taxman cometh for the real estate industry,” Beacon Research wrote in a July 22 analysis of Biden’s latest plan. “This is a function of Democratic animosity towards President Trump, a real estate investor who still profits from his business.”Since Biden says his plan would cost nearly $80 billion per year, closing real-estate tax loopholes wouldn’t be enough to pay for it all. Biden says he also wants to crack down on wealthy tax evaders, which could yield billions more. The IRS estimates various forms of tax evasion cost the federal government about $380 billion per year in unreported or underreported income. So if Biden beefed up IRS enforcement and recovered just one-seventh of the so-called “tax gap,” he’d have enough to fund his elder- and childcare plan, in full.Photo by: STRF/STAR MAX/IPx 2020 7/9/20 A Black Lives Matter painting is seen outside of Trump Tower in New York City.Could that hurt Trump as well? Trump has been dogged by allegations of tax evasion, especially after his niece Mary Trump leaked secret details regarding the family real-estate business to the New York Times for a 2018 expose. The Times claimed that Trump and his family engaged in “outright fraud” by dramatically undervaluing assets, shielding cash flow in shell companies and selling assets to each other to disguise debt write-offs that would otherwise incur tax liability. These moves allowed Trump to slash his tax bill by hundreds of millions of dollars, the Times claimed. Trump, of course, insisted this was false and pointed out that he’s been audited many times by state and federal tax regulators.For Biden to go after Trump’s money, he’ll need not just a White House win, but also a Democratic takeover of the Senate in the November elections. If Biden wins but Republicans retain control of the Senate, they’ll almost certainly block any tax hikes, especially on developers or other businesses. That leaves two ways for Trump to lose in November: With his fortune protected by a slim majority of Senate Republicans, or his fortune vulnerable to an unforgiving Democratic majority.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How to waste $1 trillionEdgy voters might reject the 2020 election outcomeWhy Joe Biden is wooing unionsElection Night in November could last for daysHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}