{"article": [{"url": "https://finance.yahoo.com/news/teslas-battery-day-what-to-expect-141211489.html", "published": 1600680020.0, "headline": "Tesla's Battery Day: What to expect", "body": "Expectations are high for Tesla’s (TSLA) first ever Battery Day tomorrow. Tesla CEO Elon Musk tweeted “many exciting things” will be unveiled at the event, and Tesla watchers are expecting game-changing developments when it comes to energy density, increasing production and eventually lower battery costs.‘It will be insane’It’s likely Tesla will announce a new battery cell it has been developing in-house in Fremont, California, and details on long term plans to manufacture its own cells at large-scale.Musk recently tweeted, “It will be very insane,” in response to a report of a leak showing a battery cell from Tesla’s in-house manufacturing system dubbed “Roadrunner.” Electrek was the first to get its hands on the new cell.It will be very insane— Elon Musk (@elonmusk) September 17, 2020If anyone has seen this battery cell before or if you some information about them, please reach out. DM are open or email fred@electrek.co wickr: fredev pic.twitter.com/YxgCYY16fP— Fred Lambert (@FredericLambert) September 15, 2020Expect to hear integrations from Maxwell Technologies, a company which Tesla acquired for its dry electrodes technology which improves turnaround times for battery manufacturing and energy density. Tesla also bought Hibar last year, a Canadian company specializing in ultra-high speed production of batteries.‘Million-mile battery’Dan Ives of Wedbush Securities expects Tesla to announce \"game changing\" developments at Battery Day, which has become incrementally more important as competition in the EV space continues to ramp up.“The technology innovations around Giga/Fremont remain the key ingredients in Tesla's success on the battery front and we believe the company is getting closer to announcing the million-mile battery at this highly anticipated event,” wrote Ives.Story continues“In our opinion this battery technology will be very advanced, potentially last for decades, withstand all types of weather/terrain, and be another major milestone for the Tesla ecosystem. In theory this battery will support an electric vehicle for 1 million miles and be a major step forward when competing vs. traditional gasoline powered automotive competitors from both an ROI and environmental perspective,” he added.The Street will closely be watching efforts to reduce production costs as “this would give Tesla much more financial flexibility around pricing on current and future EV models with price parity,” wrote Ives.‘We’ve got to scale battery production to crazy levels’With Giga-factories planned for Berlin and Austin, Tesla is aiming to get its hands on as many batteries as possible.In January, Musk said to investors, “We’ve got to scale battery production to crazy levels that people cannot even fathom today.”The electric vehicle maker already has a partnership with Panasonic, making cells at its Gigafactory in Nevada. It also has a partnership with Chinese manufacturer CATL and a deal with LG Chem to make batteries for vehicles coming out of Shanghai.CompositionTesla watchers will also be looking for the possibility of a Cobalt-free battery. Cobalt, an expensive rare- earth mineral, is deemed a “conflict mineral,” as its mining has been linked to human rights abuses, corruption, environmental devastation and child labor in the Democratic Republic of Congo, which produces about 60% of the mineral.Another reference to watch for is nickel, a key ingredient in Tesla batteries. During the company’s second quarter earnings call, Musk said, “The real limitation on Tesla growth is cell production at an affordable price. That’s the real limit.”“Tesla will give you a giant contract for a long period of time if you mine nickel efficiently and in an environmentally sensitive way,” he added.The stock priceBattery Day will take immediately following the company’s annual shareholder meeting in Fremont, California, on Tuesday.Only a certain number of shareholders selected from a drawing are allowed to attend in person, and the event will be streamed online.Year-to-date Tesla is up 428%. The stock closed at an all time high on August 31st following its 5-for-1 stock split. Tesla was sidelined for inclusion in the S&P 500 (^GSPC) earlier this month, sending shares lower that day.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreNikola calls short-seller report a 'hit job,' shares still fallWhy Tesla shares are tanking todayTesla analyst is bullish on what the company is doing with its high-priced stock, raises price target to $550Apple analyst says record-breaking share price rally is about 'MOMO' not 'FOMO'Tesla shares surge 12% on day of stock split"}]}