{"article": [{"url": "https://finance.yahoo.com/news/chinas-goal-is-to-replace-you-barr-warns-leaders-of-america-biggest-businesses-202355046.html", "published": 1594913480.0, "headline": "'China’s goal is to replace you': Barr warns leaders of America's biggest businesses", "body": "U.S. Attorney General Bill Barr delivered a blistering critique of the Chinese Government Thursday and singled out U.S. business leaders as complicit in the country's rise.Speaking at the Gerald R. Ford Presidential Museum in Grand Rapids, Michigan, he pointed to tech companies like Apple (AAPL) and Cisco (CSCO), as well as Disney (DIS) as examples of American firms \"bowing to Beijing.\"Barr then offered this warning to corporations doing business in China.“The ultimate ambition of China's rulers isn't to trade with the United States. It is to raid the United States,” Barr said. “If you're an American business leader, appeasing the PRC may bring short term rewards, but in the end the PRC’s goal is to replace you.”Barr's comments are the latest salvo in a concerted effort by the Trump administration to ramp up pressure on Beijing, from Hong Kong to national security concerns tied to tech firms TikTok and Huawei.U.S. Attorney General William Barr speaks at the Gerald R. Ford Presidential Museum in Grand Rapids, Mich., Thursday, July 16, 2020. (Nicole Hester/Mlive.com/Ann Arbor News via AP)On Tuesday, the President signed an executive order stripping the city of its special trading status with the U.S., saying its New National Security law violated China's \"One Country Two Systems\" process, and signed into law the bipartisan Hong Kong Autonomy Act that allows for additional imposition of sanctions. That prompted Beijing to threaten retaliation, saying U.S. action “gravely violates international law and basic rules of international relations.”Meanwhile, the New York Times reported the White House is considering a sweeping travel ban to the U.S. for members of the Chinese Communist Party and their families.Barr's address unleashed a new line of attack, calling for some of America’s largest companies to reevaluate their relationship with China. He accused the country’s ruling communist party of corrupt efforts to raid the United States of its economic power, in part, by partnering with and pressuring U.S. firms.“The People's Republic of China is now engaged in an economic blitzkrieg an aggressive, orchestrated, whole-of-government and the whole-of -society campaign to seize the commanding heights of the global economy and to surpass the United States, as the world's preeminent technological superpower,” Barr said.Story continuesSpecifically, he singled out some of Silicon Valley’s biggest names, saying they had allowed themselves to become “pawns of Chinese influence.”“American companies such as Cisco (CSCO) helped the Chinese Communist build the Great Firewall of China, the world's most sophisticated system for internet surveillance, and censorship,” he said. “Over the years, corporations, such as Google (GOOG, GOOGL), Microsoft (MSFT), Yahoo (VZ) and Apple (AAPL) have shown themselves all too willing to collaborate with the CCP.”In a statement to Yahoo Finance, Cisco Spokesperson Kyrk Storer said, “Cisco builds its products to global standards, and Cisco does not supply equipment to China that is customized in any way to facilitate blocking of access or surveillance of users. The products we supply to China are the same we provide worldwide, and we comply fully with all export control rules applicable to China including those related to human rights.”Barr’s critique of Apple pointed to the company’s acquiescence to Beijing’s requests during protests in Hong Kong, that included removing news and pro-democracy apps from its App and Music stores, as well a decision to move some of its iCloud data servers to China.In an email to Yahoo Finance, a spokesperson from Apple revived the company’s prior statement concerning 2018 iCloud data storage move, saying the company elected to comply after China enacted laws requiring that cloud services offered to Chinese citizens be operated by Chinese companies and that Chinese customers' data be stored in the country.“While we advocated against iCloud being subject to these laws, we were ultimately unsuccessful,” Apple’s spokesperson wrote. “Our choice was to offer iCloud under the new laws or discontinue offering the service...we felt that discontinuing the service would result in a bad user experience and less data security and privacy for our Chinese customers.”In addition to big tech, Barr took aim at Hollywood studios including Paramount and Disney, saying “they risk undermining both their own future competitiveness and prosperity.”He accused Disney of bowing to pressure from Chinese censors after Beijing banned all of its films, following outrage over the 1997 film Kunlun.\"I suspect Walt Disney would be disheartened to see how the company he founded deals with foreign dictatorships today,\" Barr said. \"After the CCP banned all Disney films in China, the company lobbied hard to regain access and the CEO apologized for Kundun calling it a stupid mistake. Disney then began courting the PRC to open a $5.5 billion theme park in Shanghai. As part of that deal Disney agreed to give the Chinese government officials a role in its management.\"Disney did not immediately respond to a request for comment.-Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}