{"article": [{"url": "https://finance.yahoo.com/news/hall-fame-resort-entertainment-company-120000346.html", "published": 1597043300.0, "headline": "Hall of Fame Resort & Entertainment Company Honored as National Youth Sports Strategy Champion", "body": "Hall of Fame Resort & Entertainment Company (\"HOFV\" or the \"Company\") (NASDAQ: HOFV, HOFVW), the only resort, entertainment and media company centered around the power of professional football and owner of the Hall of Fame Village Powered by Johnson Controls in Canton, Ohio, announced today that The Office of Disease Prevention and Health Promotion (\"ODPHP\") and its President’s Council on Sports, Fitness & Nutrition (\"PCSFN\"), both part of the U.S. Department of Health and Human Services, have recognized the Company as a National Youth Sports Strategy Champion. The recognition honors HOFV for its commitment to investing in the lives of youth around the world through its various sporting events and programming.The vision of the National Youth Sports Strategy (\"NYSS\") initiative is to bring together likeminded organizations from across the youth sports landscape to collaboratively improve the health and wellness of young people. The effort encourages and supports environments in which all youth have the opportunity, motivation and access to play sports, regardless of their races, ethnicities, genders, abilities, or ZIP codes. The ODPHP invites public and private-sector organizations to apply to become NYSS Champions based on their established commitment to these directives.\"The President’s Council has done tremendous work in developing strategies to effectively build up healthy leaders in our community,\" said Michael Munoz, Vice President, Youth Football and Partnerships of Hall of Fame Village powered by Johnson Controls. \"We are excited to implement best practices in everything we do and to amplify their amazing work via our programming and events as a National Youth Sports Strategy Champion.\"NYSS Champions are youth-serving organizations that work in alignment with the NYSS initiative and uphold a values-based model of service to youth. Champions will receive recognition from the ODPHP and the PCSFN on Health.gov; a digital badge to highlight their support of the program; and tools to promote the NYSS and the importance of physical activity.Story continuesAbout the Hall of Fame Resort & Entertainment CompanyThe Hall of Fame Resort & Entertainment Company (NASDAQ: HOFV, HOFVW) is a resort and entertainment company leveraging the power and popularity of professional football and its legendary players in partnership with the Pro Football Hall of Fame. Headquartered in Canton, Ohio, the Hall of Fame Resort & Entertainment Company is the owner of the Hall of Fame Village Powered by Johnson Controls, a multi-use sports, entertainment and media destination centered around the Pro Football Hall of Fame's campus. Additional information on the Company can be found at www.HOFREco.com.About The Office of Disease Prevention and Health Promotion (ODPHP)The Office of Disease Prevention and Health Promotion (ODPHP) plays a vital role in keeping the nation healthy. We accomplish this by setting national public health objectives and supporting programs, services, and education activities that improve the health of all Americans. Our site includes information about Healthy People 2020 objectives and evidence-based, actionable health information for consumers from MyHealthfinder. Congress created ODPHP in 1976 to lead disease prevention and health promotion efforts in the United States. We’re part of the U.S. Department of Health and Human Services under the Office of the Assistant Secretary for Health.View source version on businesswire.com: https://www.businesswire.com/news/home/20200810005148/en/ContactsHall of Fame Resort & Entertainment Company Media InquiriesAnne Graffice330-458-9176Anne.Graffice@hofvillage.com Hall of Fame Resort & Entertainment Company Investor InquiriesInvestor.Relations@hofreco.com"}]}