{"article": [{"url": "https://finance.yahoo.com/news/ben-carson-on-second-coronavirus-economic-shutdown-you-do-that-again-and-you-completely-destroy-the-financial-infrastructure-145120567.html", "published": 1594807160.0, "headline": "Ben Carson on second coronavirus economic shutdown: ‘You do that again, and you completely destroy the financial infrastructure’", "body": "A second shutdown of the U.S. economy would destroy the country’s financial system, U.S. Secretary of Housing and Urban Development Dr. Ben Carson told Yahoo Finance.“When you look at the damage that was done the first time, you do that again, and you completely destroy the financial infrastructure, and a lot more people would...die than would ever die from the virus,” said Carson.The stay-at-home orders put in place to prevent the spread of the coronavirus in mid-March have thrust the U.S. economy into a recession. Coronavirus cases are surging throughout much of the country, including Texas, Florida, and California. Intensive care units at Florida hospitals, for instance, are overwhelmed, with some states scaling back their reopening plans.“The major failure in this situation in our country is that people are not taking [the coronavirus pandemic] seriously. And particularly, young people are not taking it seriously, because they know that their likelihood of dying is very small,” said Carson.While Carson ruled out shutting down the economy again, he also rejected complacency. “Obviously, we’ve got to be a little wiser,” he said. “What I’ve been encouraging people to do is to just assume that you’re an asymptomatic carrier, so that anytime you’re around an elderly person or vulnerable person, do those things that you would do if you thought you had the disease. And that will really get a handle on it very quickly. That’s what we need to be emphasizing.”Substandard housing is also playing a role in facilitating the spread of the coronavirus which has disproportionately impacted Black Americans, explained Carson.“Housing is inadequate [in low-income communities]. It’s because people cannot appropriately social distance. It’s because people cannot have the kinds of jobs, or don’t, for the most part, kind of jobs that allow them to telework. It’s because you have poor food choices in those areas, poor transportation, poor job opportunities, and worst of all, poor education and educational choices,” he said.Story continuesDirector of the National Institute of Allergy and Infectious Diseases Dr. Anthony Fauci speaks during a coronavirus task force briefing at the White House, Saturday, March 21, 2020, in Washington. From left, President Donald Trump, Housing and Urban Development Secretary Ben Carson, Fauci, Adm. Brett Giroir, assistant secretary for health, and Vice President Mike Pence. (AP Photo/Patrick Semansky)In an effort to help Americans facing financial hardship as a result of the coronavirus pandemic, Congress implemented an eviction moratorium as a part of the Cares Act.\"We've been all over this since the very beginning of the crisis, obviously, instituting the moratorium on evictions and foreclosures, providing a mechanism for forbearance, providing information on our website, for people to know what resources are available,” said Carson. Americans seeking housing assistance also have access to over 1,700 HUD counselors who can provide them with more information. In June HUD announced that the FHA was providing a two-month extension of its foreclosure and eviction moratorium through the end of August, after enacting the first extension in May.As a member of the coronavirus task force, Carson has worked with President Trump and Dr. Anthony Fauci, the nation’s top infectious disease expert, to slow the spread of the coronavirus in the U.S.“[The coronavirus task force] is not meeting on a daily basis anymore, but we certainly haven’t given up. What we do know is that some of the things that were being done a couple months ago were very effective,” Carson said. “You know, the handwashing, the social distancing, the mask wearing. And when those things began to be alleviated, I think a lot of people in our country did not take it seriously that they were supposed to continue to maintain those things.”In spite of reports that Trump and Fauci are feuding, Carson defended the work of the task force.“I think everybody has been working extremely hard to try to alleviate this problem, including Dr. Fauci,” he said.More from Sibile:Why Black patients receive worse care at the hospitalCost of Confederate symbols comes out of Black workers’ paychecks: EPIThe upside of Trump’s Fourth of July fireworksThe case for higher wages during coronavirus recessionMaster P on Aunt Jemima, Uncle Ben’s: ‘Those are not real people’Find live stock market quotes and the latest business and finance news"}]}