{"article": [{"url": "https://finance.yahoo.com/news/edited-transcript-stra-earnings-conference-201325527.html", "published": 1596286880.0, "headline": "Edited Transcript of STRA earnings conference call or presentation 29-Jul-20 2:00pm GMT", "body": "Q2 2020 Strategic Education Inc Earnings Call ARLINGTON Aug 1, 2020 (Thomson StreetEvents) -- Edited Transcript of Strategic Education Inc earnings conference call or presentation Wednesday, July 29, 2020 at 2:00:00pm GMT TEXT version of Transcript ================================================================================ Corporate Participants ================================================================================ * Daniel W. Jackson Strategic Education, Inc. - Executive VP & CFO * Karl McDonnell Strategic Education, Inc. - President, CEO & Director * Robert S. Silberman Strategic Education, Inc. - Executive Chairman of the Board * Terese Wilke Strategic Education, Inc. - Manager of IR ================================================================================ Conference Call Participants ================================================================================ * Gregory R. Pendy Sidoti & Company, LLC - Consumer Analyst * Huang Howe Barrington Research Associates, Inc., Research Division - Senior Investment Analyst & Research Analyst * Jeffrey Marc Silber BMO Capital Markets Equity Research - MD & Senior Equity Analyst * Randall M. Heck Goodnow Investments - Partner ================================================================================ Presentation -------------------------------------------------------------------------------- Operator [1] -------------------------------------------------------------------------------- Welcome to Strategic Education's Second Quarter 2020 Earnings Call. I will now turn the call over to Terese Wilke, Manager of Investor Relations for Strategic Education. Ms. Wilke, please go ahead. -------------------------------------------------------------------------------- Terese Wilke, Strategic Education, Inc. - Manager of IR [2] -------------------------------------------------------------------------------- Thank you. Good morning, everyone, and welcome to Strategic Education's conference call in which we will discuss second quarter 2020 results and the transaction we announced this morning. With us today are Robert Silberman, Executive Chairman; Karl McDonnell, President and Chief Executive Officer; and Daniel Jackson, Executive Vice President and Chief Financial Officer. Following remarks, we will open the call for questions. Please note that this call may include forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The statements are based on current expectations and are subject to a number of assumptions, uncertainties and risks that Strategic Education has identified in today's press releases that could cause actual results to differ materially. Further information about these and other relevant uncertainties may be found in Strategic Education's most recent annual report on Form 10-K, the 10-Q to be filed and other filings with the Securities and Exchange Commission, as well as Strategic Education's future 8-Ks, 10-Qs and 10-Ks. Copies of these filings and the full press releases are available for viewing on the website at strategiceducation.com. And now I'd like to turn the call over to Rob. Rob, please go ahead. -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [3] -------------------------------------------------------------------------------- Thank you, Terese, and good morning, ladies and gentlemen. With 2 press releases this morning, Karl and Dan have a lot of material to cover, but before I turn it over to the 2 of them, I just wanted to set the stage with a couple of introductory comments, particularly with regard to the impact of the coronavirus on our enterprise. First, notwithstanding the economic lockdowns and significant unemployment caused by the coronavirus pandemic, SEI had a particularly strong first half of 2020. Indeed, we outperformed our own plans and budgets by a wide margin. Second, having shepherded these 2 academic institutions through a number of economic cycles and crises in the past, this management team knows that significant unemployment has a negative effect on our prospective students' willingness and capability to enroll in a university degree program. While we never provide forward guidance, we are seeing some of that negative impact on both Strayer University's and Capella University's summer academic term enrollment, which will in turn drive SEI's third quarter results. Third, the coronavirus pandemic is also highlighting some of the significant advantages of our academic model and our comfort with online academic technology. These advantages will both propel our enterprise and create attractive opportunities for us in the future. For instance, we will almost certainly make permanent our transition of Strayer University to a fully online model similar to Capella University. While we will still maintain physical locations in our geographic markets for academic support, faculty coordination, international student classes and brand building, we will be able to significantly reduce those existing campus footprints and their associated costs. In addition, as we announced last quarter, in order to support the broader academic community in its forced shift to a fully online model, we have made our self-pay Sophia academic platform available free of charge to all universities and colleges. We have had over 150,000 students register to take Sophia courses since March. The platform has operated splendidly, and as more and more universities are now announcing that they will continue to require online and remote learning for the 2020-2021 academic year, we have decided to continue making the Sophia platform available. However, starting August 1, we will charge a modest subscription fee for unlimited access to our content, which we believe will significantly lower students' costs of achieving their college degree, as well as providing a meaningful new enterprise for SEI. And finally, as was disclosed this morning in a separate release, we are very excited to announce today the acquisition of Laureate's Australian and New Zealand academic assets. We have been tracking and studying these 2 assets, Torrens University in Australia and the Media Design School in New Zealand, for years. Torrens is one of only 43 universities in Australia which hold that nation's highest academic designation and accreditation as a university, and it is the only investor-funded entity in that group. The Media Design School, while smaller, is world-renowned for the quality of its graduates in the entertainment industry. While we are not naturally acquisitive, these 2 strong academic platforms are part of a group of no more than a half dozen universities that we keep track of worldwide which are of the highest academic quality and located in markets we are comfortable investing in, so we were delighted when they became available. We have sufficient sources of capital to fund the acquisition, which we hope to close by year-end and which we expect to be materially accretive for us in 2021. We believe both of these academic institutions will be worthy additions to Strayer University and Capella University and will increase the value of your investment in Strategic Education. In summary, over the last 20 years, we have occasionally seen external economic shocks which have affected our short-term student enrollment and financial results. However, our experience has also given us confidence that by maintaining our focus first and foremost on the successful academic achievements of our students, both our students and our universities will prosper over the long term. In addition, given our experience and expertise in academic innovation, technology and teaching online, we believe that SEI is uniquely positioned to provide the highest-quality academic services not just to our own students and institutions but to the greater academic community as well. And with that, let me turn it over to Karl for more details on this morning's announcements. Karl? -------------------------------------------------------------------------------- Karl McDonnell, Strategic Education, Inc. - President, CEO & Director [4] -------------------------------------------------------------------------------- Thank you, Rob. Good morning, everyone. As Rob just noted, we do have a fair amount to cover today, and I intend to broadly cover 4 key areas this morning. First, I'll have some comments on our second quarter financial results; second, I'll provide a preliminary outlook for the third quarter and balance of the year; third, I'll provide an update on a couple of our new strategic initiatives; and fourth, I'll add some comments on the acquisition we announced today of Torrens University and the affiliated assets from Laureate Education. First, though, beginning with our second quarter results, and Dan will go into more detail on these in a few minutes, but our overall second quarter financial results were quite strong. Our revenue growth of 4.5% in the second quarter, along with a very focused cost-management approach, enabled us to generate significant earnings growth and margin expansion. Our adjusted operating income and earnings per share were up from the prior year 37% and 30% respectively, with the differential in growth being almost entirely attributable to significantly lower interest income due to much lower yields on the large amount of cash on our balance sheet. Our adjusted operating margin of 24.6% was up 580 basis points from the prior year. Now we began to see the impact of the COVID lockdown unemployment on our demand in the back half of the second quarter, which did impact our enrollment results. New student enrollment declined 4% at Strayer while growing 1% at Capella, and total enrollment grew 6% and 1% at Strayer and Capella respectively. Although the demand environment has been affected by this unemployment at both Strayer University and Capella University, it is having a larger impact at Strayer, we believe primarily as a result of Strayer's mostly undergraduate student mix, including many first-time college students. We did see a similar, although less severe, reduction in Strayer demand following the recession of 2008 when Strayer's non -- sorry, when Strayer's new noncorporate-related students declined between 10% and 20% for several quarters. Strayer actually completed its third quarter enrollment results within the past couple of weeks, and for its summer academic term, which represents Strayer's third quarter enrollment, we anticipate new students will be down approximately 27% versus the prior year, while total enrollment will be down between 0% and 1%. Capella's overall demand environment has seen a much less severe contraction, most likely attributable to its focus on graduate education and its learners being more stable and less sensitive to the current economic downturn. Capella University is still in the early stages of its third quarter enrollment, so we have limited visibility, but we expect their third quarter results to be substantially better than Strayer's. Based on these enrollment outcomes, along with our cost management efforts, we project that both revenue and adjusted operating income will be flat to the prior year in the third quarter. And while we don't have any visibility into our fourth quarter yet, if you assume the current trends were to continue through the balance of the year, for the full year 2020, we would project revenue to be flat to up 1% and adjusted operating income and pretax income to be up in the low- to mid-single digits from prior year. Due to the pandemic-related unemployment, our preliminary planning for 2021 is to hold total operating expenses flat, meaning we will offset annual pay increases and investments into new strategic priorities with savings from other areas. As part of this, the company intends to implement a restructuring later this year to ensure that our resources are properly allocated heading into next year. And obviously, our 2021 planning will be refined as we get further into the year. Turning now to comments I made starting with our last earnings call where I discussed a couple of new strategic opportunities arising from the more sudden shift in demand in popularity to online or digital learning, one of those being Sophia Learning, our direct-to-consumer online portal with ACE-certified college courses. As Rob noted in early March, we decided to make Sophia free to the general public through the end of July of this year, and the popularity of that offer has been quite amazing. More than 155,000 unique users have registered for more than 350,000 courses. If you assume many of these courses are being used to transfer college credit to another college or university, this free offer has saved these students, collectively, certainly tens of millions of dollars, if not hundreds of millions of dollars, in college tuition. Pre-COVID, Sophia charged a flat fee per course of between $200 and $300. On August 1, when we intend to remonetize the platform, we will be converting Sophia to a paid subscription offer. Anyone who registered for a free class prior to August 1 will have the opportunity to buy unlimited access to Sophia for a full year for $149 for that first year. Anyone who had not registered for a free course prior to August 1 will have the opportunity to have unlimited access to Sophia for $79 per month, and we believe this is another example of our ongoing commitment to be a leader on college affordability. Another area I highlighted as a potential future opportunity for SEI is helping other institutions transition to online instruction, particularly since many of them have little to no experience in a digital setting, including many of the nation's HBCUs. And since our last call, SEI has received requests from more than 14 institutions collectively covering more than 25% of their faculty members for online training. We have created several courses to teach best practices in delivering and teaching online instruction, and to date have taught more than 300 non-SEI faculty members, with an additional 100 on a waitlist. In fact, 3 of these institutions have requested that we teach 100% of their faculty members in best practices in digital learning. To date, as we said previously, we've provided this as a public service with no charge to these institutions, but moving forward we see this as a possible new source of revenue as we get into the latter part of this year and moving into 2021. And finally this morning, like Rob, I'd like to briefly comment on the acquisition we announced today of Laureate Education's Torrens University and affiliated assets. This acquisition, which we anticipate will be immediately and significantly accretive, is consistent with our desire to find the highest-quality, most attractive higher education assets, be that domestic or international. Clearly, we felt we accomplished that in 2018 with the Strayer and Capella merger in the United States, and now we are confident we have found the highest-quality asset in the Asia-Pacific regions. Torrens is the only federally recognized university-level investor-funded institution in Australia. Like Strayer and Capella, it focuses primarily on adult students and has a very strong track record of producing superior academic outcomes. Torrens is led by its very talented CEO Linda Brown, who upon close will report to me, and she is aided by an exceptional team of leaders who have built this institution from the ground up. We have already begun transition and integration planning, which admittedly will be slightly more complicated with current travel restrictions, but I have full confidence in Linda and her team, as well as the SEI team, to complete this transition in a timely and effective manner. Our goal is to support Linda and her team as they work to fulfill their mission and also bring any and all SEI tools and technologies to help further improve outcomes and retention. And finally this morning, I'd like to express my ongoing and considerable gratitude to all of my colleagues within SEI. They continue to work tirelessly on behalf of our students, and in many cases, even more so now when they're remote, as opposed to when they were in the office. And with that, I'll ask Dan to run through the second quarter financial results. Dan? -------------------------------------------------------------------------------- Daniel W. Jackson, Strategic Education, Inc. - Executive VP & CFO [5] -------------------------------------------------------------------------------- Thank you, Karl, and good morning, everyone. First I want to remind everyone that our earnings release references as-reported or GAAP results, as well as adjusted results, which are non-GAAP. The adjusted numbers exclude charges and expenses that are nonrecurring, including merger-related costs. Please refer to the non-GAAP financial information included in the second quarter earnings release we issued this morning for additional information. Moving on to our second quarter results. Revenue for the second quarter grew 4.4% to $255.8 million, compared to $245.1 million in 2019, driven by nearly 4% total enrollment growth including both Capella and Strayer universities and slight improvement in revenue per student. Revenue per student was significantly better than we expected for the quarter, due in part to higher courses per learner at Capella University, which more than offset the impact of attrition, discounts and scholarships granted to students impacted by the pandemic. Attrition and uptake of discounts and scholarships were lower than we anticipated for the quarter, a trend we expect in the third quarter, and thus, we anticipate relatively stable revenue per student for the third quarter. For the full year, we project revenue per student to be down about 100 basis points, driven by pandemic relief measures and a continued mix shift to lower-paying corporate-sponsored students expected in the fourth quarter. Adjusted operating expenses for the second quarter declined 3.1% to $192.8 million, compared to $199 million in 2019, which, coupled with our revenue growth, drove almost 37% growth in adjusted operating income and almost 600 basis points of margin expansion. Operating expenses for the second quarter were lower than we expected, due mostly to bigger pandemic-related savings on facilities, travel, events and healthcare expenses. Our bad debt was 4.7% of revenue for the quarter, which was in line with last year even after considering an additional reserve against weaker anticipated collections due to the pandemic. Year-to-date, the additional reserve we've taken equates to about 100 basis points of additional bad debt expense as a percent of revenue. Our adjusted diluted earnings per share for the quarter grew 29.6% to $2.06, compared to $1.59 in 2019, and the adjusted effective tax rate for the second quarter was 28.5%, which is also the tax rate we're forecasting for the third quarter and full year 2020. Moving to the balance sheet and cash flow. We generated $43.2 million in cash from operations during the quarter, compared to $44.4 million during the second quarter of 2019, and ended the quarter with $525.3 million of cash, cash equivalents and marketable securities. Our cash from operations for the quarter was impacted by some unfavorable timing of large vendor payments and the timing of a large payroll run at the end of June. Capital expenditures for the second quarter of 2020 were $11.2 million, compared to $10.1 million for the same period in 2019, and for the full year 2020, we expect capital expenditures to be at the lower end of our estimate of between $40 million and $45 million. And finally, we continue to maintain $250 million in available credit on our revolver, though as indicated in our transaction announcement this morning, we've received commitments to expand the facility to $350 million at the close of the pending transaction. Rob? -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [6] -------------------------------------------------------------------------------- Thank you, Dan and Karl, and operator, we'd be pleased to answer any questions. ================================================================================ Questions and Answers -------------------------------------------------------------------------------- Operator [1] -------------------------------------------------------------------------------- (Operator Instructions) And our first question comes from the line of Jeff Silber with BMO Capital Markets. -------------------------------------------------------------------------------- Jeffrey Marc Silber, BMO Capital Markets Equity Research - MD & Senior Equity Analyst [2] -------------------------------------------------------------------------------- Wanted to first start on the acquisition. I know you've been talking about going internationally, or at least outside the U.S., for some time. Why Asia-Pacific as opposed to Europe? You talked a little bit about the specific assets you're buying, but I'm just curious in terms of the region. -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [3] -------------------------------------------------------------------------------- Well, it's both Asia-Pacific and specifically, Jeff, it's Australia and New Zealand. We're looking for markets where there's very predictable, good rule of law, English language, strong academic cultures that marry the academic and regulatory oversight that we have here in the U.S. The fact that it happens to be located in the Asia-Pacific region is an added benefit, but it's more about the quality of the institution and the market in which it's located, and our belief in our ability to transfer some of the expertise that we have in teaching working adults, particularly online, to a platform that we think can -- to which we can add value and from which I think we can extract an enormous amount of value. -------------------------------------------------------------------------------- Jeffrey Marc Silber, BMO Capital Markets Equity Research - MD & Senior Equity Analyst [4] -------------------------------------------------------------------------------- Okay, that's helpful. Based on what Laureate disclosed about these schools, it looks like a pretty sizable acquisition price relative to your own multiple. Can you talk about how you justify paying that multiple? -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [5] -------------------------------------------------------------------------------- Yes, I'm not sure that's accurate, Dan -- or Jeff. But the -- obviously when the deal is closed and some of the background information's available, then I think that'll be made clear. But our view is, when you have an opportunity for the highest-quality academic assets, and you have sufficient excess capital available to invest, you take advantage of those opportunities. As I said, we keep track of a small number of platforms both in the United States and outside of the United States that we think meet that criteria, and when they become available, we try and take advantage of that. -------------------------------------------------------------------------------- Jeffrey Marc Silber, BMO Capital Markets Equity Research - MD & Senior Equity Analyst [6] -------------------------------------------------------------------------------- Okay. You mentioned you expect the transaction to be, I guess, immediate and significantly accretive; can you talk a little bit about that, how you're going to get there, are there any synergy goals involved, et cetera? -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [7] -------------------------------------------------------------------------------- Well, there aren't any real cost synergies, Jeff, because #1, in a market as distinct as Australia is from where we are, we're not looking for the kind of synergies that we had when we combined Strayer and Capella. There may very well be a number of revenue synergies associated with our technologies and some of our platform and programs, but the real driver of significant accretion is, we're taking excess capital which is earning nothing on our balance sheet and employing it at rates of return relatively equal to what we have in our current business. And when you do that math, you generate an awful lot of accretion. -------------------------------------------------------------------------------- Jeffrey Marc Silber, BMO Capital Markets Equity Research - MD & Senior Equity Analyst [8] -------------------------------------------------------------------------------- All right, that makes sense. And finally, one more before I jump back in the queue. You had given a goal in terms of reaching, I think it was, low- to mid-20% adjusted operating margins by the end of next year. Does this transaction impact that at all? -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [9] -------------------------------------------------------------------------------- Karl? -------------------------------------------------------------------------------- Karl McDonnell, Strategic Education, Inc. - President, CEO & Director [10] -------------------------------------------------------------------------------- Hey, Jeff; Karl. I don't think so. We've been quite focused on cost management throughout the year. Our adjusted operating margin this quarter was nearly 25%. So we don't anticipate that post-close our notional view that we should have margins in the mid-20% range would change at all. -------------------------------------------------------------------------------- Operator [11] -------------------------------------------------------------------------------- And our next question comes from the line of Alex Paris with Barrington Research. -------------------------------------------------------------------------------- Huang Howe, Barrington Research Associates, Inc., Research Division - Senior Investment Analyst & Research Analyst [12] -------------------------------------------------------------------------------- This is Chris Howe sitting in for Alex. Diving a little bit deeper in regard to Strayer and also Capella, can you provide some color as to the month-to-month cadence or sequentially what you saw for the respective institutions in regard to enrollments? And specifically, corporate enrollments in regard to Strayer and how that impacted your results. And following up on that, perhaps some additional color on what you're seeing so far in July in regard to the month-to-month cadence? -------------------------------------------------------------------------------- Karl McDonnell, Strategic Education, Inc. - President, CEO & Director [13] -------------------------------------------------------------------------------- Sure. One thing to note -- Strayer and Capella operate on different academic calendars, and that's a product of Capella University having monthly new student starts and Strayer only having quarterly new student starts. So in any moment in time, Strayer is always enrolling students for their next quarter a quarter ahead of Capella, which is why we were able to provide you with some visibility for the third quarter today because Strayer's already completed that, whereas Capella is still very much in the early part of their third quarter enrollment. I'd say, broadly, we began to see some adverse impact on overall demand, and by that I mean inquiries into the universities and applications for new student enrollment, in the back half of the second quarter. As I said in my comments, that's been more pronounced at Strayer, much less so at Capella. I can't provide any visibility on Capella's third quarter enrollment results because it's so early other than to say we see it being substantially better than what Strayer's was. And it wouldn't be appropriate to comment beyond that for their third quarter because they're so early in the process. And with respect to corporate enrollments, as has traditionally been the case when we've had periods of economic downturns, corporate-affiliated enrollments are performing much better than the nonaffiliated channel, although I don't have the specific number for the third quarter for Strayer with me today right now. -------------------------------------------------------------------------------- Huang Howe, Barrington Research Associates, Inc., Research Division - Senior Investment Analyst & Research Analyst [14] -------------------------------------------------------------------------------- Okay. And you mentioned the more pronounced impact for Strayer given the visibility; I just want to make sure I have it correct. New student enrollment for the upcoming quarter, you said, down -- what was the number? -------------------------------------------------------------------------------- Karl McDonnell, Strategic Education, Inc. - President, CEO & Director [15] -------------------------------------------------------------------------------- So for the second quarter, which we reported today, Strayer's new students declined 4% on a year-over-year basis. And because Strayer has already completed its third quarter enrollment, we can provide that number to you, and it's down 27% year-over-year. -------------------------------------------------------------------------------- Huang Howe, Barrington Research Associates, Inc., Research Division - Senior Investment Analyst & Research Analyst [16] -------------------------------------------------------------------------------- Just wanted to make sure I had that correct. And then my last question, just in regard to the acquisition, you mentioned that you've been tracking them along with half a dozen other global institutions. Was this more of a reflection of this asset coming for sale? And how is the current environment as these institutions, some of which may be more pandemically strained than others, are more coming -- are more institutions coming to market that are yet still of high quality that would fit the brand that you currently have? -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [17] -------------------------------------------------------------------------------- Well, we don't have anything -- Alex (sic) [Chris], this is Rob -- we don't have anything that is immediately available that we know of. And indeed, the kinds of institutions that we keep our eye on, I mean, like all institutions, are affected by the worldwide pandemic, and I think most importantly the economic distress associated with that. But our view was the pandemic and COVID is a temporary phenomenon. Academic quality, if you maintain it, is a permanent source of value. So we were not overly concerned about the short-term impact with regard to COVID and considered ourselves fortunate to be in a situation to get our hands on something that we've sort of lusted after, and that it was available. -------------------------------------------------------------------------------- Operator [18] -------------------------------------------------------------------------------- (Operator Instructions) Our next question comes from the line of Greg Pendy with Sidoti & Company. -------------------------------------------------------------------------------- Gregory R. Pendy, Sidoti & Company, LLC - Consumer Analyst [19] -------------------------------------------------------------------------------- Can you provide with us -- it seems like you outperformed your budget forecast. Can you provide us a little bit of color on maybe what some of the drivers were? And then secondly on that topic, what type of costs did you incur? Were they significant with sort of the direct-to-consumer free Sophia offering in the quarter, and also the 14 instructional teaching class, and how should we thinking about those going forward? Thanks. -------------------------------------------------------------------------------- Daniel W. Jackson, Strategic Education, Inc. - Executive VP & CFO [20] -------------------------------------------------------------------------------- Hi, Greg, this is Dan. I'll take the first one and then hand it over to Karl. On the performance relative to what we said last quarter, it was both on the revenue front and, again, driven primarily by slightly better enrollment and then better revenue per student, and then more significantly on expense savings, which, as I noted earlier, were a lot driven by pandemic savings. We froze travel, events, and cut back on a lot of other areas leading into the pandemic, and then healthcare expenses, which of course we don't directly control, were a big part of it, as our employees adapted to the -- kind of the lockdown situations. So those were the big drivers of it, and I think moving forward we're going to continue to manage cost as prudently as we can, but I think there's definitely an element of some timing on this as we hopefully return to some level of normalcy. -------------------------------------------------------------------------------- Karl McDonnell, Strategic Education, Inc. - President, CEO & Director [21] -------------------------------------------------------------------------------- Yes, and with respect to incremental expenses for Sophia and our online enablement of other institutions, on the Sophia side, we added some headcount. These are courses that eventually, provided you pass, can be transferred for credit, so we want to maintain a high level of academic integrity, and so one of the roles that we have in Sophia are people that audit the coursework on the part of the student. We added some of those auditors. But these are a few hundred thousand dollars of incremental expense. To Dan's point, that was more than offset by savings in other areas. And with the online training that we did, that was content that we had already created, so there was really no incremental expense associated with delivering that. -------------------------------------------------------------------------------- Operator [22] -------------------------------------------------------------------------------- And we have a follow-up question from the line of Jeff Silber with BMO Capital Markets. -------------------------------------------------------------------------------- Jeffrey Marc Silber, BMO Capital Markets Equity Research - MD & Senior Equity Analyst [23] -------------------------------------------------------------------------------- In your prepared remarks, and forgive me; I don't have the exact wording, but I think you talked about the pandemic accelerating the plans to move Strayer to a fully online university. Can you talk a little bit about that? I know you've been expanding your footprints, you may turn those centers into some of the learning centers like you have at Capella, but some more color on that would be great. Thanks. -------------------------------------------------------------------------------- Karl McDonnell, Strategic Education, Inc. - President, CEO & Director [24] -------------------------------------------------------------------------------- Yes, sure, Jeff. It's important to note that back in March, we canceled all of Strayer's on-ground classes for the spring term. They've been canceled for the summer term and they will be canceled for the fall term. So we will have gone almost a full year with no on-ground classes at Strayer. And pre-COVID, only about 5% of our overall instructional seats were being taught in the on-ground mode in one of our campuses, so we just see this as an opportunity to move all of that instruction, with a few exceptions in major metropolitan markets where we have a high percentage of international students on F1 visas and/or VA students who need some on-ground flexibility, we probably will continue to provide that in select markets. Other than that, it just makes sense to move where students' preferences have already been going over the last several years, which is fully online. -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [25] -------------------------------------------------------------------------------- And Jeff, just to -- yes, just one thing -- this is Rob -- I just wanted to amplify is, is that the -- our campus network, for the most part, has been built out over the last 20 years. And these facilities were designed and built at a period where that ratio that Karl described was much, much lower in terms of the online participation. In many -- I mean, I think it was 30% or 40% of our classes were online versus 60% or 70% in the classroom. So as those leases were rolling off, we were already incrementally taking advantage of a shrinking footprint (technical difficulty) cost savings that come from the fact that we just know we can accelerate that shrinking of the footprint. -------------------------------------------------------------------------------- Operator [26] -------------------------------------------------------------------------------- And our next question comes from the line of Randy Heck with Goodnow Investment. -------------------------------------------------------------------------------- Randall M. Heck, Goodnow Investments - Partner [27] -------------------------------------------------------------------------------- I actually have 2 questions. The first one is, seasonally, a typical year, Q3 starts for Strayer equal roughly what percentage of the total starts? Then I have a follow-up after that. -------------------------------------------------------------------------------- Karl McDonnell, Strategic Education, Inc. - President, CEO & Director [28] -------------------------------------------------------------------------------- Hey, Randy; Karl. It's by far the lowest, and on a discrete percentage of overall annual new students, I -- Dan and I would have to get back to you on that. We don't have that off the top of our head. But it clearly is, seasonally, the lowest cohort, smallest cohort. -------------------------------------------------------------------------------- Randall M. Heck, Goodnow Investments - Partner [29] -------------------------------------------------------------------------------- Okay. And secondly, if I -- looking at Laureate's 10-K and trying to match up what the Australian and New Zealand properties, it looks like the revenue is somewhere in the neighborhood of $190 million. Maybe it's a little less than that. But assuming that number is in the ball park, are you -- I think Rob, or I can't remember who answered that question, but I think Rob said margins would be comparable to Strategic Education's current margins, which, at 25%, would imply that the EBITDA -- I think that's an EBITDA margin -- would be somewhere around $45 million or $50 million, other things being equal, based on the 2019 numbers. Which -- and by the way, it looks like the enrollment would -- has grown reasonably nicely since year-end '19, if I'm not -- if I'm reading this correctly. Am I in the right ballpark there? -------------------------------------------------------------------------------- Daniel W. Jackson, Strategic Education, Inc. - Executive VP & CFO [30] -------------------------------------------------------------------------------- Randy, I think you're probably in the right ballpark, but at this point we haven't included any of that in our disclosures, so I would say your math is probably right based on what Laureate's saying. We don't have a lot to add at this point. -------------------------------------------------------------------------------- Randall M. Heck, Goodnow Investments - Partner [31] -------------------------------------------------------------------------------- Okay. And the funding of this acquisition, is it -- are you going to use essentially all of your cash on the balance sheet, or the majority of it? -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [32] -------------------------------------------------------------------------------- Randy, it's Rob. We're finalizing the financing plan. It won't really be necessary for several months, obviously; it's probably, hopefully, within 6 months we could get it closed. But we do have sufficient capital and access to capital, and we'll optimize it for the highest return on capital and all of our other obligations. -------------------------------------------------------------------------------- Randall M. Heck, Goodnow Investments - Partner [33] -------------------------------------------------------------------------------- Okay. But as you pointed out, it's going to be highly accretive because the cash on the balance sheet currently is earning about nothing, and borrowing money at this point is also close to nothing. -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [34] -------------------------------------------------------------------------------- Yes, that's accurate. -------------------------------------------------------------------------------- Randall M. Heck, Goodnow Investments - Partner [35] -------------------------------------------------------------------------------- So all right. Okay. Terrific. It sounds like a great deal, and based on your -- on the results of the Capella acquisition, I would say shareholders ought to be pretty happy. So thank you. -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [36] -------------------------------------------------------------------------------- Thanks, Randy. -------------------------------------------------------------------------------- Karl McDonnell, Strategic Education, Inc. - President, CEO & Director [37] -------------------------------------------------------------------------------- Thanks, Randy. -------------------------------------------------------------------------------- Operator [38] -------------------------------------------------------------------------------- Thank you. And I'm showing no further questions. I will now turn the call back over to Executive Chairman Rob Silberman for any closing remarks. -------------------------------------------------------------------------------- Robert S. Silberman, Strategic Education, Inc. - Executive Chairman of the Board [39] -------------------------------------------------------------------------------- Thank you, operator, and thank you, ladies and gentlemen. We look forward to continuing to communicate with you. If you have questions, please give us a call. And we'll talk to you on our next scheduled earnings call in the third quarter. Thank you. -------------------------------------------------------------------------------- Operator [40] -------------------------------------------------------------------------------- Ladies and gentlemen, this concludes today's conference call. Thank you for participating, and you may now disconnect."}]}