{"article": [{"url": "https://finance.yahoo.com/news/we-are-watching-to-see-if-tesla-and-elon-musk-will-reveal-a-millionmile-battery-xpeng-ceo-171531166.html", "published": 1598531000.0, "headline": "We are watching to see if Tesla and Elon Musk will reveal a 'million-mile' battery: Xpeng vice chairman", "body": "Brian Gu — the vice chairman and president of China’s newest publicly traded electric vehicle maker Xpeng (XPEV) — is waiting with bated breath to see if Tesla (TSLA) changes the battery game at its upcoming Battery Day.If Elon Musk & Co. do drop a bomb on the industry, it could have profound ramifications on the useful life of electric vehicles. Moreover, it could further solidify Tesla’s lead in the EV space globally and help it better rival gas-powered engines.“We’re all waiting to see what Tesla is going to come out with in the battery,” Gu told Yahoo Finance’s The First Trade as he awaited the initial trade of his company’s stock, which debuted on the New York Stock Exchange on Thursday. Xpeng doesn’t manufacturer its own batteries.Gu adds, “So for us, obviously we love to work with the best-in-class technology by the manufacturers. If there is a technology that provides safer, cost efficient and better cells, we would love to work with them. I think we would look forward to seeing the rapid development which will drive the growth of the overall industry.”GUANGZHOU, CHINA - NOVEMBER 22: A Xpeng G3 car is on display during the 17th Guangzhou International Automobile Exhibition at China Import and Export Fair Complex on November 22, 2019 in Guangzhou, Guangdong Province of China. The 17th Guangzhou International Automobile Exhibition is held from November 22 to December 1. (Photo by VCG/VCG via Getty Images)Musk is widely expected to reveal a major advancement in battery technology at its Sept. 22 celebration. The anticipation is a small part of the reason Tesla’s stock has exploded 190% inside of six months.“In our opinion this battery technology will be very advanced, potentially last for decades, withstand all types of weather/terrain, and be another major milestone for the Tesla ecosystem. In theory this battery will support an electric vehicle for 1 million miles and be a major step forward when competing vs. traditional gasoline powered automotive competitors from both an ROI and environmental perspective,” says Wedbush Securities analyst and Tesla bull Dan Ives.While Xpeng doesn’t make its own batteries — instead partnering with outside industry leaders — it’s no EV slouch in its own right. The upstart EV maker has two models in the surging China electric car market that have launched to critical acclaim for snazzy infotainment systems and autonomous technology. It has another model on the way in 2021 and more upgrades for its autonomous driving technology.Story continuesThe company is not yet profitable, bur did manage to raise an impressive $1.5 billion in its IPO Thursday amid enthusiasm around the EV industry.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}