{"article": [{"url": "https://finance.yahoo.com/news/am-well-spikes-in-debut-ipo-seen-as-barometer-of-telehealth-market-growth-174011611.html", "published": 1600349780.0, "headline": "Google-backed 'plumber' Amwell spikes in debut, IPO a barometer of booming telehealth market", "body": "American Well Corp. (AMWL), began trading Thursday in a long-awaited move that may help boost competition in the increasingly hot telehealth market, and rides a wave of growing enthusiasm for virtual doctor visits that swelled during the COVID-19 pandemic.Amwell’s stock opened at $25 per share, well above the initial public offering (IPO) of $18 and up nearly 40% on the day. AmWell is backed by Google (GOOG) as well as pharmaceutical company Teva.The company is one of the larger existing digital medicine companies, and is a competitor to Teladoc (TDOC) — one of the few large telehealth brands which was trading at about $191 per share Thursday. Yet unlike its peers, AmWell has largely remained invisible to the public— on purpose.“We are plumbers,” joked Dr. Ido Schoenberg, CEO & Chairman of Amwell, in an interview with Yahoo Finance Thursday.Amwell’s network largely consists of back-end virtual services for health providers, and that will not change after the IPO, Schoenberg said. He added that segment of the market is “part of a very complicated maze of our health care ecosystem.”The CEO compared Amwell’s operation to a call center where “you don’t ask if the person is using Oracle or SAP,” he said. Similarly, patients are less worried about which app they use for telehealth, and more concerned about being able to see their doctor who has their medical record.“The network of Amwell is the doctors of America or the world,” Schoenberg said.In that way, the company also achieves one of its missions — to add value to the provider experience, rather than compete with it. That is an important distinction, as many providers first began to use telehealth because of the pandemic, and are likely to continue.And there are new incentives to help increase use, including a long-standing hurdle to pay providers fairly. With the federal government increasing reimbursements to match in-person visits, and insurers jumping on board for the pandemic, Schoenberg believes there will be increased interest.Story continuesWhen it first started gaining ground, the argument for telehealth was largely based on solving a distance problem, but that is no longer true.“It’s a total revolution in the actual way that health care is working,” Schoenberg said.Experts have been watching closely as strict restrictions ease in parts of the country, followed by a return to in-person visits. The debate over how that impacts telehealth in the long-term is happening now.For his part, Schoenberg believes that the outlook is positive. The IPO represents a milestone of a decade and a half, and “we still have decades to go,” Shoenberg said.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}