{"article": [{"url": "https://finance.yahoo.com/news/july-2020-jobs-report-labor-department-coronavirus-pandemic-unemployment-rate-191513556.html", "published": 1596786800.0, "headline": "July jobs report: Economy added back 1.763 million payrolls in July, unemployment rate fell to 10.2%", "body": "The US economy regained fewer jobs in July after a record gain in June, as a resurgence of coronavirus cases in some states earlier this summer weighed on the labor market recovery. However, the number of jobs added topped estimates, and the unemployment rate fell more than expected.The Department of Labor’s July jobs report was released at 8:30 a.m. ET Friday. Here were the main metrics in the report, compared to consensus estimates compiled by Bloomberg:Change in non-farm payrolls: +1.783 million vs. +1.48 million expected and +4.791 million in JuneUnemployment rate: 10.2% vs. 10.6% expected and 11.1% in JuneAverage hourly earnings, month over month: +0.2% vs. -0.5% expected and -1.3% in JuneAverage hourly earnings, year over year: +4.8% vs. +4.2% expected and +4.9% in JuneThe change in total non-farm payrolls for June was revised down slightly by 9,000 to 4.791 million, while May’s payrolls were revised up by 26,000 to 2.725 million.Contracts on the three major US stock indices pared overnight losses after the better-than-expected July print was released.July marked the third straight month that the economy added jobs on net. However, even with the past several months of gains, the economy has not made up the entirety of the lost jobs since the start of the pandemic – especially after April’s record drop of more than 20 million payrolls.In July, the number of unemployed individuals on temporary layoffs fell by 1.3 million to 9.2 million. That was half of April’s level, as Americans began returning to work following temporary virus-related business closures. However, the number of permanent job losers held steady in July over the prior month at 2.9 million, underscoring the longer-lasting impact to the labor market due to the pandemic.The services sector again led non-farm payroll gains in July, after the services economy was cut deeply by shelter in place orders and business closures earlier on this year. The leisure and hospitality industry added back 592,000 jobs after gaining nearly 2 million in June, and retail trade jobs increased by 258,000 in July after a rise of more than 800,000 during the prior month.Story continuesWithin services, information-related industries were the only group to shed jobs on net in July, losing 15,000. Within the goods-producing sector, mining and logging jobs fell by 7,000.Government jobs rose by 301,000 in July, after an increase of 54,000 in June.Elsewhere, the jobless rate improved by a greater than expected margin to 10.2% in July from 11.1% in June. However, the unemployment rate remained above the the Global Financial Crisis peak of 10.0%, and more than double the 3.5% rate from February before the spread of the pandemic in the U.S.Average hourly wages unexpectedly rose on a month over month basis by 0.2%, following a revised 1.3% decline in June. Consensus economists had expected to see average hourly earnings moderate and decline 0.5% on a monthly basis, due to compositional effects as low-wage workers reentered the workforce following shutdowns.The US economy added back 1.763 million non-farm payrolls in June and the unemployment rate edged lower to 10.2%. (David Foster/Yahoo Finance)As had been the case since the start of the pandemic, the dispersion among estimates for July’s change in non-farm payrolls was elevated.On the high end, a handful of economists estimated that the economy added back at least 3 million jobs during the month, or double the median estimate. Several, however, expected that non-farm payrolls declined by several hundred thousand. US employers added back more jobs than expected in each of the three latest jobs reports.Still, economists convened on the notion that the pace of recovery in the labor market decelerated since June, due to both the sunsetting of enhanced federal unemployment benefits and the reimposition of stay-in-place measures in some states.“The 1.763 million increase in non-farm payrolls in July confirms that the resurgence in new virus cases caused the economic recovery to slow, but also underlines that it has not yet gone into reverse,” said Andrew Hunter, senior economist for Capital Economics. “With new infections now trending clearly lower again and high-frequency activity indicators showing tentative signs of a renewed upturn, employment should continue to rebound over the coming months.”Ahead of the July jobs report, other recent data also reflected a braking recovery in the labor market. The reference week for the Labor Department’s jobs report captured the period including the 12th of the month, and in mid-July, weekly unemployment insurance claims worsened for two consecutive weeks after months of improvement.Plus, the closely watched ADP National Employment Report released Wednesday showed private payrolls rose by a meager 167,000 in July. Consensus economists had expected private employers added back 1.2 million payrolls, after an upwardly revised 4.3 million additions in June.The ADP report, however, has historically been an imprecise indicator of the “official” government-issued employment report. ADP’s initial print for May, June and now July payroll additions each ultimately undershot the data reflected in the Labor Department’s monthly reports.This post is breaking. Check back for updates.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}