{"article": [{"url": "https://finance.yahoo.com/news/why-warren-buffett-matters-more-than-ever-on-his-90th-birthday-115107937.html", "published": 1598684360.0, "headline": "Why Warren Buffett matters more than ever on his 90th birthday", "body": "Warren Buffett turns 90 tomorrow.The number itself isn’t that remarkable (there are a couple million of 90-somethings in the U.S these days). It’s what Buffett has accomplished—and what he may still do that’s astonishing.At 90 years of age Buffett has never been more of a force (more on that in a bit). And with all due apologies to his partner, Charlie Munger, nevermind Tony Bennett and Jimmy Carter, Buffett has to be the most impactful nonagenarian in America, if not the world.Buffett’s life and achievements have been singular, and as he never fails to point out, uniquely American. To be clear though, his is not an up-from-poverty story. Buffett came from privilege. His father was a Congressman from Nebraska (and as a die-hard conservative, close to a political opposite of his son.) Still the Buffetts weren’t rich and beyond that, while his background surely helped, it certainly didn’t make him one of the successful people on the planet.People always ask me what Warren Buffett is like. Well, for one thing he’s purposeful and self-aware. Buffett has thought a great deal about longevity, for instance, but not in an obsessive, cryonics way. He told me this in a conversation I had with him last year:“If I gave you a car, and it'd be the only car you get the rest of your life, you'd take care of it like you can't believe. Any scratch, you'd fix that moment. You'd read the owner's manual, and you'd keep a garage, and do all these things. And you get exactly one mind and one body in this world. And you can't start taking care of it when you're 50. By that time, you'll rust it out, if you haven't done anything. So you should really make sure that you just remember that you've just got one mind and body to get through life with, and to do the most with it.”Before I get to his other salient attributes I want to add some disclaimers here because already I can see the Twitterati rolling their eyes, so here goes: Yes, Warren Buffett is a businessman. You may not like some of the companies he owns or in which he has invested. Yes, he makes money, lots of money. (You may not like that either.) “Here is a guy who has become extraordinarily wealthy and did it in a fair way,” says Robert Miles, longtime Berkshire Hathaway shareholder and author of \"The Warren Buffett CEO.” But Miles notes: “He’s a shark. Obviously you’re not going to be that successful and rich without being an ace negotiator.”Story continuesBuffett has made mistakes too, many of them in fact, (which he’s happy to discuss.) Also Buffett isn’t posing as some sort of country hayseed like some suggest, trying to fool people. He’s actually one of the most sophisticated people you’ll ever meet. He just happens to be polite, friendly and live in Nebraska. (Do all rich people have to be rude, icy and live in Greenwich?)His commercial achievements are stunning, which as of today are marked by a pair of sixes. Berkshire Hathaway, which he’s run for 55 years, is now the 6th largest company in America, and Buffett’s $82 billion fortune makes him the 6th richest citizen of planet Earth. How’d he do that? “It’s this notion of patience, the notion of focus, and the notion of looking at companies with a telescope is what I think is important to underscore what Buffett is doing,” legendary investor Mario Gabelli told me this week. “Take the cash up. Let other people run it. Reallocate the cash flow. That's his business skill set. At 90, you don't need hand-eye coordination. So he can do this for another 50 years. I just hope they come up with some medicine, some aphrodisiac or some dynamic that keeps him going.”Buffett’s footprint is bigger than ever. He gets even more calls from CEOs, politicians and societal leaders. His market moves attract more attention—like when he sold airlines stocks or bought gold this year. Internationally he’s more well known than he’s ever been. “Since the financial crisis of 08-09, the luster of the U.S. financial model began to wane in China and all over the world,” says Li Lu, founder and chairman of Himalaya Capital Management, a multi-billion dollar investment firm which has business ties to Berkshire Hathaway. “The example of Buffett and Berkshire on the contrary have increased their influence precisely because they point to a different way of conducting yourself. He’s singled out as someone who’s not typical of American ways. I don’t think the current tense relationship between China and the U.S. has in any way dented his reputation.”At 90 years old, that’s impact.But even more than that, Buffett has become a paradigm for living. That’s really why millions around the globe hang on his every word. Or why when you go to his annual meeting in Omaha, tens of thousands sit in stone silence for hours listening to him and Munger wax poetic. I’ve always felt it was like a church in there, or a cult, which it kind of is. Except in this cult the members invest in Berkshire Hathaway stock and make money—and they get to keep it!Every person I’ve ever spoken to about Buffett for any period of time, talks about his effect on them.Berkshire Hathaway CEO Warren Buffett participates in a newspaper throwing contest prior to the Berkshire annual meeting in Omaha, Nebraska May 2, 2015. REUTERS/Rick Wilking“He’s made remarkable changes in my life and me personally,” says Sharon Osberg, a longtime friend who plays bridge with Buffett a couple times a week. “Having the privilege of observing his behavior in difficult situations has taught me a lot about how to do that. And I learned how to be happy.” (Osberg recalls that when she first met Buffett decades ago “I got into his office, and started rolling dice on the floor. I was on hands and knees rolling dice with him.”)Li Lu says he walked into a lecture Buffett was giving years ago at Columbia University and “...was instantaneously taken by him. What he basically taught me in that course was that somebody with high moral principles and integrity can make a lot of money off the market by being wise and smart and moral,” Lu says. “For many years, he and Charlie were my role models. Normally I don’t take a living person as a role model, knowing how fragile human beings are. But for 25, 30 years he and Charlie never disappointed me in how to conduct business and life.”Says author Miles: “He’s transformed my life personally, more than anyone else in terms of modeling good behavior and having fun. He’s made me a better person, made me rethink my own philanthropy, in terms of helping those who through no fault of their own were born on the wrong side of track.”“I showed up at the Berkshire meeting to learn how to become rich and make a lot of money and compound stocks at a high rate,” says Wall Street hedge fund manager Whitney Tilson. “And instead, what I got was a dose of what they call worldly wisdom, about developing good habits and the importance of integrity becoming a learning machine and how to be a good spouse and all these other things that have really helped shape me second only to my parents, I suppose.”Buffett often talks about the importance of giving to your family and friends, the people you love. And he walks this talk, like when he flew to New York in June of last year to attend a 90th birthday party of his long standing pal, Carol Loomis, retired editor at Fortune, and sing a goofy song in her honor. (Now that’s how to stay young.)And there’s a zillion more.I know that’s a lot of gushing testimonials. But could anyone really say the same things about Buffett’s fellow mega-billionaires Bezos, Zuckerberg, Koch or Bloomberg? True, you might admire them or learn from them, but what people around the globe have received from Buffett is in another league.Of course everyone always asks what will happen to Berkshire once Buffett finally does retire or pass on. Buffett has heard this 90 million times, and for decades. And he’s been working on succession, and for decades. As my colleague Sam Ro points out, it’s almost as if Buffett wants us to focus on his succession plan because it draws more attention to Berkshire, something Buffett has been unapologetically P.T. Barnumesque about.And who’s to say the torch can’t be passed smoothly? Steve Jobs certainly did right by Apple when he picked Tim Cook, a point not lost on Buffett, particularly now that he owns $120 billion of Apple stock, worth almost 25% of Berkshire’s market value. Buffett’s two trusted lieutenants, (Ajit) Jain and (Greg) Abel—not to be confused with Cain and Abel, or at least Berkshire shareholders hope not—are increasingly hands on and poised to lead.Warren Buffett, CEO of Berkshire Hathaway Inc, pauses while playing bridge as part of the company annual meeting weekend in Omaha, Nebraska U.S. May 6, 2018. REUTERS/Rick Wilking“When you love your life, of course you want it to go on and on,” says Laura Rittenhouse, consultant and author of “Buffett's Bites: The Essential Investor's Guide to Warren Buffett's Shareholder Letters.” “But the fact that he put the succession plan into place says he has certainly confronted the inevitable.”For now and the foreseeable future (whatever that means when you’re 90), Buffett is still running things, aware that he’s being scrutinized in a way, well, that any 90-year-old CEO would. In fact, Osberg says she and Buffett were just talking about that.“We had that discussion a couple nights ago. He finds it interesting that so many people are interested in his mental faculties. He totally understands,” she says. “I literally told him this on Tuesday, I have not noticed a decline in him. He’s slower at some things, physically the body gets slower when you’re older. He walks slower, knees hurt, or whatever. He would tell you certain things he feels he’s slower at mentally, but nothing important. Like remembering names, something that none of us can do anymore. It really is amazing.”A recent interview in a nice piece by the Omaha World Herald this week, noted longevity is in Buffett’s family’s genes. His mother lived to be 92, and his sister Doris who died this month was also 92. Baby sister Bertie, whom Buffett said he will be visiting next month, is 86. “‘My dad is going to outlive us all, and I’m not kidding,’ said his daughter Susie Buffett in the article. ‘I’ll bet a lot of money he will get to 100.’” (If Buffett did, he’d be bucking the odds of course.)Berkshire Hathaway CEO Warren Buffett bites into an ice cream during a trade show at the company's annual meeting in Omaha, Nebraska May 3, 2014. Warren Buffett's Berkshire Hathaway Inc on Friday said quarterly profit declined 4 percent, falling short of analyst forecasts, as earnings from insurance underwriting declined and bad weather disrupted shipping at its BNSF Railway unit. REUTERS/Rick Wilking (UNITED STATES - Tags: BUSINESS TPX IMAGES OF THE DAY)And famously Buffett eats like a first-grader, which he explained to me a couple of years ago: “I actually eat exactly what I like to eat. If I liked it on my sixth birthday—on my sixth birthday party, when we had hot dogs, and hamburgers, and Coke, and ice cream with chocolate—I still like it. And I don't care about anything, subsequently. I discovered it all by the time I was six. And if somebody offered me a deal when I was 20, and said, you're going to live one year longer—instead of living to 88, you'll live to 89, or whatever it may be—if you eat nothing but broccoli, and Brussels sprouts, and onions, and all these things, take the last year off. It probably won't be that good anyway. So I eat what I like to eat. I'm not venturesome, in that area.”But shhhh, there may be some concessions to health and wellness afoot. Osberg tells Yahoo Finance that Buffett eats salmon once a week. And she reports he now “exercises faithfully on his treadmill.” The real trick though Osberg says is “his attitude. Everybody talks about his attitude and how happy, cheerful he is. That’s the gospel truth. He loves every day. Every single day, he loves. I’m not sure I've ever met a person who feels that way. But he does.”On May 2 of this year, three of us; my wife and I, along with Susie Buffett, sat on the empty floor of the CHI Health Center Omaha and watched Buffett and Greg Abel address Berkshire shareholders remotely for the company’s annual meeting, (streamed by Yahoo Finance I might add.) As Buffett got up on the platform, he smiled and waved at us, looking spry enough. Little did we know. Buffett then began to speak and answer questions, unscripted for four hours and 28 minutes straight, no breaks, on almost every subject under the sun.He was impassioned that afternoon, talking about America in the time of COVID-19:“Nothing can stop America when you come down to it, even with the scariest of scenarios. It may have been tested during the Great Depression, and it may be tested now to some degree. In the end the answer is never bet against America. That in my view is true today as it was in 1789 and even was true during the Civil War and depths of the depression,” Buffett said.It was a tour de force, as draining as it was impressive, and it may have been his best, most impactful talk ever.Not bad for an 89-year-old. And now he’s 90.Here then are birthday wishes from Mario Gabelli, which sound about right:“Warren, holy cow, you're only 90? I want to be there for what the Italians used to say cent'anni, which meant 100. Now, it's centocinquanta, 150 years. That's the birthday party that I'm going to have to give you a birthday wish for. But 90 going to 100 is at least a start. Happy birthday, Warren.”Yes indeed, happy birthday Warren. Long may you run. Whatever you’ve been doing has worked so far, so please keep doing it.This article was featured in a Saturday edition of the Morning Brief on August 29, 2020. Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAndy Serwer is editor-in-chief of Yahoo Finance. Follow him on Twitter: @serwer.Read the latest financial and business news from Yahoo FinanceRead moreHow to open schools the right way this fallHere's what Bill Gates and Warren Buffett talk about during COVID-19Inside Amazon, Apple, Facebook and Google versus the FedsHow to get out of the COVID-19 testing messBillions or trillions: The great coronavirus trade-offWhat America can learn about reopening from the state of Maine"}]}