{"article": [{"url": "https://finance.yahoo.com/news/fed-chair-powell-testifies-what-to-know-in-markets-wednesday-004442274.html", "published": 1592337140.0, "headline": "Fed Chair Powell testifies: What to know in markets Wednesday", "body": "Following his appearance before the Senate Banking Committee, Federal Reserve Chairman Jerome Powell will testify before the House Financial Services Committee Wednesday.Tuesday during his testimony, Powell emphasized that the Fed is encouraged by the recent economic data, but the central bank remains cautious and believes that the U.S. economy is still a long way from “normalcy.” Powell also reinforced his previous comments that the Fed is ready to do more if necessary to support markets.Federal Reserve chairman Jerome Powell testifies before the Senate Banking, Housing and Urban Affairs Committee on the Semiannual Monetary Policy Report on Wednesday, Feb. 12, 2020. (Photo by Caroline Brehman/CQ-Roll Call, Inc via Getty Images)“Recently, some indicators have pointed to a stabilization, and in some areas a modest rebound, in economic activity. With an easing of restrictions on mobility and commerce and the extension of federal loans and grants, some businesses are opening up, while stimulus checks and unemployment benefits are supporting household incomes and spending,” Powell said in his prepared remarks.“As a result, employment moved higher in May. That said, the levels of output and employment remain far below their pre-pandemic levels, and significant uncertainty remains about the timing and strength of the recovery. Much of that economic uncertainty comes from uncertainty about the path of the disease and the effects of measures to contain it. Until the public is confident that the disease is contained, a full recovery is unlikely,” he added.ING economist James Knightley agreed with Powell. “As Jerome Powell states, we cannot signal the all-clear until COVID-19 is beaten, or at least properly contained. The recent spike in new cases in several states suggests we need to make much more progress here, with the threat that renewed lockdowns could have a massive impact on confidence, risk assets and of course economic activity,” he wrote in a note Tuesday.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Retail sales jump 17.7% in May amid COVID-19 pandemicJobless claims: Another 1.54 million Americans file for unemployment benefitsA theory for why the 'startling' jobs numbers conflict with the other gloomy dataFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}