{"article": [{"url": "https://finance.yahoo.com/news/allstate-cutting-3-800-jobs-021400435.html", "published": 1601500940.0, "headline": "Allstate cutting 3,800 jobs as part of restructuring plan", "body": "Allstate is cutting 3,800 jobs, or 8% of its workforce, as part of a restructuring plan it undertook late last year.The job cuts will come primarily from claims, sales, service and support functions, the Northbrook-based insurer said Wednesday.The cutbacks are part of a multi-year “transformative growth plan,” designed to cut costs, change the way agents earn commissions and better compete against companies like Progressive and Geico.Allstate said it will take a pre-tax restructuring charge of about $290 million, with most of it recorded in the year’s third and fourth quarters. Severance payments and employee benefits account for $210 million, pre-tax. The cost of closing some offices will cost the company about $80 million, pre-tax.“Implementing this plan is difficult as we still deal with the impact of the pandemic but necessary to provide customers the best value,” Tom Wilson, Allstate’s chairman, president and CEO, said in a news release.The company is expanding transition support for impacted employees, including extended medical coverage, retraining support and help in employment searches, Wilson said.Ben Corey, a spokesman for Allstate, declined to comment on how many, if any, of the jobs being eliminated are in the Chicago area, or say which offices are closing.The plan also includes getting rid of its Esurance brand and consolidating Encompass Insurance, a subsidiary that sells personal property and casualty insurance, and Answer Financial, a website that allows customers to compare quotes. The company will continue to sell home, renters, auto and life insurance policies online, under the Allstate name.The company also said it will invest in marketing and technology.Allstate’s second-quarter earnings topped estimates, and during an earnings call in early August, executives said the company had made progress on its plan.“…I’d say our cost reductions, again, are a core part of transformative growth,” Mario Rizzo, chief financial officer, said on the call with investors. “So I’d say that’s really what we’re focused on doing as part of the plan.”Story continuesEarlier this year, Allstate announced it was purchasing New York-based insurer National General Holdings for about $4 billion.The company’s home office complex consists of several buildings totaling 1.9 million square feet of office space on a 186-acre site. It also operates out of about 450 smaller offices throughout North America, has offices in Northern Ireland, India and London.———©2020 Chicago TribuneVisit the Chicago Tribune at www.chicagotribune.comDistributed by Tribune Content Agency, LLC."}]}