{"article": [{"url": "https://finance.yahoo.com/news/n-j-governor-lawmakers-agree-130955120.html", "published": 1600344020.0, "headline": "N.J. Governor, Lawmakers Agree to Raise Tax on Millionaires", "body": "(Bloomberg) -- New Jersey Governor Phil Murphy and Democratic legislative leaders have agreed on a budget deal that will raise taxes on millionaires to fund rebates for about 800,000 middle-class households.The deal will push the tax rate to 10.75%, from 8.97%, for the estimated 35,600 with incomes above $1 million. It also includes a maximum $500 tax rebate for those with at least one child and income below $150,000, Murphy and lawmakers announced Thursday at a news conference. Almost all the new-rate revenue will pay for the rebates, Murphy said.“We do not hold any grudge at all against those who have been successful in life,” Murphy said. But “now is the time,” with families suffering job losses, to ask for more from high earners, he said.Murphy, a first-term Democrat, had pitched the higher rate in prior budget years but was blocked by Senate President Steve Sweeney, New Jersey’s highest-ranking state lawmaker.The Murphy budget estimated $390 million in revenue from the higher rate. The rebates will cost roughly $400 million.“We’re investing in the middle class,” Murphy said of the millionaire’s tax revenue use.Assembly Budget Chairperson Eliana Pintor Marin, a Democrat from Newark, called the $500 -- which won’t be distributed until after April 15 -- a “serious amount of money” for a single mother earning $75,000 a year.Critics, though, said the state, hit hard by the pandemic, would do better to fully reopen businesses to boost the economy. Murphy on March 21 closed non-essential businesses, a step that slowed the virus’ spread. While he has relaxed his orders, capacity limits remain on retail, indoor dining, theaters and gyms.“What about New Jersey’s business owners and entrepreneurs who are struggling?” New Jersey Chamber of Commerce President Tom Bracken said in a statement. “Sooner or later this administration needs to realize that the business community is not a bottomless ATM machine.”New Jersey must have a budget in place for the Oct. 1 start of the revised fiscal year, a nine-month cycle. The current fiscal year was lengthened by three months amid uncertainty about how much revenue would be lost because of the coronavirus pandemic. The new spending plan includes as much as $4 billion in borrowing to plug a revenue gap.Story continuesMurphy in 2018 enacted the 10.75% rate, the state’s highest, on those with incomes exceeding $5 million. The millionaire’s tax would apply to 16,491 New Jersey residents and 19,128 people living out of state, according to budget documents. Among those taxed higher on incomes of at least $5 million, 1,957 are state residents, and 5,749 live elsewhere.Assembly Minority Leader Jon Bramnick, a Republican from Westfield, said the higher tax will push New Jerseyans to move to lower-cost states.“Governor Murphy’s plan to raise taxes is a gift for the Florida economy and a nightmare for New Jersey,” Bramnick said in a statement. “Passing another ill-conceived tax will make outmigration worse and shift the tax burden onto the middle class when others leave.”(Adds detail on rebate funding starting in first paragraph)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}