{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-colleges-grapple-with-virus-spread-as-who-warns-against-vaccine-nationalism-175221539.html", "published": 1597755620.0, "headline": "Coronavirus update: US colleges grapple with virus spread as WHO warns against 'vaccine nationalism'", "body": "Colleges and universities attempting to open their doors for the fall semester have struggled with starting in-person classes, with the University of North Carolina-Chapel Hill backtracking on its decision after a surge of positive cases were reported.UNC’s move to revert to all-remote learning — after barely a week of classes — underscores the perils facing parents and officials who are grappling with the safe return of students to schools in the fall as COVID-19 casualties rise worldwide.Some institutions have asked students to sign acknowledgements of the risks of returning to class, denying they are liability waivers, while others are pushing ahead with testing strategies and social distancing to ensure those returning stay safe.Globally, the virus remains a struggle to contain. Worldwide, there are nearly 22 million confirmed cases, with the U.S. home to over 5.4 million of them, amplifying the push for a vaccine. On Tuesday, the World Health Organization urged countries to cooperate in a global pact, in an effort to avert “vaccine nationalism” that’s pitting major economies against one another.\"We need to prevent vaccine nationalism,\" WHO chief Tedros Adhanom Ghebreyesus said during a virtual briefing. \"Sharing finite supplies strategically and globally is actually in each country's national interest,\" he added.In South Korea, where the outbreak was tamped down relatively quickly, a church is now the focus of a recent outbreak. The pastor, who did not heed social distancing rules, has tested positive.In China, ground zero for the coronavirus has turned a corner, with a video showing thousands recently attending an open-air water festival going viral on social media. Wuhan has reported no new local transmission cases since May, following a restrictive 76-day lockdown and mass testing regime.In an encouraging sign, confirmed diagnoses in the hard-hit U.S. Sun Belt region has shown signs of leveling off, tamping down fears of new lockdowns that have crushed the economy in a polarized election year. Yet new cases in other states remain “very high,” according to tracking data from Goldman Sachs.Story continues“States representing over 80% of the population have new cases over 50 per million per day. In states representing 40% of the population new cases are still over 200 per million per day,” the bank wrote. “Although the nationwide downward trajectory is encouraging, state government officials may wait until case levels decline further before moving forward with additional reopening policies.”Cases in the south are beginning to subside. (Graphic: David Foster/Yahoo Finance)Eastman Kodak in the spotlightSeparately, Eastman Kodak (KODK) saw its trade halted after a more than 60% spike from the start of the trading session Tuesday. Just a day prior, White House advisor Peter Navarro bashed the company’s executives for floating stock options the day before a $765 million federal loan was announced.However, the question remains on whether or not it was a public relations error or wrongdoing on the part of executives. The loan, which would help the camera film-maker turn into a pharmaceutical manufacturer, is now on hold as the Securities Exchange Commission and Kodak itself are reviewing what happened.The move to grant the loan comes at a time when the Trump administration is focused on rerouting the supply chain for pharmaceuticals, with hopes to grow the raw material production in the U.S. Currently, a majority of active pharmaceutical ingredients (APIs) are made in India and China.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}