{"article": [{"url": "https://finance.yahoo.com/news/congressional-watchdog-finds-significant-risk-for-fraud-in-paycheck-protection-program-163620140.html", "published": 1593085460.0, "headline": "Congressional watchdog finds 'significant risk' for fraud in Paycheck Protection Program", "body": "The $670 billion Paycheck Protection Program is vulnerable to fraud, according to a new report from the U.S. Government Accountability Office.“Because of the number of loans approved, the speed with which they were processed, and the limited safeguards, there is a significant risk that some fraudulent or inflated applications were approved,” said the report.The CARES Act mandated that GAO monitor coronavirus relief efforts and spending and issue bimonthly oversight reports.In an effort to get the loans to struggling small businesses quickly, the GAO notes that the Small Business Administration allowed lenders to reply on borrowers’ certifications to determine eligibility for the loans. Borrowers had to self-certify that they need the loan due to economic uncertainty and that they needed the money to cover payroll or other eligible expenses.“...Reliance on applicant self-certifications can leave a program vulnerable to exploitation by those who wish to circumvent eligibility requirements or pursue criminal activities,” said the GAO.The report also found that confusing guidance “has increased the likelihood that borrowers may misuse loan proceeds or be surprised they do not qualify for full loan forgiveness.” (According to the SBA, businesses must spend at least 60% of the loan for payroll in order for it to be forgiven.)Jovita Carranza, Administrator U.S. Small Business Administration, testifies as Treasury Secretary Steven Mnuchin looks on, during a Senate Small Business and Entrepreneurship hearing to examine implementation of Title I of the CARES Act, Wednesday, June 10, 2020 on Capitol Hill in Washington. (Kevin Dietsch/Pool via AP)The GAO recommends SBA develop a plan to address PPP risks, and put it into action in order to protect the program’s integrity and address potential fraud.“Because SBA had limited time to implement up-front safeguards for the loan approval process and assess program risks, ongoing oversight will be crucial,” said the GAO. “SBA has announced efforts to implement safeguards after loan approval but has provided limited information on how it will implement these safeguards.”The Treasury Department and SBA have said they would review loans larger than $2 million, but the GAO said as of June 15 it had not received any information about how or when the agencies plan to conduct those reviews.Story continues“Further, SBA had not informed us of any specific oversight plans for the more than 4 million loans of less than $2 million, including how it would identify which loans to review and the number of reviews planned,” said the report.The GAO report also found that more than 1 million dead Americans received a coronavirus stimulus payment totaling over $1.4 billion.SBA failed to provide critical informationThe watchdog said the Small Business Administration has failed to provide information “critical to our review, including a detailed description of data on loans made.”“Most agencies were generally able to provide GAO timely access to information for this report while executing their responsibilities during this unprecedented national crisis. In this regard, they have shown that it is not only possible but imperative to cooperate in a meaningful way with oversight of the trillions of dollars of public money appropriated in the COVID-19 relief laws as they carry out their responsibilities,” the GAO said in the report.The GAO said it continues to work with SBA officials to get the data and other information.The Administrator of the Small Business Administration Jovita Carranza speaks during the daily briefing on the novel coronavirus, COVID-19, in the Brady Briefing Room at the White House on April 2, 2020, in Washington, DC. (Photo by MANDEL NGAN / AFP) (Photo by MANDEL NGAN/AFP via Getty Images)Last week, Treasury and SBA announced it would release details of PPP loans of more than $150,000. While the decision satisfied some Republicans, many Democratic lawmakers say it’s not enough transparency.“I frankly think if you sign up for a taxpayer dollars —for a loan-to-grant —the fact that you’ve received that loan-to-grant should be public. That’s how we manage to report back to the American people that we’ve spent their money wisely,” said Sen. Chris Coons (D-DE) in an interview with Yahoo Finance on Wednesday.On Thursday, Sen. Kamala Harris (D-CA) and Rep. Katie Porter (D-CA) introduced legislation to require SBA to release data on all PPP loans.“Let’s be clear: all data on borrowers receiving PPP loans must be made publicly searchable, online, and regularly updated,” said Harris in a statement.The Select Subcommittee on the Coronavirus Crisis will hold a hearing with the GAO on Friday.“Today’s GAO report comes as our nation faces the grim reality that the Trump Administration’s policies have failed to contain the coronavirus outbreak,” Majority Whip James Clyburn (D-SC), the chairman of the subcommittee, said in a statement.“GAO has also sounded the alarm on the Administration’s efforts to stymy legitimate oversight by withholding ‘critical’ information and preventing GAO from completing its work. This obstruction must end,” said Clyburn.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Business leaders, tech CEOs bash Trump's visa suspensionNew bill would allow small businesses to get second PPP loanACLU sues to stop SBA from denying PPP loans to people with criminal recordsCoronavirus oversight panel Democrats ask banks for info, docs on PPP loansSen. Menendez: May jobs report surprise ‘isn't solace' to unemployed workers"}]}