{"article": [{"url": "https://finance.yahoo.com/news/assassins-creed-valhalla-preview-194552327.html", "published": 1594565660.0, "headline": "'Assassin's Creed Valhalla' preview: Ubisoft looks to perfect its series' formula", "body": "Ubisoft is moving its long-running 'Assassin's Creed' franchise north, to England in the Dark Ages. (Image: Ubisoft)The video game industry's annual E3 conference may have been cancelled this year due to the coronavirus pandemic, but that isn't stopping some of the industry's biggest names from showing off their latest and greatest upcoming titles.Case in point: Ubisoft, which offered up the opportunity to check out the next chapter in its Assassin's Creed franchise, \"Assassin's Creed Valhalla\" as part of its Ubisoft Forward E3-style showcase.In my roughly three hours with the game, it's clear that Ubisoft Montreal, the studio behind the title, is sticking to the successful formula it struck in 2017's \"Assassin's Creed Origins\" and refined in 2018's \"Assassin's Creed Odyssey.\"This time around, the Ubisoft team takes players to England's Dark Ages, putting them in the shoes of the Viking Eivor, who can be played as either a female or male character. I was able to run through a lengthy quest in my play time, as well as experience the game's randomized elements and encounters.You'll battle across England in 'Valhalla,' taking part in large-scale battles and even building out your own village. (Image: Ubisoft)\"Valhalla\" devotes an enormous amount of its screen real estate to building out the lush vegetation and shallow bogs of 9th-century England. Fog gently rolls across the expansive landscape as overgrown vines strangle the abandoned churches and towers that dot the region.As with \"Odyssey,\" you'll spend a good deal of time sailing in \"Assassin's Creed Valhalla.\" Your longboat, however, isn't just a mode of transportation from one spot to the next, it's also a platform from which you launch the game's new raiding feature.Yes, it wouldn't be a game about Vikings if there weren’t a bit of pillaging, and with a blast of your horn, you can call in your ship and crew to take down enemy encampments, setting fire to virtually everything in sight.It's a welcome mechanic, and in certain fights, a necessity. I took part in a large-scale raid of a fortification that felt as chaotic and fast-paced as expected. With warriors battling against entrenched archers and boiling oil being dropped from above, there was virtually no place safe to hide.Story continuesStealth is still here, but not the main goalBut that doesn't mean the old stealth assassin gameplay of the first Assassin's Creed titles is gone, there's just less of a focus on it. I was still able to sneak up behind people, hide around corners and dive into fortuitously-placed piles of leaves, but it certainly doesn't seem as though that'll be the main way players do battle.In fact, Ubisoft has doubled-down on the all-out melee combat of \"Origins\" and \"Odyssey\" by adding the ability to dual-wield everything from swords and axes to shields. Special combat abilities triggered by your character's supply of vigor also make their return with some decidedly more violent skills, including one that lets you fling a series of axes at nearby combatants.You can still poison enemies or put them to sleep if you'd rather not take them out entirely, but you'll definitely have more fun with the brutal attacks available.Your long boat is an essential part of your experience in 'Valhalla.' (Image: Ubisoft)Speaking of which, you'll dispatch your enemies in far more grotesque ways in \"Valhalla.\" We're talking head-flying, arm-chopping, chest-stomping violence. I vividly remember mouthing, \"Oh, God!\" to myself while fighting off a group of marauders who sprang out from the side of a path to rob me.They didn't win.As for the game's lore, I wasn't able to dig too far into the overall storyline other than the single quest I played in which I united two of the \"Valhalla's\" factions, the Vikings and the Christians. I also didn't get any information on the overarching Abstergo backstory, which is totally fine by me.The story will, however, offer the same role-playing game (RPG) elements that let you choose how you respond to certain situations and how you upgrade your character.As with \"Odyssey,\" you'll have a huge variety of upgradable skills that improve everything from your stealth to your attack and more.From the way it's shaping up, \"Valhalla\" looks as though it could be one of the finest entries in the Assassin's Creed saga to date. It also solidifies the series' change from a stealth action game to an action RPG franchise. And it's better for it.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:The best gadgets for the beach and pool: Tech SupportWhat is Palantir, and can it really predict crime?How to delete your Facebook, Instagram, and WhatsApp accountsApple is closing stores in these 11 states amid new coronavirus outbreaksFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}