{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-florida-sees-deadliest-day-yet-as-us-cases-spike-economy-jitters-grow-171000634.html", "published": 1594300700.0, "headline": "Coronavirus update: Florida sees deadliest day yet as US cases spike, economy jitters grow", "body": "U.S. states saw yet another day of record coronavirus casualties on Thursday, led mostly by a relentless surge in the stricken Sun Belt region that amplified concerns about bending the curve of new infections.Over 12 million worldwide have now been infected by the novel coronavirus, with more 3 million diagnosed in the U.S. alone. America’s woes come as markets are being whipsawed between data suggesting the economy has stabilized, and a stream of data suggesting more people are falling prey to the virus.On Thursday, the Sunshine State — a domestic epicenter — reported its worst day yet in hospitalizations and deaths, while Arizona recorded its highest number of cases in nearly a week. Meanwhile, New York saw hospitalizations creep up for the third straight day, just as the state begins the next phase of its reopening.Meanwhile, average citizens are desperate for some semblance of normalcy — even as fears grow of a second COVID wave that could lead to renewed restrictions on public life.“The high-frequency data suggest renewed fears about the coronavirus are starting to weigh on consumption even in states that haven’t moved to reimpose restrictions, reinforcing our view that the pace of the economic recovery will slow over the next few months,” wrote Andrew Hunter, senior U.S. economist at Capital Economics on Thursday.With a rollback of reopening plans occurring in coronavirus hotspots like Arizona, California, Florida and Texas, “its therefore not a huge surprise that the recovery in economic activity in these states has started to tail off,” Hunter said.“But the data also show a clear leveling off in the rest of the country too, despite other states not reimposing restrictions and some even continuing to loosen them,” he added.Coronavirus cases are surging in southern U.S. (Graphic: David Foster/Yahoo Finance)Internationally, the news abroad wasn’t much more encouraging. Hong Kong and Tokyo both set single day records for COVID-19 cases, while India — one of the largest international hotspots outside of Brazil — reported a jump of nearly 25,000 new diagnoses, bringing its five-day total to around 100,000.Story continuesWith the virus strengthening its hold on the global economy, attention has shifted toward methods of transmission and treatments to mitigate the spread.Amid widening criticism of its handling of the crisis, the World Health Organization on Thursday took a step closer to acknowledging the role of airborne spread, saying the virus can be transmitted via air during medical procedures that generate aerosols — added that spreading in other indoor settings was not entirely out of the question.That means “short-range” transmission in certain indoor venues like cafes, restaurants, churches and gyms — especially when they are crowded and poorly ventilated — “cannot be ruled out,” the WHO said.The WHO, “together with the scientific community, has been actively discussing and evaluating whether [COVID-19] may also spread through aerosols in the absence of aerosol generating procedures, particularly in indoor settings with poor ventilation,” the agency said. Earlier this week, the organization acknowledged \"emerging evidence\" of airborne transmission.While several key theories have gained traction, the WHO added that “the proportion of exhaled droplet nuclei or of respiratory droplets that evaporate to generate aerosols, and the infectious dose of viable [coronavirus] required to cause infection in another person are not known, but it has been studied for other respiratory viruses.”Big Pharma’s date with CongressAnd amid escalating hopes of finding a viable vaccine, a Congressional committee will hold a hearing on July 21 with companies that are thick in the race for a cure. It will include testimony from officials at AstraZeneca (AZN), Johnson & Johnson (JNJ), Merck (MRK), Moderna (MRNA) and Pfizer (PFE), all of whom have leading vaccine candidates in play.“The industry is in an unprecedented race and working at the fastest speed ever even imagined to get to the point where we will understand the degree to which a vaccine can actually prevent a covid-19 virus infection,” David Dodd, chairman and CEO of GeoVax, told Yahoo Finance on Thursday.“So we’re racing to do that [and] it’ll probably be early 2021, maybe a little bit later, before we know we have a vaccine that's safe and effective and durable,” he said. “Those are the 3 components that are absolutely critical.”According to Department of Health and Human Services Secrteary Alex Azar, the world’s largest economy may have tens of millions of experimental vaccine doses at its disposal by fall — and could scale up quickly to hundreds of millions by the turn of the year."}]}