{"article": [{"url": "https://finance.yahoo.com/news/fixing-americas-racial-economic-divide-could-add-400-billion-to-us-gdp-goldman-sachs-chief-economist-195442619.html", "published": 1595343740.0, "headline": "Fixing America's racial economic divide could add $400 billion to US GDP: Goldman Sachs chief economist", "body": "The social arguments for erasing the racial economic divide are clear. Systems and institutions have been stacked against Black people and others who are not white and the initial conditions of slavery and segregation and other racist policies still exert forces on the finances of many Americans.According to a lengthy note from Goldman Sachs (GS) about racial income inequality, fixing these circumstances would also be very good for the economy. The key takeaway from the bank’s chief economist Jan Hatzius: boosting America’s Black community would mean a boost for America’s GDP.“Although the case for reducing Black employment and earnings disadvantages is mainly one of fairness rather than efficiency, it could also deliver a boost to the level of US GDP of around 2%, which currently equates to just over $400 billion per year,” wrote Hatzius in a research note circulated Tuesday.Throughout American history, the gaps between Black and white Americans have been dramatic across a wide range of economic indicators: employment, wages, and capital.A Black Lives Matter ballon is seen at the Navy Memorial to support Black Lives Matter during the Black Mamas March a protest against police brutality and racial inequality in the aftermath of the death of George Floyd on June 27, 2020 in Washington, DC. (Photo by Michael A. McCoy/Getty Images)\"Except for a temporary improvement during the late 1990s labor market boom, these disadvantages have been strikingly constant over time — in the case of the household income gap, since at least 1967,\" Hatzius wrote.Part of the problem is a general shift towards inequality. As Moody's vice president-senior credit officer William Foster pointed out on Yahoo Finance, the decline of unions and the value of labor has driven a general trend toward inequality in American society, making this more difficult to solve. And adding racial discrimination and disadvantages for Black communities at work or in the credit markets only makes this worse.Not only is upward mobility lower for Black men, downward mobility is also greater. That means that Black men from rich families are more likely to tumble down the income spectrum than maintain their position, and that Black men lower on the income spectrum are less likely to move upwards to the mean as well.Story continues“Only around 3% of Black men born into the bottom quintile make it into the top income quintile, compared to around 10% of white men,” wrote Hatzius. “ If left unchecked, this perpetuates the income disadvantage of Black men across generations.”(Goldman Sachs)Put another way, according to a McKinsey report, almost 70% of Black middle-class children are likely to fall out of the middle class as adults.No doubt the figures are stark: In 2016, the average wealth of Black U.S. households was $140,000, compared with $901,000 for white households was, nearly 6.5 times greater, according to a 2019 report by the Federal Reserve Bank of Cleveland.Invest in educationFixing all of these problems will require a wide array of policy solutions, but Hatzius suggests starting with early childhood development.“From a policy perspective, recent research shows that supporting disadvantaged children starting at a very early age — e.g. via subsidized early childhood programs — can yield largebenefits later in life, including in labor market outcomes,” Hatzius wrote.While policy is generally not race-specific, Hatzius writes, ensuring good early childhood education would significantly benefit Black children.(Goldman Sachs)Longitudinal studies confirm the efficacy of programs like the Head Start program, which started in 1965, and that it affected \"cognitive development, stronger conscientiousness, higher lifetime earnings, better health, and reduced criminal activity.\"If the U.S. can solve these racial disparities, Hatzius wrote, the country's economy would benefit. If policies addressed the 5-percentage-point employment gap that Black Americans suffer, the U.S.’s total labor income would rise 1.1%. If the 20% earnings gap narrowed, it would add 2.4% to the country’s total labor income. If both of these things were solved, it would provide a total boost of 3.5% to U.S. labor income — which would be a 2% increase of GDP. In real terms, that would be $400 billion.McKinsey has published reports with even higher estimates than Goldman Sachs’ numbers, finding that the racial wealth gap will cost the economy 4% to 6% between 2019 and 2028 — or $1 trillion to $1.5 trillion.“Reducing the economic disadvantages of Black Americans would therefore not just make America a fairer, but also a richer society,” wrote Hatzius.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Coronavirus crisis fuels push to widen social safety netThe 2008 recession was far worse for young people's careers than previously thoughtBlack communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey"}]}