{"article": [{"url": "https://finance.yahoo.com/news/walmart-unveils-store-updates-for-digital-age-163754789.html", "published": 1601466320.0, "headline": "Walmart is updating its iconic Supercenter store for the digital age", "body": "Walmart (WMT) is unveiling a \"completely new look and feel\" for its iconic Supercenter stores for the digital age of shopping.In an announcement on Walmart’s blog on Wednesday, chief customer officer Janey Whiteside shared details of an increasingly “customer-centric” layout more befitting of the shift toward online shopping, where sales for the world’s largest retailer have boomed.\"The design creates an elevated experience that appeals to shoppers through a sleek design aesthetic; a layout that spotlights products, and an end-to-end digital navigation that guides customers throughout their journeys,” Whiteside wrote.Walmart has tested the digitally-enabled store concept, and they're \"excited by the initial feedback from customers and associates,” the executive said.“By creating a system that acknowledges our app navigation from beginning to end, we create an optimized omni experience for both customers and associates,\" she added.The company will begin updating 200 Supercenters and some Health Centers and Neighborhood Markets in the fiscal year, with close to 1,000 stores next fiscal year.Additionally, the big-box retailer plans to revamp its interior and exterior signage to tout the Walmart mobile app's icon.\"As customers enter the store, they are greeted with clean, colorful iconography and a store directory that encourages them to download and use the Walmart app while they shop,\" Whiteside added.Inside the store, shoppers will be able to identify sections spotlighted with bold typeface. The stores will also feature colorful signage promoting the mobile app. Whiteside added that the aisles will be \"with letter and number combinations to guide customers from phone to product.\"Walmart is unveiling a new store design for the digital age.Whiteside noted that Walmart was inspired by \"airport wayfinding systems\" that direct large crowds through the store faster.\"We developed simple yet thoughtful designs to replicate these navigation efficiencies, which will help us move customers through the store more quickly,\" she added.Story continuesAt the checkout, there will be self-serve kiosks and contactless payment options through Walmart Pay. Some of the sections in the store will offer the Scan & Go for on-the-spot checkout.Walmart operates a fleet of more than 4,700 stores in the U.S. Approximately 90% of the U.S. population lives within ten miles of a Walmart.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. How kids and the coronavirus helped Walmart shape its yearly list of hot toysWalmart unveils ‘ultimate life hack,’ a $98 membership with access to groceries, gas, and deliveryWalmart tests drones to send coronavirus kits to homes in Las VegasWalmart teams up with Goldman to offer business lines of credit"}]}