{"article": [{"url": "https://finance.yahoo.com/news/here-is-where-trump-and-biden-stand-on-housing-issues-190539933.html", "published": 1601388800.0, "headline": "Here is where Trump and Biden stand on housing issues", "body": "Tuesday marked 35 days until the election. And whoever — President Trump or former vice president Joe Biden — wins the race, will have a hand at shaping the nation’s policies that impact homeowners and renters.Trump will continue limiting government housing regulations if he is re-elected to a second term, while Americans can expect an expansion of government-mandated protections for vulnerable groups under Biden’s $640 billion housing plan.Here’s a breakdown of each candidates’ housing policies.This combination of file pictures shows Democratic presidential candidate Joe Biden and U.S. President Donald Trump at separate speaking engagements in September 2020. (Photos by Jim Watson and Brendan Smialowski; Jim Watson, Brendan Smialowski via Getty Images).Coronavirus reliefThe most imminent and impactful result of the election would be the next president’s actions surrounding the coronavirus pandemic — and both candidates are focused on providing relief to homeowners and renters.Trump helped homeowners and renters stay in their homes during the pandemic with an executive order in September placing a moratorium on foreclosures and evictions through the end of the year — though lenders and landlords complain they’ve been left out of relief efforts.Biden’s pandemic emergency housing program offers few specifics, but his vice presidential pick Kamala Harris called for a year-long eviction ban and legal help for tenants facing eviction.Policies pertaining to businesses, unemployment benefits and the overall economy will also affect the housing market. Biden is expected to reopen the economy more slowly and offer a larger stimulus package.“If the moratorium continues after 31st [of December], landlords are going to need some support. And look at debates on stimulus bills for the economy — they are all stalling right now in Congress,” said Tendayi Kapfidze, chief economist at LendingTreePresident Trump lowered tax deductions available for homeowners under his Tax Cuts and Jobs Act of 2017.Tax creditsTrump lowered tax deductions available for homeowners under his Tax Cuts and Jobs Act of 2017. Supporters say allowing homeowners to deduct mortgage interest payments from taxable income perpetuated inequality because it’s a tax break for wealthy homeowners and overlooks renters.Biden plans to boost homeowner tax credits but not across the board — his proposed First Down Payment Tax Credit would create a $15,000 advanceable tax deduction for first-time homebuyers. The tax credit could help first-time homebuyers overcome the No. 1 hurdle to homeownership: the down payment.Story continues\"It's clear that an electoral sweep by the Democratic Party would make it far more likely that community development tax incentives could be enhanced and expanded,\" said Michael J. Novogradac, managing partner of Novogradac, a San Francisco-based accounting and consulting firm that studied the impact of potential election outcomes on the housing market.Trump is ready to take the companies public again so taxpayers aren’t shouldering the risk of loan defaults. (Photo Illustration by Igor Golovniov/SOPA Images/LightRocket via Getty Images)Fannie Mae and Freddie MacFreddie Mac and Fannie Mae are government-sponsored mortgage lenders that offer lower interest rates to low-income borrowers with, smaller down payments or low credit scores.But Fannie and Freddie for decades have been struggling to break free from their government roots. They became publicly-traded companies in 1968 and operated as semi-independent companies until the Great Financial Crisis, when the government took them back under conservatorship to save them from the large number of defaulted loans.Trump is ready to take the companies public again so taxpayers aren’t shouldering the risk of loan defaults. The Trump administration released its plan to release the lenders from government conservatorship earlier this month.Biden is expected to keep Fannie and Freddie in conservatorship to help maintain accessible, low interest rates, according to Mike Fratantoni, chief economist of the Mortgage Bankers Association.Biden plans to create a national standard for appraisals to address inconsistencies, which some say are influenced by racial bias.Fair housingIf elected for a second term, Trump is expected to prioritize deregulation of mortgage lending, and he has already reversed several Fair Housing Act regulations over the past four years.During his term, Trump ended the Consumer Federal Protection Bureau’s (CFPB’s) ability to bring discrimination cases against lenders. The CFPB took on this role in 2012 but now will focus on “advocacy, coordination and education,” according to a statement by then-CFPB Budget Chief Mick Mulvaney when the bureau’s prosecutorial role ended in April 2018.Trump also terminated an Obama-era rule mandating that states receiving Housing and Urban Development funds must analyze, report and address data showing racial patterns in a community. Advocates say that the Affirmatively Furthering Fair Housing (AFFH) rule makes the 1968 Fair Housing Act more enforceable, but Trump says it threatens suburban communities.“I am happy to inform all of the people living their Suburban Lifestyle Dream that you will no longer be bothered or financially hurt by having low income housing built in your neighborhood...” said Trump in a tweet....Your housing prices will go up based on the market, and crime will go down. I have rescinded the Obama-Biden AFFH Rule. Enjoy!— Donald J. Trump (@realDonaldTrump) July 29, 2020Moving forward, Trump plans to update the Community Reinvestment Act, which gives banks a score based on lending patterns to minorities and low-income borrowers. Under his changes, banks can also boost their scores by supplying credit cards and personal loans to minorities and low-income borrowers — not just mortgages. Critics say the changes discourage fair mortgage lending.Meanwhile, Biden wants to proactively boost mortgage access for low-income and minority borrowers. Biden plans to expand the Community Reinvestment Act to regulate not only banks but non-bank mortgage lenders and insurance companies. He also plans to create a public credit reporting agency that gives government-issued credit scores, which qualify consumers to take out mortgages and other loans.“Replacing our failed for-profit credit reporting system with a public credit registry will benefit consumers and reduce racial wealth inequality,” says the policy proposal.Biden also plans to create a national standard for appraisals to address inconsistencies, which some say are influenced by racial bias. Appraisers would receive training so they “do not hold implicit biases because of a lack of community understanding,” according to his policy.“I don’t quite know how you do that [create a national standard for appraisals], but if you could figure out a way, that would be interesting and could have some impact,” said Kapfidze. “There is evidence that Black-owned homes are undervalued relative to white-owned homes and [majority] Black neighborhoods relative to [majority] white neighborhoods. It perpetuates housing inequality.”Biden plans to devote $100 billion to developing more affordable housing.Low-income housingBoth candidates have plans to uplift low-income communities. Trump aims to lift 1 million Americans out of poverty through the Opportunity Zone program, which gives tax credits to investors who pump money into designated vulnerable communities. Enacted in 2017, the program has created 500,000 new jobs and boosted property values 1.1% in Opportunity Zones, according to a presidential report.“It’s a little too early to judge their impact,” said Kapfidze, “but if Opportunity Zones work as advertised, that could be something that’s pretty impactful.”Biden plans to help economically distressed Americans by increasing funding for the Section 8 voucher program, and he plans to devote $100 billion to developing more affordable housing. Biden would also institute a homeowner bill of rights that addresses high-cost loans and premature foreclosure — plus, a renter’s bill of rights that provides legal assistance for tenants facing eviction.“Fully funding Section 8 vouchers helps people not pay excessive amounts of income to rent. That can help them to become more financially stable, get an education, save up an emergency fund or save for a down payment. The devil’s going to be in the details in how it gets enacted,” said Kapfidze.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Homebuilders are holding back sales amid historic demandIf lumber prices ‘don’t come down, you will see a slowdown in housing’: NAHB CEO‘Lenders don’t have the capacity’ to meet mortgage demand: expert"}]}