{"article": [{"url": "https://finance.yahoo.com/news/famed-harlem-restaurant-sylvias-paddling-to-keep-afloat-131446676.html", "published": 1595146940.0, "headline": "Famed Harlem restaurant Sylvia’s ‘paddling to keep afloat’ in coronavirus era", "body": "Like most other eateries across the country, New York City soul-food restaurant Sylvia’s — a historic mainstay in Harlem — is struggling in the COVID-19 era.Once a global epicenter of the outbreak, the Big Apple is poised to begin the next phase of its reopening on Monday. However, Governor Andrew Cuomo postponed indoor dining in restaurants, a decision that has slammed the Upper Manhattan eatery, famed for both its food and its politically-connected clientele.“We’re still paddling to keep afloat,” Tren’ness Woods-Black, granddaughter of the late Sylvia Woods and VP of Communications and Strategic Partnerships at Sylvia’s, told Yahoo Finance in a recent interview. “We’re nowhere close to pre-COVID sales.”The restaurant received a bump in donations and business after the death of George Floyd, when a ‘buy black’ initiative started to gain strength. But those gains have since faded, leaving the restaurant with a “fraction” of the business they had before, Woods-Black added.The coronavirus pandemic has continued to weigh on the United States as the case count in the country has risen above 3.6 million, according to the Johns Hopkins COVID-19 tracker. The surges in the virus have forced companies to instill mask mandates and states reconsider reopening.Cases keep surging outside NY. (Graphic: David Foster/Yahoo Finance)“We’re adjusting to this new norm with only a fraction, a small percent of a business we were doing before,” Woods-Black said.“We’re a small business, 58 years old of hospitality. People come in to celebrate and feel the atmosphere and ambiance, and it’s really been hard to transfer, and we’re relying on our recipes to do what we can,” she added.Woods-Black explained that the restaurant is trying to make up the shortfall through selling Sylvia’s brand products, like hot sauces and fried chicken seasoning mix.Even though NYC is allowing sidewalk dining and delivery and takeout, Woods-Black said it isn’t helping much.“We’re not at 50%, I can tell you that. Our restaurant can accommodate close to 400 people, so just doing delivery and takeout, and sidewalk cafe — we’re having an unusually hot summer, so it’s not ideal to sit outside all the time,” she explained.Story continues“Then when rain comes, you have to have contingency plans for that. But you know, we’re making do,” Woods-Black stated.‘There’s a lot of fear’NEW YORK, NY, UNITED STATES - 2019/04/29: Mayor Pete Buttigieg (D) of South Bend, Indiana and Rev. Al Sharpton seen speaking during a press conference at Sylvia's Restaurant in Harlem, New York City. (Photo by Michael Brochstein/SOPA Images/LightRocket via Getty Images)According to SafeGraph analysis of foot traffic to sit down restaurants, foot traffic levels started to seriously decline in February from their 2019 levels.By April of this year, foot traffic had declined to only a third of where they were last year. Though they’ve made a recovery, current levels sit just over half of their levels in the previous year.And in Harlem, Woods-Black says the virus is “really decimating people” in the community, stoking fears of regulars she says have been dining at Sylvia’s for years.“It’s really hard because you also have fear. There’s a lot of fear from our staff family, about is it safe? Is it safe to come back to work?” she asked.“You know, most people are betting on staying home and collecting unemployment,” she added, “which makes things very difficult to keep the business afloat.But despite the struggles Sylvia’s is facing, Woods-Black says there are still silver linings amid the pandemic.“We own all of our properties so we don’t have a landlord lurking, harassing us for rent,” she explained.“We also have our food product company that’s doing really well during this time since groceries are up and people are experimenting and cooking more in the kitchen,” the entrepreneur added.And in the spirit of helping others, Woods-Black says that Sylvia’s is operating a food pantry on Sundays when others are closed, and participating in initiatives to virtually visit a senior citizen.“Everybody is pivoting,” she stated.Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:‘This is getting out of control,’ says infectious disease expert about coronavirusA Harvard student's brainchild creates a pipeline for Black finance hopefulsIncreasing number of Republican states projected to see a spike in coronavirus deathsCompanies ‘haven’t done the work’ around diversity and inclusion: Bozoma Saint JohnBiden outraises Trump for month of May amid coronavirus, George Floyd protestsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}