{"article": [{"url": "https://finance.yahoo.com/news/how-retailers-are-combating-the-surge-in-counterfeit-goods-141722151.html", "published": 1598001920.0, "headline": "How retailers are combating the surge in online counterfeit goods", "body": "According to the Department of Homeland Security, fraudulent goods are a $509 billion international criminal enterprise. Michael Hanson, senior executive vice president of the Retail Industry Leaders Association, joined Yahoo Finance to discuss how retailers are looking to fight counterfeit goods as part of the Buy Safe America Coalition.Hanson says the group represents a diverse group of responsible retailers, consumer groups, manufacturers, intellectual property advocates, and law enforcement officials. The group’s goal is to support efforts at all levels of government to protect consumers and communities from the sale of counterfeit and stolen goods.A police official checks some 400 counterfeit bags at the Jungbu police station in Seoul, South Korea, Wednesday, June 1, 2016. The counterfeit high-end brands such as Hermes were seized during the arrests of four people who allegedly manufactured and sold the goods in South Korea, according to Yonhap news agency. All the counterfeit items will be disposed of by incineration. (AP Photo/Ahn Young-joon)Hanson tells Yahoo Finance that one major step that would help the fight against counterfeit goods is federal legislation.A proposed bill, the Integrity, Notification, and Fairness in Online Retail Marketplaces for Consumers (INFORM Consumers) Act, calls for a modernization of consumer protection laws. It would require online marketplaces such as Amazon (AMZN) and eBay (EBAY) to collect and verify basic seller information and, likewise, sellers to provide that information to its consumers. Hanson believes that such verification measures would benefit legitimate businesses by making it harder for bad actors to operate anonymously. It could also provide law enforcement officials with the tools they need to track and prevent illicit sales.Hanson remains optimistic that Congress can come together to pass such measures. “I always hold out hope that members of Congress will come together, especially when they’re trying to protect consumers from the purchase of harmful and counterfeit stolen products. So I will remain bullish that they’ll come together and look at the informed consumers’ actions ... because when they understand the gravity of the problem and really the simplicity of how to fix it, hopefully, they’ll come together. So I’m going to hold out hope.”Reggie Wade is a writer for Yahoo Finance. Follow him on Twitter at @ReggieWade.Story continuesRead more:Nike responds to George Floyd attack: Don’t do it — ‘Don’t turn your back on racism’Nike sells out of Kobe Bryant kicks and merchandiseNike exec explains why the company broke up with AmazonAlmost half of teachers work a second job: survey96% of teachers personally pay for students’ supplies: SurveyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}