{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-august-1-2020-160514853.html", "published": 1596699560.0, "headline": "Jobless claims: Another 1.186 million Americans filed new unemployment claims last week", "body": "The number of new unemployment insurance claims improved last week to a pandemic-era low but held above 1 million yet again, as the coronavirus outbreak continues to weigh on the pace of recovery in the labor market.Here were the main results from the Labor Department’s weekly report released Thursday morning, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended Aug. 1: 1.186 million vs. 1.4 million expected, and 1.435 million during the prior weekContinuing claims, week ended July 25: 16.107 million vs. 16.9 million expected, and 16.951 million during the prior weekThursday’s report reflected the twentieth straight week that new claims topped 1 million, as the pandemic forced furloughs and layoffs across the country. Since the week ended March 20, more than 55 million individuals filed for new unemployment insurance claims.Still, at 1.186 million, the number of new claims last week was at its lowest point since the start of the pandemic, after peaking at about 6.9 million in late March. Thursday’s report also showed the first decline in new claims in three weeks, following back-to-back weeks of increases in mid-July.Nearly every US state reported declines in their levels of unadjusted new claims during the last week of July, including the states in the South and West that had been grappling with a rise in coronavirus case counts and business re-closures during the start of the summer. New claims in the populous states of California and Florida came down by 16,000 and 17,500, respectively.Meanwhile, continuing unemployment insurance claims, which capture the number of individuals still receiving benefits, also fell more than expected during the week ended July 25, declining to well below 17 million. Continuing claims, reported on a one-week lag, peaked at nearly 25 million in mid-May, and remain more than double the pre-pandemic peak of 6.6 million in mid-2009.The latest report for new weekly unemployment insurance claims covers the final week during which Americans were eligible for enhanced federal unemployment benefits as part of Congress’s original Coronavirus Aid, Relief, and Economic Security (CARES) Act passed in March. The previous $600 per week in augmented federal unemployment insurance expired at the end of July, though many workers received their last payment from the program during the prior week.Story continuesNew jobless claims totaled 1.186 million for the week ended August 1 (David Foster/Yahoo Finance)Deliberations as to the size and duration of extended benefits are still under way among lawmakers, with tens of millions of Americans caught in the lapse as the issue remains unresolved. Many economists have raised concerns that the pace of overall economic improvement – after the second quarter’s historic 32.9% annualized decline in GDP – could be jeopardized in absence of further support for individuals.Other recent labor market data also reflected the slowing recovery as coronavirus cases flared in some parts of the country in June and July. On Wednesday, the closely watched ADP National Employment Report showed private payrolls rose by a meager 167,000 in July. Consensus economists had expected private employers added back 1.2 million payrolls, after an upwardly revised 4.3 million additions in June. JPMorgan economist Daniel Silver said the result “reinforces our view that the economy has lost momentum in recent weeks following a period of strong growth.”The print boded negatively for the Labor Department’s July jobs report, set for release Friday. However, the report has historically been an imprecise indicator of the “official” government-issued employment report. ADP’s initial print for May and June payroll additions each ultimately undershot the data reflected in the Labor Department’s monthly reports.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}