{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-11-2020-222011316.html", "published": 1591889240.0, "headline": "Stock market news: Dow plunges 1,861 points, or 7%, for worst day since mid-March", "body": "Stocks dropped by the most since mid-March on Thursday following the Federal Reserve’s monetary policy decision, in which policymakers highlighted the ongoing economic concerns spurred by the coronavirus pandemic and measures taken to contain it.The Dow dropped 6.9%, or 1,861 points, for its worst day since March 16. The decline marked the fourth biggest point-drop for the Dow on record. The VIX Volatility Index (^VIX), or so-called fear gauge, spiked more than 50%.“What we’re seeing here is the market taking a breather,” Alex Piré, Seeyond Head of Client Portfolio Management, told Yahoo Finance on Thursday. He cited relatively bearish remarks from Fed Chairman Jerome Powell as partly responsible for telling investors “what the market wouldn’t like to hear. But the economic news that we’re getting has stayed fairly consistent.”[Click here to read what’s moving markets heading into Friday, June 12]Additionally, market participants eyed a rise in new coronavirus cases in key states including Arizona, Florida, North Carolina and Texas. Meanwhile, the Labor Department’s weekly report showed another 1.542 million individuals filed new unemployment insurance claims for the week ended June 6, coming down slightly from the prior week’s 1.897 million.Shares of companies viewed as some of the most set to benefit from easing social distancing measures posted another session of steep declines. Airlines American Airlines (AAL), United Airlines (UAL) and Delta (DAL) each dropped by more than 14% Thursday. Cruise companies Carnival (CCL), Royal Caribbean (RCL) and Norwegian Cruise Line Holdings (NCLH), along with lodging firms Wynn (WYNN) and Hilton (HLT), posted their third consecutive down days.Zoom Video Communications (ZM) was one of the few gainers, rising by about half a percent. Grubhub (GRUB) shares rose 4.7% after European food delivery platform Just Eat Takeaway announced it was set to acquire the company.A day earlier, the Federal Open Market Committee’s (FOMC) Summary of Economic Projections indicated the Fed expects a steep 6.5% contraction in real GDP in 2020, with an unemployment rate at 9.3%. However, policymakers expect real GDP to rebound by 5.0% in 2021, with the unemployment rate dropping to 6.5%.Story continuesIn its monetary policy decision, the Fed projected interest rates would remain near zero through 2022 and telegraphed that its pace of asset purchases would remain at minimum at the current rate.The decision to keep rates on hold for the foreseeable future given the virus-induced economic damage was widely expected by market participants. And while the Fed stopped short of unveiling yield curve control strategies, as some had speculated would be the case for the central bank to put a cap on longer-term rates, Powell did suggest the FOMC would continue discussing the mechanism going forward.“Even though [yesterday’s] FOMC meeting was somewhat of a placeholder until more meaningful choices are made in the next few meetings, the outcome was dovish nonetheless,” JPMorgan economist Michael Feroli said in a note. “The Fed kept interest rates steady and the accompanying interest rate forecast ‘dots’ indicate that rates are likely to remain pinned near zero for at least the next two-and-a-half years.“Moreover, there was unusual unanimity in this expectation as only two participants expect any rate hikes by that time,” he added. “While the dots are individual forecasts, and not a Committee statement, the unusual lack of dispersion in those dots means it should be easier for the Committee to agree to more forceful forward guidance at upcoming meetings.”—4:05 p.m. ET: Dow drops 1,861 points in fourth biggest point loss everHere were the main moves in markets as of 4:05 p.m. ET:S&P 500 (^GSPC): -188.04 (-5.89%) to 3,002.10Dow (^DJI): -1,861.82 (-6.90%) to 25,128.17Nasdaq (^IXIC): -527.62 (-5.27%) to 9,492.73Crude (CL=F): -$3.42 (-8.64%) to $36.18 a barrelGold (GC=F): +$13.40 (+0.78%) to $1,734.10 per ounce10-year Treasury (^TNX): -9.5 bps to yield 0.6530%—3:00 p.m. ET: Stock losses accelerate into the close, Dow sheds more than 1,700 points, or 6%Stocks extended their downward descent with an hour left of the trading day. The Dow dipped more than 6%, shedding more than 1,700 points.The S&P 500 sank more than 5%, or 100 points, and the Nasdaq slumped 4.5%. Norwegian Cruise Line Holdings, Carnival Cruise Line Holdings, United Airlines, American Airlines, and Occidental Petroleum – all stocks that had been hammered by the coronavirus pandemic – were among the biggest losers on the day in the S&P 500, based on percent declines.—12:34 p.m. ET: Stocks add to losses, Dow falls 1,200+ pointsHere were the main moves in markets, as of 12:34 p.m. ET:S&P 500 (^GSPC): -125.92 points (-3.95%) to 3,064.22Dow (^DJI): -1,284.96 points (-4.76%) to 25,705.03Nasdaq (^IXIC): -326.47 points (-3.26%) to 9,694.42Crude (CL=F): -$3.75 (-9.47%) to $35.85 a barrelGold (GC=F): +$21.80 (+1.27%) to $1,742.50 per ounce10-year Treasury (^TNX): -6.9 bps to yield 0.679%—11:00 a.m. ET: Dow drops more than 1,000 points as market rout deepensStocks extended declines as the morning session rolled on, with both the Dow and S&P 500 more than 3% lower.The Dow’s more than 1,000-point decline was led by shares of Boeing, which slumped 10%. The consumer staples, communication services and consumer discretionary sectors led declines in the S&P 500, as all 11 sectors held in the red.—9:38 a.m. ET: Stocks slide, Dow sheds more than 750 pointsHere were the main moves in markets as of 9:39 a.m. ET:S&P 500 (^GSPC): -82.35 points (-2.58%) to 3,107.79Dow (^DJI): -797.16 points (-2.95%) to 26,192.83Nasdaq (^IXIC): -238.04 points (+2.38%) to 9,784.07Crude (CL=F): -$2.88 (-7.27%) to $36.72 a barrelGold (GC=F): +$25.50 (+1.48%) to $1,746.20 per ounce10-year Treasury (^TNX): -7.9 bps to yield 0.669%—8:32 a.m. ET: Producer prices rise for the first time in four months in MayAn index of producer prices rose 0.4% in May for its first monthly increase since January, the Bureau of Labor Statistics said Thursday. The pace of increase was greater than the 0.1% rise expected, according to Bloomberg data, and rebounded from a 1.3% decline in April.Over last year, producer prices dropped 0.8%, or less than the 1.2% decline expected and shown in April.Excluding volatile food and energy prices, the producer price index (PPI) fell 0.1% in May over April, matching expectations.—8:30 a.m. ET: New jobless claims totaled 1.54 million last weekWeekly initial unemployment claims totaled 1.542 million for the week ended June 6, the Labor Department said in its weekly report. This was just slightly below expectations for 1.55 million, according to Bloomberg consensus data.The prior week’s new unemployment claims were revised up slightly to 1.897 million, from the 1.877 million previously reported.Continuing unemployment claims fell less than expected for the week ended May 30, ticking down to 20.929 million versus the 20 million expected. The prior week’s continuing claims totaled 21.268 million.—6:05 p.m. ET Wednesday: Stock futures open slightly higherHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:05 p.m. ET:S&P 500 futures (ES=F): 3,186.75, up 0.75 points or 0.02%Dow futures (YM=F): 26,972.00, up 11 points, or 0.04%Nasdaq futures (NQ=F): 10,099.75, up 12.5 points, or 0.12%NEW YORK, NEW YORK - MARCH 20: Traders, some in medical masks, work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}