{"article": [{"url": "https://finance.yahoo.com/news/tesla-bullish-analyst-street-high-price-target-2322-165027273.html", "published": 1594727900.0, "headline": "Tesla’s most bullish analyst sets a Street-high price target of $2,322", "body": "Tesla’s (TSLA) biggest bull says the electric vehicle maker’s stock could reach $2,322 —prompting CEO Elon Musk to tweet “Wow” to the new Street-high price target.“In our view, Tesla is the most consequential company in the mobility ecosystem, and this is unlikely to change in the next decade,” wrote Piper Sandler analyst Alexander E. Potter.Potter’s price target — which implies a 55% gain from Monday’s closing price — was increased from $939 (based on a 20-year discounted cash flow model) and is primarily driven by “Tesla's software opportunity.”The analyst pointed out Tesla’s potential for “30%+ gross margins if/when more customers opt-in for purchasing the company's full self-driving (FSD) software.”“We think that by the 2030s, Tesla could conceivably be selling vehicles at cost - or even below cost - while still achieving higher operating margins,” Potter wrote.Wow— Elon Musk (@elonmusk) July 14, 2020He also highlighted the company’s better than expected 2nd quarter delivery results, adding it’s “hard to see how competitors can catch up.”Potter says the EV manufacturer’s expected target of +500K deliveries in 2020 would be “impressive” given the constraints of COVID-19.Share’s on Tuesday were relatively flat after rallying 16% during Monday’s early session, touching all time highs just shy of $1800, before a sharp sell-off in the afternoon.“Is it time [for investors] to redeploy capital after [Tesla shares’] amazing run?” Potter wrote. “Resoundingly, we think the answer is NO.”Piper Sandler maintains an Overweight rating on the stock.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070Nasdaq is 'moving faster than any train we've ever seen before': veteran strategist'There's a risk of a lost decade here:' former IMF adviserFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}