{"article": [{"url": "https://finance.yahoo.com/news/trump-is-flailing-away-and-attacking-americans-by-boycotting-goodyear-former-us-ambassador-215005681.html", "published": 1597856300.0, "headline": "Trump ‘is flailing away and attacking Americans’ by boycotting Goodyear: former U.S. ambassador", "body": "President Trump has once again taken to his public platform to air his personal grievances.A Goodyear employee in Topeka, Kan., shared a photo of the company’s new “zero tolerance” policy, which lists MAGA-branded items as unacceptable to wear in the workplace. The visual has been widely circulated across social media and was first picked up by CBS-affiliate WIBW in Topeka on Tuesday.In response, Trump tweeted Wednesday morning calling for a boycott of Goodyear. “Get better tires for far less! (This is what the Radical Left Democrats do. Two can play the same game, and we have to start playing it now!)” he wrote in part.Trump’s fight with Goodyear reflects continued lack of leadership, according to Bruce Heyman, who served as President Barack Obama’s ambassador to Canada between 2014 and 2017.”There is a place for politics and a place for governing. He has conflated governing into politics. So, everything he is doing [is] with a political or personal outcome. And this is wrong. The president should be president for all of America, regardless of party, regardless of races, regardless of gender, regardless of economic level. And he has failed at every twist and turn. And today is a perfect example of picking on this company based on not allowing political attire within their offices, which I think is fair for any company to determine that. At the same time, the president is flailing away and attacking Americans,” Heyman said in an interview with Yahoo Finance’s On the Move.According to the Goodyear employee’s photo, Trump’s ‘Make America Great Again’ campaign slogan, along with ‘Blue Lives Matter,’ ‘All Lives Matter’ and other ‘Political Affiliated Slogans or Material’ are deemed impermissible. Garb with Black Lives Matter (BLM), and Lesbian, Gay, Bisexual and Transgender Pride (LGBT) branding are considered acceptable to wear to work.Goodyear, for its part, claims “the visual in question was not created or distributed by Goodyear corporate, nor was it part of a diversity training class” yet “[asks] that associates refrain from workplace expressions in support of political campaigning for any candidate or political party, as well as similar forms of advocacy that fall outside the scope of racial justice and equity issues.” Goodyear shared the statement on Twitter and its website shortly after Trump’s attack.Story continuesYesterday, Goodyear became the focus of a conversation that created some misconceptions about our policies and our company. Goodyear has always wholeheartedly supported both equality and law enforcement and will continue to do so. pic.twitter.com/oO6jUg2rTR— Goodyear (@goodyear) August 19, 2020Still, the underlying message of the viral image seems to fall squarely in line with the tire maker’s corporate policy. The company did not respond to additional requests for comment.Black Lives Matter, a movement that began in 2013 has become deeply politicized. Still, public figures like Heyman and WNBA Commissioner Cathy Engelbert emphasize that BLM should be a bipartisan rallying cry for racial justice, embraced by anyone fighting to end police brutality against Black Americans.“This is ridiculous. You can campaign on your record. You can campaign on your vision. But you don't campaign on the backs of our fellow Americans. And I think he is going down a very dangerous path and it's a very dangerous path for our country to have a president do that and dictate these terms...He's flailing but we're paying the price for it,” added Heyman.Beyond the ethical concerns, Trump may not be doing himself any favors by attacking Goodyear, which is based in Ohio, a key, must-win battleground state. Since 1944, Ohioans have selected the losing candidate only once, voting for Republican Richard Nixon over Democrat John F. Kennedy in 1960. Trump, with his political rhetoric, is also threatening American jobs. Goodyear employs 60,000 workers, of which approximately 7,000 are unionized.Shares of Goodyear Tire and Rubber Company (GT) closed 2.4% lower on Wednesday, after falling as much as 4.2% earlier in the trading session.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:The 'modest, unorthodox' newsroom? An experiment marks a new era for digital mediaAmazon CEO Jeff Bezos will 'try to win over hearts and minds’: What to expect at the antitrust tech hearingWNBA Commissioner: 'There is nothing political about Black Lives Matter'The US saw the highest rate of new women CEOs so far this yearDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperity"}]}