{"article": [{"url": "https://finance.yahoo.com/news/former-trump-trade-advisor-covid-19-disruption-and-usmca-provides-an-opportunity-to-bring-supply-chains-back-to-north-america-223154325.html", "published": 1593625160.0, "headline": "Former Trump trade adviser: Covid-19 disruption and USMCA ‘provides an opportunity’ to bring supply chains back to North America", "body": "Global supply chain disruptions brought on by COVID-19 have already prompted companies to consider bringing manufacturing closer to home.A former trade adviser to President Trump says the United States-Mexico-Canada Agreement (USMCA) is likely to accelerate the move.Speaking to Yahoo Finance, Kelly Ann Shaw, former deputy assistant for international economic affairs and deputy director of the National Economic Council, said the “new NAFTA” provides “an opportunity” to diversify supply chains, with a focus on North America.“There’s a lot of concern about doing business in China, and we’re hearing even more from Congress and other actors who maybe haven’t been as vocal in the past about the need to bring jobs back,” Shaw said. “Why not increase the competitiveness of the North American supply chain. They are friends, neighbors, allies. We have been unified for years under NAFTA, I think that it makes a lot of sense for our economy to continue to grow together.”US Secretary of State Mike Pompeo (R) speaks during a press conference with Chinese politburo member Yang Jiechi during the US-China Diplomatic and Security Dialogue in the Benjamin Franklin Room of the State Department in Washington, DC on November 9, 2018. (Photo by MANDEL NGAN / AFP) (Photo credit should read MANDEL NGAN/AFP via Getty Images)The USMCA, implemented Wednesday, largely keeps intact a 25-year-old NAFTA agreement that maintains $1.2 trillion in trade flows among the U.S., Mexico, and Canada. But the updated pact includes fresh provisions on labor, digital trade, and intellectual property that provides a template for future U.S. trade negotiations, Shaw said.The new labor rules require 40 to 45 percent of auto parts be made by workers earning at least $16 per hour by 2023, comparable to average wages of U.S. workers in the sector. A change in rules of origin provisions for auto parts, increases the threshold from 62.5% to 75%, strengthening the case towards regionalization of global supply chains.On digital trade, the USMCA prohibits forced data localization and bans custom duties on digital products, while preventing discriminatory treatment of cross border data transfers.“USMCA effectively modernizes NAFTA. There were no provisions on digital trade. There were few provisions on intellectual property, it significantly improved the labor provisions, whereas you know previously there was a concern but you know jobs were going to go south because of cheap labor,” Shaw said. “I think it improves the overall investment environment and creates more certainty.”Story continuesThe USMCA goes into effect as the Trump administration looks to quiet concerns about another trade agreement with China. White House Trade Adviser Peter Navarro rattled markets last week after suggesting the Phase One deal was “over,” before walking back the comments. That proceeded a tense meeting between Secretary of State Mike Pompeo and China’s top diplomat Yang Jiechi in Hawaii, where Beijing reportedly agreed to accelerate purchases of U.S. goods and services agreed to under the Phase One deal.U.S. Trade Representative Robert Lighthizer has maintained the deal is on track, telling the House Ways and Means Committee last month, “Every indication is that in spite of this COVID-19, they are going to do what they say.” But the U.S.-China relationship has grown increasingly contentious over the last few months, on issues related to the coronavirus and Hong Kong.Shaw said the increased global scrutiny on China, over the lack of transparency around the virus’s origins and the country’s handling in the initial days, provided a potential opening on trade, and Washington’s ability to rally other allies to its side.“Covid woke up a lot of countries to the lack of transparency and accountability with China’s system. I think it’s good that countries are taking a second look and I think it provides an opportunity for more multilateral collaboration on these issues,” Shaw said. “In the E.U., they’re talking about supply-chain shortening and what they can do to bring manufacturing and some of the production back. It’s an existential question countries around the world are going to be asking for the foreseeable future.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaUniversities brace for a permanent wave of school closures as coronavirus pushes schools to brink‘It’s driving up heat density within data centers:’ Why AI and 5G are contributing to climate concernsInsurance industry looks to update risk models as climate risks escalateLarry Summers: Pandemic marks a ‘fairly profound structural change’ in economy"}]}