{"article": [{"url": "https://finance.yahoo.com/news/netflix-co-ceo-says-many-tech-giants-are-dataexploiting-132020520.html", "published": 1599640100.0, "headline": "Netflix co-CEO says many tech giants are 'data-exploiting'", "body": "When the CEOs at tech giants Apple (AAPL), Alphabet (GOOG, GOOGL), Amazon (AMZN) and Facebook (FB) appeared at a blockbuster Congressional hearing in July, they faced questions about whether their companies leverage user data to gain an advantage over competitors.In a recent interview, Netflix (NFLX) co-CEO and co-founder Reed Hastings said many of the largest tech companies are “very data-exploiting” in their efforts to drive revenue through digital advertising. He contrasted that business model with Netflix, which relies on subscription fees and forgoes advertising.“The four of them plus Microsoft are formidable,” he told Yahoo Finance Editor-in-Chief Andy Serwer on Sept. 3. “They've got much bigger market caps, they're multi-business lines, many of them have ad support and are very data-exploiting in that way — we don't have any of that.”“We're just a simple, extremely great entertainment company,” he adds. “For about $15 a month, you get amazing content.”A ‘whole other tech ecosystem’Facebook, Google, and Amazon last year controlled a combined 62.1% of the digital advertising market, according to research firm eMarketer. Each company features or owns a video streaming product: Watch, YouTube, and Amazon Prime, respectively. Apple launched its Apple TV+ streaming service last year for $5 per month.Hastings downplayed competition between Netflix and the big tech companies. When asked about privacy concerns at tech giants like Facebook, Hastings said the companies operate in a “whole other tech ecosystem.”“Our world is really about data security — keeping each member's data just at Netflix,” he says. “We don't import data, we don't share data, we don't sell data.”To be sure, Netflix has gained a reputation for its analysis of user data to make decisions about how to invest in, develop, and display programming.“We really think about members satisfaction and how many people are going to watch it compared to how much it costs to produce,” said Hastings, the co-author with business professor Erin Meyer of a new book entitled, “No Rules Rules: Netflix and the Culture of Reinvention.”Story continuesFounder and CEO of Netflix Reed Hastings gestures during a keynote at the Mobile World Congress in Barcelona, Spain, Monday, Feb. 27, 2017. The Mobile World Congress will be held 27 Feb. to 2 March. (AP Photo/Manu Fernandez)Hastings spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment. The complete interview will air on Sept. 10.Netflix is the “N” in the acronym FAANG, which denotes top tech stocks including Facebook, Apple, Amazon, and Google. But Netflix has avoided the scrutiny that other tech companies have faced over data privacy.Concern over the issue came to a head when revelations surfaced in 2018 that Cambridge Analytica, a consulting firm hired by Donald Trump’s presidential campaign, had harvested the data of 50 million Facebook users. The company reached a $5 billion settlement with the Federal Trade Commission last July over the Cambridge Analytica breach and other privacy-related issues.Last June, the Department of Justice and the Federal Trade Commission agreed to divvy up responsibility for investigating each of the big four tech companies. The Department of Justice would investigate Google and Apple (AAPL), while the Federal Trade Commission would probe Facebook and Amazon.The U.S. House, also last year, opened a wide ranging probe into the market power of the big tech companies. At a hearing related to that inquiry in January, executives from small tech companies accused their bigger peers of unfairly leveraging control of the marketplace.Asked why Netflix relies on subscription fees and keeps advertising off of its platform, Hastings said the business model allows him to avoid issues surrounding data.“It's great to just be able to focus on our members and not to really think about advertisers,” he says. “Not to think about data.”Read more:Netflix co-founder on creative culture: We ‘manage on the edge of chaos’Netflix was 'one of my great mistakes,' says billionaire investor Mario GabelliBill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}