{"article": [{"url": "https://finance.yahoo.com/news/amazon-apple-facebook-alphabet-google-versus-the-feds-114945779.html", "published": 1595660240.0, "headline": "Inside Amazon, Apple, Facebook and Google versus the Feds", "body": "Sometime very soon, four of the most powerful men on the planet will face off against a small congressional subcommittee.The stakes couldn’t be higher.Yes tech execs are called into D.C. regularly these days, but this time is different. These are the CEOs of the four mega-tech companies, starting with Amazon CEO Jeff Bezos, the world’s richest man, who’s never appeared before Congress. He'll be joined by two other iconic personages: Facebook's Mark Zuckerberg (world’s fourth richest, worth $88 billion), and Apple’s Tim Cook. The fourth member of the quartet, Alphabet's (Google’s) Sundar Pichai has a lower profile but carries no less weight.Even more than all of that though, this hearing could mark a new beginning in the tug and pull between big business and society in America—for better or for worse.(COMBO) This combination of pictures created on July 07, 2020 shows (L-R) Facebook CEO Mark Zuckerberg in Paris on May 23, 2018, Google CEO Sundar Pichai Berlin on January 22, 2019, Apple CEO Tim Cook on October 28, 2019 in New York and Amazon Founder and CEO Jeff Bezos in Las Vegas, Nevada on June 6, 2019. (Photos by AFP) (Photo by BERTRAND GUAY,TOBIAS SCHWARZ,ANGELA WEISS,MARK RALSTON/AFP via Getty Images)“This is the end of a one-year investigation where we’ve looked at these big tech platforms to examine antitrust, anti-competitive and monopolistic behavior,” committee member Congresswoman Pramila Jayapal told me yesterday. “We are looking to wrap this up and propose a series of recommendations including legislation that will allow us to deal with anti competitive patterns that we see. Listening to the CEOs is the last step.”“This is not your typical hearing,” says Gigi Sohn, a distinguished fellow at the Georgetown Law Institute for Technology Law & Policy and a member of the board of the Electronic Frontier Foundation. “What you’re going to see is every member of the committee send a tweet out about how they’re about to ask tough questions of Bezos, Zuckerberg, Cook, and Pichai. It is not going to be a lovefest. I remember last time Tim Cook testified in front of Congress, all members were acting like girls at a Justin Bieber concert. Ooooh, look at my iPhone. This won’t be that.”That sounds different.“This is the first major antitrust investigation being conducted by Congress in more than 50 years,” Rep. David Cicilline, D-RI (chair of the House Judiciary Antitrust, Commercial, and Administrative Law subcommittee) told Yahoo News Senior Political Correspondent Jon Ward on “The Long Game” podcast last week. “The subcommittee members have studied these issues very seriously over the last year.”Story continuesAnd Democrats and Republicans insist they are on the same page here, according to committee member Congressman Ken Buck (R-Co.) “It's probably the most bipartisan effort that I have seen in my 5 1/2 years in Congress. Tremendous kudos for chairman Cicilline's efforts in bringing both sides together.” Cicilline concurs, calling the effort “very bipartisan.”That could be different too. If that same page stuff is for real, it should send shivers down the spine of Zuck et al., because a previous lack of bipartisanship has helped these companies escape new regulation.The congressional body, the House Judiciary Antitrust Subcommittee only has 13 members, so this won’t be the full-blown show trial treatment, (though ranking Judiciary members Jerrold Nadler (D-NY) and Jim Jordan (R-OH) may attend) but understand this is the tip of the spear against Big Tech, and remember too, it includes one of tech’s chief nemesis, Cicilline, as well as potential Biden vice president, Val Demings (D-FL), the aforementioned Jayapal and Buck as well as the never-shy Matt Gaetz (R-FL). The questions they ask, the tacts they take, how they play off each other, (and whether we get any strange bedfellow action), will be fascinating.As for the CEOs, I’ve met with each of them over the years (my time with Bezos was a brief conversation outside a conference, but I’ve had longer conversations with Cook, Pichai and Zuckerberg.) Each is impressive in their own right, and wildly different. Bezos is in fact Tony Stark-like and I did get a patented laugh out of him. Cook is a Southerner and engineer, with the highest EQ of the bunch. Pichai appears thoughtful and empathetic. And Zuck, yes, comes off as somewhat robotic and defensive.So call these CEOs the Four Amigos, (trust me, they aren’t), call them John, Paul, George and Ringo, call them whatever you want, just know this will be must-see viewing. (Even though they will testify remotely, which is “unfortunate,” Congressman Buck told me. “Frankly, I wish we had them in person.”)One hopes, at this late date, these titans understand the power they wield. That the decisions they make have implications akin to ones made by heads of state. Here are a few cuts at the scale and sway of their companies.First by sales, Amazon is the second biggest company in the U.S. ($281 billion), while Apple is No. 4, ($260 billion) Alphabet No. 11 ($161 billion) and Facebook, the baby is No. 46 (a mere $70 billion).Even more incredible is market capitalization. These companies count for four of the five biggest U.S. companies by market value: Apple, ($1.6 trillion) Microsoft ($1.5 trillion), Amazon ($1.4 trillion), Alphabet ($1 trillion) and Facebook ($690 billion.) (David Ingles noted that the combined market caps of the first four are now bigger than the value of the entire Japanese stock market. Insane!)(COMBO) This combination of pictures shows the logos of the GAFA's, named after US multinational technology and Internet-related services company Google, US online retail giant Amazon, US social media Facebook and US multinational technology company Apple, displayed on a tablet in Paris, on February 18, 2019. (Photo by Lionel BONAVENTURE / AFP) (Photo credit should read LIONEL BONAVENTURE/AFP/Getty Images)But what’s even bigger and more indicative of the tech giants’ might is the number of their customers. Facebook has 2.6 billion active monthly users. Google does 6.9 billion searches a day. Gmail has 1.5 billion users. Amazon has some 2.5 billion visits each month to its sites. Apple says it now counts some 1.4 billion active Apple devices out there in the world. (Just for reference, the three largest countries in the world by population: China has 1.39 billion, India 1.32 billion, the U.S. 329 million.) So yes, the Big Four are in the same neighborhood as the world’s biggest countries.So it’s natural this has attracted attention. In fact the number of investigations, probes and public sector litigation (never mind private lawsuits) in the U.S. and abroad relating to these companies is dizzying and too lengthy to cite.The focus in this hearing, however, is that the companies are too big and that bigness harms society. That would pertain to antitrust law which may be in the process of evolving. Over recent decades, it has generally been the case that a company was considered to be violating antitrust statutes if it unfairly raised prices for consumers. That has mostly not been the case with these tech giants, as they usually lower prices or in case of Google and Facebook give their services to consumers for free. (Of course we pay in other ways, don’t we?)But a new school of thought put forth by Columbia Law School professor Tim Wu and others, suggests there might be other types of impairment, such as stifling competition, choices and innovation. And European regulators also have a broader interpretation of societal harm. Here in the U.S. though, for the time being at least, that perspective is not supported by current case law. These hearings could begin to change that, or not.“Each one of these companies has serious competition and antitrust concerns—that’s the common thread,” opines Sohn of Georgetown. “They’re all very different business models, obviously. What connects them all is they’re huge and enormously powerful.”Here are the key issues for each:Alphabet (parent company of Google)To my mind this company has the most market power of the bunch. Google’s search is so omnipresent that it of course has become a verb. (You don’t say “Facebook it,” not yet anyway.) Indeed studies show Google has almost 92% market share of search, (which I think that’s low.) Bing and Yahoo are just a blip, check out this stunning chart. If that isn’t dominant, what is? Search of course is what helps the company achieve a 37% share of all digital advertising (a duopoly with Facebook, which has 20%.) Regulators may also have concerns about Chrome, which has a 65% market share, and growing. Google has a dominant share in maps, more than its competitors combined. And Gmail has a 53% share in the U.S. These are killer market positions. And of course, the amount of data this company has about us is scary.Google deservedly faces scrutiny, on the other hand you can make the case that unlike Facebook for one, the company’s products provide incredible value for consumers.“Let’s assume even for the sake of argument, Google has a monopoly on search. What is the consumer harm when consumers receive a trillion dollar product at no cost,” asks Carl Szabo, vice president and general counsel for the tech trade association NetChoice.Bottom line: Even though Google is arguably the biggest, baddest of the bunch, it may face less pressure than Facebook or Amazon, at least in part because of its lower key approach and profile (relative to the others.)AmazonThis company very much has a target on its back. Why? For one thing, President Trump loathes Jeff Bezos (as the owner of the Washington Post and perhaps as a far wealthier individual.) And in May the Judiciary Committee sent a letter to Bezos accusing his company of misleading Congress in testimony last year about third-party sellers, and said that “we expect you, as Chief Executive Officer of Amazon, to testify before the Committee.”There’s also the fact that Amazon has some 44% market share of e-commerce in the U.S. And its AWS business has a 32% share in the cloud services business, but also some pretty vigorous competitors there in Microsoft and Google.I asked Congressman Buck if Amazon was more of a target than the others. “I don't think that's true,” he said. “In my view, big isn't bad. I think that big is a reflection of success, and as long as they have followed the rules, then I think that it is really a compliment to their organization.”But the person to really watch here is Congresswoman Jayapal. Amazon is in her district and though she is “proud” of that, she says many employees at Amazon support the investigation. Has she ever sat down with Bezos? “No, I’ve never met him,” she told me. “It’s unfortunate that this has been the relationship. Some of these companies act like they are too big to care.”That could get interesting.Bottom line: Amazon has the attention of regulators. As long as Trump is in the White House, it will be that much more so.AppleThe issue with Apple isn’t with the iPhone which only has a 13% global market share, nor is it about selling customer’s data or advertising monopolies or buying companies to stifle competition. Apple doesn’t really play those games. The company likes to point out that it makes and sells stuff, which sets it apart. Regulators could focus on Apple’s App Store, though, which critics maintain is too powerful. Through the App Store, Apple reportedly holds sway over 65% of spending on mobile platforms, with Google capturing the other 35%, despite the fact that the latter powers over 75% of all mobile devices globally, according to StatCounter. Also potentially an issue here is that Apple takes a 30% cut of revenue for some of the commerce on the platform, which some developers say they have no recourse but to pay. Some also complain that Apple offers competing services like, say, Apple Music, in customer categories, which of course aren’t charged the 30%. Apple points to a study released this week which it says shows that its practices aren’t anti-competitive. (Apple has also run afoul of the Justice Department and U.S. Attorney General William Barr over not unlocking its phones during investigations, which may or may not come up as well.)Apple and Tim Cook, (or Tim Apple, as POTUS has called him), have generally been deft at managing their Washington relationships, explaining how they don’t fit so well with the other three. Even critics acknowledge its alleged indiscretions are less egregious and more easily remedied. “We want the marketplace to work to make room for the next Amazon, and the next Google, and the next Facebook, and to have opportunities to enter the marketplace and be successful,” chair Cicilline said to Yahoo News’ Jon Ward. “I think what we're seeing is just the opposite.” (Note the absence of Apple.)Bottom line: Apple will likely not feel real fire or ire.FacebookZuckerberg’s company on the other hand has become the poster child of all that ails Big Tech. Zuck and his COO, Sheryl Sandberg, have been infuriating critics on the left like Senator Elizabeth Warren (D-MA) over election ads, centrists like Senator Mark Warner (D-VA) over national security and the Russians, and conservatives like Senator Ted Cruz (R-TX) over suppressing right-wing voices. But the real anti-competitive issues are first, its market share in social media, (56%, versus 29% Pinterest and 9% Twitter) and its behavior in this marketplace, buying Instagram and trying to squash Snap for example. (TikTok has made inroads lately btw, but now that the Chinese-based company is up against the U.S. government on national security grounds. Zuck can barely contain himself.) There’s also Facebook’s duopoly in digital advertising, its share there being 20% (see above in Alphabet section) NB: Amazon has been chipping away at the dominance of these two.It’s been suggested by critics such as Columbia’s Wu, in his book “The Curse of Bigness,” that one solution would be to break up Facebook, into what Casey Newton called the Baby Books, i.e., its four platforms, (Messenger, WhatsApp, Instagram and core Facebook.) Zuckerberg and Sandberg have argued this would allow the Chinese social media companies to take over. “I think that’s a specious argument,” says John Borthwick, the CEO of the tech venture firm Betaworks. “It doesn’t have logical consistency to it, because the logical end run of that would be yes, Sheryl Sandberg, Facebook, should then merge with the U.S. government because that’s the only way to achieve parity with Chinese companies.”Bottom line: Somehow, some way, some day Facebook will face the music in Washington.Net net, this isn’t the first Congressional hearing to look into Big Tech, and it won’t be the last, but it may be the most consequential.Stay tuned.This article was featured in a Saturday edition of the Morning Brief on July 18, 2020. Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAndy Serwer is editor-in-chief of Yahoo Finance. Follow him on Twitter: @serwer.Read the latest financial and business news from Yahoo FinanceRead moreHow to get out of the COVID-19 testing messBillions or trillions: The great coronavirus trade-offHow this week changed America foreverWhat America can learn about reopening from the state of MaineWhat will everything look like after the coronavirusHere’s how the coronavirus divides us"}]}