{"article": [{"url": "https://finance.yahoo.com/news/unemployment-benefits-ending-americans-182609346.html", "published": 1596202460.0, "headline": "As extra benefits expire, some unemployed Americans are waiting for their first check", "body": "The extra $600 a week that unemployed Americans have been receiving in benefits amid the coronavirus pandemic is ending as Congress struggles to find common ground on key issues.And while Democrats, Republicans, and the White House negotiate, unemployed Americans will rely solely on state unemployment checks until any deal is reachedsand as they wait for the job market to recover.But some Americans still haven’t received their first unemployment check since the pandemic began.A man wears a protective face mask decorated with a question mark in lower Manhattan during the outbreak of the coronavirus disease (COVID-19) in New York, U.S., May 22, 2020. (Photo: Getty Images)Leo Gertner, a lawyer who represents employees in the entertainment industry in New York City, filed for unemployment on March 2 and still hasn’t gotten a check.“Twice I received letters asking for more information — the first one asked for all my paystubs, and then a second one asked for W2s from my previous job at a policy nonprofit,” Gertner told Yahoo Finance. “I sent them the information both times, via fax and certified mail to Albany.”After he didn’t hear back, Gertner sent the office a message using the online portal and was told to call the hotline.“I’ve called at least 100 hundred times and have never gotten through to anyone,” he said. “On April 17, I emailed and asked for help from my assemblyperson’s office, Inez Dickens, and someone from there reached out and said they placed a complaint on my behalf. That evidently didn’t work. Most recently, I used Twitter to message the DOL and they said I’d receive a callback. That was June 29. I haven’t been called.”Gertner filed for unemployment on March 2. (Photo: Leo Gertner)Luckily for Gertner, his wife is still employed, so the couple has been able to pay their bills on time and use her health insurance.“We paid our daycare for four months without sending our kid there to help them out, but then we stopped paying,” Gertner said. “I've been giving when I can to the food bank and mutual aid organizations, because the situation for people in households that lost more than one job or had only one person working has to be impossible. We no longer have enough to save anything, but we were lucky that before this situation we were saving.”Story continues‘It’s all gone now’Gertner isn’t the only American who’s been waiting for months for their unemployment claim to be processed.Jeffrey King, a mechanical engineer from Atlanta, filed for unemployment on March 29.It’s been nearly four months and he still has heard “not a word,” he told Yahoo Finance. “The numbers provided either do not work or have rung busy for months.”The experience has been “terrible” for both he and his wife, although he admitted being “lucky enough” to have family members to rely on in the meantime.King filed for unemployment on March 29. (Photo: Jeffrey King)“I graduated from college a year prior to this, and we had just begun to rebuild our savings,” King said. “It is all gone now. We have had to ask family for money to pay our taxes on income I no longer have.”While some are stressing about the weekly UI checks coming to an end, King said he is “no more nervous than I have been receiving nothing.” The unemployment rate in Georgia is around 7.6%, with 373,404 jobless claims filed in June.Fulton County, where King is based out of, has a 10.2% unemployment rate. (Photo: Georgia Department of Labor)According to Kersha Cartwright, the director of communications at Georgia Department of Labor, 91% of unemployment claims have been paid so far.“We are addressing the claims that are still not paid,” Cartwright told Yahoo Finance in an email statement. “Some of them have identification issues related to multi-agency verification as part of our fraud prevention measures. Each of these must be verified before benefits can be paid. Some of them have separation questions and must go through a benefits eligibility review to determine if benefits should be released. Each of these challenging claims have to have manual intervention to resolve the issue. We are talking with claimants by phone, email, and on our social platforms.\"King, however, is skeptical of the data being published by officials.“Georgia is actively lying about their responses,” King said. “Tons of people have not gotten their benefits … The unemployment was already not remotely enough, and many people aren’t seeing any of it. It’s a common refrain in the black neighborhood where I live.”People wearing face masks stand on a street in Atlanta, Georgia, the United States, July 19, 2020. (Photo by Alan Chin/Xinhua via Getty) (Xinhua/ via Getty Images)‘It’s frankly very disheartening’It’s unclear how many Americans face significant delays in unemployment benefits since the pandemic began.Why the delays in the first place? Because most state unemployment offices have been inundated with more unemployment claims than their system was designed to handle at once.At least 54 million jobless claims have been filed since the COVID-19 crisis began.In New York, the state’s unemployment rate was at 15.7% for the month of June. In New York City, the rate was even higher at 20.4%.“It’s frankly very disheartening,” Gertner said. “I’m a lawyer, a labor and employment lawyer no less, so I understand these bureaucracies and I know the rules. I’m used to navigating them and I know my rights. If someone like me keeps hitting dead ends, I can only imagine the difficulty and frustration other people are experiencing. I believe in government and I think it should work for the people.”New York state’s unemployment office did not respond to request for comment.A long line forms to receive free food from a food pantry run by the Council of Peoples Organization on May 15 in the Midwood neighborhood of Brooklyn, New York. (Photo by Andrew Lichtenstein/Corbis via Getty Images)Over four months of silenceJustin, who asked that his last name be withheld for privacy purposes, is yet another individual who filed for unemployment in March and hasn’t gotten a check.Justin lives in Pennsylvania but works across the border in Lambertville, New Jersey, and has to go through New Jersey’s Department of Labor, from which he’s only received a handful of automated emails (NJDOL did not respond to request for comment).“The situation has been extremely nerve wracking, to say the least,” Justin told Yahoo Finance. “As someone who naturally experiences quite a bit of anxiety, the added pressure of being entirely unaware of where or when I will get income has been awful. It would be one thing if there was even a remote sense of NJDOL following up, or being generally prepared.”Americans worry as unemployment benefits are due to end soon. (Photo by SAUL LOEB/AFP via Getty Images)For Justin, he said he’s been affected “in quite a stifling manner.”“My most critical hope for all of this is that the light is shined on those who are entirely unable to find the ability to maintain an even survivable means of income through this, those without savings large enough, of which I am sure there are many,” he said. “I certainly had to ask for a ton of help, something I truly despise having to do under most circumstances, and that’s just about the only way I managed to get to this point where I am still on the verge of eviction.”Calls for an extensionAs Congress and the White House debate over the next steps for unemployed Americans, these individuals remain in limbo.“Many people are feeling the effects of this pandemic now instead of back in April,” Ali, a network engineer out of Ohio who’s currently unemployed, told Yahoo Finance. “People deserve time. If the bills don’t stop and the funding does, something’s gotta give.”Ali, who asked his last name not be used for privacy purposes, filed for unemployment in June and hasn’t heard back yet.“I’ve certainly had to utilize much of my savings, but that’s why it’s there,” he added. “The coming weeks and months will be extremely difficult if I can’t get answers from our state offices.”House Democrats urge House Republicans to extend unemployment benefits that was passed as part of the CARES Act which is due to expire on July 31, 2020. (Photo by Michael A. McCoy/Getty Images)For Gertner, he’s worried about the long term as the coronavirus continues to drag on and the economy struggles with a recovery.“No one is hiring right now, so I'd like to know that the government will provide an extra buffer for the unemployed like me,” he said. “But it also shows how the maximum benefits in our regular unemployment is way too low, $502 a week, and that's only for people who made more than $52,000. If you're making minimum wage and working full-time, I think you only get $300 a week, which is way too little to survive. That's why the $600 mattered — it was for everyone. Everyone should get at least the maximum of $502 a week. The regular system is stingy, but especially if you make less money.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:'It’s a freaking circus': Unemployed Americans share tales of an overloaded systemMillions of American workers lost health insurance as coronavirus pandemic worsenedCoronavirus: Health care experts call for nationwide special enrollment periodRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}