{"article": [{"url": "https://finance.yahoo.com/news/yahoo-finance-harris-poll-news-older-generations-make-financial-decisions-154723797.html", "published": 1593428120.0, "headline": "This demographic tends to rely on news to make money decisions", "body": "Older Americans are putting overwhelming faith in news to inform their financial decisions as compared to the younger generation, according to the first installment of the new Yahoo Finance-Harris poll.Eighty-one percent of people ages 55 years and older say their money and investment decisions are influenced by the coverage of current events. Only 25% of people between 18 and 34 years old use the news as an information source for their financial decisions.The results stem from a poll of 2,033 respondents, conducted from June 15 to 17. Yahoo Finance has teamed up with Harris to produce monthly insights on consumer and workplace trendsFifty-five percent of U.S. adults get their news from social media, according to a 2019 Pew Research Report, up from 47% in 2018. And Facebook (FB) is the top destination among its peers, with 52% of all U.S. adults getting their news from the platform. Alphabet-owned YouTube (GOOG, GOOGL) comes in distant second with 28% of adults turning to the videos as a news source.Shocked frustrated senior mature man taking off glasses to look at laptop reading shocking online news at home, stressed worried middle aged old male confused by bad email news or computer problemSocial media as a news sourceUnfortunately, disinformation travels the fastest and gets the most engagement on these social platforms. According to a 2018 MIT study, false news is 70% more likely to be retweeted than true stories, which take nearly six times as long to reach 1,500 people as it does for false stories to reach the same number of individuals.In response to this reality, on June 17, a collective of six organizations launched #StopHateForProfit, an initiative that pressures companies to pull advertising from Facebook and Instagram for at least the month of July. “Let’s send Facebook a powerful message: Your profits will never be worth promoting hate, bigotry, racism, antisemitism and violence,” the consortium states in its call to action.Since then, consumer brands like Patagonia, REI, Unilever (ULVR.L), The North Face, Verizon (VZ), Coca-Cola (KO) and Starbucks (SBUX) have paused advertising for varying amounts of time.Story continuesMelody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more from Yahoo Finance-Harris PollRead more:Defeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperityIf Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAnti-racism movement leads to 'Cops,' 'Gone With the Wind' being pulled from platformsAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and moreTech CEOs decry racial injustice amid George Floyd protests"}]}