{"article": [{"url": "https://finance.yahoo.com/news/colleges-campus-partying-coronavirus-pandemic-200517909.html", "published": 1597936460.0, "headline": "'Be adults': Colleges crack down on campus partying amid derailed pandemic re-openings", "body": "Some U.S. colleges decided to re-open campus — with precautions varying by school — for the fall amid the coronavirus pandemic, and it’s not going well so far.Now the roughly 600 colleges that are holding in-person classes are doubling down on enforcement of social distancing guidelines and attempting to deter students from partying after several big-name schools were forced to shut down or suspend plans.“Every student must know that the parties and disregard for face masks, physical distancing, and gathering size causing other universities to abandon in person classes will not be tolerated at Vanderbilt,” the university, located in Nashville, stated in a series of tweets.College students walk to dinner at the University of South Carolina on August 10, 2020 in Columbia, South Carolina. Students began moving back to campus housing August 9 with classes to start August 20. (Photo by Sean Rayford/Getty Images)At Syracuse University in upstate New York, the vice chancellor’s anger over a party on Wednesday night was evident in a new statement:“Last night, a large group of first-year students selfishly jeopardized the very thing that so many of you claim to want from Syracuse University—that is, a chance at a residential college experience. I say this because the students who gathered on the Quad last night may have done damage enough to shut down campus, including residence halls and in-person learning, before the academic semester even begins.”‘Be better. Be adults.’That some 18-to-22-year-olds would eschew rules upon returning to campus life is no surprise. That said, given that many schools rely on tuition to survive from year to year, college officials are trying.“All these schools that are inviting people back in, of course, you have to ask yourself: Why would they do that?” Paul Quinn College President Michael J. Sorrell told Yahoo Finance in an interview this week. “And the answer: political pressure and money.”There are over 5.1 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Laurence Steinberg, professor of psychology at Temple University, told Yahoo Finance that the schools that are pushing ahead despite derailed plans elsewhere “are just delaying the inevitable.”At Syracuse, the vice chancellor signaled that the stakes are very high when he noted that “we have one shot to make this happen” and that the “world is watching, and they expect you to fail. Prove them wrong. Be better. Be adults.”Story continues‘I was super glad they sent that warning out’The stern warnings are being followed by signs of enforcement.At the University of Michigan, off-campus student behavior will be monitored by “ambassadors” who will initially work from noon to midnight, seven days a week to “serve as a visible presence and reminder to students and other community members of the need to follow public health guidance.”Here’s what ambassadors will be wearing pic.twitter.com/xA1jrstkQy— Calder Lewis (@CalderLewisTMD) August 20, 2020At the University of Connecticut, several students were reportedly evicted from on-campus housing after videos surfaced of them throwing a dorm party this week.Not all students support their peers disregarding the risk of spreading coronavirus.An education major and resident assistant at a small college in Indiana, who asked to remain anonymous for fear of social backlash, told Yahoo Finance that she’s worried after hearing about parties from other students.“Three were hosted by sports teams (baseball, men’s basketball, and women’s basketball) and the other was ran by a fraternity on campus,” she said. \"I’m worried sick that [students who go to parties] are going to get each other sick and possible cause someone to die early in their lives.”⚠️University of Connecticut officials evicted several students from on-campus housing after learning of a crowded dormitory room party with no mask wearing or social distancing, which violated the school’s #coronavirus rules. 🤦🏽‍♂️🤦🏽‍♂️ https://t.co/TciVQqtkAv pic.twitter.com/k6sVrf39Cz— Cleavon MD (@Cleavon_MD) August 20, 2020Bryce, a 20-year-old industrial engineering technology student at Purdue University in Indiana, felt reassured after the university told students in an email that the school would be taking “hard line” against parties and unsafe gatherings.“They basically warned those that wanted to come to campus to party that they weren’t welcome,” Bryce told Yahoo Finance. “I was super glad they sent that warning out.”On Thursday, Purdue suspended 36 students for attending a party deemed unsafe. (The school also prepared for the fall by buying $5 million in plexiglass to install across campus.)(PHOTO: PURDUE)“I had a huge moral struggle trying to decide whether or not to come go back to school,” Bryce said. “The science very obviously points out that it isn’t safe to open, but Purdue pushed and pushed to open back up.”Furthermore, remote learning would be particularly difficult for students like Bryce: “Last semester, I was supposed to learn how to weld but the lab was cancelled due to COVID.” And while most of his fall classes are online, he has “a lot of hands-on classes that require me to go into labs.” Classes start on August 24.And even while being personally vigilant, Bryce understands the risk.“If other students don’t have the same sense of responsibility once classes start, I will start to worry,” he said. “People let up on precautions because of a false sense of security. Everyone just needs to be more aware of how real the virus is and how unforgiving it can be.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.coRead more:Campus re-openings are driven by 'political pressure and money,' college president saysCoronavirus: Universities begin U-turns as campus life brings outbreaksCoronavirus: Some college students returning to campus are being met with liability waiversRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}