{"article": [{"url": "https://finance.yahoo.com/news/students-discuss-returning-to-school-amid-coronavirus-pandemic-123827599.html", "published": 1596699980.0, "headline": "'Just trying to get through the year': K-12 students discuss returning to school amid the coronavirus pandemic", "body": "School districts are preparing to reopen across the country, and parents are debating whether to send their children back. But some students are expressing concerns of their own.“I think that’s terrifying to me, going back to like a classroom with my fears in a world and just trying to get through the year,” Jasmine Jovel, a recent high school graduate from Chelsea, Mass., said during a discussion with middle and high school students in the Massachusetts area held by Congresswoman Ayanna Pressley (D-MA). “But with that ongoing fear that no matter how safe we’re trying to be, there’s still that chance that we can get the virus and people go home and they go to work and they interact with so many other people that we’re not aware of.”Both of Jovel’s parents had contracted COVID-19, the disease caused by the coronavirus, and she was concerned about whether her, or even her younger sibling attending first grade, would pick the virus up and bring it back home.(SCREENSHOT: Zoom call with Rep. Ayanna Pressley)Another student worried that the impact of staggered classes would compromise her ability to look after her younger sibling in school.“I have a younger brother and I know one of the plans were to do — people whose last name started with A through M, go in the beginning of the week … and N through Z at the end of the week, [but] personally for my family that wouldn’t work because me and my younger brother have different last names and there wouldn’t be anyone to take care of him when I’m out of school,” Emanuelly Fernandes, a high schooler from Everett, Mass., told the listening session.“I usually pick up my younger brother at school and he goes with me places,” Fernandes added. “So if it was to split up or do hybrid, like half online, half in school, it would be difficult personally for my family.”Second grade teachers wearing masks meet at Freedom Preparatory Academy as they begin to prepare to restart school after it was closed in March due to COVID-19 on August 5, 2020 in Provo, Utah. (PHOTO: George Frey/Getty Images)Coronavirus cases popping up in schoolsThe students showed not only an awareness and depth of their understanding of how experts believed coronavirus spreads, but also talked about how social distancing could mitigate transmission.Story continues“If you have large numbers of students inside of a school that it’s a little bit more risky— it’s like fully open,” Kameela Blackmon from Milton, MA, said. “I would say that if you have a school where you only have like 300 students … that you could probably reopen, but there’s a less chance that you’re having like a thousand kids in a school.”One student also raised a question about whether a deep cleaning of classrooms and surfaces touched by infected students will be sufficient to get rid of the virus.Cases are popping up all across the country. (Graphic: David Foster/Yahoo Finance)Sixth grader Cheyenne Brown from Boston, MA, also noted that some people simply didn’t even follow the safety precautions, potentially jeopardizing a safe return to school.“I feel as though it would be scary for going back to school in-person because of the interactions in dealing with people who don’t take it as serious as they should… that it would be best to stay home,” she said.The concerns are well-founded.In the Corinth School District in Mississippi, several students and one staff member were found to have contracted the virus since the school reopened on July 27.One student at Thales Academy in North Carolina was found to have contracted the coronavirus, leading to students and staff exposed to that individual being put in quarantine. The school has been open since July 20.In Georgia, a second-grade student was found to have tested positive for COVID-19, leading the school to put exposed students under a two-week quarantine. And Georgia’s largest school district is facing questions about lax safety protocols.A counselor talks with a disappointed camper during the Crossroads at BCYF summer youth programs at the BCYF Condon Community Center in Boston, MA on July 17, 2020. (PHOTO: Craig F. Walker/The Boston Globe via Getty Images)The Centers for Disease Control and Prevention (CDC) has released a checklist for K-12 school administrators preparing to reopen in fall 2020. Some of these recommendations include frequently cleaning and disinfecting frequently touched surfaces, and implementing social distancing, cloth face coverings, and more.But as of August 5, according to Education Week’s tracker, 12 of the 15 largest school districts are choosing remote learning.Children under 10 years old (who do not have underlying medical conditions) are at lower risk for contracting COVID-19, according to early studies of the virus, and generally show lighter symptoms if infected.As of July 21, the CDC reports that in America, 6.6% of confirmed U.S. cases and less than 0.1% of COVID-related deaths are among those less than 18 years old.But children between the ages of 10 to 19 transmit the coronavirus much like adults, one study of 5,706 COVID-19 patients from South Korea found, raising the risk for school staff.An NAACP volunteerposts coronavirus awareness posters at Madison Park Technical Vocational High School in Boston, MA on August 01, 2020. (PHOTO: Craig F. Walker/The Boston Globe via Getty Images)Students share personal stories of COVID-19At the same time, continuing with the status quo — remote learning — isn’t going to work for many students, parents, and schools.“I have ADHD and I’ve always struggled with homework and staying on task,” Adam Gould, a high schooler from Cambridge, MA, said. “Since we’ve gone fully remote … it’s really been hard for me to stay on track again. … it’s really hard to stay motivated when you’re not there having to do it in person.”Adding to the burden of schooling from home is the fact that his grandfather had contracted COVID-19. Even though he was recovering from the virus and Gould’s family was taking care of him, the man passed away.“That has been a shock on our whole family,” Gould shared.For sixth grader Brown from Boston, coronavirus hit even closer to home, an experience which has left an indelible mark on her.“My brother contracted COVID-19 and it made me feel sad,” Brown recalled. “I cried for two days, but when I heard that he was getting better, and that he [was in] quarantine, I was hoping that it would just get better.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:'The urgency is real': CDC and Education Department join White House push to open schools amid coronavirus pandemicCoronavirus: 'We cannot' put kids in schools 'if we have a very high level of transmission,' doctor warnsSchools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}