{"article": [{"url": "https://finance.yahoo.com/news/bowling-is-now-a-dynamic-sexy-sport-pba-tour-ceo-112432969.html", "published": 1595053940.0, "headline": "Bowling is now a 'dynamic, sexy' sport: PBA Tour CEO", "body": "Colie Edison’s high game on the lanes may only be 135, but she has rolled all strikes so far since taking over as the new CEO of the PBA Tour in late 2019.More formally known as the Professional Bowlers Association Tour, the 60-year-old sports league is being completely reimagined under Edison’s, 36, watch. The fact that it’s being done at all amid the COVID-19 pandemic that has shut major sports (and bowling alleys across the country) down is impressive.The PBA Tour returned to the TV airwaves in late May with strict social distancing protocols, explains Edison.“What you’ll see is between eight and 10 to 12 bowlers total. You’ll never see more than two bowlers on a lane at the same time. There’s no sharing of any resources. Everybody on the set and the crew is wearing masks. Temperature checks are done when you come in. And we’re just taking health and safety really seriously. It’s the number one priority right now,” Edison said on Yahoo Finance’s The First Trade.Also a priority is making the game more entertaining for people to watch at home. Utilizing her background in marketing and entertainment, Edison has unveiled new TV events since the tour’s return such as “Strike Derby” where players race to throw as many strikes as possible in a specified time. Another has been a shootout type of event pitting the sport’s top bowlers — male and female — against one another.Edison is also working on an event that utilizes the sports legends such as Walter Ray Williams Jr. (the sport’s Babe Ruth) and the current crop of strike throwers.PORTLAND, ME - MARCH 30: Terrence Robinson of Gray shakes PBA player Walter Ray Williams Jr.'s hand after winning against the pro during the PBA Xtra Frame Maine Shootout at Bayside Bowling in Portland, ME on Monday, March 30, 2015. (Photo by Whitney Hayward/Portland Portland Press Herald via Getty Images)The creative overhaul comes as Bowlero Corp. — operator of some 300 lanes in the country — purchased the PBA Tour in late 2019. Edison was quickly installed as CEO after serving as Bowlero Corp.’s chief customer officer. Media giant Fox expanded its relationship with the Tour in October 2019, giving it prime placement on its sports channel FS1 and Fox. The Fox deal — and others Edison is working on — could meaningfully up the prize money for the athletes (who make far less than other sports).Story continues“We did two special events in June. Over half of those viewers watched it for the first time. So we’re exposing bowling to a new generation, a new audience. That’s really the goal. We have changed a lot. What you’re seeing on TV is that dynamic, sexy version of bowling that has never been around before. Our partners at Fox have been really, really supportive,” Edison says.And as for that high game of 135, Edison is focused on reimagining her game as well.“I’m a recreational bowler. I just got a new ball. I just got new shoes,” she says. I’m hoping to break my high of 135.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}