{"article": [{"url": "https://finance.yahoo.com/news/pandemic-worsens-miami-beach-visitors-100000148.html", "published": 1594789700.0, "headline": "As pandemic worsens, Miami Beach visitors party, residents mostly comply", "body": "By Zachary FagensonMIAMI BEACH, Fla., July 15 (Reuters) - A few blocks from the Miami Beach Convention Center, where an emergency field hospital stands ready to treat a potential tidal wave of COVID-19 patients, it's party-on along the resort city's famed Ocean Drive.In recent days, social media has shown maskless revelers dancing in the street, jammed into cars turned into ad hoc nightclubs, and crowding shoulder-to-shoulder, with drinks in both hands, in the outdoor seating areas of restaurants.\"It's a tale of two cities,\" said Miami Beach Mayor Dan Gelber. \"Our residents are pretty compliant, but our visitors have been spotty and there are areas of the city where it feels like the only people there are those who don't think there's a virus.\"Florida is fast becoming the epicenter of a second wave of the coronavirus outbreak in the United States. The Florida Department of Health confirmed over 9,000 new cases on Tuesday, bringing the total to over 290,000. An additional 133 deaths pushed the statewide total past 4,500.In populous South Florida, hospital officials have reported emergency rooms and intensive care units nearing capacity. On Sunday, Florida reported more than 15,000 cases - a new state daily record that surpassed New York's April peak.But a group of mask-and-bikini-clad vacationers from New York City said that was not enough to discourage them.\"We know there's a pandemic going on but it's not like you're not going to live your life,\" said Tamia Young, a 36-year-old postal worker visiting from Brooklyn with her mother and two daughters. \"Everything is closed anyway, so it's not like you can even enjoy Miami.\"The number of closures has increased in recent days, as partially opened businesses began testing their employees for the coronavirus, with some coming back positive.The Clevelander, an Ocean Drive hotel best known for its all-day parties spread across multiple levels of bars, pools, and clubs, reopened on June 18 but closed again on Monday, after one of its employees tested positive.Story continues\"Once we see the number of new cases start to go down, less delay in receiving test results and are confident that city and state guidelines are being followed and enforced, and that there is accountability, then we will re-evaluate and put an opening plan in place,\" said Jessica Francos, vice president of operations for owner Jesta Hotels & Resorts, in an emailed statement.Miami Beach officials are planning an increased police presence across the city, in the hope of dispersing large crowds and ensuring social distancing, mask wearing, and restaurant compliance with restrictions.\"The plan will provide... much needed extra personnel to manage the frequently uncooperative and unruly crowds that are completely ignoring all reopening guidelines,\" Miami Beach City Manager Jimmy Morales wrote in a Monday memo to other city officials.The surge in cases has also prompted state officials to consider reactivating a temporary, 450-bed field hospital that was constructed in the sprawling Miami Beach Convention Center near the outset of the pandemic in Florida.The center is usually home to events like Art Basel Miami Beach, which in December of each year attracts the global elite to sip champagne and purchase millions of dollars worth of contemporary art.For the past two months, the driveway leading up to the building has been filled with Florida National Guardsmen, and medical officials conducting drive-through COVID-19 testing.The crowds and the rapidly rising number of cases across the state are leaving many restaurants on Miami Beach in an impossible situation.Jacqueline Pirolo, managing partner of Macchialina Taverna Rustica, best known for its homemade pasta, said she supported the rules being imposed on restaurants, including a controversial indoor dining shutdown imposed last week.Since the start of the pandemic the restaurant she runs with her brother has gone from offering take-out, to becoming a wine shop, to closing its doors temporarily. It is preparing to reopen with take-out and outdoor dining, but even that is scary, she said.\"I'm excited, but I'm also terrified for the safety of our guests and our staff,\" said Pirolo. \"It doesn't matter how well you follow the rules when you don't know if anybody else is.\" (Reporting by Zachary Fagenson and Frank McGurty, Editing by Rosalba O'Brien)"}]}