{"article": [{"url": "https://finance.yahoo.com/news/more-people-are-paying-rent-despite-the-coronavirus-pandemic-143101786.html", "published": 1592386760.0, "headline": "More people are paying rent despite the coronavirus pandemic", "body": "It looks like landlords’ fears that tenants would not pay rent during the COVID-19 pandemic may have been overblown.At the beginning of the novel coronavirus pandemic in mid-March, mass layoffs caused tenants to worry whether they could pay rent. But three months later, rent payments have stabilized, according to the National Multifamily Housing Council (NMHC) survey of over 11 million apartments in the U.S., released June 16.“For the first time since this research for the National Multifamily Housing Council was initiated, there’s an annual bump in rent payments across a significant block of metros,” wrote Greg Willett, Chief Economist of RealPage, a Texas-based property management software company that contributed to NMHC research.By June 13, some 89% of tenants had made partial or full rent payments, slightly up from 88.9% payment on the same date last year. June marks the first month since the beginning of the pandemic that rent payments met or exceeded the percent of payment made last year. June also outperformed last month, when only 87.7% of renters paid rent by May 13.Landlords and economists overestimated the impact of the crisis when only 78% of renters paid in the first week of April. But payments were made later that month. Since then, tenants have made some sort of monthly rent payment, partial or late.June marks the first month since the beginning of the pandemic that rent payments met or exceeded the percent of payment made last year. Graphic by: Meghan Fitzgerald, Yahoo Finance.Renters are also more hopeful about being able to pay rent. In mid-May, 62% of renters said they would be able to pay June rent in full, up from 52% the same time last month. And only 8% said they won’t be able to pay rent at all in June compared to 12% last month, according to a survey of 15,000 renters by Grace Hill, a South Carolina-based property management training company.Some renters hit harder than othersSome renters had no interruption during the pandemic — Office jobs, which already have higher-paying wages on average than retail or food service employees, had fewer disruptions from widespread lockdowns because employees could work from home. Meanwhile, younger, low-income and urban-dwelling households had significantly higher rates of nonpayment, according to Apartment List.Story continuesAnd only about 84% of tenants in low-end apartments, which are more than 20 years old and in less desirable locations, made rent payments by June 13, compared to about 90.3% payment in middle-market and luxury properties, according to RealPage.“With lower incomes and limited savings, any interruption in wages tends to lead to financial struggle for residents,” in low-end apartments, said Willett.Certain cities also fared worse than the average. Las Vegas rent payments dropped 4.7 percentage points from the same time last year, and California rent payments faltered — 5.6 percentage points in Los Angeles, 2.4 percentage points in San Francisco and 2.5 percentage points in San Jose, according to RealPage.Apartment Balconies. Las Vegas, Nevada, USA Credit: Getty“It’s no surprise that rent payment levels are off the typical levels in Las Vegas. The metro has the country’s largest concentration of jobs in the hospitality sector, where job cuts have been severe,” said Willett.As for cities in California, “Enhanced unemployment benefits help, but the extra $600 per week provided by the CARES Act goes lots further in St. Louis than in San Francisco,” he said, referring to relief measures under the Coronavirus Aid, Relief, and Economic Security Act, which provided stimulus checks, bumped up unemployment benefits and prohibited evictions and penalties for tenants in properties with federally-backed mortgages. Over 30 states have also issued bans on evictions and penalties for not paying rent.But renters are starting to see some relief. Rents dropped 0.5% in June, especially in cities with high non-payment like San Francisco and San Jose, according to Zumper, a California-based rental listing site.“One of the largest contributors to this trend is that as more and more companies move into remote work, many renters don’t want to pay big city price tags when they are unable to use the amenities and are looking for more affordable options outside of large, metropolitan areas,\" said Anthemos Georgiades, CEO of Zumper.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:House flipping hits a record before the coronavirus pandemic swept the US: study‘Summer is going to be a good period for the housing market’: economistBidding wars start to heat up in some states as coronavirus lockdown eases"}]}