{"article": [{"url": "https://finance.yahoo.com/news/the-criticism-is-not-always-benign-cd-cs-redfield-laments-polarization-warns-coronavirus-is-a-war-185805867.html", "published": 1599055580.0, "headline": "CDC's Redfield laments polarization during coronavirus 'war', warns on Labor Day travel spreading", "body": "The U.S.’s key public health organization, buffeted by relentless criticism over its handling of the COVID-19 pandemic, has struggled to bend the curve of infections — and it’s affecting morale.In a wide-ranging interview with Yahoo Finance on Wednesday, Centers for Disease Control and Prevention (CDC) Director Dr. Robert Redfield said he’s had to spend time encouraging employees, and swatting away negative comments. He also backed the Trump administration’s move to block mass evictions, and warned that the upcoming holiday could lead to a new surge in COVID-19 diagnoses.On Tuesday, President Donald Trump invoked the CDC in extending a blanket moratorium on evictions nationwide for anyone earning under $99,000 per year, moving to prevent a homelessness crisis in the country. While Congress remains gridlocked over extending stimulus funds and other efforts to renew the CARES Act, the CDC can use its authority to extend protections as a public health move.Redfield is concerned about people having to move around and stay with others in close quarters, whether in a homeless shelter or cramped living with extended families or friends. The same is true for the upcoming holiday weekend.Spikes in cases were seen both after Memorial Day and Independence Day, and Redfield is concerned about the same following Labor Day — which would reverse progress towards stability in case trends nationwide.“We don’t want it to become a spreading event,” Redfield said, adding people should remain vigilant and be “smart about crowds.”He added that getting a flu shot in the fall is important to help avoid the strain on hospitals as flu season approaches, which could coincide with a second wave of the virus.“If we have a spreading event right now, with Labor Day, three to fours weeks later we’re going to have that surge of new cases, and it’s going to be really complicated,” Redfield said.“This could be one of the most difficult public health winters we’ve ever had, with the convergence of flu and covid.”Story continuesThere are over 6 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)Vaccine hopesWith mitigation steps still in place in many parts of the U.S., hopes are pinned on a vaccine — which could be available in limited supply by year’s end. On Wednesday, McClatchy reported that Redfield sent a letter to governors requesting that vaccine distribution centers be expedited and ready to roll by November 1, stoking new concerns about politics influencing the process.“We're preparing earnestly for what I anticipate will be reality, is that there will be one or more vaccines available for us in November, December, and we have to figure out how to make sure they're distributed in a fair and equitable way,” Redfield told Yahoo Finance.That includes taking the advice of the National Academies of Science, Engineering and Medicine, which released a draft distribution strategy Tuesday, as well as the independent Vaccines Advisory Committee to the U.S. Food and Drug Administration (FDA).FDA Commissioner Stephen Hahn said Wednesday the agency is beginning to plan meetings of the committee, which will be open to the public.‘Criticism is not benign’Between a botched start to testing and constantly changing guidelines — including a recent, more controversial move to minimize the need for testing among asymptomatic individuals that may have come into contact with an infected body — the CDC has become a moving target in an election year marked by increased polarization.It’s an uncomfortable position for an apolitical agency.“Sometimes I wish the critics would understand that they do have the potential to suck energy out of people who are trying to do the right thing, for the right reasons,” Redfield said Wednesday.“So the criticism is not always benign. It can actually change the enthusiasm, the earnest,” he added.“The most important thing I do as a director now is remind the men and women how important they are, how valuable they are, how their work is valued...and to stay focused on the goal line. This is an agency that is not used to having negative criticism,” the director stated.The onset of a global outbreak has meant a significant shift in responsibility, compared to when Redfield was first appointed director.“The first couple years at CDC, it was the time of my life,” Redfield said. The COVID-19 crisis has changed that, he said.“This is a real battle. This is one of the most critical, complicated public health crises the country has faced in over a century,” he said.More from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}