{"article": [{"url": "https://finance.yahoo.com/news/nkoreas-military-threatens-reenter-demilitarized-022149105.html", "published": 1592256560.0, "headline": "North Korea destroys empty liaison office with South", "body": "SEOUL, South Korea (AP) — North Korea blew up an inter-Korean liaison office building just north of the heavily armed border with South Korea on Tuesday, in a carefully choreographed, largely symbolic display of anger that puts pressure on Washington and Seoul amid deadlocked nuclear diplomacy.Although the building was empty and the North had previously signaled its plans to destroy it, the move is still the most provocative act by North Korea since it entered nuclear talks in 2018 after a U.S.-North Korean standoff had many fearing war. It will pose a serious setback to the efforts of liberal South Korean President Moon Jae-in to engage the North.North Korea’s official Korean Central News Agency said the country destroyed the office in a “terrific explosion” because its “enraged people” were determined to “force (the) human scum, and those who have sheltered the scum, to pay dearly for their crimes,” apparently referring to North Korean defectors living in South Korea who for years have floated anti-Pyongyang leaflets across the border.The news agency did not detail how the office in the North Korean border town of Kaesong was destroyed.South Korea’s government later released military surveillance video showing clouds of smoke rising from the ground as a building collapsed at a now-shuttered joint industrial park in Kaesong where the liaison office stood.South Korea issued a statement expressing “strong regret” over the destruction of the building, warning of a stern response if North Korea takes additional steps that aggravate tensions.The statement, issued following an emergency National Security Council meeting, said the demolition is “an act that betrays hopes for an improvement in South-North Korean relations and the establishment of peace on the Korean Peninsula.”South Korea’s Defense Ministry said separately that it closely monitors North Korean military activities and was prepared to strongly counter any future provocations. The South's vice unification minister, Suh Ho, who was Seoul’s top official at the liaison office, called the demolition an “unprecedentedly senseless act\" that shocked “not only our people, but the whole world.”Story continuesThe North said last week that it was cutting off all government and military communication channels with the South while threatening to abandon bilateral peace agreements reached during North Korean leader Kim Jong Un’s three summits with Moon in 2018.U.N. Secretary-General Antonio Guterres expressed concern at the latest developments and called for “the resumption of inter-Korean dialogue leading to peaceful solutions that benefit peace and prosperity for all,\" U.N. associate spokesperson Eri Kaneko said in New York.Some outside analysts believe the North, after failing to get what it wants in nuclear talks, will turn to provocation to win outside concessions because its economy has likely worsened because of persistent U.S.-led sanctions and the coronavirus pandemic. North Korea may also be frustrated because the sanctions prevent Seoul from breaking away from Washington to resume joint economic projects with Pyongyang.South Korea's response to Tuesday’s demolition was relatively strong compared to past provocations. Moon’s government has faced criticism that it didn’t take tough measures when North Korea performed a series of short-range weapons tests targeting South Korea over the past year.Moon, a liberal who champions greater reconciliation with North Korea, shuttled between Pyongyang and Washington to help set up the first summit between Kim and President Donald Trump in June 2018.The liaison office has been shut since late January because of coronavirus concerns. The office, built with South Korean money at a reported cost of $8.3 million, was opened in September 2018 to facilitate better communication and exchanges between the Koreas. It was the first such office between the countries since they were divided into a U.S.-backed South Korea and a Soviet-supported North Korea at the end of the World War II in 1945. The office was considered a symbol of Moon’s engagement policy.North Korea had earlier threatened to demolish the office as it stepped up its fiery rhetoric over what it called Seoul’s failure to stop civilian campaigns to drop anti-Pyongyang leaflets into the North. South Korea said it would take steps to ban the leafleting, but North Korea argued that the South Korean response lacked sincerity.On Saturday night, Kim Yo Jong, the influential sister of North Korea’s leader, warned that Seoul will soon witness “a tragic scene of the useless North-South liaison office (in North Korea) being completely collapsed.” She also said she would leave to North Korea’s military the right to take the next step of retaliation against South Korea.North Korea has threatened to dismantle the shuttered Kaesong factory complex completely and abandon a 2018 bilateral tension-reduction agreement, which observers say could allow the North to trigger clashes along the land and sea borders.Earlier Tuesday, North Korea’s military threatened to move back into unspecified border areas that have been demilitarized under agreements with South Korea and “turn the front line into a fortress.”On Monday, Moon urged North Korea to stop raising animosities and return to talks, saying the two Koreas must not reverse the 2018 inter-Korean summit deals.North Korea has a history of taking highly visual symbolic steps for political gains. It invited foreign journalists to watch the detonation of its underground nuclear testing tunnels in 2018 and the demolition of a cooling tower at its main nuclear complex in 2008. Both events were an attempt by the North to show it was serious about denuclearization amid rampant outside skepticism about its commitment.“It’s hard to see how such behavior will help the Kim regime get what it wants from the world, but clearly such images will be used for domestic propaganda,” said Leif-Eric Easley, a professor at Ewha University in Seoul.The Koreas’ neighbors voiced concerns over Tuesday’s demolition. Japanese Prime Minister Shinzo Abe said he hopes tensions between the Koreas will not escalate further, adding that Japan will cooperate closely with Seoul and Washington while analyzing the development.In China, the North’s major diplomatic ally, foreign ministry spokesman Zhao Lijian said that “we always hope that the Korean Peninsula will maintain peace and stability.”Inter-Korean relations have been strained since the breakdown of a second summit between Kim and Trump in Vietnam in early 2019. The summit fell apart because of disputes over how much sanctions relief the North should get in return for Kim’s dismantling of his main nuclear complex, which was seen as a limited denuclearization measure.After the Vietnam summit, inter-Korean relations turned sour again. Kim entered 2020 vowing to expand his nuclear arsenal, introduce a new strategic weapon and overcome the U.S.-led sanctions that he said “stifles” his country’s economy.___Associated Press writer Mari Yamaguchi in Tokyo and researcher Liu Zheng in Beijing contributed to this report."}]}