{"article": [{"url": "https://finance.yahoo.com/news/best-western-ceo-says-airbnb-cant-promise-the-cleanliness-hotels-can-during-pandemic-174412208.html", "published": 1597857200.0, "headline": "Best Western CEO says Airbnb can't promise the cleanliness hotels can during pandemic", "body": "Unsurprisingly, the pandemic hammered the U.S. hotel industry.Since March, most Americans have stayed at home and worked from home; no travel meant no hotel stays. U.S. hotels have lost more than $46 billion in booking revenue since mid-February, according to the American Hotel & Lodging Association (AHLA). In May, U.S. hotel profit fell by 105% vs. May 2019. The industry is projecting a 50% drop in revenue for 2020 overall. As of July 30, more than half of the open hotel rooms in the U.S. were sitting empty.“The effects have been about 10 times worse than [after] 9/11,” Best Western CEO David Kong told Yahoo Finance this week.But now many Americans are at last beginning to venture out and (cautiously) travel—mostly in the form of summer road trips—and in many cases, they will choose between hotels and Airbnb houses.Kong makes the case that hotel chains are safer and cleaner than Airbnbs right now, thanks to the AHLA’s “Safe Stay” program, which establishes uniform room cleaning protocols.“All the major hotel brands have implemented that,” says Kong. “And people should feel very safe and secure and comfortable staying at major hotels. That’s a little different than Airbnb, which is not regulated and also does not provide the same reassurance.”Kong’s comments come just as Airbnb on Wednesday filed its IPO papers with the SEC, even after its revenue fell 70% in Q2 and its valuation has been cut to $18 billion from $31 billion.Airbnb CEO Brian Chesky told NPR’s “How I Built This” podcast earlier this month that Airbnb’s bookings in July were “at or above last year’s levels... nobody knows if this is pent up-demand or not, but we're around last year's levels all around the world.”Of course, it behooves Kong to say this about a competitor, one that is about to go public. And Airbnb did announce in April an “enhanced cleaning initiative” for hosts, “informed by the CDC published standards... and leading experts such as Dr. Vivek Murthy, former Surgeon General of the United States.”Story continuesBut to Kong’s point: Airbnb hosts operate independently of one another, and are not beholden to any third party governance apart from the possibility of a traveler lodging a complaint with Airbnb over cleanliness.Housekeeper sprays sanitizing spray in a room of the Costa Baja hotel on July 30, 2020 in La Paz, Mexico. (Photo by Alfredo Martinez/Getty Images)Despite his cleanliness claims, Kong gives Airbnb a lot of credit as a competitor. “Airbnb has had an impact on our industry since it came into being,” he says. “They had very good marketing campaigns... They made it sound like fun to stay at homes rather than hotels. In the major cities, there have been different reports that the impact is anywhere from 3% to 10%.”When Airbnb does debut on the public markets, its competitive threat to traditional hotel chains is sure to be a focal point.Kong, for his part, says that Best Western has seen a recovery since Memorial Day Weekend, but he remains “really concerned about the future, because fall is coming, and that’s traditionally when leisure business slows down dramatically and is replaced by meetings and convention business, and as we all know, this pandemic has dramatically compromised that segment. And then winter is traditionally a very slow period for the hotel industry.”—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers tech. Follow him on Twitter at @readDanwrite.Read more:Airbnb has been brutalized by the pandemic, but will IPO anyway in 'forgiving' marketUber Eats is bigger business than Uber rides right now, but far from profitableEtsy CEO on huge Q2: Etsy is 'becoming much more mainstream'Apple has less to fear from antitrust regulators than Facebook, Google, and AmazonFacebook ad boycott is ‘more noise than fundamental risk’Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’"}]}