{"article": [{"url": "https://finance.yahoo.com/news/2-tax-safe-harbors-that-new-traders-need-to-know-about-163135382.html", "published": 1599824360.0, "headline": "2 tax safe harbors that new traders need to know about", "body": "Retail investors have been the big winners in this recent bull market, buying the March/April dip and enjoying a spectacular run – the S&P 500 index is up over 50% since March – even with the recent market turmoil in tech stocks.A great deal of them are also new to the market, welcomed by commission-free trading options from Robinhood, and now, the older, more established brokerages.Some investors may be unfamiliar with the responsibilities that come with winning in the market, which can sometimes mean estimated taxes – due quarterly. The next installment is Sept. 15.Despite the recent market tumult, many retail investors are very much in the money and are realizing those gains by trading frequently, according to a Yahoo Finance-Harris Poll survey.Much of this behavior, the survey also found, is happening in brokerage portfolios (not retirement accounts). That means these gains are subject to U.S. capital gains taxes – 0%, 15% or 20%, depending on how much money you make if you sell after a year of holding, or simply ordinary income if you sell a position in less than a year.\"Traders may need to make estimated tax payments if they have recognized significant capital gains this year,\" Hayden Adams, director of tax planning at Charles Schwab.Capital gains come with capital gains taxes — and your employer doesn't withhold them like it does with income. This means some people might be required to pay estimated taxes. (Getty Creative)For people who have a windfall that doesn’t involve withholding, there can sometimes be penalties, because you’re supposed to pay tax throughout the year, not just a lump sum come tax day.To avoid the penalties, Adams says traders should either increase withholding or make estimated tax payments.Generally, says Barry Kleiman, a CPA and principal at New Jersey accounting firm Untracht Early, regular people are often exempt from paying estimated taxes if they experience a big gain in the market during the year if they expect to wipe those gains out by the end of the year — and that people who invest in hedge funds need to pay special attention.But depending on one’s circumstances, the IRS may be interested, which is why it’s important for people who realize capital gains to understand their particular situations.Story continuesSafe harbors and estimated taxesSay an investor who makes $80,000 a year bought $10,000 worth of Tesla (TSLA) shares in April when shares were $100 (in today’s post-split values), and sold them in August after the stock rose to $400 for $40,000. They would have netted $30,000 on that trade. But since that’s a short-term capital gain, it means the investor would have to pay ordinary income tax on that money — let’s say around 24%, which comes to around $7,200.This person’s taxes are $7,200 higher than last year because of the Tesla gain, but there are two main ways to get people into a “safe harbor” situation to avoid penalties that come with underpaying taxes. (A safe harbor is a legal provision to reduce or eliminate a liability, or tax, if certain conditions are met.)If you’re set to pay 100% of last year's tax (or 110% of it if you make over $150,000) you are in a safe harbor, so you don't have to pay an estimated tax, says Mary McGrath, a CPA at Cozad Asset Management in Illinois. Similarly, if you pay 90% of this year’s tax, you’re also in the clear come April.(Photo by Filip Radwanski/SOPA Images/LightRocket via Getty Images)If that Tesla investor is still employed and with the same salary with the same withholding, they’ll probably pay around $11,000 in taxes via their paycheck without doing anything new — the same as last year and be in the safe harbor. They wouldn’t get hit with a penalty for underpaying throughout the year, just a fat $7,200 tax bill.If you’re unemployed and trading stimulus money or trying to grow your nest egg, you may not have regular withholding. In that case you may need to pay estimated taxes – at least 90% of what you’ll owe or 100% of what you owed last year, the other strategy for safe harbor.“The process is to estimate your tax for the year and make sure 25% of it is paid in each quarter,” says Kleiman.So for the Tesla investor, that would be making four payments of $1,800 throughout the year. It’s important to note that investing losses can offset gains, so many people may pay more at the beginning of the year and less later, if a loss is realized that offsets the taxable gains.Even if you can get away with paying the government a lump sum and not pay estimated taxes, many accountants advise paying estimated taxes, or at least putting money to the side throughout the year for this purpose, because an April surprise is extremely unpleasant. That theoretical Tesla investor might have forgotten about the gains or used them to buy other stocks, and may have a hard time paying Uncle Sam.---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Poll: 83% of companies ready to embrace new work conditions after coronavirusEvery investor has 'a silent partner' when they trade stocks: veteran CIOWhy the 2020 rally doesn’t feel like a bubble: hedge fund veteranNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}