{"article": [{"url": "https://finance.yahoo.com/news/media-mogul-byron-allen-i-think-president-trump-is-totally-wrong-130356805.html", "published": 1595405480.0, "headline": "Media mogul Byron Allen: 'I think President Trump is totally wrong'", "body": "President Trump is known for lobbing the “fake news” catchphrase at the media in response to criticism of his leadership.Byron Allen, one of America’s few Black media moguls, called him out on it during Yahoo Finance’s All Markets Summit Extra: Road to Recovery on Tuesday.“President Trump is completely wrong,” Allen said. “What he’s not understanding is that he’s nothing more than temporary hired help. He works for the American people. He answers to us, we don’t answer to him.”The media’s role is to “keep the bosses informed,” Allen explained. “The American people, we are the boss, we run it,” he said. “Thank God we have the media or else I think we might all be drinking Lysol right now, and we don’t need to be drinking Lysol.”Allen is the founder and CEO of the Allen Media Group which owns nearly a dozen cable networks, including the Weather Channel, about a dozen local TV stations, and produces more than 60 syndicated TV shows and thousands of hours of content.Allen is a champion of the media. His $8.5 billion all-cash bid for TV station owner Tegna, (TGNA) became public in March, and he plans to invest $10 billion over the next three years to acquire additional NBC, CBS, ABC, and FOX network affiliate local television stations and other media assets.Even though advertisers have cut back because of the financial toll of the pandemic, Allen is still bullish on the profitability of the television business. “We know, long run, it’s a marathon, not a sprint. We’re going to be fine. Everybody is going to need local news, weather, and sports. That’s just essential to who we are,” he said.Byron Allen (AP)‘The lens of white owners’While Allen points out that the media has a vital role in informing the public about the coronavirus pandemic, he is critical of its coverage of racism and the protests following the death of George Floyd.“I think [the media has] a big blind spot and I think that’s because at the end of the day, 99.9% of the media is going through the lens of white owners and white managers,” he said.Story continuesMoved by the racial justice protests, Allen wrote an op-ed titled “Black America speaks. America should listen.” He said he offered it to several newspapers, but they refused to publish it.Undeterred, Allen spent $1 million to get it in major newspapers including the New York Times and Washington Post nonetheless. “I knew that [newspapers] would reject it. And that’s why I bought 16 pages because it was two pages, to print it out, 16 pages in 8 different newspapers around the country,” he said.In his op-ed, Allen offered ideas to address economic, health care, and employment racial disparities. “Tribalism” only hurts America, Allen said.“We have to position each and every American to succeed to his [or her] fullest because we have to compete as one nation as one tribe, the American tribe,” he said, “because we have a lot of emerging nations around the world who are doing a much better job of educating their citizens and getting their citizens engaged.”More from Sibile:Ben Carson on second coronavirus economic shutdown: ‘You do that again, and you completely destroy the financial infrastructure’Ben Carson: All Obama HUD rule does is provide ‘permanent employment for lawyers’Why Black patients receive worse care at the hospitalCost of Confederate symbols comes out of Black workers’ paychecks: EPIThe upside of Trump’s Fourth of July fireworksFind live stock market quotes and the latest business and finance news"}]}