{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-astra-zeneca-vaccine-pause-underscores-uncertain-path-toward-a-cure-163440583.html", "published": 1599656720.0, "headline": "Coronavirus update: AstraZeneca hits speed bump in vaccine race; NYC reopens dining", "body": "New York City will partly reopen indoor dining on September 30, Governor Andrew Cuomo said on Wednesday, marking a major milestone in the Big Apple’s sluggish recovery as new infections there continue to remain under control.The city’s restaurants can accept customers indoors — but with strict limits that include capping capacity at 25%, temperature checks, and contact tracing protocols that involve at least one party leaving their personal information with the establishment. Among other stiff requirements, bar service will not be allowed, and eateries must shutter by midnight.UPDATE: On September 30, indoor dining in NYC can resume at 25% capacity.Strict restrictions will be in place. pic.twitter.com/ORzwGM67PQ— Andrew Cuomo (@NYGovCuomo) September 9, 2020Meanwhile, the Big Apple’s economy remains far from optimal, with wealthier residents bolting for the suburbs, violent crime soaring, and joblessness and homelessness rising. The crisis has crushed small businesses and restaurant owners, and the latter have lobbied hard for relaxing the restrictive measures that have only allowed them to serve to-go, or in outdoor settings.Yet the move underscores New York’s slow but steady revival since the early days of the COVID-19 crisis, when the region became a global epicenter. In recent weeks, new infections have remained low while hospitalizations and deaths are at their lowest levels since the outbreak began.Separately, the rapid global race to develop a coronavirus vaccine hit its first major hurdle, as frontrunner AstraZeneca (AZN) paused its Phase 3 trial in the U.K. after an unexplained illness was observed in a participant, which underscored the risks associated with developing a candidate amid high hopes and an aggressive timetable.While details were light, National Institute of Health director Francis Collins on Wednesday attributed a trial participant’s unexpected illness — which resulted in the trial’s halt — to a spinal cord issue. Yet it remains unclear if that problem was related to the vaccine.Story continuesHow this will affect the timeline for the company and Oxford University, which co-developed the vaccine, is unclear. Still, company officials anticipate only a brief interruption, with an AstraZeneca statement signaling that the company intends to continue the trial soon, possibly as early as next week.“As part of the ongoing randomized, controlled global trials of the Oxford coronavirus vaccine, our standard review process was triggered and we voluntarily paused vaccination. We are working to expedite the review of the single event to minimize any potential impact on the trial timeline,” according to a statement given to Yahoo Finance.In an interview Wednesday with CBS This Morning, Dr. Anthony Fauci said the halting of the trial is not unexpected, but is unfortunate, and staying alert for adverse events is key to ensuring the vaccine candidate emerges from trials as a safe and effective product.Questions aboundConfirmed coronavirus cases. (David Foster/Yahoo Finance)AstraZeneca’s surprise pause raised the stakes in the global fight against the COVID-19 outbreak, and highlighted the risks associated with producing an inoculation in record time.On Wednesday, the Trump administration announced guidance designed to expedite a vaccine to the population once it became available. The move will allow licensed pharmacists, or registered pharmacy interns, to administer a COVID-19 shot to citizens 3 years and older.The urgency to develop a vaccine has put global efforts under increased scrutiny — with Russia’s own data being sharply questioned by a group of experts. Specifically, they noted that participants antibody results are too similar to be realistic, according to the note.The skepticism is a serious allegation, according to Dr. Arthur Caplan, a bioethicist and NYU Langone professor.“If The Lancet got swept up in the peer review process...that could be troubling to investors. It means that reports for some countries may not be trustworthy,” Caplan said — adding that it would mark the “type of uncertainty that markets hate.”Over the last several months, Wall Street analysts and health experts have watched in awe as the stock market has aggressively priced in a COVID-19 cure, and bid up the stocks of companies developing vaccines.Although stocks were calm in the face of AstraZeneca’s news, future expectations are high based on a vaccine, and prices have swung wildly based on developments in those efforts — something Caplan said was risk in itself.“The up and down is undercutting confidence because there is too much hype of incomplete or partial information coming out,” Caplan said, noting that even company executives have taken advantage, by moving their shares as the stock swings.But that enthusiasm appears to be fading, according to Raymond James analyst Chris Meekins, who said that institutional investors who got in early began to exit in recent months and weeks, signaling the pullback seen in stocks like Moderna (MRNA) and Novavax (NVAX). Both have dropped considerably from their 52-week highs.Novavax, which received the largest funding award from the federal government for its vaccine candidate, is down from nearly $190 per share in August to under $95 per share this week.Caplan also noted that optimism over a vaccine by October is also unrealistic.“It’s just ridiculous, absurd fantasy,” he said, citing that the companies’ pledge to stick to safety rather than an Election Day timeline, a strong signal that they fear the consequences of rushing out a flawed product.The recent market activity “is a wake up call that says, you could be betting on a vaccine first out of the box that doesn’t work,” Caplan said.In the past week, Moderna’s frothy stock price has come back to reality.The small biotech has relied heavily on government funding to ramp up its first-in-line vaccine candidate, and some analysts say it cannot compare to the larger drug companies in the race who have sizeable global manufacturing capacity — and are also gaining ground on Moderna’s early lead.SVB Leerink analyst Mani Faroohar downgraded the stock to underperform Tuesday, citing an “inflated” long-term outlook and “heightened headline risk with increasing media scrutiny of aggressive management stock sales.”More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}