{"article": [{"url": "https://finance.yahoo.com/news/federal-reserve-grapples-with-links-between-monetary-policy-and-income-inequality-133424222.html", "published": 1592037740.0, "headline": "Federal Reserve grapples with links between monetary policy and income inequality", "body": "Federal Reserve Chairman Jerome Powell on Wednesday acknowledged economic inequality in the United States but said monetary policy tools can only do so much to narrow the income gap.Research from within the Fed itself, however, suggests that the central bank may be more effective when policymakers pay mind to income inequality while designing policy tools.“Inequality is something that’s been with us increasingly for more than four decades and it’s not really related to monetary policy,” Powell said in a press conference after the Federal Open Market Committee announced it was holding rates at near-zero.Powell attributed the divide between the top wage earners and the lowest wage earners to globalization and technological trends that have created a greater skills gap. Powell said higher education would be required to get higher paying jobs, leaving the bottom wage earners without a way to increase compensation if education and new skills are unattainable.“If you’re on the right side of those trends then those things are good for you,” Powell said. “If you’re not, then your wages are going to stagnate.”The Fed's 2016 Survey of Consumer Finances shows the income stagnation among the lowest earners relative to the highest earners.The Fed’s data from its Survey of Consumer Finances shows that since the financial crisis the richest families have seen faster income growth than the poorest families. In the post-recovery period covering 2009 through 2016, the median family in the bottom 20% of wage earners saw income grow by only 6%. The top 10% saw income grow by 9% over that period of time.Prioritizing low-income workersA 2018 paper from the Federal Reserve Board’s Isabel Cairó and Jae Sim, however, argues that monetary policy should consider income inequality when designing its policy tools - particularly during times like now when the target federal funds rate is backed up to zero.Pointing to previous economic research, Cairó and Sim note that higher-income groups tend to save more than lower-income groups (or in economic terms, have a lower marginal propensity to consume). The authors argue that higher-income earners can “overaccumulate” financial wealth and sustain high savings rates; lower-income earners are more likely to spend larger shares of their income just to make ends meet.Story continuesThis presents a dilemma for the Fed, which broadly wants to discourage saving and spur consumption (or in economic terms, drive aggregate demand) to fuel an economic recovery.The suggestion: an “optimal” monetary policy prioritizing the reduction in unemployment to improve the welfare of lower-income wage earners - even at the expense of welfare losses to higher-income earners holding onto financial assets.“[T]hese findings suggest that monetary policy can have distributional consequences,” the authors write.The paper adds that policymakers should “provide a sufficient degree of monetary accommodation during economic downturns” to break down the link between high income inequality and insufficient aggregate demand.Running the economy ‘hot’Vincent Reinhart, a former Fed economist who advised the policy-setting Federal Open Market Committee, told Yahoo Finance Thursday that the Fed should be mindful of how its monetary policy can asymmetrically affect people along the income spectrum.“The monetary transmission mechanism goes through markets,” said Reinhart, who is now a chief economist at BNY Mellon Asset Management. “It is inflating equity prices. And equity prices are the value of something that is held unequally.”Powell has been cautious in describing the Fed’s role in narrowing the income gap, which is not part of the Fed’s Congressionally-mandated goals of price stability and maximum employment.The Cairó and Sim paper similarly notes that monetary policy “cannot eliminate income inequality,” adding that fiscal policy may be better suited to address the widening gap.But the Fed’s experience with the post-2008 recovery has enlightened policymakers to the benefit of letting the labor market run “hot” through extended periods of accommodative monetary policy, which had the effect of drawing in marginalized, low-income workers into better-paying jobs.Last year, the Fed launched a listening tour as part of a broader effort to review its monetary policy framework. A wrap-up of the 15-event “Fed Listens” circuit detailed the many conversations with workers and employers who warned that the central bank’s aggregate view of “maximum employment” may overlook stagnation among low-income workers.“One clear takeaway from these events was the importance of sustaining a strong job market, particularly for people from low- and moderate-income communities,” Powell said in the report.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Powell: Capping US Treasury yields 'remains an open question'Fed: No rate hikes likely through 2022, projects 6.5% GDP contraction this yearFOMC Preview: Fed to focus on taming the yield curveFed expands Main Street loan program with lower minimum amount, extended termA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}