{"article": [{"url": "https://finance.yahoo.com/news/worst-unemployment-ever-before-us-presidential-election-coronavirus-trump-biden-171234892.html", "published": 1601641220.0, "headline": "This is the worst unemployment ever seen before a US presidential re-election", "body": "The U.S. added 661,000 jobs in the month of September, compared to the 859,000 expected. Though the unemployment rate did tick down to 7.9% (vs. 8.2% expected in September and the 8.4% recorded in August), it’s still the worst economic backdrop ahead of an election with an incumbent president running for re-election.Friday’s jobs report is the last monthly unemployment report before the Nov. 3 election, and it’s painting a dismal landscape for Trump’s campaign.Trump is not the only president to face re-election during tough economic times. Herbert Hoover, who was in office during the start of the Great Depression, was not re-elected for a second term in 1932. Both Jimmy Carter and George H.W. Bush, who served as presidents during sluggish economies, were only in office for one term.Angela Moore joins protesters as they temporarily block the street to U.S. Senate Majority Leader Mitch McConnell's (R-KY) house with a live band on a flatbed truck, demanding the extension of coronavirus disease (COVID-19)-related unemployment aid, on Capitol Hill in Washington, U.S. July 22, 2020. REUTERS/Jonathan Ernst“Heading into today's number, the unemployment rate was already looking likely to show the worst economy of any president running for re-election in modern economic history. When President Carter tried to win a second term and lost, the unemployment rate before the election was 7.5% in September 1980. When President Bush tried to win a second term and lost, the unemployment rate was 7.6% in September 1992,” Chris Rupkey, chief financial economist at MUFG, wrote in a note Friday morning.“This is the highest unemployment and worst economy for any president facing re-election in history and it will be a miracle if the incumbent can pull off a win in these unsettled and uncertain economic times,” he added.The employment picture, coupled with Trump testing positive for COVID-19 on Thursday evening, rattled markets on Friday morning. Former Vice President and Democratic presidential nominee Joe Biden, who shared the debate stage with Trump this week, tested negative for COVID-19.‘A new, weaker phase’There have been glimmers of hope amid the recovery from the virus-driven economic downturn, but it’s clear it may be leveling out. The September report doesn’t even reflect recent announcements of layoffs by large U.S. employers. Disney is cutting 28,00 jobs across its theme parks, cruise lines and retail stores, Allstate is eliminating 3,800 jobs, and up to 50,000 jobs could be cut across the airlines, as travel remains deeply depressed.Story continues“With the pace of private payroll gains continuing to slow gradually, it is clear that the economic rebound is entering a new, weaker phase,\" Capital Economics senior U.S. economist Michael Pearce said in a note to clients.Greg Daco, chief U.S. economist at Oxford Economics, had forecasted 600,000 jobs to be added last month, well below consensus expectations, and closer to the Bureau of Labor Statistics’ actual figures.“We’re entering the slower second phase of the economy, where job growth is going to be harder to come by, and where fiscal stimulus expiring and Congress still not decided on the next tranche of fiscal stimulus, there are real risks for the economy. Yes, the unemployment rate fell to 7.9%, below 8%, but it’s still near recessionary levels. The average of the past seven recessions is a peak of 8.1%, so still a very high unemployment rate. And this month, it declined because participation fell. People are leaving the labor force, not seeing the right opportunities today,” Daco told Yahoo Finance’s on “The First Trade” on Friday.The US economy regained another 661,000 non-farm payrolls in September and the unemployment rate ticked down to 7.9%. (David Foster/Yahoo Finance)Economists are laser-focused on permanent job losses, which surged by 345,000 to 3.8 million in the month of September, showing how difficult it is for displaced workers to jump back into the labor market.“Unfortunately, the labor market scars are becoming deeper and deeper. The longer people are out of a job, the more likely they will be permanently out of a job. I’m not a pessimist, but the glass is half empty. We still have a long ways to go to recuperate the jobs lost. Those that have been unemployed for more than 15 weeks are rising. The permanently unemployed individuals are also rising, and that is worrisome because we still have over 10 million jobs to recoup back to where we were back in February,” Daco said.The situation could be exacerbated by a lack of Congressional action to pass a new stimulus bill. The House passed a $2.2 trillion stimulus on Thursday, but a bipartisan deal that will clear the Senate looks unlikely.“The virus is in the driver's seat in controlling the speed of the recovery and right now the economy is in the slow lane unless Congress and the White House can settle their differences and provide additional stimulus to support those jobless Americans who have lost their paychecks and livelihoods and hope,” Rupkey said.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:A powerful source of job creation is on a record-breaking upswingEx-Facebook and Pinterest exec explains how tech addiction made him rethink his life’s workNetflix's Reed Hastings: ‘Thank God’ Blockbuster didn’t want to buy usWhat Silicon Valley still doesn't understand about its diversity problem"}]}