{"article": [{"url": "https://finance.yahoo.com/news/disney-lay-off-28-000-210820616.html", "published": 1601396180.0, "headline": "Disney to lay off about 28,000 parks unit employees due to coronavirus hit", "body": "By Lisa RichwineLOS ANGELES (Reuters) - Walt Disney Co <DIS.N> said on Tuesday it will lay off roughly 28,000 employees, mostly at its U.S. theme parks, where attendance has been crushed by the coronavirus pandemic, especially in California where Disneyland remains closed.About two-thirds of the laid-off employees will be part-time workers, the company said in a statement.Disney shut its theme parks worldwide when the novel coronavirus began spreading this year. All but Disneyland - nicknamed the Happiest Place on Earth - reopened, though the company was forced to limit the number of visitors to allow for physical distancing.\"We have made the very difficult decision to begin the process of reducing our workforce at our Parks, Experiences and Products segment at all levels,\" Josh D'Amaro, chairman of the parks unit, said in a statement.He cited the parks' limited capacity and uncertainty about the pandemic's duration, which he said was \"exacerbated in California by the state's unwillingness to lift restrictions that would allow Disneyland to reopen.\"In a letter to employees, D'Amaro called the move \"heartbreaking.\" He said management had tried to avoid layoffs by cutting expenses, suspending projects and streamlining operations. The company had continued to pay health benefits for furloughed workers since April.\"However, we simply cannot responsibly stay fully staffed while operating at such limited capacity,\" D'Amaro said.Walt Disney World in Florida had employed 77,000 full- and part-time workers before the pandemic, while Disneyland in California employed 32,000.Disney did not disclose how many other U.S. employees work in the parks unit, which includes consumer products, cruise lines and other businesses.Last week, Disney urged California officials to issue guidelines that would allow Disneyland to welcome visitors again.On Tuesday, Dr. Mark Ghaly, California's health secretary, said the state had taken a science-based approach to reopening that aimed to \"minimize the health and economic risks that would be caused by opening and shutting repeatedly.\"(Reporting by Lisa Richwine; Editing by David Gregorio and Stephen Coates)"}]}