{"article": [{"url": "https://finance.yahoo.com/news/scaramucci-trump-is-doubling-and-tripling-down-on-full-on-racism-202027080.html", "published": 1594049300.0, "headline": "Scaramucci: Trump is ‘doubling and tripling down on full-on racism’", "body": "President Trump’s 4th of July remarks at Mount Rushmore, South Dakota, drew sharp criticism for what some deemed to be “divisive.”In his speech, Trump accused those demanding change of trying to wipe away history and criticized the media for labeling their opponents as “racist.”SkyBridge Founder and former White House Communications Director Anthony Scaramucci blasted Trump’s rhetoric, calling his behavior “ridiculous.”Trump is “doubling and tripling down on full-on racism,” Scaramucci said on Yahoo Finance’s On the Move. “Just go read transcripts of the speeches he gave over the weekend. It’s literally as if Charles Lindbergh had a baby with Joe McCarthy and that baby was Donald Trump and grew up to become the president of the United States.”US President Donald Trump arrives for the Independence Day events at Mount Rushmore National Memorial in Keystone, South Dakota, July 3, 2020. (Photo by SAUL LOEB / AFP) (Photo by SAUL LOEB/AFP via Getty Images)Trump’s speech came at a time of heightened racial tensions across the country, with thousands of people marching in protests calling for criminal justice reform and an end to police brutality.“We will never allow an angry mob to tear down our statues, erase our history, indoctrinate our children, or trample on our freedoms,” Trump said in his speech. “We will safeguard our values, traditions, customs, and beliefs. We will teach our children to cherish and adore their country so that they can build its future. Together, we will fight for the American Dream, and we will defend, protect, and preserve American way of life, which began in 1492 when Columbus discovered America.”The message of the Republican PartyMuch of this is due to the sweeping social justice reform taking place across the U.S.Companies have changed their logos, sports teams like the Washington Redskins are seriously considering name changes, and monuments and flags dedicated to Confederate leaders are being removed.“In every age, there have always been those who seek to lie about the past in order to gain power in the present,” Trump said in his speech. “Those that are lying about our history, those who want us to be ashamed of who we are, are not interested in justice or in healing. Their goal is demolition. Our goal is not to destroy the greatest structure on Earth, what we have built: The United States of America.”Story continuesBut according to Scaramucci, this is not the direction that the Republican Party should be headed, despite most Republican politicians in office still supporting Trump.They name teams out of STRENGTH, not weakness, but now the Washington Redskins & Cleveland Indians, two fabled sports franchises, look like they are going to be changing their names in order to be politically correct. Indians, like Elizabeth Warren, must be very angry right now!— Donald J. Trump (@realDonaldTrump) July 6, 2020“What is the message of the Republican Party?” Scaramucci said. “What is the framework? Let’s say I landed from Mars and say ‘give me a pitch on these two parties. I’m going to join one of them.’ What is the message of the Republican Party today? It’s a very, very dark message.”Trump’s speech also singled out the media, a frequent target of his.“Let me also say a word to those in the media who falsely and consistently label their opponents as racists, who condemn patriotic citizens who offer a clear and truthful defense of American unity,” Trump said. “That’s what our people are doing. We want a clear and faithful defense of American history and we want unity.”US President Donald Trump applauds as he attends Independence Day events at Mount Rushmore in Keystone, South Dakota, July 3, 2020. (Photo by SAUL LOEB/AFP via Getty Images)His speech was met with applause and praise from some in the Republican Party, while Democrats sharply rebuked it.“This is the biggest schism in the Republican Party since the Gerry Ford/Ronald Reagan schism,” Scaramucci added. “We’ve got to defeat Donald Trump to rebirth that party and I hope I can be a part of that over the next four months.”‘A systemic danger to society’Part of Trump’s rhetoric could be due to the fact his polling numbers against his Democratic opponent Joe Biden have been decreasing over the last few months. Many have attributed it to his administration’s handling of the coronavirus pandemic.And although Trump had been trailing Hillary Clinton prior to his November victory, Scaramucci described it as “a very, very different situation this time.”“People are saying like Michael Dukakis, he could come back,” Scaramucci said. “It’s a potential catch-up situation for him. He did the same thing in the Access Hollywood situation. He was down 13% going into the last month of the election and won the election. I think this is very different. You have 3.5 years of data, you have 130,000 Americans dead from a mishandling of a pandemic. You’ll likely have over 200,000 people, if you look at the modeling, who will have died by November 3rd.”Democratic presidential candidate, former Vice President Joe Biden holds up a mask as he speaks during a campaign event in Wilmington, Delaware. (Photo by Alex Wong/Getty Images)Scaramucci, who has endorsed Biden, will be part of a group campaigning against Trump to explain why he is “a systemic danger to society.” But he still described the current president as “like a prize fighter.”“He's not somebody you're going to beat in a judge's score card,” Scaramucci said. “You have to knock him through the ropes into the first or second ring where people are sitting if you want to beat President Trump and that's something we have to work together to do.”“But if he wins again,” he continued, “it's not clear to me that's good for the markets. There will likely be more racial unrest, more social unrest. He's dividing the country. He's not a person that wants to unite the country. Just look at the rhetoric. He's a red tribal leader.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:QAnon: Why rabid pro-Trump conspiracy theories keep gaining steamA 'flaw' in Obamacare is costing some Americans thousands of dollars per yearPresident Trump doubles down on dismantling Obamacare amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}