{"article": [{"url": "https://finance.yahoo.com/news/retail-investors-have-seen-huge-pandemic-gains-as-sp-500-nears-prepandemic-high-200605591.html", "published": 1597158860.0, "headline": "Retail investors have seen huge gains as S&P 500 nears pre-pandemic high", "body": "In this photo illustration a Robinhood logo seen displayed on a smartphone. (Photo Illustration by Igor Golovniov/SOPA Images/LightRocket via Getty Images)The S&P 500 index (^GSPC) clocked an all-time high on Feb. 19, when it closed at 3,386. About a month later, the coronavirus crisis took the index hundreds of points down to 2,237.The Covid-19 pandemic still flares throughout the U.S. as the economy struggles with alarming unemployment levels, but somehow in mid-August, the index is a hair from its Feb. 19 high — 99.6% there as the market index hovers around 3,376.By and large, the pandemic has been awful for millions of workers who’ve lost their jobs and businesses that have had to close. But for people who own stocks, it’s been surprisingly good.Interestingly though, retail investors are the one group that piled into stocks when no one else wanted to touch them, as pandemic fears reached fever pitch.In the earlier days of the pandemic, retail inventors at Fidelity and Vanguard actually put money into the stock market, “buying the dip.”“During the last week of February and the first week of March, the majority of households trading moved money into equities rather than into fixed income (bonds and cash),” Vanguard’s Amy Lash told Yahoo Finance at the time. “More than 7 in 10 households trading moved into equities.”From then on, this trend continued amid the broader sell-off, and then into the market climb.In early June, Deutsche Bank strategist Parag Thatte looked at investor flows and positioning and found all investor groups – except for retail investors – had record low-exposure to the stock market. While the whole Robinhood boom seemed anecdotal, day traders and long-term investors alike had been buying the dip.More recent data from Thatte from late July indicated that new retail investors have continued to “ramp up exposure,” citing the number of accounts on Robinhood, via Robintrack data. One of the ways Deutsche Bank and other analysts at Goldman Sachs see this is by looking at big stocks retail investors love, versus other stocks.(Goldman Sachs)Robinhood users have jumped into tech and megacap stocks like Amazon.Story continues(Deutschebank)“Performance across sectors has been closely correlated with increases in retail exposure,” Thatte said.The trend seems to be somewhat international. In Australia, the Australian Financial Review reported that $9 billion of retail investor money had flowed into stocks as $11 billion of institutional money had flowed out.Retail investors winThere are a lot of ways to read this. One could be by saying pros made poorer decisions compared to retail investors, who may have succeeded in internalizing Warren Buffett aphorisms like “be greedy when others are fearful.”But it’s not clear that was the best decision even if it led to the better outcome — they could have simply gotten lucky. One thing is clear though: retail investors have won the rally so far.“Since we have had no serious drawdown then those who had acquired [the S&P 500 Index] below 2,900 would have done very well,” said Sean Darby, global equity strategist at Jefferies, who also studies investor flows.The retail investor craze has involved a lot of momentum trading and people deciding to buy what they know — specifically big stocks like Amazon (AMZN) and other megacap tech names. This, Darby added, means that the win might be even bigger than the index.“It needs to be remembered that they might have done even better than the index given that a handful of stocks have made very impressive gains,” he told Yahoo Finance.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Company matches are mostly surviving the coronavirusThere are two types of stocks on RobinhoodWhy you should consider deleting your stock trading appThe 2008 recession was far worse for young people's careers than previously thoughtBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey"}]}