{"article": [{"url": "https://finance.yahoo.com/news/the-600-boost-in-unemployment-benefits-expires-soon-what-comes-next-200832084.html", "published": 1594826180.0, "headline": "The $600 boost in unemployment benefits expires soon. What comes next?", "body": "At the end of the month, the enhanced unemployment benefits helping millions of Americans get through the coronavirus pandemic is set to expire – and lawmakers have yet to agree what to do about it.The $600 weekly supplement is going to be a key point of debate in negotiations over the next coronavirus relief package. House Democrats voted to extend the enhanced benefits through January, but Republicans and the Trump administration have been adamant that won’t happen.“This is really important. Imagine the uncertainty in households across America now,” said House Speaker Nancy Pelosi (D-CA) at a press conference on Wednesday.Republicans have argued against extending the extra $600-per-week increase because many are making more on unemployment insurance than they do at their job, which lawmakers say discourages people from returning to work.In a statement to Yahoo Finance, White House Deputy Press Secretary Judd Deere said maintaining the benefits at current levels “does not incentivize returning to work.”“UI reform is a priority for this White House in any phase 4 package and we are in ongoing discussions with the Hill,” said Deere.Democratic lawmakers say the boosted benefits are keeping Americans afloat and ending the benefits will push people into poverty. Economists have warned taking away enhanced benefits could hurt the economy. The cut-off for the enhanced benefits is July 31, but because of state payment schedules people will stop receiving the $600 boost after the 25th or 26th.‘I’d have to prioritize...maybe not pay my mortgage’ The extra $600 a week in benefits has been a lifeline to many workers, who are now worrying about what they’ll do without the money. “I'd have to prioritize and buy food and buy the things that I couldn't do without, and maybe not pay my mortgage for a couple of months,” said Teresa Ibarra, who has been furloughed since early May.Ibarra told Yahoo Finance she worked at a hospital in Memphis for 20 years before agreeing to take a furlough, thinking it would allow her to care for her son with special needs. But her time without work has lasted longer than she anticipated and getting her unemployment benefits was much harder than she expected.Story continuesTeresa Ibarra, a furloughed worker in Memphis, with her children.“This whole thing has just been a nightmare and I never thought I would be in this situation,” said Ibarra in an interview with Yahoo Finance.Ibarra initially received a few unemployment payments, but then she says they suddenly stopped. During the weeks without income, Ibarra applied for jobs and picked out which belongings she could sell for cash. It took weeks of phone calls to get the issues resolved.Diana Bernardo has had similar problems dealing with a system overwhelmed by tens of millions of unemployment claims. Bernardo told Yahoo Finance she was laid off in mid-March, just three weeks after starting her dream job at a New Jersey hotel. Bernardo said it took about eight weeks for her to receive her unemployment payments.“It was really a blow to me mentally, emotionally as well as obviously, financially,” said Bernardo.Bernardo acknowledges she’s luckier than many, since her husband still has a job – though her family still had to cut back on expenses and postpone paying some bills while waiting for her benefits to come through.Lawmakers have floated several proposals to help workers after the $600 boost expires, but they’re still at odds about how to move forward. Treasury Secretary Steven Mnuchin said last week he wanted the unemployment insurance capped at 100% of a worker’s usual pay.American Workforce Rescue Act Sen. Ron Wyden (D-OR) – the top Democratic senator on the Finance Committee – told Yahoo Finance he’ll “pull out all the stops” to keep the enhanced benefits in place.“This is not a question of Americans getting $600 a week and spending it on luxuries. These are people who are paying for groceries, they're paying for rent. They are very often at the lowest end of the economic ladder,” Wyden said.Senate Democratic Leader Chuck Schumer (D-NY) and Sen. Ron Wyden (D-OR) have introduced the American Workforce Rescue Act.Senate Democratic Leader Chuck Schumer and Wyden have introduced the American Workforce Rescue Act. The bill would tie the enhanced benefits to states’ unemployment rates. The extra $600 a week would remain in place until the state’s unemployment rate drops below 11%. The weekly benefit would continue to drop by $100 for every percentage point decrease in the unemployment rate.“We've had thousands and thousands of more [coronavirus] cases just in the last few days,” said Wyden in an interview with Yahoo Finance. “Nobody knows what is coming, but this ties the benefit to the conditions on the ground.”Return-to-work bonus Some Republicans are advocating for a return-to-work bonus as a way to incentivize people to get back to work.“The bottom 20% of wage earners, they're making more than twice as much by being on unemployment rather than going back to work,” said Sen. Rob Portman (R-OH) “That's made it tough for some small businesses in particular, to get people to come back.”Portman has suggested a $450 weekly bonus for six weeks after a worker returns to their job.“It helps everybody. It certainly helps the taxpayer because people are off unemployment insurance and onto payrolls,” said Portman. “It helps these small businesses that are desperate now to get workers back... Finally, it’s good for workers because it gives workers the chance to reconnect with their business.”Portman said reconnecting a worker with their employer would also potentially restore their access to health insurance, retirement savings and job training. House Republicans have also proposed a version of a rehiring bonus, but Democratic lawmakers argue a return-to-work bonus won’t help the millions of people who cannot find jobs.A Yahoo Finance-Harris poll found the majority of Americans support the idea of a return-to-work bonus, and would be more likely to go back to work if they got a bonus for doing so.Bernardo said the idea is great for people who have a job to return to, but she doesn’t think it would help workers in hard-hit industries like hers.“It’s just so uncertain right now. I don't know that there are any job prospects. I know a lot of hotels are suffering,” she said.Portman told Yahoo Finance he’d “absolutely” consider a compromise — possibly an enhanced benefit less than $600, in addition to a return-to-work bonus.A waitress takes a food order from the kitchen at Slater's 50/50 Wednesday, July 1, 2020, in Santa Clarita, Calif. California Gov. Gavin Newsom has ordered a three-week closure of bars, indoor dining and indoor operations of several other types of businesses in various counties, including Los Angeles, as the state deals with increasing coronavirus cases and hospitalizations. (AP Photo/Marcio Jose Sanchez)“How do we, as a country, deal with an unprecedented pandemic — we've never had this before — and how do we in a creative way, provide an incentive for people to go back to work safely,” said Portman. “Safely is key here.”Paycheck Security Act Sen. Mark Warner (D-VA) acknowledges the concerns about the extra $600 – but defends the program, saying it kept millions of people out of poverty.“I don't think we should just arbitrarily end it. I think we have to have some glide path or something that comes after,” he said in an interview with Yahoo Finance.Warner has proposed the Paycheck Security Act with Sen. Bernie Sanders (I-VT), Sen. Richard Blumenthal (D-CT) and Sen. Doug Jones (D-AL).Under their plan, the government would cover the cost of furloughed or laid off workers’ salaries and benefits up to $90,000 if a business had at least a 15% drop in revenue year-over-year. Some businesses would also get help with overhead expenses like mortgages, rent and utilities while some of the smallest businesses could get help paying for salaries of employees who are still working.Warner said his plan could help fill the gaps left by prior relief initiatives, like the Paycheck Protection Program and Main Street lending facility.“I think they've prevented a total economic meltdown, but as we now take a breath and see the resurgence of the virus and recognize, you know, the idea of a V-shaped recovery is probably out the window. How do we think about what the next step of assistance ought to look like?,” said Warner.Sen. Mark Warner (D-VA), Sen. Bernie Sanders (I-VT), Sen. Richard Blumenthal (D-CT) and Sen. Dough Jones (D-AL) have introduced the Paycheck Security Act.The paychecks for displaced workers would come with conditions. Businesses receiving the funds could not buy back stocks or pay out dividends. The businesses would also have to protect collective bargaining agreements, remain neutral in union organizing efforts and cap CEO pay at 50 times the median worker wage.“I think it's really important that in the next stage of what we do, we focus on those businesses who've really seen economic loss,” said Warner.As lawmakers debate the future relief efforts, Bernardo and Ibarra both urged them to remember $600 is more than a number in a political debate.“There are people in need who, you know, depend on that,” said Bernardo. Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Most Americans would not sue over COVID-19 exposure: pollMajority of Americans think Congress should extend enhanced unemployment benefits past July: pollCoronavirus response: What Washington has accomplished and what's nextCongressional watchdog finds 'significant risk' for fraud in Paycheck Protection ProgramBusiness leaders, tech CEOs bash Trump's visa suspension"}]}