{"article": [{"url": "https://finance.yahoo.com/news/global-sneaker-resale-market-could-reach-30-billion-by-2030-cowen-191003371.html", "published": 1595341100.0, "headline": "The global sneaker resale market could reach $30 billion by 2030", "body": "A little over a year has passed since Cowen Equity Research classified sneakers as an emerging alternative asset class. Since then, sneakers have not only emerged, but the market itself shows no signs of slowing. Cowen analysts believe that the sneaker resale market could potentially reach $30 billion by 2030.\"With a growing base of passionate investors, a growing source of supply and authentication, sneakers: 1) earns illiquidity premiums; 2) provides diversification - non-correlated with traditional asset classes; and 3) earns favorable risk-reward characteristics,\" the analysts wrote in a research note.In 2019, Cowen estimated that the total global sneaker market stood at $100 billion. The U.S. primary sneakers market — or the market for new sneakers — was worth more than $21 billion. The global and U.S. resale market stood at $6 and $2 billion, respectively.John Kernan, an analyst at Cowen, tells Yahoo Finance that the sneaker resale market accelerated during the COVID-19 pandemic.\"I think the sneakerheads got more involved as COVID-19 picked up,” he said. “There are new customers out there. They're acquiring new consumers. They've never done this before either. So I don't think it's a fad. I think when you're talking to price points that these things are going for this, isn't a fad. Fads are cheap fashion-driven or trend-driven things. Fads aren't $500 items.\"Kareem Kowatoli of Orlando (L) and Tarek Kowataoli purchase a pair of sneakers for $1470 to resell during SneakerCon 2019 at Fort Lauderdale Convention Center on February 2, 2019 in Fort Lauderdale, Florida. (Photo by Sean Drakes/Getty Images)Kernan speaks of some of the highly coveted sneaker models, such as the Jordan 1 Retro High Travis Scott, which routinely goes for more than $500 on the secondary market.Sneaker resale is creating new markets and services such as online marketplaces such as StockX and GOAT. Cowen argues the resale game is also benefiting from network effects while further highlighting the durability of Nike (NKE) and subsidiary Jordan Brand.Kernan tells Yahoo Finance that Nike is \"feeding the beast\" when it comes to the secondary sneaker market. Kanye West led Yeezy brand continues to be a strong performer for Adidas (ADDYY).Story continuesTravis Scott Air Jordan I High OG — NIKEBoth resale and the primary markets are thriving off the shift to digital channels. The analysts believe Nike, Adidas, and others will generate faster growth as units shift to directly sold on its channels. They estimate that E-commerce could account for 31% of the swoosh brands sales by FY2024 and 54% by FY2030.Despite at times seeming like a two-horse race between Nike and Adidas, the market is showing that other brands can come in and make some noise. Kernan says that New Balance is starting to get more value as a brand, which shows that sneakerheads will respond to a brand that is not Nike/Jordan or Yeezy.Kernan points out that an expanded consumer base and well-managed supply have been among the catalysts for growth within the sneaker industry and resale market.\"There are more sneakerheads this time of the year than there were last year,” he said. “New customers are coming into the marketplaces. The supply has been managed well by the brands, so the price points have stayed hot. There's a lot of limited-edition drops. Nike, Adidas, and Jordan have done a great job with their launch cadences and keeping excitement in the market.\"Nike SB Dunk Low Grateful Dead — NIKEOne example of this is the upcoming Nike SB Dunk Low Grateful Dead that is adorned with the legendary groups famed dancing bears and psychedelic colors. Since drops like these are released in limited quantities, they are not a big moneymaker for Nike. However, they keep brand excitement at an all-time high.\"Their biggest challenge is to watch the supply and demand. If you screw up and oversupply the market, I think your average sneakerhead doesn't think that shoe is cool because it's promoted.\"Reggie Wade is a writer for Yahoo Finance. Follow him on Twitter at @ReggieWade.Read more:Nike responds to George Floyd attack: Don't do it — 'Don't turn your back on racism'Nike sells out of Kobe Bryant kicks and merchandiseNike exec explains why the company broke up with AmazonAlmost half of teachers work a second job: survey96% of teachers personally pay for students' supplies: SurveyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}