{"article": [{"url": "https://finance.yahoo.com/news/donald-trump-as-president-would-be-better-than-joe-biden-for-the-stock-market-strategist-162353459.html", "published": 1592220680.0, "headline": "Donald Trump as president would be better than Joe Biden for the stock market: strategist", "body": "With 141 days until the presidential election, Wall Street strategists are starting to weigh in on who would be better for investors: the socially divisive President Donald Trump and his favorable corporate tax policies or a consoler in chief in Joe Biden with his likely higher tax structures.Veteran strategist Frances Newton Stacy is the latest to toss her hat into the smoldering debate.“From a stock market perspective, President Trump would be better,” Stacy, who is director of strategy at Optimal Capital, said on Yahoo Finance’s The First Trade. “The reason I think — well not withstanding the last election — but I think Biden has already come out with talk about raising taxes pretty dramatically to compensate for the debt we’ve had recently. And I think that market participants are looking for lower taxes. I know Trump has floated ideas for asking for a tax cut.”Biden has been on the complete other side of the tax spectrum, much to the worry of market bulls.The former vice president has proposed reversing half of the president’s tax cut, lifting the statutory rate to 28%. Credit Suisse estimates this change would increase the effective tax rate by 4% to 5%, and cut $9 off estimated S&P 500 earnings per share. Meantime, Goldman Sachs has projected that Biden’s tax plan would lead it to reduce its 2021 earnings estimate by 12%.FILE - In this combination of file photos, former Vice President Joe Biden speaks in Wilmington, Del., on March 12, 2020, left, and President Donald Trump speaks at the White House in Washington on April 5, 2020. The November presidential election is six months away. (AP Photo, File)Added Stacy, “I think the market also appreciates a Trump economy more. And I think Trump will push the reopening [of economies] much more aggressively and Biden will be more cautious, and that affects markets.”At least at the moment, however, thoughts of a heated presidential election are playing backseat to the here and now. That here and now includes a market that has oddly rallied 45% off the March lows despite record job loss due to the COVID-19 pandemic. But the optimism has begun to wear thin with COVID-19 cases starting to spike again in key states as economies open back up.The S&P 500 tanked 5.9% on June 11 in a bruising selloff on Wall Street. Fear of a deeper correct has persisted into the start of trading this week.Story continues“A record run, over-the-top excitement from small traders, the Nasdaq at 10,000, historically high multiples, and seasonality all could be a factor in why a pullback here could be perfectly normal,” wrote strategists at LPL Financial. “In fact, if you are bullish, after a 45% rally, one of the best things would be for prices to reset some here over the coming months. We would be a buyer of weakness and use it as an opportunity for longer-term price appreciation.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Coca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}