{"article": [{"url": "https://finance.yahoo.com/news/fed-fomc-monetary-policy-decision-september-2020-202156952.html", "published": 1600183760.0, "headline": "FOMC Preview: Lack of fiscal stimulus casts shadow over Fed", "body": "The U.S. economy needs all the help it can get in this recovery, but the Federal Reserve has expressed frustration at the inability of Capitol Hill and the White House to do more.When Fed Chairman Jay Powell fields questions at the conclusion of the Federal Open Market Committee’s meeting on Wednesday, will he show signs of fatigue in asking for more fiscal support? Or will he push harder for more help?Powell’s tone could offer clues into the Fed’s next steps.“The Fed can’t generate demand,” ING’s James Knightley wrote September 12. “For that we will need to see additional fiscal stimulus, but that is looking only a remote possibility ahead of the November 3rd elections.”Last week, Senate Majority Leader Mitch McConnell said the possibility of getting a deal done “doesn’t look that good right now.”Almost six months have lapsed with no follow-up to the $2 trillion Coronavirus Aid, Relief, and Economic Security Act. CARES Act provisions like bonus unemployment insurance appear to have helped Americans stay afloat during the COVID-19 crisis, but critical portions of the support have since expired.Federal Reserve Chairman Jerome Powell, wearing a face mask, testifies before the House of Representatives Financial Services Committee. (Photo Credit: Tasos Katopodis/Pool via REUTERS)The labor market began its recovery in May, but rising case counts in the late summer have slowed the rebound. As of August, the number of U.S. nonfarm payrolls remained 11.5 million jobs below pre-pandemic levels and the unemployment rate still at an elevated 8.4%.The Fed is already backed up to near-zero interest rates and has no intention to dip into negative territory. The central bank has relied heavily on its armory of liquidity facilities to keep liquidity flowing in markets ranging from corporate debt to municipal bonds.Of course, the Fed has hinted it still has some tricks up its sleeve, such as more actively strategizing its asset purchases under quantitative easing. But Morgan Stanley wrote Sept. 15 that the Fed is playing a “waiting game” with a potential relief package.“On the immediate horizon is the risk of no further support from Congress, something we expect Chair Powell to spend time on in the press conference,” said Morgan Stanley’s economics and global macro team.Story continues‘Very significant downside risk’ of no fiscal actionNearly all members of the Federal Open Market Committee have made public remarks since the Fed’s last policy-setting meeting on July 29. Underscoring their concern over the lack of fiscal relief, the 16 officials emphasized the importance of more support.Here’s what they said:Fed Chairman Jerome Powell: “The people who worked in those service jobs, particularly the entry-level, lower paid workers, they're the ones who are most vulnerable. And those are the ones who we really need to look out for both through Fed policy, which will be there to support the economy — but also through fiscal policy.” (NPR interview, September 4)Fed Vice Chairman Richard Clarida: “Fiscal policy is really an input to the way that we think about policy.” (Remarks at Peterson Institute, August 31)Fed Vice Chairman Randal Quarles: No public remarks.Fed Governor Lael Brainard: “It is very important to many households and businesses to have continued fiscal support — just as it was important to them in the early phase of this crisis.” (Remarks at Brookings Institution, September 1)Fed Governor Michelle Bowman: “Timely and supportive fiscal and monetary policy measures also have helped, but with the progress of the recovery still tentative, I expect that many businesses will continue to fight for survival in the months ahead, with the support of their lenders and communities. (Remarks at Kansas Bankers Association, August 26)Boston Fed President Eric Rosengren: “We’re still in a position where we could use significant fiscal policy until the pandemic’s under control.” (Marketplace interview, August 18)New York Fed President John Williams: “Getting money into households’ pockets, allowing families to keep putting food on their tables, pay the rent, the [Paycheck Protection Program], and other efforts have been hugely helpful through the last several months to minimize some of the economic consequences of the pandemic.” (Remarks at Bretton Woods Committee, September 2)Philadelphia Fed President Patrick Harker: “It’s all hands on deck. I think it's not just Congress, it’s also states and also local governments.” (Fox Business interview, August 28)Cleveland Fed President Loretta Mester: “I also think we're going to need more fiscal policy to support households and businesses, as we get through the reopening phase into a more sustainable recovery.” (Yahoo Finance interview, August 28)Richmond Fed President Thomas Barkin: “Quickly pulling away the support that consumers and businesses are receiving would be a pretty traumatic move for what’s happening in the economy.” (Remarks at Northern Virginia Chamber of Commerce, August 3)Atlanta Fed President Raphael Bostic: “The fiscal side, you know, the policies were designed a little differently, and they really did time-bound it...For me, I talk to businesses. I talk to folks out in the community. There is still need out there.” (WSJ interview, September 3)Chicago Fed President Charles Evans: “Partisan politics threatens to endanger additional fiscal relief. A lack of action or an inadequate one presents a very significant downside risk to the economy today.” (Remarks at Lakeshore Chamber of Commerce, September 3)St. Louis Fed President Jim Bullard: “The increased persistence of the disease means that the key fiscal policy keeping businesses and people whole has to be continued longer than would have been initially thought.” (Remarks at St. Louis Fed’s Memphis branch, August 3)Minneapolis Fed President Neel Kashkari: “Congress should use this opportunity to support the American people and the American economy.” (CBS interview, August 2)Kansas City Fed President Esther George: “It has really taken both: both the actions of the Federal Reserve as well as fiscal policy. That has been critical to how households and businesses have been able to survive during this period.” (Yahoo Finance interview, August 25)Dallas Fed President Robert Kaplan: “It’s still my view that in some form we’ll get an extension of unemployment benefits and so I’m quite hopeful that will continue, but if it did not you would see a further weakening in the economy.” (Bloomberg interview, August 3)San Francisco Fed President Mary Daly: “We have to build a bridge to help shore people up so that when we emerge from the crisis, we are well-prepared to continue to grow.” (Remarks at Harvard Kennedy School, September 2)Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Americans are again growing concerned about losing their jobs: NY FedLower-for-longer rates from the Fed point to a weaker-for-longer dollarSenate GOP sends mixed messages on need for Federal Reserve emergency loansFed Chair Powell: Wearing masks can lead to 'enormous' economic gainsA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}