{"article": [{"url": "https://finance.yahoo.com/news/apple-ubs-analyst-neutral-160626148.html", "published": 1600859660.0, "headline": "Apple analyst explains why the stock is not a ‘buy’", "body": "Apple’s (AAPL) valuation already reflects a strong upcoming iPhone 12 cycle and its Services growth should decelerate in the next three years, predicts UBS analyst David Vogt.“At its core, Apple is a ‘product’ company with roughly 80% of revenue derived from smartphones, personal computers, tablets, and wearables,” Vogt said in a note to clients. “Following a one-time COVID driven bump in Macs/iPads and a one year iPhone 12 cycle, in FY21, ‘product’ revenue should revert back to low-single digit growth over the next three years.”Vogt has a Neutral rating on the stock. Shares of the iPhone maker were down about 1% during Wednesday’s midday trading.5G cycle priced inThere’s been much anticipation ahead of the launch of next generation iPhones. But they hype may already be priced into the stock.“While shares of Apple typically outperform the market in the months leading to an iPhone launch, subsequent to the launch, shares have historically underperformed the market,” wrote Vogt. “We think Apple shares already reflect the growth from the ‘5G cycle.’“Vogt acknowledges that Apple’s services revenue have been robust.“However, Services revenue tied to new iPhone sales and the rolling installed base of iPhone units should materially decelerate,” he warned. “Services revenue should grow just at an 11% compound annual growth rate the next three years, a material deceleration from 17% the prior three years.”18th September 2020 Wearing the New Apple Watch Series 6Services re-accerlation is ‘critical to drive upside to estimates’Vogt has a price target of $115 on the stock.“Over the past six months, Apple's valuation expanded materially to 29x in anticipation of a 5G ‘super cycle,’” he wrote. “Our intrinsic analysis supports a 27 multiple, roughly 1 standard deviation above its trailing one year average multiple.”Services re-acceleration is “critical to drive upside to estimates,” he added.“If several of Apple's under monetized Services live TV+, and News mature and contribute to a segment revenue reacceleration back to 17% growth the next three year FY23, consolidated revenue could come in $13 billion higher than our forecast,” he added.Story continuesEarlier this month the tech giant debuted its Apple watch 6 series. That same day it announced customers will be able to bundle services under an Apple One offering, along with a new fitness app called fitness+.At the end of July, the company crushed its 3rd quarter earnings estimates and announced a 4-for-1 stock split. The stock began trading on a split adjusted basis on August 31st.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreWhy Tesla shares are tanking todayTesla analyst is bullish on what the company is doing with its high-priced stock, raises price target to $550Apple analyst says record-breaking share price rally is about 'MOMO' not 'FOMO'Tesla shares surge 12% on day of stock split"}]}