{"article": [{"url": "https://finance.yahoo.com/news/senate-panel-advances-trump-nominees-shelton-waller-for-spots-at-fed-190001768.html", "published": 1595340500.0, "headline": "Senate panel advances Trump nominees Shelton, Waller for spots at Fed", "body": "The Trump administration is one step closer to filling the two remaining board vacancies at the Federal Reserve.On Tuesday, the Senate Banking Committee cleared St. Louis Fed economist Christopher Waller and former Trump transition team adviser Judy Shelton in a party line vote.Shelton advanced on a 13-12 vote, splitting the committee along party lines. Waller advanced on an 18-7 vote, earning the support of a few Democrats.Both nominees will now advance to a full Senate floor vote, where they will need to secure a majority of support in order to earn full confirmation.Although Waller appears to have little history of political ties, Shelton’s nomination has been fraught with criticism as Democrats attacked her flip-flopping on key issues like interest rates and whether or not to reinstate the gold standard.Shelton, who recently served as the U.S. executive director of the European Bank for Reconstruction and Development, had caught attention for her unconventional views advocating for a more “rules-based” approach to monetary policy anchored by gold.But when she faced the Senate for her nomination hearing in February, she backtracked.“I would not advocate going back to a prior historical monetary arrangement,” Shelton told the Senate Banking Committee February 13.Judy Shelton and Christopher Waller, nominees to be members of the Board of Governors of the Federal Reserve System, testify during the Senate Banking, Housing, and Urban Affairs Committee confirmation hearing in Dirksen Building on Thursday, February 13, 2020. (Photo By Tom Williams/CQ-Roll Call, Inc via Getty Images)The committee’s chairman, Idaho Republican Mike Crapo, said Tuesday that he has “no doubt” that Shelton will respect the Federal Reserve’s independence. The panel’s top Democrat, Ohio’s Sherrod Brown, described Shelton as a “threat to our economy,” attributing her uneven record on economic policy.The full Senate vote could be close for Shelton, as the Republicans only hold a slim 53-47 majority. Bloomberg has reported that Utah Republican Mitt Romney has not committed to supporting Shelton’s nomination, meaning that the GOP can only afford to lose two more votes assuming Romney and all Democrats and Independents vote against her.No full vote is scheduled yet.Story continuesBrian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Yahoo U: What are SPACs?Fed expands Main Street loan program to nonprofitsEXCLUSIVE: NY Fed's Williams: 'Not the time to think' about rate hikesBig US banks unwilling to call the economic bottom yetA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}