{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-walmart-just-raised-a-flag-to-bumbling-lawmakers-114133502.html", "published": 1597733360.0, "headline": "Coronavirus stimulus: Walmart just raised a red flag to bumbling lawmakers", "body": "After a blowout second quarter, Walmart (WMT) is throwing up a red flag to bumbling lawmakers in D.C. that can’t agree on the next round of fiscal stimulus for U.S. households ailing because of the COVID-19 pandemic.“Q2 sales started strong, both in-store and online, particularly in general merchandise, helped by government stimulus spending. Grocery sales had another strong quarter. As stimulus funds tapered off, sales started to normalize, but July comps still grew more than 4%,” Walmart pointed out in a presentation Tuesday detailing its latest earnings report. The company was referencing the trends in its bread and butter U.S. business.[Walmart reported better-than-expected second quarter results Tuesday.]Suffice it to say, a 4% U.S. same-store sales gain for Walmart U.S. is a step-down from what the company saw in the second quarter as consumers used stimulus checks to indulge on general merchandise. Meantime, the unemployment top up of $600 helped underpin strong growth in Walmart’s grocery business.Walmart shares are overlooking the mild warning that without a fresh infusion of stimulus for consumers, the retailer’s sales could come back down to Earth in the fall and during the holidays. Shares of the Dow component rose 6% in pre-market trading.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}