{"article": [{"url": "https://finance.yahoo.com/news/travel-has-changed-forever-airbnb-ceo-brian-chesky-113558494.html", "published": 1595400200.0, "headline": "'Travel has changed forever': Airbnb CEO Brian Chesky", "body": "Billionaire Airbnb Co-founder and CEO Brian Chesky told Yahoo Finance that the coronavirus outbreak has permanently altered travel preferences across the globe in ways that will shape the hospitality industry going forward.“Travel has changed forever,” says Chesky, whose company suffered hundreds of millions in losses and laid off a quarter of its staff in the aftermath of the outbreak. “The world of travel as we knew it in January is never coming back.”“I feel very confident about that,” he tells Yahoo Finance Editor-in-Chief Andy Serwer during a special All Markets Summit Extra: Road to Recovery on Tuesday.Zoom meetings have largely replaced business travel, and leisure trips have shifted away from metropolitan areas toward easily accessible rural locations, he said.“People are saying they do want to get out of the house, regardless what country they're in,” Chesky says. “But they aren't right now super comfortable getting on airplanes. They want to get in cars, and they want to travel not more than 300 miles away or 200 miles, a tank of gas.”The website of Airbnb on April 20, 2020 in Katwijk, Netherlands. (Photo by Yuriko Nakao/Getty Images)“A whole bunch of people who thought they had to get on an airplane and go to a city and stay in a central district realize, well, there are 400 national parks in the United States, and I live near one and maybe I should go see a natural park,” he adds. “Suddenly, you can't like undo all this knowledge.”The pandemic upended Airbnb’s main business of temporary rental homes but in recent weeks demand has returned to the same level as last year, even amid different vacation preferences from travelers, he says.“They're looking to stay in homes. So that has been a surprise to us,” he adds, in the newly released interview, taped last Wednesday.“We spent 12 years building our business and within six weeks lost about 80% of it,” he says. “Now, a whole bunch of things are happening.”Last week, Chesky sent a memo to employees saying that the privately owned company has resumed steps to go public this year but the decision will ultimately be determined by market conditions.Story continuesYahoo Finance holds a special \"All Markets Summit Extra: Road to Recovery\" from 5 to 6:30 pm on Tuesday. Chesky recounted his tumultuous experience in March, when the spread of the pandemic became widely known and demand for Airbnb plummeted.“We started the company over a decade ago, and I thought that was the craziest experience in my professional life,” he says. “For many years, I said, ‘I'll probably never experience something as crazy as starting Airbnb.’ And in March, I think we experienced that.”“It just felt like you're on a ship and you just get sideswiped,” he adds. “It felt like everything was breaking at once.”Read more:Anthony Scaramucci, Jerome Adams, top CEOs offer clarity amid crisisBusiness leaders fear 'flaming on social media' if they criticize Trump: Fast Company Editor-in-ChiefMichael Dell: ‘Not enough’ progress on diversity in the tech industry‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}