{"article": [{"url": "https://finance.yahoo.com/news/big-us-banks-unwilling-to-call-the-economic-bottom-yet-220552720.html", "published": 1594746800.0, "headline": "Big US banks unwilling to call the economic bottom yet", "body": "The largest U.S. banks are cautioning that the economy is not out of the woods yet, warning in earnings calls that there is still the possibility that loan losses could escalate even further.“I don't think anybody should leave any bank earnings call this quarter simply feeling like the worst is absolutely behind us and it's a rosy path ahead,” Citigroup CEO Michael Corbat told analysts Tuesday morning.In earnings reports covering the three months ended June 30, Citigroup (C), JPMorgan Chase (JPM), and Wells Fargo (WFC), the megabanks revealed massive buildups of their provisions for loan losses.The three large banks now have a total of $81.2 billion set aside as a buffer to bear the brunt of any consumer and corporate loans that can’t be paid back. Over a quarter of that reserve ($22.9 billion) was added just over the last quarter, illustrating the increasingly pessimistic expectations for the volume of loans that will become non-performing.Bank of America (BAC), which rounds out the big four U.S. banks, will report its earnings before the market bell on Thursday.At the nation’s largest bank, executives cautioned that their credit models still face uncertainty around the path of the virus and the lack of clarity on further government stimulus.“We've put more meaningful weight on the downside scenario this quarter,” JPMorgan Chase CFO Jennifer Piepszak said. “And so therefore, we're prepared and have reserved for something worse than the base case.”JPMorgan Chase has already seen the ratio of nonperforming loans relative to total loans rise by 31 basis points year-over-year to 0.82%.But Wells Fargo CFO John Shrewsberry told reporters Tuesday that the amount of delinquent or non-performing assets for the current quarter may be understating the fact that many lenders have offered temporary deferrals on loan payments.“It’ll be two or three quarters out before they hit their cyclical high points,” Shrewsberry said.Murky outlookStory continuesThe main question: did the big banks set aside too much or too little in reserves?An accounting change known as Current Expected Credit Losses (CECL) may give reason to interpreting the reserve figures as more conservative. The large banks had been phasing in the new CECL standards well before COVID-19, which broadly requires banks to recognize expected losses as an allowance.“Given CECL covers the life of the loan, if our assumptions are realized, we wouldn't expect meaningful additional reserve builds going forward,” JPMorgan Chase’s Piepszak told analysts.But RBC Capital Markets analyst Gerard Cassidy told Yahoo Finance Tuesday that “in all candor, none of [the banks] really know” if their provisions will be enough. Predicting the path of the virus is getting more difficult as pockets of the country continue to face difficulty in controlling the spread of COVID-19.“That’s why the stocks trade the way they do: super cheap relative to the market on a price to book value basis,” Cassidy said. “But everybody’s just uncertain on what the outlook is going to be on the banks over the next six months.”If the economy can bounce back quickly, the banks will be able to breathe easily knowing that it over-provisioned the damage to its loan portfolios. But if a lack of control forces more shutdowns, business closures, and layoffs, then it may need more buffer.JPMorgan’s Jamie Dimon is prepared for the worse.“It's just going to be murky,” Dimon said Tuesday.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Bank analysts warn of 'confusing, sloppy, and shocking' earnings as COVID-19 extends gripBlack-owned small businesses continue to face harsh cash crunchOECD adds risk of COVID-19 'double-hit' in bleak economic forecastsFed Chair Powell warns of economic fallout from a 'second outbreak'A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}