{"article": [{"url": "https://finance.yahoo.com/news/activision-blizzard-q2-earnings-2020-200550563.html", "published": 1596554060.0, "headline": "Activision Blizzard earnings blow away expectations as gamers play through pandemic", "body": "Activision Blizzard's 'Call of Duty: Warzone' is a powerhouse that continues to perform for the gaming giant. (Image: Activision Blizzard)Video game behemoth Activision Blizzard (ATVI) reported second quarter earnings Tuesday that smashed Wall Street expectations on revenue, and raised its full year 2020 guidance.Here are the most important numbers from the report compared with analysts’ expectations as compiled by Bloomberg:Revenue: $1.93 billion versus $1.69 billion expected.Earnings per share: $0.75 versus $0.59 expected.Activision Blizzard significantly revised its forward-looking upwards, from $6.8 billion to $7.3 billion. Gaming has seen a massive boost in engagement and revenue due to lock-down orders put in place as a result of the ongoing coronavirus pandemic.Blizzard’s “World of Warcraft,” which is now nearly 16 years old, saw engagement and reach increase sequentially for the quarter, while “Overwatch”, which launched in 2016, saw a year-over-year increase in engagement.Then there is the Activision Blizzard’s King mobile business, which saw year-over-year increases in monthly active users for its “Candy Crush” franchise and, surprisingly given the current economic climate, a year-over-year increase in advertising net bookings. The company, however, noted a slowdown in engagement for its mobile games in the latter half of the quarter.In terms of platform performance, console sales revenue was highest for the company at $655 million for the quarter, followed by mobile revenue, which came in at $622 million. PC revenue was $482 million, with revenue from the firm’s distribution business and esports leagues topping out at $173 million.Take-Two Interactive (TTWO), which reported its earnings on Monday, saw a 54% increase in revenue, hitting a record $831.3 million for fiscal Q1 2020 period. Meanwhile, Microsoft (MSFT) reported that its Xbox business saw a massive 64% year-over-year jump in revenue, with Xbox hardware revenue up 49%.That’s especially surprising given the fact that Microsoft is launching a new console — the Xbox Series X — later this year. It would normally mean flat or declining revenue for current-generation consoles like the Xbox One.Story continues'World of Warcraft' has also seen a sequential increase in engagement. (Image: Activision Blizzard)Standouts for Activision Blizzard included its wildly popular “Call of Duty: Warzone,” a free-to-play game available on the PlayStation 4, Xbox One, and PC; “World of Warcraft,” a massively-multiplayer role playing game for PC; and the smartphone game “Candy Crush.”The company said “Call of Duty: Warzone” has reached 75 million players to-date, and that “Warzone” players were also upgrading the free-to-play title to the full version of “Call of Duty Modern Warfare.”Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Microsoft’s Xbox Game Pass Ultimate gets Project xCloud cloud gaming on Sept. 15 for $14.99 per monthMicrosoft and TikTok need each otherDocuments reveal the behind-the-scenes battle between Apple and Spotify that lead to an antitrust investigationApple confirms next iPhone will be delayed “a few weeks”Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}