{"article": [{"url": "https://finance.yahoo.com/news/disneys-30-mulan-plan-will-be-litmus-test-for-entire-film-industry-102236194.html", "published": 1596691820.0, "headline": "Disney's $30 'Mulan' plan will be litmus test for entire film industry", "body": "After multiple delays of the theatrical release of its live-action “Mulan” movie sparked widespread debate over whether Disney would put the movie straight onto its Disney+ service, we finally have an answer: Yes.On the company’s Q3 earnings call on Tuesday, Disney announced “Mulan” will forego a glitzy theatrical release entirely and hit Disney+ on Sept. 4 for a $29.99 fee—that’s on top of the $6.99 per month Disney+ subscription fee. Existing Disney+ subscribers will have to pay $29.99 to watch “Mulan,” but it’s a digital purchase, not a rental; the movie will live in their Disney+ library for repeated viewings.The steep $30 fee raised eyebrows at first, but Universal had enormous success in April when it released “Trolls World Tour” as a $20 digital rental, raking more in rental fees in three weeks than the first “Trolls” movie made in theaters in five months. Viewers willingly paid $20 for a one-time rental; “Mulan” is $10 pricier, but it’s a purchase. And Disney will still put “Mulan” in some theaters in markets where Disney+ has not launched (think China).Disney CEO Bob Chapek was careful to caution on the earnings call, “We’re looking at ‘Mulan’ as a one-off as opposed to saying that there’s some new business windowing model we’re looking at.”That specific comment is a direct appeal to movie theater operators like AMC, which were furious after what Universal did with “Trolls World Tour.” (AMC threatened not to show Universal movies in the future.)But the “Mulan” plan is only a “one-off” until it isn’t. If it works, Disney could do it again—maybe almost immediately, with the Marvel movie “Black Widow,” which has also been delayed until November theatrical release and could end up as a Disney+ rental. Disney dominated the 2019 box office thanks to Marvel movies, including “Avengers: Endgame,” which leapfrogged “Avatar” as the highest-grossing box office movie ever. “Black Widow” tells the origin story of Scarlett Johansson’s character Natasha Romanoff, a member of the Avengers.Story continuesAnd Julia Alexander of tech site The Verge cites a Disney+ source saying, “We’ve put in enough work that it’s not a one-off.”A hand sanitisation station set up for the European premiere for \"Mulan\" in London on March 12, 2020. The premiere was canceled due to coronavirus. REUTERS/Henry NichollsDisney’s “Mulan” move says a lot about its streaming strategies.For starters, it overtly reaffirms what chairman Bob Iger said last year before Disney+ ever launched: that the direct-to-consumer business (i.e. streaming) is now the company’s “number one priority.” Disney+ is now up to 60.5 million paying subscribers, and Disney has 100 million subscribers total across Disney+, ESPN+, and Hulu. On Tuesday, it announced it will launch yet another streaming service outside the U.S., under the Star banner, which it acquired in the Fox deal.The “Mulan” plan also shows Disney is willing to do what Warner Brothers (or at least director Christopher Nolan) is not willing to do with “Tenet,” which is still slated for theatrical release on Sept. 3 before it goes digital. And even if Warner Bros. won’t do it with “Tenet,” if Disney reaps big fees from “Mulan,” other studios will be likelier to consider the straight-to-digital path in the future, even post-pandemic.Disney’s streaming success is the only reason the stock closed Wednesday up 8.8% even though the company lost $4.7 billion in its third quarter (it reported a non-GAAP profit of 8 cents per share thanks to deferred payments to sports leagues). Revenue at its theme parks division was down a devastating 85% from Q3 2019 due to the pandemic, many of its parks remain closed, its cruise lines remain shuttered, and filming of many new projects was delayed.Disney’s streaming gains are carrying the stock. If the pandemic sticks around for many more months, look for some other Disney releases to follow the “Mulan” recipe.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is affecting the entertainment industry:'Mulan' and 'Tenet' release dates affect the entire movie theater businessCoronavirus puts 'extreme pressure' on all three pillars of Disney's businessDisney's 'Mulan' will look to Christopher Nolan's 'Tenet' as a movie theater health testCoronavirus is forcing Quibi, NBC Peacock to change their plans at launch'Trolls World Tour' rental success does not spell death for movie theatersMovie theaters seek bailout as coronavirus devastates business"}]}