{"article": [{"url": "https://finance.yahoo.com/news/u-manufacturing-production-rises-more-132728493.html", "published": 1597394120.0, "headline": "U.S. manufacturing output rises strongly in July, but still below pre-pandemic levels", "body": "WASHINGTON (Reuters) - U.S. factory output increased more than expected in July, boosted by a surge in motor vehicle production, though activity remained below its pre-COVID-19 pandemic peak.The Federal Reserve said on Friday that manufacturing production rose 3.4% last month after advancing 7.4% in June. The third straight monthly gain left factory output about 8% below its level in February. Economists polled by Reuters had forecast manufacturing output would increase 3.0% in July.While businesses have reopened, new coronavirus cases continue to spread across the country, keeping a lid on demand. Manufacturing, which accounts for 11% of the U.S. economy, was struggling even before the pandemic hit the nation, a casualty of the Trump administration's trade war with China.Lower crude prices as global economies buckle under the coronavirus strain have also undercut spending by oil producers on drilling and shaft exploration equipment. Business spending on equipment has declined for five straight quarters, the longest such stretch since 2016.Motor vehicles and parts production increased 28.3% in July after accelerating 118.3% in June. There were also increases in machinery, computer and electronic products, and electrical equipment, appliances and components.The rise in manufacturing output, together with a 3.3% increase in utilities and a 0.8% gain in mining, lifted industrial production 3.0% in July. That followed a 5.7% increase in June.Capacity utilization for the manufacturing sector, a measure of how fully firms are using their resources, increased 2.3 percentage points to 69.2% in July. Overall capacity use for the industrial sector rose 2.1 percentage points to 70.6%. It is 9.2 percentage points below its 1972-2019 average.Officials at the Fed tend to look at capacity use measures for signals of how much \"slack\" remains in the economy -- how far growth has room to run before it becomes inflationary.(Reporting by Lucia Mutikani; Editing by Chizu Nomiyama and Paul Simao)"}]}