{"article": [{"url": "https://finance.yahoo.com/news/galaxy-z-fold2-5g-price-announcement-140103238.html", "published": 1598951360.0, "headline": "Samsung’s Galaxy Z Fold2 5G could be the first foldable phone you’ll want, if you can afford it", "body": "Samsung’s Galaxy Z Fold2 5G has the makings of the first foldable smartphone that you’ll want to buy, but whether you can afford it is another story.Available Sept. 18, the Android-powered Z Fold2 5G promises some rather dramatic improvements over its predecessor, including a larger front display, a nearly edge-to-edge main screen, and a new hinge mechanism that lets you keep the phone open at different angles.All of that comes at a seriously premium price: $1,999. But if you can pay that, you could end up with a far more impressive smartphone than Samsung’s first Fold.The Galaxy Z Fold2 5G looks to outdo its predecessor with an improved hinge and larger front display. (Image: Samsung)A thorough redesignSamsung has put a lot of work into building on the shortcomings of the original Z Fold. Up front, the phone now has a larger 6.2-inch AMOLED display that covers the majority of the front panel. The original Fold’s front screen was smaller and had large bezels that made the entire phone look and feel outdated despite the cutting-edge tech inside.The new screen’s aspect ratio is still odd, since it’s so tall and thin, but it should prove far more useful for everything from reading articles, scrolling social media, and watching movies.The front display on the Galaxy Z Fold2 is now nearly the full length of the phone, making it better for web browsing, scrolling social media, and watching videos. (Image: Samsung)Flip open the Fold2 and you’re now met by an upsized 7.6-inch foldable glass display. And rather than the large camera notch used to house the first Fold’s selfie camera, the Fold2 uses a small punch-out at the top of its nearly edge-to-edge display.The Fold2’s hinge has also been upgraded with a new cam mechanism that allows you to position the phone in what Samsung calls Flex mode, which lets you keep the display open halfway, so you can view content on the top portion of the screen and navigate using the bottom.The hinge itself also gets an updated sweep to keep dirt and dust from entering into the mechanism and ruining it.Around back, the Fold2 gets a camera bump similar to Samsung’s Note20 Ultra.Samsung has also built up the Fold2’s multitasking capabilities, letting you use up to three apps across its 7.6-inch display at once.Story continuesSamsung has built an improved hinge with an internal sweep for the Z Fold2, which the company says will prevent dust and debris from entering the phone. (Image: Samsung)Inside, the Fold2 has an 8-core processor, 12GB of RAM, and 256GB of storage. You’ll also get a 4,500-mAh battery, wireless charging, and, of course, 5G connectivity.A better outcomeFoldable phones are still relatively niche thanks to their high prices, so the Fold2 isn’t going to be a major volume seller for Samsung. Instead, the key for the company will be ensuring that the Fold2 is able to meet user expectations, while shaking off the poor showing of the first Fold.When that device originally landed in tech reviewers’ hands, it was met with criticisms about its durability and screen. To fix those issues, Samsung added the hinge sweep to keep debris out and provided warnings about the display’s plastic design.From the sounds of it, Samsung seems to have learned from those hard lessons and crafted a better overall device. I’ll find out for certain when I get my hands on the Z Fold2 5G in the coming weeks.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple’s stock split: How shares are performingSamsung’s Galaxy Note20 Ultra is absurdly large and expensive, but worth it for the power and stylusMicrosoft adds transcription to Microsoft 365 productivity suiteFitbit launches new Sense smartwatch to help track and reduce your endless stressFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}