{"article": [{"url": "https://finance.yahoo.com/news/goldman-sachs-q2-earnings-114630549.html", "published": 1594796060.0, "headline": "Goldman Sachs stock pops after big Q2 earnings beat", "body": "Goldman Sachs (GS) reported stronger-than-expected second-quarter earnings results on Wednesday, as surging revenues despite the pandemic buttressed the bottom line and its stock price.Here were the key figures versus the expectations for the second quarter, according to analysts polled by Bloomberg.Revenue (adjusted): $13.3 billion versus $9.71 billion expectedEarnings per share (adjusted): $6.26 versus $3.95 per share expectedThe Wall Street giant saw big gains across all its major business lines, joining JPMorgan Chase (JPM) in beating market expectations even as COVID-19 tightened its grip on the global economy.Goldman’s Fixed Income, Currency and Commodities (FICC) sales and trading revenue $4.23 billion, the highest quarterly revenue in nine years. Meanwhile, equities trading generated $2.94 billion in revenues, its best quarter in 11 years. Collectively, those businesses accounted for 54% of Goldman’s quarterly revenues.The firm’s core investment banking business delivered $2.66 billion in earnings, up 36% from the same period a year ago.“The turbulence we have seen in recent months only reinforces our commitment to the strategy we outlined earlier this year to investors,” CEO David Solomon said in a statement.“While the economic outlook remains uncertain, I am confident that we will continue to be the firm of choice for clients around the world who are looking to reshape their businesses and rebuild a more resilient economy,” he added.The bank’s Consumer & Wealth Management business posted $1.36 billion in quarterly revenues, up 9% from last year. The nascent digital banking business saw consumer deposits increase by $20 billion to end the quarter at $92 billion.Elsewhere, Goldman set aside $945 for litigation and regulatory proceedings compared to $66 million a year ago.Goldman’s stock jumped by nearly 3% in pre-market action to hover above $219 per share, up from Tuesday’s closing price of $214.01.—Julia La Roche is a Correspondent at Yahoo Finance. Follow her on Twitter."}]}