{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-checks-congress-begins-a-game-of-chicken-155943058.html", "published": 1595329640.0, "headline": "Coronavirus stimulus checks: Congress begins a ‘game of chicken’", "body": "The White House, Senate Republicans, and Democrats are divided at the moment on what they want to get into another stimulus bill.Democrats are prioritizing certain things – like aid to states – that some Republicans don’t want in the bill. Likewise, the White House is focused on a payroll tax cut that has minimal support elsewhere.But there is an exception: all parties say they want another round of stimulus checks.In May, House Democrats passed the HEROES Act which included another $1,200 payment to qualifying Americans. The Senate Republican proposal, which Senate Majority Leader Mitch McConnell outlined on the Senate floor on Tuesday, is also set to include checks.“We want another round of direct payments,” McConnell said.Done deal, right? Not so fast.President Donald Trump, with House Minority Leader Kevin McCarthy and Senate Majority Leader Mitch McConnell, gave an update on negotiations for a new round of financial stimulus on Monday. (Doug Mills/Getty Images)“We're going to have a bit of a game of chicken” in the weeks ahead, says Joshua Gotbaum, a guest scholar at the Brookings Institution and former Assistant Secretary of Treasury for Economic Policy.The question is what form of stimulus payment survives as policymakers fight over all the other parts of the bill and try to iron it out before the August break.Gotbaum thinks there is enough support on Capitol Hill and at the White House for additional stimulus payments to Americans. But part of the reason for the uncertainty is that there is only so much money to go around.‘It's just going to be a math puzzle’\"We’re discussing probably a total of 10 different elements,\" President Trump noted on Monday. In recent weeks, the president has promised more checks, saying he wants “larger numbers than the Democrats” in the new round.McConnell has said he wants a final bill to end up costing around $1 trillion. The Democrats have a much bigger price tag of $3.5 trillion. \"We’re focused on starting with another trillion dollars,\" Treasury Secretary Steven Mnuchin said on Monday. \"We think that will make a big impact.\"Many expect the final bill to land somewhere in the $1.5 trillion range, with another round of checks constituting the bulk of that amount in any scenario.Story continuesThe Center for a Responsible Federal Budget estimated that the cost of the first round of checks – as part of March’s $2 trillion CARES Act – was $293 billion. The group also looked at the provisions in the Democrats’ proposed $3.4 trillion HEROES Act, which offers more generous stimulus payments, including $1,200 per dependent, and upped the price tag to $413 billion.Since the HEROES Act passed the House in March, it has been ignored in the Senate but Democrats are using it as the starting point in their current negotiations.What the paper versions of the first round of economic impact checks, with President Trump's named affixed, looked like. (U.S. Secret Service)Senate Republicans could lower the impact by insisting on more limited checks – perhaps only for Americans making $40,000 a year or less – especially if the bill includes a delay in payroll taxes.“It's just going to be a math puzzle about how they want to fit this in with some of the other priorities,” says Gabe Horwitz, who directs the Economic Program at Third Way, a center-left think tank in Washington.Horwitz points specifically to provisions around aid to states, to small businesses, and to health care as provisions that “could start getting pretty pricey pretty fast, which leads to that overall math problem.\"Another major sticking point is the enhanced unemployment provisions which provide out of work Americans with an additional $600 a week. Those provisions – with a first round that cost about $268 billion – are set to expire on July 31. Democrats want to extended the extra $600 into 2021, while Republicans are opposed. How those negotiations work out could very well impact where the question of more checks end up.Gotbaum’s prediction is that in the end, Americans will get more checks but “it won't be confirmed until later in the negotiation.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Coronavirus stimulus checks: Americans are spending payments in 'two big ways'Coronavirus stimulus: Here’s what has happened so far to the $3 trillion in pandemic aidCoronavirus stimulus: What could happen to consumer spending if the extra $600 unemployment insurance isn't extendedRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}