{"article": [{"url": "https://finance.yahoo.com/news/cares-act-brinksmanship-may-have-already-hurt-consumers-morning-brief-100420733.html", "published": 1595567540.0, "headline": "CARES Act brinksmanship may have already hurt consumers: Morning Brief", "body": "Friday, July 24, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeUncertainty about tomorrow creates caution today.The CARES Act is set to expire at the end of the month.The biggest impact for consumers will be the end of enhanced unemployment benefits that provide $600/week in addition to regular benefits.Not only do these benefits cushion the blow for those out of work because of pandemic-related closures, but these benefits have been crucial in buoying economic growth that is largely dictated by the level of consumer spending.And while lawmakers and the Trump administration officials have been working all week to find a workable extension to this program — and reports suggest that progress is promising — the delay in finalizing what a new version of this program might look like has already been enough to likely knock consumers off course. And cause more re-trenching among consumers after two months of fairly robust consumption.Citing the latest consumer sentiment data from the University of Michigan, Morgan Stanley economist Sarah Wolfe said in a report Wednesday that “how households feel about their future finances tends to dictate how consumers spend today.”“This uncertainty will manifest in households that will need to shift spending into savings (saving includes paying down debt), while lack of funds raises exposure to delinquencies.”In the University of Michigan report, economist Richard Curtin said, “Another aggressive fiscal response is urgently needed that focuses on financial relief for households as well as state and local governments.“While financial relief is clearly needed for the most vulnerable households, that relief will not stimulate the extent of renewed consumer spending necessary to restore employment and income to pre-crisis levels anytime soon.”Wolfe also notes that consumer expectations during this crisis have been particularly sensitive to both news about the virus and news about fiscal support. And worries about whether the CARES Act will create a fiscal cliff for millions of households has likely already shifted spending behaviors even if an extension is ultimately passed by lawmakers.Story continuesConsumer expectations about their finances have been extremely sensitive to news about the economy and the virus in recent months. And so any delay in getting a new version of the CARES Act passed is likely to see consumers hold back. (Source: Morgan Stanley)“Uncertainty over the sudden loss of supplemental benefits may have a lingering impact on the savings/spending trade-off,” Wolfe writes.“This means that it is also possible the heightened uncertainty will lead to more of the rebate checks being reallocated towards nondiscretionary items, such as food, household bills, and other debt obligations.”Additionally, Wolfe notes that if the CARES Act extension is not signed by Friday, there will not be continuity between the programs.After weeks — months even — of knowing this deadline loomed, it seems Congress will make consumers sweat out how they’re going to make ends meet.And this coming amid continued spread of the virus, plans for starting school in the fall remain up in the air, and tens of millions continuing to file for unemployment benefits.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy9:45 a.m. ET: IHS Markit US Manufacturing PMI, July preliminary (52.0 expected, 49.8 prior)9:45 a.m. ET: IHS Markit US Services PMI, July preliminary (51.0 expected, 47.9 prior)9:45 a.m. ET: IHS Markit US composite PMI, July preliminary (47.9 prior)10:00 a.m. ET: New home sales, June (700,000 expected, 676,000 prior)Earnings6:30 a.m. ET: Honeywell (HON) is expected to report adjusted earnings of $1.20 per share on revenue of $7.28 billion7:00 a.m. ET: Schlumberger (SLB) is expected to report an adjusted loss of one cent per share on revenue of $5.4 billion7:00 a.m. ET: American Express (AXP) is expected to report an adjusted loss of 10 cents per share on revenue of $8.14 billion7:00 a.m. ET: Bloomin’ Brands (BLMN) is expected to report an adjusted loss of $1.14 per share on revenue of $593.27 million7:30 a.m. ET: Verizon Communications (VZ) is expected to report adjusted earnings of $1.15 per share on revenue of $29.95 billionTop NewsGlobal stocks sink amid rising US-China tensions [Yahoo Finance UK]Blockbuster tech hearing likely postponed as John Lewis lies in state [Politico]Bankrupt Brooks Brothers gets rescue takeover bid [Bloomberg]Intel forecasts third-quarter revenue above estimates [Reuters]YAHOO FINANCE HIGHLIGHTSSurgeon General: US has a racial 'health disadvantage' — even without coronavirusSouthwest CEO: It'll take 5 to 10 years for business travel to recoverThese 3 states are suffering the slowest coronavirus job market recoveries—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}