{"article": [{"url": "https://finance.yahoo.com/news/trumps-300-per-week-unemployment-benefit-too-little-too-late-to-help-august-spending-goldman-191805947.html", "published": 1598451980.0, "headline": "Trump's $300 per week unemployment boost 'too little, too late' to help August spending: Goldman", "body": "The fight between President Donald Trump and top Democrats over extending the $600 in weekly unemployment benefits has cost Americans $70 billion in monthly personal income in August, according to new Goldman Sachs data.Trump attempted to shield unemployed Americans from a precipitous drop in their benefits by signing an executive order on Aug. 8. It enables states to provide an additional $300 in weekly benefit payments to unemployed workers.However, that amount is insufficient to offset the hit cash-strapped consumers are likely to face in August, Goldman’s analysts wrote this week. The $70 billion drop in monthly personal income in August translates into a whopping $825 billion, or 4% of gross domestic product (GDP) on an annualized basis, the data found.The new payments are “too little too late” to boost August spending, Goldman wrote, and “will likely weigh on personal consumption and retail sales in August.”While the new $300 weekly unemployment payments could cut jobless workers’ monthly personal income losses in half, it’s not likely that it'll reach Americans until September. Uncertainty surrounds the White House’s program, and the subsequent delays states have undergone in implementing it are weighing heavily on the outlook.In order to bypass Congress’ power of the purse, the president directed that the federal government’s disaster relief fund be used to pay for the disbursements. Roughly $40 billion from that fund has been set aside to help states provide $300 in weekly unemployment benefits to Americans, for about three to five weeks.Thirty states have been approved to participate in the federal “lost wages assistance” program which was established as a result of President Trump’s executive order -- but to date, only a few actually have.Remaining states are also expected to join the program because it does not require them to share new costs with the federal government.Americans have been subject to a $15 billion drop in unemployment payments every week since the $600 in federal benefits payments expired. Jobless Americans began cutting back on spending when the $600 in federal benefits expired on July 31.Story continuesAccording to Cardify, a mobile app that tracks consumer spending, there has been a greater pullback in apparel and accessories purchases than there was for grocery and wholesale store spending.More from Sibile:Democratic Rep. blasts Trump on USPS woes: ‘No hope’ of waking up knowing who won the electionTrump payroll tax deferment is ‘employee relations disaster’Coronavirus gut check: How small businesses are survivingHow Hollywood content can ‘normalize injustice’Michigan Gov. Whitmer, potential VP pick, has ‘good relationship’ with Biden, says Lt. Gov."}]}