{"article": [{"url": "https://finance.yahoo.com/news/u-tops-130-000-deaths-143520833.html", "published": 1594028600.0, "headline": "U.S. tops 130,000 deaths from COVID-19 after record surge in cases", "body": "By Lisa Shumaker and Doina ChiacuJuly 6 (Reuters) - The number of U.S. coronavirus deaths exceeded 130,000 on Monday, following a surge of new cases that has put President Donald Trump's handling of the crisis under the microscope and derailed efforts to restart the economy.The overall rate of increase in U.S. deaths has been on a downward trend despite case numbers surging to record levels in recent days, but health experts warn fatalities are a lagging indicator, showing up weeks or even months after cases rise.Nationally, cases are approaching 3 million, the highest tally in the world and double the infections reported in the second most-affected country Brazil. Case numbers are rising in 39 U.S. states, according to a Reuters analysis.Sixteen states have posted new record daily case counts this month. Florida confirmed a record high 11,000 in a single day, more than any European country reported in a single day at the height of the crisis there.As health experts cautioned the public not to gather in crowds to celebrate Independence Day over the weekend, U.S. President Donald Trump asserted without providing evidence that 99% of U.S. coronavirus cases were “totally harmless.”At least five states have already bucked the downward trend in the national death rate, a Reuters analysis showed. Arizona had 449 deaths in the last two weeks of June, up from 259 deaths in the first two weeks of the month. The state posted a 300% rise in cases over the full month, the most in the country.Steve Adler, the Democratic mayor of Austin, Texas, on Monday criticized the Republican Trump's comment over the weekend that the virus was mostly harmless.\"It's incredibly disruptive and the messaging coming from the president of the United States is dangerous,\" Adler told CNN. \"One of the biggest challenges we have is the messaging coming out of Washington that would suggest that masks don't work or it's not necessary, or that the virus is going away on its own.\"Story continuesSoaring case numbers and packed hospitals in Texas have prompted some mayors and other local leaders to consider launching a new round of stay-at-home orders. Cities are getting together and lobbying the state's governor to restore the authority to impose local anti-coronavirus measures, Adler said.White House Chief of Staff Mark Meadows on Monday defended Trump's comment over the weekend, saying the president was not trying to play down the deaths.\"But it's really to look statistically to know that whatever risks that you may have or I may have, or my, my children or my grandchildren may have, let's look at that appropriately and I think that's what he's trying to do,\" he told reporters outside the White House.The U.S. Centers for Disease Control and Prevention has forecast between 140,000 to 160,000 coronavirus deaths by July 25 in projections that are based on 24 independent forecasts.(Reporting by Lisa Shumaker, Doina Chiacu and Gabriella Borter; Editing by Howard Goller)"}]}