{"article": [{"url": "https://finance.yahoo.com/news/wrapup-1-u-retail-sales-123642307.html", "published": 1594885460.0, "headline": "WRAPUP 3-U.S. retail sales snap back; high unemployment, rising COVID-19 loom over recovery", "body": "(Adds details, analyst comments, updates markets)* Retail sales increase 7.5% in June* Core retail sales rise 5.6%* Weekly jobless claims fall 10,000 to 1.30 million* Continuing claims drop 422,000 to 17.338 millionBy Lucia MutikaniWASHINGTON, July 16 (Reuters) - U.S. retail sales rose more than expected in June as consumers bought big-ticket items like motor vehicles and dined out, but a resurgence in new COVID-19 cases is chipping at the budding recovery, keeping 32 million Americans on unemployment benefits.Economists attributed the second straight monthly increase in retail sales reported by the Commerce Department on Thursday to the government's additional weekly $600 checks for the unemployed, a benefit that is set to end on July 31. The expiration of the program will leave millions of gig workers and the self employed among others, who do not qualify for regular state unemployment insurance, without an income.Economists warned this would undercut consumer spending and the overall economy at a time when new cases of the coronavirus are sky-rocketing, especially in the densely populated South and West, and forcing some authorities in these regions to either close businesses again or pause reopenings.\"The road ahead for the consumer looks a little foggy and uncertain to say the least,\" said Chris Rupkey, chief economist at MUFG in New York. \"July spending faces the headwinds of states closing back down due to the second wave of the coronavirus. August spending is in doubt because those extra $600 a week unemployment checks stop at the end of July.\"Retail sales rose 7.5% last month after jumping 18.2% in May, which was the biggest gain since the government started tracking the series in 1992. Economists polled by Reuters had forecast retail sales advancing 5% in June.Retail sales have rebounded as businesses resumed operations after being shuttered in mid-March in an effort to slow the spread of the respiratory illness. Retail sales in June were driven by an 8.2% increase in receipts at auto dealerships. Consumers stepped up spending at furniture, clothing, electronics and appliance, hobby, musical instrument and book stores. Receipts at restaurants and bars shot up 20.0%.Story continuesBut online and mail-order retail sales fell 2.4%. Sales also fell at building material and grocery stores.Stocks on Wall Street were trading lower amid worries about the explosion in coronavirus cases. The dollar slipped against a basket of currencies. U.S. Treasury prices rose.RECOVERY STALLINGExcluding automobiles, gasoline, building materials and food services, retail sales rose 5.6% in June after increasing 10.1% in May. These so-called core retail sales correspond most closely with the consumer spending component of the gross domestic product report.The rebound in core retail sales did not change expectations consumer spending collapsed in the second quarter. It, however, set spending on a higher growth path for the third quarter.Economists expect consumer spending, which accounts for more than two-thirds of U.S. economic activity, declined at as much as a 35% annualized rate in the April-June quarter. That could result in GDP falling at around a 31% pace in that period. The economy shrank at a 5% pace in the January-March quarter, the sharpest contraction since the 2007-2009 Great Recession.\"Activity snapped back in May and June, albeit to levels below those which prevailed prior to the pandemic,\" said Michael Feroli, chief U.S. economist at JPMorgan in New York. \"More recently, several high-frequency indicators suggest that May and June were the easy months, and that the resurgence of COVID-19 cases is leading to slower activity gains in July.\"Separately on Thursday, the Labor Department said 1.30 million people filed for state unemployment benefits during the week ending July 11, down 10,000 from the prior period. Economists had forecast 1.250 million claims last week.The weekly jobless claims report, the most timely data on the economy's health, showed big increases in California, Georgia, Florida and Washington state, which are experiencing a surge in COVID-19 cases.First-time claims peaked at a historic 6.867 million in late March. They remain roughly double their highest point during the 2007-09 Great Recession. Including a program funded by the government, 2.23 million people filed claims last week.The number of people receiving benefits after an initial week of aid fell 422,000 to 17.338 million in the week ending July 4. These so-called continued claims, which are reported with a one-week lag, topped out at a record 24.912 million in early May.There were 32 million people receiving unemployment checks under all programs in the last week of June, down 433,005 from the prior week. According to economists, this number, which is reported with a two-week lag, offered a more accurate reading of the labor market.Economists say unemployment remains uncomfortably high because of a second wave of layoffs, which could intensify as the COVID-19 infections depress demand and increase bankruptcies, especially in the retail sector. American Airlines said on Wednesday it was sending 25,000 notices of potential furloughs to frontline workers.\"The data are likely underestimating the true state of the labor market,\" said Joel Naroff, chief economist at Naroff Economics in Holland, Pennsylvania. \"Firms are starting to warn there could be major layoffs in the months to come.\"(Reporting by Lucia Mutikani; Editing by Chizu Nomiyama and Andrea Ricci)"}]}