{"article": [{"url": "https://finance.yahoo.com/news/3-charts-reveal-why-lululemon-just-dropped-500-million-to-buy-mirror-204304022.html", "published": 1593532280.0, "headline": "3 charts reveal why Lululemon just dropped $500 million to buy Mirror", "body": "Lululemon (LULU) plunking down a hefty $500 million to buy at-home fitness player Mirror makes sense not only from a brand perspective, but also from a pure data perspective.Mirror app downloads — which offers insights into the company’s namesake hardware — have skyrocketed by more than 1,000% each month since January, per new data from Sensor Tower (see charts below). The data shows Mirror’s app download growth peaked in March at a mind-boggling 3,000%. Meanwhile, Mirror’s website traffic has consistently grown by 100% since late April, according to SimilarWeb.All of this comes as the COVID-19 pandemic has swept across the globe and closed gyms while making working out in the outdoors more cumbersome. The pandemic has led workout enthusiasts to invest in building out home gyms, lighting a fire to sales for upstart tech companies Mirror, Peloton and Hydrow.While these types of growth rates for Mirror and Peloton shouldn’t be expected to be sustained, it does underscore a fundamental shift in working out that is likely to be around for some time. So, why shouldn’t a Lululemon pounce.“We believe that people will continue to value convenience and diversified, quality content more and more. The at-home fitness trend had already experienced very sustained momentum prior to COVID, and this unforeseen time has only further intensified a growing shift towards the convenience of working out at home. While we don’t purport to know what will happen to the boutique fitness industry after the pandemic, our industry leading engagement data points to strong, lasting trend lines around at-home practices. While we saw households using their Mirrors over 10 times per month already earlier this year, we have seen average workouts per month increase ~50% since the pandemic,” Mirror founder Brynn Putnam told Yahoo Finance via email on June 1.Mirror has been on fire.Putnam — a former Lululemon brand ambassador — will now be reconnected with her former friends at the athletic apparel maker.Story continuesLululemon said Monday evening it will buy the privately held Mirror in an all-cash transaction. The company originally invested $1 million in Mirror in mid-2019. Not many details on Mirror’s business were shared, other than a note it will hit $100 million in sales this year. Lululemon is widely expected to install Mirrors in its stores to boost brand recognition. It’s conceivable over time the company will turn Mirror into a one-stop shopping destination for its athletic wear and other health and wellness services.Lululemon CEO Calvin McDonald didn’t return Yahoo Finance’s request to be interviewed.“I’m not surprised about the acquisition. I think that at home fitness is another category benefitting dramatically from this [COVID-19 situation]. I know Lululemon had made an investment prior to this, so I suspect they liked what they saw when they decided to make a full acquisition,” said True Ventures partner Amy Errett on Yahoo Finance’s The First Trade. True Ventures was an early investor in Peloton and Fitbit (now owned by Google).Errett, who is also the founder and CEO of hair coloring company Madison Reed, added “I think the total addressable market has gone up dramatically. I think if you look at the size of the fitness market in general and then you look at the size of the gym market, which is quite large, I think the total addressable market is quite attractive.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}