{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-8-2020-221954310.html", "published": 1594221140.0, "headline": "Stock market news live updates: Stocks trade higher as Apple, Amazon hit record levels", "body": "Stocks closed higher Wednesday as heavily weighed tech stocks continued their run of outperformance, with shares of Apple, Amazon, Netflix and Facebook hitting record highs. Earlier, a report underscoring ongoing US-China tensions and more advances in coronavirus case counts dragged on the S&P 500 and Dow.[Click here to read what’s moving markets heading into Thursday, July 9]Shares of airlines fell again on Wednesday, as a protracted rise in coronavirus cases, deaths and hospitalizations domestically threatened the pace of recovery in air travel. United Airlines (UAL) said Wednesday it was preparing notices to furlough about 36,000 US-based employees, or about 45% of staff, effective Oct. 1 due to persistently low travel demand. A day earlier, the airline warned in a securities filing that it expects “demand to remain suppressed until a widely accepted treatment and/or vaccine for Covid-19 is available.” Year over year industry revenue was down 78% as of July 2, the company added.On the vaccine and treatment front, Moderna (MRNA) shares rose to their highest level in a week on Wednesday after announcing it had completed enrollment of its Phase 2 study of its mRNA vaccine candidate against Covid-19. It added it had finalized its Phase 3 study protocol with the US Food and Drug Administration, for a randomized, placebo-controlled trial expected to include about 30,000 participants.Shares of Novavax (NVAX) gave back some gains Wednesday after closing higher by 31% on Tuesday, following an announcement that it had received $1.6 billion from US Operation Warp Speed to expedite the development of a vaccine for Covid-19. Novavax – which is working on one of more than 130 Covid-19 vaccine candidates worldwide – is set to deliver 100 million doses of the vaccine as soon as late 2020, assuming clinical trials are successful. Regeneron (REGN), which announced Tuesday it received a smaller grant to develop a Covid-19 treatment, traded slightly higher.Story continuesThe steady march higher in virus cases continued unabated in some parts of the US. California reported its largest one-day rise in virus cases on record at 11,694 as of Wednesday. A day earlier, San Francisco Mayor London Breed pushed back the city’s planned return of indoor dining past the original date of July 13. Cases in Arizona rose by 3.3% as of Wednesday’s count to a total of 108,614, with the one-day increase slightly below the previous seven-day average of 4.1%.Levi Strauss (LEVI) was one of the few companies to report earnings results this week after market close Tuesday. Shares fell in late trading after the company reported a 62% drop in second-quarter net revenue over last year, or a greater decline than expected, and said it would be cutting 700 jobs.—4:02 p.m. ET: Stocks end a choppy session higher as Apple, Amazon rise to fresh recordsHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +24.64 (+0.78%) to 3,169.96Dow (^DJI): +177.10 (+0.68%) to 26,067.28Nasdaq (^IXIC): +148.61 (+1.44%) to 10,492.50Crude (CL=F): +$0.22 (+0.54%) to $40.84 a barrelGold (GC=F): +$8.30 (+0.46%) to $1,818.20 per ounce10-year Treasury (^TNX): +0.3 bps to yield 0.6530%—2:29 p.m. ET: Gilead stock drops after announcing early-stage trial for inhaled remdesivirGilead (GILD) shares fell in intraday trading Wednesday even after the company announced it was initiating a clinical trial of an inhaled solution of remdesivir for outpatient treatment of Covid-19.“Delivering remdesivir directly to the primary site of infection with a nebulized, inhaled solution may enable more targeted and accessible administration in non-hospitalized patients and potentially lower systemic exposure to the drug,” the company said in a statement. “This randomized, placebo-controlled trial will enroll approximately 60 healthy individuals aged 18-45 in the United States to form the basis for further clinical study of the inhaled drug, particularly in patients whose disease has not progressed to require hospitalization.Still, shares of Gilead have outperformed the broader market for the year to date, rallying nearly 16% through Wednesday afternoon.—11:22 a.m. ET: Stocks mixed, S&P 500 and Dow fallHere were the main moves in markets, as of 11:22 a.m. ET:S&P 500 (^GSPC): -4.07 points (-0.13%) to 3,141.25Dow (^DJI): -43.04 points (-0.17%) to 25,847.14Nasdaq (^IXIC): +12.37 points (+0.12%) to 10,355.71Crude (CL=F): flat at $40.62 a barrelGold (GC=F): +$11.40 (+0.63%) to $1,821.30 per ounce10-year Treasury (^TNX): +0.7 bps to yield 0.655%—9:37 a.m. ET: Brooks Brothers files for Chapter 11 bankruptcy as company joins wave of bankrupt retailers during pandemicBrooks Brothers, the more than 200-year-old menswear retailer, filed for Chapter 11 bankruptcy protection in Delaware Wednesday morning, joining peer retailers Neiman Marcus and J. Crew in filing for bankruptcy during the pandemic.With Chapter 11 bankruptcy, the company will be able to continue operating while working out a plan to restructure the business.An earlier report from Bloomberg also suggested Ascena Retail Group, the parent company of brands including Ann Taylor and Lane Bryant, was preparing to file for Chapter 11 bankruptcy as soon as this week. As part of the plan, the company would shut at least 1,200 of its about 3,000 retail locations and enter a creditor agreement to eliminate about $700 million if its $1.1 billion debt load. Ascena previously disclosed in May that its fiscal third quarter sales had dropped 45% over last year due to virus-related store closures.—9:32 a.m. ET: Stocks open slightly higher, Nasdaq outperformsStocks opened slightly to the upside Wednesday morning, with each of the S&P 500, Dow and Nasdaq holding onto modest overnight gains.The information technology, health care and consumer discretionary sectors led advances in the S&P 500. More than 1% advances in each of Walmart and Apple kept the Dow in the green. The Nasdaq outperformed against the S&P 500 as heavily weighted tech stocks mostly rose. The index climbed 0.7%, or 74 points, versus about 0.4% advances in each of the S&P 500 and Dow.—7:26 a.m. ET Wednesday: Stocks rise after choppy overnight sessionHere were the main moves in markets, as of 7:26 a.m. ET:S&P 500 futures (ES=F): 3,141.00, up 4.5 points or 0.14%Dow futures (YM=F): 25,788.00, up 18 points, or 0.07%Nasdaq futures (NQ=F): 10,566.5, up 34.25 points, or 0.33%Crude (CL=F): -$0.08 (-0.2%) to $40.54 a barrelGold (GC=F): +$4.50 (+0.25%) to $1,814.40 per ounce10-year Treasury (^TNX): +0.3 bps to yield 0.651%—6:08 p.m. ET Tuesday: Stock futures flat to slightly higher as overnight trading kicks offHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:08 p.m. ET:S&P 500 futures (ES=F): 3,138.75, up 2.25 points or 0.07%Dow futures (YM=F): 25,807.00, up 37 points, or 0.14%Nasdaq futures (NQ=F): 10,542.00, up 9.75 points, or 0.09%Traders wear masks as they work on the floor of the New York Stock Exchange as the outbreak of the coronavirus disease (COVID-19) continues in the Manhattan borough of New York, U.S., May 28, 2020. REUTERS/Lucas Jackson—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}