{"article": [{"url": "https://finance.yahoo.com/news/oracle-tiktok-win-gives-chance-to-prove-it-can-take-on-microsoft-amazon-184511470.html", "published": 1600091600.0, "headline": "Oracle's TikTok win gives it a chance to prove it can take on Microsoft and Amazon", "body": "Oracle’s (ORCL) proposed partnership with TikTok parent company ByteDance could give the software giant a big leg up in the hyper-competitive cloud space currently dominated by market leaders Amazon (AMZN) and Microsoft (MSFT).The proposed partnership, which was announced Monday and will see Oracle serve as ByteDance’s “trusted technology provider,” could avert a shutdown of TikTok’s U.S. operations. The drama came as a result of two executive orders signed by President Donald Trump, who called for ByteDance to shutter its U.S. business over national security concerns related to China’s suspected ability to access Americans’ user data.TikTok, which features short-form videos of users, who are mostly teens, dancing and lip syncing, chose Oracle over Microsoft, a formidable competitor in the cloud market.“You know, if you look at it from a consumption and bandwidth and, you know, collection and harvesting and cloud computing play, it's an amazing opportunity for Oracle,” Karim Hijazi, CEO of cyber security firm Prevailion, told Yahoo Finance’s The First Trade on Monday.A name big name for Oracle’s cloudWhile there’s still no word on how exactly the TikTok partnership will work for Oracle — it still needs to be reviewed by the U.S. — the fact that the company would have such a big-name client using its cloud services would be a huge win.A smartphone with the Tik Tok logo is seen in front of a displayed Oracle logo in this illustration taken, Septemeber 14, 2020. REUTERS/Dado Ruvic/IllustrationWhile Amazon, Microsoft, and Google have seen their cloud businesses serve as key growth opportunities in recent years, Oracle’s offering hasn’t managed to draw as much attention as its larger competitors.According to Statista, Amazon holds 33% of the cloud market, while Microsoft and Google (GOOG, GOOGL) have 18% and 9%, respectively. Oracle, meanwhile, has just 2% alongside the likes of Tencent Cloud and behind IBM, which has 5%.A get like TikTok would give Oracle more credibility in the cloud market, which could push more enterprise customers to choose the company over its competitors. The TikTok move also follows video chat platform Zoom’s decision to use Oracle as its cloud provider, giving the software giant a nice kick start in terms of growth momentum.Story continues“A TikTok strategic partnership or acquisition would be a positive to Oracle's Cloud business and would give it another large marquee customer after landing Zoom Video in April 2020,” BofA Global Research’s Kash Rangan wrote in an analyst note.More data for Oracle’s ad businessWorking with TikTok could prove to be a huge opportunity for the company’s Data Management Platform. A big-data service, Data Management Platform sucks up data on the types of websites people visit, which can then be used by marketers to create targeted advertising campaigns.Getting access to a service like TikTok could provide Oracle with data on members of the Gen-Z cohort, giving them access to a group coveted by advertisers. Taken together, according to Rangan, Oracle could pull in $630 million in revenue via TikTok’s added business based on its user base of 85 million users in the U.S., Canada, Australia, and New Zealand.But if Oracle were able to double the number, the firm could see as much as $2 billion in revenue from the social media app, and in a bull case that could top out as high as $6 billion.Still, all of this is contingent on whether the U.S. approves the new partnership, and supposes that no additional kinks are thrown in by the Chinese government. It’s now a waiting game to see how the move shakes out — and whether Oracle can make a serious play out of the social media platform.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:How to watch the Apple event on Sept. 15, and what to expectNetflix co-CEO on its advantage over Apple and Amazon: We have a ‘single focus’Microsoft Surface Duo review: A two-screen Android phone that could change everythingApple’s Sept. 15 event is all about the Apple WatchFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}