{"article": [{"url": "https://finance.yahoo.com/news/us-surgeon-general-adams-were-working-247-on-a-coronavirus-response-but-dc-cant-do-everything-215023260.html", "published": 1595350700.0, "headline": "Surgeon General Adams: Feds 'working 24/7' on coronavirus, but DC can't do everything", "body": "U.S. Surgeon General Jerome Adams said on Tuesday that criticism directed at the Trump administration over its coronavirus response is misplaced, as he insisted that the federal government is working around the clock to address surging rates of COVID-19 infections.As Americans watch the unabated spread of the coronavirus, medical experts have ratcheted up their calls to implement a national strategy to control the outbreak, including a mandate to wear masks in public.In an interview with Yahoo Finance, Adams — who is on the White House coronavirus task force — said the federal government is mostly executing what its critics demand. Yet he argued against a top-down approach that would centralize decision-making in Washington.Amid searing critiques that the administration is faltering in its effort to control the outbreak, Adams said that “honestly, nothing could be further than the truth. I'm working 24/7 and all the other doctors are working 24/7 to coordinate a federal response.”US has the biggest Covid outbreak in world we are now the driver of the global pandemic. Our response still lacks fundamental, basic elements: coherent leadership, focused programs, rapid turnaround time testing, effective contact tracing, consensus on masks, distancing.— Dr. Tom Frieden (@DrTomFrieden) July 19, 2020Adams voiced support for devolving control to states and localities, because that is where the resources are, he said.“I used to run a State Department of Health for three years. It's important for people to understand that you can't do everything from Washington, D.C., but the majority of the work and the majority of the authority is at the state and local level within the public health systems,” the physician said.“And so what we're doing is working closely with state and local health departments,” Adams added.Send in the troops?Story continuesOnly five states are seeing at least a 10% decline in cases. (Graphic: David Foster/Yahoo Finance)Adams argued that it would be impractical for the federal government to take on a leading role, using the presence of federal law enforcement in Oregon amid Black Lives Matter protests as an example.It’s the same reason a federal mandate on masks is not possible, he stated, reiterating his opposition to a national policy on the issue.“This is a very practical concern, this isn't subjective,” Adams told Yahoo Finance.“The difference between a mandate and a guideline is enforcement, and from a federal perspective, we can send in federal troops, and we see that's not working very well in places like Oregon right now,” he added.Minorities disproportionately targeted by police also plays another role, said Adams, who has been a vocal advocate for attention on diversity issues.“I’m not against a mandate, but really against doing things without making sure people understand why they're doing them and working with the local communities,” Adams said.“I think that we can defeat this disease if we can get the public to do their part and we can get state governments and local governments and the federal government to all work together, and I'm seeing more and more of that,” he added.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}