{"article": [{"url": "https://finance.yahoo.com/news/campus-reopenings-college-195407454.html", "published": 1597849340.0, "headline": "Campus re-openings are driven by 'political pressure and money,' college president says", "body": "Two big-name colleges, the University of North Carolina and Notre Dame, tried and failed to restart in-person classes as the fall semester begins.And the ongoing experiment is pushing schools to confront a hard truth, one college president said.“All these schools that are inviting people back in, of course, you have to ask yourself: Why would they do that?” Paul Quinn College President Michael J. Sorrell told Yahoo Finance. “And the answer: political pressure and money.”(Michael Sorrell. Screenshot: Paul Quinn College)Paul Quinn is a historically Black college based in Dallas, Texas, with around 550 students. Sorrell, the longest-serving president in the school’s 146-year history, is credited with turning the school’s fortunes around after taking the job in March 2007 as the fourth president in four years.The school was one of the very first in Texas to transition to remote learning amid the coronavirus pandemic.“All summer long, we've watched the number of cases just escalate and escalate and escalate, and if someone had said to us in the spring that there'd be this many cases in the fall, none of us would've thought about opening schools, right?” Sorrell said. “When we closed it, it was a dream compared to where we are now.”There are over 5.1 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)‘People in their 20s, 30s, and 40s are increasingly driving its spread’The World Health Organization (WHO) recently noted a rise in coronavirus cases in young people around the world.“The epidemic is changing,” Dr. Takeshi Kasai, WHO Regional Director for the Western Pacific, said during a briefing this week. “People in their 20s, 30s and 40s are increasingly driving its spread. Many are unaware they're infected, with very mild symptoms or none at all.”Consequently, Dr. Kasai added, new outbreaks can occur when younger people “unknowingly passing on the virus to others... [and] increases the risk of spill-overs to the most vulnerable: The elderly, the sick people in long-term care, people who live in densely populated urban areas and underserved rural areas.”Story continuesA student checks in to the NYU dorms in the East Village as the city continues Phase 4 of re-opening following restrictions imposed to slow the spread of coronavirus on August 18, 2020 in New York City. (PHOTO: Noam Galai/Getty Images)Sorell said his decision to keep students and staff off campus was based on two calculations.“Number one: Did we have the ability to police?” he said. “And I do mean that word, literally police the lives of our students every minute of every day of every week of every month of the semester. And the answer is of course not — but that's what you need to do to have a shot at being successful. It's not going to succeed.”At least one school is trying a literal policing strategy: Boston College is hiring Boston police detail to keep an eye on parties on off-campus housing on Thursday, Friday, and Saturday nights.“You can't make this stuff up, right?” Sorrell said. “Ask yourself how much money it would have to cost to hire police force to police parties. How could that money have been spent?”Albion College, a private school in Michigan, is relying on technology to stop the spread: Students are reportedly required to download an app that tracks at all times their physical locations and their private health data while residing in the 4.5-mile perimeter on campus.Colleges for years have struggled to control student behavior. Think about efforts re: binge drinking, Greek life, the list goes on. Now they're depending on that tenuous control for fall. So we get fliers like this one from Iowa State: Please don't share vapes or cups. pic.twitter.com/FP4Z7RtcrX— Lindsay Ellis (@lindsayaellis) August 19, 2020And amid the new protocols and even liability waivers, some student groups are pushing back against campus reopening plans.On Wednesday, resident advisors at Cornell University— which is slated to reopen and start some in-person classes on September 2 — announced on Twitter that they were unhappy with conditions at the college, demanding an increase in stipends, additional PPE, among other requests.“I don't believe in no-win scenarios,” Sorrell said. “I'm certainly not going to play with the lives of my students, my staff, and the community.”‘All because we refuse to just acknowledge the truth’Paul Quinn had a dry run of sorts over the summer when it ran a COVID-testing site twice a week and invited people in the city to get tested.The initiative “gave us a unique perspective on what's going to be necessary in order to manage people and to manage a testing operation,” Sorrell said.And after hearing the plans that other schools were implementing in terms of testing, tracing, masking, and social distancing, Sorrell realized that opening campus amid the pandemic was a losing battle.A student is seen moving into her student residence at Gates Hall on the campus of Texas Tech University in Lubbock, Texas, U.S. on August 14, 2020. (PHOTO: REUTERS/Brad Brooks)“You're going to need an entire office devoted to COVID-19 people whose job is to wait around, make sure people had on masks, testing, make sure people aren't seeing too close each other,” Sorrell said. “That's an awful lot of resources to lose. What can we do with those resources instead of running a failed operation?”A chart by Goldman Sachs, showing how the number of COVID-19 cases at universities increased substantially between the initial testing period and more recent tests, illustrated how difficult preventing outbreaks can be.(Goldman Sachs)In the end, Sorrell reiterated, public institutions of all kinds need to recognizes the severity of the situation.“We have failed government policy, we have failed public health policy, we have failed government economic policy,” he asserted. “All because we refuse to just acknowledge the truth.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:Coronavirus: Universities begin U-turns as campus life brings outbreaksCoronavirus: Some college students returning to campus are being met with liability waiversRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}