{"article": [{"url": "https://finance.yahoo.com/news/attorneys-general-sue-education-secretary-betsy-de-vos-over-gainful-employment-rule-205153783.html", "published": 1593014360.0, "headline": "19 attorneys general sue Education Secretary Betsy DeVos over gainful employment rule", "body": "This story has been updated to include comment from the Department of Education.Nineteen U.S. attorneys general are suing Education Secretary Betsy DeVos for overturning an Obama-era rule designed to protect students from predatory higher education institutions.The 2014 gainful employment rule was created by the Obama administration to ensure that schools — many of them for-profit colleges — were denied access to federal aid if their graduates had weak career prospects and heavy debt loads.DeVos repealed the rule in July 2019, and her decision goes into effect on July 1.On June 24, attorneys general of the states of Pennsylvania, Maryland, Colorado, New Jersey, Connecticut, Delaware, Hawaii, Illinois, Massachusetts, Michigan, Minnesota, New York, North Carolina, Oregon, Rhode Island, Vermont, Virginia and Wisconsin, as well as the District of Columbia sued Betsy DeVos and her agency. The lawsuit was filed in U.S. District Court in D.C.“Betsy DeVos’s unjustified and illegal repeal of the Gainful Employment rule is yet another example of the Trump Administration’s continued efforts to dismantle critical safeguards protecting students and taxpayers in order to further the interests of for-profit colleges,” New York Attorney General Letitia James said in a statement.U.S. Education Secretary Betsy DeVos testifies before the House Education Committee on Capitol Hill in Washington, U.S., May 22, 2018. (PHOTO: REUTERS/Leah Millis)James added: “We are standing up for students and calling out the Department of Education’s improper repeal of a rule that plays a vital role in ensuring students can make informed decisions about their education. The Trump administration’s actions here are just another example of putting special interests ahead of student interests.”In response to the lawsuit, press secretary Angela Morabito stated simply: “The Department will vigorously defend its final regulation rescinding this deeply flawed rule.”Advocates expect the latest lawsuit to generate momentum to reverse the rule, or create more accountability measures.“Now more than ever, students need to know that their investment in higher education will lead to a brighter economic future,” Student Defense President Aaron Ament said in a statement. “Secretary DeVos’s illegal repeal of the Gainful Employment Rule is a betrayal of students and a handout to owners of predatory schools.”Story continuesRandi Weingarten, president of the teachers’ union American Federation of Teachers, added: “Betsy DeVos has already made history as one of the most unproductive, unpopular and frankly embarrassing cabinet appointments — and today, states across the country are holding her to account.”‘Leaving the Department without any meaningful way to enforce’The for-profit higher education sector saw tremendous growth after the 2008 Crisis. In 2016, the New York Fed noted that enrollment at these schools had “skyrocketed” as the country emerged out of the Great Recession.Debt levels rose ballooned over the following decade, and students graduating from for-profit institutions generally hold far higher levels of debt than those attending other institutions.(Graphic: David Foster)The gainful employment rule addressed this imbalance by requiring schools’ graduates to have loan payments that were less than 8% of their total income or 20% of their discretionary income, as The New York Times explained in 2014.The Obama-era ED estimated that as of 2014, 1,400 programs serving 840,000 students — 99% of whom were at for-profit institutions — would not pass the accountability standards under the gainful employment rule. By 2020, the Trump-era ED defended its repeal of the rule.Attorneys general of several states and others pushed back on the repeal, stating that the move made it much easier for predatory for-profit institutions to exploit students.A security guard inside Everest College keeps away a member of the media and a former student after the embattled for-profit Santa Ana school was shut down along with 28 others. (PHOTO: Mindy Schauer/Digital First Media/Orange County Register via Getty Images)Some attorneys general sued DeVos in 2017, alleging that she illegally delayed the implementation of the 2014 rule. In January 2020, the country’s second-largest teachers’ union sued DeVos for reversing the gainful employment rule. And California Attorney General Becerra, who is not part of the new lawsuit, also brought a lawsuit against DeVos for overturning the rule.“The Repeal Rule eliminated the standard employed under the GE Rule to evaluate whether programs prepared students for gainful employment ... did away with the warnings that failing programs owed to current and prospective students ... [and] did not create any replacement mechanisms, leaving the Department without any meaningful way to enforce the gainful employment provision,” the lawsuit stated.Reversal allows ‘for-profit schools to steer students into useless programs’The attorneys general also expressed concerns over a possible resurgence in the for-profit education sector amid the coronavirus-induced recession.“Before the GE Rule, scores of students took on loans to enroll in programs that offered a worthless education, a key contributor to a national student debt crisis. In egregious cases, students’ harmful enrollment decisions were the consequence of unscrupulous recruiting practices by predatory for-profit institutions,” they stated in the lawsuit.“In the current economic downturn, there is a large pool of people eager to pursue educational opportunities that will help advance or restart their career,” the lawsuit added. “But with the Repeal Rule, the Department has reverted to the conditions that allowed for-profit schools to steer students into useless programs.”There are over 2.3 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)And due to the fact that ED has not replaced the gainful employment rule with an alternative, they argued, the repeal is “arbitrary, capricious, and contrary to law.”“With the economic downturn causing many of our residents to reevaluate their careers and consider returning to school, it’s hard to imagine a worse time to eliminate protections for students who are seeking to improve their job prospects,” New Jersey Attorney General Gurbir S. Grewal said in a statement. “Yet the U.S. Department of Education is doing just that, so that it can send more taxpayer money to for-profit schools that push high-cost, low-value educational programs and saddle students with unaffordable debt.”—Aarthi is a writer for Yahoo Finance. She can be reached at aarthi@yahoofinance.com. Follow her on Twitter @aarthiswami. Read more: California AG sues Betsy DeVos for overturning Obama-era rule aimed at for-profit collegesEducation Secretary Betsy DeVos faces another lawsuit for overturning an Obama-era ruleTeachers union sues Betsy DeVos for overturning Obama-era ruleRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}