{"article": [{"url": "https://finance.yahoo.com/news/exclusive-sanofi-more-confident-coronavirus-180906628.html", "published": 1598620640.0, "headline": "Exclusive: Sanofi more confident about its coronavirus vaccines", "body": "By Matthias BlamontPARIS (Reuters) - Sanofi's confidence in its coronavirus vaccine candidates has increased this summer as the French drugmaker prepares to start clinical trials, its chief executive told Reuters.The company is working on two of the more than 150 potential vaccines being developed across the world to tackle the COVID-19 pandemic, which has claimed more than 831,000 lives and sparked economic chaos.One candidate, to be manufactured on the back of an existing platform that develops vaccines to treat flu, will use an adjuvant made by Britain's GlaxoSmithKline (GSK) to boost its efficacy.The other, being developed with U.S. company Translate Bio, relies on a different technology known as mRNA.\"The early data is saying that we're on the right track and that we have a vaccine,\" Paul Hudson said in an interview on Friday, referring to the vaccine being developed with GSK.That vaccine is set to start clinical trials next month.Around 30 experimental coronavirus shots are already in human trials. But Hudson said in June the probability of Sanofi obtaining a vaccine with an efficacy of more than 70% was higher than for rivals, in part due to its experience in vaccines.\"Our confidence has increased. We have work to do like everybody on manufacturing in large volumes. But we will have one, maybe two vaccines next year,\" Hudson said.Translate Bio said on Tuesday the mRNA vaccine had induced an immune response in non-human studies, with trials in humans expected to start in November.Sanofi has secured deals for the vaccine-plus-adjuvant with the United States and Britain, and is in advanced talks with the European Union to supply it with up to 300 million doses.But the EU is offering only partial protection to vaccine makers against legal risks from side-effects of their potential shots, European officials said earlier this week, in a move that is hampering deals and contrasts with U.S. policy.\"I think with the level of protection, we have reached an 'agreed level'. And I think that has allowed us to go forward and sign. But I am aware there are different positions on how strong that is,\" Hudson said.Story continuesWith vaccines being developed at record speed during the pandemic, there is potentially a greater risk they may have unexpected consequences or may not be effective.The financial coverage of these liabilities is a key feature of drugmakers' talks with governments keen to secure vaccine shots in advance.There is so far no approved coronavirus vaccine, except one authorised in Russia before large-scale trials.(Reporting by Matthias Blamont; Editing by Mark Potter)"}]}