{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-october-1-2020-222348193.html", "published": 1601565140.0, "headline": "Stock market news live updates: Stocks buoyed by stimulus hopes; jobless claims less than expected", "body": "Stocks jumped Thursday in the first session of October and the fourth quarter, supported by expectations that Washington could provide more stimulus money for a recovery that may be losing momentum.[Click here to read what’s moving markets heading into Friday, Oct. 2] The Dow added more than 220 points, or 0.8%, shortly after market open before cutting gains to about 35 points, or 0.1%, as of market close. The Nasdaq outperformed and increased more than 1%.The three major indices closed out September lower, with the S&P 500 falling nearly 4% for its first monthly loss since March. Each of the S&P 500, Nasdaq and Dow posted their worst Septembers since 2011.But zooming out to include trading from July and August, equities’ third-quarter performance held up much more strongly. The S&P 500 posted its best third-quarter advance since 2010 with a rise of 8.5%, led by the Amazon-heavy (AMZN) consumer discretionary sector with a quarterly gain of nearly 15%.Investors are bracing for the potential for September’s volatility to carry over into October, with political uncertainty top of mind. Markets’ hopes for a fiscal stimulus package before the general election dimmed, after more talks between Treasury Secretary Steven Mnuchin and House Speaker Nancy Pelosi did not produce an agreement on new virus relief measures, though the two officials said they made progress and planned to discuss further.The economic situation at the hands of the pandemic remains dire. Airlines American Airlines (AAL) and United Airlines Holdings (UAL) are moving forward with a collective 32,000 job cuts after contingencies tied to federal coronavirus relief aid they received earlier this year expired on Wednesday.And a host of companies across industries announced new forthcoming job cuts this week, indicating that the historic workforce reductions taking place earlier this year amid the pandemic had not finished yet. Disney (DIS) said Tuesday it would be cutting 28,000 workers across its resort business, and insurance giant Allstate (ALL) on Wednesday announced an about 8% workforce reduction impacting some 3,800 jobs. Goldman Sachs (GS) is also reportedly looking to cut about 400 jobs, Bloomberg reported Wednesday, and the oil major Shell (RDS-B) announced plans to cut up to 9,000 jobs by 2022.Story continuesThe labor market reports Thursday and Friday did not and will not capture these planned layoffs. The Labor Department’s weekly jobless claims report Thursday morning showed that another 837,000 people filed first-time unemployment insurance claims for the week ended Sept. 26.That was below consensus forecasts of 850,000 and a marginal improvement from the previous week’s 870,000 — but the fifth straight week that new claims totaled fewer than 1 million. Meanwhile, Friday’s monthly jobs report – the last before the election – is expected to show a fifth straight month of net payroll gains, with consensus economists looking for 868,000 jobs to have come back in September.—4:03 p.m. ET: Stocks kick off October with tech-led advances, as Nasdaq gains 1.4%Here were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +17.78 (+0.53%) to 3,380.78Dow (^DJI): +35.20 (+0.13%) to 27,816.90Nasdaq (^IXIC): +159.00 (+1.42%) to 11,326.51Crude (CL=F): -$1.53 (-3.80%) to $38.69 a barrelGold (GC=F): +$15.70 (+0.83%) to $1,911.20 per ounce10-year Treasury (^TNX): 0 bps to yield 0.6770%—11:52 a.m. ET: Stocks hold higher but cut gainsThe three major indices pared earlier gains but still remained in the green around noon Thursday. The S&P 500 rose 0.5%, or 18 points, led by the communication services and consumer discretionary sectors. Only the energy and health-care sectors were in the red.The Dow rose 0.3%, or 83 points, led by a 2% rise in shares of Walmart. The Nasdaq outperformed as tech stocks increased, with the index rising 1%.—9:46 a.m. ET: ISM manufacturing index unexpectedly falls in SeptemberUS manufacturing activity unexpectedly decelerated in September, according to the Institute for Supply Management’s (ISM) monthly manufacturing purchasing managers’ index (PMI).The index ticked down to 55.4 in September from 56.0 in August, whereas consensus economists expected a rise to 56.5. The drop came as a subindex tracking new orders sank to 60.2, from 67.4 during the previous month. An index tracking employment rose to 49.6, staying in modestly contractionary territory just below the neutral level of 50.“The bigger picture here is that the manufacturing rebound continues, though it seems no longer to be accelerating,” Ian Shepherdson, chief economist for Pantheon Macroeconomics, said in an email Thursday. “The ISM and other surveys are consistent with further decent increases in orders and output over the next few months and, at the current rate of increase, output will be back to the pre-Covid level around the time of the anniversary of the initial plunge in activity next March.”—9:32 a.m. ET: Stocks open higher after jobless claims improve more than expectedHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +25.28 points (+0.75%) to 3,388.28Dow (^DJI): +190.36 points (+0.69%) to 27,972.06Nasdaq (^IXIC): +131.96 (+1.2%) to 11,298.49Crude (CL=F): -$1.20 (-2.98%) to $39.02 a barrelGold (GC=F): +$12.40 (+0.65%) to $1,907.90 per ounce10-year Treasury (^TNX): +3.7 bps to yield 0.714%—8:32 a.m. ET: Personal income falls more than expected in August, though spending holds upUS personal income fell more than expected in August, the Bureau of Economic Analysis reported Thursday morning, in the agency’s first report after federal enhanced unemployment benefits expired at the end of July.Personal income fell 2.7% month over month, versus a 2.5% decline expected. In July, income had risen at a 0.5% rate.Spending, however, at least temporarily held up. August personal spending rose by 1.0%, or faster than teh 0.8% rate expected. Still, this was a deceleration from the 1.5% spending rate in July.—8:30 a.m. ET: Jobless claims stable below 1M; consumer spending risesAhead of what is expected to be a wave of corporate layoffs in October, jobless claims fell in the latest week. Initial claims rose to 837,000, below consensus forecasts of 850,000 and below the critical 1 million mark that’s formed the beach head of the data series during the COVID-19 era. Most importantly, the closely watched continuing claims figure also dipped under 12 million, which was better than expected.However, a separate report showed consumer spending rose in August at a 1% clip — coinciding with the expiry of additional jobless benefits and slower than the prior month’s 1.5% rate.Traders appear to be taking the news in stride, with stock futures still pointing to a higher open, but off earlier highs.—8:15 a.m. ET: Ford CFO out in executive shuffleDrive on: Ford (F) announced a leadership shuffle early Thursday as CEO Jim Farley takes the helm of the storied auto giant. As part of the changes, Ford is replacing CFO Tim Stone with John Lawler, with the former leaving the company for ASAPP Inc., an artificial-intelligence software company.In a statement announcing the changes, Farley said that:During the past three years, under (former CEO) Jim Hackett’s leadership, we have made meaningful progress and opened the door to becoming a vibrant, profitably growing company. Now it’s time to charge through that door.We are going to compete like a challenger – allocate capital to higher growth and return opportunities to create value – and earn customers for life through great products and a rewarding ownership experience.—7:20 a.m. ET Thursday: Stock futures rise, Dow futures gain 200+ pointsHere were the main moves in markets, as of 7:21 a.m. ET:S&P 500 futures (ES=F): 3,381.5, up 29.5 points or 0.88%Dow futures (YM=F): 27,891.00, up 227 points or 0.82%Nasdaq futures (NQ=F): 11,550.25, up 143 points or 1.25%Crude (CL=F): -$0.54 (-1.34%) to $39.68 a barrelGold (GC=F): +$6.10 (+0.32%) to $1,901.60 per ounce10-year Treasury (^TNX): +2.2 bps to yield 0.699%—6:09 p.m. ET Wednesday: Stock futures open flat ahead of first day of fourth quarterHere were the main moves in equity markets, as of 6:11 p.m. ET Wednesday:S&P 500 futures (ES=F): 3,352.75, up 0.75 points or 0.02%Dow futures (YM=F): 27,688.00, up 24 points or 0.09%Nasdaq futures (NQ=F): 11,405.75, down 1.5 points or 0.01%NEW YORK, NEW YORK - MARCH 18: Traders work on the floor of the New York Stock Exchange (NYSE) on March 18, 2020 in New York City. The Dow fell more than 1,200 points today as COVID-19 fears continue to roil world markets. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}