{"article": [{"url": "https://finance.yahoo.com/news/college-football-will-return-but-a-huge-financial-question-remains-fans-in-the-stands-110510335.html", "published": 1591856000.0, "headline": "College football aims to return, but a huge financial question remains: fans in the stands", "body": "College football is twelve Saturdays away.It may be hard to believe amid the ongoing coronavirus pandemic, but Division I colleges and universities across the country began to bring their football players back to campus for workouts this month. Now a number of schools have reported that some of their players tested positive for COVID-19: Auburn had three players test positive; University of Central Florida had three; Oklahoma State had five; Arkansas State had seven.That won’t stop the season from happening. The general attitude from schools is that the players who tested positive will self-isolate for two weeks, and the show will go on.The show must go on, because the money demands it.“We are going to play football in the fall,” said the 76-year-old West Virginia University president Gordon Gee, “even if I have to suit up.”Gee said that a month ago, when the return of college football was still in question, since some universities were hesitant to commit to having classes in the fall. The California State University system, which includes football schools like San Diego State and Fresno State, announced it would start the fall with mostly online-only classes. The thinking at that time was that schools couldn’t have college football players come back if they didn’t have the rest of their students back on campus. There were also fears that the college football season might get pushed to spring 2021, which would mean NFL-bound stars like Clemson quarterback Trevor Lawrence or Ohio State quarterback Justin Fields would almost surely opt not to play.A lot changed in 30 days. Every state, in varying degrees and phases, has now begun to reopen after lockdown, which has prompted optimism for all sports leagues. And a lot can still change (for the better or for the worse) in the next 60 days, before the start of the season on Aug. 29.Dec 28, 2019; Glendale, AZ, USA; Clemson Tigers quarterback Trevor Lawrence (16) scores a touchdown against the Ohio State Buckeyes during the first half in the 2019 Fiesta Bowl college football playoff semifinal game at State Farm Stadium. Mandatory Credit: Mark J. Rebilas-USA TODAY Sports TPX IMAGES OF THE DAYConcerns about starting football on time have fadedJust this week, a report from the World Health Organization that said asymptomatic carriers of COVID-19 “rarely” transfer the virus caused a surge of optimism in the college football realm, even though the W.H.O. walked back that claim the next day.Story continuesThe thinking now, based on conversations Yahoo Finance had with multiple sources close to major football programs, is that as long as some students are back on campus, even if not the entire student body, it is acceptable to have football players back. Some schools may start by having only a few classes meet in person, and that still allows football to move forward.“It has really swung in the last 60 days,” says one sports media executive who has been on calls with NCAA and conference officials and wished to remain anonymous. “I think 60 days ago, the idea of schools not coming back, but still playing fall sports, that wasn’t acceptable. Now the way to straddle that for the schools is to have some people come back, but not everybody.”Many football insiders believe the Ivy League could cancel fall football. But the “Power 5” conferences (SEC, Big 12, Big Ten, ACC, Pac-12) are determined to play, even if a few cautious schools in those conferences do not, and sources say the conferences plan to cancel non-conference games first if they need to truncate the schedule.NEW ORLEANS, LA - JANUARY 13: Safety Grant Delpit #7 of the LSU Tigers raises his hands to the fans while he is leaving the field after the College Football Playoff National Championship game against the Clemson Tigers at the Mercedes-Benz Superdome on January 13, 2020 in New Orleans, Louisiana. LSU defeated Clemson 42 to 25. (Photo by Don Juan Moore/Getty Images)How many fans? “Even at 50% attendance, it’s an economic disaster”It’s an unpopular truth: At most schools and universities, football is the only sport that makes money—in many cases enough to fund all the other sports. As Yahoo Sports college football reporter Pete Thamel framed it on Yahoo Finance’s sports business special last month, “Without college football, college athletics is in big trouble.”Take as one example Louisiana State University, which won the College Football Playoff last year. According to LSU’s 2020 financial report, the football program brought in $92 million in revenue in 2019, or 59% of the school’s overall athletic revenue of $157 million. LSU football turned a profit of $56.6 million. Only football, men’s basketball, and men’s baseball were profitable.At schools like LSU, sports like track and field, swimming, golf, and tennis cannot happen without football.But even with signs pointing to the college football season starting on time, a massive economic quandary lingers: whether to allow fans in the stands, and when, and how many of them.The bulk of revenue each school gets from its football program comes from gate receipts (ticket sales). At LSU, 40% of the 2019 football revenue came from gate receipts; the next largest chunk was from booster contributions (26%).Over the past few months, there had been a lot of chatter that college football games with no fans would create bad optics, further damaging the NCAA’s cherished label of “amateurism” since it would be such an overt financially-motivated decision. Now it’s become clear that schools are willing to play games with no fans, regardless of the optics.“If there was any inkling out there about the romance of college athletics, and these athletes not being employees, that is 100% dead now,” says Ohio University sports management professor David Ridpath. “In those Power 5 conferences, it is big business, these are not ‘student athletes,’ these are money-making individuals that generate a lot of revenue for a lot of people.”Because the current social distancing rules vary state by state, some schools might be looking at games with no fans at first, while other schools could have some fans at the outset, and even hope to get close to full stadiums later in the fall. Schools in states that will demand reduced capacity of fans will also have to decide which fans get first access; if current students get priority, that won’t help the revenue gap much, since students often get discounted or even free tickets.The professional leagues face the same issue: the NBA, MLS, and NHL all plan to start up again with no fans, which is particularly damaging to MLS and the NHL, since those leagues are the most reliant on game day revenue. (The NFL, in contrast, gets the bulk of its revenue from broadcast rights.)Texas is already allowing outdoor sports venues to have spectators, but at 25% capacity. Facing reduced capacity, schools are bracing for football revenue losses. “Even at 50% attendance,” the media executive source says, “it’s an economic disaster.”Ticket sales, concessions, and parking fees all rely on fans coming to the games.And of course, a sudden spike in COVID-19 cases across the country could still ruin things for all the sports that are eager to return.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is hitting the sports world:NHL Commissioner Gary Bettman: Money 'is not what's driving' return planNHL return plan could set the model for other sports leagues to followKevin Durant’s agent doesn’t expect fans at NBA games for at least a yearCoronavirus could have long-lasting impact on live sports ticket salesMLS Commissioner: Playing in empty stadiums would be particularly bad for usKorean baseball's return is a bitter pill for American sports, but a win for ESPNCoronavirus hits sports leagues: March Madness canceled; NBA, NHL, MLS seasons on hold"}]}