{"article": [{"url": "https://finance.yahoo.com/news/bidens-underwhelming-economic-plan-185557343.html", "published": 1594303400.0, "headline": "Biden’s underwhelming economic plan", "body": "One problem with Hillary Clinton’s 2016 presidential campaign was a bland economic plan that made a weak impression on voters. She backed dozens of sensible ideas, but never articulated a compelling vision for supercharging growth and raising living standards.Joe Biden isn’t doing a lot better. He updated his economic plan on July 9, to address the coronavirus recession and the deep hole the U.S. economy is in. He calls his new plan “Build Back Better,” which refers to Trump’s approach to the recession. Biden will build back the economy better than Trump. Get it?Biden says he’ll create at least 5 million good-paying jobs through a “Buy America” program heavily reliant on federal spending. He’d direct $700 billion in new government spending toward American-made products and enhanced research and development, with emphasis on minority- and women-owned businesses. He’d also identify ways to boost U.S. production of high-priority goods, to reduce dependence on China and other foreign suppliers for equipment such as key medical supplies.This is in addition to a variety of other economic plans Biden rolled out during the Democratic primary elections, when he positioned himself as a moderate backing some new government programs, but not massive interventions in health care, energy and transportation, a la Bernie Sanders or Elizabeth Warren. Biden, for instance, wants to spend federal dollars to cut carbon emissions and address global warming, but he doesn’t fully support the massive spending implicit in the Green New Deal. And instead of Medicare for all, a giant government health plan for everybody, Biden backs expanding Medicare to some while leaving private insurance intact.Democratic presidential candidate Joe Biden, with CEO and President, Bob McGregor (R), takes a tour at McGregor Industries in Dunmore, Pennsylvania, July 9, 2020. - Biden has unveiled a sweeping $700 billion plan Thursday to help the battered US economy recover from the coronavirus crisis, a direct challenge to Donald Trump's \"America First\" agenda as they square off in the presidential race. (Photo by TIMOTHY A. CLARY / AFP) (Photo by TIMOTHY A. CLARY/AFP via Getty Images)It’s all okay, plausible, pragmatic, inoffensive—but like Biden himself, there’s nothing exciting or especially new. A “buy America” plan is hardly innovative, and in a way it’s a golden oldie. Congress first passed such a law in 1933, and politicians—including President Trump—have been pledging to strengthen it ever since.Story continuesBiden promises more fresh economic ideas in coming weeks, in an effort to address what may be his largest deficiency against Trump: the economy. Biden is beating Trump in nearly every poll, but on the economy voters still say they trust Trump more than Biden. Trump slashed business taxes and unwound regulations, which aren’t universally popular moves but may have given Trump strong branding as a pro-business president.It’s possible Biden can beat Trump without a catchy economic slogan or new ideas for boosting growth. Trump is deeply unpopular and the coronavirus recession arrived at the worst possible time for him. Trump has hurt himself further with an anemic response to the virus than undermines his self-image as a commanding “wartime” president. In reality, Trump has shifted responsibility for the virus response to others and repeatedly urged Americans to go back to business as usual, as if the virus isn’t even there. That’s backfiring as virus caseloads soar in mostly southern states that followed Trump’s dismissive attitude toward the risk.But Biden could still fall into the Clinton trap, if his economic plan amounts to a rehash of big-government programs from the past. One reason Trump won in 2016 is many voters lost faith in the government’s ability to solve problems that are depressing living standards and making it harder to get ahead. Trump might have been selling snake oil, but at least he wasn’t telling people bureaucrats in Washington would come to the rescue. Clinton, essentially, was, by deemphasizing private-sector innovation and talking up a laundry list of small-ball programs that might help, if only Washington could get its act together.Biden can do better with a canny combination of government relief efforts right for the moment, and a plan for American dominance in key industries of the future, such as quantum computing, green energy, artificial intelligence and space commerce. It’s crucial to include more Americans—way more—in prosperous technology industries and expand career opportunities as broadly as possible, beyond the coasts and university towns. And a plan for delinking affordable health care from employment could spur an entrepreneurship boom if some of the nation’s creative minds no longer cling to corporate work just for the benefits.Biden has one plan Americans are likely to hear more about. He’d establish a Pandemic Testing Board to develop a muscular federal response to the coronavirus and provide all resources necessary to contain the virus. He’d also build a public-health job corps of 100,000 contract tracers and other professionals to combat the coronavirus surge on the ground. If we still need such a program by November, it will be very bad news for the economy—but better than having no such program at all.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:The real risk to Trump from the Supreme Court’s ruling on his tax recordsEdgy voters might reject the 2020 election outcomeElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}