{"article": [{"url": "https://finance.yahoo.com/news/daca-trump-supreme-court-ruling-152240520.html", "published": 1592476220.0, "headline": "Supreme Court rejects Trump's attempt to end DACA", "body": "Today, the US Supreme Court rejected President Donald Trump’s attempt to dissolve the Deferred Action for Childhood Arrivals (DACA) program. The Obama-era immigration program has been widely supported by tech executives, many of whom spoke out in favor or DACA.Started in 2012, DACA allowed undocumented immigrants who arrived in the US before they were 16 years old (“Dreamers”) to obtain work permits and protections from deportation. Trump criticized DACA during his 2016 campaign. He attempted to dismantle the program in September 2017 but was quickly challenged in court.Hundreds of CEOs signed a letter urging Trump to keep DACA. Those included Amazon CEO Jeff Bezos, Facebook CEO Mark Zuckerberg, Twitter CEO Jack Dorsey, Apple CEO Tim Cook, Google CEO Sundar Pichai and Warren Buffett. Leaders from Airbnb, Dropbox, eBay, Fitbit, Foursquare, GoFundMe, LinkedIn, Lyft, Netflix, Netgear, Pandora, Tesla, Tumblr and Uber also signed the letter.A number of tech companies including Facebook, Google and Twitter went on to file amicus briefs in support of plaintiffs who challenged the DACA withdrawal in lower courts. Apple filed an amicus brief defending DACA with the Supreme Court. The general argument among tech companies is that DACA recipients make meaningful contributions to the US. According to CNBC, there were about 700,000 DACA recipients when Trump ordered the program to wind down.The Trump administration originally argued that former President Barack Obama did not have the legal authority to implement the program. In today’s 5-4 ruling, the Supreme Court decided that the Trump administration’s termination of DACA was “arbitrary and capricious” and that it violated federal laws around administrative procedure.“We do not decide whether DACA or its rescission are sound policies. ‘The wisdom’ of those decisions ‘is none of our concern,’” Chief Justice John Roberts wrote."}]}