{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-nursing-homes-162629862.html", "published": 1593776060.0, "headline": "How coronavirus ravaged a nursing home industry that was already 'in crisis'", "body": "The coronavirus pandemic has affected people of all races and ages and has particularly ravaged the nursing homes and assisted living communities across the U.S.Nearly 43% of the more than 125,000 U.S. coronavirus deaths have been linked to nursing homes, according to a recent New York Times analysis.Experts are attributing much of it to the lack of resources that nursing homes across the country are facing, along with their particularly vulnerable population.There are roughly 15,600 nursing homes in the U.S. with over 1.3 million residents and over 1.6 million staff members. (Photo: Getty Images)“Prior to COVID, the industry was definitely in crisis,” David Grabowski, a professor of health care policy at Harvard Medical School, told Yahoo Finance. “We’ve seen understaffing in a lot of buildings, quality of care problems, a number of closures in terms of nursing homes around the country. And I would attribute a lot of that to the economic model that the nursing homes operate under.”According to the Times analysis, “the virus has infected more than 282,000 people at some 12,000 facilities” as of June 26 and killed more than 54,000. There are roughly 15,600 nursing homes in the U.S. with over 1.3 million residents and over 1.6 million staff members.“We’ve seen just incredible shortfalls,” Grabowski said. “One nurse aide trying to care for 25 or 30 residents on her shift, and just really dire situations in different nursing homes around the country due to COVID.”There is no federal standard nurse-to-resident ratio at nursing homes, according to Fierce Healthcare, and no current national data on staffing due to the pandemic.“It’s the industry right now that needs support,” Grabowski said. “We need more personal protective equipment, more testing, and more support for these direct caregivers. They need hazard pay and benefits, and we need to recruit additional individuals into this workforce. Because otherwise, it just can’t continue down the path that we’re on right now.”Cases are surging in the southern part of the U.S. (Graphic: David Foster/Yahoo Finance)How it all beganIt all began at the end of February when both residents and staff at a nursing facility in Kirkland, Washington began displaying symptoms of coronavirus.Story continuesBy April, two-thirds of the residents, along with dozens of staff members, tested positive and 37 people linked to the nursing home died. Now, the facility is facing a $600,000 fine after state inspectors found it “did not have an adequate infection control system in place and failed to provide quality care, among other findings,” according to the New York Times.A recent NCAL survey found that many assisted living communities are running low on PPE such as N95 masks, surgical face masks, face shields, gowns, and gloves. And, more than half of nursing homes and assisted living communities have reported issues with lab processing times for coronavirus tests — 87% have said it’s taken two days or longer.“You really need those resources to manage the outbreak,” Grabowski said. “And many nursing homes in this country lack that. They certainly lack the PPE and the testing to keep it out. But then once in there, they really lack the workforce to manage.”A stretcher is moved from an AMR ambulance to the Life Care Center of Kirkland where one associate and one resident were diagnosed with the novel coronavirus (COVID-19) according to a statement released by the facility in Kirkland, Washington on February 29, 2020. (Photo: Jason Redmond / AFP) (Photo by JASON REDMOND/AFP via Getty Images)The most vulnerable populationAccording to the CDC, 8 in 10 deaths from the coronavirus in the U.S. have been in adults 65 years or older.“You have a particularly vulnerable population, so the elderly we know seem to be more susceptible to having cases when and if they are infected,” Dr. Carri Chan, a professor at Columbia Business School who focuses on operations management of hospital resources, told Yahoo Finance. “These people also have many interactions with individuals in their facilities, so living in tighter quarters, and if somebody is infected, the same caretaker may interact with multiple different residents.”Consequently, she added, “if it’s unknown that somebody is infected, it is possible that spread could actually happen quite rapidly. And because of the vulnerability of the population, it ends up being much more damaging than potentially somewhere, like for instance, an apartment building where the demographics of people living there are more heterogeneous.”The close environment makes it easy for the virus to spread between staff and residents.Judie Shape, 81, who tested positive for coronavirus, acknowledges press photographers gathered outside as her daughter Lori Spencer and husband Michael Spencer visit outside her room at Care Center of Kirkland. (REUTERS/Jason Redmond)“If it’s present where your staff live, they’re going to get the virus and they’re going to unknowingly bring it in and spread it at the building,” Grabowski said. “The way these buildings are set up, they’re very clustered. Two residents often in a room, shared bathrooms. The nature of the care is high touch. This is bathing and dressing and toileting. Many of these staff work across multiple buildings, so they’re not just spreading it down the hall. They’re spreading it out to other facilities. Once in there, it really spreads quickly.”Nursing homes, both in the U.S. and around the world, have begun cutting off access to non-residents in order to limit the spread of the virus.Chan cautioned that this could have a negative effect on residents as well.“We also have to be careful for this demographic to not entirely isolate the older population within our communities, because that, from a mental health standpoint, can also be quite damaging,” she said. “Finding ways to continue to provide the care that is necessary in a safe manner, so maintaining availability of PPE is important, both for the providers but also for visitors.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:U.S. nursing homes face 'a crisis on top of a crisis' with coronavirus and funding woesHospitals itch to ramp up elective surgery amid coronavirus profit crunchPrimary care doctor: 'We should all be very worried' about plunging patient visits amid pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}