{"article": [{"url": "https://finance.yahoo.com/news/the-real-risk-to-trump-from-the-supreme-court-ruling-on-his-tax-records-154154870.html", "published": 1594291760.0, "headline": "The real risk to Trump from the Supreme Court ruling on his tax records", "body": "There’s now at least one prominent crack in President Trump’s efforts to shield his tax returns and other financial records from investigators.The Supreme Court ruled on July 9 that Trump’s accounting firm must turn over financial records to the Manhattan district attorney, who is investigating possible fraud by Trump and his company. The Manhattan DA, Cyrus Vance, is probing whether hush payments Trump made to two women during the 2016 presidential campaign violated New York state law.Trump won a temporary reprieve from the Supreme Court in two other cases, in which the House of Representatives sought a wide range of records from Trump’s accounting firm and bank. The Supreme Court ruled those cases must return to a lower court for a more thorough review. The records might still head to Congress, but not until many more months of legal proceedings.It now seems unlikely Trump’s tax returns will become public before the November election, as many Democrats were hoping. Even if the Manhattan DA gets those records soon, they won’t automatically become public. The DA will use those records as part of its investigation, and they’ll likely remain secret until and unless there’s a trial.Bill Christeson holds up a sign that reads \"Follow the Money\" outside the Supreme Court, Thursday, July 9, 2020, in Washington. The Supreme Court ruled Thursday that the Manhattan district attorney can obtain Trump tax returns while not allowing Congress to get Trump tax and financial records, for now, returning the case to lower courts. (AP Photo/Andrew Harnik)Had the Supreme Court granted Congress immediate access to Trump’s financial records, they probably would have become public promptly. It’s not clear Congress could have legally released Trump’s personal financial information to the public. But it’s almost certain somebody would leak such information to the press, whether legal or not. Grand jury investigations such as the one in Manhattan are much tighter, with little leaking. So Trump’s records will probably remain sealed unless presented as evidence at trial. And if the DA declines to prosecute, they might never become public through that venue.A short-term victory for TrumpTrump erupted at the rulings, tweeting that “Courts in the past have given broad deference. BUT NOT ME!” He’s probably also incensed that his two appointees—Brett Kavanaugh and Neil Gorsuch—agreed with the majority in the 7-2 ruling compelling the accounting firm to turn over Trump’s records to the Manhattan DA.Story continuesStill, it’s a short-term victory for Trump. He will probably not have to explain whatever his tax returns might reveal before the election on Nov. 3. Those records would obviously show what Trump pays in taxes, if anything. It’s possible Trump’s personal tax liability is very low, on account of tax breaks real-estate firms such as his are legally entitled to. Trump’s presidential opponent, Democrat Joe Biden, paid about 33% of his income in federal taxes in 2018.President Trump, July 7, 2020 in Washington. (AP Foto/Alex Brandon)The bigger risk for Trump is legal jeopardy. Trump’s former lawyer, Michael Cohen, pled guilty to campaign-finance violations for his role as a middleman in the 2016 payments to the two women. It stands to reason that if Cohen was guilty of a felony for those payments, Trump is too, since he signed the checks. Federal legal proceedings in Cohen’s case referred to Trump as “Individual 1” and depicted him as a conspirator in cahoots with Cohen, which Cohen corroborated in Congressional testimony last year. Justice Dept. policy, however, discourages federal prosecution of a sitting president.That doesn’t apply to state prosecutions, however, and Vance in New York may be carrying forward an investigation where federal prosecutors left off. After the Supreme Court ruling, Vance said his inability to get Trump’s financial records had delayed his investigation by nearly a year. The probe will now resume, he said. That raises the possibility that Vance could indict Trump before Election Day on Nov. 3. Vance is a Democrat, and while he insists his office is above politics, he’d still have the pretext to bring charges for something that happened four years ago.Cohen pled guilty to the campaign-finance violations as part of a broader deal that also involved financial fraud and other crimes unrelated to Trump. The combative Trump seems unlikely to plead guilty to anything. One certainty of the Supreme Court ruling is that Trump’s legal battles will continue into the foreseeable future.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Edgy voters might reject the 2020 election outcomeTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}