{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-30-2020-221903237.html", "published": 1593530780.0, "headline": "Stock market news live updates: S&P 500 posts quarterly advance of 20% for index's best Q2 since inception in 1957", "body": "Stocks rallied into the close Tuesday to cap off the best second quarter for blue-chip equities since the S&P 500 was created in 1957.The S&P 500 surged nearly 20% for the April through June quarter, in a swift rebound from the index’s March lows as a historic infusion of fiscal and monetary stimulus to prop up individuals, business and the economy undercut concerns over the coronavirus’s spread.[Click here to read what’s moving markets heading into July 1]The advance marked the index’s best overall quarter since 1998. The Dow jumped more than 17.5%, and the Nasdaq outperformed with a greater than 30% gain for the second quarter, marking these indices’ best overall quarters since 1987 and 2001, respectively.Each of the S&P 500’s 11 sectors closed out the second quarter in positive territory. The consumer discretionary sector led with a 32.6% quarterly gain, followed by the information tech sector at 30.1%. The consumer staples and utilities sectors lagged, rising 7.3% and 1.8%, respectively, during the second quarter.By stock, Halliburton and Marathon Oil posted the biggest second-quarter rises in the S&P 500, with each advancing more than 80% as energy prices staged a recovery from a mid-April nadir. However, the stocks had been laggards in the first quarter, and each stock was still down by about half for the year to date through Tuesday’s close. West Texas intermediate crude oil prices rose 92% during the second quarter for the commodity’s best quarter since 1990, after a 66.5% slump in the first three months of the year.PayPal, Gap, eBay and Dish Network also led the S&P 500 higher, with each stock posting quarterly advances of more than 70%. Xerox Holdings, Apache Corp. and Biogen were the biggest laggards for the second quarter, with each dropping more than 15%.The three major indices also closed out June in the green for a third straight month of gains. The Nasdaq rose 6% in June, followed by the S&P 500 with a 2% gain. The Dow rose 1.7% for the month.Story continues—4:10 p.m. ET: Stocks rally into the close of a strong second quarterHere’s where the three major indices settled at the end of regular equity trading:S&P 500 (^GSPC): +47.05 points (+1.54%) to 3,100.29Dow (^DJI): +217.08 points (+0.85%) to 25,812.88Nasdaq (^IXIC): +184.61 points (+1.87%) to 10,058.77—1:15 p.m. ET: Mnuchin says additional stimulus would be ‘targeted to specific industries’ disrupted by pandemicTreasury Secretary Steven Mnuchin said Tuesday afternoon that any further fiscal relief to businesses would be “targeted to specific industries” most disrupted by the pandemic.Mnuchin added that he hopes the bill to repurpose Paycheck Protection Program (PPP) funds will pass by the end of July, when key measures provided by the original legislation are set to expire.His remarks came during congressional testimony alongside Federal Reserve Chair Jerome Powell before the House Financial Services Committee.—1:02 p.m. ET: Fauci warns new Covid-19 cases could jump to 100,000 per day without behavior changesDr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, said Tuesday before a Senate panel that new coronavirus cases could accelerate to 100,000 per day if the country does not manage to contain the latest outbreak in the virus. The current per-day increases in virus cases has hovered around 40,000 as of late.The resurgence in new cases in the South and West “puts the entire country at risk,” Fauci said.—10:50 a.m. ET: Dow rises to join S&P 500, Nasdaq in positive territoryThe Dow turned slightly positive mid-morning Tuesday as a more than 1% rise in shares of Intel, Goldman Sachs and Procter & Gamble – along with gains in some other components – offset a more than 5% drop in shares of Boeing.The real estate sector led gains in the S&P 500, after new data Tuesday showed home prices held up strongly in April even at the height of the coronavirus pandemic. The S&P CoreLogic Case-Shiller home price index added to a slew of recent data underscoring the strength of the housing market and residential home demand, despite the outbreak.—10:01 a.m. ET: Consumer confidence jumped more than expected in JuneA closely watched measure of consumer confidence jumped more than expected in June over May as lockdowns eased earlier this month.The Conference Board’s Consumer Confidence Index rose to 98.1 in June, rebounding from May’s reading of 85.9 in the index’s largest jump since 2011. The level was still, however, down sharply from its average reading of about 126 in 2019.Subindices tracking consumers’ assessments of current business and labor market conditions, along with their assessments toward future conditions, also each rose in June over May.\"Consumer Confidence partially rebounded in June but remains well below pre-pandemic levels,\" Lynn Franco, senior director of economic indicators at The Conference Board, said in a statement. “The re-opening of the economy and relative improvement in unemployment claims helped improve consumers' assessment of current conditions, but the Present Situation Index suggests that economic conditions remain weak.”“Looking ahead, consumers are less pessimistic about the short-term outlook, but do not foresee a significant pickup in economic activity,” Franco added. “Faced with an uncertain and uneven path to recovery, and a potential COVID-19 resurgence, it's too soon to say that consumers have turned the corner and are ready to begin spending at pre-pandemic levels.\"—9:33 a.m. ET: Stocks open flatHere were the main moves in markets, as of 9:33 a.m. ET:S&P 500 (^GSPC): +2.67 points (+0.09%) to 3,055.91Dow (^DJI): -33.96 points (-0.13%) to 25,561.84Nasdaq (^IXIC): +14.4 points (+0.1%) to 9,885.68Crude (CL=F): -$0.65 (-1.64%) to $39.05 a barrelGold (GC=F): -$2.30 (-0.13%) to $1,778.90 per ounce10-year Treasury (^TNX): -0.8 bps to yield 0.628%—9:00 a.m. ET: Home-price growth held up in April despite pandemicHome prices increased in April over last year even amid the coronavirus pandemic, according to the S&P CoreLogic Case-Shiller index. The index posted a 4.73% annual gain in April, up from March’s 4.35% rise. Consensus economists expected a 4.5% year-on-year rate.The 20-City composite index, which tracks home prices in 20 major metropolitan areas, rose 3.98% in April, up from March’s 3.92% year on year gain. Consensus economists had expected the index to decelerate to a 3.8% pace.—7:23 a.m. ET: Stock futures tick down ahead of the opening bellHere were the main moves in markets, as of 7:21 a.m. ET:S&P 500 futures (ES=F): 3,042.5, down 5.25 points or 0.17%Dow futures (YM=F): 25,430.00, down 67 points, or 0.26%Nasdaq futures (NQ=F): 9,963.5, down 10.25 points, or 0.1%Crude (CL=F): -$0.48 (-1.21%) to $39.22 a barrelGold (GC=F): +$1.40 (+0.08%) to $1,782.60 per ounce10-year Treasury (^TNX): unchanged to yield 0.636%—6:07 p.m. ET: Stock futures little changedHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:07 p.m. ET:S&P 500 futures (ES=F): 3,047.25, down 0.5 points or 0.02%Dow futures (YM=F): 25,482.00, down 15 points, or 0.06%Nasdaq futures (NQ=F): 9,981.25, down 7.5 points, or 0.08%Traders wearing masks work, on the first day of in person trading since the closure during the outbreak of the coronavirus disease (COVID-19) on the floor at the New York Stock Exchange (NYSE) in New York, U.S., May 26, 2020. REUTERS/Brendan McDermid—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}