{"article": [{"url": "https://finance.yahoo.com/news/colleges-are-backtracking-reopen-inperson-124357492.html", "published": 1596786680.0, "headline": "'An impossible situation’: U.S. colleges backtrack on reopening for in-person classes", "body": "American schools are faced with an unprecedented catch-22 amid the ongoing coronavirus pandemic: Either reopen safely and undertake the risk of a coronavirus outbreak or play it safe and provide unappealing remote classes for their students.Furthermore, with the lack of clear guidance from the federal level, schools and colleges are implementing varied approaches of remote or in-person learning (or a combination of the two), testing, preparing classrooms, and protocols for when significant transmission occurs.Many colleges initially planned to open campuses for in-person classes, betting on the fact that the coronavirus wouldn’t massively derail the safety of their campuses. But by the beginning of August, that number had dwindled: Now less than a quarter of schools are choosing to go the in-person route.College plans for the fall. (David Foster/Yahoo Finance)At the K-12 level, a list compiled by Education Week noted that most K-12 school districts are also playing it safe and opting for remote learning.In either case, the decision is extremely tough.“It’s completely appropriate for school districts to take every precaution, to do blended learning, to give parents and educators options ... there are no risk-free scenarios here,” former Education Secretary Margaret Spellings told Yahoo Finance’s On The Move (video above). “And as a part, and all of us as parents, we’re going to have to weigh the benefits of education and socialization ... against the safety risk.”‘College presidents are basically in an impossible situation’The first and most important question that schools — both K-12 and higher education — are considering is whether to resume face-to-face learning while implementing public safety measures like social distancing and mask requirements when on campus.Large colleges like Purdue University and North Carolina State University decided that students will return to their campus. Liberty University, a private college in Lynchburg, Virginia, is also planning to be fully open on Aug. 24. Oklahoma State University is bringing students back between Aug. 1 and Aug. 17.Story continuesBut others are backing off in-person classes as cases continue to spike in certain parts of the country.Cases are popping up all across the country. (Graphic: David Foster/Yahoo Finance)Among colleges, one trend is clear: Colleges are taking careful steps, even backtracking when necessary, before fully reopening.Spelman College in Atlanta announced in July that its campus would be reopening for the fall. A few weeks later, Spelman decided to pivot to an entirely online model.Georgetown University also reversed course from its decision in early July, citing the “acceleration of the spread of the virus and increasing restrictions on interstate travel” as the reason why it “cannot proceed with our original plans for returning to campus this fall.”Colleges that have made the decision to open up partially are coming up with various ideas for social distancing: In Texas, Rice University considered outdoor learning in tents as an alternative. (Students would have to bring their own portable chairs, and how these tent structures would be used and scheduled has yet to be determined.)“We are fortunate that our climate allows us to be outdoors for much of the academic year,” the school stated. “So we are also purchasing five open-sided tents (40 x 60 ft.) and placing them adjacent to academic buildings.”A student walks on the campus of Harvard University in Cambridge of Massachusetts, the United States, on July 14, 2020. (Photo by Fan Lin/Xinhua via Getty) (Xinhua/ via Getty Images)Rutgers is opting for an online-only semester and cutting fees for students by 15%, while Princeton and Rowan University are offering tuition discounts of 10% to undergrads.“College presidents are basically in an impossible situation,” Robert Kelchen, associate professor of higher education at Seton Hall University, told the Wall Street Journal. “If they announce they’re going online too soon, they run the risk of losing students and probably making some alumni mad at them. If they open up in person, there are serious health concerns, and they run the risk of protests and a vote of no-confidence.”Students are also making their voices heard in the reopening debate. One reporter noted that even though Harvard made plans for 40% of its undergrads to return to campus, only 25% will be coming back.Beloit College, a small private liberal arts school in Wisconsin, is slicing up the semester system, in case the pandemic gets worse and they need the flexibility.Beloit College campus, Beloit, Wisconsin. (PHOTO: Education Images/Universal Images Group via Getty Images)“We started thinking about the fall at the end of March,” Eric Boynton, provost and dean of Beloit College, told Yahoo Finance. “And over the space of April, we actually instituted some innovations about how to conduct our classes in the fall, and how to deliver our curriculum.”The 174-year-old Wisconsin-based school decided to shift from making students take 15-week semester-long classes to two modules: Students will take two classes in each module between September to October, and then two additional classes between October and December.“And so what happens when we have these mods in the first semester,” Boynton explained, “is there's a hinge point, a natural point, which we could either pivot to or away from campus, in relationship to whatever COVID or the pandemic is up to.”Whatever route schools end up choosing, the risk is clear: Even though the fall semester has yet to begin, a New York Times survey found 6,300 cases of COVID-19 tied to about 270 colleges from Austin to Philadelphia.A sign reminding people to wear face masks is seen in front of a library on Georgetown University's main campus in Washington, D.C., the United States, July 7, 2020. (Photo: Xinhua/Liu Jie via Getty Images)Test or no test?Decisions also vary on testing.At the University of Virginia, all graduate and undergraduate students who plan to return to the campus “will be required to submit a negative COVID-19 viral PCR test result” to the college before they return, the school announced on its website.Purdue officials told ABC that they plan to test every one of their 40,000 students with saliva kits before the semester.The timing of how often to do the test also varies.Yale is planning twice-per-week testing for undergrads and anyone else living on campus. The University of Chicago stated more vaguely that testing would be “upon their arrival and routinely throughout the year.”Some schools have spelled out what will trigger another shutdown: Syracuse University stated that if more than 200 students contract coronavirus at the same time, the university will discontinue in-person instruction, a student reporter tweeted.Liberty also has a hard line: If 5% of its total on-campus population (including faculty and staff) contract coronavirus, the school will suspend in-person instruction as well. And if 15% become infected, the school will close the campus entirely and dismiss students.(Screenshot/ University of Texas at Austin)The University of Texas at Austin also has spelled out what will trigger five different levels of closure, with the number of deaths being a major factor to weigh.Beloit, on the other hand, is advising students to stay home and quarantine for 14 days prior to arriving on campus. But the school is also exploring batch testing and arranging classes such that students don’t pass each other frequently on campus while also mandating mask wearing and health checks.Schools vs. collegesThough K-12 schools may not have the funds to match what these universities are doing, they do have some sort of rubric to follow when planning their reopenings.Looking at the “discrepancy between what is happening at the university level ... and the measures that we're talking about societally as we think about reopening K through 12 schools ... it's important for people to understand what universities are talking about and what risk mitigation looks like at the level of the university,” Sarah Fortune, chair of the Harvard T.H. Chan School of Public Health’s department of immunology and infectious diseases, said on a press call this week.Fortune noted that efforts by these universities effectively could serve “as a bar, that we should be striving for in our K to 12 schools.”And particularly when it comes to testing, universities are “really blanketing their communities with testing in order to open safely,” she noted, adding that elementary and K-12 schools should also be thinking of doing similar measures.Harvard students at Harvard University premises in Cambridge, MA, July 08, 2020. (PHOTO: Anik Rahman/NurPhoto via Getty Images)Safety of staffThe other big issue schools are grappling with is whether teachers, faculty, and administration staff are comfortable returning to the campus.For instance, if a teacher or a professor feels that they are exposing themselves to unnecessary risk of contracting coronavirus by interacting with students face to face, can they refuse? And what happens if they can’t?“That concern is justified, especially if you’re in a hotspot,” Spellings, who is now the CEO of non-profit Texas 2036, said.But ruling out face-to-face instruction across the entire American education system from kindergarten to colleges — i.e. another lockdown — is an “ill-conceived” idea, she warned.A second grade teacher teaches online in her empty classroom on April 15, 2020 in Goshen, Kentucky. (PHOTO: Andy Lyons/Getty Images)For teachers and educators, Daniel Altchek, labor and employment partner at Saul Ewing Arnstein & Lehr, who regularly advises schools, said that these situations will be tricky.“There’s a couple of vehicles where they can typically express those concerns” about returning to work and possibly contracting the virus, he explained.For K-12 teachers, they can ask their union for support. The unions are very aware of this issue: On Tuesday, the second-largest teachers’ union in the country announced that it was authorized to strike as a “last resort” measure if teachers fail to reach an agreement with state and federal authorities over safely reopening schools.For higher ed, it’s a little more complicated.“Most higher ed has sort of campus governance structures, such as the faculty senate, those types of bodies … where they do have a pretty strong voice on campus,” Altchek explained. Concerns can be escalated to the administration, and there are also legal protections for faculty.In any event, directives from the Centers for Disease Control and Prevention (CDC) and Occupational Safety and Health Administration (OSHA) will play a key part in how employers deal with concerns.This is the one of the barriers against COVID-19 that the University of Georgia set up. pic.twitter.com/34MCpJEwGo— colette arrand (@colettearrand) August 6, 2020And whether or not all universities get some legislation that protects them from lawsuits from employees that say they contracted coronavirus is unclear. But he hasn’t seen indications of an “avalanche” of lawsuits, he added.That assertion is true to an extent. Politico reported that lawsuits tracked by law firm Hunton Andrews Kurth found that out of the 3,727 coronavirus-related suits that have been filed since March, less than 5% fall into the “personal injury” category, i.e. plaintiffs claiming that they had exposed to coronavirus on the premises.Some schools are asking students to sign a liability waiver to protect themselves against litigation if students catch coronavirus on campus.Spellings noted that the lack of guidance from the federal level was definitely an issue.“What are we going to do when the eventualities happen, with teachers becoming affected, and students ... do you close the entire school?” she asked. “Do you sequester for two weeks? How do you think about testing.”At the same time, going fully online or locking down again “is really going to hurt a generation of students, especially those most at risk,” Spellings said.A University of South Florida student on July 2, 2020 in Tampa, Florida. (PHOTO: Octavio Jones/Getty Images)‘Stiff headwinds’Any path forward will be fraught with peril, experts said, especially for higher education.“We've had the higher education sector on a negative outlook for three years,” Jessica Wood, higher education sector lead for S&P, told Yahoo Finance. “There's been pressure across the industry for several years, from a competitive standpoint, from an affordability standpoint and from an enrollment standpoint.”The pandemic will exacerbate those issues.“When you add in COVID and the pressures that shelter-in-place directives have had on campuses, and then you add in the current recessionary environment, we do think it — and we’ve been saying it for a couple of years — that it's likely that weaker institutions will face significant pressure in the coming year or two, and we will see more closures,” Wood said.Back in Wisconsin, Boynton echoed those sentiments.“There are stiff headwinds facing this industry to be sure, no doubt about it,” he said, before adding that “there is plenty of opportunity for colleges to find ways to not only survive, but thrive in this climate — but it will require all sorts of creative work.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:Coronavirus: 'We cannot' put kids in schools 'if we have a very high level of transmission,' doctor warnsSchools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}