{"article": [{"url": "https://finance.yahoo.com/news/ultrawealthy-investors-are-hoarding-cash-weeks-before-the-presidential-election-tiger-21-advisor-160037535.html", "published": 1598440100.0, "headline": "Ultra-wealthy investors are hoarding cash weeks before the presidential election: advisor", "body": "The rich hope to stay that way weeks removed from a highly uncertain presidential election.And they are hoarding cash as part of that effort.Tiger 21, a membership-based organization of wealthy investors that have close to $80 billion in combined assets under management, found in their latest summer survey that 62.6% of its members have built cash reserves in the past three months. That’s despite the stock market essentially being on autopilot of late even as the COVID-19 pandemic rages on.The total current cash position for the group stood at an average 19% of one’s portfolio, well above the levels seen among most portfolio managers on Wall Street. Cash levels clocked in at 12% of the average portfolio in Tiger 21’s survey last quarter.The reason behind the cash raising is straightforward: Tiger 21 says the group is just wildly unsure how the medium-term will shake out in the fight against COVID-19 and the race for the presidency. Investors polled by Tiger 21 say they are selling public equity, private equity and collectible investments such as second homes to raise cash.Credit Getty“Our members are concerned about the uncertainties coming. It’s not just the election. It’s how are we going to get back to a normal economy. The stock market is surging, but that only represents 15% to 20% of the labor force. Our best estimates are 80% of the labor force where all the pain is, not in the public companies. And we know on Main Street there are a lot of issues going on. So it’s interest rates. It’s the concern about all the money flooding in and how much of that money is actually distorting the markets and how long will that last,” Tiger 21 founder and chairman Michael Sonnenfeldt told Yahoo Finance’s The First Trade.Sonnenfeldt points out one area where his group of investors are split right now is on the impact of Joe Biden becoming president. Theoretically, Biden’s promise to raise taxes on people earning more than $400,000 a year could wallop the rich.Story continuesAdded Sonnenfeldt, “Some of our members are concerned about paying taxes depending on how they think the money is being spent. Is it being spent wisely? Others believe that you can’t have a functioning society without having roads and a military, and you have to pay your fair share.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}