{"article": [{"url": "https://finance.yahoo.com/news/president-trump-h-1b-visa-ban-jobs-and-economy-182009144.html", "published": 1593178100.0, "headline": "CEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperity", "body": "President Trump’s visa ban has shaken the collective business community. But the tech industry is among the most severely affected, and executives have reacted swiftly and vociferously, expressing frustration and disapproval with the decision.Trump signed an executive order on Monday that prevents hundreds of thousands of foreigners looking to work in the United States through the end of 2020. The ban, effective on Wednesday, affects high-skilled H-1B applicants and their immediate family members, who come to the country on the H-4 visa.Business leaders have called this decision to suspend avenues of legal immigration ‘too broad,’ ‘short-sighted,’ and ‘deeply damaging,’ and will have a lasting impact on the nation’s ability to attract and retain talent. Rather than providing more Americans with opportunity, the ban will merely make the U.S. a less competitive nation, according to Boston Consulting Group CEO Rich Lesser.“Talent has been the fuel for this country for 100 years-plus as the driving force, and to the extent that top talent sees it as risky to come to the U.S. because you come to study or take a job — you normally don’t come just for that first move, you come for the moves that can come after that,” Lesser said in an interview with Yahoo Finance this week.“So it's not just about at this moment in time, but ‘Could I build a career here? Could I be here five years, 10 years?’ The riskier that sounds, the more top talent has plenty of other places to go, including just north of the border, that's made it crystal clear that they want top talent from around the world,” he added.Last week, the Institute for Management Development’s eighth annual global competitiveness report found the U.S. dropped from third place to No. 10. The IMD derives its rankings based on a variety of factors, including the economic picture, openness of societies, political stability, and social and gender equality. Singapore, Denmark and Switzerland took the top three spots in this year’s report.Story continues“Our ability to show that we're resilient as a country is under strain right now. The resurgence in coronavirus that we see in many parts of the country is a real issue, particularly when you contrast the U.S. and Europe right now. It’s meaningfully different...you also need to show investors and talent and the business community that this is a resilient place that can handle adversity and come through it strong. And the jury’s out on it, but right now there are real concerns, legitimate concerns,” said Lesser.‘Built on being a magnet for talent from all around the world’According to the Trump administration, the executive order is intended to free up jobs for Americans, as more than 47 million people filed for unemployment insurance since the pandemic first upended the economy 14 weeks ago. The monthly jobless rate rebounded to 13.3% in May, but still remains at historically high levels.The visa ban has merely illuminated the incongruence between Trump’s rationale of prioritizing American jobs and the reality and requirements of the jobs themselves.Sixty-four percent of Americans believe legal immigrants currently in the country are mostly filling jobs that U.S. citizens do not want, according to a recent Pew Research study. Also, as the progressive think tank Economic Policy Institute points out, a fundamental flaw of the H-1B program is that it allows U.S. employers to legally underpay workers relative to U.S. workers in similar occupations in the same region.KENOSHA, WI - APRIL 18: President Donald Trump signs an executive order to try to bring jobs back to American workers and revamp the H-1B visa guest worker program during a visit to the headquarters of tool manufacturer Snap-On on April 18, 2017 in Kenosha, Wisconsin. (Photo by Scott Olson/Getty Images)“The digital divide in this country is enormous. This crisis is highlighting the digital divide. There's a lot of top talent that's homegrown in the U.S., a lot of people to be very proud of. But this country has been built on being a magnet for talent from all around the world. To use cutting off of foreign talent as the basis to try to build American talent is unlikely to be successful,” said Lesser.Lesser acknowledged a handful of American employers and workers could benefit marginally from this decision, but reiterated how harmful and myopic the move could be from a broader perspective.“It risks encouraging talent to be overseas and makes it much harder to be a magnet to spur future innovation and growth…[I think] the offsetting cost will be much higher and I would so much rather take that same amount of investment and put it into education support and bridging the digital divide...,” he said. “We absolutely need to invest in talent in the U.S., it's essential. But this path, cutting off others as the basis to do it [isn’t] the best path to get there, short or long term.”Over the past several years, nearly three-quarters of the annual supply of 85,000 H-1B visas have gone to workers in the technology industry, according to reporting from the Los Angeles Times. Amazon and its subsidiary AWS received the most H-1Bs of any company last year, hiring 3,026 high-skilled foreign-born workers. Google, Facebook and Apple are among other top employers of H-1B visa holders.Many of the tech executives themselves are beneficiaries of the H-1B visa program. Sundar Pichai first came to the U.S. on a student visa, but was ultimately able to start his career at McKinsey on an H-1B visa. He then rose through the ranks at Google (GOOG, GOOGL), eventually becoming CEO of one of the most powerful companies in the world. Satya Nadella, the chief executive of Microsoft (MSFT), also started his career journey on an H-1B.In addition to H-1B visa applicants and their families, those on H-2B (temporary, often seasonal workers) L (intracompany transfers of employees in executive or managerial roles or those with specialized knowledge) and J (work-and study-based exchange visitor programs) visas are also included in the suspension.Trump’s decision comes a week after the administration was defeated on a separate immigration policy — the Supreme Court upheld the Obama-era Deferred Action for Childhood Arrivals program, protecting Dreamers who were brought to the United States as children.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:If Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAnti-racism movement leads to 'Cops,' 'Gone With the Wind' being pulled from platformsAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and moreTech CEOs decry racial injustice amid George Floyd protestsJack Dorsey’s $1 billion pledge sparks discussion around UBI ‘I feel lost’: America’s freelancers left without income amid coronavirus financial crisis"}]}