{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-crisis-will-reveal-which-startups-are-houses-of-cards-fast-company-editorin-chief-123407308.html", "published": 1592638940.0, "headline": "Coronavirus crisis reveals which startups are 'houses of cards': Fast Company Editor-in-Chief", "body": "Layoffs at high-profile tech giants like Uber (UBER) and Lyft (LYFT) grabbed headlines in recent weeks, though the novel coronavirus has also decimated the next generation of aspiring unicorns, forcing some to close permanently.Some promising ventures may succumb to unfortunate circumstances, but the economic crisis also reveals which early-stage companies can draw on the effective leadership and sustainable business model necessary to weather a downturn, says Stephanie Mehta, the editor-in-chief of business publication Fast Company.“We're going to see the companies that actually have real business plans and real models that will be able to sustain them on the other side,” says Mehta, in a newly released interview, taped on April 27.“For a lot of them, we're going to see which ones were just, to mix my metaphors, which were houses of cards.”“The worry I have without necessarily being able to look at any one company's books or look at any one company's financial situation is that I think it's on that leadership front,” adds Mehta, a former business reporter at The Wall Street Journal and executive editor at Fortune.“A lot of these companies are sort of ill-equipped to deal with the cultural stress all of this is going to put on their companies,” she says.More than 500 tech startups have laid off over 60,000 people since the the spread of the coronavirus in the U.S. became widely known in mid-March, according to a tracker created by layoffs.fyi, which draws on media reports. That month, open positions at the 30 most valuable start-ups in the United States fell 19%, according to Thinknum Alternative Data reported by the New York Times.The economic pain has struck even trendy sectors like artificial intelligence and co-working spaces. Starsky Robotics, a San Francisco-based driverless company that had raised more than $20 million, closed in March. Flexible office-space provider Knotel laid off half of its 400 employees, and competitor Convene laid off a fifth of its staff and furloughed half of remaining employees.Story continuesMehta said the economic headwinds may be compounded by new or young founders who lack experience managing companies in turmoil.“A lot of the companies that Fast Company writes about got started in 2008, 2009, 2010,” she says. “So these are founders and CEOs and leadership teams that have never been through a downturn — have never been through a crisis.”Fast Company Editor-in-Chief Stephanie Mehta appears on \"Influencers with Andy Serwer.\"Mehta made the remarks in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Since 2018, Mehta has served as the editor-in-chief of Fast Company. Prior to her current position, she worked in various reporting and editing roles at the Wall Street Journal, Fortune, Bloomberg, and Vanity Fair.At Fortune, she worked with Serwer, who left the publication in 2014 and became Editor-in-Chief of Yahoo Finance the following year.The exact ramifications of the downturn for the startup community remain difficult to pin down, Mehta noted, citing the sudden economic damage and the long expansion that preceded it.“This crisis is so unknowable in so many ways, given the speed with which we've seen big unemployment numbers, and coupled with the fact that it's been a really long time since we've had any kind of economic downturn to speak of,” she says.Mehta recalled an observation made to her by Ellen Coleman, the former CEO of DuPont who took over the chemical giant in 2008, amid the Great Recession: “She said, ‘When the tide is out, you see all the rocks on the beach.’”Read more:Michael Dell: ‘Not enough’ progress on diversity in the tech industryU.S. needs 'cultural transformation' after George Floyd's death: Chase KochMelinda Gates: Some governors are ‘moving too fast’ to reopen their states‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}