{"article": [{"url": "https://finance.yahoo.com/news/we-need-more-funding-for-police-missouri-ag-schmitt-155616526.html", "published": 1592564660.0, "headline": "‘We need more funding for police’: Missouri AG Schmitt", "body": "In the wake of President Trump signing an executive order for police reform Tuesday, Missouri Attorney General Eric Schmitt says he believes police should get more money to carry out their work.“I would argue we need more funding for police,” Schmitt told Yahoo Finance. “But I also freely concede the point that this isn’t just about policing. There’s a lot of other issues involved if we’re serious about tackling these issues.”In St. Louis, the police department has an operating budget of $134.5 million for the year 2020. This year, Missouri Gov. Mike Parson announced budget cuts as the state faces revenue shortfalls thanks to the coronavirus pandemic. The more than $200 million in budget restrictions hit the state’s schools, but left the policing budget untouched.“I do think there’s a discussion beyond just reforms as it relates to policing we ought to be having,” Schmitt said.Schmitt highlighted education and “increased” choice as the first place to start, but applauded the president’s executive order, calling it a “really important step moving forward,” and stated it was part of “ongoing dialogue.”And while additional training and moves from Congress are needed moving forward, the AG says he doesn’t support any initiatives around defunding the police.It “would really inhibit the ability to do a lot of the things being talked about,” Schmitt said. “Additional money for training, bodycams, dashcams, those sorts of things.”“At a time where we’re rising crime rates in a lot of our cities, removing that funding, critical funding for police departments to do that dangerous work, would be a huge mistake.”Participants raise their fists in solidarity during a moment of silence for those lost to police brutality, under the Gateway Arch during a rally in St. Louis on Sunday, June 14, 2020. (Robert Cohen/St. Louis Post-Dispatch via AP)The Attorney General has supported other reforms in the state in the past, particularly in the St. Louis area. After discovering that St. Louis received its biggest source of revenue from writing traffic tickets, the AG sued the city to end the practice.In talking with Yahoo Finance, the AG said police applauded the move as it enabled them to do more “community policing.”Story continuesHe also supported ending residency requirements for police officers, a move that many activists say could limit efforts for community policing.“There were significant reforms in the wake of Ferguson here in Missouri,” Schmitt said, referring to the 2014 shooting of Mike Brown and the ensuing protests, “that I think other local communities might adopt. This is a big, broad national discussion.”“But I think community policing, body, dashcams, training, de-escalation — these are important things by the way that are not accomplished if you defund police departments.”Schmitt added that the issue is how to “deal with police officers that should no longer wear the uniform,” pointing to the murder of George Floyd at the hands of Minneapolis police.“My assumption is that will be something we deal with moving forward,” he said. “This is an important conversation for us to have.”“Quite frankly, we’ve been having that conversation over the last five years post-Ferguson here in Missouri, and the rest of the country I think is starting to have that conversation too.Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:Why Black wealth has stayed 'relatively flat' since Tulsa massacreFormer Obama advisor Valerie Jarrett talks protests, defunding police, and criminal justice reformCoronavirus pandemic could wipe out Social Security 4 years earlier than predicted: Wharton ModelRepublican states to see biggest economic boosts from reopening amid coronavirus crisisOver 4 million in US will contract coronavirus if states fully reopen: Wharton modelRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}