{"article": [{"url": "https://finance.yahoo.com/news/school-coronavirus-transmission-174052056.html", "published": 1594903700.0, "headline": "Coronavirus: 'We cannot' put kids in schools 'if we have a very high level of transmission,' doctor warns", "body": "This post has been updated.Educators and school administrators are finding themselves caught between balancing the White House’s desire to reopen schools and the risks to public safety.The driving force in any decision should be the rate of coronavirus transmission in a specific locality, one public health expert explained.Read more: Here are the retailers requiring customers to wear face masks“We all want to get our kids back to school — getting our kids back to school is so important,” Dr. Anne Rimoin, a professor at the UCLA School of Public Health, told Yahoo Finance’s The First Trade (video above). “That being said, we cannot do it in unsafe conditions. And if we have a very high level of transmission like we do here in Los Angeles, it is not safe to put kids back in school and to put teachers and staff in a position of potentially being exposed.”Coronavirus is surging in southern U.S. (Graphic: David Foster/Yahoo Finance)Epidemiologists generally agree that community spread of coronavirus cannot be controlled if the positivity rate of those tested is above 5%. There are nearly 150,000 confirmed cases of coronavirus in Los Angeles County, home to roughly a quarter of the state’s population, with a positivity rate of nearly 10%.The 7-day moving average for the state of California was 7.1% as of Sunday, and the average for the country is 8.5%.Positivity rate of coronavirus testing. (Johns Hopkins)Schools from Los Angeles to Nashville to Atlanta have already decided that they will begin the new school year in the fall online. And despite the troubling numbers, the Trump administration is pushing for schools to open with full in-person classes for the upcoming school year.“We do want to get our schools open,” President Donald Trump stated in an interview with Georgia’s WSB-TV Channel 2 on Thursday. “There’s virtually no impact on children. They’re just stronger than we are.”Highlight: \"It's crazy to open up the schools for in-classroom if you have a 10, 15, 20, 25% infection rate like you see in some of these states,\" Connecticut @GovNedLamont says. \"I think we've mitigated the risk here [in CT]. We're going to have all the kids wearing masks.\" pic.twitter.com/HPgJKTvxde— Yahoo Finance (@YahooFinance) July 17, 2020‘What we really need is information’Story continuesOne thing that complicates matters is that it’s not entirely clear how the coronavirus virus spreads among children, Dr. Rimoin noted.“So what we really need is we need information,” she said. “We need good data … on how [the] virus spreads in children and who is at risk, and we need a massive investment in the school system.”Furthermore, teaching through this pandemic is “really, really tough,” Tish Jennings, an associate professor at the University of Virginia, who studies how stress affects teachers, told Yahoo Finance.A second grade teacher talks to her students in her classroom on April 30, 2020 in Goshen, Kentucky. (PHOTO: Andy Lyons/Getty Images)And while teachers are getting some support from their school principals, “it's really taken an Herculean effort to get these schools to shift this way,” Jennings added. “It's not an easy thing to do at all ... We haven't done a good enough job of preparing for another shutdown or continued shutdown. And at the same time we haven't done a good enough job managing the coronavirus.”Dr. Rimoin said that more money could definitely help accelerate the push to reopen, so that schools can invest in the right equipment to prevent transmission.“We need billions of dollars to get these schools ready to come back in… everybody wants schools to open, everybody wants the economy to come back,” she said. “But the only way forward is to … do with these blunt public health instruments, [like] wearing a mask, social distancing, hand hygiene. … They don’t seem like big, exciting magic bullets, but they work.”Correction: We removed an embedded tweet from this post because the quote included was not substantiated.—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:Schools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemic'It’s a freaking circus': Unemployed Americans share tales of an overloaded system'Struggling so severely': Coronavirus exposes the gulf between the haves and have-notsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}