{"article": [{"url": "https://finance.yahoo.com/news/tesla-bear-says-long-term-thesis-still-intact-sees-7000-price-target-by-2024-210751224.html", "published": 1598631320.0, "headline": "Tesla bull says long-term thesis 'still intact,' sees $7,000 price target by 2024", "body": "Tesla (TSLA) shares will start trading at their new split-adjusted price on Monday.The stock closed down 1% on Friday at $2,213, after touching an intraday high earlier in the day.The electric vehicle maker’s shares are up about 40% since announcing a 5-for-1 split earlier in August, the first in the company’s history.“A stock split now especially with fractional shares shouldn’t have that big of an impact,” Tasha Keeney, an analyst at ARK Invest, told Yahoo Finance’s The Ticker.2020 models charge outside a Tesla dealership Sunday, Aug. 23, 2020, in Littleton, Colo. (AP Photo/David Zalubowski)“But of course you could see some price appreciation from investors basically misunderstanding it, thinking that it might be cheaper,” she added.The split does not change the fundamentals or valuation of the company. Shares at a lower price point are seen as a as a way to make them more accessible to individual investors.“The long term story with Tesla, our thesis is still intact,” said Keeney. “Our expected value for Tesla by 2024 is still $7,000.”Keeney says COVID-19 has solidified Tesla’s lead in the electric vehicle space, as the pandemic has slowed down efforts by other manufacturers working on EV.“If you think of a traditional automaker who is investing in electric vehicles — and basically how they’re going to handle that when their core business has really been sinking,” said Keeney, “It’s not their core expertise.”“On the autonomous front we still see Tesla [with] much more skill than any other automaker, than any start-up because it’s using its customer fleet to collect data,” she said.“We think it’s a leader in electric vehicles and full autonomy and we think it’s 3 to 4 years ahead of the competition on that front.”Tesla’s latest 2nd quarter results announced in July beat expectations. The company posted a fourth consecutive quarter of GAAP profitability making the stock eligible to be considered for inclusion in to the S&P 500 (^GSPC).Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Editor’s note: The original headline of this article was changed to correct an editorial error. Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreStory continuesBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}