{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-october-9-2020-221531060.html", "published": 1602256580.0, "headline": "Stock market news live updates: S&P 500, Nasdaq post best week since July with stimulus talks in focus", "body": "Stocks traded higher Friday as investors continued to mull chances of a virus-relief package amid mixed signals from officials as to what size of a proposal they might support.The S&P 500 and Nasdaq each posted their best weekly gain since July as of Friday’s close, rising about 3.7% and 4.6%, respectively. The Dow gained 3.3% on the week for its best gain since August.Traders have closely monitored developments out of Washington to weigh whether a comprehensive or partial stimulus package might emerge before Election Day on Nov. 3, with additional relief measures viewed as a key tenet in encouraging the recovery in the virus-stricken economy. The Department of Labor’s weekly report on new jobless claims Thursday morning showed a worse than expected 840,000 individuals filed for first-time unemployment insurance benefits last week, though continuing claims dipped back below 11 million for the first time since late March.President Donald Trump said during Rush Limbaugh’s radio show Friday afternoon that he wants to “see a bigger stimulus package, frankly, than either the Democrats or Republicans are offering.” The remarks marked an about-face from his stance earlier this week, when he said in a Twitter post that he had told his negotiators to end stimulus talks until after the election, promptly sending markets tumbling.But earlier in the day Friday, multiple outlets reported that the White House intended to offer a stimulus proposal totaling $1.8 trillion, for a sum about $400 billion below the plan House Democrats voted to advance last week. This, however, would still mark an increase from the $1.6 trillion Treasury Secretary Steven Mnuchin had floated in prior discussions with Pelosi.Adding to optimism around a deal in some form, White House economic adviser Larry Kudlow told Fox Business on Friday that President Donald Trump “wants to do a deal.”A day earlier, Speaker Nancy Pelosi and Mnuchin discussed further stimulus in an about 40-minute conversation Thursday afternoon, Pelosi’s spokesperson Drew Hammill said in a Twitter post.Story continuesHammill reported that Mnuchin “made clear the President’s interest in reaching” an agreement on a comprehensive package, after Pelosi said earlier in the day that she would not support a standalone proposal aimed at providing aid only to airlines. However, the White House has offered mixed signals as to whether it would in fact support a broader legislative package, with Trump and White House spokespeople offering conflicting takes on their willingness to back a more comprehensive proposal over the past couple days.“A compromise on a big stimulus package in Washington could potentially deliver another October surprise, but the odds are against it as Election Day approaches,” Jeffrey Buchbinder, LPL Financial Equity Strategist, said in a note. “The optics of getting nothing done aren’t great on either side, and there are a lot of close Senate races right now, suggesting there still may be a glimmer of hope for a deal by November 3.”—4:06 p.m. ET: Stocks close the session, week higher as traders eye stimulus talksHere’s where the three major indices settled at the end of Friday’s regular session:S&P 500 (^GSPC): +30.3 points (+0.88%) to 3,477.13Dow (^DJI): +161.39 points (+0.57%) to 28,586.90Nasdaq (^IXIC): +158.96 points (+1.39%) to 11,579.94—12:46 p.m. ET: White House reportedly boosts stimulus offer to $1.8 trillionThe White House reportedly now intends to offer a stimulus proposal totaling $1.8 trillion, for a sum about $400 billion below the plan House Democrats voted to advance last week, according to outlets including Bloomberg and CNBC.Previously, Treasury Secretary Steven Mnuchin floated a $1.6 trillion proposal during negotiations with House Speaker Nancy Pelosi.White House economic adviser Larry Kudlow also said during Fox Business on Friday that President Donald Trump “has approved a revised package.“He would like to do a deal,” Kudlow said during the interview.—9:32 a.m. ET: Stocks open higher, tracking toward weekly advancesHere were the main moves in markets, as of 9:34 a.m. ET:S&P 500 (^GSPC): +21.45 points (+0.62%) to 3,468.28Dow (^DJI): +156.61 points (+0.55%) to 28,582.12Nasdaq (^IXIC): +74.85 points (+0.66%) to 11,495.04Crude (CL=F): -$0.11 (-0.27%) to $41.08 a barrelGold (GC=F): +$29.50 (+1.56%) to $1,924.60 per ounce10-year Treasury (^TNX): +1.5 bps to yield 0.782%—9:06 a.m. ET: Xilinx shares surge after reports AMD is eyeing a takeoverAdvanced Micro Devices (AMD) is reportedly in advanced talks for a takeover of peer chipmaker Xilinx (XLNX) in a deal that could be worth $30 billion, according to the Wall Street Journal. The deal announcement could reportedly come as soon as next week. Shares of Xilinx surged more than 16%, while AMD fell about 3% in pre-market trading.Xilinx, which makes programmable chips used in networks, autonomous vehicles and data centers, could help AMD push further into telecommunications industries, especially as carriers build out their forthcoming 5G networks. The company could also help position AMD as a more formidable competitor to Intel (INTC), which to now has had a major hold over the market for computer chips used in data centers.Representatives from AMD and Xilinx did not immediately respond to a Yahoo Finance request for comment regarding the reported deal.—7:17 a.m. ET Friday: Futures hold onto overnight gainsHere were the main moves in markets, as of 7:17 a.m. ET Friday:S&P 500 futures (ES=F): 3,451.25, up 13.75 points or 0.4%Dow futures (YM=F): 28,424.00, up 114 points or 0.4%Nasdaq futures (NQ=F): 11,573.5, up 34.5 points or 0.3%Crude (CL=F): -$0.33 (-0.8%) to $40.86 a barrelGold (GC=F): +$26.80 (1.41%) to $1,921.90 per ounce10-year Treasury (^TNX): +0.2 bps to yield 0.769%—6:04 p.m. ET Thursday: Stock futures open higher as investors eye stimulusHere were the main moves in equity markets, as of 6:04 p.m. ET:S&P 500 futures (ES=F): 3,450.00, up 12.5 points or 0.36%Dow futures (YM=F): 28,422.00, up 112 points or 0.4%Nasdaq futures (NQ=F): 11,573.25, up 34.25 points or 0.3%Traders wearing masks arrive before the opening bell at the New York Stock Exchange (NYSE) on May 26, 2020 on Wall Street in New York City. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}