{"article": [{"url": "https://finance.yahoo.com/news/july-jobs-report-disney-earnings-what-to-know-in-the-week-ahead-144837604.html", "published": 1596362180.0, "headline": "July jobs report, Disney earnings and more: What to know in the week ahead", "body": "Following last week’s tech-heavy batch of corporate quarterly results, earnings season will continue this week with more blue-chip companies including Disney (DIS) set to report.Investors are also poised to receive more updates on the state of the US labor market, with the Labor Department’s July jobs report due for release at the end of the week. The ADP National Employment Report on private payrolls, and Thursday’s weekly report on initial unemployment claims are also set to be closely watched. These reports come as Congress continues to debate the eventual shape of the next virus-related stimulus package, with enhanced unemployment benefits from the first set of stimulus having expired at the end of last week.EarningsEarnings season rolls on with another busy week of quarterly reports. The plethora of names set to report span newly public firms to established corporate leaders, and companies that have benefited from stay-in-place orders to those that have struggled with decimated demand.Disney (DIS) will be one of the central reports this week, with different facets of the entertainment giant’s business hit disparately by disruptions due to the pandemic. In its fiscal second quarter, Disney delivered an earnings miss after closures of the company’s theme parks and disruptions to movie production and releases outweighed a surge in Disney+ and ESPN+ streaming subscribers. The Disney+ subscriber base grew to 54.5 million subscribers as of early May, hitting that sum within six months of launch.Visitors wearing protective face masks walk at the Disneyland theme park after it reopened following a shutdown due to the coronavirus disease (COVID-19) in Hong Kong, China June 18, 2020. REUTERS/Tyrone SiuPartway through its fiscal third quarter, Disney reopened both its Shanghai and Hong Kong theme parks, with some restrictions on attendance. In July – after the end of the third quarter – its Hong Kong theme park was temporarily shut again due to a spike in coronavirus cases in the region. The company also reopened its Florida Disney World and Paris Disneyland locations in July, with modified capacity.Other companies’ reports will also be of high interest this week. Clorox (CLX) is due to report on Monday, following strong results from peer personal care companies including Kimberly-Clark, Colgate Palmolive and Procter & Gamble earlier this earnings season, with home goods and personal health-care products still seeing high demand among consumers.Story continuesSome travel companies crushed by the pandemic are also set to report, including Norwegian Cruise Line Holdings (NCLH) and Wynn Resorts (WYNN). As with the airlines, these companies have struggled to readjusted operations and slash costs quickly to accommodate a severe reduction in demand, amid myriad travel restrictions and stay-in-place orders domestically and abroad.A set of newly public companies are also due to report results this week, including Virgin Galactic (SPCE), Nikola (NKLA), Uber (UBER) and Beyond Meat (BYND).Nikola’s quarterly report Tuesday will mark the company’s first since its June listing via SPAC merger. The company’s market capitalization was sitting at more than $10.8 billion as of Friday, despite the maker of battery-electric and hydrogen-powered trucks having not sold a single vehicle yet.As of Friday, companies comprising about three-quarters of the S&P 500’s market capitalization had reported second-quarter results. Companies largely topped a low bar of expectations, with consensus estimates having spanned wide ranges due to a general lack of guidance, and lack of precedent on the impact of a global pandemic on corporate profitability. Of the companies that had reported so far, 84% surprised to the upside on earnings per share (EPS), according to a note from FactSet’s John Butters on Friday.“If 84% is the final percentage, it will mark the highest percentage of S&P 500 companies reporting a positive EPS surprise since FactSet began tracking this metric in 2008,” he said.July jobs reportThe ongoing impact of the coronavirus pandemic – and more recently, a resurgence in cases in some parts of the US – on the labor market will be quantified in part with the July jobs report, along with other high frequency data later this week.As of Sunday, consensus economists expected that net non-farm payrolls rose by 1.578 million in July, and that the unemployment rate improved to 10.5%. In June, net payroll gains in the US were higher than expected for a second straight month and rose by a record 4.8 million. The unemployment rate improved to 11.1%, from the 13.3% in May.Still, even with the jobs added back over the past couple months, tens of millions of Americans remained on unemployment insurance in July. And the rate of improvement in weekly initial jobless claims deteriorated as some states in the South and West grappled with a rise in coronavirus cases and had to re-shut portions of their respective economies.NEW YORK, NY - JULY 29: New Yorkers in need wait in a long line to receive free produce, dry goods, and meat at a Food Bank For New York City distribution event at Lincoln Center on July 29, 2020 in New York City. In addition to unemployment and homelessness, millions of Americans face food insecurity as a result of the economic downturn caused by the coronavirus pandemic. (Photo by Scott Heins/Getty Images)“Since the 4.8 million surge in payrolls in June – which had raised hopes that the economy was in the midst of a V-shaped rebound – a range of indicators have suggested that the pace of recovery in employment and broader economic activity has slowed,” Andrew Hunter, senior US economist for Capital Economics, wrote in a note.“While that can probably be explained by several factors, including the fading of the boost from the $1,200 stimulus cheques and from the initial wave of PPP loans being forgiven, the key factor seems to have been the renewed wave of coronavirus infections across the South and West, which has prompted several states including Texas, Florida and California to reimpose restrictions on bars, restaurants and other indoor activities,” he added.Initial jobless claims, which are set for release on Thursday, are expected to show another 1.415 million individuals filed new unemployment insurance claims for the week ended August 1. This would mark the first, if marginal, decline in new claims in three weeks, and the twentieth straight week that new claims topped 1 million. Continuing claims for the week ended July 25 are expected to fall to 16.94 million from just over 17 million the prior week.Other employment data set for release this week includes the ADP National Employment Report on private payrolls. This is expected to show private employers added back 1.2 million jobs in July, moderating somewhat after a gain of 2.369 million in June.Earnings calendarMonday: Marathon Petroleum (MPC), McKesson (MCK), Tyson Foods (TSN), Clorox (CLX), Noble Energy (NBL) before market open; Virgin Galactic (SPCE), Tenet Healthcare (THC), American International Group (AIG), Take-Two Interactive Software (TTWO), Diamondback Energy (FANG), Chegg (CHGG) after market closeTuesday: Vulcan Materials (VMC), KKR & Co (KKR), Cinemark Holdings (CNK), Warner Music Group (WMG), Ralph Lauren (RL) before market open; Prudential Financial (PRU), Allstate (ALL), Activision Blizzard (ATVI), Disney (DIS), Nikola (NKLA), Beyond Meat (BYND), Planet Fitness (PLNT), Match Group (MTCH), Twilio (TWLO), Wynn Resorts (WYNN) after market closeWednesday: Discovery (DISCA), Sonos (SONO), Nielsen Holdings (NLSN), Regeneron Pharmaceutical (REGN), Wayfair (W), The New York Times (NYT), CVS (CVS), Moderna (MRNA), Sinclair Broadcast Group (SBGI) before market open; Square (SQ), Etsy (ETSY), Roku (ROKU), Marathon Oil (MRO), Live Nation Entertainment (LYV) after market closeThursday: Norwegian Cruise Line Holdings (NCLH), Bristol-Myers Squibb (BMY), Hilton Worldwide Holdings (HLT), YETI Holdings (YETI), iHeartMedia (IHRT), Mylan (MYL), Papa John’s International (PZZA), Ascena Retail Group (ASNA) before market open; Booking Holdings (BKNG), T-Mobile (TMUS), Stamps.com (STMP), Cloudflare (NET), TripAdvisor (TRIP), Zillow Group (ZG), Uber (UBER), Dropbox (DBX), Datadog (DDOG), The RealReal (REAL), Caesars Entertainment (CZR) after market closeFriday: Eventbrite (EB), Novavax (NVAX), AMC Entertainment Holdings (AMC), Eastman Kodak (KODK) before market openEconomic calendarMonday: Markit US manufacturing PMI, July final (51.3 expected, 51.3 prior); ISM manufacturing, July (53.5 expected, 52.6 in June); Construction spending, June month over month (1.0% expected, -2.1% in May); Wards Total Vehicle Sales, July (14.00 million expected, 13.05 million prior)Tuesday: Factory orders, June (5.0% expected, 8.0% in May); Durable goods orders, June final (7.3% expected; 7.3% prior); Capital goods orders, non-defense excluding aircraft, June final (3.3% prior); Capital goods shipments, non-defense excluding aircraft, June final (3.4% prior)Wednesday: MBA mortgage applications, week ended July 31 (-0.8% prior week); ADP employment change, July (1.2 million expected, 2.369 million in June); Trade balance, June (-$50 billion expected, -$54.6 billion in May); Markit US services PMI, July final (49.6 expected, 49.6 prior); Markit US composite PMI, July final (50.0 prior); ISM non-manufacturing index, July (55.0 expected; 57.1 in June)Thursday: Initial jobless claims, week ended August 1 (1.415 million expected, 1.434 million prior week); continuing jobless claims, week ended July 25 (16.94 million expected, 17.018 million prior week); Challenger job cuts, July year over year (305.5% in June)Friday: Change in non-farm payrolls, July (1.578 million expected, 4.8 million in June); change in private payrolls, July (1.326 million expected, 4.767 million in June); Change in manufacturing payrolls, July (300,000 expected, 356,000 in June); Unemployment rate, July (10.5% expected, 11.1% in June); Average hourly earnings, July year over year (4.2% expected, 5.0% in June); Average hourly earnings, July month over month (-0.5% expected, -1.2% in June); Labor force participation rate, July (61.8% expected, 61.5% in June); Wholesale inventories, June month over month final (-2.0% expected, -2.0% prior)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}