{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-executive-order-on-student-loans-creates-an-implementation-disaster-in-the-making-183049075.html", "published": 1597757900.0, "headline": "Coronavirus stimulus: Executive order on student loans creates 'an implementation disaster in the making’", "body": "The president’s extension of the interest-free payment pause on federally-held student loans is only punting the problem to the future, one expert said, adding that bringing borrowers back on repayment on January 1 will be an “implementation disaster in the making.”President Donald Trump recently extended the interest-free payment pause through executive action, ordering Education Secretary Betsy DeVos to extend a policy first announced in mid-March for 40 million borrowers. The protections for federally-held student loans were set to expire on September 30, as codified by the CARES Act, and will now extend until December 31, 2020.But that’s not going to be enough, Ben Miller, vice president for postsecondary education at the Center for American Progress, told the House Education and Labor Committee.“There's little chance the economy will be in strong shape by then,” Miller stated on Friday. “Having roughly 26 million borrowers all enter repayment during the holidays — it’s an implementation disaster in the making.”A graduate walks up to receive his diploma from U.S. President Donald Trump at the Hope for Prisoners Graduation Ceremony attended in Las Vegas, Nevada, February 20, 2020. (Photo: REUTERS/ Kevin Lamarque)Instead, Miller suggested “an approach that pauses payments for a full year and ties interest restarting to positive economic indicators would be much better.” But it’s unclear what action Congress will take in the new stimulus bill taking shape.In the meantime, borrowers are already seeing some implementation issues.Student loan startup Summer’s co-founder and CEO Will Sealy told Yahoo Finance that he’s seeing borrowers on the Public Service Loan Forgiveness program have difficulties getting their servicer to count the non-payments towards their loan forgiveness program. They’re supposed to make 120 months of on-time payments before they can have the remainder of their loans forgiven.“FedLoan Servicing has told borrowers they will not count payments until the forbearance is over,” Sealy said. “This could delay that backlog and cause significant processing errors and delays this upcoming January.”FedLoan’s parent company, PHEAA, did not return request for comment.Story continuesDetails still scarce on executive orderThere’s also uncertainty over what exactly the order means. It’s been more than a week since the president told the Education Department to extend the pause, but details are still scare on how exactly the pause will work.For instance, the wording suggests that private student loans are unaffected by the executive action. It’s also unclear if borrowers on PSLF could continue to count these months towards loan forgiveness and whether or not the memo extends the administration’s previous policy of pausing the seizure of wages or tax refunds of Americans who defaulted on their federal student loans.(Graphic: David Foster)The last issue is important as a pause affects many people who are low-income or people of color, Miller asserted, and “now is not the time to start taking parts of borrowers paychecks.”Loan servicers are standing by to get more details before they take any action, Scott Buchanan, executive director of the Student Loan Servicing alliance, a nonprofit that represents the servicers, told Yahoo Finance.“As soon as we get official guidance from the Department, we are prepared to move quickly to implement and work with borrowers on any changes,” Buchanan said. “We expect that guidance very shortly.”The ED did not respond to a request for comment.And the ED’s response, if it mirrors the executive order exactly, is likely to disappoint those like Miller, who emphasized simply that “on the student loan issue the executive order is it best an insufficient step.”—Aarthi is a reporter for Yahoo Finance covering education. Follow her on Twitter @aarthiswami. If you are a student loan borrower who is struggling with your debt and would like to share your experience, reach out to her at aarthi@yahoofinance.comRead more:Executive order extends U.S. federally-held student loan interest freeze until end of 2020'They stole my time’: For-profit college students share horror storiesHEROES Act would cancel $10,000 in student debt for ‘economically distressed’ borrowerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}