{"article": [{"url": "https://finance.yahoo.com/news/trump-is-trying-to-undermine-confidence-in-democracy-dem-lawmaker-141355730.html", "published": 1597828880.0, "headline": "Trump is trying to 'undermine confidence' in democracy: Democratic rep.", "body": "Rep. Cheri Bustos (D-IL) is blasting President Donald Trump for “doing everything he can to undermine people’s confidence in our democracy.”“That is a sin. We’ve got the longest lasting democracy on the face of the planet,” said Bustos in an interview with Yahoo Finance. “I don’t even think it’s arguable that this is the preferred form of government — a democratic form of government. For anybody, especially the president of the United States, to undermine the confidence in the best form of government in the world is just unconscionable. It’s a sin.”Democratic lawmakers have sounded the alarm in recent weeks, saying that Trump is trying to make it harder for people to vote with his attacks on the United States Postal Service, his opposition to additional USPS funding and his unproven claims that mail-in voting would lead to significant voter fraud (experts say voting fraud is very rare). On Tuesday night, the Trump campaign and the Republican National Committee sued New Jersey over its mail-in voting plans.“Absentee is great, but universal [mail-in voting] is going to be a disaster, the likes of which our country has never seen. It'll end up being a rigged election, or they will never come out with an outcome,” Trump said on Tuesday.Vote by mail-in ballot at the Supervisor of Elections office on election day during the 2020 Primary Election on August 18, 2020 in Palm Beach, Florida. Credit: mpi04/MediaPunch /IPX‘Our democracy is at stake’Bustos is also the Chairwoman of the Democratic Congressional Campaign Committee — the fundraising arm of Democrats in the House. She’s tasked with supporting Democratic candidates and expanding the House majority.“The reason Donald Trump wants to undermine the postal service — and he even said it, to get in the way of people's voting rights — is absurd. If there's anything that we should do is we should make voting easy for people. We shouldn't be throwing up these barricades,” said Bustos in an interview before the New Jersey lawsuit was announced.White House Chief of Staff Mark Meadows brushed off the idea that Trump is purposefully trying to slow the mail to try and help his reelection bid.Story continues\"This president believes that the American people, casting their ballot, one at a time, will ultimately make sure that he's the one elected on Nov. 3 — and any postal consideration has nothing to do with any ballot initiative or anything else. He wants to make the post office great again,” he told White House pool reporter Mike Shear on Tuesday.After being called to Capitol Hill for emergency oversight hearings and Democratic attorneys general threatened legal action, Postmaster General Louis DeJoy — a Trump donor— paused controversial changes that voting rights advocates and lawmakers said could disenfranchise voters in the election. DeJoy said he put the changes on hold to “avoid even the appearance of any impact on election mail.”While Democratic lawmakers welcome the news, they still worry about changes that have already been made.“This pause only halts a limited number of the postmaster’s changes, does not reverse damage already done, and alone is not enough to ensure voters will not be disenfranchised by the president this fall,” said House Speaker Nancy Pelosi (D-CA) in a statement.Later this week, the House will vote on legislation to prohibit recent USPS changes and provide the agency with $25 billion.“I really do believe that our democracy is at stake. I really do believe that,” Bustos said. “Sitting on the sidelines and not participating in this election is really not something that any of us can afford to do.”Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:What to expect from the 2020 conventions: 'As good a TV show as they can have'Coronavirus response: Breaking down the debate over liability protectionsCoronavirus stimulus: What’s next for small business?White House, Senate GOP continue to debate stimulus plan as jobless claims riseTwitter hack highlights concerns about disinformation, election securityThe $600 boost in unemployment benefits expires soon. What comes next?"}]}