{"article": [{"url": "https://finance.yahoo.com/news/general-mills-ceo-you-cant-make-the-food-the-world-needs-unless-youre-taking-care-of-your-people-first-172522442.html", "published": 1595248400.0, "headline": "General Mills CEO: 'You can’t make the food the world needs unless you’re taking care of your people first'", "body": "One of the major advantages of leading a company that has been in business since 1866 is access to extensive history that could help navigate an uncertain here and now rather successfully.Such is the case for General Mills Chairman and CEO Jeff Harmening, who joined the company in 1994 (so he has working knowledge of the history of the place, too) and took over the cereal and baking food giant in June 2017. Amidst the COVID-19 crisis, Harmening has mined General Mills’ extensive historical archives — including a review of strategies and trends during the 1918 Spanish Flu Pandemic —to suss out clues on how to approach the business today.Harmening tells Yahoo Finance insights from the past interestingly resemble those being shared out and about today.“I looked back from the archives from the last pandemic. There was internal news that was about making sure that you wore a mask and washed your hands and practice social distancing. It’s amazing how little has changed over 100 years. What I got out of it is taking care of our people first is the most important thing to do in a crisis like this. You can’t make the food the world needs unless you’re taking care of your people first. Whether it’s here, the U.S., China, or Europe. We focused on our employee safety and it paid dividends for us,” Harmening said on The First Trade.Indeed that appears to be the case.This is a display of General Mills Cheerios cereal at a Costco Warehouse in Homestead, Pa, on Thursday, May 14, 2020. (AP Photo/Gene J. Puskar)Amid restaurant closures and people working from their living rooms during the pandemic, that has spurred a surge in eating at home. The maker of Cheerios cereal and Gold Medal flour is hot off a bang up fourth fiscal quarter as it was able to satisfy a significant increase in demand. Net sales spiked 21% year-over-year to $5 billion. Operating profits soared 16% from a year ago, held back a bit by the company’s decision to ramp up marketing.The company saw some of its strongest demand in its baked goods, dessert mixes, soup, flour and Blue Buffalo pet food businesses.Story continues“When the pandemic hit, people started cooking and baking at home — and about 85% of our businesses are food served at home. That demand hasn’t slowed all that much. It’s still double-digit growth for the baking business. People are buying a lot of flour and Betty Crocker mixes,” Harmening said.General Mills shares are up about 19% year-to-date versus the relatively flat S&P 500, according to Yahoo Finance Premium data.“While we continue to see potential headwinds in FY21, we think the company is well positioned to drive underlying growth in the years ahead – even in the event of a recession given the generally more affordable nature of the portfolio (ex pet). In the shorter term, we are encouraged that General Mills is poised to perform better than food peers as it expands market share and benefits during the pandemic from favorable category exposures such as baking and cereal,” wrote packaged foods analyst Laurent Grandet at Guggenheim after meeting with Harmening a week or so ago. Grandet rates General Mills’ shares a Buy.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.PBA Tour CEO: bowling is now a dynamic, sexy sportLL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}