{"article": [{"url": "https://finance.yahoo.com/news/pending-home-sales-august-2020-140006600.html", "published": 1601456900.0, "headline": "Pending home sales end summer on a high note", "body": "A leading indicator of the health of the housing market, pending home sales in the U.S., reached a new record in August — further evidence that housing has been a bright spot in the economy during the COVID-19 pandemic.Pending home sales, based on contract signings, rose 8.8% in August from a month ago, far surpassing analysts’ estimates of a 3.1% increase, according to Bloomberg. It marked the fourth straight month of increased activity and exceeds pre-pandemic levels. Pending home sales increased 24.2% from the same month a year ago, according to the National Association of Realtors, noting that pending home sales transaction rose in all four regions of the country. The results follow record existing and new home sales results for the month.Read more: Buying your first home: What you need to know“Tremendously low mortgage rates – below 3% – have again helped pending home sales climb in August,” said Lawrence Yun, NAR’s chief economist, in a press statement. “Additionally, the Fed intends to hold short-term Fed funds rates near 0% for the foreseeable future, which should in the absence of inflationary pressure keep mortgage rates low, and that will undoubtably aid homebuyers continuing to enter the marketplace.”In this Aug. 16, 2019, photo an under contract sign is displayed by a home in Richmond, Va. On Thursday, Sept. 26, the National Association of Realtors releases its August report on pending home sales, which are seen as a barometer of future purchases. (AP Photo/Steve Helber)But Yun warns that these deals may not necessarily result in actual sales because not all contract signings close. And he adds that the shortage of inventory could spell trouble for sales activity.Total housing inventory at the end of August totaled 1.49 million units, down 0.7% from July and down 18.6% from one year ago (1.83 million), according to the NAR. Unsold inventory sits at a 3-month supply at the current sales pace, down from 3.1 months in July and down from the 4.0-month figure recorded in August 2019.Pending home sales is “in line with the upward swing in MBA’s data since June on purchase mortgage applications,” said Joel Kan’s, Mortgage Bankers Association’s assistant vice president of economic and industry forecasting, in a press statement. “As home buyers continue their search this fall, one headwind remains the insufficient number of listings for sale.”Story continuesAmanda Fung is an editor at Yahoo Finance.Read more:Home price growth in the US acceleratesUS home price growth unchanged in June; July new home sales highest since 2006Coronavirus finally slows down US home price growth5 reasons why the housing market has recovered from COVID-19: BofA"}]}