{"article": [{"url": "https://finance.yahoo.com/news/airbnb-ceo-ipo-may-happen-this-year-113852291.html", "published": 1597227320.0, "headline": "Airbnb plans to file for IPO this month: Reports", "body": "Home rental unicorn Airbnb plans to file this month for an initial public offering, according to multiple reports. The filing with the Securities and Exchange Commission will potentially allow for a listing later this year.The company opened 2020 with plans to go public, until the coronavirus outbreak brought leisure travel to a halt and slashed business by about 80% in six weeks.But after a sudden return of demand in recent weeks, the IPO plans came back, Airbnb Co-founder and CEO Brian Chesky told Yahoo Finance last month, confirming that the company had resumed the work necessary to go public and would do so in 2020 if the market is “ready.”“We’re going to start resuming all the work to be ready to be a public company,” Chesky told Yahoo Finance Editor-in-Chief Andy Serwer.He tied the timeline of a potential IPO in part to a widespread willingness to travel, which remains an open question amid ongoing coronavirus outbreaks as well as persistent fear of flying among a majority of Americans.“We also don't want to go public if the world's not ready for us,” Chesky said. “If people are really nervous about travel, if they aren't really clear about Airbnb, then the market's not ready.”The Wall Street Journal first reported the IPO plans.Airbnb, valued by investors at $31 billion before the pandemic, had received offers to go public through a special purpose acquisition company, or SPAC, Reuters reported.Brian Chesky speaks during the Fortune Global Forum - Day 3 at the Fairmont Hotel on November 4, 2015 in San Francisco, California. (Photo by Kimberly White/Getty Images for Fortune)Chesky touted the company’s resilience but cautioned that the general sense of uncertainty amid the pandemic may prevent the company from going public in the near-term.“We've seen initial recovery,” he said. “Our business back to 2019 levels without spending a dollar on advertising — or very, very few dollars on advertising — that's a really positive sign.”“So we want to be ready as soon as the market's ready. I think the market probably wants to see this play out a little bit longer,” he said. “So that's why I definitely don't want to rule out this year. But I don't want to say this year, because the world is just changing so quickly.”Story continuesChesky made the remarks to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Last month, Chesky told employees that the company had resumed plans to go public, due to stronger-than-expected business in recent weeks, the New York Times reported.In September of last year, the Times reported that some employees had written a letter to the co-founders of Airbnb expressing a desire to sell their lucrative stock options — a move only possible after the company goes public.Speaking to Yahoo Finance, Chesky cautioned against speculation about how the company will proceed in the coming months.“The best thing we can do is be ready.”This story was updated on Aug. 12 after multiple reports that Airbnb plans to file for IPO.Read more: 'Travel has changed forever': Airbnb CEO Brian CheskyJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinBusiness leaders fear 'flaming on social media' if they criticize Trump: Fast Company Editor-in-ChiefMichael Dell: ‘Not enough’ progress on diversity in the tech industry‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}