{"article": [{"url": "https://finance.yahoo.com/news/41-of-retail-investors-expect-negative-returns-in-the-next-5-years-survey-142137745.html", "published": 1593422960.0, "headline": "41% of retail investors expect negative returns in the next 5 years: Survey", "body": "Retail investors are both bullish and bearish about the future of the stock market and whether they should put money in now, with the differences in outlook falling considerably along demographic lines.This data comes from a poll conducted by Harris and Yahoo Finance from 200 U.S. adults with financial assets or investments, with the pollsters weighing the data to ensure that results are projectable to appropriate U.S. populations.The confusion and disconnect between market participants is hardly surprising. The economy is in crisis with massive unemployment due to the coronavirus, but stocks, after plunging in March, have roared back and pushed the S&P 500 index (^GSPC) well over 3,000, close to its record highs.Four out of 10 people (41%) with equity investments expect trouble ahead in the next five years, with negative returns.Four out of 10 people (41%) with equity investments expect trouble ahead in the next five years, with negative returns, according to a new Yahoo Finance-Harris poll. (REUTERS/Lucas Jackson)The survey found 18% of people with equity investments believe the losses will be between -5% and zero; and 11% believe they will be between -10% and -5%.Despite these outlooks, just 19% of respondents said it’s a good time to decrease exposure to the market, indicating that many are planning to stay the course.[More from the Yahoo Finance-Harris poll: Hardly any at-home workers have returned to their normal workplace]Furthermore, since these numbers come from people holding equity investments, this bearish sentiment is not including all those who decided to ditch their stocks for cash at some point during the crisis.There may be a lot of bears, but over half the survey respondents (51%) believe investment results will be modestly positive (less than 5% gains) in the next five years.Age and gender divides outlook The bull-bear sentiment showed interesting differences when it comes to gender and age. People between 35 and 44 proved especially bullish compared to other groups; 67% of them said it was a good time to invest, with just 9% to the contrary.Putting this in comparison, the next most aggressive group was the 18 to 34 cohort, of whom just 32% think it’s a good time to increase exposure to stocks.Story continuesSimilarly, men are thinking about the market far more aggressively. 41% of them say that it’s a good time to increase holdings in the stock market compared to just 21% of women.The Harris Poll’s CEO Will Johnson offered a possible explanation for the gender disconnect, noting that women have been hit far differently than men when it comes to job losses.“We may all be in this together, but the recession isn’t hitting all of us equally,” said Johnson. “A greater percentage of women are losing their jobs through layoffs or furloughs than men. One key reason is that women disproportionately work in sectors that were shut down by the pandemic, such as retail, hospitality and education.”This gender carryover continues when it comes to whether people feel they will hit their investment goals, with 32% of men saying they are “very confident” compared to just 4% of women.This confidence gap narrowed when respondents were asked if they were “fairly confident” about achieving their investment goals – 60% of men said they felt at least that sure compared to 47% of women.Age-wise, older people (55+), likely de-risked by the conventional wisdom of moving from stocks to bonds and cash, were more likely to report confidence in achieving their goals.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Women far less bullish about their investment goals than men: SurveyHardly any at-home workers have returned to their normal workplaceHere’s a running list of companies boycotting FacebookWant a 'slice' of a stock? Demand booms for fractional shares as markets soarLeisure and hospitality drive jobs numbers higherWhy pandemic insurance is impossible"}]}