{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-what-could-happen-to-the-stock-market-if-the-extra-600-unemployment-insurance-isnt-extended-160550572.html", "published": 1595330000.0, "headline": "Coronavirus stimulus: What could happen to the stock market if the extra $600 unemployment insurance isn't extended", "body": "The lack of a strong plan by lawmakers to financially help those unemployed at the hands of the COVID-19 pandemic could be akin to launching a heat-seeking missile on a hard-charging stock market.We all know how that ends (badly).“Near-term, a little bearish,” said FBB Capital Partners Mike Mussio on Yahoo Finance’s The First Trade when asked how the market — which returned to pre-pandemic highs early this week — would react if the next round of government stimulus disappoints. Mussio thinks investors shouldn’t rule out a quick 10% correction in markets if that potential letdown becomes a reality in the form of households instantly losing essential funds.Added Mussio, “Don’t underestimate the political [factor] in an election season and the potential near-term impact to markets. We saw that play out in 2008 much closer to an election. The TARP [Troubled Asset Relief Program] plan failed in September before it passed in October. And that was six weeks ahead of an election. We’re still looking at the 100-day market here.In reality, the selloff could be far more severe given how important consumer spending is to the U.S. economy, as Yahoo Finance reports.Mussio believes a deal on a fiscal relief package will be somewhere north of $1 trillion, but less than $3 trillion.Leaders on Capitol Hill are picking up their negotiations to avoid the U.S. economy falling off a fiscal cliff while the pandemic rages on.House Speaker Nancy Pelosi of Calif., center, flanked by House Majority Leader Steny Hoyer of Md., left, and Rep John Larson, D-Conn., right, speaks during a news conference on Capitol Hill in Washington, Friday, Feb. 13, 2009, after the House passed the stimulus legislation. (AP Photo/Susan Walsh)Democrats in the House signed off on a $3 trillion COVID-19 relief bill several months ago. It would extend the $600 weekly payments originally passed in the Coronavirus Aid, Relief, and Economic Security (CARES) Act through January. The bill would also provide for another round of direct payments of up to $1,200 for individuals and $6,000 for families that have children. House of Representatives Speaker Nancy Pelosi said Tuesday she would like a bill on her desk by next week, ahead of the July 31 expiration for the unemployment check top up.Story continuesSenate Majority Leader Mitch McConnell is reportedly eyeing a new $1 trillion stimulus as a starting point in negotiations. Meanwhile, President Trump is clamoring for a payroll tax cut.Amidst this last minute juggling act in D.C., the stock market continues to power higher on optimism an impressive package is inked. That optimism on stimulus is fueling more optimism that perhaps the unemployed get back to work sooner than expected.“Stocks may be sending a message that we will get back to work sooner than we think,” pointed out Belpointe Chief strategist David Nelson on The First Trade.Again, any deviation from that thesis — spurred by lawmakers not getting the job done by the end of June — is likely to be met harshly by a ginned up stock market.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}