{"article": [{"url": "https://finance.yahoo.com/news/7-of-the-biggest-reasons-why-the-stock-market-is-having-a-dreadful-september-172804864.html", "published": 1600864580.0, "headline": "7 of the biggest reasons why the stock market is having a dreadful September", "body": "Thus far, September has lived up to its billing as a weak month for stocks. And getting back into sustained rally mode may take some time.Through September 23, all three of the major equities indices are in the red for the month. The worst-performing index has been the Nasdaq Composite, which has shed nearly 9%. The S&P 500 and Dow Jones Industrial Average are down 5% and 2.5%, respectively, month-to-date.Talk up any Wall Street veteran and they will say the pullback in stocks in September is due to the simplest of reasons:Tech stocks such as Amazon, Apple, Netflix and Tesla had powerful gains in the summer and had to come back down to Earth. In short, Big Tech is now viewed a bigly overvalued.No new stimulus plan from a bickering set of lawmakers, means downside risk to consumers this holiday season.Political risk (see the latest fight over a Supreme Court nominee to replace Justice Ruth Bader Ginsburg) front and center ahead of the November presidential election.COVID-19 cases remain on the rise globally and could spike further in the winter as we all stay inside.And lastly, the entire market is overvalued in a world absent a COVID-19 vaccine.All of these are indeed fair explanations for an across the board selloff in stocks. Stocks never go up in a straight line forever, especially in the backdrop laid out above.But in reality, as the equities team at RBC Capital Markets discusses in a new note the pullback is far more nuanced. That suggests a host of items will have to fall into place together in order to get the markets back in sustained rally mode this year.Here are nine areas of concern RBC sees currently weighing on markets.1) Peak earnings sentimentRising profit estimates among sell-side strategists often tend to be a driver of stock prices. That in fact happened during the summer as strategists wagered on a post peak COVID-19 economic recovery. At issue now is that profit estimate upward revisions may have stalled, RBC notes. “The improvement in earnings sentiment in recent months helps explain why stocks have rebounded so sharply since March, but also raises the question whether momentum in this indicator will soon level off, challenging what has been a powerful driver of US equity markets,” says RBC.Story continues2) Institutional investors chilling outIt would appear that the smart money has started to respect the fact valuations on stocks have become too rich. Explains RBC, “The August 2020 high [in institutional investor sentiment] came after eight consecutive weeks of incremental net-long positions added since early July for the broader US equity market. Although this indicator moved up slightly in the latest update (released Friday, with data as of September 15th), since late August we have generally seen a retreat in this indicator. This negative shift in sentiment has coincided with the S&P 500’s recent choppiness in trading, which began after the new September 2nd all-time high in the index. Overall, the data raises the questions of whether institutional investor positioning in US equities has peaked again.”3) Valuations matterInflating stock valuations over the summer were largely ignored by investors. The thinking at the time was that due to easy monetary policy from the Federal Reserve valuations could almost infinitely expand. That view is now being challenged after valuations for stocks reached nosebleed levels. Writes RBC, “As of mid-September the S&P 500 is trading at 25.2x 2020 EPS and 19.9x 2021 EPS. These stats capture valuations from a top-down perspective. From a bottom-up perspective, multiples also look highly concerning. Indeed, as of mid-September, our Combo model (based on 34 different metrics, using weighted medians and median multiples for individual companies in the S&P 500) is still 2 standard deviations above its long term average and has recently traded at 2.25 standard deviations above its long-term average (slightly higher than its Tech Bubble high of 1.76).4) COVID-19 trends headed in the wrong directionWith fall in full swing, concerns on rising COVID-19 infections and deaths is back to being top of mind for investors. RBC thinks is a must-watch area moving forward, notably as the economic activity they track has begun to reverse course from the summer recovery. “With 2021 on the horizon, it will be important to monitor whether a bigger reversal in the momentum of the economic recovery is underway, particularly since additional fiscal stimulus has become even more unlikely with Washington shifting its focus to the Supreme Court vacancy,” RBC writes.5) Here comes the election riskBERLIN, GERMANY - SEPTEMBER 21: In this photo illustration a pencil lies on a U.S. presidential election mail-in ballot received by a U.S. citizen living abroad that shows current U.S. Republican President Donald Trump and his main contender, Democratic presidential candidate Joe Biden, among the choices on September 21, 2020 in Berlin, Germany. Thousands of U.S. citizens living abroad received their mail-in ballots via e-mail over the weekend. (Photo by Sean Gallup/Getty Images)Investors did their best in August and the early part of September to ignore the November election. They can longer do that ahead of the presidential debates and a confirmation hearing for a new Supreme Court member. Explains RBC, “Although stocks tend to perform well over time when Democrats control the White House (and all three branches of government), the election gives US equity investors a number of reasons to be wary of the path of stocks in coming months. RBC’s U.S. equity analysts see a Biden victory/Democratic sweep as a negative event for 58% of the industries that they cover. Investors have also been contemplating the possibility that the results of the presidential race won’t be known immediately. In 2000, the S&P 500 fell 12% after Election Day while the winner of the Bush-Gore race was determined, bringing the index’s total drop from its September 1 level to 17%.6) Stocks overseas are laggingAlthough U.S. stocks hit new highs on September 2, overseas markets remained under pressure as to reflect sluggish economic trends. To RBC’s strategists, that has left U.S. relatively overvalued to international stocks. That relative premium should be worked off given weakening growth again here in the United States. “While the US has continued to maintain its lead for the year over non-U.S. equities, the U.S. has been underperforming its global peers since the S&P 500 hit a new all-time high on September 2. Valuations continue to signal that U.S. equities are extremely overvalued relative to non-U.S. equities. Meanwhile, positioning in asset allocation funds in non-U.S. equities remains close to historical lows, despite a slight increase in 2Q20.7) Leaders start to lagSome of the market’s best-performing stocks (we see you, Big Tech) have begun to stall in September. That’s often a red flag on the sustainability of a rally. RBC hints the 2020 leaders may have further to fall. “Going back to 2004, top-performing names have often lost steam around this time of year. Many reasons may explain why selling leaders and buying laggards around this time of the year can be a good strategy, but we think its helpful to keep in mind that almost half of U.S. mutual funds have their fiscal year-ends during the calendar fourth quarter (October and December are the most popular months, at 22% each) with another 13% seeing their fiscal year end in September.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.What’s hot this week from Sozzi:Peloton’s biggest rival just raised a ton of money from the likes of Stephen CurryHome Depot co-founder and Atlanta Falcons owner gives his best advice to new NY Mets ownerPeloton founder: here’s one of my biggest 15 year goalsVitamin Shoppe CEO: the pandemic has changed our businessKraft Heinz CEO: Buffett’s team like our $3.2 billion dealKroger CEO: this is how we see the future of food shoppingWatch Yahoo Finance’s live programming on Verizon FIOS channel 604, Apple TV, Amazon Fire TV, Roku, Samsung TV, Pluto TV, and YouTube. Online catch Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, and reddit."}]}