{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-sun-belt-shows-signs-of-leveling-off-as-nyc-announces-travel-checkpoints-172408001.html", "published": 1596630740.0, "headline": "Coronavirus update: Sun Belt shows signs of leveling off as NYC announces travel checkpoints", "body": "The COVID-19 stricken Sun Belt region showed some signs of improvement, with some states like Arizona seeing decreased deaths from the coronavirus, even as others continue to struggle to curb their outbreaks.On Wednesday, Florida joined hard-hit California in the upper echelon of confirmed coronavirus diagnoses that have topped 500,000. With the Empire State fighting to preserve its recovery from being a COVID-19 epicenter, New York City Mayor Bill DeBlasio announced the Big Apple would enforce quarantine checkpoints at the city’s borders, affecting travelers coming from 34 states where infection rates are on the rise.The U.S. remains a major hotspot in the coronavirus pandemic, and health experts have expressed continuing alarm over the lack of a national strategy, even as optimism builds over potential treatments and vaccines.Meanwhile, absent a federal mask mandate, states have taken it upon themselves to determine when and where to mandate them. Mississippi Gov. Tate Reeves announced a mask mandate Tuesday, joining more than three dozen states in the U.S. to implement a requirement on masking in public spaces.Reeves said that “as irritating as [masks] can be,” they are critical to curbing the spread.The announcement came after roughly half the state’s counties were under broad mask mandates due to higher rates of the coronavirus. Previously, masks were only required for workers at gyms, personal-care businesses, restaurants and bars.Cases are popping up all across the country. (Graphic: David Foster/Yahoo Finance)Meanwhile, all eyes on the pharmaceutical front, where two different antibody trials pushed forward — including Regeneron’s antibody cocktail therapy and Eli Lilly’s (LLY) monoclonal antibody trial. Antibody treatments are seen as a bridge between treatments and a vaccine.On Wednesday Johnson & Johnson (JNJ) announced a deal for 100 million doses of its single-dose vaccine candidate. The $1 billion agreement is in partnership with the Departments of Health and Defense, and is a “not-for-profit” price point, the company said in a statement.Story continuesModerna (MRNA), which has the leading vaccine candidate in the U.S., said the company has been sealing deals for its vaccine with countries around the world at a roughly $32-$37 per dose price, for the two-dose candidate.By comparison, Pfizer’s (PFE) deal with the U.S. for its candidate, in partnership with BioNTech (BNTX), is roughly $19 per dose for a two dose treatment.Separately, Novavax (NVAX) revealed that its experimental COVID-19 vaccine produced antibodies against the virus and appeared to be safe, according to initial data. The company expects to begin Phase 3 trials by September, about a month earlier than previously expected.Drug pricing concerns surfaceIn the midst of concerns about the affordability of coronavirus treatments — and who will pay for them — the industry is grappling with public pressure to fairly price potential vaccines and treatments for COVID-19.As the election heats up, President Donald Trump has touted his executive action on pharmaceutical costs. And one new study by data analytics firm IQVIA revealed that despite reports of price increases for some specialized drugs, overall drug costs have actually fallen for a majority of Americans.Murray Aitken, senior vice president at IQVIA and the executive director of its Institute for Human Data Science, told Yahoo Finance in a recent interview that high prices reported by media are “a 1% problem.” Largely speaking, the cost of drugs are more stabilized, he added.“There are lots of anecdotes about drug pricing, there’s less context and evidence to look broadly at what’s happening,” Aitken said.But out-of-pocket exposure is a driving force behind perceptions of the industry, and the price a patient pays is a determining factor of if prescriptions are abandoned at the pharmacy.“Abandonment rates are less than 5% when the prescription carries no out-of-pocket cost, but rise to 45% when the cost is over $125 and 60% when the cost is over $500,” according to the report.But in instances where there is zero copay or caps on cost to the patient, the chances of the patient reaching their deductible decrease, which results in overall greater cost to the patient in some cases, Aitken said.Employers have increasingly been concerned with the cost of newer treatments for some diseases, like gene therapies. Aitken said the costs in the immediate future will be higher, but over time as production becomes more streamlined and scales up, pricing should level off.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}