{"article": [{"url": "https://finance.yahoo.com/news/election-night-in-november-could-last-for-days-154024060.html", "published": 1592563700.0, "headline": "Election Night in November could last for days", "body": "On the evening of Nov. 8, 2016, stock market futures began to quiver around 9 pm, then plunge, as election returns started to show Donald Trump heading for a shocking upset win in the U.S. presidential election. The Associated Press gave Trump the winning margin around 2:30 am on November 9.Election Eve 2020 could be a lot more uneventful, because there may not be a definitive winner in the presidential election for days. The move to mail-in voting in many states, as a safety measure amid the coronavirus pandemic, could delay ballot counts and create a very different experience for voters accustomed to news networks declaring a winner by the time most people wake up the morning after Election Day.Key states such as Michigan, Wisconsin, Pennsylvania and Texas have expanded mail-in voting, to limit the number of people who show up at crowded polling places on Election Day. Mail-in ballots typically take longer to count, and some don’t even arrive until after Election Day. “It’s time to let go of old ideas about how election night will work,” political scholar Lou Jacobson wrote recently in Politifact. “This November, there’s a good chance we won’t have a clear winner in the wee hours of the morning.”Allegheny County Election Division Deputy Manager Chet Harhut demonstrates a mail-in and absentee ballot counting machine at the Elections warehouse in Pittsburgh Monday, June 1, 2020. Pennsylvania holds its primary on Tuesday, June 2. (AP Photo/Gene J. Puskar)Mail-in voting isn’t new, but significantly expanding it could make it impossible to project a winner in swing states on Election Day. California, for instance, accepts any mail-in ballot postmarked by Election Day, which means votes trickle in for several days after the polls officially close. A running joke is that California holds an “election month,” not an election day. After this year’s Democratic primary election, on March 3, it was clear Bernie Sanders had won a majority of the votes. But it took more than a week to determine how many delegates each Democratic candidate won, and the California secretary of state didn’t certify the final vote tallies until May 1, nearly two months later.If the presidential election is a landslide in favor of either candidate, the outcome could be known quickly, because uncounted ballots wouldn’t add up to enough to change the vote. But most analysts expect a close election. The latest forecast by the Cook Political Report gives Democrat Joe Biden 248 electoral votes, and President Trump, the Republican, 204 electoral votes. That leaves 86 electoral votes up for grabs, enough to tilt the election either way.Story continuesA handful of swing states will determine the winner, including Arizona, Florida, Michigan, North Carolina, Pennsylvania and Wisconsin. Most of them are likely to have a higher-than-usual portion of mail-in votes, and some are still working out the rules for counting ballots. In some states, for instance, election officials can count ballots as they come in, which speeds processing. But in other states, counting can’t begin until Election Day, which takes longer to get an official result. Like California, Florida, North Carolina and Texas accept ballots postmarked by Election Day, even if they arrive later. Those could be the last states to report results.Election workers process mail-in ballots during a nearly all-mail primary election Tuesday, June 9, 2020, in Las Vegas. (AP Photo/John Locher)Trump has fumed against mail-in voting, claiming it opens the door to voter fraud. But there’s no evidence of that. Trump also seems to think mail-in voting favors Democrats, even though there’s no proof of that, either. Trump’s protestations are a preview of the chaos that could erupt if there’s no clear winner on Election Day. Trump could claim fraud, even if there isn’t any, and some partisans might see slow vote counting as fishy business. Biden hasn’t complained about mail-in voting, but if the vote shifted from Biden to Trump as officials counted late ballots, Democrats would probably howl, too. Maybe voters will at least have a reason to turn in early on Election Eve.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Mike Bloomberg can help Joe BidenBiden’s age might work in his favorSome nightmare scenarios for the November electionsThe risk to Biden if he picks a black running mateHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}