{"article": [{"url": "https://finance.yahoo.com/news/kansas-city-fed-esther-george-us-economy-well-positioned-to-recover-at-some-point-110012256.html", "published": 1598422100.0, "headline": "KC Fed's George: US economy well-positioned 'to recover at some point'", "body": "Federal Reserve Bank of Kansas City President Esther George said it is too soon to tell where the virus numbers are headed, meaning that the U.S. economic outlook is still fraught with considerable uncertainty.George told Yahoo Finance that in the meantime, the Fed will keep monetary policy “very accommodative” while the health response drags on.“Assuming we get the policy mix right, assuming that the medical issues can be addressed, I think the economy is well-positioned to be able to recover at some point in the future,” said George.After the virus reached the U.S. in the spring, the Fed slashed interest rates to near-zero, restarted quantitative easing, and launched an arsenal of liquidity facilities to backstop various financial markets. George said that until the economy has shown signs that it has “regained its footing,” the Fed will keep its level of support.“We have done a lot,” George said on the sidelines of the Jackson Hole symposium, an annual meeting of monetary policymakers from around the world that has shifted to a virtual format due to the virus.The Kansas City Fed covers all of five states (Colorado, Kansas, Nebraska, Oklahoma, Wyoming) and part of two states (New Mexico and Missouri). In that region, George said coronavirus cases were initially low but noted “variation” in counts over the summer.For example, Colorado reported yesterday the lowest three-day moving average positivity rate since the outbreak began. But case counts in Kansas continue to rise, with the state now reporting at least one positive case in each of the state’s 105 counties.George said if economic conditions worsen, the central bank may still have some tricks up its sleeve.“If the economy takes a turn, the committee is going to have to think about what, if anything, it should be doing. And I wouldn't suggest that we won't do anything,” George said.[Kansas City Fed President Esther George speaks with Yahoo Finance: Transcript]Esther George, president and chief executive officer of the Federal Reserve Bank of Kansas City, speaks with a colleague during the Jackson Hole Economic Policy Symposium at the Jackson Lake Lodge in Grand Teton National Park near Jackson, Wyo., Friday, Aug. 22, 2014. (AP Photo/John Locher)Financial imbalancesStory continuesGeorge said she has supported the Fed’s reaction to the coronavirus, but acknowledged that there could be consequences of the central bank’s unprecedented measures somewhere down the line.Prior to the pandemic, George made a frequent point of the financial stability implications of accommodative monetary policy. When the coronavirus began wreaking havoc on markets in early March, she delivered a speech warning that large-scale asset purchases and prolonged periods of low interest rates “can lead to a buildup of financial imbalances that ultimately pose risks to the real economy.”Since that speech, the Fed has ballooned its balance sheet to $7 trillion and involved itself with actively backstopping corporate debt markets.“That is always a concern, and I suspect will be something we are going to have to focus on in the years ahead,” George told Yahoo Finance.George said that despite those concerns, she has supported the central bank’s COVID rsponse in light of the fact that “the economy is suffering a terrible shock right now.”The Jackson Hole symposium will take place August 27-28 and, for the first time, be live-streamed for anyone to watch.The FOMC’s next policy-setting meeting is scheduled for September 15-16.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.World Bank's Malpass: China needs to 'fully participate' in debt reliefWorld Bank's David Malpass: 'Inequality problem is gigantic'Fed will not cap U.S. Treasury yields for the time beingSenate efforts to slip in lower leverage requirements brushed off by small, large banksA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}