{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-operation-warp-speed-readies-for-vaccine-as-cdc-downplays-rapid-deployment-165718862.html", "published": 1600257920.0, "headline": "Coronavirus update: Operation Warp Speed readies for vaccine as CDC tries to manage expectations", "body": "Operation Warp Speed is gearing up for widespread distribution of a potential vaccine, including with a state-by-state and community-specific guidelines — even as top public health officials say a widely-available inoculation likely won’t be ready for the general public before 2021.The U.S. Department of Health and Human Services (HHS) shared its vaccine distribution strategy, which reinforces a vaccine timeline in sync with what health officials have said is likely — in January 2021 or sometime thereafter — rather than President Donald Trump’s more aggressive outlook.Paul Mango, deputy chief of staff for policy at the department of Health and Human Services, told Bloomberg News on Wednesday that all Americans should be able to access a shot by April 2021 — a more realistic timeframe echoed by Dr. Anthony Fauci and Centers for Disease Control (CDC) Director Robert Redfield, who addressed a Senate panel on Wednesday. He added that the U.S. can expect to resume “regular life” in the second half of next year.Redfield noted that vaccinations at a small scale could start by November or December and ramp up, and it “six to nine months to get the American public vaccinated.”The political pressure has played a role in confusion and growing skepticism over a safe and effective vaccine. A Trump ally, Michael Caputo, who served as the top spokesman for HHS is taking a 60-day leave following concerning reports that he and his staff attempted to interfere in the dissemination of information on the pandemic from the CDC.But the CDC has continue to share its data, and continued Wednesday to share a more detailed playbook, including a look at different states, territories and the tribal communities for vaccine distribution. On a call with reporters, officials said the federal government would be ready to deploy vaccines within 24 hours of an emergency use authorization or a biologics license application from the U.S. Food and Drug Administration (FDA).Story continuesRedfield noted that the company chosen to distribute the vaccine, McKesson (MCK), already works with the federal government to distribute 80 million flu doses and other inoculations each year, and has the scope to scale up to as many as 900 million doses.In keeping with that effort, the Trump administration is launching a $16 million tracking system to help with COVID-19 vaccine supplies, distribution and administration, but some say the effort conflicts with existing state-level tracking systems.The country is waiting for its frontrunners, including Moderna (MRNA) and Pfizer (PFE) with BioNTech (BNTX) to conclude Phase 3 trials. Pfizer recently held an investor day event and noted that it is on track to provide efficacy results by the end of October.In an analyst note, SVB Leerink noted the company has the supply for 100 million doses by the end of the year, and has contracted to provide 450 million doses. All told, Pfizer is in discussions to provide up to 600 million — or 1 billion total — by next year.Pfizer “is now grossly over-powered for its original efficacy assumptions, and with 29,000 subjects enrolled and more than 12,000 having had two doses, the efficacy signal could really happen any day,” according to the note.There are over 6.5 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)But in the interim, antibody treatments have been increasingly in focus, as the reality of widespread vaccine use looks at mid-2021. The use of recovered patients’ blood, and the antibodies in them, has been a promising and seemingly low-risk approach to tackling the global pandemic.To that end, Eli Lilly (LLY) provided a promising update Wednesday, showing its antibody treatment resulted in reducing the amount of the virus in a person’s body, thereby avoiding ventilators and death in a limited set of the population.Daniel Skovronsky, Lilly's chief scientific officer and president of Lilly Research Laboratories, said the results “reinforce our conviction that neutralizing antibodies can help in the fight against COVID-19.\"The news is a positive signal for others like Regeneron (REGN), which is also working on an antibody cocktail.There are over 29 million cases worldwide. (Graphic: David Foster/Yahoo Finance)Growing global concern over the ongoing pandemic has spurred several vaccine companies to focus their efforts on equitable global distribution. Larger pharmaceutical players already have such infrastructure and relationships set up, but smaller new entrants like Moderna and Novavax (NVAX) are also pursuing the same.Recently, Novavax announced a relationship with the Serum Institute of India, while Moderna on Wednesday said it was breaking ground on an office in Switzerland, a country that has been bullish on Moderna’s vaccine candidate, and where the company’s key large-volume manufacturing partner, Lonza, is based. The Swiss federal government is purchasing 4.5 million doses of Moderna’s candidate.Meanwhile, Europe is struggling to manage resurgences of the coronavirus outbreak in parts that reopened, but are now seeing new surges in positive diagnoses. Those countries had decided to open up earlier than Italy and Spain, which were the hotspots in Europe, include the Czech Republic and France.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}