{"article": [{"url": "https://finance.yahoo.com/news/covid19-vaccine-surprise-stock-market-higher-morning-brief-095822292.html", "published": 1597208780.0, "headline": "The big 'surprise' that could send stocks higher: Morning Brief", "body": "Wednesday, August 12, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeA vaccine.Since the market bottomed on March 23, the S&P 500 has rallied 49% while the Nasdaq is up more than 55%.And with the S&P 500 now within 1% of a record high, strategists have been writing quite a bit about the next catalyst to keep stocks pushing higher.And the most common answer seems to be a vaccine.Jared Woodard, a strategist at Bank of America Global Research, said in a note published Tuesday that a “vaccine surprise” is among his three big risks facing investors in the months ahead. A risk that could change the character of the market’s current rally which has been centered on “at home” plays and big cap tech stocks. (The other two risks flagged by Woodard are related to the election and fiscal policy, in-line with what we highlighted out of Morgan Stanley on Tuesday.)“[We] are all hoping for 12 months not 10 years and six vaccine candidates [are] in large-scale phase three trials, with some already entering mass production,” Woodard notes. “Financial assets are not priced for a ‘return to normal’ in 2021 and the risk worth considering is that an early vaccine could spark a significant tactical rotation out of deflationary defensives and into cyclical sectors.”And while it’s only been a few-days-long trend, stock market action since late last week has been consistent with investors pricing in something like this possibility.Cyclical sectors like financials, energy, materials, and industrials have been leading the market while tech high-flyers have been lagging since the Nasdaq’s record close on Thursday. Baird strategist Michael Antonelli also noted Tuesday that the equal-weighted S&P 500 has outperformed against the cap-weighted index for a month, suggesting a rotation has indeed already been underway. Albeit quietly.“In our upside scenario [for the stock market],” said Mark Haefele, chief investment officer for global wealth management at UBS, “we think a combination of earlier-than-expected vaccine availability, increased fiscal stimulus, status quo in US-China relations, and an outcome to the US presidential election that does not lead to a material increase in corporate tax rates or regulation would lead to equity risk premia falling below pre-pandemic levels.”Story continuesIn this outcome, Haefele expects the S&P 500 would trade at 3,700 at the end of 2Q21, and adds that “Our preferred investments for this scenario would include select cyclicals and value stocks, and companies exposed to themes accelerated by the pandemic (such as digital transformation). We would also expect further dollar weakness.”So with outsized attention paid to a few high-flying tech stocks during the market’s rally, it seems investors have begun to sour a bit on these popular bets. Perhaps not a total shock — just a few weeks ago we noted that while investors had piled into big cap tech names they also thought this trade was too crowded.In an email on Tuesday, Nicholas Colas, co-founder at DataTrek Research, also discussed the role a vaccine could play in the market going forward. Colas writes that if he were forced to say what moves stock prices in a single word, the answer would be “surprise.”And so the logical question that follows is — what would surprise investors right now? And the shortest answer to that questions is “a vaccine.” A vaccine that could, in turn, keep the economy growing over the next couple of quarters and therefore live up to the promise implied in the market’s summer rally.“Since ‘Surprise’ is the word of the day, we need to parse what fundamental factors make for earnings surprises from here,” Colas writes. “The easy part: the US economy needs to continue improving. That means we need further fiscal stimulus ASAP and an effective COVID vaccine in the next 6-9 months.”As for the fundamental drivers of earnings surprises, Colas argues that increased demand, higher prices, or new products are the only sources of incremental earnings power for any company. A view that also complements what we highlighted from Wilson’s latest notes on Monday that argued companies will benefit from increased operating leverage — and therefore higher profits — in the year ahead as costs are cut but demand returns. Wilson’s outlook, in essence, says that the first pillar of Colas’ earnings surprise framework is where future stock returns will come from.And the most likely path between here and there, it seems, is a faster-than-expected vaccine.So it makes sense that investors are starting to look at pricing in this possibility now. A survey from Deutsche Bank we highlighted late last month said some 56% of investors think a vaccine will be available within a year.Anything faster than this timeline could spark the next leg of the market’s rally.And as we’ve all seen play out during the last few months, stocks are always betting on some future, as-yet-unknown outcome. Wait for a vaccine, or better profits, or the realization of these fundamental earnings drivers and you’ll end up being late.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7:00 a.m. ET: MBA Mortgage Applications, week ended August 7 (-5.1% prior week)8:30 a.m. ET: CPI, July MoM (0.3% expected, 0.6% in June)8:30 a.m. ET: CPI excluding food and energy, July MoM (0.2% expected, 0.2% in June)8:30 a.m. ET: CPI, July YoY (0.7% expected, 0.6% in June)8:30 a.m. ET: CPI excluding food and energy, July YoY (1.1% expected, 1.2% in June)Earnings4:05 p.m. ET: Lyft (LYFT) is expected to report an adjusted loss of 99 cents per share on revenue of $334.55 million4:05 p.m. ET: Cisco (CSCO) is expected to report adjusted earnings of 74 cents per share on revenue of $12.1 billionTop NewsBiden picks Kamala Harris as running mate, first Black woman [AP]Tesla launches five-for-one stock split [Reuters]Trump says US inks agreement with Moderna for 100 million doses of COVID-19 vaccine candidate [AP]UK economy officially enters recession after record 20.4% contraction [Yahoo Finance UK]Fed lowers pricing for emergency loans to state, local governments [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSGundlach, who called Trump's 2016 election, predicts he'll win againCoronavirus quarantines made Americans want to spend on home improvementCompany 401(k) matches are (mostly) surviving the coronavirus—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}