{"article": [{"url": "https://finance.yahoo.com/news/consumer-spending-comes-back-with-a-vengeance-in-may-morning-brief-100600715.html", "published": 1592370860.0, "headline": "Consumer spending comes back 'with a vengeance' in May: Morning Brief", "body": "Wednesday, June 17, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeRetail sales show why stimulus worksRetail sales data in May showed consumers snapped back in a big way after a record drop in April.Last month, retail sales jumped 17.7% following a 16.4% decline in April.Both moves are records for the series.“The US consumer was back with a vengeance in May,” said Lydia Boussour, senior U.S. economist at Oxford Economics.The reading for “control group” sales — which feeds directly into GDP and strips out auto sales, building materials, and gasoline among other categories — also rose by a record 11% during the month of May. Control group sales were driven by huge increases in clothing (+188%), furniture (+90%), electronics (+51%), food service (+29%), and sporting goods (+88%).Michael Feroli, an economist at JPMorgan, said Tuesday that auto sales, which rose 44% in May, appeared to be “the only pure case of pent-up demand.”In other words, the rebound in consumer spending was more about sentiment and economic prospects improving than it was simply a make-up for paused spending in April.All of which leaves May’s retail sales data sending a broad signal that consumers remained resilient through an uncertain economic period. With this report also suggesting that stimulus which kept incomes stable — or even slightly higher than normal — has flowed through to the real economy.Spending came back with a vengeance. (Yahoo Finance)In testimony before Congress on Tuesday, Federal Reserve Chair Jerome Powell emphasized the need for lawmakers to continue delivering stimulus to the U.S. economy in the months ahead.\"With an easing of restrictions on mobility and commerce and the extension of federal loans and grants, some businesses are opening up, while stimulus checks and unemployment benefits are supporting household incomes and spending,\" Powell said in prepared remarks on Tuesday.\"That said,\" Powell added, \"the levels of output and employment remain far below their pre-pandemic levels, and significant uncertainty remains about the timing and strength of the recovery... Until the public is confident that the disease is contained, a full recovery is unlikely.\"Story continuesIn response to questions during the hearing, Powell told one lawmaker, \"We do think you’ll want to continue support for workers in some form. There are going to be an awful lot of unemployed people for some time.\"With consumer spending accounting for nearly 70% of U.S. GDP growth, the importance of keeping consumers afloat is hard to overstate.As Feroli said Tuesday, “sustaining sequential monthly gains in retail spending into the late summer will likely require increasing labor income to more than offset the declining generosity of federal income support.”And Tuesday’s retail sales data should serve as a signal to lawmakers that extending or enhancing stimulus measures should remain a priority, especially as some key provisions from the CARES Act get set to expire at the end of next month.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7 a.m. ET: MBA Mortgage Applications, week ending June 12 (9.3% prior)8:30 a.m. ET: Building Permits, May (1.26 million expected, 1.066 million in April)8:30 a.m. ET: Housing Starts, May (1.1 million expected, 891,000 in April)READ MORETop NewsEuropean stocks rise on coronavirus treatment hopes despite second wave fears [Yahoo Finance UK]UK inflation tumbles to lowest level since Brexit vote [Yahoo Finance UK]PG&E set to exit bankruptcy, ending saga sparked by fires [Bloomberg]China LGBTQ dating app Blued files for Nasdaq IPO [Bloomberg]YAHOO FINANCE HIGHLIGHTSMacy's may not exist in the future: former Sears execACLU sues to stop SBA from denying PPP loans to people with criminal recordsFormer Obama advisor Valerie Jarrett talks protests, defunding police, and criminal justice reform—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}