{"article": [{"url": "https://finance.yahoo.com/news/be-prepared-for-1000-point-dow-selloff-before-the-presidential-election-strategist-174327257.html", "published": 1599569480.0, "headline": "Be prepared for 1,000-point Dow selloff before the presidential election: strategist", "body": "Considering the 2020 stock market has totally disconnected from the COVID-19 realities continuing to grip U.S. households — while also forgetting there is a heated presidential election underway — investors best brace for more severe plunges in equity values in the weeks ahead.Buyers may ultimately step in on various dips thanks to the Federal Reserve’s easy money policy creating insane amounts of liquidity in the system. But sharp selloffs that rattle the cages of the bulls (and there are many) will likely be the name of the game in the near-term as risks rise around the election, a lack of new COVID-19 fiscal stimulus and sluggish economic growth.“I think they do [need to be prepared for more 1,000-point Dow selloffs],” Miller Tabak chief strategist Matt Maley told Yahoo Finance’s The First Trade. “I don’t think we will get anywhere near that 30% to 35% selloff [like at the height of the pandemic in the winter] for the simple reason that we know that the Fed is there, and is ready and willing to inject more liquidity if they need to.”That perspective from Maley is only mildly comforting to an investment community that printed money on big cap tech trades throughout the summer only to see gains pared aggressively out of the blue last week.Crippled under the weight of fresh fears of equities being overvalued, the Nasdaq Composite had its worst five-day stretch in six months last week. Meanwhile, the Dow Jones Industrial Average and S&P 500 had their worst five-day performances in 11 weeks. On Sept. 3 alone, the Dow plunged more than 1,000 points only to rally slightly into the close to finish down 807 points.People walk along Wall Street in the Financial District. (Photo by Spencer Platt/Getty Images)Several of the market’s darlings such as Apple, Tesla, Netflix and Microsoft were pounded as investors fretted on stretched valuations and a rising number of external risks (election, lack of government stimulus, etc.). The selling pressure extended into post Labor Day weekend trading on Tuesday, sparking concerns of a deeper correction not unlike the one seen in late February/early March. Tesla’s stock — which has led the market higher for months — has lost 30% over the past five sessions.Story continues“Last week's decline was technical in nature but fundamentally triggered. We think there is more downside over the next month but eventually leads to further broadening out of the bull market. The S&P may be range bound for the rest of year making stock picking critical,” points out Morgan Stanley equity strategist Mike Wilson.Not everyone on the Street is ringing the alarm bells on the rally, however.Says Oppenheimer senior analyst Ari Wald, “The Nasdaq 100 is still above its important moving averages like its 50-day and well above even the longer-term ones like its 200-day moving average. This [selloff] is really just a function of the strength we saw going into this peak. That’s the beauty of these trend lines. It keeps everything in proportion. This weakness is within the proportion of what we still see an uptrend. We see rather than something more menacing developing, we see an opportunity for longer term investors to buy this near-term weakness.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}