{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-crisis-fuels-push-to-widen-social-safety-net-193403270.html", "published": 1594824140.0, "headline": "Coronavirus crisis fuels push to widen social safety net", "body": "The coronavirus pandemic has accelerated larger economic trends like working remotely and younger people deciding to move up big life decisions like moving to the suburbs.But according to economists at Japanese bank Nomura, the economic inequality driven by the pandemic will likely push the U.S. more toward universal health care and some sort of universal basic income.“We think that the ongoing pandemic recession, along with structural changes induced by COVID-19, will have a larger-than-usual negative impact on income distribution,” wrote Nomura analysts in a large report published Monday.All of this increased inequality, the economists say, will likely lead to more “political clamor” for social safety net programs and a “Piketty moment,” in which more dramatic solutions are considered as people take inequality more seriously. (Thomas Piketty is a French economist whose work focuses on wealth inequality.)In an interview with Yahoo Finance, Nomura chief U.S. economist Lewis Alexander pointed out that the pandemic has underscored existing inequalities and “is a much bigger problem than people have acknowledged before.”A pop-up food drive in Pennsylvania. The coronavirus crisis has increased food insecurity for many people, highlighting inequality. (Photo by Ben Hasty/MediaNews Group/Reading Eagle via Getty Images)Already, millions of people have lost their jobs due to the public health crisis and shutdowns as well as second-order economic impacts as companies slash costs and budgets. With health care inextricably tied to employment in the U.S., the massive unemployment crisis amid a public health crisis means that many have lost their income as well their insurance.Right now, Nomura notes, certain classes of workers are suffering far more than others. Those who can work remotely largely have weathered the storm, while those who cannot struggle. Furthermore, many of these workers earn less and are more vulnerable.Big changes in the futureSo far, there have been big governmental measures to manage the crisis. The Fed turned on its money printer, opened lending facilities, and Congress passed the CARES act, extending unemployment benefits, incentivizing employers to keep employees on staff, and sending checks to millions of Americans.Story continuesAll of this worked well, but is temporary.Nomura notes that the pandemic and racial justice protests following the death of George Floyd have pushed politicians further left on healthcare and other social safety net policies.“Importantly, the movement is accompanied by more taxes on the rich and large corporations with growing concerns over fiscal sustainability, which means that the combination of more progressive tax systems and permanent income support for low-income households could also be in the policy agenda to reduce the income disparity,” wrote Nomura’s analysts.In certain cities like Los Angeles and Atlanta, and some countries the idea of universal basic income is catching on. The concept was an integral part of presidential candidate Andrew Yang’s policies and is supported by some in the tech industry, like Twitter and Square CEO Jack Dorsey. Even on the conservative side, some have expressed curiosity about UBI and its potential in supplanting existing safety net measures.The coronavirus has already caused the country to look harder at how it insures people — often incentivizing them against testing and treatment. (Photo by CHANDAN KHANNA/AFP via Getty Images)“In late May, the Spanish government approved a permanent minimum income program which guarantees a certain level of income to low-income households,” wrote Nomura’s analysts.A universal basic income would indeed be a “drastic” solution for many, but universal healthcare, which is de rigueur in most wealthy countries, would not be considered particularly progressive on the global stage.At the very least, there could be something like an expansion of certain existing social safety nets.“There are other ways in terms of subsidizing low-wage workers, essentially a version of the earned income tax credit,” said Nomura’s Alexander. “I think what COVID-19 is going to do is take all those issues that were in the day before and, in a sense, give them a big push.”-Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.The 2008 recession was far worse for young people's careers than previously thoughtWhat have we learned from the $HTZ debacle?Black communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey'We're seeing a 6,000% increase in spam': IBM cyber VP"}]}