{"article": [{"url": "https://finance.yahoo.com/news/lenders-dont-have-the-capacity-to-meet-mortgage-demand-expert-155228656.html", "published": 1600254020.0, "headline": "‘Lenders don’t have the capacity’ to meet mortgage demand: expert", "body": "Mortgage rates hit a new low last week, the average 30-year fixed rate hit 2.86% for the week ending September 4. It’s the ninth time mortgage rates set a record low this year — and some experts think it won’t be the last time.But rates are not as low as borrowers might expect because overworked lenders are keeping mortgage rates higher to try to slow the onslaught of mortgage and refinance applications, according to experts. Once lenders catch up, mortgage rates are expected to fall further.“It’s not that they [lenders] don’t want to drop rates. It’s that they don’t have the capacity to fulfill that mortgage request right now, on the refis [refinance applications] especially,” Jeff Taylor, managing partner at Digital Risk, a Florida-based financial mortgage analytics company, told Yahoo Finance The Final Round.During the coronavirus pandemic, there has been a frenzy of refinancing and new mortgage application activity. Lenders are projected to dole out a record $3.9 trillion this year, and new home sales are projected to increase 14% this year compared to 2019, according to a new Fannie Mae forecast.“We’re heading towards a $3 trillion residential mortgage market. That’s the second biggest in the last 25 years, only behind 2003… Interest rates have lowered so much… And I see that market only getting hotter as the rest of this year goes on and all the way through 2021,” said Taylor.The mortgage application process should take 30 to 45 days, but applicants are waiting an average of 45 to 120 days, according to Snapdocs, a San Francisco-based digital mortgage closing company.“Low interest rates are driving a surge in purchase and refinance applications, and many lenders are getting crushed by the demand. Some are even throttling business by keeping interest rates at a level where they can ensure that they’re able to fulfill the business they’re getting. Lenders are starting to think that they won’t be able to close new loans for six months, due to the incredibly high demand,” said Snapdocs in a statement.Story continuesMost mortgage companies have tried to bring on more staff to deal with demand. Nonbank mortgage bankers’ and brokers’ payrolls were up 9% in July from last year, according to the Bureau of Labor statistics. Mr. Cooper, a Texas-based mortgage lender, is hiring 2,000 new employees, the company announced this month, Detroit-based lender Quicken Loans hired 4,000 new employees during the pandemic, and United Shore plans to hire a total of almost 1,500.“This kind of explosion in volume, you have to expand your staff, I think. There’s really no way around it without burning out all your people,” said Sheri Nedley, senior vice president of capital markets and operations at Florida-based The Mortgage Firm in a Snapdocs webinar last week.Some lenders like The Mortgage Firm and Wisconsin-based Waterstone Mortgage are adding technology to increase efficiency, offering customers online applications, digital closing and automated communication updates. Meanwhile, digital lenders and lending tech companies like eOriginal and New York-based Better.com have reported explosive demand during the pandemic.“Sometimes, change doesn’t happen unless it is absolutely necessary. This is going to be the big push into digital mortgage closings,” said John Moffatt, director of mortgage operations at Better.com, a New York-based digital mortgage lender had 200% application growth in March alone.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:There’s a ‘staggering shortage of homes on the market’: economist‘New York and California are the land of the flee, and Texas is the land of the free’: real estate investorCalifornia wildfires threaten $11.8 billion-worth of homes"}]}