{"article": [{"url": "https://finance.yahoo.com/news/tesla-earnings-oppenheimer-analyst-dragging-feet-on-price-target-213306972.html", "published": 1595310260.0, "headline": "Tesla Earnings: Why one bullish analyst has been dragging his feet on his price target", "body": "Tesla (TSLA) shares will be a must-watch stock when the electric vehicle maker reports its quarterly results this Wednesday after the market close.Analysts have been playing catch-up as the stock has blown past price targets on the heels of better than expected vehicle deliveries, and speculation of inclusion in the S&P 500 (^GSPC) if it reports a profit for its latest quarter.Meanwhile, Oppenheimer analyst Colin Rusch maintains a $968 price target on the EV maker. Tesla shares closed Monday at $1643.“Why we’ve been dragging our feet about the price target is really about the earnings power, and that at the end of the day we think is driven by the gross margins,” said Rusch, who has an Outperform rating on the stock.“What we’re looking for on Wednesday evening is really progress in the Shanghai facility and demonstration that gross margins are holding up,” said Rusch.The analyst says he will also be paying attention to the company’s self-driving technology, and progress on its European giga-factory, and next giga factory for the Cybertruck.the company logo shones off the grille of an unsold 2020 Model S sedan at a Tesla dealership Sunday, July 19, 2020, in Littleton, Colo. (AP Photo/David Zalubowski)“We see a potential for 50% upside to our estimates for 2024,” said Rusch.Tesla ‘has the potential to really disrupt the market in all major segments’The company is currently the most valuable automaker in the world, worth almost $100 billion more than Toyota. Shares of the electric vehicle maker almost touched $1800 earlier this month.“It makes sense if you believe in the disruptive nature of the technology, and the disruptive nature of the platform,” said Rusch.“As we look at the market as a forward-looking entity, and I’m looking out 4-5 years... Tesla can has the potential to really disrupt the market in all major segments. If we’re looking at the light duty segment, as well as the heavy duty, and last-mile, middle-mile delivery space.”Cheaper gas prices at the pump won’t sway would-be-Tesla- buyers away from purchasing an electric vehicle, said Rusch.“It’s similar to going to the grocery store and buying organic, or buying things for kids with natural materials,” said Rusch. “We think this is really about consumers investing in what they want to see in the world and certainly they are willing to pay a premium for it.”Story continuesGet the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070The days of $100 oil are over': Bubba Trading founderProposed direct listing change would 'encourage more companies to go public': IPO expert'There's a risk of a lost decade here:' former IMF adviserFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}