{"article": [{"url": "https://finance.yahoo.com/news/consumer-confidence-surges-in-september-morning-brief-100049089.html", "published": 1601442500.0, "headline": "Resilience among American consumers continues to be the fall’s biggest theme: Morning Brief", "body": "Wednesday, September 30, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeConsumer confidence surges in SeptemberThe U.S. consumer will not let up.On Tuesday, The Conference Board’s latest monthly data on consumer confidence surged past expectations, registering a reading of 101.8 against expectations for a reading of 90 and up from 86.3 in August. September’s gain marked the largest one-month jump in this index since 2003.Affirming once again that U.S. consumers continue to be more resilient than many economists feared as we wrap up the second month without additional stimulus after the CARES Act expired at the beginning of August.“Consumer Confidence increased sharply in September, after back-to-back monthly declines, but remains below pre-pandemic levels,” said Lynn Franco, senior director of economic indicators at The Conference Board.“A more favorable view of current business and labor market conditions, coupled with renewed optimism about the short-term outlook, helped spur this month’s rebound in confidence. Consumers also expressed greater optimism about their short-term financial prospects, which may help keep spending from slowing further in the months ahead.”This report follows data that shows consumer spending holding up fairly well during September once noise from Labor Day normalized.And reveals that amid some indications the economic recovery had slowed in September, consumers don’t see a deceleration in the rate of recovery as the sign of a dimmed outlook.“The rising exuberance is surprising given the recent moderation in employment conditions, slowing momentum in the overall economy, great uncertainty surrounding the prospect of an additional fiscal stimulus package, and the nationwide uptick in Covid-19 infections,” said Kathy Bostjancic, chief U.S. financial economist at Oxford Economics.Consumer confidence, however, is still well below levels that prevailed pre-pandemic. At 101.8, the headline consumer confidence index is still significantly below February’s reading of 133.6. The report’s present situations index is also sitting at 98.5, well below the 169.3 posted back in February.Story continuesBut overall, this data continues the theme we discussed in Tuesday’s Morning Brief, which explored lowered expectations for economic growth on account of no new stimulus while economists still noted that the economy has performed better than had been expected back in the summer.Through much of June and July, the expiration of the CARES Act was seen as a “benefits cliff” that threatened to derail a still-fragile recovery. And indeed, this risk still exists. But so far, evidence that no additional stimulus would be a death knell for continuing the economy’s recovery is scant.And makes headlines like those on Tuesday that House Speaker Nancy Pelosi (D-Calif.) and Treasury Secretary Steven Mnuchin discussed a new stimulus package a potential bonus to this recovery rather than a necessary condition.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7:00 a.m. ET: MBA Mortgage Applications, week ended September 25 (6.8% during prior week)8:15 a.m. ET: ADP Employment Change, September (650,000 expected, 428,000 in August)8:30 a.m. ET: GDP Annualized Quarter-on-Quarter, second quarter third revision (-31.7% expected, -31.7% in prior print)8:30 a.m. ET: Personal Consumption, second quarter third revision (-34.1% expected, -34.1% in prior print)8:30 a.m. ET: Core Personal Consumption Expenditures Quarter-on-Quarter, second quarter third revision (-1.0% expected, -1.0% in prior print)9:45 a.m. ET: MNI Chicago PMI, September (52.0 expected, 51.2 in August)10:00 a.m. ET: Pending Home Sales, August month-on-month (3.2% expected, 5.9% in July)Top NewsStock market investors cautious after first Trump-Biden debate [Yahoo Finance UK]Disney to lay off about 28,000 parks employees due to coronavirus hit [Reuters]NextEra Energy made takeover approach to Duke: WSJ [Reuters]Apple gives Tim Cook up to a million shares that vest through 2025 [Bloomberg]YAHOO FINANCE HIGHLIGHTSA powerful source of job creation is on a record-breaking upswingMore stimulus is key to Trump’s re-election Airline, hotel industry reps both say their rebound depends on the return of business travel—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}