{"article": [{"url": "https://finance.yahoo.com/news/rbc-equity-strategist-stocks-fall-10-by-yearend-morning-brief-102925659.html", "published": 1595396240.0, "headline": "Why one strategist thinks stocks can fall 10% by year-end: Morning Brief", "body": "Wednesday, July 22, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. Subscribe‘Valuations are frightening’The stock market continued its climb on Tuesday.After the Nasdaq hit a record high on Monday and tech names ripped higher, we saw small caps, energy, financial, and industrial names do most of the work on Tuesday while tech stocks lagged.Despite muted gains on Tuesday, the S&P 500 is now less than 5% below its record closing high from mid-February.But amid this rise in the market, one cautious Wall Street analyst reiterated the risks facing investors right now and still made the case for an 11% drop in the market by year-end.And yet in so doing outlined what to our minds is a still-constructive outlook for the stock market.In a note to clients published Tuesday, RBC chief equity strategist Lori Calvasina noted that optimism around vaccine development and fiscal stimulus are clearly carrying the day for investors. But historical valuation measures make the market right now look fairly fragile. And too fragile for Calvasina and her team to ignore.“Against this puzzling backdrop, we are raising our year-end 2020 S&P 500 price target slightly to 2,900 from 2,750,” Calvasina writes. “Beyond an adjustment in the number, nothing in our messaging has changed. We continue to see downside risk to the US equity market in the back half of the year. Valuations are frightening, with one of our models now above Tech bubble highs.” (Emphasis ours.)Looking across dozens of metrics to measure the market’s current valuation, almost everywhere Calvasina and her team look, this market is expensive.Taking a weighted average of the firm’s S&P 500 valuation model, the market right now is 2.3 standard deviations above its long-term average, the highest since December 1999 and a level that tends to be associated with negative returns over the next 12 months. Using both its weighted and unweighted valuation measures, RBC finds the market right now is actually more expensive than during the tech bubble peak of 1999.Story continuesCalvasina also notes that investor positioning poses a risk to tech stocks, a finding similar to what we highlighted from Bank of America, which showed investors betting on big-cap U.S. tech stocks is the most crowded trade on record in the firm’s monthly fund manager survey.And yet broadly, investor positioning and sentiment doesn’t raise any alarm bells beyond this crowding in the tech sector.“Investor sentiment also remains weak, except in the Tech trade where it’s been overly exuberant,” Calvasina writes.“Both institutional investors and retail investors (the high net worth crowd) remain fairly pessimistic. On the institutional side, US equity futures positioning among asset managers remains extremely low, having staged only a modest recovery off of its late March lows, in fits and starts. Similar trends are in place when we look at the weekly AAII survey on retail investor bearishness, which remains stuck at 45%, only a little better than the 52% peak level of bearishness seen in March and May of 2020.”RBC’s model — which follows a 4-week average of bulls minus bears in the closely-tracked AAII investor survey — continues to send a long-term buy signal for stocks, as bearish sentiment has been persistent even amid the market’s rise.“Normally, we’d look at this data and say its time to hold your nose and buy stocks, since extreme periods of negative sentiment tend to be good buying opportunities for longer term investors,” Calvasina writes. “But one thing we just can’t get past is that on the institutional side, positioning in Nasdaq futures has recently started to decline after returning to its 2014-2015 highs.”And as always, the market will continue to make the highest number of investors, analysts, and strategists frustrated for the longest period of time.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7:00 a.m. ET: MBA Mortgage Applications, week ended July 17 (5.1% prior week)9:00 a.m. ET: FHFA House Price Index MoM, May (0.3% expected, 0.2% in April10:00 a.m. ET: Existing home sales, June (4.75 million expected, 3.91 million in May)EarningsPre-market6:30 a.m. ET: KeyCorp (KEY) is expected to report adjusted earnings of 8 cents per share on revenue of $1.59 billion6:55 a.m. ET: Teledyne Technologies (TDY) is expected to report adjusted earnings of $2.00 per share on revenue of $743.75 million7:00 a.m. ET: Baker Hughes (BKR) is expected to report an adjusted loss of 1 cent per share on revenue of $4.72 billion7:00 a.m. ET: Nasdaq Inc. (NDAQ) is expected to report adjusted earnings of $1.44 per share on revenue of $680.9 million7:25 a.m. ET: Biogen (BIIB) is expected to report adjusted earnings of $8.02 per share on revenue of $3.43 billion8:30 a.m. ET: HCA Healthcare (HCA) is expected to report an adjusted loss of 35 cents per share on revenue of $10.27 billionPost-market4:00 p.m. ET: Align Technologies (ALGN) is expected to report an adjusted loss of 5 cents per share on revenue of $346.36 million4:05 p.m. ET: Microsoft (MSFT) is expected to report adjusted earnings of $1.37 per share per share on revenue of $36.54 billion4:05 p.m. ET: Las Vegas Sands Corp (LVS) is expected to report an adjusted loss of 83 cents per share on revenue of $511.41 million4:10 p.m. ET: Chipotle (CMG) is expected to report adjusted earnings of 28 cents per share on revenue of $1.33 billion4:10 p.m. ET: Whirlpool (WHR) is expected to report adjusted earnings of $1.00 per share on revenue of $3.62 billion4:10 p.m. ET: Tesla (TSLA) is expected to report an adjusted loss of 15 cents per share on revenue of $5.2 billion5:25 p.m. ET: Equifax (EFX) is expected to report adjusted earnings of $1.30 per share on revenue of $907.77 millionTop NewsChina and USA, two flags waving against blue sky. 3d imageU.S. has ordered China consulate in Houston to close [Reuters]U.S. indicts Chinese nationals for stealing data from companies —some working on COVID-19 [Yahoo Finance]Senate panel advances Trump nominees Shelton, Waller for spots at Fed [Yahoo Finance]Tesla earnings preview: Profit prospects in focus after stock's 286% year-to-date rally [Yahoo Finance]Microsoft Q4 2020 earnings preview: It’s all about Azure [Yahoo Finance]Yahoo Finance All Markets Summit ExtraFrom Yahoo Finance All Markets Summit ExtraWells Fargo's Mary Mack: 'We have more to do' on rebuilding reputationSurgeon General Adams: Feds 'working 24/7' on coronavirus, but DC can't do everythingLabor market at 'inflection point' shifting 'from degrees to skills': Infosys PresidentTrump’s Surgeon General on why local mask mandates ‘work best’Carnival CEO: 'We are doing what we need to do' to start cruisingBallet star Misty Copeland: George Floyd protests are 'the first time I feel like I'm truly being heard'YAHOO FINANCE HIGHLIGHTSCoronavirus stimulus checks: Congress begins a ‘game of chicken’Walmart to close on Thanksgiving, dole out employee bonuses as reward in 'unprecedented' yearThousands of workers walk off jobs to ‘strike for Black lives’—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}