{"article": [{"url": "https://finance.yahoo.com/news/the-dow-crashes-more-than-1700-points-out-of-nowhere-heres-one-reason-why-193300504.html", "published": 1591886480.0, "headline": "The Dow crashes more than 1,800 points out of nowhere — here's one reason why", "body": "Think more broadly, investors...it may save you from losing a ton of money right now.Federal Reserve Chair Jerome Powell — fresh off a press conference Wednesday where he warned about long-term joblessness due to the COVID-19 pandemic — was the easy scapegoat for the surprising market meltdown on Thursday. President Trump of course took full aim at Powell via his latest Twitter pipe-bomb.But some blame should get cast upon state governors for perhaps moving too quickly to reopen various businesses without a vaccine for the coronavirus. In turn, that has likely helped fuel a rise in coronavirus infections in key states such as Texas, California and Arizona. Texas alone reported 2,504 new coronavirus infections on Wednesday, the highest one-day total since the pandemic began.“There is a new wave coming in parts of the country. It’s small and it’s distant so far, but it’s coming,” John Hopkins Center for Health Security Eric Toner told Bloomberg News.The U.S. has seen more than 2 million confirmed coronavirus infections. About 115,000 people have died from the disease.Fears of a second wave of COVID-19 have subsequently erupted this week in the markets. The Dow Jones Industrial Average tanked more than 1,800 points on Thursday. Hot stocks that have fueled the rally from the lows such as Royal Caribbean and Bank of America were crushed. Even inherently less risky stocks like Disney, IBM and Pfizer were drilled on the session.Markets were beginning to weaken before Thursday’s rout, however.NEW YORK, NEW YORK - JUNE 01: A view of New York Stock Exchange on Wall Street in lower Manhattan on June 01, 2020 in New York City. (Photo by Roy Rochlin/Getty Images)Wall Street pros have also voiced concern on how the protests across the country would make a second wave worse than expected. Remember, the market’s 40%-plus rally from the March 23 lows has been predicated on a swift, V-shaped economic recovery into year-end. In other words, a rosy economic scenario underpinned by no second wave. And if there were to be a second wave, it would be concentrated to a few states and not broad-based.That overly optimistic thesis is now being rethought by investors.Story continues“Market friendly Fed policy cannot, however, offset a severe COVID second wave. Another broad shutdown of the economy is unlikely, but data show that people changed their behavior well below stay-at-home orders were official,” wrote EvercoreISI strategist Dennis DeBusschere in a note. “In other words, an official shutdown is not needed to slow the economy. With TX, AZ, CA new cases and hospitalizations increasing and investors concerned that recent protest will fuel a wave of infections, the risk of persistently weak economic and earnings growth has increased. S&P fair value estimates are falling as a result.And it’s those macroeconomic concerns that ultimately feed into the cautiousness expressed by Powell, which the market hated seeing.“I think as we look out, we have to be a little bit careful with how the health crisis evolves. We have to remember it’s a health crisis that has led us into this. I’ve been pointing out for the last couple of weeks that if you exclude New York and New Jersey — which have been doing very well in terms of the pandemic — you have a number of rising new cases across states. Close to 20 states are seeing cases rise in the U.S.,” said Oxford Economic chief U.S. strategist Gregory Daco on Yahoo Finance’s The First Trade.Daco added, “That’s part of the first wave. It could have a direct effect on the economy just at the time when we were starting to think about recovery. The question is how strong is the fear factor and how strong are the renewed lockdown orders.”Clearly, the market wasn’t even thinking about renewed lockdown orders headed into this week. But now they are, and it could be risk off in the markets for a little while longer.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Coca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}