{"article": [{"url": "https://finance.yahoo.com/news/trumps-surgeon-general-on-why-local-mask-mandates-work-best-222729157.html", "published": 1595352920.0, "headline": "Trump’s Surgeon General on why local mask mandates ‘work best’", "body": "For months, the message coming out of the White House on masks was mixed. \"I don't see it for myself\" President Trump said in April, about the possibility of him wearing a mask, and he avoided being photographed in one even as his top health officials advocated for their use.But the administration tone since the president first appeared in a mask in front of reporters on July 11 has shifted sharply. Top officials, a presidential tweet, and Tuesday’s press conference have all focused on getting more Americans to wear masks.We are United in our effort to defeat the Invisible China Virus, and many people say that it is Patriotic to wear a face mask when you can’t socially distance. There is nobody more Patriotic than me, your favorite President! pic.twitter.com/iQOd1whktN— Donald J. Trump (@realDonaldTrump) July 20, 2020“I'm not opposed to mandates at the state and local level,” said Trump’s Surgeon General, Jerome Adams, adding that local controls “work best” in stopping the spread especially if they are paired with education. The remarks came during an interview with Anjalee Khemlani for Yahoo Finance’s All Markets Summit Extra on Tuesday evening.Adams also made a full-throated push to mask up in order to help with the economic reopening. “I want people to know masks actually don't inhibit your freedom,” he said, telling Americans, “you'll have more choices if you wear a face covering.”The administration has been consistently opposed to a national mask mandate – something Adams reiterated during his Yahoo Finance conversation. But his openness to local mandates suggests the Trump administration might not seek to block the mandates that states – from California to Maine – and businesses have been implementing.White House officials from the president on down have opted to focus on voluntary compliance. Press Secretary Kayleigh McEnany urged Americans to “follow the president's lead” and Trump added that everyone should wear one, saying “whether you like the mask or not, they have an impact.”Story continuesPresident Trump holds a mask during press conference at the White House on July 21. (JIM WATSON/AFP via Getty Images)When he was asked about mandates, Trump said, “I leave it up to the governors.” An unpublished report by the White House Coronavirus Task Force from last week reportedly suggested that at least 18 states have enacted stricter measures such as mask requirements.Others, like Georgia Gov. Brian Kemp have taken a different approach. Kemp filed an emergency motion to block the city of Atlanta from enforcing a mask mandate. Atlanta Mayor Keisha Lance Bottoms, who herself has tested positive for COVID-19, announced the mandate in early July.‘We can reopen and then we can stay open’The wild card is how Trump talks about specific mask mandates when he is likely to be asked about them in coming days. The White House has long sought to shift responsibility for the crisis to the states but the president has also reinstated briefings on coronavirus that are sure to keep him center stage.In April, while he was briefing daily, it wasn’t uncommon for Trump to talk about being a “backup” to the states one day and saying he has “absolute power” over them the next.In recent days, Trump has continued to offer thoughts that clash with his top health experts, like Dr. Adams who has taken on a more prominent role in the administration’s coronavirus response in recent days.During a recent Fox News interview, the president said he didn’t support a national mask mandate because “I want people to have a certain freedom.” He added, “I don’t agree with the statement that if everybody wears a mask, everything disappears.”“If we can get 90% of people to wear face coverings and get people to practice at least six feet of social distancing from their neighbors and practice good hand hygiene,” Adams said just a few days later, “we can reopen and then we can stay open.”Some feel face coverings infringe on their freedom of choice- but if more wear them, we’ll have MORE freedom to go out. Face coverings ➡️ less asymptomatic viral spread ➡️ more places open, and sooner! Exercise and promote your freedom by choosing to wear a face covering! pic.twitter.com/3A4fW2qmN8— Jerome Adams (@JeromeAdamsMD) June 14, 2020Adams also acknowledged that the guidance has shifted on masks and “COVID-19 has really humbled us in terms of its asymptomatic spread.”During his Tuesday press conference, Trump appeared without a mask but pulled one out of his pocket at one point. \"I'm getting used to the mask,\" he said.Adams, who continues his work on the coronavirus task force but did not appear at the president’s press conference Tuesday along with other health experts, said his focus is on giving the president the best information he could.Of the task force’s recommendations Adams said, “that input is being given to the president of the United States and that's all that I can ask for.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Surgeon General Adams: Feds 'working 24/7' on coronavirus, but DC can't do everythingAll Markets Summit Extra: Anthony Scaramucci, Jerome Adams, top CEOs offer clarity amid crisisCarnival CEO: 'We are doing what we need to do' to start cruisingRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}