{"article": [{"url": "https://finance.yahoo.com/news/inside-capital-ones-new-partnership-with-microsoft-to-fight-fraud-164808265.html", "published": 1597924580.0, "headline": "Inside Capital One’s new partnership with Microsoft to fight fraud", "body": "Photo by: STRF/STAR MAX/IPx 2020 8/14/20 Big Businesses continue to thrive in New York City during the Phase 4 reopening. Smaller retail shops and restaurants have not been as fortunate.During Microsoft’s (MSFT) Q4 earnings call last month, CEO Satya Nadella mentioned that the company was working with Capital One (COF) in a partnership to improve fraud detection for credit card transactions. In an exclusive interview with Yahoo Finance, Capital One’s head of fraud, Sarah Strauss, explained exactly what that means for consumers and the companies.The partnership between the two companies allows Microsoft and Capital One to use their data to determine if a transaction is legitimate, which has a few major benefits. First, better fraud detection means less fraud and loss. But the upside is deeper. For a merchant like Microsoft, it means that a transaction is more likely to go through. For Capital One, it means fewer instances of someone paying with a different card. And for a credit card user, not getting your legitimate transaction declined because of a false positive means a better experience.When you make a transaction with your credit card, it’s graded by both merchants and credit card companies on how likely it is to be legitimate. An out-of-the-ordinary purchase – say, paying for a hotel stay online when you rarely travel – often raises a red flag and results in a declined transaction.Unfortunately, credit card companies and merchants don’t usually share data or their assessments of the legitimacy of transactions with each other; the two parties’ processes are independent. But a small piece of data from one to the other could mean the difference between partial confidence and near certainty that a transaction isn’t fraudulent. This is how the new partnership between Capital One and Microsoft works: If Microsoft is pretty sure someone is making a legitimate purchase it actually tells Capital One instead of staying silent.Controller Gamepad of Xbox Gaming Console is seen with XBox One logo in back of it, in Mersin, Turkey on December 11, 2019. (Photo by Sezgin Pancar/Anadolu Agency/Getty Images)Currently, this only helps people with Capital One credit cards who are buying goods and services from Microsoft, but Strauss said Capital One was talking with other merchants to expand the improved fraud detection.Story continuesHow it worksIf a merchant knows your IP address because you’ve shopped on that website before, it feels good that it’s you doing the shopping and not a scammer.“If the merchant can pass some of that data on, something that might have looked risky now looks incredibly low-risk,” said Strauss.Strauss added that only relevant information would be shared from Microsoft or any future partners in this project.Consumers are not liable for fraudulent transactions on their credit cards if they’re caught quickly. So the fraud detection part of this may not be a big deal — just the reduction of false positives. But Capital One says that cardholders often have anxiety around fraudulent use, even if they’re not liable, often from dealing with the process of getting a fraudulent transactionCapital One and Microsoft are sharing data with each other regarding credit card transactions. (Getty Images)removed or feeling like they’ve been taken advantage of by a scammer.In the second half of last year, credit card fraud was going strong with around 75 million stolen accounts available for purchase on the dark web, according to Sixgill, a cybersecurity firm. Now, thanks to the coronavirus and more enforcement, stolen cards for sale are down by around 40%, and the scam business is adapting by figuring out how to steal card information better online, versus in physical stores — another reason why credit card companies are doubling down on their fraud detection systems.For companies that often end up liable for fraudulent transactions, improved data regarding what is a legit transaction or not means saving money, and fewer false positives mean uninterrupted business, Strauss said.All of this is even more timely with the coronavirus crisis, which Strauss said has forced many more transactions online and changed the landscape for fraud — further shifting it online.“I think merchants are even more interested in opportunities to share data in these ways,” said Strauss. “We’ve seen a lot of interest.”—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Young investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteranMost companies plan to give raises and bonuses in 2021: surveyThe key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right nowRetail investors have seen huge gains as S&P 500 nears pre-pandemic highThere are two types of stocks on Robinhood"}]}