{"article": [{"url": "https://finance.yahoo.com/news/workers-on-office-reopenings-i-would-like-to-never-go-back-to-the-office-202416539.html", "published": 1593703940.0, "headline": "Workers on re-openings: 'I would like to never go back to the office'", "body": "A person walks by the Charles Schwab logo in midtown as New York City moves into Phase 2 of re-opening following restrictions imposed to curb the coronavirus pandemic on July 1, 2020 in New York, New York. Phase 2 permits the re-opening of office jobs, real estate services, in-store retail services such as rentals, repairs and hair salons, and outdoor dining. (Photo by Rob Kim/Getty Images)Reopening businesses has started in many states and cities across the country. For people who have been working from home, some are chomping at the bit to get out of the house. Others, however, are not psyched.So far, the forced work-from-home framework many companies have been forced to implement has been largely seen as a success by many businesses and workers, some of which have decided to allow more widespread remote work, like Facebook (FB), Twitter (TWTR), and Square (SQ). Most people have been able to get the job done from home.Whether it’s better or not is another story. Just over half of people (51%) who have been working from home think it’s better, according to a recent survey from Yahoo Finance-Harris Poll, while 30% say it’s worse. Some surveys have shown even more optimism. According to Korn Ferry, almost two-thirds of its survey respondents said they are more productive from home.Quality of the experience aside, there are still some people are excited to be back in the office and to see their colleagues, potentially get out of a small apartment, and being able to focus on work and not parenting — if there’s childcare, that is.\"One thing stands out in the stories of re-openings is that folks were eager to get back to life as they knew it pre-Covid-19,” Oppenheimer equity research wrote in a note on Monday. “Many of us are looking forward to seeing our colleagues at the office at some point in the not-too-distant future (even if at a social distance).”Logistics and new outbreaks put a stick in the spokesCompanies like JPMorgan Chase in New York have been considering their reopening plans for their massive offices in Midtown Manhattan.In a memo to employees, the bank said that it's time to go back in and plan to start on July 13, though some employees returned on June 22. The company is bringing back employees in waves and expects to be at around 20% occupancy until Labor Day. The idea is to go slow and figure things out for a larger fall return. Bank of America said Thursday it plans to bring employees back to offices in phases after Labor Day.Story continuesPhoto by: STRF/STAR MAX/IPx 2020 6/22/20 Subway riders continue to wear masks during the phase 2 reopening amidst the Coronavirus Pandemic in New York City.Companies like JPMorgan have rigorous safety protocols to adhere to, including temperature checks, face coverings, social distancing, more cleaning, and cafeteria changes. Above all, they say they will be flexible to accommodate employees.Unfortunately, getting there is another story. For most people getting to an office in Manhattan, they ride the subway or other public transit. And for parents with childcare facilities that could be closed, that’s another bottleneck.\"I don’t see how anyone can be comfortable with going back to New York City offices anytime soon,” said Ryan Craggs, who works at Hearst Digital. “Of the 12 people on my subway car, four aren’t wearing masks properly. I am less concerned with the office building than public transit commuting.”According to Reuters, just one in five New Yorkers will be able to get to work under the six-foot social distancing guidelines, which are essentially impossible to conform to for anyone using public transportation.This may prove to be the weakest link. There aren’t any solutions yet to fix the bottleneck, and the MTA still recommends people to stay home if they can.“I’m not comfortable taking mass transportation to work,” said Elana Tarlowe, who works in sales for Meredith.There are a lot of workers like Craggs and Tarlowe who are concerned about various subway behavior like eating and manspreading, but also about the fact that it relies on a system of social trust.\"All it takes is one person not taking things seriously,\" said Craggs.A further question mark: the reopening itself. Company plans can go up in flames based on an order from a governor and based on the botched re-openings and rising cases across the country, there’s no reason why even places that already had their (first) peak may not see another one later.All this is likely why 64% of workers aren’t comfortable going back to work in the next month — or more, according to a Citrix poll. A survey from Korn Ferry found that fewer than a third of workers said it's \"highly likely\" they'll be back when it reopens; and half said they're fearful to return due to health reasons, but most said they trust their employer to do a good job.Cases are surging in the southern part of the U.S. (Graphic: David Foster/Yahoo Finance)Workers appear to be ready for more blends of WFH/in office, with 59% of people expecting to work from home more often (3 days a week or more), according to a recent survey from Piper Sandler. Furthermore, surveys show that people are investing in their WFH setups even as reopening progresses.For some people who left populous cities like New York during the virus’s surge in the spring or others who decided to press fast-forward on other life-stages, a return to the city is especially unappetizing.\"I would like to never go back to the office,\" said Caroline, who works in advertising and asked Yahoo Finance not to not to use her last name for obvious reasons. \"Commuting is bad for sure, but spending 8 hours under hospital lighting with people I only kind of like? I feel like I have more ownership over my time and my life, frankly.\"Not having to wear makeup or feel like career growth is linked to physical presentation, she added, was an added bonus.The upside surprise for the great WFH experiment so far has been that for many, it’s been positive.“I absolutely think working from home has been OK,” said Tarlowe. “I do miss the feeling of the team being together. But I’m surprised at how Webex has been able to fill that void. I was not expecting it.”--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Women far less bullish about their investment goals than men: Survey'We're seeing a 6,000% increase in spam': IBM cyber VPHardly any at-home workers have returned to their normal workplaceHere’s a running list of companies boycotting FacebookWant a 'slice' of a stock? Demand booms for fractional shares as markets soarLeisure and hospitality drive jobs numbers higherWhy pandemic insurance is impossible"}]}