{"article": [{"url": "https://finance.yahoo.com/news/what-is-a-stock-split-yahoo-u-191503471.html", "published": 1596205400.0, "headline": "What is a stock split: Yahoo U", "body": "For more business and finance explainers, check out our Yahoo U page.Two giants in the tech world split their stock on August 31: Apple (AAPL) and Tesla (TSLA).Both companies saw their stock prices rise higher following the opening bell, drawing investor interest in not only Apple and Tesla but the financial concept of stock splitting.Apple, which had executed on four other stock splits in its history, announced its fifth stock split alongside its earnings report for the third quarter of 2020. The 4 to 1 stock split would divide up shares of Apple, which at the time, were trading close to $420 as of July 31.Tesla, which had never done a stock split in its history, followed suit on August 11, announcing a 5 to 1 split. At the time of announcement, shares of Elon Musk’s company were trading close to $1,400.Stock splits have little fundamental effect on the company itself, but the financial maneuver allows companies to capitalize off of a rising stock price by increasing access to its shares.How does a stock split work?Stock splits begin with a company announcement that it intends to divide up each share of its stock into a set amount of units.So if an investor holds one share of a company stock worth $400, a 4 to 1 stock split would divide up that investor’s holdings into four shares each worth $100.The market cap of the company remains unchanged, since the value of each investor’s holdings remains the same ($400 in the example). But the difference is that the amount of shares held by the investor has multiplied (from 1 to 4 in the example).The company will set a day on which the split takes effect. At the close of business, all investors holding stock will have the number of shares held converted along the terms of the stock split. Another date would be set for when trading begins on a split-adjusted basis.Why would a company split its stock?Splitting stock increases the “float,” or the number of shares available for trading. With more shares in the market, more investors would have a shot at owning part of the company.Story continuesA lower stock price will also make it more accessible to investors with less capital. For example, an investor with only $200 or $300 would be unable to buy a whole share of a company stock priced at $400. Splitting the stock into $100-per-share pieces would allow more investors to buy.Broadly, splitting stock makes ownership a little easier and available to a wider range of people.In Apple’s announcement, the company said it hopes the 4 to 1 split will “make the stock more accessible to a broader base of investors.”But what about ‘fractional trading’?Accessibility has become a smaller problem with the advent of fractional trading. Brokerages (i.e., Fidelity, Interactive Brokers, Robinhood) are allowing investors to purchase shares in amounts less than 1.(Photo by Filip Radwanski/SOPA Images/LightRocket via Getty Images)For example, an investor could place an order for 0.5 shares of a stock worth $400 (thus paying $200). The brokerage would buy one whole share at $400, give half of the stock to the investor, and hold onto the remaining half.The brokerage could hold onto the other 0.5 shares until another investor comes along with a buy order for a 0.5 share. Or it could piece together remnants from other fractional trades (0.25 here, another 0.25 there) to create a whole share.So why would a company still divide up its shares?Stock splitting can be an informal signal to investors that the company is optimistic that the stock price can continue to go higher.Although the stock split has nothing to do with the company’s fundamentals, the desire to increase the float implies that there is strong demand for shares of the company.But not all companies with surging stock prices end up turning to stock splits. For example, Berkshire Hathaway’s Class A shares are notoriously expensive. As of July 31, a single share of BRK-A was trading at $291,906.25, more expensive than a brand new 2020 Lamborghini Huracan EVO.Is there such thing as a reverse stock split?Yes. Companies with low stock prices can increase the value of their listed shares by consolidating units.For example, five shares at $1 each could be merged into a single share at $5 each.But just as a stock split signals optimism over a rising share price, a reverse stock split implies concerns over a falling share price. Companies will often turn to this strategy to avoid delisting from a major exchange. For example, the Nasdaq has a rule stating that a stock is at risk of being delisted if its price is below $1.00 per share for 30 consecutive days.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed chair says economy faces 'new phase' as coronavirus deaths top 150K, data softenFed: Economic recovery will depend 'significantly on the course of the virus'FOMC Preview: 'Probably nothing' new as Fed weighs guidance amid coronavirus surgeWells Fargo's Mary Mack: 'We have more to do' on rebuilding reputationA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}