{"article": [{"url": "https://finance.yahoo.com/news/americans-are-shelling-out-30000-on-these-pop-up-backyard-home-offices-during-the-pandemic-121919371.html", "published": 1598426840.0, "headline": "Americans are shelling out $30,000 on these pop-up backyard home offices during the pandemic", "body": "As the coronavirus pandemic in 2020 continues to accelerate the shift towards working from home, one new amenity is proving to be the new “must have” for any home.It’s no longer the master bathroom and no longer the kitchen, instead 2020 has made the home office and all the privacy and quiet that comes with it the new hot item being spotlighted by new real estate listings.A very 2020 thing:Home listing in Oakland touting a \"nice backdrop for Zoom calls\" pic.twitter.com/ZBlHAIG8F7— Sarah Frier (@sarahfrier) July 24, 2020But what if you’re stuck in a crowded house with nowhere left to take your Zoom calls? Turns out an increasing number of Americans have recently been turning to purchasing prefabricated, stand-alone office options.For Boulder, Colorado-based Studio Shed, which has been building small offices and bedrooms that cost an average of $20,000 to $30,000 in backyards since 2008, business has been exploding. Studio Shed co-founder Mike Koenig tells Yahoo Finance that the shift to work from home during the pandemic has propelled sales to increase 14-fold over what his company saw last year.Boulder, Colorado-based Studio Shed has seen demand for its prefabricated offices explode due to the shift to work from home during the pandemic.“Recently, we have seen a massive surge in the 80- to 120-square feet option, which is a perfect office size or home gym or kid’s study area,” Koenig said. “We were already seeing some very good growth having started in 2008 just seeing these shifts in the way people work and wanting to spend more time at home and maybe not commute, but starting in March it’s just been growing significantly.”Studio Shed's stand-alone offices vary in size and cost, but average about $20,000 to $30,000, including foundation and sight work costs.While most of the demand for Studio Shed’s home offices have traditionally come from Western U.S. states, Koenig says the East Coast has been experiencing a spike in demand as more people work from home. In many areas where permits aren’t required for add-on dwellings below 200 square feet, the pop-up office has become an attractive solution to reduce a cramped home feeling as homes double as workspaces.Story continues“As soon as March and April hit we definitely saw that Eastern part of the country grow, that market is up a couple hundred percent over last year,” he said.For the month of August, a traditionally slow month for sales, Koenig says business is pacing to top last year’s mark by a factor of 14.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:VR meeting startup VirBELA posts 260% growth amid COVID-19 pandemic and potential spinoffThis $3 billion online education company is seeing a 'paradigm shift' due to coronavirusNetflix co-founder brushes off NBC's new Peacock streaming competitorWhy Costco could see a lasting boost from coronavirus panic buying"}]}