{"article": [{"url": "https://finance.yahoo.com/news/netflix-film-dissects-technology-driven-232240527.html", "published": 1599589820.0, "headline": "Netflix film dissects a technology-driven 'social dilemma'", "body": "SAN RAMON, Calif. (AP) — A new Netflix documentary is setting out to expose technology’s corrosive effects on society during a pandemic that's left people more dependent than ever on tools that keep them connected with friends, family and colleagues they can no longer meet in person.So the timing for Wednesday’s release of “The Social Dilemma” might strike some viewers as odd. But its makers aim to give you a better sense of why the pandemic isn’t the only reason it feels like we’re stuck in a dystopian nightmare.The film, directed by Jeff Orlowski, aims to explain how Silicon Valley's embrace of smartphones, attention-grabbing algorithms, polarizing echo chambers and pursuit of profit have left users reeling in a way that could pose an existential threat to U.S. democracy.“It is a self-destructive code that has been planted in our society right now,\" Orlowski said in an interview with The Associated Press.The notion of modern social media as a malign force that has hypnotized us into mindlessly scrolling distracting feeds, fostered division and elevated previously marginal groups and ideologies in ways that undermine social cohesion isn't particularly new. For the past several years, it's been the subject of Silicon Valley mea culpas (at the individual, if not corporate, level), foreboding news articles and academic studies and books.Some tech-company engineers and executives have gone so far as to keep their own children off phones and social media. And a number of engineers have also been quitting high-paying technology jobs rather than continuing to contribute to the problems they believe their employers have caused.The latest example surfaced Tuesday when The Washington Post disclosed that a Facebook engineer had written a lengthy internal letter explaining why he was leaving the company. \"I can no longer stomach contributing to an organization that is profiting off hate in the US and globally,” wrote Ashok Chandwaney, who worked at Facebook for five and half years.Story continues“The Social Dilemma” is the culmination of a three-year project aimed at making the severity of an extremely complicated problem easier for non-tech types to grasp — and perhaps motivating people to take action to prevent worse consequences.The film pulls together the disparate threads of its argument through revealing — and sometimes chilling — insights from former executives at Facebook, Google, YouTube, Twitter, Instagram and Pinterest. These are set against the backdrop of a fictional family addicted to screens filled with manipulative content served up by a ruthless set of algorithms embodied by actor Vincent Kartheiser, best known playing ad exec Pete Campbell in the TV series “Mad Men.\"Tristan Harris, a former Google executive who plays a leading role in the film, said he hopes “The Social Dilemma\" can wake up society the way Ralph Nader's book “Unsafe At Any Speed\" spurred the introduction of seat-belt laws and Al Gore's award-winning 2006 documentary “An Inconvenient Truth\" sharpened focus on the climate changes caused by human-generated greenhouse gases.“What I am really hoping is this film will be the first time we have a shared truth, a shared reality about the breakdown of our shared reality,\" Harris told The Associated Press in an interview.Harris, now the president of the Center for Humane Technology, began sharing his disillusionment while he was still working at Google, and some of his posts about the subject caught Orlowski's attention. The two had known each other while attending Stanford University, paving the way for them to reunite on a film that they both felt was important to finish before this November's U.S. presidential election.“I don't want to have false optimism that we would shift the election or swing the election, but I think it's an important part of the conversation,\" Orlowski said. “The more we can recognize how this software is invisibly reshaping our society and acknowledge and understand this is a reality we are living in right now, then we can work to improve that.\"___Myers reported from Los Angeles."}]}