{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-trump-ships-rapid-tests-to-states-ramping-up-pressure-to-reopen-schools-150459992.html", "published": 1601375360.0, "headline": "Coronavirus update: Trump to ship rapid tests, ramping up pressure as NYC reopens schools", "body": "The Trump administration announced a national distribution plan to ship 150 million rapid antigen tests in an effort to push for more widespread school openings, as COVID-19 infections and deaths continue to mount.The pandemic has now claimed over 1 million lives worldwide in a span of under a year. America remains the world’s epicenter of coronavirus casualties with over 7 million confirmed cases and 200,000 deaths.To aid in helping schools reopen safely, the federal government has purchased Abbott’s (ABT) rapid tests, which provides results in 15 minutes and were recently approved by the U.S. Food and Drug Administration. The antigen tests, hailed by Health and Human Services Secretary Alex Azar as a linchpin of President Donald Trump’s testing strategy, provide the ability to identify possible active infections.The administration’s move was amplified by developments in New York City — a former global coronavirus epicenter — which on Tuesday began in-person elementary school classes, with most of the city’s 1 million-plus students still learning remotely.The Big Apple’s hybrid model marks a milestone in a city where large swaths of public life are still under restrictions. Yet the school reopening was a hard-fought compromise between teachers, principals and city officials — and infections have recently begun rising in areas of NYC after months of stability. On Tuesday, Mayor Bill de Blasio said the city’s daily rate of positive tests jumped above 3% for the first time in months.All of which is stirring furious debate over the administration’s antibody strategy, with health experts warning that testing is merely one tool in the toolbox to helping monitor outbreaks.The administration’s timing and focus on education coincides with rising protests from teachers in various states that are grappling with in-person class mandates — and some unions have held or threatened to hold strikes. Amid those concerns, more than 100 teachers did not show up for classes in Arkansas on Monday.Story continuesKey to preventing COVID-19 spreading are social distancing, proper ventilation, mask wearing in crowded places — like schools— and frequent hand washing. Public health officials have warned against staying in indoor places for extended periods of time, even if masked, as concerns are raised over the reopening of bars and restaurants.Where the outbreak is surging and falling in the U.S., by region.While children are less likely to show symptoms of the virus, health experts worry about the potential of asymptomatic spread from school-aged children to adults. The U.S. Centers for Disease Control (CDC) released a new study of symptoms in younger children Monday, noting that minorities were — similar to adults— disproportionately affected, and more likely to end up in the intensive care unit at hospitals.As a result, the CDC urged schools to “implement multiple concurrent preventive strategies and adjust mitigation depending on local levels of transmission to reduce COVID-19 disease risk for students, teachers, school staff members, families and the community.”However, the agency’s guidance has come under fire in the wake of a New York Times report that suggested the White House was politicizing CDC policy. Teachers and adults at schools are likely to be at increased risk, since children are more likely to be asymptomatic and less likely to be quarantined. And in some cases, parents have reportedly sent infected kids to school deliberately.What the experts are sayingScott Atlas, a Stanford University fellow and one of Trump’s key coronavirus advisors, has been adamant that schools should reopen. At a recent press conference in Florida, Atlas said the U.S. was “the only country of our peer nations in the Western world who are so hysterical about reopening schools.”His remarks underscored the sentiments expressed by other experts who have argued in favor of in-person learning, based on mental health and educational equity. Since lockdowns began in March, scores of parents at all income levels have also struggled to balance at-home learning with work responsibilities.An August article in the Journal of the American Medical Association noted that school closures have heightened the risk that “children may experience worsened mental health as well as reduced access to nutritious foods and health services, lower academic gains, and less attention from protective services.”Those problems are worse in lower income communities, the authors wrote, which also raised questions about whether and how children can spread COVID-19.The American Academy of Pediatrics and the Children’s Hospital Association have noted that children represent 9%of all COVID-19 cases in the country, and hospitalization rates are lower among kids. And just like in adults, a disproportionate number of minorities are affected by the virus.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}