{"article": [{"url": "https://finance.yahoo.com/news/bidens-age-might-work-in-his-favor-170833466.html", "published": 1592309780.0, "headline": "Biden’s age might work in his favor", "body": "President Trump frequently refers to his Democratic challenger as “Sleepy Joe” Biden, suggesting the former vice president is lethargic and confused. Informally, the Trump campaign claims the 77-year-old Biden is outright senile.Biden’s verbal gaffes help feed this narrative, but Trump’s attacks on Biden’s age could backfire. Trump, 74 himself, has looked frail at times, such as when he struggled to lift a water glass to his mouth while giving the commencement address at West Point on June 13, and when he inched down a ramp after the speech. Trump recently belittled a 75-year-old protester in Buffalo who was injured by riot police, falsely claiming he was a violent anarchist, when in reality he’s a long-time peace activist. Slandering the elderly isn’t normally a shrewd vote-getting move.Trump is also earning poor marks for his handling of the coronavirus crisis, which may concern seniors more than any age group because they’re most vulnerable to the Covid-19 virus. Since mid-March, Trump’s net approval on his handling of the coronavirus has fallen by 29 percentage points among those 65 and over, according to Morning Consult. Trump now refers to remaining coronavirus cases as “embers,” as if the fire itself is stamped out. But infections and hospitalizations are still rising in several states—including retirement havens such as Florida and Arizona. Seniors could conclude Trump is still failing to take an urgent health risk seriously.There are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Trump won voters 65 and over by 9 percentage points in 2016, according to Pew Research. That was his best showing among any age group. But Trump is losing his grip on seniors in 2020. A Quinnipiac poll from May found Biden leading Trump by 10 points among voters 65 and older. A Fox News poll that breaks out age ranges differently found Biden ahead by 3 points among voters 45 and up. “Older voters are moving to Biden,” Beacon Research wrote in a recent analysis of the 2020 race. “Covid-19 certainly may not be helping Trump's cause with older voters, but seniors were a core group of Biden's constituency during the Democratic primary.”Story continuesYoung voters still don’t decide electionsYounger voters may be disappointed in a presidential campaign with two candidates born in the 1940s, but young voters still don’t decide elections. Older voters do. In the Democratic primaries, Bernie Sanders’ call for revolution gave him a strong lead in polls among young Americans. But they didn’t show up to vote. Older voters turned off by Sanders’ extreme positions did show up, and they favored Biden over all the others, allowing him to surge ahead in the primaries and essentially clinch the nomination fairly early on.Voters 50 and over accounted for 56% of the turnout in 2016, and 60% in the 2018 midterms, according to AARP. It will probably edge higher in 2020. The turnout rate for voters 65 and over in 2018 was 69%, the highest for any age group. The one area where voters still trust Trump more than Biden is the economy. But that’s not a top three concern among older voters of either party, according to AARP. Republicans and Independents care most about health care, which is the No. 3 concern for Republicans. That’s a strength for Biden, who favors lowering the Medicare eligibility age to 60 and expanding the Affordable Care Act.US President Donald Trump and Military Academy Superintendent Darryl Williams (R) salute cadets at the 2020 US Military Academy graduation ceremony in West Point, New York, June 13, 2020. (Photo by Nicholas Kamm / AFP)The top concern for older Republicans is immigration, also a Trump strength. But Biden doesn’t need to win Republican votes to beat Trump. Increasing the share of Independents above Hillary Clinton’s 42% tally in 2016 would be enough to put Biden over the top, and for now, Biden’s edge among Independents is a few points higher.Biden has also called for an aggressive national testing and tracing program for the coronavirus, while Trump has mostly deflected such responsibilities to governors and mayors. Not surprisingly, voters trust Biden more than Trump to handle the coronavirus.With more than four months left until the election, there’s still plenty of time for events to shift the advantage to either candidate. But senior moments highlighting Biden’s age might not be nearly as disqualifying as the Trump campaign hopes. The most important voting bloc may simply claim Biden as one of their own.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Some nightmare scenarios for the November electionsThe stock market is off the railsThe risk to Biden if he picks a black running mateHow Biden wallops TrumpIf you want to protect lockdowns, renounce health careGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}