{"article": [{"url": "https://finance.yahoo.com/news/how-jp-morgan-chase-is-making-banking-cool-for-black-teenagers-123305151.html", "published": 1592466080.0, "headline": "How JPMorgan Chase is making banking ‘cool’ for black teenagers", "body": "Eric Williams was a freshman in high school who thought he could play sports forever. He grew up in Chicago and looked up to Los Angeles Lakers superstar LeBron James.“Honestly, I never really had a positive role model,” Williams told Yahoo Finance. “Someone that looks like me, someone who’s older than me to steer me in the right way other than athletics,” he said, “I feel like people of my generation feel like the only reason, or only way to become famous is through sports or through entertainment and things like that. But I feel like that’s not true.”Williams, 21, no longer defines success in the same way he did in high school because of the transformative experience he had in JPMorgan Chase’s The Fellowship Initiative program. Launched in 2010, the program aims to improve the economic and social outcomes of young black men.The six-year graduation rate for black students who started pursuing a bachelor’s degree at a four-year institution in fall 2010 was 40%, compared to 64% for their white peers, according to the National Center for Education Statistics. And the median white household is 10 times wealthier than the median black household.Eric Williams, The Fellowship Initiative Fellow, and Rudy Lozano, Vice President, Global Philanthropy, Regional Director of The Fellowship Initiative at JP Morgan Chase & Co, in D.C. for Congressional briefing on mentoring in 2017.In the wake of the killing of George Floyd, these disparities have taken on more urgency as companies nationwide are making efforts to battle racism, many through donations to social justice causes. JPMorgan Chase (JPM) CEO Jamie Dimon renewed the company’s commitment to addressing the U.S. racial wealth gap. And part of that commitment is expanding The Fellowship Initiative to triple the number of participants. More than 1,000 students from low-income communities in cities across the country will be paired up with JPMorgan employees who will help them with their academic and career pursuits over the next 10 years.Teaching ‘life lessons’An avid football and baseball player, runner, and wrestler in high school, Williams is currently pursuing an exercise science major at Eastern Illinois University. He wants to become a physical therapist or strength and conditioning coach.Story continues“Before TFI, sports was something that kept me out of trouble. Sports was something that kept me busy,” he said. “And I feel like if I can be able to be a positive role model to youth through sports, it’s not only helping them stay active, fit, but I’m also teaching them life lessons, as well.”It took some convincing to get Williams on board with the time commitment TFI required. Participants must set aside three Saturdays a month to spend time at JPMorgan Chase and its non-profit partners’ offices and learn new skills, take on new projects, do community service, and travel to colleges and other countries in order to learn how to represent their communities as global citizens. The work – including homework – involved in TFI was a challenge for Williams, but, he said, “it made me explore the best of me.”Credit: JPMorgan Chase The Fellowship InitativeThat’s time Williams would have preferred to devote to sports, but his JPMorgan mentors impressed him. “You wouldn’t know that unless you see people that look like you that’s like, hey, you know, it’s cool to go to school and work in a bank,” said Williams.Empowering Williams to become a role model is a point of pride for TFI.“Over the past 10 years, we’ve been able to support more than 350 students in Chicago, Dallas, Los Angeles, and New York. All of those students have graduated from high school, on track to succeed in college,” said Linda Rodriguez, Executive Director for Youth Initiatives in Global Philanthropy at JPMorgan Chase.“They’re amazing young people, and I think they are bringing in the voices and the ideas that we need to move the country forward,” she said.More from Sibile:Kareem Abdul-Jabbar on how Bruce Lee beat the system, fought racismKareem Abdul-Jabbar on George Floyd protests: Black Americans have been playing catch-up economically since the Civil WarKareem Abdul-Jabbar: ‘The NFL got on the right side of history’Historic jobs report signals fragile recovery. ‘I didn’t hire a single person back,’ says NYC restaurant owner3 ways civil unrest following George Floyd nationwide protest hurts the stock marketFind live stock market quotes and the latest business and finance news"}]}