{"article": [{"url": "https://finance.yahoo.com/news/global-drug-market-is-booming-in-the-21st-century-un-concludes-164606260.html", "published": 1593258860.0, "headline": "The global drug market is booming in the 21st century, UN concludes", "body": "There’s one “business” that’s possibly recession-proof and COVID-proof: The illegal drug trade.According to the latest United Nations Office on Drugs and Crime (UNODC) World Drug Report, the global drug market has expanded over the past two decades for a combination of reasons related to drug production, trafficking, and use.“Expansions can be seen in terms of the overall number of people who use drugs, the illicit production of opium and manufacture of cocaine and the quantities of drugs seized,” te report stated. “If analysed in isolation, however, each of those indicators by itself would not justify the conclusion that there has been an overall market expansion.”World Drug Report 2020Furthermore, the global coronavirus pandemic could make things worse going forward.“Vulnerable and marginalized groups, youth, women and the poor pay the price for the world drug problem,” UNODC Executive Director Ghada Waly said in a press release. “The COVID-19 crisis and economic downturn threaten to compound drug dangers further still, when our health and social systems have been brought to the brink and our societies are struggling to cope,”Supply and demandThe size of the global population has grown, lending itself to an increase in global demand for drugs. At the same time, supply has also been increasing over the years, making drugs a lot cheaper and hence more available.World Drug Report 2020The report noted that the availability of new drugs was also spurring more demand, as evidenced by the case of the narcotic-like pain reliever tramadol.The opioid crisis in North America, as well the “rapid emergence of a synthetic drug market in the Russian Federation and Central Asia, can also be defined as supply-driven phenomena,” the report stated.In Southeast Asia, the predominant type of drug has become meth. In the Middle East, amphetamine. Opiates are prevalent across in North America, while Africa is dealing with heroin (and North and West Africa struggle with tramadol).(GRAPHIC: UNODC)More drugs, bigger bustsStory continuesThe surge in drugs across the world is evidenced by massive drug busts.In Myanmar, police made a massive drug bust in May 2020, seizing 200 million meth tablets, 500 kilograms of crystal meth, and 35.5 metric tons and 163,000 liters of precursor chemicals used to manufacture illicit drugs, as well as 990 gallons of liquid methylfentanyl (which is a synthetic opioid like fentanyl).Crew members of the U.S. Coast Guard Cutter Vigilant worked with Honduran and Colombian militaries made a drug bust off the coast of Costa Rica, seizing 6,800 pounds of cocaine with an estimated wholesale value of $118.3 million.Crew members aboard the Coast Guard Cutter Vigilant stack seized cocaine at Coast Guard Base Miami Beach, Florida, in this photo taken June 12, 2015. (PHOTO: REUTERS/U.S. Coast Guard/Petty Officer 3rd Class Mark Barney/Handout)One of the big concerns the UN had was the fact that young people in developing countries were starting to experiment with drugs.“Drug use increased far more rapidly among developing countries over the 2000-2018 period than in developed countries,” the report found. “Adolescents and young adults account for the largest share of those using drugs, while young people are also the most vulnerable to the effects of drugs because they use the most and their brains are still developing.”(GRAPHIC: UNODC)UN projecting boom in drugs to continueThough initially it seemed like the coronavirus pandemic hit all supply chains, including those of the illegal drug trade’s, the industry is likely to recover quickly, the UN report found.“Due to COVID-19, traffickers may have to find new routes and methods, and trafficking activities via the darknet and shipments by mail may increase, despite the international postal supply chain being disrupted,” the authors wrote.(GRAPHIC: UNODC)But the supply chain problems could lead drug users to seek other alternatives, they added.“The pandemic has also lead to opioid shortages, which in turn may result in people seeking out more readily available substances such as alcohol, benzodiazepines or mixing with synthetic drugs,” the authors stated. Hence, more “harmful patterns of use may emerge as some users switch to injecting, or more frequent injecting.”(GRAPHIC: UNODC)To mitigate the possibility of a massive surge in the illegal drug trade, the UN recommended, governments should not do what they did during the last financial crisis: In 2008, countries cut drug-related budges and other services related to helping drug users.—Aarthi is a writer for Yahoo Finance. Follow her on Twitter @aarthiswami.Read more:World Drug Report: There are two massive markets for meth'Out of control': Meth is making a big comeback in the U.S.'This is really quite dramatic': Cocaine is booming like never before'They call it ice': North Korean defector details the country’s massive drug problemBeyond botched meth PSA, South Dakota has a problemRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}