{"article": [{"url": "https://finance.yahoo.com/news/president-trump-is-great-for-your-401-k-strategist-162344939.html", "published": 1592825480.0, "headline": "President Trump is great for your 401(k): strategist", "body": "The verdict is far from certain here, but Wall Street strategists continue to believe President Trump winning re-election would be better for your longer-term investments than a president Joe Biden (and most definitely, a “blue wave” sweeping through the House and Senate).“I think President Trump is far better for the economy,” said veteran strategist Michael Lee of Michael Lee Strategy on Yahoo Finance’s The First Trade. “When you had the Biden/Obama recovery it was decent for the financial markets, but not so much for 401(k)s or those at the lower end.”The president did his part to spark concerns on the part of households that own stocks at his rally in Tulsa, Oklahoma over the weekend. Trump noted several times that 401(k) plans would be at risk if he weren’t re-elected as president — it’s likely to be a mantra used at length by Trump on the campaign trail as markets have shrugged off the COVID-19 pandemic and rallied back near record highs.A vote for Trump means a vote for you to have a fatter wallet, or so the president is hyping up.President Donald Trump speaks during a campaign rally in Tulsa, Okla., Saturday, June 20, 2020. (AP Photo/Sue Ogrocki)Indeed, markets look to to be in the early stages of pricing in a Trump re-election (despite polls that show him trailing Biden), which theoretically would mean the extension of his signature corporate tax cuts and a continued focus on de-regulation. The Dow Jones Industrial Average has surged 40% from the March 23 lows, while the S&P 500 has tacked on a similar amount. Moreover, a broader number of stocks have participated in the rally of late such as a consumer staple in Clorox and various industrials.And of course, high-flying tech names remain just that — high-flying. Netflix shares hit a new all-time high on Monday, according to Yahoo Finance premium data.As controversial as President Trump is, market pros would contend that these types of moves upward in equities wouldn’t necessarily happen if the market was sniffing out the real possibility of a blue wave and higher taxes under a president Biden. There is still time for that pricing in to happen if Trump continues to stumble in the polls, but to Lee’s point the market may simply view Trump as friendlier to one’s investments and the economy at large and that sticking around for four more years.Story continues“I do think for the overall economy, a Trump administration would benefit the masses more than those with financial assets,” Lee adds.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}