{"article": [{"url": "https://finance.yahoo.com/news/the-trump-campaigns-bogus-boom-times-201131372.html", "published": 1598455160.0, "headline": "The Trump campaign’s bogus boom times", "body": "At the Republican National Convention on August 25, White House economic adviser Larry Kudlow previewed how the Trump campaign plans to characterize the economy over the next 10 weeks, leading into Election Day: It’s booming!“There’s a housing boom, an auto boom, a manufacturing boom, a consumer spending boom,” Kudlow said. “Stocks are in record territory. A V-shaped recovery is pointing to better-than 20% growth in the second half of this year.Of the 5 Kudlow booms, 1 is legitimate, 1 is partly true and the other 3 are only booms if you fudge the data. Here’s a breakdown:Stocks. Yes, they’re in record territory, after a remarkable recovery from the lows of late March. There’s one basic reason stocks are on a tear: the Federal Reserve has sent them there. When the economy tanked in March, the Fed launched an unprecedented series of monetary stimulus programs that provided liquidity to financial markets and pushed interest rates to historic lows, leaving risky stocks as the only alternative to unprofitable bonds. The net effect is a powerful incentive for investors to plow into stocks, which they’ve done. So if you’re lucky enough to be a shareholder, the stock-market surge is helping safeguard your wealth.Graphic by David FosterHousing. With the Fed pushing mortgage rates to historic lows, home buyers have jumped at the chance to lock in cheap financing. That has pushed home sales to record levels. But that’s only a “boom” for sellers. A surge in demand pushes prices up, creating a burden for buyers. People buying a home benefit from extraordinarily low mortgage rates, but they still have to come up with at least a 20% down payment in most cases, and as home prices rise the cash needed for a down payment goes up. The second chart below shows housing affordability—the amount of income needed to buy a median-priced home—has actually worsened during the last couple months, despite falling mortgage rates. Banks have also gotten pickier about who gets a mortgage, since the risk of ending up jobless has obviously risen since March. So while housing is in a statistical boom, it doesn’t help everybody hoping to buy a home, and it hurts some.Story continuesGraphic by David FosterGraphic by David FosterAutos. Vehicle sales tanked in the spring, when the first wave of coronavirus shutdowns sent many workers home. From February to April, the pace of monthly sales plunged by 41%. Sales have bounced back somewhat since then, with the chart below showing the start of a V-shaped recovery, as Kudlow mentioned. But the latest sales numbers are still 13% below February levels, and it’s more likely sales will flatline than return to normal, until a coronavirus vaccine helps us beat the bug for good.Graphic by David FosterManufacturing employment. This is the same story as with auto sales. The number of manufacturing jobs dropped by 11% from February to April, a loss of nearly 1.4 million jobs. We’ve since gained backed about 600,000 of those jobs, but manufacturing employment is still 6% lower than it was in February. Again, most economists don’t think we’ll return to pre-virus levels of employment until a vaccine is widely available.Graphic by David FosterConsumer spending. You should be getting used to this pattern by now. Consumer spending plunged by an unprecedented 19% from February to April, and it has rebounded some since then. But spending is still 6.9% lower than it was in February, and the expiration of federal unemployment aid and other benefits could lead to a fresh drop in spending rather than extended gains.Graphic by David FosterKudlow’s prediction of 20% growth or better in the second half of 2020 is consistent with what other economists expect. But that’s after a monstrous 33% decline in GDP (on an annualized basis) in the second quarter. Again, if GDP does grow that much, it will be the start of a recovery, but you can only call it a boom if you completely ignore the wipeout in first quarter GDP.Kudlow and his boss President Trump obviously need to spread some economic optimism for Trump to have a shot at reelection in November. Some voters may buy it, and there’s evidence many higher-income voters able to work remotely are immune to the coronavirus recession. But unemployment is still sky-high, with millions struggling to pay rent and buy food. You can’t convince people they’re better off if their pocketbooks say otherwise, and phony optimism could produce another type of boom for Trump—the kind that blows up.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:5 campaign promises Trump has given up onSteve Bannon, revealed as a petty grifterWhy Trump wants to shackle the postal service11 ways Trump is out of touch with votersEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}