{"article": [{"url": "https://finance.yahoo.com/news/nike-reports-fiscal-1q-results-2020-coronavirus-digital-sales-201745232.html", "published": 1600788320.0, "headline": "Nike swings back to a quarterly profit as digital sales surge 82%", "body": "Nike (NKE) posted fiscal first-quarter results that far surpassed consensus estimates, swinging back to a quarterly profit as digital sales surged and lockdown measures eased to allow customers back into stores worldwide.Here were the main metrics from the report, compared to consensus estimates compiled by Bloomberg:Q1 Earnings per share: 95 cents vs. 46 cents expected and 86 cents Y/YQ1 Revenue: $10.59 billion vs. $9.11 billion expected and $10.66 billion Y/YShares of Nike jumped more than 8% after reporting results, following a gain of 15% for the year-to-date through Tuesday’s close.Nike continued to gain ground in digital sales, which accelerated even as the opportunity for in-person sales increased during the quarter. Nike’s digital sales grew 82% in the first quarter, following a 75% jump in the prior period.“Our results this quarter continue to demonstrate Nike’s full competitive advantage, as we strengthen our position in the midst of disruption,” Nike CEO John Donahoe said in a statement. “In this dynamic environment, no one can match our pace of launching innovative product and our brand’s deep connection to consumers. These strengths, coupled with our digital acceleration, are unlocking Nike’s long-term market potential.”A man tries on shoes in the Nike store in Santa Monica, California. REUTERS/Lucy Nicholson (UNITED STATES - Tags: BUSINESS SPORT)The company’s first-quarter results included the three months through August, capturing the period during which pandemic-related store closures largely abated and made way for a return to traffic at brick-and-mortar locations. Nearly all of Nike’s locations were open across North America, Europe, the Middle East and Africa (EMEA), and Greater China during the quarter.Both Nike’s Greater China and EMEA regions saw quarterly revenue increase over last year, by 8% and 5%, respectively. But revenue from North America – the company’s largest segment – dropped again in the first quarter by 1%, as more than 20% declines in apparel and equipment sales outweighed a return to growth in footwear.But across regions, even as stores reopen, Nike noted that it still continues to experience “year-over-year declines in physical retail traffic across the marketplace due to COVID-19 impacts and safety-related measures.”Story continuesNike’s most recently quarterly performance marked a stark contrast from its fiscal fourth quarter through May, when nearly 90% of Nike-owned stores outside of Greater China were closed for eight weeks during the quarter and “significantly impacting” those period’s results. Nike last quarter had swung to its first quarterly loss in two years as net losses totaled $790 million.For its fiscal fourth quarter, however, net income came in at $1.5 billion, pushing the company well above breakeven and representing growth of 11% over last year, with lower selling and administrative expenses offsetting a decline in gross margins, which came as the company leaned on promotions to move through excess inventory. Revenue of $10.59 billion ticked down less than 1% over last year, improving after a 38% drop in the fourth quarter.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:August jobs report: US economy adds 1.371 million payrolls, unemployment rate dips to 8.4%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}