{"article": [{"url": "https://finance.yahoo.com/news/proposed-direct-listing-change-will-encourage-more-companies-to-go-public-ipo-expert-130008146.html", "published": 1593418100.0, "headline": "Proposed direct listing change would 'encourage more companies to go public': IPO expert", "body": "A proposed change to direct listings could attract more public debuts and woo companies away from traditional IPOs — if the SEC approves the move.“We're not trying to displace the IPO, but we're trying to create more choice and more options for companies that want to come to the public markets best suited to meet their objectives,” John Tuttle, vice chairman and chief commercial officer of the New York Stock Exchange, told Yahoo Finance. He noted Spotify (SPOT) and Slack (WORK) both went public via direct listings.[Read more: Don’t say ‘IPO’: What to know about Slack’s direct listing]NYSE recently submitted a detailed amended change to the Securities and Exchange Commission that would allow companies undergoing a direct listing to raise new capital by selling shares on their own behalf. Currently, direct listings only allow the sale of existing shares, not the issuance of new ones.During a direct listing, a designated market maker, or DMM, determines the opening price based on buy and sell orders. Companies hire advisers to help with the process, but there is no costly intermediary underwriter, or roadshow as in traditional IPOs.“If this is a way of lowering the cost, it will encourage more companies to go public,” said University of Florida Cordell Eminent Scholar Jay Ritter.One of the criticisms from venture capitalists has been the underpricing of shares by underwriters in traditional IPOs. Take some of June’s examples: Warner Music Group (WMG), ZoomInfo (ZI), Shift4 Payments (FOUR), Vroom (VRM). Those four stocks closed considerably higher than their IPO price on the first day of trading, leaving “$1.5 billion on the table,” says Ritter.“Those are profits for the first day investors, but on the other hand that’s money that the company didn’t raise even though the market was willing to pay a much higher price for the stock than the underwriters set for the offer price,” Ritter recently told Yahoo Finance.“The traditional underwriters definitely don’t want this to become popular,“ he added.Story continuesIMAGE DISTRIBUTED FOR THE NEW YORK STOCK EXCHANGE - Shift4 Payments, Inc. (NYSE: FOUR) rings The Opening Bell on Friday, June 5, 2020, in New York. The New York Stock Exchange welcomes Shift4 Payments, Inc. (NYSE: FOUR) in celebration of its IPO. To honor the occasion, Jared Isaacman, Chief Executive Officer, Christopher Cruz, Managing Director, Searchlight Capital, and Stacey Cunningham, NYSE President, ring the NYSE Opening Bell. (New York Stock Exchange via AP Images)‘It’s easy to see who won from the direct listing. It was the early private shareholders’A direct listing, even with a capital raise attached, may not be the best option, says Lise Buyer of Class V Group, a Silicon Valley consultant for companies going public.“I think 2 out of 2 haven’t worked out very well for the public shareholders,” said Buyer.Spotify and Slack both opened successfully, but in the case of Spotify the stock closed lower than at the open on the first day and declined the next. In Slack’s case, the stock opened at $38.50 last year and declined in the weeks that followed.“It’s easy to see who won from the direct listing. It was the early private shareholders.” she said. “Who lost in Slack’s listing? The new investors ... had they waited a couple of days, they could’ve bought it later in the open market.”“If a company wants to avoid that first day pop, wants to price to where demand really is, then an auction model solves that problem where you get perfect pricing information up front,“ she added. Buyer was director of business optimization at Google (GOOG, GOOGL) and one of the chief architects of the company’s auction-style IPO.During a Dutch auction IPO, investors submit bids compiled by underwriters. The issuer and underwriter then determine the offer price based on the highest value at which the total offering can be sold.Specialist Peter Giacchi, right, calls out prices on the New York Stock Exchange trading floor before the Slack IPO, Thursday, June 20, 2019. The San Francisco company is set to start trading Thursday in what's known as a direct listing. (AP Photo/Richard Drew)NYSE’s proposed modification comes after the SEC had rejected its initial proposal in 2019. The commission extended the time to decide on the proposed rule change by 60 days, while it reviews public comments based on NYSE’s amendment. The SEC would not comment on this story.“What they’re concerned about, with a direct listing that simultaneously has a capital raising event [is] that this is a way of getting around existing regulations,” said Ritter.Buyer highlights liability “would be an issue” in a direct listing combined with a primary share offering. In traditional IPOs, the underwriters are liable for inaccuracies or omissions in filings.The drum has been beating louder to make direct listings more appealing as more companies express interest in them. In February, workplace toolmaker Asana said it had filed to go public via direct listing. And last year Airbnb reportedly indicated it was leaning towards entering the public market this way. Then the coronavirus pandemic hit.Asked wether he believes the SEC will lean towards such a change Ritter said, “I don’t think it’s a slam dunk, but I think it’s pretty likely.”Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreCrude supply 'dwarfed' by cuts in demand: oil watcherThere's a risk of a lost decade here:' former IMF adviserDon't expect shale to rise like a 'phoenix from the ashes': Oil expertThree reasons why things are looking up for homebuilder LennarFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}