{"article": [{"url": "https://finance.yahoo.com/news/why-costco-could-see-a-lasting-boost-from-coronavirus-panic-buying-105226720.html", "published": 1594188020.0, "headline": "Why Costco could see a lasting boost from coronavirus panic buying", "body": "It wasn’t long ago that shoppers were flocking to Costco (COST) to stock up on groceries as coronavirus cases first hit the Northeast ahead of state lockdowns across the country.Now, as a similar spike in cases hits Texas, Florida and Arizona, Costco might benefit from more of that — but perhaps more importantly, as one data firm points out, their membership model might benefit regardless of renewed panic buying.According to location analytics firm Placer.ai, the wholesaler was already seeing a steady rise in store visits as the pandemic situation started to improve in mid-April. Visits rose from a nearly 30% year-over-year drop in April to a 14% decline in May to only a 6.5% drop in June, according to Placer.ai data.Visits to Costco have steadily been rising since April, according to data from location analytics platform Placer.ai. That could bode well for the wholesaler's June sales.That could signal strength in Costco’s June sales numbers that are expected to be released after market close on Wednesday.As Placer.ai notes, not only has store traffic been steadily rising since April, but it also strengthened as June progressed. The analytics company says Costco visits on June 19 were up more than 11% compared to last year, marking the first day the wholesaler saw offline locations achieve year-over-year growth in traffic since March 19. The last week of June also saw weekly visits slump a mere 3.6% year-over-year, good enough to mark the first time this year that weekly visits rose relative to the January 1 trend line.Eight days in June saw year-over-year growth for store visits, marking the first time the wholesaler has seen that since March, according to Placer.ai data.“The focus on value in a time of economic uncertainty, a membership model that was clearly boosted by pandemic shopping trends, and the return of normalcy to in-store shopping behavior could position the brand for an incredibly productive period in the months to come,” Placer.ai analysts posited.The wholesaler last reported May sales numbers on June 3 that showed a 5.5% U.S. sales jump from the same month last year and a 6.7% jump compared to the first 39 weeks of 2019. That was a welcome return to growth after the company reported a drop in April sales due to a slump in foot traffic as members stayed home during lockdown. Shares rose roughly 1.5% following that update.Story continuesUPDATE: Costco reported June sales after the market close Thursday that topped expectations. The wholesaler reported net sales of $16.18 billion for the retail month of June through the five weeks ended July 5, an increase of 11.1% from $14.57 billion last year. Total comparable sales for June rose 11.5% and e-commerce sales surged 86.7% from last year as more customers tapped its buy online pickup in-store option.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Most 2020 grads are desperate and applying for jobs that aren't the right fit: MonsterMayor of city famed for defunding police says abolishing police is not the solutionAnalyst who predicted market's 40% rally says these stocks will lead to all-time highsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}