{"article": [{"url": "https://finance.yahoo.com/news/we-see-it-here-every-day-how-a-slowdown-in-the-postal-service-is-impacting-small-businesses-212145143.html", "published": 1597076960.0, "headline": "‘We see it here every day’: How a slowdown in the Postal Service is impacting small businesses", "body": "ScanMyPhotos began in 1990 and quickly developed a close relationship with its local post office in Irvine, Calif.“They are the reason we have this company,” co-founder Mitch Goldstone said an interview with Yahoo Finance’s. The company, which digitizes physical photos, says it has digitized and sent 600 million pictures back to customers.But in recent weeks, Goldstone has seen an array of problems as new Postmaster General Louis DeJoy has begun to implement operational changes that are slowing deliveries. “We see it here everyday and we get it in the customer service phone calls,” Goldstone said.The reports are similar across the country. Small businesses that rely heavily on shipping products are reporting problems after years of reliable service, including some in DeJoy’s home state of North Carolina.A United States Postal Service mail carrier poses in front of her truck before departing on her delivery route in El Paso, Texas. (PAUL RATJE/AFP via Getty Images)DeJoy counters that the USPS has been bleeding money for years ($2.2 billion just in the last quarter) and says the changes are necessary “for the Postal Service to operate efficiently and effectively” for the long term. During remarks to the Board of Governors last week, DeJoy promised to “aggressively monitor and quickly address service issues.”Much of the focus on the Post Office’s current problems have centered around this fall’s election with record levels of voting expected by mail. But business owners like Goldstone want to draw attention to the business sector. In an open letter to the Post Office, he said millions of small businesses could be impacted because of the “devastating” delays.According to a 2019 USPS report, 70% of the smallest businesses – those with fewer than 10 employees – use the Post Office regularly and spend an average $359 a month on shipping.Bipartisan calls for actionThe USPS operates as a self-supporting federal agency – part independent business and part government agency. It likes to tout that it gets no tax dollars in normal times.But two factors – a drop in demand during the pandemic and a mandate in the Postal Act of 2006, which advocates say puts “the Postal Service in a straight jacket” financially – mean it’s on the verge of running out of money as early as this year.Story continuesA USPS letter carrier crosses Boston Street with greatly reduced traffic during the coronavirus outbreak in March. (Lane Turner/The Boston Globe via Getty Images)During the stimulus negotiations, Democrats pushed for $10 billion in funding for the USPS, and have added a rollback of Postmaster DeJoy’s operational changes to their list of demands. DeJoy says that Congress should help, but that he needs to cut services in the meantime.Sen. Gary Peters (D-MI) started an investigation into the delays, and Sen. Susan Collins (R-ME), in a statement over the weekend, called for Congress to get back to the negotiating table for a stimulus deal to help groups, including “the USPS with this persistent pandemic.”DeJoy recently met with stimulus negotiators. Senate Minority Leader Chuck Schumer afterwards described it as a “heated discussion.”‘I am very confident that we can turn our business around’Much of the answer, according to President Trump and other Republicans, is for the USPS to massively raise rates. In April, the president called the service “a joke” because of the rates it charges companies like Amazon. Fact checkers have disputed the claim that package rates are the reason for the current financial troubles.Either way, a hike in rates would likely hurt small businesses even more. The current rates are considerably lower for the smallest sized parcels when compared to the rates at UPS (UPS) or FedEx (FDX).ScanMyPhotos digitizes thousand of photos daily (Photo from ScanMyPhotos)“I am very confident that we can turn our business around,” Dejoy said recently. The USPS recently launched a loyalty program offering new credits to help retain smaller businesses.Goldstone remains hopeful that Washington can figure out a solution to the problem and things will eventually return to normal after the partisan fever around vote-by-mail subsides. In the meantime, he says it’s difficult to maintain his businesses especially given the fact that many of his current customers are using the service to honor family members who have died in the pandemic.“The last thing people need to wonder is where the heck are their loved ones’ – [who] just passed away – lifetime of photos,” he said.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:USPS in 'dire' financial position, says Postmaster GeneralShowdowns over the Postal Service loom as a union chief says Trump is ‘scapegoating’ membersThis Senator wants to bring back banking at the Post OfficeRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}