{"article": [{"url": "https://finance.yahoo.com/news/facebook-whatsapp-pausing-hong-kong-160532685.html", "published": 1594100060.0, "headline": "Google, Facebook, Microsoft Pause Hong Kong Data Requests", "body": "(Bloomberg) -- Google, Facebook Inc., Microsoft Corp. and Twitter Inc. won’t process user data requests from the Hong Kong government amid concerns that a new security law could criminalize protests.Last Wednesday, when the law took effect, Google paused production on any new information requests from Hong Kong authorities, said a spokesperson for the Alphabet Inc. unit. “We’ll continue to review the details of the new law,” the spokesperson added.It’s unclear what types of actions will violate the new law, but police arrested a man last week for brandishing a Hong Kong independence flag. Protesters have rallied against the law, and the government has threatened fines and imprisonment for service providers that fail to remove messages. In response, the U.S. has revoked some trade benefits with Hong Kong related to sensitive technology. American officials have expressed fears that the new law signals Beijing’s intention to take full control of Hong Kong, which has operated with more autonomy and freedom than cities on the mainland.Zoom Video Communications Inc. and Microsoft joined their internet peers in hitting pause on data requests while they examined the new law, spokespersons for both companies said in separate statements. Microsoft said it “typically received only a relatively small number of requests from Hong Kong authorities, but we are pausing our responses to these requests as we conduct our review.”In 2019, the Hong Kong government requested data from Google users 105 times, according to the company’s reported figures.Facebook typically works with law enforcement to follow local laws where the company operates, but said it has paused sharing user data with Hong Kong authorities while it conducts a “human-rights” assessment. The pause applies to all Facebook properties, including its core social network, Instagram and WhatsApp.“Freedom of expression is a fundamental human right and support the right of people to express themselves without fear for their safety or other repercussions,” a Facebook spokesperson said in a statement. “We have a global process for government requests and in reviewing each individual request, we consider Facebook’s policies, local laws and international human-rights standards.”Story continuesTwitter operates in much the same way and paused data requests immediately following the law’s implementation last week, a Twitter spokesperson said, adding that the company has “grave concerns regarding both the developing process and the full intention of this law.”Facebook and Twitter don’t operate in China but do in Hong Kong, where they have offices. Google has a significant presence in Hong Kong, which includes sales staff that works with Chinese companies running digital advertising outside of China.(Updates with Zoom joining the action from the fourth paragraph.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}