{"article": [{"url": "https://finance.yahoo.com/news/china-isnt-helping-trump-win-reelection-as-boltons-book-suggests-201514750.html", "published": 1592493800.0, "headline": "China isn’t helping Trump win reelection, despite Bolton's claim", "body": "If it’s true that President Trump asked Chinese President Xi Jinping to help him get reelected in November, he’s not getting the boost he hoped for.In John Bolton’s new book, the former national security adviser writes that in June 2019, at a meeting in Japan, Trump asked Xi to buy more U.S. wheat and soybeans so farm-state voters would support Trump’s reelection bid. That was in the middle of Trump’s trade dispute with China, when he was raising tariffs on Chinese imports while seeking various trade concessions. China sharply curtailed U.S. agriculture purchases during the dispute, in retaliation for Trump’s tariffs.The final result was a “phase one” trade deal in January, with China pledging to buy $200 billion more in U.S. farm, manufacturing and energy products this year and next than it did in 2017, the baseline year. Trump obviously hoped for a surge in U.S. exports to China, so he could bring home the bacon for famers and lock in key states such as Wisconsin, Michigan, Ohio, Iowa, Pennsylvania and North Carolina.Former National Security Advisor John Bolton discusses the \"current threats to national security\" during a forum moderated by Peter Feaver, the director of Duke's American Grand Strategy, at the Page Auditorium on the campus of Duke University on February 17, 2020 in Durham, NC. (Photo by Melissa Sue Gerrits/Getty Images)China hasn’t been doing its part, however. Under the terms of the January deal, China should be buying about $12 billion worth of the covered products per month. But through the first four months of 2020, exports of those products to China are averaging just $5 billion per month, according to research firm Panjiva. “They are not buying more than they did in 2017,” Chris Rogers of Panjiva says.The coronavirus pandemic has obviously interfered with trade, and U.S. exports to China did pick up in April. But they were still about $5 billion short of the monthly $12 billion target. And now there are new hostilities between the Trump administration and China, with Trump routinely vilifying China as the source of the coronavirus, and China blasting back at the United States for its own lethargic response to the crisis. A new Chinese effort to crack down on dissidents in Hong Kong could roil the relationship further, leaving the January trade targets far out of reach. “The worsening rhetoric between the two countries may provide the Trump administration with a reason to terminate the phase one trade deal,” Panjiva explained in a recent research note.Story continuesTrump says Bolton is a liar, but the Bolton claims fit with Trump’s penchant for personalized, ad hoc diplomacy meant to burnish his reelection odds. The Bolton book itself may now complicate Trump’s effort to claim victory in his trade negotiations with China. “Bolton’s revelations create incentives for Trump to prove that he is strong against China and for Beijing not to be perceived as aiding his reelection,” Eurasia Group analysts wrote on June 18. They think there’s a 40% chance the phase one deal will collapse by Election Day, with a 60% chance it will survive.Former National security adviser John Bolton gestures while speakings at the Center for Strategic and International Studies in Washington. (AP Photo/Pablo Martinez Monsivais, File)Trump’s antipathy toward China might suggest Xi and his comrades would like to see Trump lose in November. But some analysts think the Chinese hope for another four years of Trump, because they think his America first strategy is wrecking longstanding alliances and weakening America’s global influence. Trump’s Democratic rival Joe Biden, by contrast, might repair tattered alliances and try to rally friendly nations to unite in an effort to contain China, which aspires to be a world superpower. So China might think it’s worth enduring Trump’s trade fights because there’s more to gain from America’s shrinking role in the world.Trump could still win the U.S. farm vote in November. While his trade war cut sharply into agricultural exports, federal subsidies meant to offset the cost of the trade war led to a modest increase in overall farm income in 2019. Federal subsidies are available this year, as well. Farmers say they want markets, not bailouts, but they may not particularly care what John Bolton has to say about them.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Mike Bloomberg can help Joe BidenBiden’s age might work in his favorSome nightmare scenarios for the November electionsThe risk to Biden if he picks a black running mateHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}