{"article": [{"url": "https://finance.yahoo.com/news/nike-reports-fiscal-4q-2020-results-coronavirus-pandemic-china-201847126.html", "published": 1593099980.0, "headline": "Nike swings to a quarterly loss as coronavirus store closures dent results", "body": "Nike (NKE) swung to a quarterly loss and posted fiscal fourth-quarter sales that dropped more than expected, as a slew of global store closures hit the athletic-wear maker’s results.Shares of Nike dropped more than 2% in extended trading after reporting results.Here were the main metrics from the report, compared to consensus estimates compiled by Bloomberg:Revenue: $6.31 billion, vs. $7.38 billion expected and $10.2 billion Y/YLoss per share: 51 cents, vs. earnings of 10 cents per share expected and earnings of 62 cents Y/YNike’s fiscal fourth quarter captured the three-month period between March and the end of May, during which the athletic-wear giant contended with a wide range of virus-related store closures outside of mainland China. About 90% of Nike’s physical stores in North America, Europe, the Middle East, Africa and the Asia Pacific region were closed for about eight weeks during the quarter.Nike warned in a mid-May update that closures would generate “significantly lower wholesale revenue and higher inventory” during the fourth quarter, and exert a “material impact” on results across its regions. The company’s closely watched gross margin shrank 820 basis points, to 37.2%, in the fourth quarter — driven in part by factory cancelation charges, rising inventory reserves and supply chain costs.The Beaverton, Oregon-based company said 90% of company-owned stores were open as of Thursday, including 100% of stores in China. Retail traffic “continue to improve week-over-week with higher conversion rates as compared to the prior year,” Nike added.The previous quarter through the end of February saw Nike’s sales hold up more strongly than expected, even given closures that at the time had swept China.However, it managed to offset some revenue declines due to retail store closures in China with a more than 30% surge in digital sales.That dynamic continued to an extent across Nike’s other geographies in the reported quarter, but not by enough to buoy overall sales. Nike’s digital sales surged 75% in the fourth quarter, comprising about 30% of overall revenue.Story continues“As physical retail re-opens, NIKE's strong digital trends continue, a testament to the strength of our brand and the investments we've made to elevate digital consumer experiences,” Nike Chief Financial Officer Matt Friend said in a statement.Shares of Nike have fallen less than half a percent for the year to date, versus a decline of 4.8% in the S&P 500.This post is breaking. Check back for updates.A man tries on shoes in the Nike store in Santa Monica, California, September 25, 2013. NIKE, Inc. plans to release its first quarter fiscal 2014 financial results on Thursday, September 26, 2013. REUTERS/Lucy Nicholson (UNITED STATES - Tags: BUSINESS SPORT)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOMay jobs report: US economy unexpectedly adds 2.5 million payrolls, unemployment rate falls to 13.3%What we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}