{"article": [{"url": "https://finance.yahoo.com/news/this-week-in-trumponomics-maybe-bidenomics-will-be-better-195537050.html", "published": 1601046200.0, "headline": "This week in Trumponomics: Maybe Bidenomics will be better", "body": "President Trump seems to have thrown in the towel on an economic agenda for a second term. He should be hectoring Congress to pass more coronavirus stimulus, but he’s saying practically nothing about it as unemployment worsens and the stock market sags. Trump’s only real economic proposal is a payroll tax cut that will probably never happen, because it would disrupt funding for Medicare and Social Security. Trump railed on China’s trade abuses in 2016, but he’s got little to say about that, either, like maybe he just lost interest.His Democratic rival Joe Biden, by contrast, has a detailed economic plan, and it’s been getting decent grades by economists assessing how it would impact growth, employment and government deficits. Oxford Economics estimated this week that Biden’s overall plan would boost incomes and create more jobs compared with a baseline in which policy stays the same.Biden has proposed several large spending programs, along with sizable tax hikes to pay for them. The costliest programs include $1.7 trillion to help more people afford health care over 10 years, $1.4 trillion for primary and secondary education, $775 billion in child and elder care, and $700 billion to invest in buy-America programs, including infrastructure.Democratic presidential candidate former Vice President Joe Biden speaks at Wisconsin Aluminum Foundry in Manitowoc, Wis., Monday, Sept. 21, 2020. (AP Photo/Carolyn Kaster)To pay for all that, Biden would boost the corporate tax rate from 21% to 28%, raise individual taxes on families earning more than $400,000 and eliminate some tax breaks for businesses and the wealthy. Biden’s spending proposals add up to about $7 trillion over a decade, while his new taxes would raise about $4 trillion.No candidate’s plan survives contact with political reality, and some parts of Biden’s plans are implausible, even if Democrats control both houses of Congress. So Oxford assessed a “Biden lite” scenario in which Biden is able to pass about half of his spending and half of his tax hikes into law. In this analysis, about three-quarters of the tax hikes fall upon households earning more than $840,000 per year, doing little to depress consumer spending because the wealthy have plenty of disposable income.Story continuesThe forecasting firm finds Biden’s plan would raise 2021 real GDP growth from 3.7% to 5.8%, which would be the strongest growth since 1984. The economy would recover from the coronavirus recession by mid-2021, six months faster than it would without such stimulus. By the end of Biden’s term in 2024, the unemployment rate would have plunged to nearly 3%. The federal deficit would widen a bit, but stay in the same range as expected thanks to more tax revenue from more people working.The Trump-o-meter is neutral on this analysis, because it’s the Trump-o-meter, not the Biden-o-meter. That translates to a reading of MEDIOCRE, the third highest.Source: Yahoo FinanceOther analysis backs the Oxford findings. Research released in mid September by the Penn Wharton Budget Model found that Biden’s plan would boost GDP by 1.4% by 2040, while pushing federal debt 1.5% lower than it would otherwise be. Other analyses find that middle-class incomes could drop a bit under the Biden plan, though new aid for health care, child care and other things would leave many better off.Moody’s Analytics analyzed four election scenarios—a Democratic sweep, a Republican sweep, a Biden win with split control of Congress, and a Trump win with split control of Congress—and found that a Democratic sweep would be best for the economy. If Biden were able to largely enact his policies, the research firm found, GDP growth would average 2.9% during the next decade and the economy would add 21.7 million jobs. Under the status quo—with Trump as president and Congress split—growth would average just 2.4%, with 13.9 million new jobs.There’s not much analysis of Trump’s second-term economic plan, because there’s not much to analyze. A Penn Wharton analysis of Trump’s proposed cut in the payroll tax found it could boost middle-class incomes by 6%. But Medicare is due to run short of money within the next few years, and that would happen sooner if Congress cuts this key funding source. There’s essentially no chance Congress would throw seniors under the bus like this. It’s more likely Congress will have to raise taxes to shore up Medicare.Trump also wants to cut capital gains taxes, but this looks like another political loser. Penn Wharton analysis shows this would do nothing for the bottom 95% of earners, while saving the top 5% $6,625 on average, and the top 0.1% $191,500. That would only make sense politically if a wealthy person’s vote counted 20 times more than everybody else’s.More comparisons of the Trump and Biden plans are forthcoming as we enter the last five weeks of the presidential race. But just as important is each candidate’s ability to promote his own plan, while vilifying his opponent’s. That guarantees a lot of trash talk amid the sober analysis.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Democrats can save ObamacareTrump’s health care sham5 campaign promises Trump has given up onWhy Trump wants to shackle the postal serviceEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}