{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-1-2020-221842898.html", "published": 1598973140.0, "headline": "Stock market news live updates: Stocks open September with a bang as S&P, Nasdaq set new records", "body": "Wall Street began September on a high note on Tuesday, with technology stocks and broader market benchmarks setting new closing highs, in an encouraging start to what is historically a rough month for markets.Both the S&P 500 Index and the Nasdaq set new records on Tuesday, underpinned by the continuing rally in technology shares like Apple (AAPL) and Tesla (TSLA) — which both soared after their stocks split on Monday help boost market sentiment.The Dow also advanced after a tepid start to the session, with a host of technology stocks like Zoom, (ZM), Amazon (AMZN), Facebook (FB), Microsoft (MSFT), Netflix (NFLX) and Alphabet (GOOG, GOOGL) hitting fresh highs. This cohort has been among the winners of the “work from home” phenomenon that’s defined the coronavirus era.U.S. data continues to show resilience, with construction spending nearly flat in July, but with the prior month revised sharply higher. Meanwhile, the manufacturing sector continues to rebound, with the ISM Manufacturing Index hitting its highest levels since August 2018. New orders jumped during the month, but the employment component remained in recession territory — in line with still fragile labor market.Benchmarks closed out a monster August by notching their best month in at least 20 years, bolstered by ultra-accomodative Federal Reserve policy, moderating coronavirus infections and rising optimism for a COVID-19 vaccine that may backstop economic growth.A formidable string of consecutive winning sessions carried the Dow over 7% higher during August — its best monthly showing since 1986. The S&P 500 Index also saw its best month since 1986, while a brisk rally in tech stocks propelled the Nasdaq to its best monthly performance since 2000, representing a nearly 10% gain.All told, stocks are now deeply entrenched in a new bull market, less than 6 months after a vicious sell-off sparked by the COVID-19 outbreak obliterated all of the Trump era gains.Story continuesAccording to Goldman Sachs, “while equities have never been as expensive since the Tech bubble, based on a 24-month [price/earnings basis], the equity risk premium is close to an all-time high, suggesting that equities have rarely been as attractive relative to bonds.”Additionally, July’s high-frequency economic data broadly outperformed Wall Street’s estimates, the latest being robust personal income and spending data released on Friday. Taken together, economists now believe that third quarter growth could be “even boomier” than prior estimates, JPMorgan Chase said on Friday.Traders have been encouraged by Fed policy that continues to encourage risk appetite, and the COVID-19 outbreak that has shown signs of tapering off in the Sun Belt region — which until very recently had been a domestic epicenter of new infections. Additionally, encouraging developments in the race for a vaccine have given the market reasons for hope.—4:03 p.m. ET: Stocks start September on a high note as S&P 500, Nasdaq set new closing highsHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +26.35 (+0.75%) to 3,526.66Dow (^DJI): +215.74 (+0.76%) to 28,645.79Nasdaq (^IXIC): +164.21 (+1.39%) to 11,939.67Crude (CL=F): +$0.29 (+0.68%) to $42.90 a barrelGold (GC=F): -$1.80 (-0.09%) to $1,976.80 per ounce10-year Treasury (^TNX): -2.1 bps to yield 0.6720%—12:10 p.m. ET: Stocks creep to session highs in quiet sessionHere were the main moves in markets as of 12:10 p.m. ET:S&P 500 (^GSPC): 3,512.36, +12.05 (+0.34%)Dow (^DJI): 28,510.69, +80.64 (+0.28%)Nasdaq (^IXIC): 11,895.52, +120.06 (+1.02%)Crude (CL=F): $43.10, +$0.49 (+1.15%)Gold (GC=F): $1,989.60, +$11.00 (+0.56%)10-year Treasury (^TNX): flat to yield 0.695%—10:15 a.m. ET: Construction spending all but unchangedHigh-frequency data has been surprising to the upside, but July’s construction spending was one of the few outliers. Commerce Department data showed that outlays on private projects were nearly cancelled out by a swan dive in public construction. That said, June’s data was sharply revised higher.—10:00 a.m. ET: Manufacturing rebound continuesThe ISM manufacturing index inched up in August, to 56.0 from 54.2, in line with most data points that suggest the U.S. recovery is on firm footing and the highest in about a year.However, economists have flagged a couple of cracks in what would otherwise be a silver lining. Andrew Hunter at Capital Economics notes that:... the recovery in production is badly lagging the stronger turnaround in spending, with the result that inventories are now looking very lean. That points to further gains in production in the months ahead and, unusually for this stage of the cycle, probably upward pressure on goods price inflation too.The improvement was driven by a further jump in the new orders index to a 16-year high of 67.6, from 61.5. The production index also saw a further rise to 63.3, from 62.1, consistent with manufacturing output growth of nearly 10% in 3m/3m annualized terms. That said... The ISM report suggests the recovery in employment continues to lag behind, with that sub-index rising to only 46.4, from 44.3, but that is probably because employment never fell as sharply as output in the first place, and therefore has less ground to recover.Admittedly, with the non-manufacturing index having already risen above 58 in July, the ISM surveys suggest that the manufacturing sector continues to lag behind. But with durable goods consumption already more than 10% above its pre-pandemic level and inventories now unusually low – the ISM manufacturing inventories index fell further in August to a record low – production should continue to rebound at a solid pace over the next few months.—9:35 a.m. ET: Stocks open mixed, tech resumes rallyHere were the main moves in markets as of 9:35 a.m. ET:S&P 500 (^GSPC): 3,499.61, -0.70 (-0.02%)Dow (^DJI): 28,349.38, -80.67 (-0.28%)Nasdaq (^IXIC): 11,832.50, +57.05 (+0.48%)Crude (CL=F): $42.93, +$0.32 (+0.75%)Gold (GC=F): $1,998.30 per ounce, +$19.70 (+1.00%)10-year Treasury (^TNX): +2.5 bps to yield 0.7160%—8:25 a.m. ET: Zoom, the other stock investors loveThe pandemic era has turned Zoom (ZM) into a must-have on virtually every computer/mobile device, and the company’s second-quarter earnings report reflects this. A monster quarter saw the company beat estimates by a mile and hike its annual revenue forecast by more than 30%, on the heels of converting more free users into paid subscribers.Zoom’s stock, which closed up nearly 9% on Monday, is rallying by a staggering 38% in the pre-market.—8:00 a.m. ET: Tesla eyes $5 billion share offeringTesla Inc CEO Elon Musk takes off his coat onstage during a delivery event for Tesla China-made Model 3 cars in Shanghai, China January 7, 2020. REUTERS/Aly SongInvestors can’t seem to get enough of Tesla’s (TSLA) stock (which hit a record on the same day the stock split), so the House that Elon Musk built is offering them more of what they crave. Tesla will raise up to $5 billion in a share sale that will be led by Wall Street’s main brokers.The news comes just a day after the company’s successfully split its stock 5-1. Tesla’s already up more than 2% in the pre-market, after having closed up a whopping 12.6% on Monday. Via StockApps data, here’s Tesla by the numbers:Stock up by nearly 200% in the last three months, and up about 500% on the yearMarket capitalization of over $460 billion makes Tesla the world's most valuable car company — almost seven times more than Ferrari, Porsche and Aston Martin combined — and four times more valuable than tech stalwart IBM—8:00 a.m. ET: Tuesday: Tech stocks continue to ride last month’s momentumHere were the main moves in equity markets, as of 6:45 p.m. ET:S&P 500 futures (ES=F): 3,505.00, +6.00 (+0.17%)Dow futures (YM=F): 28,391.00, -25.00 (-0.09%)Nasdaq futures (NQ=F): 12,209.00, +95.00 (+0.78%)Crude (CL=F): $43.08 per barrel, +$0.47 (+1.10%)Gold (GC=F): $1,996.70 per ounce, +$18.10 (+0.91%)10-year Treasury (^TNX): flat to yield 0.6930%—6:15 p.m. ET Monday: Stock futures rise as overnight session beginsHere were the main moves in equity markets, as of 6:45 p.m. ET:S&P 500 futures (ES=F): 3488.00, -11Dow futures (YM=F): 28339, -77Nasdaq futures (NQ=F): 12099.00, -15—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}