{"article": [{"url": "https://finance.yahoo.com/news/trump-is-threatening-american-jobs-at-goodyear-180850862.html", "published": 1597842980.0, "headline": "Trump is threatening American jobs at Goodyear", "body": "President Trump wants to bring some jobs back to America—but also kill some U.S. jobs, apparently.Trump is now encouraging his 80 million Twitter followers to boycott Goodyear (GT) and buy tires from somebody else. Trump found a news story featuring one slide from a Goodyear presentation to employees in Topeka, Kan., on what is acceptable workplace attire. The slide says Black Lives Matter and LGBT messages are acceptable. Under unacceptable: Blue Lives Matter, All Lives Matter, MAGA gear, and other politically affiliated material.You can see the corporate sin, right? Goodyear doesn’t want its workers wearing Trump’s MAGA brand hats and shirts around the workplace. So Goodyear has earned Trump’s wrath. “Don’t buy GOODYEAR TIRES,” Trump tweeted on Aug. 19. “Get better tires for far less!”Rising Chinese tire importsGoodyear employs at least 7,000 unionized workers in 14 U.S. plants, according to its latest annual report. The company’s headquarters is in Akron, Ohio—a state Trump has to win in November to have a chance of beating Joe Biden. Goodyear has facilities in the crucial swing states of Florida and North Carolina, along with Texas, which some analysts think Democrats could win. Does Trump hope his call for a boycott wrecks the company’s sales and throws those workers out of a job?It could happen. The company’s stock price fell nearly 4% in the aftermath of Trump’s attack, indicating investors think Trump could materially harm the company. The question now is whether Trump will mount a sustained assault against Goodyear, as he has against other corporate targets, such as Amazon, the US Postal Service, Carrier, Boeing and General Motors. Or, will he let it drop? If Trump leaves it at one tweet and backs off, Goodyear will probably recover.In this Monday, Dec. 30, 2019, file photograph, the company sign hangs over vehicles waiting for repair outside a Goodyear Tire and Service store in downtown Denver. (AP Photo/David Zalubowski)There’s plenty of competition selling those cheaper tires Trump favors, however—including many Chinese importers. Chinese tire imports to the United States have been rising by double-digits, with China the top importer, followed by Thailand, Canada and South Korea. Trump of course has railed against cheap Chinese products that used to be made in America, and slapped tariffs on billions of dollars’ worth of Chinese imports. But that was before Goodyear banned MAGA hats.Story continuesGoodyear was obviously trying to address the intense and sometimes hostile partisanship that exists everywhere in America these days. A more savvy approach would have been to ban attire with any sort of political messaging, without singling out Trump’s MAGA brand. In response to Trump’s attack, Goodyear says there were some “misconceptions” about the MAGA ban. But its response reads like corporate gobbledygook and leaves the company open to more bashing from Trump. (Goodyear said it asks associates “to refrain from workplace expressions in support of political campaigning for any candidate or political party, as well as similar forms of advocacy that fall outside the scope of racial justice and equity issues.”)TULSA, USA - JUNE 20: U.S. President Donald Trump meet his supporters at his ''Make America Great Again'' rally in Tulsa, Oklahoma, United States on June 20, 2020. (Photo by Kyle Mazza/Anadolu Agency via Getty Images)The Goodyear fracas is the mirror image of the dustup over Goya Foods in July. Goya’s CEO, Robert Unanue, visited the White House on July 9 and throatily praised Trump, prompting some Trump critics to boycott the company. Trump promoted Goya products from inside the White House and encouraged his supporters to buy out the stores, making Goya products a weird litmus test of one’s conservative or progressive bona fides.Now, tires. Goodyear is the leading tire brand in the United States, and it also owns Dunlop, Kelly and other brands. So Trump haters could buy more of those tires while Trump lovers buy fewer. The good news for Goodyear may be that most people don’t buy tires every month, and Trump may have moved on to some other villain—or be gone from the White House—by the time most Americans have to make their next tire purchase. But don’t expect to see Trump wearing a Goodyear hat.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Why Trump wants to shackle the postal serviceTrump’s “housewife” myth11 ways Trump is out of touch with votersA double-dip recession is formingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}