{"article": [{"url": "https://finance.yahoo.com/news/a-scary-number-of-retail-companies-are-facing-bankruptcy-amid-the-coronavirus-pandemic-180604964.html", "published": 1599921140.0, "headline": "'A scary number' of retail companies are facing bankruptcy amid the coronavirus pandemic", "body": "Another one dies, while one averts death — for now.New York City-based department store chain Century 21 filed for bankruptcy and announced on Thursday that it will shut 13 locations that for years served up deep discounts on designer wares. The company pinned the blame on the COVID-19 pandemic and uncooperative insurers who were supposed to help provide the company with fiscal support during tough times.Bankrupt J.C. Penney, meanwhile, received a bailout today from landlords Simon Property Group and Brookfield. The consortium valued the century old department store — which went bust back in May — at some $1.75 billion. A total of 650 stores will stay open, down from the more than 1,000 pre-pandemic.The sign outside the J.C. Penney store is seen in Westminster, Colorado February 20, 2009. (REUTERS/Rick Wilking)“It takes a long time to kill a retailer,” Forrester retail analyst Sucharita Kodali told Yahoo Finance’s The First Trade when asked about J.C. Penney. “So as long as they are able to pay their bills, which if they have an owner they will — they can absolutely be around. But that doesn’t mean death for J.C. Penney is totally off the table.”Kodali added that J.C. Penney “may not be a great customer experience, but at least it’s alive and open. They can figure out what the plan B over five to ten years could be for that space.”J.C. Penney joins the likes of Macy’s, which essentially mortgaged its future by raising $4.5 billion in financing in a bid to survive the year as 2020 ravaged sales.“I don’t think J.C. Penney has a long-term future. I’m not so sure whether Macy’s has a long-term future,” former Sears Canada CEO turn Columbia Business School professor Mark Cohen previously told The First Trade. “I think the occupants of those B and C malls — the specialty stores that congregate the concourses that are increasingly vacant — may not have a future. We’re seeing an enormous number of store closings being announced — and even from the successful chains like Zara. So I think the breakage will be extraordinary and we’re seeing the first signs of it.”Story continuesThe Macy's flagship store is seen boarded up after a night of violent protests and looting in Midtown, Manhattan on June 2, 2020 in New York City. (Photo: Scott Heins/Getty Images)‘That’s a scary number’States are allowing malls and retailers to slowly reopen, but the situation remains precarious as COVID-19 infections remaining elevated. Consequently, it’s reasonable to expect malls and stores are shutdown.“I think many of these companies will file [for bankruptcy], and it’s not a handful. It’s several dozen. And that’s a scary number,” Stifel managing director Michael Kollender, who leads the consumer and retail investment banking group for the firm, told Yahoo Finance. “It’s far more than we have seen over the last several years combined.”Kollender and his colleague James Doak at Miller Buckfire — Stifel’s restructuring arm, where Doak is co-head — have worked on dozens of consumer and retail bankruptcies in recent years, including Aeropostale, Gymboree and Things Remembered.“We will see some major chains go away and not come back,” Kollender added. “These are chains that were struggling before the situation. COVID-19 will put them over the ledge.”Confirmed coronavirus cases. (David Foster/Yahoo Finance)The pandemic has already toppled several household names. Stein Mart, a 112-year-old discounter, filed for bankruptcy in early August and will look to close most of its nearly 300 stores. The company cited significant financial stress brought on by the COVID-19 pandemic for its decision.August also saw Lord & Taylor — the oldest U.S. department store founded in 1826 — file for Chapter 11 bankruptcy protection after being crippled by COVID-19 store closures. The company was purchased for $100 million from Hudson’s Bay by fashion startup Le Tote in 2019. Le Tote also filed for Chapter 11.Men’s Wearhouse-owned Tailored Brands also filed for Chapter 11 in August, too. The company said it had received $500 million in debtor-in-possession financing from existing lenders.Meantime, Ascena Retail Group, the owner of Ann Taylor and Lane Bryant, finally filed for bankruptcy protection in late July. The company, which has been circling the bowl for years, will look to the courts to help it shave $1 billion in debt. But it’s likely the retailer will be far slimmer post bankruptcy than its current 2,800 store count.Regional retailer Paper Store filed for Chapter 11 in July as well. The operator of 86 stationary and card stores in the Northeast said it’s looking for a buyer.Retail bankruptcies 2020New York & Co. parent company RTW Retailwinds also filed for Chapter 11 bankruptcy protection in July after years of growing irrelevance in malls. The women’s apparel company — which changed its name to the bizarre RTW Retailwinds as part of a rebranding in 2018 — operates 378 outlet and and mall-based stores across 32 states. It may close all of its stores as part of the filing.“The combined effects of a challenging retail environment coupled with the impact of the Coronavirus (COVID-19) pandemic have caused significant financial distress on our business, and we expect it to continue to do so in the future. As a result, we believe that a restructuring of our liabilities and a potential sale of the business or portions of the business is the best path forward to unlock value. I would like to thank all of our associates, customers, and business partners for their dedication and continued support through these unprecedented times,” said RTW Retailwinds CEO Sheamus Toal in a statement.Indeed it has been a brutal time for retail amidst the pandemic.Brooks Brothers filed for bankruptcy in July. It has been dealt a twin blow to its finance from closed malls and a shift away from preppy clothing. The company would up being sold to the duo of Authentic Brands Group and Simon Property Group for $325 million.GNC has walked through death’s door after knocking on it for years. The 85-year-old vitamin seller filed for bankruptcy in late June after years of battling waning sales and a debt load north of $1 billion. GNC plans to shutter up to 1,200 stores across the U.S. The company operates more than 5,800 stores.A person wears a protective face mask outside the GNC store as the city continues Phase 4 of re-opening following restrictions imposed to slow the spread of coronavirus on August 7, 2020 in New York City. (Photo: Noam Galai/Getty Images)2020 is shaping up to be one of the deadliest ever for the former icons of the mall and various shopping centers. The pandemic has kept stores closed for months and sent sales for the sector into a tailspin.With consumers only slowly venturing back out to stores after months of being quarantined, retailers are being faced with the reality they need fewer stores open — or should no longer be in business at all.“Some companies are just not going to survive this,” says McGrail, who is the COO of one of the world’s largest asset disposition and valuation firms, Tiger Capital Group. Its McGrail’s team — which often includes store associates of a stricken retailer — that hangs the “Everything must go” signs and works to fetch top dollar on fixtures and other inventory.Such is the current life for McGrail and others in the retail bankruptcy and restructuring fields. In talking to a host of experts, one thing is abundantly clear: more retail bankruptcies are very likely over the next twelve months.And while bankruptcies from Stein Mart, Lord & Taylor, RTW Retailwinds, Ascena and Brooks Brothers are headline makers, the fact is we haven’t seen a stronger uptick in bankruptcies just yet for several reasons.A pedestrian walks past the Lord and Taylor store in Boston on Aug. 4, 2020. Lord and Taylor, filing for bankruptcy, plans to close two Boston-area stores. (Photo: Jessica Rinaldi/The Boston Globe via Getty Images)First, preparing for a structured entry into bankruptcy typically takes two to three weeks. Retailers were only thrust into mass social distancing driven store closures in mid- to late-March. Most held out hope they would reopen stores in April, which pushed off bankruptcy planning. Second, even the worst positioned big name retailers still had enough cash on hand to move through April and May (especially with workers furloughed) — that allowed executives to consider all options besides a headline-grabbing bankruptcy.And lastly, one of the benefits of a retailer filing for bankruptcy is to raise cash for creditors by holding store closing sales. That couldn’t happen with state mandated store closings.‘We are in a retail tsunami,’ and it has only just begunMost experts expect some degree of chaos to ensue even as retailers reopen their stores.Thousands of stores across the country right now are still sitting on badly aged inventory inside of their closed — or reopened — stores. That dust-collecting stuff is being sold at fire-sale prices — the problem is that everyone in retail is doing the same exact thing, leaving retailers to earn a horrific return on that inventory investment.Next up, retailers stand to get hammered by offering deep holiday deals in the hopes of bringing in cash flow. It’s a true death spiral for retailers.A man walks past a Zara store on March 18, 2015. (REUTERS/Susana Vera)Store liquidations and their rock bottom prices for merchandise, meanwhile, will pressure efforts by stronger chains to get their businesses going. That will make relatively strong retailers far less strong.For those retailers seeking to emerge from bankruptcy, vendors are likely to be tepid to ship them product while at the same time tightening payment terms.That one-two punch usually kills a wounded retailer for good.Then there is the general uncertainty on how people will view going back to the mall in the new normal of social distancing. That fog of war is poised to persist well beyond the coming holiday season.“We are in a retail tsunami,” Kollender said.This story was originally published on June 24, 2020, and has been updated.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}