{"article": [{"url": "https://finance.yahoo.com/news/road-trips-to-make-up-97-of-summer-travel-as-gas-prices-hit-4-year-lows-and-coronavirus-fears-grow-103613194.html", "published": 1593582260.0, "headline": "Road trips to make up 97% of summer travel as gas prices hit 4-year lows and coronavirus fears grow", "body": "Summer travel plans for Americans are leaning heavy on road trips as gas prices are expected to fall to their cheapest mark at the pump in four years, according to a report from motorist and travel group AAA.The report projects national gas prices will fall 15% versus last year in the third quarter to an average of just $2.25 a gallon as July 4 kicks off what would usually be a busy travel season.Concerns over the ongoing coronavirus pandemic, however, are counteracting the boost cheap gas prices would be expected to provide to summer travel plans, AAA said. Overall trips, including air, road, cruise, and rail travel, are expected to fall 15% this summer to mark the first decline in national travel for the season since 2009, though road trips are expected to see a lesser hit.“Americans will get out and explore this summer though they’re taking a ‘wait and see approach’ when it comes to booking and are likely to book more long weekend getaways than extended vacations,” said AAA’s Senior Vice President of Travel Paula Twidale.(Source: AAA Summer Travel Report)Summer road trips in 2020 are expected to see a slight decline of just 3% compared to last year, while AAA projects summer rail and cruise travel to collapse a whopping 85%. The same report pegs the decline in summer air travel at nearly 74% versus last year’s travel season.That shift in travel preference, according to AAA, is expected to make the American road trip the most popular it’s been in the past five years. Road trips are expected to make up 97% of all summer trips compared to the five-year average share of 87%.‘Quite the rollercoaster’For car sharing platform Turo, which has been dubbed the Airbnb for cars by letting people rent out their own cars, the rise it’s seeing in road trip interest seems to be gaining steam since when the pandemic first hit, according to Turo CEO Andre Haddad.“It’s been quite the rollercoaster over the last three months,” he told Yahoo Finance. “[We saw] demand plummet in March, in fact back then we had three days where we had more cancelations than actual bookings.” Since then, however, bookings on the car platform have rebounded to pace 10% to 15% above last year.Story continues“What we’re finding in terms of trends is that folks are picking up more locally to do these local trips,” he said. “Trips are a bit shorter than last year as people take shorter vacations and travel fewer miles despite the drop in gas [prices].”Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:OpenTable CEO says 25% of America's restaurants will close for good due to coronavirusCollege students could be leaving up to $5,000 in coronavirus stimulus money on the tableMayor of city famed for defunding police says abolishing police is not the solutionAnalyst who predicted market's 40% rally says these stocks will lead to all-time highsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}