{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-fda-sparks-new-debate-over-vaccine-push-164533822.html", "published": 1598874800.0, "headline": "Coronavirus update: FDA sparks new debate over 'following Russia, China' in vaccine push", "body": "The rapid push toward a coronavirus vaccine is feeding concerns among health experts, who fear the COVID-19 crisis response will be further polarized and undermined by political pressures.Over the weekend, FDA Commissioner Stephen Hahn alarmed experts when, in an interview with the Financial Times, he suggested the regulatory body could approve a vaccine before Phase 3 trials are complete.President Donald Trump, who is locked in a fierce reelection battle, has placed a high priority on a vaccine candidate being deployed by year’s end.“It is up to the sponsor [vaccine developer] to apply for authorization or approval, and we make an adjudication of their application. If they do that before the end of Phase Three, we may find that appropriate. We may find that inappropriate, we will make a determination,” Hahn told FT.A discussion about such a move, as well as in general vaccine approval, will be discussed with an outside advisory committee on Oct. 22, the FDA recently announced.Hahn’s comments, following what some called a “premature” emergency use authorization for convalescent plasma last week, adds to the wariness and sensitivities of the administration playing politics with public health.Dr. Dara Kass, a Yahoo medical contributor, said Monday that Hahn’s statement is the opposite of reassurances he and his team have been providing that “only a safe vaccine” will get approval.“The idea of actually approving a vaccine before Phase 3 trials are complete is unprecedented, but it’s also potentially unsafe,” Kass told Yahoo Finance on Monday.Experts have warned that third phase is often the longest. The process cannot be condensed because of the length of time needed to observe the effects of the inoculation’s safety and durability, which are governed by regulation.The Dakotas are seeing an uptick in cases. (Graphic: David Foster/Yahoo Finance)Similar concerns have risen from both Russia and China claiming to have effective vaccines. Those are being used by their militaries and other high-risk individuals in the population — all before completing, or in some cases even starting, Phase 3 trials.Story continues“I just can’t imagine a scenario by which we would choose to follow Russia and China on anything else,” Kass said.Dr. Howard Forman, a Yale University professor and health expert, told Yahoo Finance that it would be just like China and Russia if the U.S. were to authorize the use of a vaccine before human trials are complete.“We have a vaccine now. In fact, we have many vaccines now. We just don’t know if they are safe and effective,” Forman said, adding that the standards of the FDA are what distinguish the U.S. from other countries.If a vaccine were to be authorized — which, like plasma, could be revoked if adverse events are seen—it could undermine trust in vaccines, which is already a polarizing issue. Hahn himself acknowledged that last week in a series of Twitter posts.FDA scientific reviewers who have long experience with vaccine development are encouraged by the rapid rate of enrollment in the ongoing clinical trials for a #COVID19 vaccine.— Dr. Stephen M. Hahn (@SteveFDA) August 26, 2020Still, mounting political pressure has stoked concerns among experts over the past several weeks.“The CDC and the FDA, in the past week, have both had to go back and walk back comments they have made about safety recommendations on testing or therapeutics based on political pressures they’ve had, where they’ve had to correct themselves,” Kass said. “That doesn’t help any public confidence in a vaccine when it comes out.”Cases are down in the U.S. week over week. (Graphic: David Foster/Yahoo Finance)The frontrunners in the U.S., Moderna (MRNA) and Pfizer (PFE), have said the earliest they will get some sort of indication of the effectiveness of their candidates will be by September, with Pfizer expecting regulatory review by October.Meanwhile, companies in the race are working on distribution deals as soon as a vaccine is authorized or approved.The latest deal in the works is from Novavax (NVAX), which received the largest federal funding award for vaccine development. Novavax has reached an agreement in principle with Canada to supply up to 76 million doses, according to a statement.In the treatments space, GlaxoSmithKline (GSK) has announced its partnership with Vir Biotechnology (VIR) for— also a vaccine contender— began late-stage trials of their monoclonal antibody candidate. The duo are the latest to progress in their pursuit of an antibody treatment, which is seen as both a treatment and defense for the virus in the absence of a vaccine.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}