{"article": [{"url": "https://finance.yahoo.com/news/wall-st-analysts-raise-q3-earnings-estimates-morning-brief-095348300.html", "published": 1596430880.0, "headline": "Wall St. analysts are making the unusual move of raising earnings estimates: Morning Brief", "body": "Monday, August 3, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeEarnings estimates are coming up, but remain on fragile footingWe’re one month into the quarter and analysts are doing something unusual: they’re raising their estimates for earnings.According to Factset data, analysts covering S&P 500 (^GSPC) companies have raised their estimates for Q3 earnings per share (EPS) by 1.1% during July.That might not seem like much. But historically, analysts usually cut estimates during the quarter.“During the past five years (20 quarters), the average decline in the bottom-up EPS estimate during the first month of a quarter has been 2.8%,” Factset’s John Butters observed. “During the past fifteen years, (60 quarters), the average decline in the bottom-up EPS estimate during the first month of a quarter has been 2.4%.”This is also only the third time we’ve seen upward revisions to quarterly earnings in nine years. Quarterly EPS estimates were previously raised during the first month of the quarter in Q1 2018 (+4.9%) and Q2 2011 (+2.1%).Analysts are revising up their estmates for earnings.(Factset)The Q1 2018 revisions were a bit of an outlier as they coincided with the enactment of President Trump’s Tax Cuts and Jobs Act, which saved corporations billions.Of course, the current quarter is also very much an outlier as everyone knew the estimates came with an already-wide margin for error. The unprecedented coronavirus pandemic had analysts hacking estimates aggressively, all while corporations offered next to no guidance.“[A]nalysts made substantial cuts to EPS estimates for Q3 during the second quarter (March 31 to June 30),” Butters noted. “During this period, the Q3 bottom-up EPS estimate declined by 23.6%.“Upward revisions to EPS estimates for the current and upcoming quarters are good news for investors concerned about elevated valuations. You could even say that they confirm the signal sent by rising stock prices, which is a leading indicator. They would also be in line with history, which shows that V-shaped earnings recoveries follow recessions.Story continuesKeep in mind that the economy has been bolstered by temporary emergency stimulus, notably the CARES Act. The enhanced unemployment insurance (UI) benefits under the act that provided $600/week in addition to regular benefits expired on Friday.“There has been some discussion of a stopgap bill to prevent the decline in stimulus, but it doesn't look like the central case,” Bank of America economist Michelle Meyer wrote on Friday. “As such, for the next two weeks, we could see a decline in [personal] income of $18bn/week. This could weaken near-term spending.”Meyer notes “Congress could theoretically backdate the UI payments to make up for these lost weeks.” However, the policy brinksmanship alone and the uncertainty that comes with it risks affecting consumer behavior unfavorably.So, while it’s good news to hear earnings may be in better shape than previously estimated, those earnings are on fragile footing with the unemployment rate in the double-digits and the outlook for the coronavirus still highly uncertain.By Sam Ro, managing editor. Follow him at @SamRoWhat to watch todayEconomy9:45 a.m. ET: Markit US manufacturing PMI, July final (51.3 expected, 51.3 prior)10:00 a.m. ET: ISM manufacturing, July (53.5 expected, 52.6 in June)10:00 a.m. ET: Construction spending, June month over month (1.0% expected, -2.1% in May)EarningsPre-market6:30 a.m. ET: Clorox (CLX) is expected to report adjusted earnings of $1.99 per share on revenue of $1.88 billion6:40 a.m. ET: Marathon Petroleum (MPC) is expected to report an adjusted loss of $1.76 per share on revenue of $17 billion6:45 a.m. ET: Noble Energy (NBL) is expected to report an adjusted loss of 34 cents per share on revenue of $657.69 million7:00 a.m. ET: McKesson (MCK) is expected to report adjusted earnings of $2.32 per share on revenue of $54.11 billion7:35 a.m. ET: Tyson Foods (TSN) is expected to report adjusted earnings of 93 cents per share on revenue of $10.54 billionPost-market4:00 p.m. ET: Diamondback Energy (FANG) is expected to report adjusted earnings of 3 cents per share on revenue of $559.17 million4:05 p.m. ET: Virgin Galactic (SPCE) is expected to report an adjusted loss of 26 cents per share on revenue of $883.3 million4:05 p.m. ET: Take-Two Interactive Software (TTWO) is expected to report adjusted earnings of $1.60 per share on revenue of $847.14 million4:05 p.m. ET: Chegg (CHGG) is expected to report adjusted earnings of 32 cents per share on revenue of $136.7 million4:15 p.m. ET: Tenet Healthcare (THC) is expected to report an adjusted loss of 71 cents per share on revenue of $3.79 billion4:20 p.m. ET: American International Group (AIG) is expected to report adjusted earnings of 48 cents per share on revenue of $11.17 billionTop NewsMicrosoft reveals talks to buy TikTok US, Canada, Australia, and New Zealand [Yahoo Finance UK]Lord & Taylor, oldest U.S. department store, files bankruptcy [Bloomberg]Tailored Brands files for bankruptcy as pandemic hammers sales [Reuters]7-Eleven owner to buy Marathon’s Speedway for $21 billion [Bloomberg]Prescription drug marketplace GoodRx files for IPO [Reuters]YAHOO FINANCE HIGHLIGHTSRoubini: Trump, Congress are 'playing with fire' by dragging out stimulus talksNetflix a 'force to be reckoned with' with Emmy nods, but here's why competitors still have a shot‘Dollar signs with heartbeats’: How for-profit schools blazed a trail of pain in America—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}