{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-1-2020-221322505.html", "published": 1593616580.0, "headline": "Stock market news live updates: Nasdaq sets record close as tech surge rings in Q3", "body": "Stocks began July’s first trading day and the third quarter on a positive note, as Pfizer’s (PFE) coronavirus vaccine candidate showing progress in a trial phase — and the Federal Reserve’s pledge to keep the monetary spigots open “for years” — sent the Nasdaq Composite to a record close.A modest rally on Wednesday carried tech stocks Amazon (AMZN), Netflix (NFLX) Tesla (TSLA) to new record highs, which helped the Nasdaq close at a fresh high.Market sentiment was also bolstered by encouraging preliminary trial results of an experimental coronavirus vaccine from Pfizer — a Dow component stock — which rallied 5% on the day. Expectations are high that a safe and effective treatment will be found, even though it’s unlikely one will be available before 2021.Record-breaking surges in coronavirus infections are overshadowing market psychology, and setting the tone for the start of the second half of a turbulent year. European bourses rose on Wednesday, as investors weighed positive economic data against surging U.S. cases, which are likely to delay the global recovery.New York City on Wednesday joined New Jersey in postponing plans to reopen indoor dining, with cases outside the Tri-state area skyrocketing. Meanwhile, a spike in California’s infections reportedly prompted the state to shutter indoor activities, including dining, to mitigate the spread.Nevertheless, stocks closed out a breathtaking second-quarter rally that took them to their best overall quarter since 1998, and best second quarter on record. During that time frame, the S&P 500 saw a near-20% run-up during the April through June period, while the Dow and Nasdaq rose about 17.5% and 30%, respectively.The historic rally was fueled by a massive fiscal and monetary policy response designed to bolster the virus-stricken economy, and as states and cities across the country began easing their lockdowns. Minutes from the Fed on Wednesday showed the central bank intends to keep its foot on the easing pedal for “years” as the recovery takes shape.Story continuesMarkets were also greeted by a raft of economic data on Wednesday. ADP’s payrolls data showed that private employers added 2.37 million jobs in June, a reversal from May’s steep 3 million-plus losses but below market expectations of 2.95 million jobs in June. Separately, the ISM manufacturing index will likely show continued improvement in June.Those figures come ahead of the more pivotal nonfarm payrolls report, which is forecast to show the battered U.S. economy created 3 million jobs last month — up from 2.5 million in May.“We expect June nonfarm payrolls to rise by 2 million,” economists at Barclays said in a research note. They said the unexpected jump in May’s report could signal “a persistent improvement in the hiring rate” — but there was also the possibility that it was temporary.“If so, this would suggest that the surge in May hiring was more of a one-off event and we could see some give-back in June employment,” the bank added.However, investor expectations are more tied to new surges in COVID-19 infections, which are walloping the Sun Belt states and prompting more regions to rethink reopening plans. That may put a definitive cap on a market that’s skyrocketed since plunging to multi-year lows in when lockdowns first began in March.—4:03 p.m. ET: Tech rings in Q3 with rally; broader market ends higherHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +15.58 (+0.50%) to 3,115.87Dow (^DJI): -77.91 (-0.30%) to 25,734.97Nasdaq (^IXIC): +95.86 (+0.95%) to 10,154.63Crude (CL=F): +$0.50 (+1.27%) to $39.77 a barrelGold (GC=F): -$19.50 (-1.08%) to $1,781.00 per ounce10-year Treasury (^TNX): +2.9 bps to yield 0.6820%—2:00 p.m. ET: Fed sees accomodative policy for ‘many years’: MinutesMinutes from the Federal Reserve, released shortly after 2pm, confirmed what many on Wall Street already knew (or at least suspected): That the central bank expects to keep pump-priming the economy for “years” to come with low rates and quantitative easing:“The staff presented results from model simulations that suggested that forward guidance and large-scale asset purchases can help support the labor market recovery and the return of inflation to the Committee’s symmetric 2 percent inflation goal.The simulations suggested that the Committee would have to maintain highly accommodative financial conditions for many years to quicken meaningfully the recovery from the current severe downturn...The staff cautioned that businesses and households might not be as forward looking as assumed in the model simulations, which could reduce the effectiveness of policies that are predicated on influencing expectations about the path of policy several years into the future. Alternatively, prompt and forceful policy actions by the Committee might help focus the public’s expectations around better outcomes or reduce perceived risks of worst-case scenarios, which could generate more immediate macroeconomic benefits than those featured in the staff analysis.”Stock benchmarks have lost momentum since the opening bell, but are rangebound in the green after the release.—12:30 p.m. ET: Stocks cling to modest gainsInvestors reading the COVID-19 tea leaves are torn between rising cases and optimism over a vaccine, but stocks are still holding narrow gains in choppy trading. Tech stocks like Tesla and Netflix (NFLX) spiked to fresh records, yet for different reasons.Here’s where major benchmarks stood at midday:S&P 500 (^GSPC): 3,119.90, +19.61 (+0.63%)Dow (^DJI): 25,864.02, +51.14 (+0.20%)Nasdaq (^IXIC): 10,152.03, +93.26 (+0.93%)Crude (CL=F): $39.89, +0.62 (+1.58%)Gold (GC=F): $1,777.50, -$23.00 (-1.28%)10-year Treasury (^TNX): +0.031, yielding 0.684%—12:20 p.m. ET: Consumers hitting the brakes, Chase data suggestJPMorgan Chase's consumer card spending tracker noted a drop from recent highs.JPMorgan Chase, which tracks credit and debit card data, said on Wednesday that spending had “pulled back noticeably from its recent highs.” In a research note, economist Jesse Edgerton noted the following:“...the pullback appears surprisingly widespread across states and demographic groups and has only been moderately correlated with the resurgence of COVID-19...A wide range of states have seen at least a slowdown in spending growth in the last week or two. Texas stands out with a particularly notable pullback, but states like Arizona, Florida, and South Carolina are closer to the middle of the pack in their change in spending, even though they have also seen virus cases rising rapidly.”At its peak on June 21, our tracker of card spending in nonrecurring categories was down 9.6% from its level last year at this time, but it has reversed course since last week and is now down 12.9% through June 27. (We note that the most recent days of data are subject to small revisions.)—11:30 a.m. ET: Dow dips into the red as rally hits a speed bumpSome traders are booking profits on the rally as July begins, with blue-chip stocks dipping into the red after the early spurt higher. Pfizer is still up by around 5%, while the S&P and Nasdaq are still clinging to gains, off earlier highs.The virus is still dominating concerns. New York City said it would hit pause on its plans to restart indoor dining, while Florida is still trying to get a handle on its COVID-19 spike. The state reported higher cases on Wednesday that were below the rolling 7-day average, yet still markedly higher.A vaccine is “key” to sustaining the economy’s momentum, David Nelson, Belponte’s chief strategist, told Yahoo Finance on Wednesday, even if investors have pushed stocks too high, too quickly.—11:00 a.m. Oil flat after bullish inventory dataCrude got a fleeting boost from EIA data showing U.S. crude and gasoline stocks plunged in the latest week, dovetailing with American Petroleum Institute (API) figures showing that inventories also fell more than expected last week, while distillate inventories rose. Oil is hovering around $39 per barrel, up 0.46% on the day.—10:30 a.m. Tesla is now the most valuable car companyTesla Inc CEO Elon Musk takes off his coat onstage during a delivery event for Tesla China-made Model 3 cars in Shanghai, China January 7, 2020. REUTERS/Aly SongStock in The House that Elon Musk built has set (another) record on Wednesday, zooming past Toyota en route to becoming the world’s most valuable car maker. Tesla (TSLA) shares traded well above $1100 (!!) in early dealings, putting its market cap north of $208 billion.The company is set to report production and deliveries within the next few days. According to Oppenheimer, which rates Tesla as an “Outperform” both categories are “moving along at a health rate:“We believe depth of demand, pricing, and manufacturing margins are the key concerns short term for investors on TSLA shares. We expect deliveries to be in line or ahead of consensus for 68.3K vehicles in 2Q20.”—9:45 a.m. ET: ISM sees record jump in manufacturing activityThe seasonally adjusted IHS Markit final U.S. Manufacturing Purchasing Managers’ Index surged in June, hitting 49.8 versus 38.8 in May — still in contraction territory but up a record 10 points from the prior month. IHS noted that it underscored “a marked easing in the overall manufacturing downturn.” The latest figure was also slightly higher than the earlier released 'flash' reading of 49.6.Chris Williamson, Chief Business Economist at IHS Markit had this to say about the month’s performance:“The record rise in the New Orders Index, coupled with low inventory holdings, bodes well for a further improvement in production momentum in July. A record upturn in business sentiment about the year ahead likewise hints that business spending and employment will start to revive.However, while the PMI currently points to a strong v-shaped recovery, concerns have risen that momentum could be lost if rising numbers of virus infections lead to renewed restrictions and cause demand to weaken again.”—9:30 a.m. ET: Wall Street jumps on the first day of Q3; Pfizer surgesMajor indices rallied to start the first day of July and the third quarter of a turbulent year. News on the coronavirus vaccine front helped to grease the wheels of a rally, sending Pfizer’s stock up more than 5% in early dealings.Here were the main moves in markets, as of 9:38 a.m. ET:S&P 500 (^GSPC): 3,114.90, +14.61 (+0.47%)Dow (^DJI): 25,976.06, +163.18 (+0.63%)Nasdaq (^IXIC): 10,067.94, +9.17 (+0.09%)Crude (CL=F): $39.71, +0.44 cents (+1.12%)Gold (GC=F): $1,787.40 per ounce, -$13.10 (-0.73%)10-year Treasury (^TNX): +0.031, yielding 0.684%—9:15 a.m. ET: Stocks pop as Pfizer says COVID vaccine shows promiseWall Street turned positive after drug giant Pfizer (PFE) said an early trial of an experimental coronavirus vaccine showed its safe. In addition, the treatment prompted patients to produce antibodies against the new virus. With much riding on the aggressive efforts to develop an effective vaccine, investors are likely to bid up prices as individual candidates show promise.—8:45 a.m. ET: Trump slumps in betting markets amid ‘perfect storm of woes’New data from Smarkets, a predictive political betting market, shows President Donald Trump’s fortunes are definitively on the decline, as a raft of bad news hits his reelection bid as his Democratic challenger consolidates his electoral support.Smarkets investors show the president’s chances falling to 34% in its $3.1m election-winner market — his lowest position on Smarkets since March 2019. Meanwhile, former Vice President Joe Biden is seen having a 59% chance of prevailing, within striking distance of Trump's all-time high of 61%.\"Donald Trump faces a perfect storm of grave national security allegations, historically bad poll numbers, Black Lives Matter protests, economic turmoil, and a resurgence in coronavirus cases,” Smarkets Head of Political Markets Sarbjit Bakhshi said.\"The tide seems to have turned against the President who was at 61% to win the election back in February, and it is difficult to see how he can stage a comeback from this point. Whether the GOP may do the unthinkable and drop him remains to be seen, but at this stage all options will need to be on the table,” he added.—8:15 a.m. ET: ADP data shows big jump in private payrolls in JunePrivate sector employers added a total of 2,369,000 jobs in the month ended in June, according to ADP’s National Employment Report. The data was a reversal from a steep loss of more than 3 million jobs in the prior month, but below consensus expectations of nearly 3 million jobs.Still, the data reflected broad hiring strength across a range small, medium and large-sized businesses as companies called back employees as lockdowns gradually eased. Yet with coronavirus infections surging anew, it’s unclear how long the hiring momentum will last.“Small business hiring picked up in the month of June,” said Ahu Yildirmaz, vice president and co-head of the ADP Research Institute in a statement.“As the economy slowly continues to recover, we are seeing a significant rebound in industries that once experienced the greatest job losses. In fact, 70 percent of the jobs added this month were in the leisure and hospitality, trade and construction industries,” he added.Stocks hunkered at their lows after the data, pointing to a lower open on the first trading day of Q3.—7:30 a.m. ET: Stock futures dip ahead of dataHere were the main moves at the start of the overnight session for U.S. equity futures, as of 7:30 a.m. ET:S&P 500 futures (ES=F): 3,071.75, off 18.50 or -0.60%Dow futures (YM=F): 25,469.00, off 220.00 of -0.86%Nasdaq futures (NQ=F): 10,103.75, off 43.50 or -0.43%—6:07 p.m. ET: Stock futures open slightly lowerHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:07 p.m. ET:S&P 500 futures (ES=F): 3,086.5, down 3.75 points or 0.12%Dow futures (YM=F): 25,668.00, down 21 points, or 0.08%Nasdaq futures (NQ=F): 10,140.00, down 7.25 points, or 0.07%NEW YORK, NEW YORK - MAY 26: The New York Stock Exchange (NYSE) stands in lower Manhattan on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}