{"article": [{"url": "https://finance.yahoo.com/news/realtor-com-americas-hottest-zip-codes-193250300.html", "published": 1597761620.0, "headline": "These are America’s hottest ZIP codes", "body": "The biggest cities in the U.S. did not make Realtor.com’s list of hottest ZIP codes this year.Home sales in Colorado Springs, Colo., Reynoldsburg, Ohio and Rochester, N.Y. beat out top cities in 2020. Homes sold in those ZIP codes in an average of 18 days — 51 days faster than the national average — thanks to these areas’ accessibility to downtown urban areas, outdoor space, affordability and strong local economies, according to Realtor.com.“Each of these areas have affordable home prices, and that’s really helping to draw buyers in. And because buyers are interested in that affordability, homes in these ZIP codes are selling fast,” said Danielle Hale, chief economist at Realtor.com.Colorado Springs was the hottest market in the U.S. this year, according to Realtor.com.First-time millennial homebuyers (ages 22 to 38) were the main drivers of hot real estate markets, comprising 53% of buyers in the best-selling markets, compared to 43% in the rest of the U.S. Millennials prioritize affordability and adequate square footage, driving them to suburban and secondary markets — and the coronavirus pandemic has made large homes and yard space even more attractive, said Hale.“As the largest generation in U.S. history continues to advance toward life milestones — settling down, marriage, parenthood — the need for space and affordable housing outshines the bright lights in expensive urban areas like New York or Los Angeles,” said Hale. “Now with this extra time at home, trying to live, work, play [and] do schooling all in the same space, people are even more interested in extra space.”“Rochester has done a lot to revitalize its downtown area, so that is appealing to folks who are looking for an area that has big city-like amenities without a lot of the big-city problems,” said Hale.Half of this year’s hottest markets were in Northeastern suburbs, including Rochester, N.Y., Melrose, Mass., South Portland, Maine, Hudson, N.H. and Worcester, Mass. Their popularity was driven by migration from pricey nearby cities, especially New York City and Boston, according to Realtor.com.“The East Coast really did well this year,” said Hale. “It’s done a better job of keeping up with building, and that helps homes stay affordable.”Story continuesThe second hottest ZIP code on the market, Reynoldsburg, is near Columbus, Ohio.But America’s renewed love affair with suburban living could push up prices in secondary markets, while dwindling demand for city apartments drove rent prices down to a six-year low, especially in primary markets.“The rise of [building] multifamily units may lead to an oversupply of apartment buildings, especially in city centers given the evident recent shift in consumer preference for single-family homes in the suburbs,” said a statement by Lawrence Yun, chief economist at the National Association of Realtors.Shifting housing patterns could become an issue in the coming election, as developers look for new ways to meet demand for affordable housing. President Trump and Housing and Urban Development Secretary Ben Carson recently wrote an op-ed for the Wall Street Journal, lambasting the “Obama-Biden dystopian vision of building low-income housing units next to your suburban house.”“The crime and chaos in Democrat-run cities have gotten so bad that liberals are even getting out of Manhattan’s Upper West Side. Rather than rethink their destructive policies, the left wants to make sure there is no escape,” said the op-ed. “That’s why we stopped the last administration’s radical social-engineering project that would have transformed the suburbs from the top down.”\"We believe the suburbs offer a wonderful life for Americans of all races and backgrounds when they are allowed to grow organically, from the bottom up,\" read Trump and Carson's op-ed.But demand for suburban living doesn’t mean big cities are going away. Historical patterns show that New York City real estate generally bounces back within three years of a recession or catastrophic event.“There are a lot of people who still prefer the city. It’s got culture, it’s got night life, it’s got close proximity to everything… There are lots of reasons to stay in the city depending on what stage of life you’re at,” said Hale.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:The ‘Disneyland of football’ is coming to OhioThere’s a record number of vacant rental apartments in ManhattanA mass exodus from American cities? Not quite: poll"}]}