{"article": [{"url": "https://finance.yahoo.com/news/hamilton-delivers-64-download-bump-for-disney-144157998.html", "published": 1594028960.0, "headline": "'Hamilton' delivers 64% download bump for Disney+", "body": "In February, Lin-Manuel Miranda broke the news that Disney (DIS) had bought the rights to a filmed version of the Broadway mega-hit “Hamilton” and would release it in theaters in October 2021. Disney paid $75 million, likely the priciest purchase ever of an already-finished film, and Disney had high hopes it would be a box office success with Americans who had never been able to see the musical in person.Then the pandemic hit. With movie theaters closed, Disney saw an opportunity to juice subscribers for its new Disney+ streaming service; it put “Hamilton” on the platform on July 3.Now it already looks like that was the right move.Sensor Tower, an app download research firm, tells Yahoo Finance that in the week from June 29 to July 5, Disney+ saw a 64% bump in downloads compared to the prior week. (The number is even higher if you zoom in on the first three days of ‘Hamilton’ hitting the service: downloads spiked 79% from July 3 to July 5 compared to the weekend prior.)Lin-Manuel Miranda makes a surprise appearance during a Q & A before The Rockefeller Foundation and The Gilder Lehrman Institute of American History sponsored High School student #EduHam matinee performance of \"Hamilton\" at the Richard Rodgers Theatre on 3/20/2019 in New York City. (Photo by Walter McBride/Getty Images)Disney needed the win.The company has been hit particularly hard by the pandemic: all of its U.S. theme parks are closed, all of its cruise lines are closed, all of its Disney retail stores are closed, and its cable subsidiaries ABC and ESPN are starved for live sports content.Disney has delayed the theatrical release date of its live-action remake of “Mulan” twice now due to the pandemic: first from March 27 to July 24, then to Aug. 21. Disney is in an apparent game of chicken with Warner Brothers, which has twice delayed its Christopher Nolan action blockbuster “Tenet,” first from July 17 to July 31, then to Aug. 12. Neither studio appears to want to go first, and the entire movie theater industry awaits the two releases.In the meantime, Disney+ has been the sole silver lining. On May 4, Disney shared that the service has amassed 54.5 million paying subscribers in under six months since its November launch. Apart from the original “Star Wars” series “The Mandalorian,” the vast majority of the content on Disney+ is existing Disney content from its hit franchises. “Hamilton,” although it was filmed in June 2016 and later purchased by Disney, counts as something new for the Disney+ platform.Story continues—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers Disney. Follow him on Twitter at @readDanwrite. Read more:Disney's 'Mulan' date decision affects the entire movie theater industryCoronavirus puts 'extreme pressure' on all three pillars of Disney's businessDisney's 'Mulan' will look to Christopher Nolan's 'Tenet' as a movie theater health testCoronavirus is forcing Quibi, NBC Peacock to change their plans at launch'Trolls World Tour' rental success does not spell death for movie theatersMovie theaters seek bailout as coronavirus devastates businessDisney’s ‘Hamilton’ move could usher in new boom of musical movies"}]}