{"article": [{"url": "https://finance.yahoo.com/news/infosys-commits-to-hiring-12000-american-workers-expanding-us-footprint-130006173.html", "published": 1598947700.0, "headline": "Infosys commits to hiring 12,000 American workers, expanding U.S. footprint", "body": "India-based IT services firm Infosys (INFY) plans to hire 12,000 employees in the U.S. over the next two years, building on an initiative it launched in 2017 to dramatically expand its workforce in America.The latest announcement brings the company’s total job commitments to 25,000 over the next five years.Speaking to Yahoo Finance’s On The Move, Infosys President Ravi Kumar said the new positions will target experienced technology professionals, along with recent graduates from major universities and community colleges.The jobs will largely include software developers and analysts focused on machine learning, artificial intelligence, and cloud technologies, according to the company.“We’ve believed over the last three years, that we have to hire locally and amplify with global talent,” Kumar said. “This endeavor of hiring locally has been pivoted on digital jobs, which are consumed in close proximity to enterprises.”The announcement from Infosys comes as firms across the country scramble to keep up with the digital transformation accelerated by the COVID-19 pandemic, and a move to remote work and remote learning. In its most recent quarter, digital revenue accounted for 44.5% of Infosys’s total revenue, marking a 25.5% growth year on year.The company has also made a strategic shift to hire locally in recent years, with the Trump administration dramatically limiting the number of H-1B worker visas issued. Denial rates for new visa petitions rose from 6% in FY 2015 to 29% through the second quarter of FY 2020, according to a new analysis from the National Foundation for American Policy. Fifty-nine percent of H-1B petitions filed by Infosys have been denied so far this year, a 57% jump from just five years ago.To build out its U.S. workforce, Infosys has launched six technology and innovation centers in Indiana, North Carolina, Connecticut, Rhode Island, Texas, and Arizona over the last three years, aimed at training and developing skills for critical IT service jobs.Story continuesKumar said the push to remote work brought on by the pandemic presented a huge opportunity for employers to expand their recruiting pool, while allowing employers to seek out jobs beyond their immediate region. Gig-workers with the most flexible schedules and the skill sets matching the jobs are most likely to emerge as the biggest winners, even without traditional university degrees, he said.Infosys plans to fill 12,000 new positions by retraining and up-skilling employees already in the workforce and by hiring from schools and colleges, where the per capita cost is much lower, Kumar said.“I think the magic formula to fix the jobs of the future, fix the gap and the jobs of the future,” he said. “Trading jobs in the market is always going to be expensive. But if you are hiring from schools and colleges and building from the ground up. It is going to be viable enough for for our businesses.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita25% of colleges likely to go out of business: Chegg CEOLabor market at ‘inflection point’ shifting from ‘degrees to skills’ : Infosys President‘China’s goal is to replace you’: Barr warns leaders of America’s biggest businesses‘An unprecedented case”: What a U.S. TikTok ban would look like"}]}