{"article": [{"url": "https://finance.yahoo.com/news/pelosi-mnuchin-agree-plan-avoid-224817163.html", "published": 1599155780.0, "headline": "Pelosi and Mnuchin agree on plan to avoid government shutdown", "body": "Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin have tentatively agreed to use a short-term spending bill to avoid a government shutdown at the end of September, according to Capitol Hill aides.The agreement on government funding comes even as the White House and top Democratic officials have been unable to reach a compromise on a new Covid relief package. Pelosi and Mnuchin spoke for more than 30 minutes earlier this week but remain hundreds of billions of dollars apart on additional stimulus efforts to help the slumping U.S. economy.Yet separating the issue of government funding from coronavirus relief talks removes at least one nightmare scenario from the political landscape two months before Election Day — a stalemate on more economic stimulus coupled with federal agencies shut down and vital services halted in the middle of a pandemic.“House Democrats are for a clean continuing resolution,\" Drew Hammill, deputy chief of staff for Pelosi, said in a statement.There is no consensus for how long the stopgap would extend government funding past Sept. 30, Hill aides said. House and Senate Democratic leaders haven't formally discussed the issue yet, although a mid-December deadline would be the traditional practice during an election year.The Senate returns to session next week, while the House is not back from its summer recess until midmonth. Senate Majority Leader Mitch McConnell (R-Ky.) and other top Senate Republicans are trying to gather support for a narrow coronavirus relief package that can get at least 51 GOP votes. Democrats will oppose the plan, so it's unlikely to get the 60 votes needed to advance.The new Senate Republican proposal — which will cost well over $500 billion — is expected to include $300 in weekly federal unemployment benefits through the end of December, another round of funding for the Paycheck Protection Program for small businesses, $105 billion for education, and liability protections for companies, schools and health care providers amid the pandemic, according to a draft proposal. The bill would also provide billions to the U.S. Postal Service by converting an existing loan into a grant. The House has passed legislation calling for $25 billion in new funding for the Postal Service, but the White House has supported only $10 billion.Story continuesSenate Minority Leader Chuck Schumer (D-N.Y.) has already rejected the GOP plan before it’s formally rolled out, calling instead for adoption of a far more sweeping House-passed bill, the $3.4 trillion Heroes Act. Pelosi has also offered to accept a $2.2 trillion relief plan in a bid toward compromise but has been rebuffed by the White House.“Republicans may call their proposal ‘skinny,’ but it would be more appropriate to call it ‘emaciated,’” the New York Democrat said in a letter to his Democratic colleagues on Thursday. “With no money for rental assistance, no money for nutrition assistance, and no money for state and local services, the census, or safe elections, Leader McConnell and Senate Republicans would be making another unacceptable and ineffective attempt at providing relief.”Mnuchin — who has partnered with White House chief of staff Mark Meadows throughout negotiations with Pelosi and Schumer — has said he would go up to $1.5 trillion for the overall cost of the new package. The White House and GOP leaders on the Hill have also complained Democrats have just assembled a \"wish list\" of policy items as part of the next relief measure and won't make real concessions in order to reach an agreement."}]}