{"article": [{"url": "https://finance.yahoo.com/news/department-store-century-21-files-120344482.html", "published": 1599752300.0, "headline": "Department Store Century 21 Files Bankruptcy, Will Shut Down", "body": "(Bloomberg) -- Century 21 Stores, an iconic New York off-price department store chain, filed for bankruptcy with plans to shut down, becoming the latest victim of the retail industry carnage that’s accelerated during the pandemic. Nearly 1,400 jobs are at risk.The retailer will hold going out of business sales at its 13 stores in New York, New Jersey, Pennsylvania and Florida, according to a company statement. The company listed assets and liabilities of as much as $500 million each in its bankruptcy petition filed Thursday.The company had “no viable alternative” to shutting down after its insurance providers failed to pay some $175 million Century 21 claims it’s owed under business interruption policies, Co-Chief Executive Officer Raymond Gindi said in the statement.The insurance companies “turned their backs on us at this most critical time,” Gindi said. “While retailers across the board have suffered greatly due to Covid-19, and Century 21 is no exception, we are confident that had we received any meaningful portion of the insurance proceeds, we would have been able to save thousands of jobs and weather the storm.”Disputes over business interruption insurance have been landing in court in droves, with insurers contending that pandemics aren’t covered. More than 1,100 insurance lawsuits tied to Covid-19 have been filed nationwide, according to data compiled by law firm Hunton Andrews Kurth. Century 21 has sued several of its insurance providers over the failure to pay, the retailer said. It’ll move that lawsuit into bankruptcy court and seek a speedy adjudication, according to the statement.Still, Century 21 faced the same uphill battle against e-commerce rivals that has shunted so many of its peers into bankruptcy. The retailer has seen fewer in-store shoppers in recent years, and Century 21 was contending with a heavy debt load before the pandemic forced it to close its stores in March, according to court papers.Story continuesThe retailer opened its flagship store in lower Manhattan in 1961. Popular with locals and tourists alike, the chain offered shoppers designer brands at discount prices. Its cultural imprint was strong enough to earn a mention from Sarah Jessica Parker’s character Carrie Bradshaw in the hit television series Sex and the City.Century 21 generated $747 million of revenue in fiscal year 2019 and typically spent about $400 million a year on merchandise alone, according to court papers. It has around 1,400 employees, most of whom are unionized.The case is Century 21 Department Stores LLC, 20-12097, U.S. Bankruptcy Court for the Southern District of New York (Manhattan). To see the docket on Bloomberg Law, click here.(Adds retail, historical context beginning in paragraph six.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}