{"article": [{"url": "https://finance.yahoo.com/news/disney-cut-28-000-jobs-223430718.html", "published": 1601401340.0, "headline": "Disney to Cut 28,000 Jobs in One of Biggest Layoffs of Covid Era", "body": "(Bloomberg) -- Walt Disney Co. is slashing 28,000 workers in its slumping U.S. resort business, marking one of the deepest workforce reductions of the Covid-19 era.The belt-tightening move affects the company’s theme-park, cruise-line and retail businesses, Disney said on Tuesday. That includes executives and salaried employees, although 67% of those being terminated are part-time workers. Disney is offering benefits to the workers being eliminated, including 90 days of job-placement services.The cutbacks jarred investors, who sent the shares down almost 2% in late trading. The stock was already down 13% this year.It’s the latest sign that travel and other experiences will be slow to recover from the pandemic. Disney joins airlines and other travel-reliant businesses in scaling back their workforces. American Airlines Group Inc. has warned that it could furlough 19,000 employees, while United Airlines Holdings Inc. is planning to cut about 12,000.Disney’s move also spotlights its troubles with California, which has been slower than other areas to lift restrictions on theme parks.The company’s domestic parks employed more than 100,000 before the pandemic, but that doesn’t include the cruise line and other divisions. Its workforce totaled 223,000 at the end of the last fiscal year, which ended in September 2019.Disney’s announcement could signal more challenges in the labor market’s recovery, with analysts already expecting Friday’s jobs report to show moderation in September’s gains compared with August.“As heartbreaking as it is to take this action, this is the only feasible option we have in light of the prolonged impact of Covid-19 on our business,” Josh D’Amaro, chairman of the parks division, said in a memo to workers.The Covid-19 crisis closed Disney parks around the world. Although the resorts in other areas have reopened -- including Florida, in July -- Disney still hasn’t received clearance to restart operations at its two theme parks in Anaheim, California.Story continuesD’Amaro said the Burbank, California-based company had tried to hold out as long as possible before making the cuts permanent, but after seven months with some attractions still closed, Disney couldn’t wait any longer.Lower CapacityEven those that have reopened, such as the four theme parks in Florida, are operating at much lower capacity due to social-distancing requirements. The number of visitors, particularly those who arrive via air travel, has been disappointing, the company has said.Disney also has been adopting more technology in response to the pandemic, allowing guests to get around the parks with fewer human interactions. The changes include online restaurant menus and mobile-pay systems. Some of those new approaches require fewer employees.“We’ve cut expenses, suspended capital projects, furloughed our cast members while still paying benefits, and modified our operations to run as efficiently as possible,” D’Amaro said. “However, we simply cannot responsibly stay fully staffed while operating at such limited capacity.”The situation has been exacerbated in California by the state’s unwillingness to lift its restrictions, D’Amaro said.Nineteen California legislators sent Governor Gavin Newsom a letter Monday urging him to reopen the state’s theme park industry.“Your administration has been rightfully reliant on data and science and, to date, the data and science do not point to theme parks as sources of transmission,” they wrote.(Updates with airline cuts starting in fourth paragraph.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}