{"article": [{"url": "https://finance.yahoo.com/news/companies-havent-done-the-work-around-diversity-and-inclusion-bozoma-saint-john-124030690.html", "published": 1593071300.0, "headline": "Companies ‘haven’t done the work’ around diversity and inclusion: Bozoma Saint John", "body": "Speaking with Yahoo Finance, Bozoma Saint John, Chief Marketing Officer of the talent agency Endeavor, says that companies haven’t done enough work to apply the knowledge they’ve learned around diversity and inclusion.“There are way too many white papers that have been written about why diversity and inclusion within our corporations makes sense,” she said. “I don't think there is a CEO right now who has not heard of these white papers, or doesn't at least superficially understand why it makes sense.”“But we haven't done the deeper work of actually applying it. And so right now, this very moment demands application. It demands more than just knowledge,” she added.As George Floyd protests continue to roil the nation, companies have come out to show their support of the Black Lives Matter movement, often donating millions to racial equity initiatives.Nike (NKE) pledged $100 million to organizations that promote racial equality and social justice. Shopping giant Amazon (AMZN) donated $10 million. Facebook (FB) committed $200 million to black businesses.Saint John says that businesses shouldn’t be afraid that their pledges will be mistaken for “lip service,” encouraging companies to do something, instead of nothing.“I am very much encouraged by the fact that businesses are taking this seriously, and that there is a reaction that is making them act now. I don't want to discourage anybody from action,” she said.“I think action is better than inaction, let's put it that way. And so for whatever reason it is that they are pouring money into causes and organizations that go to create equal justice and also go to protect black people, that go to defend black people, I am for it 100%.”Companies need to investSaint John also says companies need to be as invested internally as they seem to be externally.“Very much like the investment that we're seeing to outside organizations, I want business to make investments in their inside organization,” she explained.Story continues“And so that means hiring practices, that means internships, that means programs to help inclusion and support once people of color are inside of their buildings, because we know that retention is a real problem and a real challenge.”What’s more, the C suite executive said, there is a need for allies within companies to step up and help amplify the voices of their colleagues that aren’t being heard.“We've been talking for such a long time to the people who this system is not working for. And we've been telling them that it's their fault,” Saint John said. “Only if they positioned it a different way. Only if they were more aggressive in their ask for equality, that perhaps, then, they would get it.”But that approach doesn’t work, she said.“I don't want to continue to put the responsibility on the people who the system is working against to try and fix it. You know, it's time for somebody else to fix it. And so I'm asking for our business leaders, I'm asking for our colleagues who sit beside us, I'm asking for those who are on their way in and up who sit beneath us, to use their own voices to advocate,” said Saint John. “For those who are feeling very comfortable in their spaces, it's time to get uncomfortable and start making noise on behalf of those who you know and can see that the system is disregarding. If you want to know what to do, do that.”Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:Biden outraises Trump for month of May amid coronavirus, George Floyd protests‘We need more funding for police’: Missouri AG SchmittWhy Black wealth has stayed 'relatively flat' since Tulsa massacreFormer Obama advisor Valerie Jarrett talks protests, defunding police, and criminal justice reformCoronavirus pandemic could wipe out Social Security 4 years earlier than predicted: Wharton ModelRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}