{"article": [{"url": "https://finance.yahoo.com/news/white-claw-pizza-what-blaze-pizzas-latest-creation-tastes-like-163921430.html", "published": 1592567240.0, "headline": "White Claw pizza: Here's what Blaze Pizza’s latest creation tastes like", "body": "Don’t knock it ‘til you try it — at least when it comes to Blaze Pizza’s White Claw pizza.Yahoo Finance got to try the unique creation, and it was delicious.Customizable pizza chain, Blaze Pizza, collaborated with hard seltzer company White Claw on a unique White Claw-infused pizza crust. It was available at more than 40 Blaze Pizza locations for one day only on June 18.Blaze Pizza Co-founder and Executive Chef Brad Kent took us behind the scenes for an exclusive look at how the White Claw infused dough is made. To make roughly 100 dough balls, Kent cracked open 20 White Claw cans. Mango White Claw replaced the filtered water that’s normally used in Blaze Pizza’s dough.Flour, yeast, extra virgin olive oil, salt and a pinch of sugar were added to the White Claw to complete the dough.Cracking open and pouring in the White Claw takes the most time, according to Kent. But it’s totally worth it. The crust has the perfect level of chewiness and crunchiness and the most subtle tropical notes shine through.(Courtesy of Blaze Pizza)The pizza is then topped with Blaze Pizza’s signature red sauce, shredded mozzarella, pepperoni, roasted red pepper, jalapeño and pineapple before its tossed into the oven. After three minutes in the oven, the piping hot pizza is topped with fresh arugula.Although, you can’t really taste the White Claw in the crust once it is cooked, you can definitely appreciate the marriage of sweet, salty, spicy and savory flavors that explode in your mouth upon the first bite. Pineapple on pizza can be a rather controversial and divisive topic, but put your prejudices aside for this one. Have an open mind because fruit on pizza worked this time around.While the White Claw pizza was only available for one day, Kent said that depending on how the promotion goes, the company is open to bringing it back. If the people want it, Blaze Pizza will deliver, according to Kent.Yahoo Finance’s verdict on overall taste: 4.8 out of 5—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.Story continuesMore from Heidi:Jobless claims: Another 1.51 million Americans file for unemployment benefitsRetail sales jump 17.7% in May amid COVID-19 pandemicJobless claims: Another 1.54 million Americans file for unemployment benefitsFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}