{"article": [{"url": "https://finance.yahoo.com/news/powell-federal-reserve-yield-curve-control-an-open-question-211711984.html", "published": 1591806320.0, "headline": "Powell: Capping US Treasury yields 'remains an open question'", "body": "The Federal Reserve could soon renew its World War II-era policy of capping yields on U.S. government debt, as the central bank weighs its options on pinning down longer-term interest rates.The central bank on Wednesday held rates steady at near-zero and suggested that it may not raise rates through 2022. But as markets look for more forward guidance on what the Fed may do in the future, Fed Chairman Jerome Powell said Wednesday that the Fed is looking “in some depth” at strategies that could clarify where policy will be headed in the medium-term.One such strategy would be yield curve control, in which the central bank commits to purchasing U.S. Treasuries of a targeted maturity until their yields fall below stated levels.“We’ll continue those discussions in upcoming meetings and evaluate our stance and communications as more information about the trajectory of the economy becomes available,” Powell said.Powell said Fed policymakers received a briefing on the historical experience with such a policy, adding that the effectiveness of yield curve control “remains an open question.”Other Fed officials have floated the idea of yield curve control in the past.Fed Governor Lael Brainard has said targeting medium-term yields (i.e. 3-year and 5-year Treasuries) could be useful in providing “additional accommodation” and Fed Vice Chairman Richard Clarida has described the policy as a “natural complement” to other types of forward guidance.Powell’s suggestion that the Fed will discuss the viability of yield curve control in “upcoming meetings” means that the Fed may not be ready to announce anything in its next scheduled Federal Open Market Committee meeting on July 28 and 29.Wall Street firms have bet on later this year for an announcement. Bank of America’s global research team wrote June 2 that they expect the Fed to wait until September to announce a “one-two punch” of forward guidance and yield curve control targeting medium-term rates.Story continuesWhat is yield curve control?The Fed keeps short-term borrowing costs low by paying out interest on reserves parked by banks at the Federal Reserve overnight. When the Fed lowers interest rates, the central bank is attempting to incentivize borrowing because money becomes cheaper to borrow.But the Fed has less of a direct impact on longer-term interest rates, preferring to allow market forces to determine pricing on, for example, 10-year investments.The “yield curve” maps out yields for U.S. Treasuries ranging in duration from one month to 30 years, and serves as a proxy for interest rates of different duration. For example, the 3-month U.S. T-bill had a yield of 17 basis points as of June 10, right in the Fed’s target interest rate range of 0 to 25 basis points.Yield curve control would involve direct bond purchases of longer-dated U.S. government debt until those bond yields – and consequently, longer-term interest rates – are pinned below desired levels.The Fed has done this before between 1942 and 1951, targeting a ⅜ percent rate on three-month Treasury bills and a 2.5% yield on long-term bonds.The Fed may revive the policy now to spur more longer-term borrowing to pull the U.S. economy out of the COVID-19 induced recession.Over the last week, longer-term interest rates have jumped as investors rotate out of fixed income and into risky assets like equities. Last Friday, the 10-year U.S. Treasury (^TNX) rose above 90 basis points, a 30 basis point rise from levels in mid-April.The distinct feature of yield curve control is a stated yield target; the Fed has already been purchasing 10-year U.S. Treasuries as part of a commitment to buy government debt and mortgage-backed securities “in the amounts needed.” The Fed tweaked its stance on Wednesday to increase its pace of purchases “over coming months.”Other central banks have deployed yield curve control policies, such as the Bank of Japan and the Reserve Bank of Australia.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed: No rate hikes likely through 2022, projects 6.5% GDP contraction this yearFOMC Preview: Fed to focus on taming the yield curveFed expands Main Street loan program with lower minimum amount, extended termFormer Minneapolis Fed Chief: 'Very slow' recovery could lead to negative ratesA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}