{"article": [{"url": "https://finance.yahoo.com/news/apple-phil-schiller-hey-email-app-064233993.html", "published": 1592531420.0, "headline": "Apple says the Hey email app was originally approved in error", "body": "Apple isn’t going to let up on Basecamp’s Hey email app anytime soon. In an interview with TechCrunch, company Senior Vice President Phil Schiller said Apple has no plans to change its rules to accommodate the application despite the backlash it’s gotten over the past few days. “Sitting here today, there’s not any changes to the rules that we are considering. There are many things that they could do to make the app work within the rules that we have. We would love for them to do that,” he told the publication.Basecamp launched the Hey email app for iOS (and other platforms) a few days ago, promising a more organized approach to email. Unlike free services like Gmail, it costs $99 a year, which you’d have to pay for on the web. That means the app itself wouldn’t work right after you download it from the App Store, and you can’t pay for a subscription as an in-app purchase. “You download the app and it doesn’t work, that’s not what we want on the store,” Schiller said.As TechCrunch explains, that’s against the rules for most apps, with the exception of “reader”apps that can display books or play music and movies, such as Netflix. “Email is not and has never been an exception included in this rule,” Schiller told TC. He also admitted that the iOS app was approved in error — the Mac app was rejected from the get-go — and should never have shipped in the first place.While the Hey email app is still available on the App Store as of this writing, Apple rejected a bug fix the company tried to submit on Monday. The tech giant also rejected Basecamp’s appeal, sending the company a lengthy letter explaining its violations.“The HEY Email app is marketed as an email app on the App Store, but when users download your app, it does not work. Users cannot use the app to access email or perform any useful function until after they go to the Basecamp website for Hey Email and purchase a license to use the HEY Email app. This violates the following App Store Review Guidelines:Guideline 3.1.1 – Business – Payments – In-App PurchaseIf you want to unlock features or functionality within your app, you must use in-app purchase. Your app requires customers to purchase content, subscriptions, or features outside of the app, but those items are not available as in-app purchases within the app as required by the App Store Review Guidelines...To resolve this issue, please revise your app such that it does not violate any of the App Store Review Guidelines and terms.There are a number of ways that you could revise your app or service to adhere to the App Store Review Guidelines. Customers who have previously purchased access to content, subscriptions, or features elsewhere may continue to access these items in your app, as long as new iOS customers are given the option to purchase access using in-app purchase as required by the App Store Review Guidelines.”Story continuesApple's rejection letter to Hey attached. Company also says Basecamp hasn't generated revenue for the App Store in 8 years. https://t.co/WLTwgGJQ2i pic.twitter.com/ln09TViar6— Mark Gurman (@markgurman) June 18, 2020In a tweet, Basecamp CTO David Heinemeier Hansson said “There is no chance in bloody hell that we're going to pay Apple's ransom. I will burn this house down myself, before I let gangsters like that spin it for spoils. This is profoundly, perversely abusive and unfair.”If you’ll recall, Apple takes a 30 percent commission on paid apps and any in-app purchases. For subscriptions, it takes 30 percent in the first year, then 15 percent in the succeeding years. That’s how it’s been for a long time, but developers are speaking up about it again after the European Commission announced that it was opening dual investigations into the App Store and Apple Pay.The investigation was triggered by complaints filed by Spotify and, based on reports, Rakuten-owned e-reader app Kobo. Spotify chief Daniel Ek revealed long ago that the company can’t afford Apple’s fees, pointing out that it’ll be undercut by Apple Music that doesn’t have to pay the same cut. After the EC announced its investigation, Tinder’s parent company Match Group and Fortnite owner Epic Games also criticized the tech giant for collecting a portion of their earnings made through the Apple App Store."}]}