{"article": [{"url": "https://finance.yahoo.com/news/why-joe-biden-is-wooing-unions-203706580.html", "published": 1594827920.0, "headline": "Why Joe Biden is wooing unions", "body": "In his plan for rebuilding infrastructure and addressing climate change, Joe Biden mentions unions 32 times, repeatedly calling for jobs that pay well and also offer the chance to join a union.That partly reflects Biden’s drift to the left, as he tries to build a bridge to liberal Democrats who back Senators Bernie Sanders and Elizabeth Warren. But Biden’s pitch for unions could work with moderate voters too, since unions have gotten more popular as they’ve become less common.Union membership has been falling steadily since the 1970s, with just 10.3% of workers belonging to unions today. That’s down from a peak of around 32% in the early 1950s. About one-third of government workers belong to a union, but in the private sector barely 6% do. Unions have declined as manufacturing jobs have gone overseas, employers have found ways to avoid costly union contracts and some workers with the choice have rejected unions.Some economists think the decline of unions is one of the reasons household income has stagnated, while income inequality has dramatically worsened. That may explain why unions have been gaining popularity after a long slide. Approval of unions fell from 75% in the 1950s to a low of 48% in 2009, according to Gallup surveys. That was around the time many Americans felt greedy, corrupt labor unions contributed to the bankruptcies of General Motors and Chrysler. But union approval rebounded to 64% in 2019, even as union membership shrank during the last decade.(AP Photo/Tony Dejak, File)As a longstanding Washington Democrat, Biden might seem like a natural ally of labor unions. But unions grew disillusioned with Democrats during the Obama administration, when Biden was vice president. Obama generally supported a free-trade agenda that labor unions felt weakened their job security. He also gave tepid support to legislation that could have expanded union membership. And the Affordable Care Act, passed in Obama’s second year in office, included a provision to tax generous health coverage plans like those many unions have negotiated. Congress repealed that unpopular tax last year, when Trump was president.Story continuesTrump won the union voteDonald Trump’s protectionist trade agenda in 2016 helped him with union members, including some who supported Bernie Sanders in the Democratic primary elections. Hillary Clinton won 55% of the union vote in 2016, with Trump getting 38%. But Clinton’s pull was down from 2012, when Obama got 65% of the union vote and Mitt Romney got just 30%. Those additional union votes for Trump were probably enough to put him over the top in Pennsylvania, Michigan and Wisconsin, securing the electoral college win in 2016.The union vote could be just as decisive in 2020, one likely reason Biden kicked off his presidential campaign last year by announcing the endorsement of the International Association of Fire Fighters. Many unions sat out the Democratic primaries this cycle, to avoid choosing among Democrats. But now that Biden’s the presumptive nominee, he has endorsements from the AFL-CIO, the United Auto Workers and many other important unions.Democratic presidential candidate, former Vice President Joe Biden, center, and McGregor Industries owner Bob McGregor take a tour of the metal fabricating facility, Thursday, July 9, 2020, in Dunmore, Pa. (AP Photo/Matt Slocum)The question is whether a President Biden could actually do much to turn around the slide in union membership and beef up the kind of worker protections unions offer, in the midst or aftermath of the coronavirus recession. Biden says he wants to establish new federal programs that will create millions of jobs for workers rebuilding roads and bridges, weatherizing commercial buildings, installing electric-vehicle charging stations, revamping the nation’s power grid and remediating abandoned oil and gas wells. He also favors a $15 minimum wage, up from $7.50 now, along with legislation that would close loopholes allowing firms to avoid hiring union workers.Thing is, the big infrastructure and climate plan Biden announced on July 14 entails a lot of wishful thinking. “Such an ambitious plan is more of a campaign messaging tool than a realistic governing blueprint,” Beacon Research explained in an analysis. The Biden plan would require Democrats to take control of the Senate in November, since it has no Republican support. And even then, it’s not clear a thin majority of Democrats could pass legislation without the 60-vote majority needed to overcome a filibuster. Biden also hasn’t spelled out how he’d pay for $2 trillion in new spending his plan would entail, another shortfall at a time federal deficits are soaring to record levels.Trump, for his part, hasn’t said much about unions, or about any part of his agenda for a second term. He’ll likely tout his trade deal with China and the newly crafted trade deal with Mexico and Canada as union-friendly policies. But the China deal is at risk of falling apart, with China buying far fewer American goods than it promised to. And the new deal with Canada and Mexico isn’t all that different from the old NAFTA. Meanwhile, the manufacturing sector is reeling from the coronavirus pandemic and more than 700,000 jobs lost during the last four months. Biden’s timing seems pretty good.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Edgy voters might reject the 2020 election outcomeTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}