{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-college-football-split-on-season-us-strikes-vaccine-deal-with-moderna-170756877.html", "published": 1597234520.0, "headline": "Coronavirus update: College football split on season; US strikes vaccine deal with Moderna", "body": "A new school year and the flu season are right around the corner, bringing with them the ongoing struggle of battling the coronavirus outbreak that is just beginning to show signs of waning in the U.S.Some college football conferences have taken action, with the Big Ten and Pac-12 announcing their upcoming seasons are postponed due to the uncertainty of the coronavirus. The Big-12, however, decided Tuesday it would continue its season. Meanwhile, other conferences are still weighing their options.Questions about how this could affect decisions in the National Football League, which is also weighing its ability to play its regular season. The Washington Football Team announced it would hold its regular season games, but without fans.In the U.S., the COVID-19 case count jumped by 100,000 Wednesday to 5.1 million, and deaths are approaching 165,000. Globally, cases are reaching 20.5 million and more than 744,000 have died from the virus.However, optimism remains high for a successful coronavirus vaccine in the U.S. by the end of the year — even though widespread distribution is unlikely until mid-2021.Moderna (MRNA), the frontrunner in the U.S., struck a deal to provide 100 million doses of its two-shot vaccine to the U.S. for up to $1.5 billion. That is in addition to $955 million from the federal government to license the vaccine.Other companies have also promised hundreds of millions of doses to the U.S. in similar deals through Operation Warp Speed (OWS).To-date, the U.S. has deals for several hundred million doses, for a total of more than $8 billion. OWS has stated its aim is to secure at least 300 million doses.CLEMSON, SOUTH CAROLINA - JUNE 10: A view of Clemson Memorial Stadium on the campus of Clemson University on June 10, 2020 in Clemson, South Carolina. The campus remains open in a limited capacity due to the Coronavirus (COVID-19) pandemic. (Photo by Maddie Meyer/Getty Images)Behind the scenesDr. Peter Marks, director of the Center for Biologics Evaluation and Research (CBER) in the U.S. Food and Drug Administration (FDA), noted in an event with the National Press Foundation on Wednesday that despite the vaccine race moving full steam ahead, regular press releases from pharmaceutical companies should be taken with a grain of “kosher salt.”Story continues“I’m not sure that all of this noise that we are hearing from all of the companies is really all that helpful. This is a stock price issue,” he said.Marks said that the news is encouraging, but positive early trial results don’t always translate to a successful vaccine.The FDA anticipates being able to issue an emergency use approval for a vaccine, but officials have repeated that nothing will be rushed. Marks reiterated that point, adding that in the past the FDA has been able to approve vaccines on an accelerated basis, but only when more is known about the disease.“Because we don’t have that now, for the first vaccines ... we don’t expect to be using our accelerated approval provisions because we don’t think we’ll have enough knowledge” to correlate to the clinical outcomes, Marks said.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}