{"article": [{"url": "https://finance.yahoo.com/news/verishop-aims-to-become-the-largest-online-shopping-mall-in-the-western-world-ceo-imran-khan-amazon-130106234.html", "published": 1591949360.0, "headline": "E-commerce startup Verishop aims to become the 'largest online shopping mall in the Western world': CEO", "body": "Online retailer Verishop is just under a year old, but its CEO and co-founder already has his sights set on building a platform that will eventually rival some of the biggest existing e-commerce players.“Our mission is to build the largest online shopping mall in the Western world,” Imran Khan, CEO and co-founder of Verishop, told Yahoo Finance Breakouts. “If you look at why do you go to shopping mall, you go to shopping mall for entertainment. You go to shopping mall for discovery. And you go to shopping mall for convenience. And I'm really focused on bringing those three value propositions to customers.”The Santa Monica, California–based company was launched on June 18, 2019, by Khan and his wife, Cate Khan, who previously worked as head of retail at Amazon’s now-shuttered Quidsi business. Before co-founding Verishop, Imran Khan spent about four years as Snap’s (SNAP) chief strategy officer, during which the social media company grew from a closely-held start-up to a publicly traded firm with a multi-billion-dollar market cap.Verishop began selling fewer than 200 brands on the platform, but now serves as an aggregator of more than 600, including women’s and men’s apparel brands like Levi’s (LEVI), home goods brands including Zwilling and beauty brands like Kora Organics. The company was last reported to have raised $30 million in venture capital at a valuation of around $100 million‘Verified shop’Instead of listing products via third-party sellers, as can be the case on other e-commerce sites like Amazon or eBay (EBAY), Verishop purchases products directly from brands in an effort to maximize trust among consumers. The name of the company itself is a portmanteau of “verified shop.”“What we’re trying to do is highlighting the brands ... and then the second thing is our commitment to trust,” Khan said. “The internet over the last 20 years lost that trust. We had misinformation. Now, we have ‘mis-product.’”“A lot of times the brands tell me that they don't want to go to a traditional e-commerce platform, because they know their product will show up next to a counterfeit product,” Khan said. “It ruins their brand value. And that's what we’re trying to solve.”Story continuesWhile Khan did not name other e-commerce companies specifically in his remarks, his comments nod to the model e-commerce giants like Amazon have adopted. On Amazon, more than half of goods come from third-party merchants, or sellers outside of the company that pay per-sale commissions to be listed on the site. Reports of influxes in counterfeit items on Amazon and on other similar platforms abound, and the Department of Homeland Security wrote in a report in January that “American consumers shopping on e-commerce platforms and online third-party marketplaces now face a significant risk of purchasing counterfeit or pirated goods.”The proliferation of counterfeits has created an inroad for companies like Verishop and The Real Real (REAL) to enter the market, promising authenticity in the goods they deliver.San Francisco, California, USA - Circa, 2019 : Retail online-shopping website Verishop advertisement on MUNI bus on city street. Verishop is a new e-commerce site that sells a curated selection of women's and men's fashion, home goods, and beauty products.Still, as an e-commerce platform, Verishop operates in a space where margins can be slim and delivery costs high, and where companies have benefited deeply from the scale offered by early entrance. Amazon itself has been shelling out about $1 billion per quarter since mid-last year to roll out free one-day shipping to its Prime members.Verishop flirted with offering free one-day shipping to all customers without membership last year, but currently provides default free two-day shipping to all users.The coronavirus pandemic also consolidated market share among earlier leaders in e-commerce. But Khan said the resulting e-commerce sales bump was a boon for Verishop as well.Verishop’s home goods sales grew 158% between late February and late March, and beauty products also more than doubled sales. The company attributed these results to widespread sheltering in place, giving consumers more time to focus on home decor and personal care. Apparel sales fell about 16% and 17% for women’s and men’s fashion, respectively, during the period, however.Those trends have begun to normalize in recent weeks, Khan said.“I think we're seeing that things are going back to the normal level, as normal as it can get,” he said. “We are living in a very interesting time and very challenging time in many different ways, but I think we're seeing more normalizing level. But in home-and-beauty category still continues to do pretty well and [is] doing better than they did pre-COVID. But business is becoming much more balanced now.”Still, Khan said Verishop grew sales 33% month on month in May, accelerating from a 30% month on month growth rate in April.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:Some wellness products growing ‘over 1,000%’ during pandemic: Ro CEOMay jobs report: US economy unexpectedly adds 2.5 million payrolls, unemployment rate falls to 13.3%What we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}