{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-9-2020-221507350.html", "published": 1599664400.0, "headline": "Stock market news live updates: Tech shares rebound after three days of selling; vaccine trial put on hold", "body": "Stocks rose Wednesday and recovered some losses after another drop in tech names dragged the three major indices to their lowest closing level in one month on Tuesday. Shares of reopening stocks including airlines, cruise lines and travel companies fell, after a company front-running the race to develop a Covid-19 vaccine had its trial put on pause.[Click here to read what’s moving markets heading into Thursday, September 10]Shares of Amazon (AMZN) and Apple (AAPL) each extended their gains to more than 4% in intraday trading, rebounding after investors over the past three sessions poured out of these leaders from the past several months. Tesla (TSLA) shares rose more than 7%, after the stock slumped 21% in its worst single session decline on record earlier in the day. The S&P 500 rose more than 2.5%, after the index sustained a 7% loss over the course of the prior three sessions.In spite of the morning bounce, some analysts warned that the rotation away from technology and “stay-at-home” stocks could continue over the next few months.“I think they definitely have more to go on the downside before they bounce in any kind of meaningful way,” Matt Maley, chief strategist at Miller Tabek, told Yahoo Finance’s The First Trade on Tuesday. “These are great companies on a long-term basis, but since they got so far ahead of themselves, I think they’ve got further to drop, and they won’t bounce back as quickly as a lot of people think they will.”Even after the past several sessions’ worth of sharp declines, Amazon’s stock remained higher by 70% for the year to date, Apple’s held higher by 54%, and Facebook’s by 32%. That compares to a 3% gain for the S&P 500 over the same time period.Other strategists echoed similar sentiments, suggesting investors should brace for volatility in the near-term especially in growth and tech names.“We think there is more downside over next month but eventually leads to further broadening out of the bull market,” Morgan Stanley strategist Mike Wilson said in a note Tuesday. “The S&P may be range bound for the rest of year making stock picking critical.”Story continuesThe risk-off sentiment also spilled over into other asset classes, with US crude oil prices (CL=F) dropping 7.6% to settle at their lowest level since June Tuesday afternoon. This came after Saudi Aramco slashed its October crude prices by a greater than anticipation margin, signaling its expectation for extended weakness in energy demand as individuals continue to eschew travel and other discretionary consumption during the pandemic. Crude oil prices rose more than 1.5% Wednesday morning.Meanwhile, on the vaccine front, STAT News reported late Tuesday that a late-stage trial of a Covid-19 vaccine candidate being studied by AstraZeneca (AZN) and the University of Oxford was being put on hold, due to safety concerns after a suspected serious adverse reaction in a participant in the U.K. Shares of AstraZeneca sank 2%, while those of companies competing to develop a Covid-19 vaccine including Moderna (MRNA) and Novavax (NVAX) rose.—4:02 p.m. ET: Stocks roar higher as tech shares rebound; Nasdaq jumps 2.7%Here were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +67.19 (+2.02%) to 3,399.03Dow (^DJI): +439.71 (+1.60%) to 27,940.60Nasdaq (^IXIC): +293.87 (+2.71%) to 11,141.56Crude (CL=F): +$1.28 (+3.48%) to $38.04 a barrelGold (GC=F): +$14.80 (+0.76%) to $1,958.00 per ounce10-year Treasury (^TNX): +1.9 bps to yield 0.7030%—2:37 p.m. ET: Stocks hover near session highs, Dow gains extend to 2.4%The three major indices held near session highs with about 90 minutes left of the trading day. The Dow rose 2.35%, or nearly 650 points, while the S&P 500 added 85.61 points, or 2.6%.The Nasdaq outperformed, gaining more than 3%. Shares of Apple, Amazon and Microsoft each added more than 4% in intraday trading.—1:22 p.m. ET: New York Gov. Cuomo says indoor dining in NYC can restart Sept. 30New York City restaurants can open for indoor dining at 25% capacity beginning Sept 30, New York Gov. Andrew Cuomo said in a news conference Wednesday. The city will send out about 400 inspectors to ensure restrictions are being met as locations reopen, he added. The state will reassess indoor dining guidelines on Nov. 1.—12:18 p.m. ET: Stocks extend gains, Dow adds 500+ pointsThe three major indices added to gains in intraday trading, with each of the S&P 500 and Nasdaq higher by more than 2%.Here were the main movs in markets, as of 12:18 p.m. ET:S&P 500 (^GSPC): +76.05 points (+2.28%) to 3,407.89Dow (^DJI): +539.32 points (+1.96%) to 28,040.21Nasdaq (^IXIC): +305.88 points (+2.83%) to 11,155.09Crude (CL=F): +$1.34 (+3.65%) to $38.10 a barrelGold (GC=F): +$8.20 (+0.42%) to $1,951.40 per ounce10-year Treasury (^TNX): +1.4 bps to yield 0.698%—10:01 a.m. ET: Job openings rose by 6.618 million in July, topping expectationsJob openings in the US rose by a greater than expected amount in July while new hiring slowed, underscoring the choppy recovery under way in the labor market.Job openings grew by 617,000 to total 6.618 million in July, the Bureau of Labor Statistics said Wednesday. Consensus economists had expected 6 million opening, according to Bloomberg-compiled data.The number of hires, however, decreased by 1.183 million in July to 5.8 million, with the greatest drop coming in accommodation and food services at nearly 600,000. Hires increased in federal government, largely due to hiring for the 2020 Census.—9:42 a.m. ET: Tiffany shares slide 10% after LVMH walks back from $16 billion acquisitionLVMH (MC.PA) on Wednesday pulled out of a $16.2 billion deal to acquire jewelry brand Tiffany (TIF), in what would have been the largest-ever tie-up in the luxury industry.The French luxury conglomerate said that it would not “be able to complete the deal” in light of recent events, including a call by the French government to put its Tiffany takeover on hold until January 2021 due to the US threat of tariffs on French products. The US had said in July it would impose a 25% tariff on French products including makeup and handbags, as part of a dispute over a French tax that would hit US tech companies.Tiffany had previously called for a delay of the deal until Dec. 31 this year. LVMH, however, decided to stick with the original agreement from November 2019, which had set a deadline of Nov. 24 this year for the deal to take place.Tiffany said in a subsequent press release it had filed a lawsuit against LVMH, requesting a Delaware Court “require LVMH to abide by contractual obligation to complete transaction.”—9:34 a.m. ET: Stocks open higher after three days of sellingThe three major indices opened higher Wednesday morning, with the Nasdaq leading the way higher as some of the biggest decliners over the past three sessions tried to make up lost ground. The index rose 1.9%, or 205 points.The S&P 500 rose 1.3%, or more than 40 points, just after market open, led by the information technology and materials sectors. The Dow added 250 points, or 0.9%, led by more than 2% advances in each of Microsoft and Apple.—7:20 a.m. ET Wednesday: Stock futures turn positive, looking to regain some lossesHere were the main moves in markets, as of 7:20 a.m. ET:S&P 500 futures (ES=F): 3,354.00, up 18.5 points or 0.55%Dow futures (YM=F): 27,609.00, up 84 points or 0.31%Nasdaq futures (NQ=F): 11,227.75, up 167.25 points, or 1.51%Crude (CL=F): +$0.54 (+1.47%) to $37.30 a barrelGold (GC=F): -$14.90 (-0.77%) to $1,928.30 per ounce10-year Treasury (^TNX): -0.8 bps to yield 0.676%—6:03 p.m. ET Tuesday: Stock futures extend decline, led again by a drop in tech sharesHere were the main moves in equity markets, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,309.75, down 25.75 points or 0.77%Dow futures (YM=F): 27,306.00, down 219.00 points or 0.8%Nasdaq futures (NQ=F): 10,975.25, down 85.25 points, or 0.77%NEW YORK, NEW YORK - MARCH 20: Traders, some in medical masks, work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}