{"article": [{"url": "https://finance.yahoo.com/news/apple-ceo-tim-cook-hit-with-questions-on-app-store-dominance-during-antitrust-hearing-224150894.html", "published": 1596044960.0, "headline": "Apple CEO Tim Cook hit with questions on App Store dominance during antitrust hearing", "body": "Apple (AAPL) CEO Tim Cook faced pointed questions from the House Judiciary Committee’s Subcommittee on Antitrust, Commercial, and Administrative Law on Wednesday, with members pointing to the cut Apple takes from app developers in its App Store.While lawmakers spent a good amount of time pressing the four CEOs of some of the largest companies in the world — including Amazon (AMZN) CEO Jeff Bezos, Facebook (FB) CEO Mark Zuckerberg, and Alphabet-parent Google (GOOG, GOOGL) CEO Sundar Pichai — on their own side issues, including unproven allegations of bias and swearing loyalty to the U.S. military, some stuck to the theme of the hearing: antitrust.Representative Hank Johnson (D-GA) hit Cook and Apple for their App Store strategy, which requires certain app developers to use Apple’s own payment system and charges those firms a 30% commission for each sale on the platform.During his questioning, Johnson asked whether Apple is the sole decision maker as to whether apps can appear in the App Store, if it applies its rules arbitrarily, and if it discriminates against app developers who offer apps similar to those provided by Apple — all points that have been raised at varying points by Apple’s critics.Apple CEO Tim Cook speaks via video conference during a House Judiciary subcommittee hearing on antitrust on Capitol Hill on Wednesday, July 29, 2020, in Washington. (Graeme Jennings/Pool via AP)Cook, however, pushed back, saying that Apple does not favor any apps and that the company applies its rules evenly across the App Store.Representatives Lucy McBath (D-GA) and Val Butler Demings (D-FL) similarly questioned Apple’s App Store policies, specifically pointing to Apple’s controversial move to remove parental control apps in 2019. According to The New York Times, Apple reinstated some of the apps shortly after reports were published about antitrust investigations into Silicon Valley tech giants and following the company’s release of its own parental control apps.Apple, meanwhile, said it banned the apps because they were using something called Mobile Device Management, and could have been able to sell data collected using those apps to third parties. However, the Times’ report said that Apple was unable to prove any of the previously banned apps had taken such steps.Story continuesApple’s App Store commission and its control over apps that can appear in the store are some of the main issues behind the antitrust investigations into the company by the Department of Justice and several state attorneys general.Apple requires apps to meet specific guidelines for them to be listed in the App Store, as well as use Apple’s App Store payment system. App developers that sell through the App Store pay a 30% commission to Apple. Subscriptions purchased through the store require a 30% commission for the first year and 15% for each subsequent year.That move, according to app developers like Spotify (SPOT), is unfair since Apple itself offers a competing service in Apple Music and doesn’t have to pay a commission for its sales.Apple does allow so-called “reader” apps like Spotify or Netflix (NFLX) to avoid paying commissions for subscriptions, because they don’t let users sign up through the apps themselves. Apps like Spotify and Netflix can’t list any call to action telling users where they can sign up for their services.Cook made sure to point out that Apple’s App Store commissions are commensurate with those required by competitors like Google through its Google Play app store, but Apple also operates its operating system as a walled garden.No apps can be installed on an iPhone if they aren’t available through the App Store. Apple says that’s to ensure security and quality. Google, however, allows users to install apps from outside of its Play Store, though it’s not something the average user would likely know how to do and requires allowing the installation of apps from third-party sources.The one instance in which Cook was tripped up was when Representative Joe Neguse (D-CO) asked whether Apple’s apps have to abide by the same rules that third-party app makers must with regards to the App Store.While Cook said he believed that to be the case, Neguse pointed to the fact that while Apple forbids app makers from releasing copy-cat apps, Apple is able to copy apps submitted to its store.It was as a statement Cook was unable to square with his contention that Apple follows the same rules as third-party app makers.Overall, Apple emerged from the hearing relatively unscathed compared to his peers. But the hearing itself is just a piece of the committee’s hearing, and the company still has to contend with the Department of Justice and state attorneys general investigations into the business.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Amazon, Apple, Facebook, and Google CEOs push America-first narrative in effort to avoid antitrust scrutinyAnalysts look to hints of iPhone 12 delays in Q3 earningsTop back-to-school gear: Tech SupportTwitter hack could have been ‘much, much worse’ say cybersecurity expertsShould you delete TikTok?: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}