{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-week-ending-july-25-123150219.html", "published": 1596099860.0, "headline": "Jobless claims top 1M again in latest week as coronavirus keeps battering workers", "body": "Over a million people filed for unemployment benefits in the latest week, Labor Department data showed on Thursday, underscoring the depths of the coronavirus pandemic’s devastating impact on the U.S. economy.All told, new unemployment claims have exceeded 1 million for 19 consecutive weeks, with well over 50 million now out of the workforce. Here were the main results from the report, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended July 25: 1.434 million vs. 1.445 million expected and 1.416 million during the prior weekContinuing unemployment claims week ended July 18: 17.01 million vs 16.2 million expected, 16.197 million during the prior weekCombined with second quarter gross domestic product data that was the worst on record, the latest jobless claims underscored the COVID-19 crisis’ unrelenting effect on a U.S. recovery that is spluttering, as new diagnoses throttle the economy.The unemployment data is yet another sign from high-frequency data that “the economy has lost momentum in recent weeks as the spread of COVID-19 intensified in many areas,” wrote JPMorgan Chase economist Daniel Silver in a research note on Thursday.The tick higher in jobless claims “Was the second straight weekly increase, and while the recent increases have been relatively modest (by COVID-19 standards), they marked the end of a run of fifteen straight weekly declines for the claims data,” he added.Continuing claims have been closely watched by Wall Street as an indicator of how well the job market is healing. The jump to 17 million in the latest week bodes ill for the recovery, given that it was the first weekly rise in that category since late May, Silver pointed out.It also suggests a “net increase in the number of unemployed people during the week ending July 18, although other factors beyond employment status can influence the data, including rules about eligibility,” he added.Thursday’s jobless data shows the urgency facing Congress and the White House as they negotiate the details of a new tranche of stimulus to mitigate the pandemic’s fallout.Story continuesAt least 54 million jobless claims have been filed since the COVID-19 crisis began.A key sticking point is whether the $600 supplemental unemployment benefit will be extended — and by how much. At least some economists have argued that money originally designed to be a lifeline for the working class has now become something of a perverse incentive, with some earning more at home than they did in their jobs.Veteran market analyst Peter Boockvar said on Wednesday that it’s likely that Washington’s warring political factions will land “somewhere in the middle” of a range between a reduced $200 figure floated by the Republicans and the current $600 payment.“Either way, it will be lower than what was where the University of Chicago estimated that 68% of those receiving benefits were getting paid more than what they made before with the median payment 34% higher than their previous weekly paycheck,” Boockvar said.“Rate of change is what is most relevant here, and thus the law of diminishing returns matters,” he added.The Federal Reserve on Wednesday held interest rates at near-zero as the central bank continues efforts to support a recovery. However, Fed Chair Jerome Powell said high-frequency data pointed to an economy that appears to have slowed since COVID-19 cases began surging in mid-June, adding to an infection count of nearly 4.5 million and killing over 150,000.“On balance, it looks like the data are pointing to a slowing in the pace of the recovery,” Powell said — adding that consumer surveys appear to be “softening again,” while labor market indicators pointed to a slowing of job growth, particularly among small businesses.-Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}