{"article": [{"url": "https://finance.yahoo.com/news/trump-border-private-land-165743709.html", "published": 1592222720.0, "headline": "Trump administration 'doubled down on' converting private land for border wall amid coronavirus pandemic", "body": "The battle over President Trump’s border wall is still raging amid the coronavirus pandemic.The administration, citing national security risks, has continued its attempts to seize land from landowners along the U.S.-Mexico border by using eminent domain, which is the power of the government to convert privately-owned land to federally-owned land in exchange for compensation to landowners.“Since the month of March, the government has filed 24 new condemnation cases to try to take private property from south Texas landowners,” Efren Olivares, legal director at Racial and Economic Justice Program for Texas Civil Rights Project, said recently on Yahoo Finance’s The Ticker (video above). “That’s more than they had filed in the previous eight months. So we’ve definitely seen a spike in efforts since the pandemic began.”Border Patrol Agent Anthony Garcia stands for a portrait along the U.S. border with Mexico where the new border wall construction will replace old fencing in Calexico, CA. (Photo by Carolyn Van Houten/The Washington Post via Getty Images)Oliveres added that the Texas Civil Rights Project is “alarmed... that the government has doubled down on its effort to continue building border walls despite the pandemic. In fact, we have clients in condemnation cases who live at the property where the government wants to build a border wall. And while they try to shelter at home, we have a client who’s 75 years old. And the government is trying to send out surveyors and construction crews to his home property as part of this effort to continue building.”‘One of the government’s most fearsome powers’There are currently 657 miles of “primary barriers” and approximately 50 miles of “secondary barriers” along the nearly nearly 2,000-mile U.S.-Mexico border, according to data provided to Yahoo Finance by U.S. Customers and Border Protection (CBP). The vast majority of those barriers was constructed prior to the start of Trump’s presidency.President Trump has stated that a border “wall” is necessary in order to protect Americans from illegal immigration. And during a rally back in February, he referred to the coronavirus as another justification for his wall, stating: “We must understand that border security is also health security.”Story continuesThere are currently 657 miles of primary barriers along the U.S.-Mexico border. (Graphic: David Foster/Yahoo Finance)The president declared a state of emergency in February 2019 to obtain funding for the “wall,” and that order was extended in February 2020 for another year with the goal of constructing 400 miles by the end of 2020. But according to the New York Times, “while Mr. Trump has built less than 200 of those miles, his administration has brought 78 lawsuits against landowners on the border, 30 of them this year.”But much of the land needed to complete the project is owned by American citizens. The government has been leveraging eminent domain to attempt obtaining private-owned land.Robert McNamara, a senior attorney at the Institute for Justice, described eminent domain as “one of the government’s most fearsome powers.”“It should be used rarely, carefully, and with great concern for the effect it has on the innocent property owners who are its victims,” McNamara told Yahoo Finance. “And unfortunately, many times none of those things are true.”US President Donald Trump tours the border wall between the United States and Mexico in Calexico, California, April 5, 2019. (Photo by SAUL LOEB/AFP/Getty Images)‘It’s preposterous’Once a landowner receives notice from the federal government, they typically have 21 days to respond.Olivares stressed that while it is “a long and complicated process,” landowners still have rights even if they receive eminent domain notifications. And because there are no Miranda rights in these proceedings, many are unaware that they can say no.“Some landowners might want to do that, and that’s their right,” he said. “But if they don't agree with it, they don’t have the obligation to sell their property.”View of the Mexico-US wall on June 18, 2019, in Tijuana, Baja California, Mexico. (Photo by AGUSTIN PAULLIER/AFP/Getty Images)If a landowner refuses to relinquish their property over to the federal government, the government then has to prove three things: that they have the authority to take the land, that it would be used for a public purpose, and that it would be paying for the property at fair market value. The value aspect, however, is where many landowners often feel undercut.“We’re seeing the government really undervaluing the property, insisting on paying only $100 for up to 18 months of access to these properties to do surveying and other preparatory work,” Olivares said. “It’s preposterous.”Norma Anzaldua stands with her family watching the Rio Grande river on her family's land on August 22, 2018 in Mission, Texas. (Photo by Carolyn Van Houten/The Washington Post via Getty Images)‘Condemned on Thanksgiving and Christmas’McNamara said he’s “not at all surprised” by the move to pursue land seizures amid the pandemic.“I have seen property owners condemned on Thanksgiving and Christmas,” he said. “When the government takes private property through eminent domain, it all too often acts with callous disregard for property owners and their individual circumstances, and I’ve unfortunately lost the ability to be surprised by that.”Olivares noted that not all of the land that the government is trying to build upon is right along the Rio Grande — some of it spans up to a mile north of the river.Leonel Calderon stands next to the Rio Grande river, which marks the boundary between the United States and Mexico, as it flows past the backyard of his home in Del Rio, Texas. (Photo by Joe Raedle/Getty Images)“In Stark County, in particular, the proposed path goes through significant residential areas,” Olivares asid. “We’re talking about dozens of landowners, including an orphanage, a nursing home in Stark County, who are at risk of being destroyed by this border wall.”What Olivares and his organization are trying to argue for their clients is that the federal government’s attempts to obtain their land are not a matter of urgency amid this pandemic, “that the landowners should be allowed to shelter at home, to not have to deal with dozens of construction workers on their property without wearing protective equipment, without wearing masks or gloves.”Olivares added that “the rulings on those motions are still pending.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:'A fight at every step': Trump's wall will have to battle the people who live thereEconomist: 'It’s pretty shameful' that more coronavirus stimulus hasn't happened yetImmigrants actually help Americans get better jobs, study findsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}