{"article": [{"url": "https://finance.yahoo.com/news/usps-mail-sorting-election-ballot-160058157.html", "published": 1597403300.0, "headline": "USPS appears to be retiring vital machines ahead of mail-in ballot surge", "body": "The United States Postal Service is reportedly retiring mail sorting machines. According to Postmaster general Louis DeJoy, the agency is in a “dire” financial situation, citing significant falls in mail volume, “a broken business model” and an inadequate management strategy as reasons for the “impending liquidity crisis.” Dejoy has been implementing changes since assuming the role in June, including organizational restructuring and a management hiring freeze, saying they’re meant to “strengthen the Postal Service.”But there appear to be moves that he might have left out. Vice is reporting that the USPS is also retiring mail sorting machines around the country “without any official explanation or reason given.” The office of the USPS Inspector General and its media representatives have yet to respond to Engadget’s requests for confirmation.According to internal documents obtained by Vice’s technology site Motherboard, close to 15 percent of the organization’s machines will be taken out of service. That’s a total of 502 machines around the country, and USPS workers Motherboard spoke with said the move would “slow their ability to sort mail.” An earlier report by CNN noted that the agency had begun removing these machines in June, and that it had initially intended to retire 671 machines instead of 502.Motherboard added that the USPS presentation it obtained described this as an “equipment reduction,” rather than “mov[ing] equipment around its network” as a spokesperson had earlier said.As part of the restructuring announced earlier this month, DeJoy said that mail processing operations will report to a newly created Logistics and Processing Operations organization that’s separate from area and district reporting structures. This change was made “to allow for improved focus and clear communication channels,” he wrote. The move has faced public criticism, with Rep. Gerry Connolly (D-VA) calling it “sabotage” on Twitter. Connolly chairs the House subcommittee for government operations, which oversees the postal service.Story continuesMore recently, DeJoy reportedly admitted in an internal memo that CNN obtained that the restructuring has led to “unintended consequences that impacted our overall service levels,” but reiterated that the changes were “necessary.”Before the pandemic, the USPS had been delivering an estimated 146 billion pieces of mail a year, including 6 billion packages. But with the election looming and people stuck at home, voting by mail has become a topic of national debate and is expected to lead to a surge in volume. President Trump has questioned the post office’s ability to manage the anticipated influx, saying “how can the post office be expected to handle [this]?” He added, “That’s a tremendous strain on the post office. The post office loses a fortune, it has been for many many years, for decades. So now on top of it it has this.” To be clear, the USPS is not a for-profit business. It’s an independent agency of the federal government’s executive branch that serves the public.DeJoy said in his opening remarks for the USPS board of governors “while I certainly have a good relationship with the President of the United States, the notion that I would ever make decisions concerning the Postal Service at the direction of the President, or anyone else in the Administration, is wholly off-base.” He added that “the Postal Service and I are fully committed to fulfilling our role in the electoral process.”“If public policy makers choose to utilize the mail as a part of their election system, we will do everything we can to deliver Election Mail in a timely manner consistent with our operational standards,” he wrote. DeJoy also asked for election officials and voters to “be mindful of the time that it takes for us to deliver ballots.”As the USPS continues to assess its operations to find ways to serve the public, removing mail sorting machines may lead to increased burdens on postal workers who might have to take on the previously automated task. It’s not clear if these machines might be replaced with newer models, or if the leftover machines are capable of picking up the slack. It’s clear the agency needs financial support to continue running without overworking its employees, especially with an election coming up."}]}