{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-what-could-happen-to-consumer-spending-if-the-extra-600-unemployment-insurance-isnt-extended-120051869.html", "published": 1595228900.0, "headline": "Coronavirus stimulus: What could happen to consumer spending if the extra $600 unemployment insurance isn't extended", "body": "It could easily be argued that Wall Street is completely out to lunch on the hardships of a Main Street dealing with the financial ramifications of being unemployed due to the COVID-19 pandemic.But those well-paid suits (or nowadays, Lululemon polo wearing Zoom goers) that have pushed equites ever so closer to pre-pandemic highs, may be in for a rude awakening real soon. If the extra $600 in unemployment insurance set to expire on July 31 for close to 30 million people isn’t extended, a key linchpin of the U.S. economy — consumer spending — could quickly go up in smoke in August, and take the red-hot stock market along for the ride down the toilet.“Our estimates suggest that expiration will result in large spending cuts, with potentially negative effects on both households and macroeconomic activity,” warned researchers at JPMorgan Chase & Co. led by Diana Farrell.Calling the potential spending cuts large may be a bit of an understatement by Farrell and her team. JPMorgan estimates that absent an extension of the funds — which have kept consumer spending afloat in recent months —unemployed households could slash spending by a whopping 29%.The researchers added for good measure,”Given that UI [unemployment insurance] currently represents around 15% of total wages, allowing the $600 supplement to expire at the end of July 2020 could cause substantial declines in aggregate demand and potentially negative effects on the macro-economy.”A decision on the unemployment ‘top up’ will probably come down to the wire in what is a bitterly divided government ahead of the November presidential election.Democrats in the House led by speaker Nancy Pelosi signed off on a $3 trillion COVID-19 relief bill several months ago. It would extend the $600 weekly payments originally passed in the Coronavirus Aid, Relief, and Economic Security (CARES) Act through January. The bill would also provide for another round of direct payments of up to $1,200 for individuals and $6,000 with families that have children. Senate Majority leader Mitch McConnell is reportedly eyeing a new $1 trillion stimulus, but it’s unclear right now what unemployment insurance would look like under the scheme.Story continuesPeople line up outside the Utah Department of workforce Services Monday, April 13, 2020, in Salt Lake City. Congress, the Trump administration and the Federal Reserve have mounted the largest financial intervention in history a full-scale drive that includes mandating sick leave for some, distributing $1,200 checks to individuals, allocating rescue aid to employers and expanding unemployment benefits to try to help America survive the crisis. Yet those measures are only temporary. And for millions of newly unemployed, they may not be enough. (AP Photo/Rick Bowmer)Democratic Governor Ned Lamont is a rare voice in the Democratic party suggesting on Yahoo Finance’s The First Trade it wouldn’t be wise to keep the full top up in effect. Instead, he thinks a return to work incentive is better — echoing similar calls by Republicans.“We still have a double-digit unemployment rate here [Connecticut]. And I would be generous when it comes to those companies that are still not open. Our event planners, for example, our bars. There we have got to be generous. But for those companies that are open, which is most of our economy, I want to do everything I can to encourage them to get back to work. We can get them back to work safely. So I was sort of more inclined towards giving people the incentive to get back to work and not doing a big $600 increase for everybody else who are still unemployed,” Lamont explained.Oxford chief U.S. economist Greg Daco says doing nothing on the unemployment check front would deal a hefty blow to the economy. Lawmakers failing to agree on any new round of fiscal stimulus would be disastrous, suggests Daco.“It’s essential we extend some of the benefits. Barring extension of some of the benefits, you’ll see a shortfall in demand that is going to be even more significant,” Daco said on The First Trade. “Another paradox in the recovery is actually the lower income families have rebounded more strongly in terms of spending on the back of that fiscal aid from Congress. If you suddenly have the expiring of the federal top up to unemployment benefits for about 30 million people at the same time as you’re not seeing any renewal in one checks or tax rebates that were sent to families across the country, you’ll see a lot of people facing difficulties in terms of their income shortfall and their spending ability.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.PBA Tour CEO: bowling is now a dynamic, sexy sportLL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}