{"article": [{"url": "https://finance.yahoo.com/news/over-half-of-older-workers-dont-have-jobs-that-can-be-done-remotely-191913674.html", "published": 1599661640.0, "headline": "‘Over half’ of older workers don’t have jobs that can be done remotely", "body": "As the U.S. struggles to re-open the economy, perhaps those on the tail-end of the return will be older workers. This is the group most at risk from COVID-19 and the most wary of coming back an office or another public setting.If they can avoid it that is.A recent study by the Center for Retirement Research at Boston College examined the differences in the ability to work from home by age.The report found that for many older Americans, “their ability to survive financially will depend on their ability to work from home.”The good news is that older workers have jobs that allow them to work from home at roughly the same rate as their younger counterparts.“There doesn’t seem to be large differences on average across age groups,” said Anqi Chen, one of the report’s authors, during an appearance on Yahoo Finance.But “the bad news is that over half of older workers don’t have jobs that can be done at home,” Chen said.The report, “Can Older Workers Work from Home?,” was co-authored with Alicia H. Munnell and found that 41% of Americans aged 25-34 work in jobs that can be performed remotely. That number rises gradually by age, and 47% of workers aged 65+ are in a similar position.The research was done by analyzing job types based on the potential of it being done from home. For example, jobs primarily done outside or don’t involve email were categorized as ones where working from home is not a possibility.A sign in Washington D.C as business across the country gradually reopen. (Yasin Ozturk/Anadolu Agency via Getty Images)Then who actually does those jobs was analyzed, and the authors found that 55% of older workers don’t have the option of working from home.‘Older workers might feel unsafe’As they return, “older workers might feel unsafe or be the last to go back to work,” said Chen, who is the assistant director of savings research at the center. Chen appeared as part of Yahoo Finance’s ongoing partnership with the Funding our Future campaign, a group of organizations advocating for increased retirement security for Americans.The researchers found that the ability to work from home was vastly different when measured by education or income. Across all ages, Americans with more education or higher earnings have many more options as they weigh whether or not to resume working from an office or another setting.Story continuesThis prospect – having to choose between maintaining your income or stepping back to preserve your health – could have the biggest impact on these older workers.Any loss in income would come during years of peaking earning power. Chen has also studied workers who lost their jobs during the Great Recession a decade ago and found that they were “never able to catch up.”To make matters more challenging, even before the recession, “we see that about half of older workers approaching retirement didn’t have enough saved up to maintain their standard of living” Chen said.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:American savings accounts are now ‘steadily declining’ as coronavirus effects lingerWhy a ‘vast majority’ of Americans are not getting the most out of Social SecurityReport lays out how the gender pay gap becomes a retirement wealth gapRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}