{"article": [{"url": "https://finance.yahoo.com/news/wisconsin-farmer-results-of-trade-deals-have-been-disappointing-132924348.html", "published": 1597739840.0, "headline": "Wisconsin farmer: Results of trade deals have 'been disappointing'", "body": "Wisconsin is a key state for the 2020 presidential race. President Trump narrowly won the state in 2016 and now Democrats are trying to take it back. The Democratic National Committee originally planned to host its convention in Milwaukee, before deciding to go virtual because of the COVID-19 pandemic.One of the most important industries to the state’s economy is dairy farming. The industry has struggled over the past several years and the COVID-19 pandemic has introduced a whole new set of challenges. In the beginning of the pandemic, dairy farmers were dumping milk as restaurant and school shutdowns killed food-service demand.Mitch Breunig owns Mystic Valley Dairy in Sauk City, Wisc. He told Yahoo Finance he currently milks about 400 cows and has 1,000 acres of cropland. He said things really started to change in April.“We actually sold some cows to some other farmers and then we actually, in the end, had to dump some milk out. That was pretty frustrating. In my lifetime, I don’t ever remember having to do that,” said Breunig.Breunig said the pandemic revealed that the U.S. supply chain was broken.“It just backed that whole system up. It took probably 60 days for that to sort of get back in balance and realign itself, but during that time, it was really hard. Having cows — it isn’t like we just flip a switch or turn them on and off,” said Breunig. “Instead of living day by day, we almost lived hour by hour waiting for the next shoe to drop.”CAMBRIDGE, WI - APRIL 25: Cows eat before being milked on Hinchley's Dairy Farm on April 25, 2017 near Cambridge, Wisconsin. (Photo by Scott Olson/Getty Images)‘We’ve done a lot to screw up our supply chain in the last couple years’The coronavirus is just the latest challenge Breunig and other farmers have faced in recent years. Breunig, who is also a corn and soybean farmer, said President Trump’s trade war with China and other trade negotiations have also disrupted his work and hit his business.“The trade deals have really been a problem to me because trade isn’t something you do overnight. It’s relationships that are built over time,” said Breunig. “When you start manipulating those markets, it really starts to, you know, sort of screw up the supply chain. We’ve done a lot to screw up our supply chain in the last couple years.”Story continuesBreunig hasn’t decided who he’ll vote for in the presidential race, but said trade and agriculture policy will be major factors as he makes his choice. President Trump touts the newly negotiated NAFTA, now the United States Mexico Canada Agreement (USMCA), and the China trade deal while campaigning — but Breunig told Yahoo Finance he was hoping for more.“We’ve signed some deals, but we haven’t really seen the fruits of those labors and, to me, it’s been disappointing,” said Breunig. “We have this fancy new deal, but the meat and potatoes that are inside the deal are really what’s important and we really haven’t seen those come forward yet.”Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Coronavirus response: Breaking down the debate over liability protectionsCoronavirus stimulus: What’s next for small business?White House, Senate GOP continue to debate stimulus plan as jobless claims riseTwitter hack highlights concerns about disinformation, election securityThe $600 boost in unemployment benefits expires soon. What comes next?Most Americans would not sue over COVID-19 exposure: poll"}]}