{"article": [{"url": "https://finance.yahoo.com/news/unprecented-case-what-a-us-tiktok-ban-would-look-like-180821377.html", "published": 1594732580.0, "headline": "'An unprecedented case': What a U.S. TikTok ban would look like", "body": "As U.S. lawmakers sound the alarm on short-form video app TikTok, President Donald Trump and Secretary of State Mike Pompeo have publicly said the government is “looking at potentially banning” the popular social media platform.But cybersecurity experts say an outright ban may be easier said than done, and any move to quash a consumer driven platform on national security grounds unrelated to terrorism would mark a first for the country.“This is not really a comparable situation to something like Huawei because Huawei is a [telecommunications company] that builds physical equipment, it has a lot of enterprise customers,” said Justin Sherman, a fellow with the Cyber Statecraft Initiative at the Atlantic Council. “TikTok is an app for sharing dance videos.”TikTok is owned by Chinese company ByteDance, the world’s most valuable startup. The app has been downloaded 165 million times in the U.S., accounting for 8.2% of its 2 billion downloads globally, according to data from Sensor Tower.But its growing success has been met with suspicion by lawmakers and corporations who say TikTok’s Chinese ownership poses national security risks because the company could be compelled to share its user data with the Chinese government.Last week, Wells Fargo (WFC) ordered its employees to remove the app from company phones, citing concerns over TikTok’s privacy and security controls and practices. That came after Amazon (AMZN) demanded its employees remove the app, though the company later said the email was sent by mistake.The Republican National Committee and Democratic National Committee have both discouraged party members and campaigns from downloading the app, while White House trade advisor Peter Navarro recently alleged data collected on the platform “goes right to servers in China, right to the Chinese military, the Chinese Communist Party, and the agencies that want to steal our intellectual property.”TikTok has repeatedly denied those allegations, saying that data of U.S. users are stored on servers in the United States, with a backup in Singapore.Story continuesFrom the perspective of teens flooding onto TikTok, the Chinese-owned online video app is a major new outlet for self-expression, one proudly home to the silly, the loud and the weird. To others, though, the service is an unnerving black box that could be sharing information with the Chinese government, facilitating espionage, or just promoting videos and songs some parents consider lewd. (AP Photo)“When we're talking about a ban, an important question to consider is what the endgame is [for the administration], what they're actually looking to do,” said Sherman. “That is not something that has been clearly articulated at this point.”‘There is nothing these companies can do’Sherman says an outright government ban requiring companies to filter traffic going across internet networks to block access to applications in the U.S., similar to China’s Great Firewall, is unlikely, given protections laid out in the First Amendment against censorship.Instead, the Committee on Foreign Investment in the United States or CFIUS is expected to play a key role in minimizing TikTok’s influence. The inter-agency committee used its expanded authority last year to launch a national security review of ByteDance’s $1 billion acquisition of Musical.ly, the western version of Asia’s TikTok at the time.The Chinese company has sought to address concerns about data collection and Chinese government influence in part, by hiring CEO Kevin Mayer from Disney (DIS) earlier this year. It is also reportedly looking to create a new management board and establish a global headquarters outside of China to show TikTok’s operations are separate from ByteDance.But Samm Sacks, senior fellow at Yale Law School’s Paul Tsai China Center, says anything short of a spinoff of TikTok is unlikely to assuage regulators’ concerns if history is any indication.“I have yet to see an example where that's happened, which makes me think that there is nothing that these companies can do if they are of Chinese national origin,” Sacks said. “I think the precedent that this sets is that the U.S. is willing to go down a path of cyber sovereignty in arguably similar ways as the Chinese government.”CFIUS has moved aggressively to halt Chinese investments into U.S. companies, under the Trump administration. In 2018, the committee blocked Ant Financial’s acquisition of Moneygram over data security concerns. Last year, CFIUS ordered Beijing Kunlun Tech Co to sell popular gay dating app Grindr over similar concerns.A general view of the Huawei UK headquarters on July 14, 2020 in Reading, England. The British government announced that UK telecommunications companies would be banned from buying Huawei 5G after 31 December this year. Existing Huawei 5G equipment will need to be removed from their networks by 2027. (Photo by Leon Neal/Getty Images)Still, Sherman says a forced divestment of Musical.ly would mark “an unprecedented” step, largely because of the nature of the app – a platform for short dance videos, mostly created by younger users.“In the Grindr case, I think the government was a little more clear and saying, okay, the concern here is that this is a dating app and therefore there's very intimate information about people's dating histories, people's sexual preferences,” Sherman said. “TikTok the app collects lots of data, but because it's heavily consumer driven, it is consumer targeted, this is an unprecedented sort of case here.”Raising the level of suspicionWashington’s pressure campaign against Chinese telecommunications giant Huawei also offers lessons in how the U.S. is likely to try to diminish the popularity of TikTok without an outright ban. While the Trump administration has never publicly presented evidence of a so-called backdoor by Huawei that ties the company to the Chinese government, White House officials have repeatedly said the company poses a national security threat, creating a cloud of suspicion.Earlier this year, Republican Senators Josh Hawley and Rick Scott introduced a bill, banning federal employees from using TikTok on government devices. That came months after the U.S. military banned all personnel from using the app on government-issued devices. With the recent string of companies and organizations following suit, Sacks said an outright ban may not be necessary in order for the Trump administration to achieve its intended goals.“[Company bans] are just as damaging because it raises the level of suspicion. It’s like, well if Amazon isn't comfortable with this, you know, maybe we shouldn't be either. Maybe they know something we don't know,” Sacks said. “Even if there is no executive order, even if CFIUS doesn't take further action. That's really damaging.”-Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaFormer Trump trade adviser: Covid-19 disruption and USMCA ‘provides an opportunity’ to bring supply chains back to North AmericaUniversities brace for a permanent wave of school closures as coronavirus pushes schools to brinkLarry Summers: Pandemic marks a ‘fairly profound structural change’ in economy"}]}