{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-regeneron-roche-team-up-for-antibody-treatment-who-warns-on-contact-tracing-145558180.html", "published": 1597831400.0, "headline": "Coronavirus update: Regeneron, Roche team up for antibody treatment; NYC hits lowest infection rate since crisis", "body": "Regeneron (REGN) and Roche (RHHBY) announced on Wednesday a partnership to ramp up production of the therapy as well as fund clinical trials, as the coronavirus pandemic have led to more collaboration between erstwhile rivals.In a statement Wednesday, Regeneron — which has been testing an antibody cocktail therapy — said in a statement on Wednesday that the collaboration “provides important scale and global expertise to bring REGN-COV2 to many more patients in the United States and around the globe,” according to CEO Leonard Schleifer.The two companies have been rivals in the vision loss and rheumatoid arthritis space, but unprecedented demand on the global pharmaceutical market exacerbated by the COVID-19 crisis has created strange bedfellows. Pharmaceutical collaborations for certain diseases has been a typical strategy, but the market for those are a fraction of the nearly 8 billion global population.Roche has been one of the leaders in COVID-19 diagnostics with its high-volume testing machines. Roche previously tested a drug, Actemra, to treat COVID-19 — but ended the clinical trials when the drug didn’t meet its primary endpoint in July.The increasingly urgent search for effective coronavirus treatments and a vaccine comes as the pandemic continues to strengthen its hold on the global economy. The case count globally has surpassed 22 million, with more than 781,000 dead. The U.S. — a worldwide epicenter of the outbreak — accounts for nearly 5.5 million cases and 171,000 dead.However, in the U.S. the virus’ surge has waned in the hard-hit Sun Belt states, even as concerns widen about a second wave in the fall amid an increasingly difficult path to reopening schools and universities. Meanwhile, New York City, a former COVID-19 hotspot, reported on Wednesday that its infection rate had tumbled to the lowest level since the crisis began — a milestone in the city’s hard-fought return to normal.Cases in the south are beginning to subside. (Graphic: David Foster/Yahoo Finance)WHO weighs on COVID responseStory continuesUnderfunding of public health has played a significant role in the poor response for many countries, as well as mixed community participation in needs like quarantining and social distancing, according to the World Health Organization.In a live session Wednesday, WHO Health Emergencies Program executive director Michael Ryan said contact tracing is a central pillar of controlling the virus and will be an important tool in the next six months— as schools reopen and society seeks to return to normal.Contact tracing, to isolate cases and ask people to quarantine, can break the chain of transmission.“If we do that tomorrow, we would drive infection rates right down,” Ryan said, adding that the weaknesses in the public health systems worldwide have been the biggest obstacle.These systems “are not good enough, are not invested in enough” and are ignored by governments, fueling the pandemic’s growth globally, he said.That, paired with a less than perfect participation rate from local communities is a “dangerous mix that allows the virus to jump back up.”Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}