{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-sets-new-record-in-cases-as-more-officials-back-masks-in-public-161101651.html", "published": 1593705980.0, "headline": "Coronavirus update: TX mandates face coverings amid surge; more GOP officials back masks", "body": "The coronavirus pandemic showed no signs of relenting on Thursday, with the U.S. marking a new record of over 50,000 cases in a day as beleaguered Sun Belt states struggled to contain soaring infections ahead of the July 4 holiday weekend.Texas, one of the most hard-hit states, relented in the face of withering criticism over its lax enforcement of face coverings in public. Amid a surge in coronavirus infections and hospitalizations, Gov. Greg Abbott issued a statewide order mandating public masking, and moved to limit outdoor gatherings of more than 10 people.Wearing a face covering in public is proven to be one of the most effective ways to slow the spread of #COVID19 while continuing to keep Texas businesses open. Texans should wear a face covering for the health of their families, friends, and for all fellow Texans. pic.twitter.com/5oWVfZMsph— Gov. Greg Abbott (@GovAbbott) July 2, 2020Global cases continue to rise, nearing 10.8 million and killing more than 516,000. While deaths in the U.S. have slowed, the rate of cases continues to pressure health systems in some of the hardest hit spots.COVID-19 resurgences in states like Texas, Arizona, Florida and California are pushing systems to the brink, and prompting some regions to hit the pause button on plans to reopen while reinstating some restrictions. On Thursday, the Sunshine State reported its worst-ever day of hospitalizations and new infections.McDonald’s (MCD) announced halting its reopening of locations for 21 days late Wednesday, following Apple’s (APPL) decision to re-close stores in some of the hardest hit states this week.“We have 50 states going in 50 different directions, and as a result we are seeing these record rises, and it’s very alarming and very disturbing,” Dr. Howard Koh, a public health professor at Harvard and former Assistant Secretary at the U.S. Department of Health (HHS), told Yahoo Finance Thursday.Story continuesKoh lamented the lack of a national plan, and a key reason the country has been unable to manage its outbreak. Mask-wearing is one of those national policies that needs to be adopted, he added.The case surge has led to an inflection point among Republican leaders and the Trump Administration, whom have been resistant to public mask wearing but are now becoming more supportive.Recently, Sen. Mitch McConnell advised there should be no stigma about masks, and Texas Gov. Greg Abbott reversed his stance to allow enforcement of mask-wearing. Treasury Sec. Steve Mnuchin defended President Donald Trump’s decision not to cover up in public, but said the rules were different for Americans.“We are encouraging Americans to wear a mask,” Mnuchin said on Thursday.Coronavirus cases are increasing in the Sun Belt region. (Graphic: David Foster/Yahoo Finance)In addition, reports of COVID-19 parties in southern states, similar to prior reports of similar occurrences in New York, are worrying health experts. The latest data has shown the newest U.S. cases are skewing younger, undermining the earlier dynamic of older patients being affected.With new restrictions back on the table, the health of the economy has taken center stage. June’s payrolls data released on Thursday showed nearly 5 million jobs created and the unemployment rate tumbling to 11% — a second consecutive month of record gains.However, those blowout numbers lagged the virus’ current resurgence, sparking new worries about the near future.The jobs recovery “faces fierce headwinds as COVID-19 cases rise and business uncertainty remains high,” said ZipRecruiter labor economist Julia Pollack.A recent CFO Pulse Survey from Deloitte showed a similarly immediate positive outlook, but concerns for the long-term. Top finance officers said they see staffing as a continued unknown, even though they are mostly optimistic about operating profitably as the U.S. continues to reopen.Still, they are not as optimistic about beating able to reach pre-crisis performance levels.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}