{"article": [{"url": "https://finance.yahoo.com/news/tesla-raise-5-billion-share-113004681.html", "published": 1598942300.0, "headline": "Tesla launches $5 billion capital raise, tapping in on share surge", "body": "By Akanksha Rana and Tina Bellon(Reuters) - Tesla Inc <TSLA.O> on Tuesday unveiled its biggest program of new share sales as a public company, seeking to cash in on soaring Wall Street interest in the electric carmaker to raise up to $5 billion that will ease future debt pressures.The move comes a day after a 5-for-1 stock split took effect, Tesla's first since its initial public offering in June 2010, and follows a nearly six-fold increase in the value of its shares this year.Tuesday's share sale comes as Tesla seeks to massively expand production of its existing vehicles and build new factories near Berlin, Germany and Austin, Texas. The company also plans to launch new lines of vehicles, including a semi-truck called the Tesla Semi and its futuristic Cybertruck.Tesla said it plans to use proceeds from the offering to strengthen its balance sheet and for general corporate purposes.Craig Irwin, a Roth Capital Partners analyst who has the equivalent of a 'hold' rating on the stock, on Tuesday said the capital raise did not come as a surprise.\"They will need cash for all the facilities they are building, and new growth initiatives,\" Irwin said.Ten major banks, including Goldman Sachs <GS.N>, Bank of America Securities <BAC.N>, Citigroup Global Markets <C.N> and Morgan Stanley <MS.N>, will conduct the sale, the electric carmaker said in a filing, giving no deadline for its completion. (https://bit.ly/3gNy91t)David Whiston, an analyst at Morningstar Research, said it remained to be seen how much money Tesla will ultimately raise. The company had $8.6 billion in cash and cash equivalents at the end of June.\"I can understand them taking advantage of the stock’s incredible run, but they don’t need the money right now,\" Whiston said.Tesla in February had announced plans to raise $2 billion in a stock offering.Tesla shares, which rose about 8% in early premarket trading, retreated to trade about 1% higher on the day after the news.Story continuesThe company's high-flying stock has risen another 70% since the split was announced on Aug. 11, and was trading at over $2,000 before the division on Friday.With a market capitalization now around $465 billion, it became the world's biggest car company by value in July and has propelled Chief Executive Officer Elon Musk's personal fortune past $100 billion.Musk has repeatedly assured investors over the past year that Tesla would not need to raise more money for costly expansion initiatives or to pay down debt.(Reporting by Akanksha Rana in Bengaluru, Tina Bellon in New York; Editing by Shinjini Ganguli and Steve Orlofsky)"}]}