{"article": [{"url": "https://finance.yahoo.com/news/gary-cohn-the-corporate-tax-rate-im-actually-ok-at-28-190220151.html", "published": 1593094220.0, "headline": "'The corporate tax rate — I’m actually OK at 28%': Gary Cohn", "body": "Gary Cohn, one of the key architects of President Trump’s historic 2017 tax reform, sent a wake-up call to Wall Street saying it would be okay to raise corporate taxes.“I'm actually okay at 28%. You know, the level we got to in our tax plan on the corporate side was actually a bit lower,” than was originally thought necessary, Cohn told Yahoo Finance’s On the Move.Cohn was director of the National Economic Council when he helped push the Tax Cuts and Jobs Act successfully through Congress. It cut personal income taxes and lowered the corporate tax rate to 21%, helping grease the wheels of a record expansion — until the coronavirus crisis brought the global economy crashing to a catastrophic halt.“I'll remind everyone though, that the corporate tax rate is not where we collect a lot of dollars. So there's a difference between going from 35 to 21, it was less than $100 billion a year,” Cohn said, adding that the tax on corporate income fails to generate a lot of money for the Federal Government.Gary Cohn, former director of the United States National Economic CouncilDems propose raising taxesSenators Elizabeth Warren (D-Mass.) and Bernie Sanders (D-VT) promised to raise taxes had either of them won the race to become the Democratic Party nominee and presidency. Presumptive nominee Joe Biden has proposed more modest tax increases but has yet to detail his plans.The Trump tax cuts remain unpopular with Americans, especially among those earning the least who may welcome increasing taxes on businesses. But, Cohn points out the cuts were also part of a larger economic strategy to stimulate the U.S. economy which had failed to grow at a rate stronger than 3% following the 2008 financial collapse.“And one of the reasons that we cut the corporate tax rate in the United States was to create jobs and redomicile business in the United States and make the United States competitive from a tax standpoint. If we go to 28%, that's probably the top end of the range that we can go to and be competitive with the rest of the world,” Cohn cautioned.Story continuesCohn says the Trump tax cuts worked according to plan. “If you look at data back in the beginning of the year, we had record low unemployment rate, we were creating jobs,” he said.Raising taxes too high, Cohn worries, could derail economic gains made prior to the coronavirus pandemic. He calls the current economic downturn an extraordinary event and advises from a tax standpoint everything must be on on the table.“We've spent multiple trillions of dollars in stimulus, we're gonna have to pay for it one way or another. You just can't keep spending money and not talk about the revenue,” Cohn said.Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.Delta CEO trying to avoid furloughs 'any way we possibly can' as airlines recoverJ&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesSouthwest warns that revenue could drop as much as 95% in MayDelta shores up liquidity as coronavirus pummels demand, warns of smaller airlineJetBlue Chairman: 'Everybody's working on survival' as coronavirus decimates airlinesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}