{"article": [{"url": "https://finance.yahoo.com/news/thousands-of-workers-walk-off-jobs-to-strike-for-black-lives-141151493.html", "published": 1595323160.0, "headline": "Thousands of workers walk off jobs to ‘strike for Black lives’", "body": "Thousands of union workers left their jobs on Monday in an effort to support initiatives to dismantle racism in a protest that was dubbed the Strike for Black Lives. The protest was organized by union groups including the Service Employees International Union (SEIU), the American Federation of Teachers, United Farm Workers, and the Fight for $15 and a Union, alongside social justice groups including the Movement for Black Lives, U.S. Youth Climate Strike Coalition, and the Center for Popular Democracy.The protest took place in over 25 major cities across the country, including New York, Los Angeles, Detroit, Seattle, and Milwaukee.Workers are targeting fast food companies like McDonald’s (MCD) to highlight the overrepresentation of minorities working in low-wage and front-line jobs during the coronavirus pandemic.“Companies like McDonald’s cannot on the one hand tweet that ‘Black Lives Matter’ and on the other pay us poverty wages and fail to provide sick days and adequate PPE,\" Angely Rodriguez Lambert, a McDonald's worker in Oakland, Calif., and leader in the Fight for $15 and a Union, said in a statement.“We're going on strike because McDonald's and other fast-food companies have failed to protect us in a pandemic that has ravaged Black and brown communities across the country,” she said.Amika Tendaji of Black Lives Matter Chicago speaks to people outside the McDonald's restaurant on 180 W. Adams St. in Chicago on Monday, July 20, 2020. The event is a part of a nationwide strike that organizers hoped would involve tens of thousands of people walking off the job. (AP Photo/Joshua Housing)In Detroit, fast food workers joined nursing home workers in a protest to highlight what the SEIU called “the industry’s failure to protect its largely Black workforce during the COVID-19 pandemic.”According to a statement from organizers, the strike is “demanding solutions from government and corporations that center communities of color and dismantle racist policies to make sure every family is healthy, safe, and secure, no matter their race, immigration status, job, or where they live.”Specifically, the group has four main demands, from “justice for Black communities, with an unequivocal declaration that Black Lives Matter,” to the opportunity for every worker to form a union.Story continuesIn New York, protesters were joined by Sen. Chuck Schumer (D-NY) to demand that Congress pass the second stimulus bill, the Heroes Act. Democrats passed the $3 trillion stimulus plan in May, but it has since languished in the Republican-majority Senate.Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:Famed Harlem restaurant Sylvia’s ‘paddling to keep afloat’ in coronavirus era‘This is getting out of control,’ says infectious disease expert about coronavirusA Harvard student's brainchild creates a pipeline for Black finance hopefulsIncreasing number of Republican states projected to see a spike in coronavirus deathsCompanies ‘haven’t done the work’ around diversity and inclusion: Bozoma Saint JohnRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}