{"article": [{"url": "https://finance.yahoo.com/news/softbank-returns-profit-record-losses-062047809.html", "published": 1597124900.0, "headline": "SoftBank Moves Into Asset Management After Return to Profits", "body": "(Bloomberg) -- Masayoshi Son is launching a new asset management venture to buy stocks in publicly traded companies, expanding SoftBank Group Corp.’s investment efforts as it rebounded from record losses to profitability.The Tokyo-based company reported net income of 1.26 trillion yen ($11.8 billion) for the three months ended June 30, following a loss of 1.44 trillion yen three months earlier. The profit was boosted by more than 1 trillion yen in one-time gains from the sale of Sprint Corp. and shares in T-Mobile US Inc.Son has shifted his attention to investments in recent years after building his fortune in the telecom sector. The asset management initiative expands on previous efforts like the $100 billion Vision Fund, which he set up three years ago to take stakes in private startups. The new arm has already purchased shares in Apple Inc., Amazon.com Inc. and Facebook Inc.“As an investment company, we need to explore various angles and scope. But our focus is still on companies driving the information revolution,” said Son. “This is the purpose of our company.”SoftBank will own 67% of the asset management firm, while Son personally will own the rest. The unit has about $555 million in capital, he said.It’s not clear why Son thinks SoftBank will have an edge in picking stocks, moving into a field crowded with heavyweights like Fidelity Investments and BlackRock Inc. The effort may increase the volatility of SoftBank earnings, which has grown with initiatives like the Vision Fund.“Investors will need to build greater risk into their expectations -- and Masa investing alongside is not a good look,” said Kirk Boodry, an analyst at Redex Research who writes for Smartkarma. “Launching a new investment vehicle targeted at public tech when Nasdaq is near all-time highs with bubble concerns seems like a good way to keep the share price discount to public value from closing.”The Japanese billionaire has pulled off a remarkably speedy comeback after the worst loss in his company’s 39-year history. A global rally in technology shares lifted the value of SoftBank’s stakes in publicly traded firms like Uber Technologies Inc. and improved the prospects for startups in its portfolio, from China’s Didi Chuxing to South Korea’s Coupang.Story continuesFar from striking a winning pose on Tuesday however, Son emphasized the importance of defense. He opened his presentation with slides depicting a 16th century battle between two Japanese lords. Oda Nobunaga, who would go on to unify Japan, won the engagement by sheltering his riflemen inside a wooden structure to protect them from samurai on horseback.“You can’t skimp on defense,” Son said. “We need to strengthen our defense. Defense is cash.”SoftBank also stopped reporting operating profit, long a key metric tracked by investors. It said the figure is “no longer meaningful” as the company becomes a “strategic investment holding company.”SoftBank is in the process of offloading 4.5 trillion yen in assets to fund share repurchases and to pay down debt. The company already raised 4.3 trillion yen through sales that include stakes in T-Mobile, Alibaba Group Holding Ltd. and its domestic telecom unit, completing about 95% of the program.The Vision Fund returned to profitability, following a 1.13 trillion yen loss in the previous quarter. SoftBank booked a 296.6 billion yen gain on Vision Fund investments in the quarter, including 111.4 billion yen in realized gains after selling a portion of its shares in four listed portfolio companies. About $1.4 billion of the unrealized gains came from holdings in public companies, with Uber responsible for about $700 million and Ping An Good Doctor, Vir Biotechnology Inc. and Guardant Health Inc. contributing about $200 million each.“It’s still too early to say that it will be all profits at the Vision Fund going forward,” Son said in a live-streamed briefing. “But things are turning around in a big way.”Several SoftBank-backed companies have also pulled off successful initial public offerings, raising the prospects for more in the future. Online home-insurance provider Lemonade Inc. more than doubled in the days after its initial public offering last month, while oncology drug developer Relay Therapeutics Inc. has surged about the same amount since its trading debut.Beike Zhaofang, a Chinese online property brokerage backed by SoftBank, said last week it is seeking to raise about $2 billion in a U.S. IPO. DoorDash Inc., a U.S. food delivery company backed by SoftBank, has filed paperwork for a public stock listing. Online insurance platform Policybazaar and e-commerce giant Coupang are preparing for offerings in 2021.Son confirmed that SoftBank is looking to sell or take public Arm Ltd., the chip design firm that he bought four years ago for $32 billion. He said he may accelerate plans for an Arm IPO from the original 2023 schedule or he may sell part or all of the firm. Bloomberg News reported earlier this month that Nvidia Corp. is in advanced talked to acquire Arm.Son put plans for a second Vision Fund on hold after missteps, including the meltdown at WeWork. Now, the fund’s upbeat results and a renewed investor appetite for risk could revive the idea, according to Atul Goyal, senior analyst at Jefferies Group.”Our strategy hasn’t changed,” Son said at the briefing. “We still plan on unicorn hunting with Vision Fund 2, 3 and so on.”(Updates with details from the briefing from ninth paragraph)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}