{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-30-2020-222440298.html", "published": 1601478740.0, "headline": "Stock market news live updates: Stocks end session higher, but post first monthly loss since March", "body": "Stocks rose Wednesday as investors weighed a raucous first presidential debate and continued to eye developments among congressional lawmakers for further fiscal stimulus.[Click here to read what’s moving markets heading into Thursday, Oct. 1]Market participants also eyed a key labor market report, which showed more private payrolls added back in September than expected, and considered a couple highly anticipated direct listings for tech companies Asana and Palantir.Wednesday’s rise did little to unwind entirely the wave of selling that overtook markets for much of September. The S&P 500 closed out September lower by 3.9% for its first monthly loss since March, and its worst September since 2011.Still, the blue-chip index ended the quarter higher by 8.7% for its best third-quarter since 2010. The Nasdaq’s 11% gain over the past three months was also its best third-quarter in a decade, with tech stocks rallying strongly over the summer before giving back some gains in September.Only the utilities sector clung to gains in the blue-chip index for September. The energy, communication services and information technology sectors were the laggards, as a month-long correction in previously high-flying tech names took out these sectors’ leadership positions.And with five weeks to go until Election Day, market pundits have warned of a potential for additional volatility conjured up by political uncertainty, compounded with ongoing concerns over the coronavirus pandemic and strain still facing the US economy.“I think markets are really nervous into those 36 days [before the election] and one of the things we have to think about is, when does nervousness price in the worst is yet to come? When do you think the worst is priced in? At least from June to August highs, if you give up two-thirds of those gains … that would be 3,224 [on the S&P 500],” Tom Lee, Fundstrat Global Advisors managing partner and head of research, told Yahoo Finance. “We think that that’s when you start to price in the worst, because you’ve given up two-thirds of the rally that you’ve had since June, and I think the world is better than it was since June.”Story continuesDespite the pullback, Lee added he does not believe stocks are ultimately in a “down trend.”“There’s still $4.3 trillion in cash on the sidelines. I don’t think in the history of any financial market in the world do you ever have a top when there’s 20% of the equity market sitting in cash,” he said. “Investor cash — that’s excluding the private equity cash, the record cash held by corporates too. So you’ve got tons of dry powder. People are bearish.”The election also comes against a dire economic backdrop, especially in the labor market, with major corporations recently unveiling new rounds of job cuts. Disney (DIS) Tuesday said it was slashing 28,000 jobs – one of the largest sums during the Covid-19 era – among its theme parks, cruise lines and retail businesses, as each unit struggles with demand far below pre-pandemic levels. ADP’s private payrolls report Wednesday morning topped estimates but showed fewer than 1 million jobs added back in September, as the pace of the economic recovery slows.To that end, congressional lawmakers and Trump administration negotiators have been attempting to come to a deal to pass in the near-term another virus relief bill. House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin on Tuesday discussed the $2.2 trillion Democratic stimulus proposal, according to a Bloomberg report, and are poised to hold further talks again on Wednesday. Still, most economists and policy pundits are bracing for no new stimulus legislation to pass before the general election.—4:03 p.m. ET: S&P 500 ends Wednesday's session higher, but falls 3.9% in Sept. for first monthly loss since MarchHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +27.43 (+0.82%) to 3,362.90Dow (^DJI): +329.70 (+1.20%) to 27,782.36Nasdaq (^IXIC): +82.26 (+0.74%) to 11,167.51Crude (CL=F): +$0.79 (+2.01%) to $40.08 a barrelGold (GC=F): -$10.80 (-0.57%) to $1,892.40 per ounce10-year Treasury (^TNX): +3.2 bps to yield 0.6770%—2:44 p.m. ET: Stocks extend gains, Dow rises 300+ pointsThe three major indices advanced strongly Wednesday afternoon, led in the S&P 500 by the health-care, consumer staples and information technology sectors.Here were the main moves in markets, as of 2:44 p.m. ET:S&P 500 (^GSPC): +31.46 points (+0.94%) to 3,366.93Dow (^DJI): +338.55 points (+1.23%) to 27,791.21Nasdaq (^IXIC): +93.91 points (+0.85%) to 11,181.82Crude (CL=F): +$0.85 (+2.16%) to $40.14 a barrelGold (GC=F): -$6.30 (-0.33%) to $1,896.20 per ounce10-year Treasury (^TNX): +3.1 bps to yield 0.676%—1:41 p.m. ET: Palantir opens for trading at $10 per share on the NYSEData software company Palantir (PLTR) opened for trading at $10 per share in its direct listing debut on the New York Stock Exchange. Shares were given a $7.25 reference price earlier, though this was used as a guide for investors during the price discovery process, and no shares actually traded hands at that level leading up to the opening trade.—12:35 p.m. ET: Asana opens for trading at $27 per share on the NYSEWorkplace management software company Asana (ASAN) opened for trading at $27 per share in its direct listing on Wednesday on the New York Stock Exchange, after having a reference price of $21 per share.The opening price gave the company a valuation of about $5.2 billion on a fully diluted basis, or around the valuation the stock had commanded on the secondary market.The company, while unprofitable, has posted a solid top-line increase in its most recently reported results. Asana grew revenues by 63% over last year to $99.7 million during the six months ended July 31. The company’s net loss, however, also widened over that period to $76.9 million from $30.5 million.—10:00 a.m. ET: Pending home sales soar to a record in AugustUS pending home sales surged by 8.8% in August, the National Association of Realtors (NAR) said Wednesday, far exceeding consensus estimates for a 3.1% monthly rise. The jump brought the level of the pending home sales index to 132.8, a record high.This marked the fourth straight monthly increase in pending home sales, with each of the four major US regions tracked by NAR posting steep gains.\"Tremendously low mortgage rates – below 3% – have again helped pending home sales climb in August,\" Lawrence Yun, NAR’s chief economist, said in a statement. \"Additionally, the Fed intends to hold short-term fed funds rates near 0% for the foreseeable future, which should in the absence of inflationary pressure keep mortgage rates low, and that will undoubtably aid homebuyers continuing to enter the marketplace.\"\"While I did very much expect the housing sector to be stable during the pandemic-induced economic shutdowns, I am pleasantly surprised to see the industry bounce back so strongly and so quickly,” Yun added.—9:50 a.m. ET: Stocks extend gains as Mnuchin strikes upbeat tone on stimulusThe three major indices rose further Wednesday morning, as Treasury Secretary Steven Mnuchin suggested lawmakers were serious about trying to come to an agreement and pass a virus relief bill in the near-term. Mnuchin, a key negotiator for the Trump administration in the stimulus talks, said at a conference presented by CNBC Wednesday morning that lawmakers were looking to give it “one more serious try.”The Dow rose about 250 points, or 0.9%, as of 9:50 a.m. ET. The S&P 500 rose 0.55% and the Nasdaq increased 0.43%.—9:31 a.m. ET: Stocks open higher, shaking off overnight declinesHere were the main moves in markets as of 9:32 a.m. ET:S&P 500 (^GSPC): +14.53 points (+0.44%) to 3,350.00Dow (^DJI): +165.73 points (+0.6%) to 27,618.39Nasdaq (^IXIC): +41.48 points (+0.36%) to 11,125.75Crude (CL=F): +$0.22 (+0.56%) to $39.51 a barrelGold (GC=F): -$4.00 (-0.21%) to $1,899.20 per ounce10-year Treasury (^TNX): +2.1 bps to yield 0.666%—8:17 a.m. ET: US employers added back 749,000 private payrolls in September, topping expectations: ADPUS private employers added back a greater than expected 749,000 payrolls in September, according to ADP’s closely watched monthly private jobs report.Consensus economists were looking for private job gains to total 649,000 for the month, according to Bloomberg data. August’s increase in payrolls was upwardly revised to 481,000, from the 428,000 previously reported.By ADP’s measure, domestic employers have on net added back payrolls for the past five consecutive months. However, the pace of increase has slowed considerably from the nearly 4.5 million the firm reported were created in June this year, when the first wave of business reopenings drove record surges in business rehiring.—7:27 a.m. ET Wednesday: Stock futures turn lower as overnight boost quickly fadesHere were the main moves in markets, as of 7:27 a.m. ET Wednesday morning:S&P 500 futures (ES=F): 3,317.50, down 16.25 points or 0.49%Dow futures (YM=F): 27,240.00, down 168 points or 0.61%Nasdaq futures (NQ=F): 11,272.00, down 65.75 points or 0.05%Crude (CL=F): -$0.35 (-0.89%) to $38.94 a barrelGold (GC=F): -$12.20 (-0.64%) to $1,891.00 per ounce10-year Treasury (^TNX): +0.3 bps to yield 0.648%—9:50 p.m. ET Tuesday: Futures push higher with first presidential debate under wayContracts on the three major indices were higher Tuesday evening as the first presidential debate between President Donald Trump and former Vice President Joe Biden was under way. In the first about 45 minutes of the debate, the discussion, moderated by Fox News anchor Chris Wallace, covered topics including the Supreme Court, and whether Trump’s pick Judge Amy Coney Barrett should be moved to be confirmed before the election, the handling of the Covid-19 pandemic, the candidates’ health-care plans and the labor market.Here’s where futures were trading, as of 9:50 p.m. ET:S&P 500 futures (ES=F): 3,344.75, up 11 points or 0.33%Dow futures (YM=F): 27,493.00, up 85 points or 0.31%Nasdaq futures (NQ=F): 11,368.5, up 30.75 points or 0.27%—6:11 p.m. ET Tuesday: Stock futures open lowerHere were the main moves in equity markets, as of 6:11 p.m. ET Tuesday:S&P 500 futures (ES=F): 3,332.00, down 1.75 points or 0.05%Dow futures (YM=F): 27,389.00, down 19 points or 0.07%Nasdaq futures (NQ=F): 11,332.00, down 5.75 points or 0.05%NEW YORK, NEW YORK - MARCH 18: Traders work on the floor of the New York Stock Exchange (NYSE) on March 18, 2020 in New York City. The Dow fell more than 1,200 points today as COVID-19 fears continue to roil world markets. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}