{"article": [{"url": "https://finance.yahoo.com/news/coroanvirus-covid-may-2020-retail-sales-171911895.html", "published": 1592293100.0, "headline": "Retail sales jump 17.7% in May amid COVID-19 pandemic", "body": "The May retail sales report peeled back the curtain on the health of the U.S. consumer amid one of the worst global pandemics in modern history. Consumer spending rebounded in May following April’s record plunge. Online sales maintained their strength and spending in the beaten down core components rebounded sharply during the month.Here were the main numbers compared to Bloomberg estimates:Headline retail sales: +17.7% vs. +8.4% expected, -14.7% in AprilRetail sales, excluding auto and gas: +12.4% vs. +5.1%, -14.4% in April(Yahoo Finance/David Foster)Within core components, consumer spending online rose 9% and 1.3% at grocery stores in May. Sales at department stores jumped 36.9%, furniture stores saw a 89.7% increase in spending, sporting goods sales rose 88.2%, sales at electronics stores surged 50.5% and spending at clothing retailers skyrocketed 188%.Meanwhile non-core components also saw a big bounce in activity in May. Auto and auto parts sales rose 44.1% and gas sales jumped 12.8%. Sales from food services was up 29.1% and spending on building materials increased 10.9%.“Activity started to recover more quickly than we – and others – had been anticipating. As a result, we now estimate that real consumption and overall GDP both contracted at a 30% annualised pace in the second quarter, rather than the 40% fall we previously expected,” Capital Economics wrote in an email Tuesday.“Nevertheless, there is still considerable uncertainty over whether spending will continue to recover at this pace over the coming months, particularly given the more recent upturn in new coronavirus cases in a number of states,” the firm cautioned.ING economist James Knightley agreed that while the strong retail sales bounce in May is news to cheer, the pace of the economic recovery remains to be seen.“Retail sales bounced back far more vigorously than expected in May ... This is much stronger than the weekly Redbook chain stores sales figures had hinted at, with today’s report clearly boosting hopes of a more V-shaped recovery,” Knightley wrote in a note Tuesday. “The outlook for the coming months remains uncertain and is going to be determined by how quickly the re-opening gathers momentum and how many of the laid-off workers return to their previous jobs.”Story continues—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.54 million Americans file for unemployment benefitsA theory for why the 'startling' jobs numbers conflict with the other gloomy dataPopeyes US sales are making a massive comebackFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}