{"article": [{"url": "https://finance.yahoo.com/news/u-coronavirus-cases-double-june-152110733.html", "published": 1593512960.0, "headline": "U.S. coronavirus cases double in June in at least 10 states", "body": "By Christine Chan and Lisa ShumakerJune 30 (Reuters) - Coronavirus cases more than doubled in at least 10 U.S. states, including Florida and Texas in the month of June, a Reuters analysis on Tuesday showed.Arizona recorded the biggest jump in cases for the month at 294%, followed by South Carolina and Arkansas. Cases also more than doubled in Alabama, Nevada, North Carolina, Oklahoma and Utah.Nationally cases rose by at least 43% and deaths increased by 20%. Several states have yet to report cases on Tuesday. (Open https://tmsnrt.rs/3dM9TLE in an external browser for a Reuters interactive)While much of the world appears over the worst of the pandemic, the United States and a few other countries are still seeing huge daily spikes.In the six months since the World Health Organization (WHO) first reported a cluster of mysterious pneumonia cases in Wuhan, China, more than 500,000 people have died from the coronavirus, including over 126,000 Americans.A strong national response, stringent lockdowns and mandatory mask wearing in public helped bring the pandemic under control in much of Asia and Europe. In the United States, wearing masks has become a divisive political issue and many states began reopening businesses without having met government health benchmarks for doing so safely.In the past week, 21 U.S. states reported rates of people testing positive for the virus above the 5% level that the WHO has flagged as concerning. Arizona has the highest rate in the country at 24%. (Open https://tmsnrt.rs/2WTOZDR in an external browser for a Reuters interactive)Cases increased by less than 10% in June in just four states - New York, Massachusetts, Connecticut and New Jersey.New York, once the epicenter of the U.S. epidemic, saw cases rise by about 6% in June - the lowest rate in the country - after strict lockdown and social distancing measures were put in place to help bring the disease under control.(Writing by Lisa Shumaker and Christine Chan; Editing by Bill Berkrot)"}]}