{"article": [{"url": "https://finance.yahoo.com/news/college-students-could-be-leaving-up-to-5000-in-coronavirus-stimulus-money-on-the-table-110808246.html", "published": 1592892980.0, "headline": "College students could be leaving up to $5,000 in coronavirus stimulus money on the table", "body": "Billions of dollars in stimulus set aside for America’s college students impacted by the coronavirus shutdown remains largely untapped.As much as $7 billion was earmarked specifically for students as part of the $2 trillion relief package passed by Congress earlier this year, but as of late-April only 1% had actually been distributed, partially because students may have been unaware they were eligible.Student loan deferment, forbearance, cancellation, and default: The full breakdownTo help remedy that issue, financial aid startup Frank recently teamed up with education giant Chegg to simplify the application process with a new online tool. According to Frank CEO Charlie Javice, their new portal was immediately hit with unprecedented demand.“In about 10 hours we got over 10,000 applications submitted,” she told Yahoo Finance’s YFi PM. “Students could be eligible for anywhere from $500 to up to $5,000 of aid.”The rules for distribution of the aid, referred to as the Higher Education Emergency Relief Fund, (HEERF) have been changing since the program was launched. A judge recently blocked prior Department of Education guidance that attempted to limit eligibility to Title-IV students who were on financial aid. Now, colleges have more leeway to distribute aid, and in some cases have been prioritizing students who had filed a FAFSA or federal student loan application though that is no longer necessary to receive aid.“There are different eligibility requirements,” Javice said, adding that in order to maximize direct aid students may need to provide proof of either job loss or reduced hours or eligible expenses tied to food or travel that stemmed from coronavirus hardships. Beyond that, much of the onus falls on colleges to inform students of the aid and distribute it to students in need — something colleges have failed in large part to do so far, Javice said.(Jordan Strauss/AP Images for University of California, Irvine)“All in all, our colleges and the Department of Education have really not helped students. They’ve really confused them,” she said. “If anything it’s probably as backward and worse than the [Small Business Administration’s Paycheck Protection Program] that we saw and experienced personally as a company.”Story continuesWhile the SBA’s program ran into funding issues and had to be refunded by Congress after businesses quickly applied for grants, it seems as though the Higher Education Relief Fund is suffering the opposite problem at least for the time being. As Javice explains, however, aid is similarly on a first-come-first-served-basis for eligible students.Notably, some schools have turned down aid that had been allocated as part of Coronavirus Aid, Relief, and Economic Security (CARES) Act. Harvard University, for example, announced it would not accept HEERF funds after the school came under fire following attacks by President Trump, who erroneously claimed the school had sought out relief funds. The school released a statement denying that it had applied for or sought any funding, but said it would proactively turn down the funding that the Department of Education had allocated. Some other larger institutions followed suit, with promises that students would still be made whole for any similar coronavirus-related expenses.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Most 2020 grads are desperate and applying for jobs that aren't the right fit: MonsterMayor of city famed for defunding police says abolishing police is not the solutionAnalyst who predicted market's 40% rally says these stocks will lead to all-time highsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}