{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-quarantines-made-americans-want-to-spend-on-home-improvement-134402003.html", "published": 1597135940.0, "headline": "Coronavirus quarantines made Americans want to spend on home improvement", "body": "As Americans sheltered in place this summer, home improvement retailers like Lowe’s Companies (LOW) and Sherwin-Williams (SHW) boasted lucrative summer sales.Americans splurged on home improvement during the pandemic because they “finally have the time” and are “adapting to a new lifestyle under COVID,” according to a survey of over 1,000 U.S. homeowners from July 7-9 by Porch, a Seattle-based home improvement website.“Who amongst us hasn’t sat around their home during this period and thought about how they could make it better? This is almost a universal experience at the moment,” HomeAdvisor and Angie’s List (ANGI) CEO Brandon Ridenour told Yahoo Finance last week.One California-based service that matches contractors with consumers, Houzz, saw a 58% increase in requests for home professionals in June 2020, compared to June 2019. And private companies have echoed reports of a growing market.“Who amongst us hasn’t sat around their home during this period and thought about how they could make it better?” said HomeAdvisor CEO Brandon Ridenour.“We saw strong demand in home improvement,” Mike Roman, chairman and CEO of Minnesota-based manufacturer 3M, recently told Yahoo Finance.The average homeowner spent $17,140 on improvements during the pandemic. More than three-quarters of U.S. homeowners reported doing at least one home improvement project since March, and 78% said they plan to start a home improvement project in the next 12 months, according to Porch.“We’ve now seen an incredible resurgence in demand… around home services [and] home improvement,” said Ridenour.Outdoor alterations drove home improvement sales this summer. Requests for pool and spa professionals were up three times (334%) compared to last year at this time, and demand for landscape contractors, deck and patio professionals doubled (178%) in June this year compared to the same month last year, according to Houzz.“Where we’ve really seen the surge in demand throughout the summer has been with outdoor services, people really making their backyards better,” said Ridenour.The Leading Indicator of Remodeling Activity. Graphic and data by Joint Center for Housing Studies of Harvard University.But the market could suffer as the weather cools and outdoor projects end. The $328 billion remodeling market is expected to only grow 1.5%-1.7% in the third quarter (compared to 5.6% growth in the third quarter last year), according to the Leading Indicator of Remodeling Activity (LIRA) by the Joint Center for Housing Studies of Harvard University.Story continuesBig kitchen remodels and other large indoor undertakings have been unpopular — and are not expected to carry the industry this fall — “as you would expect, given the nature of having somebody inside your home and people’s fear around that,” said Ridenour.Financial concerns and unemployment will also begin to depress home improvement activity, according to economists.“The remodeling market was buoyed through the early months of the pandemic as owners spent a considerable amount of time at home,” said Chris Herbert, managing director of the Joint Center for Housing Studies, in a press release. But “many homeowners will likely scale back plans for major renovations this year and next,” he said.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Rent growth hits lowest level in about 6 yearsReal estate is no longer Americans' favorite long-term investment: surveyHow office leasing fared during the coronavirus pandemic: exclusive data"}]}