{"article": [{"url": "https://finance.yahoo.com/news/trump-time-peter-navarro-says-coronavirus-vaccine-manufacture-will-be-swift-191354925.html", "published": 1591885280.0, "headline": "‘Trump time’: Peter Navarro says the manufacturing of a coronavirus vaccine will be swift", "body": "Entities around the world are locked in a race to develop a vaccine for the novel coronavirus. Organizations like the World Health Organization and companies like Moderna (MRNA) and Johnson & Johnson (JNJ) are vying to be the first to develop a way to curb the spread of COVID-19.It’s a process that is expected to require many months of testing and trials, but if successful (which is far from certain) the next hurdle will be to ensure that factories and labs can produce the millions of doses needed.As the National Defense Production Act policy coordinator, one of Peter Navarro’s jobs at the White House will be to make that happen.Peter Navarro with President Trump at the White House in March. (Pete Marovich-Pool/Getty Images)During a Yahoo Finance Presents interview with Andy Serwer, Navarro promised, “We won't be in a situation where we have too little.”He pointed to companies like Puritan Medical Products, which the President Trump and Navarro visited last week, and General Dynamics (GD) as examples of the industry mobilizing to ramp up production within a matter of weeks.Will a vaccine be shared?A key question is what happens if a virus is produced overseas, perhaps by the World Health Organization, with which the Trump administration recently cut ties.Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, discussed this question recently with Yahoo Finance. talked to Yahoo Finance on Tuesday about this question.“I don’t think we’re going to have a situation with one country or one organization that they are or are not going to share,” he said, based on his hope that enough organizations around the world will develop a vaccine with ‘favorable responses.’Navarro echoed Fauci’s point Thursday noting that the U.S. is already pushing forward on smaller manufacturing contracts so “if, in fact, one of the five or six vaccine developers comes up with what we need, we will have already been able to produce that.”Last week, as an example, the Department of Defense announced it had contracted with another frontrunner, Novavax (NVAX), to produce 10 million doses of its still unproven vaccine candidate for military use.Story continuesNavarro, who also serves as the director of the White House Office of Trade and Manufacturing Policy, added that “the worst thing that can happen if the vaccine doesn't work is we'll have too much capacity to produce it,” adding “that's where we're heading.”‘I don't even know how you work with China on a vaccine’China has its own vaccine effort underway. CanSino, which is is supported by the Chinese government, says it could have a vaccine approved by the fall, matching the most aggressive timelines of companies in the U.S.China is “treating this like a military operation,” a Biotech investor told Yahoo Finance of China’s effort.Earlier this week, Navarro published an op-ed saying he has no interest in working with China on a vaccine. China has been using the coronavirus crisis to “advance its strategic interests,” he said, and “lies through its teeth.”“I don't even know how you work with China on a vaccine,” he said.All over the World the CoronaVirus, a very bad “gift” from China, marches on. Not good!— Donald J. Trump (@realDonaldTrump) May 28, 2020‘Trump time’Fauci says that he expects some of the vaccine candidates in the U.S. to enter Phase 3 trials as soon as July, with the possibility of a viable vaccine by the end of the year.Navarro didn’t comment directly on timing but is confident that the manufacturing process would be swift, citing the recent turnaround of ventilators and medical swabs.Ever the showman like his boss, he said the U.S. would move “in what I call Trump time.”Ben Werschkul is a producer for Yahoo Finance in Washington, D.C.Read more:Fauci: Sped-up production on coronavirus vaccine risky and costly — but worth itTop Trump adviser: Jerome Powell should provide the data and then ‘keep his mouth shut’‘I actually would be tougher’: A Democrat's plan for changing the relationship with China after TrumpRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn,YouTube, and reddit."}]}