{"article": [{"url": "https://finance.yahoo.com/news/20-old-robinhood-app-user-004659180.html", "published": 1592510060.0, "headline": "20-Year-Old Robinhood App User Dies by Suicide After Seeing Large Negative Balance: Reports", "body": "A 20-year-old college student reportedly died by suicide after his account on a popular investing app allegedly showed him having a negative balance of more than $700,000 — a number a relative says may have misstated the number he actually owed.Alexander Kearns, 20, died on June 12 while staying at his parent’s home in Naperville, Illinois, according to Forbes and Kearns' obituary. He was a sophomore studying management at the University of Nebraska at Lincoln, according to CNBC.Kearns — who had recently expressed a keen interest in markets and the economy — was a user of the app Robinhood, which allows users to invest in stocks and offers commission-free trading, Bill Brewster, a cousin by marriage and analyst at Sullimar Capital, tells PEOPLE.The student had reportedly started experimenting more and more with the app amid the coronavirus pandemic, but last week was thrown for a loop after his account showed that he had $16,000, but also a negative $730,165 cash balance, Brewster says.In an alleged suicide note Brewster shared to Twitter, Kearns appeared exasperated by the situation, and angry with the Robinhood app for allowing someone who had “no clue” what he was doing to be assigned that much.“How was a 20 year old with no income able to get assigned almost a million dollar’s worth of leverage?” Kearns allegedly wrote. “The puts I bought/sold should have canceled out, too, but I also have no clue what I was doing now in hindsight. There was no intention to be assigned this much and take this much risk, and I only thought that I was risking the money that I actually owned. If you check the app, the margin investing option isn’t even ‘turned on’ for me. A painful lesson. F— Robinhood.”RELATED: A Third of Americans Show Signs of Clinical Anxiety or Depression in the Wake of the Coronavirus“All of us at Robinhood are deeply saddened to hear this terrible news and we reached out to share our condolences with the family over the weekend. We will not share any details regarding the account to respect privacy and confidentiality,\" a spokesperson for the company told PEOPLE in a statement.Story continuesBrewster says that while he has never used the Robinhood app, he received many responses to the suicide note on Twitter from users who suggested the problem may lie in confusion over the app's user interface — and that, upon connecting the dots based on the anecdotes he received, he believes the large balance may have actually represented “his temporary balance until the stocks underlying his assigned options actually settled into his account.”A source familiar with Robinhood's procedures tells PEOPLE that it is possible for the app to display positive portfolio value, but negative buying power and negative cash, which are not the same as debt. This will happen if a contract to purchase shares is called one day, but the corresponding option to sell shares to cover that isn't executed until the next trading day, and that the app notifies users of this by email or in-app notification. Despite the temporary negative display, the value of the account will still be accurately reflected in the portfolio value.“When he saw that $730,000 number as a negative, he thought that he had blown up his entire future,” Brewster added to Forbes.\"It doesn't make any sense to me. I would think that a tech company that is focused on financial transactions would have the sense to understand that they should display the number to people in a way they can decipher,\" he tells PEOPLE. \"The fact of the matter is this kid died over nothing. Nothing. He didn't owe a penny... This is finance, this is people's lives.\"RELATED VIDEO: Introducing PEOPLE's New Mental Health Initiative: Let’s Talk About ItIntroducing PEOPLE's New Mental Health Initiative: Let’s Talk About ItPEOPLE is launching a year-long initiative to encourage readers to have vital conversations about their mental healthA spokesperson for the platform – which reportedly has more than 10 million users and is popular among younger, first-time investors – told PEOPLE in a statement that Robinhood is \"committed to continuously improving our platform and are reviewing our options offering to determine if any changes may be appropriate.\"For now, Brewster says he hopes that Kearns' death will inspire changes within the app and its design.\"I would argue that if you are playing with people's finances, and it is true that you are driving people to use options... you have got a duty to make sure that people do not sign on and see a number like [$730,165],\" says Brewster. \"Because you know right now most of those people unsophisticated.\"The source tells PEOPLE that customers are required to complete an eligibility questionnaire before they can be approved to use options, and that the certification process is consistent with FINRA rules and regulations.According to his obituary, Kearns is survived by his parents, Daniel and Dorothy, and a sister named Sydney, whom Brewster tweeted are requesting their privacy at this time. His family asked that in lieu of flowers, donations be made in his name to the American Foundation for Suicide Prevention.If you or someone you know is considering suicide, please contact the National Suicide Prevention Lifeline at 1-800-273-TALK (8255), text \"STRENGTH\" to the Crisis Text Line at 741-741 or go to suicidepreventionlifeline.org."}]}