{"article": [{"url": "https://finance.yahoo.com/news/goya-foods-facing-consumer-boycotts-after-ceo-praises-trump-135951289.html", "published": 1594372040.0, "headline": "Goya Foods facing consumer boycotts after CEO praises Trump", "body": "President Trump on Thursday held a roundtable at the White House with Hispanic leaders, and signed an executive order on his Hispanic Prosperity Initiative, which assigns an advisory commission to improve education and business opportunities for Hispanic Americans.But following the event, Goya Foods finds itself in the social media crosshairs after Goya CEO Robert Unanue said at the roundtable, “Mr. President, what can I tell you? I’m so blessed to be here in the most prosperous country in the world, the greatest country in the world. And we’re so blessed to have you as our leader, as we continue to build this country and make it the most prosperous nation in the world.”Goya, privately-held and based in Jersey City, N.J., was founded in 1936 by Prudencio Unanue, who emigrated from Spain to Puerto Rico and on to New York. Robert Unanue (Prudencio’s grandson) is the third-generation Unanue to run Goya, which touts itself as the largest Hispanic-owned U.S. food company.After briefly relaying that origin story, Unanue also told Trump at the roundtable, “You are an incredible builder.”Goya Foods CEO and President Bob Unanue speaks prior to US President Donald Trump signing an Executive Order on the White House Hispanic Prosperity Initiative in the Rose Garden at the White House on July 9, 2020. (Photo by JIM WATSON/AFP via Getty Images)The comments did not land well with a number of prominent people on social media.Julian Castro, the former housing secretary from Texas, tweeted on Thursday night that Goya “has been a staple of so many Latino households for generations. Now their CEO, Bob Unanue, is praising a president who villainizes and maliciously attacks Latinos for political gain. Americans should think twice before buying their products. #Goyaway.”Rep. Alexandria Ocasio-Cortez, (D-NY), tweeted, “Oh look, it’s the sound of me Googling ‘how to make your own Adobo.’”Oh look, it’s the sound of me Googling “how to make your own Adobo” https://t.co/YOScAcyAnC— Alexandria Ocasio-Cortez (@AOC) July 10, 2020Chrissy Teigen, the model and bestselling cookbook author, tweeted about the comments, “F*******CK. A shame. Don’t care how good the beans taste though. Bye bye.” In followup tweets, she added, “The next step republicans will do (mark my words, they did this with my equinox tweets as well) is say you aren’t supporting the workers if you boycott. You ARE. They should never feel they have to work for someone who agrees Mexicans are ‘vile’ ‘rapists’ - F*CK this guy.”Story continues#BoycottGoya was the No. 2 trending topic on Twitter by Friday morning.The comments by Unanue and the resulting backlash are reminiscent of what happened to Under Armour founder Kevin Plank when he said on CNBC, one month into the Trump presidency, “To have such a pro-business president is something that’s a real asset for this country... There’s a lot that I respect there.” Under Armour sponsored athletes including Steph Curry and Dwayne “The Rock” Johnson posted on social media condemning Plank’s comments.The speed of the backlash to Unanue’s praise for Trump is also yet another sign of the current politically-charged cultural moment, in which consumer-facing brands that for years tried to remain apolitical are finding themselves in the crosshairs either because of one executive’s support of Trump (see: Equinox and Miami Dolphins owner Stephen Ross) or a brand’s sponsorship of a sports league or team (see: FedEx and the Washington Redskins).Goya declined to comment on the social media reaction to Unanue’s comments about Trump, but Unanue doubled down on his comments in an interview on “Fox & Friends” on Friday, saying: “You make a positive comment, all of a sudden that's not acceptable? If you're called by the President of the United States, you're going to say, ‘No, I’m sorry, I’m busy, no thank you?’ I didn’t say that to the Obamas and I didn’t say that to President Trump.\"Unanue called the backlash to his comments “suppression of speech.”At the White House event, Unanue also announced that Goya will donate 1 million cans of chickpeas and 1 million pounds of other food products to American food banks to help families hurt by the pandemic.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:From Aunt Jemima to Uncle Ben, a reckoning for racist brand names and logosRedskins name change push is a reminder: NFL sponsor pressure gets resultsReebok ends its CrossFit sponsorship over CrossFit CEO's tweet about George FloydNike is setting the tone for sports brands in its response to the George Floyd protestsDrew Brees on potential return of NFL kneeling protests: 'I will never agree with anybody disrespecting the flag'Every pro sports league’s current plan to return from coronavirus lockdown"}]}