{"article": [{"url": "https://finance.yahoo.com/news/fortnite-apple-google-epic-games-150013584.html", "published": 1598004500.0, "headline": "What the heck is happening with Apple, Google, and 'Fortnite'?: Tech Support", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's dilemma:“What the heck is going on between Apple, Google, and ‘Fortnite’?”Chances are if you or your kids have tried to download or update Epic Games’ incredibly-popular “Fortnite” on your Apple (AAPL) or Android (GOOG, GOOGL) smartphone or tablet, you’ve hit a wall.If you’ve got the game already, you might be able to play it, but you can’t update it. And if you’re looking to download it for the first time, it’s just not there.So what’s going on? Is “Fortnite” done for?Not exactly.What’s happening is a battle between some of the biggest names in tech and video games being played out (pun intended) in real time.Both the Apple App Store and Google Play Store require that developers pay fees for apps they sell to consumers through either store. It works the same way for items purchased in apps and games, otherwise known as in-app purchases.Epic Games took a shot at Apple by parodying its famous Macintosh commercial. (Image: Epic)So if you download “Fortnite,” which is free, through the App Store or Play Store, but buy the title’s in-game currency V-Bucks, 30% of your payment for those V-Bucks goes to Apple or Google.The same basic system applies to other digital app and games stores online with some variations to the cut the store owners take.So why’s that a problem?Epic Games doesn’t want to have to fork over the 30% fee to Apple or Google, because the company sees it as unfair. See, the only way you can install an app on an iPhone or iPad is to download it from the App Store. And if you use the App Store, you have to use Apple’s Payment system, which triggers that 30% commission.Story continuesGoogle lets users download apps from third-party app stores, but doing so can be rather risky if you don’t know the company behind the store you’re using. And if a developer works with the Play Store it too has to use Google’s payment system and pay the 30% commission.That said, users can still download the Epic Game app for Android via the web and install “Fortnite” without using the Google Play Store.Epic took issue with both systems and broke the guidelines for the App Store and Play Store by putting out an update that allowed “Fortnite” players to either pay for V-Bucks using Apple or Google’s payment systems or Epic’s own payment system with 20% discount.Epic contends that Apple purposely limits consumers’ ability to install apps on their devices outside of the App Store, and points to corporate apps that can be installed by businesses as proof that the tech giant makes an effort to block app installs outside of the App Store to ensure it gets that 30% commission.Epic gave customers the option of paying via its own service at a reduced price, or by using Apple or Google's payment platforms. The game was then banned from the companies' respective app stores. (Image: Epic)Apple, meanwhile, has said that app developers benefit from the company’s tools and assistance in building out their apps, and that the App Store itself is responsible for 1.9 million jobs in the U.S. and, in 2019, was responsible for facilitating more than $500 billion in commerce globally.The company also said it would welcome back “Fortnite” as long as Epic follows the same App Store rules that other developers follow.Epic also has the option to allow customers to purchase V-Bucks online and then access them through the “Fortnite” iOS app, similar to how Netflix allows you to subscribe online and access your account via the Netflix app.Doing so cuts out the App Store commission, but Epic says it’s not helpful for customers since the company can’t provide any means pointing to where users can purchase V-Bucks in the app itself.Spotify has had similar arguments with Apple over the same issue in the past.Is this the end for Epic?Not likely, the company is still able to make money through versions of “Fortnite” for the PlayStation, Xbox, Nintendo Switch, and PC, so the company still has plenty of revenue streams.Will Apple change its stance?That also seems unlikely. The App Store is an important source of revenue; it’s doubtful the company will change its stance. So unless the trio of antitrust investigations into the App Store force Apple to alter its policy, it’s going to stay the same.When can I download ‘Fortnite’ on my phone again?That all depends on how stubborn the companies will be. But for now, it looks like it’ll be some time.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.Apple faces an App Store reckoning amid gaming and tech uprisingApple is now worth $2 trillionSamsung’s Galaxy Buds Live offer premium earbud features without the priceMicrosoft’s Surface Duo dual-screen smartphone coming Sept. 10 for $1,399Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}