{"article": [{"url": "https://finance.yahoo.com/news/obamacare-coronavirus-pandemic-143957815.html", "published": 1595497640.0, "headline": "Obamacare 'glitch' magnified as Americans scramble for health care amid coronavirus pandemic", "body": "The passage of the Affordable Care Act (ACA), otherwise known as Obamacare, led to millions of Americans getting more access to health care coverage. And that health care access is more crucial than ever amid the coronavirus pandemic.But the Supreme Court ruled in 2012 that a key component of Obamacare, the expansion of Medicaid in every state, was “unduly coercive” and left it up to the states to decide if they wanted to adopt that expansion.Read more: How to file for Medicaid if you lose your jobThat left a “coverage gap” of an estimated 4.8 million people uninsured in the 13 states without expanded Medicaid. And those Americans are particularly vulnerable if they’ve lost their employer-sponsored health care during the coronavirus pandemic and have such a low income that they cannot afford other types of coverage.“That is a glitch we know well,” Jesse Cross-Call, a senior policy analyst at the Center on Budget and Policy Priorities, told Yahoo Finance. “They are in that position where for folks between the poverty line and 400% of the poverty line, they’re eligible for premium tax credits to purchase coverage. But folks with incomes below the poverty line, the vast majority of them are not eligible for Medicaid coverage or for premium tax credits.”Not all states adopted the Medicaid expansion. (Graphic: David Foster/Yahoo Finance)The coverage gapThe coverage gap mainly happens in states that haven’t expanded Medicaid, according to Robin Rudowitz, vice president for the Kaiser Family Foundation (KFF).“Where you have adults without dependent children, as well as parents above the current eligibility level for Medicaid and below poverty that have no other affordable options for coverage because they’re not eligible for subsidies in the marketplace and they’re not eligible for Medicaid,” she told Yahoo Finance.The federal poverty levels are used to determine if someone is eligible for Medicaid or premium tax credits through the health care marketplace.A look at the coverage gap. (Chart: KFF)If someone’s income is between 100% and 400% of the federal poverty level, they qualify for premium tax credits that lower their monthly premium. If their income is below 138% of the FPL and their state has adopted the Medicaid expansion, they qualify for Medicaid. And if their income is below 100% of the federal poverty level, they likely won’t qualify for either income-based Medicaid or premium tax credits.Story continuesThe premium tax credit is defined by the IRS as “a refundable tax credit designed to help eligible individuals and families with low or moderate income afford health insurance purchased through the health insurance marketplace.”A look at the coverage gap. (Chart: KFF)These credits, or subsidies, are determined by a sliding scale based on income. Those credits can be distributed in two ways — either through a tax credit when someone files their taxes for the year, or by having the marketplace pay the credit to the insurance company to lower the monthly premiums.“Originally, the Affordable Care Act had it so all the states would expand their Medicaid program,” Cross-Call reiterated. “Then it was the 2012 Supreme Court decision that made it a state option. And so, there was never supposed to be this patchwork where some states had expanded Medicaid and some states didn’t.”‘It is there for people who have the highest need’So why are there still states that have not adopted the Medicaid expansion? According to Michael Simpson, a research associate at the Urban Institute, it’s all about politics.“These are typically most of the states that are southern and conservative, and typically the argument against expansion is that this is more government intrusion into people’s lives and more costs that the state shouldn't be bearing for people who should be getting health insurance some other way,” Simpson told Yahoo Finance.Registered nurse Paige Duracher checks Jacqueline Parker's vitals in the cardiac step-down area of the University of Mississippi Medical Center in Jackson. (REUTERS/Jonathan Bachman)All 13 remaining non-expansion states voted for Donald Trump in the 2016 presidential election.“In general, the sentiment is: Why don’t people go get a job that gives them health insurance?” Simpson said. “Sometimes ignoring the fact that most people are already working and that doesn’t mean that your job necessarily provides health insurance or that you have it available to you.”However, many voters have taken the issue to the ballot box. Oklahoma voters recently approved a ballot measure to expand Medicaid. Missouri will also be voting on the issue in their upcoming state elections.“Medicaid really is there for some of the most vulnerable populations in our country,” Cross-Call said. “We’ve been talking about Medicaid expansion, but it’s also there for millions of kids and pregnant women, people with disabilities, seniors with low incomes. It is there for people who have the highest need.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Millions of American workers lost health insurance as coronavirus pandemic worsenedA 'flaw' in Obamacare is costing some Americans thousands of dollars per yearPresident Trump doubles down on dismantling Obamacare amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}