{"article": [{"url": "https://finance.yahoo.com/news/sp-case-shiller-home-price-july-2020-130217714.html", "published": 1601367020.0, "headline": "Home price growth in the US accelerates", "body": "U.S. home price growth accelerated in July as the nation continued to grapple with the coronavirus pandemic.Standard & Poor’s said Tuesday that its S&P CoreLogic Case-Shiller national home price index posted a 4.8% annual gain in July, up from 4.3% in June. The 20-City Composite posted a 3.9% annual gain, up from 3.5% the previous month — beating analysts’ expectations of 3.6%, according to Bloomberg. The results for the first time in five months, now include Wayne County, Mich.“The National Composite Index gained 4.8% relative to its level a year ago,” said Craig J. Lazzara, managing director and global head of index investment strategy at S&P Dow Jones Indices, in a press statement. “The strength of the housing market was consistent nationally – all 19 cities for which we have July data rose, with 16 of them outpacing their June gains.”For the 14th straight month, Phoenix led the 20-City Composite posting a 9.2% annual gain for July. Seattle and Charlotte followed with 7% and 6% annual gains, respectively.“A sharp deceleration [in home prices] appears unlikely despite the ongoing pandemic,” Nomura wrote in a recent note. “Recent data such as y-o-y growth in volumes of mortgage loan applications have remained elevated as reopening continued. Moreover, an insufficient supply of previously-owned homes for sale appears to have dampened the negative demand shock.”Credit: GettyIn July, the median price for an existing home topped $300,000 for the first time ever, according to the National Association of Realtors. And last month, median price continued to climb reaching $310,600, up 11.4% from the same month last year.“The recent boost in the number of people listing their homes for sale still falls far short of demand from folks looking to buy homes right now,\" said Redfin chief economist Daryl Fairweather, in a press statement. “Unfortunately, that means little relief for homebuyers, especially those seeking an affordable home. I don't expect the double-digit home-price increases to subside before early 2021.”Story continuesThe lack of lumber as a result of the California wildfires has also been impacting the price of homes. “Over recent months, we have seen lumber prices surge dramatically,” NAR Chief economist Lawrence Yun said in a press statement. “This has already led to an increase in the cost of multifamily housing and an even higher increase for single-family homes.”The housing market is booming and has been a “shining star” in the economy. Existing and new home sales surged to 14-year highs in August as record low mortgage rates and a shortage of inventory fuel activity. Total housing inventory at the end of August was 1.49 million, down 18.6% from the same time last year and and there’s just a three-month supply at the current pace of sales, according to the NAR.Even homebuilders are feeling really good about the market, homebuilder confidence reached an all-time high in September, according to the NAHB/Wells Fargo Housing Market Index (HMI). Some homebuilders are even holding back sales to preserve supply for 2021.“The U.S. housing market has been caught up in a ‘perfect storm’ during the COVID-19 pandemic,” said CoreLogic Deputy Chief Economist Selma Hepp in a press statement. “The substantial swing in demand is driven by a need for indoor and outdoor space met by record low mortgage rates and a wave of millennials who were on the verge of buying — all competing for fewer and fewer homes on the market.”Amanda Fung is an editor at Yahoo Finance.Read more:US home price growth unchanged in June; July new home sales highest since 2006Coronavirus finally slows down US home price growth5 reasons why the housing market has recovered from COVID-19: BofALuxury real estate may be back as the housing market recovers but bewareHome price growth accelerated at the start of 2020 before coronavirus slammed the USEconomist on housing: 'You can't buy what's not for sale'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance news"}]}