{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-21-2020-113949181.html", "published": 1600701680.0, "headline": "Stock market news live updates: Stocks sink as September gloom continues", "body": "Stocks sank Monday but pared losses in the last stretch of trading during the regular session. Still, the three major indices extended the past few weeks’ worth of declines, as concerns over stagnating coronavirus case improvement stoked fears of more lockdowns, and as political uncertainty nudged investors away from risk assets.[Click here to read what’s moving markets heading into Tuesday, September 22]The Dow fell more than 500 points, or 1.8%, adding to a cumulative more than 350-point slide in the index from Thursday to Friday last week. The Dow was off by as many as 942 points, or 3.4%, at its worst point during the session.The S&P 500 dropped 1.2% and at session lows was down about 9.8% from its recent closing high from Sept. 2 to come within striking distance of falling into a correction, or a drop of at least 10% from a recent high. The index logged a four-session losing streak, or its longest since February.“So far, the market has over-shot our expectations for a 4% to 6% haircut from recent highs on near-term extended valuations, as well as economic and Covid-19 risks. That said, the declines through last Friday are not all that surprising,” John Stoltzfus, chief investment strategist for Oppenheimer Asset Management, said in a note Monday. “It is that September — traditionally but not always — can be tough month for stocks. The S&P 500 had delivered a massive rally rising 60% from the lows on March 23 through September 2. Markets tend to overshoot to the upside as well as to the downside.”Other analysts pointed to developments – and in some cases, a lack of progress – in Washington, D.C. as contributors to the pullback.“The root causes of the recent drawdown in US large caps are [first], recent weakness in real-time economic indicators, [second] the lack of movement on a fiscal stimulus package that could offset #1 and [third] the Fed’s lackluster forecasts in its Wednesday release of the Summary of Economic Projections,” Nicholas Colas, Co-founder of DataTrek Research, wrote in a note Monday morning.Story continuesShares of major bank stocks including JPMorgan Chase (JPM), HSBC (HSBC) and Deutsche Bank (DB) slid following a report that they and other financial institutions for decades facilitated fund transactions used for allegedly criminal activities, and failed to report suspicious activity.Meanwhile, heavily weighted big tech stocks Apple (AAPL), Amazon (AMZN) and Microsoft (MSFT) reversed earlier losses to trade slightly higher. Oracle (ORCL) shares rose more than 1.5% after the company announced Friday that it was chosen to become TikTok’s “secure cloud technology provider,” and in doing so take a 12.5% stake in the social media service.So-called “reopening stocks” renewed their declines, as fears over coronavirus cases both in the US and abroad led to jitters over a second wave of the pandemic and more business re-closures. Covid-related deaths in the US neared 200,000, and new cases have risen significantly in Arkansas, Colorado, Idaho, Montana, Nebraska and North Dakota over the past week. Former FDA Commissioner Scott Gottlieb told CBS’s “Face the Nation” on Sunday that he thinks “we have at least one more cycle with this virus heading into the fall and winter.” In Europe, countries including France and Germany have been grappling with marches higher in daily cases, and the World Health Organization warned last week of a “very serious situation unfolding” in Europe over the virus.Cruise stock Royal Caribbean Group (RCL) fell more than 7%, and airlines including United Airlines (UAL), Southwest (LUV) and Delta (DAL) also came under pressure.—4:03 p.m. ET: Stocks fall, S&P 500 posts longest losing streak since FebruaryHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -38.42 (-1.16%) to 3,281.05Dow (^DJI): -510.18 (-1.84%) to 27,147.24Nasdaq (^IXIC): -14.48 (-0.13%) to 10,778.80Crude (CL=F): -$1.61 (-3.92%) to $39.50 a barrelGold (GC=F): -$46.40 (-2.36%) to $1,915.70 per ounce10-year Treasury (^TNX): -2.3 bps to yield 0.6710%—3:13 p.m. ET: Stocks hold lower but come off session lowsThe three major indices remained sharply lower, but came off their worst points of the session Monday afternoon, with less than an hour remaining in the trading day. Earlier in the session, the Dow was off by as many as 3.4%, or 942 points, before paring losses.American Express, Dow Inc. and Caterpillar led declines in the Dow, with each of these stocks lower by more than 5%. The materials, energy and industrials sectors continued to lag in the S&P 500.—12:04 p.m. ET: US household net worth rose by a record $7.6 trillion in Q2 after stimulus boostThe Federal Reserve said Monday that US household net worth surged by a record $7.6 trillion in the second quarter this year, following an influx of coronavirus-related government stimulus payments and run-up in the stock market. The increase brought household wealth to $118.9 trillion by the end of quarter ended in June.—10:26 a.m. ET: Stocks extend declines, Dow drops 700+ pointsThe three major indices extended declines Monday morning, adding to the last three weeks’ worth of drops. The Dow sank further, dropping more than 750 points, or 2.7%, to well below 27,000.The S&P 500 also slid more than 2%, with the energy, materials and industrials sectors leading the declines.Overseas equities also slumped. Germany’s DAX (^GDAXI) index slid 4.5% for its biggest drop since March.—9:33 a.m. ET: Stocks open sharply lower, Dow sheds 400+ pointsHere were the main moves in markets as of 9:33 a.m. ET:S&P 500 (^GSPC): -51.81 points (-1.56%) to 3,267.66Dow (^DJI): -502.67 points (-1.82%) to 27,154.75Nasdaq (^IXIC): -153.07 points (-1.37%) to 10,638.94Crude (CL=F): -$0.97 (-2.36%) to $40.14 a barrelGold (GC=F): -$42.70 (-2.18%) to $1,919.40 per ounce10-year Treasury (^TNX): -3.3 bps to yield 0.661%—7:45 a.m. ET: Nikola shares plummet after founder Trevor Milton resigns as executive chairmanShares of newly public electric truck-maker Nikola (NKLA) slumped in early trading after its executive chairman and founder Trevor Milton unexpectedly announced his resignation, after a short-seller released a scathing report alleging Milton had for years deceived investors about the company.“I asked the Board of Directors to let me step aside from my roles as Executive Chairman and a member of Nikola Board of Directors. The focus should be on the Company and its world-changing mission, not me. I intend to defend myself against false allegations leveled against me by outside detractors,” Milton wrote in a statement posted on his Twitter account at 2:21 a.m. ET Monday morning.Nikola’s stock, which had risen to as high as $50.05 per share after announcing a partnership with General Motors (GM) earlier this month, saw shares slide to below $24 per share in early trading. GM shares were off 3.8% in pre-market trading.I will be cheering from the sidelines with you. Your greatest fan. pic.twitter.com/IaYfZedYhK— Trevor Milton (@nikolatrevor) September 21, 2020—7:36 a.m. ET Monday: Stock futures sell off in early tradingHere were the main moves in equity markets, as of 7:36 a.m. ET Monday:S&P 500 futures (ES=F): 3,257.25, down 59 points or 1.78%Dow futures (YM=F): 27,041.00, down 561 points or 2.03%Nasdaq futures (NQ=F): 10,729.00, down 198 points, or 1.81%Crude (CL=F): $40.32 per barrel, -$0.79 (-1.92%)Gold (GC=F): $1,936.90, -$25.20 (-1.28%)10-year Treasury (^TNX): yielding 0.663%, or down 3.1 bpsNEW YORK, NEW YORK - MARCH 20: Traders work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}