{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-18-2020-221829052.html", "published": 1592493200.0, "headline": "Stock market news live updates: Stocks trade choppily as investors eye virus cases, jobless claims", "body": "Stocks closed mixed Thursday, as market participants nervously eyed rising coronavirus cases in major regions throughout the country. Meanwhile, a report showed new weekly unemployment insurance claims were worse than expected last week, with the level down just slightly from the prior week.[Click here to read what’s moving markets heading into Friday, June 19]The S&P 500 and Dow snapped a three-day winning streak by market close Wednesday, with concerns over a jump in coronavirus cases in some major states contributing to declines. However, big tech shares continued to climb and added to their run of outperformance, despite increasing scrutiny from regulators in the U.S. and Europe.Travel and leisure stocks including airlines and cruise lines were mixed with increases in new coronavirus cases threatening a smooth reopening process. Cruise giant Carnival reported on Thursday a $4.4 billion second-quarter loss, and said it is unable to predict when it would be able to return to operations.California on Thursday reported its largest one-day increase in Covid-19 cases yet, with these rising by 4,084. Similarly, new coronavirus cases in Florida rose by a one-day record for the state at more than 3,200, and Texas’s hospitalization rate rose. Other states including Arizona, Nevada and Oregon also saw spikes in cases, as regions struggled to keep infection rates down with reopenings under way.Meanwhile, New York City – one of the regions that had been under stay in place orders the longest – signaled it would press ahead with the next phase of its reopening process next week, allowing for outdoor dining and salons to open their doors as the statewide daily infection and death rates fell below 1%.With virtually every U.S. state now in the process of allowing businesses to reopen, new economic data has begun to reflect a recovery from April’s lows. Wednesday’s batch of economic data showed a strong rebound in the housing market, with mortgage applications for home purchases at a more than 11-year high as of last week. New-home building and building permits for the month of May also rose over April, albeit at a slower pace than consensus economists had expected.Story continues—4:04 p.m. ET: Dow posts back-to-back days of declines, while Nasdaq climbs for fifth straight sessionHere were the main moves in markets as of 4:04 p.m. ET:S&P 500 (^GSPC): +1.86 (+0.06%) to 3,115.35Dow (^DJI): -39.51 (-0.15%) to 26,080.10Nasdaq (^IXIC): +32.52 (+0.33%) to 9,943.05Crude (CL=F): +$0.88 (+2.32%) to $38.84 a barrelGold (GC=F): -$3.20 (-0.18%) to $1,732.40 per ounce10-year Treasury (^TNX): -3.9 bps to yield 0.6940%—1:00 p.m. ET: S&P 500, Dow dip again, Nasdaq holds higherThe S&P 500 and Dow fell in afternoon trading Thursday, as a choppy session rolled on. The Nasdaq Composite held higher, as Tesla, Apple, Amazon and Microsoft rose.—11:00 a.m. ET: Stocks turn positive, shaking off earlier lossesThe three major indices erased earlier losses and rose slightly Thursday. Advances in shares of Boeing and Chevron led gains in the Dow. In the S&P 500, the Energy sector outperformed, and the financials and materials sectors also led gains.Each of the three major indices rose by less than half a percent.—9:31 a.m. ET: Stocks open lower as coronavirus case increases spark concernHere were the main moves in markets, as of 9:31 a.m. ET:S&P 500 (^GSPC): -18.12 points (-0.58%) to 3,095.37Dow (^DJI): -213.54 points (-0.82%) to 25,906.07Nasdaq (^IXIC): -4.58 points (-0.05%) to 9,904.90Crude (CL=F): -$0.02 (-0.02%) to $37.94 a barrelGold (GC=F): -$5.80 (-0.33%) to $1,729.80 per ounce10-year Treasury (^TNX): -3.4 bps to yield 0.699%—8:30 a.m. ET: Initial jobless claims totaled 1.508 million last week, coming in higher than expectedWeekly unemployment insurance claims ticked down to 1.508 million for the week ended June 13, the Labor Department said Thursday. This was above consensus expectations for claims to fall to 1.29 million for the week, according to Bloomberg data. The prior week’s new claims were upwardly revised to 1.566 million.Continuing unemployment claims also fell by a less than expected margin for the week ended June 6. Those ticked down to 20.544 million, from the downwardly revised 20.606 million from the prior week. Consensus economists expected continuing claims to dip below the 20 million mark.—7:24 a.m. ET Thursday: Stock futures extend lossesHere were the main moves in markets, as of 7:24 a.m. ET:S&P 500 futures (ES=F): 3,106.5, down 11.5 points or 0.37%Dow futures (YM=F): 26,052.00, down 98 points, or 0.37%Nasdaq futures (NQ=F): 9,987.75, down 6.75 points, or 0.07%Crude (CL=F): +$0.32 (+0.84%) to $38.28 a barrelGold (GC=F): -$4.90 (-0.28%) to $1,730.70 per ounce10-year Treasury (^TNX): -2.1 bps to yield 0.712%—6:05 p.m. ET Wednesday: Stock futures open lowerHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:05 p.m. ET:S&P 500 futures (ES=F): 3,113.75, down 4.25 points or 0.14%Dow futures (YM=F): 26,118.00, down 32 points, or 0.12%Nasdaq futures (NQ=F): 9,990.75, down 3.75 points, or 0.04%Traders wearing masks arrive before the opening bell at the New York Stock Exchange (NYSE) on May 26, 2020 on Wall Street in New York City. - Global stock markets climbed Monday, buoyed by the prospect of further easing of coronavirus lockdowns despite sharp increases in case rates in some countries such as Brazil. Over the weekend, US President Donald Trump imposed travel limits on Brazil, now the second worst affected country after the United States, reminding markets that while the coronavirus outlook is better, the crisis is far from over. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}