{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-largest-us-education-union-is-demanding-that-the-federal-government-act-184424500.html", "published": 1597153940.0, "headline": "Coronavirus stimulus: Largest U.S. education union is 'demanding that the federal government act'", "body": "As U.S. schools reopen amid the coronavirus pandemic the largest educators union in America is calling for Congress to approve critically-needed funding as soon as possible.“What school district put in their budget, the funds for plexiglass?… [or] funds to have masks and change them on a regular basis?” asked Becky Pringle, the newly-elected president of the National Education Association (NEA). “No one did that.”Pringle added that the NEA is “demanding that the federal government act, and act now — we are tired of waiting for [Mitch] McConnell to do his job, we’re tired of waiting for leadership from the White House, saying we need to make sure our students are safe. … That’s not fair, it is not right, and… this country can do better.”Cheryl Nicholas, Principal of Layer Elementary School, explains to the media the social distancing and other health precautions that have been initiated at the school a week before classes begin for the year during the COVID-19 pandemic on August 10, 2020 in Winter Springs, Florida. (PHOTO: Paul Hennessy/NurPhoto via Getty Images)Negotiations related to a new coronavirus stimulus bill are stalled after President Trump attempted to address the situation with an executive order and three memos signed on Saturday.“I got an email last night — I get one almost every day — with a teacher,” Pringle said, “and you can feel the tears in their eyes when they’re writing it to you… all saying, I cannot put my students in this place, where they are unsafe, and I feel unsafe as well.”‘Throwing our schools and our families into chaos’The CARES Act, passed in March, allocated schools around $17 billion through three main funds: The Elementary and Secondary School Emergency Relief Fund (ESSER), the Governors Emergency Education Relief Fund, and the Education Stabilization Fund Discretionary Grants.As of August 8, less than 4% of the ESSER funds have been drawn down by states, the Education Department informed Yahoo Finance. And 17% of the governors’ fund, in comparison, has been sent to districts.Part reason for why so much money is being unspent is bureaucracy. Education Week noted that the aid isn’t sent as a check to districts’ bank accounts but instead routed through states, which slows down the process.The U.S. has now passed 5 million coronavirus cases. (Graphic: David Foster/Yahoo Finance)Another issue slowing down the process is a dispute over whether private schools are getting funds meant for public schools.Story continuesIn Indiana, the Office of Management and Budget Director Cris Johnston told WBOI about a third possible reason for the bottleneck: “We didn’t want to make a big transfer before the end of our fiscal year and then have differing guidance come out from the federal government that said, ‘No, you can’t use the money this way.’”Money aside, Pringle noted that many schools have yet to form a coherent strategy to handle re-openings and mitigate transmission of the infectious coronavirus.“If they do not have infection rates in their communities that are low,” Pringle said, “and have been low for two weeks… if they don’t have the materials and masks and PPE… if they cannot socially distance or sanitize or ensure they have a plan when, not if, but when a student gets sick or an educator gets sick… [reopenings are] throwing our schools and our families into chaos.”Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:'Impossible to stay quiet': Doctor sounds alarm on messy school reopenings amid the coronavirus pandemic'Just trying to get through the year': K-12 students discuss returning to school amid the coronavirus pandemic'The urgency is real': CDC and Education Department join White House push to open schools amid coronavirus pandemicCoronavirus: 'We cannot' put kids in schools 'if we have a very high level of transmission,' doctor warnsThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}