{"article": [{"url": "https://finance.yahoo.com/news/us-consumer-continues-to-impress-morning-brief-100609408.html", "published": 1600838060.0, "headline": "No stimulus, no problem for U.S. consumers so far: Morning Brief", "body": "Wednesday, September 23, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThe U.S. consumer continues to impressLast week, The Morning Brief wrote that September appeared set to be a slower month for the U.S. economy.A temporary bump from Labor Day spending, a slowdown in the labor market, a lack of fresh stimulus, and a rough patch in financial markets were all viewed as negatives by Wall Street economists when assessing the overall state of the U.S. economy five months into this recovery.But a closer look at the health of consumer balance sheets and spending habits tells a more positive story. Particularly as we wrap up a second month without additional stimulus while little progress is being made on helping workers get through this downturn.“Extracting a signal from high-frequency economic data has been challenging in the last few weeks, as many indicators strengthened around the Labor Day holiday only to weaken shortly afterwards,” said Jesse Edgerton, an economist at JPMorgan. “As the dust from these possible seasonal distortions clears, however, our Chase card spending tracker appears to be on track for a solid monthly increase.”Edgerton notes according to the bank’s 30 million cards, spending in September looks set to fall 5.8% from last year, a market improvement from August’s 10% decline from a year earlier and the best year-over-year comparison we’ve seen for any month since February.Consumer spending kicked into a higher gear in September even backing out a positive bump from Labor Day, according to data from JP Morgan. (Source: JPMorgan Chase)“There continues to be little sign of a ‘cliff’ in card spending after the expiration of the extra $600 per week in unemployment insurance benefits at the end of July,” Edgerton adds.And work on consumer balance sheets from the team over at Morgan Stanley might help explain why.Economists at Morgan Stanley led by Ellen Zentner flagged the resilience of consumers in a note published Monday, noting that increased savings built up from the CARES Act offers consumers a sizable buffer as we head into the fourth quarter and early 2021.Story continues“Household spending has indeed been resilient, not only supported by a faster than expected return of jobs, but a buildup of savings supported by earlier fiscal support,” Morgan Stanley writes. “How much consumers choose to draw down savings is important when thinking about incoming smoothing in the face of fading fiscal support...We estimate from April through July the U.S. consumer built up a cumulative $12.5 trillion (annualized) in excess savings.”The U.S. consumer is sitting on trillions in excess savings, offering spending a buffer in the absence of further stimulus. (Source: Morgan Stanley)The firm adds that while most of these savings do sit with higher-income and higher net worth households, “savings have accrued to lower income households as well.”In its note, Morgan Stanley cites a paper authored by Natalie Cox, Peter Ganong, Pascal Noel, Joseph Vavra, Arlene Wong, Diana Farrell, and Fiona Grieg presented at a Brookings Institution conference earlier this year which found that the increase in the savings rate was driven by the lowest quartile of earners.And with lower earners increasing their spending fastest as the economy re-opened during the summer, a deeper savings buffer for this cohort of consumers could bolster economic growth. Recall that consumer spending accounts for just under 70% of GDP growth.“[Lower-income] quartiles are actually driving more of the aggregate increase in balances than would be expected from their initial balance shares, so liquid wealth inequality decreases between February and May,” the authors wrote. “This provides a concrete sense in which the poor are disproportionately increasing savings relative to the rich during this pandemic. While this shift in the wealth distribution towards low-income households many not seem huge, it implies an almost two percentage point decline in the share of liquid wealth held by the richest quartile occurring over a matter of weeks.”And so it is the buffer provided to the lowest earners through the CARES Act that it seems the economy is now working through. And this dynamic suggests, at least so far, that the economy should be able to continue its recovery even in the absence of additional fiscal stimulus.“The willingness of consumers to draw upon these savings in the coming months is yet to be known,” Morgan Stanley writes, “but we believe it will provide an important stop-gap to the loss of government transfers.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7:00 a.m. ET: MBA Mortgage Applications, week ended September 18 (-2.5% during prior week)9:00 a.m. ET: FHFA House Price Index, July month on month (0.5% expected, 0.9% in June)9:45 a.m. ET: Markit US manufacturing PMI, September preliminary (53.5 expected, 53.1 in August);9:45 a.m. ET: Markit US services PMI, September preliminary (54.5 expected, 55.0 in August)9:45 a.m. ET: Markit US Composite PMI, September preliminary (54.6 in August)Earnings7:00 a.m. ET: General Mills (GIS) is expected to report adjusted earnings of 88 cents per share on revenue of $4.2 billion8:30 a.m. ET: Cintas (CTAS) is expected to report adjusted earnings of $2.13 per share on revenue of $1.7 billionTop NewsEuropean stocks follow Wall Street higher ahead of PMI data [Yahoo Finance UK]Tesla’s value dropped by $50B after Musk said cheaper battery is three years away [Yahoo Finance UK]Walmart ramps up hiring spree ahead of holidays, set to hire 20,000 seasonal workers [Yahoo Finance]Nike swings back to a quarterly profit as digital sales surge 82% [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSCongress debates leaning on Fed or PPP for small business aidThe one thing that matters to stocks more than politicsDavid Chang on sexism in the restaurant industry: ‘I’ve been a bully’—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}