{"article": [{"url": "https://finance.yahoo.com/news/3-key-themes-from-apples-big-event-213920384.html", "published": 1592844440.0, "headline": "3 key themes from Apple's big event", "body": "This year’s edition of Apple’s WWDC, in which the hotly anticipated rumors are revealed, was muted by the coronavirus crisis, which made it impossible to have its customarily boisterous live audience to cheer.Rumors of new devices and models did not materialize into announcements, but three overarching themes emerged amid a smattering of software announcements.The first theme: A unified and flexible Apple experience.Apple (AAPL) CEO Tim Cook left the job of emcee largely to his software chief Craig Federighi, who revealed updates of iOS, macOS, WatchOS, and AirPod OS. Many of these seemed incremental, but design-wise Apple said it considered the new macOS Big Sur the most revolutionary update since Mac OS X emerged in 2001 – 19 years ago.While Apple didn’t blow anyone away, the updates across all operating systems highlighted flexibility, customization, and a flow of ideas between the devices. For example, phones took design cues from desktops, which in turn incorporated many of iOS’s design cues.What this means is that Apple is becoming increasingly seamless and closer to its goal of having a customer freely flow among devices. With the updates in the wearable technology of the watch and AirPod, this seems increasingly high on the company’s list of priorities.Some new features from iOS for iPad. (Apple)The second theme: the new processor and changes in the future.Cook came back to the stage at the end of the conference to announce that Apple will begin using its own ARM-based processors instead of Intel’s chips in its MacBook Pro and iMac computers running Apple’s new Big Sur operating system. Intel has been the brains of the Mac for a decade.The new chips from “Apple Silicon” mean that Apple will have more control over its chips but also that its computers will also have the same internal architecture as its phones and iPads.This transition will take two years to complete, and in the meantime Apple will continue to support Intel-based machines and software.Apple clearly sees this as a long-term benefit and pointed to power consumption versus processing power as a potential benefit. Still, with a two-year transition time — more Intel-based Macs are in the pipeline according to Cook — a lot remains to be seen.Story continuesThe third theme: Privacy as marketing.Apple has used privacy as marketing for some time now, looking to paint its image as starkly different than Big Data companies like Facebook or Google. Throughout the announcements across all platforms, Apple made a concerted effort to show its priorities to keeping less data, asking for less data, and most importantly — preventing other companies from having unfettered access and control over your data.Apple’s unveiled new tools to tell its users what companies are tracking them, how apps might use their data, and even added location services changes to allow for a much wider radius, so an app can know approximately where you are without giving it the exact pinpoint location.People and their information have been hacked, breached, and leaked so many times that many see apathy to privacy now from a criminal perspective, and they may see information sharing as a non-negotiable concession to using goodies from the tech industry. But Apple’s commitment to privacy has the potential to change that, at least somewhat.For now, the rest of the rumors regarding hardware and new devices weren’t realized, but clearly, the company is still very busy. Potentially, this could mean a wave of new things to come for the next time.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Apple: new macOS 'biggest design upgrade since introduction of Mac OS X'Apple: use our stuff over Google’s if you care about privacyApple is ditching Intel to build its own processors for its MacBook and iMac systemsApple Watch finally gets sleep tracking, plus hand-washing featureApple debuts iOS 14, hitting iPhones later this yearFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"}]}