{"article": [{"url": "https://finance.yahoo.com/news/trump-administration-backs-off-on-new-visa-guidelines-that-affect-international-students-200422459.html", "published": 1594739540.0, "headline": "Trump administration reverses new visa guidelines for international students", "body": "The Trump administration walked back a sudden policy change that would have potentially blocked hundreds of thousands of international students from remaining in or returning to the U.S. while pressuring universities to resume in-person classes in the fall amid the ongoing coronavirus pandemic.Following a week-long fight by Harvard University, the Massachusetts Institute of Technology (MIT), and more than a dozen state attorneys general, the government agreed on Tuesday to “rescind” a policy that would have affected international students who are attending institutions that have opted to go completely remote over the fall.“For the hundreds of thousands of international students across this country who enrich our institutions and strengthen our communities — we celebrate this victory with you,” Massachusetts Attorney General Maura Healey said in a statement. “This ICE rule was senseless and illegal the minute it came out, and the Trump Administration knew it didn’t have a chance. This is why we take action in court, why we stand up for our values, and why we will remain vigilant in protecting our international students from these harmful disruptions.”On July 6, new U.S. Immigration and Customs Enforcement (ICE) guidelines were announced that detailed that F1 and M1 international students in the U.S. who were taking their courses completely online didn’t have a reason to be in the U.S. Schools had until Wednesday to adjust their plans.President Donald J. Trump participates in a roundtable with stakeholders positively impacted by law enforcement in the East Room the White House on Monday, July 13, 2020 in Washington, DC. (Photo by Jabin Botsford/The Washington Post via Getty Images)On Tuesday, the judge in the case brought by schools announced that the “status quo” of March 9, announced at the beginning of the coronavirus crisis, will remain, as both sides had reached a resolution on the issue. Consequently, international students can stay in the U.S. for the duration of their study in the fall, even if their school is entirely online.“There were rumors that the policy would be scaled back to new internationals only, so I’m elated that it was rescinded completely,” Jenny Lee, a professor of higher education at University of Arizona who studies higher education, told Yahoo Finance.Story continuesHowever, Lee wasn’t convinced that it was all over just yet: “[T]his was just one among a long string of many anti-immigrant policies over the recent years. So we should anticipate this as not being the end, but a pause before another attack on international higher education soon.Brendan Cantwell, associate professor at Michigan State University who studies politics in higher education, told Yahoo Finance that the flip-flopping by ICE could have larger implications.“This shows that the government didn’t understand how higher education works, had no plan to implement and enforce the guidance, and had no choice but to back down in the face of overwhelming opposition from the higher education sector,” he explained. “It is welcome news and a great relief to universities and international students alike ... [but] we should not think of this as having been cost-free.”Ultimately, according to Cantwell, the administration’s “chaotic approach to policymaking and the unwelcoming message the guidance sent could cause lasting damage between U.S. higher education and students around the world.”Attorney General Maura Healey and international students rally at the State House against ICE visa rules on July 13, 2020 in Boston. (PHOTO: Pat Greenhouse/The Boston Globe via Getty Images)ICE puts out new guidance, walks it back a week laterThe lawsuit closed a short but tense and disorderly chapter on students and immigration.Last week, ICE announced that if a student is taking an entirely online course, they could not remain in the U.S. unless they transfer to a school with in-person instruction “to remain in lawful status.” If they failed to do so, “they may face immigration consequences, including the initiation of removal proceedings.”And if the school was offering a hybrid model of both in-person and online education, they’d be allowed to take more than one class online. However, the school needed to certify their status to the government.Only 8% of colleges have thus far planned for a completely online fall semester and 2.1% are “waiting to decide,” according to data compiled by the Chronicle of Higher Education.Lawmakers panned the guidance from ICE, labeling it as xenophobic and misguided.“Essentially, what is is is about, is two things: One, the Trump administration has always been about anti-foreigner, anti-immigrant policies and this is another example of that,” Healey, the Massachusetts attorney general, told Yahoo Finance’s On The Move. “Second, this is about Donald Trump trying to find a way to show that come September, everything is okay in this country and that we beat coronavirus.”This decision, “against all the weight of the evidence of any public health expert” and “any second grader” puts the higher education at risk, she asserted.The state had filed a lawsuit, along with 17 others, and the District of Columbia, calling the policy “senseless and cruel.” California had filed a few days prior, as well as Harvard and the Massachusetts Institute of Technology, which was resolved today.ICE is rescinding its rule that threatens to deport international students, a day after we filed our lawsuit.This is why we sue. The rule was illegal and the Trump Administration knew they didn’t have a chance.They may try this again. We will be ready.— Maura Healey (@MassAGO) July 14, 2020‘That’s actually illegal’On Monday, ICE had responded to Harvard lawsuit — which has dozens of amicus briefs from U.S. tech companies to other universities — in court filings, arguing that the possibility of national security risks that students staying in the U.S. could pose.Furthermore, the policy was apparently being enforced as students attempting to re-enter the country were being turned back.One South Korean student who attends DePaul University in Chicago was reportedly stopped at the airport in San Francisco because he had not signed up for classes.“I am aware of one instance in Massachusetts where a student was stopped at the airport,” Healey said. “We want all of those instances reported to us … this is an administration that is ignoring the rule of law.”And by offering “no data in support, no sound policy reason or explanation … [is] under the Administrative Procedures Act, and under U.S. law — that’s actually illegal,” she asserted. “You can’t make rules that way.”Nurses from Haiti attend a training program at Regis College. (PHOTO: Suzanne Kreiter/The Boston Globe via Getty Images)‘Not a good thing for the long-term health of the U.S. economy’ Even though the issue has now been resolved, higher ed experts also worry that this incident, on top of other visa restrictions including with H1-Bs and travel bans, could hurt U.S. higher education’s attractiveness to international students, and hence the economy.“Look, higher ed is getting hit from all sides right now,” Jeff Brown, dean of the Gies College at the University of Illinois, told Yahoo Finance in a previous interview. “We’re coming off several decades of decline in public support for higher education, and now we have an economic recession, which is affecting donors’ ability and willingness … To be honest, [the July 6 visa guidelines are] just not helpful — it’s like, let’s hit ‘em while they’re down.”Colleges worry that prospective students from abroad may opt to go to Australia or the UK instead of paying in full in the U.S.Ultimately, Brown added, immigration restrictions on students such as the proposed one by ICE is “not a good thing for higher ed [and] more importantly, it’s not a good thing for the long-term health of the U.S. economy.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:‘Higher ed is getting hit from all sides right now’: Colleges reel from new immigration announcement‘Not on our watch' says California, suing Trump admin over new coronavirus student visa rulesHarvard and MIT sue ICE over new visa guidelines for international studentsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}