{"article": [{"url": "https://finance.yahoo.com/news/increasing-number-of-republican-states-projected-to-see-a-spike-in-coronavirus-deaths-204507232.html", "published": 1593186800.0, "headline": "Increasing number of Republican states projected to see a spike in coronavirus deaths", "body": "According to a Yahoo Finance analysis of the University of Washington Institute for Health Metrics and Evaluation’s (IHME) coronavirus death toll model, there is an increasing number of Republican states that are projected to have the highest increases in COVID-19-related deaths.A previous analysis of the death toll projections for all 50 states and Washington, D.C. found that eight of the top 10 states with the greatest estimated death increases had Republican governors. That figure has now been increased to nine.What’s more, the analysis found that Republicans govern roughly 70% of the states in the country with the highest increases in death projections.Yahoo Finance looked at the current death toll projections through October 1, and compared them with the number of recorded deaths in May. For consistency, the analysis uses IHME figures for all data.The top state on the list is Texas, leaping up from its previous spot of No. 17 on the list. Its projected coronavirus death count represents a 1,204% increase from the number of deaths recorded by May 8.According to IHME, Texas is anticipated to have roughly 13,800 deaths by the fall. As of June 20, IHME recorded 2,147 deaths — more than double May’s figure, which stood at 1,053. The figure also represents a large increase on the original projected death increase. In May, it was anticipated Texas would see a 144% increase in its deaths by August.The current projections are a 738% increase over the original prediction.Texas was one of the first states to reopen. But facing alarming increases in the daily case count of coronavirus, Texas Governor Greg Abbott has decided to place a “pause” on reopening, and has banned elective surgeries in an attempt to quell the virus in the Lone Star state.Next on the list is Arizona, which is anticipated to have a 1,120% increase in deaths by October from the reported deaths in the state in May. Arizona previously occupied the top spot on the list.Story continuesArizona Governor Doug Ducey has stopped short of returning the state to a lockdown, but has asked citizens to stay home.Also on the list of top 10 states that are anticipated to see the highest increase of deaths over their recorded May levels are Arkansas, Florida, Utah, Oregon, New Hampshire, South Dakota, Nebraska, and Missouri.Oregon is the only state in the top 10 with Democratic leadership.There are over 2.4 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)All states that cracked the top 10 have more than a 500% increase in the anticipated number of deaths when compared to the recorded death toll in May. For some states, the latest death toll projection increases also represent large upticks over the previously recorded rates.In other words, thanks to re-openings, IHME’s death toll projections were revised sharply upwards for some states over others. Oregon’s new projections are an 800% increase over the previous predictions. Arkansas’ new death toll figures represent a 600% increase.However, states with Democratic leadership are faring much better than their Republican counterparts, Yahoo Finance found. Seven of the 10 states at the bottom have Democratic governors.At the very bottom of the list sits New York, which is only anticipated to see a 20% spike in deaths over the number of deaths recorded in May. While New York is among the highest in the country in terms of absolute number of deaths, the projection of the state’s death toll has remained fairly flat.Included in the bottom are Vermont, Michigan, New Jersey, Connecticut, Idaho, Massachusetts, Louisiana, Colorado, and Oklahoma. All states except Oklahoma are anticipated to have less than a 100% increase in coronavirus deaths by October from the recorded levels in May.This week, New York, New Jersey, and Connecticut imposed a quarantine for visitors coming from states with significantly high levels of COVID-19. Many of those states cracked the top 10 of the Yahoo Finance list of greatest coronavirus death increases, including Alabama, Arkansas, Arizona, Florida, Washington, Utah, and Texas.Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:Companies ‘haven’t done the work’ around diversity and inclusion: Bozoma Saint JohnBiden outraises Trump for month of May amid coronavirus, George Floyd protests‘We need more funding for police’: Missouri AG SchmittWhy Black wealth has stayed 'relatively flat' since Tulsa massacreFormer Obama advisor Valerie Jarrett talks protests, defunding police, and criminal justice reformRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}