{"article": [{"url": "https://finance.yahoo.com/news/back-to-school-tech-gear-205640568.html", "published": 1595606660.0, "headline": "Top back-to-school gear: Tech Support", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's dilemma:‘What back-to-school tech does my kid need?’We’re halfway through the summer, and that means the back-to-school season is in full swing. And with many schools expected to start the school year with remote learning as a result of the ongoing coronavirus pandemic, students are going to need new tech more than ever.We’re talking laptops, Chromebooks, and routers to help get work done, and a few other gadgets for the inevitable down time.Here’s the gear you’ll want to look for while back-to-school shopping this year.LaptopsWhether your child is participating in remote learning or heading off to school, they’re going to need a laptop. And if you’re looking for the best of the best, my go-tos are Apple’s (APPL) MacBook Air and Dell’s XPS 13.Apple's MacBook Air is a fantastic laptop for students at home and on the go. (Image: Apple)Both systems can be outfitted with powerful components and plenty of storage for all of your student’s homework, not to mention movies, music, and photos. Just as importantly, they’re thin and light, making them perfect for sliding into a backpack or shoulder bag for whenever schools and colleges eventually reopen.Apple’s entry-level MacBook Air will set you back $999 or $899 with student pricing, while Dell’s entry-level XPS 13 will cost you $999.I’d recommend going with slightly upgraded models of each to ensure you’re getting the most bang for your buck in the long run. That means opting for the MacBook Air with a Core i5 processor, 8GB of RAM, and 512GB of storage for $1,199 with student pricing. Dell’s XPS 13 also costs $1,199 with the same kind of setup.Story continuesChromebooksIf your student doesn’t need a full-fledged laptop for school or college, you can choose a Google Chromebook. Built by electronics giants ranging from HP and Samsung to Dell and Acer, Chromebooks are powered by Google’s Chrome OS operating system and are built largely for lightweight apps, web browsing, and online productivity.Google's Pixelbook Go is a slick, sturdy Chromebook that's worth the price. (Image: Google)The folks at Laptopmag.com recommend the ASUS Chromebook Flip C434 as the best overall Chromebook. Starting at $561 on Amazon or $569 at Best Buy, the Flip features a 2-in-1 convertible design, meaning you can use it as both a standard notebook and as a tablet.I’m partial to the Chromebook Pixel Go for $649. That system’s premium feel and fantastic keyboard, not to mention solid performance make it excellent for typing papers, web browsing, or kicking back and watching Netflix.Wi-Fi mesh routersIf your child is starting the school year at home, you’re going to need a strong Wi-Fi signal. And while standard routers are fine for most apartments and houses, those with annoying dead spots can benefit from the addition of a mesh router system.Unlike normal routers, which send out and receive wireless signals from a single point, mesh routers sit in multiple points throughout your home, bouncing signals off of each other and blanketing your entire space with Wi-Fi connectivity.The Eero mesh router system can help bring Wi-Fi connectivity to your entire home. (Image: Eero)There are a multitude of mesh routers available, and Google’s Nest Wifi and Eero’s offerings are among some of the best. Google provides a base station and secondary router for $269 and says it can cover as much as 3,800 square feet of space. Eero’s system starts at $249 for three units and can cover up to 5,000 square feet of space.There are a variety of other mesh routers on the market, including from Netgear, Linksys and others, so don’t be afraid to check out the ones that are right for your price range and your home’s size.Wireless earbudsNo matter where children are doing their schooling, they’re going to need something to drown out the noise around them and focus on their work. Wireless earbuds can be a big help in that department. They’re also not bad for listening to music and vegging or blasting tunes while working out.Ever since Apple introduced its AirPods, the market has been flooded with similar wireless earbuds, but Apple is still the top contender when it comes to the category. The original AirPods currently go for $159, but if you want a premium listening experience, I’d opt for Apple’s AirPods Pro for $249. They feature active noise-canceling technology and are both sweat and water resistant.Sony's wireless earbuds are some of the best on the market, and feature active noise-canceling technology. (Image: Sony)If you’re an Android fan or are looking for something a little different, you can choose Sony’s WF-1000XM3 earbuds, which cost $229 and provide excellent audio quality and active noise-canceling technology. Google’s own Pixel Buds, meanwhile, go for $179 and include Google Assistant integration, but lack active noise-cancelling technology.Microsoft has also gotten in on the earbuds trend with its own Surface Earbuds, which feature a slick look and comfortable feel for $199. They don’t, however, have active noise-canceling technology.Smart speakersLet’s face it, whether your child is in middle school, high school, or college, getting up for class is a pain. Thankfully, there’s a new breed of smart speaker that’s small enough for a dorm room, but loud enough to wake up even the heaviest of sleepers.Google’s Nest Mini is a hockey puck-sized smart speaker that comes loaded with Google Assistant for $49. The Mini can play music from Spotify, podcasts, and provide basic information from Assistant.Amazon's Echo Dot is $59 and packs a solid speaker with the company's Alexa voice assistant. (Image: Amazon)Then there’s Amazon’s Echo Dot. Like the Nest Mini, the Echo Dot takes up minimal space on a nightstand and can stream music, podcasts, and offer basic information via Amazon’s Alexa voice assistant. The Dot, however, costs $59 and features a digital clock on its front.Happy shopping!Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Twitter hack could have been ‘much, much worse’ say cybersecurity expertsShould you delete TikTok?: Tech SupportLyft to provide 60,000 partitions to drivers to prevent spread of coronavirusIs TikTok a security threat? It’s complicatedFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}