{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-sun-belt-struggles-as-fl-leads-soaring-case-numbers-ny-turns-a-corner-162359621.html", "published": 1594639880.0, "headline": "Coronavirus update: Sun Belt struggles as FL leads case spike; NY turns a corner", "body": "New York hit another major milestone in recovering from the coronavirus outbreak, even as a majority of the U.S. continues to battle exponential case increases, with Florida setting a record in new diagnoses.On Sunday, the Empire State reported zero new deaths for the first time since the COVID-19 pandemic first took hold four months ago, after reporting just six deaths the day before. The former epicenter of the outbreak joined other northeastern states like Rhode Island, in successfully curbing the outbreak.However, the Sun Belt struggled to do the same. States like California, Florida and Texas continue to see unbridled case growth, with Florida reporting a record 15,000 cases in one day Sunday — a number that dwarfed even New York’s case count during the worst of its outbreak. The data arrived just as Walt Disney World in Orlando re-opened after four months over the weekend.California’s resurgence has also been a major source of concern, as it appeared to have recovered after initial outbreaks hit the West Coast early in the crisis.Globally, the situation continues to worsen. The World Health Organization reported a record-breaking single-day global case surge of 230,000 Sunday. The agency warned that most of the new infections are coming from a handful of countries unable to tame COVID’s surge.\"Let me be blunt, too many countries are headed in the wrong direction, the virus remains public enemy number one,\" WHO Director General Tedros Adhanom Ghebreyesus said on Monday.He added that countries in the “intense transmission phase” include the U.S. and India — while more than 50% of cases are in the Americas.Cases are nearing 13 million globally Monday, meanwhile, global deaths have reached 569,000. In the U.S., more than 3.3 million have tested positive, and more than 135,000 have died from the virus. Surging new infections prompted Disney to shutter Hong Kong Disneyland one again, as cases in the region rise.Coronavirus cases outside New York are surging. (Graphic: David Foster/Yahoo Finance)Dr. Dean Blumberg, a University of California Davis infectious disease expert, said the rise in cases is especially concerning, because summer was supposed to slow the spread. Much like the 2009 influenza pandemic, however, COVID-19 has been characterized by sustained transmission even in warm weather.Story continuesSimultaneously, Texas continues to see record hospitalizations, worrying public health experts on the highly-populated state’s ability to handle the surge.Unequivocally worse in #TexasRecord hospitalizations (10,410) w/tightening capacityRecord deaths (7 day moving average; Sunday reporting)Record positive rate (16.3%). Texas remains advantaged by a LOT of hospital beds; not so much people who can care for the people in them. pic.twitter.com/ersc7r09tr— (((Howard Forman))) (@thehowie) July 12, 2020U.S. response struggles as election nearsThe U.S. response to the virus has laid out aggressive targets and timelines for a vaccine, increased domestic production of personal protective equipment (PPE), and increased emergency use authorization for a variety of nasal swab and antibody tests. Federal regulators continue to green-light tests and efforts to accelerate the vaccine process.Pfizer (PFE) on Monday became the second company to receive fast-track designation from the U.S. Food and Drug Administration (FDA) Monday for its coronavirus vaccine candidate, being developed in collaboration with BioNTech (BNTX). Moderna’s (MRNA) candidate was fast-tracked in mid-May.Despite many of the steps taken a few months ago when the virus was hammering New York and New Jersey, the southern states currently battling the outbreak are reporting some of the same struggles faced by their northeastern counterparts — shortages of PPE and tests, and overwhelmed health care systems.The ongoing struggle has spurred calls for a nationally-directed strategy, rather than the patchwork and independent state-level decisions that have largely been credited for the concerning case surge.Meanwhile, the White House is embroiled in its own internal battle, reportedly sidelining Dr. Anthony Fauci while it continues to muzzle the Centers for Disease Control.In a statement to multiple outlets, the White House said Fauci, the director of the National Institute of Allergy and Infectious Diseases, “has been wrong on things” and that several officials are concerned with the number of times he has been wrong.A number of experts are concerned with the distraction at a crucial time in the country’s response to the outbreak. Fauci told the Financial Times he has not spoken with Trump since early June.Nicholas Burns, a former undersecretary of state and Harvard professor, said on Twitter the move by the White House is unprecedented.“I can’t remember anything quite like the White House attack on Dr. Anthony Fauci,” Burns said. “As U.S. infection rates soar, trying to make a scapegoat of the most admired public servant in America isn’t going to work. And it’s plain dishonest.”Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}