{"article": [{"url": "https://finance.yahoo.com/news/why-nikola-shares-look-attractive-longterm-jp-morgan-analyst-181115335.html", "published": 1594214360.0, "headline": "Why Nikola shares 'look attractive' long-term: JPMorgan analyst", "body": "Shares of Nikola (NKLA) are “starting to look attractive for long-term investors” says JPMorgan analyst Paul Coster, upgrading the stock to Overweight from Neutral.The upgrade came hours before founder Trevor Milton posted a drive-demo of the company’s fuel-cell semi truck. Shares surged 26% during Wednesdays session, back above the firm’s price target of $45.“We believe the stock does not fully price in successful execution of the multi-year growth strategy, which yields earnings power of ~$1.7bn EBITDA in 2027,” wrote Coster, the note’s lead analyst.That analyst highlights a “number of potential positive catalysts in coming weeks and months” including the announcement of a partner to produce its Badger pick-up truck, deployment plans for hydrogen charging stations in the UK, and “potentially accelerated implementation plans for the FCEL truck in the U.S.”The electric and hydrogen fuel-cell truck company has been much-talked-about since its public debut in early June, with comparisons (and non-comparisons) to Tesla (TSLA). In a recent interview with Yahoo Finance Milton said he hopes to someday “take the throne” from the Ford (F) F-150.Milton tweets regularly about designs and sneak-peeks and is often defending the company against nay-sayers.Want to see the Instagram live video? See the fuel cell, under the hood, powering the truck, driving, running along side of it and had a little fun poking at all the trolls saying we are fake. Hope you all enjoy! Share with everyone https://t.co/rM8fgWZBpK— Trevor Milton (@nikolatrevor) July 8, 2020“In our view, NKLA is currently a story-stock, but we are on board as long as the company executes to plan, and providing the stock offers a favorable risk-reward trade-off,” wrote Coster.“We could also get less constructive in a hurry, if the firm fails to execute to plan, or if competition ratchets up faster than we anticipate,” he added.Story continuesNikola RastorThe analyst reviews have been mixed so far. Cowen last month initiated coverage of the stock with an Overweight rating and a price target of $79. Meanwhile RBC Capital gave it a lukewarm reception this week, with a Sector Perform rating and a price target of $46.Coster wrote that downside risks include that “the company is authorized to issue equity and is likely to do so (alongside debt) to fund growth of the business.” The note also warns insiders may sell shares when the lock up expires.The stock has been highly volatile since it went public through a merger with a special purpose acquisition company (or SPAC) in early June. The stock reached an intraday high of $93.99 last month.[Read more: 'Robust pipeline' of companies set to come to markets: NYSE official]“NKLA trading volumes are very high despite limited float at present, so we believe the stock movement is largely driven by short-term traders,” wrote Coster.He notes institutional investors have been more focused on the company’s warrants, predicting ”the stock will remain volatile until the SPAC shares are registered and the warrant calls are exercised (by the company), which could lead to some additional selling,” followed by some degree of stabilization.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070The days of $100 oil are over': Bubba Trading founderProposed direct listing change would 'encourage more companies to go public': IPO expert'There's a risk of a lost decade here:' former IMF adviserFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}