{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-july-18-2020-194718978.html", "published": 1595489960.0, "headline": "Jobless claims: Another 1.416 million Americans filed new unemployment claims last week, as labor market recovery sputters", "body": "The level of new jobless claims unexpectedly rose last week, signaling a weakening trend in the labor market as states across the US grapple with a resurgence in coronavirus cases. Another 1.416 million Americans filed for first-time unemployment insurance benefits, up from just over 1.3 million the prior week, to mark the first increase in new claims on a week over week basis since March.Here were the main results from the report, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended July 18: 1.416 million vs. 1.3 million expected and 1.307 million during the prior weekContinuing claims, week ended July 11: 16.197 million vs. 17.1 million expected and 17.304 million during the prior weekNew jobless claims topped one million for an 18th straight week, with the pandemic and social distancing measures driving stubbornly high levels of joblessness since mid-March. The total number of new claims filed since the week ended March 20 topped 52 million.“A resurgence in virus cases has resulted in a pause or rollback of reopenings across states. Businesses are once again closing and layoffs are rising,” Rubeela Farooqi, chief US economist for High Frequency Economics, wrote in an email Thursday. “The risk from repeated business closures is that temporary job losses will become permanent. This could result in an even slower pace of recovery.”On a non-seasonally adjusted basis, new claims fell by 141,816 during the week ended July 18, diverging from the headline figure, which rose by 109,000. Last week, unadjusted claims had risen week over week, whereas the headline seasonally adjusted figure fell.The latest jobless claims report comes as lawmakers race against the clock to deliver another stimulus package to support individuals and businesses hardest hit by the coronavirus pandemic. The $600 per-week in additional federal unemployment benefits – a key measure included in the previous more than $2 trillion relief package – is set to expire at the end of July. Debates in Washington over the shape of a new stimulus package were under way this week.Story continuesA handful of states in the South and West that had recently reported spikes in coronavirus cases again saw increases in new jobless claims for the week ended July 18. California, which has consistently posted the highest level of new jobless claims each week, reported an unadjusted increase of 7,759 new claims to 292,673, for a second straight week of increases in new claims.Louisiana’s level of new claims increased by 4,804 to 31,155 last week, and Nevada’s rose by nearly 30%, or 4,109, to 18,775. Virginia’s initial jobless claims were at more than 40,000 for an increase of about 7,900 over last week. Many states, however, reported declines in the level of new claims versus the previous week.Continuing unemployment insurance claims, which are reported on a one-week lag, declined for a seventh straight week during the period ending July 11. Continuing claims – a measure of those still receiving unemployment insurance benefits – declined more than expected to below 17 million, and the previous week’s level was downwardly revised.NEW YORK CITY: Hundreds of people wait in line for hours at a downtown Brooklyn office for their EBT Food Stamp cards on May 12, 2020 in New York City. Across America, people are reeling from the loss of jobs and incomes as unemployment soars to historical levels following the COVID-19 outbreak. (Photo by Spencer Platt/Getty Images)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:Jobless claims: Another 1.3 million Americans filed for unemployment benefits last weekJune jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}