{"article": [{"url": "https://finance.yahoo.com/news/joe-bidens-road-to-the-democratic-presidential-nomination-100230633.html", "published": 1597641020.0, "headline": "Joe Biden’s road to the Democratic presidential nomination", "body": "America already knows former Vice President Joe Biden well. Biden spent eight years as Obama’s vice president and 36 years in the U.S. Senate.When he became U.S. Senator, some current lawmakers, including Rep. Alexandria Ocasio Cortez (D-NY) and Sen. Josh Hawley (R-MO), weren’t even born. His long history in Washington could be both an asset and a liability.Obama, one of the most popular figures in the Democratic party, has called selecting Biden as VP the best decision he made as the nominee – but Biden has had to answer for some of his decisions earlier in his career.He presided over the Anita Hill hearing in 1991, in which Hill accused then Supreme Court nominee Clarence Thomas of sexual harassment. Knowing the hearing would be a problem, Biden spoke to Hill last year and expressed regret – but Hill told the New York Times she was unsatisfied with the conversation.Biden helped write the controversial 1994 crime bill and voted to authorize use of force in Iraq – both of which his opponents used against him on the debate stage during the primary.The former vice president has also faced accusations of inappropriate behavior toward women. He addressed the claims in April.“I hear what they're saying, I understand it. And I'll be much more mindful. That's my responsibility,” said Biden in a video released by his campaign.If elected, Biden would be 78 at his inauguration. He would become the oldest person to ever take office – a title currently held by President Trump, who assumed the presidency at 70 years old.Democratic presidential candidate former Vice President Joe Biden and his running mate Sen. Kamala Harris, D-Calif., participate in a virtual grassroots fundraiser at the Hotel DuPont in Wilmington, Del., Wednesday, Aug. 12, 2020. (AP Photo/Carolyn Kaster)Biden argues his decades of experience make him uniquely qualified to lead a nation in turmoil. The former vice president has already faced a pandemic and helped lead the country out of a recession.“You know what it’s like, as much as anybody, to be in the White House during a crisis,” said former President Barack Obama in a conversation with Biden earlier this year.Biden is running on the legacy of the Obama-Biden administration. He helped get the Affordable Care Act over the finish line and now he says he wants to expand access to healthcare by building on Obama’s signature legislation.Story continuesThe former vice president is a moderate Democrat who says he will raise taxes on corporations (higher than the current rate, but lower than before the 2017 tax cuts), invest in education and boost American manufacturing. He touts his relationships with world leaders and argues he’ll need to rebuild America’s standing abroad.Biden entered the race last year, calling this election the battle for the soul of the nation.“If we give Donald Trump 8 years in the White House he will forever and fundamentally alter the character of this nation,” Biden said in his announcement video.This isn’t the first time Biden has run for president of the United States. He first tried in 1988 and then again 20 years later. He considered it in 2016, but opted out as he grieved the loss of his son, Beau.His late son, at least in part, led him to his current running mate: Sen. Kamala Harris (D-CA).Democratic presidential candidate former Vice President Joe Biden joined by his running mate Sen. Kamala Harris, D-Calif., speaks at the Hotel DuPont in Wilmington, Del., Thursday, Aug. 13, 2020. (AP Photo/Carolyn Kaster)“They took on some big fights together. Kamala in California, and Beau here in Delaware. Big fights that helped change our entire country. I know how much Beau respected Kamala and her work. And that mattered a lot to me as I made this decision,” Biden said as he introduced Harris for the first time.Biden had vowed to pick a woman as his number two and his choice made history. Harris, the daughter of immigrants, is the first Black woman and first Asian-American to appear on a major party’s presidential ticket.If elected, Biden has pledged to make another historic decision: he would name a Black woman to the Supreme Court should an opening arise.Biden has not thrilled the next generation of progressives – they’ve urged him to think bigger on climate change, healthcare and racial justice. Sen. Bernie Sanders (I-VT) has worked with the Biden campaign to push some of his policies to the left. Still, with less than three months to go, Biden is pitching himself to voters as an experienced and steady leader who can guide the country out of crisis.The Yahoo Finance DNC Special will be led by editor in chief Andy Serwer along with Rick Newman, Jessica Smith and Kristin Myers. Yahoo News editor in chief Dan Klaidman and Huffington Post Washington bureau chief Amanda Terkel.Yahoo Finance will have live coverage of the 2020 Democratic National Convention and Republican National Convention on Monday, August 17 and Monday, August 24.Yahoo Finance's Editor-in-Chief Andy Serwer will be joined by Yahoo Finance correspondents Jessica Smith, Kristin Myers, and Rick Newman along with special guests from inside the political arena.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Coronavirus response: Breaking down the debate over liability protectionsCoronavirus stimulus: What’s next for small business?White House, Senate GOP continue to debate stimulus plan as jobless claims riseTwitter hack highlights concerns about disinformation, election securityThe $600 boost in unemployment benefits expires soon. What comes next?Most Americans would not sue over COVID-19 exposure: poll"}]}