{"article": [{"url": "https://finance.yahoo.com/news/student-debt-crisis-elections-november-pro-biden-alyssa-milano-113537625.html", "published": 1599799520.0, "headline": "‘The student debt crisis is definitely on the ballot in November,’ pro-Biden Alyssa Milano says", "body": "Speaking at an event organized by the Biden campaign, actress-turned-activist Alyssa Milano highlighted student loan debt as a key issue for the upcoming presidential election.“America is in crisis,” Milano said on Thursday evening during a volunteer phone event in partnership with the Progressive Change Campaign Committee, Student Debt Crisis, the American Federation of Teachers, and National Education Association. “There’s a public health crisis… there’s an economic crisis… and there’s also a really important moral crisis, which has left our nation reeling in anguish and anger over systemic racism.”At the same time, she noted, Millennials and Generation Z came of age amid “crushing student debt” and “really broken politics and promises.” And given that these two generations make up an increasing part of the electorate, “the student debt crisis is definitely on the ballot in November.”In this screenshot from the DNCC’s livestream of the 2020 Democratic National Convention After Party, Alyssa Milano speaks to the virtual convention August 20, 2020. (PHOTO: DNCC via Getty Images)Milano: ‘#WhyImvotingforJoe’About 44 million Americans hold $1.5 trillion in student loan debt. Biden has promised to cancel a minimum of $10,000 in student loan debt for every borrower.Biden has proposed to make public colleges and universities tuition-free for all families earning less than $125,000, double the maximum value of Pell grants, increase access to the programs, reform the existing income-based repayment program and public service loan forgiveness, increase scrutiny on for-profit schools and private lenders, allow student loans to be discharged in bankruptcy.(Graphic: David Foster)The proposals will be paid for by “repealing the high-income ‘excess business losses’ tax cut in the CARES Act,” he said in a Medium post. A recent Biden-Sanders task force came to the same recommendations.Milano has dug into the topic of student loans previously in a podcast with Student Debt Crisis’ Natalia Abrams. She also tweeted her support for Biden in April.He wants to forgive student debt.He wants to expand Medicare, more generous subsidies and medicaid funding along with a public option to achieve universal health care.$2 trillion in new spending on early education, post-secondary education, and housing.#WhyImvotingforJoe— Alyssa Milano (@Alyssa_Milano) April 11, 2020During Thursday’s event Abrams also stressed how women and minorities have disproportionately felt the impact of student loans.Story continues“Black women are the largest holders of student debt today, and women hold more than two-thirds of student loan debt,” Abrams stated. It’s “also multi-generational,” she added.In a press release, National Education Association Becky Pringle also noted how debt has held back upward mobility.Biden “knows that if we are going to successfully rebuild the middle class, access to higher education must include more than just those who come from families who can afford to write a check,” Pringle said in a statement.—Aarthi is a reporter for Yahoo Finance. She can be reached at aarthi@yahoofinance.com. Follow her on Twitter @aarthiswami. Read more: Biden-Sanders task force proposes forgiving certain student debtBiden backs Democrats' student debt cancellation push amid coronavirus outbreakRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}