{"article": [{"url": "https://finance.yahoo.com/news/walmart-facial-covering-policy-152304083.html", "published": 1594811360.0, "headline": "Walmart to require face masks for customers and workers at all US stores", "body": "Walmart (WMT) will require all customers and employees to wear face masks at all of its locations beginning July 20, as the U.S.’s surging COVID-19 diagnoses feed a groundswell of support for face coverings in public.Approximately 65% of Walmart’s nearly 5,000 locations operate in areas that have a government mandate in place requiring masks.The move by the retail giant — which is the largest private employer in the U.S. — comes as new coronavirus cases are soaring, and a growing number of officials have thrown their weight behind public masking. Starbucks also recently moved to require face masks among its patrons.“While we’re certainly not the first business to require face coverings, we know this is a simple step everyone can take for their safety and the safety of others in our facilities,” Walmart COO Dacona Smith wrote in a blog post.“According to the CDC, face coverings help decrease the spread of COVID-19, and because the virus can be spread by people who don’t have symptoms and don’t know they are infected, it’s critically important for everyone to wear a face-covering in public and social distance,” Smith added.The subject of masks has sharply divided public opinion, and led to some high-profile confrontations at establishments that insist on customer compliance.In recent days, economists — including a few Federal Reserve policymakers — have linked mask wearing to economic growth, arguing they can prevent spreading, and substitute for the restrictive lockdowns that brought the economy to a screeching halt in the spring.“We know some people have differing opinions on this topic. We also recognize the role we can play to help protect the health and well-being of the communities we serve by following the evolving guidance of health officials like the CDC,” Smith wrote.To help customers comply with the new policy, Walmart plans to create a new Health Ambassador role. This person will go through training to make “the process as smooth as possible for customers.” The ambassador will wear a black polo shirt, and be placed near the entrance.Story continuesAt Walmart-owned Sam’s Club, its membership warehouse, the club will hand out complimentary masks to members without one on hand.Walmart operates more 4,700 Walmart stores in the U.S. and close to 600 Sam’s Club stores.Yahoo Finance’s The Market Wake-UpJulia La Roche is a Correspondent at Yahoo Finance. Follow her on Twitter. Starbucks to require that all customers wear facial coverings in its cafes"}]}