{"article": [{"url": "https://finance.yahoo.com/news/hall-fame-resort-entertainment-company-120000715.html", "published": 1596697700.0, "headline": "Hall of Fame Resort & Entertainment Company Completes Acquisition of The Crown League", "body": "First league to offer fans access to and engagement with teams controlled by football and fantasy legendsHall of Fame Resort & Entertainment Company (\"HOFV\" or the \"Company\") (NASDAQ: HOFV, HOFVW), the only resort, entertainment and media company centered around the power of professional football and owner of the Hall of Fame Village Powered by Johnson Controls in Canton, Ohio, today announced the completion of its acquisition of the controlling interest in The Crown League, the first ever fantasy football league to have teams assembled and managed by some of the game’s greatest alongside fantasy football experts.With the completion of the transaction, HOFV enters the high-growth fantasy sports vertical, a market that is expected to grow to $33.2 billion by 2025.1 This strategic acquisition provides HOFV with a highly differentiated fantasy football product and advances its plan to create an integrated and immersive media, sports and entertainment enterprise that benefits from diverse yet complementary revenue streams.\"This transaction is representative of the type of integrated businesses we are working hard and carefully to build,\" said Michael Crawford, President and CEO of HOFV. \"Our strategic plan is supported by strong long-term fundamentals across our different verticals. The offerings we are creating are being purpose-built to be mutually beneficial allowing for monetization in a variety of ways such as sponsorship and content distribution. Introducing a well-conceived fantasy football league powered by our unique partnerships within Professional Football creates a new avenue for sustainable growth in a market that is ripe for disruption.\"Expected to launch in time for the 2021 NFL season, the newly formed platform will allow fantasy football fans to experience the game in new and exciting ways. Participants will have the opportunity to back fantasy teams that are controlled by professional football legends and fantasy gurus, which will compete against each other on a national scale. The League will leverage its access to these personalities to create original content and enable fans to engage with them over its platform, which is supported by proprietary technology.Story continuesTo lay the groundwork for creating and maintaining a highly engaged community-based league, the platform will begin sharing details in the coming months about its franchise structure and brand identities as well as the many ways in which it plans to engage football fans with a new and unique way to experience fantasy football.In conjunction with the closing of the transaction, Mat Sposta, who cofounded the acquired Crown League and will continue to oversee its operations to ensure continuity and will continue to work closely with league cofounder Derek Siskin, who will serve as the platform’s Chief Creative Officer. The team will also be supported by an executive management team with an extensive expertise in growing, activating and monetizing brands.Mr. Sposta stated, \"We look forward to leveraging the world’s passion for fantasy sports by offering a one-of-a-kind professional fantasy league. Integrating the Hall of Fame Resort and Entertainment Company’s direct access to unique content and brand partnerships into this platform will provide our community with a deeper appreciation for professional football’s greatest players and their respective legacies. This partnership will allow us to launch the platform in a powerful way and provides opportunities to expand our offering into new verticals while connecting with the fantasy and sports betting communities in meaningful ways. Participants do not need to be fantasy experts to be engaged and enjoy the first professional fantasy league.\"About the Hall of Fame Resort & Entertainment CompanyThe Hall of Fame Resort & Entertainment Company (NASDAQ: HOFV, HOFVW) is a resort and entertainment company leveraging the power and popularity of professional football and its legendary players in partnership with the Pro Football Hall of Fame. Headquartered in Canton, Ohio, the Hall of Fame Resort & Entertainment Company is the owner of the Hall of Fame Village Powered by Johnson Controls, a multi-use sports, entertainment and media destination centered around the Pro Football Hall of Fame's campus. Additional information on the Company can be found at www.HOFREco.com.About The Crown League The Crown League is a development stage platform expected to be the first community-based, national professional fantasy football league. Combining key elements of fantasy sports, esports, and traditional pro sports, The Crown League is intended to create real community, a new form of gaming and an innovative sports experience for the average fan. For more information visit www.thecrownleague.com.1 Orbis Research. \"Global Fantasy Sports Industry 2014 Market Research Report.\" QY Research, 12 April 2019.View source version on businesswire.com: https://www.businesswire.com/news/home/20200806005516/en/ContactsFor Information, Contact: Media InquiriesPublic.Relations@hofreco.com Investor InquiriesInvestor.Relations@hofreco.com"}]}