{"article": [{"url": "https://finance.yahoo.com/news/sallie-krawcheck-coronavirus-pushing-gender-wealth-gap-backward-at-a-faster-pace-221913135.html", "published": 1593970040.0, "headline": "Sallie Krawcheck: Coronavirus pushing gender wealth gap backward at a faster pace", "body": "Wall Street veteran Sallie Krawcheck says the gender wealth gap has gone backward during the COVID-19 crisis, at a rapid pace.Krawcheck, the CEO of women-led and focused investment platform Ellevest, is a vocal advocate for female financial empowerment. Throughout the outbreak, her firm has doled out free financial advice and coaching for women, encouraging them to invest more.She explained to Yahoo Finance that the pandemic — which is impacting workers at all income levels — is exacerbating unfavorable socioeconomic and gender trends.“We talk a lot about the gender pay gap — 82 cents [for a woman] to a white man’s dollar,” she said last week. “The gender wealth gap, so, how much women have, is 32 cents to a white man’s dollar. For black women, it’s a single penny. And we’re going backwards in the pandemic.”According to a new poll from Harris and Yahoo Finance, women feel far less confident about hitting their investing goals than men. Only 4% of women surveyed feel “very confident,” compared to 32% of men, while 47% reported feeling “fairly confident” versus 60% of male respondents.What’s more, as the COVID-19 pandemic wrecked the economy, women — particularly females of color — have been disproportionately affected by job losses. Krawcheck noted that even women who are privileged enough to work remotely from home are less productive, as they take on a bulk of responsibilities in the household.Krawcheck recently pivoted the business to offer more solutions targeted toward women and non-binary investors. In June, Ellevest debuted its $1 monthly Money Membership, that provides one-on-one financial and career coaching as well as saving and budgeting tools.There’s an executive-level membership for $9 per month. Ellevest also rolled out checking account and no-fee debit card options, with an automatic roundup to build savings.However — Krawcheck, who served in the c-suite at Citigroup (C) and Merrill Lynch (BAC), doesn’t view traditional banks as her competition.Story continues“Our competition is inertia and not taking action. In particular, because women receive so many negative messages around money — including that they’re not as good at managing cash, or investing.“‘You’re not good at math. You’re not great at investing. You need more financial education. You’re risk-averse,’” she said. “The only one that’s true is everybody needs more financial education.”Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapse"}]}