{"article": [{"url": "https://finance.yahoo.com/news/surprising-economic-trend-defines-this-recession-morning-brief-095904682.html", "published": 1600319240.0, "headline": "The surprising economic trend that defines this recession: Morning Brief", "body": "Thursday, September 17, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThe housing market is booming.According to the National Bureau of Economic Research, the current recession began in February.And this economic downturn has been defined by a few major trends. Historic job losses in March and April. Unprecedented fiscal stimulus. A massive rally in the stock market. Millions of re-hirings through the summer.But no trend has been more surprising as the booming U.S. housing market.New, pending, and existing home sales have all surged through the summer. Mortgage applications have been on fire.And on Wednesday, the September reading on homebuilder sentiment from National Association of Home Builders showed builders have never felt better about the housing market.Not during the the 1990s expansion, the housing bubble of the 2000s, or the 2010s economic expansion that eventually grew to the longest on record were homebuilders as bullish on their prospects as they are today.Instead, it was a global pandemic that laid the groundwork for a surprise housing boom.“The suburban shift for home building is keeping builders busy, supported on the demand side by low interest rates,” said NAHB chief economist Robert Dietz. “In another sign of this growing trend, builders in other parts of the country have reported receiving calls from customers in high-density markets asking about relocating.”In response to financial market dislocations from fears over the economic fallout of the pandemic, the Federal Reserve cut interest rates to 0% and has pledged to keep policy accommodative for years to come. Low interest rates help mortgage borrowers and lenders, greasing the gears of the housing market.Additionally, many of those hit hardest by layoffs during the pandemic were at the lower end of the wage scale — restaurants, bars, hotels, and any travel-related service have been hit hardest — while white collar workers told to work at home instead of come into the office have so far fared better.Story continuesThis divergence in the labor market has been captured in wage growth data, with wages rising more than 4.5% over last year during the last few months as those earning less dropped out of the workforce while higher earners remained employed. As Federal Reserve Chair Jerome Powell said Wednesday, “The economic downturn has not fallen equally on all Americans, and those least able to shoulder the burden have been hardest hit.”And so this dynamic has left a still-employed, higher-earning white collar workers setting up home offices or looking for a new home base altogether. With this surge in demand coming right into a housing market that had been supply-constrained for years.In a note to clients published Wednesday, Evercore ISI analysts led by Stephen Kim called this a “golden age” for the U.S. housing market.“In our view, the roots of this demand strength run deep, nourished by a reservoir of millennial households now springing forth, nesting and upsizing trends, accommodative housing policy, and record-low mortgage rates,” Kim writes. “[Amidst] rising fear and insecurity, the instinct to retreat to the sanctuary of one's home is implacable. So as we stand at the threshold of a new cycle, surveying years of pent-up demographic trends, unprecedented buying power, generous government support, and scant supply, the industry’s forecast is uncommonly bright...”And so it seems that a recession and the scariest crisis in a generation has served to reset the outlook for housing in the U.S.A surprising outcome, indeed.But seen differently, that housing — and particularly suburban, single-family housing — would benefit during a crisis that serves to accelerate the most notable economic trends of the 2010s.Because the success of the housing market is an inequality story as much as it is about low rates or constrained supply.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Building permits, August (1.52 million expected, 1.483 million in July)8:30 a.m. ET: Housing starts, August (1.475 million expected, 1.496 million in July)8:30 a.m. ET: Philadelphia Fed Business Outlook Index, September (15.0 expected, 17.2 in August);8:30 a.m. ET: Initial jobless claims, week ended September 12 (850,000 expected, 884,000 prior week)8:30 a.m. ET: Continuing claims, week ended September 5 (13.000 million expected, 13.385 million prior week)Top NewsUS futures and European stocks slide after US Fed meeting [Yahoo Finance UK]ByteDance's TikTok proposal isn't just up to Trump [Yahoo Finance UK]Powell pushes on 'very strong, very powerful' guidance on interest rates [Yahoo Finance]Snowflake IPO: How the stock traded on its debut [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSHow the biggest stocks from 2000 performed in subsequent yearsNumber of people paying rent at lowest level since the start of the pandemicMicrosoft lost its best chance to be the ‘cool‘ tech company—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}