{"article": [{"url": "https://finance.yahoo.com/news/trump-is-no-longer-the-best-candidate-for-business-191731801.html", "published": 1593008720.0, "headline": "Trump is no longer the best candidate for business", "body": "For most of the last three years, investors and business owners have backed President Trump’s handling of the economy, even if they disapproved of his disruptive leadership style. Trump cut taxes and slashed regulation, gifts to corporate America that boosted business income and stock valuations.There’s almost no chance Trump could be so generous to business if he wins a second term, since the federal debt is soaring amid the severe coronavirus recession and trillions in new stimulus dollars. “At the beginning of the Trump administration, the agenda was squarely focused on market positives,” Ed Mills, Washington policy analyst for Raymond James, says in the latest episode of the Yahoo Finance Electionomics podcast. “That to-do list is done. Much of what could have been done is completed.”Trump hasn’t outlined a thorough economic agenda for a second term, but he has indicated his trade fight with China could continue and maybe intensify. Trump has threatened a “decoupling” with China that could sever the trade relationship built during the last several decades. “Trade uncertainty is a market negative,” Mills says. “The market doesn’t like the potential for decoupling of the United States and China. One of the thoughts is that if he were to win a second term, he would follow through with some of the threats not completely followed through in his first term.”Trump’s recent suspension of skilled-immigrant visas, known as H-1Bs, could be another preview of a second Trump term. Trump says coronavirus requires a temporary ban on H-1B arrivals, to protect Americans. But Trump has sought many ways to limit legal immigration during the last three years, and some executives think Trump is using coronavirus as a pretext for his anti-immigration crusade. Tech firms and other companies rely on H-1B workers to do programming and other technical jobs for which there’s a skill shortage among American workers, and big business is squarely against the latest ban.Story continuesTrump is also threatening new tariffs on imported metals and a trade war with Europe. For much of Trump’s presidency, pro-business measures such as tax cuts outweighed Trump’s protectionist impulses on trade. But Trump may no longer have sweeteners to offer the business community, to offset the heartburn he causes on trade.A return to pre-Trump normsThis doesn’t mean businesses are rushing to support Trump’s Democratic opponent, former vice president Joe Biden. While not as hostile to businesses as Democrats such as Bernie Sanders or Elizabeth Warren, Biden still wants to raise the business tax rate from 21% to 28%, and impose a 15% minimum tax on businesses that report a profit to shareholders but use legal tax breaks to shrink their federal tax payments. He’d also end tax breaks for energy firms and other sectors.But Biden could only impose such measures if he won and Democrats also clinched control of the Senate, perhaps a 50-50 likelihood, at best. And even then, it could be hard to raise taxes in the middle or immediate aftermath of a punishing recession.President Donald Trump holds an image of the U.S. border wall being built between the U.S. and Mexico as he participates in a border security briefing at United States Border Patrol Yuma Station, Tuesday, June 23, 2020, in Yuma, Ariz. (AP Photo/Evan Vucci)Where Biden might plainly trump Trump is on trade. Biden hasn’t spelled out a China policy, but since he’s campaigning on a return to pre-Trump norms, Biden would probably rebuild alliances Trump has neglected, including trade ties. Many trade experts say Trump is generally right when he accuses China of cheating on trade. But tariffs, Trump’s preferred method of punishment, harm American businesses that pay the duties, along with U.S. exporters subject to similar retaliation from China. Biden might remove Trump’s tariffs while working with allies to bring unified pressure on China to change its most objectionable trade practices, without the damage to global supply chains Trump’s approach threatens.Biden has also proposed a much more robust federal response to the coronavirus pandemic than Trump’s decentralized approach. Public health is now conjoined with economic prosperity, because the prevalence of the virus—and surging caseloads in some states—are holding back an economic recovery and compounding the damage every day businesses and workers can’t get back to normal. Biden favors a massive federal testing program or the sort many public health experts have called for, while Trump has left testing to the states and even downplayed the virtues of testing. If the pandemic is still strangling the economy on Election Day, Biden’s pandemic war plan could amount to an economic stimulus plan Americans strongly favor.Voters still give Trump a slight edge over Biden for handling the economy, but Trump has been sliding in nearly every measure of his performance as president during the last two months. Trump clearly needs a sharp economic rebound to win in November, and empty boasts won’t do the trick if voters don’t feel their own personal situation is improving. Biden’s pitch, for now, is that Trump is unsteady and vitriolic, while he’d bring a return of calm, measured leadership. Businesses survived Trump’s wild ride until the coronavirus hit, and by November they might conclude that a few years of calm would be good for the bottom line.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Why you’re not hearing about Biden’s economic planTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}