{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-29-2020-221532343.html", "published": 1593444020.0, "headline": "Stock market news live updates: Stocks rise, Boeing leads Dow higher", "body": "Wall Street rallied Monday, with all three indexes jumping by over 1%, after new housing data showed a record monthly gain in pending home sales and momentarily offsetting rising fears about new coronavirus cases that are jeopardizing an economic rebound.[Click here to read what’s moving markets heading into Tuesday, June 29]The estimates-topping economic data helped assuage fears over the economic damage from the pandemic. In the past week, a rising number of states across the country have retreated from the gradual relaxation of lockdowns, in an effort to curb increases in COVID-19 infections.Shares of Boeing handily led gains in the Dow, with the aircraft manufacturer’s stock surging after the Federal Aviation Administration said test flights for the 737 Max jet would begin as soon as Monday.Monday’s market moves came following a selloff Friday, with the Dow ending lower by more than 700 points, or 2.3%. The risk-off mood was spurred after cities and states hit with a resurgence of coronavirus infections reversed some of the reopening steps already under way, seen as a drag on business activity.And more cities rolled back reopening plans over the weekend. California Governor Gavin Newsom said Sunday that the state was ordering bars to close anew in seven counties, including Los Angeles. He also recommended another eight counties re-close their bars, due to the spread of Covid-19 across the state.California’s latest orders put the state in the company of others including Texas and Florida, which last week also mandated that bars in their states temporarily shutter.“We suspect that most forecasters have been assuming a smooth(ish) rebound across the whole economy; we have. That now looks unlikely,” Ian Shepherdson, chief economist for Pantheon Macroeconomics, wrote in a note.“It will take a month or so, at least, before the changes in behavior and new restrictions induce a sustained and clear downshift in cases and hospitalizations, allowing another attempt at reopening in the South. This means that the first month of the third quarter will be very weak,” he added.Story continuesGlobally, coronavirus deaths exceeded 500,000 over the weekend, and total cases topped 10 million, according to Johns Hopkins data.Later this week, investors will receive a bevy of new economic data, including the June jobs report Thursday morning. The release will coincide with the Labor Department’s weekly report on new unemployment insurance claims, which is expected to show another 1.336 million individuals filed for new jobless claims the week ended June 27, down just slightly from the worse than expected 1.48 million reported last week.Markets in the U.S. will be closed Friday in observance of the Fourth of July holiday.—4:04 p.m. ET: Stocks rally, Dow jumps 2% led by a 13% surge in Boeing sharesHere were the main moves in markets as of 4:04 p.m. ET:S&P 500 (^GSPC): +44.19 (+1.47%) to 3,053.24Dow (^DJI): +580.25 (+2.32%) to 25,595.80Nasdaq (^IXIC): +116.93 (+1.20%) to 9,874.15Crude (CL=F): +$1.03 (+2.68%) to $39.52 a barrelGold (GC=F): +$2.60 (+0.15%) to $1,782.90 per ounce10-year Treasury (^TNX): unchanged to yield 0.6360%—3:10 p.m. ET: New Jersey pushes back plan to bring back indoor diningNew Jersey Governor Phil Murphy said Monday that the state would not be bringing back indoor dining on July 2 as previously planned. Gov. Murphy cited concerns over allowing congregations indoors for “sedentary” activities, which could facilitate spread of the coronavirus.Earlier, New York City Mayor Bill de Blasio and Gov. Andrew Cuomo also suggested NYC may postpone plans to reopen indoor dining, beyond the original July 6 date anticipated.—11:52 a.m. ET: Stocks jump, Dow adds more than 400 pointsThe three major indices added to gains during intraday trading as investors digested the much better than expected pending home sales release from earlier in the morning.The S&P 500 and Dow were each higher by more than 1%, and the Nasdaq shook off earlier losses. The industrials and materials sectors led gains in the S&P 500, and Boeing remained the outperformer in the Dow, up nearly 5%. Cisco and Intel were the only two stocks in the 30-stock index to trade lower intraday Monday.—10:02 a.m. ET: Pending home sales post record 44.3% gain in MayPending home sales surged by a record in May over April, according to the National Association of Realtors (NAR). The 44.3% jump in May pending home sales was more than double the 19.3% increase consensus economists had been expected, and came following April’s 21.8% slump. Still, the level of pending home sales was down 5.1% over last year, following two straight months of declines during the pandemic.“This has been a spectacular recovery for contract signings, and goes to show the resiliency of American consumers and their evergreen desire for homeownership,” said Lawrence Yun, NAR’s chief economist. “This bounce back also speaks to how the housing sector could lead the way for a broader economic recovery.”“More listings are continuously appearing as the economy reopens, helping with inventory choices,” Yun said. “Still, more home construction is needed to counter the persistent underproduction of homes over the past decade.”—9:46 a.m. ET: Boeing shares jump more than 4% after FAA says test flights for 737 Max are set to beginBoeing (BA) shares led the Dow higher, after the Federal Aviation Administration confirmed that test flights for the 737 Max were set to begin as soon as Monday, according to multiple media reports citing an FAA letter to congressional staffers.Shares of Boeing were down 48% for the year to date through Friday, making it the worst-performer in the Dow for 2020. The stock lagged as the aircraft-maker struggled both with its longstanding woes over the 737 Max jet, which was involved in two deadly crashes since 2018, along with dried up demand for commercial flights during the coronavirus pandemic.—9:31 a.m. ET: Stocks open mostly higherHere were the main moves in markets, as of 9:31 a.m. ET:S&P 500 (^GSPC): +9.66 points (+0.32%) to 3,018.71Dow (^DJI): +211.85 points (+0.85%) to 25,227.40Nasdaq (^IXIC): -8.94 points (-0.04%) to 9,752.5Crude (CL=F): +$0.23 (-0.6%) to $38.72 a barrelGold (GC=F): +$1.10 (+0.06%) to $1,781.40 per ounce10-year Treasury (^TNX): +1 bp to yield 0.648%—7:25 a.m. ET: S&P 500, Dow futures rise heading into market openHere were the main moves in markets, as of 7:25 a.m. ET:S&P 500 futures (ES=F): 3,012.75, up 5.75 points or 0.19%Dow futures (YM=F): 25,060.00, up 110 points, or 0.44%Nasdaq futures (NQ=F): 9,838.5, down 27 points, or 0.27%Crude (CL=F): +$0.15 (+0.39%) to $38.64 a barrelGold (GC=F): +$5.30 (+0.3%) to $1,785.60 per ounce10-year Treasury (^TNX): +1.2 bps to yield 0.65%—6:04 p.m. ET: Stock futures open lowerHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:04 p.m. ET:S&P 500 futures (ES=F): 2,991.00, down 16 points or 0.53%Dow futures (YM=F): 24,801.00, down 149 points, or 0.6%Nasdaq futures (NQ=F): 9,803.00, down 62.5 points, or 0.63%A Trader wearing a mask arrives with his special keyboard before the opening bell at the New York Stock Exchange (NYSE) on May 26, 2020 on Wall Street in New York City. - Global stock markets climbed Monday, buoyed by the prospect of further easing of coronavirus lockdowns despite sharp increases in case rates in some countries such as Brazil. Over the weekend, US President Donald Trump imposed travel limits on Brazil, now the second worst affected country after the United States, reminding markets that while the coronavirus outlook is better, the crisis is far from over. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}