{"article": [{"url": "https://finance.yahoo.com/news/trumps-worst-campaign-promise-183331408.html", "published": 1597153280.0, "headline": "Trump’s worst campaign promise", "body": "President Trump hasn’t said a lot about his agenda for a second term. But he has laid out one perplexing goal: Ending the payroll tax that funds Social Security and Medicare.At a press briefing on Aug. 8, Trump said that if he wins reelection in November, he’ll “terminate” the payroll tax. This tax amounts to an automatic 7.65% deduction, which both employees and employers pay, that funds Social Security and Medicare benefits. According to the latest data, the payroll tax raised about $945 billion per year for Social Security, covering 89% of its costs, and $272 billion for Medicare, covering 36% of its costs.Social Security and Medicare both face funding shortfalls in coming years. Official government projections show Medicare starting to run short of money in 2026, and Social Security starting to come up short in 2034. But those projections don’t account for the coronavirus recession that has slashed government tax revenue, with unemployment surging and far fewer people contributing the payroll tax. Analysts at the Committee for a Responsible Budget think Medicare will now run short in 2023, and Social Security in 2031. Others think it could happen even sooner.Vowing to eliminate a key source of funding for the two popular programs puts Trump at odds with seniors who rely on Social Security and Medicare benefits—and who also happen to be the most reliable voting bloc. Trump won voters over 65 by 9 percentage points in 2016, his best performance among any age group. But Trump’s Democratic foe, Joe Biden, now has a double-digit lead over Trump among seniors. Trump can only alienate seniors by destabilizing their safety net, and a sizable deficit among older voters could easily cost him the election this time around.What is Trump thinking? Nobody can ever be sure, but he seems to believe ordinary workers will appreciate his effort to put more money in their pockets, while seniors won’t really worry about the consequences. Trump signed an executive memorandum on Aug. 8 that “defers” payment of the payroll tax for four months starting Sept. 1, for incomes up to $2,000 per week, or $104,000 per year. For somebody earning $50,000 per year, that’s about $1,300 in deferred taxes.Story continuesNo net gain for workersBut workers deferring the tax would have to pay it back in 2021, so it’s not really a tax cut as much as a delayed payment providing no net gain to workers. Trump may be trying to trip up Biden, who opposes the payroll tax deferral, by claiming Biden wants to raise taxes on middle-class workers. Biden has no such plan, but if he won in November and let Trump’s deferral lapse, it might feel like a tax hike to workers who hoped Trump would make the cut permanent so they’d never have to pay it back.As political sleight-of-hand, it could easily backfire, since Biden now says Trump is waging a “reckless war on Social Security.” That’s not what Trump intends, but shutting the spigot that funds the program leaves Trump vulnerable. Politicians normally bend over backward to praise the benefit programs for seniors and insist they’ll protect them, even though a combination of benefit cuts and tax hikes is probably inevitable at some point to keep the mushrooming programs intact.The White House insists any funding shortfall for Social Security or Medicare will be filled by general revenue, which would have to come from borrowed money at this point. But that’s an alarming scenario for staunch safety-net defenders. “Replacing a dedicated payroll tax with income taxes or other general fund revenues would fundamentally alter Social Security,” Howard Gleckman of the Tax Policy Center writes. “Instead of operating as a guaranteed entitlement supported by that dedicated tax, it would be subject to annual meddling by Congress.”President Donald Trump prepares to sign four executive orders during a news conference at the Trump National Golf Club in Bedminster, N.J., Saturday, Aug. 8, 2020. (AP Photo/Susan Walsh)Since its inception, Social Security has essentially been fenced off from normal budget negotiations in Congress because the payroll tax automatically funds it. Congress doesn’t have to appropriate funding every year, it only needs to adjust the amount of income subject to the payroll tax from time to time. Medicare is partly funded from general revenue, though that too is somewhat automatic, because the general revenue contribution is set to match expenditures each year. And the Treasury Department can borrow the money if necessary.Trump would be the first president to fiddle with the stability of Social Security funding. If he did eliminate the payroll tax, and fund Social Security like all other federal programs, that would raise the risk of benefit disruptions during a government shutdown, like the one that began at the end of 2018. Members of Congress could also withhold funding as part of a budget skirmish or other political fight. Social Security is popular, but Congress isn’t, in large part because of intense partisanship over matters voters consider national priorities.Trump’s meddling with Social Security is even more puzzling given that it’s almost impossible to imagine Congress would pass the legislation necessary to permanently eliminate the payroll tax. Social Security is considered the “third rail of politics”—touch it, and you die. Few members of Congress will risk the enmity of seniors by changing a cherished safety-net program. Trump wouldn’t get this legislation even if he won in a landslide and Congress flipped back to full Republican control. And there’s nothing he can do on his own beyond deferring the tax and making the future bill even bigger. Nobody likes taxes, but the payroll tax is one Trump and other politicians should at least respect.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Trump’s tricky tax ploy11 ways Trump is out of touch with votersA double-dip recession is formingEdgy voters might reject the 2020 election outcomeHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}