{"article": [{"url": "https://finance.yahoo.com/news/walmart-plus-membership-debuts-september-15-040112184.html", "published": 1598915360.0, "headline": "Walmart unveils 'ultimate life hack,' a $98 membership with access to gas, groceries and free delivery", "body": "Walmart (WMT) will debut its highly-anticipated annual subscription-based membership called Walmart+ this month.The annual membership, which launches nationwide on Sept. 15, will cost $98 per year, or $12.95 per month, the company said. The perk is a clear shot across the bow at Amazon (AMZN) — Walmart’s fiercest retail competitor — and is being offered at a discount to the tech giant’s wildly popular, $119 per year Prime subscription.It also solidifies Walmart’s own status as an online behemoth in its own right. Throughout the pandemic, Walmart reaped the rewards of being an essential business that remained open. Recently, the company saw a massive spike in its e-commerce business, as consumers stocked up on pantry essentials and other merchandise during lockdowns.Walmart+ members will get access to unlimited free delivery on more than 160,000 items, from groceries and toiletries to toys and electronics, which will be delivered to their doorsteps as soon as the same day. To qualify, orders must be at least $35.The Walmart+ membership also features fuel discounts of up to 5 cents per gallon at Walmart, Murphy USA (MUSA) and Murphy Express gas stations. Members can access the Scan & Go feature in the Walmart App, allowing customers to pay on the spot and avoid the cashier lines.Janey Whiteside, Walmart’s chief customer officer, described the membership program as “the ultimate life hack” for its customers.“We’ve talked a lot about how the way customers shop is rapidly evolving today more than ever. We know that customers want more products than they can find in stores and online,” Whiteside said on a call with reporters.“We know they want services that solve the needs that pop up in daily lives. And we know that our customers are looking to get time back all while keeping more money in their pocket,” she added.The Walmart+ benefits are in addition to the retailer’s existing offerings such as free curbside pickup, NextDay Delivery, and two-day delivery.Story continuesTo be sure, the retailer intends to add more perks to the membership offering in the future. Walmart is also offering a 15-day free trial for the membership.Given Amazon’s growing dominance, the subscription service has been anticipated for some time now.Whiteside, however, downplayed the Amazon effect, saying that it was “really important for us... to make sure that we understood what was most important for our customers. As we went through the pandemic… what we saw was customers’ needs, and wants were changing, and, in the beginning, almost on a daily basis,” she added.According to the executive, Walmart wanted to understand what mattered to its customers and provide the right benefits that are “robust enough and that scale enough.”Shares of Walmart have climbed more than 13% year-to-date. The stock closed down $1.45, or 1.03%, at $138.85 on Monday.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Billionaire Ackman defends capitalism, but warns wealth inequality poses ‘black swan-type’ risk to investors"}]}