{"article": [{"url": "https://finance.yahoo.com/news/ll-cool-j-says-its-about-time-juneteenth-is-recognized-worldwide-135537174.html", "published": 1592557400.0, "headline": "LL Cool J says it's about time Juneteenth is recognized by people and corporations", "body": "A nation still in mourning over the murder of George Floyd by Minneapolis police — and more recently the tragic shooting death of Rayshard Brooks by police in Atlanta — enters Juneteenth with a heavy heart, but there is a glimmer of hope that race relations in the country will be better in the future.Music icon LL Cool J tells Yahoo Finance it’s about time Juneteenth gets the recognition it deserves by individuals and big corporations.“I don’t know exactly where I will do something, of course it’s about time that people recognize the day worldwide. And let me tell you something man, you know Blacks in America have come a long way. But still got a long way to go. And there’s a lot of remnants of, you know, systemic issues that still exist that try to exclude us from participating in certain things,” LL Cool J — coming off a major extension of his Rock The Bells brand online — explained to Yahoo Finance.In the minds of many, LL Cool J captured the current nationwide outrage with a two and a half minute freestyle rap recently on Instagram about the Black Lives Matter movement. View this post on Instagram A post shared by LL COOL J (@llcoolj) on May 31, 2020 at 7:13pm PDTHe added, “I would encourage people not to get bitter, but to get better. I’m definitely celebrating that day in a big way. It’s a very important day to me, a very important day to Black people. It’s beautiful to say like when we get to the point where we can all celebrate ourselves without being intimidated by others, or being like when we can celebrate our ethnic and cultural differences in a way that is not offensive to everybody else. That’s going to be a beautiful day, but we’re not there yet. But that’s going to be a beautiful day.”Juneteenth is the oldest nationally celebrated commemoration of slavery coming to an end in the U.S. It dates back to 1865 — on June 19 the Union soldiers went to Galveston, TX. with news the Civil War ended and that slaves were free.Story continuesThe day takes on even more meaning this year as protests have erupted worldwide over racial injustice, sparked by the deaths of Floyd and Brooks.Amazon founder and CEO Jeff Bezos has encouraged all his employees to cancel meetings (as he will be doing) to observe Juneteenth. Meanwhile, Twitter, Nike, Target and NFL teams such as the Denver Broncos and Detroit Lions will count the day as a paid holiday for workers.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Magic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}