{"article": [{"url": "https://finance.yahoo.com/news/next-coronavirus-relief-package-should-take-note-of-racial-inequality-roger-ferguson-134053855.html", "published": 1597222100.0, "headline": "Next coronavirus relief package should ‘take note’ of racial inequality: Roger Ferguson", "body": "While Congress mulls another round of coronavirus relief, people of color suffer disproportionately amid the pandemic, making them more likely to contract the disease or lose their jobs than their White counterparts.The next stimulus package should take into account such racial inequities, says Roger Ferguson, the president and CEO of TIAA, a top investment and financial services firm.Ferguson, one of four Black CEOs of a Fortune 500 company, attributed worse outcomes for people of color to inequities “built into the system” over many years.“There is a pattern here that is playing out in these virus impacts, but that goes back in the history of the country,” Ferguson says. “I do think it's important for Congress to acknowledge and take note of that.”The outbreak’s divide along racial lines deserves “national attention,” Ferguson, who formerly served as a vice chairman for the Federal Reserve, told Yahoo Finance on July 30.Negotiations over the next round of relief funds have reached a stalemate, Senate Majority Leader Mitch McConnell (R-KY) said on Tuesday. Disagreement between Democrats and Republicans on Capitol Hill centers on the size of the package, how much compensation to provide unemployed Americans, aid to state and local governments, and other issues.Data released last month by the Centers for Disease Control and Prevention showed that Black and Latino Americans have been almost twice as likely to die from the coronavirus as their White counterparts. Meanwhile, a survey published by Fortune in June found that Black Americans had been twice as likely to lose their job than their White counterparts, and Hispanics were nearly twice as likely.“We have to recognize the reality that the coronavirus has disproportionately affected minorities for a variety of reasons,” Ferguson says. “Thinking through the process of helping to rebuild those communities — I think is very, very important.”Despite the heightened challenges that face communities of color in the U.S., housing and small business aid from prior rounds of stimulus have struggled to reach people of color. Racial justice groups called on Congress last week to address racial inequality in the next coronavirus relief package.Story continuesNEW YORK, NY - SEPTEMBER 20: TIAA CEO Roger Ferguson Jr. speaks during the 2018 Yahoo Finance All Markets Summit at The Times Center on September 20, 2018 in New York City. (Photo by John Lamparski/Getty Images)Ferguson spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Last week, Congressional Democrats introduced a bill that would make closing the racial gap in employment, wealth, and other facets of economic life a formal part of the Federal Reserve’s mission.Members of Congress have considered several ways to direct coronavirus aid to communities of color, including funds for local community development organizations or historically Black colleges and universities, Ferguson said.“I think it is important for Congress to take note of the reality around them,” he says. “That this virus has disproportionately impacted people of color.”Read more:Misty Copeland: Coronavirus will impact ballet for 'years to come’Bill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}