{"article": [{"url": "https://finance.yahoo.com/news/u-core-capital-goods-orders-134407475.html", "published": 1598431940.0, "headline": "U.S. core capital goods orders rise; recovery uneven as COVID-19 shifts spending", "body": "By Lucia MutikaniWASHINGTON (Reuters) - New orders for key U.S.-made capital goods increased in July, though the pace slowed from June's robust gain, suggesting the rebound in business investment would be gradual amid uncertainty about the course of the COVID-19 pandemic.The report from the Commerce Department on Wednesday showed an uneven recovery in investment as the coronavirus crisis shifts spending away from equipment used in the services industries such as restaurants and bars to purchases of goods like home electronics.\"While orders are nearly back to their pre-pandemic levels, the slowing pace of gains suggests it will take a while for activity to fully recover,\" said Lydia Boussour, a senior U.S. economist at Oxford Economics in New York.\"We do not expect business investment to reach its pre-pandemic level before mid-2022.\"Orders for non-defense capital goods excluding aircraft, a closely watched proxy for business spending plans, increased 1.9% last month. These so-called core capital goods orders jumped 4.3% in June, which was the largest gain in six years.Core capital goods orders are slightly below their pre-pandemic level. They fell 1.9% on a year-on-year basis in July. Last month's rise in orders matched economists' expectations.Graphic: Core capital goods https://graphics.reuters.com/USA-STOCKS/azgvonkjwpd/corecap.pngThough new coronavirus cases have subsided after a broad resurgence following the reopening of businesses in May, the path of the pandemic remains unclear, with many hot spots remaining. There are growing signs that the economy's recovery from the pandemic is slowing or even reversing.At least 28 million people are on unemployment benefits and bankruptcies are rising as government aid rolled out at the start of the pandemic dries up. Regional Federal Reserve surveys showed a moderation in factory activity in the New York state and the mid-Atlantic regions this month. Consumer confidence fell to a six-year low in August.Story continues\"The trends in economic indicators have not changed significantly,\" economists at Bank of America Securities wrote in a research note. \"We likely need to see daily COVID-19 cases decline much more significantly in order for gains in economic activity to accelerate meaningfully.\"The economy slipped into recession in February.Stocks on Wall Street were trading higher. The dollar <.DXY> was little changed against a basket of currencies. U.S. Treasury prices fell.LEAN ORDER BOOKSCore capital goods orders last month were supported by demand for machinery, fabricated metals products, computers and electronic products and electrical equipment, appliances and components. Unfilled core capital goods orders edged up 0.1%. That followed a 0.2% gain in June.\"The recovery remains uneven between investment that complements COVID-life and that which does not,\" said Sarah House, a senior economist at Wells Fargo Securities in Charlotte, North Carolina. \"Computers and communications orders have surpassed their February levels, while orders for machinery and metals continue to dig out from the hole left by shutdowns and more muted profit outlooks.\"Shipments of core capital goods increased 2.4%. Core capital goods shipments are used to calculate equipment spending in the government's gross domestic product measurement. They shot up 3.8% in June, but remain 0.4% below their February level.The shuttering of nonessential businesses in mid-March and a collapse in oil prices helped to undercut business investment, which was already under pressure from the Trump administration's trade war with China.Business investment tumbled at a record 27% annualized rate in the second quarter, with spending on equipment collapsing at an all-time pace of 37.7%. Investment in equipment has now contracted for five straight quarters.Economists expect the government will report a historic drop in corporate profits in the second quarter on Thursday when it publishes its second estimate of GDP for the last quarter.Orders for durable goods, items ranging from toasters to aircraft that are meant to last three years or more, surged 11.2% in July after advancing 7.7% in June. Durable goods orders have recouped losses suffered during the shutdown and are almost back at their pre-pandemic level.Durable goods orders were boosted by robust demand for motor vehicles, which powered ahead 21.9% after accelerating 85.6% in June. There were no orders reported for civilian aircraft. Orders for transportation equipment jumped 35.6% last month after rising 19.7% in June. Motor vehicles have a bigger weighting in the transportation category.Boeing <BA.N> reported no aircraft orders in July after receiving only one in June. The planemaker has struggled with cancellations as airlines grapple with sharply reduced demand for air travel because of the pandemic.The grounding of Boeing's best-selling 737 MAX jets since March 2019 after two crashes in Indonesia and Ethiopia has also weighed on the company.Unfilled durable goods orders fell 0.8% in July after declining 1.4% in June. Durable goods inventories fell 0.5%.(Reporting by Lucia Mutikani; Editing by Chizu Nomiyama, Paul Simao and Andrea Ricci)"}]}