{"article": [{"url": "https://finance.yahoo.com/news/apple-could-still-go-higher-after-hitting-15-trillion-valuation-203801481.html", "published": 1591890380.0, "headline": "Apple could still go higher after hitting $1.5 trillion valuation: Analyst", "body": "Apple’s (AAPL) market value hit a new all-time high on Wednesday, eclipsing $1.5 trillion, and making it the first U.S. company to ever hit that mark. And while the market is certain to have ups and downs, like the subsequent rout on Thursday, industry analysts still believe the iPhone maker has more than enough room to continue growing.Wedbush analyst Dan Ives has pointed to Apple’s market capitalization hitting $2 trillion, and BofA Securities’ Wamsi Mohan upgraded the stock’s price target from $340 to $390 a day after Apple hit its new peak.Apple CEO Tim Cook arrives to the global premiere for Apple's \"The Morning Show\" at the Lincoln Center in the Manhattan borough of New York City, U.S., October 28, 2019. REUTERS/Eduardo MunozSo what’s driving Apple’s market performance? Well, its hundreds of millions of active users, wildly popular accessories, and its plethora of services are easily the biggest draws. However, the company could still face trouble as a result of trade disputes. And its Apple TV+ service still hasn’t taken off the way it was expected to.The case for Apple’s continued growthJust a few months ago, Apple was facing major obstacles in the form of supply-chain interruptions and store closures caused by the coronavirus pandemic. The company eventually pulled its Q2 guidance and hasn’t issued guidance for Q3.But Apple still managed growth in Q2 on the strength of its services and accessories business, despite a 7.2% year-over-year drop in iPhone revenue.Apple, however, has a potentially massive revenue generator in its upcoming iPhone, which is expected to be called the iPhone 12. The phone, which could be delayed until October due to the coronavirus’ impact on the company’s supply chain, is all but certain to be Apple’s first 5G-capable device.According to Ives, the phone should be a sales monster for Apple, launching a so-called “super cycle” with consumers rushing to get Apple’s first device sporting next-generation connectivity.Apple team members demo the new cameras on iPhone 11 Pro for guests during an event to announce new products Tuesday, Sept. 10, 2019, in Cupertino, Calif. (AP Photo/Tony Avelar)“With 350 million of roughly 950 million iPhones worldwide currently in a window of an upgrade opportunity, Cupertino is roaring its engines ready to capitalize on this dynamic coupled by an AirPods franchise slated to sell 85 million this year (vs. 65 million last year),” Ives wrote in a May research note.Story continuesMohan, meanwhile, points to Apple’s wearables lineup, in addition to the 5G iPhone, as a key reason for the stock’s continued growth.Moving forward, Mohan sees the company’s transition to a continuous revenue model as a reason for its potential.Apple’s services business, which consists of the App Store, Apple Music, AppleCar, and iCloud, is a major engine for the company, earning $13.3 billion in Q2. But Apple TV+, the firm’s answer to Netflix (NFLX), isn’t quite as popular as competing offerings.Potential blind spotsAccording to Bloomberg, as of May, the TV+ service, which launched in November 2019, had 10 million subscribers, with just 5 million active on the platform. Compare that to Disney+, which also launched in November and already had 50 million users as of April.It’s worth noting that Disney+ is more expensive than Apple TV+, $7.99 per month versus $4.99 per month. Disney, however, has access to its incredible backlog of movies and TV shows, as well as 20th Century Fox’s shows and movies.It’s clear that Apple needs to make moves to accelerate Apple TV+ growth, and according to Ives, that could involve the company scooping up a Hollywood studio. Bloomberg also reports that the tech giant is looking into deals for older shows and movies, something Apple was hesitant to do out of a desire to rely solely on its own original content.Then there are potential trade disputes that Apple has to worry about. With tensions between the U.S. and China continuing to ratchet up as a result of China’s clampdown on Hong Kong and the ongoing back and forth between the two countries on the origins of the coronavirus, there are fears that a new trade dispute could break out.The U.S.’s decision to restrict American companies from working with China’s Huawei could also come back to haunt Apple if Chinese consumers decide to boycott Apple’s goods in retaliation. What’s more, if China decided to hit directly at Apple by placing it on some kind of trade blacklist, it would be difficult for the company to quickly move its manufacturing operations to a new location.For now, however, Apple is seemingly riding out both the virus and transnational strife with relative ease.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Social Chain CEO: Brands need to bring change that ‘lasts longer than a trending topic’Amazon customers are less happy about the service despite massive pandemic boostVenture capitalist Bradley Tusk calls for repeal of law protecting internet companiesWhat is a VPN and should I use one?: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}