{"article": [{"url": "https://finance.yahoo.com/news/ap-sources-whitmer-met-biden-053531735.html", "published": 1596847400.0, "headline": "AP sources: Whitmer met with Biden as he nears VP decision", "body": "LANSING, Mich. (AP) — Gov. Gretchen Whitmer traveled to Delaware last weekend to meet with Joe Biden, the presumptive Democratic presidential nominee's first known in-person session with a potential running mate as he nears a decision.Whitmer visited Biden Sunday, according to two high-ranking Michigan Democrats who spoke on the condition of anonymity because they were not authorized to discuss the matter publicly. The first-term governor of the battleground state has long been on his short list of possible running mates.Flight records show a chartered plane left Lansing's Capital Region International Airport for Delaware Coastal Airport at 5:33 p.m. and returned at 11:16 p.m.The governor's office declined to confirm or deny the trip.“We don't discuss her personal schedule,” spokeswoman Tiffany Brown said.Biden's campaign declined to comment.He has spent months weighing who would serve alongside him if he wins in November. Biden has pledged to select a woman and has conducted an expansive search, including Sens. Kamala Harris of California and Elizabeth Warren of Massachusetts, California Rep. Karen Bass and former Obama national security adviser Susan Rice.Biden is facing calls to select a Black woman to acknowledge their crucial role in Democratic politics and in response to the nation's reckoning with systemic racism.Whitmer has sought to address racism and racial inequity. In April, she created a task force to address the pandemic’s racial disparities and later proposed police reforms in the wake of George Floyd’s death. On Wednesday — days after visiting Biden — she declared racism a public health crisis, created an advisory council of Black leaders and required implicit bias training for all state employees.If Whitmer is chosen to join the ticket and Biden wins, Lt. Gov. Garlin Gilchrist II would become the country’s only Black governor.Biden and Whitmer formed a bond after he campaigned for her in the 2018 gubernatorial election. She is a co-chair on his campaign.Story continuesHer profile has grown since delivering the Democrats' response to President Donald Trump's State of the Union address and especially amid the pandemic. She has taken aggressive steps to curb the coronavirus in a state that was a hot spot nationally early on and — after she criticized the federal response — has drawn criticism from Trump, who in March urged Vice President Mike Pence not to call \"the woman in Michigan.”___Follow David Eggert at https://twitter.com/DavidEggert00"}]}