{"article": [{"url": "https://finance.yahoo.com/news/trumps-health-care-sham-154334003.html", "published": 1601031080.0, "headline": "Trump’s health care sham", "body": "More than three and a half years into his four-year term, President Trump has finally revealed something he calls his health care plan. The upcoming election against Democratic nominee Joe Biden might have something to do with it.Part 1 of Trump’s plan is an executive order declaring Trump’s support for a law that already exists. On Sept. 25, Trump signed an order declaring that it’s the policy of the U.S. government to protect people with preexisting conditions. But the Affordable Care Act, which Congress passed 10 years ago, already prohibits insurers from charging people more if they have preexisting conditions, or denying them coverage. Trump’s order doesn’t enhance that in any way, and it has no legal standing.Part 2 of Trump’s health care plan is a request to Congress to pass legislation banning surprise medical bills, like those some patients get when they unknowingly get “out of network” care that’s not covered by their insurance. If Congress doesn’t pass such a law by the end of the year—which it won’t—Trump will try to ban surprise billing by executive order, which won’t work because the president can’t enact laws on his own.Democratic presidential candidate Joe Biden delivers remarks after meeting with Pennsylvania families who have benefited from the Affordable Care Act on June 25, 2020 in Lancaster, Pennsylvania. (Photo by JIM WATSON/AFP via Getty Images)Part 3 is some free money for seniors, if Trump can find $6 billion somewhere and reappropriate it without provoking a lawsuit. Trump says he’ll send 33 million seniors a $200 discount card to defray the cost of prescription drugs. If this actually happens, you can bet the cards will have the Trump name on them, to remind recipients who’s giving them the free money. The money would supposedly come from the savings from another dubious program that hasn’t gone into effect yet, suggesting seniors may never see the discount cards. Trump could try to divert the $6 billion from some other program, but that would likely produce litigation and long delays.There are other plans Trump has rolled out before to import drugs from Canada—where prices are substantially lower—and allow some Americans to buy cheaper health insurance with fewer benefits. Add it all up and Trump can claim that as his first term ends, he finally has a health care plan that ought to earn him a second term.Story continues‘Overblown’ and ‘bizarre’But Trump’s plan is unlikely to change anything at all. In an analysis of the Trump announcements, Beacon Policy Advisors called the new measures “several of the most bizarre executive orders that he has yet released. Regarding pre-existing conditions, Trump’s order is perhaps the most overblown of his whole term thus far. While these executive orders may give the president ammunition to use against Biden during the upcoming presidential debates, we expect that it will only appeal to the lowest of low information voters.”The backdrop for Trump’s anemic health care plan is a Supreme Court case that could kill the ACA and leave millions of Americans exposed to exorbitant health care costs. Trump has sided with the plaintiffs in the case, who argue that a change to the individual mandate Congress passed in 2017 should invalidate the entire law. The Supreme Court will hear the case on Nov. 10—one week after Election Day—and probably rule in June of 2021. If the court strikes down the whole law, insurers could once again charge people more if they have a history of cancer or heart disease or any other illness, or deny them coverage altogether.Republicans in Congress have proposed legislation to protect the 54 million Americans under 65 who have preexisting conditions, if the ACA dies. But those bills aren’t as thorough as the ACA and there’s no guarantee Congress could even pass health care legislation, given how contentious the issue is. The quick demise of the ACA would probably throw the health care system into turmoil and leave millions newly vulnerable.This photo taken Thursday, July 27, 2017, shows a man walks by an healthcare insurance office in Hialeah, Fla. (AP Photo/Alan Diaz)Biden has a raft of plans to address the coronavirus pandemic, fix flaws in the ACA, lower the Medicare eligibility age and offer new government options to people who still can find affordable health insurance. Those, too, would require Congressional legislation that could be hard to pass. Yet Trump is surely aware that Biden has a huge edge with voters on the issue of health care. Recent surveys by the Commonwealth Fund find Biden far ahead of Trump in 10 swing states on three issues voters say matter most: addressing the coronavirus pandemic, lowering health care costs and protecting people with preexisting conditions. And that was before the death of Supreme Court Justice Ruth Bader Ginsburg weakened support for the ACA on the Supreme Court.There’s no information about any health care plan on Trump’s campaign website, reflecting the sketchiness of what Trump has actually proposed. But he’ll be bragging about a terrific health care plan nonetheless, and asking voters to give him another chance to accomplish things he didn’t bother to address during his first term.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Democrats can save ObamacareHow Biden would undo the Trump tax cuts5 campaign promises Trump has given up onWhy Trump wants to shackle the postal serviceEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}