{"article": [{"url": "https://finance.yahoo.com/news/bidens-tax-plan-is-a-liability-183544480.html", "published": 1598535800.0, "headline": "Why Biden's tax plan is risky", "body": "You’ll hear this a lot from President Trump over the next 10 weeks: Joe Biden wants to raise your taxes.That’s not exactly true, but it’s not exactly false, either. Biden wants to raise business, income, capital-gains and other types of taxes. He says this will only affect people with incomes above $400,000. But analysis by the Tax Policy Center finds that middle-class incomes would drop a bit as well, because a small portion of the business tax hikes would be passed on to workers as slightly lower wages. So while middle-class tax rates wouldn’t go up, middle-class wallets might lighten by a few bucks.Is this a middle-class tax hike? It depends which candidate, Biden or Trump, wins the messaging war in the homestretch of the 2020 presidential election. “The Biden campaign is going to tell you the tax increases will only impact those making $400,000 or more per year,” Isaac Boltansky of Compass Point Research & Trading says on the latest episode of our Electionomics podcast. “That line, I just don’t think is going to work, especially in the debates.”Biden isn’t shy about touting his tax plan. On a call with donors in June, he said, unprompted, that he was going to eliminate the 2017 Trump tax cuts and close loopholes that benefit the wealthy, “and a lot of you may not like that.” The Trump tax cuts are generally unpopular, because many people they favored businesses and the wealthy too much. Polls show most Americans are comfortable with higher taxes on the wealthy. So Biden is on safe terrain as long as voters think tax hikes will stop at an income threshold well above middle-class standards.The problem for Biden is that his plan to raise taxes gives Trump an opening to tar him as a middle-class pickpocket, whether accurate or not. Eric Trump, Nikki Haley, Elise Stefanik and several other speakers at this week’s Republican convention said falsely that Biden plans to tax most American workers. Trump obviously has as bigger megaphone than Biden, since the president can command national coverage just about any time he steps up to a podium. Biden is staying close to home in Delaware, doing limited press interviews and mostly answering Trump online.Story continuesBiden doesn’t want to raise taxes just for the sake of it. His tax hikes are all linked to plans that need funding to pay for them. Raising the corporate tax from 21% to 28% would help pay for Biden’s climate plan and affordable housing plan, for instance. Raising the capital-gains tax would fund Biden’s health care plan. Higher income taxes on the wealthy would help cover Biden’s student-loan forgiveness plan. An important caveat: Biden’s only chance of passing any of these plans is with a Democrat majority in the Senate, and even then it could be tough.It’s those plans Biden needs voters to think about, not the tax hikes that will pay for them. “I think what you’re going to see from the Biden campaign is, our plan will increase the rate for high earners and corporations, but we plan to broadly expand our fiscal support and the social safety net, ” Boltansky says. “Taxes will go up, but for those of you in the low to moderate income bucker, there are a number of fiscal policies that we’re going to push.”The national conventions mark the beginning of the final phase of the presidential campaign, when voters start to pay more attention and the candidates pour resources into winning key states. This is when messaging becomes crucial. We already know Biden will cast Trump as a reckless leader endangering the nation, while Trump will paint Biden as a senile socialist coming for your paycheck. That’s where Biden’s tax plan matters. Will voters perceive Biden’s tax plan as a ruinous money grab? Or a way of funding sensible reforms? That depends on how effectively Biden communicates with voters during the next two months.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:5 campaign promises Trump has given up onThe Trump campaign’s bogus boom timesWhy Trump wants to shackle the postal service11 ways Trump is out of touch with votersEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}