{"article": [{"url": "https://finance.yahoo.com/news/goldman-a-national-policy-on-face-masks-may-save-lives-and-the-economy-175932952.html", "published": 1593522440.0, "headline": "Goldman: A national policy on face masks may save lives — and the economy", "body": "Wear a mask, save a life — and maybe the U.S. economy as well?Goldman Sachs is making a forceful case for imposing a federal mandate on citizens to wear masks. The bank’s economists argue the policy has the added benefit of reducing new coronavirus infections — and the likelihood of renewed lockdowns that would decimate economic growth even more.However, “there are also other ways to reduce infections, including stringent bans on large gatherings and greater use of face masks,” Goldman wrote in research published late Monday.In doing so, the bank argued in favor of a nationwide mask mandate, a move embraced recently by House Speaker Nancy Pelosi yet fulsomely rejected by civil libertarians. Face coverings have grown more polarizing in the face of surging coronavirus infections, particularly in new epicenters in Sun Belt states.Wall Street has been buffeted by fears that a new wave of COVID-19 infections could derail the relaxation of stay-at-home orders throttling growth. Investors have largely discounted rising infections, but fear a return to the restrictive lockdowns that brought public life to a screeching halt in March.Still, Goldman wrote that “a national face mask mandate could partially substitute for renewed lockdowns,” with its data suggesting that a federal standard “would likely increase face mask usage meaningfully, especially in states such as Florida and Texas where masks remain largely voluntary to date.”‘Significantly better outcomes’A groundswell of localized opposition belies the fact that most Americans have adopted using masks, despite aesthetic concerns and ideological dispositions. A Pew Research poll last week found that at least 65% of Americans have adopted the near constant use of personal protective equipment (PPE), in line with Goldman’s own data.“We find that face masks are associated with significantly better coronavirus outcomes,” the bank’s economists wrote, with those findings bolstered by data suggesting “a largely causal impact of masks rather than correlation with other factors (such as reduced mobility or avoidance of large gatherings).”Story continuesThe argument is being shaped by the historical relationship between the federal government and states being allowed to go their own way on some issues.While the U.S. has a national recommendation for public masking in place, it falls short of an enforceable requirement. Vice President Mike Pence has resisted the call for a national mandate, while President Donald Trump refuses to wear a mask in public at all.However Goldman’s baseline assumptions suggest “a national mandate could raise the percentage of people who wear masks by 15 percentage points, and cut the daily growth rate of confirmed cases by 1.0 to 0.6%.”By extension, a mask mandate could function as a stand-in for new lockdowns that would shave nearly 5% from gross domestic product (GDP), the bank added.Medical workers treat a coronavirus disease (COVID-19) patient at the United Memorial Medical Center's coronavirus disease (COVID-19) intensive care unit in Houston, Texas, U.S., June 29, 2020. REUTERS/Callaghan O'HareThe mask debate has profound public health implications, as well as import for an economy still reeling from the COVID-19-related lockdowns. The debate has converged with a general fatigue among citizens weary of quarantines and widespread social unrest challenging official efforts to prevent further spreading.Dr. Hilary Fairbrother, a Houston emergency medicine physician at the McGovern Medical School, told Yahoo Finance last week that social distancing in the hard-hit Lone Star State “didn’t stick” because the initial wave of coronavirus cases was relatively tame.Once quarantine fatigue set in, “people started gathering, weren’t wearing masks anymore and went to see family and local vehicular travel,” all of which contributed to the current surge, Fairbrother added.And a desultory and mostly voluntary masking policy has worsened the problem in places like Arizona and Texas, doctors in those regions contend. Goldman’s data found that face mask mandates have “large and highly statistically significant effects” on public health.“Our estimates imply that mask mandates lower the infection growth rate by 1.3 percentage points in the 11-15 days after announcement” and curb the rate of infections by 25%, the bank noted.“We also estimate significant and somewhat larger declines in the growth rate of COVID-19 fatalities of 2.4 percentage points in the 11-15 days after announcement and of 3.7 percentage points in the 21-29 days after,” it added.Although the prospect of another nationwide lockdown is seen as a low probability event, it’s not entirely impossible as new case surges in key parts of the country force local officials to roll back their reopening plans.“At this point, there seems to be little appetite for widespread stay-at-home orders or business closures such as those implemented in most states in late March and April,” Wells Fargo wrote in an analysis last week.“Still, the intensification of the virus could, by itself, harm economic activity, even in the absence of new lockdown orders,” the bank’s analysts said.“Even without official government intervention, there is also the risk that a renewed outbreak could curb spending if households pull back from the economy or businesses close out of fear of the virus,” Wells added."}]}