{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-extra-300-unemployment-benefits-could-run-out-faster-than-many-realize-190210741.html", "published": 1597759820.0, "headline": "Coronavirus stimulus: Extra $300 unemployment benefits could run out faster than many realize", "body": "The additional $300 of unemployment benefits authorized by President Donald Trump’s memorandum may last less than a month — if states distribute them at all.Initially, experts expected the benefits to last around five weeks, but under the latest guidance from the Federal Emergency Management Agency (FEMA), jobless Americans are guaranteed the extra $300 for only three weeks.States must apply for the additional unemployment benefits first. When approved, they “will receive an initial obligation of three weeks of needed funding,” according to the FEMA guidelines. Any extra after that will be decided on a week-by-week basis until the funds deplete.“It all depends on whether or not there's enough money in the disaster relief fund,” Michele Evermore, a senior policy analyst at the National Employment Law Project, told Yahoo Money.US President Donald Trump signs executive orders extending coronavirus economic relief, during a news conference in Bedminster, New Jersey, on August 8, 2020. (Photo by JIM WATSON/AFP via Getty Images)‘It's the exact same pot of money’The FEMA funds are not just for funding the unemployment benefits; they also fund disaster relief, meaning they could run out sooner than expected. For instance, Iowa’s Gov. Kim Reynolds this weekend requested $4 billion for those affected by the recent derecho storm in her state. The request was approved by the president.“They're applying for FEMA aid and it's the exact same pot of money that's being used for employment insurance benefits,” Evermore said. “I imagine this will happen more than once in the next month.”The disaster relief fund has more than $70 billion. Under Trump’s memorandum, up to $44 billion is available for unemployment benefits. But this sum can also be used for aid if a disaster occurs. If the total amount in the fund dips below $25 billion, any remaining money can be used only for disaster relief, not unemployment benefits.Read more: Here’s what you need to know about unemployment benefits eligibilityAfter the states get approved for funding, “it can take several weeks” for the extra benefit to be distributed, according to Evermore.This comes as more than 28 million Americans have lost the extra $600 in weekly unemployment benefits under the CARES Act at the end of July and have since seen a drop in benefits ranging from 52% to 72%, according to an analysis by Evercore ISI.Story continuesUnemployed Americans see a drop in their unemployment benefits between 52% to 72% without the extra $600, according to an analysis by Evercore ISI. (Graphic: David Foster/Yahoo Finance)Which states have committed to paying the benefits?So far, seven states have been approved to receive unemployment funding: Arizona, Colorado, Iowa Louisiana, Missouri, New Mexico, and Utah. Arizona is the only state that has received the funding already.“Arizona has actually already received the money that they're paying out in benefits,” Evermore said. “I'm not sure what they're doing in Arizona. What they might have done is set up their own side system last week to pay a benefit and they're just getting that reimbursed.”To apply for the benefits, states must put together a memorandum with FEMA, showing they have the ability to administer the funds and certifying they have a match that works.States have two options for matching the benefit. One option allows states to count $100 in unemployment benefits they are already paying out to recipients as the extra $100 described in Trump’s memorandum. The second option is for states to find funds to provide an additional $100.Yahoo Money sister site Cashay has a weekly newsletter.South Dakota is the first state to decline the additional benefits. The state governor cited that the state has recovered most of the jobs lost due to COVID-19, and that it has the lowest insured unemployment rate in the nation.The insured unemployment rate shows what percent of the labor force is currently collecting Unemployment Insurance (UI) benefits and leaves out those collecting benefits like Pandemic Unemployment Assistance (PUA) that 10 million Americans are receiving.“It's really hard to get an Unemployment Insurance (UI) benefit in South Dakota,” Evermore said. “They don't have the lowest unemployment rate, but they have the lowest insured unemployment rate.”Denitsa is a writer for Yahoo Finance and Cashay, a new personal finance website. Follow her on Twitter @denitsa_tsekova.Read more:Analysis: 1 in 3 jobless Americans could be left out of Trump's action on unemploymentEven as GDP tanked, personal income grew thanks to government supportRead more personal finance information, news, and tips on CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and Reddit."}]}