{"article": [{"url": "https://finance.yahoo.com/news/apple-arm-processor-intel-191921295.html", "published": 1592836040.0, "headline": "Apple is ditching Intel to build its own processors for its MacBook and iMac systems", "body": "Apple is officially ditching Intel. The announcement came during the iPhone maker’s WWDC 2020 developers conference, at which Apple said it will begin using its own ARM-based processors instead of Intel’s chips in its MacBook Pro and iMac computers running Apple’s (AAPL) new Big Sur operating system.The change is expected to dramatically improve performance and battery life for Apple’s laptops and desktops, and, according to CEO Tim Cook, will enable the company to better build out future features.Apple has already produced 10 generations of its ARM-based, A-series chips found in its iPhone and iPad, and pointed to the performance of the iPad Pro as proof that the new chips will be able to handle heavy-duty apps like video and photo editing programs.Apple says the change will create a common architecture across the company’s entire ecosystem, from iPhone, Mac, Apple Watch, and Mac, allowing developers to bring apps across those product lines with relative ease.According to Apple’s head of software, Craig Federighi, the company is already running some of its newest apps natively on the new silicon. Developers, meanwhile, should be able to quickly move their apps over to the new hardware using Apple’s Xcode software.Apple says that big-name developers including Microsoft and Adobe are already working on software that runs on the new processors with Federighi showing demos of Microsoft’s Office and Adobe’s Lightroom running on a Mac powered by an A12z processor.Final Cut Pro was also shown running 4K video on Apple’s new chip, allowing Federighi to add special effects to a video project while it was running live.Developers who can’t switch their existing apps to work on the new silicon via Xcode will be able to use a new feature called Rosetta 2. That software allow Intel apps to run on the new chips by translating them to work with the ARM-based architecture at their install phase. Apple says Rosetta 2 can handle professional apps with plug-ins, and in a demo was shown running the game “The Shadow of the Tomb Raider” on Apple’s new hardware without a hiccup.Story continuesApple SiliconApple’s history with IntelApple first began using Intel (INTC) chips in its systems in 2006 after transitioning away from its PowerPC architecture. Intel’s chipsets have given the tech giant’s computers plenty of power over the years, but Apple is keen on bringing more of its devices’ components in house, minimizing its dependence on outside suppliers.The challenge for Apple will be ensuring that it can squeeze the same amount of horsepower out of its new ARM chips to rival, or overtake, those made by Intel. ARM chips are great for mobile devices because of their impressive energy efficiency, which enables smartphones and tablets to run for hours at a time without needing a charge.But performance has never been its strong suit. Look no further than reviews of recent Windows PCs running ARM-based processors. While they pack plenty of battery life, they lack in speed and functionality compared to Intel-based systems.From the look of Apple’s demo, though, the company is well on its way to providing some seriously powerful systems.According to Cook, Apple will roll out its new line of Macs and iMacs running on the company’s own hardware in the coming year. The company still has some new Intel-powered systems in its pipeline, but according to Cook, the company will fully transition to its new chips within the next two years.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple to close retail stores in 4 states amid coronavirus outbreaksWhy Microsoft and Amazon are calling on Congress to regulate facial recognition technologyThe PlayStation 5’s most important feature will be its price5 Father’s Day tech gifts: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}