{"article": [{"url": "https://finance.yahoo.com/news/apple-removes-fortnite-game-app-195056396.html", "published": 1597330700.0, "headline": "Fortnite maker sues Apple, Google after removal of game from app stores", "body": "By Stephen Nellis and Munsif Vengattil(Reuters) - Apple Inc and Alphabet Inc's Google on Thursday removed popular video game \"Fortnite\" from their app stores for violating the in-app payment guidelines, prompting developer Epic Games to file federal antitrust lawsuits challenging their rules.Apple and Google cited a direct payment feature rolled out on the Fortnite app earlier in the day as the violation.Epic sued in U.S. court seeking no money from Apple or Google, but rather injunctions that would end many of the companies' practices related to their app stores.\"Apple has become what it once railed against: the behemoth seeking to control markets, block competition, and stifle innovation. Apple is bigger, more powerful, more entrenched, and more pernicious than the monopolists of yesteryear,\" Epic said in its lawsuit, filed in the Northern District of California.Epic also attacked Apple on social media, launching a campaign with the hashtag #FreeFortnite, urging players to seek refunds from Apple if they lose access to the game, and creating a parody of Apple's famous \"1984\" television ad.In the parody, which quickly garnered hundreds of thousands of views, a female Fortnite fighter hurls a unicorn-shaped club to smash a screen on which an Apple-headed character speaks of \"the anniversary of the platform unification directives.\"Apple takes a cut of between 15% and 30% for most app subscriptions and payments made inside apps, though there are some exceptions for companies that already have a credit card on file for iPhone customers if they also offer an in-app payment that would benefit Apple.Analysts believe games are the biggest contributor to spending inside the App Store, which is in turn the largest component of Apple's $46.3 billion-per-year services segment.In a statement, Apple said Fortnite was removed because Epic had launched the payment feature with the \"express intent of violating the App Store guidelines\" after having had apps in the store for a decade.Story continues\"The fact that their (Epic) business interests now lead them to push for a special arrangement does not change the fact that these guidelines create a level playing field for all developers and make the store safe for all users,\" Apple said.Google also removed \"Fortnite\" from its Play Store, but the company's spokesman Dan Jackson declined to comment on the lawsuit when contacted by Reuters.\"However, we welcome the opportunity to continue our discussions with Epic and bring Fortnite back to Google Play,\" he said in a statement. Jackson said Epic violated a rule requiring developers to use Google's in-app billing system for products within video games.Apple and Google were among the major American technology companies to come under anti-competition scrutiny in a hearing before lawmakers last month.During the hearing, Apple Chief Executive Tim Cook argued that Apple is not anti-competitive because it does not have majority share in any markets where it operates, including mobile phones, where devices powered by Alphabet Inc's Android have greater market share.Epic's lawsuit, however, argued that app distribution and in-app payments for Apple devices constitute their own distinct market for anti-competition purposes because Apple users rarely leave its \"sticky\" ecosystem.Epic's free-to-play battle-royal videogame \"Fortnite\" has reached massive popularity among young gamers since its launch in 2017, and competes with Tencent Holdings' \"PlayerUnknown's Battlegrounds\".The title's removal from the App Store means that new players will not be able to download it and that existing players cannot receive updates, but the game should continue to work on devices where it is already installed.Epic Games does not disclose how many iOS users \"Fortnite\" has. Many fans play the game primarily on PCs or gaming consoles while using their mobile phones as a backup, but iPhone users generate far more revenue for Epic.In both Apple's App Store and Google's Play Store, \"Fortnite\" had about 2 million downloads in July 2020, according to mobile analytics firm SensorTower. But Apple users spent about $34 million while Android users spent only $2 million, according to SensorTower data.Because Android functions differently from iOS, users can still download \"Fortnite\" from Epic's website and other non-Google stores such as the one run by Samsung Electronics Co Ltd and install it on their devices, Epic said in a blog post on Thursday.\"Epic is not seeking any monetary relief, but rather only an order enjoining Google from continuing to impose its anti-competitive conduct on the Android ecosystem,\" it said in its lawsuit.In a statement, Spotify Technology SA, a streaming music rival to Apple that has filed an antitrust complaint against the iPhone maker in Europe, applauded Epic's move.\"Apple's unfair practices have disadvantaged competitors and deprived consumers for far too long,\" Spotify said.(Reporting by Munsif Vengattil and Ayanti Bera in Bengaluru, Stephen Nellis and Paresh Dave in San Francisco; Additional reporting by Bhargav Acharya and Aishwarya Nair in Bengaluru; Editing by Sriraj Kalluvila, Daniel Wallis and Arun Koyyur)"}]}