{"article": [{"url": "https://finance.yahoo.com/news/trump-suspend-certain-foreign-worker-195610855.html", "published": 1592838260.0, "headline": "Trump suspends entry of certain foreign workers despite business opposition", "body": "By Ted HessonWASHINGTON (Reuters) - U.S. President Donald Trump suspended the entry into the United States of certain foreign workers on Monday, a move the White House said would help the coronavirus-battered economy, but which business groups strongly oppose.Trump issued a presidential proclamation that temporarily blocks foreign workers entering on H-1B https://graphics.reuters.com/USA-IMMIGRATION/WORKERS/xklvyzkdxpg/h1b.jpg visas for skilled employees, and L visas, for managers and specialized workers being transferred within a company.He also blocked those entering on H-2B seasonal worker visas, used by landscapers and other industries.The visa suspension, which takes effect on Wednesday until the end of the year, will open up 525,000 jobs for U.S. workers, a senior administration official said on a call with reporters.The official, who did not explain how the administration arrived at that figure, said the move was geared at \"getting Americans back to work as quickly as possible.\"But businesses including major tech companies and the U.S. Chamber of Commerce said the visa suspension would stifle the economic recovery after the damage done by the pandemic.Critics of the measure say Trump is using the pandemic to achieve his longstanding goal to limit immigration. The proclamation's immediate effects are likely to be limited, as U.S. consulates around the world remain closed for most routine visa processing.The proclamation exempts those already in the United States, as well as valid visa holders abroad, but they must have an official travel document that permits entry into the United States.Immigration attorneys were working on Monday to determine what the order might mean for clients now out of the country.The measure also exempts food supply chain workers and people whose entry is deemed in the national interest. The suspension will include work-authorized J visas for cultural exchange opportunities, including camp counselors and au pairs, as well as visas for the spouses of H-1B workers.Story continuesRepublican Trump is running for re-election on Nov. 3 and has made his tough immigration stance a central pitch to voters, although the coronavirus, faltering economy and nationwide protests over police brutality have overshadowed that issue.The president has faced pressure to restrict work visas from groups that seek lower levels of immigration, as well as some Republican lawmakers.In a statement, BSA, the Software Alliance, whose members include Microsoft and Slack, urged the administration to \"refrain from restricting employment of highly-skilled foreign professionals,\" adding, \"These restrictions will negatively impact the U.S. economy,\" and decrease job opportunities for Americans.Doug Rand, co-founder of Boundless, a pro-migrant group that helps families navigate the U.S. immigration system, said the fact that H-2A visas used to bring in foreign farmworkers were exempt signals that \"big agriculture interests are the only stakeholder with any sway over immigration policy in this administration.\"H-2B visas, which were included in the suspension, have been used by Trump owned- or Trump-branded businesses, including his Mar-a-Lago club in Florida.Many business groups were lobbying against a temporary visa ban before it was announced.Sarah Pierce, a policy analyst with the Washington-based Migration Policy Institute, estimated that the new ruling would block 219,000 foreign workers through the rest of the year.\"This is introducing more chaos into an already chaotic situation for a lot of U.S. companies,\" she said.\"The administration is making the assumption that these companies did not already look at the U.S. labor market, which most of them do before they get involved in a complicated process of trying to bring in foreign workers.\"Mitch Wexler, a managing partner at law firm Fragomen, said the order would hurt his social media and wireless communications clients and other tech companies.Employers \"wouldn't pay a lot of money to file these applications and hire lawyers like me if they could hire an American for these positions,\" he said.Trump also renewed an April proclamation that blocks some foreigners from permanent residence in the United States, extending that measure until the end of the year.The senior administration official said that proclamation freed up roughly 50,000 jobs for Americans, but did not provide details.The visa suspension issued on Monday narrows an exemption for medical workers in Trump's April ruling to include only people working on coronavirus research and care.U.S. Citizenship and Immigration Services said there were 15,269 petitions for H-1B visas in healthcare-related jobs across the United States in fiscal year 2019.The Trump administration will make several other moves to tighten rules around temporary work visas.The administration plans to rework the H-1B visa program so that the 85,000 visas available each year go to the highest-paid applicants, instead of the current lottery system, the senior administration official said.It also plans to issue rules making it harder for companies to use the H-1B visa program to train foreign workers to perform the same job in another country, the official said.Both moves would likely require regulatory changes.The Trump administration is also taking steps to limit work permits for asylum-seekers, finalizing a regulation on Monday to remove a requirement to process such permits within 30 days.A separate asylum measure set to be finalized on Friday would greatly limit asylum seekers' access to work permits.(Reporting by Ted Hesson and Steve Holland in Washington; Additional reporting by Raphael Satter and Nandita Bose in Washington, Mica Rosenberg in New York and Paresh Dave in Oakland; Editing by Grant McCool and Rosalba O'Brien)"}]}