{"article": [{"url": "https://finance.yahoo.com/news/retail-sales-lyft-earnings-what-to-know-in-the-week-ahead-213750907.html", "published": 1596991520.0, "headline": "Retail sales, Lyft earnings: What to know in the week ahead", "body": "This week investors will turn their attention to another set of corporate earnings results, though the number of reports per day will slow from the heavy pace of the past couple weeks. Economic releases will include two sets of U.S. inflation reports, along with the Commerce Department’s July print on retail sales.The reports come against a backdrop of a still-dire pandemic situation in the U.S., with confirmed cases over the weekend domestically nearing 5 million infections – by far the worst of any single country worldwide. President Donald Trump over the weekend signed four executive actions to implement a federal eviction moratorium, $400 weekly federal enhanced unemployment insurance benefit, relief for student borrowers and temporary payroll tax suspension, as a move to quickly roll out stimulus to individuals, after two weeks of talks in Congress failed to convene lawmakers around terms of a new relief bill.Lyft earnings et. alEarnings season continues this week with another set of companies reporting quarterly earnings results, including a handful of newly public corporations.One report set to be closely watched this week will be Lyft’s (LYFT), scheduled for Wednesday after market close.The quarterly report for the No. 2 ride-hailing company in the U.S. comes after Uber (UBER) last week reported a 75% slump in mobility gross bookings, reflecting evaporated travel demand during the coronavirus pandemic. Uber partially offset its top-line slide with a more than doubling of its food delivery business, but Lyft’s more narrowly focused ride-hailing business will have little to fall back on in absence of normal levels of ridership.Lyft has also focused only on the North American market for ride-hailing, especially in the U.S., where Uber CEO Dara Khosrowshahi said ride-hailing recovery was “lagging” relative to the rest of the world given the ongoing pandemic. Lyft, however, has typically been prudent about cost-cutting, setting up a potential buffer on bottom-line results.Story continuesOther companies set to report earnings results this week include the newly public Lemonade (LMND), ZoomInfo Technologies (ZI) and Vroom Inc (VRM). The insurance company, subscription software company and online car rental company, respectively, each listed within the last three months, making their quarterly reports their first as publicly traded companies. The reports will test the endurance of these companies’ soaring stock prices, which up until now have had few positive or negative catalysts to derail them. All of these three companies have more than doubled their stock prices since listings, as investors snapped up shares of newly public companies to try and get in early on expected growth.So far this earnings’ season, most companies managed to clear a low bar for second-quarter expectations, with a lack of company guidance surrounding the coronavirus pandemic leading to widely dispersed earnings estimates among Wall Street analysts.As of Friday, 83% of S&P 500 companies had surprised to the upside on earnings per share for the second quarter, FactSet’s John Butters wrote in a note late last week. If that proportion carries through for the rest of the quarter, it would mark the highest percentage of positive surprises among S&P 500 companies since FactSet began tracking the metric in 2008.SAN FRANCISCO, CALIFORNIA - MAY 15: A pedestrian walks by closed stores on May 15, 2020 in San Francisco, California. Malls and other businesses shutdown in an attempt to contain the coronavirus causing the U.S. retail sales to fall by a record 16.4% from March to April. (Photo by Justin Sullivan/Getty Images)Inflation data, Retail salesKey economic data reports set for release this week include the US Bureau of Labor Statistics’ producer price index (PPI) and consumer price index (CPI) results, set for release on Tuesday and Wednesday, respectively.The CPI is set to be especially key, following the index’s biggest jump in 8 years in June, as gasoline prices rebounded by more than 12% to comprise more than half of the gain. Consensus economists expect July’s CPI moderated to a 0.3% month on month rise, from June’s 0.6% increase.“The impact of the coronavirus pandemic on the inflation outlook is uncertain. Though as demand continues to recover and firms feel like they can relax discounting efforts, consumer prices should continue to edge higher,” Sam Bullard, senior economist for Wells Fargo Securities Economic Group, wrote in a note. “Assuming our base case unfolds (no significant resurgence of the virus leading to another widespread lockdown), we expect prices to steadily rise in the coming months, albeit at a modest pace.”Retail sales will round out the week of economic data reports on Friday, with consensus economists expecting these to have risen by 1.9% in July after a 7.5% gain in June. This would mark the third straight month of gains in retail sales following a record 14.7% slide in April. However, it would also be the third consecutive month of moderating gains, with retail sales having jumped a record 18.2% in May.The past two months have brought retail sales up to just 0.6% below February’s levels before the coronavirus pandemic. And control group sales, which exclude more volatile autos, gas and building materials, jumped 5% above February’s levels as of last month, underscoring a recovery in consumer spending as lockdown measures eased.“Headline retail sales should get a nice boost from the continued acceleration in vehicle sales, which rose in July to a 14.5 million annualized pace from 13.2 million in June. Gasoline prices also advanced more than 4% on the month and firmer than the seasonal norm,” RBC Capital Markets economists wrote in a note Friday. “While chain-store sales were up about 1% on the month, other retail measures (number of stores open, retail employment) suggested a plateauing in July.”Earnings calendarMonday: Royal Caribbean (RCL), Duke Energy Corp (DUK), SeaWorld (SEAS), Marriott International (MAR), before market open; IAC/InteractiveCorp (IAC), Occidental Petroleum (OXY), J2Global (JCOM), ZoomInfo Technologies (ZI), Novavax (NVAX) after market closeTuesday: N/AWednesday: Lemonade (LMND) before market open; SmileDirectClub (SDC), Lyft (LYFT), Vroom Inc (VRM), Cisco (CSCO) after market closeThursday: Tapestry (TPR) before market open; Applied Materials (AMAT) after market closeFriday: DraftKings (DKNG) before market openEconomic calendarMonday: JOLTS job openings, June (5.3 million expected, 5.387 million in May)Tuesday: NIFB Small Business Optimism, July (100.4 expected, 100.6 in June); PPI Final Demand, July MoM (0.3% expected, -0.2% in June); PPI excluding food and energy, July MoM (0.1% expected, -0.3% in June); PPI final demand, July YoY (-0.7% expected, -0.8% in June); PPI excluding food and energy, July YoY (0.0% expected, 0.1% in June)Wednesday: MBA Mortgage Applications, week ended August 7 (-5.1% prior week); CPI, July MoM (0.3% expected, 0.6% in June); CPI excluding food and energy, July MoM (0.2% expected, 0.2% in June); CPI, July YoY (0.7% expected, 0.6% in June); CPI excluding food and energy, July YoY (1.1% expected, 1.2% in June)Thursday: Import price index, July MoM (0.6% expected, 1.4% in June); Export price index, July MoM (0.4% expected, 1.4% in June); Initial jobless claims, week ended August 8 (1.1 million expected, 1.186 million prior week); Continuing jobless claims, week ended August 1 (15.8 million expected, 16.107 million prior week)Friday: Retail sales advance, July MoM (1.9% expected, 7.5% in June); Retail sales excluding autos, July MoM (1.3% expected, 7.3% in June); Retail sales excluding auto and gas, July MoM (1.0% expected, 6.7% in June); Business inventories, June (-1.1% expected, -2.3% in May); University of Michigan sentiment, August preliminary (71.9 expected, 72.5 in July)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}