{"article": [{"url": "https://finance.yahoo.com/news/n-korea-state-media-quiet-011308985.html", "published": 1602274880.0, "headline": "N.Korea state media quiet ahead of expected military parade", "body": "By Hyonhee Shin and Josh SmithSEOUL, Oct 10 (Reuters) - North Korea was expected to hold a large military parade on Saturday, possibly displaying new strategic weapons, but there was no immediate sign that state television would air the event live.North Korea is celebrating the 75th anniversary of the founding of the ruling Workers' Party of Korea with a range of concerts and events.An official of South Korea's Unification Ministry, which handles North Korean affairs, said the government was monitoring developments but there was no sign yet of any broadcast of a speech by North Korean leader Kim Jong Un or a military parade.For weeks commercial satellite imagery has shown thousands of North Korean soldiers practicing marching, and South Korean officials have said the North could use a parade to unveil a new intercontinental ballistic missile (ICBM), or a new submarine launched ballistic missile (SLBM).The last time North Korea broadcast a military parade live on television was in 2017, when it showed off many large ICBMs amid heightened tension with the United States.ICBMs were once again paraded in February 2018, but no international media were allowed to observe. Shortly after, Kim began meeting international leaders such as U.S. President Donald Trump, and no large missiles have been displayed since.Denuclearisation talks with Washington have broken down, and South Korean officials said on Thursday that Kim could use the military parade as a \"low intensity\" show of power ahead of the U.S. presidential election in November.In a congratulatory message to Kim for the anniversary, Chinese President Xi Jinping said he intended to \"defend, consolidate and develop\" ties with North Korea, its state media said on Saturday. (Reporting by Hyonhee Shin and Josh Smith; Editing by Clarence Fernandez)"}]}