{"article": [{"url": "https://finance.yahoo.com/news/jeff-bezos-worlds-richest-man-faces-congress-for-the-first-time-185438473.html", "published": 1596031340.0, "headline": "World’s richest man faces Congress for the first time", "body": "This story is developing and will be updated.Jeff Bezos, the richest man in the world, testified before Congress for the first time ever Wednesday afternoon. Since founding Amazon (AMZN) 26 years ago, Bezos has been able to control the narrative, and managed to do so — even before the House Judiciary Subcommittee on Antitrust, Commercial and Administrative Law.Nearly two hours into the hearing, Bezos was questioned for the first time by Congresswoman Pramila Jayapal (D-WA), who represents the state’s 7th congressional district, which includes most of Seattle, where Amazon was founded. When asked whether Amazon uses third-party seller data for its own benefit, Bezos said the company restricts this, but added: \"I can't guarantee that the policy hasn't been violated,” noting that it’s a voluntary policy that Amazon has put in place.Congresswoman Mary Gay Scanlon (D-PA) used the pricing war and subsequent acquisition of Quidsi, the company behind the now defunct Diapers.com, as an example of Amazon’s anti-competitive nature. Alluding to Amazon’s predatory pricing strategy. Bezos claimed he didn’t recall the specific details and instead claimed there are a multitude of marketplaces for diapers.Both Subcommittee Chair David Cicilline (D-RI) and Congresswoman Lucy McBath (D-GA) shared anecdotes from third-party sellers who described the “bullying, fear and panic” of working with Amazon. Cicilline said sellers told him Amazon was the “only game in town” and said one small business owner compared the platform to a drug dealer — “Amazon strings you along for a while because it feels so good to get that paycheck every week. We called it Amazon heroin — you kept going, you had to get your next fix...but this person was ultimately going to be your downfall.”Bezos categorically denied these claims saying he does not believe this is a systemic problem and that sellers have other ways to access customers.When asked by Representative Jamie Raskin (D-MD) whether Amazon’s voice assistant Alexa has been trained to favor Amazon products, Bezos said he wouldn’t be surprised if it happens sometimes. \"We do, of course, promote our own products, which is a common practice in business,” he added.Story continuesBezos, worth some $180 billion, joined the virtual pulpit alongside Alphabet’s (GOOG) Sundar Pichai, Facebook’s (FB) Mark Zuckerberg and Apple’s (AAPL) Tim Cook.Lawmakers derailed the hearing from the start, focusing on so-called conservative bias, repeatedly bringing up issues specific to Twitter (TWTR), even though there was no representative of the social media platform at the hearing.Bezos was the first chief executive to read a prepared statement via video conference. He spent his allotted five minutes sharing the story of his single mother, who gave birth to Bezos when she was just 17 years old.He ended his introductory remarks by leaning into a patriotic angle, claiming “the rest of the world would love even the tiniest sip of the elixir we have here in the U.S. Immigrants like my dad see what a treasure this country is—they have perspective and can often see it even more clearly than those of us who were lucky enough to be born here. It’s still Day One for this country, and even in the face of today’s humbling challenges, I have never been more optimistic about our future.”Nobody going after Bezos. They all want invites to coolest parties in DC (low bar) hosted by wealthiest man in world in midst of mother of all mid-life crises. I'd like to roll w/Jeff, and I don't like him.— Scott Galloway (@profgalloway) July 29, 2020When you’re the world’s richest person and waiting for your turn to be questioned by Congress. pic.twitter.com/QQgmcb8efu— CNET (@CNET) July 29, 2020Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Amazon CEO Jeff Bezos will 'try to win over hearts and minds’: What to expect at the antitrust tech hearingWNBA Commissioner: 'There is nothing political about Black Lives Matter'The US saw the highest rate of new women CEOs so far this yearDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperity"}]}