{"article": [{"url": "https://finance.yahoo.com/news/mcdonalds-will-require-all-us-customers-to-wear-masks-173055321.html", "published": 1595594300.0, "headline": "McDonald's will require all U.S. customers to wear masks amid coronavirus pandemic", "body": "McDonald’s (MCD) is joining the list of businesses requiring all customers nationwide to wear masks amid the coronavirus pandemic.Beginning Aug. 1, masks will be required to enter all 14,000 McDonald’s restaurants and will be provided to any customers who don’t have one, the Wall Street Journal reported.A person wears a protective face mask outside McDonald's in Union Square during the coronavirus pandemic on April 30, 2020 in New York City. (Photo by Noam Galai/Getty Images)This comes as coronavirus cases continue to surge in many parts of the U.S., including states like California, Texas, and Nevada.Other restaurant chains and major retailers have implemented mask mandates as well. Starbucks (SBUX) and Walmart (WMT) announced theirs recently, along with stores like Target (TGT), Home Depot (HD), Whole Foods, and many more.California and Texas are still two of the biggest coronavirus hotspots in the U.S. (Graphic: David Foster/Yahoo Finance)A growing list of mask mandates but no national mandateThis isn’t the first major safety step that McDonald’s has taken since the onset of the coronavirus pandemic.In May, the fast food chain conducted a trial run in Arnhem, Netherlands, of a newly designed restaurant that focused on public health safety and social distancing. Hand sanitizers, hand washing stations, and special waiting spots for customers were installed and food was delivered by meal trolleys, Yahoo Finance previously reported.Public soda fountains were also discontinued across locations.A woman wears a protective face mask in a McDonald's. REUTERS/Hannah McKayCurrently, there are still three states that have no mask mandates at all — North Dakota, South Dakota, and Nebraska. Other states have mandates only within certain cities and counties, while a large group mandate mask wearing in all public settings.There are still three states with no mask mandates at all. (Graphic: David Foster/Yahoo Finance)Without a statewide mask mandate, customers are legally allowed to enter places of businesses with no masks unless the business explicitly states it’s a requirement to enter.President Trump does not support a federal mask mandate, although the CDC has stated that face coverings make a significant impact in reducing the spread of the coronavirus.“Cloth face coverings are one of the most powerful weapons we have to slow and stop the spread of the virus – particularly when used universally within a community setting,” CDC Director Rob Redfield said in a statement. “All Americans have a responsibility to protect themselves, their families, and their communities.”Story continuesAdriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Florida mayor 'very concerned' about kids going back to schoolHarvard doctor: America 'needs to regroup' to fight coronavirus'We need to be prepared' for coronavirus surges, doctor warnsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}