{"article": [{"url": "https://finance.yahoo.com/news/a-biden-win-might-boost-markets-not-quash-them-184540581.html", "published": 1594043600.0, "headline": "A Biden win might boost markets, not quash them", "body": "Joe Biden wants to raise taxes, eliminate corporate tax breaks and impose new regulations. With Biden surging ahead of President Trump in 2020 election polls, investors are beginning to worry that a Biden presidency could end the market-friendly policies Trump has propagated.But maybe not. If Biden beats Trump in November, some parts of his agenda could ease the burden on American businesses—especially on trade. Biden may not be able to pass tax hikes if the economy is still reeling from the coronavirus recession in 2021 or 2022, as many economists expect. And unlike Trump, Biden favors an aggressive federal effort to corral the coronavirus, which markets might welcome if the virus is still shackling the economy by Inauguration Day 2021.Democratic presidential candidate, former Vice President Joe Biden speaks during a roundtable on economic reopening with community members, Thursday, June 11, 2020, in Philadelphia. (AP Photo/Matt Slocum)JPMorgan and Goldman Sachs both published surprisingly sanguine analyses of Biden’s policies recently, signaling that Wall Street is warming to Biden. “The consensus view is that a Democrat victory in November will be a negative for equities,” JPMorgan strategists wrote on July 6. “However, we see this outcome as neutral to slight positive.”The 2017 Trump tax cuts lowered the corporate tax rate from 35% to 21%, leading to a surge in market-friendly stock buybacks. Biden wants to raise the corporate rate back to 28%. He also supports a minimum tax on large companies of 15% of the income they report to shareholders. And Biden would raise income and inheritance taxes on wealthy households.JPMorgan estimates that Biden’s higher tax levels, if they went into effect, would modestly reduce shareholder returns and corporate spending. But they might not go into effect. Even if Biden wins the White House and Democrats flip the Senate, giving them full control of Congress, tax hikes could be a hard sell. With a thin Senate majority at best, every Senate Democrat would have to vote for tax hikes, which a few moderate Democrats might balk at. And Dems would want to make sure they keep control of the Senate after the 2022 midterm elections, another reason to put off a tax hike that might slow economic growth while unemployment is still fairly high.Story continues‘Prospects for international cooperation’Other Biden policies could improve on Trump’s, from Wall Street’s perspective. Trump’s protectionist trade policies, including new tariffs on Chinese imports, have raised costs to U.S. businesses that are paying the tariffs and finding the Chinese market closed to U.S. exports, in retaliation. Trump also frequently threatens to intensify his trade war with China and other countries as a negotiating tactic, causing uncertainty for companies trying to build or maintain global supply chains.US Democratic presidential candidate Joe Biden speaks on June 30, 2020, in Wilmington, Delaware. (Photo by Brendan Smialowski / AFP) (Photo by BRENDAN SMIALOWSKI/AFP via Getty Images)Goldman Sachs chief economist Jan Hatzius sees Biden’s approach toward China as more favorable to markets than Trump’s. “Although tensions with China will undoubtedly persist regardless of the election outcome,”Hatzius wrote on July 5, “a re-escalation of the trade war would become less likely and the prospects for international cooperation on vital issues such as climate change would improve.”Other Biden policies could offset some of the negative effects if he does manage to raise taxes. Biden favors raising the federal minimum wage from $7.50 to $15 over time, which would raise labor costs for businesses but also give lower-income workers more spending power. JPMorgan thinks the increased demand would be a “net positive for S&P 500 companies.”Like most Democrats, Biden also backs new infrastructure spending, one of the things those tax hikes might pay for. That would also likely benefit some large, public companies. Trump would also like to sign a large infrastructure bill, but Democrats and Republicans in Congress haven’t been able to agree on what should be in it and where the funding would come from. Democrats could craft their own bill if they controlled both houses of Congress.As for the coronavirus, the rising infection tally in the United States indicates some states have failed to control the spread and the virus will be a persistent problem until a vaccine is available. Biden says he’d establish a Pandemic Testing Board to make testing and contact tracing a national priority, instead of leaving it up to states and cities to scrounge resources for themselves. Biden’s plan aligns with the advice of many public health experts, who say mask wearing should be a national requirement and lavish federal spending on testing would be more effective than on-off-on-off business closures. If the virus is still depressing the economy by next January, markets would undoubtedly welcome a vigorous new effort to defeat it.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Edgy voters might reject the 2020 election outcomeTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}