{"article": [{"url": "https://finance.yahoo.com/news/new-york-and-california-are-the-land-of-the-flee-and-texas-is-the-land-of-the-free-real-estate-investor-153723421.html", "published": 1599043520.0, "headline": "‘New York and California are the land of the flee, and Texas is the land of the free’: real estate investor", "body": "The allure of small-town living has catalyzed mass migration from places like New York and California to states like Texas and Florida as Americans grapple with daily life during the coronavirus pandemic.Since March, city-dwellers shopped for more affordable, spacious living arrangements in suburbs and small cities. Migration is starting to slow down, a recent Yahoo Finance-Harris Poll survey showed, but the shift to small-town living has already radically changed real estate values in the U.S., say experts.“I actually think we're not appreciating it as big and profound as it actually is. Our joke has been that New York and California are the land of the flee, and Texas is the land of the free,” Ari Rastegar, founder of Rastegar Property Company, an Austin-based real estate investment firm, told Yahoo Finance’s The Final Round.Empty streets of New York City during Coronavirus quarantine lockdown.State government policies like income and business taxes are influencing some people’s decision on where to live and work. Even before the pandemic, less burdensome taxes in Texas drew huge tech companies like Tesla, Oracle, Facebook, Apple and Google — and their employees — to Austin, Texas. “People are coming here [Austin] because there's a place to get a job,” said Rastegar.People are “moving from more tax, business and regulatory-unfriendly states to more tax, business and regulatory-friendly states where homes are more affordable,” Jonathan Woloshin, UBS Global Wealth Management head of U.S. real estate, told Yahoo Finance’s The First Trade. “When you layer onto that we have a lot of companies that once we get back to the office are going to have a decent amount of their workforce work remotely, we think that’s a trend that could continue.”Individuals are taking advantage of remote work options by seeking out warmer climates and a lower cost of living, said Rastegar.“When people are starting to think about, am I going to have to work from home? ...They have to ask themselves, do I want to be in a fair weather climate? Do I really want to pay state income taxes? Do I want to have a larger space? Can I have a lower cost of living and still be close to the largest employers in the world? I think the answer is yes,” he said.Story continuesThe shift to suburban and small-town living was already happening, but the pandemic sped it up. Rents are rising and inventory is dwindling in small towns. In Henderson, Nevada, asking rent for a one-bedroom climbed 5.4% in July from June, and in Tulsa, Okla. one-bedroom asking rent increased 5.1% in July, according to Zumper, a San Francisco-based rental listing website.Meanwhile, rents are coming down and vacancies are piling up in big cities like New York. San Francisco asking rent dropped 3.3% from March to July, and New York asking rent dropped 2.8% from March to July, according to Zumper.“The writing's on the wall,” said Rastegar. If people “can go get an immediate pop [boost] in their income simply by moving [somewhere with] a lower [cost] of living, and a lower cost to rent… that's why people want to be there.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Unemployment insurance doesn’t cover rent in most cities, study showsCalifornia wildfires threaten $11.8 billion-worth of homesThere’s a record number of vacant rental apartments in Manhattan"}]}