{"article": [{"url": "https://finance.yahoo.com/news/check-this-one-thing-in-your-401-k-right-now-213045152.html", "published": 1597250300.0, "headline": "Check this one thing in your 401(k) right now", "body": "The S&P 500 index (^GSPC) was below 2,300 points in late March after hitting a high of 3,386 on Feb. 19. Since then, it’s returned to pre-pandemic levels — an increase of over 50%. From April, it’s up over 22% and 9% since June.Gains are great for people who own stock — and didn’t sell it during the plunge, a group that for the most part is retail investors — but they also throw people’s portfolios completely off track.When stocks crashed in March, a 75% stocks/25% bonds long-term portfolio would have changed dramatically. A 30% hit in the stock market (let’s say the S&P 500) would have resulted in a 53% stock position in your portfolio. In the spring, financial planning experts recommended investors rebalance if their target allocations weren’t where they should be.“One of the things that we like to do in these periods of dislocation is rebalance,” Great Hill Capital Chairman Thomas Hayes told Yahoo Finance on March 23, at the bottom.The market’s seismic shift back up to February levels means that for people who did rebalance, things could be out of whack once again due to the market’s gains.When to rebalanceBrett Horowitz, a certified financial planner at Evensky & Katz in Coral Gables, Fla., told Yahoo Finance that his firm is always looking to rebalance clients’ portfolios when they deviate from target allocations — for any reason. Back in early 2020 when the markets were at all-time highs, Horowitz said they rebalanced many portfolios to target allocations and used the opportunity to make sure people had appropriate emergency funds.\"In March, we rebalanced the opposite way by selling bonds, which had minimal to no losses, and using this money to buy stocks,” he wrote an email. “If the stock market had continued to fall, we would have done this again and again.”Now, with the S&P 500 positive year-to-date, Horowitz says he's approaching clients once again, selling stocks to refill cash reserves or buy bonds, and bringing their stock exposure back in line with their targets. During the financial crisis, Horowitz said, there was enough market volatility for the firm to rebalance clients three times.Story continuesA person walks out of the New York Stock Exchange as the city continues Phase 4 of re-opening following restrictions imposed to slow the spread of coronavirus on August 3, 2020 in New York City. (Photo by Noam Galai/Getty Images)More people are rebalancing these days, survey data from Charles Schwab shows. In a recent survey conducted in late May and early June, 401(k) participants said they’ve been paying more attention to their accounts and two in five made “defensive and opportunistic changes”: 14% rebalanced, 12% increased contribution rates, 8% increased equity exposure, and 7% decreased equity exposure.Since the coronavirus crisis has so far seen both a huge crash of over 30% (S&P 500 at 2,290) and a huge gain of over 50% (to more than 3,360 points), adding or subtracting stock exposure could be correcting upwards or downwards.[Read more: Cashay: Investing 101]Schwab's head of Workplace Financial Services Catherine Golladay said in a statement that the company was \"very encouraged\" to see this type of engagement and that people are using retirement tools and making adjustments to stay on track.Rebalancing and enhancing your portfolio to make sure it’s in line with your goals is a key skill for investors to learn, and one that isn’t necessarily intuitive for someone on a heater. If your big tech stocks have taken your net worth higher, why sell your winners? The answer is obvious (diversification and mitigating risks since generally bonds are far less volatile than stocks) but it’s not easy.Enhancing a portfolio, not blowing it upGetting people involved and educated about their portfolios is a struggle for many companies that seek to provide good overall, long-term experiences to their clients — and goes far beyond retirement companies looking to help people balance their portfolios’ allocations.TD Ameritrade’s chief market strategist J.J. Kinahan told Yahoo Finance that educating and helping investors improve portfolios and reach goals have been a challenge and priority, especially with new investors or for people who are taking a renewed interest in finances.Kinahan said that since 35% of trades on the company’s platform are derivative trades using financial instruments like options, the company is spending a lot of time making sure that it offers educational resources for customers. make good decisions about people’s portfolios. A key priority: using derivatives like options to “enhance your portfolio, rather than a ‘Mamma needs a new pair of shoes’” attitude.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Retail investors have seen huge gains as S&P 500 nears pre-pandemic highCompany matches are mostly surviving the coronavirusThere are two types of stocks on RobinhoodWhy you should consider deleting your stock trading appThe 2008 recession was far worse for young people's careers than previously thoughtBlack-owned small businesses continue to face harsh cash crunchWomen far less bullish about their investment goals than men: Survey"}]}