{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-us-housing-market-nike-earnings-what-to-know-in-the-week-ahead-164259831.html", "published": 1592740220.0, "headline": "Coronavirus, U.S. housing market, Nike earnings: What to know in the week ahead", "body": "Coronavirus cases are back on the rise in some U.S. states. According to Johns Hopkins University data, the U.S. reported more than 30,000 new COVID-19 cases on Friday, which was the highest number of daily cases since May 1.After months of lockdown, states that reopened their economies earlier than others are beginning to see a resurgence in cases. “After weeks of prolonged shutdowns to cautiously planning and implementing phased reopening plans, it is hoped our nation is on the ‘right route.’ However, over the last week or so, more than a dozen states reported significant upticks in cases and a select few experienced an increase in their positivity rate that was not a direct result of more testing,” Raymond James Chief Investing Officer Larry Adam wrote in a note June 19.“Our Healthcare Policy Analyst Chris Meekins believes this is a swell of the first wave rather than a second wave, and that the probability of the US truly turning a corner on the outbreak by July 4 remains at 65%,” Adam added.U.S housing marketMeanwhile, the U.S. housing market will be in focus this week. Existing home sales are expected to have decline 5.6% in May to a seasonally adjusted 4.09 million units, up from a 17.8% plunge in April. The National Association of Realtors’ existing home sales data is measured by contract closings as opposed to contract signings, which are measured by pending home sales, Nomura economist Lewis Alexander pointed out.“Given the sharp 21% m-o-m decline in pending home sales during April, we expect another decline in existing home sales in May. The expected pickup in buying activity due to easing of social distancing restrictions by many US states should be reflected in existing home sales reports in coming months,” Alexander said in a note June 19.Furthermore, new home sales are expected to have bounced 1.9% in May to a seasonally adjusted 635,000 units, up from a modest 0.6% increase in April. “Easing of restrictions on mobility and nonessential business activity suggests contract signings for newly built homes likely rose solidly during the month,” Alexander said.Story continuesAlexander noted that the weekly volume in mortgage loan applications has been increasing substantially since bottoming in April. All should be positives for the housing market in the near term.HONG KONG, CHINA - 2020/05/11: Multinational sport clothing brands Adidas and Nike logos seen at a store in Hong Kong. (Photo by Budrul Chukrut/SOPA Images/LightRocket via Getty Images)Nike earningsWhile the earnings calendar remains light for the week, investors will be closely watching shoe giant Nike’s earnings Thursday afternoon.Investors will be keeping an eye on Nike’s business in China, its e-commerce business and the company’s performance during the global pandemic when the company reports. Nike is expected to report earnings of 3 cents per share on $8.35 billion in revenue during its fiscal fourth quarter.Nike’s fiscal third quarter sales came in above estimates, but earnings fell short as a result of the pandemic. At the time of the announcement in March, the company said that it was starting to see recovery in China.Shares of the shoemaker are down more than 5% this year while the broader market fell 4% during the same time period.Economic calendarMonday: Chicago Fed National Activity Index, May (-16.74 in April); Existing Home Sales, May (4.09 million expected, 4.33 million in April); Existing Home Sales month-on-month, May (-5.6% expected, -17.8% in April)Tuesday: Markit US Manufacturing PMI, June preliminary (50.8 expected, 39.8 in May); Markit US Services PMI, June preliminary (48.0 expected, 37.5 in May); Markit US Composite PMI, June preliminary (37.0 in May); New Home Sales, May (635,000 expected, 623,000 in April); New Home Sales month-on-month, May (+1.9% expected, +0.6% in April); Richmond Fed Manufacturing Index, June (-11 expected, -27 in May)Wednesday: MBA Mortgage Applications, week ending June 19 (+8.0% prior); FHFA House Price Index month-on-month, April (+0.3% expected, +0.1% in March)Thursday: Wholesale Inventories month-on-month, May preliminary (+0.4% expected, +0.3% in April); Durable Goods Orders, May preliminary (+10.9% expected, -17.7% in April); Durables excluding Transportation, May preliminary (+2.3% expected, -7.7% in April); GDP annualized quarter-on-quarter, Q1 third reading (-5.0% expected, -5.0% prior); Personal Consumption, Q1 third reading (-6.8% expected, -6.8% prior); GDP Price Index, Q1 third reading (+1.4% expected, +1.4% prior); Core PCE quarter-on-quarter, Q1 third reading (+1.6% expected, +1.6% prior); Initial Jobless Claims, week ending June 20 (1.35 million expected, 1.508 million prior); Continuing Claims, week ending June 13 (20.54 million prior); Bloomberg Consumer Comfort, week ending June 21 (40.2 prior)Friday: Personal Income, May (-6.0% expected, +10.5% in April); Personal Spending, May (+8.8% expected, -13.6% in April); University of Michigan Sentiment, June final (79.0 expected, 78.9 prior)Earnings calendarMonday: N/ATuesday: N/AWednesday: KB Home (KBH) after market closeThursday: Darden (DRI), Rite Aid (RAD) before market open; Nike (NKE) after market closeFriday: N/A—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:White Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeJobless claims: Another 1.51 million Americans file for unemployment benefitsRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}