{"article": [{"url": "https://finance.yahoo.com/news/shell-cut-9-000-jobs-061602566.html", "published": 1601463200.0, "headline": "Shell to Cut Up to 9,000 Jobs as Virus Accelerates Overhaul", "body": "(Bloomberg) -- Royal Dutch Shell Plc will cut as many as 9,000 jobs as crude’s crash forces billions of dollars in cost savings and the oil and gas giant overhauls its business to embrace clean energy.The move reflects the challenge facing Big Oil as the virus pandemic persists, with some in the industry believing the era of demand growth is already over. As the crisis hastens the shift to low-carbon energy, oil majors are axing jobs, taking multibillion-dollar writedowns and slashing once-sacrosanct dividends.At Shell, 7,000 to 9,000 job losses are expected by the end of 2022 -- as much as 11% of the workforce. The total includes around 1,500 people taking voluntary redundancy this year, the company said Wednesday. It predicts sustainable annual cost savings of $2 billion to $2.5 billion by that time.“We have to be a simpler, more streamlined, more competitive organization,” Chief Executive Officer Ben van Beurden said in a statement. “In many places, we have too many layers in the company: too many levels between me, as the CEO, and the operators and technicians at our locations.”Shell plans to “refocus” its refining business, eventually reducing its number of plants to fewer than 10, from the 15 it’s involved in today. Refining margins have been much lower this quarter than last quarter, and oil-product sales have shrunk to around 4 million to 5 million barrels a day from 6.7 million a year earlier, according to the statement.While the Anglo-Dutch major didn’t provide a full breakdown of the job losses, a spokesperson said that positions in the top three layers of the company would be reduced by one fifth.Third-quarter oil-product trading results will fall short of the historical average and will be “significantly lower” than in the second quarter, the company said. That shows the trading bonanza that saved Shell’s last set of results won’t be repeated. Its full third-quarter financials, scheduled for Oct. 29, will include impairment charges of $1 billion to $1.5 billion.Story continuesShell’s B shares traded down 1.7% at 940.2 pence as of 4:36 p.m. local time.Right Path“The transformation to a leaner and lower-carbon organization is the right one for Shell longer-term,” Barclays Plc analyst Lydia Rainforth wrote in a research note. “But with the macro environment still challenging, this may take some time to reflect in the share price.”Oil’s coronavirus-induced plunge has seen Shell’s peers also take drastic steps to shore up the balance sheet. BP Plc said in June it planned to cut 10,000 jobs, Chevron Corp. intends to trim 10% to 15% of its global workforce, while Exxon Mobil Corp. is reviewing staffing country by country.Shell began the process in May, when Van Beurden told staff in a memo that it was reshaping the company to make it slimmer and more resilient and that there could be redundancies in the second half of the year, according to people with knowledge of the matter. The Anglo-Dutch major offered voluntary severance, scaled back recruitment and reviewed expatriate staff contracts.“These incremental details should help investors who think Shell has been sitting on its hands in recent months,” RBC Capital analyst Biraj Borkhataria wrote in a note. But he said shareholders will want more details on the company’s plans, expected to be revealed at Shell’s strategy day on Feb. 11.Emissions GoalsThe reorganization is also designed to further Shell’s expanded green ambitions. The company said in April it planned to eliminate all net emissions from its own operations and the bulk of greenhouse gases from fuel it sells to its customers by 2050. Shell also said that ultimately, it would only do business with emission-free companies.European oil majors making a strategic shift into cleaner fuels have faced questions from investors about the profitability of renewables, which typically bring in single-digit returns. BP’s shares fell to a 25-year low a week after it outlined plans to boost renewables returns.Shell insists that with time, its power division will bring in 8% to 12%. While oil and gas projects have historically brought in higher figures, returns in that industry have recently dwindled. Van Beurden said in May that “8% to 12% currently we don’t even make in our upstream business.”Read our QuickTake explainer: How Peak Oil’s Outlook Is Changing Under the Pandemic(Updates with job loss details in sixth paragraph, share price in eighth.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}