{"article": [{"url": "https://finance.yahoo.com/news/microsoft-tiktok-acquisition-rumors-211139315.html", "published": 1596471560.0, "headline": "Microsoft and TikTok need each other", "body": "Microsoft (MSFT) is the prime candidate to purchase the social media app TikTok from its Chinese parent company ByteDance. The move would be a much-needed lifeline for the app, putting its operations squarely in the hands of an American company, following threats by the Trump administration to ban the service over allegations that it is a national security threat.Yet Microsoft, or any other potential suitors, will need to wrap up a deal by Sept. 15, or see TikTok shut down.For Microsoft, the potential deal would be a game changer that could reinvigorate the company’s image among younger users who may not use Microsoft products thanks to competitors like Google’s (GOOG, GOOGL) Chromebooks and Apple’s (AAPL) iPhone and iPad.Microsoft wants to “age up with the user base,” Jefferies analyst Brent Thill told Yahoo Finance’s On the Move.“So if they can get the younger audience today then that’s a vehicle to then sell other solutions.”FILE - In this May 6, 2019, file photo Microsoft CEO Satya Nadella delivers the keynote address at Build, the company's annual conference for software developers in Seattle. (AP Photo/Elaine Thompson, File)Microsoft needs new bloodMicrosoft’s successes of late have largely come from its cloud and server business, as well as its productivity suits. The company’s Intelligent Cloud arm, which includes its Azure cloud computing business, pulled in $13.4 billion in fiscal Q4 2020, while its Productivity and Business Processes arm earned $11.8 billion.But Microsoft’s More Personal Computing business, which includes everything from Windows OEM and commercial products to Xbox and Surface sales is still incredibly important to the company. In Q4, the business was responsible for $12.9 billion of the tech giant’s revenue, proving that while productivity and cloud services are certainly money makers for Microsoft, the company simply can’t afford to lose its consumer business.Currently, Microsoft’s only inroad into younger consumers’ lives is its gaming products, whether that’s in the form of its Xbox brand or PC games. Apple and Google, meanwhile, find their products in the hands of every young person with a smartphone. What’s more, schools continue to lean into Apple’s iPads and Google’s Chromebooks as low-cost alternatives to Windows-based laptops for in-class assignments.Story continues“Where do they spend their time? They’re on these other platforms playing … games they’re on their iPhone,” Thill said. “These are not Microsoft platforms. And so they have a tremendous opportunity to grow up with this audience.”Microsoft needs every opportunity to expand its presence among young people to ensure the future survival of its consumer tech business. And grabbing an upstart social media platform with millions of users could be the perfect opportunity.“I think the brand has changed at Microsoft,” Thill said. “It used to be kind of stale, but [CEO Satya] Nadella has done a fantastic job of going after everyone. And so, we think that Microsoft, again, is the best neutral third party when you look at who could potentially do this.”Thill imagines Microsoft integrating TikTok into its Xbox gaming platforms, creating a setup that moves users between the two services.TikTok loses the government scrutinyTikTok is suspected by lawmakers across the political spectrum of using its app to harvest the data of American users. The fear, according to cybersecurity experts, is that the data could eventually be used to blackmail teens who use the service now and take jobs in high-security sectors in the future.There’s also the fact that the app collects personal information on users and can turn it over to the authorities if requested to do so.But TikTok collects the same kind of data as competing social media platforms like Facebook and Twitter. And the company has been working overtime to prove it isn’t being used as an arm of the Chinese military or intelligence services.To that end, the company hired former Disney executive Kevin Mayer as its CEO and has made numerous assurances that the firm isn’t accessing personal data to spy on its users.But that hasn’t been enough for the Trump administration or other lawmakers who say the app simply can’t be trusted.If Microsoft purchases the firm, however, it could escape such scrutiny. Not only is Microsoft one of the largest tech companies in the world, it also works with the U.S. government on a series of projects, giving lawmakers reason to trust that it will protect user data from foreign governments.There’s no guarantee that the deal will go through just yet or what the final terms would look like. But from the look of it, a TikTok owned by Microsoft may be the best solution for both companies.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Documents reveal the behind-the-scenes battle between Apple and Spotify that lead to an antitrust investigationApple confirms next iPhone will be delayed “a few weeks”Amazon, Apple, Facebook, and Google CEOs push America-first narrative in effort to avoid antitrust scrutinyAnalysts look to hints of iPhone 12 delays in Q3 earningsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}