{"article": [{"url": "https://finance.yahoo.com/news/the-us-has-lost-jobs-since-trump-took-office-but-so-have-many-other-countries-163313385.html", "published": 1599219680.0, "headline": "The US has lost jobs since Trump took office, but so have many other countries", "body": "The Labor Department reported that the U.S. added 1.37 million new jobs in August, while the unemployment rate dropped below 10% for the first time since the pandemic took hold.“This is a very deep scar to the labor market” noted Gregory Daco, chief U.S. economist at Oxford Economics, “one that will take years to recover, not months.” The U.S. still has a total net loss of 11.5 million jobs since March.Democrats have been broadening the argument even further by repeatedly noting that not only are jobs down since the February, they’re also down since President Trump took office in 2017. The Center for American Progress, a left-leaning group, responded to the latest employment report by claiming that even after Friday’s good news, Trump is “still the worst jobs president in recorded history.”Today's release from the BLS confirms that Trump is still the worst jobs president in recorded history.#JobsDay pic.twitter.com/BRfplic6N6— Ryan Zamarripa (@ryan_zamarripa) September 4, 2020What the charge leaves out is that many other countries are in the same boat. Countries tabulate their economic data differently than the U.S., but Yahoo Finance analyzed a few measures where it’s possible to compare the U.S. with other nations. Yahoo Finance relied on data from the Paris-based Organisation for Economic Co-operation and Development (OECD).The Trump campaign responded to Friday’s number with a statement saying “the economy maintained its rapid recovery as more and more Americans are returning to work.”Measuring by ‘employment rate’Employment rate is perhaps the best way to compare the jobs situation around the world. It's a measure of the number of people who have jobs in any given country, divided by everyone of working age (15-64).Story continuesThe unemployment rate is a more frequently used yardstick. It measures people who don't have a job, divided by everyone working or actively looking for a job. The U.S. unemployment rate dropped to 8.4% in August.Great Jobs Numbers! 1.37 Million Jobs Added In August. Unemployment Rate Falls To 8.4% (Wow, much better than expected!). Broke the 10% level faster and deeper than thought possible.— Donald J. Trump (@realDonaldTrump) September 4, 2020The rub is that different countries define “actively looking for a job” differently. “I think you are on a little bit easier ground if you focus on employment rather than unemployment,” David Wilcox, senior fellow at the Peterson Institute for International Economics, told Yahoo Finance recently.There are eight countries that report employment rate to the OECD on a monthly basis like the U.S. does.The U.S. employment rate fell between January 2017 and July 2020. The U.S. rate was at 69.6% in January 2017 and was 65.2% in July. That's a drop of 6.32%. (The August employment rate is not available yet.)But 6 of the 7 other countries that release this data have also seen a drop. Colombia’s employment is down a whopping 20.33% over the same time period. Canada is down 5.59%, while Australia’s rate is 1.38% lower. South Korea is down 0.91%, and Russia is down 0.71%.Japan is the only country (on this list) with a higher employment rate now versus when Trump took office.The United Kingdom publishes an employment rate with a slightly different set of parameters than the OECD standard. Like Japan, the UK has shown an uptick in the last 3.5 years. At the beginning of 2017, its employment rate was 74.8%. Its most recent data includes June 2020 at an employment rate of 76.4%.The OECD, which is one of the best clearinghouses for this type of information, also compiled the most recent employment rates around the world. The U.S. falls far below the median. The U.S. current sits between Mexico and Spain, but those two countries, and other prominent nations like France, have only reported employment rates through the first quarter of 2020 – before the full impact of the global pandemic was felt.More mixed results when looking at ‘employed population’The results are a bit complicated when the measurement is “employed population,” which is one way to measure how many people are working in a country at any given time.French President Emmanuel Macron delivers a speech at the Organisation for Economic Co-operation and Development's ministerial council meeting in 2018. (REUTERS/Philippe Wojazer/Pool)Eight nations deliver their employed population figures to the OECD on a monthly basis. Of those, half have more total jobs now versus what they had in January 2017: Australia, Israel, Japan, and South Korea. The U.S. is in the bottom half here, joining Canada, Chile, and Colombia as being down.Different measures by different countries tell a similar story. Germany, for example, publishes a metric called \"persons engaged in economic activity.” They found almost 44 million people working during the fourth quarter of 2016 and a slight increase to 44.6 million 3.5 years later.The differences between employed population and employment rate is - of course - all about population growth. Many countries – although, notably not the U.S. – have more gross jobs now than they had at the beginning of 2017.What’s been much harder for countries around the world in the last 3 1/2 years is providing jobs that keep up with population growth.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Jobs report: US economy adds 1.371 million payrolls in August, unemployment rate dips to 8.4%The jobs recovery is 'nearing the point of exhaustion'American savings accounts are now ‘steadily declining’ as coronavirus effects lingerTrump, Biden both likely to push national debt to new heights: ExpertRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}