{"article": [{"url": "https://finance.yahoo.com/news/bill-ackmans-acquisition-company-files-173225427.html", "published": 1592829620.0, "headline": "Ackman seeks $3 billion for largest-ever blank-check company", "body": "By Svea Herbst-Bayliss and Joshua Franklin(Reuters) - Billionaire investor William Ackman said on Monday he was looking to raise $3 billion and commit at least $1 billion from his hedge fund Pershing Square Capital Management LP for a new blank-check investment vehicle, the largest of its kind.Ackman, whose New York-based hedge fund manages more than $10 billion in assets, can make additional commitments and boost the size of the capital raise to $6.5 billion, according to a filing with the U.S. Securities and Exchange Commission.The special purpose acquisition company (SPAC), Pershing Square Tontine Holdings, Ltd, plans to go public with 150 million units at $20 each, according to the filing. Reuters first reported Ackman's plans earlier this month.A SPAC uses IPO proceeds and borrowed funds to acquire a company, typically within two years. Investors are not notified in advance which company a SPAC will buy. Ackman said in the filing it will seek to acquire a venture capital-backed company that he called a \"mature unicorn\" which has chosen to remain private.Ackman's vehicle will handily beat out former Citigroup Inc executive Michael Klein's Churchill Capital Corp, which raised $1.1 billion, as the largest ever SPAC.The deal will give Ackman firepower to compete for a big acquisition against some of the largest private equity firms, such as Apollo Global Management and Blackstone Group.\"The theory has been up to now you don't want to get too big as a SPAC because then you're competing with all the private equity firms for assets,\" said Douglas Ellenoff, partner at law firm Ellenoff Grossman & Schole LLP. \"He's saying, 'Bring it, we're prepared to compete.'\"Ackman is raising the SPAC after his hedge fund gained roughly 30% since January despite the COVID-19 pandemic.SPACs have raised $10.4 billion through U.S. IPOs so far in 2020, according to SPAC Research, on track to exceed the record $13.6 billion in all of 2019.Ackman is looking to list the SPAC's shares on the New York Stock Exchange under the symbol \"PSTH.U\".(Reporting by Svea Herbst-Bayliss in Boston and Joshua Franklin in New York; Editing by Richard Chang)"}]}