{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-pandemic-new-business-formation-entrepreneurs-214427143.html", "published": 1601398340.0, "headline": "A powerful source of job creation is on a record-breaking upswing", "body": "Applications to form businesses in the U.S. surged unexpectedly in the third quarter, signaling the labor market may recover more quickly from the coronavirus financial crisis than during previous recessions.“New businesses play an important role in job creation...New business formation is critical for the employment outlook, with new and younger firms historically accounting for the lion’s share of net job growth,” according to a new research note from Goldman Sachs.Business creation declines in a typical recession, but this pandemic is shaping up to be an anomaly. While the official Census data for business formation for the third quarter will be published on Oct. 14, the Census reported a total of 97,190 business applications for the week ending Sept. 19, representing a 45.1% year-over-year jump. Looking back at the second quarter data, total business applications reached an all-time high of 883,174 applications.There has been a surge in new business applications in the U.S. Source: Goldman SachsThere’s another optimistic sign: “high-propensity to succeed” business applications — or those that are best positioned to survive — reached their highest quarterly level on record for the third quarter, after seeing virus-related declines in March and April.The authors describe this economic crisis as markedly different from the 2008-2009 recession, specifically laying out the two major reasons this is the case.“First, the monetary and fiscal policy responses were much more aggressive than usual, easing financial conditions and provided a catalyst for self-employment given new work from home arrangements. Second, the pandemic has provided many opportunities for new types of businesses.”The latest recession has created opportunities for new businesses. Image: Getty‘Never allow a good crisis to go to waste’History shows it’s certainly not unprecedented for recessions to yield new businesses, though.Even the 2008 financial crisis paved the way for the so-called disruptors that have defined the last decade. Airbnb and Groupon (GRPN) were founded in 2008. WhatsApp (FB), Uber (UBER), Slack (WORK), Venmo (PYPL), and Square (SQ) were created the following year, becoming some of the most successful and ubiquitous companies in the world, particularly during a digital-forward stay-at-home-centered economy.Story continuesFormer Chicago mayor Rahm Emanuel (echoing Winston Churchill, who first used the phrase after World War II) said, “Never allow a good crisis go to waste. It’s an opportunity to do the things you once thought were impossible.” He repurposed the sentiment in March, attempting to galvanize government officials early on in the pandemic.“This pandemic is actually inducing a surge in employer business startups that takes us back to the days before the decline in the Great Recession,” John Haltiwanger, a University of Maryland economist, told The Wall Street Journal recently.”Of course, not all firms are created equal. Applications include those who are self-employed or freelance for their main source of income. More Americans, perhaps those who were laid off or furloughed, have taken to freelancing or working for themselves during this time of crisis.Goldman couches the positive news on business formation with an important caveat: “Some of the surge in recent business applications likely reflects ‘pent-up’ applications from a backlog due to statewide closures in the early stages of the pandemic.”Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Ex-Facebook and Pinterest exec explains how tech addiction made him rethink his life’s workInstagram bug made users vulnerable to hackers, cybersecurity firm claimsParis Hilton explains why TikTok is her favorite appNetflix's Reed Hastings: ‘Thank God’ Blockbuster didn’t want to buy usWhat Silicon Valley still doesn't understand about its diversity problem"}]}