{"article": [{"url": "https://finance.yahoo.com/news/ceos-caught-in-geopolitical-fight-as-deadline-approaches-for-tik-tok-deal-124729635.html", "published": 1599119720.0, "headline": "CEOs caught in geopolitical fight as TikTok deadline looms", "body": "The saga surrounding the acquisition of popular social media app TikTok has thrust corporate CEOs in the unusual role of diplomacy, as companies caught in the middle of U.S.-China tensions look to curry favor on both sides of the Pacific.Microsoft (MSFT) and Walmart (WMT) are looking to leverage longstanding ties to China, while Oracle’s (ORCL) Larry Ellison and Safra Katz play up their cozy relationship with the White House. Bytedance founder and CEO Zhang Yiming, in perhaps the most unenviable position, must convince Beijing to allow his company to hand over the reins of its U.S. operations and 100 million monthly active users to an American company.“What it comes down to, is can the founder of Bytedance persuade the government in China to let this deal go forward,” said James Lewis, senior vice president and director of the technology policy program at the Center for Strategic and International Studies. “Microsoft and Walmart will have to go and placate the Chinese government. Walmart is a huge customer for Chinese goods; Microsoft has a huge presence in China.”President Trump has threatened to shut down TikTok in the U.S. if Bytedance does not find an American suitor for its operations by September 15th. A joint bid from Microsoft-Walmart bid and one from Oracle (ORCL) are reportedly frontliners in ongoing negotiations with the Chinese company.But the dealmaking has been complicated by a last minute maneuver from Beijing, which expanded its restricted export list last Friday. In its first major overhaul since 2008, the list specifies nearly 2 dozen technologies ,including artificial intelligence and “personalized content recommendation” tools, putting the transfer of TikTok’s core technology in doubt.“The Chinese Ministry of Commerce and Ministry of Science and Technology are giving themselves a tool to formally intervene in the forced sale of TikTok,” said Nina Palmer, a senior director in the China practice at Albright Stonebridge Group. “It's hard to tell based on the powers that the Chinese government gave itself, if it's intending to have a final say on the actual sale or if it's attempting to block the sale altogether.”Story continuesPalmer says updated export controls elevate the risk of a protracted fight over one of TikTok’s fastest growing markets. The restriction requires Chinese firms to apply for a local permit before starting negotiations with foreign companies to transfer its technology. Companies are then required to obtain an export license once the transfer agreement is signed. The Commerce Ministry has said any approval would require 45 working days, putting the timeline for approval right up against the November 12th deadline specified in a separate Executive Order.“It's also very possible the Chinese government doesn't meet its own deadlines. That has happened frequently with previous deals that we've seen in the past, like the anti-monopoly law,” said Palmer, singling out Qualcomm’s (QCOM) failed bid to buy NXP Semiconductors (NXPI).The world’s largest smartphone chip maker walked away from its $44 bid for Netherlands-based NXP in 2018, after China’s antitrust regulator refused to sign off on the deal, in the face of heightened trade tensions.HANGZHOU, CHINA - MARCH 31: ByteDance founder Zhang Yiming is seen on March 31, 2016 in Hangzhou, Zhejiang Province of China. (Photo by VCG/VCG via Getty Images)Bytedance has said it will comply with the new government order, though there are still questions about what that order would entail, and what technology Beijing would allow to be transferred. With talks reportedly hitting a snag over whether the app’s core algorithm, which determines the videos users see, will be included as part of the deal, TikTok’s roughly $30 billion price tag could be in jeopardy.“Generally when you buy a company, all the engineers, all the technology goes with the deal,” said Alfred Chuang, general partner of Race Capital, in a recent interview with CNBC, in which he called TikTok’s “15 million lines of machine learning code” its crown jewel. “How will they cut and convert that and how much of that will actually be transferred over? I feel like we now have a big dance here.”But Howard Yu, LEGO professor of management and innovation at IMD Business School says the platform is still an attractive buy even without the algorithm in place, particularly for Walmart and its efforts to attract a younger customer base.“It’s not really about the algorithm ... The remaining value of TikTok is all the influencers between the 16- to 25-year-old group. So whoever is getting it, whether it’s [Microsoft-Walmart] or Oracle, is really galvanizing the audience,” he said.Beyond TikTok, China’s new restrictions and the Trump administration’s heavy involvement in corporate dealmaking are likely to have lasting implications for how American and Chinese companies approach their investments moving forward, Palmer said.“I do think it sets a precedent, or rhetorical precedent for the Chinese to do something similar to U.S. companies,” Palmer said. “The export control catalog update demonstrates the Chinese government will use export controls in the U.S., China relationship free fall. Companies that are creating or storing any type of intellectual property or exporting technology from China as a manufactured good need to relook at their risk assessments on China.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaInfosys commits to hiring 12,000 American workers, expanding U.S. footprint25% of colleges likely to go out of business: Chegg CEO‘China’s goal is to replace you’: Barr warns leaders of America’s biggest businesses‘An unprecedented case”: What a U.S. TikTok ban would look like"}]}