{"article": [{"url": "https://finance.yahoo.com/news/big-companies-unleash-a-wave-of-pink-slips-as-coronavirus-keeps-hammering-jobs-market-141401529.html", "published": 1598692940.0, "headline": "Coke, American Air, MGM: Big companies unleash pink slips as coronavirus reshapes global economy", "body": "Thousands of workers are poised to join the ranks of the unemployed, as ongoing turmoil from the coronavirus pandemic prompted Corporate America to unleash a wave of pink slips this week —adding to an already staggering number of people without jobs.As Congress and the White House are locked in a stalemate over a fresh round of economic stimulus — which includes a highly coveted $600 unemployment bonus that’s helped prop up consumer spending — a range of big companies are moving to shave headcount.The timing could hardly be worse, given that the fate of a fiscal boost is uncertain, and the ranks of the jobless remain swelled with tens of millions of people.“We’re in a situation where unemployment is remarkably elevated,” Mark Hamrick, Bankrate.com’s senior economic analyst, told Yahoo Finance on Thursday.Here is a list of companies that announced layoffs this week.Coca-Cola (KO)The soda giant announced its global severance program on August 28. 4,000 workers in the U.S, Puerto Rico, and Canada are going to be offered buyout packages. The voluntary layoffs will impact employees who were hired on or before September 1, 2017. While workers will initially be given the option of choosing to take a buyout package, involuntary layoffs could ensue.A driver delivers Coca-Cola products to stores in Boston, Massachusetts. (Photo: REUTERS/Brian Snyder)American Airlines (AAL)American Airlines CEO Doug Parker sent a letter to employees on August 25 warning them that about 19,000 workers would be either furloughed or laid off on October 1, if another round of federal government financial relief doesn’t materialize by then.“It was assumed that by Sept. 30, the virus would be under control and demand for air travel would have returned. That is obviously not the case,” Parker wrote in a letter to workers.“Based on current demand levels, we at American now plan to fly less than 50% of our airline in the fourth quarter, with long-haul international particularly reduced to only 25% of 2019 levels,” he added.United Airlines (UAL) United Airlines pilots are bracing for the biggest job cuts in the company’s history. The airline sent a memo to employees on August 27 informing them that nearly 3,000 pilots will be furloughed between October 1 and November 30, unless Congress provides another $25 billion in financial relief, the amount the industry is currently requesting.Story continuesSalesforce (CRM)As the U.S. underwent the coronavirus shutdown in March, Salesforce CEO Marc Benioff pledged to protect employees from layoffs for 90 days, in a tweet he sent on March 25.Salesforce is pledging to its workforce Ohana not to conduct any significant lay offs over the next 90 days. We will continue to pay our hourly workers while our offices are closed. We encourage our Ohana to pay their own personal hourly workers like housekeepers & dog walkers.— Marc Benioff (@Benioff) March 25, 2020Yet on August 26, Salesforce began informing employees that their jobs would be cut unless they managed to find a new position at the company within 60 days. Approximately 1,000 jobs are on the line, though the actual number of layoffs may be less if employees find another position within the enterprise software giant’s ranks.In an interview with Yahoo Finance this week, Benioff expressed regret over the cuts, but added that it was “part of running our business in a successful way. And that does impact employees at different moments.”Bed Bath & Beyond (BBBY)Bed Bath & Beyond cut 2,800 jobs on August 26. The retailer plans to permanently shut down about 200 stores over the next two years.MGM Resorts International (MGM)A day after reopening The Mirage in Las Vegas, MGM Resorts International announced that it will send letters to 18,000 furloughed employees informing them of their separation from the company.The hotel and casino giant’s Empire City Casino in New York and Park MGM in Las Vegas are still closed.More from Sibile:Crunch time for United, American and Delta as clock ticks toward deadline, pressuring DC’s warring partiesTrump’s $300 per week unemployment boost ‘too little, too late’ to help August spending: GoldmanEconomist: Pay people $1K to take a coronavirus vaccine instead of forcing themDemocratic Rep. blasts Trump on USPS woes: ‘No hope’ of waking up knowing who won the electionTrump payroll tax deferment is ‘employee relations disaster’Find live stock market quotes and the latest business and finance news"}]}