{"article": [{"url": "https://finance.yahoo.com/news/what-trump-bad-month-means-for-senate-and-economy-160251259.html", "published": 1593947420.0, "headline": "What a bad month could mean for 'Trumpism,' the Senate and the economy", "body": "President Donald Trump’s mushrooming political challenges — and the rise of his presumptive Democratic challenger — may signal an electoral washout that alters the composition of the Republican-led Senate, and leads to big economic policy changes.Fallout from months of social unrest, an implacable surge in coronavirus infections and an economy still feeling the after-effects of lockdowns have seriously jeopardized the president’s reelection chances. Meanwhile, former Vice President Joe Biden has consolidated political support while steadily becoming favored to win in November.Political observers are devoting more scrutiny to what a Biden wave could mean for the Senate, and the economy. A handful of hotly-contested seats could hand the Democrats — who already control the House — complete control of Washington.Trump’s declining support among Republicans will make the GOP’s task to hold onto the Senate even tougher. Against that backdrop, the president delivered an Independence Day speech at Mount Rushmore perceived as a rallying cry to a disaffected base that’s being courted by those hoping to see a GOP rout in November.Issues like tax cuts, deregulation and conservative-leaning judges no longer resonate the way they once did with the GOP base given the current turmoil, according to Reed Galen, co-founder of the Lincoln Project, an anti-Trump GOP advocacy group.“There are a lot of conservatives, for whom, whether it was tax cuts or conservative judges that [formed] the bulwark of why they still defended the president,” Galen told Yahoo Finance last week.“What I think you see now is, in the context of COVID-19 and tens of millions of people out of work, the tax cut argument doesn't really work that much anymore, and folks are trying to figure out how they’re going to make their next month’s rent,” he added, also taking aim at vulnerable Republican senators.Last week, Eurasia Group upped the chances of a Biden victory in November to 60%, mirroring a dramatic shift in predictive markets that once overwhelmingly favored a Trump reelection. The firm also pegged at 55% chances that the Senate swings to the Democrats, up five points from its prior estimate.Story continuesJune was an unequivocally “bad month” for the president, noted Jon Lieber, Eurasia’s Managing Director — one that’s also shaping up to get even worse on Election Day.He estimates that a Biden victory of 4-5 percentage points nationally could result in a GOP loss of at least four vulnerable Senate seats in Arizona, Colorado, Maine and North Carolina — and perhaps even more.The current state of key Senate races ahead of November's election.While not a base-case for Eurasia, Lieber warned that a unified Democratic majority “would mean a major policy discontinuity is possible in January 2021. With this, a major shift in market sentiment over the next several months is possible.”Earlier this year, Wall Street fretted as Vermont Senator Bernie Sanders appeared all but certain win the Democratic nomination, but stumbled as Biden surged. The Democratic Socialist’s failure put a progressive, iconoclastic agenda seemingly out of reach.Yet Lieber cautioned that control of all three levers of power in Washington would let Democrats pursue “an aggressive agenda limited primarily to fiscal issues and new regulations — unless they eliminate the filibuster, which is more likely if they control a larger majority of 53 or more seats,” he added.The meaning of a 51st stateThe concatenation of a Trump loss and a Biden blowout that changes the Senate could lead to an outcome that until very recently has been considered unthinkable: Statehood for Washington, DC, and the addition of 2 more Senate seats that would more than likely be Democratic.In a historic first, the House of Representatives voted along party lines last month to make the nation’s capital a state. D.C. statehood has been a Democratic holy grail for years, and something Republicans have resisted.Eurasia thinks that if Democrats run the Senate, it could result in the elimination of a filibuster that would pave the way for two new Democratic Senators, “which would structurally and permanently swing the balance of power in Congress toward the Democratic coalition.”Vice President Mike Pence laughs as U.S. President Donald Trump holds a baseball bat as they attend a Made in America product showcase event at the White House in Washington, U.S., July 17, 2017. REUTERS/Carlos BarriaIt would also mean a virtually unobstructed, progressive economic policy from a potential Biden administration that would have carte blanche in Congress, the firm noted. That is seen including higher taxes, an expansion of government-backed health care, pro-labor and green infrastructure initiatives.“A larger Democratic majority could bring about structural changes that favor them,” Lieber wrote.‘A mission to excise Trumpism’Lieber believes that Trump “can still turn this around if there is a strong economic rebound this summer, if the contest shifts from being a referendum on his leadership and instead focuses on Biden’s advanced age or policy agenda, or if there were to be growing backlash to ongoing street protests, statues being torn down, or the defund the police movement.”However, Lincoln Project’s Galen thinks otherwise. Speaking to Yahoo Finance, he made clear that his group has a broader objective in mind.“This is not just a mission to take out Trump, but to extent possible to excise Trumpism from both the Republican party and the American political system,” he said, blasting senators for tying themselves so closely to the president.Galen charged GOP senators have “abdicated their ...responsibilities as a co-equal branch of government” — but now find themselves trapped between the rock of an unpopular incumbent and the hard place of unfavorable political trends.“They thought back in January that running with the president during a good economy was going to take them over the line. And now that they’ve attached themselves to him, they have very little to run on, and if they separate themselves from him too egregiously he will attack them, and drive their numbers down further,” Galen said.“I think come November, each of the members is likely to get what they deserve,” he added.-Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}