{"article": [{"url": "https://finance.yahoo.com/news/nikola-sets-record-straight-false-110000332.html", "published": 1600063700.0, "headline": "Nikola Sets the Record Straight on False and Misleading Short Seller Report", "body": "PHOENIX, Sept. 14, 2020 /PRNewswire/ -- Nikola Corporation (NASDAQ: NKLA) (\"the Company\") today issued the following statement commenting on a false and defamatory report published September 10, 2020, by Hindenburg Research (\"Hindenburg\"):(PRNewsfoto/Nikola Corporation)Nikola believes that the Hindenburg report, and the opportunistic timing of its publication shortly after announcement of Nikola's partnership with General Motors Co. and the resulting positive share price reaction, was designed to provide a false impression to investors and to negatively manipulate the market in order to financially benefit short sellers, including Hindenburg itself.Nikola has contacted and briefed the U.S. Securities and Exchange Commission (SEC) regarding Nikola's concerns pertaining to the Hindenburg report. Nikola intends to fully cooperate with the SEC regarding its inquiry into these matters.Nikola, an early-stage growth company, has been through extensive due diligence processes, starting with Bosch in 2017, Hanwha Group and ValueAct Capital in 2018, CNH Industrial N.V. in 2019, and VectolQ Acquisition Corp. and General Motors in 2020. Nikola remains laser-focused on laying the groundwork toward becoming the global leader in zero-emissions transportation. The Company continues to make significant progress on its strategic initiatives:Nikola Tre Semi-Truck Production: The Company expects the Nikola Tre semi-truck, a pioneer battery-electric semi-truck created in collaboration with IVECO through a joint venture established in 2019 for the short haul trucking sector, to be ready for production and available to customers by the fourth quarter of 2021. The Nikola/IVECO joint venture has enabled dedicated focus toward delivering the Tre in 2021. The Nikola Tre is a zero-emission semi-truck with over 720 kWh of battery and an approximately 300-mile range. (Photos from September 2020: Tre 1, Tre 2, Tre 3 and Tre 4.)Nikola Two Hydrogen-Electric Powered Semi-Truck Development: During 2021, Nikola will begin testing a pre-production Nikola Two, a hydrogen-electric powered semi-truck for the medium and long-haul trucking sectors, with more than 1,000 horsepower and 2,000 ft. lbs. of torque. Anheuser-Busch LLC previously announced its placement of an order for up to 800 trucks, with a prototype to be delivered by the end of 2021, testing planned for 2022, and a production version expected in the second half of 2023.In November 2019, a fuel-cell electric driven Nikola prototype completed a zero-emission beer delivery for Anheuser-Busch on public roads while operating on hydrogen. (Anheuser-Busch video can be viewed here.)Story continuesLarge Order for Electrified Refuse Truck: As previously announced, Nikola has received a minimum order of 2,500 electrified refuse trucks from Republic Services, Inc., with on-road testing likely to begin in early 2022 and full production deliveries expected to begin in 2023. (Read more in the Company's press release.)Strategic Partnership with General Motors for Badger Pickup Truck: As announced last week, the Company has formed a strategic partnership with General Motors, under which General Motors will engineer, homologate, validate and manufacture Nikola's Badger pickup truck, which will include variants with all-electric and hydrogen fuel cell powertrains. Badger production is expected to start in late 2022. (Read more in the Company's press release.)The Company also remains committed to achieving the following milestones: announcement of a hydrogen station collaboration by the end of 2020; substantial completion of Nikola's JV manufacturing facility in Ulm, Germany by year end 2020; and completion of Phase 1 of its greenfield manufacturing facility in Coolidge, Arizona by the fourth quarter of 2021.Hindenburg Report The report from Hindenburg, an activist short-seller financially motivated to manipulate the market and profit from a manufactured decline in Nikola's stock price, contains a number of false and misleading statements regarding the Company's operations and multi-year, groundbreaking R&D efforts. Among the starkest examples are the following:Short Seller Mischaracterizes Quote by Bosch Employee: Following the publication of the short seller report, Bosch stated, \"Specific instances in the [Hindenburg] report quoting a Bosch employee were taken out of context.\" Bosch has also stated, \"The employee spoke only about Bosch's own plans for the IAA industry show and H2Haul project for the European Union.\" Nikola and Bosch are aligned on the product roadmap for the Tre truck. The five trucks are currently being built and commissioned in Ulm, Germany, and are pre-production builds. Hindenburg either recklessly misunderstands or willfully misrepresents the vehicle pre-production process to fit its narrative.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Alleges That Nikola Buys and Does Not Make Inverters In-House: In its report, Hindenburg misrepresents that Nikola is claiming a third-party inverter is the Company's own technology by placing a sticker over the supplier's name. At no time did Nikola state that the inverter on the prototype truck shown in the video was the Company's or would be used in production. Nikola has been designing, engineering and working on its own inverters for quite some time. The Company does use third-party parts in prototype vehicles, some of which may be subsequently swapped out for its own parts in production. This is common practice among vehicle manufacturers and Nikola often blocks supplier names from the view of media and competitors. Every program is different as they require different specifications and validation.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Misrepresents Nikola's Historic Position on Battery Technology: The short seller report claims that Founder and Executive Chairman Trevor Milton made false statements regarding the Company's battery technology following the breakdown of its transaction discussions with ZapGo Ltd. In fact, the potential battery technology advancements are related to an ongoing confidential R&D partnership with a leading academic institution, not ZapGo. The Company is excited about potential breakthroughs related to its next generation battery technology.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Attempts to Falsely Link Departure of Former CFO with Nikola One Deposits Announcement: Nikola's former CFO was terminated by the Company. His departure, as well as subsequent litigation (which he voluntarily dismissed), were unrelated to the Company's announcement that it would refund Nikola One reservation deposits. As Nikola communicated via Twitter in April 2018, \"We don't use your money to operate our business. We want everyone to know we have never used a dollar of deposit money in the history of our company.\" Any innuendo by the short seller report that these separate events were connected and indicative of questions regarding Nikola's use of deposits is inaccurate.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Alleges that 2016 Nikola One \"was not a real truck and was, in fact, a pusher\": The Nikola One is a real truck that sits in Nikola's showroom. A pusher means a vehicle that was not designed to be moved by its own propulsion system. The Nikola One was, in fact, designed to be powered and driven by its own propulsion.Here are the facts:Gearbox was functional and bench tested prior to installation.Batteries were functional.Inverters functioned and powered the motors on a bench test prior to the show.Power steering, Suspension, Infotainment, Air Disc Brakes, High Voltage, and Air Systems were all functional.As Nikola pivoted to the next generation of trucks, it ultimately decided not to invest additional resources into completing the process to make the Nikola One drive on its own propulsion. After pivoting, Nikola produced prototypes for the Nikola Two, which are self-propelled and have been frequently demonstrated, beginning with demonstration runs at Nikola World in April 2019.The Nikola One was an incredibly successful proof of concept, and everything the Company learned from that experience has underpinned the successful development of its next generation of trucks that can be seen driven here.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Distorts Nikola One 2017 Third Party \"Future of Transportation\" Promotion Video and Creates a Popular Lie: Hindenburg seeks to portray Nikola as misrepresenting the capabilities of the Nikola One prototype in a 2017 video produced by a third party, as \"simply filmed rolling down a big hill.\" Nikola never stated its truck was driving under its own propulsion in the video, although the truck was designed to do just that (as described in previous point). The truck was showcased and filmed by a third party for a commercial. Nikola described this third-party video on the Company's social media as \"In Motion.\" It was never described as \"under its own propulsion\" or \"powertrain driven.\" Nikola investors who invested during this period, in which the Company was privately held, knew the technical capability of the Nikola One at the time of their investment. This three-year-old video of a Nikola prototype is irrelevant except for the fact that the short seller is trying to use it for its main thesis. The fact is, Nikola has real working hydrogen fuel-cell powered semi-trucks. Any reports intended to suggest that Nikola's trucks do not drive are erroneous, and recent videos of Nikola vehicles driving can be found here.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Intentionally Underestimates Extent of Hydrogen Production Capabilities: Nikola continues to believe that its planned hydrogen station network, and the production and distribution of hydrogen, will provide key competitive advantages that drive sustained profitability and shareholder value over the long term. Nikola representatives occupy leadership positions in industry organizations, including as working group chairs within the worldwide International Standards Organization (Heavy Duty) hydrogen fueling standard development and the Society of Automotive Engineers fuel cell standards committee for the HD vehicles' fuel economy. The Company has also partnered with one of the most well-known hydrogen experts in the world, Nel ASA. Further, Nikola has already installed a 1,000 kg hydrogen storage and dispensing demo station at its headquarters and ordered over $30 million of electrolyzers to support the initial hydrogen station rollout. Read more in the Company's press release.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Alleges NZT Program Was Scrapped after Unveiling: The program remains underway. The first NZT enclosed cab display model is sitting in Nikola's showroom at its headquarters. The Company has since spent millions of dollars preparing the NZT enclosed cab version for production using both internal and external resources. More to come at Nikola World 2020.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Quotes Spokesman of Fuel-Cell Competitor, Powercell AB, as Saying Nikola Battery and Hydrogen Fuel-Cell Technology is \"Hot Air\": Third-party competitor views of Nikola and the Company's technology are not relevant.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Takes Shots at Nikola Employees: Nikola believes in talent, and each of the employees unfairly described in the short seller report are making important contributions to the success of the Company. Nikola has built a deep bench of experienced leaders, with significant expertise in the automotive and electric-vehicles industry. Kevin Lynk is a talented mechanical engineer who has specialized in computational fluid dynamics (CFD), finite element analysis (FEA), computer-aided design (CAD) and product data management (PDM). Kevin has also played an instrumental role in the design and development of most Nikola vehicles since the beginning of the Company. Travis Milton previously owned and operated his own construction company preparing him for hydrogen station infrastructure and buildouts. Dale Prows has over 30 years of experience in supply chain and purchasing in the petrochemical and aluminum industries.These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price.Short Seller Misrepresents Value of 2010 Contract between Swift Transportation and dHybrid Systems LLC: This agreement was from 2010, and has no connection with or association to Nikola. In its report, Hindenburg criticizes Mr. Milton's statements about the approximately $250 million value of the contract between Swift Transportation and dHybrid (not Nikola), and cites only selected clauses to misrepresent the value of the contract as being worth \"only $16 million.\" What Hindenburg fails to include are the provisions in the contract whereby Swift was granted an option to acquire up to an additional 11,700 systems at $20,000 per vehicle, bringing the total potential value of the contract to $250 million. The contract can be found here (see paragraph 6(b)).These allegations by the short seller are false and misleading, and designed to manipulate the market to profit from a manufactured decline in Nikola's stock price. There are dozens more inaccurate allegations made by the short seller, which are not relevant to Nikola.Nikola is building novel and revolutionary technology from the ground up. As part of this process, and as part of the Company's evolution, growth and development, Nikola has quickly and nimbly pivoted its business model based on the industry, macro environment, technology and other factors in pursuit of the most value-enhancing path forward. Nikola remains committed to enhancing shareholder value for the long term and will not waver from its mission.ABOUT NIKOLA CORPORATION:Nikola Corporation is globally transforming the transportation industry. As a designer and manufacturer of zero-emission battery-electric and hydrogen-electric vehicles, electric vehicle drivetrains, vehicle components, energy storage systems, and hydrogen station infrastructure, Nikola is driven to revolutionize the economic and environmental impact of commerce as we know it today. Founded in 2015, Nikola Corporation is headquartered in Phoenix, Arizona. For more information, visit www.nikolamotor.com or Twitter @nikolamotor.FORWARD LOOKING STATEMENTSCertain statements included in this press release that are not historical facts are forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Forward-looking statements generally are accompanied by words such as \"believe,\" \"may,\" \"will,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"expect,\" \"should,\" \"would,\" \"plan,\" \"predict,\" \"potential,\" \"seem,\" \"seek,\" \"future,\" \"outlook,\" and similar expressions that predict or indicate future events or trends or that are not statements of historical matters. These forward-looking statements include, but are not limited to, statements regarding the company's expectations regarding its projected truck builds and related specifications; the company's expectations for its trucks and market acceptance of electric trucks; and market opportunity. These statements are based on various assumptions, whether or not identified in this press release, and on the current expectations of Nikola's management and are not predictions of actual performance. Forward-looking statements are subject to a number of risks and uncertainties that could cause actual results to differ materially from the forward-looking statements, including but not limited to general economic, financial, legal, political and business conditions and changes in domestic and foreign markets; the potential effects of COVID-19; the outcome of judicial proceedings to which Nikola is, or may become a party; failure to realize the anticipated benefits of the recently completed business combination; the conversion of pre-orders into binding orders; risks related to the rollout of Nikola's business and the timing of expected business milestones; the effects of competition on Nikola's future business; the availability of capital; and the other risks discussed under the heading \"Risk Factors\" in the definitive proxy statement/ prospectus/ information statement filed by VectoIQ on May 8, 2020 and other documents Nikola's files with the SEC. If any of these risks materialize or our assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. These forward-looking statements speak only as of the date hereof and Nikola specifically disclaims any obligation to update these forward-looking statements.SELL-SIDE ANALYST / INSTITUTIONAL INVESTOR INQUIRIES:Kim Bradykim.brady@nikolamotor.comMEDIA CONTACTS:Nicole Rosenicole.rose@nikolamotor.com 602-499-4795Colleen Robarcrobar@robarpr.com 313-207-5960Tim Lynch / Tim RagonesJoele Frank, Wilkinson Brimmer Katcher(212) 355-4449CisionView original content to download multimedia:http://www.prnewswire.com/news-releases/nikola-sets-the-record-straight-on-false-and-misleading-short-seller-report-301129952.htmlSOURCE Nikola Corporation"}]}