{"article": [{"url": "https://finance.yahoo.com/news/chamath-palihapitiya-views-on-aoc-and-future-leadership-120639814.html", "published": 1594624460.0, "headline": "Billionaire Palihapitiya on phenomenon of 'spectacular' AOC, and 'swinging pendulum' of politics", "body": "Billionaire investor Chamath Palihapitiya recently explained why the thinks New York Democratic Representative Alexandria Ocasio-Cortez is both interesting and spectacular.In a series of Twitter posts last month, the CEO and founder of tech holding company Social Capital lashed out at President Donald Trump while vowing to send money to Democrats — an amount he pegged at over $750,000.At that time, he also endorsed the polarizing freshman Congresswoman from Queens, also known as AOC.I love @AOC - she will be President one day. I’ll be there for her when she’s ready.— Chamath Palihapitiya (@chamath) June 24, 2020Over the weekend, Ocasio-Cortez waded into a new controversy by describing New York City’s spiking crime rate as a consequence of unemployed workers trying to feed their families. In a recent interview with Yahoo Finance, Palihapitiya explained his thinking on the evolution of the major parties, and why he considers AOC a “wonderful” politician.\"I spend a lot of time trying to understand where the parties are going. And I think what's happening is that the Republican Party is going to get torn apart because of people's affiliation or lack of affiliation with Donald Trump,” said the 43-year-old investor, who grew up in Canada in an immigrant family on welfare.“Similarly, I think the Democrats are too beholden to a, you know, a gerontocracy class that's, frankly, fading away. It's the reason they lost the election. And I think people are very perceptive of that,\" the billionaire added.The reason AOC is interesting is that \"she represents a standard-bearer of the movement in the left.\" He also thinks there will be \"standard-bearers, young, dynamic leaders, in the right that do the same thing.\"“And what that's going to do is actually create a movement among centrists,” he added.Story continuesThe ‘swinging pendulum’Palihapitiya, who has no party affiliation and prides himself on independence, believes what's happening currently is a disintegration of both the Democratic and Republican parties, and \"broadly speaking, that disintegration is a really good thing.\"When these standard-bearers, like Ocasio-Cortez, emerge from within both the Democratic and Republican parties, and \"those two poles exist at scale,\" it creates \"an opportunity for somebody down the middle to unify the country.\"Meanwhile, what AOC represents is something “really unique and special. I also think I would say the same thing about a Republican, a young, dynamic personality who has a modern view of economic theory and social programs, which is sorely needed,\" Palihapitiya added.At the moment, he explained, the pendulum is \"swinging toward progressives, and then it'll swing back to centrism.\"The latter “is where most of the good will be done. But I think AOC is spectacular,\" he added.SAN FRANCISCO, CA - OCTOBER 19: Founder/CEO of Social Capital, Chamath Palihapitiya, speaks onstage during \"The State of the Valley: Where’s the Juice?\" at the Vanity Fair New Establishment Summit at Yerba Buena Center for the Arts on October 19, 2016 in San Francisco, California. (Photo by Michael Kovac/Getty Images for Vanity Fair)According to Palihapitiya, \"politicians at their best are 'do no harm' because the real things that move society forward are incentives. And incentives are best designed by people who are experts of policy, not experts of politics.\"What that means is the U.S. is in need of a bipartisan political class “who just get out of the way, and who don't make things worse, and who allow us to do what we're all capable of doing, which is taking care of ourselves and fending for ourselves and, at the edges... design incentives so that we can take care of ourselves in a more humane and thoughtful way,\" he added.In the midst of a heated debate over what capitalism needs to do to better society, Palihapitiya made a case for the need to create incentives for a “more accountable form of capitalism, more progressive form of capitalism can actually make money for shareholders but return more value to people.”Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Palihapitiya: Skip government bailouts, put ‘more money into the hands of consumers’Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investors"}]}