{"article": [{"url": "https://finance.yahoo.com/news/tik-tok-star-zach-king-on-security-concerns-i-think-we-should-clear-them-up-213956278.html", "published": 1597682840.0, "headline": "TikTok star Zach King on security concerns: 'I think we should clear them up'", "body": "In the midst of a high-stakes geopolitical standoff over TikTok, one of the viral video app’s top influencers believes any lingering national security concerns should be addressed.TikTok is in the crosshairs of the U.S. government, following threats by the Trump administration to ban the service over concerns that the Chinese-owned service is feeding user data back to Beijing. Recently, a few popular creators have chosen to leave the platform in favor of competitor Triller, citing privacy and security concerns.“I’m in the camp where every company has so much data on us Facebook, Instagram, Google. I don’t know how it would be different, maybe you have to worry about the Chinese government having it and doing something malicious with it,” Zach King, a TikTok star with over 47 million followers on the app, told Yahoo Finance’s “The Final Round” in an interview.“But I think if there are security issues I think we should clear them up. As a user I’d love to know what those are to be wary about,” he added.Tech giant Microsoft (MSFT) is the prime candidate to purchase TikTok from ByteDance, its Chinese parent company, by September 15.Although many TikTok creators have been shaken by the threat — asking fans to follow them on other social media platforms — King suggested it could be an opportunity in disguise.“This is not the first time we’ve seen this...that’s part of the ecosystem, that’s part of the landscape of being a digital creator,” he explained.CHINA - 2020/08/10: In this photo illustration a TikTok logo is seen displayed on a smartphone. (Photo Illustration by Sheldon Cooper/SOPA Images/LightRocket via Getty Images)“You have to be able to diversify your brand, be spread out of different platforms,” King added. “If TikTok goes down I think you could see some of that attention going to these other platforms and back to platforms where people already came from” he said.King has been a digital creator for over 12 years. In addition to being the third most followed creator on TikTok, he boasts over 8 million subscribers on YouTube, and 23 million followers on Instagram.However, King tipped his hat to TikTok — which he compared to Vine, the now defunct short-form video app that was wildly popular before being shut down several years ago.Story continuesVine was an app “where things could instantly go viral within a couple hours. And that’s what the power of TikTok is,” King explained.In an effort to position itself for TikTok’s possible demise, Facebook (FB) recently launched Instagram Reels, an alternative King suggested he would consider.“I’m looking at platforms that spark my interest. They either have tools that I really enjoy or an alive community,” he told Yahoo Finance. He spoke favorably about Byte, a short-form video platform used to create 15 second looped videos, and founded by Dom Hofmann, co-founder of Vine.Sara Dramer is an associate producer at Yahoo Finance. Follow her on Twitter @saradramerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}