{"article": [{"url": "https://finance.yahoo.com/news/disneyland-reopening-delayed-beyond-july-003313026.html", "published": 1593027680.0, "headline": "Disneyland reopening is delayed beyond July 17", "body": "Disneyland has delayed its planned July 17 opening. (Jay L. Clendenin / Los Angeles Times)Disneyland's reopening will be delayed beyond July 17, Walt Disney Co. announced Wednesday, saying it will wait for state guidelines before specifying a new target date.The Anaheim destination, along with sister park Disney California Adventure, has been closed since mid-March amid the COVID-19 pandemic. Before the newly announced delay, it was slated to reopen in time for its 65th anniversary.But coronavirus infections have been rising, and park employees have pushed back against the mid-July date, citing safety concerns.\"California has now indicated that it will not issue theme park reopening guidelines until sometime after July 4,\" the company said. That would not give the company enough time to recall staffers and prepare the parks to reopen by mid-July, it said.Disney's Grand Californian Hotel & Spa and Disney's Paradise Pier Hotel, which had been slated to reopen July 23, will also be closed indefinitely.The Downtown Disney shopping and restaurant district adjacent to the parks is still slated to reopen July 9.Disney reopened Shanghai Disneyland on May 11 and the shopping and dining district in Orlando, Fla., known as Disney Springs on May 20. Hong Kong Disneyland reopened last week. Theme parks at the Walt Disney World resort in Florida are set to open July 11.The postponement for the Anaheim parks comes as California and other parts of the nation are seeing significant increases in COVID-19 cases.A dozen unions that represent about 17,000 Disneyland employees sent a letter to Gov. Gavin Newsom last week, saying that because of the coronavirus, opening the park would be unsafe. Disney's Wednesday announcement alluded to the union apprehensions and said the company has reached accords that cover more than 11,000 of its workers.Newsom's office expressed support for the delay.“The governor appreciates Disney’s responsiveness to his concerns about reopening amid the recent increases in COVID-19 infections across many Southern California counties,\" spokesperson Nathan Click said in a statement. \"The state and our public health experts continue to be in contact with the company and their workers — as well as other theme parks in the state — as we track and combat the spread of the virus.”Story continuesAndrea Zinder, president of the United Food and Commercial Workers union Local 324, which represents Disney's front-line retail workers, said Wednesday that while the group has agreed to Disney's recall process, the company has yet to address many of its concerns.\"We have indicated several times that we are not convinced that adequate safety measures have been completely put in place,\" Zinder said. \"There's more work to be done. We think this is a good sign, that Disney is willing to reconsider and look broader at some of the things we have suggested.\"Chief among the union's requests are on-premise COVID-19 testing for employees who are in regular contact with guests and additional paid time off in case a staffer must self-quarantine.Zinfer's comments were echoed by Maria Hernandez, a spokeswoman for Unite Here Local 11, which represents hospitality workers. The group is helping organize a vehicle protest around the Disneyland Resort on Saturday to bring awareness to its concerns over the health and safety of its staff.\"Our response to Disney postponing it's not about whether they open July 17 or July 5 ... it's about taking necessary steps like testing workers and ensuring proper cleaning,\" read a Unite Here statement. The labor group added that it had gained the \"assurance that face shields will be provided to those who need them, but major issues remain unresolved.\"Times staff writer John Myers contributed to this report."}]}