{"article": [{"url": "https://finance.yahoo.com/news/bill-gates-should-be-able-to-manufacture-a-lot-of-vaccines-in-2021-115358302.html", "published": 1596092480.0, "headline": "Bill Gates: We should be able to ‘manufacture a lot of vaccines’ next year", "body": "Billionaire philanthropist Bill Gates told Yahoo Finance in a recent interview that the development of medicine for the coronavirus is “moving at record speed,” and predicted that better treatments will be available this year and “a lot of vaccines” will be made next year.“During 2021 we should be able to manufacture a lot of vaccines,” says Gates, who along with his wife Melinda has donated more than $350 million to the fight against the pandemic through the Bill & Melinda Gates Foundation — some of which has supported research of therapeutics and vaccines.“That vaccine — a key goal is to stop the transmission to get the immunity levels up so that you get almost no infection going on whatsoever,” Gates says.Gates, a co-founder of Microsoft who led early advances in personal computing, described the rapid medical progress as a source of optimism amid “a huge tragedy.”“The only positive thing out of this is that the pace of innovation — the way our foundation is working with the private sector to create therapeutics and vaccines — that's moving at record speed,” he says.“That's what gives us hope that we can get the death rate down with better therapeutics, even by the end of the year,” he adds. “Many new therapeutics will be out.”On Monday, pharmaceutical companies Moderna (MRNA) and Pfizer (PFE) announced that their respective coronavirus vaccines had entered late-stage trials, each which will involve 30,000 people. Dr. Anthony Fauci, the nation’s top infectious disease official, said the Moderna trial will conclude by the end of the summer and results may be available by November, the New York Times reported.Meanwhile, hospitals in hot spots like Texas and Florida have experienced shortages of the anti-viral drug Remdesivir, which shortens hospital stays for patients with severe infections, health outlet STAT reported. Gilead, the manufacturer of the treatment, intends to have over 500,000 treatment courses available by October, and more than 2 million by December, CNN reported.Story continues“We need to stop this thing,” Gates says.Gates, who serves as co-chair of the Bill & Melinda Gates Foundation, made the remarks in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Until 2000, Gates led personal computing giant Microsoft. That year, he and his wife co-founded their foundation, which now employs nearly 1,500 people and boasts an endowment of $46.8 billion.Bill Gates, co-chair of the Bill & Melinda Gates Foundation, attends a press conference announcing the programme for partnership for the \"Our Global Goals\" project in Tokyo on November 9, 2018. (Photo by Toshifumi KITAMURA / AFP)A vaccine will likely require two doses, Gates says, estimating that immunization of 80% of the world’s population necessary to attain herd immunity will require 10 billion doses.“The only solution to this constrained supply is to have massive manufacturing capability,” Gates says. “So what we're looking at is no matter who invents the vaccine...where are there other factories around the world that could be brought up to speed.”Read more:Bill Gates: U.S. ‘sadly’ not taking coronavirus ‘seriously’Bill Gates: Spread of 'outrageous' coronavirus video shows flaw in social media platformsJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinBusiness leaders fear 'flaming on social media' if they criticize Trump: Fast Company Editor-in-ChiefMichael Dell: ‘Not enough’ progress on diversity in the tech industry‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}