{"article": [{"url": "https://finance.yahoo.com/news/netflixs-million-dollar-beach-house-star-hamptons-real-estate-market-is-really-robust-115953143.html", "published": 1598080040.0, "headline": "Netflix’s 'Million Dollar Beach House' star: Hamptons one of the only markets that's 'really robust'", "body": "The Hamptons are more expensive than ever.As the coronavirus pandemic drove Manhattanites away from the city, they sought refuge in the Hamptons. But very few Hamptonites wanted to sell their homes, creating fierce competition and sending prices skyrocketing.“We’re one of the only markets that are really robust and doing an incredible job,” said Michael Fulfree, Nest Seekers International realtor and star of the new Netflix original show, “Million Dollar Beach House,” which premieres August 26. “Last summer was a seller’s market. We’re in a completely different place ever since the pandemic has hit.”Since January, there have been more than $1.9 billion in transactions (over 800 homes sold) completed, he said. The median sales price in the Hamptons was up 27.1% in the second quarter compared to last year at the same time, for an average $1.08 million per sale — the highest in more than 13 years, according to residential brokerage Douglas Elliman.“We’ve seen huge demand because of the current situation that we’re in with the global pandemic,” said Fulfree.But as the market tightened up, the market had 13% fewer transactions than last year in the second quarter and inventory was down 25.5% compared to last year, according to a Douglas Elliman report.“Luckily, we do have a lot [of homes] coming to the market [soon] because people are seeing an opportunity,” said Fulfree.Beach Houses at Cupsogue Beach County Park in Westhampton Beach, Long Island, New York.“The demand was insane, the market was on steroids, and of course supply is limited,” said Shawn Elliot, managing director of the Ultra Luxury Division at Nest Seekers International and leader of The Elliott Team. “The Hamptons market filled up quickly.”Meanwhile, in Manhattan, prices fell more than 17.7% from a year ago to a median price of $1 million. And discounts aren’t helping properties move faster: properties spent 8.8% more days on the market than they did last year (124 days on average), and there were 54.1% fewer sales in the second quarter than last year at the same time.Story continues“New York City clients and the wealthy clientele were really looking for somewhere to go. And our market has become very appealing to those trying to get out of that three-dimensional lifestyle and have some room and a place to work remotely,” said Fulfree.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:The best cities in the US to buy a vacation home you plan to rent: studyThere’s a record number of vacant rental apartments in ManhattanA mass exodus from American cities? Not quite: poll"}]}