{"article": [{"url": "https://finance.yahoo.com/news/trump-push-ahead-supreme-court-124442162.html", "published": 1600674740.0, "headline": "Trump to push ahead with Supreme Court nomination amid partisan battle", "body": "By Lawrence Hurley and Andrew ChungWASHINGTON, Sept 21 (Reuters) - President Donald Trump on Monday prepared to push ahead with plans for his third U.S. Supreme Court nomination, which would cement a 6-3 conservative majority, as some Republicans wavered on whether to support the move weeks ahead of an election.The death of liberal icon Justice Ruth Bader Ginsburg upended the campaign season, giving Trump and his party an opportunity to strengthen its grip on the court whose decisions influence most spheres of American life, from healthcare to gun rights to voting access.Trump and top Republicans including Senate Majority Leader Mitch McConnell also gained a chance to steer the national discussion away from the coronavirus pandemic, which has killed almost 200,000 Americans and thrown millions out of work.Democrats accused McConnell of hypocrisy for being eager to usher a Trump nominee to a confirmation vote. In February 2016, he refused to hold a vote for a nominee of Democratic President Barack Obama following the death of conservative Antonin Scalia, saying it would be inappropriate in an election year.At least two Republican Senators -- Maine's Susan Collins and Alaska's Lisa Murkowski -- said over the weekend that the Senate should not vote on a nominee so close to an election, the first dissent against the idea from McConnell's 53-47 majority.Trump said in an interview with Fox News on Monday that he wanted to wait until Friday or Saturday to announce his nominee out of respect for Ginsburg.\"We should wait until the services are over for Justice Ginsburg,\" he said.Trump said a vote on his Supreme Court nominee should come before the Nov. 3 election.\"We won the election and we have the right to do so we have plenty of time, a lot of time,\" Trump told Fox. \"The final vote should be taken frankly before the election. We have plenty of time for that.\"Trump's rival in the Nov. 3 contest, Democratic former Vice President Joe Biden, called on other Republican senators to join them, and allow the winner of the election to name the next Supreme Court justice.Story continuesA Reuters/Ipsos poll published on Sunday found that a majority of Americans -- some 62% including about half of Republicans polled -- agreed with that sentiment.Trump said on Saturday that he would this week select a female jurist to fill Ginsburg's seat, and named two possible candidates: Amy Coney Barrett of the Chicago-based 7th Circuit and Barbara Lagoa of the Atlanta-based 11th Circuit.\"We were put in this position of power and importance to make decisions for the people who so proudly elected us, the most important of which has long been considered to be the selection of United States Supreme Court Justices. We have this obligation, without delay!\" Trump said on Twitter on Saturday, repeating the message Sunday.'RAW POLITICAL POWER'Biden said in his remarks on Sunday that Trump's effort to push a nomination through the Senate just weeks ahead of the election amounted to \"an exercise of raw political power.\"\"I am not going to assume failure at this point,\" Biden said. \"This vote, this fight, this nomination will not be over until the Senate votes, if it does vote. And winning that vote, if it happens, is everything.\"Polls show Biden leading Trump and also show Democrats have a chance of recapturing control of the Senate -- posing a difficult choice for embattled Republican incumbents themselves facing competitive re-election races.Voting has already begun in about a half-dozen states, and the number of Americans who cast ballots early or by mail is expected to rise sharply this year due to the coronavirus.Senate Minority Leader Chuck Schumer on Saturday told colleagues on a conference call that \"nothing is off the table for next year\" in responding to the move if Democrats capture the majority, according to a source who listened to the call.That could include ending the legislative filibuster, a Senate rule that in practice means 60 votes are needed to pass legislation.Biden, however, took a more conciliatory tone in his remarks on Sunday. He also reiterated his pledge to nominate an African-American woman to the court, which would be a historic first, if he has the opportunity.Trump has already appointed two justices: Neil Gorsuch in 2017 and Brett Kavanaugh in 2018. Kavanaugh was narrowly confirmed after a heated confirmation process in which he angrily denied accusations by a California university professor, Christine Blasey Ford, that he had sexually assaulted her in 1982 when the two were high school students in Maryland.Throughout the weekend, people gathered outside the Supreme Court to mourn Ginsburg -- a trailblazing jurist who acquired a unique pop-icon status among liberals who nicknamed her \"The Notorious RBG\" -- with flowers, signs and in candlelit vigils.Inside, her chair and the section of bench in front of it were draped in black crepe, a gesture that few will see as the court is conducting business remotely during the pandemic.(Reporting by Lawrence Hurley in Washington and Andrew Chung in New York; Additional reporting by Jan Wolfe, Writing by Scott Malone; Editing by Daniel Wallis and Chizu Nomiyama)"}]}