{"article": [{"url": "https://finance.yahoo.com/news/how-a-remote-work-boom-will-affect-salaries-jobs-and-where-people-live-190344317.html", "published": 1593094280.0, "headline": "How a remote work boom will affect salaries, jobs, and where people live", "body": "For office workers who still have jobs during the coronavirus crisis, the Great WFH experiment of 2020 seems to be angling toward a success, albeit one with caveats.Coronavirus won’t kill the office permanently. Eventually, when risks of gathering ebb to a trickle, some people, longing to wear something other than sweatpants, will be happy to work alongside their coworkers, resuming water cooler discussions and the occasional happy hour.But after being home on Zoom, Hangouts, Meet, FaceTime, Skype, and Slack, workers and companies alike are second-guessing the need to return.Already, companies like Twitter (TWTR) and Square (SQ), both founded and run by Jack Dorsey, have implemented a permanent work-from-home option. Facebook (FB) founder and CEO Mark Zuckerberg said that in the next decade, 50% of the company’s workforce might be remote, and that it would “localize” salaries to wherever its employees choose to be on Jan. 1, 2021.So far, companies have a few months of data to draw from to decide whether working from home works for their workforces.“Remote working has worked better than we thought,” Rich Lesser, CEO of Boston Consulting Group, recently told Yahoo Finance.A way to cost cut — including people’s salariesOffice costs are often substantial, especially for companies with large footprints in high-rent areas. Space, electricity, personnel, not to mention any amenities and perks companies offer, are expensive to provide.If companies see no major productivity issues with remote work, they may encourage employees to work from home and even try to downsize. And these cost-cutting measures may even come in the guise of employee flexibility, making it somewhat of a win-win, at least for those who have space to work at home.Aside from rent, personnel cost may shape up to be one of the more interesting things to watch as more companies allow people to work remotely.As Mark Zuckerberg said for Facebook, salaries would likely be localized, since companies pay market values depending on geographic area — reflecting the cost of living and the labor market.Story continuesAccording to Mercer, the HR consulting firm, it’s unusual for a company to adjust salaries downward in the event of a location change.Few commuters are seen in Grand Central Terminal on June 24, 2020, in New York City. (Photo by Johannes EISELE / AFP)“It’s very hard to lower people’s salaries,” said Matt Stevenson, a partner at Mercer. “Part of that is history has shown that people react badly when you lower salaries for any reason. As a result, you may find that if you lower someone's salary because they move, they’ll start looking for a different job.”For some people, this might be a reasonable compromise. After all, you need less money to live in South Dakota than you do in San Francisco. Mary Ann Sardone, another partner at Mercer, said typically these geographic adjustments are much larger for people making under $100,000 a year than someone who earns comparatively more.“As the pay gets higher and higher, the labor market expands. It’s no longer local but national or regional,” said Sardone.Instead of lowering someone’s salary, Sardone said the more common option was to change their pay band – the salary range for a particular position that factors in experience, performance, and usually, location.Someone making $50,000 in a band of $45,000 to $55,000 in New York City could move to New Hampshire and keep her salary, but have a new band with an upper limit of $50,000. Though her salary may not change upon moving, she may find that raises will be slower to come and her pay eventually evens out with the new geographic area.NEW YORK, NEW YORK - JUNE 24: A sign with information to stop the spread of COVID-19 is seen at the entrance to Bryant Park as the city moves into Phase 2 of re-opening following restrictions imposed to curb the coronavirus pandemic on June 24, 2020 in New York City. Phase 2 permits the reopening of offices, in-store retail, outdoor dining, barbers and beauty parlors and numerous other businesses. New York state plans on re-opening in four phases. (Photo by Alexi Rosenfeld/Getty Images)Clusters and scalingThere is some precedent to the idea of a downward salary adjustment, however. Companies like GitLab, a software development tool, offer a compensation calculator for anyone — even the public, even you right now — to see. Their open compensation principles may provide a framework for how other companies might operate.GitLab explains that it localizes salaries because it allows the company to maximize the number of people they can hire. Hiring workers in low-wage regions is a “better deal for them,” because it makes discretionary income more even across the board. This ensures employees in low-wage regions don’t have “golden handcuffs,” and allows Gitlab to retain the largest pool to recruit from.“Adjusting pay according to the local market in all cases is fair to everyone,” the company says.Mercer’s Stevenson pointed out that sometimes people move out of a city to work remotely, and others follow. Pretty soon, there might be a cluster of people, and that could be enough to drive up the cost of living.With coronavirus potentially changing where people want to live long term, certain regions might see influxes of people, elevating real estate values – and the quality of schools and amenities as well.Recently, rent has become cheaper in some big cities as residents have fled due to Covid. At the same time in smaller cities’ rents have spiked.Sardone pointed out that widespread, indefinite remote working would likely have a flattening effect on salaries, depressing numbers in big cities and pushing up numbers in more rural areas and smaller cities, though it might take a while to happen — far slower than the dynamic of a large company coming and disrupting a smaller city or town.A lot depends on what happens with vaccines, the economy, the stock market, and what the post-Covid landscape looks like. But if things continue like this, it might be a boon for rural America — and relief for city prices.Correction: A previous version of this article misidentified GitLab with GitHub. GitHub also offers remote work.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Here’s a running list of companies boycotting Facebook'Robinhood is not behind the rally,’ Barclays says as retail demand surgesWant a 'slice' of a stock? Demand booms for fractional shares as markets soarLeisure and hospitality drive jobs numbers higherOverdraft fees have forced the poor out of banks: Former FDIC chairWhy pandemic insurance is impossible"}]}