{"article": [{"url": "https://finance.yahoo.com/news/microsoft-surface-duo-review-130005790.html", "published": 1599725300.0, "headline": "Microsoft Surface Duo review: A two-screen Android phone that could change everything", "body": "The Microsoft Surface Duo is here, and that means you can finally get your hands on the Android-powered foldable phone on Thursday for $1,399.Yes, you read that right. Microsoft (MSFT) built a two-screen, foldable, Android (GOOG, GOOGL) phone. There’s nothing quite like it on the market. Sure, there are foldable phones, and phones with two screens, but Microsoft has married the two concepts incredibly well, albeit with hiccups.The software is a bit finicky at times, though it’s come a long way after an early software update Microsoft released for the phone; its performance can feel slower than leading phones; and its camera system is, well, flawed.But man, for a first-generation device meant to dramatically improve handheld productivity, the Surface Duo has the makings of a revelation.Pros:Unique two-screen design.Fantastic for productivity.Easy to use in multiple modes.Priced competitively with other folding phones.Cons:Software is still buggy.Performance can feel sluggish compared to other phones.Camera system is a letdown.Surface Duo screensThe Surface Duo is designed like a book, with a glass-coated outside that serves as a cover when it’s closed. It’s got a fingerprint reader built into one edge, and a shiny chrome hinge joining its screens on the other.Microsoft's Surface Duo is a revelatory device, but suffers from first-generation flaws. (Image: Dan Howley)Open it up, though, and you’re met by the Duo’s twin 5.6-inch PixelSense displays. Taken together, Microsoft says the two make up the phone’s 8.1-inch PixelSense Fusion display.When closed, the Duo is surprisingly slim, just a bit bigger than an iPhone 11 Pro — and it’s even thinner when it’s open. So if you’re worried that this will take up space in your pocket, put that out of your mind.It’s odd not seeing your screen, but it’s also a relief to avoid seeing notification after notification pop up. And if you want, you can open the Duo all the way using its 360-degree hinge, and always have both displays available.The Surface Duo is surprisingly thin for a two-screen phone. (Image: Dan Howley)Using the Duo in this way means having to pick which panel you want to use. Special software in the phone is able to determine how you’re holding the phone and lights up the screen you’re looking at. And if it doesn’t, you can double-tap the display you want to use.Story continuesYou can also use the Duo in tent mode to watch movies, or keep apps like Slack or Teams open throughout the workday to make sure you don’t miss any notes from your coworkers.Using apps on both screensWhat makes the two screens so impressive is that, despite a small air gap dividing them, you can still drag and drop content between them depending on the app. So if you’ve got something in Outlook you want to put into Word, you can just highlight it and drag it on over. It’s not available in all apps, yet, but I’m hoping Microsoft works with enough developers to make that happen over time.You can run two separate apps on each screen, and even have select apps interact. (Image: Dan Howley)At times, the Duo was unable to determine which orientation I was holding it in. Still, you can’t deny the benefits of being able to use different apps on two separate screens at the same time. I’ve been able to type out edits to articles on one panel, while responding to Slack messages on the other. I’ve also scrolled through Instagram, while streaming old episodes of “It’s Always Sunny in Philadelphia.”There’s a lot to gain from using apps like this, and because the Duo is powered by Google’s Android, you get full access to millions of apps from the Google Play Store.A single app can also be used on both screens, giving you the ability to navigate and consume content with ease. (Image: Dan Howley)You can also expand apps to spread out across both displays, giving you more room to work. With Outlook, for instance, you can browse your inbox on the right screen, while reading a full-size message on the left.Using the Duo as a smartphoneBut you’re going to use the Duo as a standard smartphone, too. So what’s it like? Let’s start with the camera.Situated inside the phone, the camera pulls double duty for selfies and regular photos, so you have to open the Duo before you can start taking pictures. The Duo also had a hard time determining if I was trying to take a selfie or a photo of a subject, resulting in one too many close-ups of my mug of a face.This sample photo taken with the Surface Duo demonstrates how the camera's difficulty with capturing light and details. (Image: Dan Howley)Photo quality was subpar compared to the likes of Apple’s (AAPL) iPhone 11 Pro Max, or even Google’s $349 Pixel 4a. The Duo was simply unable to capture as much detail, and, as a result, images looked blurred and out of focus.A photo taken with the iPhone 11 Pro Max shows how far apart the two phones are in terms of camera capabilities. (Image: Dan Howley)Overall performance felt fine, but I did notice some lag when snapping photos, which was surprising considering the Duo uses Qualcomm’s Snapdragon 855 processor and 6GB of RAM.On the plus side, the Duo’s battery life was seriously impressive, easily lasting all day and into the next without issue.Should you get it?At $1,399 and still buggy, the Surface Duo feels more like a demonstration of what Microsoft plans for its smartphone future. It’s similar to what the company did with its original Surface line, getting the idea out there, perfecting it over time, and finally, releasing a damn good product that rivals anything else on the market.For now, the Duo is a hard sell. But Microsoft deserves credit for taking a big risk. And down the line, hopefully the company lets those risks pay off just as it has with the original Surface.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple’s Sept. 15 event is all about the Apple Watch2 reasons fears of a dot-com style tech bubble are overblownApple’s iMac 27-inch has a colossal power and a gorgeous displayApple fires shot at Google in new privacy adFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}