{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-september-19-2020-184747657.html", "published": 1600933160.0, "headline": "Jobless claims: Another 870,000 Americans filed new unemployment claims last week", "body": "Another 870,000 Americans filed for first-time unemployment benefits last week, unexpectedly rising slightly from the prior week to reaffirm a slowdown in the U.S. economic recovery.The U.S. Department of Labor (DOL) released its weekly jobless claims report at 8:30 a.m. ET Thursday. Here were the main metrics from the report, compared to Bloomberg estimates:Initial jobless claims, week ended Sept. 19: 870,000 vs. 840,000 expected, and 866,000 during the prior weekContinuing claims, week ended Sept. 12: 12.580 million vs. 12.275 million expected, and 12.747 million during the prior weekAt 870,000, Thursday’s figure represented the fourth consecutive week that new jobless claims came in below the psychologically important 1 million level, but was still high on a historical basis. Nevertheless, the labor market has made strides in recovering from the pandemic-era spike high of nearly 7 million weekly new claims seen in late March.“While jobless claims under a million for four straight weeks could be considered a positive, we’re staring down a pretty stagnant labor market,” Mike Loewengart, managing director of investment strategy for E-Trade Financial Corporation, said in an email Thursday. “This has been a slow roll to recovery and with no signs of additional stimulus from Washington, jobless Americans will likely continue to exist in limbo. Further, a shaky labor market translates into a skittish consumer, and in the face of a pandemic that seemingly won’t go away without a vaccine, the outlook for the economy certainly comes into question.”On an unadjusted basis, initial jobless claims rose by a greater margin, or about 28,500, from the previous week to about 824,500. The seasonally adjusted level of new claims rose by 4,000 week on week.By state, unadjusted claims in California – where joblessness due to the pandemic has compounded with labor market stress due to wildfires – were again the highest in the country at more than 230,000, for an increase of about 4,400 week-over-week. Georgia, New York, New Jersey and Massachusetts also reported significant increases in new claims relative to the rest of the country. Most states reported at least increases in new claims last week.Story continuesContinuing claims have also trended lower after a peak of nearly 25 million in May, and fell for a second straight week in this week’s report. But these claims, which capture the total number of individuals still receiving unemployment insurance, have not broken below the 12 million mark since before the pandemic took hold of the labor market in mid-March.Hundreds of people line up outside a Kentucky Career Center hoping to find assistance with their unemployment claim in Frankfort, Kentucky, U.S. June 18, 2020. REUTERS/Bryan WoolstonConsistently high numbers of individuals have been filing for, and receiving, jobless benefits from regular state programs, and those newly created during the pandemic. The number of individuals claiming benefits in all programs for the week ended September 5 – the latest reported week – fell for the first time following three straight weeks of increases to 26.04 million, from the nearly 29.8 million reported during the prior week.Of that total, more than 11.5 million comprised individuals receiving Pandemic Unemployment Assistance, which is aimed at self-employed and gig workers who don’t qualify for regular unemployment compensation but have still been impacted by the pandemic.One of the major downside risks to further improvement in the labor market has been concern that Congress may not soon pass another round of fiscal stimulus aimed at keeping individuals on payrolls during the pandemic. Economists have already said that the end of the last round of augmented federal unemployment benefits in late July has weighed on improvements in joblessness.“The current picture suggests that growth has slowed sharply in the past three months, and that the labor market is stalling again in the face of rising infections and the sudden ending of federal government support to unemployed people,” Ian Shepherdson, chief economist for Pantheon Macroeconomics, said in a note Wednesday.The need for more fiscal stimulus to encourage the economy’s ongoing recovery has become a key talking point of policymakers including Federal Reserve Chair Jerome Powell and his colleagues at the central bank. In congressional testimony Tuesday and Wednesday, the Fed leader said further fiscal stimulus is “unequaled” by any other form of support that could be unleashed, with the central bank’s lending facilities having gone largely untouched by Main Street.Another 870,000 Americans filed for new unemployment claims last week on a seasonally adjusted basis. (David Foster/Yahoo Finance)See also: Congress debates leaning on Fed or PPP for small business aid“The concept of the [congressionally authorized] Paycheck Protection Program was helpful because for many of those kinds of businesses – those businesses that don’t have cash reserves – the ability to get a forgivable loan if they stay open, if they keep people employed, was sound, and did give them the prospect of staying in business,” Joseph Minarik, The Conference Board chief policy economist and former Office of Management and Budget chief economist, told Yahoo Finance. “The notion that you have businesses that have been weak over the last few months and now have simply had to shut their doors, that’s a real problem, and it is not necessity going to be solved with a loan.”—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}