{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-pfizer-strikes-covid-vaccine-deal-with-us-as-trump-issues-dire-warning-164001082.html", "published": 1595418500.0, "headline": "Coronavirus update: Pfizer strikes covid vaccine deal with US as Trump issues dire warning", "body": "Attention shifted to California on Wednesday, which topped former COVID-19 epicenter New York as the state with the most cases, with hopes growing for a successful vaccine as the pandemic tightens its grip around the country.The U.S. remains the global hotspot, with nearly 4 million of almost 15 million cases around the world. The country’s inability to get a handle on the crisis has amplified fears for the economy, and formed the crux of President Donald Trump’s remarks on Tuesday.At the re-started coronavirus briefings, Trump warned the outbreak would “probably, unfortunately, get worse before it gets better — something I don’t like saying about things, but that’s the way it is.” He also bowed to growing pressure to embrace face coverings in public, saying that “whether you like the mask or not they have an impact.\"Some states are showing a potential slowdown, with 60,000 cases recorded Tuesday, down from a peak of over 70,000 last week. Yet daily casualties topped 1,000, the first time since May 29. Deaths have slowed in recent weeks, but largely lag case surges, and it remains to be seen how that will affect hospitalizations. Some hospitals in Florida, for example, are at capacity for ICU beds and staff.Meanwhile, hopes abound for the rapid deployment of a vaccine, which promises the strongest strategy to reopening fully — even as many companies weigh extending work-from-home until 2021 at the earliest. On Wednesday, the Trump administration announced a nearly $2 billion deal with Pfizer (PFE) and BioNTech (BNTX) to produce 100 million vaccine doses once emergency use authorization is given by the U.S. Food and Drug Administration, which could happen this year.Pfizer previously agreed to 30 million doses to Britain, once it receives approval. The company has said it expects to produce 100 million by the end of 2020, with up to 1.3 billion by the end of 2021.Wednesday’s announcement was in addition to $1.2 billion for 300 million doses of AstraZeneca (AZN) and Oxford University’s vaccine, which could be available as early as October, according to HHS. The department has been striking deals with pharmaceutical companies to ensure supplies of vaccines once they are available. Operation Warp Speed has set a goal of 300 million doses— just under the U.S. population total of nearly 350 million.Story continuesHowever, even with all the promises of production, prioritization of the vaccines’ distribution will leave a majority of the public unvaccinated until 2021. Dr. Anand Parekh, chief medical adviser at the Bipartisan Policy Center, told Yahoo Finance’s The First Trade as much on Wednesday.“If everything goes perfectly well, we could be in a situation where by the end of the year...the FDA could approve vaccines. Let’s not kid ourselves and think that we’re all going to be vaccinated by the end of this year. Best case scenario this is predominantly a 2021 situation,” he said.Trump restarts coronavirus briefingsCases are rising outside New York. (Graphic: David Foster/Yahoo Finance)Trump on Tuesday restarted what he deemed “successful briefings,” after a nearly three-month hiatus.The roughly 45-minute briefing largely covered the administration’s actions, while the president continued to call out China for the virus’ spread and touted comparatively lower U.S. death rates— on the day that fatalities spiked to over 1,000.“My administration currently has zero (unfulfilled) requests... for equipment or anything else that they need from the governors. No governor needs anything right now, and we think we’ll have it that way until the end, because, frankly, we are stocked up and ready to go wherever we have to go,” Trump said.While warning the outbreak would get worse, he also reiterated his belief the virus will eventually “disappear It will ” Trump said.But many health experts felt differently, with one saying the virus is less likely than ever to go away as the spread gets more diffuse.When asked if Americans will judge him on the pandemic response on Election Day, Trump partly agreed.“I think the American people will judge us on this, but they’ll judge us on the economy that I created and that already we’re creating,” he said. “I don’t think any administration, any President has accomplished so much as we’ve accomplished, from energy to health to so many other things.”Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}