{"article": [{"url": "https://finance.yahoo.com/news/apple-goes-all-in-with-subscriptions-with-new-fitness-platform-and-apple-one-bundle-182027901.html", "published": 1600176500.0, "headline": "Apple goes all in with subscriptions with new Fitness+ product and Apple One bundle", "body": "Apple (AAPL) is diving deeper into the subscription business. On Tuesday at its online event, the company announced a new fitness subscription platform called Apple Fitness+ that works via its Apple Watch and a new subscription bundle system that seeks to simplify the myriad offerings.Using metrics like heart rate from the Apple Watch, Apple Fitness allows a user to access a workout class no matter where they are and on any Apple device. Though Apple didn’t reference the coronavirus pandemic that closed gyms across the country, the company likely sees an opportunity to gain market share without that type of competition. The service will cost $9.99/mo.Apple's new fitness app uses the Apple Watch's data to enhance the experience. (Apple)If you’re deep into the company’s ecosystem, Apple wants you to try its bundle Apple One, which comes in three tiers.The premium tier costs $29.95/mo and includes Apple Music, Apple TV+, Apple Arcade, Apple News+, Apple Fitness+, and 2TB of iCloud storage.(Apple)The individual and family tiers have the music, TV, arcade, and cloud services for one or to share.Apple is providing 30-day free trials for new users, and this starts sometime this fall.While music streaming service Apple Music, video content channel Apple TV+, game app Apple Arcade, news aggregation service Apple News+, and cloud storage system iCloud are all established, Apple has never bundled them before.See also: Apple unveils iPad 8 for $329 and iPad Air 4 for $599Apple has been eyeing subscriptions for some time now, as its hardware division’s growth has flagged as people keep MacBooks and iPhones for longer and longer.Apple One's services on a variety of its devices. (Apple)For a company, subscriptions mean recurring revenue that it can mostly count on, and Apple is looking to capitalize on the momentum generated by Apple Music and Apple TV+ subscription with Apple One.In the past when Apple’s product growth has flagged, the company has occasionally managed to use its immense power as a market leader and trendsetter to do something most companies simply cannot do: It’s created or legitimized a new product category, forcing the market to adopt something, like the iPad, Apple Watch, and AirPods. Before, tablets, smart watches, and wireless headphones weren’t ubiquitous.Story continuesThe subscription model may seem like a departure from the hardware-centric business model, but Apple does keep its devices front and center, as the Apple Watch’s role in its fitness app illustrates. But even if this isn’t something anyone asked for, Apple seems confident that it can create a new category to lead.---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Demand for ‘certified used’ bikes is so strong, some sell above new sticker priceEvery investor has 'a silent partner' when trading stocks: veteran CIOPoll: 83% of companies ready to embrace new work conditions after coronavirus2 tax safe harbors that new traders need to know aboutWhy the 2020 rally doesn’t feel like a bubble: hedge fund veteranNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}