{"article": [{"url": "https://finance.yahoo.com/news/obamacare-supreme-court-arguments-amid-the-coronavirus-pandemic-202146671.html", "published": 1597850960.0, "headline": "Supreme Court to hear arguments on Obamacare, now crucial amid coronavirus pandemic, right after election", "body": "Americans are increasingly relying on Medicaid — a key part of the Affordable Care Act (ACA), also known as Obamacare — to provide health care coverage as the economic shock from the coronavirus pandemic continues across the U.S.Raising the stakes as a vaccine is developed, the Supreme Court will begin hearing oral arguments on a case that could determine the fate of Obamacare on November 10, one week after Election Day. A final judgment on the constitutionality of the landmark health care law’s “individual mandate” provision, and potentially the entire law, is expected in the spring of 2021.Supporters of the ACA have said that if the health care bill were to be overturned, it could lead to “total chaos” as millions of Americans would lose health insurance coverage and struggle to afford health care.Julie Rosamond discusses a new rule to require \"able-bodied\" Medicaid recipients to work or volunteer for a minimum number of hours each month, or be locked out of health benefits in Lepanto, Arkansas, U.S., May 2, 2018. (Photo: REUTERS/Karen Pulfer Focht)And even with Obamacare in place, a new Commonwealth Fund survey found that 43.4% of adults were inadequately insured for the first half of 2020, and half of adults who spent time “any time uninsured” reported problems paying their medical bills. If Obamacare is dismantled, as the Trump administration wants and a 2021 Supreme Court decision could entail, then the situation becomes even worse for millions of Americans already struggling with health care bills.“This is just a persistent problem in the health system right now, and it’s likely to get worse as this economic downturn, the dramatic economic downturn, continues and affects people’s incomes,\" Sara Collins, vice president of the Commonwealth Fund, told Yahoo Finance.Over 40% of adults are underinsured. (Chart: The Commonwealth Fund)Obamacare amid the coronavirus pandemicSince March 1, over 54 million Americans have filed for unemployment and an estimated 27 million people have lost employed-sponsored health care coverage. Many of those unemployed have turned to signing up for COBRA, the ACA marketplace, or Medicaid.“So if you lose your job right now, your ability to retain some form of health care coverage is going to really depend on whether your state has expanded Medicaid or not,” Jesse Cross-Call, a senior policy analyst at the Center on Budget and Policy Priorities (CBPP), told Yahoo Finance.Story continuesThe Medicaid expansion is a key component of Obamacare. Overall, Medicaid “promotes more comprehensive benefits than private insurance at significantly lower out-of-pocket cost to beneficiaries, but its lower payment rates to health care providers and lower administrative costs make the program very efficient,” according to CBPP.The ACA originally intended for national Medicaid expansion, but the Supreme Court ruled in 2012 that the policy was “unduly coercive” and left it up to the states to decide if they wanted to adopt that expansion.Oklahoma and Missouri recently approved ballot measures to expand Medicaid. (Graphic: David Foster/Yahoo Finance)“It has created this patchwork where Texas is a non-expansion state, but next door in New Mexico, it is an expansion state,” Cross-Call said of the resulting system. “If you’re a low-income worker with income right below the poverty line, you’re treated differently depending on which state you live in.”Over 73 million people were enrolled in Medicaid for the month of May, an increase from the previous three months, according to the Centers for Medicare and Medicaid Services (CMS). And March’s increase, according to CMS, was the first increase in enrollment since March 2017.‘There was a need for health care coverage before COVID, but there is even more so now’To be eligible for Medicaid, an individual has to have an annual income that’s below 138% of the federal poverty level; live in a state that adopted the Medicaid expansion; and either be pregnant, elderly, disabled, a parent/caretaker, or a child. The threshold increases depending on the number of people in a household.“Medicaid is a means-tested program,” Robin Rudowitz, vice president for the Kaiser Family Foundation, told Yahoo Finance. “It’s countercyclical. Just like in previous economic downturns, when individuals lose jobs and incomes, more people become eligible and enroll in the program. Unlike the Great Recession, now the Affordable Care Act is in place. We’ve always seen Medicaid enrollment rise during economic downturns, but now, we’re also always seeing a lot of people who become uninsured.”And while Medicaid is crucial to providing coverage for the more vulnerable populations like the elderly and disabled, it’s also a major source of health care coverage for essential and front-line workers throughout this pandemic.The NYC Department of Sanitation works during the coronavirus pandemic on April 14, 2020 in New York City. (Photo by Noam Galai/Getty Images)“There was a need for health care coverage before COVID, but there is even more so now,” Cross-Call said. “These are working individuals. There’s a large number of them who work in what are considered at this point to be essential or front line industries. These are folks who are home health aides or who work in a grocery store. Basically, they don’t have the luxury of working from home and they’re in settings where they’re likely to be exposed to the coronavirus.”At least 5 million essential workers — including those who work in health care, food production, grocery stores, and transportation/waste management — are enrolled in Medicaid, according to a CBPP analysis. The study also estimated that an additional 650,000 essential workers who are uninsured would be eligible for Medicaid if their states adopted the expansion.“The states that haven’t implemented at this point, by and large, are conservative states,” Cross-Call said. “There does seem to be some ideological component about government health care in there. But this cost issue has been persistent.”Furthermore, according to research from the Kaiser Family Foundation, if the remaining non-expansion states were to finally adopt the expansion, “an estimated 2.8 million adults who were uninsured in 2020 would move out of the coverage gap by 2021 and instead have access to Medicaid coverage.”Democratic presidential candidate Joe Biden delivers remarks after meeting with Pennsylvania families who have benefited from the Affordable Care Act on June 25, 2020 in Lancaster, Pennsylvania. (Photo: JIM WATSON / AFP)The cost issueMedicaid is a costly program, accounting for 16% of total national health expenditures in 2018 at $597.4 billion.“There have been some consistent arguments that opponents have made through the years,” Cross-Call said. “They’ve been worrying about uncertainty about what it would cost the state to do it because for the first few years, the federal government paid the entire cost of the expansion. Now they’re paying 90%, so the state has to pick up 10% of the cost, and that’s the way it’s going to be every year going forward.”The cost of Medicaid for both the federal and state governments has been a controversial topic over the years. In a paper for Mercatus Center, researchers Brian Blase and Aaron Yelowitz found that some states were improperly enrolling people in their Medicaid programs.“It’s hard for me to speculate on motives,” Yelowitz, a professor of economics at the University of Kentucky, told Yahoo Finance. “What we can say for sure is that both from a view at 10,000 feet or at the ground level, there appear to be many people who are enrolled in Medicaid — pre-pandemic is what we were studying — who have incomes that make them ineligible for the program.”Jenny Beth Martin, Rep. Tom Price, Rep. Jeff Duncan, Rep. Steve Pearce, Rep. Steve King, Rep. Louie Gohmert, Rep. Michele Bauchmann, and Ken Hoagland of Repeal It Now.org during a news conference outside the U.S. Capitol on efforts to repeal the health care law. (Photo by Scott J. Ferrell/Congressional Quarterly/Getty Images)The research found that adults mainly between the ages of 19 to 64 weren’t having their incomes properly verified.“Things like how quickly we verify your income and when your income goes up, which in good times people get pay raises and find jobs and so forth,” Yelowitz said. “Then basically, you’re supposed to be removed from the program within a certain period of time and that doesn’t seem to be happening as much as it should.”Another “structural weakness” that Yelowitz encountered in his research that some people were stating that their family size was larger than it actually was in order to qualify for Medicaid.“You might wonder: Is this a big deal or a small deal?” Yelowitz said. “You’d imagine if you had 50 different states determining eligibility for literally the same person with the same ‘rules,’ you might come up with different outcomes, but it wouldn’t be too much different if you took a group of 100 people. But what you do see if in reality that the audit reports really do say a fair number of people don’t seem to be eligible for the program at all.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Obamacare 'glitch' magnified as Americans scramble for health care amid coronavirus pandemicMillions of American workers lost health insurance as coronavirus pandemic worsenedAs extra benefits expire, some unemployed Americans are waiting for their first checkRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}