{"article": [{"url": "https://finance.yahoo.com/news/the-case-for-higher-wages-during-coronavirus-recession-182411387.html", "published": 1593005540.0, "headline": "The case for higher wages during coronavirus recession", "body": "Raising the minimum wage during the coronavirus pandemic is smart policy, according to the Economic Policy Institute.Corporate America is getting slammed by the coronavirus recession. More than 45 million people were cut from their employers’ payrolls over the past three months. Business groups have turned their focus to planned minimum wage increases, pressuring city and state officials to postpone them.California Gov. Gavin Newsom carries meals made at the Queen Sheba Ethiopian Cuisine restaurant, to a waiting delivery vehicle in Sacramento, Calif., Friday, June 19, 2020. Newsom visited the restaurant that is participating in the Great Plates Delivered program that provides meals to older adults who are at-risk to COVID-19. (AP Photo/Rich Pedroncelli, Pool)California’s Chamber of Commerce has asked Governor Gavin Newsom to roll back the planned $1 minimum wage hike planned to take effect in January 2021. The current minimum wage is $12 per hour for businesses with fewer than 26 employees, and $13 for those with more.Barring an intervention by officials, the minimum wage in several states is set to increase by $1 or less on July 1 – including Illinois, which will raise its minimum wage from $9.25 to $10, Nevada from $8.25 to $9, and Oregon from $11.25 to $12.While state officials in California, Massachusetts, Illinois and Michigan are resisting corporate pressure, Virginia’s General Assembly did vote in April to postpone a planned minimum wage hike to $9.50 from $7.25 by four months from January to May 2021.But according to EPI, the coronavirus recession has not changed the case for raising the minimum wage, rather it has highlighted its importance.“If anything, current conditions make it even more important for governments to strengthen pay standards, especially those that help low-income households’” wrote EPI’s Senior Economic Analyst David Cooper. “From a general macroeconomic perspective, raising the minimum wage in a period of depressed consumer demand is smart policy.”Raising wages for low-wage workers, the portion of the workforce that will spend a larger share of their income, boosts overall consumer demand. According to EPI research, business owners, corporate shareholders, and higher-income earners are more likely to prioritize saving a portion of a bump in pay.Story continuesA couple walk past a store with sale signs displayed at Great Lakes Mall, Wednesday, June 10, 2020, in Mentor, Ohio. Sales for retailers has plunged since the coronavirus pandemic. (AP Photo/Tony Dejak)The biggest challenge businesses are facing amid the coronavirus recession is a lack of demand, rather than excessive labor costs, says Cooper. Raising the minimum wage would help solve the demand problem more effectively than other recession response measures.“Business-oriented relief measures all can help firms weather a downturn, but they’re not going to drive additional spending in the same way that a minimum wage hike does,” wrote Cooper.The most effective policy response would be to allow minimum wage increases to continue as planned in order to boost consumer demand, while also offering small businesses further support such as tax deferrals, loans, and rent subsidies that could help them survive the coronavirus pandemic, according to EPI.More from Sibile:Master P on Aunt Jemima, Uncle Ben’s: ‘Those are not real people’How JPMorgan Chase is making banking ‘cool’ for black teenagersKareem Abdul-Jabbar on how Bruce Lee beat the system, fought racismKareem Abdul-Jabbar on George Floyd protests: Black Americans have been playing catch-up economically since the Civil WarKareem Abdul-Jabbar: ‘The NFL got on the right side of history’Find live stock market quotes and the latest business and finance news"}]}