{"article": [{"url": "https://finance.yahoo.com/news/27-of-parents-feel-unsupported-by-their-employers-this-backtoschool-season-survey-145728455.html", "published": 1598522720.0, "headline": "27% of parents feel unsupported by their employers this back-to-school season: Survey", "body": "The COVID-19 pandemic has turned back-to-school season upside down, and parents are looking to their employers for a helping hand as they navigate the complexities of the new school year. A recent survey from Monster Worldwide shows that 27% of parents feel unsupported by their employers this back-to-school season.Monster career expert Vicki Salemi tells Yahoo Finance that 75% of surveyed parents believe that work-schedule flexibility is one way that their employers could help this upcoming school year.“[Flexibility] could be working from home versus in the office, changing around their work hours, things like that,” she said.Sixty-four percent of parents polled feel stress and anxiety about sending their child back to school this year. Of those, 76% agree that the main reason they feel this way is their child having a higher chance of being exposed to the virus in a school environment, according to Salemi.Another recent Monster poll found that for many parents being able to work during the COVID-19 pandemic has been a struggle in itself. Sixty percent of those polled do not currently have a job. Salemi tells Yahoo Finance that 23% of those who are employed are taking on additional responsibilities at work because of staffing decreases within their company.From left to right back, teachers Amy Husk, Noemí Sánchez-Ortíz and Michelle Lovejoy welcome students back on the first day of school, Tuesday, Aug. 25, 2020, at Avon Elementary School in Avon, Colo., amid the coronavirus pandemic. (Chris Dillmann/Vail Daily via AP)Salemi tells Yahoo Finance that 85% of those who still have a job are considering searching for a new job amidst the pandemic.She says COVID-19 has forced more Americans to become more flexible when it comes to the type of jobs they are willing to consider — 89% of those unemployed are willing to consider a job outside of their current work industry.“Their motivation for this is, number one, flexibility in the work schedule and, two, a pay increase. I think that’s a good sign that people who are currently employed are thinking, ‘You know what, this is a good time for me to consider looking for a new role.”Monster conducted two separate polls for these findings. One was conducted among parent employees, on August 14, 2020, with 2,048 U.S. respondents. The other poll surveyed 2,607 U.S. employees on July 24, 2020.Story continuesReggie Wade is a writer for Yahoo Finance. Follow him on Twitter at @ReggieWade.Read more:Nike celebrates the life and legacy of Kobe Bryant with 'Mamba Week'How retailers are combating the surge in online counterfeit goodsThe global sneaker resale market could reach $30 billion by 2030Extremely rare Air Jordan sneakers are going up for auctionRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}