{"article": [{"url": "https://finance.yahoo.com/news/macys-may-not-exist-in-the-future-former-sears-exec-172130593.html", "published": 1592310560.0, "headline": "Macy's may not exist in the future: former Sears exec", "body": "A brutal year for Macy’s could mean an even more brutal future, perhaps one where it no longer exists, says retail veteran Mark Cohen.“The reason I am so damn critical of Macy’s is I ask the question, what does Macy’s represent? And what does it represent in the heart, minds and wallets of the customer? What’s their real operating strategy. The magic of Macy’s was a hollow claim, and the polaris strategy that they hatched during the pandemic, it doesn’t have much there,” Cohen, the former CEO of Sears Canada and long-term department store executive said on Yahoo Finance’s The First Trade.Cohen — now a professor at Columbia Business School —said he isn’t sure if Macy’s (M) has a place in the future of retail. “So after they closed hundreds of stores and refocused their efforts, what exactly does it take to the marketplace? I don’t have a good answer for that,” Cohen added.A Macy’s spokeswoman didn’t return Yahoo Finance’s request for comment on Cohen’s statements.Cohen’s comments are not completely out of left field, coming as Macy’s stock has crashed 52% year-to-date as stores have closed amid the COVID-19 pandemic. Macy’s was struggling mightily ahead of the health crisis despite an effort to modernize key departments and slash costs via vast store closures. Sources have suggested to Yahoo Finance that Macy’s latest overhaul, where it would close 125 stores and layoff thousands — put in place in February by CEO Jeff Gennette —has led to execution missteps across the organization.But ultimately the COVID-19 outbreak has thrust Macy’s into a fresh state of tumult.Macy’s first quarter sales plunged by about $2.5 billion versus a year ago. The company notched a $969 operating loss compared to a $203 million profit last year. New Macy’s CFO Felicia Williams told investors at a conference earlier this month sales may not normalize until 2021 or even 2022.Photo by: John Nacion/STAR MAX/IPx 2020 5/18/20 A view of Macy's Department Store during the coronavirus pandemic on May 18, 2020 in New York City. COVID-19 has spread to most countries around the world, claiming over 316,000 lives with over 4.8 million infections reported. All Macy's stores in New Hampshire reopen.To shore up its finances and avoid a trip through bankruptcy like long-time rival J.C. Penney, Macy’s said this month it has secured $4.5 billion in fresh financing. The financing will help Macy’s fund operations, buy new inventory and repay debt coming due this year and next.Story continuesKeep in mind Macy’s balance sheet was already in weak shape prior to the latest debt raise. The company ended the first quarter with a colossal $5.6 billion in debt, more than three times its cash balance.“Macy’s top-line profile remains constrained by declining brick-and-mortar sales across the bulk of its full-line stores, with increased promotions and growing digital sales pressuring gross margin. Larger picture and multi-year, discretionary dollars continue to shift toward convenience (Amazon) and Value (off-price), with lower visibility in the U.S. wholesale environment,” JPMorgan retail analyst Matthew Boss wrote in a recent note to clients. Boss has a Sell rating on Macy’s stock — he removed his price target (a rare move for a sell-side analyst) on April 8.Out of the 16 sell-side analysts that cover Macy’s, six rate the stock a Sell, nine see it as a Hold and one rates it a Buy.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Coca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}