{"article": [{"url": "https://finance.yahoo.com/news/higher-ed-is-getting-hit-from-all-sides-right-now-colleges-reel-from-new-immigration-announcement-141635636.html", "published": 1594200260.0, "headline": "‘Higher ed is getting hit from all sides right now’: Colleges reel from new immigration announcement", "body": "When Nay, a senior at University of Illinois at Chicago, came to the U.S. from Bogor, Indonesia, in 2017, she thought she’d get the most out of her university experience — working, studying, and experiencing life in America.Even with the coronavirus outbreak, she remained optimistic. But on Monday, new visa restrictions announced by the federal government left her worried.“It's very disheartening and very confusing,” Nay, who didn’t want to use her last name, told Yahoo Finance.Visa guidelines for international students announced by the Trump administration have thrown the entire higher education industry — from students to university deans — into a tailspin. For colleges already scrambling to figure out how to safely open their campuses this fall amid a pandemic, the industry now worries about its future.“I mean, I have to be honest, this one caught me much more by surprise,” Greg Siskind, an immigration lawyer based in Memphis, told Yahoo Finance. Unlike the travel bans, “we didn’t see this coming,” he said.The University of Illinois Urbana-Champaign campus on Friday, Jan. 31, 2020. (PHOTO: E. Jason Wambsgans/Chicago Tribune/Tribune News Service via Getty Images)On July 6, U.S. Immigration and Customs Enforcement (ICE) announced it was making changes to how it treated international students with F-1 and M-1 visas. If a student is taking an entirely online course in the fall 2020 semester, they cannot remain in the U.S., unless they transfer to a school with in-person instruction “to remain in lawful status.”If they fail to do so, “they may face immigration consequences including, but not limited to, the initiation of removal proceedings,” according to ICE.But if the school is offering a hybrid model — both in-person and online education, like Columbia and Yale — they’ll be allowed to take more than one class online and stay in the U.S. But the school needs to certify their status to the government.To be clear, most international students will likely be able to continue their studies — as long as their school is not going completely remote. (Eight percent of U.S. colleges are planning for an online-only semester, according to the Chronicle of Higher Education.) But the announcement threw some for a loop: Nay said she’s concerned and is poring over the ICE website, looking for more information.Story continues“We're all very scared just because some of us have things going on in this country that would not be able to carry back home — like work, I would for sure lose that job if I had to go back home,” she said.There’s also a 12-hour time difference between Indonesia and the U.S. that could create a struggle with afternoon classes. Nay said she’s also worried about the COVID-19 outbreak in Indonesia.A Harvard Law School student on campus on May 28, 2020. (PHOTO: Craig F. Walker/The Boston Globe via Getty Images)‘Hit ‘em while they’re down’For the higher education industry, the financial implications of this move are likely to be severe, experts warned.“Look, higher ed is getting hit from all sides right now,” Jeff Brown, dean of the Gies College at the University of Illinois, told Yahoo Finance’s “On The Move.” “We’re coming off several decades of decline in public support for higher education, and now we have an economic recession, which is affecting donors’ ability and willingness … To be honest, it’s just not helpful — it’s like, let’s hit ‘em while they’re down.”He added: “It’s not a good thing for higher ed [and] more importantly, it’s not a good thing for the long-term health of the U.S. economy.” The University of Illinois plans a hybrid approach of both in-person and online classes for the fall.‘It doesn’t make a lot of sense’Research from New American Economy shows that at last count in 2014, 5% of the postsecondary student population was comprised of students in the U.S. on temporary visas.Estimates from the U.S. Department of Commerce shows that international students have contributed $45 billion to the U.S. economy during the 2017/2018 academic year — and is ranked fifth among service exports, supporting 455,000 U.S. jobs.F-1 students — and M-1 students — are considered nonimmigrant; they have applied and received a temporary visa from the U.S. government to pursue higher education in the U.S.“It doesn't make a lot of sense,” Brendan Cantwell, associate professor at Michigan State University, who studies politics in higher education, told Yahoo Finance. “It's almost like this rule was intentionally written to create uncertainty and fear.”Aside from creating confusion among students, it also creates “huge administrative burden … on colleges and universities, because they're going to have to verify for each student,” Cantwell said. “They're going to have to verify for each student that they're meeting its requirement… they’re going to have to do student by student program by program.”“It sounds like it is not at all flexible,” Cantwell added.For instance, if a campus were to start off offering a hybrid model and then later on, switch to entirely remote if the COVID situation worsens, the student may be forced to go home mid-semester.“Anybody who is in that situation where ICE comes down on them — I would go to a lawyer,” Siskind said.More broadly, the move also \"raises a question about the humane treatment of people,” Cantwell said. “And there's also a simple logistic question, right?... It may not be possible for students to get flights.”Overall, “I just don't see how ICE has the knowledge or capability to audit it effectively,” he said. “The order shows a sort ignorance about the way colleges and universities work.\"A student at Bunker Hill Community College poses for a portrait while on campus in Boston on June 11, 2020. The repercussions of the pandemic have reverberated deeply at community colleges, which serve primarily part-time students who juggle families and jobs, and even in normal times struggle with basic needs like food, housing, child care, and transportation. (PHOTO: Erin Clark/The Boston Globe via Getty Images)American students could be affectedThe potential shortfall in tuition revenue from international students could also hurt domestic students.When paired with the fact that international student enrollments at U.S. universities has been declining, it’s evident why college leaders like Brown are worried — so much so that the school took on an insurance policy that hedged against a drop in Chinese students.American colleges “have come to rely on international students, who pay a lot more in tuition than domestic students, [and]… a lot of those dollars go directly to support scholarships for U.S. residents,” Brown explained. “If that dries up, that’s less money we have to support our own in-state students from a scholarship standpoint.”While some students opt to stay in the U.S. to work after graduation — using optional practical training (OPT), another aspect of immigration that’s currently under fire — others return home. H1-B visas, another type of visa used by graduates who seek to immigrate to the U.S., are also facing tighter restrictions by the Trump administration.Experts and business leaders have also slammed that policy, warning that restrictions may hurt long-term U.S. economic growth.Potential loss of competitivenessThe move could also hurt the brand value of the U.S. higher education overall. For instance, international students may look to Canada or Australia or even the UK — despite Brexit challenges — to pursue higher education.A graduating student from Columbia University. (PHOTO: REUTERS/Andrew Kelly)Nay, the college student from Chicago, said if she were applying to colleges now, she’d consider going to Australia or elsewhere — not the U.S. “Obviously, I want to study in a place where we feel protected and where we feel valued,” she said. “I just feel very unprotected and very devalued right now as a student, as a human being.”Students who were preparing to come to the U.S. for the first time feel disappointed.A UK student, who wanted to remain anonymous as her visa is still being processed, said: “To say I was devastated was a bit of an under statement...This had a sizable impact on my motivation to study and my general well-being.”‘We will sue’In the meantime, state attorneys general are observing the events closely.“We’ll watch what the Trump Administration does, not what it says. As the pandemic ensues, it’s particularly disappointing to hear the administration would risk education possibilities for students who worked to earn the chance to study here,” California Attorney General Xavier Becerra told Yahoo Finance. “Keep in mind: there’s no way to know yet what fall will look like as we confront this public health crisis of historic proportions — across schools and states nationwide.”Cantwell raised the possibility that the administration may walk back the policy. “We have seen this pattern over and over again with the Trump administration and immigration policy where they sort of float a draconian idea and then implement a slightly less restrictive idea,” he said.But across the country, another attorneys general has stated their intention to sue the administration over the move.“Not on my watch,” Massachusetts Attorney General Maura Healey tweeted on Tuesday night. “This is just another cruel (& illegal) attempt by the Trump Admin & ICE to stir up uncertainty & punish immigrants. Our state is home to thousands of international students who shouldn’t fear deportation or health risks in order to get an education.”She added: “We will sue.”Harvard and the Massachusetts Institute of Technology filed a lawsuit on Wednesday morning asking. a federal court to temporarily block the Trump administration’s rule barring international students from living in the country while taking online courses.—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:'We've really had to tighten our belt': Cornell pushes ahead with reopening planSchools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}