{"article": [{"url": "https://finance.yahoo.com/news/jump-into-stock-market-expecting-rise-a-fools-errand-billionaire-investor-david-rubenstein-115036959.html", "published": 1594882700.0, "headline": "Jump into stock market expecting rise 'a fool's errand': Billionaire investor David Rubenstein", "body": "The major stock indexes continued their rise on Wednesday, buoyed by a key milestone in the development of a coronavirus vaccine despite an ongoing spike in cases across most U.S. states.But the good days for the stock market won’t last, says David Rubenstein, a billionaire investor and co-founder of private equity giant Carlyle Group. He warned against bullish near-term market expectations, citing a disconnect between rising equity prices and a sluggish economy.“It's a fool's errand to go into the market now thinking that it's a bottom and you're going to go up from here,” Rubenstein told Yahoo Finance on Tuesday. “I think there's going to be a lot of ups and downs.”“The stock market is a forward indicator,” he said. “It's indicating maybe a year from now that some of these numbers will be justified. But right now, I do think that there is going to be a lot of gyrations between now and a year from now.”Rubenstein, who interviews top CEOs on Bloomberg’s “Leadership Live,” says he’s concerned about the drag on the market from stagnant economic performance and widespread unemployment.“The economy is one where it's lower growth than we had before. It is coming out of a recession,” he says. “It is one where we have, depending on how you measure, 20 to 30 million people unemployed.”“In that kind of situation, you shouldn't expect the stock market to be running up to these highs,” Rubenstein says.Since the S&P 500 index (^GSPC) reached a low point on March 23, the index has risen about 40%, as of market close on Wednesday. Over that same period, the Dow Jones Industrial Average (^DJI) is up 40% and the NASDAQ (^IXIC) more than 53%.The indexes jumped on Wednesday on news that a vaccine made by pharmaceutical company Moderna (MRNA) had produced an immune response against the coronavirus in its first human trial. The encouraging development came amid a rise in coronavirus cases across most of the United States that included a single-day record number of deaths in Florida on Tuesday.Story continuesAs cases have spiked in recent weeks, major states like Texas and California have halted or reversed efforts to reopen their economies.David Rubenstein, Co-Founder & Co-Executive Chairman, The Carlyle Group, speaks onstage during the 2019 Concordia Annual Summit on September 24, 2019 in New York City. (Photo by Riccardo Savi/Getty Images for Concordia Summit)Rubenstein made the remarks in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Before he rose to prominence in finance, Rubenstein was an adviser to President Jimmy Carter at just 27 years old. In 1987, he co-founded a $5 million firm called Carlyle Group that now manages more than $200 billion in assets and runs offices on six continents.He has an estimated net worth of $3.4 billion, according to Forbes.A return to pre-recession economic performance won’t happen anytime soon, Rubenstein warned.“We are not likely to be back to where we were before this recession hit a few months ago,” he says. “Probably for a few years.”“I say we're coming out of the recession now because we're beginning to see economic growth from the low points of April,” he says. “But we're still below where we were before the recession hit a few months ago.”Read more:CEOs shouldn’t ‘whine’ when ‘employees are being devastated’ by coronavirus: Scooter BraunBusiness leaders fear 'flaming on social media' if they criticize Trump: Fast Company Editor-in-ChiefMichael Dell: ‘Not enough’ progress on diversity in the tech industry‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}