{"article": [{"url": "https://finance.yahoo.com/news/joe-bidens-tax-policy-puts-these-16-consumer-company-stocks-at-risk-goldman-sachs-170711803.html", "published": 1597320920.0, "headline": "Joe Biden's tax policy puts these 16 consumer company stocks at risk: Goldman Sachs", "body": "The last thing consumer companies that have been beaten up by the one-two punch of the COVID-19 pandemic and mighty Amazon want to see is a president Joe Biden, suggests Goldman Sachs.Goldman analyst Kate McShane writes in a new note Thursday that U.S. consumer companies would likely see a roughly 6% average decline in net income due to potential changes in tax policy under Biden. The former vice president has put forth reversing half of President Trump’s signature tax cuts, lifting the statutory rate to 28% from 21%.McShane stress tested her model and uncovered 16 consumer companies at risk from a Biden tax hike.“In order to assess the impact this potential change could have on our U.S. consumer coverage, we raise each company’s effective tax rate by 85% of the proposed rate increase, making the assumption that ~85% of corporate tax receipts are at the federal level (based on our assessment of individual company taxes), with the remainder relating to state taxes (which we assume would remain unchanged). In this regard, The Container Store, Grocery Outlet Holding, Jack in the Box, Big Lots, Boston Beer, Albertston’s Companies, Sprouts Farmers Market, Wingstop, BJ’s Wholesale Club, Ollie’s Bargain Outlet Holdings, Seaworld, Dick’s Sporting Goods, Nordstrom, Ross Stores, Kohl’s, and Advance Auto Parts.”The analyst notes her consumer coverage benefited greatly from Trump’s signature tax cuts.Democratic presidential candidate former Vice President Joe Biden pauses during a virtual grassroots fundraiser at the Hotel DuPont in Wilmington, Del., Wednesday, Aug. 12, 2020. (AP Photo/Carolyn Kaster)“While we acknowledge that YoY change in earnings was likely attributed to more than just a reduction in the tax rate (i.e. company-specific idiosyncratic factors such as growth, execution etc.) the magnitude of the change in the tax rate was a significant driver of earnings expansion nonetheless. With that parameter in mind, we believe the greater the decline in tax rate a company witnessed, the more risk it faces if tax rates move higher,” McShane said.Despite the threat of higher taxes from Biden, investors have ignored the possibility. McShane’s work shows resilient consumer stocks as seen through the options market.Story continues“We also find investors have not sufficiently priced-in a higher increase in volatility for names expected to be most impacted, should there be higher corporate taxes. As we get closer to the elections, we expect option prices on these names to increasingly reflect higher potential volatility,” McShane warns.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}