{"article": [{"url": "https://finance.yahoo.com/news/alliance-big-tech-in-international-student-battle-an-unusual-show-of-support-202023161.html", "published": 1594999700.0, "headline": "Why international students may have Big Tech to thank for the US's visa reversal", "body": "Sometimes, it helps to have friends in high places.A coalition of powerful U.S. technology companies and trade organizations threw their support behind a legal challenge — launched by Harvard University and the Massachusetts Institute of Technology — to block the federal government from banning international students from attending online only classes on U.S. soil in the midst of the coronavirus outbreak. And Big Tech’s involvement may have been a key factor behind the administration’s last minute about-face on Tuesday.Revocation of the rule means that the U.S. Department of State may again issue visas to international students enrolled in U.S. schools for the fall semester. In addition, U.S. Customs and Border Protection no longer has authority to deny those students entry to, or continued residence in, the country.Yet the Trump administration’s aborted effort was noteworthy for the big guns that joined forces to block the move. A coalition of 19 Big Tech and trade organizations filed an amicus brief, or “friend of the court” filling, at an early stage in litigation.Signatories included heavyweights like Facebook (FB), Google (GOOG) (GOOGL), Microsoft (MSFT), Paypal (PYPL), Twitter (TWTR) and Spotify (SPOT), and the U.S. Chamber of Commerce, Internet Association, and BSA Software Alliance, among others.The flip rendered the issue moot for Harvard, MIT and several state attorneys general fighting the move since it was unveiled on July 6. It also underscored the power wielded by tech companies, who have lots of money and political influence at their disposal.Indeed, Steven Lehotsky, chief litigation counsel for the U.S. Chamber of Commerce, told Yahoo Finance that the number of concerned parties backing Harvard and MIT was significant — as was the fact that they did so at the district court level. Typically, parties file supporting briefs at the appellate and Supreme Court levels.Boston, Massachusetts, USA - September 5, 2015: Picture of the Harvard Widener Library on Harvard Campus in Cambridge, one of the most famous university's libraries.According to Institute of International Education (IIE), approximately 1.1 million students from abroad attended school in the U.S. in 2019, representing 5.5% of students enrolled in U.S. higher education institutions. According to the Bureau of Economic Analysis (BEA), the group in 2018 contributed $44.7 billion to the U.S. economy.Story continuesIn their brief, big tech companies — which employ foreign citizens in large numbers — cited those economic realities behind why they were mobilizing on the students’ behalf. International students are their current and future customers and employees who’ll become responsible for purchasing decisions of companies around the world, the companies argued.Horacia Gutierrez, Head of Global Affairs and Chief Legal Officer at Spotify Tweet July 13, 2020‘Unprecedented’ powerLisa Gilbert, executive vice president for the consumer organization Public Citizen, which tracks lobbying spending, described the level of power and influence wielded by the group as “enormous” — especially given the public alliance on the matter between the Chamber of Commerce and Big Tech.In some ways, the Chamber represents the old guard corporate power broker for historically powerful industries such as auto manufacturers and bankers, she said.“The new guard’s money, the tech industry, which has become some of the biggest power players, are spending as much as...those other types of players in the past,” Gilbert told Yahoo Finance.“Pile that all together with the Chamber of Commerce, and I think we're looking at a sort of unprecedented amount of power and volume to any request they make,” Gilbert said. Their position clearly proved to be very hard for the administration to ignore, she added.It remains to be seen whether the administration’s loss foreshadows the fate of major data privacy and content battles brewing between Big Tech and an administration that seldom shies away from settling matters in court, Gilbert said.Scott Galloway, an author and marketing professor at NYU Stern School of Business, told the Washington Post in April that Big Tech “can do what very few companies can do, which is play offense in the middle of a pandemic.”However, Gilbert pointed out that tech companies have been bipartisan in lavishing money on both major parties. According to The Center for Responsible Politics, 2019 lobbying expenditures for the companies that signed the brief totaled $38.7 million — with Facebook, Google and Microsoft responsible for the lion’s share.“These tech companies have not been playing to one side of the aisle or the other,” Gilbert added.More than 1 million students impactedThe case’s outcome had far reaching implications for more than 1 million international students in the U.S., and for the revenues of academic institutions. New York City is home to the country’s largest group of international students with more than 100,000, fueling New York State as the second most popular state destination for international students.In a call with members of the press Tuesday, New York Attorney General Letitia James said the visa changes would have required colleges and universities to reconfigure course offerings in a matter of days, or lose a significant population of their student base. That would have jeopardized millions of dollars in state revenue.Harvard president Larry Bacow hailed the reversal this week, but suggested the government could try and issue a new directive.Nevertheless, “our legal arguments remain strong and the Court has retained jurisdiction, which would allow us to seek judicial relief immediately to protect our international students should the government again act unlawfully,” Bacow wrote in an online statement.In a separate move, Canada — which has positioned itself as an alternate educational destination to the U.S., announced new requirements for international students this week, mandating that they submit to a 14-day quarantine and pass a biometric examination.In an email to Yahoo Finance, a spokesperson for Canada’s department for Immigration, Refugees and Citizenship said students holding a valid study permit, or approved for a study permit on or before March 18, 2020, are exempt from the country’s travel restrictions. However, prospective students who have not yet been fully approved are not guaranteed entry.Alexis Keenan is a legal reporter for Yahoo Finance. Follow on Twitter @alexiskweed.[Click the following links for more of Yahoo Finance’s coronavirus coverage: Personal finance tips, news, policy, graphics & more from Yahoo Finance]Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news."}]}