{"article": [{"url": "https://finance.yahoo.com/news/new-york-fed-john-williams-not-time-to-think-rate-hikes-191436423.html", "published": 1594909340.0, "headline": "EXCLUSIVE: NY Fed's Williams: 'Not the time to think' about rate hikes", "body": "New York Fed President John Williams said Thursday that the Federal Reserve is far from raising interest rates, adding that central bank policymakers have time to craft any forward guidance on future policy.“This is not the time to think about liftoff or normalization,” Williams told Yahoo Finance in an exclusive interview.Minutes from the Fed’s most recent policy-setting meeting on June 9 and 10 noted that Fed officials have been debating whether or not to offer forward guidance on the path of interest rates, including one proposal for a stated commitment to keeping rates low until inflation reaches the Fed’s existing target of 2%.In the June 10 meeting, economic projections released by the Federal Open Market Committee pointed to the median expectation that rates will likely remain near-zero through 2022. Williams said he feels that the public is responding well to the Fed’s existing communication which gives the committee more time to brainstorm how it will tie future rate moves to economic conditions.“We do have some time to think about how we should evolve that guidance as we go forward,” Williams said.The committee has also been debating the usefulness of a monetary policy tool known as yield curve control, in which the central bank would commit to purchasing U.S. Treasuries of a targeted maturity until their yields fall below stated levels.Williams had lukewarm enthusiasm for the idea, floating its use as a “potential tool” but said he would only want to rely on it if the Fed saw that existing communications were not “being as effective as we would like.”[Full Transcript: New York Fed President John Williams speaks with Yahoo Finance]‘We’ll get there over the next couple years’Economic data released Thursday morning revealed a mixed view on the recovery. Retail sales numbers showed the optimistic consumer driving a 7.5% spike in June, but Labor Department data showed more than 17 million Americans returning to unemployment insurance for the week ended July 11.Story continuesWilliams said his baseline expectation is still for the economy to see a “continued period of economic recovery.” But he added that the economy remains in a “very deep hole” with the unemployment rate still at 11.1%.“It’s a situation that changes, is in flux all the time,” Williams told Yahoo Finance. “But I'm confident that we'll get there over the next couple years and get this economy back full circle.”With economic activity appearing to bounce back as parts of the economy reopen, the Fed is hoping that its near-zero rates will support the recovery. The Fed, as the banking industry’s bank, has also stood up 11 liquidity facilities to backstop markets ranging from U.S. dollars to municipal debt.New York Federal Reserve President John Williams on February 26, 2015 in New York City. (Photo by Rob Kim/Getty Images)Corporate bond purchasesThe New York Fed in particular has been tasked with running the Fed’s Primary and Secondary Market Corporate Credit Facilities, which would allow the central bank to serve as a counterparty and directly take on investment-grade (and some high-yield) corporate debt and some bond ETFs.Critics have raised questions over why the Fed is taking on corporate bonds in large, liquid companies like Apple or AT&T. But Williams says providing the liquidity is necessary to support confidence in the financing markets that support large U.S. employers.“We're basically in there - not picking winners and losers at all - buying broadly across the market so that markets continue to work,” Williams said.Although the Fed has the capacity to take on as much as $750 billion in assets through the two facilities, the central bank was only holding just over $10 billion in ETFs and bonds as of July 8.Other New York Fed officials, such as executive vice president Daleep Singh, have mentioned in previous remarks that the Fed could reduce its purchases to “very low levels or stopping entirely” depending on market functioning.“It's a backstop,” Williams said. “If the conditions get much worse, then people know the Fed is there to help get support functioning the markets in the flow of credit.”The Federal Reserve’s next policy-setting meeting will take place July 28 and 29.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Big US banks unwilling to call the economic bottom yetBank analysts warn of 'confusing, sloppy, and shocking' earnings as COVID-19 extends gripBlack-owned small businesses continue to face harsh cash crunchOECD adds risk of COVID-19 'double-hit' in bleak economic forecastsA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}