{"article": [{"url": "https://finance.yahoo.com/news/soaring-gold-prices-could-mean-chaotic-election-day-strategist-173039740.html", "published": 1596631100.0, "headline": "Soaring gold prices could mean chaotic election day: strategist", "body": "Perhaps there is more behind the strong run up in gold prices to beyond $2,000 an ounce on Wednesday than fears of a protracted COVID-19 U.S. recession.Take the potential for a chaotic election day come November, suggests Miller Tabak’s chief market strategist Matt Maley.“That’s certainly part of the plan,” Maley told Yahoo Finance’s The First Trade when asked if gold investors are wagering on a presidential election whose results may not be known that day (see COVID-19 and mail-in voting). With no inflation in sight due to the deep recession well underway (inflation fears usually fuel gold prices as a store of value), clearly gold’s run-up is being fueled by something else.Maley adds, “I think it [gold] is more of a fear gauge, and it’s kind of interesting.”Gold prices have climbed from about $1,500 on Jan. 1 to more than $2,000 an ounce in Wednesday’s trading. The move in gold prices has fed rallies in popular commodities backed ETFs such as the SPDR Gold Shares (up 33% year to date) and the iShares Silver Trust (up 47% year-to-date).Interestingly, the broader stock market continues to rally even as gold prices hint more caution by investors may be warranted. The Nasdaq Composite eclipsed the 11,000 mark on Tuesday, powered by gains in already pricey stocks such as Microsoft and Apple. Meanwhile, investors continue to reward companies for dreadful second quarters — the latest being Michael Kors owner Capri Holdings, whose stock popped 10% Wednesday, despite announcing a 66% quarterly crash in sales.But while investors are currently dealing with a case of FOMO (fear of missing out) and buying stocks somewhat blindly, many strategists point back to the strength in gold as a red flag to the risk on rally.“Gold’s hitting new highs and Treasuries up until this morning were hitting new lows. That tells me the market is not fully convinced in this liquidity driven rally,” cautioned Comerica Asset Management chief investment officer John Lynch.Story continuesBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}