{"article": [{"url": "https://finance.yahoo.com/news/senate-democrats-student-debt-50000-151406953.html", "published": 1600338140.0, "headline": "Warren and Schumer urge student debt cancellation of up to $50,000 for all federal borrowers", "body": "Senate Democrats Chuck Schumer and Elizabeth Warren are calling on President Trump to cancel $50,000 in federal student loan debt next year.The senators unveiled a resolution that asked the president as of 2021, whether it be former Vice President Joe Biden or current President Trump, to “take executive action to broadly cancel federal student loan debt” as the country faces a pandemic and both a “historic public health and economic crises.”The senators asserted that the Secretary of Education has “broad administrative authority” granted by Congress to cancel federal student loan debt under section 432(a) of the Higher Education Act of 1965 and that the president should “take executive action to broadly cancel up to $50,000 in federal student loan debt” by using that authority.The resolution uses “existing authority under the law” to cancel debt, Warren said on a Thursday call with reporters. “Right now, our economy is in a deep hole because of this pandemic,” she added. “Student debt is just another self-inflicted wound.”U.S. Senator Elizabeth Warren (D-MA) speaks to reporters with Senate Majority Leader Chuck Schumer (D-NY) during a news conference on Democrats' demand for an extension of eviction protections in the next coronavirus disease (COVID-19) aid bill on Capitol Hill in Washington, U.S., July 22, 2020. REUTERS/Jonathan Ernst‘Democrats are ready to act in 2021’The text of the resolution noted that “even before the COVID–19 pandemic, the United States also faced a historic student loan crisis, which is currently holding back our struggling economy and restricting opportunity and prosperity for millions of American families.”With 43 million Americans holding more than $1.6 trillion in federal student loan debt, the resolution added, the pandemic is making it “nearly impossible for many Americans to ever fully repay their student loans.”Schumer noted that they are also pushing this plan for the next President of the United States because Senate Republicans and the Trump administration are against cancellation of any student loan debt.“President Trump has failed the test on student debt cancellation,” Schumer stated. “This is aimed at our new president, which is going to be Joseph Biden.... We believe that he would be very seriously entertaining our proposal.”Story continuesWarren added: “Democrats are ready to act in 2021.”(Graphic: David Foster)More than 100 organizations from civil rights groups to consumer advocacy groups have advocated debt cancellation.“We join Senators Schumer and Warren in calling on President Trump to immediately cancel up to $50,000 in federal student loan debt for 43 million borrowers,” Persis Yu, National Consumer Law Center attorney and director of NCLC’s Student Borrower Assistance Project, said in a statement.Yu added that debt cancellation is “urgently needed now as American families are struggling to stay financially afloat” and the “government cannot afford to wait any longer.”The resolution highlighted how borrowers of color are facing one of the “worst effects” of student loan debt — from Black and Latinx borrowers accruing more debt than their white peers to defaulting at higher rates — and argued that cancellation helps “close racial wealth gaps.”Various cancellation proposalsThe Trump administration previously extended the interest-free payment pause for federal student loan borrowers to December 31, 2020.The cancellation of up to $50,000 in federally-held student debt comes after House Democrats unveiled a bill proposing $30,000 in debt cancellation and then a $10,000 cancellation proposal. Senate Democrats also echoed the call for $10,000 cancellation, and Biden has also called for $10,000 in student loan debt cancellation.Democratic presidential nominee and former Vice President Joe Biden waves as he leaves the Hotel Dupont after having internal campaign meetings on September 16, 2020 in Wilmington, Delaware. (Photo by Drew Angerer/Getty Images)Some experts have argued that canceling student debt could boost the economy. Other groups have disagreed with that idea, arguing cancellation benefits mostly those who have the ability to repay.Student loan expert Mark Kantrowitz, publisher and VP of research at Savingforcollege.com, noted that $10,000 may be a more realistic goal because ultimately, “forgiveness is unlikely to happen, but if it does, the most likely amount is $10,000 because the cost is low compared to the number of borrowers.”—Aarthi is a reporter for Yahoo Finance. She can be reached at aarthi@yahoofinance.com. Follow her on Twitter @aarthiswami. Read more: Biden-Sanders task force proposes forgiving certain student debtBiden backs Democrats' student debt cancellation push amid coronavirus outbreakRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}