{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-3-2020-221514074.html", "published": 1599146180.0, "headline": "Stock market news live updates: Stocks walloped as September selling sets in; tech stocks swoon", "body": "Stocks plunged Thursday, as Wall Street gave back gains after capping off yet another record-setting session a day earlier.[Click here to read what’s moving markets heading into Friday, September 4]The Dow slid more than 800 points as of market close. The S&P 500 sank 3.5% for its worst one-day drop since mid-June, and the Nasdaq sank nearly 5% to underperform against peer major indices. Big tech shares including Amazon (AMZN), Apple (AAPL), Microsoft (MSFT) and Facebook (FB) each sold off after posting steep run-ups for the year to date.While there was no immediate trigger, the session’s moves represented a stark reversal from the bullish tone seen at the beginning of this week.The selloff “could very well be the start of the inevitable Nasdaq correction, but no one has any way of knowing that,” noted David Bahnsen, chief investment officer, California-based The Bahnsen Group. “So far, the move downward is rather hum-drum and immaterial.”He added that a pullback was “understandable” given that “The Nasdaq has advanced violently since March and many names are at absurd valuations.”Both the S&P 500 and Nasdaq ended the regular session Wednesday at their highest-ever closing levels. The broad rally lifted stocks and sectors that had been underperforming so far during the pandemic, with the utilities, materials and real estate sectors leading advances in the S&P 500 on the day. The Dow spiked above 29,000 for the first time since February and came within 500 points of its all-time record level, before sharply reversing these gains on Thursday.The jump earlier this week came as investors continued to bet on a protracted era of accommodation from the Federal Reserve and other global central banks as policymakers work to offer ongoing support the virus-stricken economy. Hopes that a coronavirus vaccine will be available in the near-term – and thereby allow more businesses to reopen and consumers to spend more confidently – have also supported equities. Media outlets including Bloomberg reported Wednesday that the U.S. Centers for Disease Control and Prevention has told states to prepare for a Covid-19 vaccine that would be ready for distribution by the beginning of November.Story continuesStill, investors received some new disappointing data on some pockets of the economy, punctuating what had been a string of better-than-expected reports on the manufacturing sector, housing market and services economy in recent days. ADP’s closely watched monthly private payrolls report showed just 428,000 new jobs were added back in August, or fewer than half the 1 million that had been expected. The report, however, has historically and especially during the pandemic period been an imprecise gauge of the Labor Department’s “official” monthly jobs reports, and investors largely shrugged off the estimates-missing print Wednesday morning.—4:03 p.m. ET: Stocks post worst day since June as Dow sheds 808 points, S&P 500 drops 3.5%, and Nasdaq drops 5%Here were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -125.81 (-3.51%) to 3,455.03Dow (^DJI): -807.77 (-2.78%) to 28,292.73Nasdaq (^IXIC): -598.34 (-4.96%) to 11,458.10Crude (CL=F): -$0.18 (-0.43%) to $41.33 a barrelGold (GC=F): -$6.20 (-0.32%) to $1,938.50 per ounce10-year Treasury (^TNX): -2.9 bps to yield 0.6220%—3:06 p.m. ET: Selloff accelerates, Dow sheds more than 900 pointsStocks added to losses with less than an hour left of the trading day. Tech stocks continued to lead the decline, sending the Nasdaq down 5.5%, or more than 600 points. The S&P 500 was lower by 4%, and the Dow fell more than 900 points, or 3.1%.The information technology, consumer discretionary and communication services sectors – all heavily steeped in big tech shares – slid on the day, with each falling at least 4%.—11:18 a.m. ET: Stocks swoon as tech sell-off leads market lowerThe three major indices sharply dropped on Thursday, with the Dow down 680 points, or 2.34%, as of 11:18 a.m. ET. The S&P 500 fell 110.86 points, or 3.1%, and the Nasdaq sank 519.28 points, or 4.3%.Big tech names including Facebook, Amazon, Alphabet, Apple and Netflix all sank, with these heavy-weight stocks dragging on the major indices. All 30 of the Dow components were lower, led by Apple with a 7% slump. Salesforce shares followed closely and fell 6%.—10:01 a.m. ET: US service sector activity expands at a slower than expected pace in August: ISMThe Institute for Supply Management’s (ISM) closely watched services purchasing managers’ index (PMI) ticked down to 56.9 in August from 58.1, according to a statement Thursday morning. This missed expectations by a hair, with consensus economists having expected the print to come in at 57.0.This marked the third straight month that the service sector index came in above the neutral level of 50.0, indicating expansion. The services PMI contracted for two consecutive months prior to that, at the height of the pandemic and stay-in-place orders in the US.\"The past relationship between the Services PM and the overall economy indicates that the Services PM for August (56.9%) corresponds to a 2.8-percent increase in real gross domestic product (GDP) on an annualized basis,” said Anthony Nieves, chair of the ISM Services Business Survey Committee.—9:32 a.m. ET: Stocks open slightly lower after record rally a day earlierHere were the main moves in markets as of 9:32 a.m. ET:S&P 500 (^GSPC): 3,562.23, -18.61 points (-0.52%)Dow (^DJI): 29,062.81, -37.69 points (-0.13%)Nasdaq (^IXIC): 11,877.35, -179.09 points (-1.44%)Crude (CL=F): $40.55 per barrel, -$0.96 (-2.31%)Gold (GC=F): $1,945.20, +$0.50 (+0.03%)10-year Treasury (^TNX): 0.638%, -1.3 bps—8:31 a.m. ET: US trade deficit expands to $63.6 billion in July, marking the largest gap since 2008The US trade deficit yawned further than expected in July to its widest since 2008, as an increase in imports of services especially outpaced a rise in exports.The overall trade deficit was $63.6 billion in July, following a revised $53.5 billion in June that had itself been a decrease from May. In July, imports rose 10.9% month-over-month to $231.7 billion, eclipsing an 8.1% monthly gain in exports to $168.1 billion.“In rough numbers, exports of only $168 billion in July are well below the $209 billion level seen in January and February before the pandemic struck,” Chris Rupkey, chief financial economist for MUFG Union Bank, pointed out in an email Thursday. “Imports have had a bigger bounce back even if they are short of January and February levels, and that is why the trade deficit has exploded ... While consumers buy more goods from abroad, US factories are struggling to sell their products to the rest of the world.”—8:30 a.m. ET: Jobless claims fall more than expected in latest weekly report, as new counting method takes effectNew weekly unemployment insurance claims fell more than expected to 881,000 last week, versus the 950,000 consensus economists had been expecting.That sum marked just the second time during the pandemic that new weekly jobless claims came in below 1 million. Thursday’s report, however, also represented the first time the US Department of Labor (DOL) counted new and continuing jobless claims under an updated system, which had been expected to lower the level of claims reported.The change was expected to lead to fewer headline claims being reported than would have been under the previous method, and also rendered comparisons to previous weeks of headline seasonally adjusted initial and continuing unemployment filings useless. Unadjusted new claims were unaffected and remained comparable over previous weeks and months.Unadjusted new weekly jobless claims totaled 833,352 in the week ending August 29, rising by nearly 7,600 over the prior week, and diverging directionally from the decrease reported in the new seasonally adjusted claims. Seasonally adjusted jobless claims for the week ended August 22 totaled 1.011 million, under the old counting system.Continuing jobless claims, which were also counted under the new system, totaled 13.254 million, or better than the 14 million that had been expected.—7:18 a.m. ET Thursday: Stocks dip ahead of jobless claims reportHere were the main moves in markets, as of 7:18 a.m. ET:S&P 500 futures (ES=F): 3,566.75, down 12.5 points or 0.35%Dow futures (YM=F): 29,062.00, down 28 points or 0.1%Nasdaq futures (NQ=F): 12,305.00, down 106.5 points, or 0.86%Crude (CL=F): $40.70 per barrel, -$0.81 (-1.95%)Gold (GC=F): $1,936.30, -$8.40 (-0.43%)10-year Treasury (^TNX): 0.653%, +0.2 bps—6:03 p.m. ET Wednesday: Stock futures tick lower after record-setting rallyHere were the main moves in equity markets, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,576.00, down 3.25 points or 0.09%Dow futures (YM=F): 29,060.00, down 30 points or 0.1%Nasdaq futures (NQ=F): 12,405.25, down 6.25 points, or 0.05%NEW YORK, March 18, 2020 -- Traders work at the New York Stock Exchange in New York, the United States, on March 18, 2020. The New York Stock Exchange said Wednesday it will temporarily close its trading floor and move to fully electronic trading because of the COVID-19 outbreak. (Photo by Michael Nagle/Xinhua via Getty) (Xinhua/ via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}