{"article": [{"url": "https://finance.yahoo.com/news/antiracism-movement-leads-to-cops-gone-with-the-wind-being-pulled-from-platforms-190716936.html", "published": 1591971320.0, "headline": "Anti-racism movement leads to 'Cops,' 'Gone With the Wind' being pulled from platforms", "body": "The calls for racial justice and equality in America have sparked a moment of reckoning for the entertainment industry.As protests following the deaths of George Floyd and Breonna Taylor, among other Black Americans at the hands of police officers, have swept across the world, audiences are pressuring Hollywood studios and streaming giants to re-examine popular films and television shows.The following shows have been yanked from their respective networks:Gone With the Wind (HBO Max)HBO Max, AT&T’s (T) new on-demand service that launched on May 27, pulled the classic film “Gone With the Wind” on Tuesday. The 1939 film, adapted from Margaret Mitchell’s novel by the same name, is shrouded in racist depictions — both blatant and subtle. With the Civil War as the backdrop, “Gone With the Wind,” which went on to win 10 Academy Awards, perpetuates harmful stereotypes of people of color.Gone With The Wind, poster, left from left: Clark Gable, Vivien Leigh on 1950s. (Photo by LMPC via Getty Images)This decision came after movie director John Ridley penned an op-ed in the Los Angeles Times Monday requesting the removal of the film. This move is likely to be temporary, but WarnerMedia would bring it back with a “new introduction from a prominent African American studies scholar,” according to The Washington Post. In an unintended second order effect, the movie hit the top of Amazon’s best-sellers chart on Wednesday.Cops (Paramount Network)The fury around the senseless murders of Black Americans has only been rivaled by the demands to restructure or defund police forces across the country. And depictions of cops — good or bad — are being scrutinized across the board. The cop genre is a particularly popular genre, with 61.8% of prime-time dramas that aired on the four major broadcast networks focused on crime and law (21 of the 34), according to a report from civil rights advocacy nonprofit Color of Change.Last week, Paramount Network (VIAC) pulled “Cops” from the lineup, and officially canceled the show on Tuesday. Cops, which ran for 25 seasons on Fox, was resurrected on Spike TV (now known as Paramount Network) in 2013.Story continues“Cops is not on the Paramount Network and we don’t have any current or future plans for it to return,” a Paramount Network spokesperson said in a statement to Deadline.Live PD (A&E)Similarly, A&E’s popular flagship show Live PD was pulled last week and officially canceled on Wednesday, a day after “Cops’” pause became permanent.“This is a critical time in our nation’s history and we have made the decision to cease production on Live PD. Going forward, we will determine if there is a clear pathway to tell the stories of both the community and the police officers whose role it is to serve them. And with that, we will be meeting with community and civil rights leaders as well as police departments,” an A&E spokesperson told Deadline.Host Dan Abrams expressed his disagreement with the network’s decision to pull the show. “Shocked & beyond disappointed about this...To the loyal #LivePDNation please know I, we, did everything we could to fight for you, and for our continuing effort at transparency in policing. I was convinced the show would go on,” he tweeted.Others under scrutinyNow there are even calls to cancel the popular Nickelodeon cartoon series “Paw Patrol,” which portrays public service officials in a positive light. The children’s show focuses on six rescue dogs that operate under the mantra \"no job is too big, no pup is too small.” Parents are taking to social media to defend the well-meaning show.Everyone better leave my son's favorite show alone, can't cancel every show in the world that has cops because of a few bad ones.. Not every cop is racist there are good police too.. Plus it's a kids show.. #IStandWithPawPatrol #PawPatrol pic.twitter.com/GCDQOFb5Ap— Jacqueline Gonzalez (@jackie01987) June 12, 2020Beyond entertainment content, relics of white supremacy are deeply embedded in the physical foundation of America. There has been a slow unraveling of this structural racism, with more than 114 Confederate symbols removed since the 2015 Charleston massacre of nine African Americans, according to 2019 data from the Southern Poverty Law Center. Since the death of George Floyd on May 25, at least seven cities across the country have removed public Confederate statues and memorials.And top executives are under scrutiny, for institutionalizing or facilitating systemic racism in their organizations. Just this week, the editors-in-chief of Bon Appétit and Refinery29 and the CEOs of CrossFit and The Wing resigned amid accusations of racial inequity.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Allegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and moreTech CEOs decry racial injustice amid George Floyd protestsStudent housing amid coronavirus: ‘Count on getting heads in beds’‘A lot of my goals just had to disappear’: College-bound students grapple with the future amid coronavirusJack Dorsey’s $1 billion pledge sparks discussion around UBI ‘I feel lost’: America’s freelancers left without income amid coronavirus financial crisis"}]}