{"article": [{"url": "https://finance.yahoo.com/news/fed-proposes-expanding-main-street-loan-program-to-nonprofits-211935225.html", "published": 1594992140.0, "headline": "Fed expands Main Street loan program to nonprofits", "body": "The Federal Reserve has extended its emergency loan program to include U.S. nonprofits like universities and charitable organizations.On Friday, the Fed officially opened its Main Street Lending Program to nonprofit organizations, allowing them to take out loans as small as $250,000 or as large as $300 million.Broadly, the Fed would make eligible any 501(c)(3) or 501(c)(19) organization with between 10 and 15,000 employees, as long as the applicant’s 2019 revenues were less than $5 billion and had less than 40% of those revenues sourced from donations.“Nonprofits provide vital services across the country and employ millions of Americans,” Fed Chairman Jerome Powell said in a statement.Nonprofits younger than five years or with an endowment larger than $3 billion will not be eligible.The Fed unveiled a framework for nonprofit participation in the Main Street Lending Program on June 15, and asked for public comment on how to tweak the terms of the program.The updated version of the term sheets include broadly looser eligibility requirements. For example, the Fed’s original term sheet set 50 employees as the minimum and set the threshold for the ratio of donations-to-revenue at 30%.The revision also lowers the line for how liquid a nonprofit organization needs to be, and will now allow organizations with at least 60 days of cash on hand (versus the original threshold of 90 days).Main Street LoansFor almost four months, the Fed has been hard at work on standing up the Main Street Lending Program for small and medium sized businesses.The program kicked off last month for for-profit companies by opening its doors to lender registration. The Boston Fed, which is administering the program, told The Wall Street Journal Friday that 260 banks that had completed the registration process and another 174 are in process.As the Fed was designing the program, public comments sent to the central bank expressed concern that nonprofits would not be able to access the facility. American colleges and universities have been particularly pinched as students face uncertainty about being able to return to campus in the fall.Story continuesThe Fed is proposing the same terms to loans under the nonprofit facilities. Nonprofits will be able to obtain a loan large enough to cover the entirety of a quarter’s worth of revenue. The nonprofit program would involve two programs, an “extended” facility that would modify an existing loan under the facility’s terms, and a “new” facility that would originate new credit.The maximum loan size under the “extended” facility will be $300 million and the maximum loan size under the “new” facility will be $35 million.The Fed will offer to take on nearly all of the credit risk under the nonprofit facility, as it would with its business loans. The facility would only require the lender to hold onto 5% of the loan for both the extended and new facilities.Pricing is also the same, at LIBOR + 3%. Payments on the loan principal will also be deferred for the first two years of the five-year loan term.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.EXCLUSIVE: NY Fed's Williams: 'Not the time to think' about rate hikesBig US banks unwilling to call the economic bottom yetBank analysts warn of 'confusing, sloppy, and shocking' earnings as COVID-19 extends gripBlack-owned small businesses continue to face harsh cash crunchA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}