{"article": [{"url": "https://finance.yahoo.com/news/apple-fitness-service-175035267.html", "published": 1600174700.0, "headline": "Apple to launch Apple Fitness+ service for $9.99 per month", "body": "Apple (AAPL) is diving deeper in the fitness business with the debut of its new Apple Fitness+ app for the Apple Watch and iPhone. The service, available for $9.99 per month or $79.99 per year, provides users with guided exercise videos that they can follow along with as they feel the burn. The service kicks off by the end of the year.Apple’s move puts it firmly in competition with other health-focused companies including Fitbit (FIT), which is in the midst of being acquired by Google (GOOG, GOOGL). It could also be a blow to the large subset of fitness-focused iOS apps available through the App Store.Apple Fitness+ is the company's first foray into fitness services, and will be available for $9.99 when it launches later this year. (Image: Apple)Through the app, you can select the workout you want to do, the trainer you want to work with, the time you want to spend on your workout, and the music you want to listen to from your iPhone, iPad, or Apple TV. Your Apple Watch will then begin automatically tracking your workout from calories to time spent and more, and displays the data on the device you’re watching your workout on.Available exercises will include yoga, cycling, treadmill walking and running, strength training, core workouts, high intensity training, and more. Many of the workouts require just a pair of dumbbells or nothing at all.See also: Apple goes all in with Fitness+ product and Apple One bundleWhen the workout is over, you get a comprehensive summary that is displayed on the summary screen on your secondary device including calories burned and more.New workouts are added each week, so you won’t get tired of your new exercise routine.Tech newsletterFor those who are getting back into getting in shape, there’s a program that can help people get used to moving properly again.Apple announced the new Fitness+ service along side the company’s latest Apple Watches including the $399 Apple Watch Series 6 and its new mid-range Apple Watch SE for $279. New Apple Watch buyers will get access to Apple Fitness+ for free for 3 months.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.Story continuesMore from Dan:Oracle’s TikTok win gives it a chance to prove it can take on Amazon and MicrosoftHow to watch the Apple event on Sept. 15, and what to expectNetflix co-CEO on its advantage over Apple and Amazon: We have a ‘single focus’Microsoft Surface Duo review: A two-screen Android phone that could change everythingFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}