{"article": [{"url": "https://finance.yahoo.com/news/not-on-our-watch-california-ag-sues-trump-administration-over-new-visa-guidelines-231246334.html", "published": 1594318820.0, "headline": "‘Not on our watch' says California, suing Trump admin over new coronavirus student visa rules", "body": "California’s Attorney General announced plans on Thursday to sue the Trump administration over a new policy that will block international students from staying in the U.S. if their schools move classes online.In a move likely to have far-reaching consequences for colleges and universities, the Department of Homeland Security (DHS) and U.S. Immigration and Customs Enforcement (ICE) announced this week new guidelines that would remove foreign students if their universities are not holding in-person classes this fall.As the coronavirus continues to spread domestically, a number of institutions are planning to sharply curtail in-person campus activities.California Attorney General Xavier Becerra speaks about President Trump's proposal to weaken national greenhouse gas emission and fuel efficiency regulations, at a media conference in Los Angeles, California, U.S. August 2, 2018. REUTERS/Lucy NicholsonCalifornia is the home to a broad swath of America’s international students. Its legal action is the first from a state attorney general, and follows a lawsuit filed by Harvard University and the Massachusetts Institute of Technology. That move was supported by dozens of schools from Princeton to Purdue, and Massachusetts is also reportedly preparing a lawsuit.“This policy isn’t just unlawful, it’s dangerous and morally reprehensible,” California AG Xavier Becerra said in a virtual press conference. “Well, not on our watch.”The lawsuit states that the temporary final rule by DHS and ICE is “arbitrary and capricious, [and] in violation of the Administrative Procedure Act.”U.S. President Donald Trump refers to amounts of temperature change as he announces his decision that the United States will withdraw from the landmark Paris Climate Agreement, in the Rose Garden of the White House in Washington, U.S., June 1, 2017. (PHOTO: REUTERS/Kevin Lamarque)‘We'll see the Trump Administration in court’California is home to more than 184,000 international students as of January 2020, which is about 16% of the total number of international students in America.“California has more students on international visas than any other state,” stressed Becerra. “You can understand why then, it is so important that we take this action today.” This would be the 86th lawsuit he has filed against the Trump administration and its officials.“We'll see the Trump Administration in court,” Becerra added.New federal guidelines presented a difficult choice to universities across America: Either reopen schools fully with limited or no remote classes, or have their international students be deported.Story continuesThe new rule blindsided universities already reeling financially and logistically from the COVID-19 pandemic that shows no signs of letting up.On July 6, ICE announced that it was making changes to how it treated international students with F-1 and M-1 visas.Even though the coronavirus pandemic has shuttered schools, if a student is taking an entirely online course, they cannot remain in the U.S., unless they transfer to a school with in-person instruction “to remain in lawful status.” If they fail to do so, “they may face immigration consequences, including the initiation of removal proceedings,” ICE said.But if the school is offering a hybrid model of both in-person and online education, they’ll be allowed to take more than one class online. However, the school needs to certify their status to the government.Only 8% of colleges have thus far planned for a completely online fall semester — and 2.1% are “waiting to decide,” according to data compiled by the Chronicle of Higher Education.U.S. President Donald Trump at the White House in Washington, U.S., June 26, 2020. (PHOTO: REUTERS/Carlos Barria)‘Cruel, senseless, and xenophobic’The same day, almost 100 members of Congress signed a letter to the heads of ICE and DHS to oppose then move.\"We call out this policy for what it is: a cruel, senseless, and xenophobic attempt to use noncitizens as political pawns in order to financially coerce colleges and universities to reopen campuses this fall, despite what is best for public health,\" the lawmakers stated. \"This policy is dangerous to the health and well-being of numerous communities.\"According to a report by the Bipartisan Policy Center, the economic value of international students is worth roughly $20 billion per year in tuition and fees — a large source of educational revenue for institutions likely to be strapped in the wake of the COVID-19 crisis.The report noted that enrollment “is already projected to decrease by 15% percent this year, leading to an estimated $23 billion decline in revenues, as more students defer enrollment or choose to attend less-expensive institutions closer to home,” the report stated.—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:‘Higher ed is getting hit from all sides right now’: Colleges reel from new immigration announcement'We've really had to tighten our belt': Cornell pushes ahead with reopening planSchools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemiThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}