{"article": [{"url": "https://finance.yahoo.com/news/why-youre-not-hearing-about-bidens-economic-plan-144915816.html", "published": 1592992640.0, "headline": "Why you’re not hearing about Biden’s economic plan", "body": "Joe Biden has a slew of proposals for new economic programs, and the tax hikes to pay for them. But the Democratic presidential candidate doesn’t have much to say about his economic plan, even though the nation’s in a deep recession and some fresh ideas might be welcome.Yahoo Finance has asked the Biden campaign several times for an interview with a Biden economic adviser able to comment on the candidate’s plans. The campaign hasn’t responded. The New York Times wrote on June 11 that “few aspects of Joseph R. Biden’s presidential campaign are shrouded in as much secrecy as the counsel he receives on the economy.” Biden has reportedly formed an advisory committee with more than 100 economists, who are sworn to silence regarding their participation.Why so sketchy? Part of it probably involves a strategy to let voters focus on President Trump’s negative marks for handling the coronavirus pandemic and an outbreak of racial unrest, rather than Biden’s own ideas. “The Biden campaign would love to make this election a referendum on Donald Trump and not a choice between the two candidates,” Washington policy analyst Ed Mills of financial firm Raymond James says on the latest episode of the Yahoo Finance Electionomics podcast. “The more Biden talks about his policies, the more it becomes a choice between the two candidates, and that is an opening for Trump.”Biden’s whole campaign has been in stealth mode, as the coronavirus pandemic forced the cancellation of campaign rallies and the former vice president laid low at his Delaware home. Biden has been holding online events with supporters, and he has shown up for a few in-person events. While bashing Trump, however, he’s saying little about his own policies. Axios recently reported that Trump is frustrated by Biden’s low profile and is trying to develop a “smoke him out” strategy that goads Biden into speaking out more and gives Trump more opportunity to attack Biden’s remarks (or mistakes).Story continuesThe chances of tax hikes going throughBiden’s economic plan involves a variety of tax hikes more modest than those proposed in the Democratic primaries by Senators Bernie Sanders and Elizabeth Warren. But they’d still be a substantial change from the Trump status quo. Biden would raise the corporate tax rate from 21% to 28%, establish a new minimum tax on large companies, raise income and capital gains taxes on high earners, and repeal some corporate tax breaks. He’d use the additional tax revenue to finance new spending on clean energy, expanded health care, more college aid, infrastructure and other initiatives.Presumptive Democratic presidential nominee and former Vice President Joe Biden speaks at Delaware State Universitys student center in Dover, Delaware, on June 5, 2020. (Photo by JIM WATSON / AFP) (Photo by JIM WATSON/AFP via Getty Images)There are two scenarios for Biden’s economic plan. If he wins the presidency but Republicans maintain control of the Senate, he’d have difficulty getting tax and spending hikes passed and most of his ideas would remain on the shelf. If Biden wins and Democrats take over the Senate, his tax and spending plans might be more likely to pass. But it’s not a given that Congress would raise taxes with the economy still struggling to recover from the coronavirus recession.Americans aren’t necessarily opposed to the tax hikes Biden has proposed. Trump, of course, signed a major tax cut in 2017, with a large reduction in business taxes and other tax cuts for the wealthy. Lower earners got tax cuts too, but they were relatively small and the Trump tax cuts remains unpopular. “There is a sense a lot of voters have that that tax cut did not individually help them,” Mills says. “In polling data, you actually see a pretty large swath of Americans in support of reversing that.”Biden won the Democratic primary because he seemed like a moderate compared with the likes of Sanders and Warren. But Biden has been drifting toward some leftist proposals, in an effort to appease Sanders and Warren supporters who can provide an important edge in November. Biden has adopted Warren’s idea of a minimum 15% tax on companies that report a profit to shareholders, even if they use legal tax breaks to lower their federal tax payment well below that level. And he favors the Green New Deal in principle, even if he doesn’t embrace specific provisions that would heavily regulate the energy and transportation sectors. One idea Biden hasn’t adopted is a wealth tax on multimillionaires.Trump isn’t shy about distorting and belittling the views of his political opponents. He refers to the Biden campaign as “radical left Democrats” and at some point will probably attach the socialist label to Biden’s tax plans. Biden may have to answer such charges, especially in the three presidential debates scheduled for September and October. But with Trump’s poll numbers sinking amid a pandemic, a recession and a revolt over racial disparities, he’ll let Trump campaign against himself for as long as possible. Trump trails Biden in the polls, but if you start to hear Biden saying more about his tax and spending plans, it probably means Trump is mounting a comeback.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Trump is sabotaging his own reelectionElection Night in November could last for daysBiden’s age might work in his favorSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}