{"article": [{"url": "https://finance.yahoo.com/news/florida-mayor-very-concerned-about-kids-going-back-to-school-215845394.html", "published": 1594227980.0, "headline": "Florida mayor 'very concerned' about kids going back to school", "body": "Though President Trump and Education Secretary Betsy DeVos have indicated they want children to return to school come fall, others are worried about how it might contribute to the spread of the coronavirus outbreak.Despite coronavirus cases surging in Florida more than ever before, the state’s education commissioner Richard Corcoran issued an executive order on Monday that mandates public K-12 schools reopen in August for at least five days a week.People wear protective face masks during the coronavirus pandemic on April 28, 2020. (Photo by Noam Galai/Getty Images)Fort Lauderdale Mayor Dean Trantalis explained why he has some reservations about the idea of bringing students back to school.“Going to school, taking kids out of their homes and bringing them into public spaces, it is a concern,” Trantalis said on Yahoo Finance’s The Ticker (video above). “We’re very concerned that it's going to increase the level of the spread, because while the kids may not take on the symptoms, they may bring it home to their parents. So we’re very, very concerned about that.”Schools ‘may be an opportunity to spread this disease more’Trantalis said the decision to reopen schools is not made by him, but rather the school board.“It’s a different level of government,” he said. “It makes its own decisions. But we’re very concerned about bringing kids into schools when, in fact, that may be an opportunity to spread this disease more so than it has been in the past.”A counselor wearing a protective face mask plays with children as summer camps reopen amid the spread of coronavirus disease (COVID-19) in Milford, Michigan, U.S., June 23, 2020. REUTERS/Emily ElconinAlthough most children don’t exhibit symptoms of coronavirus, they can still pass it to members of their household.Dr. Brian Garibaldi, biocontainment unit medical director at Johns Hopkins University, previously told Yahoo Finance that if the virus follows the same patterns of other respiratory viruses, children will likely become “an important vector for transmission.”“We need to be mindful, not just of the children’s safety but also teachers and families who are sending children to schools who may have at-risk family members at home or themselves be at higher risk from the disease,” he said.Dr. Anthony Fauci, director of the NIAID, wears a face covering as he listens during a Senate Health, Education, Labor and Pensions Committee hearing on June 30, 2020. (Photo by Al Drago - Pool/Getty Images)During a recent congressional hearing, Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases (NIAID), stressed that when it comes to reopening schools, “it’s not one size fits all.”Story continues“I think you have to look at it at the local level, the county level, the regional level, the city level, the state level,” he said. “So we often say, ‘In America, should you or should you not be open?’ I mean, that’s almost a non-question because for such a large country, and so heterogeneous, and such a range of involvement of this virus in different parts of the country.”‘I disagree’ with the CDC guidelinesIn a recent speech, President Trump said that he would be putting pressure on governors to open the schools in the fall. He also criticized the Centers for Disease Control (CDC) for its reopening guidelines.The current guidelines encourage behaviors including staying home when necessary, hand hygiene, using a tissue to cover coughs and sneezes, wearing cloth face coverings, and more. But as a result of Trump’s tweet, the director of the CDC, Robert Redfield, said they would be issuing new guidelines next week.I disagree with @CDCgov on their very tough & expensive guidelines for opening schools. While they want them open, they are asking schools to do very impractical things. I will be meeting with them!!!— Donald J. Trump (@realDonaldTrump) July 8, 2020The key is for communities to practice proper hygiene and social distancing measures so that it lessens the risk of their children being exposed and passing it on to others once they’re in school.“We have a lot of challenges here,” Trantalis said. “We have a lot of trade-offs here and it’s difficult to try to understand some of the decisions being made by those at the county level or even the state level as we plow our way through this pandemic, keeping in mind that the most important thing we can do is personal responsibility. Maintaining masks, washing hands, staying your distance. We’re told time and again that’s the best way to prevent this from being spread. So it’s a challenge and we leave it up to the medical experts to give us direction going forward.”“I think that if we’re able to really, really be serious about these practices that the CDC has recommended — the social distancing, washing hands, and wearing the masks where appropriate — we can beat this,” he added. “We don’t have to take that step backwards because the consequences are catastrophic.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:How coronavirus ravaged a nursing home industry that was already 'in crisis'Coronavirus: Health care experts call for nationwide special enrollment periodU.S. nursing homes face 'a crisis on top of a crisis' with coronavirus and funding woesRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}