{"article": [{"url": "https://finance.yahoo.com/news/airline-stocks-keep-rising-despite-covid-19-turbulence-194424813.html", "published": 1599144740.0, "headline": "Airline stocks keep rising despite 'highly depressed' ticket sales amid pandemic", "body": "The largest U.S. airlines saw the value of their shares rise over the summer travel season even though the coronavirus pandemic continued to decimate their businesses.“While we had all hoped travel would resume by this point, demand for air travel has not returned. There is a long road to recovery ahead,” Nicholas Calio, president and CEO of Airlines For America (A4A), told Yahoo Finance.A4A, an airline industry trade group, released its latest update as the air carriers head into the Labor Day holiday weekend. Passenger volume remains dramatically low – 70% below 2019 levels. Looking ahead to the fall, A4A says ticket sales remain “highly depressed” with revenue down 86% year over year, driven largely by the evaporation of business travel.According to the International Air Transport Association (IATA), North American airlines saw a 94.5% traffic decline in July, a slight improvement from a 97% decline in June, while capacity fell 86.1%.Yet since Memorial Day, shares of Delta (DAL) are up 37%, American (AAL) up 34%, United (UAL) up 43% and Southwest (LUV) up 32% even though they are all trading well below their pre-pandemic highs.Layoffs and cutsA4A says the pandemic downturn will last several more years and passenger volume will not return to 2019 levels until 2024. Calio is calling on Congress and the Trump administration for more financial support. “The reality is that without additional federal aid, U.S. airlines will be forced to make very difficult business decisions,” he said.An agent works the counter at the Delta Air Lines terminal at the Los Angeles International Airport, Thursday, May 28, 2020, in Los Angeles. From Britain's EasyJet to American and Delta in the U.S., airlines are cutting even more jobs to cope with a crushing drop in air travel caused by the coronavirus. (AP Photo/Marcio Jose Sanchez)United Airlines on Wednesday notified more than 16,000 employees they would be laid off Oct. 1 when the first round of support from the Coronavirus Aid, Relief, and Economic Security (CARES) Act expires.In March, United along with Delta, Southwest, American and other carriers postponed layoffs in exchange for $50 billion in federal grants and loans. American warned last week that it will have to furlough 19,000 employees and Delta warned it could cut 2,000 pilots. Only Southwest Airlines has said it will be able to avoid layoffs through the end of the year.Story continuesSouthwest CEO Gary Kelly recently told his employees the airline is seeing modest improvement in booking trends, but Southwest is reducing capacity in September and October responding to unpredictable passenger demand. Kelly remains hopeful that Congress will pass the extension of Cares Act telling his staff, “That would go a long way in helping us get to the other side and avoid furloughs like you are seeing at our competitors.”President Trump supports an additional $25 billion in aid for the airlines; although the idea has bipartisan support, it remains stalled with other stimulus legislation in Congress.Testing may help airlines take offAirline stocks rose last week after Abbott Laboratories announced it received FDA Emergency Use Authorization for its BinaxNOW COVID-19 Ag Card, an easy to use 15-minute rapid test for the coronavirus. Abbott plans to ship 50 million tests a month by October.Centers are already being set up in several U.S. airports to test employees, but a recent note from Raymond James analyst Savanthi Syth indicates that rapid testing infrastructure could be expanded to accommodate passengers.“We believe scalable testing could spur domestic and international air travel by convincing governments to remove or shorten the duration of quarantine requirements and provide passengers with added level of comfort regarding health and safety,” Syth wrote.A4A’s Calio says something has to be done because the airlines are an essential industry that can lead the economy back to recovery. He warns without a pickup in demand, “We're going to be much smaller airlines than we were before.”Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.Southwest CEO: Bookings 'have recently stalled' because of coronavirus spikeDelta posts massive Q2 earnings loss'The corporate tax rate — I’m actually OK at 28%': Gary CohnJ&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}