{"article": [{"url": "https://finance.yahoo.com/news/novavax-coronavirus-vaccine-induces-immune-200500304.html", "published": 1596554000.0, "headline": "Novavax coronavirus vaccine induces immune response in small study", "body": "By Manas Mishra and Carl O'DonnellAug 4 - Novavax Inc said on Tuesday its experimental COVID-19 vaccine produced antibodies against the novel coronavirus and appears to be safe, according to initial data from a small, early-stage clinical trial.The Maryland-based biotechnology company said its vaccine candidate, NVX-CoV2373, produced higher levels of the antibodies in healthy volunteers after two doses than those found in recovered COVID-19 patients, raising hopes for its eventual success.The addition of its Matrix-M adjuvant, a substance designed to boost the body's immune response, did enhance the effect of the vaccine in the study, the company said.The Novavax vaccine is among the first of a handful of programs singled out for U.S. funding under Operation Warp Speed, the White House program to accelerate access to vaccines and treatments that can fight the virus.Effective vaccines and treatments are considered essential to halting a pandemic that has claimed more than 695,000 lives worldwide.Novavax research chief Gregory Glenn told Reuters the company will start much larger late-stage clinical trials soon and could potentially glean enough data to obtain regulatory approvals as early as December.The U.S. government in July agreed to pay Novavax $1.6 billion to help cover costs related to testing and manufacturing the vaccine, with the aim of procuring 100 million doses by January 2021.The trial, which started in late May, tested the vaccine in 106 subjects aged 18 to 59 versus a placebo. Phase I of the study looked at the vaccine's safety and ability to induce immune responses.It tested 5 microgram and 25 microgram doses of the vaccine, with and without the adjuvant.The company said the second vaccination induced greater levels of side effects such as swelling and pain at the injection site, which are not considered serious, with only one participant experiencing fever.The Phase II portion of the study will be conducted in multiple countries, including the United States. It will gauge the vaccine's ability to prevent infections or reduce severity of COVID-19, in addition to safety and immune response, among a broader range of volunteers. (Reporting by Julie Steenhuysen in Chicago, Carl O'Donnell in New York, and Manas Mishra in Bengaluru; Editing by Bill Berkrot)"}]}