{"article": [{"url": "https://finance.yahoo.com/news/u-considers-banning-tiktok-other-153000723.html", "published": 1594118300.0, "headline": "U.S. considers banning TikTok and other apps, Pompeo says", "body": "Secretary of State Mike Pompeo said late Monday that the U.S. is \"looking at\" banning TikTok and other Chinese social media apps over national security concerns. His remarks come as India banned the app and Australia is considering it. In an interview with Fox News Channel's Laura Ingraham, Pompeo said \"we're certainly looking at it\" when it comes to banning TikTok and other Chinese apps.\"With respect to Chinese apps on people's cell phones, I can assure you the United States will get this one right too, Laura,\" he said. \"I don't want to get out in front of the President [Donald Trump], but it's something we're looking at.\" Sec. Pompeo when asked if the Administration has considered banning TikTok: “We’re certainly looking at it.” pic.twitter.com/N9NmbDOka0— Benny (@bennyjohnson) July 7, 2020Pompeo said he doesn't recommend downloading the app unless \"you want your private information in the hands of the Chinese Communist Party.\"A spokesperson for TikTok refuted Pompeo's comments in a statement to CBS News.\"TikTok is led by an American CEO, with hundreds of employees and key leaders across safety, security, product, and public policy here in the U.S. We have no higher priority than promoting a safe and secure app experience for our users. We have never provided user data to the Chinese government, nor would we do so if asked.\"TikTok also confirmed Tuesday it stopped operations of the app in Hong Kong in wake of the new China-backed security law that would ban treason, secession, sedition and subversion in the semi-autonomous city. There are fears China will use the law to severely erode the freedoms Hong Kong has enjoyed under the \"one country, two systems\" framework.Launched in 2016, TikTok is owned by the Beijing-based tech company ByteDance. It's been downloaded more than 1 billion times worldwide, according to the app tracker Sensor Tower. The app, which allows users to create short videos, has been under scrutiny by lawmakers since exploding in popularity outside of China. TikTok's policies said the app collects user data such as IP addresses, location and information about devices. The company said it stores data from American users in the U.S. However, critics point out that TikTok is owned by a Chinese company and would still have to comply with Chinese laws. TikTok has repeatedly denied it works with China and said they are not influenced by any foreign government. TikTok announced in March it is opening a \"transparency center\" where experts can verify and examine the app's practices. India has banned 59 Chinese apps, including TikTok, amid a standoff in the Himalayas with the country. Without naming China, India said the ban on the apps was a \"targeted move to ensure safety and sovereignty of Indian cyberspace.\" Much like the U.S., Australia is reportedly considering a ban of the app over alleged data harvesting and links to the Chinese government."}]}