{"article": [{"url": "https://finance.yahoo.com/news/why-experts-doubt-trumps-demand-for-a-side-payment-in-a-potential-tik-tok-deal-will-hold-water-233153890.html", "published": 1596566360.0, "headline": "Why experts doubt Trump's demand for a TikTok 'side payment' will hold water", "body": "As TikTok — one of the hottest names in social media — scrambles to stay alive in the U.S., could the federal government extract a cut in a potential divestment deal?The popular mobile app — whose name reflects the mere seconds that its users’ have to create short-form videos — now faces its own unprecedented ticking clock, as the stakes rise in a battle between the world’s two largest economies.President Donald Trump has demanded that TikTok, owned by Chinese Internet giant ByteDance, either shut down its app by September 15, or agree to sell at least part of its ownership stake on terms acceptable to the U.S. government. Yet on Monday, the president threw the process into a new twist by floating the idea that any sale to an American company should also require a payment to the U.S. Treasury.Trump told reporters that “a very substantial portion of that price is going to have to come into the Treasury of the United States...because we're making it possible for this deal to happen. Right now [TikTok doesn’t] have any rights, unless we give it to them.”Microsoft (MSFT) confirmed discussions with ByteDance to explore a purchase of TikTok’s service in the U.S., Canada, Australia and New Zealand, and that the two companies had notified the Committee on Foreign Investment in the United States (CFIUS). That body initiates, reviews, investigates, and mitigates existing and prospective foreign transactions to protect national security.However, it’s unclear whether TikTok or Microsoft would be expected to pay the president’s proposed fee, which would potentially drive up the cost for an American company to acquire the platform. ByteDance investors recently valued TikTok at $50 billion, according to Reuters.In the company’s blog post, Microsoft said it “fully appreciates the importance of addressing the President’s concerns” and is “committed to acquiring TikTok subject to a complete security review and providing proper economic benefits to the U.S.. including the U.S. Treasury.”Story continuesIn an email to Yahoo Finance, the software giant offered no further comment beyond its original statement.White House economic advisor Larry Kudlow told Fox Business News on Tuesday that there was “no specific blueprint” for the President’s proposed payment. However, Trump’s unusual request touched off a spirited debate about whether it was permissible under the law — and experts have their doubts.“I’m not aware of anyone having been required to compensate the U.S. government for its efforts during a CFIUS review, mitigation, or divestment,” Jonathan Gafni, an attorney with Linklaters LLP and a former official with the Office of the Director of National Intelligence (ODNI), told Yahoo Finance.David Hall, a partner with the law firm and co-chair of its CFIUS practice for Wiggin and Dana LLP, said CFIUS alone has no legal authority to impose an extra payment beyond its usual fees and mitigation requirements.While Trump has ultimate authority to unravel foreign investments, his power to impose a payment for the benefit of the U.S. Treasury in connection with mitigation requirements is questionable, Hall explained.“There's not any authority for a side payment,” he said, adding that it would be “deeply concerning” if Microsoft voluntarily paid a fee because it could set a precedent that the way a foreign company or individual can get approval in a U.S. national security review is to pay the U.S. government.Esta imagen del viernes 17 de julio de 2020 muestra a un hombre con una camiseta que promueve la aplicación TikTok en una tienda Apple, en Beijing. (AP Foto/Ng Han Guan)Another foreseeable problem, Hall said, is that CFIUS is not subject to judicial review. Therefore, if a Treasury payment were wrapped up in its conditions to approve a deal, the parties subject to it would have no resource within the legal system to challenge it.Hall and Gafni explained that CFIUS’ authority does permit it to impose fines and penalties for failing to file for foreign investment review, and to require parties to take mitigation steps that are often expensive.Review fees can range into the hundreds of thousands of dollars for larger transactions. And mitigation conditions often require parties to undertake capital or operational expenditures — such as changing directors and officers, installing new physical access controls, and hiring third-party monitoring and auditing firms.Meanwhile, there’s little doubt that TikTok is worth its weight in gold to a potential suitor, given its popularity among younger users. According to a survey conducted by Piper Sandler in February and March, TikTok’s U.S. mobile app is used by approximately 62% of American teenagers.The data showed the company in third place among American teens, behind Instagram (85%) and Snapchat (82%).Alexis Keenan is a legal reporter for Yahoo Finance. Follow on Twitter @alexiskweed.[Click the following links for more of Yahoo Finance’s coronavirus coverage: Personal finance tips, news, policy, graphics & more from Yahoo Finance]Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}