{"article": [{"url": "https://finance.yahoo.com/news/world-banks-david-malpass-inequality-problem-is-gigantic-145654628.html", "published": 1598263460.0, "headline": "World Bank's David Malpass: 'Inequality problem is gigantic'", "body": "The World Bank says the COVID-19 pandemic could push 71 million people into extreme poverty, and its president is warning of the disparate impact on the world’s poorest countries.“This inequality problem is gigantic because it’s both within countries, [and] it's across borders,” World Bank President David Malpass told Yahoo Finance August 24.The World Bank in June forecast the global economy contracting by 5.2% this year. The sharp economic contraction threatens the optimistic growth that the World Bank had hoped for prior to the pandemic, with low-income countries now projected to grow real GDP by only 1.0% in 2020 compared to its pre-pandemic forecast of 5.4%.The World Bank reported that global extreme poverty was steadily declining pre-pandemic, but now expects millions to fall into the challenge of living on less than $1.90 per day. Source: World BankMalpass said advanced countries were able to take steps to stabilize their economies, but worries that developing countries were not able to do the same. With more obstacles to recovery for the impoverished nations, Malpass expects the COVID-19 crisis to be “substantially worse” than the 2008 great recession.The effect is unequal across nations, and Malpass said advanced economies had greater resources to address the crisis. In the U.S. for example, lawmakers were able to spend over $2 trillion to support businesses and the unemployed.“The stimulus measures are aimed at benefiting the people of those countries, and there just is not a mechanism right now for it to benefit the poorer countries,” Malpass said.Fast track helpThe World Bank, a sister organization to the International Monetary Fund, is attempting to offer help in the form of up to $160 billion in project financing. In April, the organization launched a “Fast-Track Facility” that doled out $1.9 billion in assistance to 25 countries.“All of the different World Bank arms are engaged in pushing forward as quickly as possible,” Malpass said.He said the rapid funds were designed to address basic health goods like personal protective equipment, and hopes to expand the program to cover eventual vaccines and other medicines needed.Story continuesBut the World Bank has also broadened out its focus to cover initiatives focused on food and schooling. In Turkey, for example, the World Bank is supporting a project financing the expansion of e-learning. In Afghanistan, the World Bank approved grants funding an increase in local food production through irrigation systems.While many countries have been successful in administering aid, Malpass said other countries have needed help.“Other countries are having trouble figuring out which hospitals need which things, and we can provide some technical assistance on that, but the country really needs to lead that effort,” he said.For poor countries, Malpass said the key to narrowing the inequality gap will be foreign direct investment flows from advanced countries into projects in developing countries.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed will not cap U.S. Treasury yields for the time beingSenate efforts to slip in lower leverage requirements brushed off by small, large banksFed lowers pricing for emergency loans to state, local governmentsNY Fed: COVID forces first decline in household debt since 2014A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}