{"article": [{"url": "https://finance.yahoo.com/news/as-their-convention-begins-some-republicans-revolt-175401921.html", "published": 1598274140.0, "headline": "Amid their party's convention, some Republicans revolt", "body": "President Trump will make his case for a second term this week amid notable opposition—from within his own party.The Republican National Convention will feature many well-known members of the Trump orbit, including most of his kids, the Republican leaders of the House and Senate, Trump consigliere Rudy Guiliani, the governors of Iowa and South Dakota and former United Nations ambassador Nikki Haley. But there will be no former presidents, no elder statesmen, no former Republican rivals and no party unity.The GOP, in fact, may be more divided than any party in modern history as it formally nominates its presidential candidate. Trump jousted with several intraparty detractors in 2016, such as former Secretary of State Colin Powell, Sen. John McCain, and former Florida Gov. Jeb Bush. But Republican opposition to Trump in 2016 was scattershot and some detractors protested passively by declining to endorse Trump. Other Republicans who bashed Trump in the primaries got behind him once he was the party’s candidate.Four years later, the Republican resistance has swollen, intensified and gotten better organized. On the first day of the national convention, more than two dozen former Republican members of Congress announced they’re supporting Democrat Joe Biden, including former Arizona Sen. Jeff Flake. This comes after Colin Powell and former Ohio Gov. John Kasich, who ran for the Republican presidential nomination in 2016, spoke at the Democratic convention, supporting Biden.In this image from video, former Republican Ohio Gov. John Kasich speaks during the first night of the Democratic National Convention on Monday, Aug. 17, 2020. (Democratic National Convention via AP)The Lincoln Project is a group of prominent Republicans running snarky anti-Trump ads with a mission “to defeat Donald Trump and Trumpism.” The group’s founders include conservative attorney Geroge Conway, husband of departing Trump strategist Kellyanne Conway, along with senior GOP operatives who helped run campaigns for party stalwarts such as McCain and both Bush presidents. Lincoln Project ads typically hammer Trump’s handling of the coronavirus crisis and lampoon his presidency.Story continuesIn 2016, fifty former Republican national security officials published an open letter warning that Trump would endanger the nation. That number now exceeds 70, and the group has a 10-point list of specific ways Trump has done what they warned about four years ago. They’ve formed their own organization, Defending Democracy Together, to raise money, campaign against Trump and help Biden win in November.It’s not just party pooh-bas opposing Trump. Another group, called Republican Voters Against Trump, collects stories of ordinary people who consider themselves Republicans or voted for Trump in 2016, but won’t vote for him this time around. In hundreds of video testimonials, these alienated Republicans explain why they feel the president has failed them.In Gallup polls, Trump’s approval rating among Republicans is around 90%, roughly the same as it was when Trump took office in 2017. So it seems that the party’s core isn’t following the apostates into rebellion. But only 26% of Americans say they’re Republican, down from 31% right after Trump took office in 2017. The portion identifying as Democrats during that time has stayed the same, at 31%, while 41% now say they’re Independent, up from 37%.There are other signs that Trump’s support is softening among the party faithful. The portion of Republicans saying the country is on the wrong track has soared from 13% before the coronavirus pandemic to 50% now, according to YouGov. Democrats and Independents are even gloomier, but the Trump campaign has to be alarmed that their core voters are that unhappy. Some Republicans might say they still support Trump, but be less enthused and more likely to stay home on Election Day.What the Republican convention won’t showcase is the type of party unity the Democrats were able to pull off a week earlier. Biden pulled together a broad range of support from the liberal Bernie Sanders wing, the firebrand Elizabeth Warren and her supporters, and national-security traditionalist like Powell. Activists across the party put aside stark policy differences to present a united front, with no sniping from the party fringes. At the GOP convention, Trump will be the sniper-in-chief, with plenty of additional fire on the sidelines.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Steve Bannon, revealed as a petty grifterWhy Trump wants to shackle the postal serviceTrump’s “housewife” myth11 ways Trump is out of touch with votersA double-dip recession is formingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}