{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-top-government-docs-push-back-on-perception-of-politics-as-vaccine-development-speeds-along-175120427.html", "published": 1599224360.0, "headline": "Coronavirus update: Top government docs push back on vaccine politics; Russia data questioned", "body": "Trump administration officials pushed back against a brewing political tug-of-war over the availability of a vaccine, as Election Day nears and the White House finds its fast-track approach being challenged by members of the scientific community.In recent days, public health officials have suggested the discovery of an effective COVID-19 inoculation could be closer than imagined even weeks ago. However, the process has become increasingly fraught with politics, as President Donald Trump ramps up expectations of a rapid vaccine discovery — and an growing chorus of medical experts challenge the aggressive development timetable.The head of Operation Warp Speed, Moncef Slaoui has said he will resign if there is political interference, following similar comments from U.S. Food and Drug Administration’s top vaccine official.“I would immediately resign if there is undue interference in this process,” Slaoui told Science Insider in an interview published on Thursday.Peter Marks, director of the FDA’s Center for Biologics Evaluation and Research, made a similar commitment last month, echoing repeated assurances from both U.S. Health and Human Services (HHS) Sec. Alex Azar and FDA Commissioner Stephen Hahn in recent weeks.The comments contrast starkly against White House officials pushing the idea that a vaccine could be authorized by November. In an interview with Yahoo Finance this week, Dr. Robert Redfield, director of the CDC, reiterated the timeline and asked public health systems to prepare for the eventuality.Although Slaoui told NPR Friday that November was “extremely unlikely, but not impossible,” Hahn said in an interview with Texas radio station WTAW that it is up to the companies to apply for an emergency use authorization (EUA). Ultimately, the FDA must review and subsequently approve a vaccine.“We are internally preparing for receiving those data, because we want to be able to act with appropriate speed,” Hahn said, noting he is aware Pfizer’s CEO has committed to providing results by October for regulatory review.Story continuesScrutiny of Russia’s vaccine intensifiesWashington and South Dakota are seeing spikes in cases. (Graphic: David Foster/Yahoo Finance)As the worldwide race for a coronavirus cure heats up, results of Russia’s vaccine candidate, dubbed “Sputnik V,” have been published in The Lancet medical journal. The data provide some validation for the country’s push to distribute the vaccine prior to a Phase 3 trial.The early-stage non-randomized trial painted an optimistic picture about the candidate’s efficacy, based on no adverse events seen from the use of the vaccine.Still, more robust data using a control group in Phase 3 is needed, experts say. President Vladimir Putin previously stated that one of his daughters used the vaccine and the worst symptom was a slight fever— a common side effect of vaccines.Matthew Schmidt, a Russia expert at the University of New Haven, said on Friday that “by circumventing the standard safety protocols of Phase III trials, and by politicizing the vaccine, the Kremlin has likely hurt public health globally, not helped it.”The encouraging data aside, “...skirting established scientific protocols will likely buttress arguments of anti-vaccine proponents that all governments must be engaged in similar behavior to force vaccinations on people, and that they're hiding bad side effects for nefarious purposes,” Schmidt added.Meanwhile, other experts still point to the level of antibody response. While the data has been deemed positive, Dr. Peter Hotez, Baylor College of Medicine's Dean for the National School of Tropical Medicine, told Yahoo Finance Friday the true effect of the vaccine will only be seen in Phase 3.The current results mirror the pre-clinical trial results for Oxford University and AstraZeneca’s (AZN) vaccine candidate, Hotez said. That means that it follows the trend of the first round of vaccines being less effective than what may come later.“The Russian vaccine could meet the minimum...FDA criteria, but it may not be a vaccine that interrupts transmission. This may be true of early Operation Warp Speed vaccines too,” Hotez said.But one positive is the dry-freeze form that the vaccine can be shipped in. That, Hotez said, is a key differentiator.The Russians have been good at dry-freezing vaccine, a skill developed in the development of a smallpox candidate that Russia and the U.S. collaborated on, Hotez said — which will help an inoculation reach some of the most remote parts of the world.Dr. Cindy Prins, an epidemiology professor at University of Florida, also pointed to the benefits that a vaccine stable at room temperature can provide many parts of the world.The two vaccine front-runners — Moderna (MRNA), and Pfizer (PFE) with BioNTech (BNTX)— have spurred hopes for a new and quicker vaccine development process in the future. Yet only one, Novavax (NVAX), has provided a room-temperature stable option.The latter has received the highest funding award through Operation Warp Speed, and is important for more widespread use in the global market, even while the U.S. refuses to join global efforts through the World Health Organization’s (WHO) COVAX program.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}