{"article": [{"url": "https://finance.yahoo.com/news/walmart-to-hire-20000-seasonal-workers-for-ecommerce-fulfillment-040157449.html", "published": 1600816220.0, "headline": "Walmart ramps up hiring spree ahead of holidays, set to hire 20,000 seasonal workers", "body": "Walmart (WMT) is on a seasonal hiring spree, thanks in part to massive online buying sparked by the coronavirus pandemic.The world’s largest retailer and the nation’s largest employer, is seeking 20,000 seasonal workers for roles that include order fillers and power equipment operators.The new hires will be placed across Walmart’s e-commerce fulfillment centers to keep up with surging demand, and the continued shift to online shopping during the holiday reason. The starting hourly rate is $15.75 to $23.75, depending on the position and location.“As more [customers] turn to online shopping, we want to ensure we’re staffed and ready to help deliver that special gift to their loved ones while continuing to fulfill our customer’s everyday needs,” Greg Smith, EVP of supply chain for Walmart U.S., said in a statement.Walmart will start providing shifts within 48 hours of applying. The roles will continue through Jan. 1, though some could convert to an employment offer.Since March, Walmart has benefitted from its status as an essential business during the pandemic, adding a staggering 500,000 new part-time and full-time employees across its stores and distribution centers. Amazon (AMZN) Walmart’s fiercest competitor, has also been on a hiring tear sparked by online retail, and is set to add 100,000 new jobs in North America.The linchpin of Walmart’s hiring boom has been online sales. During the COVID-19 hit second quarter, the company’s e-commerce exploded by 97% year-over-year.“Over the past six months, our customers have been shopping differently, and we expect that will continue into the most important shopping season of the year – the holidays,” Walmart’s chief merchandising officer Scott McCall said.Meanwhile, Walmart is bolstering its offerings for a stay-at-home environment in anticipation of changing customer habits and preferences. That includes athleisure and loungewear, exercise equipment, grills, baking supplies, pet gifts, bicycles, TVs, laptops, and videogames.Story continuesWalmart also plans to bring out holiday deals earlier, in what it’s calling “an all-new Black Friday experience.”“We’ve heard from our customers that many plan on starting their holiday shopping well before Black Friday, and that they’re looking for gifts that fit their current lifestyle,” according to McCall.“So, we’ve adjusted our strategy to adapt to these new shopping preferences – we’re offering more of what they want now, earlier than ever, and all at the best prices,” he added.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. How kids and the coronavirus helped Walmart shape its yearly list of hot toysWalmart unveils ‘ultimate life hack,’ a $98 membership with access to groceries, gas, and deliveryWalmart tests drones to send coronavirus kits to homes in Las VegasWalmart teams up with Goldman to offer business lines of credit"}]}