{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-what-a-50-haircut-to-unemployment-checks-would-do-to-the-economy-172642329.html", "published": 1595853260.0, "headline": "Coronavirus stimulus: What a 50% haircut to unemployment checks would do to the economy", "body": "Lawmakers may want to hold the congratulatory delivered steak dinners for passing the next round of fiscal stimulus for some 30 million unemployed Americans.Because despite what looks to be a fresh $1,200 stimulus check mailer to households, it’s likely the major haircut to the unemployment top up that could depress the COVID-19 stricken U.S. economy even with those stimulus checks going out.“Our middle ground assumption of $300/week would reduce personal income by roughly $175 billion through the end of the year ($420 billion or 2% of GDP at an annual rate). However, since the benefit is due to expire entirely July 31 under current law, a partial extension at $300/week would add about the same amount ($175 billion) to the reported cost of the next round of fiscal legislation,” said Goldman Sachs chief economist Jan Hatzius in a new note to clients.The controversial unemployment top up of $600 a week has been key to keeping consumer spending —which makes up about 70% of the U.S. economy — afloat in the past three months. But it would appear that Goldman’s middle ground assumption — or slightly worse — on unemployment stimulus may come to fruition as lawmakers argue workers aren’t being incentivized to search for employment.Senate Majority Leader Mitch McConnell is working on a new $1 trillion stimulus package that will be formally presented on Monday. As part of that plan, the Washington Post reports Monday that the top up would be slashed to $200 from $600 a week. That’s a far cry away from House Democrats retaining the $600 payment in their $3 trillion stimulus package passed several weeks ago. The package is also expected to include $1,200 checks to households, similar to the Coronavirus Aid, Relief, and Economic Security (CARES) Act.WASHINGTON, July 21, 2020 -- U.S. Senate Majority Leader Mitch McConnell speaks during a press conference on Capitol Hill in Washington, D.C., the United States, on July 21, 2020. McConnell said on Tuesday that the next COVID-19 relief bill will include a second round of stimulus checks to American households and Paycheck Protection Program loans for small businesses. (Photo by Ting Shen/Xinhua via Getty) (Xinhua/ via Getty Images)\"I think workers and Americans understand the concept that you shouldn't be paid more to stay home than to work,\" Treasury Secretary Steven Mnuchin said in a Fox News interview over the weekend.Story continuesInvestors may be wise to brace for a return of volatility to markets if a less helpful stimulus package gets passed.“Near-term, a little bearish,” said FBB Capital Partners Mike Mussio on Yahoo Finance’s The First Trade when asked how the market would react if the next round of government stimulus disappoints. Mussio believes investors shouldn’t rule out a quick 10% correction in markets if there is a disappointment.Ultimately a more substantial fiscal package that helps the unemployed may have to wait until after the presidential election, Hatzius points out.Says Hatzius, “The more important factor for fiscal policy in 2021 and beyond will be the result of the November presidential and congressional elections. Under a status quo election outcome, we would expect only modest further fiscal support in 2021. Under a Democratic sweep we would expect more substantial fiscal support, as Democrats have been more inclined to use countercyclical fiscal policy than Republicans and a unified Congress would ease passage.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all abou"}]}