{"article": [{"url": "https://finance.yahoo.com/news/white-house-take-on-jobs-the-numbers-are-going-to-slow-but-were-in-a-durable-recovery-192016112.html", "published": 1599229700.0, "headline": "White House on jobs: ‘The numbers are going to slow’ but we’re in a ‘durable recovery’", "body": "After the Labor Department released the August jobs report on Friday, White House advisors fanned out to argue that the V-shaped recovery was still happening.“I think we're in a V-shaped recovery,” White House economic advisor Larry Kudlow told reporters.Joseph LaVorgna, chief economist of the National Economic Council, described it on Yahoo Finance as “a super V-shaped recovery,” and suggested the White House believes an economic recovery could last well into 2021.\"Sure, the numbers are going to slow,” LaVorgna said in an interview with Yahoo Finance, but he quickly ticked off positive trends he sees in the home, retail, autos, housing, and manufacturing markets. The collective data indicates that “the economy is undergoing a durable recovery that will last, provided the proper policies are in place,” he said.That last part was a clear reference to the presidential election, now just 59 days away, where President Trump is trailing his Democratic rival, Joe Biden.In a speech on Friday, Biden said the economy was looking more “K-shaped,” where the richest Americans experience a quick rebound while the rest of the country continues to struggle.President Donald Trump, with Vice President Mike Pence, during an event in the White House on Friday. (Anna Moneymaker-Pool/Getty Images)The U.S. economy added more payrolls in August than expected and the unemployment rate dropped from 10.2% in July to 8.4%. It was the first time since the pandemic hit that unemployment had been in the single-digits.Still, the pace of payroll gains has slowed relative to recent months. Even with 1.37 million jobs added in August, we are still a long way from making up for the massive layoffs during the early months of the pandemic. Non-farm payrolls fell by a record 20.78 million in April alone. The U.S. is still in the hole to the tune of about 11.5 million jobs since March.‘We could see 5%, even 6% growth’If the coronavirus never appeared, the U.S. economy would have seen 3% growth in 2020 and 3% growth in 2021, LaVorgna said.Now he predicts massive growth in the second half of 2020 – “we could see 5%, even 6% growth” in 2021, in part because “we're catching up.”Story continuesIt was a slight shift in tone from one month prior. LaVorgna appeared on Yahoo Finance on Aug. 7 around the time the July jobs numbers were released, and said “the slowing [of jobs growth] to me is very misleading because it has slowed, but that's not to say that is won't reaccelerate.”No signs of re-acceleration are evident so far as the economy gained 1.73 million jobs in July compared to 1.37 million in August.President Trump also touted the news, and his campaign released a statement saying in part that “the economy maintained its rapid recovery as more and more Americans are returning to work.”Great Jobs Numbers! 1.37 Million Jobs Added In August. Unemployment Rate Falls To 8.4% (Wow, much better than expected!). Broke the 10% level faster and deeper than thought possible.— Donald J. Trump (@realDonaldTrump) September 4, 2020‘We'd like something to get done’ on stimulusDemocrats largely responded to Friday’s news by acknowledging the gains but also saying it wasn’t enough. One Democratic group noted that there are still fewer jobs now than when Trump took office (though many other countries are in the same boat).House Speaker Nancy Pelosi’s statement focused on the ongoing stimulus negotiations. She said the report “highlights the continuing urgent need for action as the economic recovery stimulated by Congress’s early and robust investments continues to slow down.”Late Thursday, the news broke that Pelosi and Treasury Secretary Steven Mnuchin had a tentative deal to avoid a government shutdown at the end of the month with an unclear impact on efforts to come to an agreement on a new economic stimulus package.Speaker of the House Nancy Pelosi during an event in in San Francisco on Sept. 2. (Justin Sullivan/Getty Images)LaVorgna, as he did last month when he called stimulus an “insurance policy” for the recovery, downplayed the need for more stimulus.“We'd like something to get done,” LaVorgna said, but absent progress, “we're very confident that these numbers will continue to be very robust.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:The US has lost jobs since Trump took office, but so have many other countriesJobs report: US economy adds 1.371 million payrolls in August, unemployment rate dips to 8.4%The jobs recovery is 'nearing the point of exhaustion'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}