{"article": [{"url": "https://finance.yahoo.com/news/zoom-beats-quarterly-revenue-estimates-201306154.html", "published": 1598945780.0, "headline": "Why Zoom is being conservative about their guidance: analyst", "body": "By Neha Malara and Stephen Nellis(Reuters) - Zoom Video Communications Inc raised its annual revenue forecast by more than 30% after comfortably beating quarterly estimates on Monday as it converts more of its huge free user base to paid subscriptions.Shares of Zoom, which have surged almost four-fold this year, rose 9.3% to $355.30 after the bell. Earlier in the day they hit a record closing high of $325.10 in regular trading.Video-conferencing platforms, once used mostly as a technological substitute for in-person meetings, became a vital part of day-to-day life this year for people stuck at home under coronavirus restrictions, be it for work, school or socializing. Zoom rivals such as Microsoft Corp's Teams and Cisco System Inc's Webex have also seen soaring usage.When the pandemic hit in early 2020, Zoom was a relative upstart founded by a former Cisco executive that had gone public on a promise to make video conferencing software easier to use. But the ease of use came with privacy and security concerns that drove some customers to competitors earlier this year and prompted Zoom to embark on a 90-day plan to address the issues. Zoom began testing end-to-end encryption of its service in July but has not yet implemented the feature for most users.The surge in usage also strained Zoom's infrastructure, with some outages last week as schools in many parts of the United States resumed classes virtually.Since the start of the pandemic, Zoom has worked to convert the mass of free users into paying customers, which is important because the company relies on both its own data centers and cloud providers such as Amazon.com and Oracle Corp to provide its serving, meaning it must bear costs for free users.The company said revenue rose 355% to $663.5 million, topping analysts' average estimate of $500.5 million. The company's gross profit rose to 71% from 68%, but remains far below the 80% range Zoom operated at before free users flocked to the service.Story continues“It’s possible they’re being conservative”On a conference call with investors, Zoom Chief Financial Officer Kelly Steckelberg said the company's gross profits will remain in the same range as the fiscal second quarter for the rest of the fiscal year. She also said the company was experiencing slightly higher rates of customer cancellation than Zoom's historical average, but that the new rates had been factored into the company's forecast.\"The revenue growth is accelerating,\" Chaim Siegel, an analyst with Elazar Advisors, told Reuters. \"Even though they gave very strong guidance for next quarter it's possible they're being conservative if you consider a stay-at-home back-to-school. Zoom is a household word.\"Student live learning video conference with teacher and other classmates. (Getty)Zoom's number of large customers - those generating more than $100,000 in revenue in the past year - more than doubled to 988 in the fiscal second quarter.The company, founded and headed by former Cisco manager Eric Yuan, raised its annual revenue target for fiscal year 2021 to a range of $2.37 billion to $2.39 billion, from $1.78 billion to $1.80 billion previously.Net income attributable to common stockholders rose to $185.7 million, or 63 cents per share, from $5.5 million, or 2 cents per share, a year earlier.Excluding items, the company earned 92 cents per share, beating the average analyst estimate of 45 cents, according to IBES data from Refinitiv.(Reporting by Neha Malara in Bengaluru and Stephen Nellis in San Francisco; Editing by Sriraj Kalluvila, Leslie Adler and Richard Pullin)"}]}