{"article": [{"url": "https://finance.yahoo.com/news/senate-gop-sends-mixed-messages-on-need-for-fed-emergency-lending-195443185.html", "published": 1599663740.0, "headline": "Senate GOP sends mixed messages on need for Federal Reserve emergency loans", "body": "Senate Republicans hope to jam through a coronavirus relief bill but appear divided on whether the Federal Reserve should be pushing more or less money through its emergency lending programs.As part of its coronavirus relief proposal package, the Senate GOP proposes downsizing the fund given to the Fed and the U.S. Treasury for the purposes of setting up emergency lending programs — from $454 billion to $250 billion.The bill would also prevent the Fed from making any new loans through its facilities after mid-January 2021, although it could continue to service loans made before that time.So far, the U.S. Treasury has only used $195 billion of the fund to support the Fed’s special purpose vehicles backstopping markets ranging from corporate debt to municipal bonds.“It was totally underutilized,” Senator Mike Braun, an Indiana Republican, told Yahoo Finance’s On The Move on Wednesday.Hand sanitizer sits on a table as Sen. Mike Braun (R-IN) speaks during a Senate Health Education Labor and Pensions Committee hearing on new coronavirus disease (COVID-19) tests, on Capitol Hill in Washington, U.S., May 7, 2020. Andrew Harnik/Pool via REUTERSThe GOP hopes that cutting the cost of the program will support the $500 billion relief package’s other proposals, which includes smaller supplemental unemployment benefits and an extension of the Paycheck Protection Program.The bill will need 51 votes for the bill on the Senate floor, where the GOP holds a narrow 53-to-47 majority.But it is unclear if all Republicans support the specific measure to pull back the Fed’s emergency powers. The Senate Banking Committee’s top Republican, Mike Crapo of Idaho, has clarified that he would like to see the Fed do more with its Main Street Lending Program.Crapo has urged the Fed and the Treasury to ramp up lending to small- and mid-size businesses, writing to Fed Chairman Jay Powell and Treasury Secretary Steven Mnuchin in late July that they need to “quickly expand” the pipeline of emergency loans.George Selgin, director of the Cato Institute’s Center for Monetary and Financial Alternatives, said that Senate Republicans are mixing up its message on a policy response.“Do we want to give these firms more money or not? If people can’t agree on that — that’s a fundamental issue,” Selgin told Yahoo Finance.Story continuesMain Street Lending ProgramAlthough the Fed’s emergency lending facilities cover a wide range of financial markets, Congress has been particularly fixated on the Main Street Lending Program.The Coronavirus Aid, Relief, and Economic Security (CARES) Act birthed the $454 billion appropriation and directed the Fed to set up a program that “supports lending to small and mid-sized businesses.” The Treasury gave the Fed $75 billion to support the loans and after months of figuring out how to establish the facility, the Fed finally unveiled the program — but to little fanfare.As of Sept. 3, the facility had lent only $1.2 billion of the $600 billion in capacity that the Fed claims it could lever up to (using the Treasury equity investment). The Fed has repeatedly emphasized that the loans are not grants.Crapo has advocated for revising the Fed’s EBITDA requirements for loan eligibility, arguing that companies in industries with weaker cash flow may be unable to access loans.Sen. Pat Toomey, a Republican from Pennsylvania, agreed that an asset-based standard may work better for the program. But in a hearing focused on the Main Street Lending Program on Wednesday, Toomey expressed doubt over the usefulness of the Main Street loans in supporting companies and industries through the entire recovery process.“I think we have to ask ourselves whether this is the appropriate program to do it, and I would suggest it’s not,” Toomey said.The debate comes as the economy continues to work through a recovery; the unemployment rate has fallen but remains at 8.4% and data from S&P Global Market Intelligence reports that 470 companies have gone bankrupt so far in 2020 — more than any comparable period since 2010.Selgin said the ideological divide over the degree of support for small- and mid-size businesses needs to consider the role of fiscal policy, adding that paring back the Fed powers would be fine “if Congress were willing to put up the money that it still feels [is] necessary.”Even if passed, the GOP proposal likely faces a challenge from the Democratically controlled House of Representatives, which had previously floated a $3.5 trillion package.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed Chair Powell: Wearing masks can lead to 'enormous' economic gainsFederal Reserve: We got it ‘wrong’ on post-crisis rate hikesJackson Hole wrap-up: For the Fed, inflation is all about managing expectationsCleveland Fed's Mester: GDP to be about 6% lower than last year for 2020A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}