{"article": [{"url": "https://finance.yahoo.com/news/edgy-voters-might-reject-the-2020-election-results-140758347.html", "published": 1593594920.0, "headline": "Edgy voters might reject the 2020 election results", "body": "We’ve had close elections before, but political experts are bracing for events that might be unprecedented come November.Surprisingly large portions of both Republicans and Democrats seem poised to challenge the results of the 2020 presidential election if their side loses. Some even favor authoritarian rule over elections as the best way to run the country. And a new worry for 2020 is the risk that more mail-in voting could delay official results well past Election Day, leaving voters wondering whether it will be Donald Trump’s agenda or Joe Biden’s, once January arrives.New research by the Democracy Fund Voter Study Group finds that 38% of Democrats favor a do-over election if their candidate, Joe Biden, wins the popular vote this year but loses the electoral vote, as Hillary Clinton did in 2016. Among Republicans, 11% favor a do-over if Biden wins the electoral vote but President Trump wins the popular vote. In the U.S. system, electoral votes are awarded for each state a candidate wins, rather than for the national tally, and there’s no provision for a repeat election if there’s a split decision. The electoral vote carries the day.If Trump wins and there’s credible evidence of interference by a foreign government—as there was in 2016, we now know—57% of Democrats say they’d back a do-over election. And if Trump lost but claimed there was voter fraud, 29% of Republicans say it would be appropriate if he refused to leave office.A voter fills out his ballot as a woman waits her turn during primary voting at the public safety building in McKeesport, Pa., Tuesday, June 2, 2020. (AP Photo/Gene J. Puskar)“There are multiple contexts in which people might plausibly be mobilized to reject the legitimacy of the election,” political scientist Larry Diamond of Stanford University, who co-authored the Democracy Fund analysis, says in the latest episode of the Yahoo Finance Electionomics podcast. “These figures indicate a strong potential for the losing candidate to possibly raise concerns that would provoke a crisis over the legitimacy of the 2020 presidential election.”The Democracy Fund research is based on a detailed survey of 5,900 voters done last November and December. Unlike many political polls, which involve phone calls to a random group of Americans, the Democracy Fund research tracks several thousand voters over time to capture changes in the views of a large, consistent group of Americans.Story continuesSome cracks in the systemThe surveys took place during the House of Representatives’ impeachment investigation into President Trump, but before the House impeached Trump or the Senate acquitted him. The research obviously came before the coronavirus outbreak, the resulting recession and the Black Lives Matter protests that erupted after the May 25 killing of George Floyd in Minneapolis. Diamond says the researchers took six months to publish their research because the findings are sensitive and they wanted to be methodical.Beginning in 2017, Democracy Fund researchers began to ask voters about their views toward authoritarian government, to gauge whether support for free elections in the United States is weakening. In three sets of surveys since then, they found high levels of support for a democratic system—but also some startling cracks in that support.Democratic presidential candidate, former Vice President Joe Biden listens to a reporter's question as he speaks at Alexis Dupont High School in Wilmington, Del., Tuesday, June 30, 2020. (AP Photo/Patrick Semansky)In the 2019 survey, 13% of Americans said they’d support army rule in the United States, with no elections and no legislative activity by Congress. Another 18% weren’t sure if they favor or oppose military rule. Those portions have been roughly the same since 2017, but they’re higher than in a different set of surveys from the 1990s, which found support for military rule in the United States in the mid-single digits.In 2019, for the first time, Democracy Fund researchers asked voters their attitudes toward election-related violence. Nearly one-fifth said it would be justified if the other party’s candidate won the election. Attitudes were similar in each party. Among Republicans, 11% said a “moderate” amount of violence would be appropriate if Democrats win the 2020 election, while 10% said “a lot” of violence would be appropriate, for a total of 21%. Among Democrats, 13% support “moderate” violence if Republicans win, while 9% support “a lot of violence,” for a total of 22%. Since this was the first time researchers asked the question, it’s not clear if support for violence is rising or falling.Any support for violence might sound alarming, but the researchers point out there’s a big difference between supporting violence in theory when pollsters bring it up, and contributing to violence in real life. “Our assumption,” says Diamond, “is only a small percentage would probably commit violence. But if you look at what's happening in the United States of America these days, you can no longer dismiss the possibility that this is going to happen.”What’s worrisome about 2020 is the political tension that already exists, four months before the election. Armed demonstrators protesting coronavirus shutdowns in Michigan forced the closure of the legislature in early May, with some legislators coming to work afterward in bulletproof vests. The Black Lives Matter protests have been marred by criminals infiltrating peaceful demonstrations, provoking police and looting. Trump is already claiming, with no evidence, that there will be fraud in the November elections, as states expand mail-in voting.Harris County election clerk Jose Mendoza watches over voting booths, Monday, June 29, 2020, in Houston. Early voting for the Texas primary runoffs began Monday. (AP Photo/David J. Phillip)“You might say people are blowing off steam when they say violence might be justified,” Diamond says. “But we haven't had an incident in my memory similar to what happened in the Michigan state capital. And it's been a long time since we've had protests that have resulted in the violence that we've been seeing on our streets.”Another complicating factor is the likelihood it could take days or weeks after the election on Nov. 3 to know who actually won, since it sometimes takes that long to count mail-in ballots. If it’s a close race, with uncertain results in a handful of swing states crucial to the outcome, delayed voting could make voters suspicious and give one candidate or the other more reason to declare fraud. A landslide election, by contrast, might defuse such tension, leaving little doubt about the winner, whether Trump or Biden.The candidates themselves could tamp down tensions if they wanted to. Diamond’s plea to Trump, Biden and other politicians running for office this year: “Respect the process and the election professionals running the process. Don’t try to suppress the vote or question the credibility of arrangements electoral officials might be doing to make it easier for people to vote. And don’t gin up outrage and a readiness to do something radical or extreme. Our survey results show that could be much more dangerous than in the past.”Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Why you’re not hearing about Biden’s economic planTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}