{"article": [{"url": "https://finance.yahoo.com/news/fed-fomc-monetary-policy-decision-july-2020-150924227.html", "published": 1596017840.0, "headline": "Fed: Economic recovery will depend 'significantly on the course of the virus'", "body": "The Federal Reserve on Wednesday maintained interest rates at near-zero, noting that economic activity and employment have “picked up somewhat in recent months” but cautioned that the coronavirus needs to be contained in order to have faith in a rebound.As the COVID-19 pandemic forced the economy into lockdown, the Federal Open Market Committee slashed interest rates to near-zero and restarted its crisis-era policy of asset purchases through quantitative easing.Since then, the Fed has leaned heavily on its lender of last resort powers by setting up 11 liquidity facilities designed to backstop financial markets, ranging from corporate debt to municipal bonds. However, the virus’ resurgence in parts of the country have stoked new fears about a rebound, and a much feared second wave is clouding the outlook.“The path of the economy will depend significantly on the course of the virus,” the Federal Open Market Committee added to its policy statement on Wednesday.Although jobs reports for May and June showed strong gains, the Fed said employment remains “well below their levels at the beginning of the year.” Virus counts continue to climb, and the U.S. now has over 4.2 million reported cases of COVID-19 with the number of deaths creeping toward 150,000.Progress on an effective COVID-19 vaccine comes as the virus continues to claim new victims worldwide, while the U.S. fights an uphill battle to contain a surge in confirmed cases. A treatment remains key to ending the severe restrictions on public life, as public mask-wearing and social distancing become flashpoints in U.S. political discourse.The Fed originally intended to keep most of its liquidity facilities open through September, but the U.S. Treasury and the Fed agreed to extend those facilities through December 31. One facility targeting short-term corporate financing, the Commercial Paper Funding Facility, will remain operational through mid-March 2021.Alongside the statement, the Fed extended its U.S. dollar liquidity swap lines with foreign and international monetary authorities through the end of March 2021. The Fed says the move will “help sustain recent improvements in global U.S. dollar funding markets by maintaining these important liquidity backstops.” The facility was originally supposed to expire in October.Story continuesAlthough the Fed had messaged from the beginning that it was flexible with the end dates for its facilities, the extension underscores the concern that market support may be needed for longer than the central bank had originally hoped.The central bank’s statement noted that “overall financial conditions have improved in recent months.”The decision to hold rates in the target range of between 0% and 0.25% was unanimously agreed to by the voting members of the FOMC.Fed Chairman Jerome Powell is set to address members of the press in a conference at 2:30pm ET.Forward guidance?No major surprises were expected from the Fed, which had signaled in recent weeks that it could wait a little longer before deploying additional monetary policy tools.Policymakers have been contemplating the use of more explicit forward guidance, in which the Fed would commit to keeping rates at the zero bound until unemployment and/or inflation reach certain targets.A more dramatic version of explicit forward guidance would be yield curve control, a tool deployed in Japan and Australia in which the central bank commits to purchasing government securities of specific maturities until yields fall below stated levels.New York Fed President John Williams told Yahoo Finance July 16 that he was pleased with existing communication and said the Fed has “some time to think about how we should evolve that guidance as we go forward.”But Wall Street expects the Fed to unveil some policy change later this year, as early as the next FOMC in September. In his press conference, Powell could offer clues into what types of policies it could embrace at that point.The next FOMC is scheduled to take place September 15 and 16.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.FOMC Preview: 'Probably nothing' new as Fed weighs guidance amid coronavirus surgeWells Fargo's Mary Mack: 'We have more to do' on rebuilding reputationSenate panel advances Trump nominees Shelton, Waller for spots at FedYahoo U: What are SPACs?A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}