{"article": [{"url": "https://finance.yahoo.com/news/experimental-j-j-vaccine-protects-090000128.html", "published": 1596082100.0, "headline": "Experimental J&J vaccine protects monkeys in a single dose-study", "body": "By Julie SteenhuysenCHICAGO, July 30 (Reuters) - Johnson & Johnson on Thursday kicked off U.S. human safety trials for its COVID-19 vaccine after releasing details of a study in monkeys that showed its best-performing vaccine candidate offered strong protection in a single dose.When exposed to the virus, six out of six animals who got the candidate vaccine were completely protected from lung disease and five out of six were protected from infection as measured by the presence of virus in nasal swabs, according to the study published in the journal Nature.\"This gives us confidence that we can test a single-shot vaccine in this epidemic and learn whether it has a protective effect in humans,\" Dr. Paul Stoffels, J&J's chief scientific officer, told Reuters in a telephone interview.The U.S. government is backing J&J's vaccine effort with $456 million in funding as part of a spending spree aimed at speeding production of a vaccine to end the pandemic, which has infected millions and killed more than 660,000 people.Stoffels said prior tests of this type of vaccine in other diseases found that a second shot significantly increases protection. But in a pandemic a single-shot vaccine has a significant advantage, sidestepping a lot of the logistical issues involved in getting people to come back for their second dose.The company plans to take up the question of one or two doses in its phase 1 trial, which kicked off this week in the United States.Depending on those results, J&J plans to start large-scale, phase 3 testing with a single-shot regimen in the second half of September. Around the same time, the company will start a parallel phase 3 study testing a two-shot regimen of the vaccine, Stoffels said.J&J's vaccine uses a common cold virus known as adnovirus type 26 or Ad26 to ferry coronavirus proteins into cells in the body, causing the body to mount an immune defense against the virus.Story continuesIn the monkey study, scientists from J&J and Harvard's Beth Israel Deaconess Medical Center studied seven different potential vaccines in 32 animals and compared the results to 20 control animals who got placebo shots.Six weeks later, all of the animals were exposed to the SARS-CoV-2 virus. All 20 animals that received the placebo developed high levels of virus in their lungs and nasal swabs.In the best-performing candidate, which J&J selected for human testing, none of the animals had virus in their lungs and only one showed low levels of virus in nasal swabs. Lab tests showed they all had developed antibodies capapable of neutralizing the virus after a single shot.\"This study shows that even just a single immunization with the Ad26 vaccine leads to neutralizing antibody responses and robust protection of monkeys against COVID-19,\" said Dr. Dan Barouch, a vaccine researcher at Beth Isreal Deaconness who led the research in collaboration with J&J.(Reporting by Julie Steenhuysen; editing by Richard Pullin)"}]}