{"article": [{"url": "https://finance.yahoo.com/news/economic-warning-signs-regions-states-covid-19-cases-spike-morning-brief-095729306.html", "published": 1593407120.0, "headline": "Economic warning signs emerge where COVID-19 cases spike: Morning Brief", "body": "Monday, June 29, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeRising COVID-19 cases put confidence and spending in checkCoronavirus cases are on the rise in the U.S., led by troubling trends in the South, the West, and the Midwest. Case counts have recently gone sideways at lower levels in the Northeast.On Friday, the University of Michigan’s last reading on consumer sentiment showed the consumer bounce back in June has not exactly been uniform across the country. Sentiment is surging in the Northeast, but it’s climbing at a much more modest pace in the South, West and Midwest.In other words, consumer sentiment tracks the virus.“[T]he Sentiment Index among residents of the Northeast rose by an all-time record of 19.1 Index-points in June, with residents apparently expecting the later and more gradual reopening to produce at worst a negligible increase in infections,\" said Richard Curtin, the Surveys of Consumers chief economist.\"The resurgence of the virus will be accompanied by weaker consumer demand among residents of the Southern and Western regions and may even temper the reactions of consumers in the Northeast.”Sentiment remains lackluster, particularly in regions where COVID-19 cases are jumping.And we’re seeing signs in some data on spending and hours-worked that confirm the idea that reopening the economy alone won't get us back to pre-pandemic levels. Consumers need not just the ability but also the willingness to fully re-engage with the economy.One piece of real-time data that seems to tie the virus to economic activity is JPMorgan Chase’s credit and debit card activity.“Our Chase U.S. card data have shown a broad-based sharp move up in spending but one that initially favored states that had been more lax in their assessment of the virus risks (Texas and Florida),” JPMorgan’s Bruce Kasman wrote on Friday.“More recently, this has started to reverse as those states that have had success in containing the virus (New York) have seen a greater rise in spending while the resurgence in the virus across the South is slowing spending gains.”Story continuesAnd it's not just consumers that are pulling back. Last week, we learned Apple was re-closing stores in Florida amid the surge in COVID-19 cases while restaurants in some states started closing again even before new mandates.Data from Homebase, a company that processes paychecks for hourly workers, also suggests small businesses may be pulling back in some states more than others.\"The recovery in hours worked at small service businesses – measured by Homebase – has pulled back more sharply in states with worsening outbreaks,” Nomura’s Lewis Alexander observed.Hours worked are falling in regions where COVID-19 cases are jumping.“We have long assumed the recovery from the pandemic recession would be constrained without a widely distributed vaccine,” Alexander added. “However, recent developments suggest a rising risk of another outright contraction in activity in some states.\"Indeed, the virus drives the economy.All this comes as the expiration of emergency fiscal stimulus measures loom. And these measures have been material in bolstering the economy during this crisis.As Curtin said Friday: “The need for additional fiscal policies to relieve financial hardships has risen.”By Sam Ro, managing editor. Follow him at @SamRoWhat to watch todayEconomy10 a.m. ET: Pending Home Sales month-on-month, May (+18% expected, -21.8% in April)10:30 a.m. ET: Dallas Fed Manufacturing Activity, June (-22 expected, -49.2 in May)EarningsPost-market4 p.m. ET: Micron (MU) is expected to report earnings of 71 cents per share on $5.27 billion in revenueREAD MORETop NewsGlobal stocks rise despite global death toll passing 500,000 [Yahoo Finance UK]Shale pioneer Chesapeake Energy files for bankruptcy [Reuters]Facebook shares poised to fall after Starbucks joins ad pullback [Bloomberg]Boeing 737 MAX certification flight tests to begin on Monday [Reuters]YAHOO FINANCE HIGHLIGHTSSalesforce's Benioff blasts Facebook, renews 'cigarettes' charge: 'They're after your kids'The global drug market is booming in the 21st century, UN concludesA Harvard student's brainchild creates a pipeline for Black finance hopefuls—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}