{"article": [{"url": "https://finance.yahoo.com/news/billions-or-trillions-the-great-coronavirus-tradeoff-122132084.html", "published": 1592033360.0, "headline": "Billions or trillions: The great coronavirus trade-off", "body": "Lost somewhat in the recent social upheaval and profound questioning of race in our country is the fact that we are still in the midst of a pandemic.As I’ve delved into previously, racism and COVID-19 are connected in myriad ways which continue to reveal themselves to us. But in this column I want to look into the fight against the coronavirus, because here too there’s much to parse.There’s talk now about a first wave versus a second wave, but really we still have only one wave in the U.S., meaning the disease hasn’t come, gone and then come back again anywhere.The rate of infection of COVID-19 is now falling in 19 states including New York and New Jersey, about the same in eight states and rising in 23 states including Florida and Texas. New cases are up over the past seven days versus two weeks ago in the U.S. The CDC is predicting total deaths in the U.S, will climb to between 124,000 and 140,000 by the Fourth of July.That will be a grim marker on our nation’s birthday.While COVID-19, which has killed over 424,000 globally so far, isn’t the deadliest pandemic ever, (both the Black Plague and the 1918 Flu killed tens of millions), it is plenty horrific. The coronavirus has certainly wreaked the most economic havoc, in absolute terms at least, of any plague we’ve ever faced, certainly in modern times. And so rightfully the battle to mitigate this outbreak has become the greatest rapid-response action in the history of humanity.We humans will likely prevail in the end, but it might be only a partial victory as with HIV/AIDs, against which we have no vaccine or cure, even after 30-plus years of trying.I asked Nobel laureate Phillip Sharp, a geneticist and professor of biology at MIT how he thought the fight against coronavirus was proceeding right now. How does he assess it?“Pretty primitive,” he replied. “Pharmaceutical and biotech companies have turned their technology, if it is applicable to this problem, and they are investing very significant amounts of money to try to test whether their approaches are likely to be beneficial. And then they need to be able to respond with enough of the drug to actually have an impact in society. Whether we will have by the fall a treatment that will reduce the morbidity of the infection is really the issue. And if we can find ways to vaccinate or block the spread of the virus that would be even more beneficial.”Story continuesDr. Sharp is referring to both therapeutics—like Remdesivir made by Gilead Sciences and drugs made by Eli Lilly and Regeneron, which would treat patients sick with the disease—and the race to find a vaccine.“Developing both therapeutic candidates and vaccines and having multiple shots, multiple options is a good thing at this stage,” a veteran biotech executive who’s invested in the sector told me. The faster a vaccine comes, the less need there will be for treatments, but for now, all bets are on. Ultimately scientists and doctors agree that a vaccine, or vaccines, is what’s needed most.Unrecognizable female scientist with bacteriological protection suit investigating a vaccine in the laboratoryAnd the scientists and doctors are working on it!The World Health Organization reports there are some 135 vaccine projects being endeavored at medical institutions and universities across the globe in conjunction with everything from suddenly high-profile startups like Moderna, to giants like Merck and Johnson & Johnson. And yes, vaccines typically take years to create before they are ready to be distributed and in this case, scientists are looking to have one ready by next spring.Besides this life and death race against time—it really could be your grandfather or co-worker who’s saved—there are any number of intriguing subplots playing out beneath the surface. For starters, the U.S. government is pledging over $2 billion in grants to mega-projects managed by AstraZeneca and Oxford University, Moderna, J&J and the French company Sanofi. Philanthropies like the Bill & Melinda Gates Foundation are spending billions more. Other governments are ponying up as well—particularly the Chinese and the Russians—though it’s unclear how much those countries are truly allocating, as both might either low-ball or high-ball the number to suit their purposes.Hallmarks of a horse raceRussia has 10 drugs in trials, second only to China and the U.S, and the Wall Street Journal reports that Russian President Vladimir Putin considers the pursuit of a coronavirus vaccine akin to an episode in a new Cold War, or like the space race of the 1960s. According to the Journal: “Mr. Putin has insisted that the first [vaccine candidate] be registered by September, a timeline public-health experts say is extremely short and could pose health risks if a vaccine’s potential side effects aren’t studied extensively.”Great. Imagine the volunteering process for one of Mr. Putin’s human test trials.As for the U.S., we’re full steam ahead, or should I say going at “warp speed.” Here’s what Peter Navarro, White House Director of Trade and Manufacturing Policy told me this week: “Operation warp speed is going to deliver the hundreds of millions of vaccine doses we're going to need. When you do vaccine development, things happen in sequences. What warp speed is doing is instead of doing a sequence, they're doing these things simultaneously. So that if one of the five or six vaccine developers comes up with what we need, we will have already been able to produce that. The worst thing that can happen if the vaccine doesn't work is we'll have too much capacity. But we won't be in a situation where we have too little. Sure we've got really significant challenges ahead. But am I pessimistic? No. I'm optimistic.” (Yes, later in the interview Navarro, as he is wont, referred to COVID-19 as ‘the China virus.’)If billions of dollars sounds like a ton of money for a vaccine, consider how much the coronavirus will cost the U.S. (never mind the rest of the world), $8 trillion on lost economic activity.Interestingly MIT’s Sharp was most concerned about this economic fallout: “I'm personally in the long term concerned about the economic displacement,” Sharp told me. “I think that's going to be very consequential. I hope not. But if we have unemployment at 10% at the end of the year, it'll make this virus infection seem trivial.”Question: Would we have been in better shape if we hadn’t defunded a few billion of vaccine research and preparation over the past few years? Answer: What do you think?You might assume the process of finding a vaccine is an organized, orderly process, and in some senses it is, especially internally in terms of each project. Holistically though, this finding of a vaccine has more the hallmarks of a horse race—not that there is anything necessarily wrong with that.The competition amongst countries, projects and companies to create a viable product is intense, but it’s important to note that because there can be more than one vaccine, there is no prize for first, just for efficacy and ability to scale. (For instance, the CDC website lists eight different vaccines for the flu this past winter, made by three different companies; Sanofi, Seqirus and GlaxoSmithKline.)And so how goes the quest for a COVID-19 vaccine? “I’m cautiously optimistic,” says Dan Barouch, a noted vaccine expert, physician, immunologist, virologist and professor of medicine at Harvard Medical School. Barouch is working in conjunction with Johnson & Johnson’s vaccine project which this week announced it was moving up the start of human clinical trials from September to July.“I can say that the breadth of technologies that are being explored, as well as the breadth of companies and expertise that are being deployed for vaccine development certainly increases my optimism that some of them will be successful,” says Barouch. “There's enough in the pipeline.”Barouch recently performed studies which he said “established two scientific conclusions, number one... there really is natural protective immunity [from COVID], and number two, that we can induce and define vaccine-induced immunity. Those findings are basic science and we hope are useful to not just our program with J&J but the entire global vaccine effort.”Barouch’s vaccine is a so-called viral vector vaccine, based on a common cold virus, which he had developed earlier working on HIV. If it is successful against COVID-19, J&J has pledged to produce a billion doses.Barouch’s work is promising, but Merck and Sanofi have experience here too and while Moderna and AstraZeneca have lesser track records here, their projects also have promise.Scientist works in the lab at Moderna in Cambridge, MA. (Photo by David L. Ryan/The Boston Globe via Getty Images)The point is it’s nearly impossible to keep up with all 135 vaccine projects, nevermind therapeutics, but that hasn’t stopped investors from bidding up these stocks this year, as Yahoo Finance’s Anjalee Khemlani has been reporting.To give you an idea, according to CBS News “the market value for the eight biotech companies in the S&P 500-stock index has swelled $130 billion to just over $600 billion. The total value of a half-dozen smaller biotechs outside the S&P 500 that are also working on coronavirus treatments or vaccines has grown to more than $40 billion,” since mid-March.And of course there are all sorts of biotech mutual funds—from Fidelity, Live Oak, T. Rowe and Janus Henderson—and ETFs—by VanEck, iShares and Virtus.“My advice to people is be very careful,” says Moira Gunn, a professor at the University of San Francisco focused on the biotech business and a former NASA scientist. “For every nine drugs which enter phase one, only one makes it all the way through and is a success out of phase three to become a registered commercial product. It takes normally [many] years for that. There’s a lot of money to be made. But also, money to be lost.”It also could be the case for instance that a successful vaccine is made by one of the large pharma companies but it doesn’t move the stock because the incremental revenue isn’t consequential. Also vaccines are binary. Meaning they are all or nothing plays. That screams high risk.“The vaccine business is extremely tough,” says Aydin Huseynov, a biotech stock analyst at Benchmark. “The bar for safety is extremely high. Cancer drugs can have suboptimal effects because cancer patients in the later stages have limited mortality, only a few months to live. But with a vaccine you need an extremely safe product, and quantities for a large population.”That large population point came up in a conversation I had with Michael Dell this week. “I guess I'm feeling a little more optimistic,” he told me. “There are issues of how we protect the vulnerable populations. The interesting thing about this, one can assume that at the end, whatever that is, you know, the case count is 7.5 billion. In other words, everyone will either get the virus or they will get a vaccine. And we just don't know when that is.”Hey Michael Dell, a noted scientist agrees with you!“I think it'll take herd immunity to definitively end the pandemic,” Barouch says. “Herd immunity can be generated in two ways. One way is that the majority of people get infected. And the other is that the majority of people get vaccinated.“The best outcome is that there are multiple vaccines that can be mass produced and are eventually delivered. The number of people that will need to be vaccinated is a very large number and I don't think that any single vaccine will be able to do it. We need multiple vaccines to be successful.”So we should be rooting for any number of those 135 projects.And after that, if and when we do defeat COVID-19, we need to keep our guard up.Consider this from the late Nobel Prize-winning biologist Joshua Lederberg (in a profile of Tony Fauci in The New Yorker by Michael Specter): “Some people think I am being hysterical, but there are catastrophes ahead,” he once wrote. “We live in evolutionary competition with microbes—bacteria and viruses. There is no guarantee that we will be the survivors.”In other words, we either spend billions now, or uncountable trillions later.This article was featured in a Saturday edition of the Morning Brief on June 13, 2020. Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAndy Serwer is editor-in-chief of Yahoo Finance. Follow him on Twitter: @serwer.Read the latest financial and business news from Yahoo FinanceRead moreHow this week changed America foreverWhat America can learn about reopening from the state of MaineWhat will everything look like after the coronavirusHere’s how the coronavirus divides usThe crazy story of Purell and the coronavirusThree important forces, working in concert, we can't controlWhat will the coronavirus do to cruise ships"}]}