{"article": [{"url": "https://finance.yahoo.com/news/why-stocks-dont-seem-worried-about-surge-in-covid-cases-morning-brief-100624553.html", "published": 1594098860.0, "headline": "Why stocks don't seem worried about the surge in COVID cases: Morning Brief", "body": "Tuesday, July 7, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeIt’s not all bad for U.S. stocksOn Monday, the U.S. stock market continued to power higher.The Nasdaq hit a record high to start the week, with this push to record highs coming as COVID case counts hit a record ahead of the holiday weekend and show little let-up in hard hit states like Florida, Arizona, and California.All of which has strategists across Wall Street offering different answers to the same question: why is the market going up while the pandemic gets worse?In an email on Monday, Renaissance Macro’s Neil Dutta offered three potential answers — more fiscal support, the rest of the world doing a better job containing the virus, and positive expectations regarding vaccine development. Dutta was among the first strategists to call out a likely bottom in economic data back in April.And while we’ve written in recent weeks about why fiscal support is so essential for keeping this nascent recovery going, Dutta’s suggestion that the rest of the world’s success in containing the virus is a driver for the market is an idea we’ve not seen widely broadcast.And it should not be overlooked by investors — data from FactSet reminds us that 40% of S&P 500 revenues come from abroad.Members of the S&P 500 get more than 40% of their revenue from overseas, suggesting that successful measures to contain the pandemic abroad may be in part fueling optimism about the U.S. stock market. (Source: FactSet)Over at UBS, Mark Haefele, CIO for global wealth management, offered a similar framework to Dutta, arguing that a better-prepared health care system, continued central bank support, and resilient economic data are all bolstering financial markets right now.And indeed, on Monday the Institute for Supply Management’s gauge on activity in the non-manufacturing sector showed June’s reading recorded the largest monthly increase on record.Economists cautioned, however, that this data flatters the likely progress of the recovery, which appears to be leveling out after a swift rebound from depressed levels in the spring.Oxford Economics said Monday that the ISM report is “encouraging as businesses are getting back to work despite prevailing uncertainties.” Though the firm added that it believes, “the recovery will progress at a slower pace compared to this initial, snap-back phase. The concerning trajectory of the virus in recent weeks will be the key impediment constraining the recovery as many states have now paused or rolled back their reopening plans due to a spike in cases.”Story continuesCapital Economics’ Paul Ashworth said Monday that, “The easing of the lockdowns has generated a bigger rebound in spending in May and June than we were originally anticipating but, given the resurgence in coronavirus infections, the pace of recovery is likely to be slower in the second half of the year.”Another driver for the market might simply be the factor that underwrites much of any single stock’s long-term gains — earnings.Morgan Stanley equity strategist Mike Wilson wrote Sunday that while it is well-known the stock market is anticipating a snapback in economic activity, there is also a potential earnings boom on the horizon.“Cautious investors may be overlooking the potential for operating leverage to fuel an earnings rebound,” Wilson writes. “Aggressive cost-cutting in a downturn is what creates the powerful operating leverage when the economy recovers.”Wilson notes that with labor serving as the top cost for companies and the labor market currently experiencing a dislocation of unprecedented proportions, a rise in operating leverage “could be particularly explosive this time as the economy, and sales, recover.”Of course, if tens of millions of Americans are out of work, the ultimate health of the economy and in turn corporate profits will likely be hindered. But Wilson argues that corporate health last year was on the decline as businesses saw heightened competition for customers, workers, and growth. The pandemic may just have pulled forward and accelerated an expected cycle of corporate retrenchment.“Negative operating leverage was key to our earnings recession call [last year],” Wilson writes.“It’s also a classic feature of late-cycle economic expansions. My point is that many companies were already exhibiting negative operating leverage pre-COVID-19. This gives me confidence that 2Q will likely be the trough for earnings growth.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy10 a.m. ET: JOLTS Job Openings, May (4.5 million expected, 5.046 million in April)Earnings4:15 p.m. ET: Levi’s (LEVI) is expected to report an adjusted loss per share of 48 cents on $519.29 million in revenueREAD MORETop NewsOECD adds risk of COVID-19 'double-hit' in bleak economic forecasts [Yahoo Finance]Google, Facebook, Microsoft pause Hong Kong data requests [Bloomberg]Tesla adds $14 billion a day to its valuation [Bloomberg]Palantir moves toward stock listing with confidential filing [Bloomberg]YAHOO FINANCE HIGHLIGHTSRising coronavirus cases threaten the already shaky recovery for America's restaurants‘This is getting out of control,’ says infectious disease expert about coronavirus 'Hamilton' delivers 64% download bump for Disney+—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}