{"article": [{"url": "https://finance.yahoo.com/news/apple-tesla-bid-ahead-share-110254150.html", "published": 1598854220.0, "headline": "Apple and Tesla shares surge after stock splits kick in", "body": "By Noel Randewich and Subrat Patnaik(Reuters) - High-flying shares of Apple Inc <AAPL.O> and Tesla Inc <TSLA.O> surged again on Monday as stock splits took effect and attracted more buying from investors.Apple jumped over 4% and Tesla rallied 10%, elevating the electric car maker's market capitalization to over $440 billion, making it more valuable than companies including Walmart <WMT.N> and Johnson & Johnson <JNJ.N>.Apple split its stock 4-for-1, while Tesla split its stock 5-for-1, with both companies saying they aimed to make their shares more affordable to individual investors.Robinhood and other brokerages increasingly let customers buy fractions of individual shares, making the benefit of stock splits less obvious than in the past. Splits have become less common. Just three S&P 500 members announced splits in 2020, down from 12 in 2011, according to S&P Dow Jones Indices.The success of the splits for Apple and Tesla could lead CEOs of other companies with high-priced stocks to consider their own splits.Stock splits an endangered species on Wall Street https://graphics.reuters.com/APPLE-RESULTS/SPLIT/yxmvjrjgevr/chart.pngBoth Silicon Valley companies have massive followings among individual investors. In recent sessions, Apple and Tesla were the two most-traded stocks at Fidelity's brokerage, with customers overwhelmingly buying.Tesla's stock has surged over 70% since its split was announced on Aug. 11. Apple has jumped over 30% since it announced its split on July 30, along with a blowout quarterly report.Trading at over $2,000 on Friday on a split-adjusted basis, Tesla's stock had among the highest price tags on Wall Street. Other companies with quadruple-digit stock prices included Amazon <AMZN.O>, at over $3,400, Google-parent Alphabet <GOOGL.O>, at over $1,600, and Chipotle Mexican Grill <CMG.N>, trading at over $1,300.Apple's previous stock split was 7-for-1 in 2014, and this month's split was its fifth since going public in 1980.Story continuesApple and Tesla's share splits applied to shareholders of record on Aug. 24.Apple's market capitalization has surged above $2 trillion, and it overtook Saudi Aramco <2222.SE> as the world's most valuable publicly listed company.Tesla's stock has jumped almost 500% this year, while shares of General Motors Co <GM.N> and Ford Motor Co <F.N> fell due to fallout from the COVID-19 pandemic.(Reporting by San Francisco and Subrat Patnaik in Bengaluru; Editing by David Gregorio)"}]}