{"article": [{"url": "https://finance.yahoo.com/news/telecom-giants-race-to-bundle-streaming-apps-with-cell-plans-141008825.html", "published": 1597742300.0, "headline": "Telecom giants race to bundle streaming apps with cell plans", "body": "The television streaming wars have fully infiltrated your cellphone plan.On Aug. 17, Verizon (parent company of Yahoo Finance) announced a major extension of its partnership with Disney: some Verizon Wireless plans now include subscriptions to ESPN+ and Hulu (which is fully owned by Disney as of last year) along with Disney+, which Verizon began offering in some of its plans when Disney+ launched last November.The news is more significant than just Verizon (VZ) and Disney (DIS) getting cozier. It’s the latest sign that bundling streaming apps with cell service is becoming table stakes for big telecoms.AT&T (T) now includes HBO Max in its Unlimited wireless plans. T-Mobile since 2017 has offered its subscribers “Netflix on us,” and has made the Netflix (NFLX) bundle a central part of its TV advertising. But Verizon has upped the ante by offering the full suite of Disney streaming apps, putting new pressure on the other telecoms to sweeten their bundles. (And AT&T owns HBO Max, so it’s not quite the same as Verizon’s pact with Disney, or T-Mobile’s with Netflix.)NEW YORK CITY, UNITED STATES - 2020/02/20: American multinational telecommunications conglomerate, Verizon store logo seen in Midtown Manhattan. (Photo Illustration by Alex Tai/SOPA Images/LightRocket via Getty Images)The bundling is beneficial to both telecom and streamer, but there is also a potential drawback: subscribers receiving the streaming app for free with their cell plan might drop off when the free trial ends. Disney Chairman Bob Iger said on an earnings call in February that 20% of Disney+ subscribers came from the Verizon bundle—will all of those subscribers stick around when their first free year is up? (Disney said earlier this month that Disney+ now has 60.5 million subscribers.)One obvious exception to the new telecom-streamer marriage is Amazon.You don’t see any cell providers offering Amazon Prime Video for free, and you won’t: Amazon (AMZN) still uses Prime Video to juice subscriptions for Prime (150 million subscribers as of January), and it doesn’t need to give away Prime. The company does offer a Prime Video-only subscription for $9 a month, but doesn’t break out how many subscribers choose that option, and it’s likely negligible, since the appeal of Prime is the free shipping, and Video is viewed as an added bonus to that core Prime product.Story continuesIn a research note on Monday, Needham attempted to estimate the value of Prime and Prime Video, and concluded that Amazon Prime subscriptions are worth $200 billion (or about 13% of Amazon’s total market cap right now), and Prime Video on its own is worth $40 billion (merely 2.6% of Amazon’s market cap). Needham also cites a survey conducted by The Diffusion Group that concluded 80% of Prime subscribers pay for Prime primarily for the free shipping benefit, while just 20% pay for Prime for the media assets, like Prime Video, Twitch, or Amazon Music.Attendees visit the Disney+ streaming service booth at the D23 Expo, billed as the \"largest Disney fan event in the world,\" on August 23, 2019 at the Anaheim Convention Center in Anaheim, California. (ROBYN BECK/AFP via Getty Images)Prime Video has been the No. 2 most popular streaming platform during the pandemic, Needham finds, second only to Netflix. But because Amazon’s own bundle includes so much, it’s hard to compare Prime Video to Netflix, Hulu, Disney+ and the others in an apples-to-apples comparison.Apple, it appears, will soon be a better comparison to Amazon Prime, as Apple is reportedly preparing to offer a bundle that includes its TV, fitness, music, news, and gaming services.Of course, this game is far from winner-take-all: a Verizon Wireless customer who is happy to get the Disney streaming apps might also want Amazon Prime, and might also want some of those Apple services.So the chief question in the streaming wars will soon shift from: “How many different apps is the American TV viewer willing to pay for?” to “How many bundles?”—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers streaming media. Follow him on Twitter at @readDanwrite.Read more:Disney's $30 'Mulan' streaming plan will be litmus test for entire film industryAs live sports return to TV, so do DraftKings and FanDuel adsDisney's 'Mulan' will look to Christopher Nolan's 'Tenet' as a movie theater health testCoronavirus is forcing Quibi, NBC Peacock to change their plans at launch'Trolls World Tour' rental success does not spell death for movie theatersMovie theaters seek bailout as coronavirus devastates business"}]}