{"article": [{"url": "https://finance.yahoo.com/news/birthday-warren-buffett-one-of-the-investing-legends-best-tips-131243749.html", "published": 1598775620.0, "headline": "Happy birthday, Warren Buffett: One of the investing legend's best tips", "body": "Berkshire Hathaway’s Warren Buffett is known to have dropped a few tips on life, business and stocks in an existence that will have spanned 90 years on Sunday.But for long-time Berkshire shareholder Bill Smead of Smead Capital Management, it’s Buffett’s insights into the process of successful investing that have proven most impactful.“Buying good quality securities when people are scared to death and being greedy when others are fearful [are some of Buffett’s best investing lessons],” Smead — a long-time value investor — told Yahoo Finance’s The First Trade.Smead said he has taken Buffett’s advice recently and scooped up shares of cosmetics seller Ulta Beauty. Shares of Ulta are down 27% on the year as people work from home and consume less makeup. The company has also battled through closures of its mall-based stores.But with sales showing signs of life in the second quarter as Ulta reopened stores and employed curbside pick-up, Smead may have gotten in at a good price — all thanks to a bit of Buffett investing wisdom.“We’re off to a pretty good start with it. It’s a pretty wonderful business,” Smead said. “I don’t think that people are not going to want to put their makeup on.”Widely regarded as the Oracle of Omaha, Buffett has made himself into a household name by adhering to strict investing discipline on buying stocks and entire companies. Only until recently, has Buffett waded into the hotter sectors of the market — amassing an impressive position in Apple that has yielded tremendous returns.Buffett is now the sixth wealthiest person in the world with a fortune of $82.2 billion.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}