{"article": [{"url": "https://finance.yahoo.com/news/michael-dell-not-enough-progress-on-diversity-in-the-tech-industry-122022270.html", "published": 1591860500.0, "headline": "Michael Dell: ‘Not enough’ progress on diversity in the tech industry", "body": "Michael Dell, the founder and CEO of Dell Technologies (DELL), told Yahoo Finance on Tuesday that the tech industry has failed to adequately address the lack of diversity in its workforce.“While there's been some progress,” he says. “It's not enough.”The police killing of George Floyd in Minneapolis last month elicited statements denouncing racial inequality from major corporations and chief executives throughout the sector, including Facebook (FB) CEO Mark Zuckerberg, Amazon (AMZN) CEO Jeff Bezos, and Twitter (TWTR) CEO Jack Dorsey — all of whom, like Dell, are white men.Dell said the lack of diversity continues to pervade tech companies, noting that just about every business in the field has fallen short in hiring people from underrepresented groups.“We can look across lots of organizations and it's not clear that anybody has really broken through,” he adds. “It remains work to be done for everyone.”Asked if prominent CEOs need to be a part of the solution, Dell says, “We’ve got a role to play for sure.”Last year, black people made up 9% of workers in core information-technology occupations in the U.S., up slightly from 8% in 2015 and 7% in 2010, according to an analysis of U.S. Bureau of Labor Statistics published by MarketWatch.Only 4.9% of Dell employees in the U.S. last year were black, and just 7.7% were Hispanic or Latino, according to the company’s diversity report. In technical positions, the share of black employees at the Rock Round, Texas–based company drops to 4.2%; and in management positions, the proportion of black employees falls to 2.9%, the report says.Nearly all of the company’s board of directors and C-suite officers are white. The company’s chief diversity & inclusion officer, Brian Reaves, is black.“We have for a long time embraced diversity inside our company,” Dell says. “Not saying we're perfect at it, but I think we've created the conditions for success and in a bit of a silver lining, I think this has opened up the conversation in a new way.”Story continuesMichael Dell, chairman and CEO of Dell Technologies, appears on \"Influencers with Andy Serwer.\"Dell made the remarks in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.At age 19, Dell founded his first business called PC’s Limited. He renamed the company Dell Computer Corporation and took it public four years later. Today, the company has a market cap of over $36 billion.Dell expressed skepticism about the effectiveness of public sector solutions to racial inequality, arguing instead that businesses need to tackle the problem.“Ultimately, I'll just say I'm not real optimistic that government forces are going to drive the change here,” he says. “I think it's going to be up to companies to create the conditions and the opportunities for success for the communities that have not had them.”“Recent incidents have kind of redoubled our resolve around the goals that we've had,” he says. “Hopefully that will lead to positive change for communities of color.”Read more:U.S. needs 'cultural transformation' after George Floyd's death: Chase KochVenture firm is a 'win-win' for Koch Industries and company founders: Chase KochMelinda Gates: Some governors are ‘moving too fast’ to reopen their states‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}