{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-surge-doctor-deaths-193439614.html", "published": 1593528140.0, "headline": "LA doctor on coronavirus surge: 'There's going to be a lot of death coming'", "body": "The surge in coronavirus cases across the U.S. is worrying many health officials and state leaders, so much so that many governors are undoing some of their phased re-openings to contain further spread.“For the winter, there’s concern,” Dr. Jennifer Ellice, an ER physician based out of the Los Angeles area, said on Yahoo Finance’s The First Trade (video above). “But I’m also just concerned for the next couple of weeks because we know that’s our lagging indicator. From what I’m seeing right now, I think that unfortunately there’s going to be a lot of death coming.”With the relaxing of the coronavirus disease (COVID-19) restrictions, visitors crowd the boardwalk on Memorial Day weekend in Ocean City, Maryland, U.S., May 23, 2020. REUTERS/Kevin LamarqueOnly two states — Connecticut and Rhode Island — that reported a decline in the number of coronavirus cases last week. And on Friday, the U.S. reported over 40,000 infections, the highest number of new cases in a day.Dr. Anthony Fauci, director of the National Institute for Allergy and Infectious Diseases (NIAID), spoke of the troubling trend during a Senate committee hearing on Tuesday, stating: “I would not be surprised if we go up to 100,000 [new cases] a day if this does not turn around.”Coronavirus cases are increasing in the Sun Belt region. (Graphic: David Foster/Yahoo Finance)‘It never really went away for us’While some countries that were once major coronavirus hot spots have since been able to begin to flatten the curve, the U.S. has been unable to do so.The U.S. is still the global leader in the number of coronavirus cases and deaths. Part of it is attributed to the fact that many states reopened their economies and lifted stay-at-home restrictions too quickly.“What we’re seeing right now is an enormous number of it coming back,” Ellice said. “We’re starting to see people coming in again with what we know to be the beginnings of another big surge.”Coronavirus cases are surging in many parts of the world. (Graphic: David Foster/Yahoo Finance)California, where Dr. Ellice is based, is one of the states seeing a significant increase in the number of cases.“It never really went away for us in Los Angeles County,” she said. “We had been a hot spot throughout but I think the rest of the state had maybe started to think that the worst was behind them, but starting about a week ago, we began to see some cases trickling in and then it started to look more and more like the early days of March.”Story continuesMany of these spikes are being attributed to Memorial Day weekend activities, during which crowds assembled throughout that weekend.COCOA BEACH, FL - MAY 23: Cocoa Beach was crowded on Memorial Day weekend.. (Photo by Jonathan Newton/The Washington Post via Getty Images)As a result, some hospitals across the country are on the verge of reaching capacity in terms of available beds, especially in their ICUs, along with a shortage of ventilators. At Ellice’s hospital, there are enough ventilators for now but still a lot of worry.“In Los Angeles and in California, there’s some concern about one of our counties — Imperial County — being overwhelmed,” Ellice said. “Our hospital system that I work in, we’ve been able in the past to move patients around in order to accommodate as we had surges in different areas. What’s a little bit concerning right now for the entire state and for the entire country is that with the recent openings and elective surgeries going on, this is going to be a little bit more of a challenge than perhaps the beginning of the first wave in March.”The vaccine realitySome states are in more trouble than othhers.Florida is reporting its highest daily case count ever, while Houston is quickly running out of beds. Although many of these places had begun resuming elective surgeries, Ellice said those will likely be under review again, particularly since the hospitals can move patients around.“ICU beds can be extended,” she said. “Ventilators can be extended and moved around from place to place. But staffing is difficult and especially as some of us become ill from treating these patients, it becomes a challenge in the sense that if we’re continuing to operate as normal and doing elective procedures, then there are going to be fewer and fewer resources available to treat these patients. So I anticipate that will probably be re-examined going forward.”Radiation therapists Jessica Penney, left, and Jennifer Campbell, right, prepare cancer patient Kenton Fabrick for his treatment in the Radiation Oncology Department at Brigham and Women's Hospital in Boston, MA on on June 10, 2020. (Photo by Craig F. Walker/The Boston Globe via Getty Images)And while there is hope for a coronavirus vaccine to be created, Ellice isn’t so sure it will be a reality to have one ready by next year.And “given that once all the clinical trials are completed, there’s also the question of distribution and acceptance,” she said. “These are formidable challenges in and of themselves. Even if we had a vaccine right now, ramping up production and distribution would be formidable. I’ve seen a lot of folks say we’re going to have a vaccine next year, and I think that’s very optimistic.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:U.S. nursing homes face 'a crisis on top of a crisis' with coronavirus and funding woesPrimary care doctor: 'We should all be very worried' about plunging patient visits amid pandemicAmericans 'are paying the price' for shoddy coronavirus response, doctor saysRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}