{"article": [{"url": "https://finance.yahoo.com/news/fed-jerome-powell-coronavirus-economy-worst-over-morning-brief-100905127.html", "published": 1591852640.0, "headline": "The Fed suggests the worst of this crisis is over: Morning Brief", "body": "Thursday, June 11, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeBut that the road to recovery remains very long and challenging.For over a month now, we’ve heard from economists and strategists that the worst of the pandemic-induced economic downturn may be over.And the Federal Reserve on Wednesday said that they, too, see this as a possibility.“The coronavirus outbreak is causing tremendous human and economic hardship across the United States and around the world,” the Fed said in its latest policy statement published Wednesday. “The virus and the measures taken to protect public health have induced sharp declines in economic activity and a surge in job losses.” (Emphasis added.)In April, the Fed’s statement read: “The virus and the measures taken to protect public health are inducing sharp declines in economic activity and a surge in job losses.” (Emphasis added.)This shift in tense — flagged by Luke Kawa on Twitter — signals that the Fed sees the most acute phase of the crisis as likely having passed.“In recent weeks, some indicators suggest a stabilization or even a modest rebound in some segments of the economy,” Powell said Wednesday. Though as Powell elaborated during a nearly hour-long press conference Wednesday afternoon, this stabilization isn’t anything resembling an “all clear” for the U.S. economy.“The extent of the downturn and the pace of recovery remain extraordinarily uncertain and will depend in large part on our success in containing the virus,” Powell added. “We all want to get back to normal, but a full recovery is unlikely to occur until people are confident that it is safe to reengage in a broad range of activities.”On Wednesday, the Fed’s latest interest rate forecasts suggested there will be no interest rate hikes until 2023 at the earliest, a sign that anything resembling a “full recovery” in the economy is several years off.Additionally, outlooks for GDP and unemployment suggested the economy will contract by 6.5% this year with unemployment remaining above 9% through year-end.Story continuesAnd as Powell said, the outlook is “extraordinarily uncertain” given volatility in the data, with the Fed chair specifically citing the May jobs report as an example of how uncertain pinning down progress in the economy remains. A re-emergence of the virus or a failure by Congress to continue supporting consumers and small businesses also pose considerable risks to the outlook.Ian Shepherdson, chief economist at Pantheon Macroeconomics, also highlighted in a note Wednesday that the Fed’s “median forecasts seem reasonable to us, if the median underpinning assumption is that a vaccine is widely available before the middle of next year.”With Shepherdson adding that, “If not, all bets on the speed of the recovery are off.”An outlook well inline with the view set forth by Powell on Wednesday.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: PPI Final Demand month-on-month, May (+0.1% expected, -1.3% in April); PPI excluding Food & Energy month-on-month, May (-0.1% expected, -0.3% in April); PPI Final Demand year-on-year, May (-1.3% expected, -1.2% in April)8:30 a.m. ET: Initial Jobless Claims, week ending June 6 (1.55 million expected, 1.88 million prior)8:30 a.m. ET: Continuing Claims, week ending May 30 (20.6 million expected, 21.49 million prior)9:45 a.m. ET: Bloomberg Consumer Comfort, week ending June 7 (37.0 prior)EarningsPre-marketNotable reports: Children’s Place (PLCE)Post-market4:05 p.m. ET: Adobe (ADBE) is expected to report earnings of $2.33 per share on $3.17 billion in revenue4:05 p.m. ET: Lululemon (LULU) is expected to report earnings of 28 cents per share on $724.78 million in revenueOther notable reports: Dave & Buster’s (PLAY), PVH Corp (PVH)READ MORETop NewsFILE - In this April 4, 2014 file photo, a sign for GrubHub is displayed on the door to a New York restaurant. The owner of KFC and Taco Bell, is teaming up with Grubhub to expand its delivery business. Yum Brands said Thursday, Feb. 8, 2018, that Grubhub will run KFC and Taco Bell delivery and online ordering in the United States. GrubHub will provide delivery people and its technology.(AP Photo/Mark Lennihan, File)Just Eat beats Uber to snap up Grubhub for $7.3 billion [Yahoo Finance UK]Tyson Foods says cooperating with DoJ in chicken price-fixing probe [Reuters]Amazon bans police use of its face recognition for a year [AP]Mnuchin 'definitely' thinks more economic relief will be needed [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and moreStarbucks acknowledges a harsh reality about life after COVID-19Kareem Abdul-Jabbar: ‘The NFL got on the right side of history’—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}