{"article": [{"url": "https://finance.yahoo.com/news/covid-19-outbreak-hard-hit-155540966.html", "published": 1595934200.0, "headline": "COVID-19 outbreak in hard-hit U.S. states may be peaking, Fauci says", "body": "By Susan HeaveyWASHINGTON, July 28 (Reuters) - A coronavirus surge in Florida, California and a handful of other hard-hit states could be peaking while other parts of the country may be on the cusp of growing outbreaks, the top U.S. infectious diseases official said on Tuesday.A spike in cases in Florida, along with Texas, Arizona and California this month has overwhelmed hospitals, forced a U-turn on steps to reopen economies and stoked fears that U.S. efforts to control the outbreak are sputtering.\"They may be cresting and coming back down,\" Dr. Anthony Fauci, head of the U.S. National Institute of Allergy and Infectious Diseases, told ABC's \"Good Morning America\" program regarding the state of the outbreak in several Sunbelt states.Fauci said there was a \"very early indication\" that the percentage of coronavirus tests that were positive was starting to rise in other states, such as Ohio, Indiana, Tennessee and Kentucky.\"That's a surefire sign that you've got to be careful.\"He urged the states with rising positivity rates to act quickly now to prevent a surge and other states to reopen carefully following guidelines established by U.S. officials and health experts.Fauci has become a lightning rod for some supporters of President Donald Trump who accuse the 79-year-old health official of exaggerating the extent and severity of the U.S. outbreak and playing down possible treatments.Trump, who is seeking a second term in the White House in the Nov. 3 election, retweeted a post accusing Fauci and Democrats of suppressing the use of the drug hydroxychloroquine to treat the virus. The post included a link to a video of a group discounting the need for face masks.A Twitter spokesman confirmed that tweets with the video were in violation of the company's COVID-19 misinformation policy, and the tweets shared by Trump were deleted.In his interview with ABC, Fauci defended his work to protect Americans' health.\"I have not been misleading the American public under any circumstances,\" he said.Story continuesRISING TOLLThe number of people in the United States who have died of COVID-19, the respiratory illness caused by the novel coronavirus, rose to 148,446 on Monday, with more than 4.3 million confirmed cases, according to the latest Reuters tally.Florida had 191 coronavirus deaths in the last 24 hours, the highest single-day increase since the start of the epidemic, its state health department reported on Tuesday.Texas became the fourth state with more than 400,000 total cases, joining California, Florida and New York in the grim club. But in a glimmer of hope, Texas' current hospitalizations due to COVID-19 fell on Monday, according to its state health department.The rise in deaths and infections has dampened early hopes that the country was past the worst of the economic fallout in March and April when lockdowns brought business activity to a near standstill and put millions out of work.The U.S. Congress on Tuesday was locked in difficult talks over another coronavirus aid package to help American families and businesses recover from the crisis.In late March, as the economy was beginning to crater, Congress passed a $2.3 trillion stimulus package that included enhanced unemployment benefits to blunt the pain of lockdowns that were being adopted to stop the spread of the coronavirus.Senate Republicans announced on Monday a $1 trillion coronavirus aid package hammered out with the White House, which Senate Majority Leader Mitch McConnell touted as a \"tailored and targeted\" plan to reopen schools and businesses, while protecting companies from lawsuits.But the proposal sparked immediate opposition from both Democrats and Republicans. Democrats decried it as too limited compared with their $3 trillion proposal that passed the House of Representatives in May. Some Republicans called that one too expensive.The Republican proposal would give many Americans direct payments of $1,200 each, provide billions in loans to small businesses and help schools reopen. But it would slash the current expanded unemployment benefit from $600 per week in addition to state unemployment to $200 per week. The enhanced unemployment benefit expires on Friday.The supplemental benefit has been a financial lifeline for laid-off workers and a key support for consumer spending.(Reporting by Susan Heavey, Daniel Trotta, Patricia Zengerle and Lisa Shumaker Writing by Paul Simao Editing by Howard Goller)"}]}