{"article": [{"url": "https://finance.yahoo.com/news/5-rookie-mistakes-investors-make-hedge-fund-veteran-202044782.html", "published": 1597678100.0, "headline": "5 rookie mistakes investors make: hedge fund veteran", "body": "It’s been a wild year for investors, with a stunning 30% drop in the S&P 500 (^GSPC) — and then a rise back to the all-time high we saw right before the Covid crisis took hold in investors’ thinking.Since March, there’s been a flood of new investors getting into the market, joining investing apps Robinhood, TD Ameritrade, Schwab, and others — and retail investors have actually managed to capture many of the gains as the market surged back its March lows.Datatrek’s Nicholas Colas, an industry expert and hedge fund veteran of SAC Capital, recently outlined 10 rookie investor mistakes in his daily newsletter — mistakes he’s made himself and seen done often by others during his 30+ years of experience.“Three-star Michelin chefs still burn themselves, and master carpenters will occasionally hammer their own thumbs,” he wrote. “It happens.”But understanding them can help repeat pitfalls. Here are a few from Colas’s list.1. Plan before, not during a crisisThis is pretty much Planning 101 for anyone and anything, but Colas notes that many investors don’t plan their downturn moves until they’re in it. Mike Tyson’s “everybody has a plan until they get punched in the face” truism aside, having a winning approach — Colas’s is buy every 5% or more drop during a crisis — has worked well so far for the last two crises.2. The stock’s price changed for a reasonColas noticed that a lot of people attribute stock price changes to “general market action.” Colas says hedge fund manager Steve Cohen taught him that there is always a reason, and the real question is whether it's worthwhile to find out, because that takes precious time.Goldene Symbolfiguren auf Finanzzeitung3. Policymakers play by their own rulesDuring the beginning of the coronavirus crisis, the Fed and the government did things they have never done before in terms of providing financial relief and stimulus for the markets, businesses and individuals. Colas notes that it’s a rookie mistake when people say “they can’t do that!” They sure can — and watch them.Story continues4. Valuations don’t matter\"Math is not an investment edge,\" Colas said Steve Cohen used to say. Everyone knows stock valuations, which are public. The important part is \"why\" it's cheap or expensive and \"how\" that changes.5. Misunderstanding time framesTwo of Colas’s mistakes can be combined because they both involve misguided thinking about time frames. A lot of people say things like “this won’t end well,” and Colas points out that bad endings are usually just a potential starting point. (Obviously, in cases like Enron, that’s not true necessarily.)The other mistake is using the wrong time frame of historical comparison – when people look at charts that don’t match their particular investing needs, like a yearly chart of Amazon stock when you’re considering investing for a decade or more.“A senior Fidelity money manager in the early 1990s taught me a trick I use to this day,” wrote Colas. “Only look at charts where the time period shown matches your holding period. If you plan to hold US equities for 20 years, look at a 20-year chart.”There’s many more rookie mistakes past those on Colas’s list, and Liz Ann Sonders, Charles Schwab Senior Vice President & Chief Investment Strategist, explained what she sees as the “biggest mistake investors can make,” while speaking to Yahoo Finance. The mistake: taking an “all or nothing” approach, getting in and getting out.“Investing should never be about a moment in time, that’s gambling,” she said. “It’s a process over time.”Sonders added that investors — potentially the new retail investors buying tech stocks — should understand that there’s no need to find the best time to exit those positions, but rather rebalance over time to keep exposure where it should be for their individual circumstances.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Most companies plan to give raises and bonuses in 2021: surveyThe key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right nowRetail investors have seen huge gains as S&P 500 nears pre-pandemic highCompany matches are mostly surviving the coronavirusThere are two types of stocks on RobinhoodWhy you should consider deleting your stock trading app"}]}