{"article": [{"url": "https://finance.yahoo.com/news/exclusive-china-rather-see-tiktok-172245667.html", "published": 1599827420.0, "headline": "Exclusive: China would rather see TikTok U.S. close than a forced sale", "body": "By Keith Zhai, Yingzhi Yang and Julie Zhu(Reuters) - Beijing opposes a forced sale of TikTok's U.S. operations by its Chinese owner ByteDance, and would prefer to see the short video app shut down in the United States, three people with direct knowledge of the matter said on Friday.ByteDance has been in talks to sell TikTok's U.S. business to potential buyers including Microsoft <MSFT.O> and Oracle <ORCL.N> since U.S. President Donald Trump threatened last month to ban the service if it was not sold.Trump has given ByteDance a deadline of mid September to finalise a deal.However, Chinese officials believe a forced sale would make both ByteDance and China appear weak in the face of pressure from Washington, the sources said, speaking on condition of anonymity given the sensitivity of the situation.ByteDance said in a statement to Reuters that the Chinese government had never suggested to it that it should shut down TikTok in the United States or in any other markets.Two of the sources said China was willing to use revisions it made to a technology exports list on Aug. 28 to delay any deal reached by ByteDance, if it had to.China's State Council Information Office and its foreign and commerce ministries did not immediately respond to requests for comment sent after working hours.Asked on Friday about Trump and TikTok, Chinese foreign ministry spokesman Zhao Lijian said at a regular press briefing that the United States was abusing the concept of national security, and urged it to stop oppressing foreign companies.CLASH BETWEEN POWERSReuters has reported that TikTok’s prospective buyers were discussing four ways to structure an acquisition from ByteDance.Within these, ByteDance could still push ahead with a sale of TikTok's U.S. assets without approval from China's commerce ministry by selling them without key algorithms.ByteDance and its founder Zhang Yiming have been caught in a clash between the world's two preeminent powers.Story continuesTrump last month issued two executive orders that require ByteDance to sell TikTok's U.S. assets or face being banned in the country, where the app is hugely popular among teenagers.U.S. officials have criticised the app's security and privacy, suggesting that user data might be shared with Beijing. TikTok has said it would not comply with any request to share user data with the Chinese authorities.Beijing has said it firmly opposes Trump's executive orders and on Aug. 28 moved to give itself a say in the process, revising a list of technologies that will need Chinese government approval before they are exported. Experts said TikTok's recommendation algorithm would fall under this list.Chinese regulators said last week the rules were not targeted at specific companies but they reaffirmed their right to enforce them.(Reporting by Keith Zhai in Singapore, Yingzhi Yang and Gabriel Crossley in Beijing, Julie Zhu in Hong Kong, and Echo Wang in New York; Editing by Brenda Goh, Tony Munroe and Alexander Smith and Mark Potter)"}]}