{"article": [{"url": "https://finance.yahoo.com/news/we-have-a-silent-epidemic-emerging-right-now-in-k-12-schools-150502942.html", "published": 1600683200.0, "headline": "'We have a silent epidemic emerging right now in K-12 schools': Infectious disease specialist", "body": "As global COVID-19 cases continue to tick upward, schools around the U.S. are struggling to reopen during the pandemic. Dr. Michael Saag, associate dean for global health at the University of Alabama at Birmingham, joined Yahoo Finance to discuss schools’ problems across the country.“I believe that we’re having a silent epidemic emerging right now within the K through 12 schools,” said Saag. He tells Yahoo Finance that K-12 students pose more risk of spreading COVID-19 because, unlike their college student counterparts, younger students are not being tested and quarantined at the same rate.“On college campuses, we saw hot spots emerge, but we knew it because we were testing. At the University of Alabama at Auburn, in my neck of the woods, they had big spikes towards the end of August which they’re getting under control because they know who’s infected. They can quarantine, and the students have paid attention now, but in K through 12, we’re not doing that.”Kid going to school during the coronavirus pandemic.Saag expects that coronavirus infections will rise over the next four weeks. He said the statistic to watch for is the percent positive, which he fears will give rise to an “October surprise.”“Our October surprise that what we’re going to have is an explosive number of adults showing up [positive] because they picked it up from the kids who have been back in school. And I’m very worried about that right now,” he said.“We can’t relax, this virus is here, it’s like a ghost, it’s kind of hanging out. It’s in the area. We can’t see it until we start seeing the cases come up.”Saag says wearing a mask is a “patriotic duty,” and questioned why President Trump had not been an advocate for mask-wearing.“I don’t want to go into politics, but I will raise the question. I personally do not understand why the president is not just doubling down, but tripling down on the mask-wearing. It doesn’t add up,” he said“It splits the country, and it makes all of our jobs harder to do what we need to do. If we could just all pull together, wear a mask; it’s sort of a patriotic duty to protect ourselves, our families, our community. Let’s just do that. And maybe we’ll get this under some degree of control.”Story continuesReggie Wade is a writer for Yahoo Finance. Follow him on Twitter at @ReggieWade.Read more:16-year-old student arrested for allegedly crippling Miami school system with cyberattackHow retailers are combating the surge in online counterfeit goodsNew York City delays K-12 opening after pressure from country's largest teachers' union27% of parents feel unsupported by their employers this back-to-school season: SurveyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}