{"article": [{"url": "https://finance.yahoo.com/news/bidens-plan-to-fight-criminal-justice-system-injustice-180731710.html", "published": 1596114920.0, "headline": "Biden’s plan to fight criminal justice system injustice", "body": "Joe Biden’s new proposal to eliminate cash bail could put the $2 billion private bail bond industry out of business.“Cash bail is the modern-day debtors’ prison. The cash bail system incarcerates people based on their inability to pay – sometimes small amounts. And it disproportionately harms Black and Brown people,” Biden stated in the economic plan he released on Tuesday.The racial justice protests following the killing of George Floyd have illustrated just how central the quest for criminal justice reform is to the fight for racial economic equity. Biden’s proposal stands in stark contrast with President Trump’s threat of sending troops in to quell them.Democratic presidential candidate former Vice President Joe Biden speaks at a campaign event at the William \"Hicks\" Anderson Community Center in Wilmington, Del., Tuesday, July 28, 2020.(AP Photo/Andrew Harnik)“When people think about, what does systemic racism look like? What do systems look like that perpetuate that?” Bail Project CEO Robin Steinberg told Yahoo Finance. “They look like a white police officer with his knee on the neck of a Black man laying on the ground for 8 and a half minutes as he pleads for his life.”“That’s what systemic racism looks like. That’s what...systems of policing, systems of cash bail setting, systems of incarceration look like when they are perpetuating structural racism,” she said.Eliminating cash bail is a key part of Biden’s proposal to achieve racial economic equity. An estimated 2.5 million people are forced to sit in jail every year because they can’t afford bail. Pre-trial detention costs taxpayers $14 billion annually. (And when defendants can’t afford to pay their bail, private bail-bond companies can help them by posting the cash for their release in exchange for a fee.)Pre-trial detention, a key driver of jail growth across the country, has increased 433% from 1970 to 2015, according to Vera Institute of Justice. The institute points out that two-thirds of prisoners in locally run jails have not been convicted of a crime.The entrance to the federal prison in Terre Haute, Ind., is seen Wednesday, July 15, 2020. (AP Photo/Michael Conroy)Only 12% of the total prison population are in federal prisons. If Biden were to lead a national push by Congress to end cash bail, he would still need to convince most states to follow suit in order to end mass incarceration in state prisons.Story continuesNew Jersey virtually eliminated cash bail in 2017. As a result, the state’s prison population shrunk and the number of arrests for low-level crimes dropped. Other states including New York, Illinois, and California have also restricted cash bail.Companies such as Amazon, Facebook, Walmart, and Apple donated millions to social justice organizations in the wake of the George Floyd protests. The Bail Project, which was among the beneficiaries, received $16 million from more than 200,000 donors over the past several months.“We have many goals at the Bail Project,” said Steinberg. “The first is to get as many people out as quickly as we can. The next is to provide support. But the long-term goal that we have is towards systemic reform, to eliminate cash bail, reimagine a pre-trial justice system that is founded in the presumption of innocence and freedom and puts us all out of business.”In addition to eliminating cash bail, Biden's criminal justice reform plan includes ensuring housing for the formerly incarcerated and expanding funding for mental health and substance use disorder treatment, as well as educational opportunities and job training for current and former prisoners.More from Sibile:Media mogul Byron Allen: ‘I think President Trump is totally wrong’Ben Carson on second coronavirus economic shutdown: ‘You do that again, and you completely destroy the financial infrastructure’Ben Carson: All Obama HUD rule does is provide ‘permanent employment for lawyers’Why Black patients receive worse care at the hospitalCost of Confederate symbols comes out of Black workers’ paychecks: EPIFind live stock market quotes and the latest business and finance news"}]}