{"article": [{"url": "https://finance.yahoo.com/news/tesla-analyst-is-bullish-on-what-the-company-is-doing-with-its-highpriced-stock-raises-price-target-to-550-170242543.html", "published": 1599048620.0, "headline": "Tesla analyst is bullish on what the company is doing with its high-priced stock, raises price target to $550", "body": "Tesla’s (TSLA) high-priced stock is giving the electric vehicle maker access to more equity funding, which ultimately means more growth for the company, says BofA analyst John Murphy.The analyst raised his price target on the stock to $550 from $350, the day after Tesla announced it plans to sell up to $5 billion worth of common shares.“This corroborates our view that TSLA will utilize its stock to raise low-cost equity capital to fund accelerated growth,” wrote Murphy in a note to investors. The analyst maintains a Neutral rating on the stock.“Building capacity in the automotive industry is expensive and often generates low returns,” said Murphy. “Even if there is a future software/service/ride-hail play for TSLA (and we have our doubts), the vehicles/platform still need to be manufactured,” he said.“It is important to recognize that the higher the upward spiral of TSLA's stock goes, the cheaper capital becomes to fund growth, which is then rewarded by investors with a higher stock price,” he wrote.Year-to-date the stock is currently up around 425%. Shares rallied 12% on Monday following a 5-for-1 stock split.BERLIN, GERMANY - SEPTEMBER 02: Tesla head Elon Musk (Photo by Maja Hitij/Getty Images)‘No need for internal funding when external is plentiful’Murphy says Tesla does not need internal funding “when external is plentiful.”He points to government subsidies for consumers and low cost loans which helped Tesla in its initial phase of development. He also highlights regulatory credits that have amounted to more than $1 billion in the last 12 months. Lastly, Murphy says, “Results and momentum are further stimulating low-cost equity funding as the stock rises.”“Simply put, TSLA is a new disruptive (auto) company that may or may not be dominant in the long-term, but that does not matter as long as it can keep funding outsized growth with almost no cost capital driving capacity expansion,” he wrote.Tesla’s latest 2nd quarter results announced in July beat expectations. The company posted a fourth consecutive quarter of GAAP profitability making the stock eligible to be considered for inclusion in to the S&P 500 (^GSPC). That has also helped the stock rally over the last month.Story continuesAnalysts have been racing to re-rate the stock this year. The stock’s price target was recently raised at Jefferies, in part because of the company’s upcoming Battery Day on September 22.Wedbush’s Dan Ives has a price target on Tesla of $380 (reflecting the stock split), and a bull case target of $700. Ives has told Yahoo Finance Tesla “is a tech company, not an automobile company.”On Wednesday the stock was down more than 7% by mid-session after a large shareholder disclosed a reduction in its Tesla position.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreTesla bull says long-term thesis 'still intact,' sees $7,000 price target by 2024Tesla bear says stock is 'detached from reality,' predicts $87 price targetBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}