{"article": [{"url": "https://finance.yahoo.com/news/raymond-james-predicts-over-100-144123559.html", "published": 1602143360.0, "headline": "Raymond James Predicts Over 100% Rally for These 3 Stocks", "body": "After a volatile September, the roller coaster hasn’t ended in October. We had a pleasant surprise for investors, when S&P 500 climbed back above 3,400 to start the month. However, markets didn’t like President Trump’s COVID diagnosis, and the resulting drop. The President is out of the hospital, but now the White House and Congressional Democrats are unable to reach agreement on an economic stimulus package.The combination of good news and bad news makes the markets an intriguing mix of risk and reward. Weighing in on current market conditions, Raymond James strategist Tavis C. McCourt noted: \"Although there is a lot of noise in the market, fiscal relief likely trumps other variables as a $1.5+ trillion fiscal relief package would likely secure an improving earnings trend through next summer (vaccine), would limit the need for increased state/local taxes, and we believe would be a very good setup for outperformance of economically cyclical companies/industries. Without fiscal relief, the chances of this economic recovery stalling increases with relative performance biased towards \"megacap tech\" and interest rate sensitives/defensives.\"With so much going on, investors will be looking at the analysts’ reviews to make sense of the markets and to find out which stocks are showing the highest return potential. With this in mind, Raymond James analysts have tapped several companies that could double their value in the year ahead.Using the latest TipRanks data, we’ve pulled up the details on these three stock picks. The picture emerges of under-the-radar stocks, featuring low points of entry and – in Raymond James’ view – upsides starting at 100%.Mesa Air Group (MESA)The first stock on our list, Mesa Air, is a holding company and an operator of regional feeder airlines. These are the smaller airlines, operating shorter-ranged aircraft and servicing lower-trafficked regions and airports, that connect passengers in low-priority regions with major airlines’ large hubs. Mesa two main airlines, United Express and American Eagle, feed into United and American Airlines, respectively.Story continuesDuring 1H20, when most airlines faced the massive financial headwinds of the coronavirus, customers’ fear of travel, and government-imposed economic and travel restrictions, Mesa was conspicuous for remaining profitable. In Q1, the per-share earnings came in at 5 cents; by Q2, that number had doubled to 10 cents. The Q2 number was also up 11% year-over-year. The gains in earnings came even as revenues slid from $180 million in Q1 to $73 million in Q2.Revenues, at the top line, are an easy metric to see, and that big revenue slide helps explain Mesa’s drop in share price. The drop in price, however, presents investors with an opportunity, according to Raymond James analyst and airline expert, Savanthi Syth.“Mesa was the only U.S. airline to report a profit with F3Q20 EPS of $0.10… While cargo demand has shined throughout the current crisis, it is unlikely to be material for Mesa in the near-/medium-term… we continue to believe Mesa will remain an important partner given its low cost structure with the opportunity to take on additional flying from struggling smaller competitors. As such, we still see compelling risk-reward,” Syth opined.These comments support Syth’s Outperform (i.e. Buy) rating, and her $6.50 price target suggests that the stock has room for 111% growth in the coming year. (To watch Syth’s track record, click here)Turning now to the rest of the Street, 3 Buys and no Holds or Sells have been published in the last three months. Therefore, MESA has a Strong Buy consensus rating. With the average price target clocking in at $6.17, the upside potential lands at 101%. (See MESA stock analysis on TipRanks).Newmark Group (NMRK)A public company for just the last three years, Newmark is a major name in the commercial real estate world. The company is an advisory firm, offering high-end customers a full range of services in commercial real estate, including agency leasing, property management and valuation, investment sales, debt and financing sales, and loan servicing. Newmark bills itself as an all-in-one agency for commercial clients, and boasts of property management services for than 400 million leasable square feet of property around the world.Newmark shows a consistent pattern to its earnings, with low results in the first half and high results in the second half. Keeping that in mind, the 1H20 results, did underperform expectation. At 9 cents EPS in Q1 and 10 cents in Q2, EPS missed the forecasts. Still, the company showed a net profit in the first half – and the outlook for Q3 shows EPS climbing back close to historical levels.Share performance, however, has been poor. The stock fell sharply in the mid-winter swoon, caused by the coronavirus economic disruptions and turndown. However, 5-star analyst Patrick O’Shaughnessy, covering Newmark for Raymond James, believes this company is undervalued.“…there are still plenty of unknowns in the CRE market today, particularly within capital markets and leasing activity; however, we believe this heavily discounted valuation is not warranted. Moreover, we believe that the present value of the Nasdaq earn-out, which represents more than half of Newmark's total market cap, is underappreciated by investors, as evidenced by the relatively low correlation between Nasdaq and Newmark,\" O’Shaughnessy commented.The analyst continued, “Newmark's core franchise is currently trading at ~3.4x our 2020E core EBITDA and ~2.1x our 2021E core EBITDA. This is meaningfully below Newmark's peers, which trade at ~10x and 7x our 2020E and 2021E core EBITDA, respectively. While we do recognize that Newmark's business model does maintain a higher split of capital markets and leasing revenues than its larger peers, we believe that this 65-70% core valuation discount is too large.”Following from those comments, O’Shaughnessy gives Newmark a $10 price target, suggesting a 102% upside, and an Outperform (i.e. Buy) rating. (To watch O’Shaughnessy’s track record, click here)Overall, Newmark has a Moderate Buy rating from the analyst consensus, based on a 1 to 1 split between Buy and Hold reviews. The stock has an average price target of $8, giving it a 62% upside potential from the current share price of $4.93. (See NMRK stock analysis on TipRanks)Echostar Corporation (SATS)Echostar is a major operator or satellite communication infrastructure, providing satcom services to media, private enterprise, and US government and military entities. The company’s subsidiary, Hughes, uses the satellite network to provide broadband services, and delivers network solutions in over 100 countries around the world.Echostar had been feeling financial pain even before the COVID-19 pandemic. The company’s EPS was negative as far back as Q2 2019, and the losses grew worse sequentially through 1Q20. While the second quarter of this year also reported a loss, the sequential improvement was substantial – from a 56-cent loss in Q1 to a 12-cent loss in Q2. That improvement comes along with a generalized surge in networking use.Getting into details, SATS saw $459 million in total Q2 revenues, beating estimates by 5.2%. The second quarter also saw an increase in the subscriber base of 26,000. Echostar now boasts of 1.54 million total subscribers.Raymond James’ Ric Prentiss points out several of Echostar’s major advantages, writing, “We expect the Hughes consumer business (71% of Hughes revenues) to remain resilient in the U.S. and strong in LatAm during the COVID-19 crisis, and Enterprise sales to recover. And of course, the balance sheet is ready with plenty of chips on the table (~$2.5B cash and net debt of -$67M), giving the company strategic optionality in a time when other companies, especially higher levered satellite companies, are cash starved with significant maturities or capex programs.”In line with those comments, Prentiss rates this stock a Strong Buy, and his price target of $57 implies room for an upside of 127% in the next 12 months. Prentiss’ is the only recent review on record for SATS, which is currently trading for $25.10. (To watch Prentiss’ track record, click here)To find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment."}]}