{"article": [{"url": "https://finance.yahoo.com/news/biden-cusp-historic-running-mate-190649983.html", "published": 1597155260.0, "headline": "Biden picks Kamala Harris as running mate, first Black woman", "body": "WILMINGTON, Del. (AP) — Joe Biden named California Sen. Kamala Harris as his running mate on Tuesday, making history by selecting the first Black woman to compete on a major party’s presidential ticket and acknowledging the vital role Black voters will play in his bid to defeat President Donald Trump.In choosing Harris, Biden is embracing a former rival from the Democratic primary who is familiar with the unique rigor of a national campaign. The 55-year-old first-term senator, who is also of South Asian descent, is one of the party’s most prominent figures. She quickly became a top contender for the No. 2 spot after her own White House campaign ended.She will appear with Biden for the first time as his running mate at an event Wednesday near his home in Wilmington, Delaware.In announcing the pick, Biden called Harris a “fearless fighter for the little guy, and one of the country's finest public servants.” She said Biden would “unify the American people\" and “build an America that lives up to our ideals.”Harris joins Biden at a moment of unprecedented national crisis. The coronavirus pandemic has claimed the lives of more than 160,000 people in the U.S., far more than the toll experienced in other countries. Business closures and disruptions resulting from the pandemic have caused severe economic problems. Unrest, meanwhile, has emerged across the country as Americans protest racism and police brutality.Trump’s uneven handling of the crises has given Biden an opening, and he enters the fall campaign in strong position against the president. In adding Harris to the ticket, he can point to her relatively centrist record on issues such as health care and her background in law enforcement in the nation’s largest state.The president told reporters Tuesday he was “a little surprised” that Biden picked Harris, pointing to their debate stage disputes during the primary. Trump, who had donated to her previous campaigns, argued she was “about the most liberal person in the U.S. Senate.”Story continues“I would have thought that Biden would have tried to stay away from that a little bit,” he said.Harris’s record as California attorney general and district attorney in San Francisco was heavily scrutinized during the Democratic primary and turned away some liberals and younger Black voters who saw her as out of step on issues of racism in the legal system and police brutality. She declared herself a “progressive prosecutor” who backs law enforcement reforms.Biden, who spent eight years as President Barack Obama’s vice president, has spent months weighing who would fill that same role in his White House. He pledged in March to select a woman as his vice president, easing frustration among Democrats that the presidential race would center on two white men in their 70s.Biden’s search was expansive, including Massachusetts Sen. Elizabeth Warren, a leading progressive; Florida Rep. Val Demings, whose impeachment criticism of Trump won party plaudits; California Rep. Karen Bass, who leads the Congressional Black Caucus; former Obama national security adviser Susan Rice; and Atlanta Mayor Keisha Lance Bottoms, whose passionate response to unrest in her city garnered national attention.A woman has never served as president or vice president in the United States. Hillary Clinton was the Democratic presidential nominee in 2016. Two women have been nominated as running mates on major party tickets: Democrat Geraldine Ferraro in 1984 and Republican Sarah Palin in 2008. Their parties lost in the general election.The vice presidential pick carries increased significance this year. If elected, Biden would be 78 when inaugurated in January, the oldest man to ever assume the presidency. He’s spoken of himself as a transitional figure and hasn’t fully committed to seeking a second term in 2024.Harris, born in 1964 to a Jamaican father and Indian mother, spent much of her formative years in Berkeley, California. She has often spoken of the deep bond she shared with her mother, whom she has called her single biggest influence.Harris won her first election in 2003 when she became San Francisco’s district attorney. In that post, she created a reentry program for low-level drug offenders and cracked down on student truancy.She was elected California’s attorney general in 2010, the first woman and Black person to hold the job, and focused on issues including the foreclosure crisis. She declined to defend the state’s Proposition 8, which banned same-sex marriage and was later overturned by the U.S. Supreme Court.After being elected to the Senate in 2016, she quickly gained attention for her assertive questioning of Trump administration officials during congressional hearings.Harris launched her presidential campaign in early 2019 with the slogan “Kamala Harris For the People,” a reference to her courtroom work. She was one of the highest-profile contenders in a crowded Democratic primary and attracted 20,000 people to her first campaign rally in Oakland.But the early promise of her campaign eventually faded. Her law enforcement background prompted skepticism from some progressives, and she struggled to land on a consistent message that resonated with voters. Facing fundraising problems, she abruptly withdrew from the race in December 2019, two months before the first votes of the primary were cast.One standout moment of her presidential campaign came at the expense of Biden. During a debate, she said Biden made “very hurtful” comments about his past work with segregationist senators and slammed his opposition to busing as schools began to integrate in the 1970s.“There was a little girl in California who was a part of the second class to integrate her public schools, and she was bused to school every day,” she said. “And that little girl was me.”Shaken by the attack, Biden called her comments “a mischaracterization of my position.”The exchange resurfaced recently with a report that one of Biden’s closest friends and a co-chair of his vice presidential vetting committee, former Connecticut Sen. Chris Dodd, still harbors concerns about the debate and that Harris hadn’t expressed regret. The comments attributed to Dodd and first reported by Politico drew condemnation, especially from influential Democratic women who said Harris was being held to a standard that wouldn’t apply to a man running for president.Some Biden confidants said Harris’ debate attack did irritate the former vice president, who had a friendly relationship with her. Harris was also close with Biden’s late son, Beau, who served as Delaware attorney general while she held the same post in California.But Biden and Harris have since returned to a warm relationship.“Joe has empathy, he has a proven track record of leadership and more than ever before we need a president of the United States who understands who the people are, sees them where they are, and has a genuine desire to help and knows how to fight to get us where we need to be,” Harris said at an event for Biden earlier this summer.At the same event, she bluntly assailed Trump, labeling him a “drug pusher” for his promotion of the unproven and much-questioned malaria drug hydroxychloroquine as a treatment for the coronavirus. After Trump tweeted “when the looting starts, the shooting starts” in response to protests about the death of George Floyd, a Black man in police custody, Harris said his remarks “yet again show what racism looks like.”Harris has taken a tougher stand on policing since Floyd’s killing. She co-sponsored legislation in June that would ban police from using chokeholds and no-knock warrants, set a national use-of-force standard and create a national police misconduct registry, among other things. It would also reform the qualified immunity system that shields officers from liability.The list in the legislation included practices Harris did not vocally fight to reform while leading California’s Department of Justice. And while she now wants independent investigations of police shootings, she didn’t support a 2015 California bill that would have required her office to take on such cases.“We made progress, but clearly we are not at the place yet as a country where we need to be and California is no exception,” she told The Associated Press recently. The national focus on racial injustice now, she said, shows “there’s no reason that we have to continue to wait.”___Ronayne reported from Sacramento, California. Associated Press writers Alexandra Jaffe, Jill Colvin and Julie Pace contributed from Washington."}]}