{"article": [{"url": "https://finance.yahoo.com/news/paris-hilton-on-tiktok-tech-this-is-paris-documentary-162816627.html", "published": 1600076180.0, "headline": "Paris Hilton explains why TikTok is her favorite app", "body": "TikTok, which is owned by Chinese tech company ByteDance, has become a political punching bag for the Trump administration. But despite the app’s uncertain future, Paris Hilton, arguably the world’s original influencer, couldn’t be more bullish on the video-sharing social network.“My favorite app is TikTok. I'm having so much fun on there. I just love the platform. I love the editing. I love all the different things that you could do. I love all the challenges, the music. I just think it's so creative and fun,” Hilton told Yahoo Finance in an interview ahead of the premiere of her documentary, “This is Paris,” which debuted on YouTube today.She added: “And if someone loves to dance or they want to do comedy or beauty, there's just — you basically could do anything. And it’s just... the innovation is amazing, and it's just more fun than any of the other platforms. I just have a good time with it.”Hilton, 39, the heiress to the Hilton Hotels (HLT) empire, has 3 million followers on TikTok, whose owner just proposed partnering with enterprise software provider Oracle (ORCL) in the U.S. amid the Trump administration’s protests that TikTok poses a threat to national security.Last week, Hilton started the #ThatsHot challenge, paying homage to her signature line, trying to get creators to use the hashtag to get on Hilton’s radar — the only rule is “don’t be boring.” The hashtag was viewed 1 billion times within the first 24 hours. She also performed a virtual DJ set for #TrillerFest in April.Paris Hilton presents a creation from The Blonds Spring/Summer 2019 collection during New York Fashion Week in the Manhattan borough of New York City, U.S., September 7, 2018. REUTERS/Caitlin Ochs‘Every company has so much data on us’And while competition from Triller, Instagram’s Reels (FB) and now YouTube’s Shorts remain at the forefront, TikTok’s defining algorithm and its genre-bending categories have gotten over 100 million Americans hooked on the app each month. TikTok is the epicenter of cultural relevance for young adults.Sixteen-year-old Charli D’Amelio is the most-followed TikTok star, with 86.7 million followers. That social clout has transferred into the real world, as she now has her own signature drink at Dunkin’ Donuts (DNKN), aptly named “The Charli.”Story continuesUnlike Facebook and Instagram posts, the objective with TikTok content isn’t to put out a polished persona, but rather to capture the banal, relatable moments, from parody “What I Eat in a Day” videos to pranking partners, parents and friends. And while creators are diversifying their platforms, many are simply repurposing their TikTok videos, with the watermark still stamped on their content across different social platforms.Dixie Damelio and Charli Damelio speak during Graduate Together: America Honors the High School Class of 2020 on May 16, 2020. (Photo by Getty Images/Getty Images for EIF & XQ)While the Trump administration asserts that TikTok endangers national security, some users don’t seem too concerned. In a recent interview with Yahoo Finance, TikTok star Zach King articulated his thoughts on the app’s security concerns, but took a rather laissez-faire approach.“I’m in the camp where every company has so much data on us Facebook, Instagram, Google,” Zach King, a TikTok star with 49.5 million followers on the app, told Yahoo Finance’s “The Final Round” in an interview last month. “I don’t know how it would be different, maybe you have to worry about the Chinese government having it and doing something malicious with it.”Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Tech newsletterRead more:Golf sees huge upswing with women and young adults: ‘You can take your bag full of White Claws’Netflix's Reed Hastings: ‘Thank God’ Blockbuster didn’t want to buy us‘Mulan’ producer on boycott threats: ‘I feel badly...the conversation turns to this’What Silicon Valley still doesn't understand about its diversity problem'People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talent"}]}