{"article": [{"url": "https://finance.yahoo.com/news/covid-crash-economic-rebound-morning-brief-100124111.html", "published": 1597640960.0, "headline": "A key prediction about the economic aftermath of the COVID crash has been confirmed: Morning Brief", "body": "Monday, August 17, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThe economic snapback has been better than expectedWhen the U.S. economy went on lockdown in March, economic forecasters warned of an unprecedented drop in GDP as numerous industries effectively ground to a halt. We recently learned that U.S. GDP fell at an almost unbelievable 32.9% rate in Q2.However, most folks who follow the economy also long predicted there would be a sharp snapback once the spread of the coronavirus came under control and businesses were able to reopen. Their argument was that the economy was fundamentally in good shape going into the crisis and that the suppression in activity could largely be switched back on.Five months later, we’re learning that the snapback in activity — which began late in Q2 — has been far better than expected.“Complementing the read of large and broad-based beats evident in the earnings numbers, the message from management commentary is that the speed and scale of the demand rebound in Q2 proved to be a surprise to most companies as well,” Deutsche Bank’s Binky Chadha wrote in a note to clients on Thursday.“Freeport-McMoRan said ‘this recovery came sooner and stronger than we and others anticipated,’ while UPS ‘assumed demand would slow’ but instead saw ‘just the opposite,’” he added.The stock market has certainly taken notice with the S&P 500 (^GSPC) setting record highs last week.And this hasn’t been just about big corporates. Broad measures of the economy, like the BLS’s monthly tally of nonfarm payrolls, show job creation has been stronger than expected. And while Friday’s July retail sales report reflected some deceleration, it still showed growth despite recent flare ups in COVID-19 infection rates.“Overall, the retail sales figures are encouraging because they suggest the recovery has continued to grind on even in the face of the resurgence in virus cases,” Capital Economics Michael Pearce said.Story continues“Admittedly, the expiry of additional Federal unemployment benefits at the end of July poses a downside risk to spending in the near term, but with virus infection numbers falling again the high-frequency indicators have continued to edge higher in early August,” Pearce added.To be very clear, none of this is to say that anyone expects the economy to fully return to where it was pre-COVID any time soon. With the suppression of the economy came an actual recession which has come with the permanent closures of businesses and the permanent destruction of jobs and all the other consequences that comes with.If history is a guide, we should be prepared for lots of hiccups and policy mistakes along the way. This is always part of the process, and it’ll surely be a long time before everything is great again.But so far, things have been better than expected.By Sam Ro, managing editor. Follow him at @SamRoWhat to watch todayEconomy8:30 a.m. ET: Empire Manufacturing, August (15.0 expected, 17.2 in July)10:00 a.m. ET: NAHB Housing Market Index, August (74 expected, 72 in July)4:00 p.m. ET: Net long-term TIC flows, June ($127.0 billion in May)4:00 p.m. ET: Total net TIC flows, June (-$4.5 billion in May)Top NewsPelosi to call House back into session to vote on USPS bill [Reuters]FTSE rises as Chinese stimulus and oil demand lifts mining stocks [Yahoo Finance UK]French group Sanofi to buy U.S. firm Principia Biopharma for $3.7B [Reuters]Oil driller Chaparral’s files for bankruptcy protection [Bloomberg]YAHOO FINANCE HIGHLIGHTSSummers calls Trump 'worst of America's 45 presidents,' says stocks 'do better' during Democratic administrationsSerial tech entrepreneur launches ambitious alternative to school: 'It's a very progressive approach to education’'Hamilton' popularity lifts Disney+ engagement 20% in July: Data—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}