{"article": [{"url": "https://finance.yahoo.com/news/walmart-to-close-on-thanksgiving-announces-cash-bonuses-150815078.html", "published": 1595326580.0, "headline": "Walmart to close on Thanksgiving, dole out employee bonuses as reward in 'unprecedented' year", "body": "Walmart will give its workers the day off on Thanksgiving, in addition to special cash bonuses this summer, an acknowledgment of rising to the challenge of the coronavirus pandemic.In a memo to store associates on Tuesday seen by Yahoo Finance, the nation’s largest retailer and biggest employer said it was considering ways to compensate for a holiday shopping season that will be “different,” as the COVID-19 outbreak dramatically reshapes public life.“Throughout all of this, Walmart associates have continued to help their fellow Americans get the food, medicine, supplies, and support they’ve needed,” U.S. CEO John Furner wrote.Like most retailers, Walmart opens up on Thanksgiving to get a jump on Black Friday sales — the unofficial start to the holiday shopping season, and one of the most important periods on the retail calendar. This year, the retail giant will forego at least some of those revenues by closing all of its nearly 5,000 U.S. stores.In the letter, Furner said that an associate from a store Round Rock, Texas wrote to management suggesting that they “close for Thanksgiving during this unusual year, so that our associates could spend the day with their families.”“Our best ideas come from our associates, and this year we have decided to close our stores on Thanksgiving Day — November 26. We know it’s been a tiring year, and you’ve stepped up. We want you to enjoy the day at home with your loved ones,” he wrote.For the past two years, the big-box retailer kicked off its Black Friday in-store shopping bonanza on Thanksgiving Day at 6 p.m. local time. Walmart-owned Sam’s Club, the membership warehouse, will see its nearly 500 locations closed on the holiday again this year. Walmart hasn’t closed its entire store fleet for the Thanksgiving holiday since the late 1980s, a company spokesperson told Yahoo Finance.In addition, the retailer plans to hand out another round of special cash bonuses to Walmart’s nearly 1.5 million U.S. associates for their work this summer.Story continues“You’ve been working at an incredible pace, you’ve solved problems, and you’ve set an amazing example for others,” Furner said.For associates employed with the company as of July 31, full-time workers, excluding salaried office staff, will receive $300, while part-time or temporary workers will get $150, for a total of $428 million. The bonuses will hit paychecks on August 20.To date, Walmart has doled out $1.1 billion in special cash bonuses.Shares of Walmart (WMT) were last trading up nearly 1% at above $132.Julia La Roche is a Correspondent at Yahoo Finance. Follow her on Twitter. Starbucks to require that all customers wear facial coverings in its cafesWalmart to require masks at all U.S. stores"}]}