{"article": [{"url": "https://finance.yahoo.com/news/will-white-collar-layoffs-short-circuit-recovery-morning-brief-101027523.html", "published": 1601529500.0, "headline": "Will a wave of white collar layoffs short-circuit the recovery?: Morning Brief", "body": "Thursday, October 1, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeA second wave of layoffs could soon hit Corporate America.The economy’s K-shaped recovery is now a consensus view.This idea outlines how some workers, companies, stocks, and areas of the economy have thrived during the pandemic-induced recession while others have faltered. Even Democratic presidential candidate Joe Biden referenced the K-shaped recovery in the first presidential debate Tuesday night.And a key part of this thesis is driven by who has been hit hardest by the labor market’s disruption so far. Through six months of this crisis, white collar workers have been far less impacted by job losses than those in the hospitality and food services industry.In the leisure and hospitality industry, for example, the unemployment rate in August stood at 21.3%. In professional and business services, unemployment was 7.2% in August. As a result, average hourly earnings for workers have actually increased as more job losses accrue at the lower-end of the wage scale.This dynamic has bolstered the housing market as those well-positioned to make a large purchase like a home keep their jobs while restaurants and services that support white collar office workers have been decimated. The stock market — where the top 1% of earners own 50% of the market — is another area where the haves enjoy a robust rebound and the have nots are left behind.But news this week from companies across industries perhaps calls into question the health of the office worker class that has so far evaded the worst impacts of the recession.And at least makes it worth taking note of the possibility that a “second wave” of layoffs could hit the economy as corporates take stock of how much business has been hit in 2020 and what costs will need to be in 2021 for companies to make it through to the other side of this crisis.On Tuesday, a report from CNBC that said Disney (DIS) would lay off 28,000 employees across three divisions — including more than 9,000 full-time workers — was among the most jarring pieces of news in months related to the labor market. But the company is not alone in announcing big workforce reductions.Story continuesRoyal Dutch Shell (RDS-A) said this week it would cut up to 9,000 jobs. And Dow (DOW) also said it would cut 6% of its workforce, or more than 2,000 jobs. And this coming as major airlines are on the brink of laying off up to 30,000 workers if additional aid for the industry is not approved by lawmakers.And while the energy and theme parks businesses have not fared particularly well during the pandemic, these blue chip companies are the top of the business world’s K. They are better capitalized and more prepared to weather business interruptions than the small businesses that have been forced to close en masse during this crisis. These are the companies investors see as more likely to make it through this crisis and potentially thrive on the other side. Layoffs from this part of the corporate matrix are a worrying sign.The labor market as a whole, however, still appears to be on the mend and keeping the economy moving in the right direction.ADP’s private payroll data for September showed 749,000 private sector jobs were created last month. Professional and business services, the area of the economy where this “second wave” of white collar job losses would be most likely to materialize, added 78,000 jobs last month. Wall Street economists expect the government’s September jobs report on Friday will show the economy added 859,000 jobs last month.And as The Morning Brief has covered in recent editions, the resilience of consumer spending and optimism around the labor market has been a surprising result through September, a second full month without additional stimulus after the CARES Act expired in August.Renaissance Macro also noted in a tweet on Wednesday that economic surprises continue to the upside and have accelerated in September as anticipated slowdowns in data have not yet materialized.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Initial jobless claims, week ended September 26 (850,000 expected, 870,000 during prior week)8:30 a.m. ET: Continuing claims, week ended September 19 (12.200 expected, 12.580 million during prior week)9:45 a.m. Markit US manufacturing PMI, September final (53.5 expected, 53.5 prior)10:00 a.m. ET: ISM manufacturing, September (56.4 expected, 56 in August)10:00 a.m. Construction spending, August month-over-month (0.7% expected, 0.1% in July)Earnings6:30 a.m. ET: Constellation Brands (STZ) is expected to report adjusted earnings of $2.53 per share on $2.19 billion in revenue6:05 a.m. ET: PepsiCo (PEP) is expected to report adjusted earnings of $1.49 per share on 17.23 billion in revenue7:30 a.m. ET: Conagra (CAG) is expected to report adjusted earnings of 57 cents per share on $2.61 billion in revenueTop NewsEuropean markets open higher as Brexit talks resume [Yahoo Finance UK]Medtronic under Justice Department probe over ventilator competition: WSJ [Reuters]Trump signs stopgap bill to avoid gov’t shutdown [Reuters]Fed extends ban on share buybacks at big banks through Q4 [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSWalmart is updating its iconic Supercenter store for the digital agePredictive markets bet on Biden victory after raucous debate, Trump's momentum evaporatesThis is one of the 'busiest periods in history' for public market debuts: NYSE executive—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}