{"article": [{"url": "https://finance.yahoo.com/news/the-next-big-move-this-summer-for-the-recordsetting-nasdaq-174209010.html", "published": 1594126220.0, "headline": "Here's the next big move this summer for the record-setting Nasdaq", "body": "Hot-air balloons and rocket ships eventually return to Earth after splendid shows of upward thrust. The record-setting Nasdaq Composite may soon join that group in a return to home mission.A few market veterans Yahoo Finance has chatted up recently think a cooling off period in the Nasdaq is approaching in the coming weeks. There won’t necessarily be a trigger point that sparks an avalanche of selling like the markets saw back in March as COVID-19 became front page news. Rather, the sector is on the verge of becoming overvalued relative to its future earnings potential.In turn, portfolio managers may take profits in these hot tech names and rotate into more attractively valued small-caps or value stocks that have lagged the market’s renewed melt-up from the March lows.“I’m not saying the Nasdaq peaks and collapses. I think the relative outperformance of the Nasdaq peaks some time this quarter. Maybe the Nasdaq or the Dow and the Russell peaks and the other indices play catch-up. Or frankly something happens in the country, who knows what it will take. Investors will rotate into the small-caps,” explained Heritage Capital founder Paul Schatz on Yahoo Finance’s The First Trade.Wall Street has been squarely fixated on the tech laden Nasdaq in recent weeks, and rightfully so.The combination of easy money from the Federal Reserve (which so often encourages buying of risky tech stocks) and the pull forward of demand for cloud and other work-from-home services during COVID-19 has sent the Nasdaq screaming higher by 32% this past three months. About 7% of that appreciation has come in the past month alone, powered by big-cap tech names such as Amazon (AMZN), Microsoft (MSFT) and Google (GOOG).Tesla’s stock (TSLA) has gone bonkers in the last month, up an insane 58%, according to Yahoo Finance Premium data. Upstart electric truck maker Nikola (NKLA) has seen its market cap surge to $16 billion some one month after going public (and despite having not produced any of its cool trucks).Story continuesNEW YORK, NEW YORK - MAY 07: A view of NASDAQ in Times Square during the coronavirus pandemic on May 7, 2020 in New York City. COVID-19 has spread to most countries around the world, claiming over 270,000 lives with over 3.9 million infections reported. (Photo by Noam Galai/Getty Images)Pros Yahoo Finance has talked with of late suggest the tech momentum trade is likely to continue in the very near-term. There is simply very little somewhat defensible areas to invest in at the moment amidst a global pandemic, experts say.“Stocks have also been supported by the lack of compelling investment alternatives with interest rates near record lows,” points out SunTrust’s chief markets strategist Keith Lerner.Big-cap tech companies such as Microsoft and Amazon also offer impressive moats around their business, and that is of high value in the age of COVID-19.But nothing can go up forever, and that includes big-cap tech stocks boasting impressive underlying businesses. If second quarter tech earnings don’t blow investors away later this month, look out below.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}