{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-15-2020-221716074.html", "published": 1600183220.0, "headline": "Stock market news live updates: Stocks pare gains, Nasdaq paces toward back-to-back sessions of advances", "body": "Stocks pared gains Tuesday, with the Nasdaq tracking toward back-to-back sessions of gains as tech stocks continued to recover last week’s losses. The Dow eked out a modest rise after briefly dipping during intraday trading.[Click here to read what’s moving markets heading into Wednesday, September 16] Equities mostly poised extended gains from Monday, when each of the three major indices closed more than 1% higher, and the Nasdaq rose for the first time in three sessions. Apple (AAPL) shares pared earlier gains and then fell, after company held a virtual product launch event Tuesday afternoon focused on the Apple Watch and iPad. The communications sector was the best-performer in the S&P 500, followed closely by real estate and information technology.“Last week was rough. I think markets are at a crossroad since we’ve gained so much since March. And the economic data’s been better, the health data has been encouraging, since cases are falling. But from a markets perspective, nothing is really decisive,” Tom Lee, head of research at Fundstrat Global Advisors, told Yahoo Finance’s The Ticker on Monday.“I think investor are still torn, and I think that’s why they’re sticking with these tech stocks,” he added. “But I don’t think tech needs to roll over for cyclicals to work. I think for cyclicals to work, investors just need to be confidence that the good news on the economy is continuing. And then the cash comes off the sidelines and the sentiment which was really bearish turns positive, and I think that’s what fuels the rally into year-end.”Better-than-expected economic data out of China overnight helped boost contracts on US stock indices and global equities, as signs that the economy first hit by the coronavirus pandemic was bouncing back at a faster than anticipated clip. China’s retail sales rose in August by 0.5% year-over-year, marking the first increase so far this year and topping expectations for a flat reading. Industrial production increased 5.6% in August over last year, versus a 5.1% rise expected.Story continuesA slew of new deal-making activity helped contribute to a more risk-on session in markets. Nvidia announced the largest-ever chip industry deal to purchase SoftBank’s Arm unit, Gilead (GILD) unveiled its intent to purchase tumor-fighting drug-developer Immunomedics (IMMU) and Oracle (ORCL) confirmed it was in the running to become a “trusted technology provider” to ByteDance’s TikTok, edging out Microsoft (MSFT) for a tie-up with the fast-growing social media platform. Oracle – which will still need to undergo a US national security review and win approval from President Donald Trump for its partnership with TikTok to come to fruition – saw shares trade slightly lower in late trading, after closing 4.3% higher earlier in the day.Tuesday will also mark the first of two days of meetings for the Federal Open Market Committee. The Federal Reserve will release its September monetary policy statement Wednesday afternoon, followed by a press conference with Fed Chair Jerome Powell. Both the statement and remarks are expected to reaffirm policymakers’ cautious tone on economic growth during the pandemic, and potentially lay the groundwork for more specifics on the central bank’s plan for forward guidance, following its newly announced policy framework around inflation announced at its annual symposium in late August.“Given we just got a significant update from Fed Chair Powell at the annual Jackson Hole Symposium, the upcoming meeting should garner much less fanfare than usual,” RBC Capital Markets economists wrote in a note Friday. “Most of what Powell touched on at Jackson Hole was very forward-guidance driven. So we will hear about 1) more willingness to let inflation run above 2% (the inflation averaging provisions) and 2) letting the unemployment rate drift well below the natural rate in the future (the de-linking of employment and inflation that Powell promoted).”“From our lens the recent tweaks are merely a concretization of an already active process,” they added.—4:11 p.m. ET: Stocks end higher, Nasdaq posts back-to-back sessions of gainsHere were the main moves in markets as of 4:11 p.m. ET:S&P 500 (^GSPC): +17.66 (+0.52%) to 3,401.20Dow (^DJI): +2.27 (+0.01%) to 27,995.60Nasdaq (^IXIC): +133.67 (+1.21%) to 11,190.32Crude (CL=F): +$1.04 (+2.79%) to $38.30 a barrelGold (GC=F): -$2.10 (-0.11%) to $1,961.60 per ounce10-year Treasury (^TNX): +0.8 bps to yield 0.6790%—2:00 p.m. ET: Apple unveils new Apple Watch, iPads, at event TuesdayApple held a product launch event Tuesday focused on launching new versions of its Apple Watch and iPad, along with Apple One, a subscription bundle including iCloud, Music, TV+, Arcade and Fitness+.The new Apple Watch Series 6 will include blood oxygen monitors and a faster processor, and will begin at $399. Orders begin today, and products will be available starting Friday. The new iPad starts at $329 with orders and products available this week, and the new iPad Air will begin at $599 and be available next month.Shares of Apple pared some gains during and following the event, cutting its advance to just 0.2% in afternoon trading.—12:54 p.m. ET: Stocks hold higher in afternoon tradingThe three major indices held in positive territory Tuesday afternoon, with the Nasdaq strongly outperforming with a 1.6% advance. The S&P 500 rose nearly 1%, and the Dow was up 0.4%, or 106 points, just before 1 p.m. ET.The tech-heavy communication services sector led gains in the S&P 500, and Intel and Apple buoyed the Dow,—10:41 a.m. ET: US median household income rose ahead of the pandemic, Census data showsThe median household income in the US increased by 6.8% in 2019 to $68,700, according to the Census Bureau’s annual report out Tuesday. The report, which captured the period before the pandemic devastated economic growth and put tens of millions of American out of work, also showed that the number of individuals living in poverty fell by 4.2 million to 34 million last year.—9:32 a.m. ET: Stocks open higher, Dow adds 200+ pointsHere were the main moves in markets, as of 9:32 a.m. ET:S&P 500 (^GSPC): +27.96 points (+0.83%) to 3,411.5Dow (^DJI): +200.12 points (+0.71%) to 28,193.45Nasdaq (^IXIC): +129.29 points (+1.17%) to 11,185.94Crude (CL=F): +$0.29 (+0.78%) to $37.55 a barrelGold (GC=F): +$13.50 (+0.69%) to $1,977.20 per ounce10-year Treasury (^TNX): +1.2 bps to yield 0.681%—9:16 a.m. ET: US industrial production rises less than expected in August as manufacturing recovery slowsUS industrial production rose for a fourth straight month in August, Fed data Tuesday showed, but by a weaker than expected rate, as a recovery in manufacturing began to lose steam.Industrial production increased 0.4% in August over July, missing expectations for a 1.0% rise. However, July’s increase was upwardly revised to 3.5%, from the 3.0% previously reported.Capacity utilization totaled 71.4% in August, matching expectations and improving from the 71.1% reported for July. This metric gauges the percentage of factories, mines and utilities facilities in use during a given month.—8:30 a.m. ET: Import prices jump more than expected in AugustImport prices for the US rose by a greater than expected margin in August, extending an increase from July as inflation picked up.The Labor Department’s import price index increased 0.9% in August over July, representing a rate that was nearly double the 0.5% increase expected. Import prices rose by an upwardly revised 1.2% in July.Excluding petroleum imports, imports to the US rose 0.7%, or well above the 0.3% rise expected and 0.2% gain from July.The price index for non-fuel industrial supplies and materials was a key contributor to the increase in import prices overall, with prices for these rising 3.6% for the largest one-month advance in data going back to 2001.—8:13 a.m. ET: Opendoor set to go public via SPAC merger with Palihapitiya’s Social CapitalHousing technology start-up Opendoor announced Tuesday it will be going public via a merger with Social Capital Hedodosophia Holdings Corp. II, a blank-check company with Chamath Palihapitiya as its chairman. The deal is valued at $4.8 billion, and will provide as much as $1 billion in cash, according to a statement Tuesday.The deal makes Opendoor the latest tech startup to go public this year via merger with a special purpose acquisition company (SPAC). Other recent companies to hit the public markets via SPAC merger include Nikola (NKLA) and DraftKings (DKNG), and Virgin Galactic (SPCE) in 2019.—7:20 a.m. ET Tuesday: Futures rise after better than expected economic data from ChinaHere were the main moves in markets, as of 7:21 a.m. ET:S&P 500 futures (ES=F): 3,407.00, up 24.5 points or 0.72%Dow futures (YM=F): 27,182.00, up 189 points or 0.68%Nasdaq futures (NQ=F): 11,388.75, up 108.25 points, or 0.96%Crude (CL=F): +$0.66 (+1.77%) to $37.92 a barrelGold (GC=F): +$15.50 (+0.79%) to $1,979.20 per ounce10-year Treasury (^TNX): +1.3 bp to yield 0.682%—6:05 p.m. ET Monday: Stock futures open little changedHere were the main moves in equity markets, as of 6:05 p.m. ET Monday:S&P 500 futures (ES=F): 3,382.75, up 0.25 points or 0.01%Dow futures (YM=F): 27,994.00, up 1 point or flatNasdaq futures (NQ=F): 11,295.00, up 14.5 points, or 0.13%NEW YORK, NY - AUGUST 22: Traders and financial professionals work on the floor of the New York Stock Exchange (NYSE) at the opening bell, August 22, 2018 in New York City. Today marks the longest bull market rally in U.S. history, stretching back to March 2009. The longest previous market rally was from 1990 to March 2000. (Photo by Drew Angerer/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}