{"article": [{"url": "https://finance.yahoo.com/news/jobs-report-the-white-house-case-for-why-a-longer-deceleration-may-not-happen-145422899.html", "published": 1596794540.0, "headline": "White House on jobs numbers: Claims of a broader slowdown are ‘very misleading’", "body": "The July jobs report slightly beat expectations as the economy recovered 1.8 million jobs in July and the unemployment rate fell to 10.2%. But many were quick to note that the pace of recovery has slowed when compared with record reports in June and May.Joseph LaVorgna, an advisor to President Trump and chief economist at the National Economic Council, told Yahoo Finance that claims about a broader economic slowing are “very misleading.”The resurgence of coronavirus cases in some states weighed on the labor market recovery as some federal stimulus measures also have run out. “It has slowed” this month, LaVorgna said, but “it’s not to say that it won’t reaccelerate for a couple of reasons.”“It's very hard to say what the next report's going to look like, but for us to assume, just because we've had some very good numbers that surprised everybody, we are supposed to look for a big deceleration – that may not happen,\" LaVorgna says.A help wanted sign is displayed in the window of a Brooklyn business. (Spencer Platt/Getty Images)LaVorgna pointed to metrics like potential revisions in the month ahead and temporary hiring, calling it a “forward looking indicator of labor demand” that he noted was up. President Trump responded to the announcement, tweeting “Great Jobs Numbers!”The Democratic response to the numbers was a bit different. In a call with reporters Friday, Democratic National Committee Chairman Tom Perez returned repeatedly to the slowing pace of job growth. He also pointed out that 5 million people have left the labor force since February and so the unemployment rate, which now sits at 10.2%, isn’t as low as it seems. “They have given up,” Perez said of these workers. (In order to be counted in the Bureau of Labor Statistics’ measure of unemployment – to be “officially” unemployed – you have to be actively looking for work, which many out-of-work people have likely stopped doing.)Great Jobs Numbers!— Donald J. Trump (@realDonaldTrump) August 7, 2020The Trump campaign also jumped in with official notes that the 1.8 million new jobs – while below the June report – represent the third-largest jobs gain in American history after the May and June numbers. Left out, of course, were the horrific reports that preceded it, including an April report that saw over 20 million jobs lost, by far the worst in U.S. history.Story continuesTrump, at each stage of the ongoing recession caused by the pandemic, has promised that the U.S. economy will come back stronger than ever. Last month, after the report showed a 4.8 million jobs added, the president said the announcement proved “that our economy is roaring back.\"LaVorgna echoed the president’s assessment in the wake of the new numbers. He also played down the need for more stimulus as negotiations have faltered (he said it was separate and called it an “insurance policy”).“The economy is already jumpstarted,” he said, predicting GDP growth at an annualized rate of 20% in the second half of 2020. LaVorgna also forecast that all or most of the lost jobs would return with a clear caveat: “if we stay on the course that the president has laid out.”The remarks came with only two more jobs reports scheduled to be released between now and the November election.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:July jobs report: Economy added back 1.763 million payrolls in July, unemployment rate fell to 10.2%Stocks open lower, July jobs report surprises to the upsideRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}