{"article": [{"url": "https://finance.yahoo.com/news/some-of-the-worlds-biggest-investors-are-paranoid-about-tech-stocks-getting-pounded-survey-115840891.html", "published": 1600153580.0, "headline": "Some of the world's biggest investors are 'paranoid' about tech stocks getting pounded: survey", "body": "The Wall Street whales are getting very worried about the 2020 hot tech trade.Money managers from around the world are “paranoid” about U.S. tech stocks, according to the latest fund manager survey out of Bank of America Merrill Lynch for September. The survey polled 224 money managers with $646 billion in assets under management.Fund managers didn’t stop there in voicing their caution, however. Some 80% of those polled stated being long U.S. tech stocks is now the most “crowded trade” of all-time. Further, a “tech bubble” is now the number two tail risk to markets after a potential COVID-19 second wave of infections.The dreary mood among money managers on tech — following a tremendous run this year as names such as Apple and Amazon have been viewed as safe-havens for investors during the pandemic —underscores a more challenging tech trade of late.(Photo Illustration by Omar Marques/SOPA Images/LightRocket via Getty Images)Month-to-date the Nasdaq Composite has dropped 5.2%, lagging the Dow Jones Industrial Average and S&P 500, according to Yahoo Finance Premium data. The pullback has been fueled by steep selloffs in momentum names like Tesla (-30%) and Advanced Micro Devices (-15%) on fears of over-valuation. Profit-taking in tech has also extended to less momentum stocks — the NYSE FANG+ Index (which tracks performance of Facebook, Apple, etc.) has shed nearly 10% since reaching a peak on Sept. 2.Pressure on tech stocks may persist in the near-term.“I think we need to have institutional investors stepping back in,” Laffer Tengler Investments Chief investment officer Nancy Tengler told Yahoo Finance’s The First Trade on when buying momentum may return to tech. “I think what you’ll see here is once we get through the noise of the election, we get some of the Robinhood traders back to work and the options trading dies down modestly I think what you will find is investors are looking at fundamentals. These are the best companies in the U.S. economy.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Story continuesLL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}