{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-covid-weekly-initial-jobless-claims-june-6-210917511.html", "published": 1591861160.0, "headline": "Jobless claims: Another 1.54 million Americans file for unemployment benefits", "body": "On the heels of the blowout May jobs report, market participants got another update on how the U.S. Labor Market is faring amid the ongoing COVID-19 crisis with the weekly jobless claims report Thursday morning.An additional 1.542 million Americans filed for unemployment benefits in the week ending June 6, below economists’ expectations for 1.55 million jobless claims. Weekly initial jobless claims have decelerated for 10 consecutive weeks. The prior week’s figure was revised higher to 1.897 million from the previously reported 1.88 million. Over the past 3 months, more than 44 million Americans have filed for unemployment insurance.Read more: Coronavirus: How to find a job in a tough economy(Yahoo Finance/David Foster)Continuing claims, which lags initial jobless claims data by one week, totaled 20.93 million in the week ending May 30 following 21.27 million in the prior week. Consensus expectations were for 20 million continuing claims.“Initial jobless claims continued the gradual downward trend,” Capital Economics wrote in a note Thursday. “But it is still hard to square the claims figures with the much more upbeat news on the labour market from May’s Employment Report.”“We suspect that claims look overly pessimistic because the massive boost to the value and duration of unemployment benefits and the relaxation of eligibility criteria have encouraged a much greater than normal proportion of the jobless to put in an application. Nevertheless, despite the discrepancy between the two measures, both tell the same broad story of a still near-unprecedented level of joblessness,” the firm added.In the week ending June 6, California reported the highest number of jobless claims at an estimated 258,000 on an unadjusted basis, up from 229,000 in the previous week. Georgia had 136,000, down from 149,000. Florida reported 111,000 and New York had roughly 94,000 jobless claims.Pandemic Unemployment Assistance (PUA) program claims, which include those who were previously ineligible for unemployment insurance such as self-employed and contracted workers, was closely monitored in Thursday’s report.Story continuesPUA claims totaled 705,676 on an unadjusted basis in the week ending June 6, down from the prior week’s 796,813.“A persistent decline in the PUA claims as we’ve seen in the regular claims data would further increase our conviction in the labor market stabilization and suggest processing backlogs have been cleared. Similarly, stabilization in PUA continuing claims would signal re-employment for gig workers, but this is not our base case in next week's report.”This week’s initial jobless claims data comes after the Bureau of Labor Statistics reported that the U.S. economy unexpectedly added 2.5 million nonfarm payrolls in May, exceeding economists expectations for 7.5 million job losses. The unemployment rate fell to 13.3% from 14.7% in April.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:A theory for why the 'startling' jobs numbers conflict with the other gloomy dataPopeyes US sales are making a massive comebackPapa John's and Domino's Pizza sales are soaringFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}