{"article": [{"url": "https://finance.yahoo.com/news/wirecard-files-insolvency-083745823.html", "published": 1593056720.0, "headline": "'The money's gone': Wirecard collapses owing $4 billion", "body": "By Arno Schuetze and John O'DonnellFRANKFURT (Reuters) - Wirecard collapsed on Thursday owing creditors almost $4 billion after disclosing a gaping hole in its books that its auditor EY said was the result of a sophisticated global fraud.The payments company filed for insolvency at a Munich court saying that, with 1.3 billion euros ($1.5 billion) of loans due within a week its survival as a going concern was \"not assured\".Wirecard's implosion came just seven days after EY, its auditor for more than a decade, refused to sign off on the 2019 accounts, forcing out Chief Executive Markus Braun and leading it to admit that $2.1 billion of its cash probably didn't exist.\"There are clear indications that this was an elaborate and sophisticated fraud involving multiple parties around the world,\" EY said in a statement.EY said while it was completing the 2019 audit, it was provided with false confirmations with regard to escrow accounts and reported them to the relevant authorities.Wirecard declined to comment following EY's statement.The financial technology company is the first member of Germany's prestigious DAX stock index to go bust, barely two years after winning a spot among the country's top 30 listed companies with a market valuation of $28 billion.\"The Wirecard case damages corporate Germany. It should be a wake-up call for reforms,\" said Volker Potthoff, chairman of corporate governance think-tank ArMID.Creditors have scant hope of getting back the 3.5 billion euros they are owed, sources familiar with the matter said. Of that total, Wirecard has borrowed 1.75 billion from 15 banks and issued 500 million in bonds.\"The money's gone,\" said one banker. \"We may recoup a few euros in a couple of years but will write off the loan now.\"'TOTAL DISASTER'The collapse of Wirecard, once one of the hottest fintech companies in Europe, dwarfs other German corporate failures. It has shaken the country's financial establishment with Felix Hufeld, head of regulator BaFin, calling it a \"total disaster\".Story continuesGerman Finance Minister Olaf Scholz described the collapse as a \"scandal\", acknowledging it was time to review regulation.\"We must rethink our supervisory structures,\" said Scholz, adding he had asked his ministry to come up with ideas in the next few days.\"If legal, legislative, regulatory measures are needed, we will embrace them and implement them,\" he said. \"A scandal like Wirecard is a wake-up call that we need more monitoring and oversight than we have today,\" he said.Wirecard shares, which were suspended ahead of an earlier announcement that it would seek creditor protection, crashed 80% when trading resumed. They have lost 98% since auditor EY questioned its accounts last Thursday.EY, one of the world's \"Big Four\" accountancy and consulting firms, faces a wave of litigation in a debacle that has drawn comparisons with Arthur Andersen's disastrous oversight of U.S. energy company Enron.German law firm Schirp & Partner said that with Wirecard now effectively sidelined, it would file class actions against EY on behalf of shareholders and bondholders.\"It is frightening how long Wirecard AG was able to operate without being objected to by the auditors,\" partner Wolfgang Schirp said.Wirecard's new management had been in crisis talks with creditors but pulled out on Thursday morning \"due to impending insolvency and over-indebtedness\".The insolvency filing did not include its Wirecard Bank subsidiary, which holds an estimated 1.4 billion euros in deposits and is already under emergency management by BaFin.'COMPLETE VINDICATION'A second source close to talks with creditors said although the company had a healthy core, it had faked two-thirds of its sales. This meant there was no way it could repay all its debt, notwithstanding all the legal challenges it will face.The ascent of Wirecard, which was founded in 1999 and is based in a Munich suburb, was dogged by allegations from whistleblowers, reporters and speculators that its revenue and profits had been pumped up through fake transactions.Braun fended off the critics for years before finally calling in outside auditor KPMG late last year to run an independent investigation.KPMG, which published its findings in April, was unable to verify 1 billion euros in cash balances, questioned Wirecard's acquisition accounting and said it could not trace hundreds of millions in cash advances to merchants.\"Today is a complete vindication for those that exposed the fraud,\" said Fraser Perring, who bet on a fall in Wirecard's shares and co-authored a 2016 report that alleged fraud.The Munich prosecutor's office, which is investigating Braun on suspicion of misrepresenting Wirecard's accounts and of market manipulation, said: \"We will now look at all possible criminal offences.\"Braun was arrested on Monday and released on bail of 5 million euros a day later. Former chief operating officer Jan Marsalek is also under suspicion and believed to be in the Philippines, according to justice officials there.(Additional reporting by Joern Poltz, Hans Seidenstuecker, Edward Taylor, Madeline Chambers; Writing by Douglas Busvine; Editing by Maria Sheahan and David Clarke)"}]}