{"article": [{"url": "https://finance.yahoo.com/news/more-than-50-percent-market-pros-covid-vaccine-ready-within-year-morning-brief-100646795.html", "published": 1595308460.0, "headline": "More than 50% of market pros think a vaccine will be ready within a year: Morning Brief", "body": "Tuesday, July 21, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. Subscribe‘Optimism on a vaccine has increased notably.’Positive news surrounding the development of a vaccine for COVID-19 continues.On Monday, The Lancet published promising results of a COVID-19 vaccine study by the University of Oxford and AstraZenaca. Pfizer and BioNTech also reported positive early data from their own COVID-19 vaccine study on Monday.The market’s reaction to the news was muted, though a massive rally in tech stocks dragged all three major indexes to gains to start the week.And the results of a recent survey from Deutsche Bank perhaps explain why investors did not take this news as a meaningful new catalyst for the market. Seeing these headlines instead as the kind of interim vaccine news that has increasingly been priced into stocks over the last few weeks.In its latest monthly sentiment survey of 500 market professionals from around the globe, Deutsche Bank found that some 56% of respondents believe a vaccine will be available within a year.More than half of respondents to Deutsche Bank's monthly investor sentiment survey think a vaccine will be available within a year, up sharply from expectations back in June. (Source: Deutsche Bank)Just one month ago, 37% of respondents believed a vaccine would be available within a year.The results of July’s survey also show investors have a near-universal view that a vaccine will be available by the end of next year, with 87% of respondents believing a vaccine would be available within 18 months.Of course, there is a distinct difference between the plain availability of a vaccine for COVID-19 and the widespread, effectively distributed presence of a vaccine for the virus.But even the existence of a working vaccine that could come over some kind of timeline be rolled out to the broader public would be a game changer for the pandemic. Though perhaps not a narrative-changer for the stock market.Back in May, we looked at a number of factors driving stocks higher, and in subsequent issues of the Morning Brief have come back to this theme, which has been top of mind for investors for months. Indeed it is the pressing concern of the moment — “Why are stocks higher if the economy is in the tank?”Story continuesEconomic data including retail sales suggests this question is misguided, as the market has indeed been following the economy’s better-than-feared path back towards pre-pandemic levels. And it also seems that optimism around a vaccine for the virus is increasingly part of the market’s base case for the next several quarters.Good news for average citizens. But perhaps a caution flag for bullish investors who think they’re unique in betting on a more optimistic scenario for the pandemic.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Chicago Fed National Activity Index, June (4.00 expected, 2.61 in May)EarningsPre-market5:55 a.m. ET: The Coca-Cola Company (KO) is expected to report adjusted earnings of 40 cents per share on revenue of $7.24 billion6:30 a.m. ET: Synchrony Financial (SYF) is expected to report adjusted earnings of 18 cents per share on revenue of $3.02 billion6:35 a.m. ET: Comerica Incorporated (CMA) is expected to report adjusted earnings of 22 cents per share on revenue of $696.2 million7:00 a.m. ET: Philip Morris International (PM) is expected to report adjusted earnings of $1.10 per share on revenue of $6.54 billion7:30 a.m. ET: Lockheed Martin (LMT) is expected to report adjusted earnings of $5.70 per share on revenue of $15.18 billionPost-market4:00 p.m. ET: Texas Instruments (TXN) is expected to report adjusted earnings of 86 cents per share on revenue of $2.94 billion4:00 p.m. ET: Robot (IRB) is expected to report adjusted earnings of 29 cents per share on revenue of $265 million4:05 p.m. ET: Capital One Financial (COF) is expected to report an adjusted loss of $1.53 per share on revenue of $6.82 billion4:10 p.m. ET: Snap (SNAP) is expected to report an adjusted loss of 10 cents per share on revenue of $440.42 million4:15 p.m. ET: Navient Corporation (NAVI) is expected to report adjusted earnings of 42 cents per share on revenue of $454 million4:15 p.m. ET: Avangrid (AGR) is expected to report adjusted earnings of 34 cents per share on revenue of $1.45 billion4:20 p.m. ET: United Airlines (UAL) is expected to report an adjusted loss of $9.18 per share on revenue of $1.27 billionTop NewsEU agrees on 'historic'$829 billion recovery package [Yahoo Finance UK]Jack Ma’s Ant seeks $200 billion value in landmark dual IPO [Bloomberg]Coronavirus clouds Novartis's 2020 outlook [Reuters]IBM earnings beat estimates on cloud strength [Reuters]YAHOO FINANCE HIGHLIGHTSTesla earnings: Why one bullish analyst has been dragging his feet on his price targetHow to waste $1 trillionMore businesses implement required mask policies: Home Depot, Lowe's, Gap, and more—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}