{"article": [{"url": "https://finance.yahoo.com/news/opendoor-and-other-i-buyers-sales-stall-despite-hot-housing-market-175806818.html", "published": 1602075980.0, "headline": "Opendoor and other iBuyers' sales stall despite hot housing market", "body": "Photo provided by Opendoor media assets, Sheila Tran.Opendoor, a San-Francisco-based digital home buyer and seller, received a $4.8 billion valuation when it went public three weeks ago, and it is the largest iBuyer in the U.S., based on market share — but 2020 isn’t expected to be a winning sales year for the so-called “Amazon of Housing.”Despite a hot housing market this summer and fall, iBuyers — online homebuyers and sellers — project meager sales for the rest of the year. Most iBuyers drastically cut their inventory when they paused buying in March and April — and now, they don’t have enough homes available in stock to meet buyer demand.“March hit and, like everyone, we had to quickly figure out how to keep employees and customers safe,” said Opendoor chief product officer Tom Willerer. “The way our business works is that there is a lag in resale and a lag in revenue. You acquire a house and 90 days later, you resell it… Now we are building back up inventory and serving more customers.”Opendoor plans to sell 300 to 400 homes a month through the end of the year, with a total sales goal of 1,841 homes in the second half of 2020 (operations were still mostly closed in July and the first half of August). That’s a quarter of the company’s sales pace in 2019, when the company sold more than 1500 homes a month.“If you look at Opendoor’s numbers, they projected almost negative 50% [-49%] year-over-year growth in 2020. That seems like a bigger loss than what I would have expected,” said Sumant Sridharan, COO of Homelight, a platform that works with over 250 iBuyers including their own iBuy product. Sridharan added that those estimates may be conservative.LAUDERHILL, FLORIDA - AUGUST 20: (L-R) Claudia Teyssandier, Zillow Offers Renovation Estimator, and J Myers, Zillow Offers National Renovation Manager, evaluate a home for a possible purchase by Zillow on August 20, 2019 in Lauderhill, Florida. (Photo by Joe Raedle/Getty Images)‘Inventory levels will take a while to come back’Top iBuyers reduced inventory levels by 75%-90% during the pandemic. Though they have begun to rebuild their stock, iBuyers have fewer homes available to sell and less potential for profit through the end of 2020.“The key is inventory. We have to buy enough to sell and perform the way we want,” said Jason Aleem, head of real estate operations at RedfinNOW, iBuyer division of brokerage Redfin.Story continuesBy the end of the second quarter, Opendoor had a fifth of the inventory it started the year with — $264 million worth of homes compared to $1.3 billion on December 31, 2019.But that’s actually high, proportionally, compared to other iBuyers. Zillow shed 84% of its inventory, holding only $135.4 million as of June 30 compared to $836.6 million at the end of 2019. And RedfinNOW reduced their inventory 88% from 74.6 million at the end of 2019 to 9.4 million in assets as of June 30. Arizona-based Offerpad, another prominent iBuyer, has not disclosed sales numbers or projections for 2020.“Inventory levels will take a while to come back, since we shut the factory down completely,” said Jeremy Wacksman, president of the Zillow Group, an online listing website with iBuying services. Zillow expects a significant decline in the number of properties sold during the third quarter of 2020 compared to the second quarter of 2020 and the third quarter of 2019, according to a financial filing.SEATTLE, WA - OCTOBER 31: A Redfin real estate yard sign is pictured in front of a house on October 31, 2017 in Seattle, Washington. (Photo by Stephen Brashear/Getty Images for Redfin)But Opendoor and other iBuyers aren’t rushing to replenish inventory as the housing market outpaces the rest of the economy — pending, existing and new home sales were at an all-time high in August and prices rose as demand far outpaces supply.“One of the unexpected things early out of the pandemic is an incredibly strong housing market through economic turmoil,” said Wacksman at Zillow.Though the housing market is booming, conditions are uncertain in states where coronavirus infection rates are rising. Opendoor was slow to re-enter some markets, buying and selling in only seven markets over the summer before reopening in all 21 markets on August 18.“A lot of it has to do with the capital risk iBuyers want to take on. In March and April, they didn’t want to take on more capital risk,” said Homelight’s Sridharan. “Then after that, iBuyers and investors tiptoed back into the market.”“It’s totally about risk management,” said Aleem at RedfinNOW, “being able to forecast a future sale, make a purchase at the right value and be able to resell it in 30, 60 or 90 days — you have to manage risk.”So instead of risking entering a booming but unpredictable market, Opendoor and other iBuyers will take losses through the end of the year. Opendoor does not expect to return to pre-pandemic revenue levels until the end of 2021, according to the company’s S-4, filed Monday.“As our revenues are dependent on inventory levels available for sale, we expect our near-term revenues to be pressured due to limited inventory,” said the statement.Photo provided by Opendoor media assets, Sheila Tran.Future looks promisingBut every company Yahoo Finance interviewed for this article was bullish on the future of iBuying as digital buyers and sellers emerge from 2020 and 2021.The coronavirus pandemic only accelerated demand for and adoption of contactless, digital technology in real estate. And iBuy options can shelter families from exposure to the novel coronavirus by giving instant offers, instead of allowing strangers to traipse through their living space during open houses.“iBuying is attractive during COVID. People don’t want to have open houses,” said Sridharan.iBuyers like Opendoor made their processes even easier during the pandemic by replacing in-person indoor home inspections with video walkthroughs. Opendoor is now testing options for customers to replace synchronous assessments altogether by taking pictures of their home and uploading them to Opendoor for assessment.“The pandemic was the catalyst to accelerate many of the things we think are good long-term vision. More millennials are becoming homeowners and are looking for all-digital solutions,” said Willerer at Opendoor. “Real estate has been long overdue for this kind of innovation and COVID helped accelerate work under way to digitize the process.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Home searches reveal that swing states may turn blue on Election Day: Realtor.comThe cities most at risk of a housing bubble: UBSMost Latinos still believe in the American Dream of owning a home: report"}]}