{"article": [{"url": "https://finance.yahoo.com/news/ghost-of-tsushima-review-143939395.html", "published": 1594720040.0, "headline": "‘Ghost of Tsushima’ review: The PlayStation 4’s big send-off", "body": "'Ghost of Tsushima' serves as a fitting send-off for Sony's PlayStation 4 era, packing beautiful visuals and a powerful story. (Image: Sony)Sony’s “Ghost of Tsushima” is the company’s last blockbuster of the PlayStation 4 era. The 7-year-old system is set to be replaced by the PlayStation 5 later this year, though Sony will still put out games for the console for some time afterwards.And as the final major exclusive release for Sony’s [SNE] PS4, “Ghost of Tsushima” has a lot to live up to. Thankfully for Sony, it serves as a fitting send-off for the console, offering an absurdly beautiful and varied world set in feudal Japan rife with homages to classic samurai films by the likes of Akira Kurosawa. There’s even a special black and white Kurosawa mode.It’s not perfect, but the breadth of quests and stories make it a satisfying title worthy of your time.The Ghost“Ghost of Tsushima” is a massive, and gorgeous, open-world game that takes place amid the first Mongol invasion of Japan in about 1274. You play as a young samurai named Jin Sakai, who survives a massacre when the Mongols first landed on Tsushima, an island located between Korea and Japan where the game takes place.Jin’s story follows the conflict but is largely about confronting his painful past and moving beyond the expectations set for him by his uncle, and surrogate father, the samurai Lord Shimura.Jin Sakai must take back Tsushima from the Mongol invaders with the help of his comrades. (Image: Sony)Shimura believes a samurai must face his or her enemies head on. But the Mongols force Jin to resort to stealthy assassinations and trickery, tactics his uncle detests.If it’s not clear yet, Jin is the titular “Ghost of Tsushima” who gains the name and notoriety using the same methods his uncle finds repugnant. That said, you also have the choice to either approach your enemies head on or take them down silently.Silent or standoffGo the silent route, and you’ll have to sneak through Mongol camps, while hiding in tall grass and behind any structures that offer even a hint of cover. Coming up behind enemies and cutting them down without being seen is the safest route to go but takes skill.To ensure you stay hidden, you’ll be able to pull from a slew of items and abilities ranging from windchimes that distract guards to assassinating multiple targets at once.Story continuesIf you’re looking for a more upfront approach to enemies, you can instead choose to initiate a standoff at the beginning of an encounter. Ripped right from classic samurai films, standoffs see you call out your enemy to face you head on.The world of 'Ghost of Tsushima' is as huge as it is gorgeous. (Image: Sony)You’ll then have to hold down the attack button until you see the enemy begin to make his move. Then you release and, if your timing is right, cut him down in a single strike. Once you do that, though, you’re going to need to face all of the remaining enemies around you.As you advance through the game, you’ll add a number of formidable skills to your repertoire. In fact, the number of abilities you learn can, at times, feels overwhelming.For instance, you’ll learn new fighting stances meant for specific opponents. The water stance, for instance, is best for enemies with shields, while the stone stance will help with enemies wielding swords.You’ll also need to parry your opponent’s attacks at just the right moment, to knock them back, and build up Jin’s resolve, which you need to replenish your health. Then there are consumable weapons including kunai, arrows, and smoke bombs that you can use to either down or confuse enemies midfight.The water stance is best used against enemies with shields. (Image: Sony)It’s all a lot to take in, and can leave you throwing random weapons out as you attempt to dodge enemies coming at you one after another. Eventually, though, you’ll settle into a groove with the fighting style that works best for you.My main issue with “Ghost of Tsushima’s” combat is that you can’t, for some reason, lock onto individual enemies. I understand the desire to make fighting feel as fluid as possible, but this simply complicates each encounter.I’ve found myself fighting while facing directly into the camera, making it impossible to see who I was swinging at if anyone at all. It’s really the one major change I wish Sucker Punch would have made.So much to seeBut fighting is only part of “Ghost of Tsushima.” The game world is so vast and beautiful that I regularly found myself taking random detours to explore new Shinto shrines or bathe in a nearby hot spring. Every path you take seems to open up to a previously undiscovered location.Each new locale also unlocks additional side quests, which end up piling up in your queue. You also have the option of taking on mythical quests to unlock special battle skills or accessories. There are even opportunities to compose haikus in certain areas.You'll unlock a huge number of upgrades for Jin and his skills. (Image: Sony)To say this game is packed with things to do is an understatement.Most players won’t come anywhere near completing “Ghost of Tsushima’s” various side quests, but they’re certainly worth at least checking out for their varied stories and locales.Should you get it?“Ghost of Tsushima” is a fitting farewell for the PS4. It offers an incredibly vast world to explore, fluid combat, and more quests than you’ll likely have time to get to. And despite my issue with the lack of a locking system for fights, this is certainly a title worth getting.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:‘Assassin’s Creed Valhalla preview: Ubisoft looks to perfect its series’ formulaThe best gadgets for the beach and pool: Tech SupportWhat is Palantir, and can it really predict crime?How to delete your Facebook, Instagram, and WhatsApp accountsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}