{"article": [{"url": "https://finance.yahoo.com/news/fed-extends-ban-on-share-buybacks-at-big-banks-through-q-4-201520184.html", "published": 1601479400.0, "headline": "Fed extends ban on share buybacks at big banks through Q4", "body": "The Federal Reserve said Wednesday that it will extend its ban on share buybacks at the largest U.S. banks, although banks will still be allowed to pay out dividends.The Fed said in a statement that the measures are “to ensure that large banks maintain a high level of capital resilience.”In late June, the central bank completed its annual stress tests and concluded that the country’s 33 largest banks appeared to have enough cushion to deal with a harsh economic downturn. But the regulator banned share buybacks for the third quarter as a precautionary measure.In that decision, the Fed continued to permit dividend payments but only up to a cap (either the amount paid in the previous quarter or the quarterly average of income made over the last four quarters, whichever is less).Jerome Powell, chairman of the U.S. Federal Reserve, wears a protective mask during a House Select Subcommittee on the Coronavirus Crisis hearing in Washington, D.C., U.S., September 23, 2020. Stefani Reynolds/Pool via REUTERSThe Fed’s announcement Wednesday extends the buyback ban and maintains the cap on dividend payments into the fourth quarter of this year.The decision to extend the share buyback and dividend limitations through the fourth quarter was agreed to by four of the five members of the Federal Reserve’s Board of Governors. Lael Brainard, who also dissented against the action in June, dissented against the decision Wednesday.Brainard had argued in June that she would have liked to see a ban on dividend payments entirely, arguing at the time that allowing distributions of any sort “raises the risk they will need to tighten credit or rebuild capital during the recovery.”Federal Reserve Board Governor Lael Brainard speaks at the John F. Kennedy School of Government at Harvard University in Cambridge, Massachusetts, U.S., March 1, 2017. REUTERS/Brian SnyderThe Fed had left open the possibility that it would extends its capital distribution restrictions, but some banks were still hopeful they could resume buybacks by the fourth quarter. JPMorgan Chase (JPM) CFO Jennifer Piepszak said Sept. 15 she “wouldn’t rule out share buybacks” if regulators permitted it in the fourth quarter.The announcement comes as the Fed undergoes a second stress test, which policymakers launched in an effort to provide a second look at banks through this unprecedented COVID-19 crisis.Story continuesThe Fed said Wednesday the results from that second stress test will be released “by the end of the year.”Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed survey: Racial wealth gaps little changed since 2016Boston Fed's Rosengren: Further QE could help economy, but not as much as fiscal policyCongress debates leaning on Fed or PPP for small business aidPowell pushes on 'very strong, very powerful' guidance on interest ratesFed signals interest rates to stay near-zero through 2023A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}