{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-cdc-changes-then-deletes-new-guidance-on-airborne-transmission-164441858.html", "published": 1600689140.0, "headline": "Coronavirus update: CDC changes — then deletes — new guidance on airborne transmission", "body": "The U.S. Centers for Disease Control and Prevention (CDC) on Monday sowed confusion over its stance on the airborne transmission of the coronavirus, by publishing — and then removing — new guidance that suggested the virus can spread beyond the 6-foot parameter that’s become commonly accepted in social distancing policy.The agency quietly pulled the new guidance, which marked a significant shift in understanding of how the virus has spread. Previously, the CDC said the virus spread through direct exposure and inhalation of droplets only within about six feet of another person.But recently, scientific research has advanced the idea that infected aerosol particles can linger in the air for longer than previously thought — something the CDC appeared to acknowledge before it reversed itself, saying the new language was posted by mistake, and was simply a draft version. It later told The Washington Post that the guidelines were wrong.The move has some experts concerned.Dr. Howard Koh, a former U.S.Health and Human Services (HHS) assistant secretary, said the information was correct and needed to be published soon. He added that even if it was mistakenly posted early, there have been too many redactions and reversals during the pandemic for experts not to be wary.“To rectify the latest challenge, the CDC must acknowledge that growing scientific evidence indicates the importance of airborne transmission through aerosols, making mask wearing even more critical as we head into the difficult fall and winter season,” Koh said.According to epidemiologist Dr. Eric Feigl-Ding, the new developments mean that six feet may not be enough of a distance, especially in indoor spaces — and that there had been growing convergence on that point among scientists around the world for months.But the CDC’s reversal, even if temporary, is both shocking and expected, Feigl-Ding said.“I don’t understand what there is to politically gain by denying the existence of aerosol transmission. At this point, trust in the CDC and FDA are just so woefully deficient,” he told Yahoo Finance Monday.Story continuesThe CDC’s head-spinning shift stirred new controversy in the increasingly politicized battle over how the U.S. is addressing the COVID-19 crisis. The agency has come under fire for its contradictory messages on testing asymptomatic carriers, masking, and the rapid moves to develop an effective vaccine.Coronavirus cases are up in several parts of the U.S. (Graphic: David Foster/Yahoo Finance)Political pressure on the approval or authorization of a coronavirus cure continues to be a concern, even as health officials and pharmaceutical companies have pledged to maintain strong standards for safety and efficacy.But as some experts feared, there aren’t enough defenses against political pressure. A new report from U.S. Health and Human Services (HHS) Sec. Alex Azar spells out his authority over the Food and Drug Administration (FDA), and clears the path for an expedited emergency use authorization of any vaccine.In a Sept. 15 memo, Azar declared that any new rules for the health agencies under HHS, including FDA, could only be signed by himself, according to a report in the New York Times.Yet experts had warned that Azar’s authority supersedes FDA Commissioner Stephen Hahn, throwing into question the FDA’s credibility and ability to fight political pressure to authorize a vaccine that may not be truly safe and effective, even as several officials — including Hahn — committing to uphold gold standards of approval.Existing regulations already allow Azar to override Hahn, if he deems the product can “protect the public health” and there is already a public health emergency declaration.While HHS has said the Sept. 15 memo will have no effect on coronavirus vaccines, experts are wary of the impact and are watching how the department ultimately handles vaccine approvals.Koh recently told Yahoo Finance that the significant erosion of trust and confidence in the FDA is concerning amid the pandemic.The lack of national coordination of information and dissemination through the top health officials, hosted by the White House, is hampering the nation’s response, Koh said.“In a time like this...we need coordination and a one nation approach more now than ever before,” Koh said.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}