{"article": [{"url": "https://finance.yahoo.com/news/netflix-stock-shoots-11-6-211422291.html", "published": 1598458940.0, "headline": "Netflix Stock Shoots Up 11.6% to Near All-Time High on Optimism for Growth", "body": "Investors mounted a new rally behind Netflix, with shares of the streamer jumping 11.6% on Wednesday, to close at $547.53 per share, near the stock’s all-time high.The bump gives Netflix a market capitalization of more than $241 billion, and the stock is just shy of its peak closing price of $548.73 per share on July 10 on enthusiasm ahead of second-quarter earnings. Shares were buoyed by new optimism in the company’s ability to hold on to much of its huge subscriber gains in the first half of 2020 from COVID stay-at-home orders.Netflix added nearly 25.9 million net new subscribers worldwide in the first six months of the year, citing the coronavirus pandemic as providing unexpected tailwinds. While the company told investors it expects a slower growth in the back half of 2020, many investors are expecting the COVID bump to be long-lasting.Netflix’s stock rose amid a broader rise by tech-related stocks Wednesday, led by Facebook (up 8.2%) with gains also posted by Amazon (+2.85%), Google (+2.8%) and Apple (+1.4%). The Dow Industrial Average Index rose 0.3% for the day.Investors pumped up Netflix shares after Piper Sandler analyst Yung Kim published an upbeat research note Tuesday. The firm’s proprietary consumer research found that Netflix led the streaming field as the No. 1 service people plan to keep post-COVID, and showed an increased willingness among subscribers to pay more for Netflix.“Netflix has furthered its position as the go-to streaming option,” Kim wrote in the note. “[W]hile we recognize some of the record-setting sub adds were pulled forward, we also believe the trend was an acceleration of an ongoing shift from broadcast TV to streaming.”Per Piper Sandler’s survey of 1,000 U.S. consumers asking “What video services will you use after stay-at-home rules ease?” Netflix was the clear top choice — with 41% citing the service as a keeper. That was well above other streaming services on the survey, trailed by Amazon Prime Video (28%), Hulu (20%), Disney Plus (17%) and HBO Max (7%).Story continuesIn addition, the analyst firm’s separate survey of 600 consumers found that 52% of Netflix subscribers said they would pay more for the service (an average of $2.20 more per month), up from 50% in a similar survey in February 2020.Piper Sandler’s Kim anticipates Netflix next raising prices within the next 12-24 months on its increasing pricing power. Currently, Netflix’s most popular plan (with two HD streams) is $12.99 per month in the U.S., after a rolling price hike last year. Kim said HBO Max’s launch at $15 per month “will validate the idea that Netflix can raise pricing, given we see HBO Max as the most similar standalone streaming service to Netflix.”Other research has found Netflix’s pricing power has increased this year. A Cowen & Co. survey in May 2020 found 55% of Netflix customers were willing to pay more (versus 47% in December 2019). In addition, among respondents who stream more than 7 hours per week of Netflix content, willingness to pay more rose from 52% to 60% over the same time frame."}]}