{"article": [{"url": "https://finance.yahoo.com/news/dicks-sporting-goods-reports-record-113000976.html", "published": 1598423900.0, "headline": "DICK'S Sporting Goods Reports Record Quarterly Sales and Earnings in Second Quarter 2020; Delivers 20.7% Increase in Same Store Sales", "body": "- Second quarter 2020 earnings per diluted share of $3.12 and non-GAAP earnings per diluted share of $3.21 , increased 148% and 155%, respectively, versus $1.26 per diluted share in the prior year- eCommerce sales increased 194% during the second quarter of 2020, including Curbside Contactless Pickup, as compared to the second quarter of 2019- Company is in a strong financial position, ending the quarter with cash and cash equivalents of $1.1 billion and no outstanding borrowings on its $1.855 billion revolving credit facility- Through the first three weeks of the third quarter of 2020, the Company's consolidated same store sales increased 11%PITTSBURGH , Aug. 26, 2020 /PRNewswire/ -- DICK'S Sporting Goods, Inc. (NYSE: DKS), the largest U.S. based full-line omni-channel sporting goods retailer, today reported sales and earnings results for the second quarter ended August 1, 2020.DICK'S Sporting Goods Logo. (PRNewsfoto/DICK'S Sporting Goods, Inc.) Second Quarter Results The Company reported consolidated net income for the second quarter ended August 1, 2020 of $276.8 million , or $3.12 per diluted share. As a result of actions taken to prioritize the health and well-being of its teammates and athletes, the Company incurred approximately $42 million of incremental teammate compensation and safety costs during the current quarter. This was partially offset by the recovery of $28 million of inventory write-downs recorded in the first quarter due to the Company's strong second quarter sales. The net impact of these items resulted in approximately $14 million of pre-tax expenses, or $0.12 per diluted share, during the current quarter. The Company reported consolidated net income for the second quarter ended August 3, 2019 of $112.5 million , or $1.26 per diluted share.On a non-GAAP basis, the Company reported consolidated net income for the second quarter ended August 1, 2020 of $281.7 million , or $3.21 per diluted share. Second quarter 2020 non-GAAP results exclude non-cash amortization of the debt discount associated with the Company's convertible senior notes, as well as the share impact of the convertible note hedge purchased by the Company, which is antidilutive for GAAP purposes. The GAAP to non-GAAP reconciliations are included in a table later in the release under the heading \"GAAP to Non-GAAP Reconciliations.\"Story continuesNet sales for the second quarter of 2020 increased 20.1% to approximately $2.71 billion . Consolidated same store sales increased 20.7%, even with approximately 15% of the Company's stores closed on average. eCommerce sales increased 194%, including Curbside Contactless Pickup. eCommerce penetration for the second quarter of 2020 was approximately 30% of total net sales, compared to approximately 12% during the second quarter of 2019. Second quarter 2019 consolidated same store sales increased 3.2%.\"We had an exceptionally strong Q2 in which we delivered our highest ever quarterly sales and earnings. These results are a testament to the hard work and dedication of our teammates, who reacted quickly to favorable shifts in consumer demand throughout the quarter,\" said Edward W. Stack , Chairman and Chief Executive Officer. \"During this pandemic, the importance of health and fitness has accelerated and participation in socially distant, outdoor activities has increased. There has also been a greater shift toward athletic and active lifestyle product with people spending more time working and exercising at home. The majority of our assortment sits squarely at the center of these trends, and while mindful of the uncertainty in the current environment, we are in a great lane right now.\"Lauren R. Hobart , President, added, \"Our Q2 comps were supported by increases in both average ticket and transactions, as well as growth across each of our three primary categories of hardlines, apparel and footwear. By the end of June, we re-opened 100% of our stores to the public, while continuing to prioritize the health and well-being of our teammates and athletes. As our stores re-opened, we saw the power of our industry-leading omni-channel platform. We delivered positive double-digit brick-and-mortar store comps during both June and July, and our eCommerce sales remained very strong, increasing nearly 200% for the quarter. In recognition of our hourly store and distribution center teammates' efforts, which helped make these results possible, we recently announced the 15% pay premium will be extended through the end of the year.\"Mr. Stack concluded, \"The favorable shifts in consumer demand that drove our strong comps during Q2 have continued into Q3 but have been partially offset by softness across key back-to-school categories because of the uncertain timing of a return to school and fall team sports. Taken together, through the first three weeks of Q3, our consolidated comp sales have increased 11%, which demonstrates the strength of our diverse category portfolio.\" Balance Sheet The Company ended the second quarter of 2020 with $1.1 billion in cash and cash equivalents and no outstanding borrowings under its $1.855 billion revolving credit facility, repaying the $1.4 billion of borrowings that were outstanding at the end of the first quarter. In April, the Company issued $575 million aggregate principal amount of 3.25% Convertible Senior Notes, which added over $500 million of net proceeds to its cash position.Total inventory decreased 12.2% at the end of the second quarter of 2020 as compared to the end of the second quarter of 2019. Year-to-Date Results The Company reported consolidated net income for the 26 weeks ended August 1, 2020 of $133.4 million , or $1.53 per diluted share. As a result of actions taken to prioritize the health and well-being of its teammates and athletes, the Company incurred approximately $76 million , or $0.65 per diluted share, of incremental teammate compensation and safety costs during the 26 weeks ended August 1, 2020 . For the 26 weeks ended August 3, 2019 , the Company reported consolidated net income of $170.1 million , or $1.85 per diluted share.On a non-GAAP basis, the Company reported consolidated net income for the 26 weeks ended August 1, 2020 of $139.1 million , or $1.60 per diluted share, which excludes non-cash amortization of the debt discount associated with the Company's convertible senior notes, as well as the share impact of the convertible note hedge purchased by the Company, which is antidilutive for GAAP purposes. For the 26 weeks ended August 3, 2019 , the Company reported consolidated net income of $171.0 million , or $1.86 per diluted share, excluding a non-cash asset impairment and the favorable settlement of a litigation contingency. The GAAP to non-GAAP reconciliations are included in a table later in the release under the heading \"GAAP to Non-GAAP Reconciliations.\"Net sales for the 26 weeks ended August 1, 2020 decreased 3.2% to approximately $4.05 billion . Despite temporary store closures during March, April and May to help prevent the spread of COVID-19, consolidated same store sales decreased only 2.3%. eCommerce sales increased 154%, including Curbside Contactless Pickup. eCommerce penetration for the 26 weeks ended August 1, 2020 was approximately 33% of total net sales, compared to approximately 12% during the 26 weeks ended August 3, 2019 . Consolidated same store sales increased 1.7% for the 26 weeks ended August 3, 2019 . Capital Allocation On June 10, 2020 , the Company reinstated its dividend program, declaring a dividend of $0.3125 per share on its Common Stock and Class B Common Stock. The dividend was paid on June 30, 2020 .On August 21, 2020 , the Company's Board of Directors authorized and declared a quarterly dividend in the amount of $0.3125 per share on the Company's Common Stock and Class B Common Stock. The dividend is payable in cash on September 25, 2020 to stockholders of record at the close of business on September 11, 2020 .During the second quarter of 2020, the Company did not repurchase shares of its common stock. The Company may resume opportunistic share repurchases under its existing authorizations of $1.0 billion . Full Year 2020 Outlook As previously announced on March 19, 2020 , the Company withdrew its fiscal 2020 outlook. The Company is not providing an updated outlook at this time. Conference Call Info The Company will host a conference call today at 10:00 a.m. Eastern Time to discuss the second quarter results. Investors will have the opportunity to listen to the earnings conference call over the internet through the Company's website located at investors.DICKS.com . To listen to the live call, please go to the website at least fifteen minutes early to register, download, and install any necessary audio software. For those who cannot listen to the live webcast, it will be archived on the Company's website for approximately twelve months. Non-GAAP Financial Measures In addition to reporting the Company's financial results in accordance with generally accepted accounting principles (\"GAAP\"), the Company reports certain financial results that differ from what is reported under GAAP. These non-GAAP financial measures include consolidated non-GAAP net income, non-GAAP earnings per diluted share, and net capital expenditures, which management believes provides investors with useful supplemental information to evaluate the Company's ongoing operations and to compare with past and future periods. Management believes that excluding non-cash debt discount amortization and the diluted shares from its convertible senior notes is useful to investors because it provides a more complete view of the economics of the transaction and the offsetting share benefit received from the convertible note hedge. Management also uses certain non-GAAP measures internally for forecasting, budgeting, and measuring its operating performance. These measures should be viewed as supplementing, and not as an alternative or substitute for, the Company's financial results prepared in accordance with GAAP. The methods used by the Company to calculate its non-GAAP financial measures may differ significantly from methods used by other companies to compute similar measures. As a result, any non-GAAP financial measures presented herein may not be comparable to similar measures provided by other companies. A reconciliation of the Company's non-GAAP measures to the most directly comparable GAAP financial measures are provided below and on the Company's website at investors.DICKS.com. Fiscal 2020 Consolidated Same Store Sales Consolidated same store sales include stores that were temporarily closed as a result of COVID-19. The method of calculating consolidated same store sales varies across the retail industry, including the treatment of temporary store closures as a result of COVID-19. Accordingly, our method of calculating this metric may not be the same as other retailers' methods. For additional information on consolidated same store sales, please see our most recent Annual Report on Form 10-K, and any subsequent Quarterly Reports on Form 10-Q, filed with the Securities and Exchange Commission. Forward-Looking Statements Involving Known and Unknown Risks and Uncertainties This release contains forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are subject to risks and uncertainties and change based on various important factors, many of which may be beyond the Company's control. The Company's future performance and actual results may differ materially from those expressed or implied in such forward-looking statements. Forward-looking statements should not be relied upon by investors as a prediction of actual results. Forward-looking statements include statements regarding, among other things, the Company's future performance, liquidity, and share repurchases and dividends.Factors that could cause actual results to differ materially from those expressed or implied in any forward-looking statements include, but are not limited to: the impact on our business, operations and financial results due to the duration and scope of the COVID-19 pandemic, including whether there is a second wave or periods of increases in the number of COVID-19 cases in areas in which we operate, and the restrictions imposed by federal, state, and local governments in response to the pandemic; changes in consumer discretionary spending, including those caused by COVID-19; store closures and other impacts to our business resulting from civil disturbances; investments in omni-channel growth not producing the anticipated benefits within the expected time-frame or at all; risks relating to private brands and new retail concepts; investments in business transformation initiatives not producing the anticipated benefits within the expected time-frame or at all; the amount devoted to strategic investments and the timing and success of those investments; the results of the strategic review of the hunt business, including Field & Stream; inventory turn; changes in the competitive market and competition amongst retailers, including an increase in promotional activity; changes in consumer demand or shopping patterns and the ability to identify new trends and have the right trending products in stores and online, including changes caused by COVID-19; changes in existing tax, labor, foreign trade and other laws and regulations, including those imposing new taxes, surcharges, or tariffs; limitations on the availability of attractive retail store sites; unauthorized disclosure of sensitive or confidential customer information; website downtime, disruptions or other problems with the eCommerce platform, including interruptions, delays or downtime caused by high volumes of users or transactions, deficiencies in design or implementation, or platform enhancements; disruptions or other problems with information systems; factors affecting vendors, including supply chain and currency risks; talent needs and the loss of Edward W. Stack , Chairman and Chief Executive Officer; developments with sports leagues, professional athletes or sports superstars, including disruptions and cancellations due to COVID-19; weather-related disruptions and seasonality of the Company's business; and risks associated with being a controlled company.For additional information on these and other factors that could affect the Company's actual results, see the risk factors set forth in the Company's filings with the Securities and Exchange Commission (\"SEC\"), including the most recent Annual Report filed with the SEC on March 20, 2020 and our Quarterly Report filed with the SEC on June 3, 2020 . The Company disclaims and does not undertake any obligation to update or revise any forward-looking statement in this press release, except as required by applicable law or regulation. Forward-looking statements included in this release are made as of the date of this release. About DICK'S Sporting Goods, Inc. Founded in 1948, DICK'S Sporting Goods, Inc. is a leading omni-channel sporting goods retailer offering an extensive assortment of authentic, high-quality sports equipment, apparel, footwear and accessories. As of August 1, 2020, the Company operated 726 DICK'S Sporting Goods locations across the United States , serving and inspiring athletes and outdoor enthusiasts to achieve their personal best through a blend of dedicated teammates, in-store services and unique specialty shop-in-shops dedicated to Team Sports, Athletic Apparel, Golf, Lodge/Outdoor, Fitness and Footwear.Headquartered in Pittsburgh, PA , DICK'S also owns and operates Golf Galaxy and Field & Stream specialty stores, as well as GameChanger, a youth sports mobile app for scheduling, communications and live scorekeeping. DICK'S offers its products through a content-rich eCommerce platform that is integrated with its store network and provides customers with the convenience and expertise of a 24-hour storefront. For more information, visit the Investor Relations page at dicks.com . Contacts: Investor Relations: Nate Gilch , Senior Director of Investor Relations DICK'S Sporting Goods, Inc. investors@dcsg.com (724) 273-3400Media Relations: (724) 273-5552 or press@dcsg.com Category: Financial DICK'S SPORTING GOODS, INC. AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF INCOME - UNAUDITED (In thousands, except per share data) 13 Weeks Ended August 1, 2020 % of Sales (2) August 3, 2019 % of Sales (2) Net sales $ 2,713,372 100.00 % $ 2,259,212 100.00 % Cost of goods sold, including occupancy and distribution costs (1) 1,776,497 65.47 1,582,141 70.03 GROSS PROFIT 936,875 34.53 677,071 29.97 Selling, general and administrative expenses 543,033 20.01 521,072 23.06 Pre-opening expenses 2,485 0.09 996 0.04 INCOME FROM OPERATIONS 391,357 14.42 155,003 6.86 Interest expense 14,682 0.54 5,550 0.25 Other income (14,508) (0.53) (1,582) (0.07) INCOME BEFORE INCOME TAXES 391,183 14.42 151,035 6.69 Provision for income taxes 114,340 4.21 38,501 1.70 NET INCOME $ 276,843 10.20 % $ 112,534 4.98 % EARNINGS PER COMMON SHARE: Basic $ 3.29 $ 1.28 Diluted $ 3.12 $ 1.26 WEIGHTED AVERAGE COMMON SHARES OUTSTANDING: Basic 84,130 88,080 Diluted 88,826 89,400 (1) Cost of goods sold includes: the cost of merchandise (inclusive of vendor allowances, inventory shrinkage and inventory write-downs for the lower of cost and net realizable value); freight; distribution; shipping; and store occupancy costs. The Company defines merchandise margin as net sales less the cost of merchandise sold. (2) Column does not add due to rounding DICK'S SPORTING GOODS, INC. AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF INCOME - UNAUDITED (In thousands, except per share data) 26 Weeks Ended August 1, 2020 % of Sales (2) August 3, 2019 % of Sales Net sales $ 4,046,600 100.00 % $ 4,179,889 100.00 % Cost of goods sold, including occupancy and distribution costs (1) 2,890,397 71.43 2,939,009 70.31 GROSS PROFIT 1,156,203 28.57 1,240,880 29.69 Selling, general and administrative expenses 946,254 23.38 1,008,230 24.12 Pre-opening expenses 4,765 0.12 1,574 0.04 INCOME FROM OPERATIONS 205,184 5.07 231,076 5.53 Interest expense 22,727 0.56 8,631 0.21 Other income (986) (0.02) (8,320) (0.20) INCOME BEFORE INCOME TAXES 183,443 4.53 230,765 5.52 Provision for income taxes 50,022 1.24 60,706 1.45 NET INCOME $ 133,421 3.30 % $ 170,059 4.07 % EARNINGS PER COMMON SHARE: Basic $ 1.59 $ 1.88 Diluted $ 1.53 $ 1.85 WEIGHTED AVERAGE COMMON SHARES OUTSTANDING: Basic 83,932 90,483 Diluted 87,360 91,894 (1) Cost of goods sold includes: the cost of merchandise (inclusive of vendor allowances, inventory shrinkage and inventory write-downs for the lower of cost and net realizable value); freight; distribution; shipping; and store occupancy costs. The Company defines merchandise margin as net sales less the cost of merchandise sold. (2) Column does not add due to rounding DICK'S SPORTING GOODS, INC. AND SUBSIDIARIES CONSOLIDATED BALANCE SHEETS - UNAUDITED (In thousands) August 1, 2020 August 3, 2019 February 1, 2020 ASSETS CURRENT ASSETS: Cash and cash equivalents $ 1,061,141 $ 116,733 $ 69,334 Accounts receivable, net 74,790 64,096 53,173 Income taxes receivable 7,223 4,389 5,762 Inventories, net 1,875,152 2,136,797 2,202,275 Prepaid expenses and other current assets 74,946 144,002 79,472 Total current assets 3,093,252 2,466,017 2,410,016 Property and equipment, net 1,348,059 1,479,855 1,415,728 Operating lease assets 2,213,158 2,454,929 2,313,846 Intangible assets, net 92,584 127,079 94,768 Goodwill 245,857 250,476 245,857 Deferred income taxes 21,538 14,600 14,412 Other 138,121 122,259 133,933 TOTAL ASSETS $ 7,152,569 $ 6,915,215 $ 6,628,560 LIABILITIES AND STOCKHOLDERS' EQUITY CURRENT LIABILITIES: Accounts payable $ 1,094,258 $ 906,721 $ 1,001,589 Accrued expenses 462,284 391,555 415,501 Operating lease liabilities 474,769 410,477 422,970 Income taxes payable 55,901 21,490 10,455 Deferred revenue and other liabilities 196,165 195,148 225,959 Total current liabilities 2,283,377 1,925,391 2,076,474 LONG-TERM LIABILITIES: Revolving credit borrowings 441,500 224,100 Convertible senior notes due 2025 404,573 Long-term operating lease liabilities 2,373,173 2,604,897 2,453,346 Deferred income taxes 5,926 9,187 Other long-term liabilities 161,150 172,415 133,855 Total long-term liabilities 2,938,896 3,224,738 2,820,488 COMMITMENTS AND CONTINGENCIES STOCKHOLDERS' EQUITY:Common stock 601 623 593 Class B common stock 241 245 243 Additional paid-in capital 1,373,426 1,231,325 1,253,867 Retained earnings 2,724,424 2,565,700 2,645,281 Accumulated other comprehensive loss (130) (122) (120) Treasury stock, at cost (2,168,266) (2,032,685) (2,168,266) Total stockholders' equity 1,930,296 1,765,086 1,731,598 TOTAL LIABILITIES AND STOCKHOLDERS' EQUITY $ 7,152,569 $ 6,915,215 $ 6,628,560 DICK'S SPORTING GOODS, INC. AND SUBSIDIARIESCONSOLIDATED STATEMENTS OF CASH FLOWS - UNAUDITED (In thousands)26 Weeks EndedAugust 1,2020August 3,2019CASH FLOWS FROM OPERATING ACTIVITIES:Net income$133,421$170,059Adjustments to reconcile net income to net cash provided by (used in) operating activities:Depreciation, amortization, and other162,755157,410Amortization of convertible notes discount and issuance costs7,662—Non-cash lease costs28,395(28,699)Deferred income taxes(16,313)(4,609)Stock-based compensation17,44923,082Changes in assets and liabilities:Accounts receivable(8,402)(26,859)Inventories327,123(312,101)Prepaid expenses and other assets7,026(5,169)Accounts payable103,379(10,550)Accrued expenses48,49717,909Income taxes payable / receivable43,9853,094Deferred construction allowances30,85021,961Deferred revenue and other liabilities(9,120)(32,752)Net cash provided by (used in) operating activities876,707(27,224)CASH FLOWS FROM INVESTING ACTIVITIES: Capital expenditures(94,256)(110,992)Deposits and purchases of other assets—(1,000)Net cash used in investing activities(94,256)(111,992)CASH FLOWS FROM FINANCING ACTIVITIES:Revolving credit borrowings1,291,7001,185,850Revolving credit repayments(1,515,800)(744,350)Proceeds from issuance of convertible notes575,000—Payments for purchase of bond hedges(161,057)—Proceeds from issuance of warrants105,225—Transaction costs paid in connection with convertible notes issuance(17,396)— Payments on other long-term debt and finance lease obligations(403)(2,644) Proceeds from exercise of stock options939273Minimum tax withholding requirements(3,684)(6,312)Cash paid for treasury stock—(266,624)Cash dividends paid to stockholders(54,448)(51,258)(Decrease) increase in bank overdraft(10,710)27,363Net cash provided by financing activities209,366142,298EFFECT OF EXCHANGE RATE CHANGES ON CASH AND CASH EQUIVALENTS(10)(2)NET INCREASE IN CASH AND CASH EQUIVALENTS991,8073,080CASH AND CASH EQUIVALENTS, BEGINNING OF PERIOD69,334113,653CASH AND CASH EQUIVALENTS, END OF PERIOD$1,061,141$116,733Store Count and Square FootageThe stores that opened during the second quarter of 2020 are as follows:StoreMarketConceptPlainville, CTHartfordOutlet StoreHagerstown, MDHagerstownOutlet StoreFranklin Mills, PAPhiladelphiaOutlet StoreThe following represents a reconciliation of beginning and ending stores and square footage for the periods indicated:Store Count:Fiscal 2020Fiscal 2019DICK'S SportingGoodsSpecialtyConceptStores (1)TotalDICK'S SportingGoodsSpecialtyConceptStores (1)TotalBeginning stores726124850729130859Q1 New stores123—11Q2 New stores—33224Closed stores1344—4Ending stores726126852727133860Relocated stores3141—1Square Footage:(in millions)DICK'S SportingGoodsSpecialty ConceptStores (1)Total (2)Q1 201938.63.742.2Q2 201938.63.742.3Q3 201938.83.442.2Q4 201938.53.441.8Q1 202038.43.441.8Q2 202038.43.541.9(1)Includes the Company's Golf Galaxy and Field & Stream stores, as well as the Company's outlet and clearance stores. In some markets the Company operates DICK'S Sporting Goods stores adjacent to its specialty concept stores on the same property with a pass-through for customers. The Company refers to this format as a \"combo store\" and includes combo store openings within both the DICK'S Sporting Goods and specialty concept store reconciliations, as applicable. As of August 1, 2020, the Company operated 26 combo stores.(2)Column may not add due to rounding.DICK'S SPORTING GOODS, INC.GAAP to NON-GAAP RECONCILIATIONS - UNAUDITED(in thousands, except per share amounts)Non-GAAP Net Income and Earnings Per Share Reconciliations13 Weeks Ended August 1, 2020Income fromoperationsInterestexpenseIncome beforeincome taxesNetincome (2)DilutedsharesoutstandingduringperiodEarningsperdilutedshareGAAP Basis$391,357$14,682$391,183$276,84388,826$3.12% of Net Sales14.42%0.54%14.42%10.20%Convertible senior notes (1)—(6,568)6,5684,860(1,119)Non-GAAP Basis$391,357$8,114$397,751$281,70387,707$3.21% of Net Sales14.42%0.30%14.66%10.38%(1)Amortization of the non-cash debt discount on the Company's convertible senior notes and diluted shares that will be offset at settlement by shares delivered from the convertible note hedge purchased by the Company.(2)The provision for income taxes for Non-GAAP adjustments was calculated at 26%, which approximates the Company's blended tax rate.26 Weeks Ended August 1, 2020Income fromoperationsInterestexpenseIncomebeforeincome taxesNetincome (2)DilutedsharesoutstandingduringperiodEarningsperdilutedshareGAAP Basis$205,184$22,727$183,443$133,42187,360$1.53% of Net Sales5.07%0.56%4.53%3.30%Convertible senior notes (1)—(7,662)7,6625,670(560)Non-GAAP Basis$205,184$15,065$191,105$139,09186,800$1.60% of Net Sales5.07%0.37%4.72%3.44%(1)Amortization of the non-cash debt discount on the Company's convertible senior notes and diluted shares that will be offset at settlement by shares delivered from the convertible note hedge purchased by the Company. This amount includes $1.1 million of amortization recognized in the fiscal quarter ended May 2, 2020.(2)The provision for income taxes for Non-GAAP adjustments was calculated at 26%, which approximates the Company's blended tax rate.26 Weeks Ended August 3, 2019Selling,general andadministrativeexpensesIncomebeforeincometaxesNet income (3)Earningsper dilutedshareGAAP Basis$1,008,230$230,765$170,059$1.85% of Net Sales24.12%5.52%4.07%Non-cash asset impairment (1)(7,623)7,6235,641Litigation contingency settlement (2)6,411(6,411)(4,744)Non-GAAP Basis$1,007,018$231,977$170,956$1.86% of Net Sales24.09%5.55%4.09%(1)Non-cash impairment charge to reduce the carrying value of a corporate aircraft held for sale to its fair market value.(2)Favorable settlement of a previously accrued litigation contingency.(3)The provision for income taxes for Non-GAAP adjustments was calculated at 26%, which approximated the Company's blended tax rate.Reconciliation of Gross Capital Expenditures to Net Capital ExpendituresThe following table represents a reconciliation of the Company's gross capital expenditures to its capital expenditures, net of tenant allowances.26 Weeks EndedAugust 1,2020August 3,2019Gross capital expenditures$(94,256)$(110,992)Proceeds from sale-leaseback transactions——Deferred construction allowances30,85021,961Construction allowance receipts——Net capital expenditures$(63,406)$(89,031)CisionView original content to download multimedia:http://www.prnewswire.com/news-releases/dicks-sporting-goods-reports-record-quarterly-sales-and-earnings-in-second-quarter-2020-delivers-20-7-increase-in-same-store-sales-301118442.htmlSOURCE DICK'S Sporting Goods, Inc."}]}