{"article": [{"url": "https://finance.yahoo.com/news/the-nfl-overlooking-coronavirus-threat-is-extremely-concerning-says-former-white-house-doctor-112205386.html", "published": 1599287420.0, "headline": "The NFL overlooking coronavirus threat is 'extremely concerning' says former White House doctor", "body": "When the National Football League’s season kicks off this Thursday with the matchup between Kansas City Chiefs (the defending Super Bowl champions) and the Houston Texans, the game will feature something most other leagues have gone without during the coronavirus pandemic: fans.The debut game to be held at Arrowhead Stadium in Kansas City, Missouri, will allow for up to 22% of normal fan capacity after receiving approval from local health officials, but that doesn’t mean every medical expert is a fan of allowing potentially more than 15,000 fans into a stadium as cases trend higher both in the state and Kansas City itself.According to former White House physician Dr. Jennifer Peña, who served as Vice President Mike Pence’s lead doctor up until 2018, the NFL’s decision to allow fans at select stadiums is “extremely concerning.”“We all want to go back to some sort of sense of normalcy, the NFL season being one of the most important things Americans look forward to in the fall and being able to watch these games,” she told Yahoo Finance’s YFi PM. “But as we've seen already on college campuses and a lot of sports within college campuses, when you start to group people together in these kinds of activities, where inevitably people will have to take their masks off, you're asking for trouble.”To the team’s credit, the Chiefs have spaced out available seats, required fans to wear masks inside the stadium (with the exception of when necessary to remove a mask for drinking or eating) and have set up hand sanitizing stations throughout the stadium. However, the stadium is still allowing socially distanced tailgates and only “encouraging” masks for those events before the game. Arrowhead is also going cashless to limit interactions between fans and staff during transactions.Fans wearing face masks watch the Kansas City Chiefs during an NFL football training camp Saturday, Aug. 22, 2020, at Arrowhead Stadium in Kansas City, Mo. The Chiefs opened the stadium to 2,000 season ticket holders to watch practice as the team plans to open the regular season with a reduced capacity of approximately 22 percent or normal. (AP Photo/Charlie Riedel)Those policies are roughly similar to what is being adopted by the four other teams planning to invite fans in a limited capacity to games this season in Dallas, Miami, Jacksonville, and Indianapolis.Story continuesBut with cases rising in the state of Missouri and in Kansas City, which has seen its test-positivity rate hit higher than 9% as of the end of August, there is still cause for worrying about triggering super-spreader events, according to Dr. Peña.“It's hard to believe that with opening up the season, even in a limited capacity as they're planning to do, that we're not going to see an uptick in cases and it would be tragic,” she said. “So I would have to say I disagree with that decision.”While new daily coronavirus cases have been trending lower recently, the U.S. has still recorded more than 6.1 million cases and more than 187,000 deaths due to COVID-19, according to the Johns Hopkins University data.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Americans are shelling out $30,000 on these pop-up backyard home offices during the pandemicThis $3 billion online education company is seeing a 'paradigm shift' due to coronavirusNetflix co-founder brushes off NBC's new Peacock streaming competitor"}]}