{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-moderna-steals-spotlight-with-vaccine-leap-cdc-director-backs-public-masking-162705949.html", "published": 1594812920.0, "headline": "Coronavirus update: Moderna steals spotlight with vaccine leap; CDC Director backs public masking", "body": "Moderna’s (MRNA)’s experimental coronavirus vaccine — which showed the treatment was not only effective, but produced a significant amount of COVID-19 antibodies — boosted markets and stoked hopes of a vaccine by the end of this year, as the pandemic continues its spread.The Phase 1 clinical trial data, published late Tuesday in the New England Journal of Medicine, confirmed the company’s statements of positive results.It’s still unclear if the vaccine, which requires two shots within a month’s time— is able to block the virus entirely. But if successful, Moderna’s candidate would be the first product the company gets to market, as well as the first vaccine using its proprietary mRNA technology.And company officials on Wednesday voiced optimism about some level of dampening the effects of the virus, especially as new diagnoses soar worldwide — and continues unchecked in the United States.The final phase of the trials, set to begin July 27, will better inform on the vaccine’s effectiveness.CEO Stephane Bancel told analysts on a call Wednesday that discussions have only just begun of how the vaccine is likely to be distributed. Via Operation Warp Speed, U.S. officials have set an ambitious timeline to begin production on a candidate this year.While no specifics were given, Bancel said the federal government would be in charge. “We see partnering with government as very important...it's not up to private company to make that decision,” he added.Coronavirus cases are continuing to rise outside of New York. (Graphic: David Foster/Yahoo Finance)The biotech’s stock has skyrocketed since late February, when its partnership with the National Institute of Health began to test a vaccine candidate. The company hit a record high of $88 per share, surpassing the May 18 high, $87 per share, when Moderna announced positive interim results for the phase 1 trial.Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, has said the U.S. is likely to have a vaccine ready for distribution this year. Meanwhile, officials at the U.S. Department of Health and Human Services recently said they are confident a vaccine will be ready by winter, if not sooner.Story continuesThe optimism spurred by Moderna’s news comes as the global pandemic continues to hamper the economic recovery in the U.S. The country has now topped 3.4 million cases, while global cases climb past 13.3 million.A surge in the Sun Belt has made America a global epicenter, with states like Arizona, Texas, Florida and California facing strains on health systems and relentlessly surging in case counts. In San Antonio, freezer trucks are lining up to hold bodies of the dead, as the hospitals run out of room—raising the spectre of New York City’s struggles, as it faced a similarly grim phase during the peak of its outbreak.The political class is increasingly falling victim to the virus, with Oklahoma Gov. Kevin Stitt announcing he tested positive for the virus, following last week’s disclosure from Atlanta Mayor Keisha Lance Bottoms.CDC chief backs masksMeanwhile, Centers for Disease Control and Prevention (CDC) Director Robert Redfield twaded into the growing domestic political debate over public masking. Redfield endorsed what many experts have already advocated for months — wearing a mask helps to prevent further spreading.Redfield’s remarks came as Walmart, the country’s largest employer, said it would mandate face coverings for employees and customers starting Monday.“We are not defenseless against COVID-19,” he said, adding that the virus could be under control in two months with universal adoption.“Cloth face coverings are one of the most powerful weapons we have to slow and stop the spread of the virus – particularly when used universally within a community setting. All Americans have a responsibility to protect themselves, their families, and their communities,” Redfield said.His comments come just as the White House has ordered hospitals to bypass the CDC, and instead submit case numbers directly to it, according to new guidance from the U.S. Department of Health and Human Services (HHS).The move has experts worried it could be used for political reasons, a shift away from science-based guidance that the U.S. sorely needs.Yahoo medical contributor Dr. Dara Kass said on Twitter the move is unhelpful to the response.“As far as I can tell the federal government wants to control the data that tells us how we are doing but not give us the resources to actually do well. Am I missing something?” she said.Former FDA Commissioner Scott Gottlieb, who served in the Trump administration, also criticized the Trump administration’s move.“They have the scientific expertise to cull this data in a way that no other agency does,” Gottlieb said of the CDC."}]}