{"article": [{"url": "https://finance.yahoo.com/news/verizon-buys-prepaid-phone-provider-tracfone-120100041.html", "published": 1600067360.0, "headline": "Verizon buys pre-paid phone provider Tracfone", "body": "Verizon Communications (VZ) has phoned the executive team at Tracfone, and has inked a deal.The communications giant (which is the parent company of Yahoo Finance) announced Monday it has acquired pre-paid wireless leader Tracfone. The cost of the transaction will include $3.125 billion in cash and $3.125 billion in Verizon common stock, subject to customary adjustments, at closing.The agreement also includes up to an additional $650 million in future cash consideration related to the achievement of certain performance measures and other commercial arrangements.A man stands next to the logo of Verizon at the Mobile World Congress in Barcelona, Spain, February 26, 2019. REUTERS/Sergio PerezTracfone boasts 21 million subscribers through a network of over 90,000 retail locations worldwide. The deal takes Verizon more into the lucrative value-oriented space of the wireless market.“This transaction is aligned with what we do best: providing reliable wireless service alongside a best-in-class customer experience,” said Hans Vestberg, Chairman and CEO of Verizon. “We are excited about the opportunity to bring Tracfone and its brands into the Verizon family where we can put the full support of Verizon behind this business and provide exciting and compelling products into this attractive segment of the market. We are pursuing this important strategic acquisition from a position of strength given our very strong and prudent financial profile.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Tech newsletterLL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}