{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-17-2020-221812043.html", "published": 1592404340.0, "headline": "Stock market news live updates: Stocks fall as coronavirus cases jump in some states", "body": "Stocks cut earlier gains, and the S&P 500 and Dow turned negative, after new data showed further spikes in coronavirus cases in some densely populated U.S. states.[Click here to read what’s moving markets heading into Thursday, June 18]Texas’s virus hospitalizations jumped 11% in 24 hours, according to the state, marking the largest one-day jump since the beginning of the month. The state has in recent days been battling a resurgence in new and serious cases of the coronavirus after beginning to ease lockdown orders. Other populous states including Florida have struggled with similar trends amid their reopenings, with both it and Arizona posting record daily highs for new cases of the virus earlier this week.Earlier in the session, prospects of more stimulus, as well as hopes of a Covid-19 treatment and speedy economic recovery, helped stocks extend gains. These catalysts included reports Tuesday of encouraging results from a trial showing that the generic drug dexamethasone helped reduce the death risk among patients with severe Covid-19 cases.Meanwhile, earlier reports that the Trump administration was prepping a nearly $1 trillion infrastructure package also provided a boost to risk assets.More promising signs of a speedy economic recovery also contributed to the rally. New economic data Tuesday morning showed retail sales surged by a record 17.7% in May over April, with the pace of increase more than double the rate consensus economists expected. The sharp recovery in consumer spending after April’s record decline led at least some economists to pare back their gloomier economic expectations for the second quarter this year.“The 17.7% m/m rebound in retail sales in May indicates that, as the lockdowns were eased in many states, activity started to recover more quickly than we – and others – had been anticipating,” Andrew Hunter, senior U.S. economist for Capital Economics, wrote in a note. “As a result, we now estimate that real consumption and overall GDP both contracted at a 30% annualized pace in the second quarter, rather than the 40% fall we previously expected.”Story continuesWhile the latest batch of new economic data, including the May jobs report earlier this month, has surprised sharply to the upside, many economists and policymakers continue to call attention to risks of protracted economic weakness, as long as the coronavirus pandemic continues.Federal Reserve Chair Jerome Powell, for his part, said during testimony before the Senate Banking Committee Tuesday that, “ Until the public is confident that the disease is contained, a full recovery is unlikely.”Powell, also began testifying before the House Financial Services Committee Wednesday afternoon, also defended the Fed’s recently announced decision to expand its purchases in the secondary market to include individual corporate bonds, saying the central bank wants “to be there if things turn bad in the economy.”—4:03 p.m. ET: S&P, Dow snap 3-day win streak, Apple sets all-time intraday highHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -11.26 (-0.36%) to 3,113.48Dow (^DJI): -170.37 (-0.65%) to 26,119.61Nasdaq (^IXIC): +14.66 (+0.15%) to 9,910.53Crude (CL=F): -$0.72 (-1.88%) to $37.66 a barrelGold (GC=F): -$0.10 (-0.01%) to $1,736.40 per ounce10-year Treasury (^TNX): -2.3 bps to yield 0.7330%—3:21 p.m. ET: Hertz suspends plan to sell $500 million shares due to SEC reviewHertz said in a filing Wednesday afternoon it planned to halt its plan to sell $500 million worth of shares after the Securities and Exchange Commission told the company it would conduct a review of its prospectus supplement for the deal.The share sale is suspended “pending further understanding of the nature and timing” of the review, according to the filing.Shares of Hertz had been halted on the New York Stock Exchange earlier in the session.—12:33 p.m. ET: Powell says it would be ‘appropriate’ for Congress to unleash additional stimulusFederal Reserve Chair Jerome Powell said Wednesday afternoon in his appearance before the House Financial Services Committee that he felt it would be “appropriate” for Congress to unveil more unemployment support for individuals and stimulus for businesses.Powell has previously called for further fiscal policy to complement the stimulus provided through monetary policy. In his remarks, he also underscored that the stimulus has had a notably positive effect on consumer spending, income and payrolls since the beginning of the pandemic.—11:45 a.m. ET: Shares of Hertz halted on the NYSE for news pendingShares of bankrupt car rental company Hertz (HTZ) were halted on the New York Stock Exchange Wednesday just before noon, due to pending news.The company, which filed for Chapter 11 bankruptcy protection in late May, has in recent days drawn scrutiny for its court request to sell up to $1 billion worth of new shares. U.S. Bankruptcy Court Judge Mary Walrath approved the request late last week despite the company saying in its filing that the shares “could ultimately be worthless” as it works to repay a mountain of debt.Shares of Hertz have risen 250% since May 26, the first trading session after the company filed for bankruptcy.—10:32 a.m. ET: Stocks trade mostly lower after Texas virus hospitalizations jumpHere were the main moves in markets, as of 10:32 a.m. ET:S&P 500 (^GSPC): -8.1 points (-0.26%) to 3,116.64Dow (^DJI): -97.87 points (-0.37%) to 26,192.11Nasdaq (^IXIC): +9.99 points (+0.1%) to 9,906.31Crude (CL=F): -$0.68 (-1.77%) to $37.70 a barrelGold (GC=F): -$5.40 (-0.31%) to $1,731.10 per ounce10-year Treasury (^TNX): -1.9 bps to yield 0.735%—10:05 a.m. ET: Stocks pare gains, S&P 500 and Dow briefly turn negativeThe S&P 500 and Dow cut earlier gains to turn briefly negative before recovering. The energy and utilities sectors lagged in the S&P 500, and declines in shares of Boeing and Exxon Mobil weighed on the Dow. The Nasdaq held higher as big tech stocks including Amazon and Netflix advanced.—9:31 a.m. ET: Stocks open higherHere were the main moves in markets, as of 9:31 a.m. ET:S&P 500 (^GSPC): +8.63 points (+0.28%) to 3,133.37Dow (^DJI): +63.47 points (+0.24%) to 26,353.45Nasdaq (^IXIC): +46.09 points (+0.47%) to 9,943.56Crude (CL=F): -$0.44 (-1.15%) to $37.94 a barrelGold (GC=F): -$6.90 (-0.4%) to $1,729.60 per ounce10-year Treasury (^TNX): -1.3 bps to yield 0.741%—8:30 a.m. ET: Housing starts rise 4.3% in May, missing expectationsHousing starts and building permits rose less than expected in May, signaling a slower than anticipated pick-up in new-home building after April’s lows.Housing starts rose 4.3% to a seasonally adjusted annual rate of 974,000, after falling by a revised 26.4% in April to 934,000. Consensus economists expected housing starts to rise by 23.5%.Building permits, which indicate future homebuilding, rose 14.4% to a seasonally adjusted annual rate of 1.22 million. This was below expectations for a rise of 16.8% from April’s level, which was revised to show a month on month drop of 21.4% to 1.066 million.—7:29 a.m. ET Wednesday: Stock futures erase earlier losses and point to higher openHere were the main moves in markets, as of 7:29 a.m. ET:S&P 500 futures (ES=F): 3,145.25, up 16.5 points or 0.53%Dow futures (YM=F): 26,482.00, up 162 points, or 0.62%Nasdaq futures (NQ=F): 10,021.5, up 49 points, or 0.49%Crude (CL=F): -$0.72 (-1.88%) to $37.66 a barrelGold (GC=F): -$12.40 (-0.71%) to $1,724.10 per ounce10-year Treasury (^TNX): +0.4 bps to yield 0.758%—6:03 p.m. ET Tuesday: Stock futures open lowerHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,121.5, down 7.25 points or 0.23%Dow futures (YM=F): 26,232.00, down 88 points, or 0.33%Nasdaq futures (NQ=F): 9,950.75, down 21.75 points, or 0.22%NEW YORK, NEW YORK - MAY 26: Television journalists and others gather across from the entrance to the New York Stock Exchange (NYSE) on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}