{"article": [{"url": "https://finance.yahoo.com/news/apple-ios-14-174705402.html", "published": 1592830520.0, "headline": "Apple debuts iOS 14, hitting iPhones later this year", "body": "Apple on Monday unveiled iOS 14, the latest version of the software that powers millions of iPhones around the world. The update, which will launch later this year, will bring a host of new features to the iPhone including an updated home screen layout and improvements to the company’s Messages app.One of biggest changes to the operating system is a new App Library. The feature is designed to organize all of your apps into different, easy-to-use folders. Apps are automatically organized in the App Library depending on their use. For instance, entertainment apps will be put into an Entertainment folder.Apple's new App LibraryYou’ll also get a search bar at the top of the App Library screen that lets you quickly search for individual apps. The top of the Apps Library screen is also where you’ll find your most recently added apps and suggested apps.Apple says this will make it easier to navigate your home screen, so it’s also now giving people the ability to delete individual home screens, this way you won’t have to scour 20 different screens to find an app.True widgets! Finally!The home screen is also finally getting widgets in iOS 14. Widgets give you access to important parts of apps from the home screen without having to open them. We’re talking about the ability to control songs in Apple Music widget, or checking the temperature and forecast in the Weather widget. The idea is to make you more productive by eliminating the need to open and close apps when you just need a quick bit of information.You’ll be able to resize widgets to a number of sizes depending on what you’re looking to get out of it. There’s also a widget called the Smart Stack that will provide you with the most important updates from your day. Think the weather in the morning, your calendar in the afternoon, and smart home controls at night. It seems incredibly helpful, and hopefully is as easy to use as it looked in Apple’s on-screen demo.It’s worth noting that Android has had widgets available on its home screen for years, so this isn’t a first of its kind invention, but is certainly welcome.Story continuesApple is also bringing picture-in-picture to iOS, allowing you to continue watching video while you’re controlling other aspects of your phone.Siri and Messages get smarterSiri is also getting improvements in iOS 14, providing users with a more streamlined interface that pops up at the top of the screen when you ask simple questions. So, if you ask what the weather is like, you’ll be able to see it at the top of the screen, without the Siri app opening and covering up the app you were previously using.Apple is also rolling out a new app called Translation. The app will allow you to translate apps in 11 different languages including English, Russian, Spanish, German, Mandarin, and more. Apple says that the app can also be used offline, and will keep all of your data private.Apple's new Translate appMessages will also see big changes in iOS 14. You’ll now be able to pin conversations to the top of the Messages page. So if you have an important conversation, but don’t want it to be lost amid your myriad other chats, you can pin it to the top of the Messages app.Group messages are also getting improvements. You’ll now be able to reply directly to individual messages in groups chats with in-line replies, ensuring that you don’t confuse everyone in a group when you reply to an earlier message. You can also direct messages to individuals in your group chat, and set up notifications so that you’re only be notified when you’re mentioned in the conversation.Apple Maps changesApple Maps has also gotten an update in iOS 14. Apple is now adding the ability to find suggested places in Maps via guides. These guides will tell you about things like hiking trails, places to eat, and different tourist attractions.What’s more, Apple is adding a cycling option to Maps, so you’ll be able to see bike lanes, steep hills, and if you’ll need to carry your bike up a set of stairs. Cities including New York City, Los Angles, and Beijing among others.Apple MapsIf you have an electric car, Maps will also track your current charge, and factor in things like elevation and weather conditions to automatically give you areas where you can charge up, helping to eliminate the dreaded range anxiety that comes with an electric vehicle. Apple says it’s working with BMW and Ford on this feature, and will add more automakers in the future.Apple keyless car entryApple’s CarPlay is also turning your iPhone into a pair of keys for your car. First coming to the 2021 BMW 5 Series, the feature uses NFC to let you unlock your car with your phone, and even give other users access to your vehicle. Apple says it’s working with industry groups to make a standard that allows it to work with other vehicle manufacturers, as well.Stay tuned for iOS 14 when it’s released later this year.More from Dan:Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple to close retail stores in 4 states amid coronavirus outbreaksWhy Microsoft and Amazon are calling on Congress to regulate facial recognition technologyThe PlayStation 5’s most important feature will be its price5 Father’s Day tech gifts: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and redditPerhaps one of the most important changes coming to iOS 14 is the ability to change your default iPhone apps.Apple is giving users the option to set third-party apps like Gmail, Spotify, and Chrome as their defaults. Currently, if you tap a link in, say, Twitter, your iPhone will open it in Safari even if you regularly use Chrome or Firefox.The change not only gives users more control over their own devices, but could also help ease some of the antitrust concerns swirling around the company. Apple’s strict control over what apps are able to function as defaults has been one of the issues that critics have pointed to as proof that the company follows a pattern of monopolistic behavior.The move, though, won’t solve all of Apple’s antitrust issues. The firm has come under increased scrutiny lately about how it handles third-party apps in its App Store, and the fees it charges developers.In addition to changing default apps, rumors indicate that Apple will let users view their home screen apps in a new list-style view rather than the grid view the iPhone has used for years. According to 9to5Mac, the list view would look similar to the way apps are displayed on the Apple Watch.9to5Mac also says the new version of iOS will allow users to place widgets on their home screens similar to what Apple did with iPadOS. Android users have been able to do this for years, placing things like their calendars and weather reports on their home screens. It’s a worthwhile feature that I’m hoping Apple finally moves forward with.Finally, according to MacRumors, iOS 14 could come with a new mention feature in Apple’s Messages app that will allow you to nudge specific contacts in group messages. There’s also word that you may be able to retract sent messages, which would be a godsend for those texts you really wish you could take back the moment you push send."}]}