{"article": [{"url": "https://finance.yahoo.com/news/a-troubling-sign-the-labor-market-recovery-has-stalled-morning-brief-102014288.html", "published": 1596173300.0, "headline": "A troubling sign the labor market recovery has stalled: Morning Brief", "body": "Friday, July 31, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeContinuing unemployment claims rise for the first time since MayOn Thursday morning, shocking U.S. gross domestic product (GDP) numbers captured most of the headlines.And deservedly so.A 32.9% annualized decline in GDP — good for a 9.5% drop in total economic output in the second quarter — was the largest single-quarter decline since the 1940s.But data received on the health of the U.S. labor market should be sending even louder alarm bells about the current state of the recovery. It should also serve as a sign of caution, as we remain without any firm plans for extending unemployment benefits to the tens of millions that remain out of work.On Thursday, the latest weekly report on initial jobless claims showed another 1.434 million workers filed for unemployment insurance. That troubling number shows many are still being newly let go from their jobs.Claims for continuing unemployment insurance, however, were even more concerning, rising by more than 800,000 to 17.01 million last week, the first increase since May.\"The increase in continued claims suggests that rehiring may be pausing as the rise in Covid-19 cases causes more businesses to shut down or scale back reopening plans,\" said Nancy Vanden Houten, lead economist at Oxford Economics.Continuing unemployment claims rose last week for the first time since May, a sign that improvement in the labor market has stalled after a few months of steady gains. (Source: Oxford Economics)Vanden Houten notes that this data has been \"noisy at times\" because some states report claims on a bi-weekly basis instead of weekly. But even adjusting for this quirk, claims were higher last week. And so the number of workers sliding into longer-term unemployment is on the rise as the economic re-opening has been paused or rolled back in many states across the country.As of last week, Vanden Houten estimates that when you include those receiving pandemic unemployment assistance, adjust for backlogs and states no longer reporting claims, it's likely that some 29.6 million people were receiving benefits of some sort as of July 11 — a record high.Story continuesThe most recent claims data also covers the reference week for the July jobs report, which will be released a week from today on August 7. And this data could also be another step back in the labor market’s improvement that started back in May.Capital Economics estimates the July jobs report will show nonfarm payrolls grew by 1 million, the third-straight month of improvement. Though this would be a marked slowdown after 7.4 million jobs were added back to the economy during May and June.The firm also notes that the Census Bureau's Household Pulse survey showed a sharp slowdown for the July jobs report reference week, suggesting we could perhaps see a slide in payroll growth next week.A new data series from the Census Bureau suggests the labor market has cooled off to levels last seen back in the spring, potentially signaling trouble for the July jobs report next week. (Source: Capital Economics)“A renewed drop back in employment would send shockwaves through the markets,” the firm wrote in a note to clients on Thursday. “But it is worth taking that ‘experimental’ survey with a pinch of salt, not least because it has been running for just 11 weeks.”The firm added that “it also isn’t seasonally adjusted, with employment usually dropping back at the start of the summer as workers in education and related sectors are laid off. In any case, while other indicators also point to a slowdown in employment growth, they don’t yet suggest the recovery has gone into reverse.”But after a robust rebound in employment, consumer spending — and the markets during the end of the second quarter and beginning of the third — a stalling out in economic activity is showing up in a variety of indicators.And as Fed Chair Jerome Powell reminded markets on Wednesday, the future of the recovery is, as always, determined by the virus.\"The pace of the recovery looks like it has slowed since [cases spiked] in June,\" Powell said. \"The path of the economy is going to depend to a very high extent on the course of the virus, and on the measures that we take to keep it in check. That is just a very fundamental fact about our economy right now.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Personal income, June (-0.6% expected, -4.2% in May)8:30 a.m. ET: Personal spending, June (5.2% expected, 8.2% in May)8:30 a.m. ET: PCE deflator YoY, June (0.4% expected, 0.5% in May)8:30 a.m. ET: PCE core deflator YoY, June (1.0% expected, 1.0% in May)8:30 a.m. ET: Employment cost index, second quarter (0.6% expected, 0.8% prior)9:45 a.m. ET: MNI Chicago PMI, July (44 expected, 36.6 in June)10:00 a.m.ET: University of Michigan Surveys of Consumers Sentiment, July final (72.8 expected, 73.2 in June)EarningsPre-market6:30 a.m. ET: Caterpillar (CAT) is expected to report adjusted earnings of 65 cents per share on revenue of $8.56 billion6:45 a.m. ET: Merck & Co (MRK) is expected to report adjusted earnings of $1.07 per share on revenue of $10.5 billion6:45 a.m. ET: Chevron (CVX) is expected to report an adjusted loss of 90 cents per share on revenue of $20.71 billion6:50 a.m. ET: Dominion Energy (D) is expected to report adjusted earnings of 79 cents per share on revenue of $3.94 billion6:55 a.m. ET: VF Corp (VFC) is expected to report an adjusted loss of 68 cents per share on revenue of $978.09 million6:55 a.m. ET: Under Armour (UAA) is expected to report an adjusted loss of 42 cents per share on revenue of $538.77 million6:55 a.m. ET: Colgate-Palmolive (CL) is expected to report adjusted earnings of 70 cents per share on revenue of $3.78 billion7:00 a.m. ET: Charter Communications (CHTR) is expected to report adjusted earnings of $2.46 per share on revenue of $11.6 billion7:00 a.m. ET: Pinterest (PINS) is expected to report an adjusted loss of 14 cents per share on revenue of $250.7 million7:35 a.m. ET: Exxon Mobil (XOM) is expected to report an adjusted loss of 62 cents per share on revenue of $33.64 billion7:45 a.m. ET: AbbVie (ABBV) is expected to report adjusted earnings of $2.22 per share on revenue of $10.09 billionTop NewsAmazon Q2 earnings blow past estimates as coronavirus buying boosts revenue, profit [Yahoo Finance]Apple crushes Q3 expectations, announces 4-1 stock split [Yahoo Finance]Facebook reports Q2 user growth, sales that top expectations [Yahoo Finance]Google ad rebound offsets Alphabet's first-ever sales drop [Reuters]Buffett's Berkshire boosts its stake in Bank of America to 11.8% [Reuters]YAHOO FINANCE HIGHLIGHTSEl-Erian: Tech valuation 'is a real question mark for me'Bill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearAnother stimulus bill won’t jump-start the economy —Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}