{"article": [{"url": "https://finance.yahoo.com/news/retail-earnings-housing-data-what-to-know-in-the-week-ahead-162021937.html", "published": 1597577300.0, "headline": "Retail earnings, housing data: What to know in the week ahead", "body": "Second-quarter corporate earnings season is beginning to wind down, but a host of retailers’ earnings results is still set to be a key focus this week. A slew of US housing reports will also be released, including data on housing starts, building permits and existing home sales.Retail resultsThis week’s schedule of corporate earnings results results will span big-box retailers Walmart and Target, home improvement giants Home Depot and Lowe’s, as well as a bevy of other names in the industry including Kohl’s, TJMaxx parent company TJX Companies, L Brands and Ross Stores.The results come against a tough backdrop for many retailers during the pandemic period, with the outbreak and forced brick-and-mortar business closures pushing dozens of major names including Lord & Taylor, Tailored Brands and Ascena Retail Group to file for bankruptcy in recent weeks. The pandemic has favored retailers that had already built out strong e-commerce operations, widening the divide between those with and without a robust omni-channel positioning.To that end, Target and Walmart are both set to be closely watched, after the two companies reported blowout sales results during the first quarter, as customers flocked to these stores’ websites to purchase products during the pandemic.During its fiscal first quarter ended May 2, Target reported digital sales that jumped 141% over last year, and April alone saw online sales that surged 282%. Inclusive of all shopping methods, Target’s first-quarter sales grew 10.8%.Walmart, for its part, posted first-quarter comparable same-store sales growth of 10% for its biggest increase in nearly two decades. Its e-commerce sales were up 74% during the three months ended April 30.For their fiscal second quarters, both Target and Walmart are expected to grow sales yet again year-over-year. However, these increases likely came at a decelerating rate, as consumer home-stocking abated after the peak of the US virus-related shutdown period in the spring. Walmart’s second-quarter revenue is expected to have grown 4% over last year to $135.5 billion, following a jump of 9% last quarter. And Target’s revenue likely slowed to an 8% growth rate over last year to $19.86 billion, for a growth rate three percentage points below that of its first-quarter.Story continuesProfitability at both companies, however, is likely to still be under pressure at both companies, with consumers focused on purchasing lower-margin items like paper goods, food and other necessities as opposed to higher-margin items like apparel and bigger-ticket discretionary items during the pandemic. Higher fulfillment costs due to the increase in e-commerce sales also cut into profitability, and gross profit margins at both Target and Walmart shrank in the first quarter over last year.For its fiscal second quarter, Target’s adjusted earnings are expected to fall 13% over last year to $1.59 per share. However, that percent decline would be a big improvement from the 61% drop in earnings per share the company posted in the first quarter. For Walmart, adjusted earnings are expected to tick down 2% over last year to $1.25 per share, following a 4% rise in adjusted earnings per share in the first quarter.Meanwhile, across other retail earnings this week, Wall Street analysts and market participants will also be monitoring results and commentary around companies’ inventory levels, with business closures in the spring having contributed to a glut of unsold items at many stores. This has pushed retailers to sell items with mark-downs to incentive shoppers to purchase excess items, in turn cutting into profitability. Ross Stores executives had said in May they expected the majority of mark-down activity to take place during the fiscal second quarter.A man walks near a sign informing customers that face coverings are required in front of a Walmart store in Washington, DC on July 15, 2020. (Photo by ANDREW CABALLERO-REYNOLDS / AFP) (Photo by ANDREW CABALLERO-REYNOLDS/AFP via Getty Images)Housing dataOn the economic data front, reports on the state of the US housing market will also serve as a focal point this week.Each of these reports is expected to reflect the ongoing recovery in the housing market from the lows of March and April. Low interest rates, decelerating home price increase and a pick-up in construction and home-touring activity after virus-related shutdowns has contributed to a relatively speedy rebound in housing market activity. In late July, Bank of America economists called the housing market the “shining star” of the US economy.Housing starts, which show the pace of new-home construction and are set for release on Tuesday, are expected to have risen another 4.6% in July month-on-month. This follows a 17% jump in June, which marked the biggest month-over-month increase in nearly four years. Such a result for July would bring the seasonally adjusted annualized rate of starts to 1.24 million – a significant increase from the April low of 934,000, but a level still below that of February, when starts were at 1.6 million.Tuesday’s print on building permits is expected to show an acceleration from July. Consensus economists expect anticipate permits, a proxy for future home-building, rose by 4.9% month-over-month to a 1.32 million seasonally adjusted annualized rate. This would extend June’s 3.5% jump, but still leave permits below their pre-pandemic February level of more than 1.4 million.Existing-home sales will round out the week in economic data on Friday. Consensus economists expect sales of previously owned homes rose 14.4% in July over June, to a seasonally adjusted annualized rate of 5.4 million, following June’s record 20.7% monthly increase to 4.72 million.“Covid-19 pushed the spring selling season back, but homebuyers appear poised to make up for lost time,” Sam Bullard, senior economist at Wells Fargo Securities, wrote in a note Friday. “While the level of sales remains depressed following a 32.1% cumulative drop over the prior three months, sales likely continued to rebound in July.”“The housing market remains a rare point of strength in this young economic recovery. Even during the lockdown months, demand for homes appears to remain robust,” he added. “While shifting preferences and demographics should continue to support the housing market, the sector is not without its headwinds. Low inventories continue to exert upward pressure on prices, while increasing mortgage delinquency and use of forbearance has led to tighter lending standards.”Earnings calendarMonday: N/ATuesday: Advance Auto Parts (AAP), Home Depot (HD), Kohl’s (KSS), Walmart (WMT), Analog Devices (ADI) before market open; Jack Henry & Associates (JHY) after market closeWednesday: Lowe’s (LOW), Target (TGT), TJX Companies (TJX) before market open; L Brands (LB), Nvidia (NVDA) after market closeThursday: Alibaba (BABA), Estée Lauder (EL), BJs Wholesale Club Holdings (BJ) before market open; Ross Stores (ROST) after market closeFriday: Deere (DE), FootLocker (FL) before market openEconomic calendarMonday: Empire Manufacturing, August (15.0 expected, 17.2 in July); NAHB Housing Market Index, August (74 expected, 72 in July); Net long-term TIC flows, June ($127.0 billion in May); Total net TIC flows, June (-$4.5 billion in May)Tuesday: Housing starts, July (1.24 million expected, 1.186 million in June); Building permits, July (1.3 million expected, 1.258 million in June)Wednesday: MBA Mortgage Applications, week ended Aug. 14 (6.8% prior week); FOMC meeting minutes, July meetingThursday: Philadelphia Fed Business Outlook index, August (21.0 expected, 24.1 in July); Initial jobless claims, week ended Aug. 15 (925,000 expected, 963,000 prior week); Continuing jobless claims, week ended Aug. 8 (15.486 million prior week); Leading Index, July (1.0% expected, 2.0% in June)Friday: Markit US Manufacturing PMI, August preliminary (52.0 expected, 50.9 in July); Markit US Services PMI, August preliminary (50.8 expected, 50.0 in July); Markit US Composite PMI, August preliminary (50.3 in July); Existing home sales, July. (5.4 million expected, 4.72 million in June)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}