{"article": [{"url": "https://finance.yahoo.com/news/nasdaq-is-a-train-moving-faster-than-any-train-weve-ever-seen-before-veteran-strategist-185506190.html", "published": 1594389800.0, "headline": "Nasdaq is 'moving faster than any train we've ever seen before': veteran strategist", "body": "The Nasdaq (^IXIC), which touched fresh highs earlier this week, is like “a train that is moving faster than any train we've ever seen before,” says one veteran strategist.“This is a very very strong rally and it looks similar to what happened pre-Covid collapse, where the Nasdaq went up 11 days in a row,” James McDonald, CEO of Hercules Investments, told Yahoo Finance.The tech heavy index has seen seven out of eight sessions advancing this month, with many of the FAANG names hitting new intraday highs earlier this week.McDonald says companies like Apple (AAPL), Facebook (FB) , Amazon (AMZN), Alphabet (GOOGL) have been a “a flight to safety” as investors are “starting to see the risk coming into the market” with COVID-19 flare-ups. On Friday, Netflix (NFLX) touched fresh highs after Goldman Sachs increased its price target on the streaming service.“In the early days of tech, tech was the risky area; now it’s the safe area, and those companies are going to continue to do well,” added McDonald.TGV train at speed (blurred motion)‘It’s how much you keep at the end of the day’The strategist warns though of “significant pullbacks,” highlighting June 11th’s sell-off, when the Dow (^DJIA) slid almost 7%, the largest one-day decline since March.“As an adviser, if someone hires me today, I can’t put them into FAANGs at these 52-week highs,” said McDonald. “We’re making money on the downside, buying puts at each of these tops.”As for the Nasdaq, he says anything aside from big tech is likely to be weak.“Even with big tech like Apple and Amazon, those firms have seen extraordinary run-ups in the month and in the past three months,” he added.“The best way to approach that from investors in those companies is to put in trailing stops,” said McDonald.“You don’t want to miss the ride up, but you want to lock in your gains. It’s not how much money you make, it’s how much money you keep at the end of the day.”Yahoo Finance PremiumInes covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreStory continuesBearish Tesla analyst explains why shares could surge to $2,070The days of $100 oil are over': Bubba Trading founderProposed direct listing change would 'encourage more companies to go public': IPO expert'There's a risk of a lost decade here:' former IMF adviserFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}