{"article": [{"url": "https://finance.yahoo.com/news/11-ways-trump-is-out-of-touch-with-voters-153255903.html", "published": 1595932820.0, "headline": "11 ways Trump is out of touch with voters", "body": "With barely three months until Election Day, President Trump is in a deep slump, with polls showing him trailing Democrat Joe Biden by more than 9 percentage points. Biden’s lead is much bigger than Hillary Clinton’s at the same point in 2016.That could change. The reeling economy could improve come fall, probably the one thing Trump needs most. A surprise vaccine breakthrough could hasten the end of the coronavirus pandemic. The fumbly Biden could self-destruct in some way. Trump obviously beat long odds in 2016, and he could do it again.A core problem for Trump, however, is that he’s out of step with the U.S. electorate on many issues. Trump famously caters to his loyal base, with midwestern working-class whites at the core. But Trump alienates moderates and Independents who might otherwise support him with hardline base-pleasing policies on issues such as immigration, climate change and, now, “law and order.” Trump can recover in the polls somewhat, but it’s not clear he can win over voters who disagree with him on so many issues, such as these:The coronavirus threat. Trump has consistently dismissed the risk posed by the coronavirus, and he still insists it will disappear. Most Americans are more concerned, with 67% saying the virus is a major risk to the health of the American public.President Donald Trump wears a face mask as he participates in a tour of Bioprocess Innovation Center at Fujifilm Diosynth Biotechnologies, Monday, July 27, 2020, in Morrisville, N.C. (AP Photo/Evan Vucci)Wearing masks. Trump refused to wear a mask in public until mid-July, reportedly because he felt it would make him look silly. He finally got the message from the rest of the country, where 75% of Americans support wearing a mask in public. Even 58% of Republicans are pro-mask.The federal coronavirus battle. Three-fifths of Americans say it’s the federal government’s job to oversee coronavirus testing and make sure there are enough tests. Trump has refused to establish a federal testing program and instead put the burden on states, causing shortages and long wait times for test results.Reopening schools. Trump is pushing hard for schools everywhere to fully reopen in the fall, regardless of coronavirus levels. This might convey a sense of normalcy as voters decide whether to give Trump a second term in November. But only 22% of Americans think schools should reopen more or less normally. Nearly one-third say schools shouldn’t open at all, and 46% say they should open only with major adjustments to keep kids and teachers safe.Story continuesBlack Lives Matter. Trump has called the modern civil rights movement a “symbol of hate,” and came close to encouraging police to shoot protesters. Voters don’t see it his way: 67% of Americans say they support Black Lives Matter, including 61% of whites.PORTLAND, OR - JULY 25: Protestors clash with Federal Protections Officers outside the Mark O. Hatfield United States Courthouse on July 25, 2020 in Portland, Oregon. Photo: Chris Tuite/imageSPACE/MediaPunch /IPXMail-in voting. Voters want more of it—especially amid the coronavirus pandemic—with 65% saying early or absentee voting should be allowed for everybody. Trump opposes mail-in voting, claiming falsely that it leads to fraud.Tax returns. Fifty-six percent of Americans say Trump should release his tax returns, as every major presidential candidate has done since the 1970s. Trump, of course, refuses.Immigration. Americans broadly support immigration, with 77% saying it’s good for the country and 74% saying the “Dreamers”—immigrants brought to the country illegally as kids—should be allowed to stay. Trump has tried to limit protections for Dreamers and reduce immigration overall.Climate change. Most Americans think climate change is a problem where they live, and 65% think the federal government should do more to combat it. Trump has dismissed the dangers of a warming planet, rolled back carbon-emission regulations and promoted fossil fuels.Health care. Trump is still trying to repeal the Affordable Care Act, even though 51% of Americans now support it. About three-quarters of Americans also think the federal government should do more to help people obtain affordable health care. Trump has never said what he’d replace the ACA with or rolled out any kind of comprehensive health care plan.Twitter. At least 60% of voters think Trump tweets too much, with 59% saying it harms his presidency. Yet Trump clearly views his ability to communicate directly to his 84 million followers a key political and electoral advantage.Is Trump aligned with voters on any key issues? It’s probably fair to say most Americans are as eager as Trump to reopen the economy and get back to normal, even if there are major differences on how. There’s broad support for addressing China’s trade abuses, as Trump has done. And most Americans would like to see more products made in America, as Trump has pushed for. Trump has not accomplished much of that agenda in his first three-and-a-half years, however, which weakens his case for another four years.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:A double-dip recession is formingHow Biden threatens Trump’s fortuneHow to waste $1 trillionEdgy voters might reject the 2020 election outcomeHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}