{"article": [{"url": "https://finance.yahoo.com/news/how-the-supreme-court-could-reshape-obamacare-after-rbg-death-152933865.html", "published": 1600771040.0, "headline": "How the Supreme Court could reshape Obamacare after RBG's death", "body": "On Nov. 10, either eight or nine Supreme Court justices will gather for what appears set to be one of the most closely watched high court cases in years.The fate of the Affordable Care Act (ACA), also known as Obamacare, could be in the offing as justices will hear arguments about the law’s constitutionality in a case that has been making its way to the Supreme Court for years.The case had already been highly anticipated, and the recent passing of Justice Ruth Bader Ginsburg has raised the stakes even higher as President Trump and other Republicans push to take down the law while Democrats hope former President Obama’s 2010 signature achievement survives yet another challenge.“I think it is pretty obvious that this puts the ACA at risk,” Cynthia Cox, a vice president at the Kaiser Family Foundation, told Yahoo Finance. She added that “the Affordable Care Act is much more at risk of being overturned than it would have been with [Ginsburg] still on the court.”A sign on an insurance store advertises Obamacare in San Ysidro, San Diego, California, U.S., October 26, 2017. REUTERS/Mike BlakeBut like almost everything the court considers, the case is deeply complex and few are confidently predicting how all this will end up changing American’s health care system. There “are permutations that people don't take into account,” said Thomas Miller, a resident fellow at the American Enterprise Institute. “A lot of things are out on the table.”Here’s some background on the case and just a few of the different directions the justices may go.The case itselfThe case itself is between the states of Texas and California and two key questions are set to be argued.The first is whether Obamacare's individual mandate — which a lower court has ruled is unconstitutional — “is severable from the remainder of the ACA.” Then a follow-up question is whether the entire ACA should be declared invalid because of the mandate.President Trump after signing an Executive Order circumvent some of Obamacare rules in 2017 (REUTERS/Kevin Lamarque)The law has withstood two major challenges before the Supreme Court already. Back in 2012, the justices upheld the individual mandate in a case called National Federation of Independent Business v. Sebelius. The mandate was upheld — in a decision written by Chief Justice John Roberts — because it was seen as a tax. Then, in 2017, Trump’s $1.5 trillion Tax Cuts and Jobs Act tax effectively eliminated the mandate by lowering the penalty to zero.Story continuesThis was an opening for some Republican states, led by Texas, to open yet another legal fight to declare the mandate unconstitutional. Ken Paxton, Attorney General of Texas, has spearheaded the effort to take down the law and told Yahoo Finance during an appearance earlier this year that \"what we hope to offer is more choice, more opportunity for the consumer.\"In 2019, a federal appeals court in New Orleans ruled against the mandate but left open the key question of how much of the ACA must fall along with the mandate.“The next question is,” Cox explained, “if there is no individual mandate, if that's not constitutional anymore, then can you have the rest of the law without the mandate in place. That's separability.” If the mandate can be severed from the rest of the law, that would allow the other provisions to remain intact.Ken Paxton, the Attorney General of Texas, has spearheaded the effort to take down the law. (Photo by Robert Daemmrich Photography Inc/Corbis via Getty Images)What striking down the mandate might meanStriking down all or part of the law could create a “huge mess,” said Christen Linke Young, a health policy fellow at the Brookings Institution. There are currently more than 11 million people who receive health care coverage through the Obamacare marketplace.“Either way, the consequences are pretty severe,” she added. Even “striking down only the guaranteed issue and community rating components of the ACA would throw individual insurance markets into total chaos, and just be completely unworkable in the middle of a pandemic.”Another factor is the two years that have passed since Republicans effectively eliminated the mandate, and in that time, Obamacare has continued to function.“So we actually know now whether the rest of the ACA can work or not work without the individual mandate penalty,” Cox said. “The fact is that it can work and this, maybe, isn't what most experts of the ACA would have thought.”The many factors at play lead Miller — a long-time critic of Obamacare — to be skeptical that any decision will be as far reaching as either side hopes or fears.The federal government forms for applying for health coverage are seen at a rally held by supporters of Obamacare outside the Jackson-Hinds Comprehensive Health Center in Jackson, Mississippi. REUTERS/Jonathan BachmanHe said the likely outcome in the case “has been vastly overstated.” When asked to lay out the different scenarios for how this plays out, he jokingly said: “I can narrow it down to about 20 or so,” citing everything from a tie that doesn’t change precedent to the argument date being moved to a John Roberts decision that few see coming which, after all, has happened before.The scope of the Supreme Court’s decision could be limited in another way: if Democrats take control of both the House and the Senate on Election Day and pass legislation to reinstate the individual mandate which could address the underlying question in this case and, possibly, render the whole matter moot.Election seasonBut don’t expect all this legal nuance to be reflected between now and Nov. 3 as both sides expect the future of the Supreme Court to rival coronavirus as a central issue in the final stages of the campaign.“I do think that the Biden campaign is going to try to make the November election more of a referendum on health care,” Raymond James Washington Policy Analyst Edward Mills said on Yahoo Finance’s The First Trade on Monday.Democratic presidential candidate Joe Biden delivers remarks after meeting with Pennsylvania families who have benefited from the Affordable Care Act on June 25, 2020 in Lancaster, Pennsylvania. (Photo by JIM WATSON/AFP via Getty Images)The brewing battle in Congress to replace Justice Ginsburg will also keep the temperature high in the weeks ahead. Two Republican senators, Susan Collins (R-ME) and Lisa Murkowski (R-AK), have said they want to delay a vote until at least after Election Day, but Senate Majority Leader Mitch McConnell (R-KY) appears to have kept his caucus together enough to move towards a vote soon.If Trump succeeds in getting another like-minded justice on the court before Nov. 10, Chief Justice John Roberts could no longer be the swing vote with five justices inclined to repeal the law.One last thing to remember: While the arguments are happening this year, a final ruling is not expected until 2021.Adriana Belmonte is a reporter and editor covering politics and health care policy for Yahoo Finance. Ben Werschkul is the DC producer for Yahoo Finance.READ MORE:How Democrats can save ObamacareSupreme Court to hear arguments on Obamacare, now crucial amid coronavirus pandemic, right after electionThe Supreme Court will consider Obamacare's constitutionality — and the outcome could bring 'total chaos'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}