{"article": [{"url": "https://finance.yahoo.com/news/airbnb-confidentially-files-u-ipo-204435016.html", "published": 1597852340.0, "headline": "Airbnb files for IPO as short-term rental market rebounds", "body": "By Anirban Sen and Joshua Franklin(Reuters) - Short-term home rental company Airbnb Inc said on Wednesday it filed confidentially for an initial public offering with U.S. regulators, setting the stage for one of 2020's marquee U.S. stock market debuts.The move underscores a rebound in parts of the travel industry, which was battered this year by restrictions and shutdowns due to the COVID-19 pandemic.San Francisco-based Airbnb said in July that customers had booked more than 1 million nights in a single day for the first time since March 3, in part as U.S. travelers shy away from hotels and prefer to drive to local vacation rentals.Shares of U.S. online travel agency Booking Holdings Inc have rebounded around 14% in the past three months but are still down for the year.Companies can confidentially submit an IPO registration with the U.S. Securities and Exchange Commission. If Airbnb moves forward with the IPO, the filing would be made public closer to the time of the listing.The number of shares Airbnb will sell and the valuation it will seek have not yet been determined, Airbnb said in a statement.Airbnb did not give a timeline for when it may complete its IPO. The company is targeting a listing before the end of the year, according to a person familiar with the matter, cautioning this is dependant on market conditions.The collapse of Airbnb's core home-rental business due to the COVID-19 pandemic had prompted Airbnb to suspend marketing activities for the year and cut about 25% of its workforce.The company in April also raised $2 billion in debt from investors, which valued it at $18 billion, well below the $26 billion Airbnb cited as an internal valuation in early March.\"The company may be thinking that the lost value they've realized in 2020 could be recouped as a public company and that will be reflected in the upside in their stock price,\" said Andrea Walne, general partner at Manhattan Venture Partners, an Airbnb investor.Story continuesAirbnb's decision to go public came as U.S. capital markets stage a stunning recovery, with the likes of online used car seller Vroom Inc and business intelligence platform ZoomInfo Technologies Inc seeing their shares surge after going public.\"We believe that investors are willing to look beyond COVID issues and value companies based upon post-COVID scenarios. It's a constructive IPO market,\" said Kathleen Smith, principal at Renaissance Capital, a provider of institutional research and IPO ETFsMorgan Stanley and Goldman Sachs Group Inc are lead advisers on the IPO.(Reporting by Anirban Sen in Bengaluru and Joshua Franklin in Boston: Additionial reporting by Neha Malara, Niket Nishant; Editing by Shounak Dasgupta and Cynthia Osterman)"}]}