{"article": [{"url": "https://finance.yahoo.com/news/us-will-become-a-renter-nation-says-investor-183327180.html", "published": 1602164480.0, "headline": "US will ‘become a renter nation,' says real estate investor", "body": "Rising home prices are keeping prospective buyers out of homeownership — and some investors say it could be good for the rental market.High demand, low supply and low mortgage rates have driven up home prices to historic highs this summer. And for every $1,000 price increase, some 150,000 potential buyers are priced out of a home purchase — keeping them in the rental market.“Homeownership is still dead in this country because the only people that are buying homes right now are people that have equity, great credit and a job,” multi-family housing investor Grant Cardone told Yahoo Finance.Home prices usually drop in the fall, but median home prices hovered near summer highs at $350,000 last week, up 12.9% for the week ending October 3 compared to the same time last year, according to Realtor.com.“If you keep pushing prices, you’re pricing people out. There’s no way around that,” said Ali Wolf, chief economist at Meyers Research, a California-based market data firm.Meanwhile rent prices slid this summer, making apartments even more desirable and attainable for Americans during the pandemic. The national median rent price for a one-bedroom apartment was down 0.1% from last month to $1,231 according to Zumper, following a summer of stalled rent prices.“We’re going to become a renter nation in this country,” said Cardone. “Renting will become the economic choice and the desirable choice again…”Red shoes from above on the white arrows,dilemmas concept buy or rentAmericans — especially renters — have lower credit scores, higher rates of unemployment and less savings for a downpayment than they did at the beginning of the pandemic. Renters were more likely to fall behind on rent payments and more likely to lose their jobs during the pandemic, according to Nerdwallet, a California-based personal finance company.“There is an overlap in the people most likely to rent and those most likely to be hit by unemployment. For example, younger people and those working in hotel and food industries have both higher rental rates and are more likely to have lost their job during the pandemic,” said Elizabeth Renter, data analyst at Nerdwallet.Story continuesMeanwhile, lenders have increased requirements to slow homebuying demand as they scramble to distribute a record $3.9 trillion in loans this year, according to a Fannie Mae forecast.“Homeownership is being driven by the upper class,” said Cardone. “You need a job that is secure, they’re [the banks] going to look at how you actually went through March, April, May and June with your job. If that was even slightly suspect, you’re not gonna get a home loan… You need a better credit score than you needed before COVID, and you need to secure a job.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Opendoor and other iBuyers’ sales stall despite hot housing marketHome searches reveal that swing states may turn blue on Election Day: Realtor.comThe cities most at risk of a housing bubble: UBS"}]}