{"article": [{"url": "https://finance.yahoo.com/news/from-aunt-jemima-to-uncle-bens-a-reckoning-has-come-for-racist-brand-names-and-logos-181829211.html", "published": 1592486780.0, "headline": "From Aunt Jemima to Uncle Ben's, a reckoning for racist brand names and logos", "body": "Change happens slowly, then all at once.The nationwide social justice protests after the death of George Floyd in Minneapolis police custody have triggered a reckoning for corporate America, and now consumer brands with names and logos rooted in racial stereotypes are rushing to fix them.Quaker Oats, owned by PepsiCo (PEP) since 2001, will say goodbye to Aunt Jemima, the face of its 130-year-old pancake batter and syrup brand. The company will change the name and logo of the brand after social media outcry, driven by singer Kirby Lauryen’s viral TikTok video on “How to make a non-racist breakfast,” in which she told the origin story of Aunt Jemima, then poured out the batter.“We recognize Aunt Jemima’s origins are based on a racial stereotype,” said Quaker Foods North America CMO Kristin Kroepfl in a statement on Wednesday. “As we work to make progress toward racial equality through several initiatives, we also must take a hard look at our portfolio of brands and ensure they reflect our values and meet our consumers' expectations.\"It only took a few hours for Uncle Ben’s Rice parent company Mars Inc to follow suit. The brand on Wednesday said it will retire the Uncle Ben character, long criticized as racist since “uncle” was a derogatory term white people would use for black men in the Jim Crow era.Mars Inc said, “Now is the right time to evolve the brand... We don't yet know what the exact changes or timing will be, but we are evaluating all possibilities.” (UPDATE, Sept. 23, 2020: Mars scrubbed the Ben image from its packaging and changed the name to “Ben’s Original.”)Mrs. Butterworth’s and Cream of Wheat came next. Both products use logos based on black stereotypes.Conagra Brands (CAG), owner of Mrs. Butterworth’s, said on Wednesday it is initiating a “complete brand and packaging review on Mrs. Butterworth's.” B&G Foods, owner of Cream of Wheat—which bears a smiling black chef on the box who is based on a racist caricature from minstrel shows—said, “We understand there are concerns regarding the Chef image, and we are committed to evaluating our packaging and will proactively take steps to ensure that we and our brands do not inadvertently contribute to systemic racism.”Story continuesOn Thursday, Colgate-Palmolive joined the discussion. The company jointly owns Darlie, one of the leading toothpaste brands in China, and now says it is “working with our partner to review and further evolve all aspects of the brand, including the brand name.” Darlie was called Darkie until 1989 and featured on its package a grinning black caricature in a top hat.Land O’Lakes, member-owned and based in Minnesota, made its move in April. The company removed the kneeling Native American woman, long seen as an offensive stereotype, from all its butter packaging.Boxes of Uncle Ben's rice are displayed on a shelf at a Safeway store on June 17, 2020 in San Anselmo, California. Quaker Oats announced that it will discontinue the 130-year-old Aunt Jemima brand and logo over concerns of the brand being based on a racial stereotype. Mars, the maker of Uncle Ben's rice is also considering a change in the rice brand. (Photo by Justin Sullivan/Getty Images)Of course, these companies already knew the problems with these logos, and have known for years. A few years ago, Quaker even removed the kerchief from Aunt Jemima in response to criticism, and added pearl earrings and a white collar.As such, there is a touch of the disingenuous in these rebrands, since they prompt the question: Why did it take so long? And, would these brands have taken these actions without the social media backlash forcing their hand? The moves tend to look reactive rather than proactive.It isn’t just consumer products. The popular Grammy-winning country band Lady Antebellum announced this month that the band will change its name to Lady A, dropping the “Antebellum.” The band said in a statement, in part, “We named our band after the Southern ‘antebellum’ style home where we took our first photos.... We did not take into account the associations that weigh down this word referring to the period of history before the Civil War, which includes slavery. We are deeply sorry for the hurt this has caused.”The band’s statement also addressed the “why now” and “why not sooner” questions that can arise from many of these new rebrands: “We understand that many of you may ask the question ‘Why have you not made this change until now?’ The answer is that we can make no excuse for our lateness to this realization. What we can do is acknowledge it, turn from it, and take action.”TODAY -- Pictured: (l-r) Hillary Scott of Lady Antebellum, Dave Haywood on Friday, November 15, 2019 -- (Photo by: Nathan Congleton/NBC/NBCU Photo Bank via Getty Images)And the tide of change is hitting sports.Nascar banned Confederate flags at all of its events just two days after its only current full-time black driver called for the ban. In the NFL, the kneeling protests that Colin Kaepernick started in 2016 are expected to return, and the league will reportedly allow and support them, a reversal from four years ago. On June 5, just two days after New Orleans Saints quarterback Drew Brees set off a national firestorm when he told Yahoo Finance he will “never agree with anybody disrespecting the flag,” NFL Commissioner Roger Goodell released a video in which he said, “We the NFL admit we were wrong for not listening to NFL players earlier, and encourage all to speak out and peacefully protest.” The Goodell video was reportedly a direct result of a “Black Lives Matter” video that featured a number of NFL stars, including last season’s Super Bowl MVP Patrick Mahomes.Now a range of players and coaches have already said they plan to kneel during the national anthem this coming NFL season.Next, it’s reasonable to wonder if the reckoning might hit team names and mascots long criticized as racist, including most notably the Washington Redskins.(This post will be updated as more rebrands are announced.)—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Nascar's only black driver Bubba Wallace changed the sport in 2 days—and it's having ripple effects beyond racingReebok ends its CrossFit sponsorship over CrossFit CEO's tweet about George FloydNike is setting the tone for sports brands in its response to the George Floyd protestsDrew Brees on potential return of NFL kneeling protests: 'I will never agree with anybody disrespecting the flag'Companies like Nike and Dick’s are ‘finding their woke values’Dunkin exec: ‘We are not Starbucks, we are not political’From Tiki to Tic Tac, Trump era forces consumer brands into politics"}]}