{"article": [{"url": "https://finance.yahoo.com/news/how-democrats-can-save-obamacare-160407872.html", "published": 1600686740.0, "headline": "How Democrats can save Obamacare", "body": "The death of Supreme Court Justice Ruth Bader Ginsburg provides a new opportunity for conservatives to kill the Affordable Care Act, which is on the court’s agenda this fall. On Nov. 10—one week after the 2020 elections—the court will hear a case arguing that the entire ACA is invalid and should be struck down. If President Trump is able to appoint a new justice as hostile to the ACA as at least four other conservatives now on the court, it could finally kill the landmark law President Obama signed in 2010.But Democrats can pre-empt any action by the Supreme Court if Joe Biden wins the White House and Democrats take control of the Senate. With full control of Congress and the White House, Democrats could easily pass legislation that would address the key question in the Supreme Court case and basically render the whole matter moot. “Congress could ensure that the ACA is considered constitutional once again and take this issue out of the Court’s hands,” law professor Katie Keith of Georgetown University wrote recently for the journal Health Affairs.The case now at the Supreme Court is a suit filed by the Texas Attorney General in 2018. As part of the 2017 Tax Cuts and Jobs Act, Congress eliminated the penalty fee for people who go without insurance and therefore violate the “individual mandate” clause of the ACA requiring everyone to have some form of insurance. The Texas suit argues that without the penalty fee, the individual mandate—which remains part of the law—is also invalid, and that in turn makes the entire law unconstitutional. Many legal experts think that’s flimsy logic, yet the suit has survived legal challenges and could still sink Obamacare, as the ACA is known, if the Supreme Court upholds a lower court’s finding.President Donald Trump wraps up his speech at a campaign rally at Fayetteville Regional Airport, Saturday, Sept. 19, 2020, in Fayetteville, N.C. (AP Photo/Evan VucciRaise the penaltyThe court probably won’t issue a ruling till next June. But Congress could render the whole argument moot by passing simple legislation before then. If Congress raised the penalty fee from $0 to some nominal amount such as $5 per year or even $1, it would once again function as a tax that raises revenue—as the penalty fee did originally—and fully addresses the technical argument that forms the basis of the Texas suit. Congress could also repeal the individual mandate altogether, while leaving the rest of the ACA unchanged. Or, Congress could pass legislation declaring the individual mandate “severable” from the rest of the ACA, meaning that eliminating that one clause has no effect on the rest of the law.Story continuesThere’s almost no chance a split Congress, such as the current one, could pass such legislation, or Trump would sign it. Republicans have vowed to “repeal and replace” Obamacare since it passed in 2010, and in 2017 they almost did. The Trump administration supports the Texas suit, which means Trump is still lobbying to kill the ACA. Trump said over the summer that he’d release his own health care plan by the end of August, but he hasn’t. His entire health care plan consists of seven bullet points including “lower healthcare insurance premiums” and “cover all pre-existing conditions.” No word on how.Obamacare already prevents insurers from discriminating based on pre-existing conditions. So why would Trump propose something that’s already done? Because he still hopes the courts kill Obamacare in its entirety, which would allow insurers to once again charge people more, or deny them coverage, if they’ve had cancer or heart disease or some other condition indicating their future health care costs might be higher than average. Republicans have proposed various alternatives to the Obamacare measure making such discrimination illegal, but they’re generally not as broad or as bulletproof.Democratic presidential candidate Joe Biden speaks to Stacie Ritter (R) and her one of her twins, Jan, about how they have benefited from the Affordable Care Act during an event at the Lancaster Recreation Center on June 25, 2020 in Lancaster, Pa. (Photo by Joshua Roberts/Getty Images)Roughly 54 million Americans under 65 have pre-existing conditions and would face new limits on their ability to get coverage if the Supreme Court strikes down Obamacare. The ACA’s protection of these people is one reason the law’s popularity has risen over time, with about half of Americans now approving of the law, up from 33% at the low point in late 2013. Trump is not campaigning on repealing the ACA as he did in 2016, even though it remains his official stance.Biden, for his part, wants to shore up the ACA by expanding subsidies and reducing out-of-pocket costs for people who don’t qualify for them. He also wants to lower the Medicare eligibility age from 65 to 60 and establish a new public health program for people who can’t get affordable insurance on the private market. It wouldn’t be surprising if Biden added another small plank promising legislative fixes that would protect the ACA from the Supreme Court, no matter who the next justice is—while making sure voters know he’d need a Democratic Senate to do it.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Why Trump has stopped talking about ObamacareHow Biden would undo the Trump tax cuts5 campaign promises Trump has given up onBiden’s top economic priority isn’t what you thinkWhy Trump wants to shackle the postal serviceEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}