{"article": [{"url": "https://finance.yahoo.com/news/netflix-cofounder-brushes-off-new-peacock-streaming-competitor-150349488.html", "published": 1594980680.0, "headline": "Netflix co-founder brushes off NBC's new Peacock streaming competitor", "body": "Disney (DIS) entering the steaming wars last year didn’t strike panic in the heart of Netflix’s co-founder, and now as NBCUniversal’s Peacock streaming service officially launches, it’s déjà vu all over again for the man who first led the streaming leader.Even as Peacock pushes the number of major players in the streaming space well past 10, Netflix’s first CEO Marc Randolph told Yahoo Finance that Netflix (NFLX) will remain unshaken on its path to continue outpacing the competition.Interestingly, Peacock launched this week with a slightly different option for customers by offering a free, ad-supported tier as well as a paid subscription option. Despite that, Randolph says it won’t be enough to entice Netflix to do the same, nor will it be enough to shake things up.“If they had been first or second they may have designed a slightly different product,” he said in a new interview with Yahoo Finance’s YFi PM. “When you’re the tenth guy in, you have to shake up the playbook, and certainly [the COVID-19 pandemic] has not helped their situation.”As Randolph knows well from his days building out Netflix when it was still shipping DVDs, sometimes launches don’t necessarily go according to plan. Despite more Americans streaming content in the stay-at-home environment sparked by the pandemic, Peacock is not launching with the content it had hoped for. Mainly, NBC’s parent company Comcast has struggled through the Tokyo Olympics getting postponed due to the pandemic, which limited the firepower of exclusive offerings that were supposed to fuel the intrigue of the media giant’s streaming platform.Netflix co-founder Marc Randolph now spends most of his time coaching early stage startups and founders. (Photo by George Pimentel/Getty Images for Audi)“They wanted to use the Olympics as this major thing that would have helped enable them to really drive noticeability and content, but of course, no Olympics,” Randolph said. “They wanted to come out with, of course, big new flashy content and with the exception of maybe Brave New World there’s not a lot new there.”That said, Randolph says there is still the possibility that Peacock could blossom into a worthwhile competitor given NBC’s umbrella of content and size. Next year it will pull back “The Office” from Netflix, which has been one of the platform’s most streamed series. Beyond that, there’s always the allure of packaging sports content, something other streaming options don’t have.Story continuesParaphrasing former U.S. Defense Secretary Donald Rumsfeld, Randolph classified Peacock’s launch as a perfect example of a streaming service entering the streaming wars with the features it has, not the features it wanted.“They don’t have mobile downloads, they don’t have 4K [steaming quality] but they are going to have these things. I think it’s going to take a while,” Randolph said. “I think it’s not going to be until next year that we see Peacock coming into its own. I think it’s starting off with its wings a little bit clipped.”Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Why Netflix CEO Reed Hastings once fired his co-founder via a PowerPointSmall US towns are neglected from coronavirus relief and it's a 'slap in the face': Georgia mayorWhy Costco could see a lasting boost from coronavirus panic buying"}]}