{"article": [{"url": "https://finance.yahoo.com/news/bank-offering-6-called-loan-doctor-sued-for-allegedly-trading-insured-deposits-in-stock-market-194624703.html", "published": 1594392860.0, "headline": "'Bank' offering 6% called Loan Doctor sued for allegedly trading 'insured' deposits in stock market", "body": "The CFPB sued the Loan Doctor that advertised 6% interest CD accounts.Last November, a company called Loan Doctor Financial launched an online CD account called a “Healthcare Finance Savings CD Account” that claimed to pay interest rates of 6%. With the deposits, the company, which the CFPB says called itself a “commercial bank,” would purportedly make loans to medical professionals, which it said represented a low credit risk. The company denies that it called itself a “commercial bank.”With the very best rates of the online banks (Marcus, Ally, Synchrony) paying around 2% APY, the numbers stuck out because they were pitched as an almost risk-free investment with returns rivaling the stock market’s.But this week, the Consumer Financial Protection Bureau filed suit against the company and its CEO Dr. Edgar Radjabli for \"deceptive acts and practices in marketing a savings CD account.\"Among the practices the CFPB alleges: taking money from people who thought it was going to insured cash-equivalent accounts and instead using the funds to trade stocks.More than 400 people put money into the supposed high-yielding CDs, totaling over $15 million. The minimum deposit for the “best savings rate in the US” was $1,000, with withdrawals with one month’s notice allowed and no fees.“Loan Doctor and Radjabli falsely represented that Loan Doctor was a commercial bank and that consumers’ deposits were safe and comparable to a traditional savings account with a guaranteed return,” wrote the Bureau in a press release. “In fact, Loan Doctor was not a commercial bank, and consumers’ deposits were invested in volatile securities or securities-backed investments.”In a statement provided by the Loan Doctor’s attorney Anthony Alexis, a former CFPB assistant director and head of the office of enforcement now in the private sector, the company denied the claims and explained why it did not settle with the Bureau as most companies do.“Even though we cooperated fully with the CFPB, we could not reach a final resolution that provided a truthful narrative for the facts and circumstances surrounding the product and all that Loan Doctor has done to correct the regulatory requirements the CFPB claims needed to be addressed,” said Alexis.Story continuesAlexis added that the Bureau refused to acknowledge that the company has returned all invested money including the interest it had promised.“To our knowledge, there were no complaints and the program presented a great investment opportunity during a time of significant economic and financial stress,” said Alexis. “Confident that the allegations have no merit, Loan Doctor looks forward to clearing its name and continuing to provide quality services to healthcare professionals soon.”Targeted Facebook ads, and a heavy dose of skepticismMillions love high-yield savings accounts because they pay some of the highest interest rates of accounts with FDIC security. If the bank goes bust, the government will make things right for balances up to $250,000 per account.The Loan Doctor, according to the CFPB, marketed itself as putting deposits into “an FDIC-insured account, an account insured by Lloyd’s of London, or a ‘cash alternative’ or ‘cash equivalent,’ and, further, that Loan Doctor would maintain a cash reserve in an amount ‘equivalent to’ the amount consumers deposited.”At a glance — at least the 400 people who put money in — this might seem as if it means the money is completely safe, but the CFPB said it wasn’t.According to the complaint against it, the company “falsely touted the stability of its HCF High Yield CD Accounts by likening those accounts to various types of savings accounts and falsely describing itself as a “commercial bank.”The company's FAQ page says that the accounts are currently closed. The BBB website does not have a rating for it currently, though the company claims an \"A-\" rating. (Yahoo Finance screenshot)Contemporaneous posts on Reddit show that at least some people were curious, but many thought it was a “scam” and didn’t “look legit.” One skeptical Redditor noted that despite the FDIC name-drop, Loan Doctor didn’t say it was insured anywhere. “Your deposits are not protected,” they wrote.However, that loophole wasn’t even true for the Loan Doctor. In its fine print, according to the CFPB, it said, “the principal is guaranteed and insured. The interest is not, but we have paid 6% through all of 2019 and 5% to 6.25% in years prior.”“Those who participated in this product were sophisticated investors – many invested hundreds of thousands of dollars,” said Alexis. “The product included a clear customer agreement, with all required disclosures and information, none of which were challenged by the CFPB in its investigation or its complaint.”The complaint also alleges that the company falsely represented past returns.To blast these claims out, the company turned to the tried-and-true method of Facebook and Google ad targeting, hoping to lure the digitally savvy but naive into thinking that they had found the one risk-free high-yield secret.One Facebook post read: “Hey Mom and Dad, Are you getting a Guaranteed 6% APY on my college fund?”Most of the claims were untrue, the CFPB alleges. The Loan Doctor claimed to have buyers for the loans it originated beforehand, which it didn’t. It also claimed to have originated $500 million in loans.“In fact, Loan Doctor never originated a loan for a healthcare professional,” the CFPB wrote in the complaint.CFPB asks the Loan Doctor to stop, but it keeps operatingIn March, the CFPB asked the Loan Doctor to stop offering and marketing the CD accounts.According to the Bureau, it only \"partially\" stopped operating, but continued to sell the products under a different name \"while still concealing its risks to consumers,\" after seeking advice from financial advisors on how to find a new name that wasn't a CD that \"conveys the security, predictable income, imperviousness to stock market volatility, etc., of the product but without sounding like a bank product.\"Getty ImagesThe Loan Doctor story is probably over — though it will fight in court — but it’s relevant given the current climate of the economy and stock market. The story comes as interest rates for high-yield savings accounts and CDs continue to drop, with some of the highest-paying accounts from places like Ally (ALLY) and Marcus (GS) recently dropping their rates once again to 1.00% APY. In early 2019, Marcus paid out 2.25% APY.These may be historically good, much higher than the current national APY average of around 0.10%, but they’re much lower than the 2.25% they were two years ago. Promises of higher rates are certainly alluring, especially with the most volatile market since the Financial Crisis.Though it probably sounded too good to be true to most people — including the Redditors — as did almost everyone in the media, who didn’t write about this, 400 people did cough up at least $1,000 each.There’s essentially nothing on the Loan Doctor in the financial media, save for an interview with Nasdaq TV that was uploaded by the company itself to YouTube and posted on the company’s home page. The company’s press page hosts many links to “media” articles — including Yahoo Finance — but they’re just press releases from Cison PR Newswire, not actual news stories.If there’s one key takeaway from all this, it’s yet another reminder that free lunches don’t exist and putting your money on the line to get one can be a very risky thing indeed.Update 5/21: Added company statement that it denies that it called itself a “commercial bank” as alleged by the CFPB.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.What have we learned from the $HTZ debacle?Black communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey'We're seeing a 6,000% increase in spam': IBM cyber VP"}]}