{"article": [{"url": "https://finance.yahoo.com/news/macys-beats-quarterly-sales-expectations-111702652.html", "published": 1599027920.0, "headline": "Macy's rethinks holidays in the time of COVID-19 with new gifts, online focus", "body": "By Melissa Fares and Nivedita Balu(Reuters) - Macy's Inc <M.N> will drastically change how it does business this holiday season, executives said on Wednesday, placing a sharper focus on online sales and promoting more beauty and home items to shoppers opting to stay home due to the COVID-19 health crisis.Shares of the largest U.S. department store operator rose as much as 11% after it reported a smaller-than-expected quarterly loss and beat sales estimates as shoppers bought more activewear, shoes and handbags on its app and website during the pandemic. They were up about 4% in late morning trading.\"Our immediate priority is successfully executing Holiday 2020,\" Chief Executive Officer Jeff Gennette said.The holiday season accounts for a huge chunk of annual sales for retailers. This year, retailers are rolling out their earliest-ever holiday deals and promotions.Gennette said nearly half of the company's total gift assortment will be new, led by items in beauty and home, with products at every price point.Macy's will also reimagine iconic events including the Thanksgiving Day Parade, local tree lightings and holiday window displays, the company said.Recently announced holiday surcharges will lead to higher delivery expenses that will weigh on the holiday quarter, the company said.To cope with the closure of malls and stores due to coronavirus-related lockdowns, Macy's has focused on its online business, giving shoppers the option to buy online and pick up purchases from stores.Though Macy's sold more merchandise online, with digital sales surging 53% for the second quarter ended Aug. 1, it was not enough to make up for lost in-person sales.Macy's, along with its department store rivals, depends heavily on tourists - particularly those traveling from overseas - to drive sales, especially at stores like its flagship Herald Square location in New York City.\"Macy's second quarter may have exceeded consensus estimates, but the bar was set so low you could step over it,\" said Craig Johnson, president at retail consultancy Customer Growth Partners. \"The challenge is to size the going-forward company commensurately with demand, trimming the fleet even further, so that store productivity can be rebuilt.\"Story continuesThe company said it will open a number of smaller-format Macy's stores away from malls over the next two years. That comes as the retailer moves to shut hundreds of underperforming stores due to lack of mall traffic. The retailer said it would also test smaller Bloomingdale's standalone stores.Net sales fell 35.8% to $3.56 billion, but beat analysts' estimates of $3.48 billion, according to IBES data from Refinitiv.On an adjusted basis, the company lost 81 cents per share, compared with estimates of a loss of $1.77 per share.Net loss for the quarter was $431 million, or $1.39 per share, compared with a profit of $86 million, or 28 cents per share, a year earlier.(Reporting by Nivedita Balu in Bengaluru and Melissa Fares in New York; Editing by Steve Orlofsky and Bill Berkrot)"}]}