{"article": [{"url": "https://finance.yahoo.com/news/united-airlines-tripling-flights-despite-a-spike-in-coronavirus-infections-110008211.html", "published": 1593583700.0, "headline": "United Airlines is tripling flights despite a spike in coronavirus infections", "body": "United Airlines (UAL) will schedule nearly 25,000 domestic and international flights in August, tripling the total number of flights it flew in June, despite an increase in coronavirus infections nationwide.“We’re taking the same data-driven, realistic approach to growing our schedule as we did in drawing it down at the start of the pandemic,” said Ankit Gupta, United’s vice president of domestic network planning in a press release the airline issued Wednesday morning.Travel demand remains depressed although the number of passengers passing through TSA checkpoints continues to increase at an anemic pace. Some 600,000 passengers went through airport security checkpoints Monday. Passenger traffic was down 79% year-over-year for the week ending June 26. That was a slight improvement from the previous week which saw traffic down 81% compared to the same period in 2019.Raymond James analyst Savanthi Syth, in a recent note to clients, warned the recent surge in coronavirus infections could threaten the recovery in airline passenger loads. “It remains to be seen if recent upticks in cases in select states could slow or even reverse momentum (absent potential holiday distortions) as economies continue to gradually reopen” Syth wrote.United Airlines, Boeing, 787, Dreamliner, Parked at the gate, Auckland International Airport, New Zealand, 7 January 2020Turbulence ahead for the airlinesUnited says it plans to fly 40% of its overall schedule in August compared to 2019, saying, “customers are slowly returning to flying with a preference for leisure destinations” to see friends and family.Delta Air Lines (DAL) CEO Ed Bastian cited the same trend when he told Yahoo Finance that the airline added 100 flights back to its daily schedule in June. “You start to see how the revenue is climbing by staying very disciplined on cost, capping load factors and adding flights back as demand returns,” he said.But Bastian warns the recent rise in coronavirus cases nationwide may slow Delta’s plan to add flights past August. “While it’s encouraging to see flights returning... we likely remain at least two years away from a return to normal,” he said during a virtual town hall last week with employees.Story continuesUnited appears more optimistic saying it will add close to 600 daily flights to more than 200 airports across the United States this month and next. United also says demand for international travel is improving.“We’ve seen increasing demand for leisure travel and have added options to places like Cancun and reinstated service to Tahiti,” said Patrick Quayle, United’s vice president of international network and alliances.The airline plans to resume direct flights from Chicago and New York to Brussels, Frankfurt, Munich and Zurich. But Tuesday’s decision by the European Union to deny entrance to U.S. citizens could slow United’s strategy to fly 25% of its Atlantic schedule in August. United says it adjusted its schedule with that in mind and points out the U.S. remains closed to travelers from Europe. The airline expects border restrictions to ease and travelers to return.“Demand is coming back slowly and we’re building in enough capacity to stay ahead of the number of people traveling,” Gupta said.Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.'The corporate tax rate — I’m actually OK at 28%': Gary CohnDelta CEO trying to avoid furloughs 'any way we possibly can' as airlines recoverJ&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesSouthwest warns that revenue could drop as much as 95% in MayDelta shores up liquidity as coronavirus pummels demand, warns of smaller airlineFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}