{"article": [{"url": "https://finance.yahoo.com/news/student-debt-racial-and-economic-justice-issue-100016292.html", "published": 1593407300.0, "headline": "'America’s student debt crisis is a civil rights crisis,' new research concludes", "body": "A disproportionate number of American student loan borrowers live in minority neighborhoods, according to new research, highlighting how “America’s student debt crisis is a civil rights crisis.”The new report by the Student Borrower Protection Center (SBPC) analyzed student loan borrower behavior in Philadelphia, New York City, San Francisco, and Washington D.C. to determine how they are dealing with their debt.Read more: How to repay student loans: The full breakdownThe researchers found that despite living only a few blocks apart, borrowers of color struggle a lot more with their student debt. When added to existing inequities, the strain of student loans is “reinforcing social stratification and segregation across neighborhoods,” the report stated.The data “highlights how student debt is increasingly a racial and economic justice issue,” SBPC stated in an email to Yahoo Finance.(GRAPHIC: Student Borrower Protection Center/June 2020)Debt distress more prevalent on non-white neighborhoodsThe SBPC research noted that borrower distress is “heavily concentrated” in neighborhoods populated by mostly Black and Latinx people.The researchers found that in D.C., six of the eight neighborhoods where student loan debt is growing the fastest are populated mostly by minorities.That matches existing data: While median debt balances in some of the whitest neighborhoods (such as Adams Morgan and Foggy Bottom) in D.C. decreased by 30% over the last decade, debt balances in several majority-Black neighborhoods such as Brookland and Deanwood grew by as much as 217%.Latio Cosmos, who recently graduated from Seattle University with a degree in public affairs, participates in the Juneteenth Freedom March and Celebration on June 19, 2020 in Seattle, Washington. (Photo by Karen Ducey/Getty Images)In New York City, the median amount student loans held by borrowers living in Staten Island — which the authors consider white-majority — is half as much as those living in Bronx, considered majority-minority.Furthermore, given the weight of student loan debt, those in 90%-minority neighborhood neighborhoods were found to be five times more likely to fall behind on their loans as those in the whitest neighborhoods.In San Francisco, the rate of student loan delinquency in neighborhoods with the largest minority populations is over 7.5 times higher than areas with majority-white populations. And the three neighborhoods where student loans saw a delinquency rate lower than 5% are at least 75% white, the authors noted.Story continuesThe same issue presents itself in D.C.: In Chevy Chase and DuPont Circle, delinquency rates on student loans are around 1-2%. In Congress Heights (94% non-white), the delinquency rate is 35%.(GRAPHiC: Student Borrower Protection Center/June 2020)The findings reveal an irony present within higher education, the authors concluded.“Where higher education once stood as a promised gateway to the middle class, the reality is much bleaker,” the authors stated. “The disparities in the student loan market rival outcomes borne of the most predatory redlining tactics perpetrated by unscrupulous lenders. This cost is uniquely borne by borrowers of color, particularly Black and Latinx borrowers — all incurred simply because they chose to pursue the American Dream.”—Aarthi is a writer for Yahoo Finance. If you have attended a for-profit school, or worked at one, and would like to share your story, she can be reached at aarthi@yahoofinance.com. Follow her on Twitter @aarthiswami. Read more: The student loan crisis is hitting black communities particularly hard, new data showsMap: Cities in the South are being held back by student debtRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}