{"article": [{"url": "https://finance.yahoo.com/news/history-reveals-september-2020-may-be-bad-for-the-stock-market-163556888.html", "published": 1598874200.0, "headline": "History reveals September 2020 may be bad for the stock market", "body": "If history is any guide, September 2020 will be shockingly different for investors than the red-hot summer months of rallies.And it won’t be good, in case you are wondering.September tends to be a weak month for stocks historically. In fact, according to LPL Financial, September has been the worst-performing month for markets, on average, since 1950. The S&P 500 (^GSPC) has dropped about 1% on average that month since 1950, LPL Financial data shows. The only other month to notch a drop on average (and a minuscule one at that) going back to 1950 is August.But this time around, September being lackluster for markets could be further solidified because of election-related uncertainty. LPL Financial data reveals that the S&P 500 has shed 0.2% on average in election year. This year stands to be worse — or an outlier for you data fans — given how contentious this election will be and with the COVID-19 pandemic continuing to rage on globally.And October may flat out stink for markets, too.LPL Financial says the S&P 500 has dropped nearly 1% in election years dating back to 1950. That makes October the worst month for markets in an election year.Suffice it to say, most investors are in no way prepared for a cool-down in the markets this year.The S&P 500 is up about 7.2% this month, putting it on track for its best month since 1984. The Dow Jones Industrial Average has climbed roughly 8%, on pace for its strongest performance in 36 years. Tech stocks such as Apple (AAPL), Tesla (TSLA), Microsoft (MSFT) and Zoom (ZM) continue to power the market higher with little interest being paid by investors on valuations.Those staying bullish on markets right now despite seasonal forces are quick to point to cheap money from the Fed and hopes for a strong 2021 rebound in the U.S. economy as key reasons.“I am still bullish,” Invesco global market strategist Brian Levitt told Yahoo Finance’s The First Trade. “We’re in a recovery. Monetary policy is accommodative. Interest rates will be low indefinitely. Real yields are negative. We have a good demographic wave in this country. I believe this is the next elongated secular bull market.”Story continuesNow bring on September ...Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}