{"article": [{"url": "https://finance.yahoo.com/news/zoom-stock-has-surged-nearly-400-is-it-time-to-buy-hold-or-run-away-161839582.html", "published": 1598959580.0, "headline": "Zoom stock has surged nearly 400% — is it time to buy, hold or run away?", "body": "Wall Street has gone gaga for Zoom (ZM) after its latest earnings report, to say the very least. And all indications point to the Street staying united in that optimism, despite an eye-popping price-to-earnings multiple of 232 times forward earnings.Analysts hopped onto Zoom’s second quarter earnings call Monday night and congratulated execs for developing an essential communication tool to be used during a pandemic. JMP Securities analyst Pat Walravens pointed out to Yahoo Finance’s The First Trade his school age daughter got on the call and explained to founder Eric Yuan why Zoom is better than Google’s Hangout video conference offering.Count Walravens as among nearly 50% of primary Zoom analysts (this group has Buy ratings on Zoom’s stock) on the Street that remain super bullish on the company’s prospects and stock.“I have been doing this for 20 years, and I have never seen a story like this one. And it shows you the power of a really well-run company with a good mission that has exactly the service everyone needs in a crisis,” Walravens said.The analyst surmised Zoom’s market cap — now at $131 billion — could ultimately equate to the combined current market cap of Verizon Communications (the parent company of Yahoo Finance) and AT&T at about $500 million as work from home becomes stickier in the years post pandemic. Walravens’ bullishness on Zoom due to the shift to work-from-home jibes well with most others on the Street.FILE - In this April 18, 2019 file photo, Zoom CEO Eric Yuan attends the opening bell at Nasdaq as his company holds its IPO in New York. Millions of people are now working from home as part of the intensifying fight against the coronavirus outbreak. Beside relying on Zoom, the video conference service, more frequently as part of their jobs, more people are also tapping it to hold virtual happy hours with friends and family banned from gathering in public places. (AP Photo/Mark Lennihan, File)Bulls certainly got their latest pound of flesh from Zoom in its second quarter earnings.Second quarter sales surged 355% from the prior year to $663.5 million, beating Zoom’s own guidance by some $163 million. Operating income exploded to $277 million from $20.7 million a year ago.The company told analysts it continued to win larger accounts, notch success with its Zoom Phone and keep people on the system. Zoom materially raised its full-year sales and profit outlooks, too.Shares rose as much as 41% on Tuesday’s session. Year-to-date Zoom shares are now up nearly 400%.Story continuesThat’s not to say everyone on Wall Street is infatuated with Zoom’s stock. Numerous pros told Yahoo Finance the valuation looks stretched relative to future expectations as people return to offices for work in 2021.“Once different industry participants start sending people out to the field again and visiting customers, everyone else will follow. Zoom is a great business and its stock has had a great run. But I would be cashing out,” said Sevens Report Research founder Tom Essaye.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}