{"article": [{"url": "https://finance.yahoo.com/news/unfathomable-us-death-toll-coronavirus-154114378.html", "published": 1600771760.0, "headline": "'Unfathomable': US death toll from coronavirus hits 200,000", "body": "The U.S. death toll from the coronavirus topped 200,000 Tuesday, by far the highest in the world, hitting the once-unimaginable threshold six weeks before an election that is certain to be a referendum in part on President Donald Trump's handling of the crisis.“It is completely unfathomable that we’ve reached this point,” said Jennifer Nuzzo, a Johns Hopkins University public health researcher, eight months after the scourge first reached the world’s richest nation, with its state-of-the-art laboratories, top-flight scientists and stockpiles of medical supplies.The number of dead is equivalent to a 9/11 attack every day for 67 days. It is roughly equal to the population of Salt Lake City or Huntsville, Alabama.And it is still climbing. Deaths are running at close to 770 a day on average, and a widely cited model from the University of Washington predicts the U.S. toll will double to 400,000 by the end of the year as schools and colleges reopen and cold weather sets in. A vaccine is unlikely to become widely available until 2021.“The idea of 200,000 deaths is really very sobering, in some respects stunning,” Dr. Anthony Fauci, the government’s top infectious-disease expert, said on CNN.The bleak milestone was reported by Johns Hopkins, based on figures supplied by state health authorities. But the real toll is thought to be much higher, in part because many COVID-19 deaths were probably ascribed to other causes, especially early on, before widespread testing.Trump said it was “a shame” the U.S. reached that number but argued the toll could have been much worse.“I think if we didn’t do it properly and do it right, you’d have 2.5 million deaths,” Trump told reporters at the White House before leaving for a campaign rally in Pittsburgh. He added that the United States is now “doing well” and “the stock market is up.”He also gave his often-repeated broadside that China was at fault for the pandemic. In a prerecorded speech to the U.N. General Assembly, he demanded that Beijing be held accountable for having “unleashed this plague onto the world.” China’s ambassador rejected the accusations as baseless.Story continuesOn Twitter, Democratic presidential candidate Joe Biden said, “It didn’t have to be this bad.\"“It's a staggering number that’s hard to wrap your head around,” he said. “There’s a devastating human toll to this pandemic — and we can’t forget that.\"For five months, America has led the world by far in sheer numbers of confirmed infections — nearly 6.9 million as of Tuesday — and deaths. The U.S. has less than 5% of the globe’s population but more than 20% of the reported deaths.Brazil is No. 2 with about 137,000 deaths, followed by India with approximately 89,000 and Mexico with around 74,000. Only 10 countries rank higher in COVID-19 deaths per capita.“All the world’s leaders took the same test, and some have succeeded and some have failed,” said Dr. Cedric Dark, an emergency physician at Baylor College of Medicine in hard-hit Houston. “In the case of our country, we failed miserably.”Black and Hispanic people and American Indians have accounted for a disproportionate share of the deaths, underscoring the economic and health care disparities in the U.S.Worldwide, the virus has infected more than 31 million people and is closing in fast on 1 million deaths, by Johns Hopkins' count, though the real numbers are believed to be higher because of gaps in testing and reporting.For the U.S., it wasn’t supposed to go this way.When the year began, the U.S. had recently garnered recognition for its readiness for a pandemic. Health officials seemed confident as they converged on Seattle in January to deal with the country's first known case of the coronavirus, in a 35-year-old Washington state resident who had returned from visiting his family in Wuhan, China.On Feb. 26, Trump held up pages from the Global Health Security Index, a measure of readiness for health crises, and declared, “The United States is rated No. 1 most prepared.\"It was true. The U.S. outranked the 194 other countries in the index. Besides its labs, experts and strategic stockpiles, the U.S. could boast of its disease trackers and plans for rapidly communicating lifesaving information during a crisis. The U.S. Centers for Disease Control and Prevention was respected around the world for sending help to fight infectious diseases.But monitoring at airports was loose. Travel bans came too late. Only later did health officials realize the virus could spread before symptoms show up, rendering screening imperfect. The virus also swept into nursing homes and exploited poor infection controls, claiming more than 78,000 lives.At the same time, gaps in leadership led to shortages of testing supplies. Internal warnings to ramp up production of masks were ignored, leaving states to compete for protective gear.Trump downplayed the threat early on, advanced unfounded notions about the behavior of the virus, promoted unproven or dangerous treatments, complained that too much testing was making the U.S. look bad, and disdained masks, turning face coverings into a political issue.On April 10, the president predicted the U.S. wouldn't see 100,000 deaths. That milestone was reached May 27.Nowhere was the lack of leadership seen as more crucial than in testing, a key to breaking the chain of contagion.“We have from the very beginning lacked a national testing strategy,” Nuzzo said. “For reasons I can't truly fathom, we’ve refused to develop one.”Sandy Brown of Grand Blanc, Michigan, called the death toll “gut-wrenching.” Her husband of 35 years and their 20-year-old son — Freddie Lee Brown Jr. and Freddie Lee Brown III — died of COVID-19 just days apart in March, when there were fewer than 4,000 recorded deaths in the U.S.“The thing that really gets to me is ... if things had been done properly, we could have put a lid on this,” said Brown, who has no other children. “Now it's just unbelievable. It's devastating.”The real number of dead from the crisis could be significantly higher: As many as 215,000 more people than usual died in the U.S. from all causes during the first seven months of 2020, according to CDC figures. The death toll from COVID-19 during the same period was put at about 150,000 by Johns Hopkins.Researchers suspect some coronavirus deaths were overlooked, while other deaths may have been caused indirectly by the crisis, by creating such turmoil that people with chronic conditions such as diabetes or heart disease were unable or unwilling to get treatment.Dark, the emergency physician at Baylor, said that before the crisis, “people used to look to the United States with a degree of reverence. For democracy. For our moral leadership in the world. Supporting science and using technology to travel to the moon.”“Instead,” he said, \"what’s really been exposed is how anti-science we’ve become.”___Associated Press writers Kelli Kennedy in Miami and Tammy Webber in Fenton, Michigan, contributed to this story.___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.___This story was first published Sept. 22, 2020. It was updated on Sept. 23, 2020, to correct that the number countries that have experienced more deaths per capita than the U.S. is 10, not five."}]}