{"article": [{"url": "https://finance.yahoo.com/news/they-are-feeling-the-heat-democrats-preview-twin-hearings-on-the-post-office-120537797.html", "published": 1597821200.0, "headline": "They are ‘feeling the heat’: Democrats preview twin hearings on the post office", "body": "Postmaster General Louis DeJoy is scheduled to appear before twin Congressional hearings in the coming week: Senators will grill him on Friday followed by House members on Monday.And Democrats on both committees appear ready to rumble even after a high-profile retreat from the Postmaster General on Tuesday.\"President Trump, DeJoy, and the Postal Service are feeling the heat because a whole nation is really upset about this,\" Senate Minority Leader Chuck Schumer said.\"I have a long list of questions,\" added Sen. Gary Peters (D-MI) on a call with reporters. Peters has led the Democratic push for Senate hearings and he’ll be the party’s lead questioner Friday, the first opportunity Democrats have had to publicly ask DeJoy questions.Senate Minority Leader Sen. Chuck Schumer and Speaker of the House Nancy Pelosi after negotiations for a stimulus deal. (Alex Wong/Getty Images)Another Democrat on the Senate Homeland Security committee is Kamala Harris, but it’s unclear if she will step off the vice presidential campaign trail to attend the virtual hearing.The Republican leader of the committee, Sen. Ron Johnson of Wisconsin, agreed to hold the hearing and said in a statement it would be a chance for DeJoy to describe the financial problems at the USPS “before going before a hostile House committee determined to conduct a show trial.”DeJoy will indeed likely face more aggressive questioning on Monday. Chairwoman Carolyn Maloney (D-NY) runs the House oversight committee and has promised “we will get answers for the American people.” Maloney is set to ask questions alongside a group of high-profile Democrats, including Rep. Gerry Connolly (D-VA), Rep. Ro Khanna (D-CA), Rep. Alexandria Ocasio-Cortez (D-NY), Rep. Rashida Tlaib (D-MI), and Rep. Katie Porter (D-CA).I hope the Postmaster General comes prepared. I know I will. https://t.co/Lan1in5UmH— Rep. Katie Porter (@RepKatiePorter) August 17, 2020In a recent MSNBC interview, House Speaker Nancy Pelosi said the issue has been \"volcanic\" in mobilizing members of both parties to defend the service.Story continues‘I am suspending these initiatives’In the midst of the Democratic pile-on Tuesday, DeJoy announced changes to how his agency would handle the election. Since taking the job weeks ago, he has removed leaders and implemented “operational changes” that critics say is a blatant effort to hamstring the USPS and hinder mail-in voting during a pandemic.“To avoid even the appearance of any impact on election mail, I am suspending these initiatives until after the election is concluded,” DeJoy announced Tuesday. It was a striking reversal after several states, including New Jersey, had announced plans for lawsuits.Postmaster General Louis DeJoy recently met privately with Speaker Pelosi and Leader Schumer. The Democrats left the meeting deeply dissatisfied. (MANDEL NGAN/AFP via Getty Images)DeJoy, a Republican Party fundraiser, promised the USPS will “deliver the nation’s election mail on time and within our well-established service standards.”President Trump did not immediately comment while White House Chief of Staff Mark Meadows claimed “this is totally a perception issue that Postmaster General is addressing.”Trump himself was the cause the recent concern over the post office when he suggested last week he'd oppose USPS funding at least in part to hamper mail-in voting.In recent days, the president had a range of different messages as concerns grew – from complaining that Monday’s hearing would occur during the Republican National Convention to saying that he actually wants to save the post office.‘Congressional oversight cannot be interrupted’It remains to be seen how much the move lessens the temperature on the hearings. Gerry Connolly, a leading Democrat in the House on the issue, immediately tweeted that “Congressional oversight cannot be interrupted.” Sen. Peters, in a statement, added that “there are still too many unanswered questions.”I just spoke to Postmaster DeJoy. I told him I want a specific, written document of exactly what he's rescinding and explicit confirmation all election mail will be treated as First Class.We cannot allow two things as sacred as the Post Office and our elections to be undermined— Chuck Schumer (@SenSchumer) August 18, 2020Democrats have also signaled that there are plenty of topics beyond the election they’re likely to explore.“We are getting calls all the time from senior citizens: their prescriptions have come late,” Sen. Sherrod Brown (D-OH) said in an interview with Yahoo Finance. He called DeJoy a “political hack,” adding: “people that might have been voting Republican are pretty angry at the post office for doing this.”Another likely line of inquiry are DeJoy’s financial ties. He worked in logistics before coming to Washington and has maintained ties that have raised conflict of interest questions across Washington and, reportedly, within the office of the Postmaster Inspector General.Mail boxes in the parking lot of a post office in the Bronx in New York. (Bryan R. Smith / AFP)DeJoy reportedly still owns a sizable stake in his former company XPO Logistics – a USPS contractor – and also recently bought stock options in Amazon, which competes with the service.Schumer has said he believes that Trump and DeJoy’s overall motivation is “just to destroy the Post Office.”Another outstanding question which DeJoy’s surprise announcement Tuesday does not address is additional funding for the USPS. Democrats have been pushing, as part of broader stimulus negotiations, for up to $25 billion for the service in the coming years.Democrats are set to vote this weekend on a bill, sponsored by Maloney, which would prohibit the postal service from implementing any changes to the operations it had in place on Jan. 1 until the COVID-19 pandemic has ended.It’s unclear if the Senate will take up the bill, but we're \"going to push very, very hard,\" Schumer said.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:‘We see it here every day’: How a slowdown in the Postal Service is impacting small businessesUSPS in 'dire' financial position, says Postmaster GeneralShowdowns over the Postal Service loom as a union chief says Trump is ‘scapegoating’ membersRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}