{"article": [{"url": "https://finance.yahoo.com/news/goldman-sachs-just-succinctly-told-people-to-start-selling-their-overvalued-stocks-104721738.html", "published": 1594014920.0, "headline": "How Goldman Sachs just succinctly told people to start selling their overvalued stocks", "body": "If stock prices in part reflect the future potential of the economy, then Goldman Sachs just sent a major signal to investors to start lightening the load on red-hot equities in front of a challenging second half of the year brought on by the unrelenting COVID-19 pandemic.Goldman Sachs economists led by Jan Hatzius slashed their third quarter U.S. GDP forecasts by 8% to 25% growth in a new note to clients. Previously, Goldman Sachs expected 33% growth fueled by the re-openings of states that has sent a flood of people back to spending in bars, restaurants and retail stores. But with COVID-19 infections spiking again in several states and governors reinstating some form of lockdowns, Goldman thinks the economy is poised to underperform their prior estimates.“A combination of tighter state restrictions and voluntary social distancing is already having a noticeable impact on economic activity. States with the most severe deterioration in the Covid situation saw declines in consumer and workplace activity at the end of June that will likely continue into July, and activity flattened in other states,” Goldman’s team writes. “The healthy rebound in consumer services spending seen since mid-April now appears likely to stall in July and August as authorities impose further restrictions to contain virus spread. The ongoing recovery in manufacturing and construction should be largely unaffected, however.”Goldman economists reducing its third quarter GDP forecast could be a precursor to its equities team taking a more defensive posture on stocks soon.The investment bank’s equities strategists led by David Kostin have held steady in recent months with a year-end S&P 500 price target of 3,000, under-pinned by a solid acceleration of growth in the second half. But the S&P 500 — currently at 3,130 — has overshot that estimate in the hopes of a sustained V-shaped recovery amongst market goers. That may be unlikely, judging by Goldman’s revised macroeconomic thinking.Story continuesScenes from the marketGoldman’s more subdued growth outlook is refreshing.Signs of over-exuberance on stocks are abound right now. In other words, investors are wearing rose-colored glasses on the economic recovery — and prospects for new fiscal stimulus this summer — despite the pandemic continuing to rage on and growth coming under renewed pressure.Global economy and technology concept. [Credit: Getty]For one, the forward price-to-earnings multiple on the S&P 500 is 21.7 times, a level not seen since the late 1990s internet bubble, according to Yardeni Research. This level of valuation seems to blatantly ignore the headline risk of the coming second quarter earnings season, where S&P 500 earnings are expected to tank 43% year-over-year. So far, there have been 34 negative pre-announcements on second quarter earnings from companies compared to 25 positive, per Refinitiv data. Second quarter revenue is projected to plunge 11.8% from the prior year.Meanwhile, countless tech stocks have detached from any form of economic reality.The Nasdaq High-Low ratio has consistently hovered around 1, points out SunDial Capital Research, meaning that far more tech stocks trade at 52-week highs as opposed to 52-week lows. Tesla surpassed Toyota as the world’s most valuable automaker last week even as its profit outlook is far from certain. Tesla’s new electric truck rival Nikola is now valued at more than $20 billion after debuting on the Nasdaq on June 4.The company has yet to produce any of its cool trucks and has no profits to speak of yet.“What you’re looking at today is a sustained rally on the likelihood that we’ll see some sort of therapeutics or treatments come to the fore later this year or in early 2021. I’m not so certain I’m comfortable with stating that we’re in a bull market,” RSM chief economist Joseph Brusuelas said on Yahoo Finance’s The First Trade.Goldman may not be so sure, either.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}