{"article": [{"url": "https://finance.yahoo.com/news/most-companies-plan-to-give-raises-and-bonuses-in-2021-survey-164000202.html", "published": 1597664900.0, "headline": "Most companies plan to give raises and bonuses in 2021: survey", "body": "The coronavirus crisis has hurt earnings, spending, and caused never-before-seen unemployment levels in the U.S. But a new survey from advisory firm Willis Towers Watson finds that most companies are planning to give employees raises and bonuses next year.Willis Towers Watson surveyed U.S. industries about their 2021 compensation plans and found that companies are projecting salary increases of 2.8% on average — across all levels of employees, hourly and salaried. According to the survey, this year saw a 2.7% increase, slightly below the projected 3%. The standard over the past decade has been around 3%.This year 14% of companies elected not to plan pay increases, and many industries are tightening their belts this year. The financial services industry, Reuters reports, expects to see bonuses slashed and job cuts with only investment bankers doing well as companies scramble to raise money.A person wearing a face mask walks along Wall Street after further cases of coronavirus were confirmed in New York City, New York, U.S., March 6, 2020. REUTERS/Andrew KellyHowever, Willis Towers Watson's findings indicate that only 7% of companies plan to forgo raises next year, which the company calls \"an indication that many organizations are projecting a turn toward normalcy in 2021.\"Despite the bumps in salary that are projected, some industries will see smaller increases than usual. Health care and retail, which were hit especially hard by the coronavirus, will still see bumps, but they will likely be less than usual. On the other hand, the nondurable goods industries and insurance industry should see above-average salary gains, the survey noted.As the pandemic underscored, planning and projections are always subject to change, and the current uncertain state of the economy led Catherine Hartmann, Willis Towers Watson's North America Rewards practice leader, to call this time the \"most challenging compensation year for many companies since the Great Recession.\"Getty ImagesHartmann noted that even though most companies prioritized avoiding salary cuts during the first part of the crisis, they’re dialing back increases and bonuses this year to help keep costs down.Story continuesInterestingly, this is a similar tactic that advisory firms see companies taking should they move to a larger remote workforce. Though some companies like Facebook have announced that they will adjust people’s salaries to the geographic area they end up in come January, consulting firm Mercer said many companies in the past have simply adjusted a person’s salary band for their job — slowing the rate of raises and increases, allowing them to normalize to the new geographic guidelines over time.Companies told Willis Towers Watson they were embracing variable pay structures to compensate and reward top performers to make sure they were able to retain talent. \"Star performers\" are likely to see raises 68% higher than average employees.On the bonus front, 76% of companies planned on awarding a bonus in 2021 — flat compared to this year.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.The key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right nowRetail investors have seen huge gains as S&P 500 nears pre-pandemic highCompany matches are mostly surviving the coronavirusThere are two types of stocks on RobinhoodWhy you should consider deleting your stock trading appThe 2008 recession was far worse for young people's careers than previously thoughtBlack-owned small businesses continue to face harsh cash crunch"}]}