{"article": [{"url": "https://finance.yahoo.com/news/what-palantir-does-direct-listing-202144724.html", "published": 1601306960.0, "headline": "Palantir eyes $22B market debut — here's what the secretive big-data firm does", "body": "Palantir (PLTR), the secretive big-data firm co-founded by billionaire PayPal (PYPL) co-founder and Facebook (FB) investor Peter Thiel, will make its stock market debut via a direct listing on Sept. 30 with a valuation estimated at $22 billion.Much of what Palantir does and how it uses its troves of data is opaque to all but the most dedicated followers. Founded in 2004 with funding from the CIA’s not-for-profit venture capital arm In-Q-Tel, Palantir is named for mystical orbs in J.R.R. Tolkien’s “The Lord of the Rings” universe that can see both the past and present and allow users to communicate over vast distances.That’s not exactly far afield of how Palantir itself operates. It provides customized software to clients analyzing large swaths of data for purposes ranging from finding suspected criminals to improving companies’ manufacturing capabilities.Palantir has courted significant controversy due to its work with government agencies, including Immigration and Customs Enforcement (ICE), and due to Thiel’s support for President Donald Trump. There are also still questions as to when it will turn a profit. Like many tech unicorns that have recently gone public, Palantir has yet to turn make any money, losing $580 million in 2018 and $579 million in 2019.What is Palantir and who runs it?The logo of U.S. software company Palantir Technologies is seen in Davos, Switzerland Januar 22, 2020. REUTERS/Arnd WiegmannPalantir has two main services that analyze data: Palantir Gotham and Palantir Foundry.A customized option, Palantir Gotham is used by companies, government agencies, and law enforcement to combine information to uncover previously unseen patterns and identify relationships between sets of data ranging from social media posts and addresses to license plate numbers and personal relationships. The service then puts all of that content together in easy-to-understand charts and graphs.Meanwhile, Foundry is a ready-made option focusing on clients ranging from pharmaceutical and automotive businesses to aviation companies like Airbus, and is meant to cut down on the costs associated with Gotham, such as the need for multiple on-site engineers.Story continuesYahoo Finance newsletter.Palantir offers a variety of what it calls solutions for different types of applications, whether that’s for automotive companies, the defense sector, financial compliance, insurance, intelligence operations, law enforcement, and others.The company is guided by billionaire co-founder and CEO Alex Karp. A graduate of Stanford Law School, like Thiel, Karp has run Palantir since shortly after its inception. Prior to Palantir, Karp founded the money management firm Caedmon Group.Palantir Technologies CEO Alex Karp arrives at the \"Tech for Good\" Summit in Paris, France May 15, 2019. REUTERS/Charles PlatiauKarp has been vocal about his belief in the need for Silicon Valley companies to work with the U.S. government and law enforcement agencies. In a 2019 interview with CNBC, Karp had pointed words for firms like Google (GOOG, GOOGL) that have pulled out of contracts with the government.“That is a loser position. It is not intelligible. It is not intelligible to the average person. It’s academically not sustainable. And I am very happy we’re not on that side of the debate,” he said.Wins and controversiesPalantir says its software has assisted companies and government agencies in everything from the conviction of Ponzi schemer Bernie Madoff to disaster recovery to combating cyberattacks and fighting child exploitation. There’s even an apocryphal story that the firm’s technology was used to help locate Osama bin Laden.U.S. President-elect Donald Trump sits with PayPal co-founder and Facebook board member Peter Thiel, during a meeting with technology leaders at Trump Tower in New York U.S., December 14, 2016. REUTERS/Shannon StapletonPalantir says its technology was deployed in the aftermath of Hurricane Florence in 2018 alongside Team Rubicon, an organization of military veterans that respond to disaster areas. With the Palantir’s Gotham Operations module, the group identified and responded to neighborhoods in the greatest need of assistance.Palantir also pointed to the use of its technology by the Center for Public Integrity and Georgetown University’s Journalism Program for an investigation into the death of Wall Street Journal reporter Daniel Pearl by militants in Pakistan in 2007. The company says the software helped identify 27 individuals who took part in the kidnapping and killing of Pearl, mapping their relationships and providing answers to questions surrounding his death.The firm also claims its software helped the U.S. military track insurgents in Afghanistan planting improvised explosive devices (IEDs) by finding correlations between weather patterns, command wire IED attacks, and biometric information found on explosive devices.The company says it also provided its software to the Salt Lake City Police Department, helping officers reduce the amount of time it takes to perform complex investigations by 95%.Comparisons to ‘The Minority Report’But Palantir has also seen its share of controversy in addition to the wins it touts. The sheer amount of information its software is capable of tracking — license plate numbers; Social Security numbers; social media accounts; addresses; bank records; interpersonal relationships — has led to comparisons with the thought crimes police in “Minority Report.”Palantir has used that kind of predictive policing model in New Orleans, according to The Verge. But predictive policing is controversial, and, according to studies, can lead to greater policing of minority and low-income communities.And it’s not just fear of the size of its data collection. The firm has also been targeted by demonstrators and its own employees for the work it does with ICE. After denying that it worked with ICE’s deportation arm, Karp told CNBC in January of 2020 that his firm's software was being used to \"find people in our country who are undocumented.\"Previously, in July of 2019, WNYC reported that ICE agents used Palantir’s Falcon mobile app during operations including raids on nearly 100 7-11 stores in the U.S. in 2019.And in May of 2020, Karp told Axios that Palantir’s software has likely been used to kill people in the military realm, but wouldn’t provide any greater detail as to who or how.In the past, according to Bloomberg, Palantir lost a number of partnerships with high-flying corporations including Hershey’s, Coca-Cola, Home Depot, and American Express due to the tech firm’s high costs.Those company defections don’t seem to be hurting Palantir’s valuation.For all that’s still unknown about Palantir, it’s all but certain that the firm will receive plenty of attention as it tests the public markets for the first time.Correction: An earlier version of this article stated that Palantir was making its market debut on Sept. 29. In fact, it is pricing its IPO on Sept. 29 but will begin trading on Sept. 30.An earlier version of this story ran on July 8, 2020.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:How to get more iCloud storageMicrosoft’s Xbox boss: Video games undergoing the ‘same transformation’ as TV and music didThe Nikola scandal proves even GM will do anything to catch TeslaMicrosoft’s Bethesda deal is a $7.5 billion part of its plan to crush SonyFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}