{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-ism-nonmanufacturing-what-to-know-in-the-week-ahead-223925960.html", "published": 1593971240.0, "headline": "Coronavirus, ISM non-manufacturing: What to know in the week ahead", "body": "In an otherwise potentially quiet week, COVID-19’s resurgence will be front and center for investors.Cases of coronavirus are on the rise across the country. On Saturday, Florida and Texas reported record numbers of daily COVID-19 cases. The West and South have been seeing large spikes in cases over recent weeks. According to the World Health Organization’s latest situation report released Saturday, the number of new COVID-19 cases worldwide hit a new record of 212,326 cases over 24 hours.“The reopenings have led to a sharp rebound in activity, but new localised Covid-19 outbreaks have cast a renewed cloud over the global economic outlook for the second half of the year,” ING wrote in a report July 2. “Covid-19 infections and hospitalisations are on the rise in many states, leading to fears that the recovery could falter in response to renewed restrictions and consumer caution. In the absence of a vaccine, the Federal government will need to provide more support to keep the economy on the recovery track.”Bank of America Securities economists explained that the spread of the virus appeared to be having an effect on economic activity. Looking at Bank of America’s internal card data, total card spending turned lower and is now running at -3.8% year-over-year for the week ending June 27 vs. flat over the prior week in Texas, Georgia and Florida.“This is likely to the virus spreading at a faster rate in these states. Moreover, these data indicate that the risks of a W shaped recovery are mounting,” the firm wrote in a July 2 note.A couple enters the Oceans Ten restaurant on Ocean Drive on July 04, 2020 in the South Beach neighborhood of Miami Beach, Florida. (Photo by Cliff Hawkins/Getty Images)ISM non-manufacturingThe Institute for Supply Management’s (ISM) non-manufacturing index reading for the month of June will be released Monday morning. It is expected to have risen to a 50.0 from 45.4 in May, according to economists polled by Bloomberg.Though the services sector likely saw a bounce in activity during June due to reopenings, the level still remains well below pre-COVID. “If the ISM non-manufacturing index for June is also above 50, this would be yet another sign that economic activity bottomed out in April and has been on a steady upward ascent since,” Wells Fargo Securities said in a note July 2.Story continues“That said, it would not be a sign that activity is back to ‘normal’ levels, as it will likely take several months, if not years, of steady expansion to recoup the March/April decline. The key concern at this point, in our view, is that the May/June momentum could be halted in July amid a resurgence of the virus in some parts of the United States,” the firm added.Meanwhile, the earnings calendar remains light for the week. Levi Strauss, Bed Bath & Beyond and Walgreens will be among the only major companies reporting earnings.Economic calendarMonday: Markit US Services PMI, June final (46.7 prior); Markit US Composite PMI, June final (46.8 prior); ISM Non-manufacturing, June (50.0 expected, 45.4 in May)Tuesday: JOLTS Job Openings, May (5046 in April)Wednesday: MBA Mortgage Applications, week ending July 3 (-1.8% prior)Thursday: Initial Jobless Claims, week ending July 4 (1.427 prior); Continuing Claims, week ending June 27 (19.29 million prior); Bloomberg Consumer Comfort, week ending July 5 (43.3 prior); Wholesale Inventories month-on-month, May final (-1.2% expected, -1.2% prior)Friday: PPI Final Demand month-on-month, June (+0.4% expected, +0.4% in May); PPI excluding Food & Energy month-on-month, June (+0.1% expected, -0.1% in May); PPI Final Demand year-on-year, June (-0.8% in May); PPI excluding Food & Energy year-on-year, June (+0.3% in May)Earnings calendarMonday: N/ATuesday: Levi Strauss (LEVI) after market closeWednesday: Bed Bath & Beyond (BBBY) after market closeThursday: Walgreens Boots Alliance (WBA) before market openFriday: N/A—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.43 million Americans file for unemployment benefitsWhite Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance news"}]}