{"article": [{"url": "https://finance.yahoo.com/news/gundlach-on-economys-dependency-on-the-federal-reserve-171229604.html", "published": 1593865220.0, "headline": "Gundlach lashes Fed's 'incredible fiscal lending' during coronavirus collapse", "body": "Billionaire bond investor Jeffrey Gundlach believes the Federal Reserve has \"propped up the economy\" with extraordinary feats of lending and bond buying that have curbed market volatility during the COVID-19 crisis, but may come back to haunt policymakers.In a recent interview with Yahoo Finance, the CEO of $135 billion DoubleLine Capital hit out at what he called “the most incredible fiscal lending [Fed policymakers] have ever contemplated.”Since the early days of the coronavirus crisis, the central bank has spent trillions to backstop the economy — buying a host of corporate bonds — placating a whipsawed market in the process. Those efforts have sent the Fed’s balance sheet spiking well above $7 trillion.\"The Fed has decided that they want to pull out all the stops to reduce market and economic volatility,” Gundlach said. “'What they're doing is really a bridge further than they have ever gone before.”Turmoil on Wall Street was “really persistent and elevated...and they kept throwing things at it to make the volatility stop,\" the billionaire said, joking that \"when investors use the word' volatility,' what they really mean is down, prices going down a lot.\"The 60-year-old bond investing legend, who's spent 35 years in the markets and navigated multiple crises, explained that the recent rout in credit markets was “far worse” than the aftermath of the financial crisis.\"That led to what looked like was going to be some very substantial bankruptcies in some of the leveraged pools like mortgage-related REITs and other types of investments,” he explained.As the COVID-19 pandemic and subsequent lockdowns wreaked havoc on the economy, the Fed unleashed an arsenal of liquidity facilities — including backing corporate debt markets, a move Gundlach criticized as violating the central bank's charter.\"The Fed figured desperate times...require desperate measures, and the went all the way into buying corporate bonds,” Gundlach said — which he argued is against the Federal Reserve Act of 1913.Story continuesHe added they “could go even further” if there’s another downturn, which could very well happen as coronavirus infections surge nationwide.Gundlach, one of the few investors who sounded the alarm in subprime that precipitated the 2008 crisis, has spoken to Yahoo Finance previously about a crisis looming in corporate credit, where companies are holding record levels of debt on their books.The key risk is the enormous portion of investment-grade corporate market sitting at the lowest tier, which is BBB. Those bonds could easily be tipped into junk status.\"There's been so much issuance of corporate bonds. The prices have been propped up to levels where I think the owners that own them at these levels will end up losing principal on a basket of these assets,\" he said.What that means is the Fed is \"delaying the inevitable. In the meantime, they have a lot of wherewithal to continue delaying because they are spraying money all over the place and buying all these assets,” Gundlach added.The veteran bond investor explained that \"the price of corporate bonds isn't really real. There's no price discovery mechanism that's being pegged. There's no message; there's just a target price that the Fed has been doing, and that led to a pop-up in corporate bonds.\"He cautioned on the interest rate profile of investment-grade, pointing to the LQD exchange-traded-fund as an example.\"It's about the interest rate risk of the 10-year Treasury and the yield-to-no losses is about 2.25. There's not a lot of reward there, and there's a lot of risk if the bonds get downgraded because the yields on junk bonds are far higher today than the yields on BBB corporate,” he argued.“So, if they get downgraded, we know the pricing is going to suffer very significantly.\"Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’"}]}