{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-14-2020-112030348.html", "published": 1600096460.0, "headline": "Stock market news live updates: Stocks rise as vaccine, merger news draw focus", "body": "Stocks rose Monday as investors considered positive developments around a coronavirus vaccine candidate, and eyed a flurry of newly announced mergers and acquisitions among major companies. Tech shares mostly shook off last week’s jitters.[Click here to read what’s moving markets heading into Tuesday, September 15]AstraZeneca (AZN) announced over the weekend that its late-stage Covid-19 vaccine trials with the University of Oxford had resumed, after safety concerns over a suspected adverse reaction from a participant had led the company to pause trials temporarily a week earlier. Shares rose about a 0.5% in early trading.Elsewhere, Oracle (ORCL) shares rose after the company on Monday confirmed reports that it was included in a proposal for TikTok that the social media owner’s ByteDance submitted to the US Treasury Department over the weekend. This followed reports from multiple news outlets that the tech company landed a partnership with TikTok’s US business unit, edging out Microsoft (MSFT), which had previously been viewed as the frontrunner for a tie-up with the fast-growing social media company. Microsoft shares ticked lower in pre-market trading, extending losses from Friday.“Global markets are kicking off the week on an optimistic footing, with M&A activity and vaccine developments helping to lift spirits after recent declines,” Josh Mahony, senior market analyst at IG, wrote in an email Monday.The development between Oracle and TikTok “does help ease friction between the US and China, yet there will be questions over just how much data remains available to the main entity,” he added. “On the vaccine front, news that the AstraZeneca vaccine trial is to resume provides a significant boost after fears that complications with one participant could represent a significant hurdle to development. With Trump telling states to expect a vaccine before the election, there is a feeling that we are in the home straight in the push for an effective treatment.”Story continuesOther major corporations also announced massive new deals over the weekend. Chipmaker Nvidia (NVDA) announced it was purchasing SoftBank Group’s chip unit Arm Limited in a transaction valued at $40 billion – the largest ever in the semiconductor industry. Elsewhere, Gilead Sciences (GILD) agreed to purchase Immunomedics (IMMU) in an about $21 billion deal, adding the latter’s tumor-fighting drugs to the pharmaceutical giant’s portfolio. Shares of Gilead rose slipped 1% in early trading, while Immunomedics’ stock more than doubled.—4:04 p.m. ET: Stocks power higher as deal activity picks up; Tech shares push Nasdaq to a 1.9% advanceHere were the main moves in markets as of 4:04 p.m. ET:S&P 500 (^GSPC): +42.58 (+1.27%) to 3,383.55Dow (^DJI): +327.69 (+1.18%) to 27,993.33Nasdaq (^IXIC): +203.11 (+1.87%) to 11,056.65Crude (CL=F): -$0.02 (-0.05%) to $37.31 a barrelGold (GC=F): +$19.30 (+0.99%) to $1,967.20 per ounce10-year Treasury (^TNX): +0.2 bps to yield 0.6710%—1:49 p.m. ET: Stocks hold higher in intraday trading; American Express, UnitedHealth lead gains in the DowThe three major indices held higher in intraday trading Monday, with the real estate and health-care sectors leading to the upside in the S&P 500. UnitedHealth Group and American Express jumped in the Dow.Here were the main moves in markets, as of 1:49 p.m. ET:S&P 500 (^GSPC): +45.73 points (+1.37%) to 3,386.70Dow (^DJI): +328.55 points (+1.19%) to 27,994.19Nasdaq (^IXIC): +183.60 points (+1.68%) to 11,035.47Crude (CL=F): +$0.02 (-0.05%) to $37.35 a barrelGold (GC=F): +$16.20 (+0.83%) to $1,964.10 per ounce10-year Treasury (^TNX): -0.3 bps to yield 0.664%—11:39 a.m. ET: Alphabet-owned YouTube set to launch TikTok competitorAlphabet’s (GOOG, GOOGL) YouTube unit is set to launch a short-form video platform called “Shorts,” entering into direct competition with TikTok and Facebook’s (FB) newly launched “Reels” content service.The early beta version of Shorts, which will include videos 15 seconds in length or less, will be launched over the next few days in India, Alphabet said Monday.—11:17 a.m. ET: Expectations that tech stocks will remain under pressure ‘seem exaggerated’: OppenheimerConcerns that last week’s sharp drawdown in tech stocks will drag on may be overblown, according to Oppenheimer Chief Investment Strategist John Stoltzfus. Last week, the Nasdaq dropped more than 10% over three sessions, as crowding in tech stocks from earlier on during the pandemic period quickly unwound.“Current expectations that technology stocks will remain under pressure for some time seem exaggerated to us,” Stoltzfus said in a note. “While some technology stocks have gotten overvalued (the high flying names – particularly relatively new companies that soared to prices and multiples that seemed lofty) the core of technology stocks did not appear terribly rich in price considering that developments in technology and innovation have yet to show signs of plateauing in the current cycle. If anything technology has served to keep many segments of the economy not just alive but vibrant during an unprecedented shutdown of large segments of the US and world economies.”“Our expectations are for technology to lead in serving companies in the other ten sectors once the spread of Covid-19 is stemmed and the domestic and international economies move toward global expansion. We also expect technology to continue to benefit from a virtuous upgrade cycle from consumers,” he added.Stoltzfus added that the firm’s prior 2020 target price of 3,500 on the S&P 500 remains in suspension until further earnings visibility comes into relief. Oppenheimer remains overweight US equities, “while maintaining meaningful exposure to both developed and emerging markets on expectations that an economic recovery stateside coming out of the Covid-19 shutdown will help boost economic growth around the world and lead to a global economic expansion.”—10:15 a.m. ET: Oracle confirms it was included in proposal from ByteDance to US TreasuryOracle confirmed that ByteDance had included the company in a proposal for social media company TikTok over the weekend.“Oracle confirms Secretary Mnuchin's statement that it is part of the proposal submitted by ByteDance to the Treasury Department over the weekend in which Oracle will serve as the trusted technology provider,” the company said in a statement.—9:40 a.m. ET: Oracle shares halted for news pending Oracle shares were halted shortly after market open Monday morning, for pending news. The company over the weekend was reported to have won a deal for TikTok’s US operations, with the tie-up likely set to be structured as a corporate restructuring rather than full purchase.—9:32 a.m. ET: Stocks open higher, tech stocks regain footingHere were the main moves in markets, as of 9:33 a.m. ET:S&P 500 (^GSPC): +31.76 points (+0.95%) to 3,373.64Dow (^DJI): +173.55 points (+0.63%) to 27,839.19Nasdaq (^IXIC): +153.55 points (+1.41%) to 11,003.34Crude (CL=F): -$0.17 (-0.46%) to $37.16 a barrelGold (GC=F): +$17.40 (+0.89%) to $1,965.30 per ounce10-year Treasury (^TNX): -1.1 bps to yield 0.656%—7:19 a.m. ET Monday: Stock futures rise as vaccine, M&A developments draw focusHere were the main moves in markets, as of 7:19 a.m. ET:S&P 500 futures (ES=F): 3,3374.00, up 40.25 points or 1.21%Dow futures (YM=F): 27,850.00, up 238.00 points or 0.86%Nasdaq futures (NQ=F): 11,241.5, up 180.00 points, or 1.63%Crude (CL=F): -$0.11 (-0.29%) to $37.22 a barrelGold (GC=F): +$4.00 (+0.21%) to $1,951.90 per ounce10-year Treasury (^TNX): +0.7 bp to yield 0.674%A trader working on the floor of the New York Stock Exchange (NYSE) is reflected on a monitor in Manhattan in New York, U.S., October 10, 2018. REUTERS/Brendan McDermid—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}