{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-reopening-dogged-by-fears-of-new-case-spikes-as-pharma-presses-on-with-vaccine-180220247.html", "published": 1591881020.0, "headline": "Coronavirus update: US reopening dogged by fears of new wave as pharma presses on with vaccine", "body": "A sudden spike in new coronavirus cases across key U.S. states put markets back on the defensive on Thursday, worrying public health experts as more regions continue to make tentative steps toward reawakening their economies.The global case count is nearing 7.5 million as more than 477,000 have died. This week, the world’s largest economy set a new milestone of 2 million cases, with deaths climbing past 113,000.Memorial Day weekend, and growing public gatherings since then as summer approaches, have punctuated a concerning trend of rising COVID-19 hospitalizations and deaths in at least a dozen states. Texas and Florida, two of the U.S.’s most highly populated places, are among the most concerning cases — as is Arizona, which is also experiencing a jump in its daily counts.Until recently, the U.S. trend had been leveling off, but is now starting to reflect the impact of what some fear may be a second wave — even though the daily count is largely flat at 20,000 new per day. That figure is hiding spikes that are worrying experts, just as New York and New Jersey — the two hardest-hit states — begin relaxing their lockdowns.While increased testing has played a role in the rising case count, health officials are nervous about the increase in hospitalizations. While some reports classify these increases as a second wave, experts consider this part of the first wave as it was expected to hit different parts of the country at different times.The relaxation of stay-at-home orders come amid fears that the virus persistence will undermine a nascent economic rebound, upsetting investors and fanning speculation that the U.S. could enter another lockdown.Which state will be the 1st to lockdown again?8 leading candidates from their recent trendsdata via https://t.co/BuuW28dyJlhttps://t.co/K7RLF757t8 pic.twitter.com/OfzZrwdb9s— Eric Topol (@EricTopol) June 10, 2020In a briefing Wednesday, Federal Reserve Bank chair Jerome Powell said at least 15 million Americans will remain unemployed through 2020, even as jobless claims show signs of leveling off.Story continuesThere are over 7.2 million coronavirus cases worldwide. (Graphic: David Foster/Yahoo Finance)Treatments and vaccines advancingGlobally, policymakers and health experts are pinning their hopes on a vaccine, which is unlikely to materialize before next year.The frontrunner in the U.S., Moderna (MRNA), announced Thursday it is on track to start Phase 3 trials in July. Meanwhile, Dr. Paul Stoffels, Johnson & Johnson (JNJ) Chief Scientific Officer, told Yahoo Finance on Thursday that the company also has an aggressive hopes for its COVID-19 vaccine.The speed with which Moderna has advanced, and its meeting of endpoints and phases, has helped boost confidence in a vaccine being developed in potentially record time.At the very least, the treatment could get an emergency use authorization by the end of the year. Indications of a successful vaccine are expected in September, at the earliest. And Eli Lilly (LLY) is reportedly eyeing September as the earliest one of its antibody treatments, currently in testing, could be authorized for emergency use.Meanwhile, Regeneron (REGN) announced it was entering into clinical trials for a cocktail of antibody and antiviral treatments against Covid-19, Thursday.That includes four different groups of participants being tested— hospitalized patients, symptomatic individuals who are not in the hospital, uninfected individuals on the front lines as well as uninfected individuals who live with a coronavirus patient.George Yancopoulos, Regeneron’s cofounder, president and Chief Scientific Officer, said in a statement that the cocktail addresses two key issues with the virus.The cocktail “could have a major impact on public health by slowing spread of the virus and providing a needed treatment for those already sick – and could be available much sooner than a vaccine,” he said, adding that the “world needs multiple solutions” to the COVID-19 crisis.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}