{"article": [{"url": "https://urldefense.com/v3/__https://finance.yahoo.com/news/facebook-reports-q2-2020-earnings-results-coronavirus-ad-boycott-200643294.html__;!!Op6eflyXZCqGR5I!WBA_ntTka_rSVPthlhCfiuIvnv-8cIc-AHG-xVrGHTL3BYCD2CSk5tYcIA-PwQ0$", "published": 1596122060.0, "headline": "Facebook earnings: Facebook's Q2 user growth, sales top expectations as ad business remains resilient despite pandemic", "body": "Facebook (FB) reported second-quarter results that handily topped estimates, growing its user base and advertising business further even during the pandemic and as the social media giant came under increased scrutiny for its policies around policing harmful content on its platforms.Shares of Facebook rose 5% in late trading to $246.83, as of 4:09 p.m. ET following results.Here were the main metrics from the report, compared to consensus estimates compiled by Bloomberg:Revenue: $18.69 billion vs. $17.31 billion expected and $16.89 billion Y/YEarnings per share: $1.80 vs. $1.39 expected and 91 cents Y/YMonthly active users (MAUs): 2.7 billion vs. 2.63 billion expected and 2.41 billion Y/YDaily active users (DAUs): 1.79 billion vs. 1.74 billion expected and 1.59 billion Y/YIn its release Thursday, Facebook noted that it is recently “seeing signs of normalization in user growth and engagement as shelter-in-place measures have eased around the world, particularly in developed markets where Facebook's penetration is higher.”“Looking forward, as shelter-in-place restrictions continue to ease, we expect the number of Facebook DAUs and MAUs to be flat or slightly down in most regions in the third quarter of 2020 compared to the second quarter of 2020,” Facebook said.Facebook’s quarterly results come as the company faces a rising outcry from lawmakers, businesses and constituents on multiple fronts, including over concerns of antitrust and Facebook’s handling of misinformation and hate speech. The latter has taken on a fresh urgency as the next presidential election rapidly approaches.Over the past two months, a slew of major corporations have pulled advertisements off Facebook’s platforms in protest of the company’s complacency in leaving hate speech and deceptive posts unlabeled and available on its site. More than 1,000 companies and organizations including Unilever, Clorox, Coca-Cola, Conagra Brands and Ford Motor have so far participated in the boycott, which is set to run through at least July.Story continuesStill, Facebook said Thursday that in the first three weeks of July, the company’s year over year ad revenue growth rate was approximately in line with its 2020 year-over-year ad revenue growth rate of 10%.“We expect our full quarter year-over-year ad revenue growth rate for the third quarter of 2020 will be roughly similar to this July performance,” Facebook said in a statement.Facebook executives met with representatives of the Anti-Defamation League and National Association for the Advancement of Colored People (NAACP) in early July to address their concerns over Facebook’s lax policies around problematic posts, though the meeting was later described as insufficient in furthering any changes to the platform.However, the advertisers participating in the boycott represent just a a sliver of the more than 7 million advertisers Facebook has globally, with many of these comprising small businesses that rely on the platform for direct response marketing.Meanwhile, on Wednesday, Facebook CEO Mark Zuckerberg appeared before Congress alongside the CEOs of Amazon, Apple and Alphabet to address worries over Big Techs’ competitive tactics. Zuckerberg endured an especially pointed line of questioning from Rep. Jerry Nadler (D., NY), who contended that documents obtained by the US House Judiciary subcommittee on antitrust showed Facebook purchased Instagram in 2012 to take out a potential business threat, in an “anticompetitive acquisition that antitrust laws were intended to prevent,” Nadler said.On a broader scale, social media advertising platforms as a whole faced a tougher business landscape during the second quarter, with the coronavirus pandemic and business disruptions leading a host of companies to cut back on marketing spending. Earlier this month, Twitter reported a 23% drop in advertising revenue due to the pandemic, while Snap’s revenue growth decelerated to 17% in the second quarter, down sharply from the 44% growth in the first three months of the year.Facebook’s 10% advertising revenue growth during the second quarter represented a slowdown from the 17% increase during the first quarter this year.Still, many investors have viewed internet and software names as relatively more insulated from the direct impacts of the coronavirus pandemic and related shutdowns, with tech names largely outperforming the broader market. Shares of Facebook have risen about 14% for the year to date, outperforming the broader market’s 0.5% increase.This post is breaking. Check back for updates.Facebook Chairman and CEO Mark Zuckerberg testifies at a House Financial Services Committee hearing in Washington, U.S., October 23, 2019. REUTERS/Erin Scott TPX IMAGES OF THE DAY—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:Q2 GDP: US economy contracted by worst-ever 32.9% in Q2, crushed by coronavirus lockdownsJune jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}