{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-october-5-2020-112138265.html", "published": 1601910740.0, "headline": "Stock market news live updates: Stocks extend gains after Trump says he plans to leave hospital on Monday", "body": "Stocks rose Monday, recovering after Friday’s losses, as investors continued to closely monitor developments around President Donald Trump’s health.[Click here to read what’s moving markets heading into Tuesday, Oct. 6]The Dow extended its earlier advances to 465 points, or about 1.7%, as of market close. Shares of Regeneron Pharmaceuticals (REGN) gained more than 7%, with Trump having received the company’s experimental antibody drug as part of his treatment.As of Monday afternoon, the president remained at Walter Reed National Military Medical Center, after first being taken to the hospital on Friday to be treated for Covid-19. Trump said in a Twitter post that he planned to leave the hospital at 6:30 p.m. ET.White House physician Dr. Sean Conley affirmed Trump’s discharge timeline during a subsequent press conference, saying, “he’s met or exceeded all standard hospital discharge criteria,” while conceding that Trump “may not be entirely out of the woods yet” in his recovery process.A day earlier, Conley said in another press conference that Trump was being treated with the steroid dexamethasone, which is typically used for more severe cases of Covid-19. He also admitted that Trump had been given supplemental oxygen on Friday, after saying a day earlier that Trump had not been treated with oxygen. Trump briefly left the hospital on Sunday to wave to supporters from his motorcade.“We’re getting great reports from the doctors,” Trump said in a video posted to Twitter Sunday. “It’s a very interesting journey. I learned a lot about Covid.”While uncertainties remain over Trump’s recovery and skepticism lingers over the developments publicized by the White House, the blend of more positive comments around Trump’s health helped to diffuse some of markets’ anxiety from late last week.Traders also continue to closely eye updates around the election in light of Trump’s condition, and his at least temporary inability to campaign in the last few weeks leading up to Nov. 3. A new poll released Sunday by NBC News and the Wall Street Journal conducted after last week’s presidential debate, but before news emerged that Trump had tested positive for Covid-19, found that former Vice President Joe Biden was leading Trump 53% to 39% nationally among registered voters in the survey.Story continues—4:03 p.m. ET: Stocks rally, Dow gains 465 points or 1.7%Here were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +60.18 (+1.80%) to 3,408.62Dow (^DJI): +465.83 (+1.68%) to 28,148.64Nasdaq (^IXIC): +257.47 (+2.32%) to 11,332.49Crude (CL=F): +$2.30 (+6.21%) to $39.35 a barrelGold (GC=F): +$10.30 (+0.54%) to $1,917.90 per ounce10-year Treasury (^TNX): +6.6 bps to yield 0.7620%—2:48 p.m. ET: Trump says he will leave hospital at 6:30 p.m. MondayTrump wrote in a Twitter post Monday that he is “feeling really good” and plans to leave Walter Reed Medical Center later this evening.I will be leaving the great Walter Reed Medical Center today at 6:30 P.M. Feeling really good! Don’t be afraid of Covid. Don’t let it dominate your life. We have developed, under the Trump Administration, some really great drugs & knowledge. I feel better than I did 20 years ago!— Donald J. Trump (@realDonaldTrump) October 5, 2020—12:31 p.m. ET: Stocks extend gains, Dow climbs 350+ pointsThe three major indices added to gains in intraday trading Monday, with the Dow rising more than 350 points at about 12:31 p.m. in New York.The energy, health-care and information technology sectors led gains in the S&P 500. Crude oil gained alongside other risk assets, adding more than 6% and tracking toward its largest one-day gain since May. Treasury yields held sharply higher.Here were the main moves in markets, as of 12:31 p.m. ET:S&P 500 (^GSPC): +47.64 points (+1.42%) to 3,396.08Dow (^DJI): +350.48 points (+1.27%) to 28,033.29Nasdaq (^IXIC): +205.87 points (+1.86%) to 11,280.89Crude (CL=F): +$2.39 (6.45%) to $39.44 a barrelGold (GC=F): +$10.70 (+0.56%) to $1,918.30 per ounce10-year Treasury (^TNX): +6.3 bps to yield 0.757%—11:05 a.m. ET: Treasury yields climb, 10-year yield hits highest level since June on upbeat comments over Trump’s conditionUS Treasuries fell and yields climbed, as a risk-on mood swept markets following more upbeat comments around Trump’s prognosis.The 10-year yield added 6.1 basis points to 0.755%, hitting the highest level in more than three-and-a-half months. Yields across the curve also rose.—9:46 a.m. ET: US service activity hits pre-pandemic level in September: ISMThe Institute for Supply Management’s September services purchasing managers’ index jumped above pre-pandemic levels during the month, underscoring a recovery in the biggest part of the US economy. The index came in at 57.8 for the month, up from 56.9 in August and ahead of consensus expectations for a mild decline to 56.2. Readings above the neutral level of 50.0 indicate that a sector is expanding.The index had been at 57.1 before the pandemic and 53.5 in the same month last year.September’s jump was driven by a major gain in the new orders index, which increased to 61.5 from 56.8 in September. A subindex tracking employment jumped into expansionary territory for the first time since February, rising to 51.8 from 47.9.—9:30 a.m. ET: Stocks open higher, recovering Friday’s lossesHere were the main moves in markets, as of 9:30 a.m. ET:S&P 500 (^GSPC): +23.51 points (+0.7%) to 3,371.95Dow (^DJI): +209.89 points (+0.76%) to 27,892.7Nasdaq (^IXIC): +99.18 points (+0.92%) to 11,178.01Crude (CL=F): +$1.89 (+5.1%) to $38.94 a barrelGold (GC=F): +$5.60 (+0.29%) to $1,913.20 per ounce10-year Treasury (^TNX): +4.3 bps to yield 0.737%—8:20 a.m. ET: Regal Cinemas owner to temporarily suspend operations at all US, UK theaters, impacting 45,000 employeesCineworld (CINE.L), the parent-company of Regal Cinemas, announced early Monday that the company would be temporarily suspending operations across its 536 Regal theaters in the US and 127 Cineworld and Picturehouse theaters in the UK starting on Thursday.“As major US. markets, mainly New York, remained closed and without guidance on reopening timing, studios have been reluctant to release their pipeline of new films,” the company said in a statement. “In turn, without these new releases, Cineworld cannot provide customers in both the US and the UK – the company’s primary markets – with the breadth of strong commercial films necessary for them to consider coming back to theaters against the backdrop of COVID-19.”The closures are expected to impact about 45,000 employees, the company added.—7:18 a.m. ET Monday: Stock futures jump after doctors say Trump may leave hospital as soon as MondayHere were the main moves in markets, as of 7:18 a.m. ET:S&P 500 futures (ES=F): 3,366.00, up 26.75 points or 0.8%Dow futures (YM=F): 27,794.00, up 229 points or 0.83%Nasdaq futures (NQ=F): 11,359.00, up 125.75 points or 1.12%Crude (CL=F): +$1.74 (+4.70%) to $38.79 a barrelGold (GC=F): -$3.30 (-0.17%) to $1,904.30 per ounce10-year Treasury (^TNX): +2 bps to yield 0.714%Traders with masks work on the first day of in-person trading since the closure during the outbreak of the coronavirus disease (COVID-19) on the floor at the New York Stock Exchange (NYSE) in New York, U.S., May 26, 2020. REUTERS/Brendan McDermid—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}