{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-oxford-study-shows-generic-treatment-effective-as-some-states-rethink-reopening-plans-152641438.html", "published": 1592303660.0, "headline": "Coronavirus update: Oxford study boosts treatment hopes, market as some states rethink reopening plans", "body": "A study by the University of Oxford has yielded promising results for a generic steroid that may reduce the risk of death among severe hospitalized coronavirus patients on ventilators, a development that added to bullish sentiment on Wall Street Tuesday as investors increasingly price in a sharp rebound.Observers are eager for good news in a world where the COVID-19 crisis continues to rage unchecked. Fears of a second wave have now gripped China, while the U.S. is seeing evidence that suggests the first wave refuses to die — threatening state efforts to relax lockdowns even further.The generic drug, dexamethasone, is a type of corticosteroid which reduces inflammation and has been around since the late 1950s. Originally manufactured by major companies like Merck (MRK), the widely available treatment is used for cancer, lupus and arthritis patients, as well as by veterinarians for cats, dogs and cattle.Oxford’s clinical trial showed a reduction in risk of death in one-third of patients who were hospitalized and had a severe case of the virus. It added to hopes already stoked by remdesivir, the antiviral treatment from Gilead Science (GILD) that has shown moderate improvement in patients by reducing hospitalization time.Health experts, and market investors aggressively pricing in a rebound, were excited by the news Tuesday. As an existing generic, the drug is cheap and has the potential to immediately treat patients globally.The most awesomest part of the findings from Recovery Trial is this:Dexamethasone is cheap and available in nearly every corner of the world.Still a challenge to ensure right patients get it.But if findings hold, could make a real differenceBig win for global health— Ashish K. Jha (@ashishkjha) June 16, 2020But some also cautioned that long-term use of steroids can be dangerous, and that should be taken into consideration.Story continuesMany of the companies pursuing treatment candidates for Covid-19 by repurposing drugs have looked at treatments for lupus and rheumatoid arthritis, too.Most notably, the antimalarial hydroxychloroquine, also used for lupus and rheumatoid arthritis, was identified as an early potential treatment. However, the FDA revoked the emergency use authorization of the drug Monday as a coronavirus treatment after several studies showed it was not effective.Mounting concerns over ending lockdownsThere are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Abroad, ballooning case counts in Brazil have pushed the global case count past 8 million, as deaths rise above 437,000. In the U.S., cases have surpassed 2.1 million, and deaths exceed 116,000.As a result of rising diagnoses, some states are considering putting the brakes on reopening amid case spikes in the South, and in California. The most concerning states are Arizona, Florida, North Carolina and Texas. Miami is pausing its reopening as a result.As states weigh the extent to which lockdowns can be ended, the Centers for Disease Control released a report Monday that sheds more light on who is most affected by the virus. In a review of positive cases from January 22 thru May 30, the CDC concluded that individuals with underlying conditions were six times more likely to be hospitalized and 12 times more likely to die.According to the agency, “the most common [deaths] were cardiovascular disease (32%), diabetes (30%), and chronic lung disease (18%).” The report added that overall, 14% of patients were hospitalized, while only 2% were admitted to an intensive care unit (ICU), and around 5% died.The data also shows that, among cases where race and ethnicity were reported, 33% of Hispanics, 22% of African-Americans and 1.3% of Native Americans were disproportionately affected. Hispanics account for 18% of the population, African-Americans account for 13% and Native Americans account for 0.7%.“The proportion of missing race and ethnicity data limits the conclusions that can be drawn from descriptive analyses,” the CDC reported. “ Although reporting of race and ethnicity continues to improve,” more accurate data is available on external aggregate sources or state and local public health sites, the agency added.With efforts to find a vaccine front and center, the Trump administration narrowed its list of promising experimental cures to about seven on Tuesday as part of “Operation Warp Speed”, according to Health and Human Services.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}