{"article": [{"url": "https://finance.yahoo.com/news/key-difference-between-the-tech-bubble-of-2000-and-today-strategist-152719740.html", "published": 1595586920.0, "headline": "The ‘key difference’ between the tech bubble of 2000 and today: strategist", "body": "There’s a well-established bubble in the tech sector, but it’s not in the well-known FAAMNG club. Facebook (FB), Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), Netflix (NFLX) and Google (GOOG) have buoyed the market amid the coronavirus health pandemic and economic crisis.But the bubble isn’t brewing in the mega-cap names, according to Andrew Slimmon, a managing director and senior portfolio manager at Morgan Stanley.“The key difference between 2000 and today is that in 2000, the largest of the large tech stocks traded at much higher valuations than the mega cap tech stocks do today. That's not where the bubble is. There’s a group of stocks that are the ultra expensive that don't make money or are just starting to make money that trade at sky high valuations because it is predicated on the fact that in three or five years we're going to earn a lot of money,” Slimmon told Yahoo Finance in an interview this week.Many market strategists have posited that tech stocks, rather than being a growth play, are actually a defensive investment given their steady climb higher during a time of uncertainty and complete reliance on internet services like cloud-computing and e-commerce. Tesla (TSLA), one of the high-growth stocks that has as many cynics as devotees, posted a surprise fourth consecutive quarter of GAAP profitability, making the stock eligible for inclusion in the S&P 500. The stock is up 242% this year.Year-to-date, the Nasdaq (^IXIC) is up 16% compared to the S&P 500’s (^GSPC) 0.3% gain and the Dow’s (^DJI) -6.83% return. Newcomers to the public market like Zoom (ZM) have actually proven that profitability and high-growth can work hand-in-hand, with the coronavirus being a timely accelerator. Shares of the video conferencing juggernaut are up 258% in 2020.But other hot brands like Peloton (PTON), Nikola (NKLA) and Vroom (VRM) fall squarely into the category Slimmon mentions — they have garnered media and investor attention, but provide a nebulous profit picture at best.Story continuesIn this illustration is displayed on a smartphone's screen the company logo of Nikola Corporation, which specialises in hydrogen-powered truck design and manufacture, is shown on the screen of a smartphone in front of a blue backdrop of the global stock markets and worldwide indices in Frankfurt, Germany, on 12th June, 2020. It is one of the global companies that develops and manufactures fuel cell products powered by hydrogen in the current alternative energy market. (Photo Illustration by Alexander Pohl/NurPhoto via Getty Images)“And these are very good companies, I’m not saying they’re not. It's just ultimately, the discounted cash flows become problematic with higher interest rates. If you go back to 2000, there were a lot of speculative stocks out there but the internet didn’t go away. What brought down the NAsdaq was companies just got to such high valuations that these companies could not deliver on earnings that validated their existence. And so I think that's the risk - it's not in the mega cap tech, it's in some of these companies that are really losing money, and those are the big winners this year. That's where the big bubble is in the market,” said Slimmon.Looking at the overall market picture, Slimmon believes 2020 is turning out to be a much better year than expected, but 2021 will be a disappointment for equity investors as he believes the Federal Reserve will unlikely stick to such accommodative policy as macro conditions improve.“It’s the old saying — don't fight the Fed. The Fed is ultra-accommodative right now. And that's a time to be long equity. But the problem is the Fed is never ultra accommodative when things are great in the economy. There’s a problem they’re trying to assess. And the issue is investors tend to focus more on the problem than the Fed trying to solve the problem,” he said.“What ultimately brings down growth stocks is if growth accelerates and interest rates start to move higher. And as long as the Fed is actively buying bonds, I don't think that's going to occur. But ultimately, if they back off, that is, in my opinion, what will cause the bubble to burst.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:The US saw the highest rate of new women CEOs so far this yearSocial network of 9,000 Black professionals will be much more than 'just a Black talent pool': CEO'People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talentDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperityIf Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and more"}]}