{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-astra-zeneca-resumes-vaccine-trial-as-gilead-drug-gets-a-boost-from-lilly-164800230.html", "published": 1600084580.0, "headline": "Coronavirus update: AstraZeneca resumes vaccine trial as Gilead drug gets a boost from Lilly", "body": "AstraZeneca (AZN) has resumed its Phase 3 vaccine trial in the U.K., marking the end to a brief but abrupt interruption to the global frontrunner in the vaccine race.Anticipation of a coronavirus vaccine by the end of this year is running high, as the virus — which has now sickened more than 29 million and killed more than 924,000 globally— continues to surge throughout the world. The search for an effective COVID-19 vaccine is one of two major horse races — the other being the fiercely contested race for the White House — that is dominating the global economy.Recently, India became the second-highest country for case counts, while parts of Europe are seeing resurgences — with new cases topping those in America — after having curbed their outbreaks earlier this year. Even as some experts predict the first set of vaccines will offer only limited protection and may require seasonal follow-up, it remains the only hope for a return to a more normal life.Other frontrunners like Moderna (MRNA) and Pfizer (PFE) are also moving along in the final stage of trials, with Pfizer expecting to enter regulatory review next month and distribute its vaccine by the end of the year. On Monday, the race got a new competitor in the form of Vaxart (VXRT), which received regulatory approval for human trials for its vaccine candidate — and sent the stock up around 50% intraday.Separately, partners Pfizer and BioNTech (BNTX) are also looking to expand their trial from 30,000 participants to 44,000 participants, in order to include more diverse participants such as those as young as 16 and those with HIV.“The Oxford/AstraZeneca vaccine is the consensus front-runner, with most governments around the world having secured significant quantities,” Deutsche Bank wrote in an analysis on Monday. “If it were successfully rolled out, its benefits would be distributed quite symmetrically across regions. If another candidate made it first, the regional implications would be far more asymmetric.”Story continuesThe latter category includes Pfizer and Moderna, the bank said — and their treatments would also “asymmetrically benefit G10. Conversely, [emerging markets] should benefit more than G10 from a Chinese vaccine,” it added.Cases in the U.S. are down by over 10% week over week. (Graphic: David Foster/Yahoo Finance)Gilead in the newsGilead’s (GILD), meanwhile, is busy with a $21 billion acquisition of Immunomedics (IMMU) that will boost the company’s cancer portfolio, even if it is already seeing pushback.Gilead is one of the major pharmaceutical companies on the front lines of the war against COVID-19 with its drug remdesivir. Along those lines, Eli Lilly (LLY) announced a treatment in combination with remdesivir has been found to be effective on patients.The news highlights a focus that experts like Dr. Anthony Fauci suggested were a way forward, after clinical trials showed remdesivir was only moderately effective in treating coronavirus patients. The preliminary results show a one day reduction in recovery time compared to with remdesivir alone, according to a statement from Eli Lilly.Trump takes on drug pricesOne of the Trump administration’s major non-COVID-19 medical initiatives has focused on sky-high prescription drug prices.Toward that end, President Donald Trump signed a new executive order over the weekend that expands on a July executive order dubbed “favored nations,” which mandates drug companies to set U.S. prices in alignment with some of the lower costs seen overseas. In the order, the White House highlighted that Americans are stuck paying more per capita for the same drugs offered at lower prices elsewhere.“Other countries’ governments regulate drug prices by negotiating with drug manufacturers to secure bargain prices, leaving Americans to make up the difference — effectively subsidizing innovation and lower-cost drugs for the rest of the world,” according to the order.Yet controversial decision is putting pressure on pharmaceutical companies to give the U.S. government, through the Medicare drug pricing, a discounted price which it cannot achieve otherwise, because it is not allowed to negotiate with drug companies.The president has talked a lot about drug prices, and has announced several proposals, including the latest \"most favored nation\" approach, but most of these proposals have not been implemented for one reason or another. pic.twitter.com/OfU93CBqhf— Tricia Neuman (@tricia_neuman) September 14, 2020But drug companies are pushing back, and the Kaiser Family Foundation released an analysis that says most are unlikely to see savings from such an order.PhRMA, the largest drug lobbying group, lashed out at the order as untenable, and that the administration should focus on domestic reforms that correct “the misaligned incentives in the pharmaceutical supply chain.”Stephen J. Ubl, the organization’s president, said in a statement that “rather than emulating countries that allow politicians to arbitrarily decide what medicines are worth and what diseases are worth investing in, we should use existing trade enforcement tools to prevent them from freeloading off American innovation.”The largest industry trade group, BIO, hinted at fighting the order in court, with CEO Michele McMurry-Heath calling it a “reckless scheme” that will undermine research and development, and hurt seniors.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}