{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-checks-americans-are-spending-payments-in-two-big-ways-201910509.html", "published": 1593012440.0, "headline": "Coronavirus stimulus checks: Americans are spending payments in 'two big ways'", "body": "About 159 million Americans have been sent their stimulus money, according to the Treasury Department. But researchers are just beginning to dig into what people are doing with it.The early data suggests there are \"two big ways people are spending their checks,” Joanna Smith-Ramani, managing director of the Aspen Institute Financial Security Program, told Yahoo Finance’s On the Move.The first way is with immediate spending. Researchers from four business schools recently found “stimulus recipients are parting with their money remarkably quickly.” A survey in May found that about half of people who got a check had already put a majority of the money toward paying bills or buying essentials.Read more: Coronavirus stimulus checks: Why your payment would be smaller than expectedRetailers have noticed the money heading out the door. “We do see a positive impact from the checks” Walmart U.S. CEO John Furner told Yahoo Finance in May. Target CEO Brian Cornell also has seen the payments translate into spending.The patterns, if they hold up, are a change from 2001 and 2008 — the two most recent examples of stimulus checks being sent to Americans. During those rounds, researchers found that many people didn’t spend the money quickly and a large proportion of the eventual spending went to durable goods like home appliances, furniture, or new cars.This is how The Economic Impact Payment checks will look like. Photo: U.S. Secret Service‘Cash matters deeply’On the flip side, more people are saving the money than many expected. The Bipartisan Policy Center asked voters how they were spending the money and the most common answer was ‘to save or invest’ — followed closely by buying food and paying essential bills.Smith-Ramani thinks she knows why the savings rate is high.“Folks are really worried about what's coming in the future” she said, adding that “cash matters deeply” when there’s no guarantee of additional stimulus.Read more: Coronavirus stimulus checks: What it means for your taxesResearchers have found that the biggest predictor of who saved their money was liquid assets — not income. The groups of people who saw big income changes downward — suggesting a job loss — had stimulus check spending that “was only slightly elevated compared to users whose income was unchanged.”Story continuesSmith-Ramani noted that for those who were lucky enough to have a steady income, “this was a little bit of a surplus you weren't expecting.” But those people do not appear — at least so far — to be using the money to splurge.“They're worried they'll have to go through this themselves” she said of the ongoing pandemic and a recent surge in cases across the country.The 2008 economic stimulus checks are printed at the Kansas City Regional Financial Center in Kansas City, Missouri, May 8, 2008. REUTERS/Dave Kaup (UNITED STATES)Future stimulus remains uncertainUnder the bill passed in March, individuals received checks for up to $1,200 (depending on income level) or $2,400 for married couples. Parents of children under 17 received $500. The money has been going out in waves since April.In Washington, the chances of another round of stimulus checks remain cloudy. The Democratic-led House of Representatives passed a bill in May with more checks. On Monday, President Trump backed the idea of more checks but many of his Republican colleagues have expressed skepticism of additional measures.Smith-Ramani appeared as part of Yahoo Finance’s ongoing partnership with the Funding our Future campaign, a group of organizations advocating for increased retirement security for Americans. Her group recently hosted a weekly event series focused on the financial security impacts of COVID-19 with a range of leaders.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Coronavirus stimulus: Here’s what has happened so far to the $3 trillion in pandemic aidCoronavirus stimulus checks: 12 million Americans risk missing out by not filing formCoronavirus stimulus checks: What would need to happen before a second roundRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}