{"article": [{"url": "https://finance.yahoo.com/news/fed-fomc-monetary-policy-decision-september-2020-135645057.html", "published": 1600247060.0, "headline": "Fed signals interest rates to stay near-zero through 2023", "body": "The Federal Reserve on Wednesday kept rates steady at near-zero, suggesting that interest rates will likely stay there through the end of 2023.Policymakers also upgraded their outlook on the U.S. economy’s emergence from the depths of the COVID-19 pandemic, offering more optimistic projections on where unemployment and economic growth will end the year 2020.In June, the Fed forecast a 6.5% contraction in real GDP and an unemployment rate of 9.3% by the end of 2020. But an August jobs report showing a better-than-expected 8.4% unemployment rate suggesting that the economic recovery is proceeding faster than originally expected.Updated forecasts have the Fed now seeing 3.7% contraction in GDP with the unemployment rate reaching 7.6% by the end of the year.Still, the Fed on Wednesday said in its policy statement that the pandemic will “continue to weigh heavily on economic activity.”The Fed also committed to maintaining its purchases of U.S. treasuries and mortgage-backed securities “at least at the current pace” to “maintain an accommodative stance of monetary policy,” a change from previous language prioritizing the use of quantitative easing just to stabilize market functioning.Two members of the committee dissented against the decision: Dallas Fed President Robert Kaplan and Minneapolis Fed President Neel Kashkari. Kaplan preferred to “retain greater policy rate flexibility” beyond the passage of the virus, while Kashkari preferred that the committee “indicate that it expects to maintain the current target range” until core inflation has reached 2%.ProjectionsThis week’s Fed decision marks the first policy meeting since the central bank officially changed its operating framework to allow inflation rising “moderately” above its 2% target. The Fed’s tweak emphasizes its new thinking that the central bank can maintain accommodative monetary policy for longer, given its positive effect on pulling in workers into the labor force and the lack of substantial inflationary pressures.Story continuesThe revamped statement commits the Fed to keeping rates near-zero “until labor market conditions have reached levels consistent with the Committee's assessments of maximum employment and inflation has risen to 2 percent and is on track to moderately exceed 2 percent for some time.”The Fed’s new Summary of Economic Projections predicts that core personal consumption expenditures (the Fed’s preferred measure of inflation) not reaching 2.0% until the end of 2023.The projections have the unemployment rate falling to 4.0% over the same time horizon, still well above the 3.5% rate achieved before the pandemic struck.Federal ReservePut together, those forecasts suggest that the Fed may be willing to wait even beyond 2023 before raising interest rates, since its new framework discourages the “pre-emptive” rate hikes launched in 2015 as a result of fears over inflation.The dot plots show that four of the 17 members on the committee see at least one rate hike through the end of 2023, including one member who saw the case for two rate hikes by the end of 2022.Federal ReserveThe next FOMC meeting is scheduled to take place November 4 and 5.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Trump nominee Judy Shelton lacks votes for spot at the Fed, Sen. Thune saysFOMC Preview: Lack of fiscal stimulus casts shadow over FedAmericans are again growing concerned about losing their jobs: NY FedLower-for-longer rates from the Fed point to a weaker-for-longer dollarA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}