{"article": [{"url": "https://finance.yahoo.com/news/boston-fed-president-eric-rosengren-yahoo-finance-transcript-june-2020-172224406.html", "published": 1592829020.0, "headline": "Boston Fed President Eric Rosengren speaks with Yahoo Finance [Transcript]", "body": "Eric Rosengren, president of the Federal Reserve Bank of Boston, spoke with Yahoo Finance on June 22 to discuss the Fed’s unprecedented actions taken in the past few months and what lies ahead for the U.S. economy.Below is a transcript of his appearance:BRIAN CHEUNG: Thanks Julie, well we are here, virtually of course, with Boston Federal Reserve Bank President Eric Rosengren. Thanks so much for joining us this afternoon, President Rosengren.ERIC ROSENGREN: Nice to be here with you, Brian.BRIAN CHEUNG: So I wanted to start off with a conversation about what you are seeing from the Federal Reserve's perspective on the shape of the US economy recovery here. You made a speech last week, however, saying that the US has not been “particularly successful” was the language that you used, at containing the virus. I'm wondering: do you see that as threatening the likelihood of a recovery in the second half as we've heard some of your peers within the Federal Reserve say they hope for this year.ERIC ROSENGREN: So the economy and the pandemic are very closely intertwined. If we get a situation where people once again become afraid to go to restaurants, are afraid of going on mass transit. We're not going to get a full recovery. So the fact that some states are doing much better than they were, that's particularly true in the northeast, but a number of states in the south and the southwest are having much more difficulty controlling the pandemic. So some of the better economic data we've been getting has reflected the fact that those places are opening up, but they may not be opening up as safely as they need to.And if the result is that they have to impose new restrictions later in the year, that actually is going to slow down the economic recovery. And that is actually my baseline forecast, is that unfortunately we're unlikely to stop the community spread, and we'll be in a situation where the economy is growing more slowly than we might have hoped a few months ago.Story continuesBRIAN CHEUNG: And you have pointed out that your forecast is a little bit more pessimistic than perhaps your other colleagues on the Federal Open Market Committee. You said that you expect double digit unemployment by the end of this year, which is a little higher than the median dot that we saw from the June 10 economic projections of 9.3%. What are your expectations for GDP because, as I mentioned, there was a lot of optimism that we could see a rebound in the second half, the baseline expectation is for negative 6.5% GDP in 2020, do you see it as worse than that, when we wrap up the year?ERIC ROSENGREN: Yes I do expect it to be a little bit worse than the minus 6.5 over the course of the year. So we're going to get somewhat of a snapback because people are going back to work. Some businesses are able to open up. A lot of businesses are still working remotely and doing so effectively. But there are many types of businesses that can't do that. So if you're travel-related, if you're a restaurant, if you’re retail.Unless you can do things online, your business model has been badly disrupted. And so we need to be in a situation where people are comfortable doing all those things, and my concern is without the pandemic under more control that that's going to be not as successful as we had hoped in the second half of the year.[Read More: Boston Fed's Rosengren: Second half of 2020 will be 'more difficult' than anticipated]BRIAN CHEUNG: So what does all of that entail for Fed policy? The expectation is that the Fed will try to keep rates near-zero through 2022, a lot of factors can come in before that time but what would you need to see to justify raising rates?ERIC ROSENGREN: We're a long way away from raising rates. So whether you have my forecast, or the rest of the FOMC’s forecast, the median forecast, it's still a very bad outcome. So, the median still has very negative GDP and has an unemployment rate that's a little below 10%.Remember during the financial crisis we had an unemployment rate that was at a peak, 10%. So this is definitely a bad outcome, no matter how you're looking at it, and that implies that we're going to need to keep interest rates quite accommodative and that's both in the short-end and the long-end. And then I would highlight that our lending facilities and other facilities are a critical component of monetary policy right now.We're still getting a view of these facilities up and running, but they're really critically important to make sure that those lower interest rates for Treasury securities get passed on to borrowers that are households and firms.BRIAN CHEUNG: So I want to get to the facilities in a second, but I want to just quickly expand on the point that you just made about keeping rates lower for longer. There's been some talk that the Federal Reserve could provide more forward guidance in the form of some outcome-based policy, saying we'll keep rates low until we hit this target on unemployment or this target on inflation. Could you see that happening at some point in time and as a follow up to that you also see yield curve control, which is kind of another manifestation of forward guidance, if you will, as also being part of the Fed’s playbook maybe in the near future?In this Nov. 25, 2019 file photo Federal Reserve Bank of Boston President Eric Rosengren, left, speaks during a round table discussion at Silver Lane Elementary School, in East Hartford, Conn. (AP Photo/Steven Senne, file)ERIC ROSENGREN: There's a great deal of uncertainty about how the economy is likely to evolve right now. So I do think that's appropriate to get a little bit better sense as we go through the summer, about how likely it is that we're going to have second waves and whether that's going to be severe or more mild.I think that there will be a time when it is appropriate to provide more forward guidance, exactly what the nature of that forward guidance is still something under discussion so I do expect to have a more concrete forward guidance, whether it's yield curve control or using a particular targeted unemployment rate or inflation rate. I think we'll have to see how the economy evolves and they've got a consensus on the committee.BRIAN CHEUNG: So going back to the facilities, the Boston Fed in particular is tasked with setting up that Main Street lending facility which is really the cornerstone of the Feds response here and trying to provide liquidity to the market. These would be loans to those small medium sized enterprises across the country. I'm wondering, the lender registration opened up last Monday. Do you have any numbers you can share on the amount of financial institutions that have signed up to offer these types of loans and when should we expect to see loans actually going out to these businesses that really need it?ERIC ROSENGREN: So as I mentioned Friday, we have more than 200 firms that are in the process. It takes a couple of days to register, so you can't just sign up and be registered. The reason is because we're going to be transferring large sums of money back and forth over buyers. So we have to make sure that we have appropriate controls in place. We have to make sure we're dealing with an eligible lender. So that takes a little bit of time and those controls mean that it takes usually two to three days for an institution to be fully registered.So we're making great progress on the registration. Banks are already able to make loans, and then as soon as we're able to process those loans, we will be in a position to fund the 95%. So the way the facility works, is the bank makes the loan and then the Federal Reserve takes on its balance sheet 95% of the loan. Has to meet various conditions that are in the term sheet. But that process should be starting in the next couple of weeks where we're actually purchasing our share of the loans. The banks can do the lending right now.BRIAN CHEUNG: So, how is the Federal Reserve assessing the success of this facility? Is it going to be uptake? Because on one hand you could argue that the Federal Reserve's pricing for this facility should just be encouraging the banks themselves to offer competitively priced loans at a pretty good cheap point for these borrowers. So, the Federal Reserve has up to $600 billion they can use for this facility but how are you as someone that's setting this up, assessing what the success of this is actually going to be?ERIC ROSENGREN: So this is very different than the PPP program, which was basically a grant program. This is a loan program. And it's only appropriate for certain borrowers. So, if you're a really good firm that actually has been helped by the pandemic. Let's say you do personal protection equipment, so that your business has actually expanded, you'll probably get plenty of loans without any difficulty at a bank now.If you're a deeply troubled institution whose business model’s been so badly disrupted that you may not survive very long, that's also not a good thing because you're not going to be able to pay the loan back. So we're looking for borrowers that are troubled, that have had disruption as a result of the pandemic, but have a business model that will be fully effective as we get into the second half of the year and then the next year.So given that, it's not really just how many, and it's not how many losses we have. Every one of these loans is presumably a loan that without the Federal Reserve intervention, the bank wouldn't have been that willing to do. So I view every loan that we're going to be making as actually helping those businesses avoid very significant layoffs that they would get if they couldn't get the financing that the Federal Reserve's providing. So hopefully there will be a bunch of firms that are in that category. Ideally, though the economy would rebound so quickly that people don't need this facility at all. That's not what I'm expecting, and particularly if I'm right in the second half of the year is more difficult than many people are anticipating, I think having this facility up and running will be an important insurance policy for the economy.BRIAN CHEUNG: President Rosengren switching gears I want to rewind to the first week of March, there was a conference here in New York City, one last that I attended in-person - maybe you as well. At that conference, you said that the Fed may need to buy a “broader range” of securities in next crisis. A week and a half after that, the Fed slashed rates to zero in response to this COVID-19 situation. Since then the Fed’s been buying corporate debt, for example, so I'm wondering as we kind of look back on that those remarks that you made a few months ago, has that gone over as you would imagine that the time? And what might be effects of that be from financial stability standpoint, from a monetary policy operating standpoint?ERIC ROSENGREN: So in the normal course of business for the Federal Reserve, we can only buy Treasury securities and mortgage-backed securities that are government guaranteed. Other central banks actually can buy in the open market, other types of assets including corporate bonds and some countries including equities. We don't have that ability.So when we make a 13(3) designation, which is that we're in exigent circumstances, it means we’re basically in an emergency, then we're able to create these facilities. So Main Street's an example, but the New York Fed is running several different facilities, all of which basically have the same role as buying the securities outright. But we're doing it through a more convoluted structure. So, if we actually have broad authority to do this directly, we could do it much more quickly than we're doing it through these facilities. That wouldn't really help Main Street, but it would have helped some of the corporate facilities, for example that the New York Fed is running.BRIAN CHEUNG: So are you advocating that the direct purchases would be a better way for the Federal Reserve to be doing this?ERIC ROSENGREN: I mean my own personal view is that under 13(3) designation if we could broaden out the amount of categories that we buy in the open market, we would have been able to open up some of these - we would have been able to be purchasing securities much more quickly than we're able to do in this more cumbersome approach, doing a facility.I understand though that it is non-traditional to be buying these other assets. And we're a democracy where checks and balances are very important. So the price of those checks and balances as it takes longer to open up these facilities, and that means it takes a little bit longer to get economic recovery than we otherwise would.BRIAN CHEUNG: I want to broaden out on that point. You've been the head of the Boston Fed since 2007, you've seen two of these crises. How is the paradigm shift occurred at the Federal Reserve in the way that you've approached these types of frameworks because of the zero interest rate policy world. Have you seen a larger emphasis on the credit channel as opposed to the traditional mechanism of interest rate policy?ERIC ROSENGREN: Well I think interest rate policy is still very important, but unfortunately we've now had two circumstances where the interest rates got to zero. So once we get short-term interest rates to zero the traditional mechanism for doing monetary policy doesn't work. So it does work during good times but during bad times when we're in a low-interest rate environment, we're forced to use these non-traditional measures. So I think there's a much broader acceptance of buying these other assets in the middle of a crisis. And I think there's a broad recognition within the Federal Reserve and in financial markets more generally, that we're probably going to hit the zero lower bound more frequently now going forward.And so it becomes really important to think about financial stability issues, and to try to mitigate some of the facts that occurred during the last recession and during this recession. So I think financial stability is something that we need to have more attention brought after this crisis is over. One of the reasons Main Street I think is really important is because many firms became very leveraged, and in a very leveraged environment when you're having a disruption of financing for four or five months, that puts you in a much more precarious position than if you weren't as leveraged. So I think there's a lot more work to do on financial stability. But first we have to get the economy fully recovered, get people back to work, get the inflation rate closer to 2%.BRIAN CHEUNG: And lastly, President Rosengren your colleagues have been speaking a lot about the racial and wealth inequality here in the United States. I'm wondering from where you sit at the Boston Fed, how can the Federal Reserve play a role in that? As we know, you had you held a conference actually on inequality last year, and one of conclusion was that monetary policy is a blunt instrument, you can't really target specific geographies or demographics. But how can monetary policy play into some of those trends that we've seen as headlines have really pointed us to in the past few weeks?ERIC ROSENGREN: So one of the biggest shocks that could occur to an individual is a long period of unemployment. Not only is it devastating personally, but frequently to the family, up to the personal health of the individual. But it also wipes out whatever wealth that they've accumulated as they have to draw down their assets. So I think one of the things that the Federal Reserve can do and is doing right now is trying to get labor markets to recover as quickly as possible so those people become employed as quickly as possible.But I would also say that I think we're well aware that there are racial inequities in our society that have only been made worse by the pandemic. And I think there are things that we can do. We have a “Working Cities” project at the Boston Fed that's looking at post-industrial cities and how we can make them recover more quickly. There are other projects that are done by the Fed. So it's not just monetary policy, and some of the other activities the Federal Reserve does that can also help deal with some of those social inequality issues that we're facing as a society.BRIAN CHEUNG: All right, much to chew on there again. Federal Reserve Bank of Boston President Eric Rosengren thanks so much for stopping by our show today.ERIC ROSENGREN: Thank you for having me."}]}