{"article": [{"url": "https://finance.yahoo.com/news/colgate-reviewing-chinese-toothpaste-brand-131701662.html", "published": 1592468720.0, "headline": "Colgate reviewing Chinese toothpaste brand Darlie amid debate on racial inequality", "body": "By Martinne GellerLONDON (Reuters) - Colgate-Palmolive <CL.N> on Thursday said it was working to review and evolve its Chinese toothpaste brand, Darlie, the latest in a string of brand reassessments amid a U.S. debate on racial inequality.Darlie is a popular Chinese brand owned by Colgate and its joint venture partner, Hawley & Hazel. Its package features a smiling man in a top hat. It used to be called Darkie and featured a man in blackface.Its current Chinese name still translates to \"black person toothpaste.\"The move comes as Corporate America reacts to weeks of protests over racial injustice and police brutality sparked by the death in May of George Floyd, a black man, in Minneapolis after a white police officer knelt on his neck.\"For more than 35 years, we have been working together to evolve the brand, including substantial changes to the name, logo and packaging. We are currently working with our partner to review and further evolve all aspects of the brand, including the brand name,\" a Colgate spokesman told Reuters in an email.Colgate's statement to Reuters followed news on Wednesday that PepsiCo Inc <PEP.O> was dropping its Aunt Jemima logo, prompting peers to initiate reviews of other food brands featuring African American characters, including Uncle Ben's rice, Mrs. Butterworth's syrup and Cream of Wheat.Darlie controls 17% of the toothpaste market in China, 21% in Singapore, 28% in Malaysia and 45% in Taiwan, according to Euromonitor International.Colgate paid $50 million in 1985 for 50 percent of Hong Kong-based Hawley & Hazel, the maker of Darkie. It announced changes to the logo and English name in 1989 following pressure from shareholders and other groups.(Reporting by Martinne Geller; Editing by Chizu Nomiyama and Steve Orlofsky)"}]}