{"article": [{"url": "https://finance.yahoo.com/news/lawsuit-covid-19-contaminated-meat-carcasses-packaged-carried-to-consumers-225459717.html", "published": 1597255340.0, "headline": "Lawsuit: COVID-19-contaminated meat carcasses are packaged, carried to consumers", "body": "A non-profit physician’s group is asking a federal court to immediately order meat and poultry processing plants to test their products for COVID-19, and make the results of their tests public.Physicians Committee for Responsible Medicine (PCRM), a group that advocates for reducing reliance on animals for scientific research and for preventive medicine, as well as monitors federal food policy, asked for the mandate in a lawsuit filed Wednesday against the U.S. Department of Agriculture (USDA).The filing comes as Chinese authorities report that routine sample inspections of imported chicken wings from Brazil showed contamination with COVID-19, as did packaging on shrimp from Ecuador.In its complaint, PCRM said the USDA wrongly rejected a petition that it filed in May asking to implement new meat and poultry testing requirements for COVID-19, as well as labeling to warn consumers that meat could carry the virus. The organization also claims the agency failed to respond to its requests for information under the Freedom of Information Act (FOIA).Seven butchers stand behind the counter at a family-run butcher's shop, Frampton's Butchers, Bridport, Dorset.“The agency didn't test a thing and it doesn't doesn't seem to care,” Mark Kennedy, attorney for PCRM, told Yahoo Finance. This is the agency that's in charge of protecting this part of the food chain and they just said no.”According to PCRM, USDA rejected its petition on the basis that it failed to reference studies or show supporting information backing up its claim that coronavirus can be transmitted by meat and poultry products, or other food.However, the physician’s group alleges that meat and poultry processing plants have already proven central points of viral spread in humans, including in South Dakota where more than half of the state’s coronavirus cases have allegedly occurred in workers at Chinese-owned Smithfield’s processing plant in Sioux Falls. As well as at a Perdue Farms processing plant in Maryland, where it said 5% of 663 workers tested positive for COVID-19.“In just over half a year, at least 40,517 meatpacking workers have tested positive for COVID-19, and at least 189 have died of COVID-19,” the complaint states.Story continues“We have no numbers for what’s landing on the meat because we're not testing at all,” Kennedy said. “It wouldn’t be too hard to just check.”Processing plants are vulnerable to disease spread, the physicians say, because processing volume is high and droplets from talking, sneezing and coughing can remain airborne where plant workers and inspectors come into close proximity each day with thousands of animal carcasses.“Meat processing plants typically slaughter more than 300 cattle per hour and more than 1,000 pigs every hour,” the lawsuit states. “Poultry processing plants collectively slaughter more than 20 million birds every day, typically on high-speed automated production lines that process as many as 175 birds per minute.”A threat to the public is introduced, according to PCRM, when the cut-up carcasses are packaged and the contamination is carried to consumers. The organization said the risk is compounded by consumers who rightfully follow guidelines to keep meat stored below 40 degrees fahrenheit, and by doing so unintentionally preserve the virus. Freezing contaminated meat, the group added, can preserve the virus indefinitely.Kennedy recognized that other food processing industries also pose potential risks, however the spread of the disease is significantly higher in the meat industry.“The numbers in meat and poultry processing plants are five, six times higher, and it is probably a factor of all these things things — close proximity, physical exertion, cold conditions,” he said. “There are other viruses known to travel from workers to the food and that’s a real thing.”PCRM said it requested in its rejected petition that the USDA require all processing plants and companies shipping meat and poultry into the U.S. to test their products for COVID-19 and immediately make their findings public. It also asked that absent testing, a packaging label be required stating the following:“Warning: Workers in U.S. meat and poultry processing facilities have been sickened or killed by the SARS-CoV-2 virus, and this product has not been certified virus-free.”In its request for an injunction, among other relief, the plaintiffs are asking the court to immediately require USDA to begin testing and publication of test results, and to amend the Code of Federal Regulations so that all meat and poultry products under USDA regulation carry a safe handling label.Without testing a single product, USDA baselessly concluded that product testing “would serve no public health purpose,” PCRM alleged.On its website, PCRM says it is “dedicated to saving and improving human and animal lives through plant-based diets and ethical and effective scientific research.”USDA did not responded to Yahoo Finance’s request for comment.This story has been edited to include a statement from Chinese officials reporting that COVID-19 had been found on samples of imported meat and packaging of imported seafood.Alexis Keenan is a legal reporter for Yahoo Finance. Follow on Twitter @alexiskweed.Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}