{"article": [{"url": "https://finance.yahoo.com/news/the-trump-payroll-tax-break-you-wont-see-on-your-paycheck-193545027.html", "published": 1598971400.0, "headline": "The Trump payroll tax break you won’t see on your paycheck", "body": "The IRS issued new guidance recently to help employers implement President Trump’s Aug. 8 executive order to temporarily defer employee payroll taxes. The guidelines would give workers until April 30, 2021 to pay the payroll tax deferment amount in full before penalties and interest accrue.But many employers won’t be implementing the tax break.“The Treasury guidance issued last week is being read by practitioners to indicate that the payroll [executive order] is optional,” U.S. Chamber of Commerce Vice President Caroline Harris told Yahoo Finance in a statement.The biggest concern for employers remains the legal hornet’s nest they could face in abiding by the executive order. They fear being held liable if an employee were to leave their company or not be able to afford a big tax bill on April 30, 2021, after having spent the extra money from their paychecks normally reserved for the payroll tax in 2020.President Donald Trump holds up one of the four executive orders that he signed that addresses the economic fallout from the COVID-19 pandemic at his Trump National Golf Club in Bedminster, N.J., Aug. 8, 2020. (AP Photo/Susan Walsh)Trump’s executive order takes effect Sept. 1 and lasts through Dec. 31. Companies participating in the plan would stop withholding some Social Security taxes for the rest of the year, then withhold twice as much as usual early next year to pay the delayed taxes. The order is intended to provide a temporary tax break specifically for workers – equating to a 6.2% bump in pay for those earning less than $4,000 bi-weekly through the end of the year.The Aug. 8 executive order is not the first time President Trump has pushed for a payroll tax deferment for workers. He advocated for it publicly as early as March 13 in a tweet and tried but failed to get it included in previous fiscal stimulus legislation.If you want to get money into the hands of people quickly & efficiently, let them have the full money that they earned, APPROVE A PAYROLL TAX CUT until the end of the year, December 31. Then you are doing something that is really meaningful. Only that will make a big difference!— Donald J. Trump (@realDonaldTrump) March 13, 2020Trying to give workers a boostStory continuesEven though the U.S. economy has started to re-open, the unemployment rate is still in double-digit territory. Making matters worse, several big companies announced last week they would be cutting thousands more from their payrolls.Deadlocked negotiations in Washington between the White House and top Democrats mean that economic relief in the form of more stimulus checks or $600 in additional unemployment benefits seems less likely.While the U.S. Chamber of Commerce has acknowledged the necessity of “much-needed tax relief for families” amid the coronavirus pandemic, many employers are reluctant to adjust their accounting and payroll systems. It would be “unworkable to implement a system where employees make this decision,” the Chamber said. According to IRS guidance, employers would be liable for the payroll taxes due on April 30 if workers can’t or don’t pay them back.The Chamber said “if this were a suspension of the payroll tax so that employees were not forced to pay it back later, implementation would be less challenging.”Trump has promised that if he gets reelected, he would push for a permanent payroll tax cut. Employers are being cautious.“Every employer I’ve talked to has said we are not going to do this. It is not good for administrative complexity, and worse, it's an employee relations disaster,” Bill Arnone, the CEO of the National Academy of Social Insurance, told Yahoo Finance.While resisting Trump’s tax relief efforts for workers, companies are instead encouraging Congress to provide more economic relief through legislation.“Given the numerous implementation challenges, remaining outstanding questions, and the extremely short implementation period, employers are likely to continue withholding and remitting payroll taxes to the Treasury,” Harris said.More from Sibile:‘Ghosting’ is not just for lovers. These job applicants say ‘cruel’ and ‘selfish’ employers do it too.Trump’s $300 per week unemployment boost ‘too little, too late’ to help August spending: GoldmanEconomist: Pay people $1K to take a coronavirus vaccine instead of forcing themDemocratic Rep. blasts Trump on USPS woes: ‘No hope’ of waking up knowing who won the electionTrump payroll tax deferment is ‘employee relations disaster’Find live stock market quotes and the latest business and finance news"}]}