{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-business-closures-reach-60-192051530.html", "published": 1600784900.0, "headline": "Coronavirus Business Closures Reach 60%, According to New Yelp Data", "body": "Closed restaurant business signYelp has released its latest Economic Impact Report detailing increasing business closures across America due to the COVID-19 pandemic — and the news isn’t good, especially for restaurants, bars, nightlife venues, retail stores and beauty businesses.Many small businesses are clearly in need of help: The number of businesses listed on Yelp as closed reached 163,735 as of Aug. 31 — equaling a 23% increase since the middle of July. Of closed businesses, 97,966 — or 60% — have indicated a permanent closure. In the same time period, 32,109 restaurants closed, with 61% of those forced to close permanently. Bars and nightlife venues have reported 6,451 venues as closed, facing 54% permanent closures. Shopping hasn’t been the same since the pandemic started, either: Retail saw heavy closures, with 30,374 businesses closed and 58% shuttered permanently. Beauty business closures numbered 16,585, with 42% closed for good.Home and professional services businesses, such as landscapers, contractors, lawyers and auto and towing services, are reporting a much lower closure rate. “Consumers still need these services,” Justin Norman, vice president of data science at Yelp, told CNBC. “Through the rise of virtual consultations and contactless or socially distanced services, these businesses have been particularly resilient during this time.” The question, then, is whether social venues will become essential for workers and customers after the pandemic ends.More from GOBankingRates44 Ways To Trim Your Living Expenses During the Coronavirus Quarantine94 Money-Making Skills You Can Learn in Less Than a Year24 Ways To Maximize Your Paycheck This YearHow Long $1 Million in Savings Will Last in Every StateThis article originally appeared on GOBankingRates.com: Coronavirus Business Closures Reach 60%, According to New Yelp Data"}]}