{"article": [{"url": "https://finance.yahoo.com/news/young-investors-have-a-huge-stomach-for-risk-right-now-data-suggests-194739891.html", "published": 1597848920.0, "headline": "Young investors have a huge stomach for risk right now, data suggests", "body": "Millennial and Gen Z investors are willing to stomach far more risk than they have in the past, according to fresh data from E*Trade. The company's quarterly investors survey found that over half of these younger investors indicated that their risk tolerance has increased since coronavirus, far higher than other groups.Read more: Here's what to consider before getting into day tradingRetail investors — regular people with portfolios, rather than pros — have streamed into the market since the S&P 500 index plunged 30% in late March off its February peak. And as the S&P 500 (^GSPC) climbed back to a new all-time high this week, powered largely by tech stocks, these aggressive investors have made a lot of money as big winners of the rally.E*Trade’s survey, which polled 873 investors, found that 51% of young investors have increased risk tolerance — 23 percentage points higher than the total population. Furthermore, this cohort is getting out of cash, trading more, and full of optimism where the market is concerned. Around 34% of investors under age 34 have moved out of cash and into the market, which is 15 percentage points higher than the total population.They're also trading more frequently, with 51% of investors under 34 trading equities more since the pandemic began, and 46% saying they're trading derivatives more frequently. Based on the survey, only 30% of the total client base is trading more, and even fewer (22%) are trading more derivatives, making the outsized gains particular to young people.(Getty)And while E*Trade said that just 9% of young investors surveyed said their portfolios had fully recovered, half expected a full recovery in six months, compared to just a third of the total. However, it’s important to note the date of the survey: between July 1 and July 9. Since then, the S&P 500 has flown back up to a record high, surpassing the pre-Covid peak in late February.Staying in the market has been rewardedStory continuesFor young investors, this may seem like a reward for staying in or getting into the market and taking on risk as so much economic data has been weak.This has been the best 100 days for the stock market of all time, and one of the shortest bear markets, having recovered astoundingly quickly, even though no vaccine has vanquished the risks and fears of the coronavirus.Many people have pointed out that younger investors may have come of age during the financial crisis and Great Recession in 2008, events that shaped their thinking (and that would explain trends like favoring debit cards and avoiding debt). At the same time, they’ve also lived through an incredibly long bull market that had been in place most, if not all, of their careers — potentially long enough to forget that stocks can go down, too.(Getty Images)It’s important to put E*Trade’s numbers showing appetites for risk into context in two ways. First, financial advisers and target-date fund managers say younger people should have fairly high exposure to stocks in long-term portfolios. (Though of course some investors don’t hold the S&P 500 index, and might not be seeing the same gains in their portfolios.)But more importantly, this data also came in the first week of July when the market was far lower — this is not optimism from the current climate of an all-time high.That means that the millennials and Gen Z investors (5 to 24 years old) who have been involved in this market have had their moves vindicated and reinforced. Whether it was the right move based on the data is up for debate. If they were long-term investing moves, sure, but the frequency suggests it was more than that, something that might worry market watchers, though perhaps less than trading Hertz stock.E*Trade appears to be thinking about that.“When it comes to Millennials and Gen Z investors, time is on their side, but that doesn’t mean they can be complacent or act emotionally,” Chris Larkin, Managing Director of Trading and Investment Product at E*TRADE Financial wrote in a note about the survey. “Access to the market has never been easier, so investors just embarking on trading should walk before they run. A thoughtful and disciplined approach is key—do your research, set up watch lists, and align your trading strategy with your goals and risk tolerance.”Larkin offered a list of tips: don’t get caught up in fads or impulse buying, use analysis, learn how to use options in ways other than speculation — like protecting trades, lowering risk, and producing income — and test trading strategies with a paper portfolio before using real money.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.The stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteranMost companies plan to give raises and bonuses in 2021: surveyThe key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right nowRetail investors have seen huge gains as S&P 500 nears pre-pandemic highThere are two types of stocks on RobinhoodWhy you should consider deleting your stock trading app"}]}