{"article": [{"url": "https://finance.yahoo.com/news/stock-split-behavior-underscores-the-markets-weirdness-confusing-billionaire-and-analysts-200729624.html", "published": 1598886920.0, "headline": "Stock split behavior confuses billionaire and analysts", "body": "Go to a bank and ask a teller to break a $5 bill into five $1 bills. The bank provides this service for free – you still have $5, but in the market’s view, this actually makes you richer.This week Apple (AAPL) and Tesla (TSLA) saw their stocks split, so people who owned one share now find themselves holding four in the case of Apple, and five in the case of Tesla. The collective value of these shares, seasoned financial professionals and textbooks point out, has not changed.Or has it?On Monday, the day of the split, Apple’s stock was up almost 3.4% and Tesla’s up almost 12.5%. In other words, they are now more valuable than they were before the stock split. It’s hard to say how much of the gains are attributable to the split, but a commonly-held theory is that the cheaper price attracts a wider swath of people who otherwise might not buy a single share for over $2,000.Billionaire hedge fund manager Leon Cooperman expressed his frustration at the market’s reaction to these splits.“Look at Tesla and Apple: Everybody understands that [stock] splits don’t create value,” Cooperman, who founded Omega Advisors, said on CNBC Monday. “My dad once told me if you gave me five singles for a $5 bill, I’m no better off.”Cooperman recognized the power of the “Robinhood crowd” and its impact on the prices of certain stocks, and new data from Bloomberg Intelligence's Larry Tabb shows that individual investors' stock trading volume has never been higher, accounting for 19.5% of the market's trades over the past six months. (At times during this period, Tabb’s data found, this number has surged to around 25%.)Tesla logo is seen at the Tesla experience store on August 11, 2020 in Shanghai, China. (Photo by Wang Gang/VCG via Getty Images)Cooperman and the financial analysts who focus on fundamentals don’t see any real changes or value created. The business is the same as it was on Friday. Bob O’Donnell, TECHnalysis president and chief analyst, told Yahoo Finance that the outlook has similarly not changed due to the stock split.Ryan Detrck, LPL Financial’s chief market strategist, also brushed off the idea that splits add value, noting that Warren Buffett does not do this with Berkshire and that it doesn’t really have a benefit.Story continuesAs an aside, O’Donnell added that splits “just give people an excuse to consider making an investment” — and maybe the only error the financial industry is making is the “just.” What if it’s enough?Across the board as many new retail investors get deeper into investing, it may continue to be a formidable force in the market. Recently, the social network TikTok has been a hot place for stock and investing content, and by no means has it followed any sort of orthodoxy, with significant amounts of content talking about stock splits giving people “free stocks” and lessons on how to time the stock split for maximum gains. (Barstool’s Dave Portnoy echoed this sentiment last week: “Why do I like when stocks split? Because you get double the stocks.”)In the market, actual value (fundamentals) and market value (people have decided that the stock is valuable, no matter why) are not necessarily two distinct things — there is only one stock price after all. Perhaps the question ought to be: What happens to a company whose stock price is so linked to retail investor sentiment?--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Mutual funds have a FAAMG problemNYU professor: Make sure young investors 'don't become addicted' to online stock tradingHow a stock gets added to the Dow Jones Industrial Average'A really tough spot' for employees: How companies are enforcing mask complianceCoronavirus has hurt the credit card businessYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}