{"article": [{"url": "https://finance.yahoo.com/news/apple-app-store-antitrust-facebook-202125609.html", "published": 1596814160.0, "headline": "Facebook and Microsoft, smelling blood in the water, clash with Apple amid antitrust probes", "body": "Apple (AAPL) is facing off against its fellow tech giants Facebook (FB) and Microsoft (MSFT) about the iPhone maker’s App Store policies in a showdown that comes just as a week after Apple CEO Tim Cook and Facebook CEO Mark Zuckerberg, among other CEOs, appeared before a House Judiciary hearing about Big Tech’s market power.The dustup has to do with Apple’s responses to Facebook’s new Facebook Gaming app and Microsoft’s xCloud cloud gaming app. Both companies submitted their apps for review and had them rejected by Apple for violating the App Store’s terms of service.Apple CEO Tim Cook testifies remotely via videoconference during a U.S. House Judiciary Subcommittee on Antitrust, Commercial and Administrative Law hearing on \"Online Platforms and Market Power\" in this screengrab made from video as the committee meets on Capitol Hill, in Washington, U.S., July 29, 2020. U.S. House Judiciary Committee via REUTERSNow Facebook and Microsoft, smelling blood in the water, are hitting back, calling out Apple with statements that echo the kinds of complaints antitrust investigators have heard from other developers who say Apple is hurting competition and consumers. And that could be a problem for Apple in the long run.“The audience for [last week’s hearings] was not just a domestic audience, it was an international audience, it included competitors, third parties, and competition authorities,” explained former Federal Trade Commission Chairman William Kovacic.“So [Apple knows] that every time they twitch now, they will have close scrutiny from many different eyes including quite a few astute observers,” added Kovacic, who now serves as a law professor at George Washington University, where he specializes in global competition.Shots across the bowsApple’s current antitrust problems stem directly from its App Store policies and how it enforces them. App developers, Spotify (SPOT) being one of the most prominent, have complained to investigators and regulators about Apple’s app review guidelines, saying they aren’t applied evenly.Developers have also taken issue with the 30% commission Apple collects on app sales through the App store, saying it’s unfair because Apple sells competing apps, like its Apple Music service, and doesn’t have to pay a commission to itself. Apple also operates its own gaming service called Apple Arcade, which is available as a subscription and lets users play games across their iPhones, iPads, and Mac computers.Story continuesInvestigators are looking at whether Apple’s tight control over the App Store, which is the only means developers have to get their apps on the company’s iOS devices, stifles innovation and unfairly targets competing apps.Cook denied such accusations during a recent hearing before the House Judiciary Committee’s Subcommittee on Antitrust, Commercial, and Administrative Law, pointing to the fact that the App Store has helped generate 1.9 million jobs and is host to 1.7 million apps, of which Apple only competes with a few dozen.Facebook and Microsoft are well aware of the accusations Apple is facing, and appeared to purposely use language supporting the argument that Apple is operating an illegal monopoly in their surprisingly public responses to Apple’s decision.Facebook CEO Mark Zuckerberg testifies remotely during a House Judiciary subcommittee hearing on antitrust on Capitol Hill on Wednesday, July 29, 2020, in Washington. (Mandel Ngan/Pool via AP)“Even on the main Facebook app and Messenger, we’ve been forced to bury Instant Games for years on iOS,” Vice president of Facebook Gaming Vivek Sharma said in a statement following Apple’s decision to reject the portion of the Facebook Gaming app that allowed gamers to play Instant Games.“This is shared pain across the games industry, which ultimately hurts players and devs and severely hamstrings innovation on mobile for other types of formats, like cloud gaming. And while it’s disheartening to deliver only part of the Facebook Gaming app experience on iOS, our gaming creators have asked for it for awhile. We thank them for waiting this long.”None other than Facebook COO Sheryl Sandberg even hit out at Apple saying in a statement, “Unfortunately, we had to remove gameplay functionality entirely in order to get Apple’s approval on the standalone Facebook Gaming app – meaning iOS users have an inferior experience to those using Android.”Microsoft, meanwhile, issued a statement through a spokesperson specifically saying that Apple treats gaming apps differently than other apps.Microsoft CEO Satya Nadella. (AP Photo/Elaine Thompson, File)“Apple stands alone as the only general purpose platform to deny consumers from cloud gaming and game subscription services like Xbox Game Pass,” a spokesperson said. “And it consistently treats gaming apps differently, applying more lenient rules to non-gaming apps even when they include interactive content.”Those statements were each crafted specifically to hit Apple where it hurts when it comes to the antitrust investigations into the App Store.Apple, for its part, points specifically to two sections of the App Store policy that the Facebook and Microsoft apps violate. Microsoft, the company says, violates Apple’s policies regarding remote desktop clients, while Facebook violates terms for HTML 5 games and bots.Apple’s will need to respondWith Facebook and Microsoft clearly appealing to arguments that Apple is using its market power against competitors, the Cupertino-based company will need to prove its moves are intended to benefit consumers, Kovacic explained.“To me the crucial question would be how well developed is the justification that [Apple is] going to present for the current policy. How convincing is that story going to be, not just to insiders who watch the sector carefully, but to this larger audience that’s now watching every single move, as well as law enforcement authorities around the world that are now watching this.”According to Kovacic, Apple will have to show that its current policies provide a significant benefit to its users. The company may also be able to rely on the fact that the relationship between leading enterprises is changing, and that they are each now competing against each other in similar industries.Apple is all but certain to face additional challenges from competitors as the antitrust investigations into its App Store continue, and it’ll need the right answers if it’s to escape unscathed.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Uber posts $1.8 billion loss in Q2, but deliveries skyrocket during coronavirusSamsung debuts Galaxy Note 20 and Note 20 Ultra smartphonesActivision Blizzard earnings blow away expectations as gamers player through pandemicMicrosoft’s Xbox Game Pass Ultimate gets Project xCloud cloud gaming on Sept. 15 for $14.99 per monthFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}