{"article": [{"url": "https://finance.yahoo.com/news/us-sadly-not-taking-coronavirus-seriously-124457277.html", "published": 1596009140.0, "headline": "Bill Gates: U.S. 'sadly' not taking coronavirus ‘seriously’", "body": "Billionaire philanthropist Bill Gates warned on Tuesday that U.S. failure to take the coronavirus pandemic “seriously” could have even more dire consequences when the fall brings conditions conducive to further spread of the virus.“The U.S., sadly, is not taking this seriously,” says Gates. “The U.S. opened up while infection rates were still going up.”Gates, the co-founder of Microsoft and a top backer of global public health initiatives, said the inadequate response has coincided with warm summer months that naturally reduce the spread of the virus but that a lax approach could prove devastating later in the year.“The summer is helpful,” says Gates, who along with his wife Melinda has donated more than $350 million to the fight against the coronavirus through the Bill & Melinda Gates Foundation. “High temperature reduces force of infection, people spend more time outdoors.”The fall could prove challenging, he noted, unless new coronavirus treatments and the wide adoption of personal precautions mitigate the increased risks.“The fall — if we didn't have these new innovations coming in, or more people adhering to the face mask regulation,” he adds. “Fall could be very tough.”On Tuesday, President Donald Trump falsely stated that much of the U.S. is “corona-free” and defended promoting a version of a viral video that made false claims about the pandemic.Some governors have pulled back reopening plans in recent weeks amid a surge of cases in the South and West. But others, like Tennessee Gov. Bill Lee, have kept bars and indoor dining open despite warnings from the federal government that they increase the likelihood of spread.As of July 29, coronavirus cases were increasing in 29 states, according to the New York Times. The U.S. leads the world in coronavirus cases and deaths, with 4.3 million cases and 149,000 deaths, Johns Hopkins University reported.“This has been a huge tragedy,” Gates says. “We need to stop this thing.”Story continuesGates, who serves as co-chair of the Bill and Melinda Gates Foundation, made the remarks to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Until 2000, Gates led personal computing giant Microsoft. That year, he and his wife Melinda co-founded their foundation, which now employs nearly 1,500 people and boasts an endowment of $46.8 billion.Areas spared by the pandemic in its early months will be more vulnerable in the autumn, Gates said.“Part of the irony is that it's the communities that haven't had it badly who are going to be most at risk in the fall,” he says. “We saw in the spring, a lot of cities were saying, ‘well, we're not New York.’”Read more:Bill Gates: Spread of 'outrageous' coronavirus video shows flaw in social media platforms'Travel has changed forever': Airbnb CEO Brian CheskyJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinBusiness leaders fear 'flaming on social media' if they criticize Trump: Fast Company Editor-in-ChiefMichael Dell: ‘Not enough’ progress on diversity in the tech industry‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}