{"article": [{"url": "https://finance.yahoo.com/news/apple-price-target-raised-bofa-170530922.html", "published": 1594815200.0, "headline": "BofA raises Apple price target to $410, calls it the 'stickiest' smartphone brand", "body": "Apple (AAPL) shares, which hit all time intraday highs earlier this week, could reach $410, say BofA analysts.“Apple shares continue to trend higher which we attribute to a combination of fundamentals and investors positioning,” wrote Wamsi Mohan in a note to clients.The new price objective — which implies roughly a 6% gain from its current trading levels — was increased from $390.Mohan says investors are viewing Apple as “a liquid investment to weather an uncertain environment.”Apple is also perceived as a “tech story stock with the catalyst to 5G,” and “a large cap tech name relatively less exposed to the regulatory risks,” the analyst wrote.In this Feb. 26, 2020, photo, a woman uses her phone near the Apple store in Beijing. In a lively Muslim quarter of Nanchang city in eastern China, a sprawling Chinese factory turns out computer screens, cameras and fingerprint scanners for a supplier to international tech giants such as Apple and Lenovo. (AP Photo/Ng Han Guan)The iPhone maker just won a $14.9 billion tax appeal in the EU, a huge triumph against the European Commission.On the fundamentals side, the analyst sees improving trends, namely a decline in iPhone channel inventory and continued growth when it comes to App store revenue.“Third-party data on App store developer revenues indicates that App store revenue growth remained strong in F3Q at about 30% y/y in F3Q20, and about 23% y/y for F20 year-to-date,” Mohan said.‘Stickiest’ smartphone brandA BofA survey also shows users have strong brand loyalty for the iPhone maker.“Our ongoing global survey of smartphone users in the US, UK, China and India suggest that iPhone remains the ‘stickiest’ smart phone brand,” Mohan wrote. “Old models primarily iPhone 8, 7, and 6S are still widely in use and should continue to support future upgrades cycles.”BofA reaffirmed its Buy rating on the stock. Apple shares mid-session on Wednesday were relatively flat as big cap tech names declined.Yahoo Finance’s The Market Wake-UpInes covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070Nasdaq is 'moving faster than any train we've ever seen before': veteran strategist'There's a risk of a lost decade here:' former IMF adviserFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}