{"article": [{"url": "https://finance.yahoo.com/news/fractional-shares-trading-demand-as-stock-market-rally-180837763.html", "published": 1591967780.0, "headline": "Want a 'slice' of a stock? Demand booms for fractional shares as markets soar", "body": "If you wanted to throw $200 into Amazon stock (AMZN) a few years ago because you saw a UPS guy with nothing but brown boxes with blue tape, you’d have been annoyed.The stock— which cost $1,700 per share two years ago and is now over $2,600 — had a sticker price similar to a carbon-fiber bicycle, or a month or two (or three) of rent, depending on where you live.But last year, popular stock-trading apps Robinhood and SoFi started giving investors the chance to buy less than a single share of stock, something called “fractional” or “partial” shares. Though these products can have a few limitations, they allowed anybody to buy a stock based on a dollar amount. (Well, not anybody; Robinhood has a waitlist with over 1 million people.)This spring, fractional shares have been extremely popular as new investors have jumped to own shares — or shares of shares — of companies they couldn’t before. Big players like Fidelity and Schwab (SCHW) have joined, bringing the phenomenon to the investing mainstream.Fractional shares are allowing people to buy shares of stocks and ETFs in smaller quantities, democratizing the market. (Getty Creative)The boom in fractional shares has coincided with a stock market boom, as the S&P 500 bounced up by around 40% from its low in late March.It led many to wonder whether a new class of investor is a factor in the gains, enabled by stimulus money, no sports or betting, and perhaps the ability to buy small chunks of big stocks. (Barclays research analysts, for what it’s worth, says no, though this is hotly debated.)Huge demand for tiny pieces of big stocksFractional shares have existed for many years, usually as a part of dividend reinvestment plans. A dividend for a stock position might not kick off enough to buy a whole new share, so a person reinvesting was allowed to end up owning a number of shares with a decimal point.But in the past few years, people thought: What about just buying stocks that way? M1 Finance was one of the first companies to offer fractional shares in 2017. SoFi added the feature a year ago, and Square’s CashApp and Robinhood followed — giving the trend enough gas to convince Fidelity to launch in January.Story continuesSince the coronavirus crisis, fractional shares have taken off to a startling degree, and just last month Schwab joined in on the fractional share bandwagon. Everybody seems to be “democratizing” investing by letting people buy small, and a lot of people are doing just that.Robinhood has a waitlist. It's long. (Yahoo Finance screenshot)According to SoFi, a broker that offers both free trades and fractional shares, 40% of all trades are fractional versus whole shares and 52% of customers' first trades are fractional.M1 Finance CEO Brian Barnes told Yahoo Finance that roughly half of its 200,000 trades per day on its platform come in sizes of less than one share.For CashApp, fractional investing saw the fastest adoption of any product on the platform, with the average customer buying around $20 worth of stock per purchase. And in April, when stimulus checks hit many accounts, CashApp's stock brokerage volumes saw their highest monthly totals ever.Which stocks are hot? You can probably guess them.Not surprisingly, big-name stocks are seeing particular fractional activity on these platforms. A Robinhood spokesperson told Yahoo Finance that Amazon, Tesla, and Apple are popular for people trading fractionally.SoFi offered an even closer look: Fractional trades for Amazon are 16 times more popular than whole-share trades. Other stocks that are similarly more popular as fractional shares: Chipotle and Google are eight times more popular, Autozone seven times, Costco six times, and Netflix, Tesla, and Apple four times. So far, the company said, stocks that offer fractional trading see 58% of their trading activity in these bite-sized amounts.Schwab, which has been open to fractional investors for about a month, shared some data with Yahoo Finance that exposed a similar trend of hot tech stocks amongst the fractional set: Amazon, Apple, Google (A and C shares combined), Microsoft, and Netflix.Schwab added that the average order amount is a little over $400, with 40% of its fractional product, called “Slices,” being placed on mobile versus web. The company couldn’t yet share hard demographic data, but anecdotally, the people using fractional shares are new investors with a lot of questions both about trading and markets in general.Ownership without representation and stock splitsSome companies like Robinhood offer voting rights to fractional shareholders, noting that the tallies will be aggregated and shared if a person remembers to vote in proxy matters.But this isn’t the case of all owners. Fidelity’s customer service agreement outlines that fractional shares do not offer voting rights, and are also unable to be transferred or certified.A stock’s ideal price is supposed to be relatively bite-sized so people can match prices to discrete amounts — the platonic ideal of a stock price is often said to be around $100. Companies often do split stocks to amounts that should make it possible for someone who wants to to become an owner of a full share.But if they don’t, fractional shares make this point somewhat moot. Unlike Robinhood, investing powerhouse Fidelity trumpets fractional shares as a way to own dollar amounts — $10,000 say — rather than three Amazon shares and $2,200 in cash.This could, conceivably, have an effect on stock splits, which are done to keep prices closer to that platonic ideal.If a person was annoyed at Amazon’s $2,600 price, imagine how they must have felt in 1995 when Warren Buffett offered a single Berkshire Hathaway (BRK.A) stock at over $30,000. Not only was that a barrier to ownership for most people, but someone who wanted to raise some money had to sell in enormous increments — which was the impetus for Buffett to create the B-class share at 1/1,500th of the A’s value.Robinhood offers over 6,900 stocks and ETFs as fractional shares. What’s especially interesting is that one of those is Berkshire Hathaway class A, which costs over $270,000 per share.That means instead of owning $1,000 in a few class B shares for $179 each, you could own that in a fraction of a class A share. Robinhood said that they can offer Berkshire class A shares by buying them from market makers and retaining the amount the customer doesn’t buy — the same as any other share.But most stocks are not big and shouldn’t require the company to own a giant unsold hunk. Even Amazon, at around $2,550, is amongst the biggest, at a hundredth of Berkshire class A’s price.Still, fractional share ownership, especially for the less-than-one-stock situations, is very new — and not yet universal. As various brokerages told Yahoo Finance, there will be more data in the future.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Leisure and hospitality drive jobs numbers higherOverdraft fees have forced the poor out of banks: Former FDIC chairWhy pandemic insurance is impossible2021 health insurance rates are coming out despite 'unprecedented uncertainty'Insurance premiums expected to rise 4% to 6%, before factoring in COVIDHigh-yield savings banks finally hit by the Fed's coronavirus rate cutFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"}]}