{"article": [{"url": "https://finance.yahoo.com/news/wall-street-futures-rise-home-105501033.html", "published": 1597730600.0, "headline": "The pandemic bull market: S&P 500 closes at record high", "body": "By Gertrude Chavez-DreyfussNEW YORK (Reuters) - The S&P 500 closed at a record high on Tuesday, rebounding from huge losses triggered by the coronavirus pandemic and crowning one of the most dramatic recoveries in the index's history.Trillions of dollars in fiscal and monetary stimulus have made Wall Street flush with cash, pushing yield-seeking investors into equities. Amazon and other high growth technology-related stocks have been viewed as the most reliable to ride out the crisis.The S&P record confirms, according to a widely accepted definition, that Wall Street's most closely followed index entered a bull market after hitting its pandemic low on March 23. It has surged about 55% since then.That makes the bear market that started in late February the S&P 500's shortest in its history.Since the March 23 closing low, the S&P posted the largest gain in a 103-day period in 87 years, according to Refinitiv data.Doubts about the underlying health of the economy, however, persisted in Tuesday's session, with lukewarm reactions to bumper results from Home Depot and Walmart limiting gains.The S&P 500 flirted with all-time highs for several sessions before finally hitting a new record, raising questions about whether this run of gains could last.\"The S&P 500 has been impressive and has created a lot of wealth, but I am not sure that reflects the overall health of the economy,\" said Patrick Leary, chief market strategist at Incapital.\"The rally has more to do with asset inflation, which is fueled by all the liquidity and all the continued support in the economy as well as the weakening dollar,\" he added.The Dow Jones Industrial Average fell 66.84 points, or 0.24%, to 27,778.07, the S&P 500 gained 7.79 points, or 0.23%, to 3,389.78 and the Nasdaq Composite added 81.12 points, or 0.73%, to 11,210.84.Amazon, which rose 4.1%, was the largest gainer in the S&P 500.Story continuesMeanwhile Nasdaq clocked its 18th record closing high since early June, when it confirmed its recovery from the coronavirus sell-off. Tuesday's record was its 34th record close so far this year compared with 31 record closing highs in 2019 and 29 in 2018.Consumer discretionary rose the most among major S&P sectors on strength in Amazon while technology stocks provided another major support to the benchmark index.Home Depot Inc reported its biggest rise in quarterly same-store sales in at least two decades, however, its shares fell 1.1% to $285 after analysts cautioned that its sales might have hit their peak.Graphic: S&P 500's bull-to-bear, bear-to-bull journey in 6 months - https://fingfx.thomsonreuters.com/gfx/mkt/jbyprqoodve/Pasted%20image%201597760476411.pngWalmart Inc dipped 0.9% despite posting its biggest-ever quarterly growth in online sales.Data on Tuesday showed U.S. homebuilding accelerated by the most in nearly four years in July in the latest sign the housing sector is emerging as one of the few areas of strength in an economy suffering a record slowdown. That further added to market optimism.Minutes from the Federal Reserve's recent meeting due on Wednesday may provide some insight into how the central bank sees the recovery playing out. The Fed has cut rates to near zero to bolster business through the pandemic.Declining issues outnumbered advancing ones on the NYSE by a 1.40-to-1 ratio; on Nasdaq, a 1.66-to-1 ratio favored decliners.The S&P 500 posted 31 new 52-week highs and no new lows; the Nasdaq Composite recorded 70 new highs and 18 new lows.(Reporting by Gertrude Chavez-Dreyfuss; Additional reporting by Terence Gabriel; Editing by Cynthia Osterman)"}]}