{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-23-2020-221852759.html", "published": 1600874240.0, "headline": "Stock market news live updates: S&P 500 closes at lowest level since July as tech shares fall anew", "body": "Stocks accelerated losses into the close, erasing earlier gains and ending an advance that began on Tuesday. The S&P 500, Dow and Nasdaq each had their worst day in two weeks.The S&P 500 sank more than 2%, led by a drop in the energy and information technology sectors, to close at its lowest level since the end of July. The Nasdaq’s more than 3% decline brought the index down also to near a two-month low.The Dow fell to its lowest close since the beginning of August, even as shares of component stock Nike (NKE) climbed to a record high after reporting quarterly results that far surpassed consensus expectations. However, the increase was offset in the Dow by declines in tech names including Salesforce and Apple.Shares of Stitch Fix (SFIX) sank more than 15%, after the digital personal styling service posted a wider than expected quarterly loss. Tesla (TSLA) shares fell 10% after the company’s inaugural “Battery Day” event Tuesday evening, wherein CEO Elon Musk unveiled a new target to slash battery costs in half to be able to produce a cheaper $25,000 electric car by 2023, disappointing some on Wall Street who had hoped for nearer-term developments.Tech shares reversed course and dropped on Wednesday after leading the broader market higher a day earlier, with the S&P 500 on Tuesday rising for the first time in five sessions. Investors digested a confluence of concerns, including those over the pace of the economic recovery in absence of further stimulus.“The early recoveries in retail sales, industrial production, auto sales and payrolls were indeed broadly V-shaped. But it’s also pretty clear that the rates of recovery have slowed, with only retail sales having completed the V. You can thank the enhanced unemployment benefits for that – $600 per week for more than 30M people, at the peak,” Ian Shepherdson, chief economist for Pantheon Macroeconomics, wrote in a note Tuesday. He added that home sales have been the only area where the V-shaped recovery has continued, with a report Tuesday showing existing-home sales jumped to the highest level since 2006 in August.Story continues“It’s hard to be optimistic about September and the fourth quarter, with the chance of a further relief bill before the election receding as Washington focuses on the Supreme Court,” he added.Other analysts echoed these sentiments.“Even if just coincidence, September has become the month when most of investors’ widely-held reservations about the global economy and markets have converged,” John Normand, JPMorgan head of cross-asset fundamental strategy, said in a note. “These include an early-stage downshift in global growth; a rise in US/European political risk; and virus second waves. The only missing component has been the use of systemically-important sanctions in the US/China conflict.”Federal Reserve Chair Jerome Powell and Treasury Secretary Steven Mnuchin on Tuesday addressed the need for further fiscal stimulus in testimony before the House Financial Services Committee. Powell underscored the limitations of the Federal Reserve’s lending powers, especially in light of the meager appetite among companies to turn to the central bank’s Main Street Lending Program, which has so far extended less than 1% of its loan capacity to small businesses.“Many borrowers will benefit from these programs, as will the overall economy. But for others, a loan that could be difficult to repay might not be the answer,” Powell said. “And in these cases, direct fiscal support may be needed.”To that end, Mnuchin said he would support a reauthorization of measures under the Paycheck Protection Program, which would offer forgivable loans to businesses that stayed open and kept most of their workers employed. However, any reallocation of funds would require congressional approval – a factor that remains elusive as lawmakers struggle to come to a consensus on components of another virus relief-related fiscal stimulus package before the presidential election.—4:03 p.m. ET: Stocks post worst session in two weeks, Nasdaq drops 3% as tech shares renew declinesHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -78.64 (-2.37%) to 3,236.93Dow (^DJI): -525.05 (-1.92%) to 26,763.13Nasdaq (^IXIC): -330.65 (-3.02%) to 10,632.99Crude (CL=F): -$0.28 (-0.70%) to $39.52 a barrelGold (GC=F): -$46.10 (-2.42%) to $1,861.50 per ounce10-year Treasury (^TNX): +1.2 bps to yield 0.6760%—1:56 p.m. ET: Stocks trade lower as energy and tech lead to the downsideThe three major indices held lower in afternoon trading, and losses in the Dow accelerated. The energy, information technology and real estate sectors weighed on the S&P 500.Here were the main moves in markets, as of 1:56 p.m. ET:S&P 500 (^GSPC): -35.18 points (-1.06%) to 3,280.39Dow (^DJI): -214.02 points (-0.78%) to 27,074.16Nasdaq (^IXIC): -175.26 points (-1.6%) to 10,788.62Crude (CL=F): +$0.19 (+0.48%) to $39.99 a barrelGold (GC=F): -$38.50 (-2.02%) to $1,869.10 per ounce10-year Treasury (^TNX): +1.7 bps to yield 0.681%—11:03 a.m. ET: Stocks give up gains, Dow turns negativeThe three major indices gave up earlier gains to trader lower Wednesday mid-morning, as tech stocks renewed their declines. The Dow gave up an advance of as many as 176 points earlier in the session, as more than 1% declines in Apple, Microsoft, Chevron, American Express and Disney offset a steep gain in Nike.The Nasdaq underperformed, dropping 0.7%.—9:45 a.m. ET: US service-sector activity decelerates in September, while manufacturing activity picks up: IHS MarkitUS manufacturing and services sector activity steadied in September over August, according to IHS Markit’s preliminary monthly purchasing managers’ indices.The manufacturing PMI ticked up slightly to 53.5, matching expectations and rising slightly from the 53.1 in August. Readings above the neutral level of 50 indicate expansion in a sector.The service sector PMI moderated, however, and edged down to 54.6 in September from 55.0 in August. Consensus economists had looked for a reading of 54.7, according to Bloomberg-compiled data.“US businesses reported a solid end to the third quarter, with demand growing at a steepening rate to fuel a further recovery of output and employment,” Chris Williamson, chief business economist for IHS Markit, said in a statement.“The question now turns to whether the economy’s strong performance can be sustained into the fourth quarter,” he added. “Covid-19 infection rates remain a major concern and social distancing measures continue to act as a dampener on the overall pace of expansion, notably in consumer-facing services. Uncertainty regarding the presidential election has also intensified, cooling business optimism about the year ahead. Risks therefore seem tilted to the downside for the coming months, as businesses await clarity with respect to both the path of the pandemic and the election.”—9:30 a.m. ET: Stocks open mixed, Nike leads Dow higherHere were the main moves in markets, as of 9:30 a.m. ET:S&P 500 (^GSPC): +3.86 points (+0.12%) to 3,319.43Dow (^DJI): +128.94 points (+0.47%) to 27,417.12Nasdaq (^IXIC): -15.64 points (-0.17%) to 10,946.44Crude (CL=F): +$0.09 (+0.23%) to $39.89 a barrelGold (GC=F): -$19.80 (-1.04%) to $1,887.80 per ounce10-year Treasury (^TNX): +1 bps to yield 0.674%—9:16 a.m. ET: General Mills shares jump in pre-market trading as at-home dining boosts Q1 resultsGeneral Mills (GIS) posted estimates-topping results on the top- and bottom-line for its fiscal first quarter, aided by a continued trend toward consumers dining at home rather than going out to restaurants.First-quarter adjusted earnings were $1.00 per share, versus the 88 cents expected. Net sales of $4.4 billion grew 9% over last year and topped expectations for $4.2 billion. The company said it expects the largest factor impacting this fiscal year’s performance will be at-home versus away-from-home consumer food demand, which in turn will depend heavily on the pace and shape of the recovery from the pandemic.It added that while it saw at-home food demand still elevated from pre-pandemic levels, demand did moderate from the fourth quarter of fiscal 2020 ending in May. General Mills expects current-quarter at-home food demand will still remain elevated to see high single-digit retail sales growth in its North America Retail Category, which is by far the company’s largest segment.—7:12 a.m. ET Wednesday: Stock futures point sharply higher, Dow futures add 200+ pointsHere were the main moves in markets, as of 7:12 a.m. ET Wednesday:S&P 500 futures (ES=F): 3,315.5, up 16.25 points or 0.49%Dow futures (YM=F): 27,367.00, up 224 points or 0.83%Nasdaq futures (NQ=F): 11,181.25, up 31.75 points, or 0.28%Crude (CL=F): +$0.12 (+0.3%) to $39.92 a barrelGold (GC=F): -$11.60 (-0.61%) to $1,896.00 per ounce10-year Treasury (^TNX): +1.3 bps to yield 0.679%—7:00 a.m. ET: Mortgage applications jump 6.8% as purchase applications continue to grow over last yearThe Mortgage Bankers Association’s weekly mortgage application index grew 6.8% during the week ended Sep. 18, returning to growth after a 2.5% drop during the previous week.The increase was driven by a 9% weekly jump in refinances. Over last year, refinances grew 86%.Purchases grew 3%, seasonally adjusted, on a week-over-week basis. Unadjusted, home purchases were up 25% over last year.“Mortgage applications activity remained strong last week, even as the 30-year fixed-rate mortgage and 15-year fixed-rate mortgage increased to their highest levels since late August,” Joel Kan, MBA’s Associate Vice President of Economic and Industry Forecasting, said in a statement. “Purchase applications were up over 25% from a year ago, and the demand for higher-balance loans pushed the average purchase loan size to another record high. The strong interest in home-buying observed this summer has carried over to the fall.”—6:04 p.m. ET Tuesday: Stock futures open slightly higherHere were the main moves in equity markets, as of 6:04 p.m. ET Monday:S&P 500 futures (ES=F): 3,300.5, up 1.25 points or 0.04%Dow futures (YM=F): 27,0207.00, up 64 points or 0.24%Nasdaq futures (NQ=F): 11,149.75, up 0.25 points, or 0.00%NEW YORK, NEW YORK - MARCH 18: Traders work on the floor of the New York Stock Exchange (NYSE) on March 18, 2020 in New York City. The Dow fell more than 1,200 points today as COVID-19 fears continue to roil world markets. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}