{"article": [{"url": "https://finance.yahoo.com/news/investors-see-trump-at-severe-disadvantage-as-coronavirus-cases-biden-soar-114337787.html", "published": 1595400680.0, "headline": "Investors see Trump at 'severe disadvantage' as coronavirus cases, Biden poll numbers soar", "body": "Investors who once overwhelmingly expected President Donald Trump to be reelected have increasingly resigned themselves to the prospect of a Joe Biden presidency.As the presumptive Democratic nominee builds a formidable lead in polls and predictive markets, a new survey released on Wednesday by UBS revealed that 55% of wealthy investors and business owners expect the former vice president to prevail in November.Although they’ve grown optimistic about the global economy’s trajectory over the next 12 months, 46% view the election results as one of their biggest worries, the wealth management giant found. An identical number of those surveyed by UBS plan to adjust their portfolios based on the winner.UBS’s data echoed findings by Deutsche Bank, which in July said market participants have grown “continuously...more bearish” on Trump’s reelection prospects since the pandemic took hold in March, and underscore how sentiment among investors has now shifted decisively toward his opponent.“The surge in coronavirus infections in battleground states has placed him at a severe disadvantage as he prepares for his party’s national convention,” according to Solita Marcelli, UBS’ chief investment officer for the Americas. However, she cautioned against going “all in” on a pro-Biden investment strategy.“It’s still too early to conclude with certainty that we will see a transition of power in November. Modern U.S. presidents have successfully exploited the benefits of incumbency in their reelection bids with remarkable frequency,” Marcelli added.US Democratic presidential candidate Joe Biden speaks about on the third plank of his Build Back Better economic recovery plan for working families, on July 21, 2020, in New Castle, Delaware. (Photo by Brendan Smialowski / AFP) (Photo by BRENDAN SMIALOWSKI/AFP via Getty Images)‘Huge hill to climb’Deutsche Bank’s market sentiment survey found that a net 46% “felt that it was unlikely that Mr. Trump would win in November, a massive turnaround from a net of 93% thinking he would win back in February.”The shifts detected by UBS and Deutsche punctuate the rough shoals the president has hit since March, as a confluence of negative trends — primarily the COVID-19 crisis and protests against racial injustice — took him from overwhelming favorite to underdog.Story continuesAs Biden builds a substantial lead in head-to-head polling data and swing states turn against Trump, bettors on the major predictive markets all expect the Democrat to be inaugurated in January. In fact, Biden’s estimated chances of winning in November are 63% on Smarkets — topping Trump’s previous high of 61% on Smarkets.\"We’ve never seen a sitting president seeking re-election drop as low as 34%, so Trump seemingly has a huge hill to climb if he is to secure four more years in the White House,” Sarbjit Bakhshi, Smarkets Head of Political Markets, said in a statement on Tuesday.Currently, markets view the prospects of a Biden win with a studied degree of equanimity, and observers have suggested investors can live with him given his comparatively moderate policy stances.However, odds of a Democratic sweep of Washington are on the rise — along with the potential for big policy shifts that would mean higher taxes, according to UBS’ Marcelli, who outlined differences in the two candidates’ competing visions for the U.S.“In terms of fiscal policy, President Trump is likely to seek lower taxes in a second term, or to make permanent certain provisions of the Tax Cuts and Jobs Act that are scheduled to expire in December 2025,” she wrote. “He would be more likely to ease the financial burden on corporations in order to stimulate economic growth.”By contrast, Biden “is more inclined to raise corporate tax rates, while prioritizing broad-based spending initiatives around the expansion of healthcare coverage, boosting minimum wages, and providing more federal support for housing and education,” she added.Noting that higher taxes on corporations and the wealthy are integral to progressive Democratic policy, Datatrek’s Nick Colas said on Wednesday the effects from those would likely be offset by massive fiscal support.“Even if their tax rates go back to pre-2017 levels, a longer tail for enhanced unemployment benefits means higher pretax income than if these benefits were to run out sooner,” Colas wrote.“Bottom line: at this point in the cycle (depressed, and with high uncertainty), equity holders may actually welcome economic policy that boosts the next 4-6 quarters of revenues even if it comes with a higher marginal tax rate,” he added.-Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}