{"article": [{"url": "https://finance.yahoo.com/news/airlines-desperate-for-flyers-adopt-their-own-spacing-sanitation-rules-in-postlockdown-era-115319973.html", "published": 1592290880.0, "headline": "Airlines desperate for travelers adopt their own spacing, sanitation rules post-lockdown", "body": "Airlines desperate to stay solvent are adopting their own anti-coronavirus sanitation and social distancing measures, hoping those changes bolster confidence among flyers that cabin space can be shared without getting sick.To date, there are no federal sanitation or distancing requirements that govern civilian passenger aircraft, specifically designed to combat COVID-19, which has sickened over 2 million in the U.S.The Centers for Disease Control and Prevention (CDC) and the World Health Organization (WHO) have issued guidance. However, in the absence of legal requirements, consumers mulling if and when to fly, must rely on an airline’s individual rules.“At this time it's all the airlines making these decisions,” United Airlines (UAL) vice president for Newark Airport, Mike Erbeck, told Yahoo Finance, adding that the company follows, and exceeds, CDC and WHO guidelines. The company became the first to require passengers to fill out a health questionnaire before they fly, indicating they’ve not been diagnosed with COVID-19 in the past 21 days, and have remained asymptomatic for the disease for the past two weeks.On March 4, the CDC updated its airline guidance to recommend that all passengers and crew wear facial coverings, and refrain from flying if they’ve recently been exposed to the virus, or demonstrated symptoms.For flights without symptomatic passengers, the CDC suggests that airlines follow “routine operating procedures” between flights. For those exposed to potentially sick passengers, the agency suggests “enhanced cleaning procedures” within a 6-foot radius of the symptomatic person’s seat.Major U.S. carriers — Southwest Airlines (LUV), Delta Air Lines, United Airlines (UAL), and American Airlines (AAL) — are taking similar, though not identical, precautions, as lockdowns end and passengers take to the skies again.Airlines for America, a trade organization that represents major passenger and cargo carriers, told Yahoo Finance in an email that all of its member airlines are requiring passengers and customer-facing employees to wear a face covering from check-in all the way through deplaning. On Monday, the organization announced stricter rules that include airlines placing customers who do not comply on internal flight restriction lists.Story continues“There are some good measures they are taking,” Purdue University professor, Qingyan (Yan) Chen, an expert on closed space particle transmission, told Yahoo Finance. Chen cited the importance of required facial coverings for passengers and crew, as well as empty seats between passengers to create more distance.Still, cabin capacity limits have not been universally adopted. And while most carriers have pared food and beverage service, consuming it means face coverings can be removed — something Chen described as “dangerous” and a “perfect recipe for infection.”He proposed that airlines change their services so that passengers are not eating and drinking at the same time. Worn correctly, face masks are capable of keeping out between 25-95% of particles, he explained. The best of the lot are N95s, capable of capturing closer to 95% of exterior particles, as opposed to surgical or cloth type masks that block as little as 25%.Filters, no ice, but (maybe) boozeUnited Airlines promotional imageAccording to United, flyers can now expect enhanced sanitation in the airport, as well as on board. The company has rolled out software allowing customers to check-in and tag bags without needing to touch anything but their own belongings.On board, only packaged and covered food and drinks are provided. Ice has been eliminated, and alcohol is available only to passengers in premium cabins. United and its competitors also emphasize that planes are equipped with high efficiency particle air (HEPA) filters that remove cabin particles around every 3 minutes. In United case, such filters are installed its own planes, as well as those flown by its partner carriers.Chen said HEPA filters are indeed important, yet mitigate only so much spread of disease, which is why properly worn mask and spacing between passengers are so important.“Because of their gravity, large droplets tend to go down to the floor, so they wouldn’t go through the airflow because they are heavy,” the professor said.If a passenger coughs, “the larger droplets will go to the tray table, and then go to the seat back, and then probably on the passenger’s clothes, and also on the floor,” he said. If someone touches those surfaces, he said, their hand can then contain the disease.“Then if you rub your nose, eyes and mouth, definitely you might become sick,” Chen said, adding that various droplet sizes — large, medium and small — are all potential carriers of coronavirus.Very small to medium sized droplets can remain airborne, traveling up to 3 rows in front and 3 rows behind a passenger who originated them, Chen said. Smaller droplets can be captured by an airplane’s filters, though they can remain suspended in the cabin’s air for up to 4 minutes.During that time, Chen said, the majority of airborne droplets travel latitudinally, in a circular-type loop along an aircraft’s rows.The problem with capacityStill, how many people should be allowed on one plane is very much up for debate. The issue is less of a concern right now, as airport screenings remain down 80 to 85% year over year, according to TSA data, and flight loads hover around 40 to 50%.Last month, American came under criticism for allegedly relaxing a policy it had in place until May 31 to limit flight capacity at 50%. The company has said it will notify passengers of fuller flights and offer a chance to rebook.Meanwhile, Delta plans to fly aircraft under capacity with main cabins at 60% until September 30. United plans to notify passengers that they can rebook as cabins approach 70% capacity, through June 30. Southwest said it will keep middle seats open at least through September, which equates to operating each flight at roughly two-thirds full.In a statement to Yahoo Finance, the FAA said the agency is discussing with its interagency partners the health and safety of flight crews and the traveling public.“The agency has taken an active role in these discussions since the beginning of the COVID-19 public health emergency, issuing a recent Safety Alert for Operators (SAFO) with interim guidance from the CDC that air carriers and crew members should follow.”U.S. Department of Transportation Secretary Elaine Chao told Politico on June 4 that COVID-19 safety protocols could be best achieved by the private sector, given potential delays that could come from hurdles of removing federal rules, once conditions change.United’s Erbeck echoed the point, saying it’s important for United to remain nimble. However, the company is open to covid-related rules from the FAA.“I think we have a lot of influence in Washington to help with those regulations. I think that's what we're proving today is we're doing a lot of things without the government involvement,” Erbeck said. “If there is a better way to do it, we're open to it.”Alexis Keenan is a reporter for Yahoo Finance. Follow on Twitter @alexiskweed.[Click the following links for more of Yahoo Finance’s coronavirus coverage: Personal finance tips, news, policy, graphics & more from Yahoo Finance]Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news."}]}