{"article": [{"url": "https://finance.yahoo.com/news/fed-chair-jerome-powell-wear-a-mask-for-the-economy-202918264.html", "published": 1599233840.0, "headline": "Fed Chair Powell: Wearing masks can lead to 'enormous' economic gains", "body": "Federal Reserve Chairman Jay Powell said Friday that Americans should wear masks and follow social distancing guidelines to ensure an economic recovery.“There’s actually enormous economic gains to be had nationwide from people wearing masks and keeping their distance,” Powell told NPR. Powell added that short of a vaccine, such measures enable people to “go back to work and not get sick.”Powell also spoke about the August jobs report, describing the addition of 1.371 million payrolls in August as “a good one.” The Bureau of Labor Statistics reported the new numbers on Friday morning, which also showed the unemployment rate falling to 8.4% — below the street’s expectations.Powell pointed out that the August gains were not as large as those in May and June.“I guess I would just say, the recovery is continuing,” Powell said Friday in a clip aired on NPR’s “All Things Considered.” “We do think it will get harder from here because of those areas of the economy that are so directly affected by the pandemic still.”Powell’s remarks on Friday mark his third media interview since the COVID-19 crisis began. On March 26, Powell appeared on NBC’s “Today Show” and in mid-May, CBS’s “60 Minutes” interviewed Powell.The Fed Chairman’s remarks to NPR will be the last from Fed officials as policymakers head into a media blackout ahead of the Federal Open Market Committee’s meeting on September 15 and 16.Federal Reserve Chairman Jerome Powell, wearing a face mask, testifies before the House of Representatives Financial Services Committee during a hearing on oversight of the Treasury Department and Federal Reserve response to the outbreak of the coronavirus disease (COVID-19), on Capitol Hill in Washington, U.S., June 30, 2020. Tasos Katopodis/Pool via REUTERS“We think that the economy's going to need low interest rates, which support economic activity, for an extended period of time,\" he told NPR. \"It will be measured in years.\"The Fed chief also emphasized that more fiscal support is needed from lawmakers at the White House and Capitol Hill, for example on eviction moratoriums.“We shouldn't let those people lose everything they have and have to move out or be evicted and move in with family. That's also not going to be good for containing the COVID spread,” he said.Powell’s remarks after a rough Thursday for the stock market, which posted its worst day since June. Tech stocks suffered deep losses as the Dow Jones lost over 800 points, or 2.8%. On Friday, a better-than-expected jobs report did not appear to stop the momentum as the Dow fell another 500+ points, although the markets appeared to regain a large chunk of those losses throughout the rest of the afternoon.Story continuesNPR says it will air its full interview with Powell on Monday, September 7.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Federal Reserve: We got it ‘wrong’ on post-crisis rate hikesJackson Hole wrap-up: For the Fed, inflation is all about managing expectationsCleveland Fed's Mester: GDP to be about 6% lower than last year for 2020Jackson Hole: Fed Chair Powell unveils effort to target 'moderately' higher inflationA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}