{"article": [{"url": "https://finance.yahoo.com/news/imac-review-185427124.html", "published": 1599228140.0, "headline": "Apple’s iMac 27-inch has colossal power and a gorgeous display that make it one of the best desktops around", "body": "Apple’s new iMac 27-inch is a beast. Starting at $1,799, with the option to price it up to a bank account-draining $8,799, it’s designed for both everyday users in need of a big-screen desktop that will last and professionals seeking a powerlifter of a computer without having to step up to either the outrageous iMac Pro or Mac Pro.I’ve been using a decked-out version of Apple’s (AAPL) iMac 27-inch as my work computer for the better part of a month, and it’s proven capable of handling everything I’ve thrown at it. From games to photo editing, it’s never so much as broken a sweat.It doesn’t hurt that it packs a gorgeous 5K display and an enhanced webcam that’s perfect for our new dystopian work-from-home world.It’s one heck of a desktop that’s worth the investment, as long as you can afford the price of entry.Pros:Beautiful 27-inch Retina displayHigh-powered performanceClassic designCons:High starting priceMouse and keyboard may not suit everyoneBig-screen improvementsThe iMac 27-inch uses the same design as the current iMac 21.5-inch, featuring an incredibly thin body and stand that almost makes the display look like it’s floating over your desk. It’s an understated look that instantly makes your desk look classier.All of the cables plug into the back of the system and are routed through a gap in the stand to hide them. That’s also why Apple includes its Magic Mouse and Magic Keyboard in the box. I’m used to typing on my MacBook all day, so I wasn’t bothered by the fact that this keyboard wasn’t elevated.There’s also still the issue of the USB C charging port for the mouse being located on its underside, making it impossible to use while it’s charging.But you’re not buying this machine for the keyboard or mouse, which are still wonderful despite those quibbles. You’re getting it for its massive 27-inch display and boatloads of power.The iMac 27-inch features the same design as the iMac 21.5-inch, but offers a 5K panel and far more performance. (Image: Apple)That display, with its 5K resolution, is perfect for users who want to retouch photos with exacting detail. And because it uses Apple’s nano-texture glass, a $500 add-on, it offers the benefits of a matte display — reducing glare in well-lit environments without dulling or washing out the actual on-screen image.Story continuesIf you’re getting this all-in-one for any kind of media work, the nano-texture glass can be a huge benefit and has reduced the glare from the overhead lights in my kitchen.In addition to its display, the 27-inch iMac now gets an improved 1080p FaceTime camera that captures crisp and colorful images. What’s more, Apple says the iMac’s included T2 chip works alongside the system’s three-speaker array to provide enhanced audio quality while video chatting. The new camera is a welcome upgrade, especially with so many people working from home.Performance for daysBeyond its monster display, the other reason you’re likely looking at the iMac 27-inch is because of its gobs of power. The base version of the desktop comes with a 10th-generation, 6-core Intel (INTC) Core i5 processor, 8GB of RAM, an AMD (AMD) Radeon Pro 5300 graphics chip and a 256GB solid-state drive. That’s a solid system, for sure, but nowhere near the top of the line version.That absolute unit of a computer features a 10th-gen, 10-core Intel Core i9 processor, an absurd 128GB of RAM, an AMD Radeon Pro 5700 XT with 16GB of memory, and an 8TB SSD. You buy that version of the iMac 27-inch and NASA is going to call asking if you can run their next space launch.Apple's iMac 27-inch offers a slew of high-powered Intel processors and can pack a whopping 128GB of RAM. It's a beast. (Image: Apple)The review unit I’ve been using isn’t quite that powerful, but I’m sure it could at least operate some kind of super villain-style laser weapon, or the like. It features a 10th-gen, 10-core Intel Core i9 processor, 32GB of RAM, an AMD Radeon Pro 5700 XT with 16GB of memory, and a 1TB SSD for $4,499.The iMac handled everything I threw at it. The system knocked the teeth out of the popular Geekbench 5 CPU benchmarking test, with a score of 1220 for single-core and 9678 for multi-core. It’s hard to quantify benchmarks, though, because they don’t really give you an understanding of what that power means in terms of real-world performance.To do that, I played a few games including “Tomb Raider,” which the iMac was able to run at 60 frames per second with the settings turned up to ultimate. That’s an older game, which means the system requirements aren’t as high as a newer title — but it still shows how powerful this iMac is.Should you get it?Oh boy, if I had the money, and Macs ran more games, I’d drop my cash on this monster in a heartbeat. It’s got a fantastic display, wonderful design, and power to spare. For everyone else, the iMac 27-inch will certainly meet their needs and is worth the cash.For professionals looking to get a system that they can use for video and photo editing, this is a fantastic solution.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple fires shot at Google in new privacy adNvidia debuts latest RTX 3000 series graphics cards, including high-powered RTX 3090Samsung’s Galaxy Z Fold2 5G could be the first foldable phone you want, if you can afford itApple’s stock split: How shares are performingFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}