{"article": [{"url": "https://finance.yahoo.com/news/crude-supply-dwarfed-by-cuts-in-demand-oil-watcher-120933960.html", "published": 1593069440.0, "headline": "Crude supply 'dwarfed' by cuts in demand: oil watcher", "body": "The oil industry’s inroads to cutting supply are “dwarfed by the by the cuts that we’ve seen in demand,” even as states have re-opened their economies amid the pandemic, says one oil expert.“We’re still running a surplus in supply,” Stephen Schork, founder and editor of The Schork Report, told Yahoo Finance. “There simply is not enough demand,” he added.Concerns about an uptick in coronavirus cases and an inventory buildup sent oil prices lower on Wednesday. U.S. crude stockpiles increased by a higher-than-expected 1.4 million barrels last week, according to data from the Energy Information Administration (EIA).“What really scared the market with today’s EIA report, is that we saw a significant rebound in crude oil production on the domestic side,” said Schork.What’s worse, says Schork, is that the U.S. is technically already in peak driving season.“We’re only looking at maybe 8 or 9 more weeks of peak demand, and then demand starts to fall as we get into September and October,” said Schork. “This summer as far as the demand story, it’s over. It never began.”More people working from home and industries shifting amid the pandemic paint an uncertain scenario for the oil market.“Demand in the here and the now through the remainder of this year and well into 2021, is still going to lag. It will be well more than a year before we get even back to levels, if we ever get back there,” said Schork.“With 20, 25 million Americans out of work right now that translates into about 17 to 18 million commuters that no longer have jobs to drive to,” said Schork. “That is demand that is lost. It’s going to be a while.”Storage is shown at the Marathon Petroleum Corp. refinery in Detroit, Tuesday, April 21, 2020. The world is awash in oil, there's little demand for it and we're running out of places to put it. That in a nutshell explains this week's strange and unprecedented action in the market for crude oil futures contracts, where traders essentially offered to pay someone else to deal with the oil they were due to have delivered next month.(AP Photo/Paul Sancya)‘Oil in this generation, it is a twilight industry’The rise in electric and hybrid vehicles is also putting pressure on the oil and gasoline markets.“Oil in this generation, it is a twilight industry,” said Schork.“We’ve made too many advances on the other side to wean ourselves off gasoline,” he added.“Perhaps we’ll never get back to those demand figures for oil and for gasoline in the United States that we enjoyed just two years ago. The tide has certainly turned in this market,” said Schork.Story continuesOn Wednesday, US West Texas Intermediate crude (CL=F) settled 5.85% lower, at $38.01 a barrel. Brent crude (BZ=F) lost 5.5%, to close at $40.29 — a day after marking its highest price since early March.Industry supply cuts and optimism over demand as businesses re-open helped prices rally over the past couple of months, recovering from the massive sell-off in April when US crude futures turned negative for the first time in history.Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreRead more:It would be unprecedented for a bear market to be this short: Wells Fargo StrategistRecent rally could be a ‘bear market trap’: Miller Tabak StrategistA view from the trading floor: Algorithms having ‘outsized impact’ amid coronavirus impactFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}