{"article": [{"url": "https://finance.yahoo.com/news/peloton-founder-big-15-year-goal-130451826.html", "published": 1600071140.0, "headline": "Peloton founder: Here's one of my big 15-year goals", "body": "Peloton (PTON) founder and CEO John Foley has been spending the rather unusual COVID-19 months cooking up bacon and eggs with his two young children and wife (who is Peloton’s VP of apparel), dominating leaderboards on his snazzy new Bike+, and working closely with his executive team on protecting the company’s can-do culture amidst a nation of growing social unrest.If he checks Peloton’s stock price on the Yahoo Finance app (though he didn’t say he does in our recent interview) we wouldn’t blame him — the stock has exploded close to 200% as the country has devoured Peloton’s digital-based bikes, treads and app content with gyms closed during the pandemic.Amidst the daily grind of running a public company and being a dad and husband, Foley is remaining focused on achieving one of his biggest, long-term numerical goals for Peloton.100 million Peloton users over 15 years.“We call it a BHAG here — a big, hairy, audacious goal — of having 100 million members and a net promoter score of 100. To our knowledge, there's not a company in the world that has 100 net promoter score, and certainly 100 million subscribers gets us in that rarefied air of some of the FAANG [Facebook, Apple, Amazon, Netflix, Google] stocks. We think that Peloton has the opportunity to be one of those special companies, and we have thousands of people at Peloton who are marching in that direction every day and it doesn't look like we're slowing down anytime soon,” Foley tells Yahoo Finance.Now to be fair, Peloton has a way to go in reaching that big hairy membership goal (the net promoter score is currently in the low 90s, impressive in its own right) and enjoying the profits associated with it. Peloton ended its most recent quarter with 3.1 million members. As for being on par with Netflix, the streaming giant wrapped up its second quarter with nearly 193 million global streaming memberships.But Peloton’s most recent quarterly results — fueled by likely fundamental changes in how humans workout and approach their health more broadly — suggest Foley’s ‘BHAG’ goal may not be such a pipe-dream. Total members grew from 2.6 million in the preceding quarter to the aforementioned 3.1 million. Connected fitness subscription workouts surged 333% year-over-year to 76.8 million. The average subscriber pounded out 24.7 workouts in a month, up from 12 a year ago.Story continuesPeloton founder and CEO John Foley has good reason to smile this year. (Photo by Kimberly White/Getty Images for TechCrunch)Numbers like this go a long way to dispel the idea that Peloton products are a nice to have for rich people, a thesis trumpeted by many analysts during the company’s 2019 IPO. Rather, the data suggests the pandemic has altered the total addressable market for Peloton.Will these pandemic growth rates stick around for Peloton the next 15 years? No, of course not. But rough math suggests growing memberships by at least a 25% compound annual growth rate the next 15 years will get Foley to his goal. That’s not unrealistic as Peloton adds more content to the platform, ventures deeper into international markets (it’s only in Germany and U.K.), drives Apple-like hardware upgrade cycles and people exit the pandemic with altered lifestyles for years to come.“Leaving aside recent stock performance and valuation, we still see Peloton as a business that is poised to continue to capitalize on shifting consumer behavior toward more in-home and health safety workout regimes. In addition, we see the tiered product structure (as we get deeper into FY21/22) and the outputs/of marketing efficiencies and learnings from the past six months as having potential to widen total addressable market and drive continued sub growth in the coming years,” said UBS analyst Eric Sheridan.As for Foley, it’s not lost on him that most of his time as a public company CEO since the Sept. 26, 2019 IPO has overlapped the pandemic.“It's funny, the first six months the markets were pretty anxious about us whether it was profitability or growth. And then all of a sudden, COVID hits. It has been a wild first year for sure,” Foley says. “We've had the added complexity of having a crazy sales environment where gyms are closed and people want Peloton products and platforms more than ever. So there has been a lot of wind in our sails. Exciting times, obviously. But also super challenging times. It has been probably one of the hardest six months from a business operations perspective for our entire global operations team.”Onto 100 million members.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}