{"article": [{"url": "https://finance.yahoo.com/news/doctors-unleash-on-politics-as-coronavirus-spikes-no-other-country-debates-masks-111943253.html", "published": 1593066440.0, "headline": "Doctors unleash on politics as coronavirus spikes: 'No other country debates masks'", "body": "New coronavirus diagnoses in the United States are skyrocketing — along with criticisms about the patchwork of state and local policies that are faltering in the effort to prevent community transmission of the virus.As Sun Belt states like Arizona, California, Florida and Texas become new epicenters of the COVID-19 pandemic, attention has shifted to the increasingly polarizing debate over protocols designed to contain new infections.State lockdowns have gradually relaxed, and the public has mostly adjusted to life behind face coverings — but not without fits and starts. Pew Research data released this week show that at least 65% of Americans have adopted the near constant use of personal protective equipment (PPE).However, social distancing and the use of masks in public have become a source of contention among those who feel it violates their personal freedoms.In a series of interviews, doctors on the front lines in states where COVID-19 infections are exploding lamented the controversy in stark terms. They argue that mixed messages from mayors, governors and President Donald Trump are making it harder for people to appreciate the need for masking — especially as infections among younger citizens jump sharply.“Honestly the politicization of science is one of our incredible societal downfalls. Science should not be politics,” Dr. Hilary Fairbrother, a Houston emergency medicine physician, told Yahoo Finance on Wednesday. The Lone Star state is in the throes of a record number of cases that threatens to overwhelm health systems in major cities like Dallas and Houston.Fairbrother said the debate has become a Hobson’s choice that lacks nuance, between those who want to “close down the entire world for at least 3 years until there is no coronavirus left in any corner of the planet,” and others who are unconcerned about rising casualties.“There’s no middle ground, there’s no common sense or application of good science,” she added. “I beg people to start listening to scientists, and stop listening to politicians on all things coronavirus.”Story continuesThere are over 2.3 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)‘A very different culture’When the outbreak first led to mass restrictions on public life, some experts cautioned that Americans — accustomed as they are to constitutionally protected freedoms — were ill-prepared to accept how a raging pandemic would affect their quality of life.Those warnings have been proven prescient, as quarantine fatigue and protests against social injustice have led many to abandon anti-coronavirus protections designed to bend the curve of new infections.Many of the states now on the outbreak’s front lines are struggling to balance individual rights with the mandates of a public health crisis, and falling short of the mark. Citizens, as well as investors, are banking on the idea that the latest surge of infections won’t lead to a renewal of restrictive stay-at-home orders that crushed the global economy.“I’m not a constitutional scholar but this is what happens when you try and use federalism at the science level,” said Dr. Murtaza Akhter, an assistant professor in the University of Arizona’s Department of Emergency Medicine. The Grand Canyon State has nearly 60,000 cases and around 1500 deaths, and has been the center of a raucous public debate over mask-wearing in public.“The fact that people are still saying ‘this is America, do what you want’ that’s fine from a legal or constitutional perspective, but from a public health and science perspective that’s a terrible idea,” Akhter said.“We have a very different culture here. There’s no other country I know of in the world that debates masks,” Akhter added. “People don't even debate seatbelts anymore... but to debate masks during a pandemic is so utterly ironic that it's hard to comprehend.”Akhter, who accused Arizona’s governor of “passing the buck” on using face masks, said the coronavirus “doesn’t know state, city borders or national borders, it transcends all borders and all people. So the problem with having some people wearing masks and others not wearing them, is that the threat [of spreading] is still going to be there.”In Houston, where hospital capacity is nearing a breaking point, the dire situation has become an empirical study in how a lack of policy coordination can lead to dire consequences. Texas Governor Greg Abbott has come under fire for downplaying the need for masks, and allowing mayors to make their own calls for a mandate.“The biggest concern is that we’re going to lose a handle on the situation,” Cedric Dark, an assistant professor at Texas’ Baylor College of Medicine, told Yahoo Finance. He was critical of Abbott’s decision to reopen the economy in May, despite an earlier suggestion that the state could corral a COVID-19 surge.After the reopening, “those cases started going up, not only linearly but exponentially,” Dark said.“Unless we battle it back now, we’re going to be forced to shut everything down [again]...I think people need to realize it. We need to dial it back and go back to where we were in Phase 1,” the physician added.Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news"}]}