{"article": [{"url": "https://finance.yahoo.com/news/mulan-disney-plus-liu-yifei-hong-kong-protests-boycott-221447256.html", "published": 1599240140.0, "headline": "'Mulan' producer on boycott threats: 'I feel badly ... the conversation turns to this’", "body": "The live-action remake of “Mulan” premiered on Disney’s streaming platform Friday amid the coronavirus pandemic and renewed calls for its boycott over the star’s support for Hong Kong’s police during pro-democracy protests.Jason T. Reed, a “Mulan” producer and former Disney executive, expressed his support for Liu Yifei — a Chinese-born actress who plays the titular role — during an interview with Yahoo Finance’s The Final Round on Friday.“Well, I think that first off, it's a very complicated situation for performers who live in China and work in China. Obviously, the tensions between the two entities is very complicated,” said Reed, referring to relations between China and Hong Kong, which led to ongoing demonstrations and accusations of police brutality against pro-democracy protesters.“I'm not qualified to discuss that in depth. I'm here to represent the film,” he added. “But I will say from a very personal place, no one worked harder and gave more of themselves than Yifei did. She trained for six months prior to starting production — horse riding, martial arts, practicing creating that character.”Cast member Yifei Liu attends the European premiere for the film \"Mulan\" in London, Britain March 12, 2020. REUTERS/Henry Nicholls“She worked every single day of the schedule. So I feel badly for her, that the conversation is inevitably, it inevitably turns to this and I hope that when audiences see the movie that the conversation turns back to what an amazing performance she brought in and how hard, how much she had to do in order to bring that character to life,” he added.‘You can all attack me now’The remake of the classic 1998 animated film was slated to be Disney’s surefire success, with its big theatrical release originally scheduled for March 27. Because of the global pandemic, its debut was postponed three times before the company ultimately made the decision to go straight to Disney+. Starting Friday, everyone has to pay $30 to watch the film, but it will be included in the Disney+ subscription beginning December 4.Liu plays a brave young Chinese woman who impersonates a man to train for military in the place of her sick father. Last August, in the thick of the pro-democracy protests, Liu shared a post on social network Weibo with the words “I support the Hong Kong police. You can all attack me now” in Chinese. The original statement was made by Fu Guohao, a reporter for the official state-run Chinese newspaper, “People’s Daily.” This was in response to Beijing’s decision to push a national security law, which has since been implemented, on Hong Kong.Story continuesTwitter users (#BoycottMulan) and protesters across Thailand, Korea, and Taiwan, among other nations, claim that Liu’s personal support of police officers in Hong Kong, who were accused of using excessive force to suppress protests, is a marked stand against democracy.Liu, who was born in Wuhan, grew up in Queens, New York, before returning to China to pursue a career in acting.‘Leaning into the movie’“Mulan,” along with Christopher Nolan’s thriller “Tenet,” which hit select theaters Thursday, are the two films of the summer that may indicate how studios think about alternative releases going forward — even after the lingering effects of coronavirus.Organizations like Gold House have put a huge emphasis on galvanizing audiences to flock to the theaters for films starring and written by Asian-Americans. The #GoldOpen movement helped catapult “Crazy Rich Asians,” “The Farewell,” “Just Mercy,” and “Parasite,” the latter of which won Best Picture and Best Director at the Academy Awards. Mulan’s #GoldOpen programming includes live Twitter screening parties every day this weekend with Q&As with the cast as well as deals for food at local Chinese restaurants.“We have a number of organizations that are really leaning in to the movie...whose leadership has seen the movie and had a very positive response and they want to make sure that they get it out to the communities that they tend to represent. We were very sort of sensitive and respectful about that while making the film, whether the Asian diaspora community or the Chinese community, and obviously women in general have a very strong reaction to the movie as does the LGBTQ+ community,” said Reed.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:What Silicon Valley still doesn't understand about its diversity problem47% of teachers considered making a job change in the past month: surveySerial tech entrepreneur launches ambitious alternative to school: 'It's a very progressive approach to education''People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talentWNBA Commissioner: 'There is nothing political about Black Lives Matter'"}]}