{"article": [{"url": "https://finance.yahoo.com/news/apple-fitness-coming-for-peloton-204551144.html", "published": 1600185200.0, "headline": "Apple’s Fitness+ service is going after Peloton", "body": "Apple (AAPL) on Tuesday announced a new dedicated fitness and workout app called Apple Fitness+, positioning the tech giant as a major competitor to fitness platforms like Peloton (PTON).Available by the end of the year and priced at $9.99 per month or $79.99 per year, Apple Fitness+ pushes Apple deeper into the personal fitness category. It also serves as further proof that Apple is leaning further into recurring revenue streams offered by subscription services as a means of ensuring the company’s continued growth moving forward.Peloton under fireThe Apple Fitness+ service, which does not have a firm release date yet, will allow you to select the kinds of exercises you want to focus on — whether that’s high intensity interval training, yoga, cycling, core exercises, treadmill workouts, and more. You’ll also be able to choose the trainer you want to work with, the kind of music you’re interested in, and workout duration.Apple on Tuesday announced it's launching its new Fitness+ service. And it's aiming directly at Peloton. (Image: Apple)Sound familiar? Peloton — which first launched internet-connected bicycles and treadmills and now features an app with an array of other exercise options — offers similar options in its own services, as do other apps. In fact, much of Peloton’s appeal comes from the trainers who work with the service, and that’s exactly what Apple hopes to pull off, as well.In the company’s press announcement, it specifically says that Apple Fitness+ trainers have their own “unique, inspirational story that transcends the screen.” The company goes on to say that trainers are focused around a variety of exercise expertise whether that’s professional athletes, personal trainers, health coaches, gymnasts and more.The idea is for the trainers to be the kind of people you want to work out with on a daily basis, just as Peloton’s offerings do.Apple is even moving forward with a first-timer feature for Fitness+ called Absolute Beginner that’s meant to provide users with the basics of workout movements and help them prepare for more advanced studio workouts.Story continuesApple Fitness+ is the company's first foray into fitness services, and will be available for $9.99 per month when it launches later this year. (Image: Apple)It’s a smart idea, as it works to guide beginners away from starting on the hardest difficulty and becoming discouraged, which would lead them to cancel their subscription. It should also prevent users from hurting themselves by not following proper forms.It’s all about the subscriptionsApple Fitness+ is just the latest in Apple’s growing line of subscription services, and at $9.99 per month, it’s also one of the pricier subscriptions the company offers. But it’s also a solid value when compared to the $12.99 per month fee for Peloton’s Digital Membership, and free with the bike.American ultramarathon runner and author Robin Arzon, a Peloton executive and instructor, poses for photos on the green carpet at the New York Jets New Uniform Unveiling on April 4, 2019 at Gotham Hall in New York, NY. (Photo by Rich Graessle/Icon Sportswire via Getty Images)Apple isn’t going to get existing Peloton subscribers with Peloton bikes or treadmills to switch to Apple Fitness+, as they’ve already made a pricey investment in those machines. But it could get digital-only subscribers to change. Its availability on every iPhone, iPad, and Apple TV will also make it more appealing to users, as they won’t have to download a separate app.Apple’s subscription products are designed to keep Apple users in the company’s ecosystem, ensuring that they’ll both continue paying monthly fees, and, eventually, upgrade their iPhones and other Apple hardware as they become obsolete.The firm has been focusing on subscriptions more in recent years to help move away from its heavy reliance on iPhone sales. The company’s Services arm is now its second largest behind the iPhone division, bringing in $13.2 billion in Apple’s Q3 2020. The iPhone earned $26.4 billionWith the addition of Fitness+, Services is certain to grow even more.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple debuts $399 Apple Watch Series 6 and $279 Apple Watch SEOracle’s TikTok win gives it a chance to prove it can take on Amazon and MicrosoftHow to watch the Apple event on Sept. 15, and what to expectNetflix co-CEO on its advantage over Apple and Amazon: We have a ‘single focus’Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}