{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-16-2020-222127253.html", "published": 1600269140.0, "headline": "Stock market news live updates: Stocks mixed with tech shares pressured; Investors digest Powell's remarks", "body": "Stocks erased earlier gains and turned mixed Wednesday afternoon as investors considered the Federal Open Market Committee’s (FOMC) September monetary policy statement and remarks from Federal Reserve Chair Jerome Powell. Officials signaled that rates would remain near-zero through 2023, as policymakers look to boost the virus-stricken economy.[Click here to read what’s moving markets heading into Thursday, September 17] In its monetary policy statement Wednesday, central bank officials reiterated that “the path of the economy will depend significantly on the course of the virus.”“The ongoing public health crisis will continue to weigh on economic activity, employment, and inflation in the near term, and poses considerable risks to the economic outlook over the medium term,” according to the statement.With the virus continuing to anchor growth, policymakers released new forecasts reflecting their expectation that rates would remain historically low in order to support economic activity. The Fed’s updated Summery of Economic Projections released Wednesday showed US central bank officials anticipate that rates will remain near zero through 2023, the longest duration included in their projections.Still, the Fed’s outlook for the contraction in US economic activity became slightly less dire following their September meeting. The Fed forecast a 3.7% contraction in real GDP and an unemployment rate of 7.6% by the end of the year, versus its June outlook for a 6.5% GDP contraction and jobless rate of 9.3%.The Fed added that it would continue its current Treasury and mortgage-backed securities purchases “at least at the current pace to sustain smooth market functioning and help foster accommodative financial conditions.”Market participants also considered Fed Chair Powell’s remarks following the release of the monetary policy statement. In these, Powell again nudged for congressional lawmakers to pass more legislation targeted directly at helping Main Street businesses and households, with the initial faster-than-expected economic recovery in recent months threatened as enhanced unemployment benefits and other direct support measures expired. Both Powell and other FOMC members have repeatedly underscored the importance of fiscal policy in tandem with monetary policy as being essential to the economic recovery.Story continues—4:03 p.m. ET: Stocks give up most gains after Fed pledges to leave rates near zero, but warns on need for fiscal boostHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -15.65 (-0.46%) to 3,385.55Dow (^DJI): +37.38 (+0.13%) to 28,032.98Nasdaq (^IXIC): -139.86 (-1.25%) to 11,050.47Crude (CL=F): +$1.84 (+4.81%) to $40.12 a barrelGold (GC=F): -$0.70 (-0.04%) to $1,965.50 per ounce10-year Treasury (^TNX): +0.8 bps to yield 0.6870%—3:40 p.m. ET: Stocks lose steam after Powell remarksThe major stock indices were mixed heading into the closing bell Wednesday afternoon, after Fed Chair Powell answered reporters’ questions following the FOMC’s monetary policy statement release.In his remarks, Powell struck a cautious tone on the pace of the economic recovery, highlighting that while labor market conditions have improved, they remain far below the levels from before the coronavirus pandemic. He signaled “more fiscal support is likely to be needed” to support the economy, implying that congressional lawmakers would need to step in pass further relief legislation to work alongside accommodative monetary policy.—2:24 p.m. ET: Nasdaq joins S&P 500, Dow in positive territory; Stocks extend gainsThe S&P 500 and Dow extended gains and the Nasdaq turned positive in the wake of the Federal Reserve’s latest monetary policy announcement. The Dow extended its gains to more than 1%, or 290 points, while the S&P 500 jumped 0.6%, or 20 points. The Nasdaq tipped into positive territory with a gain of 0.12%, or 13.38 points.The energy, financials and industrials sectors led gains in the S&P 500.—2:11 p.m. ET: S&P 500, Dow hold onto gains after Fed announcement; Nasdaq remains pressuredThe three major stock indices were little changed following the release of the Federal Reserve’s monetary policy statement Wednesday afternoon. The S&P 500 was up 12.7 points, or 0.4%, as of 2:12 p.m. ET, and the Dow added 234 points, or about 0.8%. The Nasdaq held slightly lower, ticking down 10 points, or less than 0.1%.Treasuries also reacted mutedly to the news. The 10-year yield ticked down by less than 1 basis point to 0.677%, while the two-year yield was unchanged a 0.139%.—1:41 p.m. ET: Stocks trade mixed ahead of Fed decisionThe S&P 500 and Dow held higher while the Nasdaq dipped into negative territory leading up to the Federal Reserve’s September monetary policy statement and remarks from Fed Chair Jerome Powell. Each of Apple, Amazon, Alphabet, Microsoft, Netflix and Facebook shares traded lower during the afternoon session.Here’s a check of the markets, with fewer than 20 minutes to go before the release of the Fed’s monetary policy statement:S&P 500 (^GSPC): +2.74 points (+0.08%) to 3,403.94Dow (^DJI): +165.32 points (+0.59%) to 28,160.92Nasdaq (^IXIC): -55.25 points (-0.49%) to 11,136.91Crude (CL=F): +$1.70 (+4.44%) to $39.98 a barrelGold (GC=F): +$4.60 (+0.23%) to $1,970.80 per ounce10-year Treasury (^TNX): -1.5 bps to yield 0.664%—10:13 a.m. ET: Kodak shares surge as much as 83% after independent review finds company’s actions didn’t violate the law amid US government loan announcementShares of Eastman Kodak (KODK) surged as much as 83% to $11.40 per share on Wednesday before paring some gains, after the company released a report showing its options grant to its CEO and other events that came amid an announcement that the company was to receive a $765 million loan from the US government to manufacture Covid-19 pharmaceutical materials did not violate the law.Kodak’s Board retained the law firm of Akin Gump Strauss Hauer & Feld LLP to conduct the independent investigation and deliver the report. The report did say the firm found governance issues around the announcement of the federal loan, but that none of these violated the law. It included recommendations to update Kodak’s governance and disclosures, like amending the terms of CEO Jim Continenza’s share grants.—10:00 a.m. ET: NAHB Housing Market Index hits a record 83 as housing recovery continues to outperformThe National Association of Home Builders’ (NAHB) September housing market index unexpectedly jumped to a record high of 83, reflecting the ongoing outsized recovery in housing relative to the rest of the US economy. Consensus economists were looking for the index to hold steady at 78 in September from August, according to Bloomberg consensus data.However, a quick run-up in lumber prices is threatening further gains, according to the NAHB.“Lumber prices are now up more than 170% since mid-April, adding more than $16,000 to the price of a typical new single-family home,” NAHB chief economist Robert Dietz said in a statement. “That said, the suburban shift for home building is keeping builders busy, supported on the demand side by low interest rates. In another sign of this growing trend, builders in other parts of the country have reported receiving calls from customers in high-density markets asking about relocating.”—9:31 a.m. ET: Stocks open higherHere were the main moves in markets as of 9:31 a.m. ET:S&P 500 (^GSPC): +11.1 points (+0.33%) to 3,412.3Dow (^DJI): +63.59 points (+0.23%) to 28,059.19Nasdaq (^IXIC): +34.33 points (+0.31%) to 11,227.00Crude (CL=F): +$1.06 (+2.77%) to $39.34 a barrelGold (GC=F): +$15.70 (+0.80%) to $1,981.90 per ounce10-year Treasury (^TNX): -1.6 bps to yield 0.663%—8:30 a.m. ET: Retail sales rise less than expected in August, decelerating for a fourth straight monthUS retail sales rose 0.6% month-on-month in August, according to the Commerce Department’s reported Wednesday. This followed a 0.9% increase in July, which had been downwardly revised from the 1.2% gain previously reported. Consensus economists had been looking for a 1.0% rise in retail sales.While retail sales rose for a fourth straight month in August, the margin of increase has slowed considerably from the record 18.3% jump in May. August’s report marks the first since the expiration of the $600 in enhanced federal unemployment benefits.The total value of retail sales held above pre-pandemic levels in August, after first breaching that threshold in July. Retail sales were 2.6% above August 2019 levels last month.—7:14 a.m. ET Wednesday: Stock futures point to a higher open ahead of Fed decisionHere were the main moves in markets as of 7:14 a.m. ET:S&P 500 (^GSPC): +21.5 points (+0.63%) to 3,426.75Dow (^DJI): +151.00 points (+0.54%) to 28,178.00Nasdaq (^IXIC): +73.5 points (+0.64%) to 11,537.75Crude (CL=F): +$0.93 (+2.43%) to $39.21 a barrelGold (GC=F): +$9.10 (+0.46%) to $1,975.30 per ounce10-year Treasury (^TNX): -1 bp to yield 0.669%—6:05 p.m. ET Tuesday: Stock futures open little changedHere were the main moves in equity markets, as of 6:05 p.m. ET Monday:S&P 500 futures (ES=F): 3,407.25, up 2 points or 0.06%Dow futures (YM=F): 28,042.00, up 15 point or 0.05%Nasdaq futures (NQ=F): 11,473.00, up 8.75 points, or 0.08%Federal Reserve Chairman Jerome Powell, wearing a face mask, testifies before the House of Representatives Financial Services Committee during a hearing on oversight of the Treasury Department and Federal Reserve response to the outbreak of the coronavirus disease (COVID-19), on Capitol Hill in Washington, U.S., June 30, 2020. Tasos Katopodis/Pool via REUTERS—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}