{"article": [{"url": "https://finance.yahoo.com/news/doctor-casts-doubt-on-covid-plasma-treatment-no-breakthrough-here-171309333.html", "published": 1598271680.0, "headline": "Doctor casts doubt on COVID plasma treatment: ‘No breakthrough here’", "body": "Late Sunday night, President Trump announced that the Food and Drug Administration (FDA) authorized emergency use of convalescent plasma to treat COVID-19, the illness caused by the coronavirus.\"Today I am pleased to make a truly historic announcement in our battle against the China virus that will save countless lives,\" President Trump said during a White House press briefing. \"Today's action will dramatically increase access to this treatment.\"However, some health experts have questioned the FDA’s action to issue an emergency use authorization (EUA) and whether or not the organization was pressured by the Trump administration into authorizing the treatment too soon, along with the idea of touting it as a medical breakthrough.U.S. President Donald Trump speaks at a roundtable on donating plasma during a visit to the American Red Cross National Headquarters in Washington, U.S., July 30, 2020. REUTERS/Carlos Barria“The use of convalescent plasma for infections has been around for 100 years,” Dr. Dara Kass, an associate professor of emergency medicine at Columbia University, said on Yahoo Finance’s The First Trade (video above). “There’s no breakthrough here … even with convalescent plasma being used for the coronavirus.“The data that is being used by the FDA to put this EUA through is not strong and really has been manipulated, we think, a little bit just to prove a benefit that actually isn’t even between people that didn’t get plasma but really between people that got it before three days and got it after three days,” she continued.Nurse Practitioner Gabriela Huyke prepares for medical examination of a volunteer for the COVID-19 vaccine study at the Research Centers of America (RCA) in Hollywood, Florida, on August 13, 2020. (Photo by CHANDAN KHANNA/AFP via Getty Images)‘What would they do for a vaccine?’During Sunday’s press briefing, current FDA Commissioner Stephen Hahn denied that the decision came under pressure and said it was made in “independent judgment” of those at the FDA.“Those scientists have concluded that COVID-19 convalescent plasma is safe and shows promising efficacy, thereby meeting the criteria for an emergency use authorization,” Hahn said.Trump claimed during the briefing that convalescent plasma reduced mortality by 35%, although this has proven to be unfounded.According to Dr. Kass, this “brings up some questions about really just where they got that information from and why it meant that there was a huge breakthrough yesterday when in fact nothing had really changed.”Story continuesUS President Donald Trump speaks alongside FDA Commissioner Stephen Hahn (R) and Health and Human Services Secretary Alex Azar during a press conference in the Press Briefing Room of the White House August 23, 2020. (Photo by SAUL LOEB/AFP via Getty Images)Convalescent plasma works by being taken from those who have already recovered from the coronavirus and have the antibodies, and then purified and administered to those currently battling the virus. From there, the body uses those antibodies to fight off the infection. This treatment has been used on more than 70,000 patients so far, with successful results.“Plasma is safe and every study that’s been done has shown that it’s safe,” Kass said. The bigger concern, however, “is that if the administration is interested in bullying the FDA to pass an EUA for the plasma, what would they do for a vaccine? And I think the fact that news came out in less than 12 hours from the EUA for the plasma that there may actually be movement towards a vaccine to do the same thing is concerning. Vaccine development has never been done this fast.”A woman walks inside the Research Centers of America in Hollywood, Florida, on August 13, 2020, which is conducting COVID-19 vaccine trials. (Photo by CHANDAN KHANNA/AFP via Getty Images)A global vaccine raceTrump has openly criticized the FDA for taking too long to authorize treatments and vaccines for COVID-19, even going so far as to accuse them of waiting until after the presidential election.According to the Financial Times, his administration is “considering bypassing normal U.S. regulatory standards” in order to fast track a vaccine developed by AstraZeneca (AZN) in hopes of it being available by Election Day.The deep state, or whoever, over at the FDA is making it very difficult for drug companies to get people in order to test the vaccines and therapeutics. Obviously, they are hoping to delay the answer until after November 3rd. Must focus on speed, and saving lives! @SteveFDA— Donald J. Trump (@realDonaldTrump) August 22, 2020But this could have dangerous consequences, health experts have warned, as vaccines need to be tested in trials to ensure their safety and efficacy. Vladimir Putin, the president of Russia, which has over 954,000 cases and more than 16,000 deaths from the virus, announced that the country would be rolling out billions of doses of a vaccine for the coronavirus, which would mean skipping over trials.“The idea that we could do really what Russia has done, which is to skip the phase 3 trials and just put it into human arms under the idea that’s a benefit either politically or personally to anybody, is actually very concerning to us,” Kass said.And she’s not the only one who has expressed skepticism. Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Disease (NIAID), echoed a similar sentiment.\"I hope that the Russians have actually, definitively proven that the vaccine is safe and effective,\" he told ABC News. \"I seriously doubt that they've done that.\"Cases in the U.S. are down by over 10%. (Graphic: David Foster/Yahoo Finance)While Fauci and Kass, along with many other public health experts, understand the urgency to reopen the economy, they have stressed that in order to fully recover, the virus needs to be dealt with.“The virus needs to be addressed to get the economy back and going,” Kass said. “Without addressing the virus, we can do a lot of Band-Aid measures toward the economy.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Harvard doctor: America 'needs to regroup' to fight coronavirus'We need to be prepared' for coronavirus surges, doctor warnsHow coronavirus ravaged a nursing home industry that was already 'in crisis'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}