{"article": [{"url": "https://finance.yahoo.com/news/bill-ackman-on-spac-pershing-square-tontine-holdings-215319886.html", "published": 1595437280.0, "headline": "Billionaire investor Bill Ackman looks 'to marry a unicorn' with record-breaking SPAC", "body": "The brand new, massive “blank-check” company, led by billionaire activist investor Bill Ackman, is looking to \"marry a unicorn.\"Pershing Square’s Tontine Holdings (PSTH.U) raised an astonishing $4 billion from investors in its record-breaking debut on the New York Stock Exchange on Wednesday. Investors cheered the shares, which ended the first day of trading up 6.5%, closing at $21.30 per share.It’s the latest in a string of special purpose acquisition companies (SPACs). These blank-check companies have been around for years, but garnered more after bringing companies like DraftKings (DKNG), Nikola (NKLA), and Virgin Galactic (SPCE) to the public markets — side-stepping the traditional initial public offering (IPO) route.\"Our thesis is by having a $5 billion cash pile in a public company; it's our own version of a unicorn. It's a one-of-a-kind entity,” Ackman told Yahoo Finance on Wednesday, following Tontine’s floatation.“So, we're looking to marry a unicorn. So we're prettying ourselves up for the most attractive possible partner,\" he added.At one time, the blank-check company model was associated with high risk, in a way that drew both regulatory scrutiny and some controversies.However, Ackman defended the idea of a SPAC a “good one, which is: raise a cash shell, list it on an exchange, and then issue securities to take a private company public.”He added: “It's a much more efficient process, a much less risky process for the private company.\"The 54-year-old investor explained that a typical initial public offering (IPO) could take several months, during which companies are \"under enormous scrutiny\" that can distract from the business's day-to-day operations.\"The alternative with a SPAC is we work quietly with the senior-most people at the company. We learn about the business. We do our due diligence. We enter into a transaction, and the first press release is 'you're done,'\" Ackman said — noting that it minimizes the distraction and uncertainty that comes with an IPO.Story continuesNot his first rodeo with SPACsWilliam 'Bill' Ackman, CEO and Portfolio Manager of Pershing Square Capital Management, speaks during the Sohn Investment Conference in New York City, U.S., May 8, 2017. REUTERS/Brendan McDermidThis isn't Ackman's first foray into the SPAC world.In 2012, he used his shell company Justice Holdings, to buy Burger King and return the burger chain to the public markets. Today, Burger King is part of Restaurant Brands International (QSR) — Pershing Square's biggest equity holding, according to the most recent regulatory filing for the firm.In the coming months, Tontine Holdings will look across four principal areas to pursue a deal, including examining companies that may have been discouraged from going the IPO route. Those have been hit by recent market volatility, or are venture capital-backed businesses with \"significant scale, market share, competitive dominance and cashflow\" that Ackman dubs \"mature unicorns.\"The latter is \"a business that has really attractive economic characteristics: High growth, predictability, they may be investing to take more market share, so it's not generating a lot of cash today, but it's building out a great market position in a business that we understand and like and using technology is going to be an important part of it,” he explained.The other two areas for a potential transaction include private equity-owned, or family-owned businesses.\"COVID has an impact on almost every private equity business. We are an instantaneous $5 billion deleveraging IPO event. And the same is true for a family-owned business,\" Ackman added.Ackman is best known as an activist investor who snaps up large publicly-traded companies and pushes for changes. His investment philosophy has long centered around simple, predictable, cash-flow-generative, dominant companies with high entry barriers.That thesis has been \"reinforced\" by the severity of the COVID-19 pandemic that's disrupted businesses and the economy.\"The world is an uncertain place. It was an uncertain place before we had a pandemic. Unfortunately, it's going to be an uncertain place after we get through this pandemic,\" Ackman said.As such, the new cash shell company will look for businesses \"that can withstand the test of time,” and be “super durable.”He added: “Our job is to figure out what is the super high-quality enduring company that the stock market can close, pandemics can happen, and out the other side, we own a more valuable company.\"So far, it's a strategy paying off for Ackman's hedge fund business. The nearly $11 billion Pershing Square Capital's publicly-traded vehicle, Pershing Square Holdings, is up 34.7% as of Tuesday, far outpacing the broader market.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Palihapitiya: Skip government bailouts, put ‘more money into the hands of consumers’Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investorsBillionaire Palihapitiya on the phenomenon of ‘spectacular’ AOC"}]}