{"article": [{"url": "https://finance.yahoo.com/news/rent-growth-hits-lowest-level-in-about-6-years-181457217.html", "published": 1596547340.0, "headline": "Rent growth hits lowest level in about 6 years", "body": "Rent barely rose in July from a month earlier — only 0.1%.The median listing price for apartments on the market is up only 0.2% this year, the smallest January-to-July gain since at least 2014 when Apartment List began the monthly study, according to the company’s July 2020 median rent price report.“The national rent index hasn’t grown since the beginning of the pandemic, when this normally would be considered peak rental season, when rent growth is usually at its fastest. The fact that rent is dipping this time of year is unusual,” said Chris Salviati, housing economist at Apartment List.The fact that rent is dipping this time of year is unusual,” said Chris Salviati, housing economist at Apartment List.Declining demand for pricey rentals caused gains to underperform. A third of Americans say they are less likely to move due to the pandemic, and of those who are moving, one-fifth say it’s because they need to find a more affordable apartment, according to an Apartment List survey of 4,000 Americans on July 3.“We are seeing an unprecedented spike in unemployment. Folks are facing sudden and unexpected financial hardship.” said Salviati. “The most common reason people are moving is because they need to find more affordable housing than where they’re currently living.”Expensive markets and areas driven by tourism economies continued to see large rent declines in July. San Francisco asking rent has dropped 1.1% in July from a month earlier and is down 3.3% since March. And New York asking rent in July dropped 1% and 2.8% from June and March, respectively. San Jose and Miami also saw July asking rent drop more than 2% since March, each losing 0.5% and 0.3% in July from June, respectively.“You see people within the market moving from desirable downtown areas and moving further afield… We are seeing migration out of pricey areas while mostly staying within local territories,” said Anthemos Georgiades, CEO of Zumper, a San Francisco-based rental listing website.Meanwhile, rent prices in small, inexpensive cities have risen faster than average. In Henderson, Nevada, asking rent for a one-bedroom climbed 5.4% in July from June, and in Tulsa, Okla. one-bedroom asking rent increased 5.1% in July, according to Zumper.Story continues“Rent increases are mainly because of the increase in demand for smaller cities. People have at least made medium-term decisions… They are spending a year living near their families out of state — especially younger folks without kids in school,” said Georgiades.July marks the first month when rent prices rose since March, when the pandemic hit the U.S. But the rental market is entering its slow season in the fall and winter, so rent prices are not likely to continue to increase as they did in July, said Salviati.“It’s starting to look like the sharp V-shaped recovery is less and less likely. It may be more of a long drawn out recovery, as folks struggle with unemployment for a decent amount of time. So we may continue to see some softness in the market,” Salviati said.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Now average Americans can invest in real estate through this new partnershipFormer MGM CEO Jim Murren lists desert mansion for $10.5 million22 million Americans delayed buying a home during the coronavirus: Bankrate"}]}