{"article": [{"url": "https://finance.yahoo.com/news/wall-street-q4-gdp-estimates-falling-morning-brief-095639758.html", "published": 1601355860.0, "headline": "Wall Street's GDP forecasts keep falling: Morning Brief", "body": "Tuesday, September 29, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeBut lower growth might not be bad for stocks.Wall Street economists continue to slash expectations for fourth quarter growth.In a note to clients published Sunday, Ellen Zentner and the economics team at Morgan Stanley lowered their fourth quarter GDP forecast to annualized growth of 3.5%, down from 9.3%. For the full-year 2020, Morgan Stanley now expects the economy will contract 2.7%, more than the 1.5% forecasted previously.And this move followed downgrades to growth from JPMorgan and Goldman Sachs last week. JPM now sees fourth quarter growth coming in at 2.5% with the economy contracting 4.2% in 2020. Goldman expects the economy will grow at a 3% clip in the fourth quarter and contract by 3.5% for the full-year 2020.All three firms targeted the same culprit: a lack of new fiscal stimulus.Though in cutting these outlooks for growth, all three firms acknowledge that it does seem a better-than-feared dynamic has come to pass for consumer spending and the state of household balance sheets.And with stocks entering the best three months of the year over the last decade on Thursday — the median return for the S&P 500 (^GSPC) from October through December is 7.86% during the last 10 years, according to data from Bespoke Investment Group published Monday — the surprising durability of this recovery bears close watching for investors.“We estimate that the withdrawal of fiscal support will reduce disposable income in Q4 to roughly the pre-pandemic level,” Goldman economists led by Jan Hatzius said last week.“This will weigh on consumer spending, but probably by less than initially feared. Seven weeks after unemployment benefits lapsed, timely spending measures have trended higher, reflecting an offset from ongoing adaptation and reopening in the service sector.”“Diminishing fiscal support will test the resilience of the economic recovery,” Morgan Stanley said Sunday, “but we continue to believe that there has been enough progress in the recovery and that there is a enough momentum in underlying activity to keep the U.S. economy on pace to return to pre-Covid levels of real GDP by the middle of next year.”Story continuesIn a note to clients published Monday, Neil Dutta at Renaissance Macro argued that the pace of the recovery slowing down is more about the recovery moving past the initial snapback phase than it is a sign of exhaustion for the economy’s growth drivers.The strength of the housing market, consumption rising faster than production, and recent developments on rapid COVID testing all suggest in Dutta’s view a case for optimism about America’s economic future rather than the pessimism embedded in outlines of a moderating economy.“Some have noted that the lack of additional fiscal action has left the economy out in the cold,” Dutta writes.“Federal Reserve officials have been among those calling for more government spending to speed up the recovery. While additional spending would certainly be helpful for the economy, we’re skeptical the market needs stimulus to advance. After all, policy has tightened, the odds of additional action have been waning for weeks now, and during that time consumption has strengthened.”All of which echoes what the Morning Brief wrote last week — no stimulus, no problem so far for the U.S. consumer.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Advance Goods Trade Balance, August (-$81.8 billion expected, -$79.3 billion in July)8:30 a.m. ET: Wholesale Inventories, August month-on-month preliminary (-0.1% expected, -0.3% in July)8:03 a.m. ET: Retail Inventories, August month-on-month (1.2% in July)9:00 a.m. ET: S&P CoreLogic Case-Shiller 20-City Composite Home Price Index, July month-on-month (0.1% expected, 0.00% in June)9:00 a.m. ET: S&P CoreLogic Case-Shiller 20-City Composite Home Price Index, July year-on-year (3.6% expected, 3.46% in June)10:00 a.m. ET: Conference Board Consumer Confidence, September (90.0 expected, 84.8 in August)EarningsPre-market6:30 a.m. ET: McCormick & Co. (MKC) is expected to report adjusted earnings of $1.52 per share on revenue of $1.39 billionPost-market4:00 p.m. ET: Micron Technology (MU) is expected to report adjusted earnings of 99 cents per share on revenue of $5.90 billionTop NewsEuropean markets open weaker as key Brexit talks begin [Yahoo Finance UK}World tops 1 million coronavirus deaths [Yahoo Finance]House Democrats unveil new $2.2T proposal for virus aid [AP]Palantir eyes $22B market debut — here's what the secretive big-data firm does [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSTuesday’s debate could determine whether Trump’s taxes matter on Election DayFed survey: Racial wealth gaps little changed since 2016Has your bank lowered your savings rate? Just get another bank account — or three—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}