{"article": [{"url": "https://finance.yahoo.com/news/a-surprising-group-of-homeowners-have-paid-off-their-mortgages-164231580.html", "published": 1593172220.0, "headline": "A surprising group of homeowners have paid off their mortgages", "body": "Surprisingly, mortgage-free living is more common for homeowners who make less than $25,000 a year.Mortgage delinquencies surged to its highest rate since 2011 in June — but some Americans didn’t have to worry about mortgage payments at all during the novel coronavirus pandemic.Some 38% of owner-occupied households in the U.S. are completely paid off, and mortgage-free homeownership is even higher among low-income families and in small cities with low housing costs, according to a new study by Construction Coverage, a Los Angeles-based construction content website.“Lower-income families are more likely to have their mortgages paid off but if they don’t have it paid off, they are really feeling that impact, particularly those who have jobs in the hospitality and retail industry,” said Kyle Fretwell, founder of Lattice Publishing, which commissioned the study.Surprisingly, mortgage-free living is more common for homeowners who make less than $25,000 a year. Some 54.5% of low-income Americans have paid off their homes, outpacing the national average by 16.5 percentage points, although they are less likely to own a home overall, according to the study. Meanwhile, homeowners with a six-figure salary tend to face higher mortgage payments relative to their income.“San Francisco may pay higher salaries, but home prices are more expensive relative to those incomes, so a mortgage is harder to pay off,” said Fretwell. “Plus, banks are more likely to give big loans to applicants with higher income levels. So the more debt you can take on, the harder it is to pay off a mortgage.”Homeowners with mortgages have higher household incomes but also higher housing costs. Graphic by Construction Coverage based on Census data.Local housing costs make a differenceFamilies are considered “burdened” by housing costs when they exceed a third of a family’s income. In areas where more mortgages are paid off, housing costs represented a smaller portion of households’ average incomes.Small- and mid-sized metro areas outperformed the average. In mid-sized metro areas with under 350,000 residents, like Odessa, Texas and Charleston, West Virginia, 49.2% and 47.5% of homes are paid off, respectively. Housing costs represented only 16% of income in each city, about half of the threshold to be considered burdened by housing costs.Story continuesAnd mid-sized metro areas with fewer than 1 million residents, like McAllen, Texas and Brownsville, Texas, had 49.6% and 47.9% of homes paid off, respectively. Housing costs were only about 20% for each metro.But in large metros with over 1 million residents, fewer homeowners have paid off their home. New Orleans, Detroit, Houston and San Antonio are the only large cities with at least 30% of owner-occupied homes paid off — still falling short of the national average by as many as 8 percentage points. These major cities rose to the top because housing costs were only 20% of average income (except Detroit where housing costs are only 17.7%).“Home prices [and thus, mortgage payments] are lower in areas with mortgage-free homeownership. That’s the strongest indicator,” said Fretwell.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Rent is getting cheaper in big citiesHouses for sale will be ‘gobbled up’: Barbara CorcoranWe are headed to a V-shaped housing recovery: expert"}]}