{"article": [{"url": "https://finance.yahoo.com/news/apples-blowout-quarter-a-sign-of-whats-to-come-for-i-phone-maker-wedbush-analyst-181049100.html", "published": 1596201500.0, "headline": "Apple's 'blowout quarter' a sign of what's to come for iPhone maker: Wedbush analyst", "body": "Apple ‘s (AAPL) “massive home-run type quarter” is a drumroll for whats to come from the iPhone maker, says Wedbush analyst Dan Ives.“To me this was really a massive blowout quarter,” Ives told Yahoo Finance’s The First Trade.“In my opinion, by the end of this year, this is a $2 trillion market-cap [company],” said Ives, pointing to the iPhone 12 release this fall, even if it is delayed “a few weeks.”Ives raised his price target on Apple to $475, maintaining a bull case price target of $550.On Friday shares of Apple surged to intraday all time highs, after crushing expectations for its 3rd quarter of 2020, and an announcement of a 4-for-1 stock split.“That was a smart strategic move, especially from a retail perspective. And I think this is something that is going to be followed by other tech companies,” said Ives.Apple has almost $200 billion on cash, which Ives says will be used for more share buybacks and eventually, an acquisition.“I still do believe that they buy a studio for their streaming business in the next 3-6 months,” said Ives. He believes Apple could be eying Lionsgate, MGM, or Sony Studios.“Those are the ones to me that fit the bill and check every box. Look at streaming and content. That’s the thing, they built a mansion, but they just don’t have furniture in terms of content.”Amazon CEO Jeff Bezos testifies before the House Judiciary Subcommittee on Antitrust, Commercial and Administrative Law hearing on \"Online Platforms and Market Power\" in the Rayburn House office Building on Capitol Hill in Washington, DC on July 29, 2020. (Photo by MANDEL NGAN / POOL / AFP) (Photo by MANDEL NGAN/POOL/AFP via Getty Images)Facebook (FB) and Amazon (AMZN) also soared on Friday after beating expectations. Amazon posted a record profit as people stayed and shopped at home.“Amazon right now, they’re seeing massive tailwinds in e-commerce as well as cloud. Right now it’s really their world and everyone else is paying rent in terms of e-commerce,” said Ives.The better-than-expected earnings came on the heels of anti-trust congressional hearings a day earlier.“I think it’s just got for Bezos ... that they did the regulatory hearings the day before earnings and not the day after earnings, just giving these types of numbers,” said Ives.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreStory continuesBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}