{"article": [{"url": "https://finance.yahoo.com/news/business-leaders-tech-ce-os-bash-trumps-visa-suspension-213127900.html", "published": 1592930360.0, "headline": "Business leaders, tech CEOs bash Trump's visa suspension", "body": "CEOs of some of the nation’s largest tech companies, along with other business leaders, are slamming the Trump administration’s decision to suspend many foreign work visas.President Trump signed an order on Monday that will block certain visas for hundreds of thousands of people looking to work in the United States through the end of the year. The order includes the H-1B visa — which many tech companies rely on to hire highly skilled workers. (The U.S. caps the number of H-1B visas at 85,000 per year.) Some H-2B, H-4, L and J visas are also included in the suspension.The order also extended an existing suspension of most green cards.“We want to give jobs to Americans right now,” said Trump when asked about the green card decision on Tuesday afternoon.The administration says the goal is to free up jobs for Americans, as tens of millions of people remain unemployed due to the coronavirus pandemic. A senior administration official said the immigration crackdown will preserve about 525,000 jobs for Americans, but the business community argues the move will hurt the U.S. economy in the long run.The U.S. Chamber of Commerce called the order a “severe and sweeping attempt to restrict legal immigration.”“Putting up a ‘not welcome’ sign for engineers, executives, IT experts, doctors, nurses and other workers won’t help our country, it will hold us back. Restrictive changes to our nation’s immigration system will push investment and economic activity abroad, slow growth, and reduce job creation,” said U.S. Chamber CEO Thomas Donohue in a statement.The Internet Association — whose members include Amazon, Facebook, Google, Uber and many others — focused on the H-1B visa suspensions.“IA condemns the administration’s latest executive order that will limit the number of high-skilled foreign workers from entering the country through the end of the year,” said IA Director of Social Impact Sean Perryman. “The diverse and accomplished H-1B visa holders in the U.S. create American jobs and help our economy grow. All industries benefit from a visa system that allows U.S. companies to attract the best and brightest no matter where they’re from.”Story continuesThe leaders of several companies spoke out individually as well.AlphabetSundar Pichai — CEO of Alphabet and its subsidiary, Google (GOOG) — tweeted that he was “disappointed” by the proclamation and that “Immigration has contributed immensely to America’s economic success, making it a global leader in tech, and also Google the company it is today.”Immigration has contributed immensely to America’s economic success, making it a global leader in tech, and also Google the company it is today. Disappointed by today’s proclamation - we’ll continue to stand with immigrants and work to expand opportunity for all.— Sundar Pichai (@sundarpichai) June 22, 2020YouTube CEO Susan Wojcicki agreed with Pichai, saying via Twitter, “Immigration is central to America's story, and it's central to my own family's story. My family escaped danger and found a new home in America. @sundarpichai is right - at @YouTube, we join Google in standing with immigrants and working to expand opportunity for all.”AppleApple (AAPL) CEO Tim Cook also said he was “deeply disappointed” in the order. “Like Apple, this nation of immigrants has always found strength in our diversity, and hope in the enduring promise of the American Dream. There is no new prosperity without both,” Cook tweeted.Tesla“Very much disagree with this action. In my experience, these skillsets are net job creators,” tweeted Tesla (TSLA) CEO Elon Musk.Musk went on to say that while visa reform makes sense, the Trump administration’s action was “too broad.”In addition to the suspensions, the administration said it is moving to make permanent changes to the H-1B visa — moving away from a lottery system, to prioritizing applicants with the highest salary offers. A senior administration official said the changes will drive up the wage and skill level of immigrants.SpaceX founder Elon Musk after watching the successful launch of a Falcon 9 rocket with the Crew Dragon spacecraft from pad 39A at the Kennedy Space Center. (Photo by Paul Hennessy/SOPA Images/LightRocket via Getty Images)AmazonAmazon (AMZN) received the most new H-1B visa approvals of any company last year, according to U.S. Citizen and Immigration Services.“Amazon opposes the Administration’s short-sighted decision to pause high-skill visa programs. Welcoming the best & the brightest global talent is critical to America's economic recovery. We will continue to support these programs & efforts to protect the rights of immigrants,” the company said on its policy Twitter account.Twitter“This proclamation undermines America’s greatest economic asset: its diversity. People from all over the world come here to join our labor force, pay taxes, and contribute to our global competitiveness on the world stage,” said Jessica Herrera-Flanigan, Twitter’s (TWTR) VP or Public Policy and Philanthropy on the company’s public policy Twitter account.\"Unilaterally and unnecessarily stifling America’s attractiveness to global, high-skilled talent is short-sighted and deeply damaging to the economic strength of the United States,” she added.FacebookIn statement, a Facebook (FB) spokesperson said the proclamation will make the U.S. economic recovery even more difficult.“America is a nation of immigrants and our economy and country benefit when we encourage talented people from around the world to live, work, and contribute here. That’s more true now than ever. Highly-skilled visa holders play a critical role in driving innovation – at Facebook and at organizations across the country – and that’s something we should encourage, not restrict,” said the spokesperson.MicrosoftBrad Smith, president of Microsoft (MSFT), said in part, “Immigrants play a vital role at our company and support our country at a time when we need them most.”Now is not the time to cut our nation off from the world’s talent or create uncertainty and anxiety. Immigrants play a vital role at our company and support our country’s critical infrastructure. They are contributing to this country at a time when we need them most.— Brad Smith (@BradSmi) June 23, 2020Despite the opposition from the business community, the order is set to go into effect on June 24 and last through the end of the year.Yahoo Finance asked the White House for a response to the backlash, but has not yet received a comment.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:New bill would allow small businesses to get second PPP loanACLU sues to stop SBA from denying PPP loans to people with criminal recordsCoronavirus oversight panel Democrats ask banks for info, docs on PPP loansSen. Menendez: May jobs report surprise ‘isn't solace' to unemployed workersFed, Treasury have failed to protect jobs so far: oversight panel member"}]}