{"article": [{"url": "https://finance.yahoo.com/news/jeffrey-gundlach-warns-on-retail-investor-boom-during-covid-lockdown-213307360.html", "published": 1591807280.0, "headline": "Gundlach: Retail investor boom during coronavirus crisis 'unnerving,' may be stimulus driven", "body": "Billionaire bond investor Jeffrey Gundlach believes the retail investor boom is \"unnerving\" given the ongoing coronavirus crisis, but it may help explain the historic rally in recent weeks that's left institutional investors on the sidelines.\"There's something really unnerving that's going on in this rally,” which hit its trough on March 23, Gundlach said on Tuesday during a webcast for the DoubleLine Total Return Bond Fund (DBLTX). “And that seems to be driven by a lot kind of rampant speculation.\"The investor pulled up a chart showing retail investor behavior from Robinhood — the free trading app popular amongst millennials. The data showed a spike in investor accounts during COVID-19 pandemic lockdowns. Elsewhere, online brokerage accounts from E-Trade and Interactive Brokers have also seen an explosion in new users during lockdowns.As it happens, the rise in new accounts coincides with the government stimulus checks sent out as part of the CARES Act. The 60-year-old bond king speculated that \"maybe some of these people who are locked down are getting checks from the government maybe are throwing them in the stock market.\"DoubleLince Capital CEO Jeffrey Gundlach highlighted the retail investor boom as 'unnerving,' during his most recent webcast for the DoubleLine Total Return Bond Fund.One of the reasons theses newbie investors might be able to do that is through exchange-traded funds (ETFs) offering \"smaller and smaller bites of stock trading.\"According to Gundlach, this phenomenon may help explain the recent outperformance of the U.S. stock market — especially tech stocks, which have soared in the wake of the Nasdaq’s first close above 10,000 on Wednesday.The boom has been driven by what the investor dubbed the \"Super 6,\" which consists of Facebook (FB), Amazon (AMZN), Apple (AAPL), Alphabet (GOOGL), Netflix (NFLX), and Microsoft (MSFT). Absent those stocks, the S&P 500 over the last five years is up only about 12%, he estimated.These online brokerages and apps \"are making it available to the so-called 'little guy,' and it sure seems like they're taking advantage of it. And I think if you're a little guy that's not done that much in the stock market, maybe that's one of the reasons why the 'Super 6' have been outperforming by so much. They're probably finding their way into newbie portfolios,\" he added.Story continuesGundlach referenced money flow studies on equities that show institutional money hasn't been entering this market.\"There are two ways of looking at that. You could say, 'Well, they might come back,' and that could be buying impetus, and that is a plausible idea,” he said.“And there's the other side of it, where they say, 'It sounds like the big experienced smart money is skeptical of this little guy created epic rally,' which has brought the mood towards stocks,\" the investor added.Gundlach expected the rally for the S&P 500 to \"peter out\" around 2,900 — but it's gone about 10% higher than that level.\"I'm happy to watch other people push it higher from this valuation level,\" he added.During his last \"just markets\" webcast, Gundlach predicted the S&P 500 would \"take out\" the lows reached in mid-March sometime in April. At the end of Tuesday's webcast, Gundlach put the stock market's probability of taking out the March lows at 76.8% by the 2020 election, \"to facetiously put a fine point on it,\" he said.Julia La Roche is a Correspondent at Yahoo Finance. Follow her on Twitter. Mark Cuban proposes 'use it or lose it' debit card as coronavirus stimulusMark Cuban (probably) won't run for president, but here's what he'd do if he wonGundlach: A ‘wave’ of layoffs is coming for $100,000 white-collar jobs"}]}