{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-fda-authorizes-convalescent-plasma-spurring-concerns-over-vaccine-approvals-150300379.html", "published": 1598263880.0, "headline": "Coronavirus update: FDA authorizes convalescent plasma, spurring concerns over vaccine approvals", "body": "The U.S. Food and Drug Administration (FDA) approval of an emergency use authorization (EUA) for convalescent plasma as a treatment for COVID-19 patients has stoked fears among some observers that the White House may pressure the agency to authorize a vaccine before the November 3 election.On Sunday, U.S. Health and Human Services (HHS) Sec. Alex Azar and FDA Commissioner Stephen Hahn cited positive statistics that showed a 35% reduction in mortality through the use of convalescent plasma from a non-peer-reviewed study.“The data we gathered suggests that patients who were treated early in their disease course, within three days of being diagnosed, with plasma containing high levels of antibodies, benefited the most from the treatment,” Azar said.“We dream in drug development of something like a 35 percent mortality reduction. This is a major advance in the treatment of patients,” he added.But Dr. Howard Koh, former HHS assistant secretary and professor of public health at Harvard, told Yahoo Finance that the portrayal of the statistic is incorrect. Where Hahn claimed a 35 in 100 improvement, the number is more like 3 in 100, based on the Mayo Clnic data.“I think the announcement was way too premature. It shakes the confidence of the medical community about the rigor of the FDA’s decision-making process right now,” Koh said, adding that even as recently as a couple of days ago, there was tremendous internal debate from experts like NIH director Francis Collins and NIAID director Dr. Anthony Fauci about whether or not to approve the treatment.“This study from Mayo Clinic was not and is not intended to be a clinical trial. That comes from their own internal descriptions,” he said.The move comes as the coronavirus crisis continues to escalate, raising the urgency for effective treatments and cures. While a significant find, experts point that it was not from studies which had a placebo control group— the gold standard for medical professionals to consider using new treatments.Story continuesMoreover, health experts are worried politics is at play, since it’s the third EUA for a treatment issued by the FDA this year. The other two were for Gilead Science’s (GILD) remdesivir— which is still being used— and hydroxychoroquine, which was eventually revoked.Dr. Dara Kass, a Yahoo Finance contributor and an emergency medicine doctor at Columbia University, said on Monday that the use of convalescent plasma has been in use for decades, insisting “there’s no breakthrough here.”Raising questions about how the data was used, she suggested the administration was “bullying” the FDA, raising questions about how that would affect vaccine development, which could yield a breakthrough by year’s end.Koh echoed similar sentiments, saying, “What this announcement does is raises a lot of red flags about the future vaccine.”Cases in the south are beginning to subside. (Graphic: David Foster/Yahoo Finance)‘Not the same as approval’President Donald Trump touted the treatment Sunday, saying that the FDA has “made the independent decision” to authorize the plasma, and that his administration “cleared the logjam” to approving it in the past week, even as he insisted the decision had “nothing to do with politics.”Hahn explained that like remdesivir, the authorization is a legal route for the FDA to expand use and access to the treatment, even as more data is being collected.“This is not the same as an approval,” he said, adding that the data he has seen is significant.“There was a really good rationale for why this might work. We are waiting for more data, we’re going to continue to gather data, but this clearly meets the data we’ve established” for an EUA, Hahn said.Convalescent plasma is taken from recovered patients, relying on the antibodies they have built up to help patients still battling the virus. The FDA granted expanded access and federal funding helped support the program at Mayo Clinic in April. To-date, more than 100,000 individuals have enrolled, with more than 70,000 having received treatment, according to Hahn.Questions about who is donating, and how long after recovery, add uncertainty to the quality of the supply, and much is still unknown about the long-lasting effects of antibodies, according to experts.Dr. Kevin Tracey, president and CEO of the Feinstein Institutes for Medical Research at Northwell Health, told Yahoo Finance Monday that while more than 600 individuals have received plasma treatment at the New York health system, the data is still unknown.But moving forward, without a placebo arm already in place, it is unlikely clinical trials will see robust enrollment, because the patients can opt to directly have access rather than sign up for the 50% chance of receiving the treatment.“That happened to remdesivir and hydroxychloroquine, and now it happened to convalescent plasma,” Tracey said.The World Health Organization also expressed its concern, with chief scientist Dr. Soumya Swaminathan saying the treatment is still experimental.Vaccine approval fearsThe weekend move by the Trump administration is raising concerns about the vaccine race, despite repeated assurances from the FDA to wait until a vaccine is proven safe and effective.A rising number think Trump may pressure the FDA to do so before November 3. Some companies are expected to provide early read-outs of the clinical trials results by September and October, but a full regulatory review is still required.Financial Times reported that the White House is trying to push for an early authorization for AstraZeneca’s (AZN) vaccine candidate with Oxford University.Dr. Peter Marks, the FDA’s leading vaccine expert, recently said he would resign if the FDA approves an unproven vaccine.So far, AstraZeneca, Moderna (MRNA), and Pfizer (PFE) with BioNTech (BNTX) are the leaders among developed countries, with Phase 3 trials testing 30,000 participants. Johnson & Johnson (JNJ) recently announced the largest trial expected to start next month of 60,000 participants.Novavax (NVAX) announced it is entering Phase 2 trials for an older population, to study its vaccine candidate. That is in addition to an existing Phase 2 trial on 18-55 year olds being conducted in South Africa.The two trials are focused on testing the vaccine for safety, after which the company can enter Phase 3 to test on a larger population, and study the effectiveness and durability of the vaccine.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}