{"article": [{"url": "https://finance.yahoo.com/news/manufacturing-ism-pmi-v-shape-recovery-morning-brief-101337148.html", "published": 1599024080.0, "headline": "Manufacturing data points to a V-shape recovery: Morning Brief", "body": "Wednesday, September 2, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeNow the hard part begins.The manufacturing sector is on track for a V-shaped recovery.And now the challenge is sustaining the activity.On Tuesday, data from IHS Markit and the Institute for Supply Management (ISM) both showed the sharp rebound in the U.S. manufacturing sector continued in August.In August, the ISM’s purchasing managers’ index (PMI) stood at 56, a level indicating expansion in activity within the manufacturing sector and the third straight month of a reading above 50. Readings above 50 indicate expansion in the sector; readings below 50 indicate contraction.Tim Fiore, chair of the ISM’s business survey committee, said Tuesday that August marked “the first full month of operations after supply chains restarted and adjustments were made for employees to return to work.” And while sentiment among respondents was positive, optimism was slightly lower than what the survey indicated in July.IHS Markit’s PMI came in at 53.1 in August, the highest reading for the index since January 2019, with employment, new orders, and exports all rising notably last month.IHS Markit's gauge of manufacturing activity rose to its highest level since January 2019 in August as the manufacturing sector continues to heal after a shutdown in the spring. (Source: IHS Markit)“Encouragingly, new order inflows improved markedly, outpacing production to leave many companies struggling to produce enough goods to meet demand, often due to a lack of operating capacity,” said Chris Williamson, the chief business economist at IHS Markit.“Backlogs of uncompleted work consequently rose at the fastest rate since the early months of 2019, encouraging increasing number of firms to take on more staff.”Both the IHS and ISM reports indicated sharp drawdowns in inventories as new orders surge and production struggles to keep up with demand. Though this demand is still rising from extremely depressed levels. In April, for instance, new orders fell by the most in a single month since 1951, according to the ISM’s data.The recovery is also not evenly distributed across industries, a theme playing out in the stock market, in our hometowns, and across almost all areas of the economy. One respondent in the transportation equipment industry told the ISM that airlines remain under “great pressure,” while an executive in the paper products industry said, “We are starting to see parts of our business rebound in August, while other parts remained weak. Some of our export business has come back for the first time since the start of COVID-19; however, domestic portfolios remain mixed.”Story continuesAnd how quickly the sector can continue this expansion amid supply constraints, labor constraints, and inventory constraints, however, will be a challenge through the fall.“We expect that ongoing coronavirus-related headwinds will constrain the manufacturing sector’s recovery to only a modest pace going forward,” said Oren Klachkin, lead U.S. economist at Oxford Economics.“With the boost from re-openings now mostly in the past, manufacturers have largely matched activity to meet the current weak state of demand, but won’t meaningfully ramp up production until the virus threat is fully contained. Looking ahead, feeble domestic and external demand, lingering supply chain disruptions, weaker energy activity and broad-based uncertainty will plague manufacturing’s recovery until a health solution is found.”And it is again worth noting that both of these indexes are registering expansionary growth from low baselines after a collapse in activity during March and April.But even with challenges ahead and recent comparisons flattering these indexes, the manufacturing sector is another part of the economy where a V-shape recovery is taking hold. At least in the early stages of this bounce-back.In the retail sector, for instance, sales were back to pre-COVID levels by June. And the housing market has been on fire all summer after a very brief pause in the spring.With manufacturing suggesting that the ice continues to thaw across the U.S. and global economy.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7 a.m. ET: MBA Mortgage Applications, ending August 28 (-6.5% prior week)8:15 a.m ET: ADP Employment Change, August (1 million expected, 167,000 in July)10 a.m. ET: Factory Orders, July (6.0% expected, 6.2% June)10 a.m. ET: Factory Orders Ex Trans, July (4.4% in June)10 a.m. ET: Durable Goods Orders, July final (11.2% expected, 11.2% in June)10 a.m. ET: Durables Ex Transportation, July final (2.4% expected, 2.4% in June)2 p.m. ET: Federal Reserve releases Beige BookEarningsMacy’s (M) is expected to report adjusted earnings loss of $1.85 per share on $3.4 billion in revenue4:05 p.m. ET: CrowdStrike (CRWD) is expected to report adjusted earnings loss of 1 cent a share on about $188.5 million in revenueTop NewsEuropean stocks climb as US Treasury Secretary calls for new stimulus [Yahoo Finance UK]Algorithm question complicates TikTok sale: WSJ [AP]Dating app Bumble preparing for $6 billion-plus IPO [Bloomberg]Federal Reserve: We got it ‘wrong’ on post-crisis rate hikes [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSThe Trump payroll tax break you won’t see on your paycheckApple analyst says record-breaking share price rally is about 'MOMO' not 'FOMO'Zoom stock has surged nearly 400% — is it time to buy, hold or run away?—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}