{"article": [{"url": "https://finance.yahoo.com/news/moderna-phase-1-results-show-210000747.html", "published": 1594742900.0, "headline": "Moderna Phase 1 results show coronavirus vaccine safe, induces immune response", "body": "By Julie SteenhuysenCHICAGO, July 14 (Reuters) - Moderna Inc's experimental vaccine for COVID-19 showed it was safe and provoked immune responses in all 45 healthy volunteers in an ongoing early-stage study, U.S. researchers reported on Tuesday.No study volunteers experienced a serious side effect, but more than half reported mild or moderate reactions such as fatigue, headache, chills, muscle aches or pain at the injection site.These were more likely to occur after the second dose and in people who got the highest dose, the team reported in the New England Journal of Medicine.Moderna was the first to start human testing of a vaccine for the novel coronavirus on March 16, some 66 days after the genetic sequence of the virus was released.Experts say a vaccine is needed to put an end to the pandemic that has sickened millions and caused nearly 575,000 deaths worldwide.\"The world urgently needs vaccines to protect against COVID-19,\" said Dr Lisa Jackson of Kaiser Permanente Washington Health Research Institute in Seattle and lead author of the study.The federal government is supporting Moderna's vaccine with nearly half a billion dollars and has chosen it as one of the first to enter large-scale human trials. A successful vaccine could be a turning point for Cambridge, Massachusetts-based Moderna, which has never had a licensed product.Moderna's shot, mRNA-1273, uses ribonucleic acid (RNA) - a chemical messenger that contains instructions for making proteins. When injected into people, the vaccine instructs cells to make proteins that mimic the outer surface of the coronavirus, which the body recognizes as a foreign invader, and mounts an immune response against.The results released on Tuesday involved three doses of the vaccine, tested in groups of 15 volunteers aged 18-55 who got two shots, 28 days apart. The groups tested 25, 100 or 250 micrograms of the vaccine.The team reported that individuals who got two doses of the vaccine had high levels of virus-killing neutralizing antibodies that exceeded the average levels seen in people who had recovered from COVID-19.Story continuesAdverse events after the second dose occurred in seven of the 13 volunteers who got the 25-microgram dose, all 15 participants who received the 100 microgram dose and all 14 who got the 250 microgram dose. In the highest-dose group, three patients had severe reactions such as fever, chills, headache or nausea. One of these had a fever of 103.28 Fahrenheit (39.6 C).\"We didn't see any events that are characterized as serious adverse events,\" Jackson said, referring to reactions that require hospitalization or result in death.In June, Moderna said it selected the 100-microgram dose for its late-stage study to minimize adverse reactions.At that dose, Moderna said the company is on track to deliver about 500 million doses per year, and possibly up to 1 billion doses per year, starting in 2021, from the company's internal U.S. manufacturing site and strategic collaboration with Swiss drugmaker Lonza.\"It's a good first step,\" said Dr William Schaffner, a vaccine expert at Vanderbilt University Medical Center who was not involved in the study.\"There's nothing here that would inhibit one from going ahead to the Phase 2/Phase 3 trials,\" he said. \"A little fatigue and headache and myalgia (muscle pain) and pain at the injection site is a small price to pay for protection against COVID-19.\"In April, Moderna expanded the Phase 1 trial to include adults over 55, who are more at risk of serious disease, with the aim of enrolling 120 volunteers. Moderna said it will follow study volunteers for a year after the second shot, to look for side effects and check how long immunity lasts. (Reporting by Julie Steenhuysen in Chicago Editing by Matthew Lewis)"}]}