{"article": [{"url": "https://finance.yahoo.com/news/a-president-joe-biden-would-be-brutal-for-the-stock-market-for-this-simplest-reason-161252467.html", "published": 1594380020.0, "headline": "A president Joe Biden would be brutal for the stock market — for this simplest reason", "body": "Higher corporate taxes, more regulation and a potentially less friendly Federal Reserve are among the list of reasons stock market pros are down on a hypothetical president Joe Biden.“I don’t want to say Biden is anti-business. But we think a Biden victory puts a lot of pressure on the stock market relative to things he has been saying,” AdvisorShares CEO Noah Hamman said on Yahoo Finance’s The First Trade. Hamman doesn’t disagree with one projection from a source Yahoo Finance talked with that a Biden win in November could send the stock market spiraling 25% lower.Says Hamman about that forecast, “That number doesn’t surprise me. I’m not shocked by that number. Some of it is a function of when they’re in office — what they do versus what they say they’re going to do. Right now the various Fed programs we have in place that the administration has been backing it produces liquidity for the marketplace. So if that policy is going to change a little bit, a 25% decline is not an unreasonable expectation.”Former vice president Biden did his part this week to rile up the market bulls that have raced up and down Wall Street in recent months.Unveiled on Thursday, Biden’s “Build Back Better” economic revival plan is in line with many traditional Democratic efforts around expanded social safety nets and infrastructure investments. The plan — which veers more left-leaning than some experts anticipated — devotes about $400 billion to expanding clean vehicle technology, steel production and other building materials. He is also eyeing $300 billion for investments in 5G and artificial intelligence.Democratic presidential candidate former Vice President Joe Biden walks from the podium after speaking at McGregor Industries in Dunmore, Pa., Thursday, July 9, 2020. (AP Photo/Matt Slocum)Biden supports lifting the minimum wage to $15 an hour. In all, the $700 billion plan from Biden targets the creation of five million jobs.To pay for it all, Biden intends to reverse President’s Trump’s signature corporate taxes to businesses. He would lift the statutory rate to 28% from 21% currently, which would hit the bottom lines of companies and likely their stock prices.Story continuesRhetoric on big business may also overhang stocks in a Biden presidency (or the lead-up to one).At an event on Thursday detailing the plan, Biden railed against shareholder capitalism and insisted Amazon would pay its fair share of taxes.“I think they [investors] should be [worried of Biden],” Beacon Policy Advisors senior research analyst Ben Koltun said on The First Trade. “There are a lot of themes like buy American, help the middle class and small businesses, restoring manufacturing and anti-big business. That’s all boilerplate aspirations in the campaign and as the saying goes, politicians can’t campaign in poetry but campaign in prose. Scranton Joe should be taken seriously. In his 36-year Senate career, his voting record was in the middle of the Democratic caucus. He’s a pragmatist who is in tune with the changing dynamics of the party. And so when Biden comes out with an economic populism plan, it’s something not just supported by Bernie Sanders and Elizabeth Warren. It will be supported by the Joe Manchins of the world.”Take Scranton Joe Biden seriously, investors. Or else.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}