{"article": [{"url": "https://finance.yahoo.com/news/facebook-boycott-stop-hate-for-profit-162551189.html", "published": 1593603200.0, "headline": "Despite growing ad boycott, Facebook is too big for many advertisers to ignore", "body": "Facebook is in the midst of one of the most significant, if not highly-publicized, ad boycotts it’s faced since it launched some 16 years ago.Kicked off and championed by the Stop Hate for Profit campaign, the movement is meant to push Facebook to better police hate speech and other content posted to and shared across the social network.But Facebook (FB) has faced similar efforts in the past. And it’s unclear if even the deluge of advertisers taking part in the action, which include Adidas, Ben and Jerry’s, Ford (F), Hershey’s (HSY) and 237 others as of Wednesday, will have the kind of impact Stop Hate for Profit is seeking.“My prediction is that the death of Facebook is once again exaggerated,” explained Chapman University George L. Argyros School of Business and Economics associate professor Niklas Myhr.Facebook is facing a reckoningAccording to Myhr, who is also known as “The Social Media Professor,” while the boycott is unlikely to have a dramatic impact on Facebook, it could serve as a reckoning for the social network.“I think the impact, in terms of this boycott, would be largely secondary in the sense that it will be a time of reckoning and reconciliation within and outside of Facebook in terms of ‘What is this platform for?’ ‘What are our values?’ and ‘How can we ensure that we are congruent with what we say we want to be?’ ”Stop Hate for Profit, which is made up of civil rights groups including the Anti-defamation League, NAACP, and National Hispanic Media Coalition, among others, is demanding that Facebook take steps to stop the kind of content that it says allows the incitement of violence against racial justice protesters, voter suppression, and Holocaust denial to propagate throughout the social network.The campaign lays out 10 steps Facebook should follow to address those issues, and calls on advertisers to cut their ad spending to the company for all of July.So far, that has led some companies to eliminate their ad spending on the site for the month, or, in the case of Clorox (CLX), through the rest of the year.Story continuesFacebook has repeatedly been slammed for allowing politicians to promote misinformation, which the company says is important for open public discourse, and the spread of hate speech on its platform.On Wednesday, Facebook VP of global affairs and communication Nick Clegg issued a statement saying that the company doesn’t profit from hate, and that the firm works to deal with such content when it’s deemed hate speech.Facebook founder Mark Zuckerberg speaks at Georgetown University in a 'Conversation on Free Expression\" in Washington, DC on October 17, 2019. (Photo by ANDREW CABALLERO-REYNOLDS / AFP) (Photo by ANDREW CABALLERO-REYNOLDS/AFP via Getty Images)When the social network doesn’t classify speech as hateful, he wrote, it chooses to keep it up in the name of free speech.“We err on the side of free expression because, ultimately, the best way to counter hurtful, divisive, offensive speech, is more speech,” Clegg wrote. “Exposing it to sunlight is better than hiding it in the shadows.”On Tuesday, Facebook said it removed groups and accounts related to the “Boogaloo” extremist movement, but, according to BuzzFeed News, groups associated with the far-right ideology had been purchasing ads on Facebook as late as Sunday.For his part, Facebook CEO Mark Zuckerberg wrote in a June 26 post that the company already takes down 90% of hate speech on the platform before it is reported by users. He further explained that the company will move to eliminate ads that sow discord and spread hate.“Specifically, we're expanding our ads policy to prohibit claims that people from a specific race, ethnicity, national origin, religious affiliation, caste, sexual orientation, gender identity or immigration status are a threat to the physical safety, health or survival of others,” he wrote.“We're also expanding our policies to better protect immigrants, migrants, refugees and asylum seekers from ads suggesting these groups are inferior or expressing contempt, dismissal or disgust directed at them.”Facebook will survive the painAccording to Regina Luttrell, assistant professor of public relations and social media at the S.I. Newhouse School of Public Communications at Syracuse University, many of the brands that initially jumped on the boycott are committed to corporate activism and want to see “true change” from Zuckerberg.“Investors will shy away from supporting Zuckerberg's usual avoidance of the issue,” Luttrell told Yahoo Finance. “Facebook has a habit of making small changes rather than truly taking action. The latest public movement is different. We are all seeing that. Facebook needs to wake up, pay attention and make lasting changes.”It’s worth noting, however, that the current economic climate is also leading to cuts in advertising spending. According to a Gartner survey of 360 marketers conducted on March 27, 76% of marketing leaders expected decreases in marketing budgets due to the coronavirus pandemic.What’s more, Facebook has 8 million advertisers on its platform, which makes up the bulk of its $70 billion in advertising revenue in 2019. If any kind of advertising boycott is going to have a true impact on the social networking giant, it will need to include well beyond the 242 firms currently part of the movement.Facebook, with its 2.5 billion users, is the largest social media network in the world. And while some advertisers may feel comfortable leaving that kind of access to potential customers on the table, others won’t be.A conference worker passes a demo booth at Facebook's annual F8 developer conference, in San Jose, Calif. (AP Photo/Noah Berger, File)And as NYU Stern School of Business assistant professor of marketing Alixandra Barasch points out, the small advertisers that make up the majority of Facebook’s advertising partners often can’t afford to leave the social network for other outlets.“They are not going to be able to afford any kind of mass market advertising campaign, so they can’t go to TV, and they don’t want to,” Barasch explained.“They don’t have anywhere else to go, and even the big ones, I think they are afraid right now to go in this direction or take a stand one way or the other, so they are looking for ways to sort of speak out and support something that consumers care about.”For a company that has survived scandal after scandal, whether that be the Cambridge Analytica debacle that saw a political consulting firm gain access to user data for the purpose of electing Donald Trump, or reports that the social network was used to incite genocide in Myanmar, Facebook has continually come through relatively unscathed.Even the largest privacy-related fine in the history of the Federal Trade Commission, $5 billion, couldn’t hurt Facebook in the eyes of investors or advertisers. Because as long as people keep using the social network, it’s more than worth the temporary blowback to gain access to so many users.More from Dan:Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:How iOS 14 will change your iPhone forever: Tech SupportApple’s switch from Intel to its own chip is its smartest move in yearsApple to close retail stores in 4 states amid coronavirus outbreaksWhy Microsoft and Amazon are calling on Congress to regulate facial recognition technologyFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}