{"article": [{"url": "https://finance.yahoo.com/news/the-best-cities-in-the-us-to-buy-a-vacation-home-you-plan-to-rent-vacasa-182132185.html", "published": 1597843760.0, "headline": "The best cities in the US to buy a vacation home you plan to rent: study", "body": "Americans escaped stay-at-home living with outdoorsy vacations this summer — pushing demand for vacation home rentals up 35% in top markets this year.As rental homes become even more lucrative investments, vacation homebuyers can get the best return on their investment by renting out homes in Big Sky, Mont., Cape Hatteras, N.C. and Poconos, Penn., according to a new study by Vacasa, a Portland-based vacation rental company.“People are really craving outdoor activities. And all of those [locations] really characterize an opportunity for people to just get away, [have a] change of scenery [and] enjoy the great outdoors,” said Vacasa CEO Matthew Roberts, who told Yahoo Finance On the Move, that the properties in these areas are relatively affordable considering what they can charge when renting out their homes.Colorado had the highest number of lucrative locations, with Vail, Silverthorne, Breckenridge and Steamboat Springs making the list. California also had three on the list — Palm Springs, Big Bear and Mammoth Lakes. And Florida’s popularity rose compared to last year, with Kissimmee, Key West and Panama City ranking as top investments.“[People] just don't want to be in their home anymore. They want a change of scenery. And you couple that with the freedom that people have now to actually work remotely, and then add distance learning for the kids, and it really sets up a good situation for homeowners that are renting out their properties,” said Roberts.View from the waterfalls to the mountains in Big Sky, Montana — the most lucrative location for vacation homes.‘A lot of pent-up demand’The vacation rental industry’s boom comes after the coronavirus pandemic nearly crippled the short-term rental industry in March and April. Bookings hit an all-time low in April, and revenue per room dropped 80% compared to April 2019. Some 74,000 hosts took their homes off the market before the vacation rental industry rebounded in May, according to AirDNA, a short-term rental data and analytics company based in Denver, Colo.But between May 17 and June 10 (the most recently available data), bookings were actually up 20%, compared to the same period last year, according to AirDNA.Story continues“We had thought that there would be a lot of pent-up demand — and boy, was there ever. We just came booming back. And we're actually at record volumes right now. We're expecting a really good back half of the year as well,” said Roberts, who said that supply is tightening up.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:These are America’s hottest ZIP codesThere’s a record number of vacant rental apartments in ManhattanA mass exodus from American cities? Not quite: poll"}]}