{"article": [{"url": "https://finance.yahoo.com/news/kamala-harris-unveils-housing-plan-183756075.html", "published": 1594907120.0, "headline": "Kamala Harris unveils housing plan as rent deadline looms", "body": "Sen. Kamala Harris (D-Calif.) will unveil a sweeping housing plan Thursday to give struggling renters and homeowners relief as the coronavirus pandemic continues to pound the economy.The legislation, which Harris plans to introduce next week, would ban evictions and foreclosures for a year while giving tenants up to 18 months to pay back missed payments. The current federal ban on evictions — which only covers the roughly 1 in 4 rental units in the country with a federally backed mortgage — expires July 24.“With unemployment skyrocketing and so many Americans struggling to make ends meet, the country is facing an eviction and homelessness crisis like never before,” Harris told POLITICO. “That’s why we need this bold legislation to support Americans experiencing financial hardship or eviction as a result of this pandemic.”Harris’ bill also would bar landlords from raising tenants’ rent or reporting unpaid rent to credit reporting companies for a year and prohibit utility companies from shutting off access until January 2022.Some 30 percent of Americans missed their housing payments at the beginning of June, according to a survey last month by the online rental platform Apartment List. The federal boost to unemployment benefits that many laid-off workers have used to pay their rent is set to expire at the end of the month.The potential eviction cliff would hit Black and Latino people hardest, since they are twice as likely to rent as white people, amid a moment of heightened racial tension across the country. The NAACP supports Harris’ plan.“The COVID-19 pandemic is both a public health emergency and economic crisis unlike anything we have seen in this country in decades, and Black people are being disproportionately impacted on both fronts,” said Sherrilyn Ifill, president of the NAACP Legal Defense and Educational Fund.Minority workers have been particularly walloped by job losses and furloughs, largely because they make up a significant portion of those in the service industries crippled by widespread shutdowns. Black Americans are also contracting and dying from the coronavirus at a disproportionate rate.Story continues“In the midst of this pandemic, as state and local moratoriums end, we are facing the possibility of an eviction catastrophe,” Ifill added. “We need immediate action to implement a national moratorium on foreclosures and evictions. No family should be concerned about losing their home during this pandemic.”House Democrats included $100 billion in rental assistance and a yearlong ban on evictions from all rental units in the $3 trillion economic rescue package that the House passed in May. The Senate has not taken up the bill.Senate Republicans are expected to unveil their own $1 trillion pandemic relief bill next week, kicking off potentially weeks of negotiations with House Democrats even as more out-of-work Americans face another month of rent being due.Harris’ legislation would prohibit the use of Paycheck Protection Program funds to purchase foreclosed or distressed properties and directs the Congressional Oversight Commission established by the CARES Act to monitor property management companies that received PPP loans.It would also permanently bolster tenants’ legal protections, establishing a right to legal assistance for those facing eviction and providing state attorneys general with subpoena power in landlord investigations.“We are in the midst of multiple crises in our country: a public health crisis, which has killed over 135,000 people, and an economic crisis due to millions of Americans losing their sources of income. And we are now facing a housing crisis as a result of both,” Harris said.“Instead of stepping up to help folks keep a roof over their heads, [the Trump] administration is focused on putting taxpayer dollars in the pockets of big corporations,” she added. “We need to know that wealthy landlords aren’t using federal assistance to benefit themselves while putting families out on the street.”"}]}