{"article": [{"url": "https://finance.yahoo.com/news/for-profit-schools-america-144317896.html", "published": 1596275480.0, "headline": "‘Dollar signs with heartbeats’: How for-profit schools blazed a trail of pain in America", "body": "Listen on Apple Podcasts | Google PodcastsThis is the first part of Yahoo Finance’s Illegal Tender podcast series on for-profit colleges. Listen to the episode here.After the Financial Crisis, for-profit schools prospered across America at the expense of students saddled with thousands of dollars in debt, employees abandoned or implicated, and the government swindled out of taxpayer money.A Florida-based for-profit school called Fast Train (FT), which maintained seven campuses across the state from Clearwater to South Florida, exemplified the greed and shady tactics behind the boom.The FastTrain campus in Plantation, Fla. (Miami Herald/Tribune News Service via Getty Images)When enrollments at the campuses in northern Florida dropped, according to court documents, Fast Train CEO Alejandro Amor brought the director of admissions at Fast Train’s Jacksonville campus to Miami and showed him recruiting methods, which involved driving around low-income areas and pitching students without high school diplomas.“There were so many different students who were being preyed upon in different ways, and these schools… this whole thing dehumanizes people,” said Alex Shebanow, a filmmaker who made the 2018 documentary “Fail State” investigating the for-profit college industry in America.“We saw the schools viewed these students as nothing more than dollar signs with heartbeats,” Shebanow told Yahoo Finance’s Illegal Tender podcast.A neon sign at Pan American Art Projects. (Photo by: Jeffrey Greenberg/Universal Images Group via Getty Images)This is the first part of Yahoo Finance’s Illegal Tender podcast series on for-profit colleges. Listen to the episode here.Amor told another admissions director to increase enrollment numbers by driving through low-income neighborhoods with a recruiter who “stopped random men on street corners and bus stops and asked them to attend FT.”When man they pitched said he didn’t have a high school diploma, the recruiter said that was fine and that “he would just have to keep it a secret between the two of them.”The Tampa admissions director said the recruiter he was with “was a former exotic dancer and dressed very provocatively” and that the entire act was “all a part of the recruiting effort for FT.”Story continuesA strip club in Miami. (Daniel A.Varela/Miami Herald/Tribune News Service via Getty Images)The Miami Herald reported that this instruction came from the top: “Amor allegedly told an employee to ‘hire some hot mommas’ and ‘hire the sluttiest girls he could find.’”From employing exotic dancers as admissions recruiters to knowingly submitting fake high school diploma and GED information, Amor obtained federal Title IV funds (or federal financial aid) for students to pay for their post-secondary education.Amor took more than $6.5 million through “unearned student financial aid” while“orchestrating a conspiracy to steal government money and in fact stealing government money,” the U.S. Attorney’s Office in the Southern District of Florida stated when Amor was sentenced to 97 months in prison in 2016.This is the first part of Yahoo Finance’s Illegal Tender podcast series on for-profit colleges. Listen to the episode here.‘There's no way I could pay that’In St. Louis, Missouri, a student who attended the now-defunct for-profit college ITT Tech said that his desire to better himself left him with a miserable experience that continues to haunt him years later.“I should have recognized the red flags and the warning signs,” Matt Wood told Illegal Tender, noting that his classes were “watered down” and used unlicensed software.At one point, Wood was approached by a mysterious women demanding him to take out more loans.“I would say probably two weeks before I was supposed to get my associate's degree, I'm sitting in class and a woman comes in looking for me,” he recalled. “I've never seen this woman in our campus before. don't remember her name, don't know who she was, but she pulls me into her office area to this little meeting room and was saying that I was in trouble of needing more funding, and we needed to act now to figure out what we need to do to be able for me to be able to graduate.”The woman told Wood that if he didn’t get the additional funds, he wasn’t going to get his associate’s degree.“I mean, this was literally two weeks before graduation … so she was acting off panicked and concerned and that if I didn't get any more funding, I wasn't going to be able to graduate,” he said.Wood, who took out $10,000 in loans at an interest rate of 11%, later learned that she was “getting me signed up for these high interest PEAKS private loans, which was like ITT Tech's private loan system that they were using to try to get more money.”He recalled telling the school that the loan payments were “almost double what I'm paying in rent right now. I'm making $9 an hour working at Game Stop. There's no way I could pay that.”PEAKS loans are the subject of several legal actions. A complaint brought forward by the Consumer Financial Protection Bureau found that many students were rushed through the process — like being pulled out of classes or being told that these loans were necessary by their own instructors.Creditors came after Wood and people close to him but stopped after the loans were likely forgiven as per a June 2019 settlement.This is the first part of Yahoo Finance’s Illegal Tender podcast series on for-profit colleges. Listen to the episode here.The Chantilly Campus of ITT Technical Institute sits closed and empty on Tuesday, September 6, 2016, in Chantilly, VA. (Photo: Jahi Chikwendiu/The Washington Post via Getty Images)‘You have to tell your investors every quarter’Ultimately, the pressure to perform as a businesses is a key factor that pushes for-profit college administrators like Amor to use underhanded tactics.“You have to tell your investors every quarter that you're making money or your stock price is going to fall, your compensation is going to fall,” David Halperin, an attorney and an advocate for issues regarding for-profit education, told Yahoo Finance. “So you're just digging into how can I cut costs on education? How can I do more deceptive advertising? How can I push our recruiters to say whatever it takes to sign up students? So it is in various forms and in various ways, it's about greed and it looks like it is very difficult to reconcile the profit motive with the public good.”Publicly-listed for-profit schools report earnings, providing a glimpse of how they view the business landscape. Strategic Education (STRA), which owns Capella and Strayer, reported earnings this week.The company had a strong first half, reporting revenue growth in the second quarter of 4.4% — driven by nearly 4% total enrollment growth — and adjusted operating income being up 37% year-over-year.In an earnings call with analysts, Strategic Education Executive Chairman Robert S. Silberman noted that the ongoing coronavirus pandemic is “highlighting some of the significant advantages of our academic model and our comfort with online academic technology.”A commencement ceremony for Strayer University, a private, for-profit educational institution. Strayer University specializes in higher education for working adults seeking career advancement. (PHOTO: Brooks Kraft LLC/Corbis via Getty Images)Strategic Education President and CEO, Karl McDonnell said that performance was looking good: A 4% decline in new student enrollments at Strayer year-over-year but a 1% increase at Capella while total enrollment also grew at both universities.A 2018 lawsuit filed in the U.S. District Court for the District of Minnesota against Capella University alleged that students were actively recruited for doctoral programs and ended up taking on thousands of dollars in student debt before experiencing significant roadblocks when they actually tried to graduate.“Going to Capella was supposed to be a part of advancing my career in life… I feel like I was misled at every turn,” Louis DeWeaver, an Air Force veteran from Michigan in his 50s, told reporters. “They made it sound like there was structure and pathway to completing their online courses within a reasonable time frame and at a reasonable cost. … But I faced roadblocks… at every turn… and every time things slowed down, it cost me more and more money.”Capella University countered that the lawsuit is “without merit” and that the court has “already dismissed 40 of the 45 legal claims and eight out of nine plaintiffs.”This is the first part of Yahoo Finance’s Illegal Tender podcast series on for-profit colleges. Listen to the episode here. In the next episode, we'll dive into the tactics that many for-profit schools use to recruit students and generate profit.Aarthi is a reporter for Yahoo Finance covering consumer finance and education. Follow her on Twitter @aarthiswami. If you attended or worked at a for-profit college and would like to share your experience, reach out to her at aarthi@yahoofinance.comRead more:Some for-profit colleges double dip in both PPP and CARES coronavirus stimulus'They stole my time’: For-profit college students share horror stories'They rigged the system': DeVos sued by California and Massachusetts attorneys general over troubled borrower defense ruleRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}