{"article": [{"url": "https://finance.yahoo.com/news/this-week-in-trumponomics-half-the-jobs-are-back-153451512.html", "published": 1599216140.0, "headline": "This week in Trumponomics: Half the jobs are back", "body": "“Great Jobs Numbers!” President Trump tweeted on Sept. 4. Er, depends how you look at it.The story on the economy right now is basically this: We’re part of the way into an economic recovery that’s going to take a long time. Progress during the last 4 months has been steady, following the massive job losses in March and April. But the pace of improvement is slowing and the next several months are likely to feel like a grueling slog, for many. Backsliding is possible.Employers created nearly 1.4 million jobs in August, which is about 7 times larger than the pace of job creation before the coronavirus pandemic exploded in March. The unemployment rate fell from 10.2% to 8.4%. During the last 4 months, employers have added 10.6 million jobs. That would be unthinkable in normal times. Many economists thought it would take a lot longer to regain those jobs.But the economy lost 22 million jobs in March and April. So we’re only halfway out of a deep employment hole. And the pace of job gains has slowed in each of the last three months. In June, for instance, the economy created 4.8 million jobs. So the pace of hiring in August was 71% lower than at the start of the recovery. And 238,000 of the new jobs in August were temporary Census jobs that will disappear in a couple months.It’s also possible that companies have hired back all the workers they’re likely to hire, with a new kind of stagnation settling in during the rest of the year. “The unemployment rate is still resting too close to double digits,” Rick Rieder, fixed-income chief at investing firm BlackRock, wrote on Sept. 4. “Many businesses will not recover their footing for years to come, if ever. The businesses that drove much of the hiring for the past dozen, or so, years (such as travel, leisure and entertainment, etc.) will not only be slow to heal, but may be years away from recovering their footing.”Economist Ian Shepherdson of forecasting firm Pantheon Macro expects further slowing, especially since government jobs accounted for an unusually large portion of the August number. “The slowdown in private sector job growth is ominous,” he wrote. “We see little chance of a quick re-acceleration.” He bases that outlook on other data showing restrained spending as coronavirus shutdowns continue with no imminent end. He points out that if the August pace of job growth continued, it would take another 10 months to hit pre-virus employment levels.Story continuesAmid a gloomy outlook, however, the job gains are good news. This week’s Trump-o-meter reads MEDIOCRE, the best score since the coronavirus recession began in March.Graphic by Yahoo FinanceImprovements in the economy don’t seem to be helping President Trump’s reelection odds. Neither Trump nor his Democratic challenger, Joe Biden, saw much of polling bump following their nominating conventions in August. Biden continues to lead Trump by about 7 percentage points in national polls, a larger margin than Hillary Clinton enjoyed at the same point in the 2016 presidential race. Biden holds smaller leads in most of the six swing states likely to determine the outcome in November.The stock market also tripped Trump this week. After the Dow Jones index closed at 29,100 on Sept. 2, Trump tweeted, “The Dow Jones Industrial just closed above 29,000! You are so lucky to have me as your President. With Joe Hiden’ it would crash.” By the end of the week, stocks had plunged in a monstrous selloff, with the Dow down 4.5% and the tech-heavy Nasdaq index down nearly 10%.There was no obvious trigger for the selloff, except that many investors have felt stocks are overvalued, following a huge summer run-up. Sellers may have been locking in profits. Still, Trump has tethered himself to the stock market for his entire presidency, taking credit when it goes up and blaming the Federal Reserve or Democrats or anybody, really, when it goes down. If stocks sag leading into Election Day, expect him to finger market fears of a Joe Biden presidency.There will be one more monthly jobs report before Election Day on Nov. 3, when the numbers for September come out on Oct. 2. Temporary Census jobs should boost the September numbers as well, but the overall pace of hiring will probably slow for the fourth month in a row. Trump, predictably, has begun to promise a coronavirus vaccine by Election Day, even though experts say probably not. With less than two months until decision day, it’s clear now that the virus Trump has repeatedly dismissed will be influencing voters as they are determining Trump’s political future.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Biden would undo the Trump tax cuts5 campaign promises Trump has given up onBiden’s top economic priority isn’t what you thinkWhy Trump wants to shackle the postal serviceEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}