{"article": [{"url": "https://finance.yahoo.com/news/mnuchin-says-trump-wants-deal-224642136.html", "published": 1598982860.0, "headline": "Mnuchin Says Trump Wants a Deal on Covid Relief", "body": "Appearing before a House panel investigating the federal response to the coronavirus pandemic, Treasury Secretary Steven Mnuchin told lawmakers Tuesday that the White House is ready to renew the stalled negotiations over the next relief bill.“Let me say, I very much agree with you and those other experts that more fiscal response is needed,” Mnuchin said. “The president and I want to move forward with more fiscal response. I'm prepared to sit down with the Speaker at any time to negotiate.” He told Financial Services Committee Chairwoman Maxine Waters (D-CA) that he would call House Speaker Nancy Pelosi (D-CA) as soon as the hearing was over.The size of the relief package is still very much an issue, however. Mnuchin said he did not support the $2.2 trillion package proposed by House Speaker Nancy Pelosi (D-CA), which was offered as a compromise position. Republicans have offered $1.3 trillion, but have shown no interest in going higher, and may not have solid internal support for any additional relief spending.Still, Mnuchin highlighted the areas where the two sides appear to agree. “I believe a bipartisan agreement still should be reached,” Mnuchin said, “and would provide substantial funds for schools, testing, vaccines, PPP for small businesses, continued enhanced unemployment benefits, child care, nutrition, agriculture, and the U.S. Postal Service, along with liability protection for universities, schools, and businesses.”Senate eyes “skinny” bill. Senate Republicans hope to introduce a slimmed down $500 billion coronavirus relief bill next week, White House Chief of Staff Mark Meadows said Tuesday. The bill will be “more targeted” than the $3.4 trillion package Democrats approved in the House, Meadows said, and would be constructed to pass on its own or serve as a starting point for a larger deal.Meadows said he met with President Trump and Treasury Secretary Steven Mnuchin Monday and that the president told them “to get as creative as we can within the confines of the law to put forth as much money as we can so we can keep this economy going.”Story continuesPelosi has repeatedly rejected the idea of passing a “skinny” relief bill, though, and Senate Democrats are expected to prevent the GOP bill from getting a vote absent some kind of deal in place with the speaker.A major stumbling block. Meadows said aid for state and local governments is “probably the biggest stumbling block” for the next round of negotiations. Pelosi has requested $915 billion in aid to help avoid layoffs of public workers including teachers, firefighters and police officers. But Republicans have rejected anything like that level of assistance for what they portray as spendthrift, Democratic-led states and cities.Even so, Mnuchin told lawmakers that the White House would back some kind of funding for states and local governments. “Nobody thinks the right outcome is zero,\" Mnuchin said.Like what you're reading? Sign up for our free newsletter."}]}