{"article": [{"url": "https://finance.yahoo.com/news/bill-gates-spread-of-outrageous-coronavirus-video-shows-flaw-in-social-media-platforms-124710983.html", "published": 1596009320.0, "headline": "Bill Gates: Spread of 'outrageous' coronavirus video shows flaw in social media platforms", "body": "A video that made false claims about the coronavirus received tens of millions of views and amplification from President Donald Trump when it went viral on Monday — until Facebook and Twitter removed it from their platforms.The incident illustrates a flaw in how social media companies police misinformation, tech mogul and philanthropist Bill Gates told Yahoo Finance Editor-in-Chief Andy Serwer on Tuesday.Gates, a top backer of global public health initiatives and co-founder of Microsoft (MSFT), said that the spread of the “outrageous” video illustrates the way social media platforms struggle to contain damaging misinformation on social media platforms before it gains wide attention, adding that they “probably should have improved” how they monitor such posts to prevent outcomes like the one that occurred on Monday.The video “spread so fast that even though, eventually, the social media people stopped it,” he says. “It was so famous that now people are still seeking it out.”“You can't find it directly on those services, but everybody's sending the link around because it's still out there on the internet,” adds Gates, who along with is wife Melinda has donated more than $350 million to combat the coronavirus outbreak through the Bill and Melinda Gates Foundation.The video, which features individuals in medical coats at the steps of the U.S. Supreme Court building, includes misleading claims about the efficacy of hydroxychloroquine as a coronavirus therapy and the usefulness of masks in reducing the spread of the virus. Hours after the video went online, Donald Trump Jr., conservative outlet Breitbart, and Trump had promoted it, among many others.“It is really hard to believe that that's what's being retweeted,” Gates says.The video reached more than 20 million Facebook users before the company removed it, NBC News reported. YouTube also removed the video from its platform.Gates acknowledged that the rapid spread of the video made it difficult for social media platforms to contain but also said the incident illustrates a persistent shortcoming of the platforms.Story continues“Their ability to stop things before they become widespread,” he says. “They probably should have improved that.”The criticism came a day before testimony from Facebook (FB) CEO Mark Zuckerberg in front of the House Judiciary’s antitrust subcommittee, where he’s likely to face questions on a host of issues, including misinformation. Amazon (AMZN) CEO Jeff Bezos, Apple (AAPL) CEO Tim Cook, and Alphabet (GOOG, GOOGL) CEO Sundar Pichai will also appear virtually at the hearing on Wednesday.Gates, who serves as co-chair of the Bill and Melinda Gates Foundation, made the remarks in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Until 2000, Gates led personal computing giant Microsoft. That year, he and his wife co-founded their foundation, which now employs nearly 1,500 people and boasts an endowment of $46.8 billion.A debunked conspiracy theory about Gates accuses him of seeking to develop and distribute a coronavirus vaccine in order to plant tracking devices in billions of recipients. Nearly half of Republicans believe the theory to be true, according to a Yahoo News/YouGov poll conducted in May.Gates attributed the spread of the conspiracy theory in part to social media. “Lies travel faster than the truth,” he says. “Particularly in the age of social media.”“The fact that our foundation is involved in vaccines – that's true,” he says.“They just inverted it to say that somehow we're not trying to save lives — [that] instead of giving money, we're trying to make money,” he says. “It’s unfortunate.”Read more:Bill Gates: U.S. ‘sadly’ not taking coronavirus ‘seriously’'Travel has changed forever': Airbnb CEO Brian CheskyJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinBusiness leaders fear 'flaming on social media' if they criticize Trump: Fast Company Editor-in-ChiefMichael Dell: ‘Not enough’ progress on diversity in the tech industry‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}