{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-heres-how-americans-are-using-their-checks-152517698.html", "published": 1598524400.0, "headline": "Coronavirus stimulus: Here’s how Americans are using their checks", "body": "Most Americans who received a stimulus check earlier this year will use most of it to pay for expenses, according to new analysis out this week from the Bureau of Labor Statistics.Under the Coronavirus Aid, Relief, and Economic Security (CARES) Act, Americans received stimulus payments up to $1,200 per adult and $500 per child or up to $3,400 for a family of four. Negotiations over the next stimulus package, which could include another round of stimulus checks, have been stalled for weeks on Capitol Hill.BLS said it submitted questions about the stimulus payments for the Household Pulse Survey (HPS), which is a collaboration between the Census Bureau and several federal agencies. The data regarding stimulus checks was collected between June 11-16. The Census Bureau released some of the findings regarding stimulus checks earlier this summer, but BLS released a deeper dive into the data on Wednesday.According to BLS, Eighty-four percent of respondents said they received or expected to receive a stimulus check.FILE - In this April 23, 2020, file photo, President Donald Trump's name is seen on a stimulus check issued by the IRS to help combat the adverse economic effects of the COVID-19 outbreak, in San Antonio. There were just a few hundred coronavirus cases when Congress first started focusing on emergency spending in early March. By the end of that month, as Congress passed the massive $2.2 trillion Cares Act, cases skyrocketed above 100,000 and deaths climbed past 2,000. (AP Photo/Eric Gay, File)The survey found 59% of respondents said they would use their stimulus check mostly for expenses including food, utilities, rent, car payments or mortgages. Sixty-six percent said they would put at least a portion of their payment toward food.Thirteen percent of the respondents said they would use most of their stimulus payment to pay off debt and 12% said they’d mostly put it toward savings.How respondents used or planned to use their stimulus payments, June 11- June 16, 2020Daniel Zhao, senior economist at Glassdoor, notes a common concern with “rapid and broad stimulus” is that money will be saved rather than spent and put it back into the economy.“The BLS data shows that the stimulus checks were largely used as intended by helping millions of Americans cover immediate expenses and spend money on essentials rather than increase savings,” said Zhao in a statement to Yahoo Finance. “Policymakers should see this as a good sign that stimulus checks can simultaneously provide financial relief for American households and stimulate the economy.”Story continues2008 vs. 2020 BLS compared the 2020 survey to HPS results in 2008, when the federal government sent out stimulus checks in response to the financial crisis. The findings were very different.In 2008, 49% of respondents planned to use their stimulus payment to pay off debt and 30% planned to use it on spending and 18% put it toward savings. In the report, BLS notes the differences make sense when considering the unique economic and employment situations in each scenario.“The collapse of the housing bubble meant individuals were holding mortgage debt that could not be paid off by simply selling their home. The money from the stimulus check was viewed by many as a means to pay off some of this debt. In contrast, the coronavirus lockdowns led to individuals losing their job and primary source of income,” said the report. “Many individuals saw the money from the stimulus check as replacement of this lost income, and thus, used it to pay for expenses, such as food, that would typically be bought using their regular income.”Stimulus payment related to loss of income or employmentLoss of incomeNearly half of the respondents reported losing income since March 13. As would be expected, those who lost income during the coronavirus crisis were more likely to use their stimulus checks on expenses instead of saving or paying down debt. Eighty-one percent of people who lost income since March 13 said they were using their stimulus money for expenses, compared to 60% of people who did not lose income.Households making more money were more likely to save the stimulus payments. Just 3% of households making less than $25,000 said they planned to save most of their stimulus check versus 22% of households making between $100,000-$149,0000.Financial resources used to meet spending needs by loss of income of a household member.People surveyed were also asked how they met their spending needs (food, shelter, utilities, etc…) in “the past seven days.” Seventy percent reported using their usual sources of income and 26% reported using their stimulus payment.Of the respondents who lost income, 32% reported using the stimulus payment to meet their spending needs versus 20% who had no income loss. People who lost income also reported higher rates of taking money out of savings, selling assets, using credit cards or loans and borrowing money from others to cover their spending needs.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Republican National Convention: Trump fights for re-election amid coronavirus, economic crises'He will cheat': DNC organizes to combat Trump's 'suppression efforts'Trump is trying to 'undermine confidence' in democracy: Democratic rep.What to expect from the 2020 conventions: 'As good a TV show as they can have'Coronavirus response: Breaking down the debate over liability protectionsCoronavirus stimulus: What’s next for small business?"}]}