{"article": [{"url": "https://finance.yahoo.com/news/nikola-and-gm-team-up-to-make-this-900-horsepower-super-electric-truck-113011979.html", "published": 1599547100.0, "headline": "Nikola and GM team up to make this 900-horsepower super electric truck", "body": "Nikola (NKLA) and GM (GM) are teaming up to take on Tesla’s cybertruck.The electric truck startup announced Tuesday it has selected GM to be its manufacturing parter for its electric pickup truck dubbed the Badger. The Badger will use GM’s widely acclaimed Ultium battery technology. Additionally, Nikola will hand over $2 billion in stock to GM — giving the automaker an 11% stake in the company.Shares of Nikola and GM rose 40% and 8%, respectively on the tie-up.“General Motors was the perfect fit,” Nikola founder executive chairman and CEO Trevor Milton told Yahoo Finance’s The First Trade.Added GM Chairman and CEO Mary Barra, “What we're focused on is creating an all electric future and this announcement is very important today because it shows another very strong validation of our technology, our hydrogen fuel cell technology as well as our ultium batteries.”Thus far, the Badger has been a mere rendering that has lit-up social media feeds.The company did begin taking pre-orders for the electric super pickup truck in late June. On paper, the truck stands to be a beast. It’s expected to have 906 horsepower and have a 600-mile range using both battery and hydrogen fuel cells. Nikola has said pricing will start at $60,000 for the electric vehicle version and $90,000 for the one that also includes the hydrogen cell.The Badger is expected to be unveiled in early December. Production has been set for 2022.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}