{"article": [{"url": "https://finance.yahoo.com/news/the-2008-recession-was-far-worse-for-young-peoples-careers-than-previously-thought-200751863.html", "published": 1594739720.0, "headline": "The 2008 recession was far worse for young people's careers than previously thought", "body": "The Great Recession of 2008 crushed the millennial generation’s career aspirations.The labor market for both college and high school graduates wasn’t pretty. In September 2008, young workers faced an unemployment rate of 9.9%, compared to 5.6% for all workers, according to the New York Fed. By May 2010, even as the stock market had recovered, young workers aged 22 to 27 without a bachelor's degree saw unemployment at 15.7%. Even college graduates had an unlucky unemployment rate of 6.8%.Much has been written about how the Great Recession messed up millennials’ job prospects, finances, and even psyches.The dismal job market kicked off a cycle of unemployment, underemployment, lower wages, which can have lasting effects on careers. Ballooning student debt and rising real estate costs further squeezed millennials.New research examines the lasting impact of the Great Recession and finds that, contrary to earlier findings that says the “scarring” effects fade, they’re actually still being felt – 12 years later. Furthermore, the research indicates the recession hurt millennials who entered the job market even after the economy improved.This also comes as the coronavirus pandemic has ushered in a fresh economic crisis and recession. And in this downturn, the potential effects on younger generations have compounded with the closure of schools and colleges.Students wear protective face masks, graduation caps and graduation gowns outside The New School during the coronavirus pandemic on May 15, 2020 in New York City. (Photo by Noam Galai/Getty Images)Graduates may be scarred longer than previously thought — as well as the labor marketThe paper, by Jesse Rothstein, a professor at the Goldman School of Public Policy at UC Berkeley and former chief economist at the Department of Labor, corroborates previous research showing that graduating into a tough labor market hurts employment and wages.“A worker who might have found a traineeship with opportunities for advancement in good times might instead settle for a dead-end job in bad times, reducing wages immediately but also reducing future career prospects,” Rothstein writes.Story continuesBut what’s more troubling is that employment rates continued to decline for new graduates even after the recession was over. Though it has been previously thought that graduating into a recovered economy was good, this may not be the case, according to Rothstein’s findings.A worrying chart from the New York Fed. (NY Fed)“The labor market grew steadily stronger through the 2011-2019 period, and overall employment rates rose,” wrote Rothstein. “But the employment rates of new graduates were stagnant, despite the rising tide.”Rothstein found another troubling thing. Previous research has found that the bad economic conditions for recent graduates often lead to lower salaries and underemployment than otherwise in good times — but that these effects wear off into a worker’s 30s. Rothstein’s research, however, suggests the initial impact is, in fact, prolonged.“Initial conditions also have persistent effects on employment rates that, rather than fading away, last throughout a workers’ career (at least through age 40),” he found.Furthermore, Rothstein found something else seems to be happening in recent recessions that is far worse than in the past.“There has been an additional change to the employment prospects of recent entrants [to the job market], over and above what is consistent with normal recession effects,” he wrote. “Moreover, this change has persisted into the most recent entrants, who were in middle school during the Great Recession.”“Something dramatic,” he concludes, has happened, that hamstrung young people despite a rising tide.And now a recession, with no in-person schoolOne interesting criticism about the millennial-graduating-into-a-recession argument is that it’s just a small portion of the generation that actually hit a disastrous job market.Rothstein’s observations that subsequent members of the same generation are still affected illustrate how it can still be bad even if you’re still in high school (or middle school) when a recession hits. But even if that thinking was correct, the current coronavirus crisis one ups the Great Recession because the pandemic has affected schools as well.An unidentified graduating student from Mount San Antonio College holds up her diploma while her family members cheer after receiving it at the school's first drive-thru commencement ceremony for the \"Resilient Class\" of 2020, which includes more than 650 students, June 18, 2020 in Walnut, California. (Photo by ROBYN BECK/AFP via Getty Images)One of Rothstein’s observations is that college enrollment surged during the last crisis, perhaps because many decided to stay in school (or go to graduate school) rather than launch into a poor job market.Now, however, many high schools and colleges are staying closed and conducting classes online, which has its own set of problems.At the same time, for people who are paying for university education, the other side of the column looks just as bad: many schools have not lowered tuition even though the whole college experience will be transformed. Like the past two decades, wage and employment issues may occur in lockstep with rising costs.All this does not bode well for the careers of millennials, who are going two-for-two for horrible recessions, and the Gen Z generation entering the labor market now.“The employment patterns indicate that we were not well prepared for the pandemic-induced downturn of 2020. The 2020 graduates, and likely those of 2021 and 2022, will enter a labor market that is historically weak,” wrote Rothstein. “The results here indicate that this will permanently scar them.”---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.What have we learned from the $HTZ debacle?Black communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey'We're seeing a 6,000% increase in spam': IBM cyber VP'Bank' offering 6% called Loan Doctor sued for allegedly trading 'insured' deposits in stock market"}]}