{"article": [{"url": "https://finance.yahoo.com/news/facebook-apple-amazon-microsoft-alphabet-google-earnings-antitrust-morning-brief-101301496.html", "published": 1595827280.0, "headline": "The hottest trade in the stock market faces a huge test this week: Morning Brief", "body": "Monday, July 27, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeMega-cap tech stocks face mega risksIt’s the hottest trade in the stock market.We’re talking about investors betting on Facebook (FB), Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), and Alphabet (GOOGL, GOOG).These five stocks represent 1% of the names in the S&P 500 (^GSPC) but over a fifth of the market value. They’re the reason why the S&P is up. And everyone’s a bit nervous about it as these stocks have decoupled from the rest of the market and valuations are getting stretched.This week comes with a slew of earnings announcements. Facebook announces second quarter results on Wednesday. Apple, Amazon and Alphabet announce on Thursday. Earnings announcements tend to be catalysts for volatility.And while these announcements may reveal something crucial about the near term for these companies, it’s their long-term prospects that are being called into question as the CEOs of Facebook, Apple, Amazon and Alphabet head to the Hill. On Wednesday, these execs will testify before the House Judiciary Antitrust Subcommittee in what’s expected to be the opposite of a lovefest. This comes following a year-long investigation into how these companies compete with smaller rivals.“We are looking to wrap this up and propose a series of recommendations including legislation that will allow us to deal with anti competitive patterns that we see,” committee member Congresswoman Pramila Jayapal (D-WA) said to Yahoo Finance EIC Andy Serwer.It’s unclear what exactly will come of all this. But tighter regulation isn’t out of the question. And that could be bad news for the stocks.“In the past, antitrust regulation has led to slower growth and lower valuations for affected companies, including the MSFT rulings that coincided with the popping of the Tech Bubble in 2000,” Goldman Sachs’ David Kostin wrote on Wednesday. “In the two months around those rulings, MSFT declined by nearly 45%, lagging the S&P 500 by roughly 35 percentage points.“Story continuesStrategists argue earnings justify the stock prices“The record degree of concentration in the US equity market has continued to rise,” Kostin said. “These stocks have returned 35% YTD, compared with -5% for the remaining 495 S&P 500 stocks, and each of the five set a new record high this month.”FAAMG are why the S&P 500 is up this year. (Goldman Sachs)And the more Big Tech stocks outperform, the more you hear some market participants asking if this is the dot com bubble being relived.However, more sanguine stock market experts all point to one thing: earnings. While these companies have seen their market caps balloon, so have their earnings, which in turn have kept valuations reasonable.“The top 5 stocks (AAPL, MSFT, AMZN, FB, GOOG) are 18% of earnings and like >80% of 2020 EPS growth,” Fundstrat’s Tom Lee wrote on Friday. “So, their 22% market cap share does not seem so out of line with their nearly 20% net income share.”FAAMG represent a huge share of S&P 500 earnings.(Fundstrat)Credit Suisse’s Jonathan Golub pointed to the same metrics, adding that price/earnings (P/E) ratios are lower today than they were when the tech bubble burst. “[Y]ou can cross market concentration off your list of things to fret about,” he said.It’s worth noting that three of these names aren’t categorized as tech, according to S&P’s standard. Alphabet and Facebook fall under the communication services sector and Amazon is considered consumer discretionary. If you were to fold them into S&P’s tech sector — which is around 27% of the S&P 500 — all those companies in aggregate would make up closer to 37.5% of the index, according to analysis done by Nicholas Colas, co-founder of DataTrek Research.To be clear, Colas isn’t concerned about how Big Tech has gotten either. He reviewed past instances when various sectors had peaks in their S&P 500 weightings, and observed that each occurrence came with a unique macro narrative. And tech today is unique in that as a sector, it’s less likely to be disrupted and more likely to be the disruptor, which puts it in a position to take more relative market cap from other sectors.“[B]eing market historians at heart, we keep coming back to that 29% peak Energy weight in 1980 because it’s the only non-Tech sector to ever get close to Tech’s current +30% weight,” Colas wrote. “If prosaic oil companies were once 29% of the S&P, why can’t innovative Tech one day be 50% of the index? Yes, at that point I think we’d all agree Tech would be in a bubble just like Energy was in 1980. But we’re not there yet.”A decline in these stocks would be tough to recoupNone of this is to suggest investors are free and clear.“Even if supported by fundamentals, extreme market concentration creates macro and micro risks,” Kostin wrote.On the micro side, he points to the risk of regulation. On the macro side, even passive investors who have their money tied up in an S&P 500 index fund should be wary as a pull back in these five stocks could put a major dent in their performance.“For example, if the FAAMG stocks declined by 10%, in order to keep the market trading flat the bottom 100 S&P 500 stocks would have to rise by a collective 90%,” Kostin said.Perhaps this rotation is already under way as Big Tech stocks underperformed the market last week. Which reminds us of yet another risk facing big tech: the U.S.-China trade war.“Tensions between the US and China have ratcheted up again, with a round of diplomatic tit-for-tat and more hawkish rhetoric from both sides,” Capital Economics’ Jonas Goltermann wrote on Friday, adding that it has “weighed on some sectors in the US, such as semiconductors and IT, which would be particularly exposed if the US-China trade war were to restart.”“If US-China tensions were again to become a key driver in markets in the run-up to the November election – their relationship appears set to remain a central issue in the campaign – some of the firms and sectors that have done best so far this year may no longer lead the way over the coming months,” he said.All of this sets us up for what should be an eventful week.By Sam Ro, managing editor. Follow him at @SamRoWhat to watch todayEconomy8:30 a.m. ET: Durable goods orders, June preliminary (7.0% expected, 15.7% in May)8:30 a.m. ET: Durable goods orders excluding transportation, June preliminary (3.5% expected, 3.7% in May)8:30 a.m. ET: Capital goods orders, non-defense excluding aircraft, June preliminary (2.4% expected, 1.6% in May)8:30 a.m. ET: Capital goods shipments, non-defense excluding aircraft, June preliminary (2.8% expected, 1.5% in May)10:30 a.m. ET: Dallas Fed Manufacturing Activity Index, July (-4.9 expected, -6.1 in June)Earnings6:00 a.m. ET: Hasbro (HAS) is expected to report adjusted earnings of 20 cents per share on revenue of $994.8 million7:45 a.m. ET: Albertsons (ACI) is expected to report adjusted earnings of $1.31 on revenue of $22.8 billionTop NewsGold surges to new all-time high as stocks mixed [Yahoo Finance UK]White House, Senate GOP try again on $1 trillion virus aid [AP]SAP to spin off Qualtrics, partly unwinding $8 billion buy [Reuters]Chinese electric SUV maker seeks up to $950 million in U.S. IPO [Bloomberg]YAHOO FINANCE HIGHLIGHTSSteve Case: How Congress can back US startups, prevent 'massive brain drain'Companies sidestep traditional IPOs by choosing SPACs, direct listingsWNBA Commissioner: 'There is nothing political about Black Lives Matter'—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}