{"article": [{"url": "https://finance.yahoo.com/news/what-we-learned-and-probably-didnt-learn-from-the-hertz-debacle-160658041.html", "published": 1594293260.0, "headline": "What we learned – and probably didn't learn – from the Hertz debacle", "body": "Hertz may be almost worthless, but it became a very popular stock and it surged in value. But now, the interest has waned and so has the stock. (Photo by Cindy Ord/Getty Images)One of the weirdest stories in investing in 2020 has fizzled out — for now at least.Rental car company Hertz (HTZ) declared bankruptcy on May 22. And by June 3 the company’s stock had fallen to a mere 82 cents a share from around $3. Soon after, something truly wild happened.For reasons possibly associated with the closure of sports and betting amid the coronavirus pandemic, extra stimulus money, and perhaps even a “if you can’t beat ‘em join ‘em” attitude to Wall Street, a ton of people started using Hertz as a casino.Day traders began to pour into the stock, hoping a good-news bump would let them quickly double their money and cash out.With an absolutely incredible trading volume for the stock — 533 million in trades on one day, versus a typical average of a few million — the stock’s volatility reached category 5.The company, which let us not forget was bankrupt, decided to capitalize (literally) on its stock movements and use the opportunity to sell $1 billion in new stock because it apparently now had value.Market observers were dumbfounded and uniformly on the side of not participating in whatever this was.\"What you're getting right now is this great disconnect between fundamentals and finance,\" said Mohamed El-Erian, chief economic adviser at Allianz, on CNBC with great consternation. \"Take Hertz. A company in a bankruptcy procedure that saw its share price go up....now they're talking about issuing stocks, warning investors they may be worthless.\"“Clearly there’s some speculative fever going on right now,” Kathy Jones, Charles Schwab’s chief fixed income strategist, said on Yahoo Finance.Looking at trading volumes and Robinhood activity, it’s clear that many people jumped in during the madness. Some investors did well — Twitter and the financial media are littered with stories of people doubling their money.Trading has died down. So has the stock.As the media surrounding the stock reached fever pitch and settled down, so did trading volumes, which trickled for 10 days after peak “Hertz mania.” A report from Jeffries suggesting that CarMax and AutoNation might “swoop in” to buy Hertz pushed shares 50% higher. Though in overall terms, it was just $1.25 to $1.95, so probably not enough to cover those who got into the trade after June 4.Story continuesSince then, not much has happened. (A Forbes contributor this week published an article “Update on Hertz: Still worthless”).What market experts, the personal finance community, and Hertz itself said would happen is happening. The stock has been steadily tracking at just above a dollar. (Hertz said stock it would issue would be essentially worthless unless an “unanticipated” improvement happened because debtors get paid before shareholders and there probably wouldn’t be anything left.)As the excitement died down, so did the stock’s volatility. Not only was the value gone but also its volatility, which provided its allure as an ersatz roulette wheel. It’s not making regular ups and downs anymore and for the dopamine seekers, it’s useless.As one Twitter user who lost money wrote, \"I came too late to the party.”A sign is posted in the entrance to the Hertz Rent-A-Car desk at San Francisco International Airport on April 30, 2020 in San Francisco, California. According to a report in the Wall Street Journal, Hertz is preparing to file for bankruptcy as the travel industry has come to a standstill due to the coronavirus (COVID-19) pandemic. (Photo by Justin Sullivan/Getty Images)Lessons? For the people who lose maybe. But maybe not.So what have we learned from all of this? Probably nothing.“The last time I bought a Company with #Bankruptcy worries was #Sunedison and I lost a massive chunk of money,” wrote one daytrader on Twitter. “My idiot #Robinhood investing friend bought 10k shares of $HTZ at .80 cents..... He told me Scared Money doesn’t Make money. His portfolio is up 300% this year…”A few days later the same person bought some Hertz: “Yolo $HTZ why not. Risking some lunch money over night for a steak dinner.”One seemingly obvious lesson: don’t invest any more money in wildly volatile bankrupt companies than you might risk at the casino.Everyone involved in Hertz who made money— except for people who bought when it was worth less than $1.30 a share — have sold their shares. In other words, they are not holding the hot potato. They have cashed out.A story from the New York Times this week about Robinhood day traders found that Robinhood users often trade the riskiest products, sometimes to devastating losses. For a week in June, Hertz was the number-two most popular stock.Contrasting this to bitcoin, it’s clear that some irrational exuberance retail investor bubbles are not all the same. Though this bears some similarities with the Great Bitcoin Thanksgiving, one key difference is bitcoin was not a bankrupt company that had to pay all creditors before shareholders. Perhaps incredibly, bitcoin had value — if not only to the true, long-term believers.What also became clear is how wild daily volatility (~20%) can happen to any old stock, but that stock-goes-bananas roller-coaster volatility (~400%) probably takes something special, like what happened to Hertz for a few days before everyone got bored and realized the stock would probably end up where people said it would. Even Thursday, an 8% surge — huge for a normal company — felt like nothing.The company that went bankrupt — which means broke, a.k.a. no money — ends up being worth essentially nothing. That lesson, however, is probably one that people did not learn.Here’s what someone wrote on June 17, right before the stock took a nose dive:“Looks like im bout to make back the money I thought I lost on $HTZ,” wrote one Twitter user right before the stock began to plummet. “This is why you hold.”For those who are still holding, waiting for another bump, it’s going to take some real patience. No one is trading it much anymore just for the fun of it. For the stock to go up, it’ll actually require some good news, not just a market frenzy.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Black communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey'We're seeing a 6,000% increase in spam': IBM cyber VP"}]}