{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-20-2020-221556031.html", "published": 1595257940.0, "headline": "Stock market news live updates: Nasdaq rises as tech shares jump; S&P 500 turns positive for YTD", "body": "Stocks rose Monday as investors looked ahead to a packed week of earnings, stimulus talks and congressional testimony from Covid-19 vaccine developers.[Click here to read what’s moving markets heading into Tuesday, July 21]The Nasdaq Composite rose more than 2% as shares of Amazon jumped 8%, after Goldman Sachs raised its price target on the e-commerce stock to $3800 from $3000. Other internet and software stocks also outperformed Monday afternoon.The three major indices reacted mutedly after The Lancet medical journal published promising results of a Covid-19 vaccine study by the University of Oxford and AstraZenaca. Results of the Oxford-AstraZeneca study had been highly anticipated over the weekend, after reports that upbeat data would be published surfaced late last week. Earlier in the morning, Pfizer and BioNTech reported positive early data from their own Covid-19 vaccine study.Over the weekend, coronavirus case and death counts rose again in the US, with the domestic death toll topping 140,000. Cases in Florida rose by more than 10,000 for a fifth straight day as of Sunday. California’s new cases rose by more than 9,300, or well above the 8,487 average over the prior two weeks, as the state struggled to reign in infections. In Texas, new cases rose by 7,300 as of Sunday, falling below the 10,000 mark for new cases for the first time since July 13.With Congress returning from a more than two-week recess on Monday, lawmakers are set to begin discussions for another round of stimulus to help relieve individuals and companies impacted by the coronavirus pandemic. White House Chief of Staff Mark Meadows told Fox News on Sunday that the talks would begin at the White House at the start of this week, with Senate Majority Leader Mitch McConnell, Treasury Secretary Steven Mnuchin and House Republican Leader Kevin McCarthy present.On Tuesday, officials from Merck (MRK), Moderna (MRNA), Pfizer (PFE), AstraZeneca (AZN) and Johnson & Johnson (JNJ) are set to testify on July 21 before the House Committee of Energy and Commerce to discuss their work in creating inoculations for Covid-19.Story continuesInvestors are also gearing up for a packed slate of quarterly earnings results this week, which will reflect the extent of the damage the pandemic has done to corporate profits. Companies comprising about one-quarter of the S&P 500 are set to deliver earnings results in the coming week, representing one of the heaviest weeks of reports this quarter. About 13.9% of the S&P 500’s market capitalization reported second-quarter results as of this morning, with the big banks, Netflix (NFLX) and Johnson & Johnson (JNJ) among the big reporters last week.“As with the big banks that reported last week results will likely be mixed, identifying winners and losers in a tough environment of unprecedented dimension,” Oppenheimer strategist John Stoltzfus said.Second-quarter earnings per share are “projected to experience the greatest contraction of the current crisis, -43.0% versus the same quarter last year,” Credit Suisse strategist Jonathan Golub wrote in a note Friday. “That said, company results have been topping forecasts by +13.0%, more than any quarter since 1Q10.”—4:02 p.m. ET: S&P 500 closes at 5-month high as Amazon leads tech rallyHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +27.11 (+0.84%) to 3,251.84Dow (^DJI): +8.98 (+0.03%) to 26,680.93Nasdaq (^IXIC): +263.90 (+2.51%) to 10,767.09Crude (CL=F): +$0.11 (+0.27%) to $40.70 a barrelGold (GC=F): +$8.50 (+0.47%) to $1,818.50 per ounce10-year Treasury (^TNX): -0.8 bps to yield 0.6200%—12:04 p.m. ET: S&P 500 turns positive for the year to date as tech shares surge againThe S&P 500 and Nasdaq traded higher Monday afternoon, with the S&P 500 breaching 3,230.78 to turn positive for the year to date.The consumer discretionary sector, which contains Amazon, led gains in the blue-chip index, rising nearly 2% intraday. The information technology and communication services sectors also outperformed.The Dow held in the red as shares of Walgreens Boots Alliance and Dow Inc. each sank more than 2%.—9:46 a.m. ET: Chevron trades slightly lower after announcing $5 billion acquisition of Noble EnergyChevron (CVX) shares were off about 1% after market open Monday, after the energy giant announced it agreed to purchase Noble Energy in an all-stock transaction worth $5 billion. The tie-up is set to be the largest oil patch deal since the beginning of the coronavirus pandemic, with the outbreak sapping up oil demand and denting the market capitalizations of a host of energy companies including Noble, which has seen its stock sink 61% for the year to date through Friday.“We believe it is prudent for Chevron to use its strong balance sheet to acquire resources in the current stressed environment,” Jefferies analyst Jason Gammel said in a note Monday morning. “Valuation on the transaction strikes us as quite reasonable and the effect on the balance sheet is very manageable.”“Noble is somewhat of a mini-Anadarko with its DJ and Permian shale assets plus international exposure, and fits Chevron’s quality/return criteria,” he added.—9:42 a.m. ET: Stocks mixed, with vaccine updates in focusHere were the main moves in markets, as of 9:42 a.m. ET:S&P 500 (^GSPC): -5.51 points (+0.17%) to 3,219.22Dow (^DJI): -53.94 points (-0.2%) to 26,618.01Nasdaq (^IXIC): -6.66 points (-0.06%) to 10,497.02Crude (CL=F): -$0.27 (-0.67%) to $40.32 a barrelGold (GC=F): +$6.20 (+0.34%) to $1,816.20 per ounce10-year Treasury (^TNX): -2.1 bps to yield 0.607%—9:36 a.m. ET: Oxford-AstraZeneca Covid-19 vaccine study produces promising results; AstraZeneca shares jumpA potential coronavirus vaccine being developed by the University of Oxford and AstraZeneca increased both neutralizing antibodies and immune T-cells that target the Covid-19 virus, according to results published in The Lancet medical journal on Monday.Shares of AstraZeneca on the London Stock Exchange jumped 6% following the news.—9:10 a.m. ET: Pfizer shares rise after reporting positive early data from Covid-19 vaccine study; Moderna shares dropPfizer and BioNTech on Monday reported early positive data from the two companies’ German phase 1/2 Covid-19 vaccine study, according to a statement. The results included the study’s first T Cell response data.Stock futures on the three major indices pushed modestly higher after the press release. Shares of Pfizer rose, while Moderna – which is working to develop its own vaccine – sank more than 9% in early trading.—7:19 a.m. ET Monday: Stock futures point to mixed openHere were the main moves in markets, as of 7:19 a.m. ET:S&P 500 futures (ES=F): 3,208.25, down 5.75 points or 0.18%Dow futures (YM=F): 26,495.00, down 25 points, or 0.09%Nasdaq futures (NQ=F): 10,637.00, up 14.5 points, or 0.14%Crude (CL=F): -$0.31 (-0.76%) to $40.28 a barrelGold (GC=F): +$3.80 (+0.21%) to $1,813.80 per ounce10-year Treasury (^TNX): -0.8 bps to yield 0.62%—6:04 p.m. ET Sunday: Stock futures tick higher as overnight session kicks offHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:04 p.m. ET:S&P 500 futures (ES=F): 3,214.75, up 0.75 points or 0.02%Dow futures (YM=F): 26,538.00, up 18 points, or 0.07%Nasdaq futures (NQ=F): 10,635.25, up 12.75 points, or 0.12%NEW YORK, NEW YORK - MAY 26: Traders walk into the New York Stock Exchange (NYSE) on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}