{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-johnson-johnson-vaccine-enters-phase-3-as-fauci-heads-to-senate-125219576.html", "published": 1600848020.0, "headline": "Coronavirus update: Johnson & Johnson vaccine enters phase 3 as Fauci heads to Senate", "body": "Johnson & Johnson (JNJ) announced on Wednesday that its coronavirus vaccine candidate had entered the late stage clinical phase, becoming the fourth company to do so in the global search for an effective COVID-19 inoculation.The drug giant, whose candidate is a late entrant into the Phase 3 stage of development, previously announced its single-dose candidate. However, JNJ’s treatment differs in key ways from those being developed by the likes of Moderna (MRNA), Pfizer (PFE) and Novavax (NVAX), and will have more than 60,000 participants globally. The news helped to boost markets in pre-market action.While two of the U.S. frontrunners employ mRNA technology, J&J’s approach is more similar to AstraZeneca (AZN) which has halted trials in the U.S. after an unexplained illness in a participant in the U.K. trial. While the U.K. has resumed its Phase 3 trial, the U.S. continues to investigate.J&J’s candidate does not need the same deep-freeze temperatures for storage that are making the two leading candidates a challenge to distribute. The adenovirus vector technology does require refrigeration, but at a normal temperature that existing vaccine infrastructure uses, which bodes well for global distribution and production.J&J’s trials, done in collaboration with the National Institute of Allergy and Infectious Diseases, adds to a growing portfolio of COVID-19 inoculation candidates in the U.S. that are being developed at a record-breaking pace.“Four COVID-19 vaccine candidates are in Phase 3 clinical testing in the United States just over eight months after SARS-CoV-2 was identified,” said NIAID director Anthony Fauci, in a statement.“This is an unprecedented feat for the scientific community made possible by decades of progress in vaccine technology and a coordinated, strategic approach across government, industry and academia,” he added.Separately, the U.K. announced it will begin the world’s first human challenge trials — or purposely infecting individuals with Covid-19— early next year. The government-funded trial includes 2,000 potential volunteers, and relies on Gilead Sciences’ (GILD) antiviral remdesivir to manage any negative reactions. Remdesivir has been the only antiviral to-date to receive emergency use authorization against the virus in the U.S.Story continuesMeanwhile, the U.S. Centers for Disease Control & Prevention (CDC) is gearing up for distribution of whichever candidate is proven safe first, having earlier notified states to prepare for such an event.On Wednesday, the CDC announced it will award $200 million to 64 jurisdictions participating in the existing Immunizations and Vaccines for Children cooperative agreement. That program, which first began in 2008, has disbursed more than $4.1 billion in efforts to ensure immunization for children in the U.S.“With these $200 million in new funds, jurisdictions can develop and update plans for the eventual distribution and administration of the safe and effective vaccines that will help bring this pandemic to an end,” U.S. Health and Human Services (HHS) Sec. Alex Azar said in a statement.There are over 31 million cases worldwide. (Graphic: David Foster/Yahoo Finance)Health officials face CongressFour top health officials faced a Congressional committee to answer questions about the federal response to the COVID-19 outbreak.The list includes Fauci, CDC director Robert Redfield, U.S. Food and Drug (FDA) commissioner Stephen Hahn and testing czar Adm. Brett Giroir.The Senate Health, Education, Labor and Pensions committee members spent significant time grilling both Redfield and Hahn on recent controversial issues within each department. The CDC came under fire for recently removing what it called a draft guidance confirming the significant risk from aerosolized transmission of the virus, and it previously faced a battle of its credibility after reports that political appointees were interfering in weekly data reports about the virus’s impact on various communities and ways to curb future outbreaks.Redfield maintained that the CDC’s career professionals remain in control of the reports, and there has been no political interference.In addition, Redfield said a new report will be out soon that shows that more than 90% of Americans are still susceptible to the virus.Hahn, meanwhile, faced several questions about White House pressure to produce a vaccine by Election Day.Hahn said the agency will seek the input of independent advisory committees, as well as provide the public an opportunity to comment.Hahn said any issuance of an emergency use authorization includes data from “at least one, well-designed Phase 3 clinical trial” and the agency would not authorize a vaccine that the career professionals are uncomfortable with.“FDA will not permit any pressure from anyone to change that,” he said, adding that, “it's also essential that the criticism we get never shakes the underlying faith the public has, and should have, in the FDA.”Meanwhile, the FDA is planning to expand the monitoring requirement for a vaccine, extending it to two months rather than any shorter timeframes.This would extend the potential timeline for vaccines to be authorized or approved, but carries political implications as it would miss the Election Day deadline President Donald Trump has eagerly touted.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}