{"article": [{"url": "https://finance.yahoo.com/news/5-campaign-promises-trump-has-given-up-on-182247944.html", "published": 1598362220.0, "headline": "5 campaign promises Trump has given up on", "body": "President Trump has kept about one-fourth of his 2016 campaign promises, according to Politifact. The big ones: Cutting taxes, renegotiating the North American Free Trade Agreement, slapping tariffs on Chinese imports and withdrawing from the Paris climate accord.But there are many unkept promises, including a few Trump probably wants voters to forget about as they contemplate whether he deserves a second term. The Trump campaign recently released a list of 50 goals for a second Trump term, in 10 broad areas such as the economy and health care. There’s no detail on how Trump would accomplish any of the 50 bullet points, but the list gives Trump a starting point for outlining a vision for a second term.Some of Trump’s new campaign promises are do-overs Trump didn’t accomplish the first time around. He still wants a big infrastructure program, for instance, but instead of using the $550 billion price tag he used in 2016, Trump now says he simply wants to “build the world’s greatest infrastructure system.” He still wants to bring back manufacturing jobs from China, an elusive goal that his trade war China has not yet brought about. And Trump still wants to impose term limits on members of Congress, which will never happen but plays well with voters sick of congressional gridlock.Then there are the campaign promises from 2016 Trump seems to have given up on, perhaps because they were unrealistic to start with and ended up as political losers. Here are 5 promises from Trump’s 2016 campaign that don’t appear on his 2020 agenda:Mexico paying for the southwest-border wall. Every rational person knew Mexico wasn’t going to pay for a wall it didn’t want. Trump insisted he could get Mexico to pay billions for the wall indirectly, through reduced foreign aid or some kind of adjustment in the trade balance between the two countries. But none of that has happened, and Trump hasn’t said much about Mexico’s contribution to the wall since 2019.Story continuesPresident Donald Trump tours a section of the border wall, Tuesday, June 23, 2020, in San Luis, Ariz. (AP Photo/Evan Vucci)Repealing Obamacare. Eliminating the Affordable Care Act was a key plank of Trump’s pitch to voters in 2016. But the Republican-controlled Congress tried and failed to kill the law in 2017. Republicans have never had a replacement plan ready to go, suggesting the repeal chorus was mostly symbolic. There is still one active lawsuit seeking to overturn the ACA, which the Trump administration supports. The Supreme Court will hear the case in November, after Election Day, and rule sometime in 2021. It’s possible the suit could succeed, but the Supreme Court has upheld the ACA once before, and many legal analysts think it will again. The ACA has grown in popularity over time, with 51% of Americans now saying they support it. Only 36% oppose it. So the issue may now be a loser with voters.Paying down the federal debt. Try not to laugh, but in 2016 Trump said he’d eliminate the national debt in 8 years. He heralded his mastery of debt as a businessman, and also said he’d adopt the “penny plan,” which would cut discretionary federal spending by 1% per year and eventually yield savings of $1 trillion. Welp. Before the coronavirus, the national debt rose by $3.1 trillion from 2016 through 2019, in part because the 2017 Trump tax cuts slashed revenue coming into the Treasury. Since January 1, the national debt has soared by another $2.5 trillion, due to mass unemployment, further cuts in Treasury revenue and trillions in new stimulus spending. The debt has exploded more under Trump than under any post-war president, something he’d rather not talk about this year.Four percent economic growth. As a candidate in 2016, Trump assailed his predecessor Barack Obama’s handling of the economy and said he’d boost growth from the mid 2% range to 4% or better. The best Trump managed was 3% real GDP growth in 2018, aided in large part by the stimulative tax cuts that went into effect at the start of that year. GDP growth dropped to an Obama-esque 2.2% in 2019, and the coronavirus shutdowns have now sent GDP growth into an underground bunker. Trump doesn’t have any GDP targets for his second term.Releasing his tax returns. In 2014, Trump said that if he ever decided to run for president, he’d release his tax returns, as every other major presidential candidate has done since the 1970s. In 2016, when he was the Republican nominee, Trump said he’d release his tax returns once the IRS was finished auditing them, even though an audit shouldn’t stand in the way. Trump still hasn’t released his tax returns, of course, and it’s clear he never will unless forced to do so. Trump is fighting at least three legal battles to keep his financial documents out of the hands of investigators from New York State, New York City and the House of Representatives. Maybe the IRS will finally finish its audit if Trump loses in November, and his returns would no longer be a matter of pressing public concern.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Amid the party’s convention, some Republicans revoltSteve Bannon, revealed as a petty grifterWhy Trump wants to shackle the postal service11 ways Trump is out of touch with votersEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}