{"article": [{"url": "https://finance.yahoo.com/news/samsung-galaxy-note20-ultra-180417845.html", "published": 1598447540.0, "headline": "Samsung’s Galaxy Note20 Ultra is absurdly large, and expensive, but worth it for the power and stylus", "body": "Samsung’s Galaxy Note20 Ultra is a beast of a smartphone. It packs a huge display, stylish design, impressive battery life, and the line’s most crucial ingredient: the S Pen stylus.At $1,299, though, the Note20 Ultra also carries a beast of a price tag. But that price gets you a host of features that Android fans looking for a top-flight device will certainly appreciate, including 5G connectivity.Samsung's Galaxy Note20 Ultra is a huge smartphone that packs the company's signature S Pen stylus. (Image: Howley)Samsung, however, also offers a slightly smaller and less expensive version of the Note20 for $999, as well as its $999 S20+ 5G, and $1,399 S20 Ultra, giving consumers a dizzying array of options to choose from.A fresh take on a giant smartphoneSamsung’s Galaxy Note line brought big-screen smartphones into the mainstream. When the original Note launched in 2011, it packed a 5.3-inch display that drew stares for its then-massive size. Fast forward 9 years, and no one bats an eye at the nearly 7-inch display on the Note20 Ultra.For 2020, Samsung has cleaned up the camera cover on the Note20 Ultra’s back panel, the three lenses are now more exaggerated, giving them a far more appealing look than the thin strip of lenses found on the Note10.This time around, Samsung has given the Note20 Ultra a fresh bronze paint job as its go-to color, making the handset look and feel just a bit more luxurious than its predecessor.The Note20 Ultra’s enormous display is fantastic for watching movies and flipping through Instagram or TikTok. The 6.9-inch panel uses Samsung’s AMOLED 2X Infinity-O Display technology, which basically means it produces vibrant colors and packs a 120hz refresh rate. That’s more or less the same kind of display you’ll find on the Galaxy S20 line.The Note20 Ultra packs an enormous 6.9-inch display. (Image: Howley)That refresh rate, which measures the number of times the screen shows a new image each second, means scrolling through websites and even writing on the display with the S Pen stylus looks and feels smoother.But make no mistake, the Note20 Ultra is not for people who want a more compact smartphone. Measuring 6.5 inches tall, the Note20 Ultra is bigger than even Apple’s (AAPL) iPhone 11 Pro Max, which tops out at 6.2 inches. Though that phone also has a smaller 6.5-inch display.Story continuesIf you’re used to rocking a larger phone, though, it shouldn’t take much getting used to.S Pen and air writingSamsung always tries to add new, interesting features to its S Pen stylus to make it more than just a, well, stylus. For the Note20 line, that means a handful of what Samsung calls Air Actions have been thrown into the mix.Air Actions are gestures you can make with the S Pen while holding down the pen’s action button that let you do things like control the volume in Spotify by gesturing up or down, or pulling up your recent apps by gesturing back.It’s a nifty party trick, but I can’t see many people actually using it in any real-world scenario.The Note20 Ultra's biggest attractive, beyond its size, is its S Pen stylus. (Image: Howley)Still, the S Pen is a champion when it comes to taking on-screen notes and marking up documents, which is exactly what it’s meant to do. And, as usual, the tip of the stylus offers an excellent amount of resistance, making writing feel far more natural.Quality camerasWhen Samsung released its Galaxy S20 Ultra earlier this year, it added an over-the-top 100x zoom function that looked more impressive on paper than its actual results did. So Samsung scaled that back the Note20 Ultra, giving the phone a 50x zoom instead.Still, I found the extreme zoom to be minimally useful for taking clear photos. Sure, you get a sense of the scene, but you’ll still see blurring just as I did with the 100x zoom on the S20 Ultra.The Note20 captures sharp, clear photos with a slightly blue tint. (Image: Howley)When taking shots with the Note20 Ultra’s wide-angle camera, though, images came out crisp and clear. Even low-light shots looked surprisingly good. When compared with shots taken using the iPhone 11 Pro Max, I found the Note20 Ultra’s images tended to look a bit less vibrant, with colors appearing flatter on the Ultra.The Note20 Ultra’s selfie camera, meanwhile, proved softer than the iPhone 11 Pro Max’s, but produced brighter live video images.The Note20 captures vibrant low-light shots. (Image: Howley)Speaking of video, Samsung has also added the ability to control where the Note20 Ultra picks up sound in your movies. You can force the phone to focus on audio from in front of it, around it, or zoom in on an audio source. That should prove helpful when you’re trying to capture a more cinematic experience in your home movies.Performance and powerThe Galaxy Note20 Ultra is meant to be a monster of a smartphone, and it certainly has the performance chops to fit that role. It packs a Qualcomm (QCOM) Snapdragon 865+ processor, and 12GB of RAM with your choice of 128GB, 256GB, or 512GB of storage space. There’s also a microSD card slot that supports cards of up to 1TB in size.The Note20 Ultra packs three cameras and tons of processing power. (Image: Howley)In terms of battery life, the Note20 Ultra was able to handle streaming live video over Google Meets during Yahoo Finance’s live daily broadcasts for an hour without running down nearly as quickly as the iPhone 11 Pro Max.Both phones end up getting me through an entire day even when I’m broadcasting, but the Note20 Ultra had more juice by the time I was ready to hit the sack.Should you get it?The Note20 Ultra is a powerhouse of a smartphone thanks to its enormous screen, powerful processor, and exceptional battery life. It’s camera could use some work, and fewer gimmicks, but it’s still one of the better choices on the market.If you’re not a fan of the S Pen stylus, I’d recommend opting for Samsung’s Galaxy S20 line of handsets. They offer many of the same features without the added pen. If you’re looking for a stylus, but the Ultra is too pricey, there’s also the standard Note20, which starts at $999.You won’t get the same kind of camera and will have to work with a 6.7-inch panel rather than the Ultra’s 6.9-inch display, but that’s not likely to be a problem for most users.If you want the biggest baddest Note, though, opt for the Ultra.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Microsoft adds transcription to Microsoft 365 productivity suiteFitbit launches new Sense smartwatch to help track and reduce your endless stressA majority of Americans think social media sites are politically bias: ReportWhat the heck is happening with Apple, Google, and ‘Fortnite’?: Tech Support Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}