{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-september-12-2020-172853451.html", "published": 1600329620.0, "headline": "Jobless claims: Another 860,000 Americans filed new unemployment claims last week", "body": "The ranks of jobless Americans grew yet again last week, with 860,000 first-time unemployment benefits filed last week, rising slightly from the prior week’s level and reaffirming that a relatively robust U.S. recovery is losing momentum.The U.S. Department of Labor (DOL) released its weekly jobless claims report at 8:30 a.m. ET Thursday. Here are the main metrics from the report, compared to Bloomberg estimates:Initial jobless claims, week ended Sept. 12: 860,000 vs 850,000 expected, and 884,000 during the prior weekContinuing claims, week ended Sept. 5: 12.628 million vs 13 million expected, and 13.385 million during the prior weekThursday’s figure represented the third consecutive week that new jobless claims remained below the psychologically important 1 million level, yet they remain within historically high levels triggered by the COVID-19 pandemic. The dip in continuing claims was also an encouraging sign.Still, the labor market’s recovery has come a long way from the pandemic-era spike high of nearly 7 million weekly new claims seen in late March.The prior week’s drop below the 1 million mark, the second consecutive week, was attributed to a technical change made by the Labor Department, rather than a sustained improvement in unemployment.The trend in jobless claims has been markedly lower since the dramatic spike in March.Meanwhile, economists are growing increasingly fearful that Washington’s failure to forge consensus on a new coronavirus stimulus package — which also includes additional unemployment benefits — is a threat to a nascent rebound that has defied many of the worst predictions.Chris Rupkey, chief financial economist for MUFG Union Bank, warned clients in a note last week to not “be fooled” by the data. “The labor market may not be sinking but it sure isn’t getting any better either.”And while claims held steady on a seasonally adjusted basis last week, unadjusted claims actually rose by more than 20,000, or 2.4%, last week to over 857,000, led by an outsized pop in new claims in California. Continuing jobless claims, which are reported on a one-week lag and capture the number of individuals still receiving unemployment benefits, rose for the first time since mid-July last week to more than 13.3 million.Story continuesIn another sign of ongoing weakness in the labor market, consistently high numbers of individuals have been filing for, and receiving, jobless benefits from programs newly created during the pandemic.According to the latest data, more than 13 million Americans were receiving benefits in regular state programs, and 14.5 million were receiving unemployment checks from the Pandemic Unemployment Assistance program, or the service aimed at self-employed and gig workers who don’t qualify for regular unemployment compensation but have still been impacted by the pandemic.The total number of workers applying for unemployment benefits from all programs increased for a second consecutive week to 29.6 million claims as of the latest data, which covered the week ending August 22. About 1.6 million individuals had claimed benefits in all programs in the same week last year.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}