{"article": [{"url": "https://finance.yahoo.com/news/fords-ceo-farley-promises-urgency-120310872.html", "published": 1601536280.0, "headline": "Ford's new CEO Farley promises urgency at automaker, shakes up management", "body": "By Ben KlaymanDETROIT (Reuters) - Ford Motor Co's <F.N> new chief executive, Jim Farley, on Thursday promised the U.S. automaker would move with urgency, responding to investor and analyst criticism of the speed at which his predecessor acted.Farley, on his first day as Ford's 11th CEO, also announced an executive shake-up that included naming a new chief financial officer.Ford's promise to accelerate its turnaround is not new at a time when it is executing an $11 billion restructuring.Farley was named chief operating officer in February and promised a faster return to strong profits. He was officially tapped to succeed Jim Hackett in August.“During the past three years, under Jim Hackett's leadership, we have made meaningful progress and opened the door to becoming a vibrant, profitably growing company,” Farley said in a statement on Thursday. “Now it's time to charge through that door.”Hackett and Ford have been criticized by some on Wall Street for not moving quickly enough on its restructuring. At the end of the second quarter, the Dearborn, Michigan-based company had incurred only $3.9 billion of the projected $11 billion in charges.Farley will face immediate tests in his new role, including ensuring a smooth launch for the highly profitable, top-selling F-150 pickup truck to avoid the costly missteps Ford experienced when it revamped the Ford Explorer SUV.Ford on Thursday reaffirmed its goal for operating margins of 8%, something it identified as a 2020 target before the coronavirus pandemic hit. It did not specify when it would achieve this target.Ford's operating margin was 4.1% last year, before falling to negative 4.8% in the first half of 2020 due to the coronavirus outbreak.The company also said John Lawler would succeed Tim Stone as CFO. Lawler most recently had been head of Ford Autonomous Vehicles and vice president of mobility partnerships. He also served as president of Ford China for nearly four years.Story continuesStone, who will remain with Ford through Oct. 15, accepted a job as COO and CFO with ASAPP Inc, an artificial-intelligence software company. Stone had been in the CFO job only since June 2019.Ford also said it would separate the Lincoln and marketing jobs to put greater focus on both. Joy Falotico, who had held both the Lincoln and global marketing jobs, will focus on Lincoln once a chief marketing officer is named, in a move meant to accelerate the brand's growth.Farley outlined his objectives during a virtual town hall meeting with Ford's global team on Thursday, saying the company will allocate capital to its strongest franchises and high-growth opportunities, such as the F-Series pickup truck and its commercial business.It also will add more affordable vehicles to its global lineup, build electric vehicles at scale and stand up new autonomous-enabled businesses, he said. Decision making will be pushed down to the regional level.Credit Suisse analyst Dan Levy welcomed Farley's urgency and Lawler's ascension, and said investors will expect increased disclosure under the new management team.Ford has moved to cut costs globally, including earlier this month when it said it would target cutting 1,400 U.S. salaried jobs by year end.Last year, Ford cut 7,000 salaried jobs globally, as well as targeting 12,000 additional layoffs and plant closures in Europe. It also restructured operations in China and South America.The automaker previously said it expects a full-year loss because of the pandemic's impact. It sees a pre-tax profit of between $500 million and $1.5 billion in the third quarter, and a loss in the fourth quarter as it launches several new vehicles.(Reporting by Ben Klayman in Detroit; editing by Jason Neely and Steve Orlofsky)"}]}