{"article": [{"url": "https://finance.yahoo.com/news/apple-watch-series-6-apple-watch-se-173214159.html", "published": 1600173620.0, "headline": "Apple debuts $399 Apple Watch Series 6 and $279 Apple Watch SE", "body": "Apple (AAPL) on Tuesday unveiled two new versions of its best-selling wearable, the Apple Watch. Called the Apple Watch Series 6 and Apple Watch SE, the watches will cost $399 and $279, respectively, when they launch on Sept. 18.The watches feature a variety of updates designed to appeal to both new and existing Apple Watch customers, and should help Apple continue to grow its Accessories business alongside the incredibly popular AirPods and AirPods Pro.See also: Apple goes all in with Fitness+ product and Apple One bundleThe Apple Watch Series 6 is the more premium of the two watches, and is the successor to the Series 5. The watch’s now-iconic design remains unchanged, as it more or less has since the original Apple Watch launched in 2015.The Apple Watch Series 6 features a new blood oxygen sensor and faster processor. (Image: Apple)Apple Watch Series 6The Series 6 will be available in two sizes. A 40mm version will be available for those with more petite wrists or who want a smaller watch face, while a 44mm version will fit on those who have thicker wrists or want a generally large screen size.The Series 6 will be available in a host of new colors including blue, gold, black, and red.Inside, the Series 6 features Apple’s new dual-core S6 processor for improved performance and a brighter always-on display, as well as an altimeter.Apple has also added a new sleep-tracking feature to watchOS 7, the operating system that powers the Apple Watch.See also: Apple to launch Fitness+ service for $9.99 per monthThe feature allows you to monitor your sleep each night, and determine how well you’ve slept by measuring micro-movements picked up by the watch’s accelerometer. Before you head to bed, the watch will also notify you of how much power it has left and, if it’s below 30%, recommend that you recharge it before hitting the sack.Apple has announced its new Apple Watch Series 6. (Image: Apple)The Series 6 also comes with a new blood oxygen level detector. Built into the underside of the watch, the sensor is able to measure your overall blood oxygen level and notify you if it’s low. Measurements take just 15 seconds, and will record background measurements while you sleep.Story continuesBlood oxygen level helps provide you with an understanding of your overall heart health.The new sensor further pushes Apple into the healthcare space following the release of the Series 5 and its ECG heart rhythm sensor. Healthcare monitoring could prove to be a lucrative area for Apple, and CEO Tim Cook himself has expressed his bullishness for the company’s healthcare efforts in the past.Tech newsletterThe company also introduced a new band called the Solo Loop, a silicon loop that is stretchable and lets you easily slip the watch onto your wrist. There’s no clasp or buckle, and it’s available in seven colors and multiple sizes to fit your wrist. A second version of the Solo Loop is also available in braided fabric alongside new Apple Watch Nike loops and Hermes bands.Apple has also introduced a new Family Setup feature that will let you set up a family member’s Apple Watch without them needing to use their own iPhone. Kids will also be able to communicate with parents. And a new School Time mode will turn on Do Not Disturb mode to keep kids focused on class.Apple Watch SEThe Apple Watch SE is Apple’s new mid-range watch. Starting at $279, it’s positioned to take on less expensive smartwatches from the likes of Fitbit, which is in the midst of being acquired by Google.Since the SE is meant to provide a mid-range experience, it lacks some of the headline features of the Series 6 including the S6 processor and blood oxygen sensor. Still, the SE will get the Series 6’s altimeter and accelerometer so it will support fall detection found on the Series 5 and Series 6The Apple Watch SE is a new mid-range Apple Watch with many of the features found on the more expensive Apple Watch Series 6. (Image: Apple)Surprisingly, Apple will also still offer its Apple Watch Series 3 as an entry-level watch for just $199.Apple is the world leader in smartwatch market share, claiming a whopping 36.3% of the global market, according to research firm Canalys. But the firm has to contend with serious competition from the likes of Huawei and Samsung. The Apple Watch Series 6 and SE, however, should help Apple hold the lead for the time being.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Oracle’s TikTok win gives it a chance to prove it can take on Amazon and MicrosoftHow to watch the Apple event on Sept. 15, and what to expectNetflix co-CEO on its advantage over Apple and Amazon: We have a ‘single focus’Microsoft Surface Duo review: A two-screen Android phone that could change everythingFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}