{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-spread-is-like-lighting-a-campfire-doctor-explains-174945497.html", "published": 1592312240.0, "headline": "Coronavirus spread is like 'lighting a campfire,' doctor explains", "body": "Despite social distancing measures on a national level, some parts of the U.S. are seeing spikes in the number of coronavirus cases compared to other states.The key questions becomes: Why?“Think about a fire like when you’re lighting a campfire,” Dr. Dara Kass, an associate professor of emergency medicine at Columbia University, said on Yahoo Finance’s The First Trade (video above). “When you decrease the amount of wood, the fire comes down, but it never really goes out. And as soon as you increase the amount of wood that can catch fire, the fire will come back again.”Kass added that in terms of coronavirus, lockdown policies “decrease the amount of burn that it can go through. And if we keep the virus at a low burn, keep socially distanced and keep people apart enough — not to stop businesses from moving forward, but to keep the fire from catching — then we can start to see a sustainable burn that also allows us to exist in a reasonable economy. So please, don’t think this virus has gone anywhere. It hasn’t. We’ve just quieted it down so that we can move forward.”A family enjoys a campfire at the Huttopia Sutton glamping ground in Quebec, Canada, on August 14, 2019. (Photo: SEBASTIEN ST-JEAN/AFP via Getty Images)‘The new normal if this is how we continue to act’Many U.S. states reopened their economies without meeting all of the guidelines suggested by the CDC.Criteria listed by the White House for beginning a phased reopening included: downward trajectory of both flu-like and COVID-like illnesses in a 14-day period, downward trajectory of documented COVID cases within 14-day period OR downward trajectory of positive tests as a percent of total tests in 14-day period, and hospitals being able to treat all patients without crisis care and a robust testing program in place for front line health care workers.States that reopened their economies significantly earlier than the others — including Texas, California, Arizona, Arkansas, Mississippi, Utah, North Carolina, and South Carolina — are now seeing increased rates of positive COVID-19 tests.Cases are declining in New York, but rising in other parts of the U.S. (Graphic: David Foster/Yahoo Finance)Many of these cases are being attributed to Memorial Day weekend activities, in which many crowds assembled throughout that weekend, potentially exposing themselves.Story continuesThe recent spikes are “the new normal if this is how we continue to act,” Kass said. “One of the things we talked about was that the states that opened early opened against the guidance of the White House. They didn't have the decreasing number of cases. They didn't have the tracking and tracing in place.”Making things more difficult, the White House has given conflicting guidance. Vice President Mike Pence reportedly told governors to explain to their citizens that increased testing is why there are more cases of coronavirus popping up.“The president often talks about embers,” Pence said, according to the New York Times, adding that “despite a mass increase in testing, we are still averaging roughly 20,000 cases a day, which is significantly down from six weeks ago.”There are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)And ahead of Trump’s campaign rally in Tulsa, Oklahoma, this weekend, Pence claimed that Oklahoma has flattened its curve of coronavirus cases, despite the fact that the state experienced its highest case total this past weekend.Several governors pushed for re-openings, citing the economic impact that shutdowns were having on small businesses. And many of the states’ residents ignored restrictions and reopened anyways.“If this is how people want to live their lives… this is the path they're choosing,” Kass said, “which is to say that if we are not waiting for the data and we're just opening up because we're tired of this virus, we're going to continue to see spikes and hospitalizations, you know, hit up at a time when we're going to have to somehow react or just let more people get sick and die.”Beachgoers take advantage of the opening of South Beach on June 10, 2020 in Miami Beach, Florida. (Photo by Cliff Hawkins/Getty Images)Why social distancing worksData has shown that social distancing rules and face masks work.According to a study by Nature Research, stay-at-home orders and other shutdowns likely prevented about 60 million coronavirus cases just in the U.S.“It’s not that the virus is weaker,” Kass said. “It’s that we’re better at addressing it. Think about the idea of our resources. Part of the reason we stayed home in the first place was not to overwhelm our health care system. It wasn’t to say that we had a fixed number of treatments and we would stop treating people. But we really needed to keep our system going forward.”Kass cited an incident at a hair salon in Missouri, in which two hairstylists who were symptomatic exposed 140 people but “none of whom got sick, because everybody was wearing masks.”Owner of Saint Germain Hair Salon in Washington, DC, Franck Rihouey wears a mask as he trims Joe PouxÕs hair on May 29, 2020. (Photo by JIM WATSON/AFP via Getty Images)According to medical journal The Lancet, the risk of coronavirus transmission without a mask is 17.4%. When wearing an N95 respirator or face mask, the risk drops to 3.1%.And although many people are relying on vaccine development to bring stability back to society, the earliest that one would be available is likely not until 2021 at the earliest. Even if that’s the case, it would be an extremely quick timeline compared to other vaccines.People wear protective face masks in Murray Hill during the coronavirus pandemic on May 30, 2020 in New York City. (Photo by Noam Galai/Getty Images)And in any case, Kass stressed, “we can’t simply wait that long to have our economy move forward. So we need to do things that are smart.” This means wearing masks, washing hands, respecting social distancing, and helping communities move forward in a sustainable manner.“The optimism is that we know that works,” Kass added. “And if we do it, we should be able to move forward consistently. We can open businesses and offices in ways that are socially distant but sustainable if we ask people to wear masks and expect it from them.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Coronavirus: Public health experts ranked 36 American activities based on riskCoronavirus: 'Children will probably be an important vector for transmission'WHO director warns: Masks can 'create a false sense of security'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}