{"article": [{"url": "https://finance.yahoo.com/news/trump-drug-czar-argues-border-wall-161225402.html", "published": 1592047940.0, "headline": "Trump's drug czar makes case for border wall being 'a force multiplier'", "body": "The border “wall” along the U.S.-Mexico border, which is more of a series of barriers erected by a succession of U.S. presidents, is currently 657 miles long.In February 2019, Trump declared a state of emergency to access billions of dollars for more construction. One year later, the White House extended it in order for the administration to continue using the funds taken from the budgets of various agencies.CBP data indicates that more barriers are set to be built. (Graphic: David Foster/Yahoo Finance)Jim Carroll, the director of the U.S. Office of National Drug Control Policy (ONDCP), explained why he is in favor of building more barriers.“What a wall does is it’s a force multiplier,” Carroll told Yahoo Finance in an interview. “Because if you’re down there, you see these wide open stretches. As a result, Border Patrol has to be all along there. By building the wall, what we’re doing is following people to a certain area.”View of the metal fence along the border in Sonoyta, Sonora state, northern Mexico, between the Altar desert in Mexico and the Arizona desert in the United States, on March 27, 2017. (Photo: PEDRO PARDO/AFP via Getty Images)In early 2016, then-candidate Trump asserted that his wall “is going to be a real wall, it’s going to be a high wall, it’s going to be a beautiful wall,” that it would cost “maybe $10 or $12 billion,” and that \"Mexico will pay for the wall — 100%!”However, this turned out not to be the case. Instead, the Trump administration requested funds through the 2020 defense spending bill but received less than what was asked for. Eventually, the demand for the border “wall” led to a 35-day shutdown from Dec. 22 to Jan. 25, until Congress approved an additional $1.4 billion for border building.About 44% of Americans agree with the idea of building a wall along the border, according to a December 2019 Fox News poll.U.S. President Donald Trump calls up Blake Marnell, wearing a jacket with bricks representing a border wall, to the stage during a 'Make America Great Again' campaign rally in Montoursville, Pennsylvania. (Photo: Drew Angerer/Getty Images)‘I just want to know’ what’s being brought in the U.S.President Trump has repeatedly argued that his wall would help stem the flow of both illegal immigration and illegal drugs.Carroll noted that at this point, now that Trump-era policies significantly reduced immigration from Mexico, the U.S. Customs and Border Protection (CBP) is primarily focused on the flow of drugs into the country.A U.S. Customs and Border Protection officer instructs an asylum seeker to wait in line on the international bridge from Mexico to the United States on December 09, 2019 next to the border town of Matamoros, Mexico. (Photo: John Moore/Getty Images)“They’re no longer working to provide humanitarian relief,” Carroll said. “They can get back to the mission of stopping the flow. The flow is not changed… What we need to do now is secure that border to be able to know exactly what is coming in. Someone else can worry about who is coming in. I worry about what is coming in. That’s my mission.”Story continuesCBP seized 2,545 pounds of fentanyl, 5,427 pounds of heroin, 68,585 pounds of methamphetamine, 89,207 pounds of cocaine, and 289,529 pounds of marijuana at lawful points of entry in the 2019 fiscal year. At unlawful points of entry, 266,882 pounds of marijuana, 14,434 pounds of methamphetamine, 226 pounds of fentanyl, 808 pounds of heroin, and 11,682 pounds of cocaine were seized that same year.Drug seizures increased for all but cocaine in the 2018 fiscal year. (Chart: Congressional Research Service)These areas include high intensity drug trafficking areas, known as HIDTAs. There are currently 33 throughout the country. According to the ONDCP, the HIDTA program “dismantled nearly 3,000 drug trafficking organizations, removed $16.5 billion in the wholesale value of drugs from the street, and made nearly 99,000 arrests” in 2018.“We want to make sure that we continue to research, but we also make sure that we have the ability to go after and prosecute traffickers,” Carroll said.Carroll stressed that “the best approach” towards people with addiction is “treatment, not incarceration.” However, he also believes that drug traffickers should face justice.The Southwest border is a major spot for drug trafficking. (Map: ONDCP)“The people who are trafficking, who are selling this, who have an addiction to greed and are just lining their wallets, those people need the full force, weight, and justice of the American system to come after them,” Carroll said. “Those people who are preying on the victims of the disease of addiction have no right to be able to remain free. Those are not the people for diversion courts. They have an addiction to greed. Those people are traffickers and those are the people that need to be held accountable.”He continued: “Drug traffickers ... are vastly different than someone on the street who is feeding an addiction by saying, ‘I bought this for $10. Give me $5 and we can share it.’ We’re talking about true traffickers. The traffickers have no barriers, no regulation, and they have finance, they have money. They’re willing to use any method they can to be able to do this.”Director of Office of National Drug Control Policy Jim Carroll speaks during a news briefing at the James Brady Press Briefing Room of the White House January 30, 2020 in Washington, DC. (Photo: Alex Wong/Getty Images)‘China was becoming the drug dealer of the world’Carroll noted that U.S. actions led China to reduce the flow of deadly fentanyl from China to Mexico, thereby reducing the amount of fentanyl into the U.S.Fentanyl is 50 to 100 times more potent than morphine. And according to the National Institute of Health (NIH), “synthetic opioids, including fentanyl, are now the most common drugs involved in drug overdose deaths in the United States.”Synthetic opioids like fentanyl accounted for nearly 70% of all drug overdose deaths in 2018.Fentanyl deaths have spiked over recent years. (Graphic: David Foster/Yahoo Finance)Back in November 2019, China cracked down on its fentanyl manufacturers by convicting nine people of smuggling the drug into the U.S., which ONDCP described as “a positive step.”“All we have to do is look at the results and see that the work we have done in China on this issue is paying off,” Carroll said. “We talk about a dramatic reduction in the amount of drugs that are being seized coming from China. It’s easy to focus on pounds. It’s easy to talk about the number of incidents. We have to remember we’re talking about our people’s lives.”Sen. Tom Cotton (R-AR), one of the co-sponsors of the Fentanyl Sanctions Act, called China “the world’s largest drug dealer” back in April 2019. Carroll said that the Chinese government expressed dismay when he travelled to the country and said “if they don’t stop, China was becoming the drug dealer of the world.”An officer from the US Customs and Border Protection, Trade and Cargo Division finds Oxycodon pills in a parcel. (Photo by JOHANNES EISELE/AFP via Getty Images)“The first meeting we had, which was in the airport, didn’t even make it to the hotel,” Carroll said. “They said that they knew I had made that statement publicly and they disagreed with it. They wanted to show how they are taking steps not to do it. Like I said, I think the Chinese heard us loud and clear. That certainly was their future. That was the direction they were heading. But I do believe on this issue China has realized the importance of coming to the table.”Counterpoint: ‘Very little effect on the flow of drugs’Jack Riley, a 32-year veteran of the Drug Enforcement Agency (DEA), previously told Yahoo Finance that border barriers would only have some effect on illegal immigration.“It’s going to have very little effect on the flow of drugs,” Riley said, adding: “It just doesn’t make business sense for cartels to move high volume amount of drugs through desolate, isolated, unwell areas — it just doesn’t — when they can use ports of entry with sophisticated traps and all types of vehicles, where literally thousands of people in vehicles go back and forth every day. Right now, we’re probably searching and X-raying maybe 20% of the vehicle traffic coming across.”He noted that Mexican drug lord “El Chapo” mostly smuggled drugs into the U.S. through legal points of entry.An Immigration and Customs Enforcement (ICE) agents check pedestrians' documentation at the San Ysidro Port of Entry on October 2, 2019 in San Ysidro, California. (Photo by SANDY HUFFAKER/AFP via Getty Images)“If you’re sitting on a mountain in Sinaloa as Chapo did, he would say ‘Today I’m going to shotgun 10 vehicles with 10 kilos each across the border. I got about a 60% to 70% chance of getting that much through,’’ Riley said. “You only got to bat .300 to get in the Baseball Hall of Fame. It’s a good business move.”Sheila Vakharia, the deputy director of the Department of Research and Academic Engagement at Drug Policy Alliance, echoed a similar sentiment, stressing that “there’s only so much a wall can do” to stop the flow of drugs.“What we know is that most drugs come into the country through legal ports of entry, and there’s very little evidence that it’s just the wall that could obstruct it,” Vakharia told Yahoo Finance. “But the other thing is that it doesn’t take a lot of fentanyl to have the intended effect. And so, a little bit of fentanyl could go a long way. A border wall isn’t going to stop a small brick of fentanyl crossing the border, even if it comes over that border.”A Border patrol unit (behind the fence) and a Mexico's federal police guard near the US-Mexico border fence (Photo: GUILLERMO ARIAS/AFP via Getty Images)Vakharia argued that the focus should shift towards harm reduction, since there wouldn’t be as many drugs coming in if there wasn’t such a demand for it.“Instead of focusing on harsher penalties, we need to focus on how to keep people alive and getting people access to naloxone, getting them on treatments like methadone and buprenorphine, getting them into treatment, and having safer consumption sites,” she said. “These are the kinds of things that are actually going to reduce our overdose deaths, and that’s what we should be focusing on — the death.”Correction: An earlier version of this article stated that President Trump said a full border wall would cost \"maybe $10 or $12 million\" when he actually said \"maybe $10 or $12 billion.\" We regret the error.Adriana is a reporter and editor for Yahoo Finance. She can be reached at adriana@yahoofinance.com. Follow her on Twitter @adrianambells.READ MORE:Former DEA agent on fentanyl: ‘By far, the worst drug I’ve ever seen'DEA: The U.S. opioid crisis is 'ever-increasing'Expert: America's 'legacy of racism' led to a broken drug treatment systemRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}