{"article": [{"url": "https://finance.yahoo.com/news/stock-wars-apple-vs-microsoft-122513475.html", "published": 1602228800.0, "headline": "Stock Wars: Apple Vs. Microsoft", "body": "Apple and Microsoft are two of the most valuable companies in the world. Their paths have been similar, and the companies were rivals for many years thanks to a heated relationship between founders Steve Jobs and Bill Gates.About Apple: Apple Inc (NASDAQ: AAPL) started as a computer company and has transformed to include phones, watches, tablets, services and more.In fiscal 2019, Apple’s revenue was split as $142.4 billion for the iPhone, $25.7 billion for Mac computers, $21.3 billion for iPads, $24.5 billion in wearables/home and $46.3 billion in services.Apple saw $116.9 billion of its fiscal 2019 revenue come from the Americas region, $60.3 billion from Europe and $43.7 billion from China.Apple introduced the iPod in 2001, which would go on to sell over 400 million units and transform the way people listen to music. It was the 2007 launch of the iPhone that would completely change Apple’s future.At the time Jobs announced the iPhone, Apple was valued at $73.4 billion.About Microsoft: The main business at Microsoft Corporation (NASDAQ: MSFT) is its Office segment, which covers both commercial and consumer. The company is a large player in data centers and cloud services.In fiscal 2020, Microsoft saw $46.4 billion from productivity/business processes, $48.4 billion from intelligent cloud and $48.3 billion from more personal computing.Microsoft has seen large growth from its cloud business, with sales up 24% in fiscal 2020 for the segment. The company’s Azure platform grew 56% in fiscal 2020.Bill Gates Vs. Steve Jobs: The rivalry between Microsoft co-founder Bill Gates and Apple co-founder Steve Jobs has been well-documented. Over a 30-year-plus relationship, the two would be allies, rivals and friends.Microsoft made software for the Apple II PC in its early days. In 1985, Jobs would accuse Gates of ripping off the Macintosh from Apple. Microsoft was sued by Apple in 1988 in an infringement case.Story continuesIn 1997, the two leaders decided to put the past behind them and create a licensing agreement. The deal saw Microsoft agree to support its Office on Mac computers for five years and Apple make Microsoft’s Internet Explorer the default web browser on Mac computers.The agreement also saw Microsoft invest $150 million in Apple via preferred stock. The deal gave Apple much-needed cash and also helped Microsoft fend off monopolistic concerns that were centered on the company at the time.Jobs said years later that Apple was 90 days away from going broke.Microsoft would sell its Apple stake by 2003.Apple, Microsoft Financials: Over the last five years, Apple revenue has grown from $233.7 billion to $260.2 billion. Net income has gone from $53.4 billion in fiscal 2015 to $55.3 billion in fiscal 2019.Microsoft has grown revenue from $91.2 billion in fiscal 2016 to $143 billion in fiscal 2020. Revenue has grown in each of the last five fiscal years. Net income has grown from $20.5 billion in fiscal 2016 to $44.3 billion in fiscal 2020 for Microsoft.Both companies pay a dividend, with Microsoft’s yield of 1% currently beating Apple’s 0.7%.Apple, Microsoft Stock Performance: Shares of Apple are up 59% in 2020. Over the last five and 10 years, Apple shares are up 320% and 1,029%, respectively.Shares of Microsoft are up 33% in 2020. Over the last five and 10 years, Microsoft shares are up 351% and 764%, respectively.Apple became the first U.S. publicly listed company to hit both the $1-trillion and $2-trillion valuation marks. Microsoft became the third U.S. public company to pass a $1-trillion valuation in 2019, joining its rival Apple and Amazon.com (NASDAQ: AMZN).What’s Next For Apple, Microsoft: Apple continues to grow its services revenue and grow its portfolio of products. The company unveiled updates to its iPad and Apple Watch lineups in September. The company is holding an October event, where it is expected to unveil an iPhone 12 with 5G connectivity.Microsoft is putting an emphasis on data centers and growing its cloud business. The company beat out rivals International Business Machines Corporation (NYSE: IBM) and Oracle Corporation (NYSE: ORCL) for a $10-billion cloud contract with the Department of Defense.Photo by Daniel Lu via Wikimedia. See more from BenzingaOptions Trades For This Crazy Market: Get Benzinga Options to Follow High-Conviction Trade IdeasLloyd Blankfein Blames SPACs, Free Money For Bubble TerritoryGameStop Shares Surge On Microsoft Partnership© 2020 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."}]}