{"article": [{"url": "https://finance.yahoo.com/news/q2-gdp-us-economy-coronavirus-pandemic-consumer-171558880.html", "published": 1596094820.0, "headline": "Q2 GDP: US economy contracted by worst-ever 32.9% in Q2, crushed by coronavirus lockdowns", "body": "The US economy contracted at the sharpest rate on record in the second quarter this year, affirming fears that the coronavirus pandemic and measures to contain it drove a historic plunge in consumer and business activity.Here were the main metrics from the Bureau of Economic Analysis’ (BEA) advance Q2 GDP report, compared to consensus estimates compiled by Bloomberg:Q2 GDP annualized, quarter over quarter: -32.9% vs. -34.5% expected vs. -5.0% in Q1Q2 Personal consumption: -34.6% vs. -34.5% expected vs. -6.8% in Q1Core Personal consumption expenditures, quarter over quarter: -1.1% vs. -0.9% expected vs. 1.7% in Q1Market participants were bracing for an ugly second-quarter print, with the coronavirus pandemic forcing business closures and disrupting daily life for much of the April through June period.“The decline in second-quarter GDP reflected the response to COVID-19, as ‘stay-at-home’ orders issued in March and April were partially lifted in some areas of the country in May and June, and government pandemic assistance payments were distributed to households and businesses,” The BEA said in its statement. “This led to rapid shifts in activity, as businesses and schools continued remote work and consumers and businesses canceled, restricted, or redirected their spending.”“The full economic effects of the COVID-19 pandemic cannot be quantified in the GDP estimate for the second quarter of 2020 because the impacts are generally embedded in source data and cannot be separately identified,” it added.At 32.9%, the second-quarter annualized contraction marked by far the worst plunge ever recorded, based on Bureau of Economic Analysis data spanning back to 1947. Before the pandemic, the worst GDP print on record was in the first quarter of 1958, when GDP fell 10.0% on an annualized basis.US economic activity contracted by 5.0% in the first quarter of 2020, which captured only the start of the coronavirus pandemic and business shutdowns in March.Story continuesEstimates for the margin of decline in second-quarter GDP spanned a relatively wide range. On the low end, several economists expected GDP sank as much as 40%. On the high end, Mizuho Securities economists estimated GDP declined by 25% in the second quarter. The Atlanta Federal Reserve’s closely watched GDPNow tool forecast a 32.1% decline in second-quarter GDP.The US economy contracted at the sharpest rate on record in the second quarter this year, with GDP declining 32.9% on a quarter over quarter, annualized basis. (David Foster/Yahoo Finance)Consumer-driven downturnThe second-quarter cliff in economic activity was driven by a drop-off in consumer spending, which appeared as a 34.6% drop in the personal consumption metric in Thursday’s report, or slightly worse than had been expected. Consumer spending comprises about two-thirds of the US economy, and prior to the pandemic had been the main engine of economic growth.But spending sputtered during the second quarter, with businesses forced to close from mid-March onward to accommodate social distancing due to the coronavirus outbreak. Spending at retailers sank by a record 14.7% in April, according to the Commerce Department, before rebounding in each of May and June.In the second-quarter GDP report, declines across the components were broad-based. In addition to the decline in personal consumption, domestic investment fell by 49%, with subcomponents in structures, equipment and IP each tumbling. Gross private domestic investment subtracted 9.36 percentage points from headline GDP.Government spending rose 2.7%, with a 39.7% jump in non-defense spending encompassing some of the fiscal stimulus from the Coronavirus Aid, Relief, and Economic Security (CARES) Act, and outweighing a 5.6% decline in state and local government expenditures.“In contrast to prior recessions, where plunging investment and inventories have usually been the biggest drivers, the coronavirus downturn has been mainly the result of an unprecedented collapse in consumption as lockdown measures imposed in late March forced consumers to stay at home,” Ian Shepherdson, chief economist for Pantheon Macroeconomics, said July 24.With July coming to a close, and with many states having struggled to contain a resurgence in coronavirus cases, a number of economists noted that the pace of recovery coming out of the second quarter may be slower than the quick bounce some had anticipated. The second-quarter GDP report was released at the same time Thursday morning as the Labor Department’s report on weekly unemployment claims, which showed jobless claims rose for a second-straight week during the period ended July 25 following months of improvement.“A collapse in household spending, which was already weak in the first quarter, led the plunge reflecting record job losses and closures. Shutdowns and weak demand also weighed on business and residential investment,” Rubeela Farooqi, chief US economist for High Frequency Economics, said in an email Thursday morning.“A third-quarter bounce in GDP is looking more muted as of now, given a resurgence in virus cases that is weighing on economic activity,” Farooqi added. “Virus containment is key. Without it a more complete reopening of the economy, which is crucial for recovery, will remain out of reach.”—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:Jobless claims: Another 1.3 million Americans filed for unemployment benefits last weekJune jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}