{"article": [{"url": "https://finance.yahoo.com/news/u-import-prices-increase-more-125729327.html", "published": 1600157120.0, "headline": "U.S. manufacturing output rises, but momentum slackening as COVID-19 lingers", "body": "By Lucia MutikaniWASHINGTON (Reuters) - U.S. factory production increased for a fourth straight month in August, but the recovery is showing signs of strain, suggesting business investment in equipment could remain depressed through the end of the year as the COVID-19 pandemic drags on.The report from the Federal Reserve on Tuesday added to data on the labor market that has indicated a stall in overall economic activity because of the coronavirus' persistence and fading fiscal stimulus. The ebbing economic recovery, accompanied by warming inflation, is likely to dominate the U.S. central bank's two-day policy meeting, which started on Tuesday.\"It is looking increasingly like the recovery in factory production will stall in coming months if no one from Washington is going to ride to the rescue with another pandemic stimulus package,\" said Chris Rupkey, chief economist at MUFG in New York. \"The coronavirus has made the public cautious and this uncertainty is keeping factories from opening back up completely.\"Manufacturing production rose 1.0% last month after advancing 3.9% in July. The Fed noted that \"the gains for most manufacturing industries have gradually slowed since June.\" Factory output remains 6.7% below its February level.Economists polled by Reuters had forecast manufacturing output would rise 1.2% in August.Government financial aid to businesses and the unemployed has virtually dried up, and talks on another package are at an impasse. At least 29.6 million people were on unemployment benefits in August. Government money was credited for the sharp rebound in economic activity. Cheaper crude oil because of the pandemic is also hurting oilfield services and equipment firms.The International Energy Agency on Tuesday slashed its 2020 oil demand forecast, warning \"the outlook appears even more fragile.\"Brent crude is trading around $40 a barrel. Business spending on equipment has declined for five straight quarters.Story continuesA separate report from the New York Fed on Tuesday showed manufacturing conditions in New York state improving further in September, but the lingering virus was seen restricting activity.\"Weak demand, supply chain disruptions, and fears of a virus resurgence will weigh on the manufacturing sector's recovery until a health solution is discovered and broadly available,\" said Oren Klachkin, lead U.S. economist at Oxford Economics in New York.Stocks on Wall Street rose as investors looked for more stimulus from the Fed. The dollar <.DXY> was steady against a basket of currencies. U.S. Treasury prices fell.AUTO PRODUCTION FALLSLast month, production of long-lasting manufactured goods increased 0.7%. Motor vehicle production, however, dropped 3.7% after accelerating 31.7% in July. There were increases in the output of machinery, furniture, computer and electronic products as well as electrical equipment, appliances and components, goods that complement life under the pandemic.Production of apparel and leather products increased as did the output of plastics and rubber goods.The rise in manufacturing offset declines in both mining and utilities output, lifting industrial production 0.4% in August. Industrial output rose 3.5% in July.Mining production fell 2.5% in August as Tropical Storm Marco and Hurricane Laura caused what the Fed said were \"sharp but temporary\" drops in oil and gas extraction and well drilling on the Gulf Coast. Utilities output fell 0.4%, with small decreases in both electric and gas utilities.Capacity utilization for the manufacturing sector, a measure of how fully firms are using their resources, increased to 70.2% in August from 69.5% in July. Overall capacity use for the industrial sector ticked up to 71.4% from 71.1% in July. It is 8.4 percentage points below its 1972-2019 average.Officials at the U.S. central bank tend to look at capacity use measures for signals of how much \"slack\" remains in the economy - how far growth has room to run before it becomes inflationary.A third report on Tuesday from the Labor Department showed import prices rose 0.9% in August as the costs of goods increased broadly after accelerating 1.2% in July. Economists had forecast import prices, which exclude tariffs, would increase 0.5% in August.The rise in import prices mirrored further gains in both consumer and producer prices in August. But these developments are unlikely to have an impact on monetary policy as the Fed last month rewrote its framework, putting new emphasis on the labor market and less on worries about too-high inflation.Last month, prices for imported fuels and lubricants rose 3.3% after advancing 15.1% in July. Imported food prices rebounded 0.4% in August after dropping 0.9% in the prior month.Excluding fuels and food, import prices accelerated 0.7% last month, the largest gain since April 2011, after rising 0.3% in July. The so-called core import prices shot up 0.9% in the 12 months through August. Further gains are likely, with the dollar falling about 3.6% against the currencies of the United States' major trading partners since June.\"While a few industries are experiencing production bottlenecks, there are wide swathes of unused capacity throughout the economy, which will restrain inflation in the near term,\" said Gus Faucher, chief economist at PNC Financial in Pittsburgh, Pennsylvania.(Reporting by Lucia Mutikani; Editing by Paul Simao)"}]}