{"article": [{"url": "https://finance.yahoo.com/news/netflix-was-one-of-my-great-mistakes-says-billionaire-investor-mario-gabelli-125230045.html", "published": 1599120020.0, "headline": "Netflix was 'one of my great mistakes,' says billionaire investor Mario Gabelli", "body": "Netflix (NFLX) shares have surged amid the coronavirus, rising nearly 50% since March as many stayed indoors and enjoyed hits like the documentary series “Tiger King” and comedy “Never Have I Ever.”The streaming service added nearly 26 million subscribers over the first six months of 2020, just 2 million fewer than the total who signed up over the entirety of last year. Moreover, 41% of Netflix users plan to keep their subscriptions after the pandemic — a higher retention rate than any other service, according to a survey of 1,000 Americans released by Piper Sandler on Aug. 25.The strong performance prompted billionaire value investor Mario Gabelli — who rose to prominence in the 1980s for savvy trading of media and telecom stocks — to call a missed opportunity on Netflix “one of my great mistakes.”Gabelli, the chief executive and chairman of investing giant GAMCO, said in an interview on Aug. 25 that the firm holds a small stake in Netflix; but he regrets passing up a chance to buy shares when they fell after the company announced one of the increases in the price of its monthly subscription that it has imposed in recent years.“[Netflix CEO] Reed Hastings raised the price, the stock dropped,” Gabelli recalls, noting that now: “Netflix is doing very well.”The company has raised the price of its monthly subscription a handful of times since its first rate hike in 2014, but it was not clear to which increase Gabelli referred. Netflix now offers tiered pricing at monthly rates of $8.99, $12.99, and $15.99 — the more expensive options allow a subscriber to stream on additional screens at once.Meanwhile, Disney Plus costs $6.99 per month, and Hulu charges a monthly fee of $5.99 or $11.99 for an ad-free version. Cheaper alternatives include Apple TV Plus at $5 per month and Peacock, which offers among other tiers a limited free option.Over the past year, Netflix has faced a slew of new competitors in streaming, including Disney Plus, HBO Max, Peacock, and Apple TV. Plus, Hulu has sought to bolster its position through new original programming and a site redesign, and Amazon Prime remains formidable with hits like “Fleabag,” which snagged six Emmy Awards last year.Story continuesIn outlining the keys to success for streaming platforms, Gabelli emphasized the quality of a service’s programming and its global reach.“Content is still very important,” he says. “Today, however, availability of packaging that content is center road.”“Over the next five years, it's going to be, who can make it? Who can deliver it? And who can give it to the consumer globally?” he adds.The surge in Netflix subscribers over Q2 brought its total subscribers worldwide to about 193 million. By comparison, Disney Plus had 60.5 million subscribers worldwide as of Aug. 3 — though the platform has operated for a far shorter time, having launched last November.Mario Gabelli, founder, chairman, and CEO of Gabelli Asset Management Company, speaks during an interview with Maria Bartiromo on Fox Business Network in New York, U.S., March 23, 2018. REUTERS/Brendan McDermidGabelli spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Major tech companies like Amazon (AMZN) and Apple (AAPL) bring significant resources to the streaming wars, but Gabelli says traditional companies like Comcast (CMSCA) and Disney (DIS) benefit from experience in the industry.“To the degree that I'm Disney and I know how to communicate with a customer and I have content, what do you give to the consumer?” he says. “Give them what they want at the lowest possible price, and give it to them anytime, anywhere.”Read more:Billionaire investor Mario Gabelli explains ‘problem’ with Tesla stockCoronavirus vaccine 'possible' by winter: Top Harvard scientistBill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}