{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-european-stocks-positive-economc-data-rebound-ouffset-by-surging-us-infections-ftse-dax-cac-074800003.html", "published": 1593572180.0, "headline": "Coronavirus: European stocks fall as positive data offset by surging US infections", "body": "A man wearing a face mask walks out of a shopping centre in Berlin. (John Macdougall/AFP via Getty Images)European stocks fell on Wednesday as investors weighed positive economic data against surging coronavirus infections in the US, which are likely to delay the global recovery.Blockbuster May retail sales figures in Germany and strong data from China’s manufacturing sector were offset by the US hitting yet another new record for coronavirus cases.Over 48,000 coronavirus cases in the US were announced on Tuesday, the final day of the second quarter.The pan-European STOXX 600 index (^STOXX) fell by around 0.7%, while London’s FTSE 100 (^FTSE) declined by 1.1%, even as data showed a stabilisation of the UK’s manufacturing sector.Germany’s DAX (^GDAXI) fell by around 1.5% after trading resumed in Frankfurt following a technical glitch that affected seven other exchanges in Europe. France’s CAC 40 (^FCHI) was almost 1.4% in the red.READ MORE: Government action needed after 'historic setback' in UK economyStocks in Asia were mixed on Wednesday, even as purchasing managers’ index data from China’s manufacturing sector showed a faster-than-expected rebound.The country’s SSE Composite Index (^SSEC) rose by almost 1.3% on Wednesday. The Hang Seng (^HSI) was closed for Hong Kong Special Administrative Region Establishment Day, which commemorates the 1997 transfer of sovereignty over Hong Kong from the UK to China.Japan’s Nikkei (^N225) declined by 0.75%, while the KOSPI Composite Index (^KOSPI) in South Korea closed marginally in the red. Australia’s ASX 200 (^AXJO) rose by around 0.6%.READ MORE: Bank of England economist says UK is set for V-shaped recovery“The new quarter is starting somewhat mixed in the equity markets but that should steadily change as investors have likely locked in the gains they wanted for the quarter end,” said Sebastien Galy, a senior macro strategist at Nordea Asset Management.Galy cited signs of a prolonged U-shaped recovery, meaning that the global economy will not recover as quickly as some had predicted.Story continuesFutures were pointing to a lower open for US stocks on Wednesday.S&P 500 futures (ES=F) fell by around 0.6%, while Dow Jones Industrial Average futures (YM=F) declined by almost 0.9%. Nasdaq futures (NQ=F), meanwhile, fell by around 0.5%."}]}