{"article": [{"url": "https://finance.yahoo.com/news/nikola-calls-shortseller-report-a-hit-job-shares-still-fall-185403477.html", "published": 1599832940.0, "headline": "Nikola calls short-seller report a 'hit job,' shares still fall", "body": "Nikola (NKLA) shares were down about 15% during Friday’s session, even after the company released a statement calling a recent short-seller report “not accurate” and a “hit job for short sale profit driven by greed.”The Hindenburg Research report released on Thursday accused founder Trevor Milton and the company of “intricate fraud.”. It made numerous claims against Milton and the electric vehicle company, sending shares down 11% yesterday.In a statement released this morning Nikola said: “Yesterday, an activist short-seller whose motivation is to manipulate the market and profit from a manufactured decline in our stock price published a so-called ‘report’ replete with misleading information and salacious accusations directed at our founder and executive chairman.”The statement went on to say, “To be clear, this was not a research report and it is not accurate. This was a hit job for short sale profit driven by greed. We have nothing to hide and we will refute these allegations.”The electric truck startup says it is evaluating potential legal recourse. It also plans to approach the Security and Exchange Commission with the short-seller’s actions and provide evidence and documents defending itself.Some investors were expecting a more detailed rebuttal of the short-seller report from Milton or the company, especially since the founder had tweeted yesterday that one was coming. Today Milton said he has addressed each point, but his rebuttal will have to wait to be released.Everyone needs to know I'm pissed too. You know me and normally I go straight at the BS and provide evidence like I always have. I have nothing to hide. Zero. Even the simple points I can't comment on right now. As a leader, you get shit on sometimes and you— Trevor Milton (@nikolatrevor) September 11, 2020have to take it and watch as it hurts you and others. Most these points are easy to comment on and I know that. This document had to be prepared well with the SEC in mind. It will be released as soon as they give me the green light.— Trevor Milton (@nikolatrevor) September 11, 2020Shares of Nikola fell near session lows earlier this morning after Citron Research, also a short-seller firm, tweeted its support for the Hindenburg report.Story continuesCongrats to Hindenburg for exposing what appears to be a total fraud with $NKLA. Citron will cover half of all legal expenses. You can’t SLAPP the truth away. Explains why Milton sold at $10 this June $NKLA response warrants an SEC investigation to maintain integrity of EV mkt— Citron Research (@CitronResearch) September 11, 2020Hindenburg alleges it has “gathered extensive evidence—including recorded phone calls, text messages, private emails and behind-the-scenes photographs.” It claims that “Nikola staged a video” which showed the Nikola One semi-truck “cruising on a road at a high rate of speed.”It also claims that Bosch, the manufacturing partner for Nikola’s “Tre” truck “confirmed this month that they haven’t made any trucks yet,” despite Milton stating in a July podcast, “We have five of them coming off the assembly line right now in Ulm Germany.”In a tweet this morning, Milton showed these pictures refuting the short-seller claims.These were planned to release later but alleged trucks didn't exist in Ulm Germany. Do these look fake? Thanks to the Ulm fab / assembly teams for showing the trolls what's up. You guys have my admiration. F@&k the haters. Well come back stronger from the lies spread about us. pic.twitter.com/uqkAxyAG8o— Trevor Milton (@nikolatrevor) September 11, 2020Hindenburg also alleges Milton “was able to form partnerships with some of the largest legacy auto companies in the world in their desperation to catch up to Tesla’s EV leadership status.”Earlier this week Nikola and GM (GM) announced a partnership to make the Badger pick-up truck which will take on Tesla (TSLA) using the established automaker’s Ultium battery systems.The stock soared more than 40% on Tuesday, the day of the announcement.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreTesla bull says long-term thesis 'still intact,' sees $7,000 price target by 2024Tesla bear says stock is 'detached from reality,' predicts $87 price targetBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}