{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-10-2020-222314022.html", "published": 1599750740.0, "headline": "Stock market news live updates: Stocks end a whipsaw session lower as tech selloff resumes; Nasdaq drops 2%", "body": "Stocks traded choppily Thursday and turned sharply negative, as a temporary resurgence in technology shares lost steam. Each of the three major indices sank more than 1.2%.The big tech and software stocks pummeled over the past week fell anew, with shares of Apple, Microsoft and Netflix each lower by more than 2.5%. A day earlier, these and other tech stocks led the Nasdaq to its best one-day gain since April. However, the index remained lower by about 5% for September to date.The short-lived rally Wednesday came in absence of any major catalysts, as investors swooped in to purchase shares following the steep declines of the past several sessions. As of its closing price on Tuesday, the Nasdaq had fallen 10% from its recent record high last week, sending it into correction territory.“Much like there was no real reason for the drop the past three days, there was no main driver for [Wednesday’s] huge rally, other than stocks were quite oversold,” Burt White, chief investment officer for LPL Financial, said in an email Wednesday. “As the election nears, we could see this continued volatility continue.”In assessing the damage over the past few days, many analysts argued that US equities – and tech and growth shares especially – were due to be knocked from their highs. The roller-coaster trading over the past few days came after trades in tech shares had become increasingly crowded, as investors sought out shares of companies viewed as most resilient during the pandemic. Even with the volatility over the past week, the Nasdaq remained higher by 24% for the year to date through Wednesday’s close, and the S&P 500’s information technology sector was up 27% to outperform every other major sector.“Signs of uneasiness and stretched positioning in the options market have been visible in recent weeks, with the put/call ratio collapsing, an extremely steep front-end VIX term structure, and unprecedented volumes of options traded in tech companies, particularly calls,” Alastair Pinder, global equity strategist for HSBC, said in a note Wednesday.Story continues“Indeed, given the unprecedented scale of options traded for the [big-tech] FAANGMs ($200 billion notional volume a day in August, vs. $70 billion at the beginning of January), it is unlikely that the recent volatility has completely cleansed positioning,” he added.—4:03 p.m. ET: Stocks end a whipsaw session lower as tech selloff resumes; Nasdaq drops 2%Here were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -59.96 (-1.76%) to 3,339.00Dow (^DJI): -405.89 (-1.45%) to 27,534.58Nasdaq (^IXIC): -221.97 (-1.99%) to 10,919.59Crude (CL=F): -$0.97 (-2.55%) to $37.08 a barrelGold (GC=F): -$3.50 (-0.18%) to $1,951.40 per ounce10-year Treasury (^TNX): -1.8 bps to yield 0.6850%—2:37 p.m. ET: Stock losses accelerate in whipsaw session; Nasdaq drops 1.5%The three major indices sold off further Thursday afternoon, and tech stocks continued their descent.Here were the main moves in the three major indices, as of 2:37 p.m. ET:S&P 500 (^GSPC): -45.39 points (-1.34%) to 3,353.57Dow (^DJI): -313.84 points (-1.12%) to 27,626.63Nasdaq (^IXIC): -166.87 points (-1.49%) to 10,976.88—12:56 p.m. ET: Dow turns negative and drops 150 points as early gains evaporateThe three major indices sank Thursday afternoon, wiping out gains from earlier in the trading day.The Dow fell 126 points, or 0.5%, shortly before 1 p.m. ET, with the index dragged down by declines in shares of Caterpillar and UnitedHealth Group. The S&P 500 sank 0.4%, or 14.21 points. Nasdaq outperformed but was still lower by 0.09%.—11:27 a.m. ET: Stocks fluctuate, paring earlier advances as tech loses steamThe three major indices briefly turned negative Thursday morning before recovering, as volatility continued in equity markets.The S&P 500 was higher by 0.2% around 11:30 a.m. ET, after rising as much as 0.8% earlier. The Dow at session highs had added as many as 234 points, or 0.8%, before cutting its gains to just 36 points, or 0.1%.The Nasdaq outperformed slightly, rising 0.7% or 76 points intraday. The consumer discretionary, communication services and information technology sectors each outperformed in the S&P 500.—9:33 a.m. ET: Stocks open higher as rally resumesHere were the main moves in markets, as of 9:32 a.m. ET:S&P 500 (^GSPC): +18.83 points (+0.55%) to 3,417.79Dow (^DJI): +157.74 points (+0.56%) to 28,098.21Nasdaq (^IXIC): +120.96 points (+1.09%) to 11,262.84Crude (CL=F): -$0.24 (-0.63%) to $37.81 a barrelGold (GC=F): +$14.30 (+0.73%) to $1,969.20 per ounce10-year Treasury (^TNX): +0.7 bps to yield 0.71%—8:45 a.m. ET: Producer prices rose more than expected in AugustProducer prices increased by a greater than expected margin in August, as producers began to command greater pricing power as pandemic-related shutdowns eased.The Labor Department’s producer price index (PPI) rose 0.3% in August following a 0.6% monthly advance in July. Consensus economists had been looking for a 0.2% rise, according to Bloomberg data.The core PPI, which excludes volatile food and energy prices, rose 0.4% month on month, or double the increase that had been expected.—8:35 a.m. ET: Citigroup CEO to step aside, setting up bulge-bracket banks’ first female chiefCitigroup (C), the sleepiest of the mega banks, has just shaken up the banking sector. CEO Michael Corbat is set to resign early next year, and Citi’s board has approved president and CEO of Global Consumer Banking Jane Fraser as his successor — making her the first woman to lead a major Wall Street bank. Recall that JPMorgan Chase’s Marianne Lake was widely assumed to be first in line for that honor (once Jamie Dimon resigned, but there’s no indication of him being poised to do so anytime soon).—8:30 a.m. ET: Jobless claims slightly worse than expectedThe U.S. labor market showed signs of grudging progress, as jobless claims stayed below the 1 million mark in the latest week — but came in slightly above market expectations. The real story is in continuing claims, which spiked above 13 million when compared to last week, and shows just how far the jobs market has to go before re-absorbing millions of displaced workers.Stock futures are pointing to a mixed open, with tech stocks indicated higher while the rest of the market is pinned in the red.—7:18 a.m. ET Thursday: Stock futures point to a lower openHere were the main moves in markets, as of 7:18 a.m. ET Thursday:S&P 500 futures (ES=F): 3,384.75, down 15.5 points or 0.46%Dow futures (YM=F): 27,842.00, down 130 points or 0.46%Nasdaq futures (NQ=F): 11,371.75, down 21 points, or 0.18%Crude (CL=F): -$0.48 (-1.26%) to $37.57 a barrelGold (GC=F): +$4.50 (+0.23%) to $1,959.40 per ounce10-year Treasury (^TNX): -0.3 bps to yield 0.7%—6:11 p.m. ET Wednesday: Stocks little changed as late trading kicks offHere were the main moves in equity markets, as of 6:11 p.m. ET:S&P 500 futures (ES=F): 3,400.00, down 0.25 points or 0.01%Dow futures (YM=F): 27,970.00, down 2 points or 0.01%Nasdaq futures (NQ=F): 11,404.50, up 11.75 points, or 0.1%Traders work on the floor of the New York Stock Exchange shortly after the opening bell in New York, December 28, 2015. REUTERS/Lucas Jackson TPX IMAGES OF THE DAY—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}