{"article": [{"url": "https://finance.yahoo.com/news/these-states-have-the-worst-unemployment-rates-143941085.html", "published": 1599731240.0, "headline": "These states have the worst unemployment rates", "body": "The number of jobs lost due to the coronavirus shutdown continue to mount, with the latest weekly total of Americans applying for unemployment benefits topping 880,000 yet again.The latest swath of applications brings the total amount of jobless claims to nearly 60 million since the pandemic began to roil the job market in March, wiping out the 20 million jobs added over the last decade by a three-to-one margin.Read more: What to do before you lose your jobWhile some states have seen unemployment applications recede from record highs after the coronavirus pandemic hit the U.S. employment picture in March, some have suffered stubbornly high job losses months into the recovery. In some states unemployment rates shot as high as 20%.According to the Department of Labor’s latest report, which breaks out the insured unemployment rate (a ratio of people on unemployment benefits divided by labor force) through August 22, Hawaii is currently suffering the worst employment picture with a nation-leading insured unemployment rate of 20.3%. The U.S. territory of Puerto Rico saw its insured unemployment rate rise from 16.1% to 16.7% in this week’s national report to take the second spot. Nevada, New York, and California round out the top five worst job markets, with insured unemployment rates above 14.5% and notably higher than the national average of 9.1% for the same week ended August 22.Insured unemployment rates measure the ratio of people on unemployment benefits divided by the labor force. The national average was 9.1% for the week ended August 22.Compared to pre-pandemic levels, those unemployment rates are notably higher than the worst states listed in the week ended February 22. Back then, Alaska topped the nation with a similar unemployment rate at just 2.9%. As high as the unemployment rates are now in the hardest hit states, they have still marginally improved from peaks seen months prior. Nevada, for example, has seen its unemployment rate improve more than 10 percentage points, down to 16% from 27% during the week ended May 9.As a Yahoo Finance review of jobless claims data showed earlier, some states are recovering more quickly than others, but all are still struggling with varying economic restrictions tied to controlling the spread of the coronavirus.Story continuesZack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Americans are shelling out $30,000 on these pop-up backyard home offices during the pandemicThis $3 billion online education company is seeing a 'paradigm shift' due to coronavirusNetflix co-founder brushes off NBC's new Peacock streaming competitorThe NFL overlooking coronavirus threat is 'extremely concerning' says former White House doctor"}]}