{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-pandemic-clauses-in-retail-leases-are-a-musthave-but-landlords-are-atrisk-102345623.html", "published": 1599197480.0, "headline": "Coronavirus ‘pandemic clauses’ in retail leases are a must-have, but landlords are at-risk", "body": "Most retail rent agreements are straightforward: Tenants pay a monthly fee to occupy a space. But that was before the coronavirus pandemic.In the wake of disrupted store sales due to coronavirus lockdowns, retailers are looking for flexible arrangements to pay rent. Experts say “pandemic clauses” offering concessions and lease adjustments could become more common but landlords still need to be cautious.“Retail leases will experience some innovation,” said Ami Ziff, director of national retail for Time Equities, a New York City-based real estate investment, development and management firm. Ziff said these “pandemic clauses” would “create guidelines for addressing rental payments during a pandemic\" to reduce litigation.The most creative clauses would allow tenants to pay a percentage of monthly sales instead of a flat rate. It’s not unheard of: the multibillion-dollar New York City retail development Hudson Yards already offered this option to tenants before the coronavirus pandemic, and as they recover from the pandemic, California-based department store Ross Stores' will reportedly pay 2% of sales each month instead of its usual monthly rent at all of its locations in the U.S. until sales return to 70% compared to last year. Retailers report that they’d like similar terms adopted more broadly, and tech companies have even started making software for profit-sharing rent models, according to the Wall Street Journal.“Rent as a percentage of sales is an interesting concept that requires a lot of monitoring on the part of the landlord,” said Claudia Springer, a commercial real estate lawyer and partner at the law firm of Reed Smith in New York City. “It makes sense for the tenant because they will only pay a lot of rent if they do well in sales, and the landlord is bearing part of the risk. But it requires a lot of record keeping.”Landlords have had to be flexible during the coronavirus pandemic. Starbucks has asked for a year’s worth of free rent on 9,000 company-owned stores, and most national retailers requested rent deferrals at least through June 30. By mid-August, a fourth of national store chains hadn’t paid rent, according to a report from Datex Property Solutions, a California-based data company.Story continues“Retail companies are pulling back on physical retail space. And doing so weakens overall demand for space. So, yes, property owners have less power” in negotiations, said Omar Eltorai, market analyst at Reonomy, a commercial real estate data company.“Rent as a percentage of sales is an interesting concept that requires a lot of monitoring on the part of the landlord,” said Claudia Springer, a commercial real estate lawyer.‘It can lead to added liability’But not all landlords want to add a “pandemic clause,” fearing added uncertainty and legal implications from the new terms.\"As a landlord, I would not alter current lease agreements or contracts to include a ‘pandemic clause’ because adding a ‘pandemic clause’ can lead to future legal claims on what constitutes a ‘pandemic’ which will lead to unnecessary legal implications. It can lead to added liability,” said Toni Ko, a beauty industry entrepreneur who owns 500,000 square feet of commercial space in Los Angeles.For property owners to broadly adopt flexible rent terms during a pandemic, they would need support from lenders, insurers and the U.S. government — because instituting a “pandemic clause” could cut off their supply of money.“The lender is willing to give 75%-80% of the property value, but it’s hard to predict revenue from a lender standpoint if you are basing rent on a percentage of sales because now you’ve got a third-party involved… My guess is given what happened, banks and lenders will be very conservative in evaluating this,” said Springer.Like the Terrorism Risk Insurance Act in 2002 adopted after 9/11, the Pandemic Risk Insurance Act, introduced in May by Rep. Carolyn Maloney (D-NY) and backed by U.S. House Financial Services Committee Chairwoman Maxine Waters, would force insurers to cover pandemic-related losses while promising federal backing if claims exceed $250 billion nationwide. Experts don’t expect fast action on the proposed legislation, but if lenders were insured against pandemic risks, they would then be more amenable to landlords offering tenants flexible lease terms, according to experts.\"At this point it’s virtually impossible to obtain pandemic coverage for the future, but a federally insured pandemic risk insurance program would provide businesses of all sizes the certainty they need and help rebuild confidence,” National Retail Federation Senior vice president for government relations David French said in a statement.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Unemployment insurance doesn’t cover rent in most cities, study showsCalifornia wildfires threaten $11.8 billion-worth of homesThere’s a record number of vacant rental apartments in Manhattan"}]}