{"article": [{"url": "https://finance.yahoo.com/news/case-shiller-may-2020-coronavirus-finally-slows-down-us-home-price-growth-130012988.html", "published": 1595923700.0, "headline": "Coronavirus finally slows down US home price growth", "body": "The novel coronavirus has finally put the brakes on home price growth in the U.S.Standard & Poor’s said Tuesday that its S&P CoreLogic Case-Shiller national home price index posted a 4.5% annual gain in May, down from 4.6% a month earlier. The 20-City Composite posted a 3.7% annual gain, down from 3.9% in April. As in March and April, the 20-City Composite did not include transactions for Wayne County, Mich., due to delays at its local recording office caused by the COVID-19 lockdown. The results miss BofA Global Research’s estimate of a 4.9% annual gain for the national index and a 4.1% annual gain for the 20-City Composite.“May’s housing price data were stable,” said Craig J. Lazzara, managing director and global head of index investment strategy at S&P Dow Jones Indices, in a press statement. “In contrast with the past eight months, May’s gains were less than April’s. Although prices increased in May, in other words, they did so at a decelerating rate. More data will obviously be required in order to know whether May’s report represents a reversal of the previous path of accelerating prices or merely a slight deviation from an otherwise intact trend.”For the twelfth consecutive month, Phoenix led the 20-City Composite posting a 9% annual gain. Seattle and Tampa followed reporting a 6.8% and 6% annual gain, respectively.“We observed an analogous development at the city level: Prices increased in all 19 cities for which we have data but accelerated in only 3 of them (in contrast with 12 cities last month and 18 the month before that),” said Lazzara.The Prado condominium development is seen in Pasadena, Calif., Tuesday, Aug. 15, 2006. Demand for homes in Southern California fell sharply in July. (AP Photo/Nick Ut)The results follow a slew of positive data revealing a housing market in recovery. In June, existing home sales rebounded at a record rate, up 20.7% from May, according to the National Association of Realtors. Last week, BofA highlighted five reasons why the housing market has been a “shining star” in the economy as the U.S. emerges from the virus lockdowns.Lazzara points out that, “Even if prices continue to decelerate, that is quite different from an environment in which prices actually decline.”Story continuesThe National Association of Realtors (NAR) reported last week the median existing-home price for all housing types in June was $295,300, up 3.5% from June 2019, as prices rose in every region, marking 100 straight months of year-over-year gains. Meanwhile, inventory remained depressed in June totaling 1.57 million units, up 1.3% from May, but still down 18.2% from one year ago.“Home prices rose during the lockdown and could rise even further due to heavy buyer competition and a significant shortage of supply,” said Lawrence Yun, NAR’s chief economist, in a press statement, noting that significantly low inventory was a problem even before the pandemic and that such circumstances can lead to inflated costs.Amanda Fung is an editor at Yahoo Finance.Read more:5 reasons why the housing market has recovered from COVID-19: BofALuxury real estate may be back as the housing market recovers but bewareHome price growth accelerated at the start of 2020 before coronavirus slammed the USEconomist on housing: 'You can't buy what's not for sale'The hottest housing market of 2019Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}