{"article": [{"url": "https://finance.yahoo.com/news/ill-reach-out-to-fauci-biden-gives-hints-about-how-hed-approach-coronavirus-reopening-next-january-192218903.html", "published": 1593527420.0, "headline": "‘I’ll reach out to Fauci’: Biden gives hints about how he’d approach coronavirus reopening next January", "body": "On June 30, in a speech about the coronavirus response, former Vice President Joe Biden spent most of his time (as he often does) focused on what he sees as the failures of the Trump administration.Then for a few moments he gave some indications about how a Biden administration would approach the economic reopening, should he win in November.“[W]e can’t know today what the state of the COVID-19 pandemic will be next January,” he said, but added, “I’m almost certain – I hope I turn out to be wrong – it won’t be over.”The former vice president promised his plan would begin “well before I take the oath of office, it will start as soon as the election is decided.”“I’ll reach out to Fauci,“ Biden said, promising that the director of the National Institute of Allergy and Infectious Diseases would remain in his position. Dr. Anthony Fauci has been the government's top infectious diseases expert since 1984, spanning six presidential administrations.Democratic presidential candidate Joe Biden answers questions after speaking about the coronavirus pandemic and the economy in Wilmington on Tuesday. (BRENDAN SMIALOWSKI/AFP via Getty Images)During testimony on Capitol Hill on Tuesday, Fauci said the U.S. cannot necessarily count on the availability of a safe and effective COVID-19 vaccine. Without continued social distancing, case loads could continue to rise. \"I am very concerned because it could get very bad,\" he said.Previously, Biden had said as president he “would be telling governors to listen to Dr. Fauci.”In recent months, Biden has often focused on what he called the 5 elements of his response to address the crisis, including measures like greatly expanded testing and protections for older Americans.‘I will listen to them’Biden repeatedly stressed that health experts would be highly visible in a Biden White House. “I will listen to them and let them speak freely,” he said.He added that it applies to his campaign in the month ahead: “I’m going to follow the docs’ orders,” he noted, adding that it means “I am not going to be holding rallies.”Biden called on Trump to institute a range of measures like nationwide standards for when a state can reopen. He then added that, if he is elected, his administration would immediately begin “implementing all aspects of the response that remain undone.”Story continuesAnthony Fauci during a Senate hearing in Washington on Tuesday. Fauci and other government health officials updated the Senate on how to safely get back to school and the workplace during the COVID-19 pandemic. (AL DRAGO/AFP via Getty Images)Biden also promised to work with governors of both parties on their economic reopening and with both parties on issues, like masks, that have become partisan to the great frustration of health care experts.“We have to start appealing to the better side of human nature,” said Biden.Much detail still to comeIn his wide-ranging press conference in Wilmington, Del., Biden only focused on 2021 for a few moments, but promised much more detail in the week ahead.He said his detailed economic reopening plans will be released in the weeks ahead and also, again, promised “policy proposals on economic justice” are also forthcoming. These proposals have promised since the nationwide protests following the killing of George Floyd and the economic inequalities laid bare by the coronavirus.He said there will be plenty of detail “so people know what’s coming.”Ben Werschkul is a producer for Yahoo Finance in Washington, D.C.Read more:Fact or fiction? Assessing Team Trump’s claims about Biden and ChinaHere's what Joe Biden means for markets, business and AmericaTravel restrictions fly as Fauci issues grim warning on casualtiesRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn,YouTube, and reddit."}]}