{"article": [{"url": "https://finance.yahoo.com/news/boston-fed-rosengren-second-half-2020-more-difficult-than-anticipated-171504896.html", "published": 1592828600.0, "headline": "Boston Fed's Rosengren: Second half of 2020 will be 'more difficult' than anticipated", "body": "Federal Reserve Bank of Boston President Eric Rosengren told Yahoo Finance that failure to properly contain the COVID-19 outbreak means the second half of 2020 may be “more difficult than many people are anticipating.”Rosengren told Yahoo Finance on Monday that his baseline forecast includes the assumption that the U.S. is unable to stop the community spread.“We'll be in a situation where the economy is growing more slowly than we might have hoped a few months ago,” Rosengren said.Fed officials, including Chairman Jerome Powell, have expressed cautious optimism over the past few weeks that a recovery would come in the second half of this year. But Rosengren has struck a more pessimistic tone, saying in a speech last week that efforts in the United States to contain the virus “have not been particularly successful.”Rosengren warned of the risk in reopening the economy too quickly, expressing further worry that a relaxation of social distancing measures will only lead to more flare-ups of the virus. The Boston Fed chief added that positive headlines may be masking the health implications of loosening restrictions.In states that moved early to re-open, such as Florida and Arizona, hospitalizations have spiked.“Some of the better economic data we've been getting has reflected the fact that those places are opening up, but they may not be opening up as safely as they need to,” Rosengren said.Rosengren’s forecasts for the U.S. economy are gloomier than those of his colleagues on the policy-setting Federal Open Market Committee meeting. In the FOMC’s June 10 meeting, the median committee member projected a 9.3% unemployment rate by the end of 2020 with real GDP contracting by 6.5% for the year.Rosengren, however, expects the headline unemployment rate to end the year in double digits with GDP contraction coming in “a little bit worse” than the FOMC’s median projection.Federal Reserve Bank of Boston President Eric Rosengren, left, speaks during a round table discussion at Silver Lane Elementary School, in East Hartford, Conn. (AP Photo/Steven Senne, file)Fed policyWith no control of the public health response, the Fed has been leveraging its monetary policy and emergency lending tools to avoid a financial crisis.Story continuesAfter having already slashed interest rates to near-zero in mid-March, the FOMC messaged in its June 10 meeting that the Fed is unlikely to raise rates before the end of 2022.Rosengren said the Fed is a “long way from raising rates” and said the central bank hopes to keep short-term and long-term borrowing costs “quite accommodative.”The focus has instead shifted to the Fed’s ballooning balance sheet, which breached $7 trillion amid a breakneck pace of asset purchases targeting mortgage-backed securities and U.S. Treasuries. Although those purchases have slowed over the last few weeks, the Fed has committed to “increase its holdings” over the coming months.The Fed has also opened up eleven liquidity facilities designed to backstop several financial markets, ranging from the international flow of U.S. dollars to the domestic corporate bond market.The Boston Fed has been tasked with setting up one cornerstone of the Fed’s crisis response: a Main Street Lending Program offering loans to small and medium-sized businesses. Although announced in late March, the Fed only opened its program for lender registration last Monday.Rosengren said over 200 financial institutions had registered as of last week, adding that lenders should be able to clear the process in two or three days before getting the green light to extend the loans. Rosengren said the Fed will “in the next couple weeks” set up its facility that will purchase 95% of each loan from the underwriting lender.“Every one of these loans is presumably a loan that, without the Federal Reserve intervention, the bank wouldn't have been that willing to do,” Rosengren said.Rosengren said that if the economy rebounds quickly, the Fed “ideally” would not need to use the facility at all. But with a baseline expectation of a difficult second half of 2020, Rosengren says the program will serve as an “importance insurance policy for the economy.”Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Sen. Toomey: Fed gets ‘good marks’ on crisis responsePowell urges Congressional help for unemployed, municipalities as economy recovers from coronavirusPowell: Fed trying not to 'run through the bond market like an elephant'Fed proposes expanding Main Street loan program to nonprofitsA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}