{"article": [{"url": "https://finance.yahoo.com/news/uniteds-change-fees-move-shows-airline-anxiety-152644331.html", "published": 1598888840.0, "headline": "Delta, American, United end change fees in an effort to get Americans flying again", "body": "United Airlines’ (UAL) sudden decision to permanently scrap most flight change fees prompted its major competitors, Delta Air Lines (DAL) and American Airlines (AAL), to follow suit on Monday — underscoring how airlines are pulling out all the stops to fill empty seats.On Sunday, United became the first U.S. legacy carrier to eliminate fees for standard economy and premium cabin flights, as well as standby fees for all same day departures. The company also extended its unlimited change fee waiver to flights purchased through the end of the year.United’s no change fee policy became effective immediately Sunday while free same day standbys for any class of service will take effect January 1. Members of the company’s MilegePlus Premier program will be offered additional flexibility to confirm same day seats, space permitting, according to the company.Not to be outdone, both Delta and American also eliminated their change fees on U.S. travel, effective immediately. The move underscores how an airline industry walloped by the COVID-19 crisis is desperate for customers to start taking to the skies again.According to an announcement posted to Delta’s website, the airline will permanently eliminate change fees, and extend its waiver on change fees for already purchased international and basic economy flights, through the end of the year. Travel credits will now remain valid through December 2022 for tickets booked before April 17, 2020.American announced its new policies will include no change fees for all domestic and short-haul international flights for premium, and most main cabin fares. The company also eliminated standby fees for passengers wishing to change to earlier flights for the same destination on the same day. American’s standby policy goes into effect starting Oct. 1, 2020.Both United and Delta excluded basic economy tickets from their no change fee policies. However, American added enhancements to basic economy fares with more flexibility for upgrades, preferred and main cabin extra seats, priority boarding, and same-day flight changes.Story continuesIn order to comply with social distancing rules and give passengers more space, Delta recently announced that it would keep its middle aisles free of passengers through the holidays. The move was originally announced this summer, in the hopes of making consumers comfortable in the skies.In an email to Yahoo Finance earlier on Monday, a Delta spokesperson stated that “we know flexibility is important to customers and we are continually updating our policies to ensure we’re responding.”The latest changes come at a time when major carriers are in desperate need of more revenue, as the coronavirus crisis crushes demand for leisure travel. Last week, all the major carriers warned the clock was ticking on mass layoffs, as COVID-19 rescue cash evaporates, and most carriers operating at dramatically reduced capacity.United’s change fee switch is in line with long-standing rules observed by Southwest Airlines. The company already offered ticket holders the option to change flights without incurring change fees before the COVID-19 outbreak.Earlier this month Southwest also announced it would also extend the expiration date for certain expiring travel expenditures. Funds spent on Southwest tickets that expire between March 1, 2020 and September 7, 2020, will now expire at least two years later on September 7, 2022.Alexis Keenan is a legal reporter for Yahoo Finance and former litigation attorney.Follow Alexis Keenan on Twitter @alexiskweed.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}