{"article": [{"url": "https://finance.yahoo.com/news/manhattan-rent-down-vacancy-up-193314128.html", "published": 1597416080.0, "headline": "There's a record number of vacant rental apartments in Manhattan", "body": "A record 4.33% of Manhattan apartments were empty in July, up from the previous record of 3.67% reached just a month earlier, according to a new report.“In the beginning of March, April, we saw a tremendous outbound migration. About over 400,000 people left Manhattan, 40% of the occupants, essentially,” Jonathan Miller, CEO of appraisal firm Miller Samuel Real Estate Appraisers & Consultants, which prepared the report for New York City residential brokerage Douglas Elliman, told Yahoo Finance. Renters in Manhattan “became first-time buyers, they lived with relatives, they rented — they did anything but come into the city,” he said.As landlords scrambled to recover losses, empty apartment listings poured on real estate sites like Zillow. In July, there were 21.6% more apartments on the market from only a month prior in June — and 121% more compared to July 2019.“Right now, we have the highest amount of vacancy in at least the 14 years of history I have on this metric in the city,” said Miller, who said that though more renters signed leases in July compared to June, there were 57% fewer leases signed than in July 2019.Low demand has driven rent prices down 7.6%, compared to last year in July, according to the report. The median apartment price was $3,320, compared to $3,595 last year at the same time.“What we're seeing is lots of softness in the rental market and one of the big reasons for the softness is unemployment has skewed heavily to lower-wage earners, which tend to be more renters than purchasers,” said Miller.A building at 172 Rivington Street in the Lower East Side neighborhood in Manhattan, August 28, 2018 in New York City. (Photo by Drew Angerer/Getty Images)To entice prospective renters, landlords have upped incentives like waiving fees or throwing in a free month’s rent. Incentives are up more than 50%, according to the report. Landlords are offering an equivalent of 1.7 months of free rent, compared to 1.1 months free last year.“[Manhattan has] a significant vacancy rate which is driving the need to offer incentives… there is clearly a problem with filling the apartments,” said Miller.Story continuesHistorical trends show that the New York City rental market typically rebounds within three years of a recession or catastrophic event. But because the COVID-19 pandemic led to a shift to remote work, fewer employees need to be near New York City offices — so they may not need to live in New York City.“I’m very much a believer in a reversal at some point. The thing that’s a little different is less about the pandemic — and more about technology and Zoom. Because I do think that the tether between work and home just got a lot longer, that people have more flexibility about where they can live in relationship to where they work,” said Miller.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:A mass exodus from American cities? Not quite: pollRent growth hits lowest level in about 6 yearsCoronavirus quarantines made Americans want to spend on home improvement"}]}