{"article": [{"url": "https://finance.yahoo.com/news/white-house-senate-gop-continue-to-debate-stimulus-plan-as-jobless-claims-rise-192127584.html", "published": 1595514560.0, "headline": "White House, Senate GOP continue to debate stimulus plan as jobless claims rise", "body": "Senate Republicans delayed the release of their plan for the next stimulus package on Thursday, after disagreements between the White House and Republican leadership. Majority Leader Mitch McConnell was expected to outline the bill on Thursday, but Sen. Chuck Grassley (R-IA) told Yahoo Finance he now expects the proposal to be released on Monday — though the timeline is anything but certain.One of the key issues up for debate is the $600-per-week increase in unemployment benefits. As lawmakers continue to work on a path forward, the Labor Department reported 1.4 million Americans filed for first-time unemployment benefits last week.Treasury Secretary Steven Mnuchin said in a CNBC interview on Thursday morning that the enhanced unemployment benefit would be “approximately 70% wage replacement” in the Republican proposal.Grassley — the Senate Finance Committee Chairman — said Mnuchin’s comments may have “slowed things up” as lawmakers try to make sure their plan is “administrable in the 50 states.” Mnuchin told reporters on Capitol Hill “mechanical issues” were being worked out for the unemployment benefits.One-stop operator Vickie Gregorio with the Heartland Workforce Solutions talks to a jobseeker outside the workforce office in Omaha, Neb., July 15, 2020, as others seeking employment wait behind her. (AP Photo/Nati Harnik)While negotiating the CARES Act lawmakers agreed on a $600-per-week increase weekly in benefits, in part because state systems weren’t sophisticated enough to cap benefits at 100% of a worker’s usual pay. Grassley said a similar measure could be necessary, at least temporarily, in the next round of relief until state systems are capable of handling more complex solutions. “It may take a period of a flat rate — like the $600 was a flat rate — for a month or two,” said Grassley. Lawmakers have told Yahoo Finance the outdated technology has complicated negotiations over the boosted benefit. Republicans have argued against the $600 weekly benefit, because some people make more on unemployment than they do at their job.“It’s making it practically impossible for businesses to get back to work,” said Grassley. “Common sense tells you, it tells the American people, if you want people to go back to work the government is an unfair competitor by paying them more not to work. Whether that’s going to be $500, $400, $300, $200 for a while — those things are still being negotiated.”Story continuesEconomists have warned against eliminating the enhanced benefits. Former Chair of the Federal Reserve, Janet Yellen, told Congress the move would be “a catastrophe.”House Speaker Nancy Pelosi of Calif., speaks during a news conference on Capitol Hill, Thursday, July 23, 2020, in Washington. (AP Photo/Manuel Balce Ceneta)Lawmakers are facing a time crunch as the $600-per-week increase is set to expire on July 31 and people will stop receiving the boosted benefits at the end of this week.“Whatever we decide upon, there’s not going to be any day between when they [enhanced benefits] lapse and when we decide what we’re going to do,” said Grassley. “The checks are going to continue to go out — and for that interim period of time, people are still going to get their money.”In a statement, Sen. Ron Wyden (D-OR) — the top Democratic senator on the Finance Committee — blasted Republicans for their “vague plan to cut benefits and make the program even more difficult for overburdened states to administer.”“Due to ancient technology, states need between one and four weeks to adjust the $600 boost. At this late hour, the only option to guarantee benefits do not lapse is the Democratic plan to extend the $600 weekly benefit. Republicans rejected that plan outright. They were never serious about preventing a lapse in benefits,” said Wyden.Republicans have discussed a short-term extension of enhanced unemployment benefits, separate from the broader stimulus talks. Mnuchin told reporters on Thursday the administration wants to address the full package at once — but if that’s not doable, they want to address unemployment benefits and school funding first.Democratic leaders rejected the idea of breaking out portions of the relief legislation.“This is a package. We cannot piecemeal this,” said House Speaker Nancy Pelosi (D-CA) at a press conference on Capitol Hill. “We’re not going to take care of one portion of suffering people and leave everyone else hanging,” added Senate Democratic Leader Chuck Schumer (D-NY).Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Yahoo Finance’s The Market Wake-UpRead more:Twitter hack highlights concerns about disinformation, election securityThe $600 boost in unemployment benefits expires soon. What comes next?Most Americans would not sue over COVID-19 exposure: pollMajority of Americans think Congress should extend enhanced unemployment benefits past July: pollCoronavirus response: What Washington has accomplished and what's next"}]}