{"article": [{"url": "https://finance.yahoo.com/news/netflix-cofounder-reed-hastings-on-creative-culture-130348112.html", "published": 1599552680.0, "headline": "Netflix co-founder on creative culture: We ‘manage on the edge of chaos’", "body": "Netflix (NFLX) has thrived amid the novel coronavirus, which forced billions of people across the globe into their homes and helped the streaming service add almost as many subscribers in the first six months of 2020 as it did all of last year.But the company rose from DVD-by-mail startup to streaming giant well before the pandemic, upending the movie and television industries as competitors launched their own versions of its online service.Netflix co-CEO and co-founder Reed Hastings speaks with Yahoo Finance's Andy Serwer.In a recent interview, Netflix co-founder and co-CEO Reed Hastings told Yahoo Finance how the company’s unorthodox management style drove it to innovate and grow — a process that he and co-author Erin Meyer detail in a new book “No Rules Rules: Netflix and the Culture of Reinvention.”“We really manage right on the edge of chaos,” Hastings says. “It's not the most efficient place, but that's part of why we've been able to adapt.”“If you think of the last 300 years, we've had factories providing enormous economic value, and so a lot of our society has the factory as the model of the organization,” he adds. “Very top down, very process, very efficient.”“But it's not the right way to run a creative organization,” he adds. “An organization that needs new ideas; [that] needs to be able to make mistakes.”The company — which as of May employs 8,600 people — provides workers with unlimited vacation days, pays high compensation but does not use bonuses, and encourages employees to give each other direct, honest feedback.“We've been able to adapt from DVD by mail to domestic streaming to global streaming to original content in less than 20 years,” Hastings says. “Because we're so focused on supporting creativity.”ROME, ITALY - OCTOBER 08: Reed Hastings attends the Netflix & Mediaset Partnership Announcement, Rome, 8th October 2019. (Photo by Ernesto S. Ruscio/Getty Images / Netflix)Netflix has drawn attention and some criticism for what the company calls the “keeper test,” which asks managers to assess direct-reports based on whether they would try to prevent them from leaving for another company. A report from the Wall Street Journal, in 2018, found that the approach contributed to anxiety among workers who fear a sudden dismissal.Story continuesHastings rejected the notion of unhappiness among Netflix employees, citing employee satisfaction surveys that rank Netflix among the top companies nationwide.“Netflix employees love working there,” Hastings says. “It's so fun because people feel the trust, the openness of the culture, information sharing, and because they've got incredible colleagues — and so they get to do a lot.”But the workplace culture at Netflix fits a certain type of employee, Hastings acknowledged.“Netflix is not for everyone,” he says. “Netflix is for people who are learning machines. They just love absorbing new ideas and new experiences and are willing to make mistakes to figure things out. And it's those kind of self-motivated learners that do so well at Netflix.”Hastings spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment. The complete interview will air on Sept. 10.Netflix co-founder and co-CEO Reed Hastings and co-author Erin Meyer detail the company's unorthodox management style in the new book \"No Rules Rules: Netflix and the Culture of Reinvention.\" The streaming service added nearly 26 million subscribers over the first six months of this year, bringing its total subscribers worldwide to about 193 million. By comparison, Disney Plus (DIS) had 60.5 million subscribers worldwide as of Aug. 3 — though the platform has operated for a far shorter time, having launched last November.Over the past year, Netflix has faced a slew of new competitors in streaming, including Disney Plus HBO Max (T), Peacock (CMCSA), and Apple TV (AAPL). Plus, Hulu and Amazon Prime (AMZN) remain significant challengers.Nevertheless, 41% of Netflix users plan to keep their subscriptions after the pandemic — a higher retention rate than any other service, according to a survey of 1,000 Americans released by Piper Sandler on Aug. 25.The management tactic perhaps most affiliated with Netflix is its unlimited vacation time for employees, which gives them immense flexibility but also may deter some workers from taking sufficient time off due to a lack of clarity about how much is appropriate.Hastings said the company doesn’t track employee vacation time but that he models an opportunistic approach to the benefit.“I try to set a great example by taking a lot of vacation,” he says. “I'm always talking about it.”“And some of the time you come up with your greatest ideas when you're on vacation,” he adds.Read more:Netflix was 'one of my great mistakes,' says billionaire investor Mario GabelliCoronavirus vaccine 'possible' by winter: Top Harvard scientistBill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}