{"article": [{"url": "https://finance.yahoo.com/news/washingtons-coronavirus-response-whats-happened-and-whats-ahead-181939922.html", "published": 1593696440.0, "headline": "Coronavirus response: What Washington has accomplished and what's next", "body": "After the June jobs report that smashed expectations, Treasury Secretary Steven Mnuchin said the next round of coronavirus relief — known as Phase 4 — will be much more targeted.“There are going to be a number of businesses that are particularly hard hit and we’ll be looking to give those businesses additional money,” said Mnuchin. “There is no question this is working.”Mnuchin also said it’s “too early to tell” how big the next stimulus package will need to be.“That’s the reason that we’re waiting,” he said. “The president is committed to do what we need to do in the next bill to protect kids, protect jobs and protect liability.”Republicans have advocated a “wait-and-see” approach to continued relief, after better-than-expected job reports in May and June. But Democratic lawmakers argue the jobs reports show relief efforts are working, so Congress shouldn’t slow down.“Today’s jobs report may just be a slight peak in a much larger valley, and unless President Trump demonstrates real leadership in fighting the health crisis and Senate Republicans get off their hands and finally work with Democrats to quickly provide additional federal fiscal relief, the pain America is experiencing will only worsen,” said Senate Democratic Leader Chuck Schumer.Congress has already authorized about $3 trillion for fighting the virus, but experts say Washington will have to do more to support a recovery.“The biggest downfall of failing to get something done is we’re going to hurt real people. We have millions of people on the unemployment rolls, we have undeniable, seismic uncertainty about the reopening trajectory,” said Isaac Boltansky, director of policy research at Compass Point.Yahoo Finance looked back at what Congress has done already — and what lawmakers might include in Phase 4.Phase 1On March 6, Trump signed the first coronavirus relief bill into law. The $8.3 billion legislation included funding for hospital readiness, personal protective equipment, vaccine and treatment development, and international response to the coronavirus.Story continuesUS President Donald Trump signs a USD 8 billion emergency funding bill to combat COVID-19, coronavirus, in the Diplomatic Room of the White House in Washington, DC on March 6, 2020. (Photo by MANDEL NGAN / AFP) (Photo by MANDEL NGAN/AFP via Getty Images)The Trump administration had originally asked for far less money in order to fight the virus.“I asked for $2.5 [billion] and I got $8.3— I’ll take it,” said Trump as he signed the bill.Phase 2Less than two weeks later, on March 18, the Families First Coronavirus Response Act, or “Phase 2,” became law.“The three most important parts of this bill are testing, testing, testing,” said House Speaker Nancy Pelosi (D-CA) at the time.The bill included money for coronavirus testing, paid leave, food aid and funding for states.President Trump signed the Families First Coronavirus Response Act on March 18th.Phase 3On March 27 Trump signed the massive Coronavirus Aid, Relief, and Economic Security Act (CARES Act). The legislation carried a roughly $2 trillion price tag — the most expensive stimulus package to ever become law.The CARES Act created the Paycheck Protection Program and other loan programs for businesses, directed funding to states, localities and hospitals, added an extra $600 a week to unemployment benefits and sent stimulus checks to most Americans.“The $1,200, that was good, but it was gone pretty much immediately,” said Teresa Ibarra, a furloughed worker in Tennessee.The roughly $2T CARES Act included enhanced unemployment benefits, stimulus checks, funding for states, established the Paycheck Protection Program and more.Phase 3.5Lawmakers quickly realized they had to do more, but it took weeks to work through partisan gridlock. Ultimately, Congress passed a nearly $500 billion interim bill that replenished the Paycheck Protection Program, funding other small-business loans, expanded COVID-19 testing and included more money for hospitals.Congress passed an interim bill to replenish the Paycheck Protection Program, expand testing and give more money to hospitals.Phase 4?After the CARES Act, Republicans wanted to pause additional spending to see how the existing relief efforts played out. Democratic lawmakers, on the other hand, wanted to keep going. House Democrats passed their own $3 trillion bill, called the Heroes Act, but it did not stand a chance in the GOP-controlled Senate. Republicans called it a “wish list” of partisan ideas.“It’s dead on arrival here,” said Sen. Lindsey Graham (R-SC) at the time.Lawmakers have yet to begin bipartisan talks on Phase 4 in earnest, though Mnuchin said on Thursday he’s talked to certain Republican and Democratic members to get ideas.Earlier this week, Schumer and Pelosi wrote Majority Leader Mitch McConnell pressing him to start bipartisan talks.“Now is the time for action, not continued delays and political posturing,” they wrote.Parts of the CARES Act are soon set to expire. The Small Business Administration stopped accepting PPP applications on June 30, though this week Congress voted to extend the program to Aug. 8. The enhanced unemployment benefits are set to expire on July 31 if lawmakers don’t intervene.The extra $600 a week is sure to be a contentious point of debate between Republicans and Democratic lawmakers. Republicans argue it’s a problem that many people are making more on unemployment.“That’s made it tough for some small businesses in particular to get people to come back,” said Sen. Rob Portman (R-OH) in an interview.FRANKFORT, KY - JUNE 19: Hundreds of unemployed Kentucky residents wait in long lines outside the Kentucky Career Center for help with their unemployment claims on June 19, 2020 in Frankfort, Kentucky. (Photo by John Sommers II/Getty Images)Democrats say taking the extra $600 away will hurt millions of Americans the economy as a whole.“It would be unconscionable for Republicans to allow supercharged unemployment benefits to expire with the unemployment rate above 11% and 2.3 million new unemployment claims just this week,” said Sen. Ron Wyden (D-OR) in a statement on Thursday.There are a variety of proposals on how to address the expiring benefits, but lawmakers have yet to agree on a path forward.“It’s not a good time for them to still be arguing — Republican and Democrat and stuff — when there are people that are becoming homeless,” said Ibarra in an interview with Yahoo Finance. “They need to focus on helping people get through this, because there are a lot of people that are not OK.”Unemployment benefits are not the only point of contention in Phase 4. Republicans want to include liability protections for businesses and Democratic lawmakers want more money for state and local governments.“We’ve already seen more than 1 million public employees laid off around the country. One of the things that will not help our recovery is to have millions more teachers, paramedics and police officers who are a critical part of state and local government and their workforces laid off,” said Sen. Chris Coons (D-DE) in an interview with Yahoo Finance.Another question looming over lawmakers is what Trump will support. He has repeatedly mentioned (as recently as Thursday morning) the possibility of including a payroll tax cut in Phase 4, though that idea as failed to gain steam on Capitol Hill. When asked about another round of stimulus checks in an interview this week, Trump said he supports the idea.Mnuchin told reporters on Thursday the administration is considering additional direct payments to Americans.Yahoo Finance producer Valentina Caval contributed to this report.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Congressional watchdog finds 'significant risk' for fraud in Paycheck Protection ProgramBusiness leaders, tech CEOs bash Trump's visa suspensionNew bill would allow small businesses to get second PPP loanACLU sues to stop SBA from denying PPP loans to people with criminal recordsCoronavirus oversight panel Democrats ask banks for info, docs on PPP loans"}]}