{"article": [{"url": "https://finance.yahoo.com/news/oracle-wins-bid-to-buy-tik-tok-us-report-070700353.html", "published": 1600049720.0, "headline": "Oracle confirms TikTok US bid over Microsoft— but only a partnership", "body": "The logo for ByteDance Ltd.'s TikTok app is arranged for a long exposure photograph on a smartphone in Sydney, New South Wales, Australia, on Monday, Sept. 14, 2020. Photo: Brent Lewin/BloombergComputing tech giant Oracle (ORCL) has won the bid for TikTok US over Microsoft (MSFT).The group confirmed in a statement that it is part of the Bytedance/TikTok proposal to the US.The confirmation comes after an initial report by The Wall Street Journal and later Reuters, both citing unnamed sources, that the social media video platform is hoping to seal a partnership, rather than an outright sale, in order to keep some control over its US operations.Meanwhile, China's state broadcaster CGTN seems to have supported the notion that a deal wouldn’t mean an outright sale — instead a partnership. CGTN reported that ByteDance will not sell TikTok's US. operations to Microsoft or Oracle. In addition, a source told the South China Morning Post earlier that the tech upstart has decided not to sell or transfer the source code behind its popular video app.Just three days ago, a report from Reuters said that China would rather see TikTok US close rather than be pushed into a forced sale.Oracle’s proposed partnership with TikTok will still need to be approved by the White House and the Committee on Foreign Investment in the US.Microsoft put out a statement earlier confirming that TikTok’s parent company ByteDance informed it that it would not be selling it TikTok’s US operations.“ByteDance let us know today they would not be selling TikTok’s US operations to Microsoft. We are confident our proposal would have been good for TikTok’s users, while protecting national security interests,” Microsoft said in its blog.“To do this, we would have made significant changes to ensure the service met the highest standards for security, privacy, online safety, and combatting disinformation, and we made these principles clear in our August statement. We look forward to seeing how the service evolves in these important areas.”TikTok is currently owned by Chinese tech firm ByteDance, whose last valuation of $78bn (£61bn) makes it the world's most valuable start-up. It only launched in September 2016 but, outside China, it has already amassed 300 million active users and 1.4 billion total installs to date. TikTok has been downloaded 175 million times in the US alone.Story continuesREAD MORE: TikTok CEO Kevin Mayer quits amid Trump ban falloutDonald Trump’s administration, and a number of governments around the world, have voiced concern over TikTok being a data and security risk. Earlier this month, Trump said he wouldn’t ban the app as long as it’s US operations were under US ownership.Trump gave his blessing for technology company Oracle — run by Trump supporter Larry Ellison — to enter the running to buy TikTok and has mentioned separately that the US government should get a cut of the deal for introducing TikTok to a buyer.On 6 August, Trump signed an executive order on giving Americans 45 days to stop doing business with ByteDance. The two executive orders targeting TikTok and ByteDance means a bans U.S. companies from transacting with them and is due to come into effect on Sept. 20. The second requires ByteDance to sell TikTok by Nov. 12.On 27 August, TikTok CEO Kevin Mayer quit the company after only being in the role for 100 days.In a letter to staff, Mayer said that the “political environment has sharply changed” in recent weeks.“Against this backdrop, and as we expect to reach a resolution very soon, it is with a heavy heart that I wanted to let you all know that I have decided to leave the company,” he wrote.“I understand that the role that I signed up for — including running TikTok globally — will look very different as a result of the US administration's action to push for a sell-off of the US business.”"}]}