{"article": [{"url": "https://urldefense.com/v3/__https://finance.yahoo.com/news/steve-case-on-startups-in-next-round-of-stimulus-125936298.html__;!!Op6eflyXZCqGR5I!VardsejSpfDIpLBLFwi6xTu3VvNB1JJefWInA5iUc9y9Si_FwSVmDzzY9xy53wQ$", "published": 1595941940.0, "headline": "Steve Case: How Congress can back US startups, prevent 'massive brain drain'", "body": "Billionaire investor and tech entrepreneur Steve Case believes Congress needs to focus on the country's startup ecosystem in its next round of stimulus, in order foster future job growth and reverse a talent exodus sparked by the widening coronavirus crisis.As Washington debates the outlines of a new round of fiscal support for a ravaged U.S. economy, the co-founder of AOL [now a Verizon Media (VZ) property] and the CEO of the venture capital firm Revolution told Yahoo Finance last week that one of the areas Democrats and Republicans agree on is entrepreneurship and job creation.\"Small business accounts for a lot of jobs, but not a lot of net job growth. Big business, Fortune 500, also accounts for a lot of jobs, but not a lot of net job growth,” said Case, who once worked on the JOBS Act eight years ago with Congress and the Obama administration.Net job growth comes from young companies, the new companies, the startup companies,\" Case said, noting that focusing on the startup ecosystem could offset some of the permanent job losses from this crisis.\"Hopefully, the focus will be more and more on these new companies that are going to be the big job creators, not just looking in the rearview mirror at the economy of yesterday,” the entrepreneur told Yahoo Finance.Part of the is because I hear a lot of, 'We need to return to normal. We're hoping to get through this crisis and return to normal.' I don't think we want to return to normal. Normal didn't actually work that well for a lot of people. We need to do better than that when we come out of this crisis,\" Case added.His view is that the way to emerge stronger from this crisis the startups that will create future job growth, \"....and only if we do it in a more inclusive way, including backing female founders and Black and Brown founders, not just the white guys of Silicon Valley.\"A ‘massive brain drain’DENVER, CO - OCTOBER 04: Steve Case, co-founder of AOL, arrives at the Turing School of Software & Design in downtown Denver as part of his Rise of the Rest tour to highlight startups outside of Silicon Valley. October 04, 2016 Denver, CO. (Photo By Joe Amon/The Denver Post via Getty Images)Historically, venture capital money, approximately 75%, flocked to California, New York, and Massachusetts, resulting in a \"massive brain drain\" in other states where young, educated, talented people leave for opportunities elsewhere, Case said.Story continuesHe argued Congress needed to foster a “boomerang” of people coming back to the places left behind.\"Hopefully, what Congress will do as part of this next Phase 4 legislation will create the capital that can drive the creation of more regional venture funds, more of these companies in different parts of the country like the Midwest, Case explained.“...Some great states [have] a lot of really talented people who haven't had the same opportunity other people have had in places like Silicon Valley to start and scale companies. As a result, their communities have suffered,” he added.Recognizing this disparity, Case's Revolution launched its \"Rise of The Rest\" seed fund in 2017 to target companies in the middle of the country. The money is geographically focused, and has invested in over 100 companies in more than 70 cities across more than 30 sates.\"I'm very optimistic about these rising cities, and many of the folks in Congress representing these states that have often have been left out have a real opportunity if they put this legislation front and center around the startups,\" Case said.He pointed out that during the 2016 election, President Trump won 30 states. Collectively, only 15% of all venture capital funding went to those states.\"A lot of people in different parts of the country that were feeling left out. They were feeling left out because they kind of have been left out. The innovation for the future, the jobs of the future were being created in other places,” he said.“And they were seeing job loss in their families and job loss in their communities. So, that's part of the reason why, just from a national policy imperative standpoint, we need to make sure we level the playing field, so capital flows more broadly to more people in more places, jobs are created more evenly across the country, and we have an inclusive innovation economy that brings everybody along,\" Case added.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Ackman looks to ‘marry a unicorn’ with record-breaking SPACPalihapitiya: Skip government bailouts, put ‘more money into the hands of consumers’Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investorsBillionaire Palihapitiya on the phenomenon of ‘spectacular’ AOC"}]}