{"article": [{"url": "https://finance.yahoo.com/news/top-trump-adviser-jerome-powell-should-provide-the-data-and-then-keep-his-mouth-shut-160145715.html", "published": 1591873760.0, "headline": "Top Trump adviser: Jerome Powell should provide the data and then ‘keep his mouth shut’", "body": "On Thursday morning, stocks slid following the Federal Reserve’s monetary policy decision and a press conference from Chairman Jerome Powell highlighting ongoing economic challenges.The Federal Reserve says it expects real GDP to contract by 6.5% in 2020, with the unemployment rate reaching 9.3% by the end of the year.Top White House adviser Peter Navarro, it’s safe to say, is not a fan of those projections or of Fed Chairman Jerome Powell’s approach. During a Yahoo Finance interview with Andy Serwer, Navarro commented that Powell has “probably the worst bedside manner of any Fed chairman in history.”If he was going to market sushi, Navarro added, he “would market it as cold dead fish.” Navarro added.Shortly after Navarro’s remarks, President Trump tweeted his own critique of the Federal Reserve.The Federal Reserve is wrong so often. I see the numbers also, and do MUCH better than they do. We will have a very good Third Quarter, a great Fourth Quarter, and one of our best ever years in 2021. We will also soon have a Vaccine & Therapeutics/Cure. That’s my opinion. WATCH!— Donald J. Trump (@realDonaldTrump) June 11, 2020Larry Kudlow, director of the White House’s National Economic Council, added to the pile-on in a Fox Business interview Thursday. \"I do think Mr. Powell could lighten up a little when he has these press offerings\" he added a joking aside that \"we'll have some media training at some point.\"Like Trump, Navarro, who serves as the director of the White House Office of Trade and Manufacturing Policy, has long been critical of the Fed.In 2019, Navarro told Yahoo Finance that the Fed “is playing checkers in a chess world.” However, Navarro’s and Trump’s comments today come off the heels of recent praise for Powell from Trump about the Fed’s response to the economic fallout of the coronavirus pandemic.White House Trade and Manufacturing Policy Director Peter Navarro at the White House in March. (Drew Angerer/Getty Images)“I called up Jerome Powell, and I said, ‘Jerome, you've done a really good job,’” Trump said in March after the Fed took a range of measures to respond to the crisis, adding “I'm very happy with the job he did.”Story continuesThat praise is long gone. Navarro’s perspective is that Powell should not be analyzing or predicting economic trends. He wants that left to the White House.Powell’s best strategy going forward should \"simply be to provide the data and let us know where interest rates are going and keep his mouth shut,” he said.Navarro acknowledged that there are significant challenges ahead, but said if Powell wants to speak on the economy, he should speak with “enthusiasm and optimism” as he says the president does.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Fed: No rate hikes likely through 2022, projects 6.5% GDP contraction this yearCoronavirus stimulus checks: What would need to happen before a second roundTrump advisor Navarro: 'The Fed is playing checkers in a chess world'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn,YouTube, and reddit."}]}