{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-surge-has-economists-not-believing-hype-of-june-jobs-blowout-174533789.html", "published": 1593694400.0, "headline": "Coronavirus surge has economists not believing ‘hype’ of June jobs blowout", "body": "First, the good news: June saw a second consecutive month of record-breaking job market gains, with nearly 5 million people getting back to work as coronavirus-related lockdowns were relaxed. The jobless rate also tumbled to 11.1%, with more dislocated workers being absorbed by the ravaged labor market.Now, the bad news: The data was a partial snapshot of the labor market, mostly captured in mid-June — right before a new wave of COVID-19 infections began ricocheting across the world’s largest economy, which are threatening a return to lockdowns that have been progressively unwound.And despite two months of seven-digit job creation, those aren’t enough to counteract the staggering numbers of jobless workers still in limbo.In fact, the more compelling story could be found in weekly unemployment data, released simultaneously with the non-farm payrolls report that showed over 19 million continuing claims.Since the coronavirus became a byword for economic decimation, nearly 50 million have filed for unemployment benefits. To date, over 30 million of them remain without jobs, economists pointed out on Thursday.European banking giant ING succinctly summarized the dynamic using the title of a song from iconic 80s rap group Public Enemy: “Don’t believe the hype.”June’s blowout jobs report was “great news, but it doesn't tell the whole story. 31.5mn people are claiming unemployment benefits and employment is still 15 million lower than February,” wrote James Knightley, ING’s chief international economist.“Moreover, with states dialing back on re-openings the July jobs report could be far more sobering,” he added.‘Maybe save the fireworks’Amanda Agati, PNC Bank’s chief investment strategist, told Yahoo Finance in an interview that millions of jobless claimants were a “really worrisome” sign.Cases are surging in the southern part of the U.S. (Graphic: David Foster/Yahoo Finance)“It reinforces the point the jobs information and data doesn't jibe with a V-shaped recovery” that many in the market have hoped for, she added.Story continuesIt also raises the risk that July’s report will be a letdown — especially with COVID-19’s stubborn refusal to fade away.“A month ago we were in a much better place... maybe save the fireworks for the July report,” Agati quipped.Sun Belt states that include Florida, California and Texas — some of the most populous regions in the country — are now reimposing restrictions on citizens after lifting them. That poses considerable peril to bars and restaurants that were decimated by the first wave of mass lockdowns.“The virus’ second wave (or stubborn first wave) has raised doubts as to whether this can be sustained,” said Michael Feroli, economist at JPMorgan Chase, who said those questions were reinforced by the higher-than-expected jobless claims.“This occurred as PPP [Payroll Protection Program] funds began running dry in the second half of June (mostly after the reference week for the June employment report),” he said, adding that there were downside risks to the bank’s estimates for 12% growth in the second half of the year.According to some, a run of better-than-expected data — which includes a monster rebound in retail sales in an economy composed of 70% consumer spending — is also raising concerns that the federal government will pull back on fiscal stimulus.The major concern is that the headlines will lead some to conclude that it is time to close the door or pull back aid to those out of work,” said Joe Brusuelas, chief economist at RSM.“In our estimation that would be a serious policy error that would put in jeopardy a nascent recovery that we think is in play,” he said. Brusuelas added that additional unemployment payments set to expire at the end of July may result in “a sharp decline in household consumption in late summer and early fall, just before the November U.S. election.”President Donald Trump’s electoral fortunes hinge on whether the economy can pull off a death-defying recovery before November — one reason why he’s called for a new round of bigger, direct payments to consumers.However, at least some analysts warned that a sharp recovery is far from certain.“No doubt the administration will be crowing about today’s numbers, but they’d better make the most of them; the July and August numbers won’t be as good; at this point, we can’t rule out a decline in payrolls,” wrote Ian Shepherdson, chief economist of Pantheon Macroeconomics.Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}