{"article": [{"url": "https://finance.yahoo.com/news/lower-for-longer-rates-from-the-fed-point-to-weaker-for-longer-dollar-204429963.html", "published": 1599753140.0, "headline": "Lower-for-longer rates from the Fed point to a weaker-for-longer dollar", "body": "The greenback has been on a slide since COVID-19 arrived in the United States, and a wonky change in the Federal Reserve’s approach to inflation may apply further downward pressure on the dollar in the future.The U.S. dollar has depreciated notably over the course of the summer, with the U.S. dollar index (DX=F) falling to 92 at the end of August, a two-year low. Although the dollar has staved off further declines, forex analysts are warning that a weak U.S. dollar may be here to stay.A year-to-date chart of DX=F (Credit: David Foster / Yahoo Finance)ING’s economics team says that a “significant bearish factor” for the dollar is the Fed’s intention to allow inflation to “moderately” overshoot its 2 % target. The framework change means the central bank is likely to hold pat on near-zero interest rates for even longer.“It’s easy to lose track of chapters in the global currency war, but the Fed’s switch to average inflation targeting certainly looks one of them,” ING wrote September 4.Lower interest rates for longer could mean lower inflows into U.S. dollar-denominated investments. Interest rate differentials (when the return on deposits are greater in one country over another) have narrowed with the Fed now pinning U.S. rates near zero for the foreseeable future. Before COVID-19, the Fed had interest rates noticeably higher than in the Eurozone and Japan, where central banks had been backed into negative interest rates.“Markets are in broad consensus that low yields will be in play for years to come within the G10 space, meaning the Fed isn’t opening the dollar up to large bouts of pressure,” Monex Europe FX market analyst Simon Harvey told Yahoo Finance.Spillover effectsMorgan Stanley’s global investment committee agrees that a weaker dollar is an “underappreciated” impact of the Federal Reserve’s policy changes, noting that a weaker dollar may be a means for achieving higher inflation.“A weaker dollar exacerbates inflation because it drives up the cost of imports, especially commodities and consumer goods that are major inputs to US consumption,” Morgan Stanley’s Lisa Shalett wrote September 8.Story continuesAs the world’s reserve currency, the U.S. dollar presents the Fed with a unique challenge: prioritizing domestic monetary policy but maintaining awareness of the spillover effects from dollar dynamics.The Fed has had a close eye on dollar liquidity since the beginning of the COVID-19 crisis. In the spring, the U.S. dollar plunged and then spiked back up amid concerns over a global shortage of dollars. After the Federal Reserve flooded the world with greenbacks through swap lines with 14 other central banks, volatility abated before market factors began pushing the U.S. dollar lower.But a weaker dollar presents other challenges for countries now watching their currencies appreciate (which generally harm exporters). The European Central Bank has watched the Euro rise over 5% against the U.S. dollar since July, prompting ECB President Christine Lagarde to say Thursday that the central bank will “carefully monitor” the situation.Policymakers abroad may want to buckle in for a long period of dollar weakness. Monex’s Simon Harvey raised the possibility of the dollar rallying sharply once the Fed normalizes policy, but said normalization “won’t be occurring anytime soon.”The level of appreciation in other currencies depends on other risk factors. For example, in the United Kingdom, the lingering uncertainty around Brexit has Monex predicting GBP/USD to rise to 1.45 by August 2021. In comparison, Monex predicts more stability in EUR/USD, with a 12-month target of 1.22.As of Sept. 10, the GBP/USD rate was at 1.28 and EUR/USD at 1.18.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Senate GOP sends mixed messages on need for Federal Reserve emergency loansFed Chair Powell: Wearing masks can lead to 'enormous' economic gainsFederal Reserve: We got it ‘wrong’ on post-crisis rate hikesJackson Hole wrap-up: For the Fed, inflation is all about managing expectationsA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}