{"article": [{"url": "https://finance.yahoo.com/news/slack-second-quarter-earnings-work-from-home-202052097.html", "published": 1599642980.0, "headline": "Slack misses expectations on quarterly billings, stock plummets", "body": "Slack (WORK) reported second quarter results after the closing bell on Tuesday afternoon, announcing revenue that exceeded expectations but calculated billings that fell well short of analyst’s estimates.The stock plummeted more than 15% in after-hours trading on Tuesday and was still down over 14% at 10:20 a.m. EST on Wednesday.Here’s how Slack performed last quarter compared to Bloomberg consensus expectations:Revenue: $215.9 million vs. estimates for $209.2 millionTotal paid customers: 130,000 (8,000 net new) vs. estimates for 127,950Billings: $218.2 million vs. estimates for $232.9 millionAdjusted loss per share: Broke even vs. estimates for three cents per share.Looking ahead for guidance in the third quarter:3Q revenue: $222 million to $226 million vs. consensus estimate of $222.9 million3Q adjusted loss per share estimate: Six cents to five cents vs. consensus estimate of five centsFY adjusted loss per share estimate: 14 cents to 13 cents vs. consensus estimate of 16 centsHeading into the quarterly report, analysts painted a mixed picture of the stock, with 12 buys, nine holds, and four sell ratings, and the average price target at $34.67. Slack’s adjusted EPS beat estimates in four of the past four quarters.The exuberant strength of the work-from-home tailwind may be taking an overdue breather amid a broader sell-off in the tech sector. In addition to Facebook (FB), Netflix (NFLX), Apple (AAPL), cloud players like Zoom (ZM), Docusign (DOCU) and Salesforce (CRM) are seeing moderation across the board. The high-flying tech names that were essential in leading the market up have been leading all three major indices lower for a third consecutive day. But the widely held view is that the sell-off is largely the result of healthy profit-taking, not a broader-based correction.Slack Technologies Inc. co-founder and CEO Stewart Butterfield poses outside the New York Stock Exchange (NYSE) during thew company's IPO in New York, U.S. June 20, 2019. REUTERS/Brendan McDermidCowen analyst J. Derrick Wood wrote in a note last week that about 10% of Slack’s float is still being shorted by investors, reflecting the high level of uncertainty and tepidness surrounding the stock. Looking at the overall landscape, Slack has proven to be a sticky service, even against its only formidable competitor, Microsoft Teams (MSFT). In its fiscal first quarter, Slack has so far held up strongly, posting a 132% net dollar retention rate.Story continuesSlack has been steadily expanding its portfolio of large enterprise clients, which include Amazon (AMZN), IBM (IBM) and Yahoo Finance parent company Verizon (VZ). Last quarter, it added Peloton (PTON), Shopify (SHOP), Wayfair (W), Northwestern Mutual (NWE), Stripe and Doordash as customers. The company ended the quarter with 87 paid customers spending over $1 million annually, which represents a 78% year-over-year increase.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:‘Mulan’ producer on boycott threats: ‘I feel badly...the conversation turns to this’What Silicon Valley still doesn't understand about its diversity problem47% of teachers considered making a job change in the past month: surveySerial tech entrepreneur launches ambitious alternative to school: 'It's a very progressive approach to education''People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talent"}]}