{"article": [{"url": "https://finance.yahoo.com/news/why-stocks-are-rallying-while-president-trump-battles-covid-19-170153349.html", "published": 1601899760.0, "headline": "Why stocks are rallying while President Trump battles COVID-19", "body": "At first blush, it wouldn’t make sense that the stock market rallies as the leader of the free world battles with the potentially lethal disease that is COVID-19.But that is just what happened on Monday even as questions swirl around the president’s true health, if he will return as a patient of Walter Reed Medical Center and the functioning of government as administration members (and Senators who had contact with Trump recently) encounter their own cases of coronavirus. The Dow Jones Industrial Average rallied 465 points by the closing bell. Investors also sent the S&P 500 and Nasdaq Composite to solid gains.For astute market watchers, however, the risk on rally today isn’t a shock when it comes to all things President Trump. They say a change in the White House would be a welcome relief from the latest bout of chaos from the administration.And with that relief, more certainty — something asset prices always seem to love one way or another.“To me, the optimism in the market has to do with an increased conviction that Joe Biden will win [the presidency] and that will bring in a Blue Wave which in turn, will bring a large fiscal stimulus package early next year,” explained Compass Point Research director of policy research Isaac Boltansky on Yahoo Finance’s The First Trade. “There is no doubt in a Blue Wave scenario you will have higher taxes for capital, for corporations and high earners. There is no doubt of that. As the market slowly gets its arms around those realities and digs into the potential legislative responses, it sees not just higher taxes but also a broader fiscal expansion that would come from a Blue Wave especially farther down the economic spectrum. I think those types of puts ands takes are considered coupled with more certainty.”In this image released by the White House, President Donald Trump works in his conference room at Walter Reed National Military Medical Center in Bethesda, Md., Saturday, Oct. 3, 2020, after testing positive for COVID-19. (Joyce N. Boghosian/The White House via AP)Fueling this near-term sentiment put forth by Boltansky are two fresh polls on the presidential election.Democratic presidential nominee Joe Biden leads the race to be the next president 53% to 39%, according to a new poll of registered voters released Sunday by The Wall Street Journal/NBC News. The poll came right after the contentious first debate between Trump and Biden a week ago, but before the president was diagnosed with COVID-19. A poll from Reuters conducted from Oct. 2-3 — following Trump’s diagnosis — found Biden leading Trump in the presidential race by a commanding 10 percentage points.Story continuesThe takeaway for investors right now (or so it seems): waning support for Trump means more election certainty, which is bullish for equities.Opines Deutsche Bank strategist Jim Reid, “Indeed the recent price action suggests that the market wants certainty more than anything else. Given the realistic options (assuming the polls are not completely out), perhaps the market would currently most like a Democratic clean sweep as this would increase the likelihood of near term certainty. This outcome was edging up in likelihood amongst respected political pundits ahead of Mr Trump’s positive test so Friday’s news brought back all sorts of uncertainties with tail risks increasing in all sorts of directions. The fact that Biden tested negative later in the day seemed to help markets which partly supports the theory above.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.What’s hot this week from Sozzi:Peloton’s biggest rival just raised a ton of money from the likes of Stephen CurryHome Depot co-founder and Atlanta Falcons owner gives his best advice to new NY Mets ownerPeloton founder: here’s one of my biggest 15 year goalsVitamin Shoppe CEO: the pandemic has changed our businessKraft Heinz CEO: Buffett’s team like our $3.2 billion dealKroger CEO: this is how we see the future of food shoppingWatch Yahoo Finance’s live programming on Verizon FIOS channel 604, Apple TV, Amazon Fire TV, Roku, Samsung TV, Pluto TV, and YouTube. Online catch Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, and reddit."}]}