{"article": [{"url": "https://finance.yahoo.com/news/if-lumber-prices-dont-come-down-you-will-see-a-slowdown-in-housing-nahb-ceo-171649494.html", "published": 1600431860.0, "headline": "If lumber prices 'don’t come down, you will see a slowdown in housing': NAHB CEO", "body": "Homebuilder sentiment is at an all-time high, as city-dwellers seek out suburban homes during the coronavirus pandemic. But experts warn that an overcorrection in the lumber market could spell trouble for homebuilders and homebuyers alike.U.S. lumber prices rose 170% from April to an all-time high in August and moderated only slightly in September, driving the cost of the average new home up $16,148 since April 17, according to the National Association of Home Builders, a Washington, D.C.-based trade organization.“The dark cloud on the horizon of the single-family side is lumber prices,” National Association of Home Builders CEO Jerry Howard told Yahoo Finance The Ticker. “If we continue to see this type of increase in the prices, or — I’ll make an even more dire prediction — if prices don’t come down, you will see a slowdown in housing.”Coronavirus lockdowns, supply shortages and labor shortages caused two thirds of firms to delay or cancel construction projects in March and April, creating a temporary but drastic drop in demand for lumber. Prices dropped 21%, and U.S. lumber companies slowed production to moderate supply. But the drop in production created a shortage when construction activity resumed in May, sending U.S. lumber prices soaring past historical levels, according to estimates by the Random Length Lumber Futures, a lumber price measure by the CME Group, a Chicago-based global markets company.“The rapid increase in the cost of lumber is, in turn, increasing the cost of building… Supply-side headwinds could slow the homebuilding momentum at a time when the housing market desperately needs new construction,” said Odeta Kushi, deputy chief economist at First American, a California-based property services, mortgage and title insurance services company.Since 2017, a 20% tariff on Canadian softwood lumber has also limited builders’ access to cheap wood. The World Trade Organization (WTO) ruled against the tariff last month, but the Trump administration condemned the WTO ruling and has not said whether they will comply with the panel’s report.Story continuesWhile awaiting the U.S.’s response to the WTO’s ruling, industry leaders have asked President Trump to reduce lumber tariffs during the shortage.“While the outlook is promising, sharply rising lumber prices are concerning,” said Lawrence Yun, chief economist at the National Association of Realtors. “A reduction in tariffs – even if temporary – would help increase home building and thereby spur faster economic growth.”For every $1,000 price increase, some 150,000 potential buyers are priced out of a home purchase, according to the NAHB.Rising prices could cap feverish demandThe home market is hot, but it is driven by millennials and first-time homebuyers who want mid-priced homes that are under $400,000. For every $1,000 price increase, some 150,000 potential buyers are priced out of a home purchase, according to the NAHB.“That [the price of lumber] is really starting to have an impact on the builders’ ability A, to get lumber, and B, to build affordably with it,” said Howard. That “is really really what has me worried about the first-time homebuyer market and therefore potentially the overall markets.”Low supply and high demand for single-family homes, driven in part by record-low mortgage rates, are also driving home prices up. That, coupled with high building costs, could cripple the homebuilding industry’s ability to meet buyer demand for homes in an affordable price range, under $400,000 according to experts.“The inventory is very low,” said Howard. “And so, we invite our friends in the timber industry to increase their production and help us get America back to work.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:‘Lenders don’t have the capacity’ to meet mortgage demand: expertThere’s a ‘staggering shortage of homes on the market’: economist‘New York and California are the land of the flee, and Texas is the land of the free’: real estate investor"}]}