{"article": [{"url": "https://finance.yahoo.com/news/apple-tesla-stock-split-more-shares-to-go-around-morning-brief-100905716.html", "published": 1598937440.0, "headline": "Why Apple and Tesla shares surged after getting split: Morning Brief", "body": "Tuesday, September 1, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThere are now more shares of Apple and Tesla to go aroundOn Monday, shares of Apple (AAPL) and Tesla (TSLA) began trading on a split-adjusted basis.Apple shares split 4-for-1 and Tesla split 5-for-1.So for each share of Apple someone owned on Friday, as of Monday they owned four. For Tesla, that number is now five.Investors were excited about this news — on Monday, shares of Apple rose 3.3% while Tesla shares gained a whopping 12.5%. Both stocks closed at record highs.Which both makes sense and doesn’t.On the one hand, both companies said these stock splits were designed to create broader access to their shares.As part of its July 30 earnings release, Apple said, “The Board of Directors has also approved a four-for-one stock split to make the stock more accessible to a broader base of investors.” On August 11, Tesla said in a press release, “[Tesla’s] Board of Directors has approved and declared a five-for-one split of Tesla’s common stock in the form of a stock dividend to make stock ownership more accessible to employees and investors.” (Emphasis added.)And the rally in both stocks on Monday shows that wider access did indeed create incremental demand for shares.But with Robinhood and other online brokerages offering investors access to fractional ownership in shares, it is somewhat surprising that so many investors were still enticed by any newfound affordability of a full share of either company. Especially since the split-adjusted price of a single share of Tesla — now $498.32 as of Monday’s close — is basically the same as the price Apple deemed too high.Stock splits are also just cosmetic changes in the number of outstanding shares a company has issued and the price of said shares. Splitting a stock does not change the value of a business.The textbook would thus tell you to expect no change in the price of a company’s stock because the stock was split. Cutting a pizza into 16 pieces instead of 8 does not create more pizza. It just creates more slices of the same pizza.Story continuesAnd as JonesTrading’s Dave Lutz flagged on Monday, after each of Apple’s four previous stock splits the stock fell over the next 10 trading days. If anything, then, history suggests Monday’s split would be negative for Apple stock.However, the idea of a liquidity premium says that both stocks should trade higher if it is easier to trade shares with this new, lower price. In other words, because it is harder to transact in a stock that is $1,000 versus one that is $100, the $100 stock should trade at a slight premium because it is a more liquid asset.And Monday’s price action does show shares of both Apple and Tesla had experienced an illiquidity discount before these splits.And perhaps reveals this episode as yet another example of the 2020 stock market in which things can seem both crazy and yet make total sense at the same time.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy9:45 a.m. ET: Markit U.S. Manufacturing PMI, August (53.6 expected, 53.6 in July)10:00 a.m. ET: ISM Manufacturing, August (54.8 expected, 54.2 in July)10:00 a.m. ET: ISM New Orders, August (61.5 in July)10:00 a.m. ET: ISM Prices Paid, August (54 expected, 53.2 in July)10:00 a.m. ET: ISM Employment, August (44.3 in July)10:00 a.m. ET: Construction Spending MoM, July (1.0% expected, -0.7% in June)Top NewsEuropean stocks rise on fastest Chinese manufacturing growth since 2011 [Yahoo Finance UK]Apple preparing 75M 5G iPhones alongside new watches and iPad [Bloomberg]Walmart unveils 'ultimate life hack,' a $98 membership with access to gas, groceries and free delivery [Yahoo Finance]AstraZeneca signs 18-month vaccine deal with Oxford Biomedica [Yahoo Finance UK]Zoom beats quarterly revenue estimates on remote work boost [Reuters]YAHOO FINANCE HIGHLIGHTSDelta, American, United end change fees in an effort to get Americans flying againWorkers will see smaller paychecks next year under Trump's payroll tax deferralWarren Buffett is still being sent cheeseballs from Utz CEO — Here's why—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}