{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-florida-and-texas-pull-back-as-us-infections-soar-190302022.html", "published": 1593180680.0, "headline": "Coronavirus update: Florida and Texas take steps back as US infections soar", "body": "Florida and Texas announced moves on Friday that contributed to their status as new U.S. coronavirus epicenters, with soaring infection rates prompting both states to pull back on key elements of their reopening plans.The COVID-19 outbreak continues its march across the globe, with the U.S. hit a new record of case increases Thursday, pushing the country’s total count to more than 2.4 million. Meanwhile, the global case count surged past 9.6 million Friday, with Brazil having surpassed 1 million cases this week, and Russia and India not far behind.U.S. deaths have slowed, however, something that public health experts believe is a combination of younger hospitalized patients who may recover more quickly, and a lag from the sudden surge in cases which may yet send fatalities spiking in the coming weeks.Still, America’s inability to contain new case spikes has unsettled markets and public officials. Many states in the Sun Belt — which were among the first to relax lockdowns — have seen skyrocketing one-day tallies in diagnoses and hospitalizations.Rising totals in at least half of the country have overshadowed good news from former hotspots in New York and New Jersey, which are seeing record lows in daily case counts since peaking in April.The number of coronavirus cases outside New York are skyrocketing. (Graphic: David Foster/Yahoo Finance)On Friday, Florida slapped restrictions on bars as the state reported nearly 9,000 new COVID cases in a day, its highest total since the crisis began. Hard-hit Miami paused its reopening as hospitalizations surged there.In Texas this week, Gov. Greg Abbott announced a pause on reopening and a halting of elective surgeries as the hospital system neared a breaking point. Noting a nearly 12% positivity rate was a result of Texans congregating in places like bars, the governor on Friday ordered the state’s bars closed and limited restaurants to 50% capacity.There are over 2.4 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)The growing urgency prompted the White House coronavirus task force to hold a briefing for the first time since late April. Vice President Mike Pence said the task force has been focused on helping states reopen the economy, but the rising cases in southern states demanded attention.Story continuesPence’s gave a more constructive view of the outlook, crediting increased testing and a lower national average rate of hospitalizations. He suggested that hospitals in hard-hit areas have the capacity they need.Separately, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said the reasons behind the rise in southern cases is a multi-faceted problem.“We have a very heterogenous country, but heterogeneity does not mean we are not interconnected to one another,” he said.“When you have an outbreak of an infectious disease, it’s a dynamic problem that is global. Anyone who gets infected, or is at risk, is part of the dynamic part of the outbreak,” he added. Fauci also voiced concern about the growing number of new cases among younger patients.On Thursday, the Centers for Disease Control warned that it was “not just those over the age of 65 who are at increased risk for severe illness.”Meanwhile, North Carolina’s lieutenant governor informed the governor of his intention to sue Thursday due to economic hardship restrictions have caused state residents. The move came after Gov. Roy Cooper paused its reopening as cases spike, while the state’s legislature debated an anti-mask law after Cooper mandated masks Thursday.Gilead pricing debateWhile Gilead Sciences (GILD) has not yet named a price for its antiviral being used as a COVID-19 treatment, one non-profit has increased its estimate from $4,500 to up to $5,080 per dose.The Institute for Clinical and Economic Review (ICER) also said in a new report Thursday that a lower price range of around $2,520 to $2,800 is likely, if dexamethasone is approved by the FDA as a COVID-19 treatment.Both drugs target the more serious cases of the coronavirus outbreak. Globally, remdesivir is already being adopted by some countries and deals are in the works.In India, generic drugmakers licensed to produce the drug are selling it for between $66 to $79. Remdesivir will become the first officially recommended in Europe for severe patients ages 12 and up, but a price has not yet been set.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}