{"article": [{"url": "https://finance.yahoo.com/news/3-tech-stocks-berkshire-hathaways-085219847.html", "published": 1602216020.0, "headline": "3 Tech Stocks In Berkshire Hathaway's Portfolio", "body": "Berkshire Hathaway Inc. (NYSE: BRK-A) (NYSE: BRK-B) has managed to outperform the broader markets consistently over the last few decades.Let’s take a look at three such technology companies backed by the Warren Buffett and Charlie Munger-led investment company that have managed to outperform the S&P 500 index in 2020.Apple, A $2T Giant: Tech heavyweight Apple Inc. (NASDAQ: AAPL) is a company valued at approximately $2 trillion.According to Berkshire’s latest 13F filing, it holds a little over 1 billion Apple shares worth $115.4 billion, indicating a 5.9% stake in the company.Apple accounts for 48.9% of Berkshire’s total portfolio and it has been one of the top-performing stocks in the last two decades. The iPhone manufacturer continues to benefit from customer loyalty and an expanding product portfolio that has grown over the years to include wearables like the Apple Watch and AirPods.The iPhone remains Apple’s key revenue driver, but its Services business is the company’s fastest-growing segment. Apple’s Services business includes the highly lucrative App Store and several subscription products like the Apple TV+, Apple Music, Apple Care, and Apple Arcade.Apple has successfully created a robust ecosystem with a strong focus on customer engagement. At the start of 2020, it claimed to have over 1.5 billion active devices, while the number of total paid subscriptions at the end of July rose 31% to year-over-year to 550 million.Apple had aimed to double its 2016 Services revenue of $24.3 billion by fiscal 2020. In the first nine months of fiscal 2020, Apple’s Services business totaled $39.2 billion.Amazon, The E-Commerce Heavyweight: Berkshire Hathaway holds 533,300 shares in Amazon.com Inc. (NASDAQ: AMZN) worth $1.7 billion, indicating a 0.1% stake. Amazon has been one of the top stocks in the last decade and has returned a staggering 1,900% since October 2010.Story continuesIn 2020, Amazon stock is up 73% and it is one of the few companies to have weathered the pandemic unscathed. As the world went into lockdown, people were compelled to stay at home — with no option but to shop online for essentials as well as luxury products.The COVID-19 pandemic has acted as a tailwind for e-commerce companies. In the second quarter this year, Amazon sales were up a stellar 40.2% year-over-year.Amazon is not only the world’s largest online retailer, but it also leads the public cloud infrastructure market and is the third-largest digital advertising platform after Alphabet Inc (NASDAQ: GOOG) (NASDAQ: GOOGL) and Facebook Inc (NASDAQ: FB).The online retail segment is expected to account for 16% of total retail sales in 2020 and this number is expected to rise to 22% by 2023, according to Statista, suggesting Amazon’s growth story remains intact.Snowflake, A Recent Tech IPO: While Buffett is not a fan of investing in initial public offerings or early-stage companies, Berkshire Hathaway acquired 6.12 million shares of Snowflake Inc. (NYSE: SNOW) worth $1.4 billion. Snowflake is valued at a market cap of $66.4 billion, which means Berkshire holds about a 2.2% stake in the firm.A cloud computing company, Snowflake recently went public and gathered significant attention, as it upsized the IPO pricing twice.The company increased its listing price from $75 to $120 and still managed to open at $245 per share on the first day.Snowflake is an enterprise-facing, cloud-based data warehousing company and is expected to be volatile in the near-term as investors try to make sense of its lofty valuation.Analysts tracked by Yahoo Finance expect Snowflake sales to touch $571.02 million in fiscal 2021, indicating a forward price to sales multiple of 116.7.Photo courtesy: Fortune Live Media via FlickrSee more from BenzingaOptions Trades For This Crazy Market: Get Benzinga Options to Follow High-Conviction Trade Ideas© 2020 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."}]}