{"article": [{"url": "https://finance.yahoo.com/news/jpmorgan-q2-earnings-110232871.html", "published": 1594707140.0, "headline": "JPMorgan beats on earnings but Dimon warns on 'much uncertainty'", "body": "JPMorgan Chase (JPM), the largest U.S. bank by assets, kicked off the second-quarter earnings season for big banks on Tuesday by delivering stronger-than-expected results during the height of the COVID-19 pandemic.Here were the key figures versus the expectations for the second quarter, according to analysts polled by Bloomberg.Revenue (adjusted): $33.83 billion vs $30.57 billion expectedEarnings per share (adjusted): $1.38 vs $1.01 per share expectedThe JP Morgan Chase & Co. headquarters, The JP Morgan Chase Tower in Park Avenue, Midtown, Manhattan, New York. JPMorgan Chase & Co. is an American multinational banking and financial services holding company. It is the largest bank in the United States. Manhattan, New York, USA. 27th January 2014. Photo Tim Clayton (Photo by Tim Clayton/Corbis via Getty Images)JPMorgan’s bottom line was bolstered by skyrocketing trading revenues as the COVID-19 crisis heightened market volatility. However, the bank saw net income plunge by 51%, as it set aside $8.9 billion in credit reserves for the quarter — in the anticipation of possible credit losses due to the pandemic’s worsening severity.In the management commentary, CEO Jamie Dimon noted that the firm had generated its “highest quarterly revenue ever” before setting aside the loan loss reserves.JPMorgan Chase increased its loan loss reserves to $8.9 billion during the second quarter.“Despite some recent positive macroeconomic data and significant, decisive government action, we still face much uncertainty regarding the future path of the economy. However, we are prepared for all eventualities as our fortress balance sheet allows us to remain a port in the storm,” Dimon said in a statement.Dimon added that the firm has “massive loss-absorbing capacity” with over $34 billion in credit reserves and liquidity above $1.5 trillion, in addition to the $191 billion CET1 capital.“This is why we can continue to serve all of our stakeholders and to pay our dividend - unless the economic situation deteriorates materially and significantly,” Dimon added.Trading revenues were strong, booming 79% from a year ago to $9.7 billion. Revenue from fixed-income surged a whopping 99% to $7.3 billion year-over-year, while equity trading revenue rose 38% to $2.4 billion “driven by strong client activity in derivatives and Cash Equities.”Banking revenue jumped 46% from a year ago to $5 billion. Investment banking revenue increased 91% to $3.4 billion because of higher fees.Story continuesMeanwhile, in the consumer and community banking business, credit card sales volume declined 23% from a year ago, while average loans dropped 7%. Average deposits rose 20% JPMorgan also built out its loan loss reserves for consumer, with most of it dedicated toward its card business.Shares of JPMorgan were last trading up about 4% above $100 per share in the pre-market, up from Monday’s close at $97.65 per share. —Julia La Roche is a Correspondent at Yahoo Finance. Follow her on Twitter. Palihapitiya: Skip government bailouts, put ‘more money into the hands of consumers’Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investors"}]}