{"article": [{"url": "https://finance.yahoo.com/news/robinhood-is-not-behind-the-rally-barclays-says-as-retail-demand-surges-220519362.html", "published": 1591982000.0, "headline": "'Robinhood is not behind the rally,’ Barclays says as retail demand surges", "body": "Unemployment may be at 13.3% — and maybe even up to 5 percentage points higher — but retail investors, the regular folks of the investing world, are jumping into the market, channelling their inner Warren Buffett to be greedy when others are fearful.Many narratives have emerged both on Wall Street and in the financial media that these new investors, using zero-cost brokerages like Robinhood to trade stocks, could be joining the Federal Reserve and the government’s coronavirus response in pushing the stock market up.But in a research note circulated to clients Friday, Barclays said no, “Robinhood is not behind the rally.” Using the popular Robintrack database that offers insight on most popular positions and changes, analysts from Barclays Investment Sciences wrote that since March 2020, when the market bottomed out, stocks have generally done worse when Robinhood users get interested.“We have seen the opposite of the conventional wisdom—all else equal, more Robinhood customers moving into a stock has corresponded to lower returns, rather than higher,” the analysts wrote.Though the Robinhood user holdings of S&P 500 ETF jumped in-line with the market’s gains, spikes in holdings of those ETFs didn’t correspond with spikes in the market.If there isn’t a relationship between Robinhood activity and the overall market, what about individual stocks?“It is undeniable that there are many examples of big stock gains coming along with big increases in Robinhood customer holdings. For example, Amazon has been a strong performer, gaining 45% since mid-March 2020 vs roughly flat for the S&P 500,” the Barclays note said. “But just because two things happen at the same time doesn’t mean one causes the other.”Furthermore, they wrote, low-performing stocks have also seen big bumps.“COTY has been the worst performing name in the S&P 500 since mid-March 2020. But the number of Robinhood accounts that hold COTY has increased sixfold, a much bigger gain than that for Amazon,” the note said.Story continuesUKRAINE - 2020/05/02: In this photo illustration a Robinhood logo seen displayed on a smartphone. (Photo Illustration by Igor Golovniov/SOPA Images/LightRocket via Getty Images)Still, many disagreeInfluential investor and billionaire Jeffrey Gundlach, speaking in an online presentation this week, said there was \"something unnerving that's going on in this rally,\" and it \"seems to be driven by a lot of rampant speculation.\"Yes, Gundlach was talking about Robinhood. The “bond king” brought up a chart from Robintrack data and pointed to the rise of accounts and activity to the coronavirus lockdown, with a particular acceleration when the stimulus checks hit.To Gundlach, this is an explanation, or at least part of one, to what’s driving the market, especially in the big tech stocks, because money just isn't flowing from institutional investors.Other market watchers, like analysts at Goldman Sachs, have highlighted surges in new accounts, noting the \"continued surge in retail investor trading activity has helped boost the growth stocks most popular with hedge funds.\"Deutsche Bank’s Parag Thatte, who also looked at Robintrack data, mused that there seems to be a lot of evidence that retail investors are getting in on this rally and, like, Gundlach, saw flows markedly different for retail investors than other groups. In particular, Thistle noted that Robinhood accounts holding mega cap stocks (at least $200 billion market cap) rose by 50% during the lockdown.Robinhood is not VanguardThe focus on Robinhood activity makes some sense given the company’s role as a disruptor. It established free trades — making others do the same — and is pretty, modern, and millennial- and mobile-friendly. But does it deserve the constant callouts in analyst notes?Maybe, since its data is available via Robintrack, which might be useful to someone. And anecdotally, its 3 million accounts added so far this year (as of May 4) and its adoption of fractional shares mean that a lot of people may end up using the app.But is Robinhood activity enough to move the market? Judging from the popularity of the ability to buy less than a share at a time — the volumes just might not be that big. Although Robinhood’s assets under management is not public, it likely is miniscule compared to the big players of retail money: BlackRock, Vanguard, Fidelity, and Schwab.However, what if Robinhood’s popularity is a proxy for something else?Nicholas Colas, a former hedge fund manager who writes the DataTrek newsletter, said Google Trends will tell you what the retail market is thinking. “It’s certainly a thing,” he wrote. “If you use Google Trends, look at search volumes for ‘buy stocks’ over the last year. Huge interest pickup.”One likely scenario is the internalized message of “buy low, sell high,” something that my colleague Myles Udland has also wondered. That, combined with everybody knowing the Buffett aphorism about when to be greedy might have affected some people’s behavior.It sure worked for 401(k) shops like Fidelity, Vanguard, and T. Rowe Price, who told their investors to “stay the course”: Most of them followed the advice.Just like how people didn’t panic and sell their 401(k)s holdings, perhaps they saw stocks with prices that seemed really low and decided to jump in.Colas also pointed out that while it’s hard to know the effects of fractional share ownership — you can own less than a share on SoFi, Robinhood, Schwab, and others — it might have an outsized effect, especially given people aren’t always shy about using margin on these platforms.This, he added, “probably” has contributed to the market run-up.“The system isn’t really tuned to accommodate lots of small orders,” he wrote. “Market making algos only know the recent past, so seeing higher order volumes and fewer limit orders suddenly appear may have had an impact.”Robinhood users have increasingly become interested in struggling stocks that are even going bankrupt, like J.C. Penney and Hertz, wading past day-trading into outright speculation given the volatility of these companies’ prices.In addition to trading with bankrupt companies, a Sundial Capital Research note that examined Robinhood user behavior found a 13.1% rise in accounts with short ETF positions versus a 1.2% drop in accounts that had their long counterpart and a 13.1% rise in short ETFs, the largest net difference in two years.“Maybe Robinhood will stick around and this can develop into a reliable indicator of retail sentiment,” wrote Sundial Capital’s CEO Jason Goepfert. “More likely, volatility will pick up, users will move on to their regular jobs and sports betting, and interest in the platform will wane.”--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Want a 'slice' of a stock? Demand booms for fractional shares as markets soarLeisure and hospitality drive jobs numbers higherOverdraft fees have forced the poor out of banks: Former FDIC chairWhy pandemic insurance is impossible2021 health insurance rates are coming out despite 'unprecedented uncertainty'Insurance premiums expected to rise 4% to 6%, before factoring in COVIDHigh-yield savings banks finally hit by the Fed's coronavirus rate cutFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"}]}