{"article": [{"url": "https://finance.yahoo.com/news/consumer-confidence-jackson-hole-symposium-rnc-what-to-know-in-the-week-ahead-153344395.html", "published": 1598179280.0, "headline": "Consumer confidence, Fed's virtual Jackson Hole, RNC: What to know in the week ahead", "body": "This week’s busy economic calendar is set to include two sets of consumer confidence reports, the second revision of second-quarter US gross domestic product and a variety of other data on the housing market, consumer spending and manufacturing sector activity. Corporate earnings results will focus on a plethora of software names including Palo Alto Networks (PANW), Salesforce (CRM) and Okta (OKTA), and retail names including Best Buy (BBY), Nordstrom (JWN) and Dick’s Sporting Goods (DKS).The Republican National Convention (RNC) takes place this week from Monday through Thursday, at which point President Donald Trump will accept the Republican Party’s nomination from the White House. As with last week’s Democratic National Convention (DNC), most of the RNC events will be virtual, though a limited number of Republican leaders and delegates will also be present in-person in Charlotte, N.C., to kick off the event Monday. The event’s primary theme is “Honoring the Great American Story.”Later in the week, central bank officials will convene virtually for the Federal Reserve Bank of Kansas City’s annual monetary policy symposium, which typically takes place in Jackson Hole, Wyoming.Consumer confidence, personal spendingMarket participants are set to receive two reports offering a look at consumers’ views on the current economic situation, in the form of the Conference Board’s August Consumer Confidence Index, along with the University of Michigan’s Surveys of Consumers.Consensus economists expect the Conference Board’s Consumer Confidence Index will hold nearly flat at a reading of 93.0, up slightly from July’s reading of 92.6. While this would be an improvement from the pandemic-era low of 85.7 in April, it would still represent a sharply weaker reading compared to the 2019 average monthly reading of about 128.“The second spike in Covid-19 cases led to many states scaling back their reopening strategies and the combination of renewed health and economic concerns pushed confidence lower in July,” James Knightley, chief international economist for ING, said in a note Friday. “We expect it to stay subdued in August, especially with employment growth showing signs of stalling and incomes being squeezed for millions of people due to the $600/week federal unemployment benefit boost having ended. It is being replaced by a new $400 payment, but even so the combination of weaker confidence, employment and incomes means that the consumer sector is going to struggle to maintain its recent run of strong performance.”Story continuesSeparately, the University of Michigan’s final August sentiment index, set for release Friday, is poised to show an unchanged reading of 72.8, hovering close to April’s pandemic-era low point of 71.8. In the University of Michigan’s preliminary reading, a gauge of consumers’ five-year economic outlooks declined to a six-year low, with Americans expecting the pandemic to create a longer-term anchor on jobs and incomes.In the preliminary University of Michigan print, Richard Curtin, director of the university’s Surveys of Consumers, noted that policy gridlock and uncertainty around further economic relief stirred consumer fears about their ability to cope with the fallout from the pandemic. Discussions in Washington over a further stimulus package appear on hold until lawmakers return from August recess in mid-September.Also on Friday, investors are set to the receive a print from the Bureau of Economic Analysis on personal income and personal spending changes in July. In June, personal income fell 1.1%, extending a 4.4% drop from May, as boosts from federal stimulus checks and unemployment benefits moderated. Income is expected to fall for a third straight month in July, at a 0.4% month on month rate.Personal spending – a key component of overall US economic activity – rose 5.6% in June following an 8.5% rise in May, though many economists noted that the phase-out of stimulus to consumers would eventually cause some pay-back in spending. Consensus economists expect personal spending rose a more modest 1.5% in July.“Consumer spending saw another significant increase in July as the labor market improved for a third consecutive month and federal stimulus measures continued to support household income. Retail sales have surpassed its pre-Covid-19 peak; however, spending on services is likely to remain depressed as state reopening plans are put on hold and consumers continue to practice voluntary distancing,” James Sweeney Credit Suisse economist, said in a note.“The recent resurgence in the Covid-19 contagion and the breakdown in negotiations for further fiscal support are risks to spending going forward,” he added. “High-frequency indicators of consumer activity are showing tentative signs of a renewed downturn (albeit less severe than the March/April collapse),” he added.Federal Reserve Chairman Jerome Powell, wearing a face mask, testifies before the House of Representatives Financial Services Committee during a hearing on oversight of the Treasury Department and Federal Reserve response to the outbreak of the coronavirus disease (COVID-19), on Capitol Hill in Washington, U.S., June 30, 2020. Tasos Katopodis/Pool via REUTERSVirtual Jackson Hole SymposiumOn Thursday and Friday, central bank officials and economists will convene virtually for the Federal Reserve Bank of Kansas City’s 44th annual Economic Policy Symposium, for an event themed “Navigating the Decade Ahead: Implications for Monetary Policy.” The event will be live-streamed for public viewing.This year marks the first in almost four decades that the event will not take place in-person at Jackson Hole, Wyoming.Fed Chair Jerome Powell is set to speak about the central bank’s Monetary Policy Framework Review on Thursday, touching on the Fed’s dual mandate to maximize employment and provide price stability amid the economic impact of the pandemic. The Fed’s Monetary Policy Framework Review will reflect an about year’s worth of discussions, which included Fed Listens events and other work.“We suspect discussions are likely to center on the challenges of interest rates at the zero-lower bound and persistently low inflation,” Sam Bullard, senior economist for Wells Fargo Corporate & Investment Banking, said in a note. “This would dovetail nicely into the Fed’s ongoing monetary policy strategic framework review, which is apparently close to being finalized.”“We expect the Fed to shift to an average inflation target framework, with the announcement to come as early as the September 15-16 FOMC meeting,” he added. “If realized, this revised framework would open the door for the FOMC to tolerate moderate overshoots of it 2% target to compensate for periods of below-target inflation. Moreover, such changes would reinforce expectations of a ‘lower for longer’ policy for the federal funds target rate to support a more robust recovery once the coronavirus is brought under better control.”Earnings calendarMonday: Palo Alto Networks (PANW) after market closeTuesday: Best Buy (BBY), Autodesk (ADSK), JM Smucker (SJM), Hormel (HRL) before market open; Salesforce (CRM), Intuit (INTU), Nordstrom (JWN), Hewlett Packard Enterprise (HPE) after market closeWednesday: Dick’s Sporting Goods (DKS) before market open; Splunk (SPLK), NetApp (NTAP), William-Sonoma (WSM) after market closeThursday: Tiffany (TIF), Dollar General (DG), Coty (COTY), HP Inc (HPQ), Dollar Tree (DLTR), Burlington Stores (BURL) before market open; Gap (GPS), Okta (OKTA), Workday (WDAY), VMWare (VMW), Ulta (ULTA), Dell (DELL), after market closeFriday: Big Lots (BIG) before market openEconomic calendarMonday: Chicago Fed National Activity Index, July (3.7 expected, 4.11 in June)Tuesday: FHFA House Price Index MoM, June (0.3% expected, -0.3% in May); S&P CoreLogic Case-Shiller Home Price Index 20-City MoM, June (0.1% expected, 0.04% in May); S&P CoreLogic Case-Shiller Home Price Index 20-City YoY, June (3.6% expected, 3.69% in May); Conference Board Consumer Confidence, August (93.0 expected, 92.6 in July); New home sales, July (785,000 expected, 776,000 in June); Richmond Fed Manufacturing Index, August (10 expected, 10 in July)Wednesday: MBA Mortgage Applications, week ended Aug. 21 (-3.3% during prior week); Durable goods orders, July preliminary (4.5% expected, 7.6% in June); Durable goods orders excluding transportation, July preliminary (1.8% expected, 3.6% in June); Non-defense capital goods orders excluding aircraft, July preliminary (1.7% expected, 3.4% in June); Non-defense capital goods shipments excluding aircraft, July preliminary (1.5% expected, 3.3% in June)Thursday: Q2 GDP Annualized QoQ, second revision (-32.5% expected, -32.9% in previous print); Q2 Personal consumption, second revision (-34.6% expected, -34.6% in previous print); Q2 Core PCE QoQ, second revision (-1.1% expected, -1.1% in previous print); Initial jobless claims, week ended Aug. 22 (1.000 million expected; 1.106 million during previous week); Continuing jobless claims, week ended Aug. 15 (14.4 million expected, 14.844 million during previous week); Pending home sales MoM, July (2.0% expected. 16.6% in June); Kansas City Fed Manufacturing Activity Index, August (5 expected, 3 in July)Friday: Personal Income, July (-0.4% expected, -1.1% in June); Advance Goods Trade Balance, July (-$72.3 billion expected, -$70.6 billion in June); Wholesale inventories MoM, July (1.5% expected, 5.6% in June); Personal spending, July (1.5% expected, 5.6% in June); PCE Deflator MoM, July (0.4% expected, 0.4% in June); PCE Deflator YoY, July (1.0% expected, 0.8% in June); PCE Core Deflator MoM, July (0.5% expected, 0.2% in June); PCE Core Deflator YoY, July (1.2% expected, 0.9% in June); MNI Chicago PMI, August (52.5 expected, 51.9 in July); University of Michigan Consumer Sentiment, August final (72.8 expected, 72.8 in previous print)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}