{"article": [{"url": "https://finance.yahoo.com/news/google-oracle-copyright-case-ginsburg-death-175935566.html", "published": 1600693640.0, "headline": "Google-Oracle $9 billion feud faces new uncertainty after Ginsburg's death", "body": "Justice Ruth Bader Ginsburg’s death on Friday has injected new uncertainty into the high court’s term, which kicks off next month with a decade-long copyright feud between Google (GOOG, GOOGL) and Oracle (ORCL) over software used in billions of Android smartphones.Oracle claims Google owes it $9 billion for copyright infringement, but Ginsburg’s death last week at the age of 87 could leave Oracle with one less vote in its favor in a case that has drawn widespread attention because of its implications for innovation in the entire software industry.The high court will determine whether Oracle can copyright application programming interfaces (APIs), lines of computer code that, as Google explains, allow software applications, platforms, and devices to talk one another. Google contends that a victory for Oracle would stifle the ability of developers to create new and innovative applications, like those that measure your heart rate.“Ginsburg in particular has been the strongest voice on the court in favor of intellectual property owners,” Tyler Ochoa, a professor of law at Santa Clara University School of Law and an expert on copyright law, told Yahoo Finance. “It would have been very easy to predict that she likely would have voted in favor of Oracle, and without her on the court, that’s one less vote in favor of Oracle, and it makes it somewhat more likely that Google will prevail.”U.S. Supreme Court Associate Justice Ruth Bader Ginsburg is seen during a group portrait session for the new full court at the Supreme Court in Washington, U.S., November 30, 2018. REUTERS/Jim YoungOn Oct. 7, the first week of its fall term, the high court will hear Google v. Oracle, which Google has referred to as the “copyright lawsuit of the decade.” The dispute centers on the Java platform, which Oracle acquired when it bought Sun Microsystems in 2010.In the long-running lawsuit, Oracle claims Google violated copyright law by using the Java language’s APIs to build Android, the world’s most popular operating system for mobile phones. But Google countered, in a brief asking the high court to overturn an appeals court’s decision in favor of Oracle, that its use of the APIs in Android constituted “fair use” that was not subject to copyright protection.Story continues‘Profound consequences for innovation’The case has drawn an unusual amount of attention, attracting dozens of amicus briefs from professors, trade groups, advocacy groups, and fellow tech giant Microsoft (MSFT) — which came out in support of Google and noted that the issue presented by the case has “profound consequences for innovation in today’s computer industry.” The appeals court ruling in Oracle’s favor, Microsoft said, “threatens modern paradigms of software development.”Oracle CEO Safra Catz delivers a keynote address during the 2019 Oracle OpenWorld on September 17, 2019 in San Francisco, California. (Photo by Justin Sullivan/Getty Images)Another amicus brief was filed by the Trump administration, which argued that the Supreme Court should side with Oracle. “The Copyright Act makes it clear that computer code may be copyrighted,” the government’s brief stated. (More recently, the government expressed its support for Oracle in a separate matter — its partnership with the Chinese social media sensation TikTok.)While it’s rare that Ginsburg would come down on the same side as the Trump administration, intellectual property lawsuits tend to be less politicized than other cases like, for example, those related to abortion or the Affordable Care Act. Ginsburg was known for having a “deep understanding” of copyright law and respect for holders of copyrights, according to Barbara Lauriat, a senior lecturer on intellectual property law at King’s College of London.With Ginsburg gone, Google v. Oracle could end with a 4-4 tie. In that case, the lower court’s ruling for Oracle would stand but would not have precedential effect — in other words, it would not be the law of the land. This was the case back in 1996, in another dispute that involved the extent of software copyright. In that case, Lotus v. Borland, Justice John Paul Stevens recused himself and the case was tied, meaning it set no national precedent.That could very well end up happening with the Google-Oracle case, Lauriat noted, adding, “We could have history repeating itself.”Erin Fuchs is deputy managing editor at Yahoo Finance.See also:Microsoft lost its best chance to be the ‘cool’ tech companyOracle’s Tik-Tok won gives it a chance to prove it can take on Microsoft and AmazonYour internet bill might be too high — here’s how to save moneyFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}