{"article": [{"url": "https://finance.yahoo.com/news/heres-why-teslas-stock-tumbled-after-battery-day-and-why-analysts-are-still-bullish-143523241.html", "published": 1600940960.0, "headline": "Here's why Tesla's stock tumbled after Battery Day, and why analysts are still bullish", "body": "Tesla (TSLA)’s much anticipated Battery Day certainly hasn’t done much to charge up its stock.A day after the event, the electric vehicle maker’s shares tumbled over 5%, and fell again in Thursday’s early trading amid a broad sell-off in high-flying technology companies. Its stock drifted above $370 in midmorning dealings.However, at least a few analysts are reiterating the stock is still a buy, and see more upside to at least $500.“I came away impressed with the new battery cell that they unveiled, which essentially has six times the power of the current cell, and also their plan to reduce battery costs on a dollar per kilowatt hour basis by about 56%,” Garrett Nelson, CFRA senior equity analyst, told Yahoo Finance’s “The First Trade” on Wednesday.Nelson noted massive hype leading up to Battery Day may have left investors wanting more of an immediate catalyst. Tesla founder and CEO Elon Musk “didn't specifically use the term million mile battery as many analysts were expecting,” said Nelson.In fact, Musk’s announcement promising to bring to market a $25,000 fully electric and autonomous vehicle in three years may have actually turned off some investors.“We don't necessarily think investors want them to lower [the] price,” said Nelson.“Instead we think a lot of investors are hoping that their electric and autonomous technology innovations really make Tesla vehicles kind of a must have product that consumers really have to have — and that drives pricing power in the marketplace,” he added.Duesseldorf, Germany- December 10. 2019: A red Tesla Model S is parked in a business destrict of Duesseldorf and is connected with a blue power chord to a recharging station, a modern office buidling in the background.In the wake of Battery Day, Deutsche Bank also upped its Tesla price target to $500, moving from “Hold” to “Buy.” The bank’s analysts said that “while investor expectations into the event were high, Tesla’s plan to achieve 56% reduction in battery cost over the next 3 years came in considerably better than anticipated, and could materially boost its volume and margin outlook.”Bank of America called the event “constructive,” but maintained a “Neutral” rating with a price target of $550. “News flow from the event was positive as expected, but we believe is unlikely to drive a material short-term move in the stock, given already significant hype behind the company,” BofA wrote on Wednesday.Story continuesNelson predicted that Tesla’s Battery Day announcements will prove to be a longer term positive for the company. He argued the vehicles are the best in the market in terms of price versus range (which is crucial for EV buyers.)“Tesla just has a superior product. And coming out with this new, much improved, cheaper battery will help widen their competitive advantage versus peers,” said NelsonUpcoming competition from traditional auto manufacturers like Ford (F) and GM (GM) will struggle to keep up, says Nelson.“Everyone else is just trying to play catch up with Tesla,” said Nelson.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreNikola calls short-seller report a 'hit job,' shares still fallWhy Tesla shares are tanking todayTesla analyst is bullish on what the company is doing with its high-priced stock, raises price target to $550Apple analyst says record-breaking share price rally is about 'MOMO' not 'FOMO'Tesla shares surge 12% on day of stock split"}]}