{"article": [{"url": "https://finance.yahoo.com/news/georgia-school-reopenings-paint-a-bleak-picture-for-the-school-year-153337845.html", "published": 1596883280.0, "headline": "'Impossible to stay quiet': Doctor sounds alarm on messy school reopenings amid the coronavirus pandemic", "body": "The way that schools across America are handling the start of classes amid the ongoing coronavirus pandemic is being watched closely by public health experts, teachers, government officials, and parents.Some doctors don’t like what they’re seeing.“Historically, my response up to this last couple of weeks has been typically much more neutral and just trying to implore people to do the right thing, to lay the information out in front,” Dr. Michael Saag, director of UAB Medicine's Division of Infectious Disease, told Yahoo Finance. “But watching these horrific explosions of cases, be it in the summer camp… now we're seeing schools that seem to shrug their shoulders. ... It's impossible to stay quiet.”The most glaring recent examples were in Georgia, where at least 260 employees in the state’s largest school district were exposed to coronavirus and photos from two high schools showing lax social distancing amid statewide cases and deaths being near record highs.“While we're seeing an exploding epidemic, especially in the Southeast — and that includes Georgia — this whole response in this county is irresponsible,” said Saag, referring to a viral photo of a crowded hallway at North Paulding High School in Dallas, Ga. “There's no plan, there's just seems to be an open hall with students crowding one on top of the other... I can't think of a better haven for the coronavirus. That situation — it’s like a Petri dish.”Wearing masks to prevent the spread of COVID19, elementary school students wait for classes to begin in Godley, Texas, Wednesday, Aug. 5, 2020. (AP Photo/LM Otero)‘COVID-19 will not be something we can stop. And we all know that.’Children under 10 years old (who do not have underlying medical conditions) seem to be at lower risk for contracting coronavirus, the disease caused by coroanvirus, and generally show lighter symptoms if infected.But children over 10 years old seem to transmit the coronavirus much like adults, raising the risk for school staff.Angela Skillings, a second grade teacher in Arizona, contracted coronavirus despite wearing gloves, masks, and using hand sanitizer. In late June, a colleague of hers passed away after battling with the virus.Story continues“We are in very rural small town in Eastern Arizona,” Skillings told the Select Subcommittee on the Coronavirus Crisis. “We only have around 300 students … Last week, we had four more support staff members contract the virus… that is a little over 11%.”Bringing students back will make things worse, Skillings argued, citing what she has seen during seven years of teaching young children.“I've seen them pass everything around from pink eye to stomach flu to even influenza,” she said. “COVID-19 will not be something we can stop. And we all know that.”Cases are popping up all across the country. (Graphic: David Foster/Yahoo Finance)Outbreaks arose across the country as K-12 schools began fall classes.In North Carolina, an asymptomatic fourth grader tested positive for coronavirus after interacting with an infected family member. Teachers and students at the school were subsequently told to quarantine for two weeks.In Mississippi, six students and one staff member in one school district have tested positive for coronavirus, resulting in 116 students being told to quarantine.In Indiana, two high schools shut down after outbreaks while others will continue in-person classes despite some students and teachers testing positive.Most schools in bigger cities were not taking chances: As of August 6, according to Education Week’s tracker, 17 of the 20 largest K-12 school districts had chosen remote learning to start the school year.Universities, some of which will attempt to reopen campuses, are trying to implement strict rules to mitigate transmission: The University of Texas at Austin banned parties and Tulane University in New Orleans has threatened suspension or expulsion for students who attend or throw parties with more than 15 people.A sign reminding people to wear face masks is seen in front of a library on Georgetown University's main campus in Washington, D.C., the United States, July 7, 2020. (Photo by Liu Jie/Xinhua via Getty) (Xinhua/Liu Jie via Getty Images)‘We need to learn to co-exist with it for the time being’The Centers for Disease Control and Prevention (CDC) has released a checklist for K-12 school administrators preparing to reopen in fall 2020 that included recommendations such as frequently cleaning and disinfecting frequently touched surfaces, implementing social distancing, and face coverings.“This epidemic is likely to persist until sufficient numbers of individuals become immune – through infection or a vaccine,” Dr. Roger Klein, former adviser to the FDA and the CDC, told Yahoo Finance. “And because for most people SARS-CoV-2 infection is not serious, we need to learn to co-exist with it for the time being.”That reality “does not mean ignoring the epidemic and ‘going back to normal,’” Klein added, “but rather moving forward, doing the best we can, and learning as we go.”Dr. Saag, who himself recovered from COVID-19 after being infected in March, said the first step to safely reopening schools was wearing a mask — a choice as simple as choosing to wear a seatbelt to prevent being harmed in a car accident.“This is no different,” he stressed, “and in some ways it may be even worse because in each of those situations … this is an entire school community.”Teachers participate in a school Zoom meeting, to social distance, at Freedom Preparatory Academy as they begin to prepare to restart school after it was closed in March due to COVID-19 on August 5, 2020 in Provo, Utah. (Photo by George Frey/Getty Images)And when a student contracts coronavirus, Dr. Saag advised, the school “needs to shut down, regroup and start again” until “the numbers are lower and when they have a plan that really will protect people.”Robert W. Runcie, the superintendent for the Broward County Public Schools, echoed that sentiment when he told the Select Subcommittee on the Coronavirus Crisis hearing that even one confirmed case in a school “is going to create a climate of fear that it’s gonna be difficult to have a reasonable learning environment.”Arne Duncan, the U.S. Secretary of Education from 2009 through December 2015, did not hold back when assigning blame for the situation that America’s schools face.“The bottom line is this: If we really want, we want our kids to go back to school safely, the single most important thing we can do has nothing to do with education,” Duncan told the Select Subcommittee on the Coronavirus Crisis. “What infuriates me about what is happening today is that it's an unforced error. We're in this situation because our federal leadership failed us, period.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:'Just trying to get through the year': K-12 students discuss returning to school amid the coronavirus pandemic'The urgency is real': CDC and Education Department join White House push to open schools amid coronavirus pandemicCoronavirus: 'We cannot' put kids in schools 'if we have a very high level of transmission,' doctor warnsThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}