{"article": [{"url": "https://finance.yahoo.com/news/amazon-slammed-in-report-for-coronavirus-response-190037724.html", "published": 1600783700.0, "headline": "Amazon slammed in report for adding ‘largely low-quality' jobs amid coronavirus", "body": "Amazon (AMZN) CEO Jeff Bezos was among 181 chief executives at major corporations who signed a pledge in August 2019 to incorporate social welfare into business decisions, marking a new era of “stakeholder” capitalism.Months later, the e-commerce giant’s role in the U.S. economy expanded after the coronavirus pandemic forced hundreds of millions of Americans into their homes, spiking demand for online shopping and prompting a hiring blitz of 175,000 warehouse workers as other sectors endured layoffs.But a report released on Tuesday slams Amazon for falling short of its commitment to value social welfare as the nation grappled with the pandemic, citing the company’s addition of “largely low-quality” jobs and its alleged endangerment of warehouse workers put at risk of contracting the virus. The report also cited claims that Amazon retaliated against employees who spoke out about the working conditions in a series of walkouts.Amazon CEO Jeff Bezos is seen on a screen as he testifies before the House Judiciary Subcommittee on Antitrust, Commercial and Administrative Law on \"Online Platforms and Market Power\" in the Rayburn House Office Building on Capitol Hill in Washington, DC on July 29, 2020. Mandel Ngan/Pool via REUTERS(Amazon fired several workers who publicly criticized its treatment of warehouse workers, but has denied that it did so out of retaliation.)Amazon appears in the report alongside companies like Tyson Foods, Inc. (TSN) and Wells Fargo (WFC) that scored in the bottom 25% among over 600 large firms on each of two assessments that examined a company’s COVID-19 response and its inequality issues.The study based its findings on data collected by a product called Truvalue Platform, which uses artificial intelligence to analyze information drawn from industry, non-governmental organizations, news reports, and other sources.In a statement to Yahoo Finance, an Amazon spokesperson criticized the study, saying it uses the “meaningless measure of ‘sentiment about company actions’ and fails to evaluate the actual response — which in the case of Amazon was proactive, swift and effective.”“Any objective survey of how companies responded to COVID-19 would find that Amazon quickly made changes to our operations and invested heavily in safety measures to keep employees safe,” the spokesperson adds.Story continuesThe report received funding from the Ford Foundation and was carried out by consulting firm KKS Advisors as well as Test of Corporate Purpose, an initiative formed this year to evaluate companies in their response to the pandemic and recent social unrest.According to the report, many of the jobs added by Amazon in the aftermath of the outbreak were inadequate due in part to their use of “zero-hour contracts” or contracts that do not guarantee a minimum number of weekly hours.“The company created numerous jobs, for which it might ostensibly receive credit under a first-pass analysis,” the report says. “However, these jobs were largely low-quality, many used zero-hour contracts, and they are unlikely in the medium and long term to align with a stakeholder primacy agenda.”Beginning in March, Amazon workers nationwide held a series of walkouts amid a rising number of cases at the company’s warehouses, citing inadequate safety measures and insufficient paid sick leave, among other issues. By May, about 900 of the company’s 400,000 warehouse workers had been infected and eight had died, according to reports from The New York Times and NBC News.People wait in a line of about one hundred applicants waiting to enter a job fair Wednesday, Aug. 2, 2017, at an Amazon fulfillment center, in Kent, Wash. Amazon plans to make thousands of job offers on the spot at nearly a dozen U.S. warehouses during the recruiting event. (AP Photo/Elaine Thompson)In response to the pandemic, the company made efforts to take the temperature of workers before they entered U.S. facilities, provide all workers with protective masks, and give partial pay to workers who were sent home with a fever.The company fired “at least six workers” involved in the protests, the report released on Tuesday says, highlighting former Amazon president and engineer Tim Bray, who resigned in May over the company’s termination of workers who had spoken out.Bray told Yahoo Finance that the company’s emphasis on “customer obsession” sidelines the treatment of its warehouse workers.“The core tenets of broad prices and fast delivery — that’s what people want,” Bray told Yahoo Finance on Sept. 10, prior to the release of the report. “How can you be against that? Well there’s no free lunch. If you’re doing those things, somebody has got to be paying.”“Blue-collar warehouse workers come behind,” he adds. “Their experience doesn’t come into the arithmetic.”Overall, the report finds that companies whose CEOs signed the high-minded pledge from the Business Roundtable last year performed slightly better than companies that did not back the commitment in the area of COVID-19 response and slightly worse in the area of inequality issues. The study’s assessment drew on data gathered from February to July.Bray praised the efficient management he witnessed as a white-collar engineer at Amazon but said it occasionally came alongside harmful company practices.“A company can be very well-managed and still have ethical problems,” he says. “I don’t think that’s surprising even, really.”Tech newsletterRead more:'We're risking our lives': Why Amazon warehouse workers are walking out over coronavirus fearsTop unions call for closure of all Amazon warehouses — experts say it would be disastrousWorkers condemn coronavirus relief bill's loophole for big companiesRead the latest financial and business news from Yahoo Finance"}]}