{"article": [{"url": "https://finance.yahoo.com/news/house-panel-calls-postal-chief-194930382.html", "published": 1596466640.0, "headline": "House panel calls new postal chief to explain mail delays", "body": "WASHINGTON (AP) — The House Oversight Committee has invited the new postmaster general to appear at a September hearing to examine operational changes at the U.S. Postal Service that are causing delays in mail deliveries across the country.The plan imposed by Louis DeJoy, a Republican fundraiser who took over the top job at the Postal Service in June, eliminates overtime for hundreds of thousands of postal workers and orders that mail be kept until the next day if postal distribution centers are running late.Rep. Carolyn Maloney, a New York Democrat who chairs the Oversight panel, said the Sept. 17 hearing will focus on “the need for on-time mail delivery during the ongoing pandemic and upcoming election,” which is expected to include a major expansion of mail-in ballots.President Donald Trump has warned that allowing more people to vote by mail will result in a “CORRUPT ELECTION” that will “LEAD TO THE END OF OUR GREAT REPUBLICAN PARTY,” even though there’s no evidence that will happen. Trump, Vice President Mike Pence and other top administration officials frequently vote absentee themselves.Last week, Trump even floated on Twitter the prospect of delaying the Nov. 3 election — an idea lawmakers from both parties quickly shot down.Trump said Monday that the cash-strapped Postal Service is ill-equipped to add the expected influx of mail-in ballots to its responsibility to deliver mail and packages from the boom in internet shopping.“I don't think the post office is prepared for a thing like this,” Trump said at the White House.Trump also has called the Postal Service “a joke” and said package shipping rates should be at least four times higher for heavy users like Amazon. But shipping and packages are actually a top revenue generator for the Postal Service, and critics say Trump is merely looking to punish Amazon founder and CEO Jeff Bezos in retaliation for unflattering coverage in The Washington Post, which Bezos owns.Story continuesThe Oversight committee intended to have the hearing with DeJoy this week, Maloney said, but was told DeJoy could not attend because of a meeting of the Postal Service's Board of Governors. DeJoy has confirmed his availability for the September session, she said.The hearing comes as the Postal Service is reeling from mail delays and financial problems, even as record numbers of mail ballots are expected in the presidential election because of the coronavirus pandemic.Postal Service officials, bracing for steep losses from the nationwide shutdown caused by the virus, have warned they will run out of money by the end of September without help from Congress. The service reported a $4.5 billion loss for the quarter ending in March, before the full effects of the shutdown sank in, and expects losses totaling more than $22 billion over the next 18 months.“The Postal Service is in a financially unsustainable position, stemming from substantial declines in mail volume and a broken business model,'' DeJoy said in a statement last week. \"We are currently unable to balance our costs with available funding sources to fulfill both our universal service mission and other legal obligations. Because of this, the Postal Service has experienced over a decade of financial losses, with no end in sight, and we face an impending liquidity crisis.''Bills approved by the Democratic-controlled House would set aside $25 billion to keep the mail flowing, but they remain stalled in the Republican-controlled Senate. Congress has approved a $10 billion line of credit for the Postal Service, but it remains unused amid restrictions imposed by the Trump administration.The Postal Service and Treasury Department announced an agreement in principle on loan terms last week, with a formal agreement expected in the next few weeks. Even with the loan, the Postal Service \"remains on an unsustainable path and we will continue to focus on improving operational efficiency,'' DeJoy said.Besides cutting overtime, the new plan halts late trips that are sometimes needed to ensure on-time delivery. If postal distribution centers are running late, “they will keep the mail for the next day,″ Postal Service leaders say in a document obtained by The Associated Press. “One aspect of these changes that may be difficult for employees is that — temporarily — we may see mail left behind or mail on the workroom floor or docks,″ another document says.Democratic lawmakers have demanded answers from DeJoy following complaints from constituents about mail service delays and other problems.“It is essential that the Postal Service not slow down mail or in any way compromise service for veterans, small businesses, rural communities, seniors and millions of Americans who rely on the mail – including significant numbers who will be relying on the Postal Service to exercise their right to vote,” a group of Democratic senators wrote in a letter to DeJoy last week.The senators, including Democratic Leader Chuck Schumer of New York and Michigan Sen. Gary Peters, the top Democrat on a panel that oversees the Postal Service, said any changes to Postal Service operations \"must be carefully considered to ensure they do not limit service for Americans who rely on the mail for essentials, especially during a pandemic.''In a separate letter, Sen. Joe Manchin, D-W.Va., asked DeJoy to clarify whether the Postal Service plans to close some post offices and reduce hours at others in his rural state. Signs at some locations announced proposed closures as soon as Aug. 22 or 24, Manchin said, calling any such action a violation of both federal law and Postal Service rules that require 120 days' notice before any closures.“In many areas where reliable broadband is not an option, the Postal Service is their only link to medicine, Social Security checks and family members,'' Manchin said. \"Under new social distancing mandates, the Postal Service has become even more essential in keeping rural communities connected and economically viable.''"}]}