{"article": [{"url": "https://finance.yahoo.com/news/congress-debates-leaning-on-fed-or-ppp-for-small-business-aid-185202457.html", "published": 1600783220.0, "headline": "Congress debates leaning on Fed or PPP for small business aid", "body": "As small and medium sized businesses struggle to keep their doors open, policymakers are pointing their fingers at one another trying to figure out where support should come from.In a House Financial Services Committee hearing on Tuesday, members of Congress pressed the Federal Reserve to expand the scope of its emergency lending program to Main Street.But Federal Reserve Chairman Jerome Powell countered that the central bank’s program is ill fitted for already debt-burdened businesses, suggesting that Congress prioritize more Paycheck Protection Program loans under the Small Business Administration.“Trying to underwrite the credit of hundreds of thousands of very small businesses would be very difficult,” Powell said of the Fed’s Main Street Lending Program in testimony. “I think PPP is a better way to approach that space in the market and I think you are well advised to do that.”Federal Reserve Chair Jerome Powell testifies during a House Financial Services Committee hearing on oversight of the Treasury Department's and Federal Reserve's coronavirus disease (COVID-19) pandemic response on Capitol Hill in Washington, U.S., September 22, 2020. REUTERS/Joshua Roberts/PoolThe Fed’s program has extended only $2 billion in loans, of the $600 billion that the central bank says it has the capacity for. Critics have argued that the $250,000 minimum loan amount, in addition to EBITDA-based eligibility tests, make the loans inaccessible for small businesses.Democrats and Republicans on the House Financial Services Committee pressed Powell and Treasury Secretary Steven Mnuchin on the idea of expanding the scope of its Main Street program. Mnuchin said he would support lowering the minimum loan size to $100,000, but Powell immediately added that smaller businesses broadly do not appear interested in the Fed program.But small businesses are still looking for help, creating pressure on the Fed and Congress to act quickly. Data from Yelp shows that about 60% of businesses marked as closed as the beginning of the crisis are now indicated as having closed permanently.Data from Yelp show that as of August 31, restaurants marked as closed at the beginning of the crisis are more likely to have closed permanently compared to other industries. Source: Yelp Economic AveragePaycheck Protection Program?In testimony Tuesday, Mnuchin appeared to favor alleviating the pressure on the Fed’s lending facilities.Through the Coronavirus Aid, Relief, and Economic Security (CARES) Act passed in March, the Treasury was allotted $454 billion to support Fed lending facilities. Less than half of those funds have been used so far, to stand up programs to backstop markets ranging from corporate credit to municipal bonds.Story continues“I unfortunately think there’s not more we can do,” Mnuchin said of the unused funds.Mnuchin added that he would support reallocating $200 billion of the money originally earmarked for other purposes, a change that would require Congressional action. In addition to a new round of stimulus checks, Mnuchin said President Donald Trump would “very much support” additional PPP money.But not all lawmakers were warm to the idea of replenishing the PPP. Kentucky Republican Andy Barr argued that the PPP did not help small businesses looking for smaller loans “because their payroll is fairly limited and they have larger amounts of debt.”PPP loans were forgivable, but only if workers were retained and at least 60% of the loan was used for payroll. The Main Street loans from the Fed are not forgivable due to the central bank’s limitation on offering only loans, not grants.Powell and his colleagues at the Fed have highlighted on several occasions that the Fed’s limitations increase the onus on Congress to take action.But Congress does not appear close to a deal on a new fiscal package. A Democratic-led House and Republican-led Senate were not able to stop the expiration of extra unemployment insurance benefits, with no clear timeline on a compromise ahead of the November election.The top Republican on the House Financial Services Committee, North Carolina’s Patrick McHenry, applauded the Fed for its actions in a time when Congress “can’t get its act together.”“I would give the Federal Reserve an A+ for its initial response and to where we are,” said McHenry.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Powell pushes on 'very strong, very powerful' guidance on interest ratesFed signals interest rates to stay near-zero through 2023Trump nominee Judy Shelton lacks votes for spot at the Fed, Sen. Thune saysFOMC Preview: Lack of fiscal stimulus casts shadow over FedA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}