{"article": [{"url": "https://finance.yahoo.com/news/how-hollywood-content-can-normalize-injustice-202953679.html", "published": 1596814640.0, "headline": "How Hollywood content can ‘normalize injustice’", "body": "Elected officials are at fault when their policies promulgate injustice. But when it comes to the unwritten rules of culture that harm Black Americans, many times it’s Hollywood playing an outsize role as the reinforcer, says civil rights leader Rashad Robinson.“What we have is a cottage industry of television shows that consistently put out images around and stories and narratives about the justice system that lead us to all sorts of ideas about policing and justice that are deeply dangerous,” Robinson told Yahoo Finance.Over the past 25 years, violent crime and property crime has dropped significantly – by 51% and 54%, respectively, between 2018 and 1993. Yet at least 6 in 10 Americans stated, in opinion surveys conducted during that same time period, that crime had gotten worse. Robinson attributes the gap between perception and data to the popularity and influence of the crime TV genre which is watched by tens of millions of Americans annually.“We have this gap between perception and reality that according to a lot of research shows us, is really driven by the content people see on TV through television shows like “Law & Order” and “CSI” and other shows like that,” said Robinson, president of Color of Change, a racial justice organization which published a report in January called “Normalizing Injustice: The Dangerous Misrepresentations that Define Television’s Scripted Crime Genre.”Demonstrators gathered at Floyd Light City Park on Thursday, Aug. 6, 2020 in Portland, Ore. State legislatures across the U.S. are pushing an array of policing reforms after the demonstrations related to the death of George Floyd last spring, from banning chokeholds to making it easier to hold officers legally accountable for their actions. (Mark Graves/The Oregonian via AP)In the wake of the killing of George Floyd in May, many Hollywood movie studios, production companies, talent agencies and stars publicly stated that Black Lives Matter. Color of Change is working to make sure that Hollywood’s words matter and impact the media that the industry produces.The organization’s work has led to the cancellation of several shows recently including A&E’s “Live PD” and “Cops” on ViacomCBS’ Paramount Network where it had been airing since episodes were pulled from Fox in 2013.While getting shows riddled with harmful stereotypes cancelled is one aspect of Color of Change’s work, improving media representation of Black people in media is another.Story continues“After George Floyd’s murder, we’ve actually been able to build more power to go inside of writers’ rooms, to go inside of studios, to work with them on actually making sure their content doesn’t normalize injustice,” said Robinson.According to Color of Change’s analysis of crime television show data from the 2017-2018 season, 20 out of 26 show series employed zero or just one Black writer, and 81% of the showrunners were white men.Robinson highlighted the award-winning work the organization did for Netflix’s 2018 “Seven Seconds” crime series.Lorraine Ali, Veena Sud, Regina King, Russell Hornsby, and Kristi Henderson speak onstage at the \"Seven Seconds\" panel at Netflix FYSEE on May 22, 2018 in Los Angeles, California. (Photo by Neilson Barnard/Getty Images for Netflix)“We were inside the writers’ room from sort of day one. Veena Sud, the creator, brought us in, and we worked with her and the folks on bringing in real people who had faced these issues. We brought in Marilyn Mosby, the [state] attorney from Baltimore who had prosecuted the police to talk with the writers about what does it mean for a Black woman [district attorney] to prosecute police. What might some of the pushback look like,” said Robinson.The organization introduced the show’s staff to parents who had lost their children to police violence and even showed them real tapes of bail hearings in order to help them construct characters based on real stories. The successful collaboration catapulted actress Regina King to an Emmy for her performance as lead actress.Color of Change has laid out a roadmap for its Change Hollywood initiative with recommendations ranging from not relying on police to promote content that “normalizes injustice” to encouraging talent and executives to add “inclusion riders” to agency contracts in order to set diversity benchmarks for cast and crew members.“[Crime genre TV shows] have to be part of telling nuanced, diverse storytelling that can be entertaining and rich and doesn’t exploit and target and further put our communities in harm’s way,” said Robinson.More from Sibile:Michigan Gov. Whitmer, potential VP pick, has ‘good relationship’ with Biden, says Lt. Gov.Biden’s plan to fight criminal justice injusticeMedia mogul Byron Allen: ‘I think President Trump is totally wrong’Ben Carson on second coronavirus economic shutdown: ‘You do that again, and you completely destroy the financial infrastructure’Ben Carson: All Obama HUD rule does is provide ‘permanent employment for lawyers’Find live stock market quotes and the latest business and finance news"}]}