{"article": [{"url": "https://finance.yahoo.com/news/tens-of-thousands-to-lose-jobs-without-airline-stimulus-from-congress-105748761.html", "published": 1600754720.0, "headline": "Tens of thousands to lose jobs without airline stimulus from Congress", "body": "More than 35,000 airline industry employees will be laid off from their jobs next week unless Congress is able to pass an extension of the Payroll Support Program (PSP) in the Coronavirus Aid, Relief, and Economic Security (CARES) Act.“I want people to know about the amount of human suffering and economic pain that is going to be inflicted if a deal isn’t cut by October 1,” Airlines For America (A4A) President and CEO Nick Calio told Yahoo Finance. “It’s very real and it can be stopped. It can be prevented.”The original CARES Act Payroll Support Program (PSP) provided $25 billion in grants to U.S. airlines in exchange for guarantees they would not lay off employees. Those deals expire September 30.American Airlines (AAL) plans to lay off roughly 20,000 employees while United Airlines (UAL) is furloughing about 16,000. Southwest (LUV) and Delta (DAL) have stated they will be able to avoid layoffs through the end of the year but may have to furlough employees in 2021. CEOs from all four of the carriers have called on Congress for additional aid.President Trump supports an additional $25 billion for the airlines, and there is bipartisan support in Congress to include that airline aid, “PSP 2,” in a new CARES Act to stimulate the entire U.S. economy. Republicans have proposed a $500 billion package while Democrats originally pushed for a $3 trillion deal.Raymond James analysts in their most recent note dated September 20th told clients, “If a bill is passed that is closer to $2T, there is a high likelihood of ‘PSP 2’ being included while if it is closer to $1.5T, support for the airline industry is more likely to get squeezed out.”Calio is hopeful Republicans and Democrats will find a compromise that includes the airlines “We as an industry face a cliff that other industries don”t,” he said.‘The clock is ticking’Charlotte, NC, USA - May 28, 2016: American Airlines Airbus A319 (Registration No. N723UW) taking off at Charlotte Douglas International Airport.An American Airlines flight attendant who will be furloughed October 1, and requested anonymity, said, “I feel for the company, they've got it worse than we do.”Story continuesLike all the airlines, American has borrowed billions of dollars, grounded hundreds of planes and reduced capacity, planning to fly at roughly 25% of its 2019 volume as it heads toward the end of the year.American’s 8K filed last month said with layoffs, retirements and voluntary leaves of absence, “American’s team will have at least 40,000 fewer people working October 1 than we had when we entered this pandemic.”The American flight attendant said, “I think that the reason Congress isn't doing anything, it's purely a political one, not an economic one,” and called congressional inaction a “political mess.”American CEO Doug Parker joined other airline CEOs at the White House last week warning the Trump administration that airline industry job cuts threaten the country’s post pandemic economic recovery.Parker, along with leaders of the unions that represent American’s almost 140,000 employees, sent a letter to Congress and Trump administration officials saying, “We implore you to find a way to work together to reach agreement on a COVID-19 relief bill that includes a clean extension of the PSP.”A4A’s Calio points out the airline industry accounts for $1.7 trillion in U.S. GDP and supports 10 million jobs. “I'm not sure that the policymakers involved actually realize that the consequences are going to be far worse than they are,” without support. Calio said, “For months, everybody's been looking at this deadline or this cliff. And now the clock is ticking.”Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.International travel could take until 2024 to recover from COVID-19Airline stocks keep rising despite 'highly depressed' ticket sales amid pandemicSouthwest CEO: Bookings 'have recently stalled' because of coronavirus spike'The corporate tax rate — I’m actually OK at 28%': Gary CohnJ&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}