{"article": [{"url": "https://finance.yahoo.com/news/the-one-thing-that-matters-to-stocks-more-than-politics-204134805.html", "published": 1600789760.0, "headline": "The one thing that matters to stocks more than politics", "body": "The presidential election is mere weeks away on Nov. 3 and the Supreme Court is also now under a microscope after the death of Justice Ruth Bader Ginsburg upset the court’s delicate political balance.All of this has been featured in copious pundit commentary and research notes — especially as the market turmoil that surrounded 2016 proved to be a huge boon for some savvy investors like Carl Icahn, who left a Trump election night celebration to buy stocks and make $1 billion.But in a fresh note from Capital Economics, economist Oliver Allen points out the obvious point many forget during election season: the economy is \"probably more important than politics.\"Politics, Allen writes, is still moving the market. The death of Ginsburg was the “final nail in the coffin” for more fiscal stimulus that millions of Americans need to stay afloat. It also has bearing on what may happen on Election Day, as the Supreme Court may eclipse the pandemic and the economy as key voting issues.Despite the impact that politics has on the stock market, Allen warns investors not to get ahead of themselves. It’s the economy that matters most, and most importantly, how the long-term coronavirus vaccines and eventual recovery unfold.Though Allen says to look at the economy more than the election, Capital Economics doesn't offer more than a vague “the S&P 500 will climb further over the next few years, as major economies eventually get their coronavirus outbreaks under control, and central banks keep monetary policy exceptionally loose,” which seems wise, given how silly 2019 predictions look now.A television broadcast showing U.S. President Donald Trump is pictured during a trading session at Frankfurt's stock exchange in Frankfurt, Germany, March 12, 2020. REUTERS/Ralph OrlowskiMany people remember how the disrupted Bush-Gore election in 2000 hurt equity markets, causing them to drop around 8%, but the turbulence cleared up relatively quickly, resulting in no long-term damage.“Provided any dispute over this year’s election is also eventually resolved, we find it hard to see [the election] having a lasting impact on US equities, even if it could cause a spike in volatility following Election Day,” Allen writes.Story continuesThe fact that politics is secondary to the economy when it comes to stock prices isn’t a controversial take. Plenty of analysts point to uncertainty as being the chief problem. But the political implications for the stock market are frequently discussed by market strategists.Many financial pundits have said Trump is better for the stock market and economy, citing deregulation and market performance after his election amid dire predictions from some. And Allen notes that “a second term for President Trump would probably be a better outcome for US equities than a win for Joe Biden,” because of corporate taxes.At the same time, Trump’s late and weak coronavirus response led, in part, to 200,000 deaths, skyrocketing unemployment, dampened earnings, and a recovery that is still trying to get off the ground. And though some stock prices (mostly tech stocks) are doing well — driving the S&P 500 (^GSPC) back to pre-coronavirus levels after a huge plunge — many companies are still in tough situations.---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Intergenerational conflict is getting worse, Deutsche Bank warns2 tax safe harbors that new traders need to know aboutWhy the 2020 rally doesn’t feel like a bubble: hedge fund veteranNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}