{"article": [{"url": "https://finance.yahoo.com/news/women-far-less-bullish-about-their-investment-goals-than-men-survey-140743554.html", "published": 1593422120.0, "headline": "Women far less bullish about their investment goals than men: Survey", "body": "Women have had a tougher time financially during the pandemic than men have, and have exhibited a worse outlook about the market and their financial goals, according to a poll from Harris and Yahoo Finance.On many levels, the pandemic has hit certain demographics harder than others, disproportionately affecting Black communities and other communities of color. And while it has contributed to record unemployment levels, the stock market largely has been riding high after its March dip, buoyed by tech companies.Women appear to be another key aspect of an uneven demographic impact, according to the nationally representative weighted survey of 200 Americans with some financial assets or investments.Women surveyed were far less confident in hitting their investment goals, with just 4% \"very confident\" compared to 32% of men. The survey found 47% of women are at least \"fairly confident,\" compared to 60% of men. Women had less aggressive investing styles, with 67% having individual equity investments, compared to 92% of men. (Many studies have similarly found women to be more risk-averse when it comes to investing than men.)Women surveyed were far less confident in hitting their investment goals, with just 4% \"very confident\" compared to 32% of men, a survey by Yahoo Finance-Harris Poll found. (Getty Images)[Hardly any at-home workers have returned to their normal workplace: Yahoo Finance-Harris poll]One potential way to explain this is the breakdown of job losses amid the coronavirus crisis.In April, for instance, women accounted for 55% of the 20.5 million jobs lost.“We may all be in this together, but the recession isn’t hitting all of us equally. A greater percentage of women are losing their jobs through layoffs or furloughs than men,” said Will Johnson, the Harris Poll’s CEO. “One key reason is that women disproportionately work in sectors that were shut down by the pandemic, such as retail, hospitality and education.”There was also a noted breakdown in bullish sentiment. Twice the percentage of men feel bullish than women (41% to 21%), saying it's a good time to increase investment in the stock market. This may have rubbed off in other areas. Men say they are much more likely to make a large purchase in the next three months due to current interest rates, Harris noted.Story continues--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.41% of retail investors expect negative returns in the next 5 years: SurveyHere’s a running list of companies boycotting Facebook'Robinhood is not behind the rally,’ Barclays says as retail demand surgesWant a 'slice' of a stock? Demand booms for fractional shares as markets soarWhy pandemic insurance is impossible"}]}