{"article": [{"url": "https://finance.yahoo.com/news/apple-amazon-facebook-google-antitrust-hearing-172622255.html", "published": 1595939660.0, "headline": "Tech antitrust hearing targeting Amazon, Apple, Facebook and Google: Everything you need to know", "body": "The heads of four of the largest tech companies in the world are scheduled to sit before the House Judiciary Committee on Wednesday for what is expected to be the blockbuster event of the summer.Amazon (AMZN) CEO Jeff Bezos, Apple (AAPL) CEO Tim Cook, Facebook (FB) CEO Mark Zuckerberg, and Google-parent Alphabet (GOOG, GOOGL) CEO Sundar Pichai will be met with a barrage of questions from the 13 members of the Subcommittee on Antitrust, Commercial and Administrative Law ranging from their market power to the lengths they go to hold on to that power.It’s expected to be one of the most important antitrust hearings in decades and could have broad implications for the tech titans and their businesses. But the hearing is also just one piece of a multipart effort on behalf of states and the federal government to determine if Big Tech has finally gotten too big to benefit consumers and foster fair competition.This combination of 2019-2020 photos shows Amazon CEO Jeff Bezos, Apple CEO Tim Cook, Google CEO Sundar Pichai and Facebook CEO Mark Zuckerberg. On Wednesday, July 29, 2020, the four Big Tech leaders will answer for their companies’ practices before Congress at a hearing by the House Judiciary subcommittee on antitrust. (AP Photo/Pablo Martinez Monsivais, Evan Vucci, Jeff Chiu, Jens Meyer)Questions for the likes of Bezos, the world’s richest person, and Zuckerberg, head of the world’s largest social network, are expected to be especially pointed. Pichai should receive his fair share of needling from committee members, while Cook might be able to skate by relatively unscathed.While the hearing will feature the CEOs of some of the most recognizable companies on Earth, their reasons for being called to the committee are dramatically different. In fact, while it makes good headlines to have so much power (and money) in the same room, there isn’t much overlap between the allegations made against the firms.Here’s what each company is facing.Amazon’s domination of third-party sellersAmazon, which according to eMarketer makes up nearly 40% of total U.S. ecommerce sales, is facing investigations into whether it uses the troves of data it has on those third-party sellers’ products to craft and market competing items that it can sell at reduced prices. An investigation by The Wall Street Journal points to one particular instance in which Amazon used information about a car trunk organizer to create and sell trunk organizers of its own.Story continuesIt’s not out of the ordinary for a retailer to use information about the products it sells to then produce and offer competing items under its own brand name. But the breadth of data that Amazon has at its disposal with regard to third-party sellers and their products may provide the company with an unfair advantage.Amazon CEO Jeff Bezos speaks at the the Amazon re:MARS convention, Thursday, June 6, 2019, in Las Vegas. (AP Photo/John Locher)What’s more, third-party sellers purchase advertisements on Amazon.com to help market their own products, making it a major contender in the digital advertising space. Amazon, however, doesn’t have to pay to advertise its branded goods on its site.Amazon has been accused of similar practices when it comes to its Amazon Web Services cloud platform. The New York Times found that the company’s cloud computing service was being used to copy open-source software from smaller third-party firms and offering it as Amazon’s own, effectively cutting out the need to use the third-party firms’ software.With Bezos set to make his debut on Capitol Hill amidst such accusations, there are sure to be a number of testy exchanges between the CEO and committee members.Facebook’s insatiable appetiteFacebook is made up of four different entities: the main Facebook network, Messenger, Instagram, and WhatsApp. Together, those apps had a whopping 2.6 billion monthly active users as of the company’s Q1 2020 earnings report, making Facebook the largest social network in the world.And that gigantic audience means Facebook can easily muscle out smaller, up-and-coming competitors, which is exactly what the Department of Justice, state attorneys general, and the Subcommittee on Antitrust are investigating.Facebook CEO Mark Zuckerberg testifying before a House Financial Services Committee hearing on Capitol Hill in Washington in 2019. (AP Photo/Andrew Harnik, File)Facebook previously used a virtual private network app it offered called Onavo to mine data and determine how often its users were accessing competing apps. It was through the use of Onavo, according to Buzzfeed, that Facebook was able to see how much people were using WhatsApp, ultimately prompting the company to buy the messaging service.Facebook has also used its enormous size to try to crush rivals it couldn’t purchase like Snap’s Snapchat. When Snap CEO Evan Spiegel reportedly rebuffed Zuckerberg’s efforts to purchase the upstart photo-sharing platform for $3 billion 2013, Facebook began using Instagram as a means of destroying its nascent rival by copying its best known feature, the ability to share short-form ephemeral photos and videos.In July, the European Union’s antitrust watchdog, the European Commission fined Facebook roughly $129 million for providing misleading information about its takeover of WhatsApp.Using its market power, Facebook has acquired more than 80 companies since 2007. Its most recent high-profile purchase was its acquisition of giph-sharing platform Giphy in May.Google’s gargantuan sizeGoogle’s dominance of the search market is so complete its very name is now a verb for the practice of looking up information online. That should say more than enough about how thoroughly the company outstrips competitors like Bing and Yahoo, which its parent company, Verizon, with Yahoo Finance. According to Statcounter GlobalStats, Google controls 92% of the global search market.Its Chrome browser also controls 65% of the global browser market, while Android makes up 74% of the global mobile operating system market, far outpacing Apple’s iOS.Google CEO Sundar Pichai appears before the House Judiciary Committee to be questioned about the internet giant's privacy security and data collection, on Capitol Hill in Washington, Tuesday, Dec. 11, 2018. (AP Photo/J. Scott Applewhite)Google uses that massive reach to collect data that it then uses to sell advertisements. Google’s presence in the digital advertising market is so colossal that eMarkter estimates the company captured 37.2% of total online ad revenue in 2019, while Facebook accounted for 22.1%. No other companies come close.Part of Google’s power comes from the fact that it owns some of the most widely used digital advertising tools, including DoubleClick, which it acquired in 2007 and AdSense, which Google got with its acquisition of Applied Semantics in 2003.Senator Elizabeth Warren (D-MA) has been calling for Google to unwind its DoubleClick acquisition for sometime, and the company’s size in the digital ad space is now coming under question by the Senate Judiciary Committee’s antitrust panel, which announced that it will also look into Google’s business during a September hearing.Google is also facing scrutiny for how it uses its market power in search and whether it uses that size to stifle competition. For years, companies like Yelp and TripAdviser have been fighting against how Google displays search results for third-party sites versus ads and its own offerings, saying that the tech giant unfairly gives its own products prime search real estate.It’s for those reasons that the European Commission fined Google to the tune of roughly $10 billion for violations related to its advertising, search, and Android businesses.Apple’s App Store commissionsThat leaves Apple, which is facing antitrust investigations for one of its most important sources of revenue: the App Store. Apple’s problem stems from the fact that it charges a 30% commission on all App Store purchases and in-app purchases made using Apple’s payment system.For subscription services, Apple charges app developers 30% for the first year and 15% for each subsequent year. But competitors say that commission fee is anticompetitive, especially considering that Apple competes in several categories with app developers including music services like Spotify.Tim Cook, CEO of Apple, testifies during a Senate Homeland Security and Governmental Affairs Subcommittee on Investigations . (Photo By Tom Williams/CQ Roll Call)Spotify has been fighting with Apple for years about its commissions and it, along with the likes of Netflix, no longer allows users to sign up for the music streaming platform via the App Store to prevent Apple from taking a cut of its revenue.But Apple also forbids developers who don’t participate in its App Store payment service from telling users to sign up for accounts outside of their apps. Download the Spotify app on iOS, and you won’t see anywhere to sign up for the service. Amazon’s Kindle app, for instance, doesn’t allow you to purchase books to avoid the commission Amazon would pay on the sale of each book.In 2019, Spotify filed an antitrust complaint against Apple with the European Commission saying that the company is a platform provider and competitor and makes it difficult to integrate Spotify with certain Apple products.Apple’s 30% commission wouldn’t be such an issue if the company didn’t also offer competing products like Apple Music, Apple TV+, or the company’s own email service. That last category came into play recently when Apple had a dustup with the developer of a new email app called Hey.Apple initially approved the then consumer-focused app for download in the App Store, but when developer Basecamp tried to push an update, Apple rejected it saying that Basecamp needed to add a means for customers to subscribe to the $99-per-yer service using Apple’s in-app payment method.Apple eventually backed off when Basecamp added a 14-day trial option to Hey, but the fact that all of this happened against the backdrop of ongoing antitrust investigations was a strange move by the tech giant.Cook and company have pushed back against criticisms of its App Store commissions, going so far as to fund a study showing that the App Store requires the same commission fees as competing app stores.Yahoo Finance will be streaming and covering the hearings as they happen. So stay tuned.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Top back-to-school gear: Tech SupportTwitter hack could have been ‘much, much worse’ say cybersecurity expertsShould you delete TikTok?: Tech SupportLyft to provide 60,000 partitions to drivers to prevent spread of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}