{"article": [{"url": "https://finance.yahoo.com/news/a-mass-exodus-from-american-cities-not-quite-yahoo-finance-harris-poll-192733577.html", "published": 1597242920.0, "headline": "A mass exodus from American cities? Not quite: poll", "body": "In May, only 60% of city dwellers said they wanted to stay in their city. But predictions of a mass exodus from urban areas due to the coronavirus pandemic may have been overblown, according to a new Yahoo Finance-Harris poll.As lockdowns lifted, 74% of city dwellers said they are not likely to move out of the city due to the coronavirus pandemic, and only a fourth say they are somewhat or very likely to move, according to the survey of 1,020 Americans from July 31-August 3, 2020.“As the risk of catching COVID-19 subsides, city dwellers are reminded of why they love city living,” said Will Johnson, CEO of The Harris Poll, a New York-based market research company. Johnson attributed the improved sentiment to the reopening of city amenities like restaurants and nonessential retail.Data by The Harris Poll and Yahoo Finance. Graphic by David Foster//Yahoo Finance.Young people were the most eager to flee the city. Some 44% of Generation Z and Millennial respondents (ages 18-34) said they were considering leaving the city, and almost 30% of Generation X respondents (35-44) said they were likely to move. But for Americans ages 45 and up, only about 10% said they were considering moving.“Even prior to the pandemic, there was a movement from larger metros to smaller metros … as millennials age into their 30s and begin to form households. This trend has been accelerated by the pandemic as younger households look for more space and are increasingly able to work from home,” said Odeta Kushi, deputy chief economist for First American Financial Corporation, a California-based title insurance, settlement services and risk solutions company.Wealth was a significant factor determining likelihood to leave the city — in part because of the cost, and in part because workers with high salaries are more likely to have remote work options that would enable a move away from their workplace, according to economists.About 35% of respondents who made at least $100,000 a year said they wanted to move out of the city — almost twice the rate of city dwellers who made less than $50,000 a year, 19% of whom said they were likely to move. And a third of employed respondents said they were likely to move, compared to only 16% of unemployed respondents.Story continues“Wealthier households have greater mobility within the housing market due to higher ownership rates and access to lower mortgage rates,” said Johnson.Respondents with children were also more likely to move. Almost 40% of respondents with children were somewhat likely or very likely to move compared to 16% of respondents without children.“Those without children may also be less likely to move out of the city because they don’t necessarily have a reason to,” said Kushi. “The city offers amenities and conveniences that a suburb may not, and it is common for households to make the decision to move out of the city once they decide to have children and begin to prioritize a backyard and top school district.”Almost 40% of respondents with children were somewhat likely or very likely to move compared to 16% of respondents without children.Meanwhile, more suburbanites also planned to stay put in the latest poll. Some 86% said they were not at all or not very likely to move out of the suburbs because of the COVID-19 pandemic, compared to almost 70% in May.Large cities have already seen the impact of slowing demand, with significant rent price declines in July, even as suburban rent prices rose. But as coronavirus fears subside, the long-term impact on urban and suburban housing markets are yet unknown, according to economists.“It's too early to predict the macro changes to housing in urban, suburban and rural communities. Although intentions to leave the city have dropped over [the] last three months, sentiment is different from behavior,” said Johnson.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Rent growth hits lowest level in about 6 yearsReal estate is no longer Americans' favorite long-term investment: surveyCoronavirus quarantines made Americans want to spend on home improvement"}]}