{"article": [{"url": "https://finance.yahoo.com/news/every-investor-has-a-silent-partner-when-they-trade-stocks-veteran-cio-165232450.html", "published": 1599825620.0, "headline": "Every investor has 'a silent partner' when trading stocks: veteran CIO", "body": "Every trade made has a “silent partner” – Uncle Sam.On Tuesday, Sept. 15, the IRS expects everyone who is required to to submit another installment of estimated taxes, the third of the year.We’ve been in a whiplash of a bull market, seeing the S&P 500 (^GSPC) go from 2,400 to 3,400 in a matter of months as tech stocks pushed the market up and up and up.A lot of people have gotten into day trading and retail investors have largely been the big winners of the rally, at least the first chunk of it.The market has welcomed a lot of new investors since the pandemic hit the U.S., and they’re trading a lot. According to a recent Yahoo Finance-Harris poll, 44% of investors try to time the market and people who are trading frequently are making around four trades per month on average, which really does add up and can create hefty taxable gains (for the lucky ones).Many people might not be aware that they’ll be on the hook for a big chunk of money come tax time — or earlier, if they have to pay estimated taxes. (Getty Images)Barry Ritholtz, chairman and CIO of Ritholtz Wealth Management and a consistent voice of reason in the financial media, wrote a piece recently about “market timing and profit” that gets to the heart of a potential problem for investors who shuffle their stocks frequently: the fact that every trade made has a “silent partner,” Uncle Sam.Whether you should time the market is debatable. Ritholtz and most experts advise against it, but a lot of people, especially rich ones, do it frequently.But the main problem, Ritholtz writes, is that doing so often means you hold a security less than a year, which means you have to pay taxes as if the gains were ordinary income and not long-term capital gains, which enjoy lower tax rates. (Short-term capital gains come from selling assets for a year or less, and are taxed at your ordinary income tax rate. Long-term capital gains are gains on investments you owned for more than one year. They're subject to a 0%, 15%, or 20% tax rate, depending on your level of taxable income.)The Internal Revenue Service (IRS) headquarters building in Washington. (AP Photo/J. David Ake, File)Uncle Sam is involved with all your trading wins, Ritholtz says, and he’s definitely more than a “junior silent partner.” States also usually have their own taxes as well, making short-term trading even less profitable.Story continuesA key problem for the new batch of day traders, powered by trades that cost $0, is that a lot of people might not be aware that they’ll be on the hook for a big chunk of money come tax time — or earlier, if they have to pay estimated taxes.“They may not realize they have a partner,” Ritholtz told Yahoo Finance.Taxes and gains are two very interrelated things, but they can seem independent to someone making frequent trades months before there’s any hint of “tax season” in the air.Brokers like Robinhood, Fidelity, Vanguard, Schwab and others have resources on their websites for investors to learn about cost basis, capital gains, tax brackets, and other related topics, but anyone who realizes gains has to be proactive to learn about their tax responsibilities that might change how an investment strategy works.---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Poll: 83% of companies ready to embrace new work conditions after coronavirus2 tax safe harbors that new traders need to know aboutWhy the 2020 rally doesn’t feel like a bubble: hedge fund veteranNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}