{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-august-15-2020-161816268.html", "published": 1597909280.0, "headline": "Jobless claims: Another 1.106 million Americans filed new unemployment claims last week", "body": "The number of individuals filing new unemployment insurance claims unexpectedly rose back above 1 million last week, reflecting a still-elevated level of joblessness in the US.The Labor Department released its report on weekly unemployment insurance claims Thursday at 8:30 a.m. ET. Here were the main metrics from the report, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended Aug. 15: 1.106 million vs. 920,000 expected vs. 971,000 during the prior weekContinuing claims, week ended Aug. 8: 14.844 million vs. 15 million expected vs. 15.48 million during the prior weekRead more: Here’s what you need to know about unemployment benefits eligibilityThe report reflected the first increase in new jobless claims in three weeks. And new unemployment claims jumped back above their lowest level since the escalation of the pandemic in the US in March during the week ended August 8.At more than 1.1 million, last week’s total for new claims was well above the pre-pandemic record high of 665,000 from March 2009 during the Global Financial Crisis, and reflected another wave of individuals newly filing for unemployment insurance as the coronavirus pandemic continued to disrupt businesses large and small across the country. Before the coronavirus, new weekly jobless claims were coming in consistently below 250,000.Since the week ended March 20, about 57.4 million Americans have now filed new unemployment insurance claims.The majority of US states reported increases in unadjusted new claims for the week ended August 15. California again had the greatest number of new claims at more than 200,000, while New Jersey showed the greatest increase of nearly 11,000 last week, followed closely by Texas with an increase of more than 9,000.Meanwhile, continuing jobless claims, reported on a one-week lag, improved to the lowest level since. the start of the pandemic at 14.844 million, and brought the insured unemployment rate down to 10.2% or the lowest since April. Continuing claims did, however, hold well above the fewer than 1.8 million continuing claims filed weekly in the months preceding the pandemic.Story continuesA temporary work agency for job seekers is seen in Southwest Detroit, Michigan April 3, 2009. The U.S. unemployment rate soared to 8.5% last month, a 25-year high, as employers slashed 663.000 jobs and cut workers' hours to the lowest level on record, the government said on Friday. REUTERS/Rebecca Cook (UNITED STATES BUSINESS POLITICS)Importantly, Thursday’s jobless claims report marked the first after the Small Business Association’s Paycheck Protection Program (PPP) stopped accepting applications on Aug. 8. The program had been a key source of support for many small businesses in helping keep employees on their payrolls during the pandemic period.The report also represented one of the first few following the end-of-July lapse in enhanced federal unemployment insurance benefits, which had previously been set at $600 per week. President Donald Trump recently authorized a federal boost of $300-per-week in jobless benefits via executive measure, though the program so far has only been approved in a handful of states, and could see funds dry up within weeks.“Trump’s executive actions did not cover PPP and, with Congress remaining gridlocked on phase four [of discussions for another stimulus package], failure to extend support remains a downside risk for the labor market in August,” Nomura economist Lewis Alexander said in a note Friday.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}