{"article": [{"url": "https://finance.yahoo.com/news/moderna-ceo-credits-us-support-for-phase-3-vaccine-push-151225197.html", "published": 1595845220.0, "headline": "Moderna CEO credits US support for Phase 3 vaccine push, says 'we have to make a profit'", "body": "Moderna (MRNA) CEO Stéphane Bancel partly credited the U.S. for the company’s rapid development of a COVID-19 vaccine candidate, telling Yahoo Finance on Monday it could not have participated in such a robust trial without the federal government’s support.The U.S.’s leading coronavirus vaccine candidate — one of several companies that are part of Operation Warp Speed — entered Phase 3 trials Monday, with hopes of results by October or November. Bancel cited the additional $472 million— which brings total funding up to $955 million — as integral to accelerated push.“At the time we were thinking of a trial of 10,000 participants,” Bancel said of the initial plan in April, adding that discussions with the government researchers resulted in settling on a 30,000 participant trial.Over the weekend, the company announced an additional round of funding from Biomedical Advanced Research and Development Authority (BARDA), a department under the U.S. Health and Human Services Department (HHS).Moderna announced the first patient was dosed in Georgia with 100 micrograms of the vaccine candidate early Monday, but uncertainty remains as the trajectory of the outbreak determines how an effective vaccine is monitored and studied.As the coronavirus tightens its grip on the world, the stakes for Moderna — and a potential COVID-19 treatment — are high. Typically, the vaccine industry is not as profitable as therapies, and a treatment that falls short could be a devastating blow to a relatively young company.Moderna, in partnership with European-based Lonza, is producing at-risk 500 million doses for the year, and scaling up to potentially reach 1 billion doses by 2021.The mRNA vaccine technology the company is using has not yet been tested on the market, and production is more complex than traditional vaccines. The U.S. Food and Drug Administration has set a bar of 50% efficacy of any vaccine, and will have to determine the technology’s potential compared to traditional vaccines.Story continues‘We have to make a profit’If successful, a vaccine will actually be the 10-year-old company’s first product on the market. Despite significant taxpayer funding, as well as investors boosting its market capitalization to $29 billion, the biotech upstart will need to make a profit — and will consider that in its pricing, Bancel said.Exactly how much a vaccine shot will cost, and who’ll ultimately cover it, remains a big sticking point in the process.“We have to make a profit out of the first product [we sell],” Bancel told Yahoo Finance. “We have invested $2 billion of our shareholder capital since we started the company. We need to get a return. We are highly aware this is a pandemic and we need to be very responsible on how we price a product.”The company has said they will use previous vaccine prices as a benchmark, and will be providing discounts during the pandemic phase.In a separate issue, questions have been raised over the company’s executives selling stock after positive results from early trials. That pattern that has been seen in other newly-popular biotechs.Bancel reiterated the sales were set up in December 2018 after the company went public, but declined to address when or if the plans had since been modified. The company is in a silent period prior to second quarter earnings on August 5.“What I can tell you 99% of my wealth is tied up in Moderna stock, so I’m very aligned with any of our shareholders,” Bancel said. “I had more stock on June 13 than I had on January 1. If any investor is worried they are not aligned with me, they should look at the numbers.”Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsSurgeon General: US has a racial 'health disadvantage' — even without coronavirusRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}