{"article": [{"url": "https://finance.yahoo.com/news/u-consumer-spending-rebounds-income-133253054.html", "published": 1593160820.0, "headline": "U.S. consumer spending rebounds; falling income, surging COVID-19 cases loom", "body": "By Lucia MutikaniWASHINGTON (Reuters) - U.S. consumer spending rebounded by the most on record in May, but the gains are not likely to be sustainable, with income dropping and expected to decline further as millions lose their unemployment checks starting next month.The surge in spending reported by the Commerce Department on Friday is also under threat from a jump in coronavirus cases in many parts of the country, including densely populated California, Texas and Florida. The rising COVID-19 infections chipped at consumer sentiment in the second half of June. Confidence in government economic policies dropped in June to the lowest level since President Donald Trump entered the White House.The economy has been showing signs of turning around after tough measures to slow the spread of the respiratory illness pushed it into recession in February. Hiring, homebuilding permits, industrial output and orders for manufactured goods rebounded in May, recouping some of their historic losses.\"There are still huge pitfalls ahead for the economy,\" said Gus Faucher, chief economist at PNC Financial in Pittsburgh, Pennsylvania.The Commerce Department said consumer spending, which accounts for more than two-thirds of U.S. economic activity, jumped 8.2% last month. That was largest increase since the government started tracking the series in 1959. Consumer spending tumbled by a historic 12.6% in April.Economists polled by Reuters had forecast spending rising 9.0% in May. Spending was boosted by the reopening of many businesses after being shuttered in mid-March.Consumers stepped up purchases of motor vehicles and recreational goods. They also boosted spending on healthcare, and at restaurants, hotels and motels.But personal income dropped 4.2%, the most since January 2013, after surging by a record 10.8% in April when the government handed out one-time $1,200 checks to millions of people and boosted unemployment benefits to cushion against the COVID-19 hardship. The payments are part of a historic fiscal package worth nearly $3 trillion.Story continuesIn a separate survey on Friday, the University of Michigan said its consumer sentiment index dipped to a reading of 78.1 from 78.9 in the middle of June. Though sentiment rose from May, consumers in the regions with record rises in coronavirus cases were less upbeat relative to Northeast residents, which could weigh on the overall mood in the months ahead.Stocks on Wall Street fell, pressured by the rising virus infections and the Federal Reserve's move to cap big bank dividend payments and bar share repurchases until at least the fourth quarter. The dollar rose against a basket of currencies. U.S. Treasury prices were higher.INFLATION WEAKIncome in May was weighed down by a decrease in government welfare payments. The government will stop paying an additional $600 per week in unemployment benefits on July 31. Economists estimate about 26 million people, two-thirds of whom do not qualify for the regular 26-week state unemployment insurance benefits, would be left without income.About 30.6 million people, roughly a fifth of the labor force, were collecting unemployment checks in the first week of June. Government transfers to households rose at an annualized $1.1 trillion rate compared to $3 trillion in April.Wages rebounded 2.7% after dropping 7.6% in April. But gains could fizzle amid record unemployment and raging COVID-19 infections. Economists said the plunge in income underscored the need for additional government stimulus to avoid a so-called fiscal cliff on July 31.\"It is clear that the major force in keeping things from falling apart is the enhanced unemployment compensation,\" said Joel Naroff, chief economist at Naroff Economics in Holland, Pennsylvania. \"Without action, income could crater in August and spending will follow.\"Consumer spending in May was funded from savings, which decreased by $1.9 trillion. The saving rate dropped to a still-high 23.2% from a record 32.2% in April.Historically high savings could support spending. Economists, however, caution that heightened uncertainty could prompt consumers to hunker down and conserve their income.Inflation remained weak in May, with food prices moderating and the cost of energy goods and services declining for a fifth straight month. The personal consumption expenditures (PCE) price index excluding the volatile food and energy components edged up 0.1% after falling 0.4% in April.In the 12 months through May, the so-called core PCE price index rose 1.0%, matching April's gain. The core PCE index is the Fed's preferred inflation measure for its 2% target.When adjusted for inflation consumer spending surged a record 8.1% in May after tumbling 12.2% in April. Still the so-called real consumer spending remained 11.2% below its pre-pandemic level, keeping intact economists' expectations for the sharpest plunge in consumer spending and gross domestic product in the second quarter since the Great Depression.Economists expect GDP could shrink at as much as a 46% annualized rate in the second quarter. The economy contracted at a 5% pace in the January-March quarter, the deepest downturn since the 2007-09 Great Recession.(Reporting by Lucia Mutikani; Editing by Chizu Nomiyama and Andrea Ricci)"}]}