{"article": [{"url": "https://finance.yahoo.com/news/economy-may-undergo-sawtooth-recovery-from-coronavirus-former-fed-vice-chair-120138817.html", "published": 1597302560.0, "headline": "Economy may undergo ‘sawtooth’ recovery from coronavirus: Former Fed Vice Chair", "body": "The U.S. economic recovery slowed in July after a record-setting jobs surge in May and June, suggesting a gradual return to normalcy that deviates from the V-shaped recovery for which some observers held out hope.Roger Ferguson, the president and CEO of TIAA and a former vice chairman at the Federal Reserve, told Yahoo Finance in a recent interview that the U.S. may instead experience what he termed a “sawtooth” or “uneven swoosh” recovery, making progress in fits and starts on a slow return to pre-coronavirus levels of production and employment.The gradual but uneven trajectory will include significant inequality across sectors and communities, delivering rapid success for some while others trail far behind, said Ferguson, one of four Black CEOs of a Fortune 500 company.“Up and down, up and down a bit, before we gradually start to take off,” he says. “That gradual lift overall is going to mask some deep unevenness.”“There'll be some industries that come back very, very quickly,” he adds. “That will feel like a V in that industry. And there'll be some that recover very, very, very slowly.”“So we shouldn't let the general statement about sort of a gradual lift off at the right time mask the fact that it will still feel for some individuals and some industries very, very slow and uneven,” he says.The July jobs report showed an increase of about 1.7 million nonfarm payrolls, a dramatic slowdown from the average 3.75 million jobs added in each of the prior two months. The unemployment rate fell to 10.2% in July but remained well above the low single-digit marks seen before the pandemic.Diminished progress last month likely resulted in part from a pause or reversal of reopenings in more than half of U.S. states, as the coronavirus worsened in regions throughout the country. States like Texas and Florida had to close bars over the summer after a surge in cases, while the ongoing risks of large gatherings have largely prevented the return of the performing arts and other industries that depend on a live audience.Story continues“The most recent numbers suggest that the recession was really quite deep,” Ferguson says. “It's not clear to me that it's over yet.”NEW YORK, NEW YORK - NOVEMBER 07: Roger W. Ferguson Jr. speaks onstage at Women's Forum Of New York Breakfast Of Corporate Champions on November 07, 2019 in New York City. (Photo by Monica Schipper/Getty Images for Women's Forum of New York)Ferguson spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.The economic challenges will continue until the the U.S. can contain the virus, Ferguson says.“Much of this is driven by the virus and one has to observe that there's still hot pockets of virus in and around the United States,” he says.He called on Congress to pass another round of stimulus to alleviate the pain imposed by the recession.Negotiations over the next round of relief funds have reached a stalemate, Senate Majority Leader Mitch McConnell (R-KY) said on Tuesday. Disagreement between Democrats and Republicans on Capitol Hill centers on the size of the package, how much compensation to provide unemployed Americans, aid to state and local governments, and other issues.“I would encourage Congress to continue to hammer out and to negotiate and to come forward with a package that is well-rounded and has a scale that actually has the desired impact,” Ferguson says.Read more:Misty Copeland: Coronavirus will impact ballet for 'years to come’Bill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}