{"article": [{"url": "https://finance.yahoo.com/news/united-airlines-cut-16-370-172751242.html", "published": 1599050120.0, "headline": "United Airlines to cut 16,370 workers, many more going without pay", "body": "By Tracy RucinskiCHICAGO (Reuters) - United Airlines said on Wednesday it is preparing to furlough 16,370 workers when federal aid expires on Oct. 1 as the coronavirus pandemic continues to devastate the airline industry, though one union said many more people will be without pay.United's cuts include 6,920 flight attendants, but the union representing them said 14,000 will not have a paycheck in October unless Congress acts to extend $25 billion in aid.This is because many have opted for leaves that will provide healthcare but no money, Association of Flight Attendants-CWA International President Sara Nelson said.\"United's furlough announcement does not tell the full story,\" she said.Airlines have been lobbying Washington for a second stimulus package to protect jobs through March while the industry awaits a recovery. The first $25 billion, which covered airline payrolls, expires this month, but talks have stalled as Congress has struggled to reach agreement on a broader coronavirus assistance package.Chicago-based United had over 90,000 employees before the pandemic brought the industry to a near standstill in March. It warned in July that 36,000 jobs were at risk of involuntary furloughs as demand remained weak.U.S. passenger airlines are still collectively losing more than $5 billion a month as 30% of planes remain parked. Passenger travel demand is down about 70% and, on average, planes that are flying are half-full.Some 7,400 United employees have opted to take early retirement or departure packages and the company is working through several other voluntary temporary leave programs to further reduce the number of furloughs, United officials said, without providing specific numbers.The leaves would give the company flexibility to call back staff once travel returns, they said.United's furloughs will also affect around 2,850 pilots, 2,010 mechanics and 1,400 management and administrative positions, among others, though negotiations continue with pilots to reduce the final number.Story continuesRival American Airlines last week said it would lay off 19,000 workers without federal aid. Including voluntary departures or leaves, its 140,000 pre-pandemic workforce will shrink by 30%.Delta Air Lines plans to lay off nearly 2,000 pilots, but has not yet numbered potential cuts for its other workers.President Donald Trump has said his administration would help U.S. airlines but has not given any details.Congress also approved another $25 billion in loans for airlines under the first stimulus package, but not all of them are tapping the funds.(Reporting by Tracy Rucinski in Chicago; Editing by Richard Chang and Matthew Lewis)"}]}