{"article": [{"url": "https://finance.yahoo.com/news/oracle-tiktok-investment-wins-trump-004543408.html", "published": 1600609100.0, "headline": "Oracle TikTok Deal Wins Trump’s Blessing: Deal at a Glance", "body": "(Bloomberg) -- Oracle Corp.’s agreement to take a stake in TikTok has won the long-awaited blessing of U.S. President Donald Trump.The proposal, which would give Oracle and other investors minority ownership of a new company called TikTok Global, still needs approval from regulators in China, where TikTok’s parent ByteDance Ltd. is based.Trump’s praise for the agreement suggests that weeks-long deliberations over the fate of a popular music and video-sharing app are nearing completion. ByteDance began holding discussions with investors in its U.S. operations after the Trump administration threatened to shutter the business, saying that it poses a threat to national security.While some of the terms remain undetermined, here’s what’s known about the deal, based on public statements and people with knowledge of the matter:What We KnowWho’s in and who’s outOracle plans to take a 12.5% stake in a round of financing that would precede an IPOTikTok also said that together, Oracle and Walmart Inc. could end up with as much as 20%The new company, called TikTok Global, will raise a pre-IPO round of financing and seek a U.S. IPO in less than 12 monthsA host of other companies made proposals or considered bidding; Microsoft Corp. was rebuffed because it wanted to control all of TikTok in the U.S., a condition that didn’t sit well with BeijingWhat the deal looks likeOracle will be TikTok’s “trusted technology provider,” meaning Oracle will house the entity’s data in its U.S. servers -- a boon to a cloud computing business that has lagged behind those of Amazon.com Inc., Alphabet Inc. and Microsoft. It will also get access to monitor TikTok’s source code and algorithmsWalmart Chief Executive Officer Doug McMillon will sit on Tiktok Global’s board and is discussing a commercial partnership with TikTokBytedance is seeking a $60 billion valuation for TikTok, meaning Oracle and Walmart may pay $12 billion for their cumulative 20% stake if they agree to that priceTikTok Global will likely be headquartered in Texas and will hire at least 25,000 people, Trump said, without mentioning a timeline for those hiresByteDance would retain a majority stake in TikTok’s assets and control the closely guarded algorithm that determines what clips users seeHow the parties are addressing security concernsOracle will review TikTok’s full source code and updates to make sure there are no back doors that could be used by ByteDance to gather data or spy on the app’s 100 million or so American usersOracle will be able to continue to review the technology as updates come in to make sure there are no new points of access to the data -- it says its Generation 2 Cloud fully isolates running applications and responds to security threats autonomously, which eliminates the risk of foreign governments spying on American users or trying to influence them with disinformationTikTok was able to convince the U.S. government that TikTok Global would be controlled by American investors as it counts the passive stakes of existing shareholders in TikTok’s Chinese parent, people familiar with the matter said. Although Bytedance will retain an 80% stake in the new company, because existing U.S. investors hold a 40% stake in ByteDance, the math works out to 53% ownership by U.S. companies and investorsStory continuesWhat We Don’t KnowWhat China thinksThe Chinese government will also have to approve ByteDance’s plans under new restrictions Beijing imposed on the export of artificial intelligence technologies, Bloomberg News reported earlierAs of earlier this week, ByteDance was growing increasingly confident that the proposal would pass muster with Chinese regulators, people familiar with the matter told BloombergEarly reaction from Chinese state media appeared positive. “This scheme is still unfair, but it avoids the worst result that TikTok is shut down or sold to a US company completely,” wrote Hu Xijin, the influential editor in chief of China’s state-owned Global TimesFate of the Commerce Department’s banThe Commerce Department said Saturday it will push a ban back by one week that would bar TikTok from the Apple Inc. and Android app stores, extending the Sept. 20 deadline set by President TrumpTikTok Global’s leadershipVanessa Pappas is currently the interim head of TikTok, but the company hasn’t specified if she will permanently lead the social network when it becomes TikTok Global. The company has reportedly held preliminary talks with Kevin Systrom, a co-founder of Instagram, about taking over the CEO jobBesides Walmart’s McMillon, it’s unclear who the company’s other four board directors will be. The parties have said that four of the five board members would be AmericanWhether Trump will get a payoutTikTok Global will pay more than $5 billion in new tax dollars to the U.S. Treasury, but that doesn’t align with Trump’s boast about an education fund“They’re going to be setting up a very large fund,” Trump said Saturday, adding that it will be used to fund “patriotic education.” “That’s their contribution that I’ve been asking for”The companies and Bytedance’s U.S. investors said they will work together to “create an educational initiative to develop and deliver an AI-driven online video curriculum” made up of reading, math, science, history and computer engineering, but it did not put a monetary value on this effortFull details of the pre-IPO funding roundTikTok did not say when it will be conducting a financing round and hasn’t specified if existing Bytedance investors such as Sequoia Capital, General Altantic and Coatue Capital could participate in the round(Updates to include additional details throughout.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}