{"article": [{"url": "https://finance.yahoo.com/news/trump-tweets-taxes-new-york-times-report-143707781.html", "published": 1601286320.0, "headline": "Trump's past tweets slammed others for not paying enough taxes and claimed he pays 'more'", "body": "Over the years, President Donald Trump’s Twitter feed has featured messages slamming others for not paying taxes, bragging about how rich he is, criticizing those paying taxes overseas, and even claiming he pays “more taxes in one year than you pay in your entire life.”It all reads differently now after The New York Times obtained decades of Trump’s tax information and found that he “has been more successful playing a business mogul than being one in real life.”Perhaps nowhere is the disconnect between his public message and apparent private financial situation more stark than in the messages Trump has tweeted out over the years.President Donald Trump looks at his phone during a roundtable discussion on the reopening of small businesses at the White House in June. (REUTERS/Leah Millis)For the record, Trump has denied the report. “It’s totally fake news,” he said Sunday evening and added Monday morning that he “paid many millions of dollars in taxes but was entitled, like everyone else, to depreciation & tax credits.”It’s often been noted that there’s “always a tweet” buried somewhere in Trump’s timeline that relates to the scandal of the moment. In this case there are scores of them. With an assist from the always helpful Trump Twitter Archive, here are some of the starkest examples.Times he slammed others for not paying taxesThe key finding in the Times report was that he paid just $750 in federal income taxes the year he won the presidency and another $750 in 2017. He also paid no income taxes at all in 10 of the previous 15 years.That didn’t stop him from attacking others for supposedly not paying enough in taxes. In 2012, he tweeted that then-President Barack Obama “only pays 20.5%” of his earnings in taxes.@BarackObama who wants to raise all our taxes, only pays 20.5% on $790k salary. http://t.co/bqF26mQf Do as I say not as I do.— Donald J. Trump (@realDonaldTrump) April 13, 2012The same year, he sent along a story about Americans not paying taxes “despite crippling govt debt.”Story continuesThese tweets came during a 2012 presidential campaign when tax avoidance was a big issue among Republicans. Later in the year, the Republican presidential candidate, Mitt Romney, got into trouble after suggesting that the 47% of Americans who pay no income taxes were Obama supporters.In more recent years, during his own run for president and since taking office, Trump has repeatedly gone after another perceived political enemy, Amazon (AMZN), for not paying its taxes.Trump actually bragged about paying taxes in a few instances. In 2013, he retweeted an account that claimed “Trump is an American that will pay more taxes in one year than you pay in your entire life.”\"@conservativeJT: @bluejoni @realDonaldTrump Trump is an American that will pay more taxes in one year than you pay in your entire life.— Donald J. Trump (@realDonaldTrump) March 28, 2013According to the Times report, 2013 was actually one of the years that Trump lost the most money and when he was likely able to avoid taxes. Trump National Doral, one of his Florida golf resorts, lost over $65 million in 2013 alone, according to the report.I am going to Trump National Doral in Miami this week to check out the $250 million renovation. In construction, always watch the money!— Donald J. Trump (@realDonaldTrump) July 1, 2013The next year, he retweeted a message telling Trump that since he pays his taxes, he “should be able to put up whatever signage you want.”Foreign entanglementsAnother revelation in The New York Times story is Trump’s foreign entanglements. His financial ties in places like Turkey are more extensive than previously known, and there are a host of countries where he actually paid more taxes than in the U.S.As the story by Russ Buettner, Susanne Craig and Mike McIntire says, “The president’s $750 contribution to the operations of the U.S. government was dwarfed by the $15,598 he or his companies paid in Panama, the $145,400 in India and the $156,824 in the Philippines.”But in 2012, he asked whether Obama was the first president “who earned over 1/3 of his income from foreign sources and paid taxes to another country?”Have we ever had a POTUS before @BarackObama who earned over 1/3 of his income from foreign sources and paid taxes to another country?— Donald J. Trump (@realDonaldTrump) July 12, 2012Trump also sent many many tweets touting his foreign properties from Turkey to Panama to the Philippines to India.I just had an amazing day in Mumbai, India. Building an almost 80 story building, super luxury, which is doing great! Press is going wild.— Donald J. Trump (@realDonaldTrump) August 12, 2014Other revelationsThe report details a range of other findings from Trump’s use of “consultant fees” to give money to people like his daughter Ivanka to the ongoing IRS audit that could cost him $100 million to the staggering amount of personal debt he reportedly currently holds.As the Times report says, “Within the next four years, more than $300 million in loans — obligations for which he is personally responsible — will come due.”As for consultants, the president has often dismissed them in tweets, calling out the Republican party’s “consultant class of losers” in 2013.On the audit process — which Trump has used as a shield to avoid releasing his taxes — he called the process “routine” in tweets and comments. Trump’s own IRS commissioner has confirmed that there is no rule precluding the president from releasing his tax returns while under audit.On his propensity for loans, Trump has actually been somewhat open about that:I am \"the king of debt.\"That has been great for me as a businessman, but is bad for the country. I made a fortune off of debt, will fix U.S.— Donald J. Trump (@realDonaldTrump) June 21, 2016On Monday, he claimed that he was under leveraged. “I have very little debt compared to the value of assets,” he tweeted.But what The New York Times story doesn’t reveal — and what Trump is widely expected to try to keep secret — is who precisely holds the loans that he has personally guaranteed.If Trump wins, the story notes, “Lenders could be placed in the unprecedented position of weighing whether to foreclose on a sitting president.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Trump reportedly paid no federal tax in 10 of the last 15 years: 75 million of Americans pay no federal income tax — here’s whyHere’s who Trump likes to blame when the stock market goes downTrump, Biden both likely to push national debt to new heights: ExpertRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}