{"article": [{"url": "https://finance.yahoo.com/news/poll-83-of-companies-ready-to-embrace-new-work-conditions-after-coronavirus-114611114.html", "published": 1599807260.0, "headline": "Poll: 83% of companies ready to embrace new work conditions after coronavirus", "body": "The work-related changes brought on by the coronavirus are looking more and more permanent.Mercer, a human resources consulting firm, found that a majority of companies it surveyed are planning to continue offering employees “flexibility” around how and where their workers perform their duties after the crisis is over.Some companies that are adopting this strategy: Twitter (TWTR) and Square (SQ), both founded and run by Jack Dorsey, and Facebook (FB), which also announced that it would normalize salaries to wherever people end up this January, allowing them to work remotely permanently.Various market and labor observers have quipped that the coronavirus caused a decade of change in the blink of an eye, but a big question looming over workers and employees has been whether this increased flexibility around work locations and hours will stick. For many employers, the answer seems to be yes.“A couple of us [at Mercer] were talking about what’s the tipping point? At what point can an employer not go back?” said Mary Ann Sardone, a partner at Mercer. “There is a permanence now that we’re in the fall talking about this.”Back in March when employers sent their (mostly white-collar) workers home, the feeling among many companies was that it would be temporary. But the pandemic’s severity convinced companies and employees to invest in new protocols, home-office equipment, and try fresh ideas.Man doing telework and reconciling family life“Companies made return plans and have halted, changed, and pushed them out,” said Sardone. “Now there is a permanence that I don’t think we’ll be able to unwind.”In Mercer’s most recent employer survey of 819 respondents, 83% of employers indicated they would provide flexibility at a greater scale post-pandemic. One in three anticipate having 50% or more of the workforce remote post-Covid, compared to one in 30 pre-pandemic, a 900% change.The flexibility, companies said, was mostly about where the work is done; but also 72% reported expecting flexibility around hours and scheduling, and 49% reported flexibility around how work gets done, as companies have quickly adopted new technology (see: Zoom, Cisco Webex, telehealth) by necessity.Story continuesWhile a lot of the changes are designed to help parents, who have to juggle childcare duties, Sardone said flexibility is emerging for companies that need other shift times filled and are able to work with employees who may prefer non-standard hours as well.‘Too much opportunity’ not to do thisThe increased flexibility, which appeals to what employees want, is by no means a favor to them. Employers are very enthusiastic too.Movers unload a truckload of belongings as the Lilly family move into their new home, Tuesday, July 21, 2020, in Washingtonville, N.Y. New Yorkers anxious after weathering the worst of the coronavirus pandemic are fueling a boom in home sales and rentals around the picturesque towns and wooded hills to the north. Real estate brokers and agents describe a red-hot market recently, with many house hunters able to work from home. (AP Photo/John Minchillo)That’s because, Sardone says, flexibility presents “too much opportunity” for companies not to provide it.“The obvious kind of opportunity is expanding your talent pool,” she said. “Where you might have been a high cost location, now you have the ability to tap into labor markets anywhere within reason.”Getting labor is a huge benefit, but it’s not the top reason employers are citing. According to the survey, 76% of companies cited higher engagement and productivity for supporting these policies.“What I was most surprised at was how bullish employers are around flexibility,” she said. “That was a pretty compelling stat.”For companies that have changed the back-to-office plans multiple times, providing flexibility to employees also gives companies agility and flexibility themselves. While companies can’t really lower office costs too much (multi-year leases are tough to get out of if you’re not at the end of them), companies can and have been investing in technology that makes where and when the work is done matter less.“Where you may have cost savings for infrastructure, you may need to have investment in tech to make remote working work,” said Sardone.Fresh new challengesThe new normal, great for many companies and employers as it may be, isn’t without its challenges.In Mercer’s most recent employer survey, 83% of employers indicated they would provide flexibility at a greater scale post pandemic. (Getty Images)Sardone said big companies with significant investment in their headquarters or ones that provide generous perks, like free food, a gym, childcare — often campus-like tech firms — will have to think creatively about how to retain talent that especially values these aspects of company culture.But it’s general culture in a remote environment that will be a hurdle companies have to adapt to. There’s no general rule or guideline, Sardone said, because every workplace is so different. Each will have their own challenges in recreating their formulas digitally.“Much of culture is centered on face time and human interactions,” she said. “How do you replace that?”However, the key obstacle so far, Mercer has found, is managers.“A lot of our clients are finding that is the biggest obstacle: the manager and their ability and capacity — it comes from having to lead and manage differently and it requires training,” she said.Working primarily online requires a different set of skills and managers and employees alike need different levels and means of support. As the ways work gets done change, so do myriad adjacent parts of the machine, companies are finding. Management is no different.---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Why the 2020 rally doesn’t feel like a bubble: hedge fund veteranStock split behavior confuses billionaire and analystsMutual funds have a FAAMG problemNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}