{"article": [{"url": "https://finance.yahoo.com/news/september-jobs-report-labor-department-coronavirus-pandemic-unemployment-185815250.html", "published": 1601624360.0, "headline": "September jobs report: US economy gains 661,000 payrolls, unemployment rate ticks down to 7.9%", "body": "The US economy saw another 661,000 jobs added back in September and a modest improvement in the unemployment rate, as the recovery in the labor market continues at a stagnating rate.The Labor Department released its September jobs report Friday morning. Here were the main metrics from the release, compared to consensus estimates compiled by Bloomberg.Change in non-farm payrolls: +661,000 vs. +859,000 expected and +1.489 million in AugustUnemployment rate: 7.9% vs. 8.2% expected and 8.4% in AugustAverage hourly earnings, month over month: 0.1% vs. 0.2% expected and 0.3% in AugustAverage hourly earnings, year over year: 4.7% vs. 4.8% expected and 4.6% in AugustLabor force participation rate: 61.4% vs. 61.9% expected and 61.7% in AugustThe addition in non-farm payrolls marked the fifth straight month of net job gains. July’s payroll gains were upwardly revised by 27,000 to 1.761 million, and August’s were revised up by 118,000 to 1.489 million.Still, the economy remains far from recuperating the jobs lost during the nadir of the pandemic period in March and April. Between those two months, employment fell by more than 22 million. Through September, just 11.4 million jobs were brought back.By industry, leisure and hospitality employers brought back by far the most payrolls in September at 318,00, with nearly two-thirds of these gains coming in bars and restaurants as these businesses reopened further. Still, employment at food services and drinking places remains lower by 2.3 million compared to February – even with job growth totaling 3.8 million over the past 5 months.Retail trade added back more than 142,000 jobs during the month, comprising a major portion of the overall job gains in September, but representing step down from the 261,000 payrolls added in these industries in August.Government jobs were the only category to post net job losses during the month, driven by a decline in the number of temporary Census 2020 workers.Story continuesMeanwhile, the unemployment rate ticked down more than expected in September, improving further from the pandemic-era high of 14.7% in April, but still coming in at more than double the unemployment rate from February this year before the outbreak. And September’s drop in the jobless rate also coincided with an unexpected decline in the labor force participation rate, reflecting a decline in the number of Americans either employed or actively seeking employment.The US economy regained another 661,000 non-farm payrolls in September and the unemployment rate ticked down to 7.9%. (David Foster/Yahoo Finance)Even as the US economy brings back some workers, an increasing number of Americans have found their layoffs to be permanent. The number of permanent job losers jumped by 345,000 to 3.8 million in September, with this number having increased by 2.5 million since February.The number of individuals reported as being on temporary layoff fell by another 1.5 million in September to 4.6 million, reflecting a shift to longer-term unemployment for some, and a return to employment by others. This metric has dropped considerably from the 18.1 million in this category in April, but has still held well above pre-pandemic levels.Other labor market indicators ahead of Friday’s report offered a similar take on the state of the labor market in September – that jobs are still coming back on net but at a slowing rate, and with an undercurrent of layoffs and job cuts still taking place.ADP’s monthly report on private payrolls, while an imprecise indicator of the Labor Department’s report, showed 749,000 jobs added back in September, for a print better-than-expected but still a step down from the multi-millions of job gains reported in May and June. New weekly jobless claims in mid-September —around the time that the Labor Department’s monthly non-farm payrolls survey takes place — fell below 1 million in a sharp improvement from the millions of claims added per week in the spring.But job cuts have still remained elevated. The Challenger Job Report out Thursday showed that job cuts announced by US employers were 186% higher in September this year than last year, and also accelerated slightly from August.Policymakers have stressed that the slowing labor market recovery suggests more must be done out of Washington to provide support to those impacted by the pandemic and efforts meant to contain it. Federal Reserve Chair Jerome Powell said in testimony before Congress earlier this month that the path ahead remains “highly uncertain,” and will “depend on keeping the virus under control, and on policy actions taken at all levels of government.”Still, congressional lawmakers continue to struggle to reach a near-term agreement to unleash more fiscal stimulus into the economy. The lapse in enhanced federal unemployment insurance benefits in late July has chipped away at consumers’ spending power, threatening to slow further the economic recovery that began as business activity stirred back to life after closures. Other lapses have had a more direct impact on the labor market: The phase-out this week of federal aid aimed at keeping workers on payrolls has already led airlines to move ahead with tens of thousands of job cuts, based on announcements this week.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}