{"article": [{"url": "https://finance.yahoo.com/news/netflix-co-ceo-hastings-advantage-over-amazon-apple-133143102.html", "published": 1599813560.0, "headline": "Netflix co-CEO on its advantage over Apple and Amazon: We have a 'single focus'", "body": "Netflix (NFLX) is often lumped in with the other high-growth tech stocks like Facebook (FB), Amazon (AMZN), Apple (AAPL), and Google (GOOG, GOOGL). Netflix is the “N” in “FAANG,” after all. But co-founder and co-CEO Reed Hastings says Netflix has a key advantage over competitors: a singular focus.In an interview with Yahoo Finance Editor-in-Chief Andy Serwer, Hastings pointed out that while boundlessly deep-pocketed firms like Amazon and Apple are pushing further into the entertainment business, they aren’t singularly dedicated to content.“You know, they're doing a lot of things that are interesting, but we're focused on being a great entertainment company,” he said, referring to Amazon and Apple. “We have the advantage of a single focus, this is all what we are about. And we work really hard to continue to be the best in the world at it.”Hastings spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.A good decade for Netflix, and a boost from the coronavirusAnd Netflix has exploited that focus to dramatic affect. The company had the best performing stock of the last decade — climbing an outrageous 3,700%, far beyond its competitors.Reed Hastings, co-founder and CEO of Netflix, gestures during an event of the Fundacion Telmex Mexico Siglo XXI (Telmex Foundation Mexico XXI Century) in Mexico City, Mexico, September 6, 2019. REUTERS/Edgard GarridoIt’s also been a massive beneficiary of the global lockdowns caused by the novel coronavirus. The company added nearly 16 million global subscribers in the first quarter of the year, as people locked down in their homes — a 23% jump from the same quarter the prior year. The momentum continued into the spring, when the streaming giant added another 10.1 million global users for the second quarter.Netflix’s stock price has climbed along with its user base. On March 19, just before statewide shutdowns began rolling out across the U.S., Netflix was trading at $332.03 per share. At the close of markets on Sept. 10, it was trading at $480.67.Formidable competitorsStill, Amazon and Apple have been producing appealing content of their own. And with Amazon Prime Video available for $8.99 per month, or included with a Prime subscription, and Apple TV+ just $4.99 per month, they’re able to easily undercut or match Netflix’s entry-level price of $8.99. Subscribers pay $15.99 for a premium Netflix subscription.Story continuesWhat’s more, Amazon has proven that it has what it takes to make not just award-winning content, but content that can penetrate the zeitgeist. Look no further than the likes of “The Marvelous Mrs. Maisel,” “The Man in the High Castle,” and “The Boys.”Apple’s Apple TV+ service., meanwhile is available for free for 12 months when you purchase certain new Apple products. And while it hasn’t become a streaming juggernaut, it could in the future as it stocks up on new shows and content.26th Screen Actors Guild Awards – Photo Room – Los Angeles, California, U.S., January 19, 2020 – Tony Shaloub poses backstage with his awards for Outstanding Performance by an ensemble in a Comedy Series and Outstanding Performance by a Male Actor in a Comedy Series for \"The Marvelous Mrs. Maisel.\" REUTERS/Monica AlmeidaNetflix also needs to continue fighting for users’ attention to ensure that it doesn’t see excessive churn during lulls between hits like “Stranger Things” and “Tiger King.” Tech platforms, meanwhile, can continue to pull in revenue from their other disparate sources if their streaming efforts are hit by a lull in new users or see large amounts of churn.But, as Reed points out, Netflix’s business model also helps it avoid the more controversial elements of Big Tech that come with using consumers’ data to sell advertising.“They've got much bigger market caps, they have multi-business lines, many of them have ad support and are very data exploiting in that way, and we don't have any of that,” he said.“You know, we're just a simple, extremely great entertainment company. And then you know, for again, for about 15 bucks a month you get amazing content.”Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Microsoft Surface Duo review: A two-screen Android phone that could change everythingApple’s Sept. 15 event is all about the Apple Watch2 reasons fears of a dot-com style tech bubble are overblownApple’s iMac 27-inch has a colossal power and a gorgeous displayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}