{"article": [{"url": "https://finance.yahoo.com/news/microsoft-365-word-transcribe-150029898.html", "published": 1598350100.0, "headline": "Microsoft adds transcription to Microsoft 365 productivity suite", "body": "Microsoft is adding a transcription feature to its Microsoft 365 productivity suite. (Photo by VCG/VCG via Getty Images)Microsoft (MSFT) is rolling out a new feature for its Microsoft 365, formerly Office 365, productivity suite that could help streamline some of the most tedious work of all: transcribing.The feature, which Microsoft aptly calls Transcribe in Word, gives you the ability to fire up the Word app on your laptop or desktop, and in the future on your smartphone, and begin transcribing anything being said by multiple people in the room with you or via apps like Zoom (ZM), Skype, or Microsoft Teams.Yahoo Finance spoke to Dan Parish, principal group PM manager for Microsoft Office, about the new transcription feature and how it can be used within Word to let you quickly grab portions of a transcribed conversation and drag them into your document.During a brief demonstration, Parish explained how Transcribe in Word uses your computer’s speakers and microphone to capture what is being said and what you say during a conversation.The new feature, which is available now for all Microsoft 365 subscribers and coming to mobile later this year, is surprisingly easy to use. To access it, you’ll simply need to click the Dictate button in the toolbar and select the Transcribe option.You'll be able to use Transcribe with video services like Zoom and Skype, through audio apps, or by uploading your file to Microsoft's cloud. (Image: Microsoft)You’ll then be able to start recording your conversation in a window to the right of your Word document. When you’ve finished your recording, the audio will automatically upload to Microsoft’s servers where it will be transcribed and sent back to you complete with breakdowns for each speaker.So if you are talking to another person, you’ll see your transcript broken down between Speaker 1 and Speaker 2, and clickable links in each block of text that will take you to a specific part of your conversation.The transcription isn’t always perfect, though, so Transcribe lets you click into each section of your transcript and edit it for accuracy.You can then click the plus sign next to the section of the transcript you want to use to quickly drop it into your document. It’s sure to be a compelling feature for plenty of users, yours truly included.Story continuesYou don’t just have to record audio from the app itself, either. Microsoft says it will support the option to upload audio from a variety of sources, so you can quickly get transcripts you record on most devices.There are some caveats for the service, however. For now, it only supports English language transcription. It also limits you to 5 hours of uploaded audio per month, and file sizes can’t be larger than be 200mb, which means you likely won’t be using this to record especially lengthy meetings.You also can’t wear headphones while recording from a device like your laptop or desktop, because Transcribe actually takes advantage of your computer’s microphone and speakers to capture audio.As for competing options, Google (GOOG, GOOGL) also offers its own voice typing feature in Google Docs, but that feature is a kind of live transcription tool and isn’t very accurate. From the test I saw with Transcribe, that doesn’t appear to be an issue for Microsoft’s offering.Microsoft has been steadily improving the functionality and design of apps like Word to make them more appealing and easier to use, and Transcribe looks to be one more feature that will do just that.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Fitbit launches new Sense smartwatch to help track and reduce your endless stressA majority of Americans think social media sites are politically bias: ReportWhat the heck is happening with Apple, Google, and ‘Fortnite’?: Tech Support Apple faces an App Store reckoning amid gaming and tech uprisingFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}