{"article": [{"url": "https://finance.yahoo.com/news/why-tesla-shares-are-tanking-today-165145933.html", "published": 1599566360.0, "headline": "Why Tesla shares are tanking today", "body": "Tesla (TSLA) shares tanked 21% percent today, closing the session at $330.21.“If you’re a trader, you have to be able to stomach that volatility,” Ari Wald, Oppenheimer senior analyst, told Yahoo Finance’s The First Trade.The stock opened severely under pressure on Tuesday after the electric vehicle maker was sidelined for inclusion in the S&P 500 (^GSPC). Some investors had speculated the company would be added after posting its fourth consecutive quarter of GAAP profitability in July. Before the bell today, Nikola (NKLA) and GM (GM) announced a tie-up to make the electric truck startup’s Badger, which will take on Tesla’s Cybertruck.Also on Tuesday, Tesla disclosed it completed its sale of $5 billion of common shares. The company had announced the planned offering a week ago saying it would sell the shares “from time to time.” The stock entered into correction territory in the days that followed, despite a recent price target increase from BofA.The stock was also under pressure last week after investment firm Baillie Gifford disclosed cutting its position in the electric vehicle maker citing portfolio restrictions.The stock is down about 33% from its closing high on August 31st. On that day shares began trading on a 5-for-1, split-adjusted basis.The stock split, the first in the company’s history, was announced earlier in August when shares were trading below $1,400. The stock soared in the weeks that followed to close at $2,213.40 on the Friday prior to the split.Some investors had speculated the company would be added to the index after posting a fourth straight quarter of GAAP profits during its latest quarterly results announced in July. (Photo by Lintao Zhang/Getty Images)Analysts have been racing to re-rate the stock following its massive rally this year. One analyst called the stock’s valuation “mind-boggling.”ARK Invest’s Tasha Keeney recently reiterated the firm’s bullish position on Tesla, telling Yahoo Finance, “We think it’s a leader in electric vehicles and full autonomy.”Story continuesWedbush’s Dan Ives has told Yahoo Finance Tesla “is a tech company, not an automobile company.” Ives’ price target is $380, with a bull case of $700.Not everyone believes in the company’s growth story, however. In late August one analyst told Yahoo Finance, “Tesla is detached from reality,” predicting an $87 price target by the end of 2021.Year-to-date, Tesla is up about 294%.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreTesla bull says long-term thesis 'still intact,' sees $7,000 price target by 2024Tesla bear says stock is 'detached from reality,' predicts $87 price targetBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}