{"article": [{"url": "https://finance.yahoo.com/news/walmart-hits-a-grand-slam-with-its-tik-tok-deal-with-oracle-110306137.html", "published": 1600668680.0, "headline": "Walmart hits a grand slam with its TikTok deal with Oracle", "body": "Sam Walton could very well be smiling down on one of his disciples right now after hitting a dinger out of the ballpark.Walmart (WMT) CEO Doug McMillon is in fact that baseball smasher. In arguably his most important deal (and there have been quite a few to speak of) since taking over as CEO in February 2014, McMillon over the weekend signed off on a partnership with Oracle that will find it as an investor in social media juggernaut TikTok. Walmart didn’t disclose how much it will pay for its 7.5% stake in the new TikTok Global (reports have Walmart and Oracle shelling out a combined $12 billion for their total 20% stake).But the dollar amount doesn’t really matter, what does is that McMillon — who will be one of five executives on TikTok Global’s board — ponied up. Really, who gives a darn? What, you want Walmart to take those billions of dollars and invest it in opening 500 Supercenters by 2025 in the saturated U.S. retail market? If you are a Walmart shareholder of course that’s not what you should want. That would be an awful use of shareholder capital.McMillon was tasked back in February 2014 with reinventing the retailer in the age of digital consumption while channeling his Walmart upbringing to stay true to why the company was founded way back in 1962.And with his latest pen-stroke for a digital business, McMillon has executed on that mission yet again.“For Walmart this is a golden jewel that falls in their lap to monetize this massive installed base. It’s mirroring what we have seen in China around e-commerce and QVC-like cross pollination of the platform,” explained Wedbush analyst Dan Ives via email to Yahoo Finance. “They are popping the champagne in Bentonville [Walmart HQ] and Redwood Shores [Oracle HQ] the morning after this deal got sealed.”Walmart’s monetization of TikTok’s 100 million and growing user base, as Ives references, could come in numerous forms.First, the company will now have more digital gold — aka data —to help it better target its inventory investments in the United States. Better inventory planning for a retailer often leads to better returns — plain and simple. And for a retailer Walmart’s size every ounce of productivity extracted from inventory could have an outsized positive effect on earnings, cash flow and returns to investors.Story continuesIn layman’s terms, Walmart will be able to identify key trends — and plan accordingly — before rivals, thanks to TikTok.Second, another monetization aspect is to create a real-time marketplace (something Walmart hinted at in its press release on the deal). Imagine you make a TikTok video with your cat. When you are done, you get an offer for 10% off XYZ cat food from Walmart.com. That’s realistic under this deal. Or, you are watching a TikTok video and like the desk in the person’s background — you tap on the desk and up pops several options that are for sale at Walmart.com.The time has come for this way of shopping. Facebook’s Instagram hasn’t truly executed on this, but it’s not a retailer. Walmart is.Walmart CEO, Doug McMillon speaks during a news conference with US President Donald Trump on the novel coronavirus, COVID-19, in the Rose Garden of the White House in Washington, DC on April 27, 2020. (Photo by MANDEL NGAN / AFP) (Photo by MANDEL NGAN/AFP via Getty Images)Then there is the advertising component to the deal. It’s not entirely clear how that will work for Walmart just yet. But Amazon hauled in about $14 billion in 2019 from advertising on its site, essentially pure profit that the e-commerce retailer takes and invests elsewhere such as Amazon Web Services and Prime. That’s a nice chunk of change Walmart could now target with TikTok and then invest in even bigger longer term bets.There are the intangible aspects to the deal. Walmart now boasts a very strategic asset that no one else in retail possesses (unless Target buys Snapchat). Moreover, it’s a very strategic asset that skews to a whole new generation of consumers. What better way to position a giant company like Walmart for the future of consumption than making a bet on TikTok at an opportunistic moment? If there are other ways, send me an email I would love to hear them.“I do think it would make some strategic sense [for Walmart] for three reasons. First, the lines are blurring between physical commerce, digital commerce, and social media. And for Walmart to have some exposure to a digital media asset — to a social media asset that would give them more exposure to that trend I think makes a lot of strategic sense,” said UBS retail analyst Michael Lasser on Yahoo Finance’s The First Trade.Lasser added, “Two, the TikTok audience tends to skew much younger, which contrasts to the Walmart customer base, which is a little bit older. So having the exposure to that younger audience would also be of strategic value to Walmart. And finally, there is a lot of data and information that Walmart would be able to gleam as a result of seeing what trends are emerging in real time. It could boost its website and really connect more deeply to those trends.”As icing on the monetization cake, Walmart will get to partake in any return from the listing of TikTok Global in the U.S. within the next 12 months.Like we said at the outset, Mr. Sam (as Sam Walton was referred to by associates) is probably all smiles.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.What’s hot this week from Sozzi:Peloton’s biggest rival just raised a ton of money from the likes of Stephen CurryHome Depot co-founder and Atlanta Falcons owner gives his best advice to new NY Mets ownerPeloton founder: here’s one of my biggest 15 year goalsVitamin Shoppe CEO: the pandemic has changed our businessKraft Heinz CEO: Buffett’s team like our $3.2 billion dealKroger CEO: this is how we see the future of food shoppingWatch Yahoo Finance’s live programming on Verizon FIOS channel 604, Apple TV, Amazon Fire TV, Roku, Samsung TV, Pluto TV, and YouTube. Online catch Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, and reddit."}]}