{"article": [{"url": "https://finance.yahoo.com/news/ce-os-shouldnt-whine-when-employees-are-being-devastated-by-coronavirus-scooter-braun-142707428.html", "published": 1593509720.0, "headline": "CEOs shouldn’t ‘whine’ when ‘employees are being devastated’ by coronavirus: Scooter Braun", "body": "With coronavirus cases on the rise and expanded unemployment benefits set to expire in July, some observers fear economic calamity for the more than 47 million Americans who’ve filed for the program since March.The nation’s CEOs should do everything they can to retain and support their workers amid the downturn, says entertainment executive Scooter Braun, who manages pop stars Justin Bieber and Ariana Grande, among others.In a newly released interview, taped on May 20, Braun called on top executives to sacrifice some of their wealth if necessary to ensure the well-being of their employees.“I don't think it's okay to whine about being compromised when your employees are being devastated,” he says.“If you're living such a glamorous life, then maybe you don't get that extra luxury, maybe you get compromised, maybe things feel a little bit tight for you,” says Braun, the chairman of media holding company Ithaca Holdings who has an estimated net worth of $400 million.Dozens of CEOs have taken pay cuts since the pandemic hit the U.S. and businesses shut down, including Delta (DAL) CEO Ed Bastian and Uber (UBER) CEO Dara Khosrowshahi, as well as Fox (FOX) chair Rupert Murdoch and CEO Lachlan Murdoch.While a chief executive’s base salary can near or even top $1 million, it often comprises a fraction of total compensation, which often includes stock awards, option awards, and other types of remuneration.Braun said CEOs should forego salary this year, if necessary, to take care of their workers, and asserted that it’s a step he’s personally willing to take.“I'm a firm believer that if salaries need to be cut or people need to be fired, the CEO should drop their salary in this one year down to zero,” he says. “I've made it very clear for my employees day one that if there's going to be any salary cuts, it will be mine first.”Despite salary reductions by some wealthy CEOs, U.S. billionaires had seen their wealth increase $583 billion amid the pandemic, according to a report from Americans for Tax Fairness and the Institute for Policy Studies' Program on Inequality.Story continuesThe country’s five richest billionaires — Amazon (AMZN) CEO Jeff Bezos, former Microsoft (MSFT) CEO Bill Gates, Facebook (FB) CEO Mark Zuckerberg, Berkshire Hathaway (BRK-A, BRK-B) CEO Warren Buffett, and Oracle (ORCL) Executive Chairman Larry Ellison—grew their wealth by a combined $101.7 billion, or 17.4%, the report found.Meanwhile, as of May, the unemployment rate stands at 13.3%, a drop from 14.7% in April but still far higher than the record lows that preceded the pandemic.“The private sector and CEOs have a real responsibility,” Braun says.Scooter Braun speaks onstage during the Hollywood Chamber of Commerce 2019 State of The Entertainment Industry Conference held at Lowes Hollywood Hotel on November 21, 2019 in Hollywood, California. (Photo by Michael Tran/Getty Images)Braun made the remarks in an episode of Yahoo Finance’s “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.In March, President Donald Trump signed a $2 trillion coronavirus relief package that included one-time direct checks for most Americans as well as an expansion of the top unemployment compensation a state gives to an individual by $600 per week for four months. The latter is set to expire on July 31.Congress is weighing an additional stimulus measure but Senate Majority Leader Mitch McConnell said last month it will not include an extension of the increase in unemployment benefits. Nevertheless, Democratic leaders in Congress have continued to advocate for an extension of the benefits.Speaking in general, Braun lamented the inability of political leaders to reach compromise agreements to better address the pandemic.“I don't understand how a virus in healthcare has become a political issue,” he says. “I don't understand how health is a political issue.”“I really feel at this point that our leaders need to stop worrying about just their base, and realize that we're now being put in a position by the environment — by the world, the planet — now teaching us a lesson,” he adds. “It is kicking our ass.”Read more:Fighting misinformation online is 'easier than people think': Steve BallmerBusiness leaders fear 'flaming on social media' if they criticize Trump: Fast Company Editor-in-ChiefMichael Dell: ‘Not enough’ progress on diversity in the tech industry‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}