{"article": [{"url": "https://finance.yahoo.com/news/disneys-mulan-date-decision-affects-the-entire-movie-theater-industry-173045178.html", "published": 1593088700.0, "headline": "'Mulan' and 'Tenet' date decisions affect the entire movie theater industry", "body": "Just last month, Disney looked like it had its summer movie plan all figured out: Its much-anticipated live-action remake of “Mulan” would hit U.S. theaters on July 24, after being pushed from its original March 27 theatrical release date. And Disney (DIS) would get the benefit of seeing how a competitor blockbuster fares, Christopher Nolan’s “Tenet,” scheduled for July 17 release.Disney CEO Bob Chapek even noted on the company’s Q2 earnings call on May 5, “We're going to get a pretty good idea of [moviegoer confidence] because there's a competitive movie that opens one week before our film. At that point, we’re hoping that there’s some return to a semblance of normal.”Now, as COVID-19 cases have spiked again in a number of states, plans have changed.On June 12, Warner Brothers (T) delayed the release of “Tenet” from July 17 to July 31. (It also pushed “Wonder Woman 1984” from Aug. 14 to Oct. 2.) On Thursday, Warner Brothers again pushed back “Tenet,” to Aug. 12. That leaves “Mulan” up first as the movie theater industry’s big test to see if Americans are ready to sit in a theater.Now Disney is considering pushing “Mulan” again, according to the Wall Street Journal.That would make a lot of sense, especially as Disney has just delayed the reopening of Disneyland in Anaheim, Calif., planned for July 17, after the Coalition of Resort Labor Unions planned to protest the reopening, and after California said it will not issue its theme park reopening guidance until after July 4.Disney World in Orlando, Fla., is still set to reopen on July 11, but that date is now also widely expected to get pushed.A poster of the Walt Disney Studios' \"Mulan\" movie, which was going to be released on March 27, towers over an empty Hollywood Boulevard during the global outbreak of coronavirus disease (COVID-19), in Hollywood, Los Angeles, California, U.S., March 31, 2020. REUTERS/Lucy NicholsonWhat Disney does next with regards to the “Mulan” release date will affect the entire movie theater industry. AMC last week announced it will reopen 450 of its U.S. theaters on July 15. But without “Mulan” on July 24, why reopen? The theaters would have no anchor blockbuster to show.In some ways, it now looks like a game of chicken between Disney and Warner Brothers: Neither studio wants to be the first to try a big box-office release amid the pandemic. And the reopening of movie theaters this summer is extremely controversial. When AMC first announced it would reopen theaters, it said it would not require moviegoers to wear masks; CEO Adam Aron told Variety on June 18, “We did not want to be drawn into a political controversy... if we forced mask-wearing on those people who believe strongly that it is not necessary.” The comments were roundly criticized.Story continuesIt took less than 24 hours for the company to reverse course and say it will require masks at all theaters (AMC said, “We did not go far enough”), but the damage was done.If ‘Mulan’ and ‘Tenet’ keep getting delayed, the reopening of movie theater chains will likely delay in response.Amid Disney’s multiple movie delays, some have wondered if Disney might just release “Mulan” onto Disney+ as a way to lure new subscribers. Disney already put “Onward” on Disney+ earlier than planned in April, just one month after its theatrical release, and released “Artemis Fowl” straight to Disney+ this month.But it’s unlikely to do that with “Mulan” after its last few live-action remakes were mega cash cows at the box office: “Aladdin” and “Lion King” both banked more than $1 billion last year. Disney is likely willing to wait as long as it takes, until moviegoers demonstrate their comfort, to put “Mulan” into theaters and reap the ticket sales. In the meantime, theater chains have their eyes on both Disney and Warner Brothers.This story was updated at 12:49am EST on June 26 with the latest delay of “Tenet.”—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is affecting the entertainment industry:Coronavirus puts 'extreme pressure' on all three pillars of Disney's businessDisney's 'Mulan' will look to Christopher Nolan's 'Tenet' as a movie theater health testCoronavirus is forcing Quibi, NBC Peacock to change their plans at launch'Trolls World Tour' rental success does not spell death for movie theatersMovie theaters seek bailout as coronavirus devastates business"}]}