{"article": [{"url": "https://finance.yahoo.com/news/why-black-wealth-has-stayed-relatively-flat-since-tulsa-massacre-150041181.html", "published": 1592561300.0, "headline": "Why Black wealth has stayed 'relatively flat' since Tulsa massacre", "body": "In the roughly 100 years since the Greenwood massacre and more than 150 years since the official end of slavery on “Juneteenth,” studies show little progress has been made to reduce the racial wealth gap between black and white households. While many economic, legislative, and social proposals have been made to eliminate the gap between white and Black Americans, some say that reparations is the only hope.By 1921, the Greenwood neighborhood of Tulsa, Okla., was a thriving black community. Dubbed the “Black Wall Street,” the district featured restaurants, hotels, movie theaters, grocery stores, two newspapers, and more.“It was quite extraordinary,” says folklorist and reparations scholar and author Kirsten Mullen. “There were probably few places like it in the southwest. It was held up at the time as a star.”Though the name lends itself to a comparison with the street and financial center in New York, Mullen says it does not compare to “the volume and capitalization” of New York’s Wall Street.What’s more, Greenwood wasn’t the only “Black Wall Street” in the United States. Black wealth was being created in neighborhoods around the country, in places like Durham, N.C., and Richmond, Va.But it wasn’t long before these thriving black neighborhoods were noticed, and eventually destroyed.The Greenwood MassacreJust under 100 years ago, the Greenwood district was destroyed in an event that has been called the Greenwood massacre.After accusations of a sexual assault on a white woman, Greenwood was attacked. Stores and homes were looted, and hundreds died. The neighborhood was set on fire: from the ground, and from planes dropping incendiary devices from overhead.“In the wake of the violence, 35 city blocks lay in charred ruins, over 800 people were treated for injuries and contemporary reports of deaths began at 36. Historians now believe as many as 300 people may have died,” states the Tulsa Historical Society and Museum.A memorial to Tulsa's Black Wall Street sits outside the Greenwood Cultural Center on the outskirts of downtown Tulsa, Okla. A once-prosperous section of Tulsa that became the site of one of the worst race riots in American history is attempting to remake itself again after decades of neglect. (AP Photo/Sue Ogrocki, File)Mullen’s research partner, economist William Darity said there has been a “long American history of denying and destroying” Black wealth.Story continues“There was a wave of these massacres from late 1800 until the 1940’s,” he explained. “Prosperous Black communities were essentially destroyed.”“In the year 1919 alone, there were upwards of 35 or 36 of these massacres,” he said.No progress madeBut, Darity and Mullen said, the racial wealth gap was already wide prior to the Tulsa massacre, and Black wealth has stayed “relatively flat” since.“The black curve looks relatively flat, and the white curve skyrockets upwards,” Darity said.“Historical data reveal that no progress has been made in reducing income and wealth inequalities between black and white households over the past 70 years,” according to a study from Federal Reserve Bank of Minneapolis. Examining data from 1949, the Minneapolis Fed found that “income has grown at a comparable rate for black and white households.”But, they noted, “this means that pre-civil rights era disparities have largely persisted.” Over time, the “typical” black household is “poorer than 80% of white households,” the authors wrote.This is the result of “the cumulative effect of government policy in terms of action and inaction. The federal government never intervened to address these white massacres,” said Darity.Simply put, the flatness of black wealth over time “is the result of American public policy,” he said.Darity noted that reliable data on black wealth only extends as far back as 70 years, but points to the Homestead Act of 1862 as the beginning of economic disparity between Blacks and whites in the country.At the end of the Civil War, while freed slaves were denied their promised 40 acres and a mule, he said, whites were given hundreds of acres of free land.Destruction of black wealthOver the course of the next century and a half, black communities were systematically destroyed through massacres or through the policy of urban renewal, that razed communities to make way for highways or luxury buildings and shops.In some instances, Mullen said, these public works projects were never even started.In the late 19th century, “land was a major source of wealth,” Darity said. “Particularly for folks with middle-income status.” By the 20th century that source of wealth changed — to homeownership.Denied access to land before the turn of the century, Black households were then subject to racist policies of redlining, contract buying, and land devaluation.While not the sole predatory policies that plagued the black community, these real estate-based discriminatory practices robbed and denied Blacks in the country of billions.Redlining ensured that Blacks couldn’t purchase homes in white neighborhoods, systematically denying families mortgages, home insurance, or loans. The practice derived its name from the red line drawn on maps demarcating areas where African Americans lived. Banks would then justify the practice, deeming neighborhoods that had redlined at a “higher risk” for default.Division of opinions in Chicago. White children play ball in street just west of Ashland as an African American family passes. White homeowners to west of Ashland have formed block clubs, designed to keep the neighborhood white. (AP Photo/JLP)And when black families went to purchase a home, many fell prey to the practice of contract buying. The scam allowed a home seller to deny a buyer ownership of a home until the home was purchased in full. The buyer would first put down a large down payment, and then make high interest monthly payments. But until the home was purchased in full, the seller held the deed and could evict the buyer at any time. The buyer never accumulated equity in their homes, and no laws protected them.Once a home was purchased, many African Americans have found their assets to be routinely undervalued, despite structural characteristics and neighborhood amenities that are comparable to white-owned homes nearby.These practices were deemed illegal and discriminatory over 50 years ago with the Fair Housing Act, but the impact remains today.According to the Joint Economic Committee (JEC), “much less than half (42%) of Black families own their homes, compared to almost three-quarters (73%) of White families.”ReparationsIn total, these policies over the last century and a half since the Civil War’s end have had the cumulative effect of the depletion of Black wealth.The JEC has noted in their 2020 study that African Americans experience poverty and unemployment rates that are twice that of their white counterparts, lower life expectancies, and have less than one-tenth the median wealth of whites.But how to undo centuries of racist policies designed to prevent African Americans from accumulating wealth?Both Darity and Mullen, authors of the book “From Here to Equality: Reparations for Black Americans in the Twenty-First Century,” say that reparations is the only way.Without it, Darity paints a fairly bleak picture on the ability of African Americans to achieve equality. “Black Americans cannot eliminate the racial wealth gap with their autonomous actions, and with their existing resources,” he said.And as President Trump plans to hold his political rally in Tulsa on June 20, the threads of the Greenwood Massacre carry through today.After Tulsa, “whatever momentum Black Americans were building that might have contributed to some closure of the wealth gap was immediately demolished,” Darity said.Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:Former Obama advisor Valerie Jarrett talks protests, defunding police, and criminal justice reformCoronavirus pandemic could wipe out Social Security 4 years earlier than predicted: Wharton ModelTrump’s ‘Operation Warp Speed’: No way it happens, says infectious disease expertRepublican states to see biggest economic boosts from reopening amid coronavirus crisisOver 4 million in US will contract coronavirus if states fully reopen: Wharton modelGreatest increases of COVID deaths projected in Republican statesRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}