{"article": [{"url": "https://finance.yahoo.com/news/uber-eats-is-now-bigger-business-than-uber-rides-but-far-from-profitable-192154010.html", "published": 1597156160.0, "headline": "Uber Eats is bigger business than Uber rides right now, but far from profitable", "body": "Uber (UBER) released its second-quarter 2020 earnings last week, and as expected, ride bookings plummeted amid the pandemic as people continue to stay home. Mobility bookings, the core division that includes ride-hailing, fell by 73% compared to Q2 2019, and mobility gross revenue fell 67% to $3.05 billion. Uber overall lost $1.8 billion in the quarter.Uber Eats was a very different story. Delivery bookings in Q2 grew 113% from a year earlier, and delivery gross revenue grew 103% to $6.96 billion.The big takeaway: Uber Eats was more than double the size of Uber’s rides business in the quarter.As the pandemic drags on, these trends are expected to hold for at least a while longer, with fewer people hailing Uber rides to go out and more people ordering takeout meals from Uber Eats.There’s just one big problem with the trend: profitability.Uber Eats and Glovo delivery couriers with bicycles cross a street amid the outbreak of the coronavirus disease (COVID-19) in central Kiev, Ukraine May 13, 2020. REUTERS/Gleb GaranichEven though rides revenue fell 67% and missed Wall Street expectations, Uber’s mobility business was profitable in Q2, generating positive adjusted EBITDA of $50 million. Rides have in fact been profitable for Uber for five quarters, on an adjusted basis. The delivery business, on the other hand, lost $232 million.Uber had a 6.3% profit margin on rides, while delivery loses money. That’s why adjusted net revenue for the two divisions was much closer than gross bookings: $793 million for mobility and $885 million for delivery.For reference, Lyft (LYFT) reported a Q2 EBITDA loss margin of 82.6%, up from 23.5% in Q2 2019. While Uber’s rides are becoming more profitable, Lyft’s losses from rides are growing.From page 12 of Uber's Q2 2020 earnings presentationThe margins for delivery are “certainly worse than the mobility part of the business,” says Morningstar analyst Ali Mogharabi. “Uber needs more time to deliver positive EBITDA on the delivery part of the business.”But Mogharabi is optimistic that consolidation in the food delivery space will help all the major players get to profitability. Uber’s acquisition of Postmates, he says, “will actually not just help Uber, but the overall space, because the more consolidation that you have in that space, the more likely it is that you will see pricing stabilization, which we actually saw in the mobility business about a year and a half ago. With more pricing stabilization, that helps the three top companies—DoorDash, Uber, and GrubHub—to actually generate additional operating leverage, which will hopefully in the future lead to profitability.” (DoorDash, aiming to go public in 2020, lost $450 million in 2019.)Story continuesFrom page 13 of Uber's Q2 2020 earnings presentationUber has previously said it expects to achieve overall profitability by the end of 2020. It made that call on the growth, and improving margins, of its rides business. In the first quarter 2020, mobility generated more bookings, bigger revenue, and bigger profit than delivery. For Q2, due to the brunt of the pandemic, delivery overtook rides for bookings and revenue. But if Eats continues to overshadow rides, it will slow Uber’s path to profitability.Morningstar expects ride bookings to return sooner than later, and Eats orders to settle back down. “Once a recovery takes place, post-pandemic,” he says, “you probably may not see as much strength ongoing on the delivery side of the business, while at the same time you will see some improvement on the mobility side of the business.”Uber has to hope so, even as it continues to grow its footprint in the very crowded delivery app space.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Etsy CEO on huge Q2: Etsy is 'becoming much more mainstream'Facebook ad boycott is ‘more noise than fundamental risk’Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’Goya Foods faces consumer boycotts after CEO praises TrumpAmazon extends its deal to stream NFL games, even with next NFL season in doubt"}]}