{"article": [{"url": "https://finance.yahoo.com/news/peter-cecchini-on-market-outlook-183909229.html", "published": 1593524840.0, "headline": "A V-shaped recovery in 2020 earnings is 'far from certain': Strategist", "body": "A veteran global markets strategist believes that investors aren’t taking into account the appropriate risk reward in equities, which have mostly defied the gravity of spiking coronavirus cases.Major benchmarks are poised to end the month with modest gains, but are a distance away from the grim lows reached months ago. The S&P 500 (^GSPC) and Dow (^DJI) were on track to post gains of less than 1% for June, while the Nasdaq (^IXIC) was pacing for a monthly advance of more than 4%.“One thing we have to keep in mind and be vigilant about is risk versus reward,” Peter Cecchini, the founder of AlphaOmega Advisors, told Yahoo Finance.He pointed to stretched valuations of indices, some of which are trading at “nosebleed multiples,” and have rallied strongly since hitting a multi-year bottom in March.“The S&P, for example, it’s trading around 25-times forward earnings, forward 2020,” and the broader Russell 2000 (RUT) index also looks rich, Ceccini said.“And, so, really, the only way one can justify from a valuation standpoint buying equities at those levels is to believe 2020 earnings are going to experience a V-shaped recovery,” he added. “And, I think, frankly, that’s far from certain.”The S&P is on track for its best quarter since 1998, leading up to the dot-com bubble crash. With the quarter ending on Tuesday, the index has now gained more than 18% in the last three months.Cecchini is of the view that the rally has been largely retail-driven, with newbies opening up new brokerage accounts and likely possibly putting government stimulus checks into the market.In his first “Check In with Cecchini” note on June 12, the strategist declared “The Portnoy Top.” That was a reference to Barstool Sports founder Dave Portnoy, who’s taken up day trading and posted viral videos — including one where he called legendary investor Warren Buffett “washed up.”“I think the flows and the data show quite clearly, there is a sort of new cadre of traders in the retail space that are very important to the way markets are behaving now, perhaps in a way they haven’t been just prior to the off the top in 2000,” Cecchini said.Story continuesCecchini is of the belief that the market’s recovery is actually a bear market bounce, and it’s a “wait-and-see” moment for investors.“Risk-reward is unfavorable to equity investors here. The next shoe to drop, frankly, is that defaults are going continue to increase, especially in High Yield and speculative-grade loan markets,” Cecchini added, predicting that corporate rate defaults could increase “perhaps up to 10%.”“I think the high yield market will trade lower, meaning spreads will go wider. It think there is more pain yet to be felt by high yield companies,” he said.“I think that eventually bleeds back into the real economy through slower corporate profits and through payroll reductions,” the investor added.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobs"}]}