{"article": [{"url": "https://finance.yahoo.com/news/heres-what-president-joe-biden-means-for-markets-business-and-america-120038406.html", "published": 1592636900.0, "headline": "Here's what Joe Biden means for markets, business and America", "body": "I say Joe Biden has a 50% chance of getting elected in November and if you buy that impartial fact, then it’s probably a good idea to understand what a Biden presidency means for the economy, markets and business.This is no small thing.If he wants to win, Biden has 136 days to convince the electorate that he can best manage the economy. The candidate has some work to do. While the former Vice President leads in national polls, according to a recent Reuters/Ipsos poll 43% of registered voters said they thought Trump would be a better steward of the economy than Biden, against 38% who said Biden would be better. And a late-May Washington Post-ABC News survey said those polled trusted Trump and Biden in nearly equal measure to oversee the economic recovery. At the very least, Biden does not appear to have an advantage when it comes to economics.None of this is lost on Biden’s advisers. Presiding over a recovery would likely be by necessity the centerpiece of his presidency. A source tells me that his campaign will have a more refined economic plan in the coming days and that making Biden’s case versus Trump’s when it comes to the economy and jobs is a case they aim to make clear.Here’s what Penny Pritzker, former U.S. Commerce Secretary and adviser to the Biden campaign told me yeasterday, which might serve as a fundamental talking point: “Joe Biden will be a good president for jobs and good for the middle class. He will build on inclusive growth. For the next couple of years we need to rebuild jobs, we need to help businesses reopen. Joe Biden will bring us greater certainty, clarity, and stability to our economy.”\"The Vice President believes we need bold investment in job creation, substantial investment in workers and working families to ease their burdens and raise their wages, and we need to hold corporations accountable—having now bailed them out twice in 12 years—to be more responsive to their workers and their communities,” says Jake Sullivan, a senior policy adviser with the Biden campaign who works extensively on economic policy. “He sees this as a bold agenda that meets the moment when you've got both an immediate crisis that needs to be continually responded to and you’ve got deep structural challenges in the economy laid bare by COVID-19 and with ambitious action can be remedied. That’s how he’s thinking about his agenda next year.\"Story continues(Note two ‘bolds’ and one ‘ambitious.’)And in a recent speech at Delaware State University, Biden said that he aimed to “not just to build back the economy the way it was before COVID-19, but to build it back better.”Democratic presidential candidate former Vice President Joe Biden speaks Wednesday, June 17, 2020, in Darby, Pa. (AP Photo/Matt Slocum)And of course the GOP punched back: “Sadly, Democrat leaders in blue states have kept the economy from reopening for all Americans, preventing everyone from sharing in the economic rebirth as the people most heavily impacted by COVID are not yet seeing improvement. Incredibly, Joe Biden is counting on more economic pain for Americans so he can capitalize on it politically,” said Brad Parscale, Trump 2020 campaign manager, in a statement.(Hey, it’s an election year, right?)To really dig in here, let’s look at Biden and the economy from three vantage points. First, what is Biden’s personal experience when it comes to business? Second, what is his track record as a politician and what is he proposing now? And third, what will the economy look like next January, and what challenges and opportunities will he be confronting, which would inform him of what he might actually implement?First, unlike Donald Trump or Bush the elder and the younger, Joe Biden has never really been a businessman. The closest Biden got to the private sector was in the 1960s out of Syracuse University law school when he worked as a trial lawyer and public defender in Delaware. And according to Washingtonian Magazine, Biden “supplemented his income by managing properties, including a neighborhood swimming pool.” Not exactly the Trump Organization. On the other hand, there’s no record of bankruptcies.It’s also worth noting that Biden’s father’s family had some money sloshing around. Biden’s father, Joe Biden Sr., initially was successful in business, but later had his ups and downs, which Biden frequently references in speeches. Biden Sr. worked as a salesman and manager at the American Oil Company—a predecessor of Amoco—in Delaware and Pennsylvania, but later had trouble finding work and sold used cars to stabilize the family P&L. But the elder Biden changed his career again after his son was elected U.S. senator from Delaware. Biden’s sister Valerie Owens told the New York Times: “After 1972, he gave up car sales and went into real estate,”Owens said. “He didn’t want a United States senator to have a used-car salesman for a dad.”Bottom line: Biden grew up decidedly middle class, but his father’s mixed success has impacted this thinking.Next let’s consider Biden’s record when it comes to business and the economy and markets.As a U.S. Senator from Delaware, Biden has certainly been pro-business, which is not surprising as so many big U.S. companies incorporate there because of the business-friendly legal environment. And Biden hasn’t exactly gone to war with that status quo. He also championed the local banking industry, in particular, MBNA for which he earned the headline: The Senator from MBNA. (To be fair, I suppose advocating for one’s constituents is part of what an elected official does.)None of this is lost on Republicans. “We've got Joe Biden, who basically lived out of a post office box in Delaware where multinational corporations send jobs freely offshore, many of them to China,” Assistant to the President, Director of Trade and Manufacturing Policy Peter Navarro told me.Which isn’t to say Biden has unilaterally kowtowed to big business. Biden has supported environmental legislation—often counter to the interests of big business—ditto for the Affordable Care Act and light rail.Biden is also widely perceived as pro-union—he has a 85% lifetime approval rating from the AFL-CIO—and has garnered strong support from organized labor. He frequently cites his hard-scrabble(ish) upbringing in Scranton as giving him union(ish) cred. In fact Biden does have an impressive roster of union endorsements including the AFL-CIO—with 12.5 million members, the nation’s largest—the Teachers union and the Steelworkers. Still it should be noted that Trump has some support amongst the rank and file. And there are those on the left wing of the Democratic party who say that Biden hasn’t really ever gone out on a limb for unions. Bottom line: Biden is pro-labor all right, but he’s no Eugene V. Debs.And what is Joe Biden proposing? Well, if you go to his campaign’s website under Joe’s Vision, you find 37 tiles of Biden’s plans for society and the economy including one for small business—which entails tweaking and expanding the existing PPP—and others for health care and employment insurance, bankruptcy reform and essential workers, (along with other positions including those on Muslim-Americans, immigration, two on Black Americans, women and opioid addiction.) Perhaps his most extensive is a massive infrastructure plan that would cost $1.3 trillion over 10 years to rebuild or build our highways, airports, rail and broadband.You could make the case that the stock market is sanguine about Biden’s platform and a potential victory or at least it doesn’t seem to be too worried, given that the chances of him winning have been rising—now 53% versus Trump at 41%, according to predictive market website Smarkets—along with the S&P 500 index as of late. Perhaps that comes as a surprise given Biden said he would roll back a portion of Trump’s corporate tax break, upping the rate to 28%, from 21% which would reverse half of the cut, from 35%, that was enacted by President Donald Trump in late 2017. (Truthfully though, the market’s probably been going up for a number of reasons.)JPMorgan posited that the best case for the markets would be if Biden wins and the Republicans hold on to the Senate. In that scenario, there would be an end to capriciousness and worrisome policy particularly when it comes to China and the rest of the world that some say currently emanates from 1600 Pennsylvania Avenue, while the Senate would hold the Democrats more liberal leanings in check.Who’s counsel has Joe Biden been seeking? According to a recent New York Times article that's hard to say, as the candidate has sought input from dozens of left-leaning economists, but asks that they not disclose that they have been advising the candidate. Biden is reportedly interested in addressing the wealth and income gap. He’s also sought to include thinking from the younger and lefter half of the party—i.e. AOC, Bernie and Warren—not just the Larry Summers, Gene Sperling, Austan Goolsbee warhorses.‘It’s going to take a bold agenda to pull us through’But Biden’s loftier goals might be rendered moot come January 20, 2021, his potential inauguration day, if the U.S. is a total mess. Not that this would be unfamiliar ground. Biden would be taking office under the same lousy economic conditions he did as Barack Obama’s vice president 12 years ago, when the unemployment rate was 7.6% and 11.6 million Americans were without jobs. (Contrast that with 13.3% and 20 million today.) “During the Great Recession, [Joe Biden] led the $800 billion stimulus effort by the Obama administration. So he's been a leader during an economic recovery before,” notes Pritzker.“Given that we will still likely be in a crisis, Joe Biden may find he will be doing more of what he has to do, versus what he wants to do,” says Glenn Hutchins, CEO of North Island and a long-standing Democratic thought leader. First Hutchins notes, as Barack Obama had to continue rescue operations commenced by George W. Bush during the 2008 Great Recession such as TARP and the auto bailout, Biden will likely have to continue some of the current administration’s policies such as stimulus packages, PPP and the like.Then, Hutchins notes, a whole new medical infrastructure will have to be built out—especially if President Trump doesn’t see fit to do so—in terms of contact tracing, PPE and equipment, protocols, therapeutic drugs and especially vaccines to finish off COVID-19 and to prepare for the next pandemic. Done right, this could help stimulate all sorts of new businesses. This medical build-out could be done initially in conjunction with reopening the economy, for which Biden recently released a plan that includes, “federally funded testing for every worker called back on the job, guaranteed paid sick leave for workers affected by COVID-19 and a federally coordinated contact tracing workforce,” according to NPR.It’s also likely that some states and municipalities will be in pretty bad shape and in need of more funding from the federal government. Some of this could take the form of that medical spend, as well as badly needed infrastructure which is typically done at the state level. “The Democrats very, very strongly think they’ve got to give money to states, otherwise you’ll see another mass wave of unemployment as the states with balanced budget requirements have to start raising taxes and firing people,” says the aforementioned Goolsbee, former Council of Economic Advisors Chairman under Barack Obama speaking yesterday on Yahoo Finance’s YFi PM.“The challenge we’re up against is significant, and it’s going to take a bold agenda to pull us through over the course of who-knows-how-many years. [Biden has] indicated he’s prepared to do that,” says Stephanie Kelton, a professor of economics at Stony Brook University and member of the joint task force on the economy created by former Vice President Joe Biden and Vermont Senator Bernie Sanders.Still if Joe Biden is elected he’ll have to be extremely judicious when it comes to government spending because our current national debt of $17.7 trillion is 82% of GDP, the highest it's been since 1948, according to the nonpartisan Peter G. Peterson Foundation. “The Vice President doesn't believe this is a moment for austerity but does believe the president has to be a steward of the long term fiscal health of the country. He has to pay attention to debt over the long term,” says Sullivan. “But he believes a bigger threat to the country’s fiscal health would be elevated unemployment for years on end.\"Biden may be thinking beyond that. “The Vice President believes that getting back to the economy that preceded the current crisis would be woefully insufficient,” says Jared Bernstein, a senior fellow at the Center on Budget and Policy Priorities and former chief economist and economic adviser to Vice President Joseph Biden in the Obama Administration, who’s been advising candidate Biden. “There needs to be a much more robust policy infrastructure in place that insulates working families against the kind of shocks that come fast and furiously these days, whether they’re pandemics or 100-year floods that happen every year or the ravages of inequality or racial violence, or a health care system that is unresponsive to needs.”Says Sullivan: \"Young people need to be the focus, particularly making sure they’re attached to the labor force and get a start in their careers quickly. They bore the brunt of the last recession and he’s bound and determined they don’t bear the brunt of this one.”“Frankly Biden is being handed a gift here—by the people in the streets, by this moment, to be the kind of president he’s describing,” says Sara Nelson, president of the Association of Flight Attendants-CWA and co-chair of the Biden/Sanders task force.If Joe Biden does win in November, it’s not clear that he would see the environment as gift-like. On the other hand, if Biden takes office when the economy is on low, maybe he gets out when it's on high. Better than the opposite, right? President Trump is looking to avoid that.This article was featured in a Saturday edition of the Morning Brief on June 20, 2020. Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAndy Serwer is editor-in-chief of Yahoo Finance. Follow him on Twitter: @serwer.Read the latest financial and business news from Yahoo FinanceRead moreBillions or trillions: The great coronavirus trade-offHow this week changed America foreverWhat America can learn about reopening from the state of MaineWhat will everything look like after the coronavirusHere’s how the coronavirus divides usThe crazy story of Purell and the coronavirusThree important forces, working in concert, we can't controlWhat will the coronavirus do to cruise ships"}]}