{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-florida-spike-raises-doubts-over-reopening-strategy-mask-debate-gets-more-political-151132999.html", "published": 1592561960.0, "headline": "Coronavirus update: Florida spike raises doubts over reopening strategy; mask debate gets more political", "body": "Florida became the focus of rising fears it could become the next U.S. coronavirus hotspot, with surging cases in the West and South leading to increased safety measures, and fanning doubts about nationwide plans to reopen.Globally cases have surged past 8.5 million, and more than 454,000 have died. In the U.S. nearly 2.2. million cases have been reported, and more than 118,000 are dead. On Friday, the Sunshine State reported a rise in COVID-19 cases of 4.4%, sharply higher than the previous 7-day average of 3.2%.The relentless climb in domestic cases prompted California’s governor to require mask-wearing in public, while Texas and Arizona recently began to ok enforcing masks in public, amid a spike in new diagnoses in those states.Meanwhile, the economy has sent mixed signals about the trajectory of a recovery, according to Morgan Stanley data, underscoring volatility in markets hopeful for a “V-shaped” rebound.“We note a continuous upward inflection in eating out in restaurants to 26% (from 17% two weeks ago), mainly driven by the South region and rural areas. Visits to the mall, albeit still low, are up to 13% from 8% a month ago,” the bank wrote on Friday.There are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Political debate over masksAs the debate over wearing face coverings in public gets increasingly political, critics point out that several areas have been lax with mask and distancing measures. The mask controversy — which took center stage in a debate over President Donald Trump’s weekend rally in Tulsa — is rooted in a perceived infringement on individual freedom, and disputed claims about face masks reducing the intake of oxygen.Yet public health experts point to the success in New York and New Jersey, two former epicenters that are now relaxing stay-at-home orders, in implementing such measures to control the outbreak.Public health experts expressed concerns with AMC’s (AMC) plan to reopen theaters without enforcing masks Thursday. The company’s CEO explained he wanted to avoid the politically controversial topic of mask-wearing — a decision that sparked more debate.Story continuesThe company reversed the decision Friday, announcing in a statement that moviegoers will be required to wear masks.Dr. Ashish Jha, director of Harvard’s Global Public Health Institute, said on Twitter the politicizing of masks will create more confusion and a “dilemma” for businesses eager to return to normal.“It may feel easier to let customer choose. But long run success requires companies courageously undertake evidence-based actions that keep customers safe,” Jha said.Separately, Japan has lifted all coronavirus restrictions for businesses, marking another country’s full reopening this month. The country has had fewer than 100 cases daily in the past month.Vaccine coverageChina appeared to gain a leg up in the worldwide race for a COVID-19 vaccine, announcing on Friday that one of its pharmaceutical companies could begin the next phase of human tests as early as the fall.Senior U.S. government officials said this week that any successful COVID-19 vaccine was likely to be free to “vulnerable” individuals who can’t afford them.In addition, health plans are likely to cover at no cost to members— similar to the coverage of testing and inpatient services, which has seen bills as high as $1.1 million settled between insurers and funding from Congress.Vulnerable individuals, those without insurance or on Medicaid, belong to a largely underserved population. Some providers refuse to accept Medicaid because of its traditionally low reimbursement for care.The CARES Act has provisions, along with the preventative coverage mandates of the Affordable Care Act, that could address some pockets of accessibility. The bill includes language “to cover (without cost-sharing) any qualifying coronavirus preventive service” for commercial insurers.For Medicare, in addition to the flu vaccine, the law now includes “COVID–19 vaccine and its administration,” and for Medicaid, states are required to cover “any testing services and treatments for COVID– 19, including vaccines, specialized equipment, and therapies” without cost-sharing.But it still leaves out self-insured and uninsured — which make up more than half of the U.S. population. At least 56% of the population is on self-insured plans, which have had the option to cover. members’ COVID-19 testing and hospital visits during the pandemic.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}