{"article": [{"url": "https://finance.yahoo.com/news/airbnb-has-been-brutalized-by-the-pandemic-but-will-ipo-anyway-in-forgiving-market-153236640.html", "published": 1597856960.0, "headline": "Airbnb has been brutalized by the pandemic, but will IPO anyway in 'forgiving' market", "body": "The second quarter of 2020 was brutal for Airbnb: revenue fell nearly 70% year over year to $335 million, according to Bloomberg, and Airbnb’s losses ballooned to $400 million, after it lost $340 million in Q1.Unsurprisingly, staying in a stranger’s home is not as appealing during a global pandemic. Airbnb now carries a valuation of $18 billion, down from $31 billion before the pandemic. The home rental startup’s business model is not suited to America’s new normal.But Airbnb would like to go public this year anyway. And on Wednesday, the company confidentially filed its IPO papers with the SEC.Airbnb executives, employees, and investors are ready for their big liquidity event, and they’re betting that public market investors will want in, despite the recent troubles.It’s a good bet. The market has been extremely patient over the past few years with money-losing Silicon Valley unicorns, focusing instead on their narrative and future growth runway. It’s why you hear so much from tech unicorns about their TAM, or total addressable market.“As we look at the second half of this year, we see a lot of these companies that might have gotten hit with the Covid downturn, but if they have that narrative around how they’re going to come out of this, and what that looks like going forward, the public markets are being more forgiving,” says Jack Cassel, VP of new listing and capital markets at Nasdaq. “They’re buying into the story, the management team, and the vision of the company for the long-term.”Brian Chesky, CEO and Co-founder of Airbnb, speaks to the Economic Club of New York at a luncheon at the New York Stock Exchange (NYSE) in New York, U.S. March 13, 2017. REUTERS/Mike Segar“When you think of some of the unicorns that have remained private for so long, they’re very smart about telling their story early in their life cycle,” he said. “They’re meeting with analysts, they’re meeting with buy-side investors, large institutional firms, starting to test their narrative.”Airbnb has certainly told its narrative well over the past few years. The origin story is by now well-worn: Brian Chesky and Joe Gebbia, friends from Rhode Island School of Design, had the idea in 2007 to rent out their San Francisco apartment during a big design conference in town. They bought three air mattresses and called the site AirBedAndBreakfast.com. Their friend Nathan Blecharczyk joined them as the third cofounder. The company’s rapid growth is often credited in part to its appealing web design.Story continuesThe home-sharing company became part of the travel culture for young people, a legitimate threat to traditional hotels, and a prime example, along with Uber and Lyft, of the meteoric rise of the sharing economy—before the pandemic.By going public at a time when its business is severely weakened, Airbnb is taking the same tack as DraftKings, which went public in April (by merging with an SPAC) even though live sports, which its entire business depends on, were completely shut down. DraftKings simply kept saying that its business would return in full force as soon as sports returned. CEO Jason Robins told Yahoo Finance in April that the sports pause was “a temporary thing... people will be eager to reactivate when sports do come back.”Airbnb is making the same pitch: Our business will come back when things return to normal. But there’s a key difference: major U.S. sports like the NBA, MLB, NHL, and Major League Soccer have returned to play, and even though they’re playing without fans in the stands, DraftKings users can play fantasy contests or place bets on the games in states where it’s legal. Vacations have not fully returned to normalcy, and it could be many months until they do.Despite mounting losses, Airbnb reportedly plans to IPO this year. (Photo by Yuriko Nakao/Getty Images)In an interview with Yahoo Finance editor in chief Andy Serwer last month, Chesky said that back in January he fully expected Airbnb to go public in 2020, “and then suddenly all global travel basically comes to a near standstill. We took the S-1 document and didn’t file it, we put it on a shelf. And recently, we’ve dusted it off... But we also don’t want to go public if the world’s not ready for us. If people are really nervous about travel, they aren’t really clear about Airbnb, then the market’s not ready.”By many data points, Americans are indeed still “nervous about travel.” But Airbnb did see a return to bookings growth in July, and that was with “spending very few dollars on advertising,” Chesky told Yahoo Finance. It helps the company’s case that its business can return... eventually.Of course, Airbnb isn’t the only company trying to go public before the end of this year, and likely aiming to get it done before the market volatility the election could spark. July saw 43 IPOs begin trading in the U.S., the highest July tally since 2014.—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers tech. Follow him on Twitter at @readDanwrite.Read more:Uber Eats is bigger business than Uber rides right now, but far from profitableEtsy CEO on huge Q2: Etsy is 'becoming much more mainstream'Apple has less to fear from antitrust regulators than Facebook, Google, and AmazonFacebook ad boycott is ‘more noise than fundamental risk’Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’"}]}