{"article": [{"url": "https://finance.yahoo.com/news/this-week-in-trumponomics-assessing-president-biden-200248280.html", "published": 1593184220.0, "headline": "This week in Trumponomics: Assessing President Biden", "body": "President Trump is officially the underdog in the 2020 elections.Before the coronavirus arrived, Trump’s reelection bid looked reasonably solid. Unemployment was extremely low, incomes were rising and the stock market hit one record high after another. Many voters who didn’t like Trump personally could still say they felt better off under him. And as the 77-year-old Joe Biden emerged as the Democratic nominee, Trump faced a gaffe-prone opponent who arguably maked the 74-year-old incumbent seem young by comparison.Now, however, Trump is in the worst skid of his presidency, with reelection slipping away. Trump’s faltering handling of the coronavirus crisis and the patchy efforts to control it by governors and mayors has pounded Trump’s approval rating and turned swing voters against him. A New York Times poll this week placed Biden ahead of Trump by 14 points nationwide, the widest lead so far for Biden in any major poll. More troubling for Trump, Biden leads in six swing states by margins ranging from 6 to 11 points. Trump won all those states in 2016 he can only lose a couple in 2020 if he wants a second term.Investors and economists are beginning to make a Biden victory in November their baseline forecast, while assessing the impact of a change in power on stock values and the economy. “Biden now the front runner,” forecasting firm Capital Economics announced in a note to clients on June 26. Since Biden favors tax hikes, new spending programs and the rollback of some Trump initiatives, there could be important changes.Trump derides the former vice president as “Sleepy Joe,” but Trump is the one looking sleepy at the moment. His refusal to implement a muscular national coronavirus testing plan is contributing to rising caseloads in states such as Texas and Florida and almost surely prolonging the downturn. He’s offering no vision for a second term except warnings of doom if “radical Democrats win.” Biden is surging ahead of Trump not because of love for Biden—who’s running one of the least visible campaigns in memory—but because Americans are losing confidence in Trump.Story continuesFor voters who support Biden, this is good news. But the path to a Biden presidency goes through a debris field of viral illness economic damage that doesn’t need to happen, which is why this week’s Trump-o-meter reads SAD, the lowest official rating.Source: Yahoo FinanceOn CNN this week, Nobel-winning economist Paul Romer said that “if we rolled out a massive testing program, this pandemic would be over before the election.” The idea is that nearly everybody returning to a workplace should be tested—perhaps as often as weekly—to identify who’s infected and quarantine them, so they can’t infect others. This would sharply reduce the portion of infected people in crowded places and drastically cut community spread.We’re not doing that. Instead, Trump says he wants to cut back on testing so the count of confirmed cases is lower, which is folly. While Trump fiddles on testing, the US death toll has reached 125,000, and forecasters at the University of Washington have raised their forecast of total US deaths from around 60,000 two months ago to 179,000 by October 1.The virus is all but certain to be a formidable presence on Election Day in November. It looks like it’s Trump’s presidency that will be ending come November.Coronavirus cases are soaring in the Sun Belt, forcing governors in Texas and Florida to close bars and reverse prior easings of lockdown restrictions. For some reason, a solid minority of Americans rejects the idea of wearing a mask in public. Maybe because the president of the United States refuses to. Their foolhardiness is harming the country and threatening to end Trump’s political career. Biden hasn’t won yet, but more and more people are acting as if he has.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Trump is no longer the best candidate for businessWhy you’re not hearing about Biden’s economic planElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}