{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-10-2020-221715029.html", "published": 1591802000.0, "headline": "Stock market news live updates: Stocks trade choppily after Fed decision", "body": "Stocks traded choppily as market participants digested the Federal Reserve’s latest monetary policy decision and outlook for the economy over the next several years.[Click here to read what’s moving markets heading into Thursday, June 11]Members of the Federal Open Market Committee announced Wednesday their unanimous decision to keep benchmark interest rates on hold near zero, noting that the ongoing coronavirus pandemic “poses considerable risks to the economic outlook over the medium term.” This decision had been widely expected by investors, with the low rates a major component of the central bank’s wide-ranging efforts to stimulate borrowing and lending in the virus-stricken economy.The Fed also included an updated summary of projections, which showed the median member of the Federal Open Market Committee saw GDP falling by 6.5% in 2020 before rising by 5.0% in 2021. Central bank officials’ median projection also showed rates would likely hold near zero through 2022. However, during his press conference following the decision, Federal Reserve Chair Jerome Powell noted that there was still a “high level of uncertainty about the outlook.”Earlier, the Nasdaq Composite rallied to a fresh record high, rising above 10,000 after first breaking above that level a day earlier. The big-tech FAANG names added to gains, with each of Amazon (AMZN), Apple (AAPL) and Microsoft (MSFT) rising after posting record closing highs on Tuesday.Shares of cyclical companies that had led the recent equity rally fell Tuesday and extended losses on Wednesday. Airlines including American Airlines (AAL) and United Airlines (UAL) along with leisure stocks Wynn (WYNN) and Norwegian Cruise Lines Holdings (NCLH) sank. Car-rental company Hertz (HTZ) – which had posted a stunning advance of 521% between June 1 and Monday’s close – extended declines, as investors abruptly halted a rally in the bankrupt company’s stock that had been driven in part by hopes of a quick economic reopening.Story continuesStill, reopening remains front and center both for investors and policymakers. New Jersey Governor Phil Murphy said Tuesday he was ending the state’s stay-at-home order. The decision came a day after New York City kicked off its first phase of reopening, joining much of the rest of the state and country in helping drive renewed economic activity as new Covid-19 cases abate. Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told Yahoo Finance that he was working with the White House coronavirus task force to focus on states safely reopening at this point, after previously emphasizing flattening the curve in virus transmission.Other areas of the market underscored investors’ rising optimism for equities as social distancing measures ease. Namely, very newly public companies performed strongly again on Tuesday, with shares of Tesla-competitor (TSLA) Nikola (NKLA) rising another 8.8% after doubling on Monday, though the stock pared gains in early trading. Shares of Vroom (VRM), the online auto-selling platform, closed out its first day of trading on the Nasdaq Tuesday at more than double their IPO level.—4:03 p.m. ET: Stocks end mixed after Fed signals rates likely to hold near zeroHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -17.04 (-0.53%) to 3,190.14Dow (^DJI): -282.31 (-1.04%) to 26,989.99Nasdaq (^IXIC): +66.59 (+0.67%) to 10,020.35Crude (CL=F): +$0.14 (+0.36%) to $39.08 a barrelGold (GC=F): +$27.50 (+1.60%) to $1,749.40 per ounce10-year Treasury (^TNX): -8.1 bps to yield 0.7480%—2:44 p.m. ET: Stock turn around, S&P 500 and Dow dip back into the red during Powell press conferenceThe S&P 500 and Dow fell back into negative territory Wednesday afternoon as Federal Reserve Chair Jerome Powell delivered his press conference following the Fed’s rate decision.—2:16 p.m. ET: Stocks rise after Fed decisionHere were the main moves in markets as of 2:16 p.m. ET:S&P 500 (^GSPC): +12.13 points (+0.38%) to 3,219.31Dow (^DJI): +54.05 points (+0.2%) to 27,326.35Nasdaq (^IXIC): +119.92 points (+1.21%) to 10,074.48Crude (CL=F): +$0.64 (+1.64%) to $39.58 a barrelGold (GC=F): +$6.40 (+0.37%) to $1,728.30 per ounce10-year Treasury (^TNX): -5 bps to yield 0.779%—2:04 p.m. ET: Stocks turn slightly positive after FOMC members project rates will stay on hold through 2022Each of the three major indices turned slightly positive Wednesday afternoon, with the S&P 500 and Dow joining the Nasdaq in the green after the Federal Reserve issued its latest monetary policy decision and updated summary of its economic projections, which showed most members expected rates would stay on hold near zero through 2022. Treasury yields fell across the curve.The Fed’s new economic projections showed most members of the Federal Open Market Committee (FOMC) supported a decision to keep the benchmark federal funds rate at the current target band of between 0% and 0.25% through 2022.The median FOMC member expected to see real GDP contract by 6.5% in 2020, with an unemployment rate at 9.3%. However, policymakers expected real GDP to rebound by 5.0% in 2021, with an unemployment rate dropping to 6.5%.—11:20 a.m. ET: Starbucks drops after forecasting more than $2 billion drop in operating income due to Covid-19Starbucks (SBUX) shares fell 4% in intraday trading after the company said it expected current-quarter operating income would decline by about $2.2 billion due to coronavirus-related store closures and other disruptions. Sales could fall by as much as $3.2 billion during the quarter, Starbucks said.Starbucks added in a separate announcement Wednesday that it would be accelerating its expansion of drive-through and pick-up locations, “due to a retail environment that has shifted because of COVID-19 and to meet the evolving customer needs of convenience, connection and personalization,” according to a statement.—11:15 a.m. ET: Just Eat Takeaway.com confirms merger talks with GrubhubJust Eat Takeaway.com (JET.L), a European online food ordering and delivery company confirmed Wednesday that it is in talks to merge with U.S. company GrubHub (GRUB) in what would be an all-share merger.This came after speculation of a potential deal between Uber (UBER) and Grubhub, though antitrust concerns with that deal had reportedly put a roadblock in discussions.Shares of GrubHub were little changed amid the developments.—9:50 a.m. ET: Johnson & Johnson shares rise after announcing acceleration of human trials for coronavirus vaccineJohnson & Johnson (JNJ) said Wednesday it expects to start human trials of its Covid-19 vaccine candidate in the second half of July. Earlier, the trial was scheduled to begin in September. Shares of J&J rose more than 1% following the announcement.\"Based on the strength of the preclinical data we have seen so far and interactions with the regulatory authorities, we have been able to further accelerate the clinical development of our investigational SARS-CoV-2 vaccine, Ad26.COV2-S, recombinant,” Paul Stoffels, chief science officer for Johnson & Johnson, said in a statement. “Simultaneously, we are continuing our efforts to build important global partnerships and invest in our vaccine production technology and manufacturing capabilities. Our goal is to ensure we can deliver a vaccine to the world and protect people everywhere from this pandemic.\"—9:31 a.m. ET: Stocks drift ahead of Fed meeting, Nasdaq hits fresh recordHere were the main moves in markets as of 9:31 a.m. ET:S&P 500 (^GSPC): +5.54 points (+0.17%) to 3,212.72Dow (^DJI): -12.59 points (-0.05%) to 27,259.71Nasdaq (^IXIC): +69.74 points (+0.71%) to 10,023.50Crude (CL=F): -$0.58 (-1.49%) to $38.36 a barrelGold (GC=F): +$9.00 (+0.52%) to $1,730.90 per ounce10-year Treasury (^TNX): -3.2 bps to yield 0.797%—8:32 a.m. ET: Consumer prices fall for third consecutive monthAn index of consumer prices fell in May for the third straight month, the Bureau of Labor Statistics said in its report Wednesday.The headline consumer price index (CPI) ticked down by 0.1% over last month, versus consensus expectations for no change, according to Bloomberg data. The CPI fell by 0.8% in April over the prior month.Declines in prices for motor vehicle insurance, energy and apparel offset increases in prices in food and shelter.Excluding food and energy prices, CPI still fell by 0.1% over the prior month, or a shallower drop than the 0.4% decline in April. CPI excluding food and energy rose 1.2% over last year, or slightly less than the 1.3% increase expected.—7:21 a.m. ET Wednesday: Stock futures open slightly higherHere were the main moves in markets, as of 7:21 a.m. ET:S&P 500 futures (ES=F): 3,206.00, up 0.5 points or 0.02%Dow futures (YM=F): 27,225.00, down 39 points, or 0.14%Nasdaq futures (NQ=F): 9,993.50, up 42.5 points, or 0.43%Crude (CL=F): -$1.03 (-2.65%) to $37.91 a barrelGold (GC=F): +$3.70 (+0.21%) to $1,725.60 per ounce10-year Treasury (^TNX): -3 bps to yield 0.799%—7:01 a.m. ET Wednesday: Home purchase applications rise for eighth straight weekAn index tracking mortgage applications for home purchases rose 5%, seasonally adjusted, for the week ending June 5, the Mortgage Bankers Association said in its weekly report Wednesday.This marked the eighth straight advance for the index in a protracted rebound from early April, when the coronavirus pandemic and social distancing measures were at their peak and led to a slump in housing market activity. The unadjusted index for purchases also rose 13% versus the same week last year.Applications for refinances also increased, rising 11% over last week and 80% over the same week last year.“Fueled again by low mortgage rates, pent-up demand from earlier this spring, and states reopening across the country, purchase mortgage applications and refinances both increased,” Joel Kan, MBA’s associate vice president of economic and industry forecasting, said in a statement. “The recovery in the purchase market continues to gain steam, with the seasonally adjusted index rising to its highest level since January.”—6:03 p.m. ET Tuesday: Stock futures open slightly higherHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,206.75, up 1.25 points or 0.04%Dow futures (YM=F): 27,273.00, up 9 points, or 0.03%Nasdaq futures (NQ=F): 9,964.00, up 13 points, or 0.13%Traders wearing masks work, on the first day of in-person trading since the closure during the outbreak of the coronavirus disease (COVID-19) on the floor at the New York Stock Exchange (NYSE) in New York, U.S., May 26, 2020. REUTERS/Brendan McDermid—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}