{"article": [{"url": "https://finance.yahoo.com/news/trump-payroll-tax-deferment-is-employee-relations-disaster-163141325.html", "published": 1598009960.0, "headline": "Trump payroll tax deferment is ‘employee relations disaster’", "body": "President Trump’s Aug. 8 executive order delaying the collection of the payroll tax from Americans’ paychecks is supposed to take effect Sept. 1.Unable to reach an agreement with top Democrats over the next round of fiscal stimulus, Trump has sought to let Americans take home a little more cash by ordering employers to stop collecting payroll taxes from workers through Dec. 31, 2020.“Every employer I’ve talked to has said we are not going to do this. It is not good for administrative complexity, and worse, it's an employee relations disaster,” Bill Arnone, the CEO of the National Academy of Social Insurance, told Yahoo Finance.The order applies to workers earning up to about $104,000 annually. Trump’s order directs employers to suspend the collection of what amounts to 6.2% in payroll taxes from their paychecks. (Both employees and employers pay the tax, which funds Social Security.) According to the latest data, the payroll tax raised about $945 billion per year for Social Security, covering 89% of its costs, and the 1.45% Medicare tax which is also part of the Federal Insurance Contributions Act tax generated $272 billion for Medicare, covering 36% of its costs.As the deadline to implement the executive order approaches, corporate America is rebelling against Trump. Many employers fear that complying with Trump’s executive order will land them in a legal hornet’s nest.The U.S. Chamber of Commerce sent a letter to House Speaker Nancy Pelosi, Senate Majority Leader Mitch McConnell, and Treasury Secretary Steve Mnuchin detailing their concerns on Tuesday.“Under current law, the [executive order] creates a substantial tax liability for employees at the end of the deferral period. Without Congressional action to forgive this liability, it threatens to impose serious hardships on employees who will face a large tax bill as a result of deferral,” the letter states.The top concern for employers are the possible liabilities they and their employees might face once the payroll tax deferral expires in 2021.Story continues“How do you explain to employees that in January they have to pay it all back? Well, what if they spent it in today’s hard times?” said Arnone.“Employers have an accounting issue to deal with, too. How [much] do they reserve [in cash] just to protect [themselves] against employees who...leave the company and...are not able to pay [their payroll taxes]? Who’s liable? [There’s] a host of administrative and legal questions.”President Donald Trump speaks to the 2020 Council for National Policy Meeting, Friday, Aug. 21, 2020, in Arlington, Va. (AP Photo/Evan Vucci)President Trump has said he would push for a permanent payroll tax cut if he gets re-elected, but that’s cold comfort for employers. They’re fully aware that Congress needs to pass legislation to ensure those promises are backed by the law.Threat to Social Security financingThe Social Security Administration projects that its funds will be depleted by 2035. Democratic leaders, including presidential candidate Joe Biden, claim the deferment of payroll taxes could endanger Social Security funding.“For our seniors, Social Security is a sacred obligation, a sacred promise made. The current president is threatening to break that promise. He’s proposing to eliminate the tax that pays for almost half of Social Security without any way of making up for that lost revenue,” Biden said during his Democratic convention speech on Thursday. “I will not let it happen. If I’m your president, we’re going to protect Social Security and Medicare. You have my word.”Some economists dispute the claim that the payroll tax deferral will harm Social Security.“Notably, the claim that the deferral will drain the Social Security...trust funds is unfounded,” wrote American Enterprise Institute Resident Scholar Alan Viard. “The Social Security trust fund will lose interest income because it will receive some of its tax revenue a few months late, but the loss would be tiny even if all employers opted to defer.”Trump has sought to reassure seniors that his executive order wouldn’t harm Social Security funding.“When I win the election, I’m going to completely and totally forgive all deferred payroll taxes without in any way, shape, or form hurting Social Security. That money is going to come from the General Fund. We’re not going to touch Social Security,” he said on Aug. 13.More from Sibile:Coronavirus gut check: How small businesses are survivingHow Hollywood content can ‘normalize injustice’Michigan Gov. Whitmer, potential VP pick, has ‘good relationship’ with Biden, says Lt. Gov.Biden’s plan to fight criminal justice injusticeMedia mogul Byron Allen: ‘I think President Trump is totally wrong’Find live stock market quotes and the latest business and finance news"}]}