{"article": [{"url": "https://finance.yahoo.com/news/some-nightmare-scenarios-for-the-the-november-elections-193855154.html", "published": 1591800380.0, "headline": "Some nightmare scenarios for the November elections", "body": "Mail-in voting in the Georgia primary elections this year was 2,500% higher than in 2016, as many voters chose to avoid the risk of visiting a polling station amid the coronavirus pandemic. But the June 10 election was a fiasco anyway. Some people who requested a mail-in ballot didn’t get one, so they had to show up in person. Polling sites were understaffed. Some election workers didn’t know how to operate new voting machines, and some of the machines malfunctioned, causing some voters to wait for hours and others to give up and go home.Election experts fear similar confusion in the Nov. 3 presidential election, due to the combined effects of new voting systems, coronavirus concerns and partisan warfare. “This upsets the tried and true way of doing things,” election analyst Lou Jacobson of Politifact says in the latest episode of the Yahoo Finance Electionomics podcast. “In addition to the hyperpartisanship and the norm-breaking that has been going on for the past couple years, mail balloting is one more variable which makes things challenging.”Jacobson wrote a recent column for the Cook Political Report summarizing six scenarios political scientists worry could disrupt the 2020 election. Mail-in voting is not problematic in itself. States such as Washington, California, Oregon, Utah and Hawaii rely completely or heavily on mail-in ballots and haven’t had serious problems. The trouble could come in a state newly reliant on mail-in voting, if the race is close and the state’s electoral votes could tip the election one way or the other, as Florida did in 2000.[Check out other episodes of the Electionomics podcast.]Jacobson highlights Michigan as a possible flash point, since it’s a swing state Donald Trump won by a whisker in 2016 that currently has divided government. The governor, secretary of state and attorney general are Democrats, while the state legislature is controlled by Republicans. If questions arise over whether mail-in ballots are sent out, postmarked or counted on time—or some other irregularity—the Democratic governor could claim Biden won while the Republican legislature could claim President Trump won. It could also take several days after the election to count all the mail-in ballots, leading one side or the other to claim vote-rigging.Story continuesVoters wait in line to cast their ballots in the state's primary election at a polling place, Tuesday, June 9, 2020, in Atlanta, Ga. Some voting machines went dark and voters were left standing in long lines in humid weather as the waiting game played out. (AP Photo/Ron Harris)The courts could decide the outcome, as they did regarding Florida in 2000. But the U.S. electoral process gives Congress the final vote-counting authority in early January, and it’s the new Congress voted into office the prior November, not the old Congress. So the courts could decline to rule and defer to Congress.If Democrats win the Senate in November and therefore control both houses, the ruling would presumably favor Biden. But if Congress remains split, the outcome could be indecisive, with the Republican Senate backing Trump and the Democratic House backing Biden. “None of this is destined to happen,” Jacobson says. “But the various factors make it more likely than it has been in the past.”If there’s no agreed-upon president on January 20, and the White House is technically vacant, succession laws would make the House Speaker, currently Nancy Pelosi, president, as long as she left her House job. Next in line after Pelosi is the president pro tempore of the Senate, who is currently Republican Chuck Grassley.There’s also the question of what would happen if Biden beat Trump cleanly and Trump refused to accept the results, claiming fraud, as he has before, without merit. The controversial outcome in 2000 didn’t become a crisis because Democrat Al Gore accepted the Supreme Court’s decision that George W. Bush won. What if there’s a repeat favoring Biden, but Trump doesn’t accept the ruling of the Supreme Court, or Congress?“It’s really unresolved,” Jacobson says. “Would they have to send in federal marshals to physically remove him? Who would the military give the nuclear codes to? Trump would still be in the White House if he chooses to do so. But he wouldn't have the powers of president. That would be kind of chaos.”Again, these are worst-case scenarios that may never materialize. If Trump clearly loses, for instance, there will be overwhelming public pressure for him to leave office just as every other losing incumbent has done. Earlier this year, Democrats were worried about a messy contested convention that could fracture the party if none of the primary candidates garnered a majority of votes. Yet Joe Biden has now swept to a landslide win, with nearly all former challengers uniting behind him. Chaos averted.Biden is currently a slim favorite over Trump, whose approval rating has dropped near the lowest of his presidency following a slow and muddled response to the coronavirus and incendiary actions following the May 25 killing of George Floyd in Minneapolis. Biden leads Trump by 8 points nationwide and by low- to mid-single-digits in most swing states. So Biden could win by a large enough margin to preempt an electoral crisis. But nobody counts Trump out or assumes he’ll go easily.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:The surging stock market isn’t helping TrumpThe stock market is off the railsThe risk to Biden if he picks a black running mateHow Biden wallops TrumpIf you want to protect lockdowns, renounce health careGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}