{"article": [{"url": "https://finance.yahoo.com/news/kb-home-earnings-mortgage-applications-what-to-know-in-markets-wednesday-003049059.html", "published": 1592941100.0, "headline": "KB Home earnings, mortgage applications: What to know in markets Wednesday", "body": "The U.S. housing market will be in focus again Wednesday when KB Home (KBH) reports quarterly earnings and weekly mortgage applications data is released.Record low mortgage rates have been luring buyers back into a housing market that was at a standstill as a result of the pandemic. New home sales data released Tuesday showed that single-family home purchases soared 16.6% in May to a seasonally adjusted 676,000 units, which was the second biggest monthly jump since 1992.The housing market is beginning to look like the bright spot in the U.S. economy. Homebuyers were waiting on the sidelines in March and April because of the global pandemic, but buyers are coming back in full force as social distancing measures ease up across the country.“In many respects, COVID-19 is accelerating trends in U.S. housing that were already underway,” Morgan Stanley said in a note Monday. “Affordability, driven by a shallow pullback in home prices, an extended period of lower mortgage rates and efficiencies within the origination process should make ownership more appealing than it has been, at least on the margin, but we think the real story here is single family vs. multifamily, not ownership vs. rentership.”Weekly mortgage applications have continued to paint a good picture for the U.S. housing market. In the week ending June 12, mortgage applications rose 8%.Newly finished development of homes for sale, built by home builder KB Homes, are pictured in Carlsbad, California January 4, 2011. REUTERS/Mike Blake (UNITED STATES - Tags: BUSINESS)Homebuilder KB Home will report fiscal second quarter earnings after the market close, and the company is expected to report adjusted earnings of 56 cents per share on $1.12 billion in revenue.At the end of March, KB Home reported first quarter results which covered the three month period ended February 29. Given the uncertainty surrounding COVID-19 at the time, CEO Jeffrey Mezger said in a statement, “While our performance in the first quarter was strong, with underlying market conditions that were robust, these results preceded the COVID-19 pandemic declaration, and we are now taking actions to adjust our business in this period of uncertainty.”Story continuesDuring the first quarter, KB Home’s revenue grew 33%, home deliveries jumped 28% and average selling price increased 5%. As of the end of February, KB Home had total liquidity of $1.2 billion and about $430 million of cash.Shares of KB Home were down approximately 1.3% this year have performed roughly in line with the broader market’s 1.5% decline.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:White Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeJobless claims: Another 1.51 million Americans file for unemployment benefitsRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}