{"article": [{"url": "https://finance.yahoo.com/news/a-big-tesla-stock-bull-says-this-is-one-of-the-most-common-misperceptions-on-tesla-171342967.html", "published": 1598876480.0, "headline": "A big Tesla stock bull says this is one of the most common misperceptions on Tesla", "body": "Wedbush managing director and Tesla (TSLA) bull Dan Ives contends it’s not just day-traders blinded by the magic of Elon Musk gobbling up shares of the electric vehicle maker.The whales are in the mix as well.“I think there is a misperception on retail investors and institutions [on Tesla]. I have talked to more institutional investors the last six months on Tesla than the last six years because the story has changed fundamentally, and profitability wise,” Ives told Yahoo Finance’s The First Trade. “You need to start focusing on the market [electric vehicle] and on the indexing of the S&P 500 (^GSCP). It has changed the game a bit. Of course there is retail [investor] momentum, no doubt. I think there is a bit of a misperception that it’s all retail. I believe there is a strong institutional support there because there has been a change in the fundamental story of Tesla.”The pure data on Tesla suggests Ives has a point.Tesla’s stock is about 58% institutionally owned, according to Yahoo Finance Premium data. While not as high as most companies with a similarly outsized market cap ($443 billion), Tesla does have more institutional ownership than auto rival Ford (F) (55%, per Yahoo Finance Premium data).Meanwhile, Tesla’s top five institutional shareholders is a who’s who of credibility (according to Bloomberg data): Ballie Gifford, Capital Group, Vanguard, BlackRock and FMR. Smaller institutions such as ARK Invest Management (a mega Tesla bull), Legal & General Group and Northern Trust have all added to their Tesla holdings since June 30, according to regulatory filings.The unconvinced institutional crowd could be lured into Tesla soon. Shares of Tesla rose 8% to $479 on Monday as the stock split five-for-one, making it cheaper (though valuation/market cap remains the same) on paper to get involved with Tesla ahead of a potential addition to the S&P 500.For his part, Ives is staying bullish on Tesla even as the stock has skyrocketed this year. Ives has a bull case price target on Tesla of $700 a share.Story continues“If you miss the Tesla story, especially from an indexing perspective, you’re trying to figure out what font to use on your resume,” Ives remarked.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}