{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-harvard-doctor-warns-that-america-needs-to-regroup-164519833.html", "published": 1595159600.0, "headline": "Harvard doctor: America 'needs to regroup' to fight coronavirus", "body": "Despite record numbers of coronavirus cases in many states across the country, there is still no coordinated response on a federal level.As a result, many states reopened their economies sooner than public health experts would have liked. And Harvard Public Health professor Dr. Howard Koh says the U.S. needs to take a step back and do a better job and battling the coronavirus as a country.“We are now seeing record cases and rising deaths for the first time in three months,” Koh said on Yahoo Finance’s The First Trade (video above). “So we’re in the public health fight of our lives right now. This is a time where our country needs to regroup.”U.S. President Donald Trump wears a protective mask while visiting Walter Reed National Military Medical Center in Bethesda, Maryland, U.S., on Saturday, July 11, 2020. (Chris Kleponis/Polaris/Bloomberg via Getty Images)Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, echoed Koh’s statements.“We have got to say, this is not working,” Fauci told PBS Newshour. ”So what we have got to do is reset. You may need to pull back a bit on a phase. You don't necessarily need to lock down.”‘This has been an abject failure on the part of the federal government’Koh explained that part of the problem is governors diverging on the best approach to containing the spread of the virus in their respective states.“We’re now six months and counting into the worst pandemic our country has faced in a century,” Koh said. “So many other countries around the world have gotten to the other side of this and we, the United States, have not. That’s because we have not had national coordination or national strategy. We’ve had 50 states going in 50 different directions.”Not every state has a mask mandate. (Graphic: David Foster/Yahoo Finance)Face masks are proven to make a significant difference in stopping the spread of the coronavirus, but only 19 states have mandates for residents to wear them in both outdoor and indoor public places.“I’m really hoping at this time that every leader at the federal, state, and local level focuses on maximizing the public health measures we have, and maximizing masking,” Koh said. “We should have a national requirement for mask usage by now. I’m not sure why it hasn’t happened yet.”Story continuesPeople wearing face masks wait in line to shop at Ikea in Carson, California on July 4, 2020 the US Independence Day holiday. (Photo by Robyn Beck / AFP) (Photo by ROBYN BECK/AFP via Getty Images)In states like Texas and Florida — two of the nation’s newest hotspots for coronavirus cases — face mask mandates vary by city and county. Seven states only mandate masks for those in indoor public places. Two-thirds of Americans polled say everyone should be wearing masks in public.“This has been an abject failure on the part of the federal government,” Dr. Craig Spencer, an emergency medicine physician and director of Global Health in Emergency Medicine at Columbia University, told Yahoo Finance. “We’re in the middle of a raging pandemic, and we’re having discussions about resuming some semblance of normal life.”Where coronavirus was getting worse last week. (David Foster/Yahoo Finance)‘We have to get this down now before the fall comes’Numerous companies are working towards finding a vaccine for the coronavirus, but the absolute earliest it would be available in emergency cases would be late 2020/early 2021.“We’re all looking for the best cures and there have been advances in therapeutics but we don’t have a cure yet,” Koh said. “We’re all looking for a vaccine but that hasn’t been finalized or approved by the FDA yet.”Research assistant Yi Kuo, of RNA medicines company Arcturus Therapeutics, conducts research on a vaccine for the novel coronavirus at a laboratory in San Diego, California. REUTERS/Bing GuanUntil a vaccine becomes widely available to the public, which will take longer, the U.S. is only left with preventative measures.“We’ve got to take those public health and prevention measures and maximize this right now, and hit that virus with everything we got,” Koh said. “That includes social distancing, hand hygiene, and masks, which are on the news a lot these days. We have to get this down now before the fall comes and seasonal flu hits us as well.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Florida mayor 'very concerned' about kids going back to schoolHow coronavirus ravaged a nursing home industry that was already 'in crisis'Americans 'are paying the price' for shoddy coronavirus response, doctor saysRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}