{"article": [{"url": "https://finance.yahoo.com/news/trumpworld-is-imploding-155716171.html", "published": 1601291120.0, "headline": "Trumpworld is imploding", "body": "Donald Trump has many well-known enemies—and some stealthy ones, as well.The main takeaway from a New York Times report on Trump’s tax records is that Trump claims to be a billionaire, yet in some years pays little or nothing in federal income taxes. Trump uses many legal tax credits to lower his bill, but may also break the law by exaggerating his business expenses or mischaracterizing payouts to family members.There’s also an unstated revelation in the Times expose: Somebody close to Trump turned on him, leaking financial information that could be both politically damaging and legally treacherous. The Times isn’t saying where it got the detailed information on nearly 20 years of Trump tax returns, and isn’t even releasing the documents, to protect the source. But it seems obvious that a Trump insider is trying to damage him, flouting Trump’s famous demand for loyalty from anybody who works with him.Trump is in a close reelection race, and it’s possible he could beat Democrat Joe Biden once the ballots are counted in November. At the same time, however, a more ominous scenario is unfolding. Trump’s notoriety as a combative president has brought unprecedented scrutiny to a family business that for decades was a black box, its inner workings secret. Trump is now facing more legal scrutiny than ever, including criminal probes into possible felonies. There are even signs his supposedly iron grip on the Republican Party could shatter if there’s an opportunity to dispatch Trump and move on.First, the legal cases. The Manhattan district attorney is investigating Trump and his businesses for various types of fraud, probably including some of the tax-avoidance strategies described in a 2018 New York Times feature. The DA investigation is secret, so it’s not clear what the exact focus is. But city, state and federal prosecutors have an obligation to investigate possible crimes if they become aware of them, and the intense scrutiny of Trump’s finances since he became president may have surfaced plenty of trouble. Trump’s former lawyer, Michael Cohen, went to jail in part for his role facilitating a campaign-finance felony: the hush-money payments to Stormy Daniels and Karen McDougal. Trump signed the checks, meaning he’s at least as complicit as Cohen.Story continuesThe New York State attorney general is mounting a separate investigation into whether Trump has misstated asset values to lower his tax payments or defraud lenders or insurers. The New York AG initiated this probe after Cohen testified before Congress in 2019 and accused Trump of fraud. Cohen might seem like an old story at this point, but the information he revealed after the FBI raided his office in 2018 could fuel investigations into Trump for years, and possibly lead to convictions.It’s obviously tricky to investigate a sitting president, one reason the federal Justice Dept. has had no apparent role in probing Trump since William Barr became attorney general in 2019. But Trump won’t be president forever, and federal investigators could join the city and state probes of Trump at some point. The Justice Department’s Southern District of New York led the Cohen prosecution, which culminated in Cohen’s 2018 guilty plea on eight criminal counts. If Cohen provided incriminating information on Trump as part of that case, it would be logical for the Justice Dept. to pick up the probe once Trump is no longer president and certain legal privileges of the office expire.SEPTEMBER 28th 2020: According to a report in The New York Times, Donald Trump paid $750 in federal income tax in both 2016 and 2017. - File Photo by: Dennis Van Tine/STAR MAX/IPx 2016 4/17/16 Donald Trump campaigns in Staten Island, New York City. (NYC)All of this comes as Trump’s businesses are apparently under mounting financial pressure. According to the latest Times report, most of Trump’s properties lose money, and he owes $421 million in loans, much of that due in the next few years. Trump’s hotels, resorts and golf courses are struggling amid a travel rout, and while the presidency has elevated Trump’s visibility, his unpopularity may have harmed the brand.Some of Trump’s legal woes stem from the decision of his niece, Mary Trump, to spill secrets of the family business to the New York Times for its 2018 expose on the Trump Organization’s aggressive tax strategies. Mary Trump is now suing the president and other family members for fraud relating to the family inheritance. Unless the various Trumps settle the suit, it could make public even more damaging information about Trump and his clan.Matching these business and family mutinies are defections by former Trump aides now openly opposing his reelection, such as former national security adviser John Bolton and former spokesperson Anthony Scaramucci. Trump also faces unprecedented opposition from within his own party, with many moderate GOP officials endorsing Biden, funding anti-Trump ads and posting testimonials describing how Trump has let them down. More than 75 former Republican national-security officials have signed an open letter declaring Trump a threat to the nation.Trump has manhandled most Republican elected officials, largely because he can mount furious opposition to their candidacies if they cross him. But this superpower is waning, too. Several otherwise loyal Senate Republicans, including Majority Leader Mitch McConnell, pushed back on Trump after he suggested he wouldn’t leave office if he loses to Biden. Some Republicans privately loathe Trump and fear he’s wrecking their party. They might not have the guts to oppose him publicly, but they might not help him, either, in a tight election that could bring Trump’s political end.Nobody should count Trump out. He’s a renowned escape artist who has bounced back from six bankruptcies and many scandals. What’s different now, however, are growing fissures in the facade that for decades protected Trump’s family and business. Prosecutors and the public are getting a look inside, and it’s messy. People turn on the boss when it becomes a matter of survival, and the closer the scrutiny, the more trouble there’s likely to be. Trump’s downfall may not be imminent, but it is starting to look inevitable.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Democrats can save ObamacareTrump’s health care sham5 campaign promises Trump has given up onWhy Trump wants to shackle the postal serviceEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}