{"article": [{"url": "https://finance.yahoo.com/news/from-gone-with-the-wind-to-bachelor-hollywood-is-moving-to-address-claims-of-racism-120016789.html", "published": 1592032100.0, "headline": "From 'Gone With the Wind' to 'Bachelor', Hollywood is moving to address claims of racism", "body": "As the still-raging protests over the death of George Floyd convulse the nation, Hollywood took decisive action this week to address its own racial blind spots.After 18 years, “The Bachelor” (ABC) finally has its first black male lead. Matt James, the best friend of “Bachelorette” fan favorite Tyler Cameron, received the coveted gig after originally being cast as a contestant in Clare Crawley’s upcoming season (Crawley’s season has since been postponed due to the coronavirus.)Prior to the announcement, an online petition, which called for more diversity in the franchise, quickly circulated on social media, garnering over 85,000 signatures as of June 12th.In over 40 seasons of both “The Bachelor” and its sister series “The Bachelorette,” the only other person of color to be cast in the lead role was Rachel Lindsay. She took over the Bachelorette title in 2017.Matt James is the new Bachelor! For the first time in the franchise's 18-year history, the longtime reality TV dating show has a black leading man.Another major move this week included the cancellation of long-time reality TV show “Cops” (VIAC), along with A&E’s “Live PD” after the network pulled episodes off the air last week.The 33rd season of “Cops” was originally scheduled to premiere on Monday, but no episodes had aired since June 1st amid the protests — fueling further questions about how law enforcement is depicted in pop culture.In a similar vein, streamer HBO Max (T) decided to remove the 1939 Civil War epic “Gone with the Wind” from its content library, following mounting scrutiny over its portrayal of black people and slavery.Prior to the film’s removal, “12 Years a Slave” screenwriter John Ridley published a passionate op-ed in the L.A. Times that hit out at the classic for glorifying the antebellum South, and “pauses only to perpetuate some of the most painful stereotypes of people of color.”Gone With The Wind, poster, left from left: Clark Gable, Vivien Leigh on 1950s. (Photo by LMPC via Getty Images)In a statement to Yahoo Finance, an HBO Max spokesperson said the movie’s racist depictions “were wrong then and are wrong today, and we felt that to keep this title up without an explanation and a denouncement of those depictions would be irresponsible.”Story continuesThe film will eventually return to the platform at a later date, but only with “a discussion of its historical context and a denouncement of those very depictions.”The recent moves have been met with mixed response as some call them a form of censorship. Others have argued the steps are necessary to help further the objectives of racial reconciliation.Meanwhile, popular country music group Lady Antebellum formally changed its band name as a result of ongoing civil unrest — dropping the ‘Antebellum’ portion of their name entirely.Popular country group Lady Antebellum formally changed its band name as a result of ongoing civil unrestHowever, the group — who said they will now go by ‘Lady A’ — is now facing backlash after Seattle blues singer Anita White said she’s been operating under the stage name ‘Lady A’ for the past 20 years.Oscars, Grammys also make changesThe Academy of Motion Picture Arts and Sciences is taking steps to becoming more culturally inclusive.“Selma” director Ava Duvernay — a longtime advocate of black filmmakers and people of color — was one of six new faces to be elected to the Academy’s Board of Governors, which hit historic milestones this week for both women and people of color.The 54-person board now includes 26 women and 12 people of color — up from 25 and 11, respectively.The Academy’s Board of Governors hit historic milestones this week for both women and people of color.The industry’s actions come at a time when major players have been strongly criticized for lack of diversity and representation.For example, the only person of color to be nominated for an Academy Award this past Oscar season was Cynthia Erivo for her role as Harriet Tubman. This comes despite the Academy revamping its membership guidelines in order to attract more diverse voters following the #OscarsSoWhite controversies back in 2015 and 2016.Ironically, Duvernay and her film were at the center of those controversies, after the movie did not receive nominations for Best Director or Best Actor.“Selma” director Ava Duvernay was one of six new faces to be elected to the Academy’s Board of GovernorsMeanwhile, another popular award show — the Grammys — will be renaming its controversial ‘urban’ category in an effort to advance a “completely new, and very transparent and transformed Recording Academy,” interim president and CEO Harvey Mason Jr. told Variety.The category, which will be renamed to ‘Best Progressive R&B Album,’ had previously been criticized by rapper Tyler the Creator, who said the use of the word was a way for the Academy to avoid including black artists in other categories and genres.Alexandra is a Producer & Entertainment Correspondent at Yahoo Finance. Follow her on Twitter @alliecanal8193Read more:Netflix, Disney join other big brands in support of George Floyd protests on 'Blackout Tuesday'Kylie Jenner still Forbes' highest-paid celeb, despite not being a billionaire anymoreData show why HBO Max's slow start may not tell the whole storyWhy ending coronavirus lockdowns 'won't be enough' to get people back to the moviesHow coronavirus could accelerate the demise of cable TV"}]}