{"article": [{"url": "https://finance.yahoo.com/news/why-krispy-kreme-is-opening-a-colossal-doughnut-making-stadium-in-nearly-empty-times-square-162453823.html", "published": 1597836740.0, "headline": "Why Krispy Kreme is opening a colossal doughnut-making store in nearly empty Times Square", "body": "COVID-19 has turned the once absurdly busy Times Square in New York City into a ghost-town. Restaurants of all kinds are closing in the city at the hands of the pandemic. Ditto major retail chains.Yet, Krispy Kreme is about to swing open the doors on Sept. 15 to a true doughnut making funland smack in the middle of nearly empty Times Square. Some of the features of the store include the “world’s largest” hot light, a glazed waterfall where people could watch doughnuts being dipped and a 24-hour street level pick-up window.The 4,500-square-foot store has been three years in the making, Krispy Kreme CEO Mike Tattersfield told Yahoo Finance’s The First Trade. For Tattersfield — a restaurant industry veteran that was once the CEO of Caribou Coffee — opening the store despite the concerns about weak city traffic and shopper health still makes a great deal of sense.Krispy Kreme's new 4,500-square-foot store in Times Square New York City. Credit: Krispy Kreme“We’ve been looking to invest in New York. We have had a shop in Penn Station since 1997. So we saw the demand. It’s a very craveable brand,” Tattersfield said. Krispy Kreme will not only use the store as a marketing mechanism for the brand, but to sell doughnuts wholesale to nearby businesses. Tattersfield mentioned the store will supply pharmacy chain Duane Reade (via a new deal) and Walmart (also a new deal).Krispy Kreme was acquired by food conglomerate JAB Holdings for $1.35 billion in 2016. The company has gone from 1,100 stores in 26 countries at the time of the deal, to 1,500 locations spanning 33 countries. Sales have reached $1 billion annually, up from more than $500 million at the time of JAB’s purchase. Tattersfield expects to open another 450 stores by the end of 2022.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}