{"article": [{"url": "https://finance.yahoo.com/news/governments-take-center-stage-in-creating-victory-for-science-in-coronavirus-vaccine-hunt-120542868.html", "published": 1598080400.0, "headline": "With lavish dollars, governments help create 'victory for science' in coronavirus vaccine hunt", "body": "The scientific community remains cautiously optimistic about finding a COVID-19 vaccine that can usher in the end of a pandemic that’s infected nearly 23 million and killed close to 800,000.The virus’ rapid spread has created unprecedented demand for an effective vaccine, which by all indications may be found in record time — thanks in large part to governments stepping in to backstop the efforts of biotechnology and pharmaceutical companies.Although a number of public health and philanthropies are also involved in the high-stakes race, governments are a linchpin in the far-reaching research and development efforts. The U.S. Health and Human Services’ (HHS) Operation Warp Speed and the U.K.’s National Health Services (NHS) efforts have helped boost vaccine research and trials to produce a vaccine in record time.America has spent more than $10 billion on at least 800 million doses, including nearly $2 billion to Pfizer (PFE)/BioNTech (BNTX) for 100 million doses— even though the duo is not receiving federal funding for the research and production of their vaccine.Entities like Emergent BioSolutions, Grand River Aseptic Manufacturing Inc., Texas A&M University and FUJIFILM have been looped in for more than $1 billion in total, to help with domestic manufacturing of COVID-19 vaccines.To-date, the fastest a vaccine was produced for a new disease has been four years.“The virus hasn’t had its first birthday yet, and already (more than) 150 vaccine candidates are being manufactured and tested,” Dr. Kevin Tracey, president of The Feinstein Institutes for Medical Research at Northwell Health, told Yahoo Finance in an interview.That’s “a victory for science,” he added, even as he acknowledged that not all candidates will make it to market.Collaborations have formed on an international level, with groups like the World Health Organization (WHO), global vaccine alliance (GAVI), Bill and Melinda Gates Foundation and Coalition for Epidemic Preparedness Innovations (CEPI) all involved in supporting and working with companies in the race for a vaccine.Story continuesBut of the hundreds of candidates currently in the mix, there are some also getting funding to provide doses to governments. That includes the U.S., Britain, the European Union and Australia.Vaccines become lucrative amid key unknownsCases in the U.S. are not spiking as much. (Graphic: David Foster/Yahoo Finance)The market for a covid vaccine is estimated to be $100 billion in sales and $40 billion in profits, according to an Evercore ISI analysis. And while some large players are expected to be donating doses to lower-income countries, or selling at no profit, others have stated their intention to profit off of the global pandemic.Traditionally, vaccines have been a less profitable product, due to the older technology and longer time period to produce. But recent candidates for shingles and human papillomavirus (HPV) are profitable, according to Arthur Caplan, a professor and bioethicist at NYU Langone Medical Center.“It’s become lucrative,” Caplan said.Newer technologies like messenger RNA and heat-stable candidates offer companies the chance to make money. And the need for two doses effectively doubles the revenue potential, while halving the number of people that have access to the supply.Most frontrunners being tested in the U.S. are two-shot vaccines, including a primer and booster within a month’s time. These are proving to be the most effective against the virus for a longer period of timeDr. Dan Barouch, Harvard Medical School's Professor of medicine and immunology, told Yahoo Finance’s Andy Serwer that a two-shot inoculation need will depend on durability of the vaccine. The length of immunity “is really an unknown question,” he added.The long-term effects on the body are also unknown. Recent data from a group of sailors showed potential long-term immunity, and studies continue to analyze the long-term impacts on the lungs, brain and other parts of the body.The WHO has been focused on vaccine development as a tool to help curb the virus’s global spread — but warns there is much left to learn, and finding an effective vaccine could take time.“Although we have learned so much about this disease we only have less than 8 months of experience to draw on. We still know relatively little about the long-term effects,” WHO director Tedros Adhanom Ghebreyesus said Friday.And experts contend that even if a vaccine is found by the end of 2020, it is likely to be part of a first generation of vaccines, and less effective than subsequent versions that companies could release.Estimated cost of recent epidemics/pandemics:SARS (2003) - $40 billionH5N1 (2006) - $40 billionH1N1 (2009) - $45 billionEbola (2014) - $55 billionCOVID-19 (2020) - $8.8 TRILLIONInvesting in public health preparedness is FAR cheaper than the economic impact of a pandemic.— Dr. Tom Frieden (@DrTomFrieden) August 19, 2020Price, manufacturing — and costsThe sheer volume of taxpayer money being poured into private pharmaceutical companies, many of which intend to profit off of the pandemic and have benefitted from spiking valuations in the stock market, continue to amplify negative perceptions about the industry.Companies like Moderna (MRNA) and Novavax (NVAX), which have no products on the market and were trading below $20 per share in January, have seen their market capitalizations surge to over $26 billion and $8 billion, respectively, on the coattails of soaring stock prices.In the past, the U.S. government has stepped up to fund a public health crisis, though not quite at the same scale. During the 2009 H1N1 flu pandemic, which was far less severe than COVID-19, the Obama administration funded distribution of the vaccine through public health and private health systems, with a priority list set by the CDC.Kathleen Sebellius, former HHS Secretary under President Barack Obama, told Yahoo Finance there are questions about how a vaccine will be distributed, whether the FDA can stick to its commitment of only releasing a vaccine when it is proven safe and effective — and whether insurers will be charged for the administration of vaccines.An additional question is if companies “who have already been prepaid, try to charge for it all over again,” she said.But there are also questions about the confidence in a safe and effective vaccine. The 50% effective rate that the FDA has set is “a pretty damn low bar,” Sebellius said. She questioned whether the approval of a vaccine will inject a fresh round of politics into an already polarizing debate.But one of the key differences is that amid the conversation of vaccine nationalism, the U.S. has more production capabilities on its side compared to 2009. Sebellius recalled the country had to “get in line” for purchasing vaccines that were mostly produced abroad.“Not surprisingly the countries with capacity also had constituencies that were in front of the line. One of the aftermath efforts was to develop much more robust manufacturing capacity in U.S., which we now have,” she said — which has grown threefold.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}