{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-case-spike-puts-texas-in-the-eye-of-coronavirus-hurricane-165213046.html", "published": 1593086420.0, "headline": "Coronavirus update: US case spike puts Texas in the eye of COVID hurricane", "body": "The U.S. marked a new grim milestone in the runaway coronavirus outbreak, setting a record single-day case count of 45,557 Wednesday that put pressure on hard-hit states like Texas to take action.On Thursday, Texas, which was among the first wave of states to end lockdowns, announced it would pause the next phases of its reopening, only days after Gov. Greg Abbott vowed that ending the rollback of stay-at-home orders was a last resort. The Lone Star State saw a 4.6% rise in cases Wednesday totaling more than 5,500, along with more than 4,300 hospitalized patients.Abbott also halted all essential surgeries in four of the hardest-hit counties — home to the state’s larges metros of Dallas, Houston, San Antonio and Austin — in a sign that the state’s hospital capacity is becoming increasingly strained. The move mimics steps taken in New York-New Jersey during the early stages of the COVID-19 crisis, in order to compensate for a surge in cases.“The last thing we want to do as a state is go backwards and close down businesses,” Abbott said in a statement. “This temporary pause will help our state corral the spread until we can safely enter the next phase of opening our state for business.”The surge in hospitalizations is worrying local health officials, including those in the Texas Medical Center who warned ICU-bed capacity would be breached on Thursday.While other hard-hit countries around the world have controlled their outbreaks, the U.S. is seeing a steady increase with nearly 2.5 million cases and 125,000 deaths. A majority of new cases are trending younger, reaffirming public health experts’ worries of the younger population being responsible for the spread.The fumbled response to case surges in states like Texas and Florida is the reason behind the Tri-State governors announcing that visitors from hard-hit states will need to quarantine for 2 weeks if they enter the region.Dr. Dara Kass, Yahoo medical contributor, told Yahoo Finance Thursday that lack of leadership by President Donald Trump has exacerbated the problem, and that sports leagues weighing the upcoming seasons have a lot to consider.Story continues“We’re seeing the true cost, the true economic cost, on going too far ahead too fast, not being deliberate and not understanding how to undo the steps forward,” Kass said.There are over 2.3 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)The rise in cases is still taking a heavy economic toll, with jobless claims coming in higher than expected Thursday, which sent Wall Street on another leg down.Another 1.48 million Americans claimed unemployment benefits for the first time, pushing the 14 week total to 47 million, a new record since the start of the coronavirus-related shutdowns.The global pandemic has now affected nearly 9.5 million and killed 483,000. Even as European countries reopen, the race for a vaccine continues.LabCorp (LH) announced a new neutralizing antibody test Thursday, which can help companies searching for treatments and vaccines, as well as convalescent plasma to run tests on the effectiveness of their candidate. The test would be available to companies, hospitals, blood banks and other plasma-screening facilities.“The launch of this neutralizing antibody assay is the latest effort in our company’s commitment to accelerate the evaluation of vaccine candidates so that a successful candidate may reach patients sooner,” said Paul Kirchgraber, chief executive officer of LabCorp’s Drug Development business.Following positive results of an Oxford University study of dexamethasone as a treatment, the widely available generic is seeing a surge in demand in the U.S.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}