{"article": [{"url": "https://finance.yahoo.com/news/theres-a-risk-of-a-lost-decade-here-former-imf-adviser-204847849.html", "published": 1593014180.0, "headline": "'There's a risk of a lost decade here:' former IMF adviser", "body": "The International Monetary Fund’s lowered outlook for the global economy is a “wake-up call” signaling the worst is not behind us, says former IMF adviser, Josh Lipsky.”To imagine we can snap out it, just because pent-up demand has led to a surge in the last few months is naive thinking,” Lipsky told Yahoo Finance.On Wednesday, the IMF lowered its forecast for the global economy, expecting a contraction of 4.9% for 2020. The forecast is a remarkable downgrade from the IMF’s -3% projection in April, making it the worst print in the report’s history.For the first time, the IMF projects negative growth in every region of the world, as some areas re-open their economies and concerns of more coronavirus cases resurface.“Even though countries are opening up, people are not spending ... They’re saving more.” said Lipsky. “The fear factor, the rise in infections, all of that is slowing consumption and that’s the drag on the global economy right now.”The IMF predicts the U.S. economy to contract by 8% in 2020, with a slow recovery starting in 2021.A dealer wearing a protective face mask waits for customers before the reopening of the D Las Vegas hotel and casino, Wednesday, June 3, 2020, in Las Vegas. Casinos were allowed to reopen on Thursday after temporary closures as a precaution against the coronavirus. (AP Photo/John Locher)Lipsky says low-income workers in high contact jobs like hospitality and leisure are the most at risk around the world as well as in the U.S.“We’re heading towards a fiscal cliff come July, and I don’t think people have fully priced that in, “ said Lipsky. “The unemployment extensions run out, there’s a series of measures on loan forgiveness and small business that are going to run out.”He says policy makers should act quickly to extend the unemployment insurance and continue backing small businesses, otherwise the U.S. could see “a double-dip in the fall.”Lipsky says now is not the time for governments or central banks to “put your foot off the gas.”“There’s a long road ahead,” said Lipsky. “If policy makers don’t continue the extraordinary fiscal and monetary support that we have seen over the last six months, we’re not just at risk of losing 2020, and potentially 2021. I think there’s a risk of a lost decade here.”Story continuesInes covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreRead more:It would be unprecedented for a bear market to be this short: Wells Fargo StrategistRecent rally could be a ‘bear market trap’: Miller Tabak StrategistA view from the trading floor: Algorithms having ‘outsized impact’ amid coronavirus impactFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}