{"article": [{"url": "https://finance.yahoo.com/news/5-powerful-stocks-to-buy-with-the-stock-market-skyrocketing-again-171403960.html", "published": 1592914940.0, "headline": "5 stocks to buy with the stock market skyrocketing again", "body": "The stock market is back in major rally mode again after a brief downdraft. So, instead of trying to fight the tape as they say on Wall Street trading floors, why not back up the truck and search for additions to the portfolio.Read more: How to think about stock investing: The full breakdownMarket experts we talk with are divided on what should be the precise investor attack plan right now considering the market has rallied more than 40% off the March 23 lows, according to Yahoo Finance Premium data. Do you day-trade high-flying tech stocks such as Netflix (NFLX), seeing as there is nothing better to do each day (no sports on TV, after all) and the streaming giant is a powerhouse? Do you seek out “safe” dividend stocks, say like Clorox (CLX), that while no longer cheap valuation wise do pay out a solid, predictable dividend? Or do you spend hours searching for fresh names to invest in on some major view on the future of a particular sector?While divided in their views, pros agree sitting on the sidelines at the moment isn’t a great idea. Sit out of the action much longer and you could miss out on another 40% surge in markets powered by cheap money out of the Federal Reserve and the next round of government stimulus from the U.S. government (which only serves as a fire starter to the COVID-19 economic bounce underway).“At this point, if you’re in the market you’re managing your own money and you want the next big opportunity. I think you look for the next phase. I like companies like Shopify (SHOP). I like companies that are positioning themselves to take advantage of a huge, huge market but they’re in their early stages,” said Hercules Investments CEO James McDonald on Yahoo Finance’s The First Trade.Shopify CEO Tobias Lutke, center wearing hat, is celebrated as he rings the New York Stock Exchange opening bell, marking the Canadian company's IPO, Thursday, May 21, 2015. Shopify Inc. works with merchants who want to offer their own online checkout services, providing a platform for small- and mid-size businesses that sell products online. (AP Photo/Richard Drew)Shopify may qualify as a new name to many retail investors, but not to those in the know, like McDonald. The stock has surged 130% year-to-date as the company’s first quarter held up far better than Wall Street feared — sales rose 47% from the prior year as the platform regained ground from the worst of the COVID-19 demand hit. This month, Shopify inked a deal with Walmart (WMT) to expand the retailer’s online marketplace. Not only will the deal likely give a jolt to Shopify’s financials, it drives a narrative the company could be taken over by Walmart.Story continuesTo McDonald’s point, Shopify’s deal with Walmart positions it to play in the discount retailer’s next phase of growth online.If you aren’t inclined to research for new investing ideas, experts like McDonald think there is room to the upside in momentum tech names. So nibbling at these stocks of the world wouldn’t be the worst decision given the future potential of their respective businesses.“We’ll see buying in Facebook (FB), and Amazon (AMZN) and Netflix and Google (GOOGL) because these are amazing once in a generation, perhaps once in a lifetime companies. And so those companies while they’re going to pull back with others, money is going to go right back into them. But from the day trader, you start looking at the next things. We remember watching television and having those ads come up. Roku (ROKU) is loaded on almost every smart TV sold. So they’ll take some of that subscriber revenue that Netflix has had,” McDonald adds.That’s a tidy eight free stock suggestions from someone who gets paid big bucks for investment advice. Go forth and conquer.Or, focus in on potentially lucrative sector themes via ETFs if stock-picking isn’t your thing.“I like the stay-at-home internet stocks. I think there is a lot of value there. I think there is a lot of value in the medical stocks because I think a lot of medical procedures that were postponed [due to COVID-19] are coming back,” said Wells Fargo Asset Management president and global CIO Kirk Hartman on The First Trade.Hartman continued, “The other sector I think is very interesting longer-term are the emerging markets, especially big tech stocks in Asia. With a weaker dollar, the emerging markets are trading at P/E multiple of 11 times and U.S. equities are trading at 20 times. On a relative basis, emerging markets especially in Asia look cheap to me. And interestingly, China with all their problems has actually started to turn positive. That’s where I would look for value.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}