{"article": [{"url": "https://finance.yahoo.com/news/salesforce-cuts-1-000-jobs-192534391.html", "published": 1598464400.0, "headline": "Salesforce Cuts 1,000 Jobs After Banner Quarter, Stock Surge", "body": "(Bloomberg) -- Salesforce.com Inc. plans to cut about 1,000 jobs, people familiar with the situation said, a move by the software giant to streamline its business even as it reports record quarterly revenue and forecasts further gains.Sales and customer-support roles are among those being eliminated, said two of the people, who asked not to be identified discussing private information. In the U.S., the move affects some workers who sell the company’s software aimed at financial-services firms, health and life-science companies and other cloud sales teams, one of the people said.The cuts are taking place in more than a dozen Salesforce locations around the world, including in Canada, another person said. Some employees focused on Service Cloud, Salesforce Platform and configure-price-quote software were also affected, a third person said.“We’re reallocating resources to position the company for continued growth,” a Salesforce spokeswoman said. “This includes continuing to hire and redirecting some employees to fuel our strategic areas, and eliminating some positions that no longer map to our business priorities. For affected employees, we are helping them find the next step in their careers, whether within our company or a new opportunity.” The job cuts were reported earlier by the Wall Street Journal.On Tuesday, while some employees were being told via videoconference that their positions would be eliminated, Salesforce reported that revenue climbed 29% to $5.15 billion. The company also raised its forecast for annual sales, signaling the deepest effects of the pandemic-fueled recession may be behind the software maker. Shares of the San Francisco-based company surged 26% on Wednesday in New York on the rosy projections, bringing gains for the year to 67%.Chief Executive Officer Marc Benioff said in a Bloomberg TV interview Wednesday that the decision to cut jobs has always been difficult.“There is no lifetime employment at Salesforce,” he said. “Everything is performance-based. We are going to make job changes and shift and evolve as our markets shift and as our customers shift.” Every year, Salesforce will “rebalance” 5% to 10% of its workforce to focus on strategic areas, he added.Story continuesBenioff had pledged in March that the company wouldn’t conduct any “significant” lay offs for 90 days, and he scoffed at other CEOs who wouldn’t make the same promise.The company will give the employees 60 days to search for a new job within the Salesforce organization, two of the people said.(Updates with CEO remarks starting in fifth paragraph.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}