{"article": [{"url": "https://finance.yahoo.com/news/lumber-staggering-rally-homes-selling-110023301.html", "published": 1600092860.0, "headline": "Staggering Lumber Rally Has New Homes Going for $16,148 More", "body": "(Bloomberg) -- The North American lumber industry is having its craziest year in memory -- and that was before the wildfires.Weyerhaeuser Co., the continent’s biggest wood producer, said Monday that the blazes that have blanketed much of the Western U.S. sky in an apocalyptic orange had reached four of its timber operations in Oregon. All employees were safe, the company said, but several mills temporarily cut back their shifts.That’s the second natural disaster to rock the industry in 2020. In March, producers idled sawmills during the coronavirus lockdown. Just a month later, pent-up demand exploded. Homebuilders broke ground on a surprising number of new houses, and do-it-yourselfers, fortified by government stimulus checks, took on home repairs and remodeling jobs they were able to tackle while under quarantine.In the wake of that volatility, futures have climbed 57% this year, and even after falling from a record high last month, prices are still on pace for the largest gain since 1993.“Everyone stopped and took a breath right after Covid hit to see what the supply-demand constraints were going to look like,” said Joe Sanderson, managing director of natural resources at Domain Timber Advisers LLC, which owns or invests in 283,000 acres in various locations around the country. “Based on all the activity related to people fixing up their decks, or building a new addition on their house, we’ve seen that demand pick back up.”Now lethal wildfires look like they’re about to have an impact on the industry. Logging bans, closed railroad lines and shuttered mills in the Pacific Northwest have added tension to what Kevin Mason, managing director at ERA Forest Products Research in Kelowna, British Columbia, calls “an incredibly tight supply chain.”In more normal times, some customers would pad their inventories on concerns that commercial timberlands could go up in smoke. But that’s impossible now due to a supply shortage.Story continues“We’re in an unprecedented market,” Mason said. “There’s no flood of supply and no reduction in demand.”Mason said lumber prices will dip in the fourth quarter, but come back strong in 2021, boosted by another wave of demand, delayed in part by the current shortage. Last month, futures reached an all-time high of $830.90 per 1,000 board feet. The current price, $640, is still 68% higher than the average over the last five years.“I wouldn’t be surprised if you see some of the mills struggling to keep the log supply in front of the mills,” Devin Stockfish, Weyerhaeuser’s chief executive officer, said during a virtual conference presentation Monday.Read more: Millions of Beetles Are Wiping Out Forests All Across the WorldWith supply and demand so haywire, volatility has soared. Consider Weyerhaeuser’s performance. Shares lost more than half their value in March, only to make it all back by the end of July.Lumber’s price swings have rippled across the country. Boosted by higher material costs, the average new single-family home sells for $16,148 more in August than it did in mid-April, according to the National Association of Home Builders. The average price of a new multifamily home has increased by $6,107 over the same period.“Housing has been a bright spot, if not the bright spot, for the overall economy in recent months,” said Robert Dietz, chief economist for the homebuilders’ group.Strong DemandDemand remains strong. In July, U.S. new-home sales jumped to the highest in nearly 14 years, buoyed by a reported urban exodus to the suburbs and historically low mortgage-interest rates. At Home Depot Inc., a supplier to weekend carpenters, lumber was the best-performing department in the second quarter, according to Ted Decker, the retailer’s executive vice president of merchandising.Other construction data show what a roller-coaster year it’s been. In January, builders broke ground on the most new homes since 2006, before the Great Recession. By April, that number had plunged 42%. At the end of July, it was back to flirting with the 14-year high.Still, economic pressures lurk on the horizon. Direct U.S. government stimulus to taxpayers has run out, joblessness remains high and the two natural disasters -- wildfires in the West and the spread of coronavirus most rampant in the South and Midwest -- remain out of control.“A lot of us wonder how long can the demand for home purchases be this strong without a more meaningful recovery in the labor market or the broader economy,” said Richard Moody, chief economist at Regions Financial Corp. in Birmingham, Alabama.Mark Wilde, a senior analyst at BMO Capital Markets in New York, said he’s been involved with the lumber market for 30 years and has never seen anything like what’s been happening in 2020.“This has been pretty singular in terms of volatility,” he said.(Adds company comments starting in second paragraph, updates prices in fourth paragraph.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}