{"article": [{"url": "https://finance.yahoo.com/news/this-week-in-trumponomics-here-come-the-big-layoffs-175303663.html", "published": 1598619680.0, "headline": "This week in Trumponomics: Here come the big layoffs", "body": "The first four months of the coronavirus recession were a tense holding period. Congress passed enough aid to bridge most businesses and workers through the end of July, as governors and mayors tested trial-and-error ways of reopening their economies while subduing the virus.Some of the damage companies were hoping to forestall is now becoming permanent. Several large companies have started announcing four- and five-digit layoffs, as they adjust to a long-term drop in demand. Casino operator MGM has permanently laid off 18,000 workers who were on temporary furlough. That’s one-fourth of its total workforce. MGM has been able to reopen its casinos, but travelers to Las Vegas and other resort areas simply aren’t showing up in the numbers they used to. After Sept. 30, MGM’s laid-off workers will lose company-provided health insurance and other benefits.American Airlines, barely airborne, is preparing to lay off 19,000 workers on October 1. In a letter to employees, CEO Doug Parker pointed out that an aid package for airlines Congress passed in March assumed the coronavirus pandemic would be under control by September. “That is obviously not the case,” he said.Delta, for its part, is planning to lay off more than 1,900 pilots. “We are six months into this pandemic and only 25% of our revenues have been recovered,” a top executive explained to employees recently. “Unfortunately, we see few catalysts over the next six months to meaningfully change this trajectory.\"Coca-Cola, struggling with lost sales from closed restaurants, said this week it’s cutting 4,000 jobs through buyouts and layoffs. Salesforce said on August 26 it’s cutting 1,000 jobs. Thousands of smaller companies and other organizations are throwing in the towel and starting to slash staff permanently. This, of course, comes on top of the 13 million jobs that have been eliminated since February, raising the unemployment rate from 3.5% to 10.2%.More large layoff announcements are probably coming. Trump is touting an economic recovery, but if big companies with access to all necessary financing can’t keep payrolls intact, the hole might be getting deeper rather than shallower. This week’s Trump-o-meter reads SAD, the lowest rating.Story continuesTrumpometerAt this week’s Republican convention, there was barely any acknowledgment of the coronavirus pandemic or the deep recession it has caused. Trump said he has “done more for the African-American community than any president since Abraham Lincoln,” even though the unemployment rate for Black Americans is a stratospheric 14.6%. White House economist Larry Kudlow ticked off five economic booms—stocks, housing, auto sales, manufacturing and consumer spending—without mentioning that most of those things remain far below pre-virus levels. Kudlow also referred to the pandemic in the past tense, as if it’s over and everybody’s fine now.Trump obviously needs to persuade voters the economy is healing and they should give him another four years to see the convalescence through. But the economy may not be healing. Congress can’t muster another stimulus bill, and the White House isn’t generating any heat under Senate Majority Leader Mitch McConnell. Recent consumer confidence numbers remain depressed. More than a million workers continue to file initial unemployment claims each week. The monthly job numbers come on Sept. 4, and they’ll reveal whether we’re going forward or back. Mounting layoffs may already tell us.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:5 campaign promises Trump has given up onThe Trump campaign’s bogus boom timesWhy Trump wants to shackle the postal service11 ways Trump is out of touch with votersEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}