{"article": [{"url": "https://finance.yahoo.com/news/supreme-court-expected-rule-trump-041405484.html", "published": 1594250540.0, "headline": "No peeking, voters: Court keeps Trump taxes private for now", "body": "WASHINGTON (AP) — Rejecting President Donald Trump’s complaints that he's being harassed, the Supreme Court ruled Thursday in favor of a New York prosecutor’s demands for the billionaire president’s tax records. But in good political news for Trump, his taxes and other financial records almost certainly will be kept out of the public eye at least until after the November election.In a separate case, the justices kept a hold on banking and other documents about Trump, family members and his businesses that Congress has been seeking for more than a year. The court said that while Congress has significant power to demand the president’s personal information, it is not limitless.The court turned away the broadest arguments by Trump’s lawyers and the Justice Department that the president is immune from investigation while he holds office or that a prosecutor must show a greater need than normal to obtain the tax records. But it is unclear when a lower court judge might order the Manhattan district attorney's subpoena to be enforced.Trump is the only president in modern times who has refused to make his tax returns public, and before he was elected he promised to release them. He didn't embrace Thursday's outcome as a victory even though it is likely to prevent his opponents in Congress from obtaining potentially embarrassing personal and business records ahead of Election Day.In fact, the increasing likelihood that a grand jury will eventually get to examine the documents drove the president into a public rage. He lashed out declaring that “It's a pure witch hunt, it's a hoax\" and calling New York, where he has lived most of his life, “a hellhole.”The documents have the potential to reveal details on everything from possible misdeeds to the true nature of the president’s vaunted wealth – not to mention uncomfortable disclosures about how he’s spent his money and how much he’s given to charity.The rejection of Trump’s claims of presidential immunity marked the latest instance where his broad assertion of executive power has been rejected.Story continuesTrump’s two high court appointees, Justices Neil Gorsuch and Brett Kavanaugh, joined the majority in both cases along with Chief Justice John Roberts and the four liberal justices. Roberts wrote both opinions.\"Congressional subpoenas for information from the President, however, implicate special concerns regarding the separation of powers. The courts below did not take adequate account of those concerns,\" Roberts wrote in the congressional case.But Roberts also wrote that Trump was asking for too much. “The standards proposed by the President and the Solicitor General—if applied outside the context of privileged information—would risk seriously impeding Congress in carrying out its responsibilities,\" the chief justice wrote.The ruling returns the congressional case to lower courts, with no clear prospect for when it might ultimately be resolved.Promising to keep pressing the case in the lower courts, House Speaker Nancy Pelosi said Thursday's decision “is not good news for President Trump.”“The Court has reaffirmed the Congress’s authority to conduct oversight on behalf of the American people,” Pelosi said in a statement.The tax returns case also is headed back to a lower court. Mazars USA, Trump's accounting firm, holds the tax returns and has indicated it would comply with a court order. Because the grand jury process is confidential, Trump's taxes normally would not be made public.Yahoo Finance’s The Market Wake-UpManhattan District Attorney Cyrus Vance Jr. said his investigation, on hold while the court fight played out, will now resume.“This is a tremendous victory for our nation’s system of justice and its founding principle that no one — not even a president — is above the law, \" Vance said said.Even with his broadest arguments rejected, Jay Sekulow, Trump’s personal lawyer, said he was pleased that the “Supreme Court has temporarily blocked both Congress and New York prosecutors from obtaining the President’s financial records. We will now proceed to raise additional Constitutional and legal issues in the lower courts.”Justice Samuel Alito, who dissented with Justice Clarence Thomas in both cases, warned that future presidents would suffer because of the decision about Trump's taxes.“While the decision will of course have a direct effect on President Trump, what the Court holds today will also affect all future Presidents—which is to say, it will affect the Presidency, and that is a matter of great and lasting importance to the Nation,\" Alito wrote.The case was argued by telephone in May because of the coronavirus pandemic.The fight over the congressional subpoenas has significant implications regarding a president’s power to refuse a formal request from Congress. In a separate fight at the federal appeals court in Washington, D.C., over a congressional demand for the testimony of former White House counsel Don McGahn, the administration is making broad arguments that the president’s close advisers are “absolutely immune” from having to appear.In two earlier cases over presidential power, the Supreme Court acted unanimously in requiring Richard Nixon to turn over White House tapes to the Watergate special prosecutor and in allowing a sexual harassment lawsuit against Bill Clinton to go forward.In those cases, three Nixon appointees and two Clinton appointees, respectively, voted against the president who chose them for the high court. A fourth Nixon appointee, William Rehnquist, sat out the tapes case because he had worked closely as a Justice Department official with some of the Watergate conspirators whose upcoming trial spurred the subpoena for the Oval Office recordings.The subpoenas are not directed at Trump himself. Instead, House committees want records from Deutsche Bank, Capital One and Mazars.Appellate courts in Washington, D.C., and New York brushed aside Trump's arguments in decisions that focused on the fact that the subpoenas were addressed to third parties asking for records of his business and financial dealings as a private citizen, not as president.Two congressional committees subpoenaed the bank documents as part of their investigations into Trump and his businesses. Deutsche Bank has been one of the few banks willing to lend to Trump after a series of corporate bankruptcies and defaults starting in the early 1990s.Vance and the House Oversight and Reform Committee sought records from Mazars concerning Trump and his businesses based on payments that Trump’s former personal lawyer, Michael Cohen, arranged to keep two women from airing their claims of decade-old extramarital affairs with Trump during the 2016 presidential race.___Associated Press writer Zeke Miller contributed to this report."}]}