{"article": [{"url": "https://finance.yahoo.com/news/us-indicts-chinese-hackers-for-stealing-us-and-international-company-data-183259081.html", "published": 1595338820.0, "headline": "US indicts Chinese nationals for stealing data from companies —some working on COVID-19", "body": "The U.S. Department of Justice on Tuesday accused two “prolific” Chinese hackers of stealing terabytes of data in a global computer intrusion campaign that allegedly targeted domestic and international companies, including American companies working on COVID-19 testing, treatment and vaccines.In a virtual press conference with reporters, Assistant Attorney General for National Security John C. Demers announced the charges —originally filed on July 7 — against defendants Li Xiaoyu and Dong Jiazhi.The indictment, filed in the Eastern District of Washington, alleges that the hackers’ illegal activity spanned over a decade, from September 2009 to July 2020, and was supported by the Chinese government.“There's been a huge array of sensitive and valuable trade secrets, technology, data, information, personal individual information, that has been stolen by hackers operated from China, both for their own gain, and with the assistance and the benefit of the Chinese government's Ministry of State Security (MSS),” U.S. Attorney William D. Hyslop for the Eastern District of Washington told reporters.The charges arrive at a time when the global race for a coronavirus vaccine is heating up, with several major U.S. firms leading the charge for a potential breakthrough. Just last week, the U.S. also accused Russia of attempting to hack COVID-19 research.Although the hackers also recently researched vulnerabilities of biotech firms working on COVID-19 related research, Demers said the DOJ does not allege that information from those firms was actually obtained.FBI Deputy Director David L. Bowdich speaks during a press conference Tuesday, July 21 to announce the unsealing of an indictment against two alleged Chinese hackers.Targeting intellectual propertyAccording to the indictment, the alleged hackers conspired with the MSS to infiltrate the systems of 13 U.S. companies and 12 international companies engaged in industries that included civil and industrial engineering, software development, pharmaceutical research and development, among others.In addition, the prosecutors said hundreds of victim companies were targeted. Li allegedly threatened to expose a target victim’s stolen source code on the internet unless the victim transferred to Li $15,000 in cryptocurrency.Story continues“The campaign targeted intellectual property and confidential business information held by the private sector, including COVID-19-related treatment, testing, and vaccines. Hackers also targeted the online accounts of non-government organizations and individual dissidents, clergy, and democratic and human rights activists in the United States, China and Hong Kong,” Demers said.In total, the defendants together with the Chinese government are responsible for stealing hundreds of millions of dollars worth of trade secrets, intellectual property, and other valuable information, Hyslop said.Two pharmaceutical companies located in Massachusetts and California are listed in the complaint, along with a medical device manufacturer in Massachusetts.The alleged breaches infiltrating pharmaceutical companies are said to have taken place between February and March of 2019, before the outbreak of COVID-19. Breaches impacting the device company occurred during the same time period, as well as in January 2020.Demers also blasted China’s 2025 “Made in China” plan, calling it as much of a roadmap to theft as it is a guide to innovation.“The indictment specifically outlines how stealing intellectual property from the companies in these high-tech industries can help Chinese companies replicate the targeted technology and eventually edge out their non-Chinese competitors,” he said.The comment echoed those of Attorney General William Barr who on Friday held a press conference to warn American companies of Chinese companies that seek to exploit American know-how.FBI Deputy Director David L. Bowdich said despite the Chinese government’s state sponsorship of “economic coercion,” the indictment does not mean that the U.S. should avoid doing business with China, or welcoming Chinese students or visitors.“Our concern is not with the Chinese people, or Chinese Americans,” Bowdich said. “What we are concerned about is with the Chinese government and the Chinese Communist Party.”He warned other nations that they should closely consider their alliances with China based on its government’s “little regard for international law.”Alexis Keenan is a legal reporter for Yahoo Finance and former litigation attorney. Follow Alexis Keenan on Twitter @alexiskweed.[Click here for more of Yahoo Finance’s coronavirus coverage: Personal finance tips, news, policy, graphics & more from Yahoo Finance]Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news."}]}