{"article": [{"url": "https://finance.yahoo.com/news/jeffrey-gundlach-says-base-case-is-trump-wins-re-election-215711167.html", "published": 1597165520.0, "headline": "Gundlach, who called Trump's 2016 election, predicts he'll win again", "body": "Billionaire bond investor Jeffrey Gundlach, who accurately predicted Donald Trump's presidency in early 2016 before the Republican primaries concluded, believes the president will win re-election.\"My base case is actually that Donald Trump will win re-election,\" Gundlach said during a Q&A on a webcast for his firm DoubleLine Capital's closed-end funds on Tuesday afternoon.The 60-year-old billionaire said he'd \"bet against\" former Vice President Joe Biden defeating Trump in November.\"I think polls are very, very squishy right now because of the highly toxic political environment in which we live,\" Gundlach said. Gundlach said he’s come across data suggesting that about \"two-thirds of conservatives or moderate conservatives say that they have lied about their support for Donald Trump either directly or by omission.\"\"I just think there's a lot, a lot of time here. There's going to be twists and turns,\" Gundlach added.For markets, he expects \"significant\" volatility, usually the case close to a presidential election.\"This go-around, I expect much greater volatility around the election as the progressive policies, so-called, of tremendous increased deficit spending for basically wealth manipulation, that could get pretty heated, and we'll see what happens.\"On Tuesday, Biden announced Sen. Kamala Harris, D-Calif., as his vice-presidential running mate.Later on the call, Gundlach said he didn't think Harris was a \"good pick,\" adding that Harris is \"maybe a little too charismatic.\"\"She might be a little bit dominant with her personality, but I don't have any particular thoughts on Kamala Harris. I'm not surprised that she's the pick.\"Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Ackman looks to ‘marry a unicorn’ with record-breaking SPACAckman sees ‘real recovery’ in back half of 2021, remains upbeat of offices and restaurantsPalihapitiya: Skip government bailouts, put ‘more money into the hands of consumers’Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investorsBillionaire Palihapitiya on the phenomenon of ‘spectacular’ AOCRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}