{"article": [{"url": "https://finance.yahoo.com/news/this-is-getting-out-of-control-says-infectious-disease-expert-about-coronavirus-155239045.html", "published": 1594033220.0, "headline": "‘This is getting out of control,’ says infectious disease expert about coronavirus", "body": "As coronavirus cases spike across the country, one infectious disease expert says the wave of outbreaks is “getting out of control,” as economies and businesses reopen and some states see social distancing standards relax.“There is an old adage in infectious disease that a virus isn’t going anywhere until it’s eliminated everywhere,” Dr. Michael Saag, director of the Infectious Disease Division at the University of Alabama at Birmingham School of Medicine, told Yahoo Finance.“Why don’t we direct our attention on all of us working together to have everybody wear a mask, stay at home at least for the time being,” he said. “Sorry, I know it’s not fun. But this is getting out of control.”The United States is rapidly approaching 3 million positive coronavirus cases according to the Johns Hopkins University COVID-19 tracker, as the average case count in the country hits another record high.“I’m afraid that the status quo is not going to cut it from this point forward,” said Saag. “At least for the next eight weeks. So we’re going to probably have to do something different.”Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases (NIAID), warned last week that daily case counts could skyrocket to 100,000 coronavirus cases a day if measures weren’t taken to curb the virus.“All of the southern states — and some others — basically became Missouri. They’re the ‘show-me’ state. They didn’t believe this was real,” Saag said. “Guess what. It’s very real. So we’ve got to buckle down and take care of ourselves, or else we might see another doubling of the cases up to 100,000 as Dr. Fauci said.”Saag said that even amid spiking case counts, there is a “window of opportunity” to get coronavirus under control. The infectious disease expert said we should all behave as if we were “80 years old with underlying health conditions.” If we did, he explained, we would all “stay at home, avoid large crowds, and wear a mask everywhere we go.”Story continues“All of us want to avoid another shelter at home environment,” he said, “but if we don’t get this right, we’re headed that way.”Most concerning to Saag is the “overwhelming” of health care systems. “Hospitals are starting to fill up here in the South,” he said.“All of us are worried about that,” he said. “And that’s a nightmare scenario — there is not going to be any room at the end. And patients won’t be able to get in with or without COVID.”Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:A Harvard student's brainchild creates a pipeline for Black finance hopefulsIncreasing number of Republican states projected to see a spike in coronavirus deathsCompanies ‘haven’t done the work’ around diversity and inclusion: Bozoma Saint JohnBiden outraises Trump for month of May amid coronavirus, George Floyd protests‘We need more funding for police’: Missouri AG SchmittRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}