{"article": [{"url": "https://finance.yahoo.com/news/tenet-us-release-will-reveal-are-americans-ready-to-go-back-to-movie-theaters-125449925.html", "published": 1599120140.0, "headline": "'Tenet' U.S. release will reveal: Are Americans ready to go back to movie theaters?", "body": "After three release date delays amid the COVID-19 pandemic, Warner Bros. released the Christopher Nolan action thriller “Tenet” last weekend in 41 overseas markets, and the movie beat expectations.“Tenet” generated $53 million in ticket sales in its opening weekend, topping initial projections of $40 million. That opening is not so far from the $62 million U.S. opening weekend box office rake of Nolan’s film “Inception” in 2010. The top markets for “Tenet” were the U.K. and France.But America could tell a different story.Thursday marks the official release of “Tenet” in the U.S., which has handled the virus worse than most other countries. The movie is playing only in areas of the country where theaters are open—notably, that does not yet include New York City or Los Angeles.Theaters are allowed to open in 42 states, including Connecticut, Massachusetts, Pennsylvania, Colorado, and Ohio. (AMC this week said that 70% of its U.S. theaters will be open in time for Labor Day weekend, news that sent AMC shares soaring.) Some 33,000 theaters (nearly 90% of U.S. theaters) are following “CinemaSafe,” a set of COVID-19 cleaning protocols from the National Association of Theatre Owners, akin to the “Safe Stay” cleaning guidelines that U.S. hotels are using.“We’re expecting good things [for “Tenet”] based on the international markets,” says John Partilla, CEO of Screenvision, which sells the ads and other content that runs before movies in theaters. Partilla cites a recent survey from Atom Tickets in which 74% of U.S. moviegoers said they will feel ready to go see a movie in the first month of theaters reopening in their state.People take their seats inside the Odeon Luxe Leicester Square cinema, on the opening day of the film \"Tenet\", amid the coronavirus disease (COVID-19) outbreak, in London, Britain, August 26, 2020. REUTERS/Henry NichollsBut in a time when Universal put “Trolls World Tour” straight to digital rental for $20 and made more in one week than the first “Trolls” movie made in theaters in five months, and after Disney caved and will put its live-action “Mulan” (expected to be a mega blockbuster pre-pandemic) straight to Disney+ for $30 this weekend, expectations across the movie industry are being recalculated.Story continuesSome think the pandemic will create a landscape where only guaranteed blockbusters (think Star Wars, Marvel, Pixar, and “Fast & Furious” installments) will get theatrical releases, and indie films and romantic comedies will go straight to streaming.“Everything has changed in the land of COVID, at least temporarily,” Partilla says. “I do think in the beginning months, people may be more drawn or compelled to see those large, majestic action movies that really demand the large screen... but I think ultimately, over time, people will be drawn out to see every kind of movie.”After Labor Day weekend, the numbers from “Tenet” should give an initial sense of whether a large portion of Americans feel ready to go see a movie inside a theater. And with “Mulan” hitting Disney+ on Friday, expect industry debate over whether Warner Bros or Disney made the smarter decision.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is affecting the entertainment industry:'Mulan' and 'Tenet' release dates affect the entire movie theater businessCoronavirus puts 'extreme pressure' on all three pillars of Disney's businessDisney's 'Mulan' will look to Christopher Nolan's 'Tenet' as a movie theater health testCoronavirus is forcing Quibi, NBC Peacock to change their plans at launch'Trolls World Tour' rental success does not spell death for movie theatersMovie theaters seek bailout as coronavirus devastates business"}]}