{"article": [{"url": "https://finance.yahoo.com/news/billionaire-investor-mario-gabelli-explains-problem-with-tesla-stock-125040865.html", "published": 1599033500.0, "headline": "Billionaire investor Mario Gabelli explains ‘problem’ with Tesla stock", "body": "Tesla (TSLA) stock has soared amid the coronavirus outbreak, rising more than 250% since March and tripling the net worth of chief executive Elon Musk.But billionaire value investor Mario Gabelli warned in a recent interview of a “problem” with the stock, predicting that the company will struggle to sell the massive amount of electric cars necessary to justify its skyrocketing valuation.Gabelli, the chairman and CEO of investment firm AMCO, lauded Musk as “phenomenal” and described electric vehicles as “the holy grail” in the current shift toward a green economy. But he cautioned that trends in car sales won’t allow Tesla to live up to its market cap, now north of $440 billion.“You have about five years to grow into that valuation,” says Gabelli, who spoke to Yahoo Finance on Aug. 25, prior to the company’s 5-1 stock split on Monday.Gabelli draws on expertise in the sector, having started his career in the 1970s as an analyst focused on automotive and agricultural equipment.He said he expects an increase in the annual global production of cars in coming years, but emphasized the limited portion of those vehicles likely to be electric.“Today in the world, we're going to produce 80, 90 million,” he says. “By the year 2025, let's go to 100 million. Are we’re going to have 10%, or 10 million, of those electric?”The number of cars sold in major markets worldwide fell more than 4% last year to 90.3 million, according to market analysis firm LMC Automotive; meanwhile, IHS Markit projected auto sales will fall 22% year-over-year in 2020 due to the coronavirus.Electric cars made up 2.6% of global sales last year, the International Energy Agency found.The share of overall car sales made up by electric cars is expected to grow over the next decade, but infrastructure changes such as additional charging stations and costs posed by batteries could slow the rise, a JPMorgan Chase note warned in 2018.An analysis by Fortune found that in order for Tesla to justify its heightened valuation it would need to generate $204 billion in annual revenue by 2030, which would amount to 3.5 million electric vehicles sold at $58,000 each. Last year the company reported $24.6 billion in revenue — and didn’t turn a profit.Story continuesBut Tesla bulls contend the stock has institutional backers beyond retail momentum traders, and the company’s announcement on Tuesday of $5 billion worth of shares raised from 10 top banks suggests the company has support from major lenders.Chairman and CEO of GAMCO Investors, Inc. Mario Gabelli speaks at the Reuters Global Investment Summit in New York, November 19, 2015. REUTERS/Brendan McDermidWhile bearish on Tesla, Gabelli acknowledged the importance of electric vehicles as part of the shift toward a green economy.“Today, electric vehicles are the holy grail of the environment that we're all a part of,” he says. “Just think about 100 years ago when Henry Ford came down with the assembly line, the Model T.”Gabelli spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Even if he’d rather not invest in Tesla, Gabelli praised Musk.“Elon Musk, when you think of SpaceX, when you think about what he does, in quotes ‘the boring’ capability of drilling tunnels,” Gabelli says. “Think about the ingenuity that he's brought to this company.”“It's phenomenal,” he adds.Read more:Stock market factoring in ‘smooth ride’ to economic recovery: Edward Jones execCoronavirus vaccine 'possible' by winter: Top Harvard scientistBill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}