{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-8-2020-111841832.html", "published": 1599578480.0, "headline": "Stock market news live updates: S&P 500 drops to the lowest level in a month as tech rout continues", "body": "Stocks fell Tuesday, with the three major indices logging their third straight sessions of losses as last week’s tech-led selloff rolled on.[Click here to read what’s moving markets heading into Wednesday, September 9]Shares of mega-cap technology stocks extended declines as investors continued to rotate away from the equity leaders of the past several months. Shares of Facebook (FB), Amazon (AMZN) and Apple (AAPL) were each off by at least 4%. Tesla (TSLA) shares slid by the most ever after the company was bypassed for S&P 500 inclusion, and as competitor Nikola (NKLA) inked a strategic partnership with General Motors (GM). The Nasdaq sank 4% on the day.“The sell-off in risky assets has been concentrated in US Tech and momentum stocks, while credit has been more resilient and outperformed its beta to equity,” according to a note from Goldman Sachs strategists over the weekend. “This is likely due to the unwinding of some of the popular positions into the largest US stocks. In fact, the US equity rally has been very concentrated so far with very low breadth.”“While aggregate US equity future net length is not very stretched, Nasdaq net equity future positioning is close to historical highs,” the analysts said. They added that an increase in the 10-year Treasury yield off the pandemic-era lows also likely triggered a rotation out of longer-duration stocks, including growth and tech names.Still, the analysts added they “expect the current bull market to continue as the improved growth outlook coupled with supportive monetary policies should maintain the search for yield elevated and foster a compression of the ERPs [equity risk premiums].”Elsewhere, investors eyed developments on the Covid-19 vaccine front. Tuesday morning, the CEOs of some of the pharmaceutical companies front-running the race toward creating on a vaccine wrote a public letter vowing to avoid cutting corners in the development process, even as they work with an expedited timeline to try and quickly distribute an inoculation.Story continues“In the interest of public health, we pledge to always make the safety and well-being of vaccinated individuals our top priority,” according to the letter, signed by the CEOs of companies including AstraZeneca (AZN), Johnson & Johnson (JNJ) and Moderna (MRNA).In news conference yesterday, President Donald Trump said he believed a Covid-19 vaccine could be approved as soon as October. Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases said seeing a vaccine receive approval by October was “unlikely” but “not impossible,” according to a recent interview with CNN.—4:07 p.m. ET: S&P 500 drops to the lowest level in a month, Nasdaq slides 4% as tech rout continuesHere were the main moves in markets as of 4:07 p.m. ET:S&P 500 (^GSPC): -95.12 (-2.78%) to 3,331.84Dow (^DJI): -632.42 (-2.25%) to 27,500.89Nasdaq (^IXIC): -465.44 (-4.11%) to 10,847.69Crude (CL=F): -$2.88 (-7.24%) to $36.89 a barrelGold (GC=F): +$5.70 (+0.29%) to $1,940.00 per ounce10-year Treasury (^TNX): -3.7 bps to yield 0.6840%2:35 p.m. ET: Stocks hold lower, Dow drops 450+ pointsThe three major indices held sharply lower Tuesday afternoon, with less than 90 minutes left of the regular trading session. However, the indices came back slightly from session lows, at which point the Dow was off by as many as 632 points, or 2.2%.The information technology, energy and financials sectors led the drop in the S&P 500, as every major sector sank. Shares of Apple, Boeing and Microsoft lagged in the Dow.—11:54 a.m. ET: US crude oil futures plunge by most since AprilCrude oil prices plunged alongside equities as a risk-off tone overtook markets. US West Texas intermediate crude oil futures for October delivery (CL=F) dropped 8% shortly before noon in New York, for the commodity’s worst one-day decline since April 27.—9:45 a.m. ET: Virgin Galactic shares rise 2% after UBS initiates Buy rating on stock, citing first-mover advantageVirgin Galactic (SPCE) shares rose Tuesday morning after UBS initiate coverage on shares of the newly public space tourism company with a Buy rating and $25 price target, implying 57% upside from Friday’s closing prices.Shares of Virgin Galactic are up 38% for the year to date, even after falling 29% since the beginning of August.“We see Virgin Galactic as the only way for consumers to gain entry into the ~560 member astronaut club in the next 5 years,” the analysts said. “There will be competitors, but the curation of the VG product from marketing to life-long brand connection, in addition to an operating model supporting a uniquely high flight-rate, separates the VG experience from the others.”The analysts added they expected Virgin Galactic to kick off commercial service in 2021, and they see space tourism growing into a $3 billion per-year industry by 2030. An even larger addressable market exists in the transportation industry supersonic flight, which is another area Virgin Galactic is working to tap into, they added.—9:36 a.m. ET: Tesla shares slide 16% after share sale, S&P 500 exclusion; Competition with Nikola heats upTesla (TSLA) shares slid 16% shortly after market open Tuesday morning for its worst one-day drop since March. This came after the S&P 500 committee decided late Friday not to include the stock in the blue-chip index, in a surprise move after the electric car-maker delivered its fourth consecutive quarterly profit in July.Separately, Tesla announced Tuesday that it had completed a $5 billion share sale as of Friday, with settlement of shares sold expected to be completed by Wednesday. The dilution added to the negative sentiment around the stock Tuesday.The stock also came under pressure after competitor Nikola (NKLA) announced a strategic partnership with General Motors (GM), giving the latter an 11% stake in the company. Analyst Dan Ives of Wedbush called the partnership “potential game changing deal,” with Nikola “importantly getting access to the GM battery and fuel cell technology/infrastructure to help produce the Badger and its core line of semi trucks over the coming years,” according to a note Tuesday morning.—9:33 a.m. ET: Stocks open lower, Nasdaq sinks 3%Here were the main moves in markets, as of 9:34 a.m. ET:S&P 500 (^GSPC): -70.97 points (-2.07%) to 3,355.99Dow (^DJI): -449.3 points (-1.6%) to 27,684.01Nasdaq (^IXIC): -359.85 points (-3.18%) to 10,960.89Crude (CL=F): -$2.58 (-6.49%) to $37.19 a barrelGold (GC=F): -$13.70 (-0.71%) to $1,920.60 per ounce10-year Treasury (^TNX): -4.6 bps to yield 0.677%—7:16 a.m. ET Tuesday: Stocks pace toward a third straight day of lossesHere were the main moves in equity markets, as of 7:16 a.m. ET:S&P 500 futures (ES=F): 3,398.75, down 18.75 points or 0.55%Dow futures (YM=F): 28,058.00, down 16 points or 0.06%Nasdaq futures (NQ=F): 11,341.5, down 207.25 points, or 1.79%Crude (CL=F): -$2.09 (-5.26%) to $37.68 a barrelGold (GC=F): -$11.00 (-0.57%) to $1,923.30 per ounce10-year Treasury (^TNX): -3.3 bps to yield 0.69%Traders work on the floor at the closing bell of the Dow Industrial Average at the New York Stock Exchange on March 11, 2020 in New York. - Wall Street stocks dove deeper into the red in afternoon trading on March 11, 2020, with losses accelerating after the World Health Organization declared the coronavirus a global pandemic. Near 1710 GMT, the Dow Jones Industrial was down more than 1,200 points, or 5.0 percent, at 23,777.17. The broad-based S&P 500 slumped 4.6 percent to 2,749.88, while the tech-rich Nasdaq Composite Index tumbled 4.4 percent to 7,979.15. (Photo by Bryan R. Smith / AFP) (Photo by BRYAN R. SMITH/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}