{"article": [{"url": "https://finance.yahoo.com/news/walmart-and-target-huge-ecommerce-gains-are-a-blaring-siren-to-brickandmortar-retail-192709224.html", "published": 1597761320.0, "headline": "Walmart and Target huge e-commerce gains are a blaring siren to brick-and-mortar retail", "body": "It’s no shock that amid the ongoing pandemic, retailers are seeing e-commerce sales surge. But even so, the numbers are eye-popping.Walmart reported blowout Q2 earnings on Tuesday, led by a 97% surge in online sales. That comes after Walmart’s online sales rose 74% in Q1. The chain, which was criticized years ago for being too slow to beef up its online presence, has been on an e-commerce hot streak since before the pandemic and is now a formidable online sales foe to Amazon, which saw its net sales rise 40% in Q2.The stay-at-home era has served as a tide to lift many e-commerce boats: Target reported a huge Q2 earnings beat on Wednesday, with its online sales up 195%. That’s after a stellar first quarter when Target saw its online sales spike 141%, and said that in April alone, online sales were up an astonishing 282%.Even Etsy (ETSY), which due to its size is rarely compared to giants like Amazon (AMZN), Walmart (WMT), and Target (TGT), saw its Q2 sales (which are entirely online) rise 137%, driven by mask purchasing, which comprised 14% of all sales in the quarter.Overall, U.S. e-commerce grew 44.5% in Q2, the biggest quarterly growth in more than 20 years.That e-commerce surge stands in brutally sharp contrast to the headlines in brick-and-mortar: bankruptcy filings galore, including Lord & Taylor, Men’s Wearhouse parent Tailored Brands, Ann Taylor and Lane Bryant parent Ascena Retail, Lucky Brand Jeans, and The Paper Store, all in the past two months.People wearing face coverings wait in line to shop at Walmart, July 22, 2020 in Burbank, California. (Photo by Robyn Beck / AFP)None of this is very surprising at first glance.As Americans continue to work from home and socially distance, they’re shopping online, and also beginning to make more than just essential purchases online. U.S. retail sales rose 1.2% in July, which was less than predicted but marked the third straight month that spending rose, a good sign of economic recovery. Consumers are shopping again, but doing it mostly online.So, this massive e-commerce surge can be largely chalked up to the pandemic.Story continuesThe scarier question for traditional brick-and-mortar retailer is: What if it isn’t?According to Department of Commerce statistics, e-commerce makes up just 16.1% of total U.S. retail spending. But the direction of the trend is obvious. One year ago, e-commerce was 10.8% of U.S. retail. Just a few years ago, retail chains were encouraged to have an online presence as an addition to their physical presence; then over time, the buzzword became an “omni-channel” approach; soon, if it isn’t the case already, a chain’s e-commerce platform is going to be more important than its physical footprint.A strong e-commerce platform is table stakes for all retailers now, period. Peter Tchir, head of macro strategy at Academy Securities, noted on Yahoo Finance Live on Tuesday: “Walmart would be insane not to look at Amazon’s valuation and commit billions and billions to some sort of better online experience.”That’s bad news for stores like TJ Maxx (TJX) and Ross Stores (ROST), both of which have been dinged for their weak e-commerce platforms, and both of which also report Q2 earnings this week.A general view of Lord & Taylor in Mizner Park, one of the nation's oldest department store chains, has started liquidating 19 of its 38 stores. The retailer filed for Chapter 11 bankruptcy protection Sunday, joining the growing list of retailers who say they were impacted by temporary store closures amid the coronavirus pandemic, as Florida's Covid-19 surgeon August 6, 2020 in Boca Raton, Florida. Credit: mpi04/MediaPunch /IPXWalmart’s report also sheds light on what items Americans are buying online: everything, including food. Walmart says its online grocery pickup ordering “continued to experience all-time high sales volumes” in Q2. Walmart’s profit, which some analysts expected to suffer due to shoppers buying lower-cost items, also beat expectations. Walmart saw fewer total transactions (down 14%), but bigger totals at checkout (average ticket price rose 27%), thanks to shoppers buying pricier items (often with their stimulus checks) like electronics, outdoor furniture, and sporting goods.Even as many retail chains re-open their doors or extend their open hours (as Walmart and Dick’s have both done in the past month), the breakdown between digital sales and physical sales will be a fascinating focal point for the 2020 holiday shopping season.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Amid pandemic, Walmart says it’s seeing increased sales of tops—but not bottomsEtsy CEO on huge Q2: Etsy is 'becoming much more mainstream'Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’Facebook ad boycott is ‘more noise than fundamental risk’Goya Foods faces consumer boycotts after CEO praises TrumpAmazon extends its deal to stream NFL games, even with next NFL season in doubt"}]}