{"article": [{"url": "https://finance.yahoo.com/news/ll-cool-j-stock-market-highs-are-pointless-if-the-us-is-not-morally-sound-121519377.html", "published": 1592637800.0, "headline": "LL Cool J: Stock market highs are pointless if the US is not 'morally sound'", "body": "Grinding away on the last minute details of a major brand launch didn’t stop hip-hop icon LL Cool J from capturing the outrage of the nation on racial injustice in one two minute-plus freestyle rap on his Instagram account May 31.“For 400 years, you had your knees on our necks,” LL Cool J belted out to his 2.1 million followers, referencing the graphic video of a white police officer in Minnesota murdering George Floyd via a knee on his neck for eight minutes and 46 seconds. “A garden of evil with no seeds of respect. In America’s mirror, all she sees is regret. Instead of letting blood live, they begging for blood let.”LL Cool J drops the mic by adding, “Black lives matter, forever.”In an interview with Yahoo Finance, the 52-year-old music mogul — born James Todd Smith — explains the rap simply reflects his feelings right now.“I just feel like the world, a lot of people — the majority of people — are on the right side of history. And I feel like that small malignant group of racists are getting more and more marginalized you know, by global chemotherapy. And you know, they should because it’s wrong. This was the first time that there was no debate [killing of George Floyd], right. He didn’t go for the taser. Did he grab something? He did not. He didn’t move or resist in that eight minutes and 46 seconds, no debate. I think that was the catalyst — I think that really just was a turning point for the globe,” LL Cool J says.LL Cool J adds the video served as a wakeup call to the country that racism still very much exists and needs to be addressed more strongly.“I think people said hey wait a minute, you guys are really treating these people bad. And so, I think ultimately we are one step closer to solving this problem. I don’t think racism will ever totally go away, but I think it can be controlled. And I think it can be pushed back over in the corner where it belongs and ultimately destroyed. But I think things will get better,” LL Cool J says.Story continuesAnd LL Cool J himself offered up his own wakeup call to investors (who have sent the stock market back near record highs) — respect what’s happening out there on the streets.“The Dow could be at 100,000 right now. Yes, everybody who is part of the market would be over the moon, but if the morale [in the country] was lower than it has ever been, it's still not right. It doesn't feel good. What is the point,” says LL Cool J. “I think we not only have to be financially sound as a country we have to be morally sound, you know. I think none of us are perfect we are all a work in progress, but at least morally sound to a certain extent.”LL’s latest ventureThe singer, actor, husband and father of four is coming off the launch of his Rock The Bells brand this week.Rock The Bells — paying homage to the name of one of LL Cool J’s biggest hits — targets the Gen X fans of classic hip-hop through a website that features written and video content from the legends of hip-hop such as Big Daddy Kane, Run DMC, Eric B, Salt-N-Pepa, Fab 5 Freddy, Risk, Crazy Legs, Roxanne Shanté and Jonathan Mannion. All nine were hand-selected by LL Cool J to receive ownership in Rock The Bells brand. There is also a carefully curated marketplace on Rock The Bells dedicated to buy limited-edition products synonymous with the classic hip-hop era.LL Cool J performs on day three at Lollapalooza in Grant Park on Saturday, Aug 4, 2018 in Chicago. (Photo by Rob Grabowski/Invision/AP)While LL Cool J is hard at work with RTB (as it’s becoming known) and acting on NCIS, he is still a musician at heart... and a musician that just inked a new deal with his long-time label Def Jam Records back in September. He hasn’t released a new album in more than seven years, but tells Yahoo Finance he is working on something new.LL Cool J won’t commit to it being an album squarely focused on the social issues being addressed across the nation at the moment. Instead in typical LL Cool J form, he will just let the creativity flow.“I'm inspired to create right like there's no prediction,” LL Cool J says, adding, “One thing will be clear though, it will be true, it won’t be me pretending or a facade of any sort.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J says it's about time Juneteenth is recognized by people and corporationsLL Cool J on his Rock The Bells brand and hip-hop: 'It's time for us to lift up our own'Magic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}