{"article": [{"url": "https://finance.yahoo.com/news/the-main-focus-for-everybody-right-now-is-survival-unemployed-latina-millennial-111551107.html", "published": 1594103000.0, "headline": "'The main focus for everybody right now is survival': unemployed Latina millennial", "body": "Latina dress designer Diana Osorio is stuck in her Bushwick, Brooklyn, apartment unable to travel selling her handmade dresses at festivals and apparel shows.“The main focus for everybody right now is survival — buying food and the essentials,” Osorio tells Yahoo Finance.Dress designer Diana Osario sewing dresses she designs from her Brooklyn apartment. The founder of conamorbydiana.com says her business was impacted by the pandemic.The 34-year old native of Colombia, founder of conamorbydiana.com, says she sold about 60 of her versatile dresses last year for $400 each — but demand came to a screeching halt due to the pandemic. Osorio also lost her part-time job at a shop in Manhattan when the city forced non-essential businesses to close amid the outbreak. Since then, Osorio says she’s burned through the government stimulus check, plus another $2,000 of savings a month until finally receiving unemployment benefits in June.“I was calling, calling, calling,” said Osorio. She says the claims help line was busy every day, for two weeks straight.Disproportionately higher unemployment rateThe latest jobs report shows unemployment for Hispanics in June at 14.5%. While the rate has ticked down each month from the height of the pandemic in April, Hispanics are still unemployed at a disproportionately higher rate than other populations, along with African Americans, which have the highest rate among minorities of 15.4%.“The last recession it was a slow climb for Latino communities and other communities of color to get back to where they were, “ said Orson Aguilar of UnidosUS Action Fund, a Latino advocacy group. “Here we’re going to see something very similar because we’re seeing signs of job closure, and a lot of businesses are realizing that it is a good time to automate and be productive with fewer head count.”Musician and event planner Camila Celin says her gigs were all cancelled due to the pandemic. She is playing instruments online but says those events don't pay as much as live concerts.While many Hispanics work in essential jobs, businesses in non-essential areas are taking the longest to re-open, making the recovery for the unemployed Hispanics in those sectors slower.Musician and event producer Camilia Celin, also originally from Colombia, says she was making the most money of her career before the pandemic hit.Story continues“Over, completely over, completely over. Nothing,” said Celin. Her concerts have been cancelled or postponed until next year.Celin is also on unemployment, relying on the extended unemployment benefits set to expire in July.“Right now, if they take that away from me, I wouldn’t know how I would pay all my bills basically,” said Celin.Diana Osario began making masks when the pandemic hit, selling them to friends and family. ‘We have to grow from this’Both Celin and Osorio are putting their talents to work in other ways.“The normal human thing to do is adaptation,” said Osorio. She’s adapting by making handmade masks for friends and family, and collaborating with other artists for future projects.“It’s not like unemployment is making me chill and not do anything. I’m working on my own things. I’m working on myself and developing,” said Osorio. “We have to grow from this.”Celin is using this time to work on her solo sets and planning socially distanced events, as well as live-streaming gigs.“We’ve been doing festivals online, but the amount money that we get is so much less than what we would get in a general concert,” said Celin.“When I came to his country I didn’t even speak English,” says Celin. “I’m a hustler, so I’m sure I’ll invent things,” she added.Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreCrude supply 'dwarfed' by cuts in demand: oil watcherThere's a risk of a lost decade here:' former IMF adviserDon't expect shale to rise like a 'phoenix from the ashes': Oil expertThree reasons why things are looking up for homebuilder LennarFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}