{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-the-battle-is-going-to-be-very-long-doctor-warns-151254678.html", "published": 1595067620.0, "headline": "'We need to be prepared' for coronavirus surges, doctor warns", "body": "The coronavirus pandemic has wreaked havoc across the U.S. and is not showing signs of slowing down despite some stay-at-home orders and face mask mandates.“The battle is going to be very long, and we in Massachusetts are preparing for a second surge,” Dr. Jon Santiago, an emergency medicine physician and a state representative for Massachusetts, told Yahoo Finance’s The Ticker (video above). “Many think we will get one sometime in the fall. It’s unclear how big that will be, but we need to be prepared.”Coronavirus is surging in southern U.S. (Graphic: David Foster/Yahoo Finance)‘We ... need to double down on preventative care’There have been fears of a second wave since the virus first began spreading in the U.S. at the end of January. Public health officials warned that a resurgence in the fall was a possibility and could pose a significant threat combined with flu season.“Here in Massachusetts and in New York, we’ve been able to beat back a surge effectively,” Santiago said. “I worked every Friday, Saturday, and Sunday, every week during the surge here for the past four months and we’re in a place now where we feel comfortable moving forward.”Santiago stated that over the past weekend while working an ER shift, he encountered two patients who had visited loved ones down South and tested positive for the virus after returning to Massachusetts.“There are no borders between states,” he noted. “We have to be incredibly vigilant and careful, and need to double down on preventative care … if we’re ever going to get through this.”Coronavirus cases are continuing to rise outside of New York. (Graphic: David Foster/Yahoo Finance)‘We really need to double down on behavior change’This is why, Santiago stressed, it’s more important than ever to remain vigilant.“Right now, even in the state of Massachusetts, it’s really hard for me to fathom that there’s a political will right now to really go back to a complete shutdown,” he said. “So as we open up — we just went to phase three, that’s the gyms and museums and some indoor dining — the community and the economy, we really need to double down on behavior change, mask wearing, self-quarantining, even from folks who are visiting the state.”Story continuesPeople seen walking on the beach side walk some wearing mask and some not wearing a face mask on July 06, 2020 in Miami Beach, Florida. (Photo by Johnny Louis/Getty Images)Most states have implemented mandatory face mask wearing for those venturing outdoors or entering public indoor places. Experts have said that mask wearing is a critical part of containing the spread of the virus.“Just a couple of days ago, I filed a legislation to mandate face covering when you enter outdoor places in Massachusetts,” Santiago said. “We’re going to need that across this whole country. The fact that it’s been politicized from our most important leaders up and down is concerning to me. We need to get to a place where we’re practicing social distancing, good hygiene, and mask wearing. Because in lieu of a vaccine, that’s all we have right now.”People in Domino Park are seen in circles painted as guidelines for social distancing during the outbreak of the coronavirus disease (COVID-19) in Brooklyn. REUTERS/Andrew Kelly TPX IMAGES OF THE DAY‘What can happen when there’s not enough testing’While Santiago’s state of Massachusetts is seeing a decline in cases and hospitalizations brought about by coronavirus, states in the Sun Belt region of the U.S. are experiencing the opposite.California, Texas, and Florida have become major hotspots, with Florida now the new U.S. epicenter of the coronavirus.“What we’re beginning to learn and what we’ve known for a while — particularly some of us in the health care sector — is this is a virus of epic proportion, is wreaking havoc across this entire country” Santiago said. “And what we’ve known is as states have begun to reopen, those more closely associated with a quicker reopening are now seeing what the virus has done.”Women wearing facemasks walk near a notice about maintaining social distance on the beach in Long Beach, California, on July 14, 2020. (Photo by APU GOMES/AFP via Getty Images)Texas and Florida were both states that reopened significantly earlier than most, while public health experts say that California eased restrictions too soon given its extremely high case count.“Those folks in California and Florida and Texas are now starting to see what can happen when the virus gets out of control, what can happen when there’s not enough testing,” Santiago said. “We need to move forward. Again, without a vaccine, without all the care and treatment that we have out there, we need to move forward with testing and proper surveillance and contact tracing, something we started in Massachusetts.”Contact tracing is a practice used by health departments to track those who have come into contact with an infectious disease (in this case, coronavirus) and the people those came into contact with.Florida Gov. Ron DeSantis speaks holding his facemask during a press conference to address the rise of coronavirus cases in the state, at Jackson Memorial Hospital in Miami. (Photo by CHANDAN KHANNA/AFP via Getty Images)“What we have going on in Florida, California, and Texas is very concerning and my guess is in the next week or so, you’ll see the associated hospitalizations and the deaths begin to rise with a level of new infections that we’re already seeing,” Santiago said.“We’re operating weeks, months after the fact,” he added. “These states down South and in the West, we should have been more proactive putting the resources in place as a public health crisis and not so much a political one.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Florida mayor 'very concerned' about kids going back to schoolAmericans 'are paying the price' for shoddy coronavirus response, doctor saysHow coronavirus ravaged a nursing home industry that was already 'in crisis'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}