{"article": [{"url": "https://finance.yahoo.com/news/unemployment-insurance-doesnt-cover-rent-in-most-cities-study-shows-151038651.html", "published": 1598609900.0, "headline": "Unemployment insurance doesn’t cover rent in most cities, study shows", "body": "During the coronavirus pandemic, millions of Americans applied for unemployment insurance — and quickly realized that it didn’t even cover rent.Unemployment insurance does not cover the average two-bedroom apartment rent cost in three out of every four metros in the U.S. — and it doesn’t even cover the average studio apartment rent cost in 35% of metros, according to data by Clever, a Missouri-based real estate agent matching platform. Clever used the midpoint between the maximum and minimum unemployment insurance benefits in each state to calculate income, which ranged from $30 a week in Mississippi to $1,234 a week in Massachusetts.“The biggest thing right now is that there’s so many restrictions in place. A lot more people are furloughed or unemployed because of that,” said Francesca Ortegren, a data scientist at Clever. “Who knows how long this is going to last… living on unemployment insurance for more than a couple months is really difficult as people start to use up their savings.”And in many cities, renters had little left over from unemployment insurance to pay for food, medical bills and other necessary expenses. In Jacksonville, Fla., renters had less than $1.42 left over after paying rent on a studio apartment, according to Clever’s data.“The biggest thing right now is that there’s so many restrictions in place. A lot more people are furloughed or unemployed because of that,” said Francesca Ortegren, a data scientist at Clever.Some 20% of Americans said that they relied on unemployment insurance to pay necessary expenses in July. But even more used credit cards, borrowed from friends and family, or used the $1,200 stimulus check from the Coronavirus Aid, Relief, and Economic Security (CARES) Act to bridge the gap between their expenses and their income, according to the U.S. Census Bureau.“Renters who lost their jobs are in a particularly bad spot,” said Ortegran, “and 25% of renters are using some form of unemployment to pay for their necessities. That’s a huge portion, and even more of those are worried about upcoming rent payments.”Until July 31, unemployed Americans received an extra $600 a week in unemployment insurance due to the CARES Act, which also placed restrictions on evictions. President Trump signed an executive order on August 8 adding $300-400 a week to unemployment benefits, but so far only Montana, Kentucky and West Virginia confirmed to be distributing that money.Story continues“People were able to cover their expenses with the extra $600. It helped all but two of the metros [San Jose and San Francisco]. With the extra $400, it doesn’t cover living costs in quite as many places, but it’s still helpful,” said Ortegren.Where unemployment benefits can cover rentThe best place for renters to live off of unemployment insurance is in Buffalo, N.Y., where studio apartment renters have $702.85 left over after paying rent, and two-bedroom apartment renters have $461 left over after paying rent, Clever found.In the most expensive metro areas — mostly in California and Florida — thousands of dollars spanned the gap between rent and unemployment insurance. San Francisco is the most burdened metro in the country for unemployed residents, with $1,000 in studio rent and $2,430 in 2-bedroom rent that isn’t covered by unemployment insurance.“California’s unemployment insurance [midpoint $1,061.67 monthly] is in the middle range, but it is probably the most expensive state to live in, so unemployment insurance isn’t matching the cost of living,” said Ortegren.Surprisingly, the South is also a difficult place for unemployed residents. In Nashville, Tenn., unemployment is $660 a month, leaving studio apartment renters $150 in the hole on their monthly rent payments. And in Durham, N.C., where unemployment insurance is about $790.83 a month, studio apartment renters are $30 shy of their monthly rent payments.“Unemployment insurance in the South is on the low end. In many Southern states, unemployed residents can’t pay for the cost of living, which is shocking because living costs there are particularly low.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:California wildfires threaten $11.8 billion-worth of homesCoronavirus causes a record number of hotels to default on their loans: reportThere’s a record number of vacant rental apartments in Manhattan"}]}