{"article": [{"url": "https://finance.yahoo.com/news/powell-warns-of-weak-recovery-if-policymakers-provide-too-little-covid-19-relief-144041053.html", "published": 1601970500.0, "headline": "Powell warns of 'weak recovery' if policymakers provide 'too little' COVID-19 relief", "body": "Federal Reserve Chairman Jay Powell said Tuesday that policymakers should not be afraid to offer more support to the economy, warning that too little help from Congress and the Fed risks a slower recovery from the COVID-19 crisis.“The risks of overdoing it seem, for now, to be smaller,” Powell said in prepared remarks at a National Association of Business Economics conference. “Even if policy actions ultimately prove to be greater than needed, they will not go to waste.”Powell emphasized that the recovery would be stronger if monetary policy and fiscal policy “continue to work side by side.”But with interest rates already near zero, the central bank has made it clear in recent months that Congress and the White House are better suited to address the needs of the economy at the moment.Federal Reserve Chair Jerome Powell puts on his face mask as he prepares to testify during a US Senate Senate Health, Education, Labor, and Pensions Committee hearing to examine covid-19, focusing on an update on the federal response in Washington, DC, on September 23, 2020. (Photo by KEVIN DIETSCH / various sources / AFP) (Photo by KEVIN DIETSCH/AFP via Getty Images)Nearly every member of the monetary policy-setting Federal Open Market Committee is on the record as saying that more policy support is needed from Capitol Hill. Richmond Fed President Thomas Barkin said Aug. 3 that a lack of a relief package would be a “pretty traumatic move” for the economy.‘Too little support would lead to a weak recovery’For his part, Powell has walked a tightrope with his language on fiscal policy, urging action while at the same time emphasizing the central bank’s independence.But Powell said Tuesday that policymakers should be more afraid of offering too little support than offering too much support, given the “early stage” of the economic recovery.“Too little support would lead to a weak recovery, creating unnecessary hardship for households and businesses,” Powell said.The Fed chief’s remarks come as House Democrats and Treasury Secretary Steven Mnuchin continue to negotiate over a second coronavirus relief package.As Senate Republicans worry about the size of the fiscal package, Powell has said that the middle of a pandemic is “not the time to prioritize considerations” like the debt. Down the line though, Powell has said the U.S. budget deficit will need to be dealt with.Story continuesThe Fed’s next policy-setting meeting is scheduled for Nov. 4 and 5, just after the presidential election.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed still faces questions on how high, how long it will let inflation riseFed extends ban on share buybacks at big banks through Q4Fed survey: Racial wealth gaps little changed since 2016Boston Fed's Rosengren: Further QE could help economy, but not as much as fiscal policyA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}