{"article": [{"url": "https://finance.yahoo.com/news/the-ipo-class-of-2020-122720137.html", "published": 1591860920.0, "headline": "The IPO class of 2020", "body": "The IPO class of 2020 is, so far, receiving a warm welcome from the public markets. The recent rally in equities has encouraged companies looking to debut publicly, to strike the iron while it’s hot.“They did all of their number crunching, updated their filings, and many of them are ready to go,” says Patrick Healy, CEO of Issuer Network, a consultant for companies going through initial public offerings.“The IPO window is open again,” said Healy, especially for certain industries amid coronavirus.“If you’re in tech and biotech, you’re in high demand. Your valuation is going to be acceptable, and in some cases, even higher than it was before,” he added.This year, investors can expect to see most of the IPO action in June, July, and August.“Even though it’s the dog days of summer, this is the window,” said Healy, “Because the markets got shut down prior through essentially Memorial Day.”“Anybody who is going to get out, is going to get out over the summer,” he said, noting companies will likely avoid listing past September for fear of “elections volatility.”IPOs to watchThis week alone, eight companies and one special purpose acquisition company list on the major exchanges. Bigger deals could perhaps come in the weeks ahead, including:Snowflake: The cloud data company reportedly filed confidentially for an IPO, with a February round of funding valuing the company at $12.4 billion.Albertsons Cos: In May, the supermarket chain company amended its S-1 filing after submitting paperwork in March to list on the New York Stock Exchange.Royalty Pharma: The company plans to offer 70,000,000 shares with a price range of of $25- $28 each, raising up to $1.96 billion.Lemonade: The renters’ and homeowners’ insurance marketplace backed by Softbank recently filed to go public, targeting to raise $100 million.DoorDash: In February, just days after the market highs and at the beginning of the meltdown, the company said it had filed confidentially to go public.Story continuesShift4 Payments, Inc. rings The Opening Bell on Friday, June 5, 2020, in New York. The New York Stock Exchange welcomes Shift4 Payments, Inc. (New York Stock Exchange via AP Images)A look at 2020’s recent debutsSo far in 2020, there have been 43 IPOs, including:Vroom (VRM): Vroom shares surged 118% in its debut on June 9. The e-commerce platform opened at $40.25 despite its initial public offering being priced at $22 per share.Warner Music Group (WMG): The company raised $1.9 billion during its debut, making it the biggest IPO of the year so far. On June 3, shares soared +17% on WMG’s first day of trading after pricing its IPO at $25 per share.ZoomInfo (ZI): The cloud based platform for sales and marketing teams, raised almost $1 billion when it priced its IPO at $21/share. The stock closed over 60% higher on its first day of trading.Nikola Motor (NKLA): On June 3, the electric car startup did a ‘reverse IPO’ by merging with VectoIQ, a publicly-traded special purpose acquisition company. On Monday, June 8, shares closed up over 100% after announcing the pre-order date for Nikola’s fuel-cell pickup truck, Badger.Ucloudlink Group (UCL): The Chinese cloud company priced its IPO at $18 a share. Shares opened at $22.50 on June 10, up more than 6% during the first minutes of trading.Shift4 Payments (FOUR): The company, which processes transactions for over 200,000 businesses, priced its IPO above its range, at $23 a share. Shares on its first day of trading soared 45%.IMAGE DISTRIBUTED FOR THE NEW YORK STOCK EXCHANGE - The New York Stock Exchange welcomes Shift4 Payments, Inc. (NYSE: FOUR) in celebration of its IP on Friday, June 5, 2020, in New York. (New York Stock Exchange via AP Images)‘The confidence to reignite’Shift4 Payments CEO Jared Isaacman told Yahoo Finance why his company decided to go for it. “We had tons of data, and we started to see the recovery ... really accelerate in May. That’s what gave us the confidence to kind of reignite the IPO process and get it going.”This year’s parade of IPO’s come amid the biggest 50-day market rally in history following the March 23rd lows. The initial public offering market last year started out strong, and fizzled out in the fall following the WeWork debacle.As with last year, a company’s growth prospect is where investors are focusing. “I wouldn’t say profitability is a requirement to go public. The road to profitability is what investors are interested in,” said Healy.“You’ve got Uber (UBER) and (Lyft) that still haven’t turned a profit, and they’ve been public for over a year,” he added.Ines covers the U.S. stock market for Yahoo Finance. Follow her on Twitter at @ines_ferreRead more:The ‘single biggest takeaway from Berkshire Hathaway’s shareholder meeting: top Buffett watcherWarren Buffett: “Thank you Dr. Fauci”It would be unprecedented for a bear market to be this short: Wells Fargo StrategistRecent rally could be a ‘bear market trap’: Miller Tabak StrategistA view from the trading floor: Algorithms having ‘outsized impact’ amid coronavirus impactFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}