{"article": [{"url": "https://finance.yahoo.com/news/apple-arm-intel-processors-182545656.html", "published": 1593005600.0, "headline": "Apple’s switch from Intel to its own chips is its smartest move in years", "body": "Apple (AAPL) is leaving Intel (INTC) in the dust. The iPhone maker announced plans to cut ties with the processor giant during its virtual Worldwide Developers Conference on Monday, saying that it will phase out the use of Intel’s chips in its Mac line of computers over the next two years.In place of Intel’s processors, Apple will begin using its own ARM-based silicon, just as it has in its iPhone and iPad lines for years. It’s one of the most significant moves Apple has made in some time and should incentivize iPhone owners to switch from their Windows PCs to Macs.The merging of Mac and iPhoneApple has long maintained that it wants to keep its Mac and iPhone lines separate, but with the ARM announcement, the company has signaled that it will soon begin blurring the lines between the two platforms.“This was a seminal event as the chip announcement is the first step of many more down the horizon in our opinion as Cupertino takes the reigns of its architecture and the cross pollination between software and hardware become ubiquitous going forward,” Wedbush analyst Dan Ives wrote in a research note following Apple’s event.So what does the chip change mean for Apple’s software? A good deal, actually. Currently, Apple developers have to build their Mac apps to support Intel’s x86 chip architecture. But with the change to ARM-based processors, developers will be able to build out their apps for Apple’s ARM-based architecture, making it easier to bring iPhone and iPad apps over to the Mac.It sounds like a minor difference, but it brings Apple’s biggest competitive advantage in the smartphone and tablet space to its Mac lineup: its massive app library.Apple is also providing developers with the means to translate apps built for Intel’s chips to the company’s new ARM-based processors, so customers will have access to both kinds of apps on the ARM-powered Macs. And based on a virtual stage demo Apple showed at WWDC, Intel x86 apps appear to function just as you’d expect when translated to Apple’s ARM-based systems.Story continuesApple's switch to its own ARM-based processors should pay off big time for the company. (Image: Apple)Beating Intel at its game Intel has hit a roadblock in terms of performance upgrades in recent years. The old theory of Moore’s Law, which states that the number of transistors on a chip double every two years, has long gone out the window.The company sat on processors using 14 nanometer architecture for years before taking its steps to 10nm processors. Those 10nm chips finally debuted in Apple’s 2020 MacBooks, five years after Intel initially promised to launch the processors.Apple’s own ARM-based chips for its iPhone and iPad, meanwhile, began using 7nm architecture for the company’s A12 processor, which was released in 2019.By switching to its own ARM-based processors for its computers, Apple will be able to avoid any potential future delays from Intel and control the capabilities of its Macs, more or less, from the ground up.What Apple needs to prove, however, is that its own custom chips will be able to provide the kind of power and performance that rivals, or even surpasses, Intel’s processors. If the company’s press event is any indication, Apple is already on track to do just that.Apple showed off a number of demos during WWDC using a Mac running the company’s A12z processor. In one demonstration, the test Mac ran apps like Photoshop and Final Cut Pro with ease, even handling instances of 4K video without so much as a hiccup.That should bode well for Apple’s performance goals for its Macs, and if the ARM-based machines are able to outperform comparable Windows-powered, Intel-based systems, that would solidify Apple as the go-to machine for professionals in need of systems with serious horsepower.Apple, meanwhile, benefits from this whole adventure by bringing its chip resources in-house, eliminating the need to pay Intel for its processors, potentially saving millions in the long run.If Apple’s new systems live up to the hype, the switch to ARM-based processors will be the smartest move the tech giant has made in years.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple to close retail stores in 4 states amid coronavirus outbreaksWhy Microsoft and Amazon are calling on Congress to regulate facial recognition technologyThe PlayStation 5’s most important feature will be its price5 Father’s Day tech gifts: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}