{"article": [{"url": "https://finance.yahoo.com/news/fed-will-not-cap-us-treasury-yields-for-the-time-being-190109904.html", "published": 1597846160.0, "headline": "Fed will not cap U.S. Treasury yields for the time being", "body": "The Federal Reserve will not take up a new tool known as yield curve control, but said it will keep all of its options open in the future.In minutes detailing the Federal Open Market Committee’s July 29 meeting, Fed officials appeared cool to a World War II-era policy of purchasing U.S. Treasuries until yields reach stated targets.One reason: yields are already historically low across the curve. At the time of the meeting, the yield on the U.S. 10-year Treasury (^TNX) was below 60 basis points and the yield on the U.S. 30-year (^TYX) under 125 basis points.FOMC members, who opted to hold interest rates at near-zero in that meeting, also flagged concerns over the consequences of an “excessively rapid expansion of the balance sheet” under a yield curve control policy. Questions also arose over how the Fed would exit such a strategy.“In light of these concerns, many participants judged that yield caps and targets were not warranted in the current environment but should remain an option that the Committee could reassess in the future if circumstances changed markedly,” read the Fed minutes, which were released Wednesday.The central bank had previously floated the idea of targeting medium-term U.S. debt (like the 3-year and 5-year), a version of yield curve control deployed by the likes of the Reserve Bank of Australia. But the July minutes suggest that the Fed would like to prioritize its communication policy instead of involving itself further in the U.S. government debt.The Fed has also swatted down interest in following the European Central Bank and the Bank of Japan in their use of negative rates.Forward guidanceThe July discussion of yield curve control is a noticeable development since the Fed’s June 10 meeting, in which Fed officials debated the pros and cons of implementing such a policy and agreed to “conduct further analysis.”With the tool likely sidelined for now, the Fed has its focus on forming some plan for forward guidance.Story continuesThe central bank has already slashed rates to near-zero and committed to expanding the balance sheet through purchases with no maximum. But markets are still in the dark about how long the Fed will commit to keeping borrowing costs low and providing accommodation through its quantitative easing policies.The July minutes detailed interest in both outcome-based forward guidance (where the Fed commits to keeping rates near-zero until inflation and/or unemployment reach stated goals) or calendar-based guidance (where the Fed commits to keeping rates near-zero until a certain date).“A number of participants noted that providing greater clarity regarding the likely path of the target range for the federal funds rate would be appropriate at some point,” the minutes read.FOMC members also floated the idea of tying the pace of its ongoing asset purchases to the communication of those goals as well.But forward guidance may not be ready for the Fed’s next FOMC announcement on September 16. The July minutes suggest that the Fed would want to wrap-up its pre-COVID review of its longer-run goals and monetary policy strategies first, to “guide the Committee’s future policy actions and communications.”Capital Economics wrote Wednesday that the minutes appear to tee up an average inflation targeting strategy where the Fed periodically tolerates inflation running above its 2% goal.Fed officials will remain in focus as the central bank hosts its annual monetary policy symposium next week on August 27 and 28. The meeting, which usually takes place in Jackson Hole, Wyoming each year, will be held virtually due to COVID-19 and will be broadcast live to the public for the first time.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Senate efforts to slip in lower leverage requirements brushed off by small, large banksFed lowers pricing for emergency loans to state, local governmentsNY Fed: COVID forces first decline in household debt since 2014Democrats propose expanding Fed mandate to reducing racial inequalityA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}