{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-trumps-covid-19-timeline-treatments-sow-concern-regeneron-boosted-171018810.html", "published": 1601904860.0, "headline": "Coronavirus update: Trump returns to White House, CDC says virus can travel more than six feet", "body": "President Donald Trump returned to the White House on Marine One Monday evening, marking the end of a three-day hospital stay at Walter Reed Military Medical Center to treat his COVID-19 infection.After returning, Trump removed his mask, a point that left health experts bewildered since has not yet been determined if the President is still infectious. In a video shared on Twitter afterwards, Trump reiterated a message from earlier in the day.Trump announced he would be leaving Walter Reed on Twitter, while also spreading what some experts say is a dangerous public health message.“Don’t be afraid of Covid. Don’t let it dominate your life. We have developed, under the Trump Administration, some really great drugs & knowledge,” Trump said.In the video, later, Trump reiterated the line, “don’t let it dominate your lives. Get out there. Be careful. The vaccines are coming, momentarily.”Dr. Eric Feigl-Ding, a health economist and epidemiologist, said Trump’s message misses the mark for most Americans.“I would love (Trump’s) quality of health care, getting all this unapproved antibody cocktails around the clock, for only $750 a year (in taxes),” Feigl-Ding said. “Most people don’t have that.”Trump’s message also reflects poorly on the 200,000 lives lost, and continued case growth — as anticipated— now and in the coming months, he said.Dr. Peter Hotez, a vaccine expert and Baylor College of Medicine professor shared a similar sentiment to Trump’s tweet, saying it sent a “chilling message.”“It says he’s learned nothing about the severity of COVID19, how the White House refusal to launch a national response to virus caused so much suffering and death, and how he may have survived his case because of privileged access to biotechnologies denied to others,” Hotez told Yahoo Finance.White House physician Dr. Sean Conley said Trump’s departure from the hospital was in line with the medical team’s assessment of Trump’s health status, but refrained from sharing additional details, including information about Trump’s CT scan, citing patient privacy, or when his last negative COVID-19 test was.Story continuesConley noted that Trump has been fever-free, without any fever-reducing medication, for 72 hours, and that he could be in the phase of the infection that ensure he does not have traces of “a live virus still present that he could possibly transmit to others”— indicating a later stage of the infection window. If lab results show that to be true, Trump could return to the campaign trail.“We’re in a bit of uncharted territory when it comes to a patient that received the therapies he has so early in the course,” Conley said, noting he and the team remained cautiously optimistic.Conley said Trump appeared to be in good spirits and did not appear to have any visible neurological impact, as seen in videos over the weekend. “He’s back,” Conley said.White House Press Secretary Kayleigh McEnany, as well as additional staffers and White House cleaning staff, announced on Monday that they tested positive for COVID-19 — the latest in a growing list of Republican officials linked to Trump, who is currently undergoing treatment for the virus as questions swirl around his condition.In the days following Trump’s stunning disclosure that he was infected with the coronavirus, several GOP senators and key functionaries in his inner circle have also received positive diagnoses. The furor was sparked last week after Hope Hicks was revealed to have the virus, the first revelation that the pandemic had hit the White House hard, roiling the president’s already turbulent reelection effort.McEnany said she had consistently tested negative in the past few days, and was not showing any symptoms.The crisis engulfing the White House was amplified on Monday by the Centers for Disease Control and Prevention (CDC), which updated its guidelines to address a point many experts have previously stressed — that it is possible for the virus to spread beyond six feet, the benchmark for social distancing measures. Last month, the agency published that same guidance but quickly removed it, in a move that fanned new accusations that the CDC’s decisions were being politicized.Meanwhile, questions have surfaced about the lack of transparency surrounding when Trump first contracted the virus, the limited information on contact tracing efforts — and how serious his condition might be despite rosy assurances by his medical team.Health experts are concerned the White House has been concealing a more serious COVID-19 infection, especially as he receives a number of aggressive treatment cocktails.The President’s physician, Dr. Sean Conley, admitted to wanting to keep an optimistic tone while Trump — who over the weekend embarked on a much maligned pass and review via car for the benefit of his supporters — was at Walter Reed Military Medical center.“I was trying to reflect the upbeat attitude that the team, the President, that his course of illness, have had,” Conley said, adding that he didn’t want to provide any information that would “steer the course of the illness in another direction.”Conley confirmed several reports Sunday that Trump had received supplemental oxygen after his saturation level dropped just below a concerning level while at the White House.There is a surge in cases in New York, New Hampshire, and Connecticut. (Graphic: David Foster/Yahoo Finance)Social distancing and airborne spreadThe latest revision by the CDC states that in indoors spaces, where air circulation can be poorer, the virus can spread further than six feet and droplets can linger in the air for hours — which can infect someone who breathes in the air.The question of how far the virus can spread was discussed in an article by Italian researchers in April, who pointed to evidence that droplets travel further than six feet. The CDC is now embracing the existing evidence on the topic.The agency “continues to believe, based on current science, that people are more likely to become infected the longer and closer they are to a person with COVID-19,” it said in a statement.“Today’s update acknowledges the existence of some published reports showing limited, uncommon circumstances where people with COVID-19 infected others who were more than 6 feet away or shortly after the COVID-19-positive person left an area,” it added.A range of cocktails for Trump’s treatmentTrump has has no fever since Friday, his vital signs are stable, and he has not complained of shortness of breath, even when his oxygen saturation levels were lower.According to doctors, he has been able to walk around the whole time. If all goes well with Trump remaining mobile and active, the doctors could discharge him as early as Monday.However, over the last few days Trump has received Regeneron’s (REGN) experimental antibody cocktail treatment, Gilead Sciences’ (GILD) remdesivir, and dexamethasone, a generic steroid usually reserved for use in severe COVID-19 cases. Both stocks spiked in intraday trading, as investors speculated their role in the president’s treatment would bolster their chances for regulatory approval.Yale University professor and health police expert Dr. Howard Forman told Yahoo Finance said the variety of medications Trump has received give a confusing message about at what point in the infection course he is current in.“They’re treating him almost as thought he’s past the 10 day window after infection,” which could indicate he is past a point of serious concern, Forman said.“But again, they have not been clear with exactly what’s going on. By the way, this is a problem with presidencies in both parties going back decades and decades,” Forman said. He referred to past presidents who were able to conceal the extent of their illnesses.Regeneron’s treatment was given to the president based on a compassionate use basis, and has given analysts reason to believe the U.S. Food and Drug Administration is likely to provide an emergency use authorization soon. In a research note on Monday, SVB Leerink analysts speculated that an EUA could come “in a matter of days.”Yahoo medical contributor Dr. Dara Kass said there simply isn’t enough public information about the President’s health to understand how he is being treated— or why doctors are considering releasing him to the White House Monday.“It’s surprising to a lot of us that given the number of medication that he has received, the conflicting evidence of his vital signs, that they would stop being cautious and be frivolous with his care,” Kass said.“The videos we are seeing are inconsistent with the treatment he is getting,” she added.Trump tweeted videos on Saturday and Sunday evenings, assuring the American people he was feeling fine, and drove by a crowd on Sunday outside the hospital.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberDoctors, scientists increasingly political amid COVID-19 pandemic: 'Public health is on the ballot'India's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}