{"article": [{"url": "https://finance.yahoo.com/news/first-time-netflix-name-checked-203316355.html", "published": 1595000480.0, "headline": "For the first time, Netflix name-checked TikTok as a major competitor", "body": "tiktokNetflix acknowledged Disney, WarnerMedia, and NBCUniversal are among its main global competitors. But it reserved its praise only for TikTok.In a July 16 letter to shareholders (pdf) tied to the company’s second-quarter earnings report, Netflix mentioned TikTok as a serious competitor for the first time. Then it offered plaudits for the Chinese-owned video app—something Netflix does not typically do for its traditional rivals in Hollywood.What Mumbai needs to do to replace Hong Kong as Asia’s main financial hub“TikTok’s growth is astounding,” the letter stated, “showing the fluidity of internet entertainment.”Since launching worldwide in 2018, TikTok has become one of the most popular apps in the world. It was the most downloaded app in the Apple App Store in both 2018 and 2019. Nearly half of its users are between the ages of 16 and 24—and about 90% of those users say they use the app every day. Last month, TikTok hired Disney’s head of streaming, Kevin Mayer, as its new CEO.Netflix has long included a section in its earnings reports on competition, providing a window into the company’s thinking about which competitors it views as potential obstacles to growth. In 2014, the streaming service said its primary competition was traditional TV (including networks like CBS and HBO). A year later, Netflix began listing Hulu and Amazon in that group of rivals.South Africa is struggling with Covid-19 because its leaders want to emulate the “First World”Over time, Netflix’s idea of its competition has expanded to include pretty much anything that takes place on screens: YouTube, Facebook, and even video games. “We compete with (and lose to) Fortnite more than HBO,” the company said in 2018.But, other than YouTube, Netflix has not considered the most popular social media and video apps to be threatening enough to single them out. It has never name-checked Instagram, Snapchat, or Twitch in its earnings reports, for instance. (Nor has it ever bothered to acknowledge the existence of Quibi. Poor Quibi.)Story continuesThat makes it all the more significant that Netflix is now lumping TikTok with Disney and other entertainment behemoths.As of now, all of TikTok’s bite-sized, shareable videos are user-generated. There is no scripted Hollywood content made exclusively for the service. But Mayer’s hiring, coupled with the app’s immense popularity with young people around the world, means it could eventually compete directly with Netflix for access to the top talent.Even if it decides to stick with only user videos, TikTok is still occupying a big chunk of consumers’ finite screen time—time Netflix would much prefer they spend watching Stranger Things or Floor Is Lava.The good news for Netflix is TikTok definitely will not be making any deals with Hollywood studios if it is banned in the United States. Because of its ties to China, the app has already been blacklisted in India, while the US is now mulling a similar ban over security concerns.Also positive for Netflix is that it is still winning its original crusade: the streaming TV wars. In the same earnings report, the company announced it added another 10 million subscribers this quarter to go along with almost 16 million last quarter—its two best quarters ever. Its stock is vastly outperforming those of its Hollywood television and film competitors, who are hamstrung by the coronavirus-induced theater and theme park closures.But another global entertainment war has already reached Netflix’s shores, and it poses an even bigger threat to its quest to become the world’s go-to source for all things entertainment. Every minute the next generation spends TikTok-ing instead of binge-watching is more time their media consumption habits change. Sign up for the Quartz Daily Brief, our free daily newsletter with the world’s most important and interesting news.More stories from Quartz:What hiring looks like without resumes, cover letters, or interviewsSuccessful leaders of the future will share three main traits"}]}