{"article": [{"url": "https://finance.yahoo.com/news/how-soon-coronavirus-could-deplete-the-governments-major-trust-funds-141057324.html", "published": 1594027100.0, "headline": "How soon coronavirus could deplete the government’s major trust funds", "body": "The Social Security and Medicare trustees released a report in April looking at the state of the nation’s most prominent trust funds.It showed Social Security running low on money in 2035 and Medicare being depleted even earlier. And that was before factoring in the effects of the coronavirus pandemic.Now, economists are beginning to get a clearer picture of just how much the coronavirus recession may impact some of the government’s biggest programs.Without intervention, \"all major trust funds will be out of money in just about a decade,\" Marc Goldwein, a budget expert and a senior vice president at the Committee for a Responsible Federal Budget, said during a recent briefing. He suggests Social Security could be depleted by 2031 with other funds running low as early as next year.A blank Social Security checks before being run through the printer at a U.S. Treasury printing facility. (William Thomas Cain/Getty Images)A “trust fund” is government lingo for a pot of money funded from a specific source, which is then “dedicated by law for specific purposes.” In other words, it’s a part of the federal budget but is self-contained and operates on its own trajectory (in theory).Here’s the latest on where some of the government’s major funds currently stand.Social SecuritySocial Security is technically two trust funds: the Old-Age and Survivors Insurance fund and the Disability Insurance fund. The first one is the biggie: it’s one of the largest programs in the federal government, with $2.8 trillion in reserves at the end of 2019. The program is scheduled to pay out over a trillion dollars in 2020. “The total annual cost of the program is projected to exceed total annual income, for the first time since 1982, in 2021 and remain higher throughout the 75-year projection period,” the Social Security Administration wrote in its report.The money for the funds comes out of the payroll taxes withheld from every worker in the country. The current payroll tax rate for Social Security is 6.2% for the employer and 6.2% for the employee.The recession has undoubtedly moved the timeline up for when Social Security will run low on money, the question is exactly how much.Story continuesForecasts for trust funds amid COVID-19Stephen Goss, chief actuary of the Social Security program, recently called it the “$64 billion question,” suggesting that the duration of the recession is the key factor. He pegged the “depletion date” as somewhere around 2033 or 2034 if the recession ends in the next two years. An analysis from the Bipartisan Policy Center found, assuming an extended recession, that the program could be looking at reduced benefits as soon as “this decade.”Goldwein’s more recent analysis projects depletion by 2031 – about halfway between those two estimates.If it happened, Social Security benefits would need to be reduced. Nobody is sure precisely how it would work. Monthly checks could get smaller or, as Goldwein noted, “Social Security would be required to delay its checks and so instead of sending people monthly checks, they would send checks as there's enough money, which means that instead of 12 checks a year, you get 10 checks a year, or nine checks a year.”This is assuming that Congress does nothing to intervene.One idea on Capitol Hill would convene a bipartisan group of lawmakers to make a plan for all the federal trust funds. Another idea, championed by Democrats, would raise benefits through payroll tax increases and new taxes on the highest income earners. On the 2020 Democratic campaign trail, most of the Democratic candidates focused on simply adding payroll taxes to wages above $137,700 (which are currently exempt).The Medicare Trust FundMedicare, which helps cover health care costs for millions of seniors, is also funded via payroll taxes. The tax is 2.9% (1.45% from workers and another 1.45% from their employer).The program, which technically is two trust funds, could be low on money as soon as the next presidential administration. “We believe the Medicare trust fund for hospital insurance will run out by 2023,” says Goldwein.(Bill Clark/CQ Roll Call)Hospital Insurance Trust Fund is the money behind Medicare Part A, which covers hospital visits and home health care, and is the part of the program in dire economic straights.The Supplemental Medical Insurance Trust Fund is another pot of money behind Medicare Part B (which covers preventative medical expenses) and Part D (prescription drugs) and is seen as sitting on much sounder financial footing.Like with Social Security, nobody is certain what would happen if the Hospital Fund runs low.“We think the most likely scenario is that what the law says is we'd actually have to delay payments to providers,” said Goldwein – which would mean health care providers wouldn’t “ever want to see Medicare patients, because they know they won't get paid on time, if at all.”The Congressional Research Service suggests that a shortfall would result in a situation where “funds would be sufficient to pay for only 90% of Part A expenses.”A group whose purpose is to advise the Congress on Medicare issues recently suggested that \"either the Medicare payroll tax needs to be immediately raised from its current rate of 2.9% to 3.7% or Part A spending needs to be immediately reduced by 18%.\"Highway Trust FundThe Highway Trust Fund pays for much of the federal government’s spending on roads and highways. It was founded in 1956 to help build the interstate highway system and its funding largely comes from gasoline taxes.With gas consumption lower during coronavirus lockdowns, the fund has suffered. In January 2020, the fund took in over $3.3 billion and, by April, tax receipts were down to $587 million.The declining Highway Trust Fund has been an issue for years. In 2014, Transit workers rallied on Capitol Hill to urge Congress to replenish the Highway Trust Fund. (Mark Wilson/Getty Images)“We believe the Highway Trust Fund is going to run out of money in 2021,” says Goldwein. “There will not be enough reserves plus gas tax revenue to finance highway spending” by then. Even before the current crisis, the fund was in trouble. In 2019, the Bipartisan Policy Center suggested the fund would “run dry between 2021 and 2022.“The fund is far from the only way to pay for road projects. House Democrats recently passed a $1.5 trillion infrastructure bill to spend money a variety of ways with one provision being called a “massive Highway Trust Fund bailout.” The bill is unlikely to be considered in the Senate, with the prospects for a bipartisan infrastructure deal murky at best.Vice President Mike Pence recently said a $400 billion infrastructure bill might work as “a separate piece of legislation” from the upcoming phase 4 stimulus negotiations.Other trust fundsAcross the federal government, other funds cover a range of things like pensions for government employees and flood insurance.In January, the Government Accountability Office, the Congressional watchdog, studied all of the funds together and found – even before the current crisis – that declines in the Social Security and Medicare funds would begin dragging down total balances as early as 2022.The question that some may begin asking is whether trust funds can stay independent from the overall federal budget. If the government were to abandon the idea of these self-contained programs, they would become part of the vagaries of budget negotiations, “same as everything else,” notes Goldwein.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:‘There is no precedent’: Record-breaking U.S. deficits are comingAmericans in both parties increasingly think the social safety net needs to be expandedCoronavirus stimulus checks: Americans are spending payments in 'two big ways'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}