{"article": [{"url": "https://finance.yahoo.com/news/disney-wb-are-sending-a-clear-signal-americans-arent-ready-to-return-to-movie-theaters-193007377.html", "published": 1600871900.0, "headline": "Disney, WB are sending a clear signal: Americans aren't ready to return to movie theaters", "body": "Over Labor Day Weekend, when Warner Bros. put Christopher Nolan’s action thriller “Tenet” out in U.S. theaters (in states where theaters were open) and Disney put its live-action “Mulan” onto Disney+ for a $30 digital purchase fee (on top of the existing Disney+ subscription fee), much was made of the differing decisions.Warner Bros. was betting that moviegoers and Nolan fans were ready to go see “Tenet” in a theater, with a mask on, while Disney didn’t take the same chance with “Mulan,” going straight-to-digital in the U.S. while releasing it in theaters abroad.Now it appears both studios have arrived at the same conclusion: American moviegoers aren’t ready to go back to the movies yet.Disney (DIS) on Wednesday delayed the theatrical release of three Marvel movies: “Black Widow” from Nov. 6, 2020 to May 7, 2021; “Shang-Chi and the Legend of the Ten Rings” from May 7, 2021 to July 9, 2021; and “The Eternals” from Feb. 12, 2021 to Nov. 21, 2021. (Interestingly, for now, the Pixar movie “Soul” is still set for a Nov. 20, 2020 theatrical release.)Disney also delayed two 20th Century Studios movies: Steven Spielberg’s “West Side Story” from Dec. 18, 2020 to Dec. 10, 2021; and Kenneth Branagh’s Agatha Christie adaptation “Death On The Nile” from Oct. 23, 2020 to Dec. 18, 2020.These delays come one week after Warner Bros. (T) delayed “Wonder Woman 1984” from Oct. 2 to Christmas Day. It’s the third time the film has been delayed due to the pandemic.(L-R) David Harbour, Florence Pugh, O-T Fagbenle, Rachel Weisz and Scarlett Johansson of Marvel Studios' 'Black Widow' at the San Diego Comic-Con International 2019 Marvel Studios Panel in Hall H on July 20, 2019 in San Diego, California. (Photo by Alberto E. Rodriguez/Getty Images for Disney)“Tenet” has now grossed more than its $200 million budget globally, but has disappointed in the U.S. Its U.S. opening pulled in $20 million, according to initial reports, but that figure was massaged to include preview screenings in the week before, according to Variety. From Friday to Sunday, its first three days in U.S. theaters, the film actually sold only $9 million in tickets. (To be fair, movie theaters have not reopened in New York City or Los Angeles, two key U.S. theatrical markets.)Story continues“Mulan” has had its own trouble. The movie has faced political backlash in Hong Kong, Taiwan, and elsewhere for filming parts in Xinjiang, where Uighur Muslims have been detained in detention camps, and for a 2019 tweet from star by Liu Yifei expressing support for Hong Kong police.Theatrical numbers have slid quickly in China, where “Mulan” had earned $36.5 million as of Sept. 21, while “Tenet” (which opened in China one week before “Mulan”) had earned nearly double that, $61.4 million, by the same date.As for how “Mulan” has fared on Disney+, Disney has only said that it is “very pleased” with the initial results, and that from Sept. 1 through Sept. 12, nearly 29% of U.S. Disney+ users purchased the film. (Disney said in August that Disney+ had amassed 60.5 million subscribers, but it hasn’t broken out how many of those are in the U.S.)As the pandemic drags on, American movie theaters will anxiously await more big movies to lure mask-wearing moviegoers. AMC in August restructured its $5 billion in debt and issued new shares in order to narrowly avoid filing for bankruptcy.—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers the streaming wars. Follow him on Twitter at @readDanwrite.Read more:'Tenet' U.S. release will reveal: Are Americans ready to go back to movie theaters?Disney’s $30 ‘Mulan’ plan will be a litmus test for the entire film industry‘Hamilton’ delivers 64% download bump for Disney+Disney's 'Mulan' will look to Christopher Nolan's 'Tenet' for a movie theater health checkCoronavirus is forcing Quibi, NBC Peacock to change their plans at launchMovie theaters seek bailout as coronavirus devastates business"}]}