{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-fauci-cdc-face-congress-as-us-coronavirus-cases-spiral-higher-174159214.html", "published": 1596199760.0, "headline": "Coronavirus update: Fauci, CDC face Congress as US coronavirus cases spiral higher", "body": "The U.S.’s troubled response to the coronavirus pandemic was on display Friday, as the Trump Administration’s top health officials testified before Congress, warning that the virus’ spread would “likely continue for some time.”Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told lawmakers in prepared testimony that “while it remains unclear how long the pandemic will last, COVID-19 activity will likely continue for some time.”Six months after the U.S. Health and Human Services Department (HHS) declared the virus a public health emergency, the country continues to struggle to offer adequate testing nationwide, even as hopes remain pinned on a vaccine that could be produced by year’s end. The U.S. is still a global epicenter, with over 4 million confirmed cases and more than 150,000 deaths.To that end, Operation Warp Speed announced Friday a $2.1 billion investment in Sanofi (SNY) and GlaxoSmithKline (GSK) to help manufacture and scale up production of their vaccine candidate. That makes it the largest investment to-date in a vaccine candidate from the federal government.But concerns about the safety of a vaccine remain.Speaking to the House Oversight Committee’s Select Subcommittee, Fauci pushed back against concerns about a rushed vaccine timeline at the hearing as he complemented the U.S. Food and Drug Administration’s handling of the process.“Historically the FDA has based their decisions on science. They will do it this time also,” he said.FDA Commissioner Stephen Hahn recently said he would consider an Emergency Use Authorization for a vaccine. Yet whether it would come after Phase 3, or wait until the regulatory review process is in progress, remains unclear.New Jersey, Connecticut, Rhode Island, West Virginia, and Oklahoma are seeing a surge in cases. (Graphic: David Foster/Yahoo Finance)As pharmaceutical companies push aggressively toward developing an effective COVID-19 inoculation, many are worried it could come too early — or that it will be far less effective than it needs to be.Dr. Tom Frieden, former CDC director, wrote in a Wall Street Journal op-ed Friday that there were multiple ways the development process could go wrong — including a vaccine that protects against the disease, but “may not prevent people from becoming infected and spreading the virus to others. Nor do we know whether all people will be protected by a new vaccine...(or) how long any protection will last.Story continuesStill, optimistic stock market investors continue reacting to incremental milestones of pharmaceutical companies like Moderna (MRNA), Pfizer (PFE) and Johnson & Johnson (JNJ) pursuing a candidate.“If you watch the stock market or the sale of stock by some of the people in the companies, you think they had a discovery whereas basically all they’ve had is a Phase 2 positive result,” said Dr. Aruthur Caplan, a professor and bioethicist at the New York University Grossman School of Medicine, speaking at the National Press Foundation on Thursday.Testing updateMeanwhile, the federal government announced additional investments in testing technology Friday.The National Institute of Health announced $248.7 million for new technologies for its Rapid Acceleration of Diagnostics (RADx) initiative Friday. The investment will help seven companies manufacture and scale up rapid and lab-based coronavirus tests that can be used to increase the U.S.’s capacity to test.These companies include Mesa Biotech, Quidel and Talis Biomedical for point-of-care tests; and Ginko Bioworks, Helix OpCo, Fluidigm and Mammoth Biosciences for lab-based tests. In addition, Fluidigm (FLDM) has an active portfolio of COVID-19 response efforts, including testing and vaccine trials.Adm. Brett Giroir, who has lead the testing efforts for the U.S., said at the hearing Friday that half of testing is now done at pont-of-care (in doctor’s offices and hospitals and clinics), and the other half by large commercial labs.As of now, the country is still performing less than 1 million tests per day, but the RADx initiative has set a goal of reaching 6 million tests daily.As the debate over reopening schools heats up, a study in the Journal of the American Medical Association (JAMA) showed that the virus is very prevalent in children’s noses and throats — raising questions about how likely they are to spread COVID-19.But many questions remain unanswered, such as how transmissive children are if they are actively holding the virus. That will be critical as states determine how they will reopen schools in the fall.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}