{"article": [{"url": "https://finance.yahoo.com/news/these-3-states-are-suffering-the-slowest-coronavirus-job-market-recoveries-155323655.html", "published": 1595502080.0, "headline": "These 3 states are suffering the slowest coronavirus job market recoveries", "body": "The number of jobs lost due to the coronavirus shutdown continue to mount, with the latest weekly total of Americans applying for unemployment benefits coming in at a greater than expected 1.4 million.The latest swath of applications brings the total amount of jobless claims to more than 52 million over the past four months, wiping out the 20 million jobs added over the last decade by a more than two-to-one margin.Read more: Coronavirus: How to find a job in a tough economyWhile some states have seen unemployment applications plummet from record highs after the coronavirus pandemic roiled America’s employment picture, some have suffered stubbornly high job losses months into the recovery. A Yahoo Finance review of jobless claims data from the U.S. Department of Labor shows that Oklahoma, Alaska and Georgia have seen the weakest signs of return to normal and a bottoming out in job losses. Those three states were followed by Mississippi and California.Read more: How the pandemic could change how millennials think about personal financeComparing each state’s average weekly jobless claims totals over the past nine weeks to the nine weeks beginning March 14, which sparked a record amount of unemployment applications, reveals that those states are stopping the bleeding much slower than others. Contrasting those first nine weeks of pain to the latest nine-week period shows that the five weakest states have only seen average weekly initial unemployment claims fall by less than 48%. On the complete opposite side of the spectrum, Rhode Island has seen weekly initial jobless claims fall roughly 83% over the same period.Rounding out the 10 states showing the softest recoveries over the period observed were Florida, Maryland, Wyoming, Arkansas, and Texas.Nationally, the total of Americans filing for new unemployment benefits rose this week for the first time since March. Notably, states that have suffered a tick higher in coronavirus cases are moving in the wrong direction. California, which returned to shutting down its economy after seeing cases rise over the last few weeks, also exhibited rising jobless claims over last week.Story continuesZack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:This $3 billion online education company is seeing a 'paradigm shift' due to coronavirusNetflix co-founder brushes off NBC's new Peacock streaming competitorSmall US towns are neglected from coronavirus relief and it's a 'slap in the face': Georgia mayorWhy Costco could see a lasting boost from coronavirus panic buying"}]}