{"article": [{"url": "https://finance.yahoo.com/news/how-california-wildfires-are-uniting-frenemies-trump-and-newsom-191708753.html", "published": 1600179920.0, "headline": "How California wildfires are uniting frenemies Trump and Newsom", "body": "As Election Day approaches, President Trump and California Gov. Gavin Newsom have been forced to put their differences aside to address the wildfires sweeping across the west.The California wildfires have destroyed more than 2 million acres and devastated farmland. At least 24 people have died and about 44,000 people have been evacuated.Trump approved a major disaster declaration for California on Aug. 22 which enabled the state to access federal aid. The president assessed the damage in person during a visit to the state on Monday.When the wildfires ignited in California about three weeks ago, Trump blamed the wildfires on forest mismanagement by local leaders.“You gotta clean your floors, you gotta clean your forests – there are many, many years of leaves and broken trees and they’re like, like so flammable, you touch them and it goes up,” Trump said during a rally in Pennsylvania on Aug. 20. “Maybe we’re just going to have to make them pay for it because they don’t listen to us,” he said referring to local leaders.El presidente Donald Trump escucha al gobernador Gavin Newsom informarle sobre los incendios que afectan a California, el lunes 14 de septiembre de 2020 en el aeropuerto McClellan de Sacramento, en McClellan Park, California. (AP Foto/Andrew Harnik)In response, Newsom, a Biden supporter, slammed Trump during his speech at the Democratic convention on Aug. 20. “The president of the United States threatened the State of California, 40 million Americans that happened to live here in the State of California to defund our efforts on wildfire suppression, because he said we hadn’t raked enough leaves. You can’t make that up,” he said.However, as the wildfires rage on, Newsom has taken on a more conciliatory tone with the president, acknowledging past forest mismanagement.“There’s no question, when you look past this decade and looking past almost 1,000-plus years, that we have not done justice on our forest management. I don’t think anyone disputes that,” he said on Monday. “The state of California, your administration just entered into a first-of-its-type commitment, over the next 20 years, to double our vegetation management and forest management.”Newsom did emphasize, however, that “one thing is fundamental: 57% of the land in this state is federal forest land; 3% is California. So we really do need that support. We need that emphasis of engagement.”Story continuesFarmland devastationFarmers in Sonoma County have been hard hit by the wildfires, which have disrupted grape and vegetable harvests.“[The wildfires are] hitting our red grape industry really hard and it’s a tough situation because there’s potential for smoke taint,” Tawny Tesconi, Sonoma County Farm Bureau executive director, told Yahoo Finance.Vineyards not owned by specific wineries face an even tougher dilemma, Tesconi said.Smoke and haze from wildfires hovers over a vineyard Thursday morning, Sept. 10, 2020, in Sonoma, Calif. (AP Photo/Eric Risberg)“You’ve got the grape grower who grows the grapes and you’ve got the winery who processes the grapes,” she said. “So the grape grower has what’s called crop insurance. And so they can take a chance and pick their grapes and hope the insurance works, but they have to prove smoke taint; or they pick the grapes and take a chance that the winery is going to reject it.”Tesconi warns that food prices may spike as a result of the wildfire food supply chain disruptions.“You can’t stop milking cows, you just can’t. But [from] a standpoint of all those other parts of the sector, the processing facilities...that may have had interruptions because of evacuations...we’re also dealing with power shut-off programs,” said Tesconi, explaining that in some cases farmers also have to take the extra step of washing off the ash that has fallen on crops, further disrupting the flow of their businesses.“There is going to be an increase in costs of getting that food to market, so there’s an expected potential increase in food costs to the consumer as well,” she said.Trump has support from farmers Trump has maintained strong re-election support among farmers during his presidency in spite of criticism of his handling of the pandemic. More than 70% of farmers plan to vote for Trump, according to an August survey by agriculture publisher DTN Progressive Farmer. That’s a solid majority, but significantly lower than the 89% of farmers who said they would vote that way in the April survey.As many farmers are forced to evacuate and continue to contend with food supply chain disruptions, many welcome Trump’s aid.“Sometimes the president doesn’t necessarily say things correctly about the whole raking the forests, but I hope the underlying comment on that is really about that we need more forest management,” said Tesconi.“So if there’s going to be some opportunity for the federal government to step in and help us do a diverse kind of platform of forest management, I’m hoping his visit here is just kind of the kickoff for that,” she said.More from Sibile:Trump cuts funding for ‘white privilege’ training as more Republican voters acknowledge systemic racismWe’ll ‘have a way’ to ban fracking in Biden administration: Sierra ClubJob cuts come for white-collar workers: ‘There are no truly recession-proof’ occupationsThe Trump payroll tax break you won’t see on your paycheck‘Ghosting’ is not just for lovers. These job applicants say ‘cruel’ and ‘selfish’ employers do it too.Find live stock market quotes and the latest business and finance news"}]}