{"article": [{"url": "https://finance.yahoo.com/news/larry-summers-on-trump-and-2020-election-143711033.html", "published": 1597571120.0, "headline": "Summers calls Trump 'worst of America's 45 presidents,' says stocks 'do better' during Democratic administrations", "body": "Economist Larry Summers, a former U.S. Treasury Secretary in the Clinton administration and National Economic Council director for Obama, says Trump \"has been the worst of America's 45 presidents.\"\"I think he's doing grave damage every day — both in terms of the incompetence with which we are dealing with problems like COVID and in terms of the erosion of American institutions and the rule of law, traditions for respect of all Americans,\" Summers said in a wide-ranging interview on Yahoo Finance's \"On The Move\" this week.At this stage, the 65-year-old former public servant says his \"best guess\" is that former Vice President and Democratic nominee Joe Biden and vice presidential running mate Sen. Kamala Harris (D-Calif.) will defeat Trump in November.What's more, Summers contends that a Biden administration will restore and accomplish several things that will benefit the country, from restoring the office's traditions and norms to enacting policies that support the middle class.\"I think they will bring a return to traditional norms of American civility and seriousness of purpose, whether the issue is listening to public health professionals on a disease, whether the issue is consulting in civil ways with our allies on matters of international concern, whether the issue is engagement with all Americans being treated equally, rather than appealing to racism,\" Summers said.He added that the Biden-Harris ticket put forth \"powerful ideas for addressing some of the most pressing problems that we face,\" pointing to green investments, health care, taxes, and inequality.Democratic presidential candidate and former Vice President Joe Biden gestures as he speaks at a campaign event, on his first joint appearance with Vice presidential candidate Senator Kamala Harris after being named his running mate, at Alexis Dupont High School in Wilmington, Delaware, U.S., August 12, 2020. REUTERS/Carlos Barria ?Stock markets ‘do better’ during Democratic administrationsHe praised their program as \"impressive and ambitious\" and thinks they'll have a \"very good chance\" at enacting a substantial part of those policies \"quite quickly\" upon assuming office.Summers also dismissed the perception that Democrats are anti-business.\"And, I'm certainly one who, at times, has had to warn against those excesses. But, I can tell you that the data are remarkably clear that, on average, the stock markets, on average, corporate profits, do better during Democratic administrations than they do during Republican administrations. And, so it's not just the little guy that does better. It's actually capital and Corporate America that does better.\"Story continuesThe economist explained that's because \"the foundation of our economy is the middle class, and when you have policies that are based around supporting the middle class it ends up being better for everyone.\"\"And when you have policies that rely on a trickle-down theory, it's not even best for those who have bought into the implementation of those policies,\" Summers added.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach predicts that Trump will win re-electionGundlach predicts gold prices will go much higher in the long-term"}]}