{"article": [{"url": "https://finance.yahoo.com/news/golf-courses-clubs-open-coronavirus-social-distancing-153956564.html", "published": 1599821240.0, "headline": "Golf sees huge upswing with women and young adults: ‘You can take your bag full of White Claws’", "body": "Rachel Kim was finishing up her final year at Dartmouth’s Tuck School of Business when the coronavirus pandemic rattled the world. Being in Hanover, New Hampshire, the already limited choices for dining and recreation were no longer options, so she found it a great motivator to spend more time outdoors, and found herself gravitating toward the golf course.“It’s definitely the best activity to do during coronavirus and it’s the best time to get into it because there’s less pressure to know the rules, etiquette…Golf has gotten more laid back because of coronavirus. Because of sanitary reasons, we’re not supposed to rake the sand or move the flag. It’s easier to join the game and learn how to play it,” said 28-year-old Kim.During this extended season of social distancing, warm temperatures and desire for physical activity, the golf industry has seen a dramatic resurgence, with people investing in lessons, flocking to ranges and courses and shelling out money for clubs and gear. What had been perceived as a sport on life support has been infused with a renewed energy, driven by young adults.Rachel Kim at the Montcalm Golf Club in Enfield, New Hampshire. She first got interested in golf early this spring and the coronavirus pandemic upended normal life. Now she plays once a week and is planning trips around the sport.According to research from the National Golf Foundation, there have been notable increases in participation among juniors and beginners, along with returners, as golf has positioned itself as a healthy way to pass time during this crisis.“The number of junior golfers (ages 6-17) could increase by as much as 20% this year, a potential COVID-related bump of a half million golfers by year’s end. During a time when many other activities were on hold, including youth sports in many instances, we’ve also seen increases in the number of beginning and returning golfers of about 20% during the first half of 2020,” NGF editorial director Erik Matuszewski told Yahoo Finance.Nationally, rounds of golf were up 19.7% year-over-year in the month of July, marking the biggest increase ever for a high-volume summer month since NGF started monthly tracking in 2000. This reflects an increase of approximately 10 million more rounds than in July 2019. In August, rounds were up 3% nationwide over the same period in 2019, after climbing from a 16% year-to-date deficit on April 30.Story continuesForget bars, drink on the courseAs social circles emerge from isolation and people seek alternatives to crowded bars, restaurants or house parties, golf has been one clear beneficiary. With the majority of white collar workers still given the choice to work from home, trips to the range have replaced happy hours for many professionals.Dan Matthews, a 35-year-old producer in the advertising industry, picked up his first golf club in late July. His interest was piqued because he deeply missed the camaraderie of the workplace and it was a project he could focus on.“I had some co-workers that decided to pick it up and I wanted to join them since they were so very encouraging. I was also looking for something to personally improve on that was more of a solo activity during the pandemic. This way I could do it more frequently on my own and it's an ideal sport to take up that is socially distant,” he said.For Rona Li, 28, the main catalyst was her boyfriend, who started playing with her best friend’s husband often. Initially, she saw it as a net positive for her and her friend to enjoy socializing without the guys.“It was our way to have girl's time alone. They can leave the house, and we can be at home. But that got old and boring quick. So the guys suggested we play as a foursome. You can take your bag full of White Claws… that sounds fun enough to try it once. So in June, we started going to the driving range, renting clubs, just to see how good we were. Then the first time we played 18 holes with them. We may have beat them for a few holes. The tides are turning — it seemed promising,” she said.Granite Links in Quincy, Massachusetts (Photo: Rona Li)After that first round, spent sipping on boozy seltzers and spending time outside, Li found her competitive spirit ignited and her passion for golf accelerated quickly.“To be outside, to have Claws… that was our little activity. Since then, we have probably played six to seven rounds together. We even drove out to Cape Cod to play at a few golf courses out there. So now it’s like let’s plan trips around where the prettiest golf courses are. We impulsively booked a flight out to Hawaii in December...figure, why not?”Yuna Park, 30, echoed this sentiment. As her husband started spending more time on the course with her friends, she found herself wanting to learn. So far, it’s been a frustrating yet fruitful endeavor.“Now, that more people in my life are starting to pick up and with my friends and family who have been playing in the past, it gives us an opportunity to connect whether it’s for a couple of hours or even plan for future golf vacations...after I get better.”The female driverAs women flock to courses in droves, golf instructors are seeing demand from the demographic in their students. Last year, 23% of on-course golfers were women, though they do represent a disproportionately higher percentage of beginners and juniors than the overall population of golfers.Rebecca Lee-Bentham, formerly ranked the No. 1 female golfer in Canada, says she’s excited about this unprecedented surge in interest. Lee-Bentham has over five years of experience playing on the LPGA Tour. This year, she wasn’t supposed to be coaching at all because of the busy slate of events. But because of the pandemic, she found herself with more bandwidth to work with students.While her student mix is a combination of first timers and others who had dabbled in the past but are taking it seriously for the first time, she’s seeing insatiable demand for lessons from students, the majority of them under 40 years old.Rachel Kim with friends taking a break while golfing (Source: Rachel Kim)“There are lots of fresh beginners...the most I’ve ever seen. And my friends who coach are all booked up. The ones that were struggling are now full with students. It’s the busiest I’ve seen golf courses and driving ranges. I’ve seen a lot more demand from the younger demographic — kids, young adults and women.”Kim, the MBA grad, who is set to start a management consulting job in January, finds the cliché that business deals are done on the golf course highly antiquated.“That’s secondary now, a pretty outdated idea. It’s a plus, of course. A lot of my female friends started playing because they want to be outside and enjoy the weather, be active, take on a new activity. It doesn’t hurt that if I get invited to a golf outing at work, I can hang,” she added.The fairway of opportunityWith the uptick in interest, manufacturers of all things golf have been reaping the rewards. According to a Golf Datatech report, U.S. golf equipment sales reached $388.63 million in July, the greatest single-month retail sales ever recorded. The research firm first started tracking data in 1997; the last time sales were even in the same ballpark was in June 2007 ($368.1 million) and June 2006 ($364 million), during Tiger Woods’ pinnacle period of red-hot success. He was the top-ranked golfer in the world from August 1999 to September 2004, and again from June 2005 to October 2010.This is a massive sigh of relief for an industry that was in deep decline just four years ago (Both Nike (NKE) and Adidas stopped selling golf gear in 2016 and 2017, respectively). In August, golf manufacturers Callaway (ELY) and Titleist and FootJoy parent company Acushnet Holdings (GOLF) signaled the summer season was looking bright.“The golf business has been great,” Ed Stack, Dick’s Sporting Goods (DKS) CEO said last month after reporting blowout revenue and profitability, as customers searched for ways to get outdoors. Dick’s, which sells golf equipment in its stores, also owns the standalone Golf Galaxy brand.“There’s a number of young people who have come into the game because they’re not playing football or soccer or some other sport... Men, women, and kids have really all jumped into this game and we expect that to continue through the balance of the year,” added Stack.Three golfers play twilight golf after a long day of working from home in El Segundo, California (Source: Melody Hahm)Now as golf starts to shake off its association as a sport that’s stuffy, white and male, there’s plenty of room for modernization. During this time, as Kim has been playing more and more rounds of golf, she discovered a problem — and a potential opportunity. She and another female business school classmate are building a women’s golf apparel line.“As I got into the game of golf, all my friends had the same complaints: ‘I can’t find any women’s golf clothing at a good price range that feels youthful and contemporary. Everything’s so pink, preppy, more targeted toward 60-plus year-old women. We want to design clothing that’s welcoming that encourages women to play golf. A big part of golf is feeling like you belong on the course. We still want to look cute, feel good, that kind of thing,” said Kim.Kim and her business partner are currently conducting market research and finding potential manufacturers in New York City with the hope of launching the direct-to-consumer brand in the spring of 2021. The goal is to sell an outfit (skirt and shirt combination) for $150.“There are a lot of golf apparel companies that have beautiful stuff but one skirt costs $150. A lot of people are not willing to invest that amount of money, especially if they might not actually know if they want to continue playing. The goal is to be versatile so you can wear the clothes on or off the course. Women don’t love wearing collared shirts like men do. Maybe the skirt could be worn to brunch with a cute sweater,” she said.Lee-Bentham, the golf pro, is excited to see more people buzz about the sport she has dedicated her life to.“I love seeing the spike of young golfers. I hope it’s long term but I’m sure it’ll fizzle out after COVID. But it’s good that lots of people are trying it out. And golf was seeing a big decline before COVID,” she said. “Now you’re seeing celebrities and other pro athletes taking up golf making it ‘cool.’ I love it. Now I’m like ‘I can fit in.’ I’m no longer an outcast.”Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:‘Mulan’ producer on boycott threats: ‘I feel badly...the conversation turns to this’What Silicon Valley still doesn't understand about its diversity problemSerial tech entrepreneur launches ambitious alternative to school: 'It's a very progressive approach to education''People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talent"}]}