{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-16-2020-222206832.html", "published": 1592320460.0, "headline": "Stock market news live updates: Stocks rise after record retail sales jump, reports of more stimulus", "body": "Stocks surged Tuesday after much stronger than expected retail sales data for May boosted investor confidence in a speedy economic recovery. Reports of additional stimulus from the Trump administration in the form of a $1 trillion infrastructure package, along with hopes that a common drug could help treat coronavirus patients, also helped catalyze the rally.[Click here to read what’s moving markets heading into Wednesday, June 17]Retail sales jumped by a record 17.7% in May over April, coming in at more than double the consensus estimate for a rise of 8.4%. This followed a record 14.7% plunge in retail sales in April, with the reversal suggesting consumer spending was picking back up as businesses began to reopen in May.“We’ve been used to seeing record lows in economic fundamentals over the past few months and to see the pendulum swing so far in the other direction is nothing if not encouraging,” Mike Loewengart, managing director of investment strategy for E-Trade Financial Corporation, said in an email Tuesday. “Looking at this morning’s number in aggregate, this is another indicator that a v-shaped recovery could be more likely than we initially thought.”Separately, investors also eyed multiple reports stating that the widely used steroid dexamethasone helped reduce the death rate of patients with severe cases of Covid-19, according to trial results.The moves higher in equities sent the three major indices higher for a third straight session.Tuesday’s developments added to the risk-on mood sparked after the Federal Reserve announced Monday it was expanding its own stimulus program for the virus-stricken economy. The Fed said it would begin purchasing individual corporate bonds as part of its emergency lending program, expanding the Fed’s previously announced Secondary Market Corporate Credit Facility, which had until Monday only included purchases of exchange-traded funds.“I think what they’re trying to get away from is the perception that they’re favoring one company or one industry over another so they try to spread it out,” Kathy Jones, chief fixed income strategist at Charles Schwab, told Yahoo Finance’s The Ticker of the announcement. “But again, the bonds have to meet their criteria, which means they’re not buying the lowest credit quality bonds in the high yield market. They’re going to be buying those with higher credit ratings and up to a five-year maturity.”Story continuesThe slew of more positive economic data combined with additional stimulus news at least temporarily diverted investor attention from signs of increasing coronavirus cases in some parts of the country. Texas and Florida each reported record new coronavirus cases earlier this week, and other states including Arizona and California have also recently seen renewed increases in cases with their own reopenings under way.Travel and leisure stocks including American Airlines, Norwegian Cruise Line Holdings, Royal Caribbean International and Hilton – which have seen their shares mostly move in lockstep in recent weeks with states’ reopenings under way – gained in late trading.—4:05 p.m. ET: Stocks rise for third straight session after record retail sales jumpHere were the main moves in markets as of 4:05 p.m. ET:S&P 500 (^GSPC): +58.15 (+1.90%) to 3,124.74Dow (^DJI): +526.82 (+2.04%) to 26,289.98Nasdaq (^IXIC): +169.84 (+1.75%) to 9,895.87Crude (CL=F): +$1.05 (+2.83%) to $38.17 a barrelGold (GC=F): +$7.30 (+0.42%) to $1,734.50 per ounce10-year Treasury (^TNX): +5.4 bps to yield 0.7560%—12:31 p.m. ET: Stocks hold higher as session rolls onHere were the main moves in markets, as of 12:31 p.m. ET:S&P 500 (^GSPC): +58.02 points (+1.89%) to 3,124.61Dow (^DJI): +555.1 points (+2.15%) to 26,318.26Nasdaq (^IXIC): +161.64 points (+1.66%) to 9,887.66Crude (CL=F): +$0.26 (+0.7%) to $37.38 a barrelGold (GC=F): +$8.60 (+0.5%) to $1,735.80 per ounce10-year Treasury (^TNX): +4.9 bps to yield 0.751%—10:17 a.m. ET: Powell says full recovery ‘unlikely’ until public views virus as containedFederal Reserve Chair Jerome Powell began delivering his Semiannual Monetary Policy Report to Congress Tuesday morning, reiterating the Federal Reserve’s cautious stance on the pace of the economic recovery as the coronavirus pandemic continues in the U.S.“Significant uncertainty remains about the timing and strength of the recovery,” Powell said in prepared remarks. “Much of that economic uncertainty comes from uncertainty about the path of the disease and the effects of measures to contain it. Until the public is confident that the disease is contained, a full recovery is unlikely.”Still, Powell noted that “some indicators have pointed to a stabilization, and in some areas a modest rebound, in economic activity,” highlighting the much stronger than expected May jobs report.—10:03 a.m. ET: National Association of Home Builders index rises more than expected, showing ‘housing well-positioned to lead the economy forward’The National Association of Home Builders’ (NAHB) confidence index for builders rose by 21 points to 58 in June, coming in above the 45 print expected by consensus economists. Readings above 50 reflect a positive market.“As the nation reopens, housing is well-positioned to lead the economy forward,” NAHB Chairman Dean Mon said in a statement. “Inventory is tight, mortgage applications are increasing, interest rates are low and confidence is rising. And buyer traffic more than doubled in one month even as builders report growing online and phone inquiries stemming from the outbreak.”—10:01 a.m. ET: Business inventories fell more than expected in AprilU.S. business inventories fell by more than expected in April as the coronavirus pandemic weighed on imports and global commerce.Business inventories dropped by 1.3% in April, extending a 0.3% drop from March. Motor vehicle inventories plunged by 8.4%, weighing on the overall print. Retail inventories excluding autos, a measure included in the calculation of gross domestic product, declined by 1.1%.—9:31 a.m. ET: Stocks open sharply higherHere were the main moves in markets as of 9:31 a.m. ET:S&P 500 (^GSPC): +83.22 points (+2.71%) to 3,149.81Dow (^DJI): +795.79 points (+3.12%) to 26,567.07Nasdaq (^IXIC): +210.74 points (+2.17%) to 9,940.37Crude (CL=F): +$1.09 (+2.94%) to $38.21 a barrelGold (GC=F): +$0.70 (+0.04%) to $1727.90 per ounce10-year Treasury (^TNX): +7.1 bps to yield 0.773%—9:20 a.m. ET: Industrial output recovered, but by a less than expected margin in MayDomestic industrial production rose by 1.4% in May after a record decline of 12.5% in April, data from the Federal Reserve said Tuesday. Consensus economists had expected industrial output to rise by 3% in the month, as factories, mines and utility businesses picked up activity in May. May’s increase in output was led by the production of motor vehicle and parts.Capacity utilization, or a measure of the proportion of a plant being used, also posed a modest rebound in May. This rose to 64.8% in May from 64% in April.—8:30 a.m. ET: Retail sales jump 17.7% in May after April’s record slumpRetail sales surged in May over April following a record decline, in a sign that consumer spending was beginning to recover from a nadir amid the coronavirus pandemic.Retail sales rose 17.7% in May, following April’s 16.4% drop over the prior month, the Commerce Department said in its advance report Tuesday. Consensus economists expected retail sales to rise 8.4% in May, according to Bloomberg data.Excluding auto and gas sales, retail sales rose 12.4%, also better than the 5.1% rise expected in May. This measure of retail sales fell 16.2% in April over March.—7:28 a.m. ET Tuesday: Stocks pace toward third straight day of gainsHere were the main moves during the pre-market session, as of 7:28 a.m. ET Tuesday:S&P 500 futures (ES=F): 3,107.75, up 34.75 points or 1.13%Dow futures (YM=F): 26,222.00, up 417 points, or 1.62%Nasdaq futures (NQ=F): 9,901.00, up 100.5 points, or 1.03%Crude (CL=F): +$0.62 (+1.67%) to $37.74 a barrelGold (GC=F): +$7.30 (+0.42%) to $1,734.50 per ounce10-year Treasury (^TNX): +4.4 bps to yield 0.746%—6:02 p.m. ET Monday: Stock futures open higherHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:07 p.m. ET:S&P 500 futures (ES=F): 3,085.00, up 12 points or 0.39%Dow futures (YM=F): 25,926.00, up 121 points, or 0.47%Nasdaq futures (NQ=F): 9,828.75, up 28.25 points, or 0.29%A trader wears a face mask on the floor of the New York Stock Exchange (NYSE) following traders testing positive for Coronavirus disease (COVID-19), in New York, U.S., March 19, 2020. REUTERS/Lucas Jackson TPX IMAGES OF THE DAY—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}