{"article": [{"url": "https://finance.yahoo.com/news/kansas-city-fed-president-esther-george-yahoo-finance-transcript-august-2020-110014699.html", "published": 1598422100.0, "headline": "Jackson Hole 2020: Kansas City Fed President Esther George speaks with Yahoo Finance [Transcript]", "body": "Esther George, president of the Kansas City Fed, joined Yahoo Finance on the virtual sidelines of the annual Jackson Hole symposium to discuss the impact of the COVID-19 pandemic on the U.S. economy and how the Federal Reserve is responding.Below is a transcript of her appearance, taped on August 25 and aired on August 26.-BRIAN CHEUNG: Welcome to \"Yahoo Finance Presents.\" I'm Brian Cheung, joined here by a very special guest: Kansas City Fed president Esther George. President George, thanks so much for joining us today.ESTHER GEORGE: Thank you, Brian. Good to see you.BRIAN CHEUNG: So I want to kick things off with just a discussion of where things are where you are in the 10th District. It covers all or part of seven states. Chairman Powell saying in that July FOMC recently that the economic recovery is going to depend significantly on the course of the virus. What is the course of the virus in the 10th District? And how is it affecting the economic conditions in your region?ESTHER GEORGE: Well, as we've seen in many parts of the country, the course of the virus has varied depending on locality, depending on status of opening up those areas. And we see that in our own region, where initially, case counts were low. But, of course, over the summer, we have begun to see some variation in that. So I think we are really seeing the interconnection between the spread of the virus and how the economy can begin to open up again.BRIAN CHEUNG: So one challenge is whether or not there are certain pockets of the economy that are feeling this more than others, one example being state budgets. State and local governments have been hit particularly hard. Households are still constrained on an income side because of the millions of Americans that are having to turn to unemployment insurance every week. In your district, what types of things do you see as areas of concern with the recovery being dragged out, given the numbers you just presented? And is that really more of a monetary policy or a fiscal policy solution that would address those things?Story continuesESTHER GEORGE: So part of the way we judge how the economy is unfolding, in addition to the data collections, we get is really to talk to our contacts throughout that seven-state area. And so we get first-hand information on where some of the pain points are and where things may be improving. One of the things I've observed, though-- it has really taken both: both the actions of the Federal Reserve as well as fiscal policy. That has been critical to how households and businesses have been able to survive during this period.BRIAN CHEUNG: So on interest rate policy, that seems to be the big lever that the Federal Reserve has used during downturns like this. The Fed's been backed up to zero, has been the case since the end of March. Do you personally see the Fed holding rates at the zero bound through the end of 2022?ESTHER GEORGE: So I think when we look at the forecast for the economy, holding rates where they are today is really going to be a function of how the economy unfolds. And I think right now, it's too soon to really tell what's going to happen-- what will happen this fall in terms of the virus, what will happen in terms of the pattern of recovery. I think what I would say, though, is until we see progress that begins to tell us the economy has regained its footing, we can expect the Fed's policy to remain very accommodative.Kansas City Federal Reserve Bank President Esther George addresses the National Association for Business Economics in Denver, Colorado, U.S. October 6, 2019. REUTERS/Ann SaphirBRIAN CHEUNG: What does progress mean, given what you just said? Another way of asking this is about the forward guidance. There's been talk about pinning lift off to some kind of outcome-based guidance, whether or not that's the unemployment and/or the inflation rate or calendar-based guidance, committing to leaving rates this low until a certain date. What are the indicators that you're looking for? And could you see the Fed codify that in the communication?ESTHER GEORGE: So I think one of the things I look for is, obviously, we know what our mandate is. We're asked to make sure that we can promote maximum employment, that we make sure prices remain stable and well-anchored. And those take place in the context of a sustainable growth environment.So there are a lot of things to be looking at, certainly in the near term and in the years ahead, which is how do the labor markets begin to heal? How quickly does employment come back? What do we see in the inflation data? All of those are going to inform the committee's decisions around what kind of policy actions it might take next.BRIAN CHEUNG: Now in terms of policy actions, as you mentioned, a lot of uncertainty right now. But there's questions about with rates at zero, what other tools does the Fed have to provide further accommodation if things turn for the worse? We've heard so many times that the Fed has thrown the kitchen sink. It's like how many kitchen sinks does the Fed have? What other tools are in the box?ESTHER GEORGE: So you know that the Federal Open Market Committee has been talking about for more than a year, pre-pandemic, what kinds of actions it can take under different scenarios. I think where I'm focused right now, though, is to say we have done a lot. The interest rate policy, financing conditions are very accommodative. And we still have capacity in those credit facilities that have been rolled out under 13(3).So certainly, if the economy takes a turn, the committee is going to have to think about what, if anything, it should be doing. And I wouldn't suggest that we won't do anything. But I think right now, it's too soon really to begin to talk about what other kinds of things would be appropriate, because I think we're pretty well-situated under today's scenario.BRIAN CHEUNG: You had just mentioned that the Fed's been thinking about this type of scenario in the past before we had the pandemic. That Fed Listens review that the Fed was doing for the year leading up to the crisis was looking at dual mandates and whether or not the Fed could tweak its approach, not to change the 2% inflation, but maybe the way that you communicate how you're trying to get to 2% inflation. The Kansas City Fed has held its own Fed Listens event, where it's listened to local area leaders and what not.What was the biggest takeaway for you from that process? I know that Chairman Powell will be speaking about the framework review on Thursday. But just based off of your personal interactions through this process, what's been the big, one takeaway from that?ESTHER GEORGE: So I think one thing that's been very important, Brian, is the process itself. So I think it's good for the central bank to step back periodically and look at its assumptions about the economy, the way the economy has actually evolved, and see what it's learned from those experiences. And so the review of our framework has certainly given us the opportunity to do that.I think the other takeaway from this-- as we talk to the public, you become aware of how important your communication is. For example, when we talk about inflation not hitting a target, you find that the general public, that often doesn't resonate. And they can be perplexed as to why we would be worried about inflation being too low when what they may be seeing in their daily purchases suggest it's not an issue or they're having issues with the price of things. So I think a reminder about our communication, but I think, importantly, the process we've undergone has been very important.BRIAN CHEUNG: So I want to switch gears to the liquidity facilities that you had just mentioned. There's a lot of focus on the Main Street Lending Program. This is a relatively unprecedented thing that the Federal Reserve has done: to try to offer cheap loans to businesses on Main Street.Since that point in time when the Fed has opened up that facility, it looked like there were no takers specifically in your district for that facility, although the data that I was looking at was as of the end of July. I know there's a lot pending in the pipeline right now. But in your view, has the program, the Main Street Lending Program, served the liquidity needs of businesses in your district well?ESTHER GEORGE: So I think you pointed out, that is a relatively recently opened up program. It came online in early July. And the process of meeting the needs of small business borrowers is really front and center of what I see in our region, the role of community banks. Community banks, well before any government programs came out, were focused on how to assist their borrowers and how to assist their community.When we look at small business loans, though, they're not standardized. They really depend on the underwriting and the analysis that individual banks do. So my expectation is that could prove to be a much more important facility than we saw initially. I think as banks begin to understand the program-- already we've seen some 500 lenders sign on to that-- that we'll begin to see the take up on that program. And I hope that that is going to be an important facility for small businesses who really are looking for support right now.From left, Esther George, President and CEO of the Federal Reserve Bank of Kansas City, John Williams, President and CEO of the Federal Reserve Bank of New York, and Jerome Powell, Chairman of the Board of Governors of the Federal Reserve System walk together after Powell's speech at the Jackson Hole Economic Policy Symposium on Friday, Aug. 24, 2018 in Jackson Hole, Wyo. Powell signaled Friday that he expects the Fed to continue gradually raising interest rates if the U.S. economic expansion remains strong. (AP Photo/Jonathan Crosby)BRIAN CHEUNG: So I want to rewind to right before the pandemic. You made a speech here in New York City right before all of this happened. It was actually my last in-person conference. It may have been yours as well.At the time, you said that large-scale asset purchases could lead to elevated asset valuations and possibly a buildup of financial imbalances. Fast forward to now, the Fed balance sheet is at about $7 trillion. When you look at the stock market and the backstops that the Fed has put in a number of different markets, how do you assess the current state of financial imbalances? And does that threaten the recovery if we do at some point-- are on the way back up?ESTHER GEORGE: So I have talked about the role of asset purchases, low-for-long interest rate policy, and the implications that can have for financial stability, for creating imbalances. So that is always a concern, and I suspect will be something we are going to have to focus on in the years ahead. The focus, of course, right now for the Federal Reserve, though, is to pay attention to what the economy needs and what it's able to provide.So my support for the actions that have been taken have been in that context, to understand that the economy is suffering a terrible shock right now. And for the Federal Reserve to provide the kinds of facilities, the kind of accommodation is going to be very important. There'll come a day, I hope, when we have to look at the economy growing in a way that we will rethink those things.BRIAN CHEUNG: President George, I do want to broaden out now to the Jackson Hole conference. Of course, I say Jackson Hole in the quotes, because, unfortunately, given the pandemic, you're in Kansas City. I'm here in Brooklyn, New York. I wish I could be there wearing a hat like that in Jackson Hole, Wyoming right now.But the theme of this particular conference is \"Navigating the Decade Ahead-- Implications for Monetary Policy.\" What are your expectations for the types of conversations that will be going on during this conference? And more specifically within the context of what's happening right now with this pandemic - what do you hope the takeaways will be for the number of policymakers that will be attending this conference virtually?ESTHER GEORGE: So our hope for the Jackson Hole conference is always to make sure that we are bringing relevant issues and that they get the benefit of a variety of views and good discussion. And so although we'll be doing that virtually this year, those are the ingredients that I hope come to bear. The topic itself really was one that we thought about ahead of the pandemic, which were some of the issues that are likely to be in focus for central banks in the decade ahead, things like low growth that we've experienced over the past decade, thinking about low interest rates and why that is, thinking about uncertainty-- all of those things, I think, have been amplified now that we are in a time of pandemic.And so I think it will provide for a rich discussion. I am hopeful that based on the papers, the authors, the discussions, and the participants in this conference, that we'll bring new insights to some of those issues for the decade ahead.BRIAN CHEUNG: One really unique thing about this particular conference is that it will be open to the public. Anyone can watch the YouTube stream, whereas previously, it was invite-only - if you were physically there in Jackson Hole, you wouldn't know what was going on behind those closed doors. Why did you decide to open it up? And what do you hope that will yield in terms of people, who are either close Fed watchers or people who have never heard of the Federal Reserve before, gleaning from these types of conversations that will be happening Thursday and Friday?ESTHER GEORGE: So we've always been committed to transparency and public access to what we're doing at Jackson Hole. And we do that by having the media in the room with us. We do that by providing the papers. And we do it by taking a transcript for every question that happens at that symposium. It comes out through a book of proceedings about that.The fact that we couldn't be there in person this year, though, we stayed true to that commitment. And technology, of course, allows something that we can't do when we are in the national park there in the space where we typically are. So the ability to broadcast to a wider audience is something that's available to us this year.BRIAN CHEUNG: I will say, the internet connection there can be a little spotty at times. But I did want to ask, we talk about low interest rates, obviously, that being a big discussion broadly, even before the pandemic. But in your view as a policymaker that's been inside the Fed for a while, what are some of the reasons for why the Federal Reserve has in recent crises found itself backed up at the zero bound repeatedly? And do you think that there are consequences to that type of policy action in the future, whenever it is we get out of this pandemic and at some point down the line, maybe face another type of downturn?ESTHER GEORGE: So there have been a lot of discussions about this. And I really do look forward to some of the things we'll learn at this year's symposium, as we hear from academics and others about why it is we find ourselves here. I do think we see a number of structural factors in the economy that can contribute to that, whether you think about demographics, you think about technology, and how the structure of the economy itself may produce a different interest rate environment.I think for me, of course, always thinking about what are the longer-term implications for those low interest rates is going to continue to be even more important if that's the state of the world going forward. And we will have to think of ways to be more mindful of where imbalances could be growing as a result of the need to be in a lower interest rate environment.Esther George, left, president of the Kansas City Federal Reserve Bank, listens to a speaker during a closed door meeting with representatives of the marijuana industry in Colorado, Thursday, April 9, 2015, in Denver. Kansas City Federal Reserve President George held the closed door meeting with 20 representatives of the marijuana industry at the behest of Colorado congressmen Ed Perlmutter and Jared Polis. (AP Photo/David Zalubowski)BRIAN CHEUNG: Well, and the Jackson Hole conference is usually a pretty good forum for international policymakers to be sharing their knowledge. I mean, when we talk about the issue of low interest rates and whether or not there are certain structural reasons for why an economy, whether or not it's aging population or decreasing productivity-- folks at the Bank of Japan have been dealing with that for many years. So when we talk about this year, what do you hope to glean from other policymakers that are outside of the Federal Reserve, those from the ECB, BOJ, BOE, other types of central Banks. And do you think that that international coordination has increased over the last few years, and maybe has that been accelerated by the pandemic?ESTHER GEORGE: I think that's a great point. Core to the Jackson Hole symposium is really bringing a global perspective to these issues. And we both learn from those as we hear the experiences of other countries. We always take into account the different dynamics of that. So I think it's a very important conversation.This year, we'll have more than 40 countries, 40 central bankers, that will participate in the symposium. And hearing from them, I think, is going to be critical to casting light on these issues that we've made the theme of this year's program.BRIAN CHEUNG: So the last question here I want to wrap up with-- I've been asking a lot of other Fed presidents during this pandemic about the specific type of interactions that you have with individuals, whether or not that's a household or a business in the district. During these times when there's just so much uncertainty, as someone at the Kansas City Fed, what are you telling them to do or watch for in this type of economic environment to give them reassurance that there will be some light at the end of the tunnel?ESTHER GEORGE: It's a great question. So my job as a regional Fed president is really to engage closely with all parts of the economy in my region. And we have never done that more than we have during the last five months. When sometimes our formal statistical data may look noisy to us, talking to people on the ground really can inform how we understand how the economy is unfolding.And as I listen to the challenges they face across our region, I think it's important to remember: we came into this with a strong economy. We had historically low unemployment. And that positions us better, I think, when we look at how we come out on the other side. So assuming we get the policy mix right, assuming that the medical issues can be addressed, I think the economy is well-positioned to be able to recover at some point in the future.BRIAN CHEUNG: Well, a lot to chew on there, but again, that was Federal Reserve Bank of Kansas City President Esther George. President George, thank you so much for joining us here on Yahoo Finance today.ESTHER GEORGE: Thank you, Brian.-Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}