{"article": [{"url": "https://finance.yahoo.com/news/existing-home-sales-economic-indicator-may-have-bottomed-in-may-morning-brief-101752350.html", "published": 1592889920.0, "headline": "Another economic indicator may have bottomed in May: Morning Brief", "body": "Tuesday, June 23, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeExisting home sales plunged in May. Most think the worst is over for this reading.For nearly two months, we’ve been chronicling calls from strategists and economists who believe the worst economic impacts from the pandemic are behind us.And on Monday, another piece of economic data hit what most believe will be the reading’s nadir.Existing home sales for the month of May fell 9.7% from April to a seasonally-adjusted annual rate of 3.91 million. Sales fell 26.6% from the same month last year.“Sales completed in May reflect contract signings in March and April – during the strictest times of the pandemic lockdown and hence the cyclical low point,” said Lawrence Yun, chief economist for the National Association of Realtors. “Home sales will surely rise in the upcoming months with the economy reopening, and could even surpass one-year-ago figures in the second half of the year.”“After plummeting 32.1% over the last three months, we think existing home sales found their bottom in May,” said Nancy Vanden Houten, lead U.S. economist at Oxford Economics.“Mortgage purchase applications point to a solid rebound in home sales in June. We expect existing home sales to be down slightly for the year, however. The slow recovery in the labor market limit will keep a lid on how much sales can rebound. Limited inventories will also continue to be a constraint on sales.”For years now, a lack of supply — particularly at the lower end of the housing market — has kept prices elevated and made home ownership unaffordable for many would-be first-time buyers.SEATTLE, WA - OCTOBER 31: A Redfin real estate yard sign is pictured in front of a house for sale on October 31, 2017 in Seattle, Washington. Seattle has been one of the fastest and most competitive housing markets in the United States throughout 2017. (Photo by Stephen Brashear/Getty Images for Redfin)Even still, Monday’s data suggests homebuyers are showing a preference for leaving cities and moving to the suburbs as the pandemic has changed both lifestyle and remote work expectations.“Relatively better performance of single-family homes in relation to multifamily condominium properties clearly suggest migration from the city centers to the suburbs,” Yun said. “After witnessing several consecutive years of urban revival, the new trend looks to be in the suburbs as more companies allow greater flexibility to work from home.”Story continuesAnd so while strong demand, low supply, and increasing confidence among homebuyers all auger well for the single-family housing market — whether these homes are new or existing structures — some commentary from executives at Lennar (LEN) last week suggested new construction may have an even larger tailwind in the months ahead.“In May, we saw an influx of new homebuyers wanting to take advantage of extremely low mortgage rates and move out of apartments in densely populated areas and homes they were sharing with friends and family during the pandemic,” said Lennar CEO Rick Beckwitt on the company’s earnings call last week. This commentary tracks with what Yun sees as demand for detached homes among urban dwellers seeking new living arrangements in a post-pandemic world.But Beckwitt added that, “We also heard increased conviction from people wanting to buy a new, safe and clean home versus an existing home.”And while there is little which suggests buying a previously owned home would elevated pose health risks even considering all we don’t know about the virus, everything happening now is new and no one knows what comes next.Consumer preferences for new homes over old homes because of health concerns might be a fleeting part of the housing market, but it also may well be a new trend. Certainly, Lennar would like to see more demand for newer homes.But either way, recent data has shown the housing market has held in far better than many expected just a few months back. And Monday’s report might’ve been the last truly depressed piece of housing data we get for the rest of this year.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy9:45 a.m. ET: Markit US Manufacturing PMI, June preliminary (50.8 expected, 39.8 in May)9:45 a.m. ET: Markit US Services PMI, June preliminary (48.0 expected, 37.5 in May)9:45 a.m. ET: Markit US Composite PMI, June preliminary (37.0 in May)10 a.m. ET: New Home Sales, May (635,000 expected, 623,000 in April); New Home Sales month-on-month, May (+1.9% expected, +0.6% in April)10 a.m. ET: Richmond Fed Manufacturing Index, June (-11 expected, -27 in May)READ MORETop NewsTrump says China deal ‘fully intact’ after Navarro roils markets [Bloomberg]Trump suspends entry of certain foreign workers despite business opposition [Reuters]Boston Fed's Rosengren: Second half of 2020 will be 'more difficult' than anticipated [Yahoo Finance]Apple is ditching Intel to build its own processors for its MacBook and iMac systems [Yahoo Finance]More from Apple WWDC3 key themes from Apple's big eventApple: New macOS 'biggest design upgrade since introduction of Mac OS X'Apple debuts iOS 14, hitting iPhones later this yearApple: Use our stuff over Google's if you care about privacyApple Watch finally gets sleep tracking, plus hand-washing featureYAHOO FINANCE HIGHLIGHTSCoronavirus stimulus: Here’s what has happened so far to the $3 trillion in pandemic aid President Trump is great for your 401(k): strategistPrimary care doctor: 'We should all be very worried' about plunging patient visits amid pandemic—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}