{"article": [{"url": "https://finance.yahoo.com/news/house-report-finds-billions-of-dollars-in-questionable-ppp-loans-183933217.html", "published": 1598968040.0, "headline": "House report finds billions of dollars in questionable PPP loans", "body": "Democrats on the House subcommittee overseeing the coronavirus response released a staff report on Tuesday, flagging billions of dollars in questionable Paycheck Protection Program loans.Democratic members of the Select Subcommittee on the Coronavirus Crisis are now calling for more oversight of the program, highlighting several issues they say suggest a “high risk” of fraud and abuse.Treasury Secretary Steven Mnuchin testified before the subcommittee in a hearing on Tuesday afternoon.“The Subcommittee’s analysis shows that PPP helped millions of small businesses and non-profit organizations stay afloat during the coronavirus crisis, but a lack of oversight and accountability from SBA and Treasury may have led to billions of dollars being diverted to fraud, waste, and abuse, rather than reaching small businesses truly in need,” said Chairman James Clyburn (D-SC) in a memo to the subcommittee.The report found red flags, like mismatched addresses, for nearly $3 billion in loans to more than 11,000 borrowers, after comparing PPP loan information against a federal database of businesses.According to the report, subcommittee staff found $1 billion in loans may have gone to borrowers who received multiple PPP loans. While the analysis found nearly 11,000 loans in which the borrowers received multiple loans, the memo says only 65 loans would definitely face additional scrutiny since the Trump administration only plans to individually audit loans over $2 million.In this May 21, 2020 photo, a sign on a business in Tenino, Wash., says they are closed due to the coronavirus and state stay-at-home restrictions. (AP Photo/Ted S. Warren)In the hearing on Tuesday, Mnuchin said loans for lower amounts could face more scrutiny as well.“We’ve never said those loans wouldn’t be audited,” said Mnuchin. “Many of the things that the committee found I would expect SBA, when they review those loans, would also find those things.”More than 600 loans totaling more than $96 million went to companies that have been excluded from doing business with the government and more than 350 loans worth $195 million went to government contractors with “significant performance and integrity issues,” according to the report.Story continuesThe Democratic majority also said SBA and Treasury approved hundreds of loan applications that were missing or incomplete identifying information on the loan applications, including names and addresses.In Tuesday’s hearing, Republicans defended the program saying the questionable loans make up a very small portion of the total loans issued.“Let’s keep perspective on this,” said Rep. Blaine Luetkemeyer (R-MO). “That’s a pretty good rate — that’s well beyond what we’d expect for the government to be able to do.”The Small Business Administration says it issued 5.2 million PPP loans totaling $525 billion. The Trump administration says the program saved 50 million jobs, though economists say the actual number of jobs saved is far lower.Treasury Secretary Steven Mnuchin arrives for a House Select Subcommittee on the Coronavirus Crisis during a hybrid hearing, Tuesday, Sept. 1, 2020, on Capitol Hill in Washington (Nicholas Kamm/Pool via AP)Republicans’ competing reportRepublicans on the subcommittee also issued a competing report on Tuesday, highlighting the Paycheck Protection Program’s successes.“Technical glitches with SBA’s E-Tran portal, which was receiving an unprecedented volume of loan applications, was resolved within a matter of days. SBA also provided clarifying guidance on certain aspects of the program to provide more information to applicants, lenders, and Congress. Their efforts may have prevented an apocalyptic scenario for American small businesses,” said the Republican report.Mnuchin and some Republican lawmakers have previously acknowledged problems in the program’s rollout, but said issues were to be expected as they tried to rush out emergency relief to save struggling businesses. Mnuchin noted $30 billion was returned to the program by companies that should not have initially received the loans.“Taxpayers should not have to choose between quickly getting aid to those who need it and wasting federal funds, and there are simple steps that could have been taken to improve oversight and reduce fraud,” said Clyburn in his opening statements at the subcommittee hearing.Democrats on the subcommittee are now calling on Treasury and SBA to improve internal controls for loan forgiveness, expand oversight of loans by developing a “more robust, risk-based” audit plan and cooperate with Congress, inspectors general and other watchdogs.About $130 billion remains in the Paycheck Protection Program, but the SBA and Treasury stopped accepting applications on Aug. 8. While there is strong bipartisan support to restart the program and allow some small businesses to get a second loan, stimulus negotiations have stalled on Capitol Hill and lawmakers have not been able to pass a bill.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Coronavirus stimulus: Here’s how Americans are using their checksRepublican National Convention: Trump fights for re-election amid coronavirus, economic crises'He will cheat': DNC organizes to combat Trump's 'suppression efforts'Trump is trying to 'undermine confidence' in democracy: Democratic rep.What to expect from the 2020 conventions: 'As good a TV show as they can have'Coronavirus response: Breaking down the debate over liability protections"}]}