{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-covid-weekly-initial-jobless-claims-june-27-170734017.html", "published": 1593675620.0, "headline": "Jobless claims: Another 1.43 million Americans file for unemployment benefits", "body": "Thursday morning, the U.S. Labor Department concurrently released the weekly jobless claims data and the monthly jobs report. The unemployment crisis in the U.S. remains a key focal point even as the weekly data showed incremental improvement.In the week ending June 27, an additional 1.427 million Americans filed for unemployment benefits, exceeding consensus expectations for 1.35 million initial jobless claims. The prior week’s figure was revised slightly higher to 1.482 million from the previously reported 1.480 million. Weekly jobless claims have decelerated for 13 consecutive weeks; however, more than 48 million Americans have filed for unemployment insurance over the past 15 weeks.Read more: Coronavirus: How to find a job in a tough economy(Yahoo Finance/David Foster)Closely watched continuing claims, which lags initial jobless claims data by one week, totaled 19.29 during the week ending June 20, up from 19.23 million in the prior week. Economists were predicting 19 million continue claims for the week.“Data on jobless claims remains noisy at this point due to processing lags, but the fact that cumulative jobless claims over recent weeks are implying a considerably higher level of continuing claims, compared with reported continuing claims data that has been broadly flat over the past four weeks, suggests a high level of churn in the labor market continued through June,” Morgan Stanley wrote in a note Wednesday.UNITED STATES - APRIL 18: A demonstrator demands that Gov. Larry Hogan (R) lift restrictions that have closed certain businesses in Maryland since the coronavirus outbreak on Church Circle in Annapolis, Md., on Saturday, April 18, 2020. (Photo By Tom Williams/CQ-Roll Call, Inc via Getty Images)Pandemic Unemployment Assistance (PUA) program claims, which include those who were previously ineligible for unemployment insurance such as self-employed and contracted workers, was also closely monitored in Thursday’s report.PUA claims totaled 839,563 on an unadjusted basis in the week ending June 27, down from the prior week’s 881,242.Though an imperfect indicator of what to expect from the BLS jobs report, the weekly initial jobless claims provided a glimpse into what to expect from the monthly report.The U.S. economy added 4.8 million jobs in June, up from 2.5 million in May and above consensus expectations for 3.23 million job additions. The unemployment rate ticked lower to 11.1% from 13.3% in the prior month.Story continues“Another big upside surprise for payrolls of 4.8mn while the unemployment rate plunges to 11.1%. Great news, but it doesn't tell the whole story. 31.5mn people are claiming unemployment benefits and employment is still 15 million lower than February. Moreover, with states dialling back on re-openings the July jobs report could be far more sobering,” ING Chief International Economist James Knightley wrote in an email Thursday.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.48 million Americans file for unemployment benefitsWhite Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance news"}]}