{"article": [{"url": "https://finance.yahoo.com/news/whole-foods-ceo-does-not-think-online-grocery-will-remain-the-norm-postpandemic-food-is-different-175009302.html", "published": 1600347500.0, "headline": "Whole Foods CEO does not think online grocery will remain the norm post-pandemic: 'Food is different'", "body": "Amid the pandemic, big retail names like Walmart, Target, Dick’s Sporting Goods, Best Buy, and Chipotle have all highlighted the surge they’ve seen in online shopping (or in the case of food chains, mobile ordering) and curbside pickup. Online grocery ordering and fulfillment has seen the same trend: Coresight Research in May predicted online grocery sales will surge more than 40% in 2020, after growing 22% in 2019. (Online grocery was already big for Walmart before the pandemic: Walmart U.S. president Greg Foran told Yahoo Finance in June 2019 that online grocery was creating a “halo effect” on the rest of Walmart’s business.)The question now is whether these trends will continue on the same breakneck pace once the pandemic is behind us.Many analysts think it will, including McKinsey retail partner Sajal Kohli, who told Yahoo Finance that BOPIS (buy online, pick up in store) is “exceptionally sticky” and that consumers have “discovered this newfound convenience and they will actually stick to curbside.”Whole Foods CEO John Mackey isn’t convinced that will be the case for grocery specifically.“Covid was a tremendous accelerant for online grocery shopping, and people that had never done it before did it for the first time,” Mackey told Yahoo Finance on Wednesday. “I remember people telling me that they were calling up Whole Foods at 2 in the morning so they could get a delivery slot scheduled.”But once the pandemic is fully behind us (however long that will take), Mackey predicts the surge in online grocery will slow.“I think most people will go back to normal patterns once people feel safe again,” he says. “Some people will opt for convenience, if getting food is merely a transaction for you... but food is different, food is sensual, people like to smell it, taste it, touch it. If you’re a foodie, you don’t want to be just ordering stuff online, you want to go out and have the adventure of shopping for food. Particularly at stores like Whole Foods, where you have a lot of prepared foods and the stores are beautiful and fun. I think a lot more people than maybe in other categories of retail will not stay online. Or they’ll do a hybrid, a combination, they’ll get their commodity items delivered or pick it up, but a lot of the other stuff... if you’re going to shop for fresh produce, and meat, and seafood, people want to select it out themselves. Time will tell, but that’s what I think will happen.”Story continuesPeople wear protective face masks outside of Whole Foods Market at the Hudson Yards as the city continues Phase 4 of re-opening following restrictions imposed to slow the spread of coronavirus on September 1, 2020 in New York City. (Photo by Noam Galai/Getty Images)Mackey is making a broad argument about buying certain groceries in person, but he’s also making a company-specific argument about Whole Foods stores being experiential. It’s the same thesis Apple stores have represented for years: that people like going to certain stores rather than shopping online because of the store designs. But ever since Amazon (AMZN) bought Whole Foods in 2017, shoppers have noted the gradual Amazonification of Whole Foods stores, through shelving organization, register promotions for Amazon Prime memberships, and even Amazon Echo devices for sale in markets. Some analysts believe that in the years to come, Whole Foods stores could begin to look more like Amazon warehouses.Mackey also says the slow reopening of Whole Foods hot bars (some of which did huge volume in normal times) will further boost sales and shift shoppers away from online ordering.In mid-March, “We saw our prepared foods just crash,” Mackey says. “Salad bars, hot bars, everything with self-service closed down. Not to mention, offices closed down, so we got no lunchtime traffic. Our prepared foods dropped about 75% year over year. On the other hand, restaurants also closed down, so people started cooking at home, and our sales went through the roof. Pretty much every category, particularly animal proteins— meat, chicken, and fish—exploded, because people were grilling at home... What’s happened now is that our sales remain very high, but also people are bored with their own cooking, so they’re getting out more.”—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Curbside pickup is 'exceptionally sticky' and will continue post-pandemic: McKinsey retail expertWhy Dick’s sporting goods is wildly outperforming amid the pandemicWalmart and Target huge e-commerce gains are a blaring siren to brick-and-mortar retailAmid pandemic, Walmart says it’s seeing increased sales of tops—but not bottomsEtsy CEO on huge Q2: Etsy is 'becoming much more mainstream'"}]}