{"article": [{"url": "https://finance.yahoo.com/news/mass-layoffs-and-smaller-airlines-after-covid-19-even-with-more-aid-193503117.html", "published": 1601045000.0, "headline": "Mass layoffs and smaller airlines loom after COVID-19, even with more aid", "body": "Tens of thousands of U.S. airline employees need Congress to throw them a lifeline soon — before mass industry wide layoffs take place on October 1st, adding to the millions laid off in the wake of the coronavirus pandemic.The original CARES Act provided $25 billion in grants to U.S. airlines in exchange for guarantees they would not lay off employees, but those deals expire September 30. Meanwhile, weeks of stalemate have bogged down plans for a second large stimulus measure, although signs of a thaw have appeared in recent days.“We are hearing that any overall coronavirus relief bill, our payroll support extension, will be included no matter what. There is tremendous bipartisan support,” Association of Flight Attendants President Sara Nelson told Yahoo Finance’s On the Move.Nelson thinks the hard deadline may work in favor of the airline employees, “Because it is a hard deadline of October 1, and oftentimes Washington or any negotiations need a hard deadline,” to get anything done she said.Republicans have proposed a $28 billion dollar extension of the Payroll Support Program (PSP) for U.S. airlines, which was part of last March’s $2.2 trillion Coronavirus Aid, Relief, and Economic Security (CARES) Act. Democrats have included a “PSP2” extension in their $2.4 trillion dollar stimulus proposal, but Congress isn’t expected to take up any stimulus measures until September 29th at the earliest.At stake are scores of jobs linked to an airline industry that’s been decimated by the crisis. American Airlines (AAL) plans to lay off roughly 20,000 employees while United Airlines (UAL) is furloughing about 16,000.Southwest (LUV) and Delta (DAL) have stated they will be able to avoid most layoffs through the end of the year, but may have to furlough employees in 2021. And CEOs from all four of the carriers have called on Congress for additional aid.‘Unraveling’There are over 6.9 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)The 35,000 people about to lose their jobs fails to account for thousands of employees at every carrier who have taken voluntary leaves of absence. That move preserved their benefits, but not their paychecks.Story continues“And we're really much more over 100,000 people who are going to be living without a paycheck,” Nelson said. “We've done some things to try to keep some benefits in place but this is unraveling.”Delta Air Lines says roughly 40,000 employees have taken leaves of absence of various lengths. Delta had 90,000 employees before the pandemic, but with buyouts and retirements has reduced that number to 75,000.In a regulatory filing last month, American said that with layoffs, retirements and voluntary leaves of absence, the company “will have at least 40,000 fewer people working October 1 than we had when we entered this pandemic.”In its most recent earnings report, United Airlines said 6000 employees took a comprehensive voluntary separation package which included flight benefits and continuous pay through Nov. 30.Executive Chairman and former CEO Oscar Munoz, speaking Thursday at the L’Attitude Business Conference, acknowledged the situation. He pointed out that more tenured airline employees are taking early retirement “to give someone underneath a chance to stay.”“So there's going to be smaller airlines,” Nelson said. “But we're going to recover.” And industry trade groups like The International Air Transport Association (IATA) say it will take at least four years for airline traffic to return to 2019 levels.It’s that slow pace of recovery that motivates Nelson and airline CEOs to push Congress for more aid and another six month payroll support program.“We just need a period of time where we can get six months closer to a vaccine, six months closer to a testing regimen,” Nelson said, hoping the spring travel season would bring a return to normalcy for the ailing airline industry.Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.Tens of thousands to lose jobs without airline stimulus from CongressInternational travel could take until 2024 to recover from COVID-19Airline stocks keep rising despite 'highly depressed' ticket sales amid pandemicSouthwest CEO: Bookings 'have recently stalled' because of coronavirus spike'The corporate tax rate — I’m actually OK at 28%': Gary CohnJ&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}