{"article": [{"url": "https://finance.yahoo.com/news/apple-spotify-antitrust-investigation-151914471.html", "published": 1596450440.0, "headline": "Documents reveal the behind-the-scenes battle between Spotify and Apple that lead to an antitrust investigation", "body": "Apple (AAPL) and Spotify (SPOT) don’t have the best relationship. The two companies have clashed for years over how Apple handles Spotify’s apps, saying that the iPhone maker arbitrarily punishes the music streaming giant as a means to protect its own Apple Music and iTunes services.That’s part of the reason Apple is now being investigated for potential antitrust violations by the Department of Justice, state attorneys general, and the House Judiciary Committee.On Wednesday, Apple CEO Tim Cook, as well as the heads of Amazon (AMZN), Facebook (FB), and Google (GOOG, GOOGL), sat before the Judiciary Committee’s Subcommittee on Antitrust, Commercial, and Administrative Law to discuss those accusations and how it treats competing apps in its app marketplace.Apple CEO Tim Cook speaks via video conference during a House Judiciary subcommittee hearing on antitrust on Capitol Hill on Wednesday, July 29, 2020, in Washington. (Graeme Jennings/Pool via AP)Documents presented during the hearing provide a deeper look at the issues between the firms and why Spotify has become one of the key contributors to the testimony against Apple.The files come in the form of a written exchange between Apple vice president and general counsel Bruce Sewell and Spotify general counsel Horacio Gutierrez. In the documents, Sewell tells Gutierrez that a then-recent update to the Spotify app doesn’t comply with App Store guidelines because it provides users with a link that takes users outside of the app to Spotify’s own website where users can sign up for Spotify’s premium paid service.According to Apple’s App Store rules, developers are not allowed to provide users with links from their apps to their own websites for transactions. Apple created the rule to ensure that the tech giant could still capture a cut of subscription sign ups in apps.App developers can provide so-called “reader” apps in which users can access content they’ve purchased outside of the app, but the app itself can’t give a direct way for users to make such purchases. There are exceptions for apps, however, that offer physical goods, such as ride sharing and food delivery apps.Story continuesSpotify has been fighting with Apple for years over how the tech giant treat's the streaming service's app. (AP Photo/Patrick Semansky, File)Sewell explains Apple’s stance to Gutierrez, then threatens Spotify with having its app removed from the App Store if it doesn’t comply with Apple’s request.“If our rules change I will let you know at once, but for now, and in the future, if Spotify wishes to continue to utilize the App Store, it must follow the rules that apply to every other app developer. Your failure to do so will result in removal from the App Store,” Sewell wrote.But in his own correspondence, Gutierrez tells Sewell that Spotify isn’t pushing customers from its iOS app to its own website and payment portal, but rather, that the company was doing so through email campaigns outside of its app.“Plainly, there is no legal or contractual basis for Apple to interfere with app developers’ right to directly and freely communicate with their customers, especially in a case like this where the communication takes place outside of the app itself,” Gutierrez wrote.During his testimony on Wednesday, Cook explained to members of the subcommittee that the vast majority of apps in the App Store don’t have to pay a commission, because they are free. Those that do, pay 30% of each purchase to Apple, while subscription services pay a 30% commission for each purchase, and 15% for each subsequent year.Apple has long held that all apps in the App Store are treated equally, but Gutierrez counters that argument in his letter pointing to other apps like LinkedIn and Deezer that, at the time, offered ways for users to sign up for their services through their apps.“This all is well beyond what Spotify’s app does, and one is hard pressed to imagine what could drive such obviously discriminatory treatment besides an attempt to unlawfully gain competitive advantage,” he wrote.At the Judiciary Committee hearing, Apple’s treatment of apps was once again raised, this time by Representative Joe Neguse (D-CO), who questioned why app developers weren’t allowed to copy features and designs of existing apps, while Apple specifically mentions that it can copy developers’ apps in its developer agreement.Apple argues that its App Store has created 1.9 million jobs and hosts 1.7 million apps including the likes of Uber and Grubhub. The company also provides assistance to app developers and software to run such apps.Apple’s antitrust woes are unlikely to result in the company being broken apart, as its issue specifically relates to whether it favors its own apps over competitors’ offerings.But given the company’s rocky relationship with Spotify, and that company’s push for antitrust investigations into Apple in both the U.S. and the European Union, it seems equally likely that Apple will need to make some changes to how it competes in the app space.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple confirms next iPhone will be delayed “a few weeks”Amazon, Apple, Facebook, and Google CEOs push America-first narrative in effort to avoid antitrust scrutinyAnalysts look to hints of iPhone 12 delays in Q3 earningsTop back-to-school gear: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}