{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-europe-markets-eu-recovery-fund-stocks-074359562.html", "published": 1595299880.0, "headline": "Coronavirus: Stocks rise on stimulus 'game changer' for EU recovery", "body": "German chancellor Angela Merkel and French president Emmanuel Macron at a joint press conference at the end of the European summit. Photo: John Thys/AFP via GettyEuropean markets jumped on Tuesday, as EU leaders reached an “historic” deal on a stimulus package in the early hours of the morning.The pan-European STOXX 600 index was up 1.1%, and Germany’s DAX (^GDAXI) was trading 1.9% higher. France’s CAC 40 (^FCHI) rose 1.3% and the FTSE 100 (^FTSE) in Britain gained 0.7%.A summit in Brussels dragged on into a fifth day as the leaders of 27 states negotiated over the terms of a €750bn (£683bn, $859bn) recovery fund, paid for through joint borrowing. The stimulus is aimed at reviving European economies from the worst recession in decades.The group overcame fierce divisions, with a group of five so-called ‘frugal’ northern countries pushing hard for more of the pot to be conditional loans rather than grants. The Netherlands, Austria, Denmark and Sweden secured increased rebates in exchange for their support.READ MORE: EU leaders agree ‘historic’ €750bn stimulus dealThe announcement of a deal at around 5.15am in Brussels sent the euro to a new four-month high against the dollar (EURUSD=X) at $1.1474 on Tuesday, before edging back slightly. Italian bond yields also fell to their lowest since early March, Reuters reports.ING analysts said the news marked a “significant step of solidarity and integration” for the EU. The European Commission’s new power to borrow in capital markets to give national grants is a “real game changer,” they wrote in a note.Hopes for coronavirus vaccine trials and the EU stimulus also supported Asian stocks overnight. Stocks in Shanghai (^SSEC) rose 0.2%, Japan’s Nikkei (^N225) gained 0.7% and the Hang Seng (^HSI) index in Hong Kong closed 1.9% higher.US futures were also pointing to a mixed open. S&P 500 futures (ES=F) and Dow Jones futures (YM=F) were up 0.7%, while Nasdaq futures (NQ=F) were up 0.9% at around 5am eastern time."}]}