{"article": [{"url": "https://finance.yahoo.com/news/house-hearing-tech-ceos-likely-002452904.html", "published": 1595532740.0, "headline": "Blockbuster tech hearing likely postponed as John Lewis lies in state", "body": "Monday's first-of-its-kind congressional hearing with the CEOs of Amazon, Apple, Google and Facebook is likely to be postponed because of the announcement that the late Rep. John Lewis will lie in state at the U.S. Capitol next week, two sources familiar with the plans told POLITICO on Thursday.Lewis (D-Ga.), a civil rights icon who died last week after a battle with pancreatic cancer, is set to be honored in a private ceremony in the Rotunda on Monday, congressional leaders announced Thursday evening. The event will be followed by a public viewing atop the east front steps on Monday night and Tuesday, and a procession through Washington, D.C., which has yet to be scheduled.Those plans conflict with the House Judiciary antitrust subcommittee's planned hearing with Amazon's Jeff Bezos, Facebook's Mark Zuckerberg, Apple's Tim Cook and Google's Sundar Pichai, scheduled to begin at noon on Monday.One of the sources called a delay \"highly likely.\"The two spoke anonymously to discuss private deliberations.The hearing, the timing for which is now unclear, is the most highly anticipated session in years to feature testimony from major tech companies' CEOs.It's set to be the first time ever that the chief executives of all four companies have testified at the same hearing, and would be the first ever congressional appearance for Bezos, the world's richest person, who also owns The Washington Post. But the likely postponement marks the latest unexpected delay for the committee's investigation into tech and antitrust, which has separately faced delays due to the coronavirus pandemic.The session would be the sixth hearing in the Judiciary Committee's ongoing investigation into competition in the digital marketplace and allegations of anti-competitive conduct by the tech giants. It comes as all four companies face increasing antitrust scrutiny in Washington and Brussels, including a potential antitrust lawsuit that the Justice Department could launch against Google in the coming months."}]}