{"article": [{"url": "https://finance.yahoo.com/news/china-not-forthcoming-hawaii-talks-014921253.html", "published": 1592513840.0, "headline": "China not forthcoming in Hawaii talks, but made commitment on trade: U.S. diplomat", "body": "WASHINGTON (Reuters) - China's attitude in talks with the United States this week in Hawaii cannot be described as forthcoming, although it did commit to following through on Phase One of the U.S.-China trade deal, the senior U.S. diplomat for East Asia said on Thursday.David Stilwell, who spoke after U.S. Secretary of State Mike Pompeo met China's top diplomat, Yang Jiechi, in Hawaii on Wednesday, told reporters the next couple of weeks would show whether the talks were productive.\"The PRC (People’s Republic of China) side could not be described as really forthcoming,” said Stilwell.\"Whether or not (they) were productive … look at what comes up in the next couple of weeks. Do we see a reduction in aggressive behavior or not?\"At the same time, China did commit to following through on phase one of a trade agreement reached with the United States this year, Stilwell said, adding that trade would be a good acid test as to whether Beijing was a cooperative partner.Stilwell said recent Chinese actions, over India, in the South China Sea and over Hong Kong had not been constructive. He said Washington looked forward to seeing China reconsider plans to impose new national security legislation on Hong Kong.The world's two largest economies have been at loggerheads over multiple issues and ties have dipped to what many experts see as their lowest ebb in decades in recent months as the coronavirus pandemic that began in China hit the United States hard.On Thursday, U.S. President Donald Trump who has made rebalancing trade with China a top priority, renewed a threat to cut ties with Beijing.China's foreign ministry said Yang told Pompeo that Washington needs to respect Beijing's positions on key issues, halt its interference on matters such as Hong Kong, Taiwan and Xinjiang, and work to repair relations. [L1N2DU0QK](Reporting by David Brunnstrom and Arshad Mohammed; Editing by Sandra Maler and Alistair Bell)"}]}