{"article": [{"url": "https://finance.yahoo.com/news/new-york-city-delays-school-opening-154306665.html", "published": 1598957480.0, "headline": "New York City delays K-12 opening after pressure from country's largest teachers' union", "body": "The largest school district in the country is delaying the restart of in-person learning amid mounting pressure from the country’s largest teachers union.New York City Mayor Bill de Blasio (D) announced on Tuesday that in-person schooling will be delayed for 1.1 million children across the city by 11 days to September 21. Parents will have the option for online or in-person once school begins.\"We are dealing with all unknowns, but the good unknown is when there will be a vaccine,” de Blasio said in a press conference on Tuesday. “Once we do we can start going back to normal.”BREAKING: NYC delays reopening of schools to Sept 21, in order to allow more time to make schools as safe as possible.Teacher prep days: Sept. 10, 11, 14, 15Remote instruction begins: Sept 16School buildings open for blending learning: Sept 21— Mark D. Levine (@MarkLevineNYC) September 1, 2020The decision comes on the back of concerns raised by parents and the United Federation of Teachers (UFT), the country’s largest teachers union, over whether proper measures were put in place to ensure health and safety.There was also talk of a possible strike if the UFT could not reach a deal with the city over reopening safely. A strike would have been momentous as that hasn’t happened in the city since 1975.Read more: Here's how parents can cut back-to-school costs for remote learning\"There's no longer a disagreement on what schools need to have,” UFT President Michael Mulgrew said during the press conference, referring to the discussions that took place last week between teachers, administrators, and officials.NYC stood out in its decision to reopen since Los Angeles and Chicago, the second- and third-largest school districts in the country, respectively, opted for remote learning. (As of Monday, there were 1,668 new cases of COVID-19 in Chicago. Los Angeles reported 1,030 new cases of COVID-19 on Sunday. New York reported 754 new cases on Tuesday.)Story continuesCases are particularly surging in Connecticut, South Dakota, Iowa, and Alabama. (Graphic: David Foster/Yahoo Finance)‘One of the hardest jobs in America right now’The situation underscores how tricky the reopening process is, given the number of stakeholders involved.Aside from the teachers who are concerned about their health and well-being, parents are also reluctant to restart in-person learning: A recent report by YouGov and SafetyCulture of 1,164 American parents found that only 43% of parents sending their children back to school are comfortable with their decision.Read more: The ins and outs of learning pod etiquette during a pandemic“One of the hardest jobs in America right now is being a school principal,” NYC school chancellor Richard Carranza noted.Nancy Rastetter, a teacher at Yung Wing School P.S. 124, packs up belongings of students from the 2019/2020 school year on August 25, 2020 in New York City. (PHOTO: Michael Loccisano/Getty Images)Mayor de Blasio stated that testing and a 30-day health plan will be part of the schools’ updated reopening plan. According to NYC School Chancellor Richard Carranza, each school building must have 30 days worth of PPE each day. These supplies will be purchased centrally with no additional cost to the school.Testing will also be done randomly in school buildings, de Blasio said, and he urged parents to test their children for coronavirus before they return to the classroom. The mayor also said that there will be a nurse in every school building in the city.—Reggie Wade is a reporter for Yahoo Finance. Follow him on Twitter at @ReggieWade.Aarthi Swaminathan is a reporter for Yahoo Finance. Follow her on Twitter @aarthiswami.Read more:‘I was misled’: Public school teacher tells Congress about student debt nightmareU.S. teachers increasingly struggle to find affordable housing: StudyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}