{"article": [{"url": "https://finance.yahoo.com/news/golf-business-boomed-during-the-pandemic-morning-brief-095626068.html", "published": 1598504660.0, "headline": "The golf business is booming during the pandemic: Morning Brief", "body": "Thursday, August 27, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeRounds played are surging and the golf business is following suit.During the COVID-19 pandemic, maintaining social distance from others has become the most important, and simplest, way to slow the spread of the virus.And few recreational activities offer a built-in social distancing protocol as easily as the sport of golf. And as a result, the entire golf industry has been booming during the summer of 2020.On Wednesday, Dick’s Sporting Goods (DKS) — which owns Golf Galaxy and also sells golf apparel, equipment, and accessories at Dick’s locations — reported second quarter results that smashed expectations.Dick’s reported same-store sales rose 20.7% during the second quarter, even with 15% of locations closed, on average, during the quarter. Wall Street analysts were looking for same-store sales to rise by less than half this amount, according to data from Bloomberg.Revenue at Dick’s in the second quarter totaled $2.71 billion with earnings per share coming at $3.21 per share. Online sales at Dick’s — which includes curbside pick-up — rose 194% in the second quarter. Shares of Dick’s rose 15.6% during Wednesday’s session.And a standout during the quarter is what the company saw in its golf segment. An area that Dick’s management expects will continue to be a point of strength for the company through the rest of the year.“The golf business has been great both at Dick’s and [Golf] Galaxy,” said Dick’s CEO Ed Stack on the company’s earnings conference call on Wednesday.“There’s a number of young people who have come into the game because they’re not playing football or soccer or some other sport,” Stack added. “So they’re out playing [golf]. Guys are out playing golf because they’re not at their kids’ games. Men, women, and kids have really all jumped into this game and we expect that to continue through the balance of the year, too.”Story continuesStack cited the ongoing PGA TOUR playoffs, the upcoming U.S. Open (set to be held September 17-20), and The Masters (set for November 12-15) as positive catalysts for recreational golfers maintaining interest in the sport after the COVID-related uptick in enthusiasm.“So we think golf is one of those categories that’s going to be...very good,” Stack said.The latest data from the National Golf Foundation showed that in June, national rounds played were up 13.9%, indicating that up to 8 million more rounds were played in June compared to last year. This followed a 6.2% increase in rounds played in May, the first month that many courses were open after mandated shutdowns in the spring.Data from the NGF for July rounds played has not yet been released. But anecdotal reports from this story’s author shows tee time availability at public courses in the Tristate area remains severely constrained.Data from the NPD Group published in late July also pointed to a strong summer for the golf business, with the firm’s data showing that golf equipment sales rose 51% in June after a 22% increase in May.NPD sports industry advisor Matt Powell said, “The golf industry was in a good place before the COVID-19 crisis, largely due to a surge of retirees entering the market, and in May we started to see this health returning. Today’s growth is driven by new players as well as pent-up demand from the closures of physical golf retail stores and golf courses.”Earlier this month, results from golf manufacturers Callaway (ELY) and Acushnet Holdings (GOLF) — which owns Titleist and FootJoy — also indicated a big turnaround in the sport through the summer months.Callaway CEO Chip Brewer said that during the second quarter the company’s business had been “recovering faster than we initially projected.”Sales at Callaway were still down 34% during the second quarter, but the company noted that equipment sales rose 21% in June, the quarter’s final month. Brewer added that the company’s sales recovery in July was better than what had been seen in June, citing both “new participation and pent-up demand.”At Acushnet, sales fell 35% during the second quarter, but Acushnet CEO David Maher told analysts this month that “the game and business of golf have been incredibly resilient over the past [few] months.” The company said in its release that demand for golf balls had been particularly strong, indicating a pickup in rounds played.And on the company’s earnings call, Maher added that, “we continue to exercise caution in our planning, given COVID-related uncertainties, while at the same time, our teams are preparing to capitalize on the high levels of participation and consumer demand we have seen over the past two to three months.”Shares of both Callaway (up 4.1%) and Acushnet (up 0.8%) were higher on Wednesday following results from Dick’s.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Q2 GDP Annualized QoQ, second revision (-32.5% expected, -32.9% in previous print)8:30 a.m. ET: Q2 Personal consumption, second revision (-34.6% expected, -34.6% in previous print)8:30 a.m. ET: Q2 Core PCE QoQ, second revision (-1.1% expected, -1.1% in previous print)8:30 a.m. ET: Initial jobless claims, week ended Aug. 22 (1.000 million expected; 1.106 million during previous week)8:30 a.m. ET: Continuing jobless claims, week ended Aug. 15 (14.4 million expected, 14.844 million during previous week)10:00 a.m. ET: Pending home sales MoM, July (2.0% expected. 16.6% in June)11:00 a.m. ET: Kansas City Fed Manufacturing Activity Index, August (5 expected, 3 in July)EarningsPre-market6:30 a.m. ET: Tiffany (TIF) is expected to report adjusted earnings of 14 cents per share on revenue of $760.8 million6:30 a.m. ET: Coty (COTY) is expected to report an adjusted loss of 12 cents per share on revenue of $1.34 billion6:45 a.m. ET: Burlington Stores (BURL) is expected to report an adjusted loss of $1.08 per share on revenue of $1.12 billion6:55 a.m. ET: Dollar General (DG) is expected to report adjusted earnings of $2.45 per share on revenue of $8.35 billion7:00 a.m. ET: Dollar Tree Stores (DLTR) is expected to report adjusted earnings of 91 cents per share on revenue of $6.2 billionPost-market4:00 p.m. ET: Workday (WDAY) is expected to report adjusted earnings of 66 cents per share on revenue of $1.04 billion4:05 p.m. ET: Okta (OKTA) is expected to report an adjusted loss of 2 cents per share on revenue of $186.26 million4:15 p.m. ET: Gap (GPS) is expected to report an adjusted loss of 41 cents per share on revenue of $2.90 billion4:15 p.m. ET: VMWare (VMW) is expected to report adjusted earnings of $1.45 per share on revenue of $2.8 billion4:00 p.m. ET: Ulta (ULTA) is expected to report adjusted earnings of 13 cents per share on revenue of $1.24 billion4:25 p.m. ET: Dell (DELL) is expected to report adjusted earnings of $1.38 per share on revenue of $22.45 billionTop NewsTikTok CEO Kevin Mayer quits amid Trump ban fallout [Yahoo Finance UK]Jackson Hole Preview: Fed to take on 'deliberately vague' approach to targeting 2% inflation [Yahoo Finance]Facebook says Apple mobile software will cut ad revenue [Reuters]Salesforce cuts 1,000 jobs after banner quarter, stock surge [Bloomberg]YAHOO FINANCE HIGHLIGHTSMutual funds have a FAAMG problemTrump's $300 per week unemployment boost 'too little, too late' to help August spending: GoldmanUltra-wealthy investors are hoarding cash weeks before the presidential election: advisor—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}