{"article": [{"url": "https://finance.yahoo.com/news/china-lgbtq-dating-app-blued-011517470.html", "published": 1592339000.0, "headline": "China LGBTQ Dating App Blued Files for Nasdaq IPO", "body": "(Bloomberg) -- The owner of Blued, China’s biggest LGBTQ dating app, has filed for a U.S. initial public offering.Beijing-based BlueCity Holdings Ltd. listed a $50 million offering size in a Tuesday filing with the U.S. Securities and Exchange Commission. The figure is a placeholder amount that will likely change. The company plans to trade on the Nasdaq Global Market, according to the filing.The listing comes as U.S. exchanges look to apply more stringent rules on Chinese companies, following a string of accounting scandals that have burned some of the biggest names on Wall Street and drawn the attention of President Donald Trump. Nasdaq Inc. has proposed regulations including minimum fundraising thresholds and stricter requirements for auditors.BlueCity was founded in 2011 by former policeman Baoli Ma, also known as Geng Le. The company reported a net loss attributable to ordinary shareholders of 27.9 million yuan ($3.9 million) on 207 million yuan revenue in the three months ended March 31, according to the filing. That loss had decreased from 196 million yuan for the same period last yearUsers in regions outside of China, including India, South Korea, Thailand and Vietnam, represented more than 49% of Blued’s total monthly active users in March 2020. The company said in its filing that it operates in certain countries and regions where anti-LGBTQ public policies are in place or same-sex relationships are illegal. China, Blued’s primary market, hinted late last year that the country’s legislative arm would review same-sex marriage in its civil code.The U.S. is currently celebrating Pride Month, held every June to mark the 1969 Stonewall rebellion in Greenwich Village, New York City. The U.S. Supreme Court ruled in a landmark decision on Monday that workers can’t be fired for being gay or transgender.Besides providing dating services to its 49 million users, BlueCity’s app also offers live streaming and connects men who want to become parents with overseas surrogates. The services are part of its strategy to diversify revenue streams.Story continuesAMTD International Inc., CLSA Ltd., Loop Capital Markets and Tiger Brokers are underwriters on BlueCity’s share sale, the filing shows.(Updates with 2019 results in fourth paragraph. The year of the company’s founding was corrected in an earlier version of this story.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}