{"article": [{"url": "https://finance.yahoo.com/news/kareem-abdul-jabbar-on-how-bruce-lee-beat-the-system-fought-racism-133243360.html", "published": 1591864820.0, "headline": "Kareem Abdul-Jabbar on how Bruce Lee beat the system, fought racism", "body": "In an interview with Yahoo Finance about the nationwide protests in the wake of the killing of George Floyd, six-time NBA champion Kareem Abdul-Jabbar spoke about a sports and film icon who fought racism in his industry: martial arts star Bruce Lee.“Bruce had to deal with racism in the acting profession. He had to deal with the fact that most of the people in the studios thought that most Americans would not accept a Chinese person as a hero,” said Abdul-Jabbar, “And Bruce lost opportunities to act here in America because he was not white.”Chinese-American martial arts exponent Bruce Lee (1940 - 1973), in a karate stance, early 1970s. (Photo by Archive Photos/Getty Images)The new documentary series about Bruce Lee on ESPN, “Be Water,” which premiered on June 7, delves into the racism Lee experienced trying to get acting roles in Hollywood.Lee shot to stardom in the U.S. as the crime fighting sidekick known as Kato in the popular ABC TV series “The Green Hornet” in the 1960’s. He later collaborated with Hong Kong producer Raymond Chow to star in action films, including “The Big Boss” and “Fist of Fury.”Abdul-Jabbar, who developed a friendship with Lee, spoke about the challenges he faced. “It was me talking with him and interacting with him as he tried to figure out how to go about showing that all people should be able to have their heroes up on the screen, and he provided the example for it,” said Abdul-Jabbar.Kareem Abdul-Jabbar arrives at the NBA Awards on Monday, June 24, 2019, at the Barker Hangar in Santa Monica, Calif. (Photo by Richard Shotwell/Invision/AP)“He went to Hong Kong and partnered with Raymond Chow, and made incredible movies that were blockbusters. So he beat the system and then came back and made ‘Enter the Dragon,’ and again, wowed everybody,” said Abdul-Jabbar.Warner Bros. became the first major Hollywood movie studio to produce a Chinese martial arts film starring Lee, who died at the age of 32 before the movie premiered. While the movie cost the studio $500,000 to make, it became a box-office hit earning more than $200 million.More from Sibile:Kareem Abdul-Jabbar on George Floyd protests: Black Americans have been playing catch-up economically since the Civil WarKareem Abdul-Jabbar: ‘The NFL got on the right side of history’Story continuesHistoric jobs report signals fragile recovery. ‘I didn’t hire a single person back,’ says NYC restaurant owner3 ways civil unrest following George Floyd nationwide protest hurts the stock marketThese airlines are cutting workforce despite $25 billion bailout promiseFind live stock market quotes and the latest business and finance news"}]}