{"article": [{"url": "https://finance.yahoo.com/news/tiktok-touts-u-ties-pompeo-204528941.html", "published": 1594205300.0, "headline": "Trump Says He’s Considering a Ban on TikTok in the U.S.", "body": "(Bloomberg) -- President Donald Trump said his administration is considering banning the short video app TikTok in the U.S. as one possible way to retaliate against China over its handling of the coronavirus.Trump’s comments on Tuesday came one day after Secretary of State Michael Pompeo said officials were looking at barring the app, whose parent company is China’s ByteDance Ltd. Asked to elaborate Wednesday, Pompeo declined to repeat the threat of a ban but said instead that the examination of TikTok was part of a broader effort to protect American citizens’ private data.“It’s something we’re looking at, yes,” Trump said when asked in an interview with Gray Television’s Greta Van Susteren about Pompeo’s earlier remarks. “It’s a big business. Look, what happened with China with this virus, what they’ve done to this country and to the entire world is disgraceful.”Trump did not offer any specifics about a potential decision. He said that banning TikTok is “one of many” ways he is looking to hit back at the Beijing government over the coronavirus, which has infected nearly 3 million people in the U.S. and killed more than 130,000.In a separate but related development, the short-video app is the subject of an inquiry by the U.S. Federal Trade Commission and Justice Department over its data practices, according to a children’s privacy advocate who says he was interviewed by the agencies. Several privacy groups alleged in May that the app, which is popular with teens, was collecting information about children under 13 without parental permission, in violation of both U.S. privacy law and an earlier FTC settlement.The president has seen his poll numbers plummet as his own response to the pandemic has come under widespread criticism, including for his refusal to unequivocally urge Americans to wear masks.TikTok played up its U.S. ties and said it doesn’t feed user data to China, pushing back against comments by Pompeo, who said the government was weighing a ban in part over concerns about its ownership.Story continues“TikTok is led by an American CEO, with hundreds of employees and key leaders across safety, security, product, and public policy here in the U.S.,” a company spokesperson said. “We have never provided user data to the Chinese government, nor would we do so if asked.”TikTok hired former Walt Disney Co. executive Kevin Mayer as chief executive officer last month. He also serves as chief operating officer of ByteDance.Calling attention to India’s recent move to ban almost 60 Chinese apps, including TikTok, Fox News host Laura Ingraham asked Pompeo whether the Trump administration would also consider banning the app in the U.S. “We’re certainly looking at it,” Pompeo responded.He then recommended Americans not download the app unless they want to see their private information fall “in the hands of the Chinese Communist Party.”Asked at a briefing on Wednesday for more detail about what a ban might look like, Pompeo said U.S. efforts to protect American consumers’ data “doesn’t relate to any one particular business or company but rather to American national security.””What you’ll see the administration do is take actions that preserve and protect that information and deny the Chinese Communist Party access to the private information that belongs to Americans,” Pompeo said.Pompeo joins other U.S. government officials, including Senators Marco Rubio and Chuck Schumer, who have called for investigations of TikTok over possible threats to national security. The U.S. government has also launched a national security review of ByteDance’s acquisition of Musical.ly, a startup that later merged with TikTok.Young people organizing through Tiktok were cited as one reason many people signed up to attend Trump’s first post-shutdown campaign rally last month in Tulsa, Oklahoma, but then didn’t show up. The Trump campaign denied the online organizing effort contributed to lower-than-expected attendance.In the U.S., TikTok has been downloaded more than 165 million times, according to SensorTower estimates. TikTok has denied allegations that it poses a threat to U.S. national security.In a public show of support for protecting user data from the Chinese government, TikTok said Monday it would cease operations in Hong Kong over a national security law that compels social media apps to hand over user data to Beijing. TikTok operates a separate version of its app in China called Douyin.The privacy advocate Josh Golin, executive director of the Campaign for a Commercial-Free Childhood, said the Justice Department and the FTC had asked him about allegations that his group and others had filed with the trade commission.Questions About ChildrenSeveral privacy groups alleged in May that the app was collecting information about children under the age of 13 without the permission of their parents, in violation of both U.S. privacy law and an earlier FTC settlement.“We felt both FTC and DOJ were taking our allegations seriously,” Golin said.A TikTok spokesperson said that the company “takes the issue of safety seriously for all our users, and we continue to further strengthen our safeguards and introduce new measures to protect young people on the app.” The spokesperson also cited initiatives to teach kids online safety, allow parents greater control and place some restrictions on users under 13.The Campaign for a Commercial-Free Childhood’s conversations with the agencies were previously reported by Reuters. The Justice Department did not immediately return requests for comment after business hours. The FTC declined to comment.(Updates with new Pompeo comments in second and 12th paragraphs.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}