{"article": [{"url": "https://finance.yahoo.com/news/draftkings-shoring-balance-sheet-selling-003800132.html", "published": 1602272780.0, "headline": "Draftkings: Shoring up the Balance Sheet by Selling Stock Comes With a Price", "body": "With its stock trading at 52-week high, and up 496% year-to-date, DraftKings (DKNG) has cashed out at the top.On Monday, the sports-betting provider announced it is selling 32 million DKNG shares to raise capital. The company expects to raise over $1.6 billion from the sale with 16 million being sold by DraftKings and the rest by existing shareholders. At $52 per share, the company is offering the stock for a price 14% below what its shares cost prior to the offering announcement. The result will be a windfall of an estimated $830 million, which DraftKings will use for general corporate purposes.In reaction, DKNG plummeted 22% this week and it looks like the stock received more lashes than it deserved — at least, according to 5-star Canaccord analyst Michael Graham.Graham sticks to his Buy rating on DKNG shares, while his $65 price target stays put, too. Investors could be taking home a 33% gain, should the target be met over the following months. (To watch Graham’s track record, click here)In tandem with this week’s stock offering, DKNG management also provided a Q3 business update. The company anticipates Q3 revenue will come in between $131 to 133 million, roughly in-line with Graham's $133 million estimate.MUPs (monthly unique players) increased by 725,000 quarter-over-quarter to 1.02 million, representing a 64% year-over-year uptick. The figure is well ahead of Graham’s estimate for 424,000 net adds, who puts the increase down to “an active sports calendar and increased marketing spend.”Graham points to “ongoing emphasis on marketing investments as clear positives.” DraftKings spent between $200-210 million on sales & marketing during the quarter. With the OSB and iGaming markets “developing into a much bigger opportunity, with competitive intensity increasing in the short term,” Graham expects DraftKings to “respond to these dynamics with more conviction around marketing spend.”Summing up, the analyst said, “Longer term, we see DraftKings persisting as a leading player owing to: (1) the company's focus on technology and platform development that should translate into a superior product and player loyalty; (2) an aggressive customer acquisition strategy within prudent ROA guide rails; (3) common ground with investors on the long-term wisdom of this strategy; and (4) a singular focus on this opportunity without having to compete for capital with a legacy business.”Story continuesAmong Graham’s colleagues, DraftKings’ Moderate Buy consensus rating is based on 12 Buys and 5 Holds. With an average price target of $55.31, the analysts forecast a 13% upside from current levels. (See DraftKings stock analysis on TipRanks)To find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.Disclaimer: The opinions expressed in this article are solely those of the featured analyst. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment."}]}