{"article": [{"url": "https://finance.yahoo.com/news/what-you-need-to-know-about-ant-financial-potentially-the-largest-ipo-in-history-090833413.html", "published": 1598415380.0, "headline": "What you need to know about unicorn Ant Financial, potentially the largest IPO in history", "body": "This “ant” is really an elephant.Ant Financial, which rebranded itself to Ant Group in June in an apparent effort to stress tech over finance and ward off Chinese finance regulators, filed papers on Tuesday to go public in a dual listing in Shanghai and Hong Kong.The offering could eclipse the $29 billion raised by Saudi Aramco’s initial public offering, which listed last December on that country’s local market. If Ant’s target numbers hold, it would become the new largest IPO in history.That’s fitting of the world’s most valuable private tech unicorn, last valued at $150 billion in 2018 after a record $14 billon funding round. Now it’s targeting a public valuation of $225 billion.So, what exactly does Ant do, and how did it become so valuable?HANGZHOU, CHINA - JULY 21, 2020 - Ant Financial logo photographed at the hangzhou headquarters of Ant Group, the parent company of Alipay. Hangzhou, Zhejiang Province, China, July 21, 2020. - PHOTOGRAPH BY Costfoto / Barcroft Studios / Future Publishing (Photo credit should read Costfoto/Barcroft Media via Getty Images)Before Alibaba’s $25 billion IPO in 2014 (the world’s largest until Saudi Aramco), Alibaba CEO Jack Ma spun out its payments division under the name Zhejiang Ant Small & Micro Financial Services Group, later just Ant Financial Services Group. The obvious aim was to eventually bring Ant public on its own. Four years later, Alibaba took a 33% stake in Ant. Ant Group’s CEO is Alibaba alum Simon Hu, but Jack Ma is Ant’s largest shareholder. (In its IPO filing, Ant Group says its “origin and continued affiliation with Alibaba is a source of strength as well as purpose.”)Ant’s core product is Alipay, the most popular digital payments app in China. It boasts a more than 50% share of China’s massive mobile payments market, the largest in the world. Experts don’t see the mobile payment revolution slowing any time soon, and Alipay is the global king in mobile payments. It also sells tech services to other Chinese financial and e-commerce businesses.Alipay launched in 2004 and hit 1.2 billion users last year. Almost all of its growth has come in Asia, though Alipay has signed a slew of U.S. partnerships with chains like Walgreens (WBA) and Neiman Marcus to let Alipay customers from China pay with Alipay when shopping in America. Last year, Alipay also opened up its app to American tourists in China — that was before the COVID-19 pandemic put a prolonged halt to global tourism.Story continuesAlipay users conduct more than 100 million mobile transactions on Alipay every day. The app’s biggest competitor in China is WeChat Pay, from Alibaba rival Tencent (TCEHY).And then there’s Yu’ebao, China’s largest money-market fund, with $170 billion in assets. Ant Group owns that, too. Ant sees itself as far more than a payments firm: its stated mission is “to make it easy to do business anywhere.”Ant’s public offering will stand apart from the new unicorn IPO parade about to happen in America: Airbnb, DoorDash, Snowflake, and Palantir (via directing listing) are all aiming to go public by the end of this year — but none are profitable yet.Ant Group, in contrast, is wildly profitable. In its IPO filing, it reveals $3.2 billion of profit in the first half of 2020 ($10.5 billion in revenue), reflecting year-over-year growth of 1,000%. And that eye-popping profit came during a global pandemic.—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers tech. Follow him on Twitter at @readDanwrite.Read more:Ant Financial’s core product Alipay hits the 1 billion users markThe world’s most valuable tech unicorn is a Chinese payment companyAirbnb has been brutalized by the pandemic, but will IPO anyway in 'forgiving' marketUber Eats is bigger business than Uber rides right now, but far from profitableEtsy CEO on huge Q2: Etsy is 'becoming much more mainstream'Apple has less to fear from antitrust regulators than Facebook, Google, and AmazonFacebook ad boycott is ‘more noise than fundamental risk’Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’"}]}