{"article": [{"url": "https://finance.yahoo.com/news/apple-gives-tim-cook-million-003324177.html", "published": 1601408480.0, "headline": "Apple Gives Tim Cook Up to a Million Shares That Vest Through 2025", "body": "(Bloomberg) -- Apple Inc. said it is giving Chief Executive Officer Tim Cook new equity awards that could provide him with as many as 1 million shares by 2025.The compensation, currently worth $76 million to $114 million depending on Apple’s share performance, gives Cook a new reason to keep running the world’s largest technology company.The equity comes in two packages, according to a regulatory filing on Tuesday. The first comprises 333,987 restricted stock units that vest in thirds on April 1 in 2023, 2024 and 2025. The other has 333,987 units that will vest Oct. 1, 2023 and is based on Apple’s relative share performance over three years. Cook may get none of this award or 200%, depending on stock returns. If all goes well, Cook would get about 1 million shares in total.“Tim has brought unparalleled innovation and focus to his role as CEO and demonstrated what it means to lead with values and integrity,” Apple’s board said in a statement. “For the first time in nearly a decade, we are awarding Tim a new stock grant that will vest over time in recognition of his outstanding leadership and with great optimism for Apple’s future as he carries these efforts forward.”Apple shares have soared in recent years as Cook helped the company churn out new iPhones, Watches, AirPods and digital services, while fending off the impact of a U.S.-China trade war and a global pandemic. The executive became a billionaire earlier this year, but he has been giving away some of that wealth.Read more: Tim Cook Hits Billionaire Status With Apple Nearing $2 TrillionThe new packages mark the first equity awards issued to Cook since he was named CEO in 2011. Cook, 59, has given no indication he plans to step down, but succession planning has been a major point of discussion in recent Apple board and executive team meetings, Bloomberg has reported.A few weeks ago, Cook was asked how long he foresees running the Cupertino, California-technology giant. “We’ll see,” he said. “At some point, of course, we all do something different.”Story continuesRead more: Apple’s Rising Class of Leaders Will Shape a Post-Tim Cook EraApple Chief Operating Officer Jeff Williams, Chief Financial Officer Luca Maestri and General Counsel Kate Adams were also granted new equity awards on the same time schedule and terms as Cook. Those other executives got smaller packages though.For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}