{"article": [{"url": "https://finance.yahoo.com/news/stocks-got-crushed-on-thursday-morning-brief-095819784.html", "published": 1599195980.0, "headline": "Stocks got crushed on Thursday: Morning Brief", "body": "Friday, September 4, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeEverything that worked suddenly didn’t.After a record close for the Nasdaq and the S&P 500 on Wednesday as the Dow closed at its highest level since late-February, stocks got crushed on Thursday.When the dust settled, the S&P 500 had dropped 3.5% while the Dow fell 2.8% and the Nasdaq just less than 5%.This was the biggest single-day drop for the S&P 500 and the Nasdaq since June 11.And the simplest explanation of what happened Thursday is that all the trades that have worked stopped working and the trades that haven’t worked did.Apple (AAPL), for instance, fell 8% on Thursday while Tesla (TSLA) dropped 9% and is now down some 19% from its record high hit earlier this week. Chip names that have also been market leaders like Nvidia (NVDA) and AMD (AMD) were also under pressure on Thursday, falling 9.2% and 8.5%, respectively.Zoom (ZM) shares also dropped 10% bringing their two-day losses to 20%. Recall that on Tuesday Zoom shares rose 40% following a stellar earnings report. And Zoom is only one example of a hot stay-at-home or hot software trade that got reversed on Thursday. Throw a dart at a SaaS name or any stock levered to the “at home” economy and you found a big loser on Thursday.Meanwhile, financials held up better than the broader marker, with the XLF (XLF) ETF that tracks the S&P Financial sector falling 1.5%, far less than the broader market.The KBW Bank Index fared even better than the XLF, falling 0.8% on Thursday while the KBW Regional Banking index actually rose 0.3%, one of the few green areas in the market.And while all 11 sectors in the S&P 500 were lower on Thursday, Energy (XLE), Utilities (XLU), and Real Estate (XLRE), along with the financials, fell less than 2%. Each of these outperforming sectors were down more than 10% from their 52-week highs ahead of Thursday’s session.Story continuesOn Wednesday, in contrast, six of the seven other sectors in the S&P hit record highs. Only Industrials (XLI) neither made a record high on Wednesday nor began Thursday’s session off more than 10% from a 52-week high.So again the theme across sectors holds: What hasn’t been working did, what has been working didn’t.And of course, days that lack a clear, simple, obvious market catalyst beyond “stocks went down because they’ve gone up a lot” are frustrating to investors.In an email sent out on Thursday afternoon, Dave Lutz at JonesTrading outlined some of the myriad factors cited by investors across Wall Street as the cause of Thursday’s selloff. These theories ranged from gamma hedging by options dealers to a strong dollar to commentary from strategists at Citi advising clients to buy value over growth among other factors that may have been triggers for the decline.None of these ideas were seen as definitive.And with a crucial jobs report due out in just a few hours investors will be offered even more grist for the mill of stories about the what and the why of the market’s eventful week so far.So many investors and commentators are also still operating under the idea that the stock market has been disconnected from the real economy — an idea the Morning Brief has questioned. But it is possible that we could be entering a new phase of this market cycle in which investors recognize the still-depressed state of U.S. economic activity. Or it might be the case that we are seeing a period similar to the rotation trade that shook markets in early August.But whether Thursday’s decline marks a regime change in the market or is a one-day event, it certainly serves as a reminder that in this environment, every market move is just a little bit bigger than you might expect.No matter whether that move is relentless rally to record highs or an out-of-nowhere market selloff.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Change in non-farm payrolls, August (1.35 million expected, 1.763 million in July)8:30 a.m. ET: Unemployment rate, August (9.8% expected, 10.2% in July)8:30 a.m. ET: Average hourly earnings, month over month (0.0% expected, +0.2% in July)8:30 a.m. ET: Average hourly earnings, year over year (4.5% expected, 4.8% in July)8:30 a.m. ET: Labor force participation rate (61.8% expected, 61.4% in July)Top NewsEuropean stocks fall as Wall Street tech selloff set to rumble on [Yahoo Finance UK]Fed policymakers signal comfort with higher inflation [Reuters]Goldman’s 1MDB charges dropped by Malaysia after settlement [Bloomberg]U.S. Justice Department's Google lawsuit expected in weeks ahead [Reuters]YAHOO FINANCE HIGHLIGHTSNetflix was 'one of my great mistakes,' says billionaire investor Mario GabelliAirline stocks keep rising despite 'highly depressed' ticket sales amid pandemicApple fires shot at Google in new privacy ad—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}