{"article": [{"url": "https://finance.yahoo.com/news/if-target-whole-foods-join-15-percent-pledge-it-could-lead-to-15-billion-investment-in-black-communities-campaign-founder-104239259.html", "published": 1592545820.0, "headline": "If Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founder", "body": "After George Floyd’s death on May 25, Aurora James found herself flooded with questions on how people could help in the fight for racial justice and equality.As companies issued statements condemning police brutality and announced splashy one-time donations, James, a Black designer and entrepreneur crafted a campaign that would focus on implementing long-term actionable change in corporate structures.So on May 29, James, the creative director of Brooklyn-based Brother Vellies, a high-end shoe and clothing brand, launched the #15percentpledge, with a singular goal of convincing major retailers to dedicate 15% of their shelf space to Black-owned businesses. James arrived at the 15% number because Black Americans make up close to 15% of the U.S. population (or around 50 million Americans).“The best way to get money into these Black communities is through Black-owned businesses,” she said in a recent interview with Yahoo Finance.Within two weeks, fashion startup Rent the Runway and beauty retailer Sephora committed to the pledge. The 15 Percent Pledge has a three-pronged approach: taking inventory, ownership and action. According to James, if Target (TGT) and Amazon’s Whole Foods and ShopBop (AMZN) join Sephora in this 15% commitment, it could lead to a $15 billion infusion into the Black community via Black-owned businesses.James said she’s been having fruitful conversations with executives at Target, and she’s added a mix of high fashion and big box retailers to her dream list of sign-ons: Net-a-Porter (CFRUY), Walmart (WMT), Barnes & Noble, Home Depot (HD) and Saks Fifth Avenue.“I think people wanted an actual thing they could really do and get behind. There’s been a huge groundswell. We have almost 100,000 people who signed the petition,” she said. “These are customers at these retailers...who are excited and really wanting and demanding they take the 15 Percent Pledge.”James said she is working on a seal that businesses could use to denote that they are Black-owned, and added that she is also calling on consumers “to look in our closets, own shelves, own refrigerators and check for Black-owned businesses.”Story continuesAfter posting about the campaign on Instagram, she started meeting with various executives at Sephora, who worked over the weekend to determine whether they could meet the 15% goal.In this Friday, Oct. 23, 2009 photo, shoppers visit a Sephora boutique inside a J.C. Penney store in New York. (AP Photo/Mark Lennihan)Sephora is the “perfect [retailer] to kick this off,” James said, underscoring that it’s “not just [about] bringing the brands on, but making sure they're [being supported] in a meaningful way.” James said she plans to work with Sephora over the next few years.Scale is criticalThese commitments are symbolic and may be materially impactful, but the issue creates a major hurdle for entrepreneurs to fulfill orders — even with the promise of a pledge.“That’s something we really addressed early on with Sephora, and Sephora brought to us as well. It costs a lot of money to be in all the doors of Sephora. So for us, we're really going to have to start also connecting with VCs and making sure that they are looking at the brands that these businesses are trying to scale. That’s absolutely critical,” James noted.Only 1% of venture capital dollars go to Black startup founders. And the number of Black VC dealmakers in 2018 fell to 1%, according to The Information.As a Black entrepreneur who bootstrapped Brother Vellies, James has firsthand experience trying to build a brand from scratch.“I created Brother Vellies with $3,500 dollars at the flea market in the Lower East Side. We’ve gone on to sell millions of dollars of shoes. I’m lucky that has happened, but it’s been without VC support. So I think we also need to start asking ourselves why these VCs aren’t looking at Black-owned businesses and calling for that to change,” she said.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Anti-racism movement leads to 'Cops,' 'Gone With the Wind' being pulled from platformsAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and moreTech CEOs decry racial injustice amid George Floyd protests‘A lot of my goals just had to disappear’: College-bound students grapple with the future amid coronavirusJack Dorsey’s $1 billion pledge sparks discussion around UBI ‘I feel lost’: America’s freelancers left without income amid coronavirus financial crisis"}]}