{"article": [{"url": "https://finance.yahoo.com/news/dominos-u-sales-surge-pizza-113610285.html", "published": 1594881860.0, "headline": "Domino's U.S. same-store sales rise 16% on pizza demand during pandemic", "body": "(Reuters) - Domino's Pizza Inc <DPZ.N> on Thursday beat Wall Street estimates for quarterly same-restaurant sales and profit, as diners ordered in more pies since dine-in options were limited due to lockdowns triggered by the COVID-19 pandemic.The pizza chain's shares, that have risen about 41% this year so far, were up about 1.5% before the bell.The health crisis has nearly decimated the food industry as rising number of cases and stay-at-home orders have forced restaurants to shut dine-in options and layoff thousands of employees in an effort to reduce costs.Domino's is one of the few restaurant chains to see a boost in sales as consumers sought the comfort of pizzas and relied on their fast delivery. Second quarter U.S. same-store sales surged 16.1%, beating analysts' estimates of 10.67%.The world's largest pizza company said consumers' ordering behavior during the pandemic led to the sharp rise in numbers.Domino's also introduced a new contactless carside delivery option for carryout orders, which allow diners to choose where they would like their order placed – the passenger side, back seat or the trunk of their car.'Drive-thru' has been a major hit for other fast-food chains as well, such as McDonald's <MCD.N> and Burger King <QSR.TO>.Several casual restaurants in the country are now pivoting to a delivery model to keep their business running amid uncertainties.For Domino's, total revenue rose 13.4% to $920 million in the quarter ended June 14 from a year earlier, above the expectation of $911.5 million, according to IBES data from Refinitiv.Net income rose 28.5% to $118.7 million. On a per share basis, the company earned $2.99, beating the estimate by 75 cents.International same-store sales rose 1.3%, and beat estimates of 0.65%.Separately, the company also said Chief Financial Officer Jeffrey Lawrence would retire after more than 20 years of service.(Reporting by Nivedita Balu in Bengaluru; Editing by Shinjini Ganguli and Rashmi Aich)"}]}