{"article": [{"url": "https://finance.yahoo.com/news/unemployment-is-down-but-job-market-looks-increasingly-bleak-165708559.html", "published": 1601640320.0, "headline": "Unemployment is down, but job market looks increasingly bleak", "body": "Around 661,000 jobs were added back to the U.S. economy in September and the unemployment rate fell again to 7.9% from 8.4%. The unemployment rate beat expectations, but the economic consensus left little to celebrate.As James Knightley, ING chief international economist wrote in a note early Friday, it's \"a long, long way from full employment.\"Pantheon chief economist Ian Shepherdson’s one-line summary: “Momentum fading; October will be much weaker.”Permanent job losses increasingIn the last jobs report before the presidential election, the data showed many people had stopped looking for jobs – and were therefore not officially counted as being in the labor force – and that permanent job losses ballooned by 345,000 to 3.8 million. Around two-thirds of these permanent losses — which are defined by layoffs lasting 27 weeks or more — have come since February because of pandemic-related shutdowns.(Yahoo Finance)“The unemployment rate fell further to 7.9% from 8.4%, but much of this was due to a fall in the participation rate,” wrote Knightley, who called it “another bad sign as it typically indicates people are being discouraged from looking for work.”Higher unemployment for Blacks and HispanicsThe unemployment rate improved overall, but it was markedly worse for certain demographics: the rate was 12.1% for Black workers, and 10.3% for Hispanic workers, compared with 7.0% for white workers.Labor participationThe labor participation rate now sits at 61.4% – it was at 63.4% in February. Unlike August, where the unemployment rate fell because jobs filled were increased (the numerator), the rate fell in September because the labor force decreased (the denominator).Because the pandemic shut or slowed down numerous industries like hospitality and leisure, Knightley said, many workers are still waiting for their old job rather than searching for new ones. While the old jobs aren’t available, Knightley said there “isn’t much out there” in terms of the new.Story continues\"This is the highest unemployment and worst economy for any president facing reelection in history and it will be a miracle if the incumbent can pull off a win in these unsettled and uncertain economic times,\" MUFG's Chris Rupkey wrote in a note.Employees walk past the entrance to Disneyland Park on Wednesday, Sept. 30, 2020 in Anaheim, CA. After suffering losses for months due to Gov. Newsom's mandatory coronavirus shut-down, Disney says it will lay off 28,000 employees across its parks, experiences and consumer products segment. (Allen J. Schaben / Los Angeles Times via Getty Images)Shepherdson lauded the fact that half the jobs lost to Covid-19 are back, but couched it in the grim reality of a halting recovery: \"The rate of employment has clearly slowed, as the resurgence of the virus has constrained the pace of reopening, and the early signs for October are not encouraging.\"Women also fared exceptionally poorly in this month’s job report, losing 143,000 jobs, but also dropping out of the workforce at the highest rate since the pandemic began.WagesBoth Shepherdson and Knightley pointed to other worries in hourly earnings. Though the year-over-year increase in wages was 4.7%, which sounds great, that's because many low-paying jobs have vanished, not because they suddenly pay more.“There is very little evidence of actual wage growth outside of sectors such as grocery and we expect this to remain the case given the slack in the jobs market,” Knightley wrote.As Rupkey put it, the recovery is starting to slow, casting \"a pall over the economic outlook where millions of Americans are without hope of getting their former positions back any time soon.”Rupkey and others see further stimulus as essential.“The virus is in the driver's seat in controlling the speed of the recovery and right now the economy is in the slow lane unless Congress and the White House can settle their differences and provide additional stimulus to support those jobless Americans who have lost their paychecks and livelihoods and hope,” Rupkey wrote.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Robinhood investors were a market-stabilization force during the pandemic crashWhy savings accounts have fallen — and some more than othersIntergenerational conflict is getting worse, Deutsche Bank warns2 tax safe harbors that new traders need to know aboutNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggests5 rookie mistakes investors make: hedge fund veteran"}]}