{"article": [{"url": "https://finance.yahoo.com/news/rules-once-lifted-reimposed-try-064917983.html", "published": 1594778240.0, "headline": "Confirmed US virus cases rise amid new global restrictions", "body": "MIAMI (AP) — California, Arizona, Texas and Florida together reported about 36,000 new coronavirus cases Wednesday as restrictions aimed at combating the spread of the pandemic took hold in the United States and around the world in an unsettling sign reminiscent of the dark days of April.The soaring counts of confirmed infections and a mounting death toll led the mayor of Los Angeles to declare that the nation's second-largest city is on the verge of resorting to a shutdown of all but essential businesses. More school districts made plans to start the fall semester without on-site instruction, and the 2021 Rose Parade in California was canceled.Other events went ahead undeterred. Thousands of auto-racing fans gathered at Bristol Motor Speedway in Tennessee for a NASCAR event. Officials allowed 30,000 at the track, and the event marked the largest sporting event since the pandemic began four months ago. Disney World moved forward with the rolling opening of its Florida theme parks.California, Arizona, Florida and Texas reported a total of more than 450 new deaths. Alabama reported a pandemic-high one-day total of 40 deaths, and officials said the state will begin requiring face masks.In Texas, which again set a record for confirmed new cases, with nearly 10,800, Republican Gov. Greg Abbott has increasingly emphasized face coverings as the way to avoid another lockdown.Montana Gov. Steve Bullock required masks at indoor public spaces and at larger outdoor gatherings in counties where four or more people are known to have COVID-19. The Democrat's order came as the state reported a record number of new confirmed cases.In Ohio, Gov. Mike DeWine, who has faced criticism from fellow Republicans over business closures, gave a televised address with an emotional appeal to residents to make sacrifices to protect their neighbors. But he stopped short of mandating masks.Among the sternest measures were in New York, where Democratic Gov. Andrew Cuomo added to a list totaling 22 states whose visitors will be required to quarantine for two weeks if they visit the tri-state region. Out-of-state travelers arriving in New York airports from those states face a $2,000 fine and a mandatory quarantine order if they fail to fill out a tracing form.Story continuesThe broad reach of the virus has brought scrutiny to governors' decisions. Oklahoma Gov. Kevin Stitt, a first-term Republican governor who has backed one of the country's most aggressive reopening plans, became the first U.S. governor to announce that he had tested positive for COVID-19. He plans to quarantine at home.Stitt, who has resisted a statewide mandate on masks and rarely wears one himself, attended President Donald Trump’s rally in Tulsa last month, which health experts have said likely contributed to a surge in coronavirus cases there. Stitt said he’s confident he didn’t contract the virus at the gathering.Florida surpassed 300,000 confirmed cases, reporting 10,181 new infections as its daily average death rate keeps rising. Major cities have required masks, but Gov. Ron DeSantis has declined to issue a statewide order, arguing that it's best decided and enforced locally.Still, the Republican governor on Tuesday wore a mask while speaking publicly for the first time — at a roundtable news conference with Miami-Dade County mayors.“We have broken single-day records several times this week, and there’s nothing about it that says we’re turning the corner or seeing light at the end of the tunnel. I don’t see that in the numbers,\" said Dr. Nicholas Namias, chief of trauma and surgical critical care at Jackson Memorial Hospital.He said diminishing bed capacity is creating problems at the Miami medical center.“We’re getting to the point where it’s going to be full. We have gridlock, and we won’t be able to take patients, and they’ll just be stacked in the ERs,” Namias said.In Washington, a divided approach to the pandemic spilled into public view in extraordinary fashion, with trade adviser Peter Navarro panning Dr. Anthony Fauci, the nation’s top infectious disease expert. Fauci called the criticism “nonsense” and “a bit bizarre.” Trump stepped in to referee, saying “we’re all on the same team.”Businesses instituted restrictions, too, with Walmart becoming the largest U.S. retailer to require customers to wear face coverings at all of its Sam’s Club and namesake stores. In Las Vegas, some casinos began limiting smoking to keep customers from removing the masks they are required to wear.Organizers canceled the 2021 Rose Parade in Pasadena, California, because of the pandemic's impact on long-range planning for the New Year’s tradition, according to the Tournament of Roses Association. But Disney World welcomed visitors to Epcot and Hollywood Studios despite the surge of cases in the state.Other countries, meanwhile, imposed lockdowns and implemented new health checks at their borders.All travelers arriving in Greece from a land border with Bulgaria were required to carry negative coronavirus test results issued in the previous 72 hours. The new rules, which follow an increase in tourism-related COVID-19 cases, triggered an immediate drop in arrivals compared with recent days.Gergana Chaprazova, 51, from Plovdiv in southern Bulgaria, planned to visit the Greek seaside town of Kavala with her husband and complained that she was being tested again.“I have to wait for a test, but I (already) have a test from Bulgaria. I don’t understand why I must have a test here,” she told The Associated Press.More than than 13 million coronavirus cases were confirmed worldwide, with over 580,000 deaths, according to a tally by Johns Hopkins University. The actual numbers are thought to be far higher for a number of reasons, including limited testing.Romania, citing the rising number of infections, announced a 30-day extension of a nationwide state of alert. And residents of Australia’s second-largest city, Melbourne, were warned to comply with lockdown regulations or face tougher restrictions.“The time for warnings, the time for cutting people slack, is over,” Victoria state Premier Daniel Andrews said.In Israel, officials warned that if infection numbers don’t dwindle in the coming days,they will have no choice but to lock down the entire country again, as it did in the spring.South Africa is already showing signs of being overwhelmed by the pandemic — an ominous outlook for the rest of the continent of 1.3 billion people.A ban on alcohol sales and a nightly curfew were reimposed this week to reduce the volume of trauma patients to hospitals that are struggling to cope with an influx of COVID-19 patients. One result was more economic pain in a country that already has a high unemployment rate of 30%.___Tucker reported from Washington. Kantouris reported from Promachonas, Greece. AP reporters around the world contributed to this report."}]}