{"article": [{"url": "https://finance.yahoo.com/news/trump-biden-both-likely-to-push-national-debt-to-new-heights-expert-184817320.html", "published": 1598450180.0, "headline": "Trump, Biden both likely to push national debt to new heights: Expert", "body": "The U.S. national debt is nearing $27 trillion and forecasters are looking ahead to a decade of record deficits to come.But neither Donald Trump nor Joe Biden are talking much about it. In fact, according to a leading budget watchdog, both are making promises that are set to make the problem worse in the years ahead.“It's not the top priority right now and in fact it shouldn't be” said Maya MacGuineas, president of the nonpartisan, nonprofit Committee for a Responsible Federal Budget. But it will be unavoidable in the years ahead once the pandemic recedes. MacGuineas says that politicians need to level with the public and tell them \"when we get through this, we as a country have to turn our attention to bringing the debt back down.\"But for now, she notes, “That kind of responsible talk on fiscal policy no longer seems to be good politics.”The total federal debt has ballooned from around $9 trillion in 2008 to $19 trillion in 2016 and is expected to pass $27 trillion later this year. By 2030, according to estimates, it could grow to somewhere between 118% and 130% of GDP. The pandemic has necessitated an explosion in government spending this year but that spending has come on top a government “irresponsibly growing the national debt” for years, according to MacGuineas.Biden’s plan: More spending but also more taxesAt their convention this week, Republicans have taken turns attacking Joe Biden for wanting to raise taxes. The Democratic presidential nominee has indeed promised to increase taxes between $3 trillion and $4 trillion with new levies focused on the richest Americans and corporations.But even that, says MacGuineas, is “not enough,” noting that Biden’s spending plans are significantly higher.Democratic presidential nominee Joe Biden delivered his acceptance speech on the fourth night of the Democratic National Convention. (Win McNamee/Getty Images)Biden has published a series of plans — from a $700 billion ‘Buy American’ plan to a $2 trillion climate proposal and others — that analysts say would cost much more than his tax increases.If Biden were to win in November, how many of his ideas he would be able to get through Congress would be an open question. Over his 47 years in Washington, Biden has at times had a reputation as a deficit hawk, which has led to attacks from some of his more liberal colleagues.Story continuesTrump’s plan: More tax cutsPresident Trump has been a little vague about how he would govern in a second term. His campaign recently published a second term agenda featuring bullet points but little in the way of specifics.One thing he has been clear on is his desire for more tax cuts. “For the most part, [Trump] would widen the deficit significantly with very few offsets\" says MacGuineas.President Trump listens to the first lady’s address on the second night of the Republican National Convention. (Alex Wong/Getty Images)One tax cut in particular Trump has been keen on is a payroll tax cut. He recently signed an executive order to defer payroll taxes for some workers and, at a press briefing, promised “If I am victorious on November 3rd, I plan to forgive these taxes and make permanent cuts to the payroll tax,” adding “I’m going to make them all permanent.” He then immediately attacked Biden for wanting to raise taxes.MacGuineas says cutting payroll taxes is a \"mistargeted\" way to address the current recession and, in addition, it would undercut the main funding source for both Social Security and Medicare. “We can't get rid of the payroll tax unless we were to replace it with something else” she says.Democrats have repeatedly attacked the president’s idea, noting it would exhaust the program by 2023. A permanent payroll tax cut would have to go through Congress where even the president’s allies have been cool to the idea.The national debt was displayed prominently during the 2012 Republican National Convention. Not this year. (Chip Somodevilla/Getty Images)MacGuineas hopes for real discussion on the issue in the coming years, noting “If you continue to push that message that you can have all the things you want and never pay for them, we are going to be on an unsustainable path.”If politicians continue to ignore the debt or argue that it doesn’t matter, MacGuineas warns that the debt will soon begin to do real damage to the economy through things like higher interest rates, a less desirable currency, and “the vulnerability it leaves for all sorts of risks that come along.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Biden's tax plan: Eyes on the 1% and corporations like AmazonTrump’s permanent payroll tax cut would deplete Social Security funds by 2023, analysis finds‘There is no precedent’: Record-breaking U.S. deficits are comingRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}