{"article": [{"url": "https://finance.yahoo.com/news/if-trump-doesnt-move-to-console-the-nation-heres-what-may-happen-to-his-precious-stock-market-104750388.html", "published": 1592200520.0, "headline": "If Trump doesn't move to console the nation, here's what may happen to his precious stock market", "body": "Social unrest must not be ignored by investors given its various implications. And it shouldn’t be ignored by the avid golfer occupying the Oval Office, either.“So does it [social unrest] justify a correction further what we’ve seen recently? Yeah, possibly this correction could go further,” said Matthew Gerken, a geopolitical strategist at independent research outfit BCA Research. Gerken said on Yahoo Finance’s The First Trade the odds are high we could see a 10% correction as the market bakes in the impact of social unrest on the already battered economy.Countless experts think it would be wise for President Trump to dump his tough guy law and order mantra he has spewed consistently throughout this period of heightened social unrest and adopt a role often taken by presidents during trying times for the country — Healer in Chief. Not only would it be the right thing to do for society (and yes politically for you political strategists out there gearing up for the November election), but it would go a long way to healing an economy thrust into recession by the COVID-19 pandemic.President Donald Trump walks past police in Lafayette Park after he visited outside St. John's Church across from the White House Monday, June 1, 2020, in Washington. Part of the church was set on fire during protests on Sunday night. (AP Photo/Patrick Semansky)At the bare minimum for Trump, a warm fuzzier persona right now may protect the precious stock market he so cares so deeply about — especially when the opportunity exists to tweet about a new record high as he did for the Nasdaq last week (before the market’s Thursday meltdown). If not, investment pros like Gerken tells Yahoo Finance the stock market could be in for a long, hot summer dotted with fiery volatility and the death of the buy dip mentality that has returned in recent months.Gerken — studying prior periods of social unrest and the economic ramifications — sees three risk factors for markets as it pertains to this latest spate of social unrest:Weakening consumer confidence: Gerken thinks consumer confidence and economic activity could “worsen” in the face of historic national unrest. In turn, the slight uptick recently in consumer expectations could reverse. This has not played out yet, however. U.S. consumer confidence for early June improved more than six points from May, per data from the University of Michigan.Story continuesTrump’s poll numbers continue to dive: If Trump’s hard line on the protesters continue, Gerken believes the president’s odds of re-election could “fall permanently.” That would unleash a wave of downgrades by analysts on long-term earnings expectations, presumably because a president Joe Biden would mean higher corporate taxes.Investor expectations are shaken: Explains Gerken, “A mistake could cause unrest to reach an unknown critical threshold that strikes fear into investors about U.S. stability. The U.S. debate has moved on from racism to “fascism” as Trump’s opponents criticize him for his authoritarian rhetoric and deployment of military forces to secure parts of Washington, D.C. Structural factors are driving the riots which means they may smolder and additional incidents could cause them to flare up throughout summer and fall. The deployment of troops to quell civil unrest – as in any country at any time – could easily lead to bloody mistakes.”Investors gave Trump a taste of what could be in store if he doesn’t soften up his image out in public. The Dow Jones Industrial Average plunged more than 1,800 points on June 11 as fears of a prolonged period of social unrest, joblessness and COVID-19 torpedoed the red-hot rally off the March 23 lows. Every stock in the Dow was down, notably banks like JPMorgan and industrials in Boeing. The only S&P 500 stock up on Thursday sessions was grocer Kroger, slightly.The small-cap Russell 2000 Index of mostly U.S. centric companies fell 8% on the week, worse than the 5% drop on the S&P 500.Despite the Dow clawing back 477 points on Friday, fear persists on Wall Street entering mid-June. The CBOE Volatility Index — aka the fear gauge known as the VIX — closed the week at a more than one-month high of 36.“There is no question that the stock market is at a CRITICAL JUNCTURE... and how it acts over the next week or two is going to be very important for the market over the rest of the summer (and beyond),” said Miller Tabak chief markets strategist Matt Maley.How it acts may be an extension of how the Commander-in-Chief acts in coming weeks.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Coca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}