{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-october-8-2020-221741601.html", "published": 1602169940.0, "headline": "Stock market news live updates: Stocks rise despite worse than expected jobless claims", "body": "Stocks rose Thursday after the three major indices closed at their highest levels in more than one month a day earlier. Investors digested a new round of jobless claims that were higher than expected, alongside dimming prospects for more stimulus in the near-term.[Click here to read what’s moving markets heading into Friday, Oct. 9] Shares of Regeneron (REGN) jumped after the drugmaker said it had submitted a request to the U.S. Food and Drug Administration for emergency use authorization of its Covid-19 antibody treatment, which had been taken by President Donald Trump after his Covid-19 diagnosis. And IBM (IBM) surged nearly 6% after announcing it was spinning off its managed infrastructure services business into its own public company.Traders had previously been clinging to hopes that some aid out of Washington – if not a multi-trillion dollar, comprehensive virus relief package – might transpire in the near-term.However, House Speaker Nancy Pelosi, in her weekly briefing on Thursday, dialed back expectations for some stimulus measures to be unleashed ahead of the November elections. Pelosi said she would not advance a standalone bill to provide relief to airlines, in absence of other stimulus measures. A day earlier, she had signaled she might be open to passing a smaller, targeted bill, which Trump had previously suggested he would support.House Democrats last week voted to advance a larger package to inject another $2.2 trillion in aid to various parts of the economy.“It’s been the question of the day, as to why we got the tweets we got over the last 24 hours, the market reaction we got into [Tuesday’s] close, and then the rally today,” Ed Mills, Raymond James Washington policy analyst, told Yahoo Finance Wednesday afternoon.“Investors I’ve spoken to at Raymond James have been mixed. Some believe that this makes it much more likely that regardless of the outcome of the election, there’s a deal to be had in the lame duck [session] before the Dec. 11 deadline to funding the government,” he added. “Others said this is a clear signal from the market that they are now expecting a Democratic sweep. That would be the package that would be the largest. However, that might have to wait until February or March to be fully implemented.”Story continuesMeanwhile, Federal Reserve officials continued to voice their concerns that the tenuous economic recovery would be weakened in absence of further near-term fiscal stimulus.In minutes released Wednesday covering the central bank’s September meeting, the central bank said that “many participants noted that their economic outlook assumed additional fiscal support and that if future fiscal support was significantly smaller or arrived significantly later than they expected, the pace of the recovery could be slower than anticipated.”Another sign of tepid economic activity arrived Thursday via the Labor Department’s weekly jobless claims report, which checked in at 840,000. Consensus economists expect to see another 820,000 new claims filed last week, up marginally from the prior week. However, continuing claims — a closely watched metric — fell unexpectedly to below 11 million.—4:03 p.m. ET: Stocks post back-to-back sessions of gains as investors weigh stimulus hopes against worse-than-expected jobless claimsHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +27.40 (+0.80%) to 3,446.85Dow (^DJI): +122.11 (+0.43%) to 28,425.57Nasdaq (^IXIC): +56.38 (+0.50%) to 11,420.98Crude (CL=F): +$1.29 (+3.23%) to $41.24 a barrelGold (GC=F): +$7.00 (+0.37%) to $1,897.80 per ounce10-year Treasury (^TNX): -2 bps to yield 0.7650%—11:12 a.m. ET: Stocks extend gains, led by energy sharesThe three major indices added to gains Thursday afternoon, with the Dow increasing more than 100 points, or 0.4%. The Nasdaq advanced 0.6%, and the S&P 500 increased 0.7%.The energy sector led gains in the blue-chip index, as U.S. crude oil prices rose more than 1.85% to more than $40 per barrel. The real estate and financials sectors also gained.—9:36 a.m. ET: Stocks open higher despite stubbornly high jobless claimsHere were the main moves in markets, as of 9:36 a.m. ET:S&P 500 (^GSPC): +16.02 points (+0.47%) to 3,435.47Dow (^DJI): +95.6 points (+0.34%) to 28,399.06Nasdaq (^IXIC): +67.99 points (+0.59%) to 11,432.06Crude (CL=F): +$1.07 (+2.68%) to $41.02 a barrelGold (GC=F): +$10.90 (+0.58%) to $1,901.70 per ounce10-year Treasury (^TNX): -1.1 bps to yield 0.774%—8:30 a.m. ET: Jobless claims come in higher than expected, but continuing claims fallThe labor market remained stagnant in the latest week, with new jobless claims ticking up to 840,000 — above consensus forecasts of 820,000. However, continuing claims dropped unexpectedly below 11 million, in an encouraging sign that some longer-term jobless were getting back to work.Stocks are holding gains, aiming to build on Wednesday’s strong rally that carried the S&P to its best session in months.—7:39 a.m. ET: Domino’s Pizza 3Q sales top estimates, but profit falls shortDomino’s Pizza (DPZ) reported mixed third-quarter results, with sales topping estimates but profit and margins coming in light compared to consensus expectations. Shares fell more than 4% in early trading.Adjusted earnings were $2.49 per share, versus estimates for $2.78, and the company’s quarterly operating margin of 37.4% contracted over last year by more than one percentage point. Domino’s said in a statement that its bottom-line was pressured by “higher variable performance-based compensation expense as well as Covid-related costs, including additional compensation and enhanced sick pay for frontline workers.”Third-quarter U.S. comparable same-store sales growth was 17.5%, handily topping estimates for 14.6%, according to Bloomberg consensus data. International comparable sales of 6.2% were nearly three times the 2.2% growth expected.—7:22 a.m. ET Thursday: Stocks look to extend Wednesday’s gainsHere were the main moves in markets, as of 7:22 a.m. ET:S&P 500 futures (ES=F): 3,420.75, up 14 points or 0.41%Dow futures (YM=F): 28,307.00, up 128 points or 0.45%Nasdaq futures (NQ=F): 11,535.25, up 65.25 points or 0.57%Crude (CL=F): +$0.66 (+1.65%) to $40.61 a barrelGold (GC=F): +$5.80 (+0.31%) to $1,896.60 per ounce10-year Treasury (^TNX): -1.3 bps to yield 0.772%—6:04 p.m. ET Wednesday: Stock futures open slightly higher after rallyHere were the main moves in equity markets, as of 6:04 p.m. ET:S&P 500 futures (ES=F): 3,408.75, up 2 points or 0.06%Dow futures (YM=F): 28,197.00, up 18 points or 0.06%Nasdaq futures (NQ=F): 11,481.75, up 11.75 points or 0.1%Traders wear masks as they work on the floor of the New York Stock Exchange as the outbreak of the coronavirus disease (COVID-19) continues in the Manhattan borough of New York, U.S., May 27, 2020. REUTERS/Lucas Jackson—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}