{"article": [{"url": "https://finance.yahoo.com/news/social-network-of-9000-black-professionals-valence-will-be-much-more-than-just-a-black-talent-pool-195401794.html", "published": 1594393340.0, "headline": "Social network of 9,000 Black professionals will be much more than 'just a Black talent pool': CEO", "body": "Valence, the social network for Black professionals, is harnessing its existing connections to build deeper bonds for its 9,000 members.The platform, which was incubated by Upfront Ventures in Los Angeles, launched last November with $2.5 million in funding. Last month, Valence announced that it will facilitate relationships with Black entrepreneurs and VC partners at top firms like Sequoia, First Round, Greylock and GGV.Valence, which has the mission to bridge Black talent and economic opportunity and achievement, and new CEO Guy Primus shared his two-pronged approach to building a sustainable business.“What I believe is that we're not going to be part of this executive search universe. We'll provide our access, tools and technology to executive search firms so they can avail themselves of connecting with this community. We’ll charge a per seat license, so we intend to do that and that's kind of how we'll go to market,” he said in his first broadcast interview as chief executive.“The other element of the business is on the talent that's on the platform. We can curate content, we can create content, we can create experiences. We can put people together in groups where they are kind of availing themselves of the knowledge that exists and sharing tacit knowledge amongst themselves,” he added.Transforming the ‘black box’ world of venture capitalWith less than 1% of venture capital going to Black founders, Primus described the world of private financing as a “black box” to most people. And by bringing together a so-called “council of elders,” which includes people like Rodney Adkins, who sits on the boards of UPS (UPS) and PayPal (PYPL), and Peggy Alford, who is a Facebook (FB) board member, Valence can create paid programming and experiences for members.NEW YORK, NY - JUNE 22: Co-Founder and CEO, The Virtual Reality Company Guy Primus, Creative Director, The Virtual Reality Company James Lima participate in a VR Embraces Families: \"Rising A Rukus\" VRC animation series premiere panel discussion during day one of The Art of VR at Sotheby's on June 22, 2017 in New York City. (Photo by Brian Ach/Getty Images for Advanced Imaging Society)“We can bring people like that to the table and they can be our guiding light. We can actually create a curriculum, executive coaching, peer mentoring and curated content in a way that makes people want to pay for that, whether they’re at the director level or the EVP level and aspire to bigger things. That's the way that we'll go to market. That's the way we'll monetize,” he said.Story continuesHarlem Capital managing partner Jarrid Tingle echoed a similar sentiment in an interview with Yahoo Finance last week.“People can't apply to jobs they don't know exist. And if you don't have a public job posting, you’re just going to go to folks you've known over time and given how housing, networks, friendships work, you're just not going to organically get those diverse folks in the ecosystem. That's number one, which does take time, but I do think it's worthwhile,” Tingle said.Primus, who previously served as the CEO of The Virtual Reality Company, COO of Will Smith’s Overbrook Entertainment and head of digital media at Starbucks (SBUX), believes that the user information Valence will be able to collect and aggregate will provide employers a more focused channel to recruit workers.“Ultimately, we do believe that the data play that we're curating and that we're developing, will lend itself to a SaaS platform,” Primus said. “There’s a continuum of opportunities for us to develop revenue and to curate this market and make it so that this is much more than just a Black talent pool.”Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:'People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talentDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperityIf Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and moreTech CEOs decry racial injustice amid George Floyd protests"}]}