{"article": [{"url": "https://finance.yahoo.com/news/intergenerational-conflict-is-getting-worse-deutsche-bank-analysts-warn-200542605.html", "published": 1600355600.0, "headline": "'Intergenerational conflict' is getting worse, Deutsche Bank analysts warn", "body": "Young people and their elders do not always see eye to eye, as evidenced by things like “OK Boomer” and Pimco founder Bill Gross’s new investment outlook letter that bashes his son for having the audacity to have tattoos.The Gross vs. Gross feud is unfortunately just the tip of the iceberg that could pose a large problem for the wider economy, according to new analysis from Deutsche Bank.In a comprehensive report, the bank warned that the divide between \"young people\" and their elders is a potential powder keg.“The widening generational divide should be a key source of alarm for investors, financial markets and society as a whole,” DB research analyst Henry Allen and two others wrote. “Young people perceive themselves as the losers on issues ranging from housing to climate change to student debt.”This anger manifests in election outcomes and is an international phenomenon, with the generations often voting as a block. All of this has significant political and investment implications, especially since the analysts see the situation deteriorating further in the near-term.Students march on Westminster Bridge holding a placard saying \"It's not OK boomer\" during the \"Fridays for Future\" climate change rally on February 14, 2020 in London, England. The youth strike movement to demand action on climate change started in August 2018, led by the Swedish teenager Greta Thunberg. (Photo by John Keeble/Getty Images)There are a lot of grievances. Housing prices continue to remain high and prevent younger people from having the real estate opportunities to accumulate wealth as older generations have done. Education costs and student loan debt have ballooned while wages have not. The climate crisis has not been addressed in a meaningful way either. All of this has been aggravated by Covid-19, Deutsche Bank says, which has hurt younger generations more than the older ones even though the virus has had the opposite effect.Another aggravating factor: People are living longer, which has made the aging populations tilt “the balance further against the young,” analysts wrote.3 ways the problem could play outDeutsche Bank outlined three scenarios that could result from the conflict.First, asset prices could fall, \"narrowing the generational divide without external intervention.\" A decrease in housing prices or the stock market could result as older generations sell their homes to fund their retirement. This dynamic would also mean the labor market would be smaller, pushing up wages for younger workers.Story continuesThis, Deutsche Bank says, would be a “natural resolution,” though potentially one with “serious consequences” for investors since it involves hits to asset prices. The resolution would calm the conflict as younger people could envision how their generation succeeds.“However, this relies on an as-yet unknown force to boost the global economy,” the analysts wrote.(Deutsche Bank)The second, also with similar “serious consequences,” would be having elected leaders with redistributionist policies. This would result in shakeups in asset prices, tax systems, and climate policy.“This scenario becomes more likely towards the end of this decade as Millennial and younger voters start to exceed those in older generations,” Deutsche Bank wrote. The analysts mention that politicians like Sen. Bernie Sanders haven’t won the presidency yet, but they are a growing force.The Deutsche Bank analysts’ third option, which it sees as Goldilocks-esque, isn’t built in crisis or revolution, but rather on compromise.“To avoid these two scenarios and their serious consequences for asset markets, a scenario of gradual resolution may be achieved if policymakers seek to redress the balance over time,” the analysts wrote. “This could include policies such as higher taxes on wealth or unearned income.”In the bank’s view, a society that doesn’t address the legitimate needs and demands of a huge part of its population is headed for serious problems – something that’s been proven time and time again by countries that have gone through political revolution and those that have not by addressing malcontent head-on.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Demand for ‘certified used’ bikes is so strong, some sell above new sticker price2 tax safe harbors that new traders need to know aboutWhy the 2020 rally doesn’t feel like a bubble: hedge fund veteranNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}