{"article": [{"url": "https://finance.yahoo.com/news/americans-expect-things-to-get-worse-between-now-and-the-inauguration-poll-172052245.html", "published": 1602073700.0, "headline": "Americans expect things to get worse between now and the inauguration: Poll", "body": "This summer, Yahoo Finance and the Harris Poll surveyed Americans on the eve of the political conventions about how they expected things to stand in three months. The results were gloomy with respondents expecting conditions to worsen on all 10 issues we asked about.We followed up this past weekend. The responses a second time around – with the chaotic 2020 campaign in its final stretch – were even worse.For the 10 issues discussed, Americans were asked: “How much better or worse do you think each of the following will be three months from now?”David Foster/Yahoo FinanceOn nearly every issue, not only did a plurality of Americans expect conditions to worsen but more answered negatively this time around than they did in the summer.\"What we are seeing is a reflection of the volatility that is happening in the marketplace and with certain policy actions,\" said Amir Kanpurwala, the Harris Poll Managing Director of Brand Strategy, in a Yahoo Finance interview to discuss the polls findings.He added that the stalemate in Washington over more stimulus is making people more concerned \"about the U.S. economy and about things like having a job, issues with the healthcare system, public safety so on and so forth.\"The sour mood is reflected across a range of other public data. A recent Ipsos poll conducted for Thomson Reuters found that 66% of U.S. adults believe that the country is “off on the wrong track.”The survey was conducted before the chaos this week over additional stimulus negotiations that saw President Trump initially saying the country needs stimulus, then announcing \"I have instructed my representatives to stop negotiating,\" before reversing course again and asking for piecemeal measures as the markets bounced up and down.Public safety, coronavirus, and the economyPerhaps pointing to the possibility of a contested election, 49% of respondents to the Harris survey predicted that public safety would get much worse or somewhat worse between now and the eve of the next presidential inauguration. That was up 8 percentage points compared to the August survey.Story continues[Read more from the Yahoo Finance-Harris Poll]The survey was conducted after President Trump’s positive diagnosis for COVID-19 was publicly announced. Nearly half of respondents – 47% – see the virus getting worse in the coming months, up 3 points from August. There was an age gap in the results with younger people more likely to be optimistic than their older counterparts.President Trump pulls off his protective face mask as he poses atop the Truman Balcony of the White House after returning from being hospitalized at Walter Reed Medical Center (REUTERS/Erin Scott)More than half of Americans – 53% – think the U.S. economy will be much or somewhat worse three months from now, up 2 points from August. The pessimism this time around was most pronounced among women (57%) and Americans living the Northeast (60%).The national debt was once again the issue that the biggest majority of Americans thing will get bigger: 63% say they think things will get much or somewhat worse, while only 11% see things improving on that front.Social justice and health careHarris conducted the poll from Oct. 2-5 and interviewed 1,003 American adults. The survey broke down the response by gender, age, and geographic area and the negative perspective was reflected across all groups.The Southern states offered a slightly more positive outlook on the next three months but, like every other region of the country, more Southerners expect things to be worse on all 10 issues than better by January.The numbers for social justice took a downturn. Asked about equality – social, civil, and economic equality – 38% of respondents said things will move be worse in the coming months. That was up 7 percentage points since August.Health care was among the few issues where even a slight improvement was seen. In August, 40% of survey respondents saw things getting worse; this month that number inched down to 39%. In addition, in August, 26% of respondents said they expected the healthcare system to improve; now the number is down to 20%. A plurality of Americans – 41% – now expect “no change” in healthcare in the coming three months.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:The Yahoo Finance-Harris PollHow the markets reacted to 2 past contested electionsHere’s who Trump likes to blame when the stock market goes downThe US has lost jobs since Trump took office, but so have many other countriesRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}