{"article": [{"url": "https://finance.yahoo.com/news/amazon-apple-facebook-google-ceo-hearing-america-first-180815767.html", "published": 1596028580.0, "headline": "Amazon, Apple, Facebook, and Google CEOs push America-first narrative in effort to avoid antitrust scrutiny", "body": "The CEOs of four of the largest tech companies on Earth sat before members of the House Judiciary Committee’s Subcommittee on Antitrust, Commercial, and Administrative Law on Wednesday to answer questions about their business practices and whether they operate as illegal monopolies.And in their opening statements Amazon (AMZN) CEO Jeff Bezos, Apple (AAPL) CEO Tim Cook, Facebook (FB) CEO Mark Zuckerberg, and Google (GOOG, GOOGL) parent company Alphabet CEO Sundar Pichai each played up their contributions to, investments in, and dependence on the United States.Their statements each offered sentiments that bordered on nationalistic with the likely intention of appealing to lawmakers as the most pro-American of the bunch.This combination of 2019-2020 photos shows Amazon CEO Jeff Bezos, Apple CEO Tim Cook, Google CEO Sundar Pichai and Facebook CEO Mark Zuckerberg. On Wednesday, July 29, 2020, the four Big Tech leaders will answer for their companies’ practices before Congress at a hearing by the House Judiciary subcommittee on antitrust. (AP Photo/Pablo Martinez Monsivais, Evan Vucci, Jeff Chiu, Jens Meyer)Facebook’s China fightIn his opening statement, Zuckerberg specifically discussed how Facebook is used by Americans to stay in touch with friends and family and by small and medium businesses to reach their customers.“Although people around the world use our products, Facebook is a proudly American company,” Zuckerberg said. “We believe in values — democracy, competition, inclusion and free expression — that the American economy was built on.”He also pointed to China and its growing influence over the internet, as well as the potential implications the application of antitrust laws could have on the American competitiveness in the global tech industry.“For example, China is building its own version of the internet focused on very different ideas, and they are exporting their vision to other countries,” Zuckerberg said.“As Congress and other stakeholders consider how antitrust laws support competition in the U.S., I believe it’s important to maintain the core values of openness and fairness that have made America’s digital economy a force for empowerment and opportunity here and around the world.”Zuckerberg has repeatedly pushed back against criticism of Facebook and the U.S. tech industry by pointing to China as a threat to the current status quo.Story continuesIt’s worth noting that Facebook has repeatedly made overtures to Chinese officials seeking to launch the social network in the country in the past. Zuckerberg even went as far as learning Mandarin, but the company was ultimately rebuffed.Amazon’s inability to outsourceBezos, like Zuckerberg, stuck to how much Amazon has invested in the U.S. economy via jobs and the impact Amazon’s service has had on small and medium businesses that use the company’s ecommerce platform to reach customers.“When customers shop on Amazon, they are helping to create jobs in their local communities,” Bezos said.“As a result, Amazon directly employs a million people, many of them entry-level and paid by the hour. We don’t just employ highly educated computer scientists and MBAs in Seattle and Silicon Valley. We hire and train hundreds of thousands of people in states across the country, such as West Virginia, Tennessee, Kansas, and Idaho.”In his remarks, Bezos explained that many of those jobs require employees to be located close to customers, meaning they can’t be outsourced to China. He also explained how the U.S. offers a unique opportunity for companies like Amazon to grow.“It’s not a coincidence that Amazon was born in this country,” Bezos said. “More than any other place on Earth, new companies can start, grow, and thrive here in the U.S. Our country embraces resourcefulness and self-reliance, and it embraces builders who start from scratch.”Amazon does, however, do business at a global scale and, despite mentioning an inability to outsource jobs to China, the company offers a number of its services in the country including its power Amazon Web Services platform.Google’s fight as America’s fightAlphabet’s Pichai, for his part, linked the success of Silicon Valley tech companies directly to America’s continued leadership in the technology industry. In his statement, Pichai pointed to the massive investment Alphabet has made in the U.S. and how that has benefited the country at large.According to the CEO, Google makes deep investments in America’s future in technology.“Through these investments, our teams of engineers are helping America solidify its position as the global leader in emerging technologies like artificial intelligence, self-driving cars, and quantum computing,” Pichai saidHe followed that statement by playing on fears that the U.S. isn’t guaranteed to hold on to its position as a global leader in tech, saying, “Just as American leadership in these areas is not inevitable, we know Google’s continued success is not guaranteed.”Pichai also explained how the company employs 75,000 people in 26 states, and that the company was the largest capital investor in the U.S. in 2018 and has been among the top 5 investors in the country for the last three years.Apple’s story is AmericanApple is somewhat of an afterthought in the tech antitrust hearing largely because its issues stem from its own App Store rather than complete dominance of the internet, social media, or ecommerce in general.Still, Cook made sure to mention that Apple’s story is an American one.“Apple is a uniquely American company whose success is only possible in this country,” he said.“Motivated by the mission to put things into the world that enrich people’s lives, and believing deeply that the way we do that is by making the best not the most, Apple has produced many revolutionary products, not least of which is the iPhone.”Cook also mentioned the economic impact the App Store has had on Americans in particular, saying that the store, which has 1.7 million apps, has generated 1.9 million jobs in 50 states.How these companies are eventually held to account for their alleged monopolistic behavior remains to be seen. But the hearing will provide at least an idea as to how lawmakers are leaning.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Analysts look to hints of iPhone 12 delays in Q3 earningsTop back-to-school gear: Tech SupportTwitter hack could have been ‘much, much worse’ say cybersecurity expertsShould you delete TikTok?: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}