{"article": [{"url": "https://finance.yahoo.com/news/wall-street-grows-more-fearful-of-trump-vs-biden-contest-with-illegitimate-outcome-144836458.html", "published": 1600854980.0, "headline": "Ginsburg vacancy making Wall Street nervous that Trump vs. Biden will yield an 'illegitimate' result", "body": "The prospect of a disputed presidential election may yield a tainted result that many U.S. voters will view as “illegitimate” regardless of whether President Donald Trump or former Vice President Joe Biden is the victor, an outcome that carries serious implications for the markets and the economy.An already polarized election cycle marked by months of social unrest and the COVID-19 pandemic has become more combustible as the move to fill the seat of deceased Supreme Court Justice Ruth Bader Ginsburg gathers steam.The coming fight has amplified an atmosphere of open partisan warfare in Washington, and injected more volatility into a whipsawed market weighed by fading prospects of a second economic stimulus package. As a result, investors increasingly view a contested result as a base case rather than an outlier possibility, JPMorgan Chase analysts wrote on Wednesday.Ian Bremmer, Eurasia Group Founder and President of GZERO Media, told Yahoo Finance recently that November could easily feature a replay of the hard-fought 2000 election that saw weeks of uncertainty result in a Supreme Court ruling that favored George W. Bush over Al Gore.This time around, a result that lands before the Supreme Court may take “weeks if not months” to untangle, Bremmer noted, especially with the president outlining the contours of his post-election argument by ripping mail-in ballots as a hotbed of voter fraud.“So all of this with a country incredibly divided is leading us to an election...that is likely to be perceived as illegitimate, irrespective of the outcome, unless it's a landslide,” Bremmer said in an interview last week — something he believes is unlikely even as national polls show Biden in the lead.Trump may get a boost from stabilizing COVID-19 infection numbers, a coming vaccine, and social unrest in many Democratic-led cities, Bremmer noted.It suggests the election is “going to be tight at a time when everyone is going to have a hard time determining whether or not this election has been held properly,” he added.Story continues‘Dangerous’ tail riskRecent survey data suggests voters are concerned about fraud playing a role in deciding the next president.With Wall Street slowly awakening to the possibility of a protracted and inconclusive election, the CBOE Volatility Index — also known as the market’s “fear gauge” — spiked to its highest level in weeks amid the convergence of a the lack of new stimulus, rising COVID-19 infections and the Supreme Court vacancy.“The Supreme Court nomination can become another driver of the election and can energize both voter bases. It can also cause more uncertainty in the event of a contested election,” TD Securities said this week.“There could be longer term issues due to the replacement as well; the filibuster could be repealed and there may be more support for \"packing\" the Supreme Court,” TD wrote, referencing an idea floated by Democrats recently to expand the high court to at least 12 seats.RBC acknowledged that investors are pricing in the risk that the election results won’t be clear on Nov. 4. Harking back to Bush vs. Gore in 2000, the firm’s analysts wrote on Wednesday that the S&P 500 index fell 12% in the wake of the election.Cyril Moulle-Berteaux, head of Morgan Stanley’s global multi-asset team, told Yahoo Finance recently that currently, the market was not priced for a photo finish on Election Day.He cautioned that the circumstances in 2020 differ from those seen in 2000, which were influenced by a Federal Reserve that was on a tightening cycle, and the aftermath of the technology bubble bursting.However, if the election uncertainty “were to last more than a few days...that uncertainty will be likely to have an impact on the market” that could yield a 5% correction from current levels and weigh on the beleaguered U.S. dollar.Yard signs supporting U.S. President Donald Trump and Democratic U.S. presidential nominee and former Vice President Joe Biden are seen during early voting for the 2020 U.S. presidential election at the Fairfax County Government Center in Fairfax, Virginia, U.S., September 18, 2020. REUTERS/Al DragoBut according to Eurasia’s Bremmer, the fallout could be even worse than 2000, especially if an inconclusive result impacts closely-fought races in the House and Senate — which a number of analysts believe is poised to shift to Democratic control. The resulting policy uncertainty can be a drag on an economy already walloped by the COVID-19 crisis.“The reason that's important, right, is because in an environment where you've got a pandemic, where you’ve got a major economic contraction, with a lot of geopolitical instability,” Bremmer said. That includes the possibility of upheaval in emerging markets, and doomsday scenarios involving U.S. antagonists like China and Russia.“The ability for any additional tail risk to hit when we don't have a functioning government, when we don't have agreement on who’s supposed to be in charge, makes it much more dangerous,” he warned.Read more:Congress debates leaning on Fed or PPP for small business aidHow the Supreme Court could reshape Obamacare after RBG's deathNYC business leaders urge 'immediate action' from de Blasio to fix Big Apple's rotFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}