{"article": [{"url": "https://finance.yahoo.com/news/to-fix-the-economy-you-need-to-fix-the-pandemic-former-white-house-economist-202243438.html", "published": 1595431820.0, "headline": "To fix the economy, you need to fix the pandemic: former White House economist", "body": "Coronavirus cases continue to pepper the country, crimping reopening plans and an economic recovery. As extra unemployment benefits from the coronavirus relief bill are set to expire, things look far from back to normal.This far in, one thing is clear: there will be no recovery without crushing the pandemic, which is why some breathed a sigh of relief as the White House endorsed mask-wearing, which experts say slows transmission.Economist Austan Goolsbee, who chaired the Council of Economic Advisors during the Obama administration and is currently a professor at the University of Chicago's Booth School, called this “rule one of virus economics.”“There can be no improvement to the economics unless you get control of the virus,” he told Yahoo Finance. But while President Trump endorsed masks in a tweet, Goolsbee expressed frustration that not enough was being done.“The president doesn’t want money for testing and doesn’t want to expand the public health component. I think that is a terrible mistake — it will mean we need trillions more in economic relief if we don’t do those things,” he said.A sign is seen on a barrier at the closed and empty Lincoln Center in Manhattan during the outbreak of the coronavirus disease (COVID-19) in New York City, New York, U.S., May 21, 2020. REUTERS/Mike SegarThe difference between the U.S.’s response to the coronavirus and Europe’s is stark – while the U.S. reached 1,000 deaths from COVID-19 on Tuesday, Europe has largely reopened following lockdowns.“If we can get on the path that they’ve been on in Europe, in Korea, Japan, Australia, New Zealand, and places where they got control of the spread of the disease, you could be looking at smaller [stimulus] numbers,” said Goolsbee. But as the problem snowballs, the amount of stimulus required is much higher, since the economy “can’t ignite on its own.”Goolsbee said he was concerned that the longer this drags on, the worse it gets. As relief money runs out for businesses, a second wave of unemployment will come — and then second-order effects emerge like states’ budgets getting slammed, forcing them to lay off workers and even raise taxes.“I think we could be talking about a much more extended downturn than what we’ve been having,” Goolsbee said.Story continuesThere's no federal mask mandate. (Graphic: David Foster/Yahoo Finance)Addressing the virus – and not the lockdowns – is how to bring the economy back, he said.“It’s not a secret — I have research and other people have research that documents that the main thing that drove the economy into the ground wasn’t lockdown orders coming from governors or mayors or the president. It was people’s fear of catching the disease,” he said. “And if we get a resurgence of the virus, you are going to see another wave of people stop going out, stop engaging in economic activity, and sadly we’ve kind of seen that starting in the states where it’s flaring up again.”For now, Goolsbee said that in lieu of a virus under control, Congress needs to extend benefits — and fast.“Millions of people are going to be thrown out of their houses and there's going to be a dramatic reduction in income for 20, 30 million Americans,” said Goolsbee, “who are also, by the way, going to be losing their health insurance because they lost their jobs.”--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Coronavirus crisis fuels push to widen social safety netThe 2008 recession was far worse for young people's careers than previously thoughtBlack communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'"}]}