{"article": [{"url": "https://finance.yahoo.com/news/too-much-govt-intervention-leads-to-lower-productivity-rise-of-zombie-companies-morgan-stanley-strategist-134115467.html", "published": 1596617360.0, "headline": "Too much gov't intervention leads to lower productivity, rise of 'zombie companies': Morgan Stanley strategist", "body": "Government interventions to rescue the economy lead to lower productivity and economic growth — meaning the “the pie is getting smaller and smaller,” warns Ruchir Sharma, chief global strategist at Morgan Stanley Investment Management.“If you keep having this interventionist mindset and increased government involvement in the economy and you do not allow the clearing of the dead wood, you will keep on having lower productivity growth, which basically means lower economic growth,” Sharma told Yahoo Finance’s On The Move.He notes economic growth hasn’t crossed 3% on an annualized basis in any of the last five years.Lawmakers in Washington are currently negotiating a second stimulus package as individuals and businesses reel from the economic fallout of the pandemic. The fiscal policy has been coupled with monetary measures from the Federal Reserve and aggressive moves to help the economy.“Most people, including at the Fed, think that as long as you don’t have high inflation, you can keep juicing up the economy with lots of free money, with lots of liquidity,” he added.“During a recession you need stimulus. You need liquidity backstops. But the issue is that you need to withdraw that pretty much once a recovery or a bounce-back begins,” he said.“That was not what was done in 2010, 2011, 2012, when you had subsequent rounds of quantitative easing, even as the economy had recovered,” said Sharma.Rise of ‘zombie companies’Sharma says too much intervention has crowded out start-ups and contributed to the rise of “zombie companies.”“These are companies that don’t even make enough profit to pay their interest for 3 years in a row. So those companies keep rising, and it crowds out the new companies from coming up,” he said.“Twenty percent of all U.S. companies today can be classified as zombie companies. In the 1980s it was 2%, so something is going amiss in the system,” he said.REUTERS/Issei Kato TPX IMAGES OF THE DAYSharma also warns too much intervention ends up driving asset prices higher.Story continues“Now you’ve moved to a situation where the tail wags the dog. Every time the market falls by 1% or 2%, because let’s say some stimulus is not being enacted ... immediately there’s panic,” he added.“By mollycoddling by ensuring that volatility remains so low, we’re doing the opposite, which is in terms of making the beast bigger to the extent that its counter-productive for the code principles of capitalism,” he said.“What you ended up getting was massive asset price inflation, where asset prices are so high, and I think that this is where we’re stuck in this trap,” he said.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}