{"article": [{"url": "https://finance.yahoo.com/news/jj-coronavirus-vaccine-aims-for-70-success-rate-125444337.html", "published": 1591948940.0, "headline": "J&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trials", "body": "Johnson & Johnson (JNJ) is setting a relatively high bar for its experimental coronavirus vaccine, with a top executive telling Yahoo Finance that it is aiming for a success rate in at least 70% of its clinical trials.The pharmaceutical giant is but one of over 100 companies in the race for a COVID-19 cure, but among the handful perceived as having a shot at immediate success. J&J Chief Scientific Officer Dr. Paul Stoffels told “On the Move” on Thursday.“So the statistics in the clinical trials are built around 70%,” said Stoffels, who leads the company’s effort to create an effective vaccine against the coronavirus. Recently, J&J announced plans to accelerate its testing program, and will begin human trials of the vaccine in July instead of September, based largely on promising results in pre-clinical models.Stoffels said pointing out those results helped convince the U.S. and European regulators to approve an earlier date to begin human trials. “We were able to reach agreement that we could start, based on our data, mid-July,” he added.According to a press release, J&J’s next stage of testing will evaluate over 1000 adults in the U.S. and Belgium from ages 18 to 55, as well as those 65 and over.Billion dose gambleJ&J is one of five companies designated by the Trump administration to be most likely to produce a working coronavirus vaccine.Dr. Anthony Fauci, the federal government’s top epidemiologist and director of the National Institute of Allergy and Infectious Diseases, recently said that “by the beginning of 2021 we hope to have a couple of hundred million doses.”Yet Fauci told Yahoo Finance this week that although he is “cautiously optimistic” about the potential of different vaccines to provide immunity to billions of people world wide, “You’ve got to realize there is no guarantee at all that we are going to have a safe and effective vaccine.”Johnson & Johnson began production of its trial COVID-19 vaccine on an “at risk” basis last April. J&J CFO Joe Wolk told Yahoo Finance that the objective was to “ensure that should the clinical development and the trials be successful, we are in a position to kind of flip the switch and ready to go, to create great access across the globe.”Story continuesThe company entered into a $1 billion partnership with the US Department of Health and Human Services Biomedical Advanced Research and Development Authority (BARDA) to develop and manufacture the vaccine. “We have committed to make a billion vaccine dosages next year, and more afterwards as we are scaling up,” Stoffels said.J&J is covering the cost of production according to Stoffels. “But as we go forward, there will be advance purchase agreements with different governments in the world to partially take on or to fully take on cost,” he explained.All of this is happening before the J&J vaccine testing program moves into the critical phase three trials this fall. Those tests will prove if the vaccine can hit J&J’s 70% efficacy goal.Stoffels said that limited tests this summer will set the stage. If all goes well, “we can start the phase three study and proving efficacy in a placebo-controlled way on a large scale,” he added — perhaps as early as September.Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.Risk firm: 'American is most at risk' of coronavirus default among US airlinesSouthwest warns that revenue could drop as much as 95% in MayDelta shores up liquidity as coronavirus pummels demand, warns of smaller airlineJetBlue Chairman: 'Everybody's working on survival' as coronavirus decimates airlinesTed Cruz: 'We are going to see human lives lost' if coronavirus shutdowns last for monthsJ&J eyes 'imminent' coronavirus vaccine production, aims for a billion doses worldwideGary Cohn: Restarting the economy after coronavirus is 'not going to be an overnight big bang'J&J's Chief Scientific Officer predicts vaccinations against coronavirus within 12 monthsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}