{"article": [{"url": "https://finance.yahoo.com/news/mnuchin-says-u-treasury-cannot-170341104.html", "published": 1600949480.0, "headline": "U.S. airlines turn eyes to expected new House coronavirus relief proposal", "body": "By David Shepardson and Tracy RucinskiWASHINGTON/CHICAGO (Reuters) - U.S. airline unions expressed hope on Thursday that Congress could strike a deal in the coming days that would provide $25 billion to prevent tens of thousands of furloughs on Oct. 1 after the U.S. Treasury chief said he could not act unilaterally to save airline jobs.A new Democratic-proposed House bill is expected to provide $2.4 trillion in coronavirus relief that would include funds for airlines and restaurants, a congressional aide said, down from $3.4 trillion approved in May. That figure is still far above the $300 billion Senate Republicans backed earlier this month.While the White House has repeatedly said it would seek executive action to help airlines if Congress failed to pass a deal, Treasury Secretary Steven Mnuchin told Congress on Thursday he cannot tap unused coronavirus lending authority to provide cash grants to airlines.\"Is there anything that you have under existing authorities, either the CARES act authorities, or prior law, that could help the airlines avoid these coming layoffs?\" Republican Senator Tom Cotton asked Mnuchin.\"Unfortunately there is not,\" Mnuchin said. He added the funding from Congress approved in March \"literally saved the entire industry.\"Many congressional aides and some airlines are pessimistic about the prospects of a new bailout.Some lawmakers are pushing for a deal before Oct. 1, when airlines are set to furlough tens of thousands of workers if they do not secure additional payroll support.International President of Flight Attendants-CWA President Sara Nelson said labor's pressure on lawmakers was having an impact.\"We are seeing that this is moving us to a full relief bill,\" Nelson said over Facebook Live.An initial $25 billion in payroll assistance under the CARES Act approved in March required no layoffs by airlines through Sept. 30, but with industry continuing to struggle, airlines are pleading with Congress for more money.Story continuesU.S. Senator Roger Wicker, a Republican, sought to fast-track legislation for a fresh $25.5 billion in airline bailout funds to avoid layoffs for another six months, but it failed to move forward after some senators raised objections.American Airlines said it would furlough some 19,000 workers on Oct. 1 without fresh aid and halt service to 15 smaller airports.United Airlines and Delta Air Lines are delaying the furlough date for their pilots by a month as they try to strike new agreements and await developments in Washington.Treasury has a separate $25 billion loan fund for passenger airlines, but not all airlines are tapping it.(Reporting by David Shepardson and Tracy Rucinski, editing by Timothy Gardner)"}]}