{"article": [{"url": "https://finance.yahoo.com/news/colorado-couple-sees-200000-in-student-debt-discharged-by-judge-131501065.html", "published": 1599035000.0, "headline": "Colorado couple sees $200,000 in student debt discharged by judge", "body": "A new ruling by the U.S. Court of Appeals for the Tenth Circuit found that a Colorado couple’s private student loans could be discharged when a borrower files for personal bankruptcy, further upending a legal concept dominating student debt for years.The ruling rejected student loan giant Navient’s claims that $200,000 worth of private student loans owed by the Colorado-based McDaniel couple was non-dischargeable under bankruptcy law.“This has been a huge part of my life for so many years now,” Paige McDaniel, 40, told Yahoo Finance in an interview. “It affects your whole life. It affects your relationship with your kids, your marriage — everything.”The outcome of the case represents a “loosening of the student loan discharge law,” Jason Iuliano, a bankruptcy expert and assistant professor of law at Villanova University, told Yahoo Finance.McDaniel 10th Opinion by AarthiNavient declined to comment on the specific case but provided the following statement: “We recognize that some student borrowers face long-term financial challenges, and this is why, for several years, Navient has recommended bankruptcy reform that would allow federal and private student loans to be dischargeable in bankruptcy after making a good-faith effort to repay.”The McDaniel case comes months after a separate ruling in favor of another student loan borrower, Kevin Rosenberg, who saw more than $200,000 of student loan debt discharged under Chapter 7 personal bankruptcy (liquidation bankruptcy). The loan servicer appealed the ruling. The Rosenberg case addressed the “undue hardship” standard imposed on borrowers to prove they needed their debts erased.Read more: What is bankruptcy and how does it work?The McDaniel case touches on the question of why student loans are generally exempt from being dischargeable in Chapter 13 personal bankruptcy (reorganization bankruptcy) in the first place.‘We just couldn’t keep up with it’McDaniel took out multiple student loans from Sallie Mae called “Tuition Answer Loan” to pay for a degree she obtained in 2008 while juggling work and parental duties. She estimated that her master’s and bachelor’s degrees left her with $120,000 total in private loans.Story continues“It was astronomical,” she recalled.When it was time to repay those loans, her monthly payments to Navient were more than $1,000. McDaniel said she told the company that she simply couldn’t afford that, but loan officials were “not willing to work with me at all.” She claimed that the company threatened to garnish her wages to recoup the debt.Paige McDaniel. (Courtesy of Paige McDaniel)“We just couldn’t keep up with it,” McDaniel said. “All of our other bills were paid on time. These were the only things we couldn’t keep up with.”In 2009, McDaniel and her husband, Byron Patterson McDaniel, filed for Chapter 13 bankruptcy because “it was either that or we were getting to the point where we couldn’t keep our house.” The following year, the court confirmed an amended repayment plan submitted by the couple.“In early 2015, the McDaniels certified that they had carried out all of their plan’s payments and obligations,” the latest ruling stated. “According to the Trustee’s final report and account, the McDaniels had paid nearly $27,000 in principal toward Navient’s debt claims under the confirmed plan.”The bankruptcy court then granted the McDaniels a discharge of their debts in March 2015. But, according to McDaniel, Navient had tacked on another $44,408.17 to their principal over that period.Navient “added more interest during the bankruptcy, which was ridiculous,” McDaniel said. “So when we got out of the bankruptcy, we ended up owning them more than when we started. We were actually in worse shape than when we filed.”Navient Corporation Indianapolis Location. (Getty, 2017)By the time the McDaniels were out of bankruptcy, their monthly student loan payment had ballooned to more than $2,000 a month — “more than my mortgage,” according to McDaniel. Over the next two years, the latest ruling stated, “the McDaniels paid Navient an additional $37,460 on their Tuition Answer Loans.”In 2017, the couple asked the bankruptcy court to reopen their case and filed a complaint against Navient. But the loan servicer argued that the debt was not dischargeable, citing nuances of bankruptcy code, and moved the court to dismiss the McDaniels’ complaint. The motion was denied, and Navient appealed.“This case raises a question of first impression in this circuit: does an educational loan constitute ‘an obligation to repay funds received as an educational benefit,’” the Tenth Circuit wrote in the August 31, 2020, ruling on the appeal. “We conclude that it does not. Exercising jurisdiction under 28 U.S.C. § 158(d)(2)(A), we affirm the bankruptcy court’s interlocutory order denying Navient’s motion and remand the case for further proceedings.”Austin Smith of Smith Law Group, who represents the couple, told Yahoo Finance that the ruling “is a total victory for the McDaniels. But we have won this issue before and it hasn't changed Navient's conduct.”United States Bankruptcy Court on 19th Street in downtown Denver, Colorado, USA. (Getty)‘From presumptively non-dischargeable to automatically dischargeable’Iuliano, the bankruptcy expert, said that the ruling could affect the dischargeability of private student loans more broadly, particularly those that either exceed the cost of attendance at an accredited school or private student loans from non-accredited Title IV schools.In other words, he added, the ruling potentially “converts a ton of student loan debt… if adopted nationally, tens of billions dollars, from presumptively non-dischargeable to automatically dischargeable.”More than 2.5 million people with student loan debt have filed for bankruptcy over the past decade, Iuliano’s research, which will be published in The Student Loan Bankruptcy Gap, 70 Duke L.J. (forthcoming 2020), has found.In 2019 alone, roughly 221,000 student loan borrowers filed for personal bankruptcy.“I want people who are kids who are going to college to know, you don't want to take out private student loans,” McDaniel said. “There needs to be more protection for the borrowers. ... I don't know how to fix it. I really don’t. But I know it's terribly, terribly broken.”—Aarthi is a reporter for Yahoo Finance. She can be reached at aarthi@yahoofinance.com. Follow her on Twitter @aarthiswami. Read more: New startup aims to help student loan borrowers declare bankruptcy'A major, major initiative’: California wants to create its own Consumer Financial Protection BureauStudent loan servicer appeals landmark $220,000 bankruptcy rulingRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}