{"article": [{"url": "https://finance.yahoo.com/news/bill-ackman-on-wealth-inequality-and-defense-of-capitalism-213958621.html", "published": 1598633240.0, "headline": "Billionaire Ackman defends capitalism, but warns inequality poses a 'black-swan type' risk", "body": "Pershing Square Capital Management CEO Bill Ackman issued a call on Friday for the U.S. to fix soaring wealth inequality and save capitalism by giving every child born in America an investment account.Like other wealthy investors, the billionaire hedge fund manager has called for governments to attack the growing gap between the rich and the poor, which is sparking widespread social unrest and backlash against capitalism.However, unlike several of his billionaire peers, Ackman issued issued a full-throated defense of free markets.“Despite its faults, we are strongly of the view that, while far from perfect, capitalism is by far the best system for maximizing the size of the economic pie,” Ackman wrote in a letter to investors.However, “one of the principal problems with capitalism, particularly as it has functioned over the last several decades, is that wage growth has not kept pace with long term wealth creation” — disproportionately excluding the middle and working classes, he wrote.Like the coronavirus pandemic, the fallout from wealth inequality \"present[s] black-swan-type risks for investors,\" Ackman wrote.As a solution, he proposed helping those “with no investment assets to participate in the success of capitalism. We need a program that makes every American an owner of the compounding growth in value of corporate America,” the investor wrote.“Compounded returns over time are indeed one of the great wonders of the world, and every day we wait to address this issue, the problem looms larger,\"he added.Staving off a ‘turn toward Socialism’Specifically, the 54-year-old activist investor suggested that the government create investment accounts for every baby born in the U.S. that would invest in no-fee stock index funds, and withdrawal from those funds wouldn't be allowed until retirement.\" Without funds to invest for retirement – particularly after the housing crash destroyed many Americans' only other source of long-term wealth creation – one has almost no hope to build wealth for retirement, or to give the next generation a head's start,\" Ackman added.Story continuesAccording to Ackman, assuming a rate of 8% per year, investing $6,750 in an account at birth would yield assets of more than $1 million by age 65. It would cost the government $26 billion per year, based on the average number of children born in the U.S.In addition, the billionaire suggested that companies should be required to put a fixed percentage of a worker’s salary or wages in a tax-free investment account that couldn't be touched until retirement. In that way, it would mimic Australia’s successful superannuation system.He also advocated for financial literacy, which is just as important as access to investing.According to Ackman, the American Dream \"has become a disappointment or worse for far too many.\" He added that if capitalism continues to leave people behind and wage growth lags, Americans will \"seek changes, potentially radical ones, to the current system, or seek an alternative system.\"Ackman wrote that solving the wealth divide is incumbent upon everyone, especially the capitalist system's greatest beneficiaries.\"Like those who rent rather than own their homes and thereby have no love lost for their landlords, Americans that have no ownership in the success of capitalism, and who are suffering economically, are more motivated to turn toward Socialism or other alternatives,\" the investor wrote.Pershing Square Holdings, Ackman's hedge fund firm's publicly-traded vehicle, is up 44.1% year-to-date, far outpacing the broader market.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Ackman looks to ‘marry a unicorn’ with record-breaking SPACAckman sees ‘real recovery’ in back half of 2021, remains upbeat of offices and restaurants"}]}