{"article": [{"url": "https://finance.yahoo.com/news/homebuilder-optimism-hits-record-fueled-140000612.html", "published": 1600247300.0, "headline": "Homebuilder Optimism Hits Record, Fueled by Low Mortgage Rates", "body": "(Bloomberg) -- U.S. homebuilder optimism rose to a record in September, with low mortgage rates driving a housing boom that has boosted the pandemic economy.A gauge of builder sentiment jumped five points from a month earlier to 83, beating estimates and hitting the highest level in 35 years of the survey, according to the National Association of Home Builders/Wells Fargo Market Index. It was 78 last month, which matched the previous record from 1998.The index ended 2019 at a 20-year high but plunged in April after social-distancing measures froze home purchases. Builders have bounced back since then, with the housing market an unexpected bright spot in the pandemic-battered economy.Read more: Mortgage Rates Slide to Record-Low 2.86%Record-low mortgage rates are driving demand for housing, particularly as millennials enter the market and Americans seek space in the suburbs for home offices and remote learning. With some sellers not eager to list properties, a shortage of inventory has propped up prices and fueled optimism about the homebuilding industry.“The suburban shift is keeping builders busy, supported on the demand side by low interest rates,” Robert Dietz, NAHB’s chief economist, said in a statement.An S&P index of homebuilder stocks has more than doubled since March 23 and is near a record high.Read more: Lumber Rally Has New Homes Going for $16,148 MoreBuilders still face challenges. With a new stimulus package stalled in Congress, the housing recovery could be threatened by mounting economic fallout from the coronavirus. And while low rates have fueled a surge in mortgage applications, potential buyers could struggle to find affordable properties.Higher costs are also hitting profit margins for homebuilders. Lumber prices have surged, adding more than $16,000 to the price of a typical new single-family home, according to NAHB.“Many in the industry are worried about rising costs and delays for building material, especially lumber,” said Chuck Fowke, chairman of NAHB.Story continuesFor more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}