{"article": [{"url": "https://finance.yahoo.com/news/why-the-founding-fathers-would-want-us-all-to-have-fast-internet-114817838.html", "published": 1596869780.0, "headline": "Why the Founding Fathers would want us all to have fast Internet", "body": "My high-speed internet...isn’t.Starting a Zoom, Skype, WebEx or Google Meet at my house is like a countdown for a Space-X launch.-All applications off? Check.-Tabs closed? Check.-All other family members off-line? (“No, Dad, I have a call!”) Not so check.And then regardless of how successful that process is, my video calls are invariably marked by blurriness, delays, freezing and interrupted audio. It makes me look and sound bad. And unprofessional, which is a problem because like 42% of Americans, I’m working from home these days.A car drives past a sign advertising high-speed internet service near Starkville, Miss. In classrooms, access to laptops and the internet is nearly universal. But many students struggle to keep up from home because of the cost of internet service and gaps in its availability. (AP Photo/Rogelio V. Solis)I’m hardly the only person suffering from inadequate internet of course. While the Federal Communications Commission likes to say that 21.3 million Americans, (or 6.5% of the population), don’t have broadband internet, a recent study by Broadband Now shows the actual number is more like 42 million. (Intuitively, that FCC number is low. Just ask yourself how many people you know have issues with broadband.)What exactly constitutes high speed internet these days? Good question. Certainly download speed of 1,000 megabits per second (Mbps)—or a gigabyte—is fast. And according to a story by my former colleague, David Pogue, for CBS News: “The average download speed today [in the U.S.] is around 133 Mpbs. And what the FCC defines as broadband for downloading is 23 Mbps. It's not very fast.”Got that right David.I have my own definition of high-speed internet though: Two people, (or heaven forbid three), in one household, doing unimpeded video calls simultaneously without having to close tabs and applications. How many Americans have that? Not as many as the FCC thinks. Am I being whiney? No. This isn’t about birthday calls to grandma (although they’re important too), this is about work, school and other critical communication like telemedicine. That’s important.At my house in Georgetown, Maine, (a town coincidently cited in David Pogue’s piece) my ISP, Consolidated Communications, one of the nation’s larger providers with some 4 million customers, delivers to me through copper line DSL, what it says is 15 Mbps down (to the house) and 3 Mbps up (to the network.) But when I do speed tests (just Google speed test and click the blue button) I get 12 down on a good day, and more often 9, and 1 or less up. I should point out that this is when I connect to my router with an ethernet cable. (Remember those?) So, yes I mostly work tethered.Story continues(A side note here: ‘up,’ didn’t used to be a big deal because generally speaking the largest amounts of data would come ‘down’ to your house—streaming movies for instance. Video calling during COVID-19 has greatly increased the need for ‘up’ functionality, which actually first picked up years earlier when people began watching security video of their homes when they were on vacation.)And speaking of COVID-19, that’s what really brought the digital divide, (which of course has always existed), to my attention. And in fact put me on the other side of it.First I left my apartment in New York with its 20 Mbps to 30 Mbps speed (now slower because of everyone WFH in my building), came to Maine in late March and right off embarked on a mad scramble to coax more capacity out of my connection (pleading calls to Consolidated Communications, asking neighbors for pointers, trying out different equipment.) But the real issue wasn’t me per se, it was our team and trying to connect all of them from their different locations. As we began broadcasting live from team members' homes, we quickly realized broadband was our biggest problem.All that opened my eyes, but it was just the beginning.I noticed that I wasn’t the only one with slow broadband up here, when I went by the town hall and saw some kids huddled on the cold pavement near the front door of the office. What were these young people doing? Their homework. The digital divide was staring me right in the face.I also noticed that bad broadband was a normal topic of conversation, like the weather. There were stories of elected officials having to go to neighbors’ homes to use slightly better WiFi for official business. Or a neighbor having to rent an office in town to use the internet. Or a Consolidated Communications employee telling a neighbor there is nothing he can do and the company is based far away and doesn’t care. Or another neighbor who says “the name ‘Consolidated Communications’ is because they consolidated all the bad stuff into one place.” (A competitor, Redzone Wireless, has a worse reputation in this town.)But wait there’s more. In late May my younger daughter graduated from college and started her first full-time job. From this house. coordinating internet use became a critical feature of daily life, until she gave up and moved to Boston for a while to try her luck with the WiFi down there. (So much for attracting young people to the state with the oldest population in the U.S.)“The thing everyone should understand about the current broadband crisis is that it would’ve been fairly normalized usage in a few years anyway,” says Ernesto Falcon, senior legislative counsel at the Electronic Frontier Foundation. “Coronavirus increased demand by only 30% or 40%; it’s not like double or triple usage.”But that acceleration has further exposed the yawning gap. “It’s a fundamental dividing line of inequality in America,” says Falcon. “You can’t participate in the economy or society at large without sufficient access.I bet you can guess who’s getting left behind.“It predominantly hits communities of color and rural communities the hardest,” Falcon says.According to an Alliance for Excellent Education report released in June, some 31% of Black families don’t have high-speed internet. (It’s even worse for Native American families.) Some 44% of households with an income of less than $25,000 don’t have broadband. And the study shows that in over a dozen states including Texas, Indiana and Missouri over 25% of the population has no or slow internet. According to the International Telecommunication Union, the U.S. ranks 24th (after Greece!) in fixed-broadband subscriptions per capita. Again, that means working, studying or seeing a doctor from home is next to impossible.Richest country in the world we’re talking about here.I understand that you may have free market inclinations and I respect that, as in, ‘If these people want WiFi they should get jobs and work hard to pay for it. Electricity isn’t free in this country either.’ Ah but here’s the difference between electricity—or even water—and broadband. If you can afford some sort of home in America, it often comes with a water hook up and electricity, and if so, it’s the same water (Flint notwithstanding) and electricity that the richest Americans get. With broadband, if you live in a place with underperforming internet, it doesn’t matter what you can afford to pay, there’s nothing you can do. And kids learning from home without fast internet are at a distinct disadvantage versus those living in an area with real broadband.If the Founding Fathers had envisioned the internet, this is not the way they would want it to work.Start treating broadband ‘the same way we treat any infrastructure’As far as my situation in Maine, I asked Rob Koester, senior vice president of consumer product at Consolidated Communications and he acknowledged the difficulties of serving communities like mine. Yes, COVID-19 has changed the consumption patterns significantly, he said. and it’s tough to really improve service because, “the ROI just isn’t there,” he told me. “It can cost $1,000 to $1,500 to bring fiber to a customer’s home and probably double that in rural areas.”And I get that. The economics don’t work. Koester told me to mitigate that, Consolidated has been doing public/private partnerships for towns like mine, such as a project he worked on in Chesterfield, New Hampshire, population 3,500, which now has broadband speeds of up to 1,000 Mbps. “The total cost of the project is $4.3 million, with Consolidated putting up $2.5 million of its own money and the town bonding another $1.8 million,” according to the Brattleboro Reformer.“[The ISPs] are private companies and we recognize that,” says GeDa Jones Herbert, a special counsel focused on education at the NAACP Legal Defense and Educational Fund, which sent a letter calling on 20 internet service providers to address lack of access and affordability among Black students. “It comes back to the concept of corporate social responsibility. We’re not asking these companies to become nonprofits and throw out their business models. We’re not asking them to pour in endless resources and go out of business. We are asking them, as you’re profiting and we know you are, make a commitment to benefit all.”Ditto for millions of Americans living in farm country and on Indian reservations too.Bottom line No. 1: Broadband for all is expensive and complicated to implement. Bottom line No. 2: It’s also absolutely essential and government needs to step up.And prioritize.It’s ironic isn’t it, that politicians are so focused on the foibles of Big Tech, when most of the problems those companies engender are irrelevant to huge swaths of the population. “It’s easier to focus on things like privacy,” says Katie Jordan, senior policy advisor at the Internet Society, a group that advocates for expanding internet access worldwide. “The congressional members see issues with tech companies right in front of their eyes. If you’re sitting on Capitol Hill and have access to the internet, maybe every now and then it’s slow, but then you go back to living your entire life online. It’s hard for them to imagine life for someone who hasn't had that access.”But isn’t that the very core of being a public servant?“We need to start treating this the same way we treat any infrastructure: water, roads, electricity. Government has to be involved,” says Falcon of the Electronic Frontier Foundation. “Lots of legacy owners will oppose the transition. But they have to accept the transition has already happened. Most countries, including China, have adopted fiber efforts. We will see the world where average Chinese citizens have a 100 gigabit connection and we’re struggling with one one-thousandth of the speed. It will take years. The longer we wait to start, the more behind we are.”Not surprisingly, Elon Musk and Jeff Bezos, aren’t waiting. Both have endeavors to beam broadband from a system of satellites that have been greenlit by the FCC, Musk’s is called Starlink from his SpaceX business—which reportedly will offer speeds of some 610 Mbps—while Bezos’ is called Project Kuiper, which is connected to Amazon and not directly to his space company, Blue Origin. Both though are acknowledged to be smaller scale solutions better for rural areas, at least for now.In the meantime, before these two (and the rest of Silicon Valley) completely take over our economy, millions of us could sure use some bipartisan help to get online. Fast!This article was featured in a Saturday edition of the Morning Brief on August 8, 2020. Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAndy Serwer is editor-in-chief of Yahoo Finance. Follow him on Twitter: @serwer.Read the latest financial and business news from Yahoo FinanceRead moreHere's what Bill Gates and Warren Buffett talk about during COVID-19Inside Amazon, Apple, Facebook and Google versus the FedsHow to get out of the COVID-19 testing messBillions or trillions: The great coronavirus trade-offHow this week changed America foreverWhat America can learn about reopening from the state of MaineWhat will everything look like after the coronavirusHere’s how the coronavirus divides us"}]}