{"article": [{"url": "https://finance.yahoo.com/news/more-businesses-implement-required-mask-policies-home-depot-lowes-gap-and-more-182522641.html", "published": 1595252000.0, "headline": "More businesses implement required mask policies: Home Depot, Lowe's, Gap, and more", "body": "Gap is the latest retailer to require customers wear masks in stores, joining a growing list of companies implementing the same policy.“Employees are already required to wear masks in our stores to help keep our customers and communities safe, and we're now asking our customers to help us do the same, with the exception of small children or those who are exempt due to an underlying medical condition,” Gap said in a statement in its website.Face coverings reduce the spread of COVID-19, according to the CDC, yet there is no federal mandate for Americans to wear them when out in public.“Cloth face coverings are one of the most powerful weapons we have to slow and stop the spread of the virus – particularly when used universally within a community setting. All Americans have a responsibility to protect themselves, their families, and their communities,” CDC director Robert Redfield said in a statement last week.As mask-wearing has become politicized and transmission continues, several states have been seeing spikes in coronavirus cases and have had to reverse reopening orders.In the absence of a unified government ruling of mask-wearing, many retailers and big businesses are taking it upon themselves to keep their employees and customers safe and requiring people wear face coverings in-store, regardless of whether local regulations do so.After Walmart, Target, and others announced the requirement recently, many others have followed.People wearing facemasks sit outside a Walmart store in Washington, DC on July 15, 2020. Walmart will require shoppers to wear face masks. (Photo by ANDREW CABALLERO-REYNOLDS / AFP)Here is a list of some of the companies with mandatory mask policies in effect:Home Depot - 2,285 locations“The Home Depot today announced that shoppers will be required to wear masks or facial coverings while inside all U.S. stores, beginning Wednesday, July 22. Small children or those who have a valid medical condition will not be required to wear a mask.” — Home DepotLowe’s - 2,002 locations“Lowe's Companies, Inc. today announced it is adopting a nationwide standard for all customers to wear masks or face coverings when shopping in U.S. stores effective July 20. Lowe's will offer free masks at the customer service desk of every store for customers who need them, while supplies last.” — LowesStory continuesWalmart - 4,756 locations“As the number of confirmed cases has spiked in communities across the country recently, so too have the number and types of face covering mandates being implemented. Currently about 65 percent of our more than 5,000 stores and clubs are located in areas where there is some form of government mandate on face coverings. To help bring consistency across stores and clubs, we will require all shoppers to wear a face covering starting Monday, July 20. This will give us time to inform customers and members of the changes, post signage and train associates on the new protocols.” — WalmartStarbucks - 15,257 locations“In its continued effort in prioritizing the health and well-being of partners (employees) and customers, Starbucks today announced that beginning on July 15, it will be requiring customers to wear facial coverings while visiting all company-owned café locations in the US.” — StarbucksBest Buy - more than 900 locations“As COVID-19 cases continue to rise throughout the country, Best Buy is joining many retailers by requiring all customers to wear face coverings when shopping in all our stores.” — Best BuyBJ’s Wholesale Club - 216 locations“Effective Monday, July 20, 2020, anyone entering a BJ’s location will be required to wear a facial covering that covers both the mouth and nose at all times while shopping in our Clubs. Children under the age of 2 are not required to wear a facial covering.” — BJ’sApple - 271 locations “Face coverings will be required for all of our teams and customers, and we will provide them to customers who don’t bring their own.” — AppleCostco - 546 locations“To help protect our employees and members, effective May 4, 2020, all Costco members and guests must wear a face covering that covers the mouth and nose, at all times while at Costco. This requirement does not apply to children under the age of 2 or to individuals who are unable to wear a face covering due to a medical condition.” — CostcoTarget - 1,871 locationsTarget said it will implement mandatory face coverings on Aug. 1. “This builds on the more than 80% of our stores that already require guests to wear face coverings due to local and state regulations,” the company told reporters.CVS - 9,900 locationsNews | With the recent spike in COVID-19 infections, we're joining others in taking the next step and requiring all customers to wear face coverings when entering any of our stores throughout the country effective Monday, July 20. #COVID19— CVS Pharmacy (@cvspharmacy) July 16, 2020National Retail Federation“NRF applauds the leadership of companies like Walmart, Starbucks, Best Buy, BJ’s Wholesale Club, Apple, Qurate Retail Group, Costco and others that have implemented nationwide mask mandates. We hope today’s announcement by Walmart – the world’s largest retailer – that it will be enforcing a policy requiring customers to wear a mask to shop in their stores is a tipping point in this public health debate. Workers serving customers should not have to make a critical decision as to whether they should risk exposure to infection or lose their jobs because a minority of people refuse to wear masks in order to help stop the spread of the deadly coronavirus.” — NRFMenards - 350 locations“We are requiring Guests and Team Members to wear masks while shopping at all store locations.” —MenardsKohl’s - 1,158 locations“As COVID-19 cases continue to rise, face covering mandates have grown to apply to approximately 70% of our store base, therefore we’ve made the decision to take a consistent approach across our entire store fleet. Beginning Monday, July 20, we will require all customers to wear a face covering while shopping in our stores. This mask requirement does not apply to individuals unable to wear a mask for medical reasons.” — Kohl’sKroger - 2,757 locationsWith the increase in #COVID19 cases across the country, we are committed to doing our part to help reduce the spread of the virus. Starting July 22, we will require all customers in all locations to wear a mask, joining our associates who continue to wear masks. pic.twitter.com/r9WPD3QNFa— Kroger News (@KrogerNews) July 15, 2020Publix - 1,239 locations“Beginning July 21, customers are required to use face coverings over their noses and mouths while inside any Publix store. This new mandate is encouraged by the CDC for most individuals. Thank you for doing your part to limit the spread of COVID-19.” — PublixWhole Foods - ~ 500 locations“Effective July 20, Whole Foods Market requires all customers to wear face coverings while shopping in our stores to protect the health and safety of our Team Members and communities. Whole Foods Market provides face masks at the entrance of all stores for customers who do not have their own face covering.” —Whole FoodsGap Inc (Gap, Banana Republic, Old Navy, Intermix, Janie and Jack)“Given the recent increase in COVID-19 cases in the US and Canada, we want to do everything we can to help stop the spread of the virus. That’s why we are adjusting our current policy and requiring all customers to wear masks in all of our North America Gap, Old Navy, Banana Republic, Intermix and Janie and Jack stores, effective August 1. “ — Gap IncIkea - 50“For preventing a COVID-19 spread, it is mandatory for all visitors to wear masks during visit. Please wear a mask to protect yourself and understand that you are not allowed to enter our store without wearing it. To secure customers’ and co-worker’s safety, co-workers will be wearing masks and we are disinfecting the store regularly.” — IkeaMcDonald’s - around 14,000The rule begins Aug. 1.This list will be updated.-Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Coronavirus crisis fuels push to widen social safety netThe 2008 recession was far worse for young people's careers than previously thoughtWhat have we learned from the $HTZ debacle?Black communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey"}]}