{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-democrat-governor-argues-against-extending-extra-600-unemployment-insurance-164553186.html", "published": 1594986800.0, "headline": "Coronavirus stimulus: Democratic governor argues against extending extra $600 unemployment insurance", "body": "There are better ways to support those unemployed at the hands of COVID-19 than extending the $600 unemployment top up, Democratic Connecticut Governor Ned Lamont says.“Look, I think we’ve got to extend the unemployment [benefits],” Lamont said on Yahoo Finance’s The First Trade. “We still have a double-digit unemployment rate here [Connecticut]. And I would be generous when it comes to those companies that are still not open. Our event planners, for example, our bars. There we have got to be generous. But for those companies that are open, which is most of our economy, I want to do everything I can to encourage them to get back to work. We can get them back to work safely. So I was sort of more inclined towards giving people the incentive to get back to work and not doing a big $600 increase for everybody else who are still unemployed.”Lamont’s position is a rare one right now inside the Democratic party.Democrats in the House signed off on a $3 trillion COVID-19 relief bill several months ago. It would extend the $600 weekly payments originally passed in the Coronavirus Aid, Relief, and Economic Security (CARES) Act through January. The bill would also provide for another round of direct payments of up to $1,200 for individuals and $6,000 with families that have children.House Minority Leader Nancy Pelosi of Calif., left, speaks during a news conference on Capitol Hill in Washington, Wednesday, Jan. 8, 2014, about extending unemployment insurance benefits. From left are, Pelosi, D-Calif., AFL-CIO President Richard Trumka, Rep. Sander Levin, D-Mich., Sen. Jack Reed, D-R.I., Sen. Bob Casey, D-Pa., and Rep. John Conyers, D-Mich. Sen. Reed, is leading the effort in the Senate to reauthorize the benefits for three months. (AP Photo/J. Scott Applewhite)While House Speaker Nancy Pelosi has signaled recently a willingness to compromise with Republicans (who are against them) on the $600 unemployment checks, the decision on any form of extension is likely to come down to the wire. Without an extension, the extra unemployment relief will expire on July 31 and possibly send households into fresh financial chaos.Proponents of the top up such as Lamont and most Republicans have argued it gives people more money to sit at home than to actively look for work.“The single most important thing we have to do going forward is stop the $600 a week [unemployment] payments,” Heritage Foundation economist Stephen Moore said on The First Trade this week. Moore estimates the U.S. economy has lost 1 million to 2 million jobs because of the extra unemployment payments.Story continuesBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}