{"article": [{"url": "https://finance.yahoo.com/news/exclusive-bytedance-investors-seek-stakes-060054370.html", "published": 1598231300.0, "headline": "Exclusive: ByteDance investors seek to use stakes to finance TikTok bid", "body": "By Echo Wang and Joshua Franklin(Reuters) - ByteDance investors are in talks to use their stakes in the Chinese technology firm to help finance their bid for its popular short-video app TikTok, according to people familiar with the matter.ByteDance has been in talks to divest TikTok's North America, Australia and New Zealand operations to potential acquirers, including Microsoft Corp <MSFT.O> and Oracle Corp <ORCL.N>. President Donald Trump has ordered the Chinese company to sever ties with the social media app in the United States, citing concerns over the safety of the personal data it handles.Some ByteDance investors, including investment firm General Atlantic, are vying to own large stakes in the TikTok assets for sale, the sources said. Under their restructuring plan, Microsoft or Oracle could receive a minority stake in the assets, the sources added.The TikTok assets for sale could be worth between $25 billion and $30 billion, the sources said. To help fund their bid, the ByteDance investors are discussing exchanging some or all of their stakes in the Chinese company with equity in the TikTok assets, according to the sources.The ByteDance investors' plan faces long odds and significant hurdles, the sources said. Trump administration officials have said they expect a major U.S. company to lead the TikTok deal and ringfence the app technologically from ByteDance. A U.S. government panel, the Committee on Foreign Investment in the United States (CFIUS), has to sign off on any deal that ByteDance reaches.Nevertheless, the push by some ByteDance investors for a bigger role in the TikTok deal underscores their efforts to give the Chinese company more options and avert a fire sale. Some of them had to convince ByteDance's founder and CEO Yiming Zhang to let go of TikTok, the sources said.Microsoft remains the lead bidder for the TikTok assets because of its deep pockets and technical capacity to design new algorithms for TikTok that will be separate from ByteDance and its Chinese short video app Douyin, according to the sources.Story continuesMicrosoft is working on a blueprint on how TikTok would be separated operationally from ByteDance after a deal is reached, which the Redmond, Washington-based company has said it hopes to ink by Sept. 15, the sources added. CFIUS would then monitor the implementation of the deal under a lengthy transition period, according to the sources.The sources requested anonymity because the matter is confidential. TikTok and General Atlantic declined to comment, while ByteDance, Microsoft and Oracle did not immediately respond to requests for comment.As relations between the United States and China deteriorate over trade, Hong Kong's autonomy, cybersecurity and the spread of the novel coronavirus, TikTok has emerged as a flashpoint in the dispute between the world's two largest economies.While TikTok is best known for its anodyne videos of people dancing and going viral among teenagers, U.S. officials have expressed concerns that information on users could be passed on to China's communist government.Trump has said he would support an effort by Microsoft to buy TikTok's American operations if the U.S. government got a \"substantial portion\" of the proceeds, but has also said there are other credible buyers such as Oracle.CRACKDOWN ON CHINESE-OWNED APPSThe White House has stepped up its efforts to purge what it deems \"untrusted\" Chinese apps from U.S. digital networks. Beyond TikTok, Trump has also issued an order that would prohibit transactions with Tencent Holding Ltd's <0700.HK> messenger app WeChat.Earlier this year, Chinese gaming company Beijing Kunlun Tech Co Ltd <300418.SZ> sold Grindr LLC, a popular gay dating app it bought in 2016, for $620 million after being ordered by CFIUS to divest. ByteDance acquired Shanghai-based video app Musical.ly in a $1 billion deal in 2017 and relaunched it as TikTok the following year. ByteDance did not seek approval for the acquisition from CFIUS, which reviews deals for potential national security risks. Reuters reported last year that CFIUS had opened an investigation into TikTok.TikTok said last week it planned to file a lawsuit against an Aug. 6 executive order by Trump prohibiting transactions with the app and ByteDance.ByteDance was valued at as much as $140 billion earlier this year when one of its shareholders, Cheetah Mobile <CMCM.N>, sold a small stake in a private deal, Reuters has reported. The start-up's investors include Japan's SoftBank Group Corp <9984.T>.(Reporting by Echo Wang and Josh Franklin in New York; Additional reporting by Greg Roumeliotis in New York; Editing by Jacqueline Wong)"}]}