{"article": [{"url": "https://finance.yahoo.com/news/facebook-is-operating-like-a-public-utility-and-has-huge-blind-spots-naacp-ceo-181910110.html", "published": 1594214840.0, "headline": "Facebook is operating like a public utility and has 'huge blind spots': NAACP CEO", "body": "Unless Facebook (FB) reboots its corporate culture, it will be hard to affect the type of change needed to once and for all clean up hate speech on the powerful social media platform.“Absolutely,” NAACP CEO Derrick Johnson said on Yahoo Finance’s The First Trade when asked if Facebook has a culture problem. Johnson is fresh off meeting with Facebook CEO Mark Zuckerberg and COO Sheryl Sandberg to discuss ways to better police content.The NAACP has been at the leading edge of taking Facebook to task for its subpar internal controls around hate speech. It’s efforts have led to numerous big-name Facebook advertisers such as Unilever and Coca-Cola to halt spending on the platform. The results of the company’s two-year audit on how it polices its site and its culture was released Wednesday and revealed Facebook lacking in many areas. Indeed, advertisers will unlikely be pleased.“I raised the question yesterday. They have a huge blind spot when it comes to hate groups and the sentiments of Americans across the country. If you look at the peaceful protests across the country, it looks like America. You have young, old, male, female, Black and white. That’s the reality that Americans want to see on platforms such as Facebook. It’s operating like a public utility. There are no accountability measures in place. One person makes the decision and you have a culture within the company that has huge blind spots when it comes to race issues and antisemitic behavior.,” Johnson added.FILE - In this Thursday, Dec. 12, 2019, file photo, National Association for the Advancement of Colored People President Derrick Johnson faces reporters during a news conference in Boston. Facebook CEO Mark Zuckerberg and Chief Operating Officer Sheryl Sandberg met with civil rights leaders, Tuesday, July 7, 2020, including the organizers of a widespread advertising boycott of the social network over hate speech on its platform. Johnson, who was present on the Zoom meeting, said Facebook’s executives only delivered cheap talk, filled with little commitment to new rules or actions that would curb racism and misinformation. (AP Photo/Steven Senne, File)Johnson tells Yahoo Finance he got “nothing” from his meeting with Zuckerberg and Sandberg. Facebook didn’t respond to Yahoo Finance’s request for comment.At this point in Facebook’s lifespan, one has to wonder if they have lost control of what’s on their site. And that strong policing is unlikely to happen at all.“It has to be a combination of human and it has to be a combination of machine. I think a lot of times machines cannot solve all the problems because machines need training. Machines are as good as much as you train the machines,” said former Snap chief strategy officer and now Verishop CEO Imran Khan on The First Trade, on whether Facebook has lost control of the platform. “I think at some point you have to get a human involved, and then I think a lot of those things also require human judgment.”Story continuesDespite the public uproar, Facebook’s stock has stayed surprisingly resilient. Shares are up 18% year-to-date, slightly outperforming the Nasdaq Composite.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}