{"article": [{"url": "https://finance.yahoo.com/news/california-wildfires-threaten-118-billionworth-of-homes-182841617.html", "published": 1598448980.0, "headline": "California wildfires threaten $11.8 billion-worth of homes", "body": "Some 13,000 lightning strikes have ignited over 650 wildfires in California this month, killing seven people. And for those who escaped, the fires have still caused plenty of damage.More than 17,000 homes worth an estimated $11.8 billion could burn down or become unusable due to smoke damage, according to a new Realtor.com analysis.“There is nothing more stressful for evacuees than to know whether or not their home was able to survive the wildfire, and we’re trying to provide that information as quickly as possible,” said Daniel Berlant, assistant deputy director, chief of planning, risk analysis, fire engineering and investigations for the California Department of Forestry and Fire Protection (CAL FIRE).Over 1,400 houses and buildings have already been destroyed, claiming 1.25 million acres of California — an area larger than the state of Delaware. That’s four times the amount of land that normally burns, an average 306,602 acres burn in California each year, according to CAL FIRE statistics.“The magnitude of the fires this year is much larger and earlier in the season than what we usually see. Obviously when you have the massive electrical discharges in the Bay Area that started the fire, it shows we are not in a typical year,” said George Ratiu, senior economist at Realtor.com.BOULDER CREEK, CA - August 22: Firefighters work to protect homes in Boulder Creek, Calif. on August 22, 2020. (Photo by Dylan Bouscher/MediaNews Group/The Mercury News via Getty Images)Already known for its sky-high rent prices and tight housing supply, the Bay Area faces the worst fire damage. South of San Francisco, in the Santa Cruz metro area, 5,300 homes valued at $4.5 billion are in danger. Just north of San Francisco, the Vallejo-Fairfield metro area is at risk of losing 3,800 homes valued at $2.65 billion collectively, according to Realtor.com.“The destruction is shrinking an already-tight supply of homes, which will result in a significant jump in prices for existing properties,” said Ratiu.The three biggest fires (named the LNU, SCU and August complex fires) are among the largest and most destructive fires on record in California, according to CAL FIRE.Story continues“The speed and severity with which the lightning storms set these fires have clearly increased the risk and the damage, and we have already seen significant damage to human life and to property,” said Ratiu.Though projections are dire, they could change with California’s weather, which took a turn for the better mid-week with cooler temperatures and higher humidity — hopefully diminishing the death and damage as 14,000 firefighters contain fires on the ground.“Improvement in the weather could allow firefighting crews to increase the containment areas, which would mitigate significantly the risk of further damage,” said Ratiu.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:The American mall experience is evolving before our eyes — here’s a virtual sneak peekCoronavirus causes a record number of hotels to default on their loans: reportThere’s a record number of vacant rental apartments in Manhattan"}]}