{"article": [{"url": "https://finance.yahoo.com/news/what-is-palantir-everything-you-need-to-know-about-the-supersecretive-20-billion-tech-firm-set-to-ipo-164310444.html", "published": 1594209080.0, "headline": "What is Palantir and can it really predict crime? Everything you need to know about the super-secretive $20 billion tech firm set to go public this year", "body": "Palantir, the secretive big-data firm co-founded by billionaire PayPal (PYPL) co-founder and Facebook (FB) investor Peter Thiel, announced plans to go public Monday. The Palo Alto-based firm, which is valued at roughly $20 billion, confidentially filed an S-1 with the Securities and Exchange Commission (SEC) and is now waiting on the SEC review process.But much of what Palantir does and how it uses its vast troves of data is opaque to those but the most dedicated followers. The firm has already courted significant controversy due to its work with government agencies including Immigration and Customs Enforcement. And, as with many highly-valued tech unicorns, there are still questions as to when it will finally turn a profit.Entrepreneur Peter Thiel speaks during the final day of the Republican National Convention in Cleveland, Thursday, July 21, 2016. (AP Photo/J. Scott Applewhite)Here’s what you need to know about one of the most shadowy companies in Silicon Valley before it goes public.What is Palantir and who runs it?Founded in 2004 with funding from the CIA’s not-for-profit venture capital arm In-Q-Tel, Palantir is named for a collection of mystical orbs in J.R.R. Tolkien’s “The Lord of the Rings” universe that can see both the past and present and allow users to communicate over vast distances.That’s not exactly far afield of how Palantir itself operates. The company is able to pull in data from disparate sources for clients, which help them either form or point them to possible solutions for their various needs.The firm currently offers two main services: Palantir Gotham and Palantir Foundry.Palantir Gotham, meanwhile, is a bespoke option used by companies, government agencies, and law enforcement to combine information to uncover previously unseen patterns and identify relationships between sets of data ranging from social media posts and addresses to license plate numbers and personal relationships. The service then puts all of that content together in easy-to-understand charts and graphs.Palantir cofounder and CEO Alex Karp. (Photo by Bertrand GUAY / AFP) (Photo credit should read BERTRAND GUAY/AFP via Getty Images)Foundry is a ready-made option focusing on clients ranging from pharmaceutical and automotive businesses to aviation companies like Airbus, and is meant to cut down on the costs associated with Gotham, such as the need for multiple on-site engineers.Story continuesPalantir offers a variety of what it calls solutions for different types of applications, whether that’s for automotive companies, the defense sector, financial compliance, insurance, intelligence operations, law enforcement, and others.The company is guided by billionaire co-founder and CEO Alex Karp. A graduate of Stanford Law School, like Thiel, Karp has run Palantir since shortly after its inception. Prior to Palantir, Karp founded the money management firm Caedmon Group.Karp has been hesitant about taking Palantir public, despite calls to do so from employees seeking to cash in on their stock options.During a 2014 talk at the First Data Cyber Security Summit, Karp said that companies that go public lose their competitive edge, due to the differences between “creative, wacky” engineers who look to solve problems and Wall Street where the objective is to cash in.Karp has also been vocal about his belief in the need for Silicon Valley companies to work with the U.S. government and law enforcement agencies.Logo and signage at the headquarters of big data analytics company Palantir, in the Silicon Valley town of Palo Alto, California, August 25, 2016. (Photo via Smith Collection/Gado/Getty Images).In a 2019 interview with CNBC, Karp had pointed words for firms like Google that have pulled out of contracts with the government.“That is a loser position. It is not intelligible. It is not intelligible to the average person. It’s academically not sustainable. And I am very happy we’re not on that side of the debate,” he said.Karp has also mused about moving Palantir out of Silicon Valley, in an interview with Axios, saying he may move the business to Colorado to break free of the Valley’s “monoculture.”Wins and controversiesPalantir says its unique software has helped assist companies and government agencies in everything from the conviction of Bernie Madoff and disaster recovery to cyber attacks and child exploitation. There’s even an apocryphal story that the firm’s technology was used to help locate Osama Bin Laden.According to Palantir, its technology was deployed in the aftermath of Hurricane Florence in 2018 alongside Team Rubicon, an organization of military veterans that respond to disaster areas. With the Palantir’s Gotham Operations module, the group was able to identify and respond to neighborhoods in the greatest need of assistance.Palantir also pointed to the use of its technology by the Center for Public Integrity and Georgetown University’s Journalism Program for their Peal Project. The initiative was launched to look into the murder of Wall Street Journal reporter Daniel Pearl who was killed by militants in Pakistan in 2007.The company says that the software is able to help identify 27 individuals who took part in the kidnapping and murder, mapping their relationships and providing answers to questions surrounding Pearl’s death.The firm also claims its software helped the U.S. military track insurgents in Afghanistan planting improvised explosive devices (IEDs) by finding correlations between weather patterns, command wire IED attacks, and biometric information found on explosive devices.Palantir says its technology was used to help track the perpetrators behind Daniel Pearl's kidnapping and murder. (Photo by Getty Images)The company says it also saw success in providing its software to the Salt Lake City Police Department, which Palantir claims helped officers reduce the amount of time it takes to perform complex investigations by 95%.But Palantir has also seen its share of controversy. The sheer amount of information the company’s software is capable of tracking — license plate numbers; Social Security numbers; social media accounts; addresses; bank records; interpersonal relationships — has led to comparisons with the thought crimes police in “Minority Report.”Palantir has used that kind of predictive policing model in New Orleans, according to The Verge. But predictive policing is controversial, and, according to studies, can lead to greater policing of minority and low-income communities.And it’s not just fear of the size of its data collection. The firm has also been targeted by demonstrators and its own employees for the work it does with Immigrations and Customs Enforcement.After denying that it worked with the deportation arm of Immigrations and Customs Enforcement, Karp came forward in an interview with CNBC, saying that his firm's software was being used to \"find people in our country who are undocumented.”WNYC previously reported that Palantir’s Falcon mobile app was used by ICE agents during operations including raids on nearly 100 7-11 stores in the U.S. in 2019.Karp has also admitted that Palantir’s software has likely been used to kill people in the military realm during his interview with Axios, but wouldn’t provide any greater detail as to who or how.In the past, according to Bloomberg, Palantir lost a number of partnerships with high-flying corporations including Hershey’s, Coca-Cola, Home Depot, and American Express due to the tech firm’s high costs.For all that’s still unknown about Palantir, it’s all but certain that the firm’s S-1 will gain plenty of attention when the company begins offering shares publicly, and finally gives the public a better look behind the curtain.Clarification: This piece has been updated to reflect that Palantir initially denied working with the deportation arm of ICE, not the agency itself.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:How to delete your Facebook, Instagram, and WhatsApp accountsApple is closing stores in these 11 states amid new coronavirus outbreaksDespite growing ad boycott, Facebook is too big for many advertisers to ignoreHow iOS 14 will change your iPhone forever: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}