{"article": [{"url": "https://finance.yahoo.com/news/stocks-of-bankrupt-companies-going-bananas-despite-companies-being-broke-123553108.html", "published": 1592120600.0, "headline": "Stocks of bankrupt companies going bananas despite companies being broke", "body": "There’s been a surge of interest in stocks of companies in financial trouble, most notably Hertz (HTZ), which filed for Chapter 11 bankruptcy and was dumped by activist investor Carl Icahn only to be picked up by many users on Robinhood and other stock-trading platforms.The interest in Hertz has been so hot that the company asked and was granted the right to sell $1 billion in new shares of stock that are essentially worthless.\"What you're getting right now is this great disconnect between fundamentals and finance,\" said Mohamed El-Erian, chief economic adviser at Allianz, on CNBC. \"Take Hertz. A company in a bankruptcy procedure that saw its share price go up....now they're talking about issuing stocks, warning investors they may be worthless.\"On June 9, Hertz opened at $3.37 and saw highs and lows of $6.25 and $3.09, respectively, which represent massive swings over 80%. The whole week was like this, with moments during the day where the stock was up or down to a huge degree. Even on June 11, the flattest day for the stock, there were moments when the stock was up 7%.Hertz is having a tough time, but its stock is very, very popular. (Photo by Mateusz Slodkowski/SOPA Images/LightRocket via Getty Images)Hertz isn’t the only stock like this; J.C. Penney, which is also in Chapter 11, and other risky companies, like Chesapeake Energy (CHK) have also had wild rides in the market of late. Chesapeake shares went from the low teens on June 4 to a session high of $77.50 on June 8 (around a 397% gain), finishing the week at just under $20.Many see the trend as part of the narrative of retail traders, bored from a lack of sports and betting — potentially armed with stimulus money — to use the stock market as a casino.“With the volatility, it is kind of like watching a sports game,” Barstool Sports’ Dave Portnoy, who has become a day trader, recently told Bloomberg.Robinhood users love Hertz, for nowThe latest trend of investing in bankrupt and otherwise distressed companies is standard day-trading on steroids. These investors appear not to be looking for long-term gains, but rather the chance that they will be on the winning side of wild volatility. In other words, they are speculating.Story continuesAccording to Robintrack, Hertz has been an especially hot stock for Robinhood users. Over the past week, the company has been the No. 2 most popular stock in portfolios. Only electric car company Nikola (NKLA) has seen a bigger surge. While J.C. Penney has been unavailable.Robinhood users may love mega cap stocks like Apple (AAPL) and Amazon (AMZN), but they’ve also consistently shown interest in stocks with low prices, like Ford (F) and GE (GE), which are currently the top two on the company’s popularity board. GoPro (GPRO) is also in the top 10. Hexo (HEXO), which is almost a penny stock at a dollar per share, is currently in more portfolios than Amazon (AMZN). The lower the price, the easier to trade.“Clearly there’s some speculative fever going on right now,” said Kathy Jones, Charles Schwab’s chief fixed income strategist. “Money is cheap trading is cheap, and this is what they’re doing.”Very risky businessA huge profit in a day or week is sweet, but the volatility swings both ways, and just like how the house always wins, bankrupt companies often end with a loss — because they are literally bankrupt and have no money.There’s a reason why bankrupt companies aren’t worth much, and whoever ends up holding the bag may not want to. For those who are looking for a piece of a bankrupt company, investors are the last in line for any remaining asset value — everyone gets paid back before them when a company goes bust.While the rewards are easily imaginable when you see big swings, the risk isn’t. Unlike a roulette wheel, there is no obvious measure of risk/reward. On the other hand, for someone who is using the market in lieu of the casino — say, for small amounts — maybe that’s not a bug.Looking at the volume, however, the amounts are not that small. A year ago, Hertz had a trade volume of around 2 million to 7 million per day. But on Monday, volume hit 533,891,800. A lot of parties are getting involved, and those numbers suggest that this may be more than the $20 blackjack table.All of this has a lot of people shaking their heads.“When you see this kind of froth in stocks that have declared bankruptcy, that's never a good sign,” said Matt Maley, chief market strategist at Miller Tabak on Yahoo Finance’s The First Trade. “When we're on the kind of speculation by people who are not used to being involved in the market, that's a poor sign for the length of a rally.”--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.'Robinhood is not behind the rally,’ Barclays says as retail demand surgesWant a 'slice' of a stock? Demand booms for fractional shares as markets soarLeisure and hospitality drive jobs numbers higherOverdraft fees have forced the poor out of banks: Former FDIC chairWhy pandemic insurance is impossible2021 health insurance rates are coming out despite 'unprecedented uncertainty'Insurance premiums expected to rise 4% to 6%, before factoring in COVIDHigh-yield savings banks finally hit by the Fed's coronavirus rate cutFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"}]}