{"article": [{"url": "https://finance.yahoo.com/news/one-key-senators-argues-against-more-stimulus-no-need-to-load-the-money-cannon-again-184943183.html", "published": 1592488640.0, "headline": "One key senator argues against more stimulus: No need to ‘load the money cannon' again", "body": "Back on March 20, as Congress was in final negotiations on the $2 trillion CARES Act, Sen. Pat Toomey (R-PA) described the goal of the bill as ensuring that “American's livelihoods are intact when we get through this.”Now, almost three months later, he has become one of the Senate’s leading voices against another round of stimulus, arguing that the focus should be on getting people back to their livelihoods.“I would be very, very reluctant to support any kind of legislation that's going to have the effect – even if unintended – of delaying the reopening,” he said Thursday in a interview with Yahoo Finance that covered a range of topics including Toomey’s questioning of Federal Reserve Chair Jerome Powell earlier in the week.Toomey has been skeptical of efforts to re-up certain provisions of the CARES Act such as direct stimulus checks and extending unemployment insurance. “It's not obvious to me that we need to load the money cannon and fire that off again,” he said.Here’s the case he made during the interview.Not interested in more ‘demand-side’ stimulusToomey points that an idea in the CARES Act, which he was central in helping to draft, was simply to replace lost income but now, “in some cases, it's well beyond lost income.”“A senior citizen who is a retiree didn't have a reduction in their Social Security check because of the pandemic, and yet, that person still got the $1,200” stimulus check, Toomey notes as one example. Like many of his Republican colleagues, he has reservations about what he sees as doing even more “demand-side” stimulus like the Economic Impact Payments checks that have been going out since April.Senator Pat Toomey exiting the Senate subway in January. (Tom Williams/CQ-Roll Call, Inc via Getty Images)Republicans have also been pushing back since the day the CARES Act cleared the Senate on enhanced unemployment insurance provisions that they note in some cases is paying people more to stay home than return to work.‘Americans are going to pay a price for this’Toomey has represented Pennsylvania in the Senate since 2011. He won his seat during the 2010 Tea Party wave which was heavily focused on government spending. Before entering the Senate, Toomey was the president of the Club for Growth, which describes itself as a network of “pro-growth, limited government Americans.”Story continuesIn his years in Congress, Toomey has, indeed, raised the issue of the ballooning deficit more than many of his colleagues (though he has also supported budget-inflating measures like the Trump tax cuts in 2017).“Let's remember, there's no free lunch,” he says of another round of stimulus. “All of this is either borrowed money or created money and, either way, Americans are going to pay a price for this.”Mitch McConnell, the Republican leader in the Senate, is reportedly working with the White House towards another stimulus bill somewhere in the $1 trillion range. The Democratic-led HEROES act, which passed the House of Representatives in May, came with a $3 trillion price tag.The paper version - featuring President Trump's name - of the Economic Impact Payment checks. Most of money was distributed via direct deposit (U.S. Secret Service)McConnell, like Toomey, has often emphasized the need to wait and assess what worked. He’s also said that his bill won’t look anything like the Democratic effort, and will strip out provisions like extending unemployment benefits – if he gets his way.‘Get on with the re-opening of the economy’Toomey has talked about how, to him “the most important thing is that we get on with the re-opening of the economy.”He says of Pennsylvania that “unfortunately, a very substantial portion of our state is still not fully re-opened, despite the fact that we are routinely now having record low numbers of positive coronavirus tests, certainly since March.” Pennsylvania and its neighbors have indeed been seeing their caseloads decrease for many weeks.Currently 46 counties in Pennsylvania have been classified in the least restrictive “green” classification by Democratic Governor Tom Wolf. Twenty-one counties are in the “yellow” phase but could go green this week.Toomey wants things moving faster. He says if the economy is allowed to re-open more quickly “we're going to find employment come back quite strongly,” which then can help “evaluate where we are and see what remains to be done” in Washington.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Sen. Toomey: Fed gets ‘good marks’ on crisis responseCory Booker calls on lawmakers to get 'their act together' on new coronavirus stimulusCoronavirus stimulus checks: What would need to happen before a second roundRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}