{"article": [{"url": "https://finance.yahoo.com/news/fund-managers-overweight-growth-tech-stocks-most-crowded-trade-morning-brief-101038923.html", "published": 1594790300.0, "headline": "Big money managers are worried about the trade they love most: Morning Brief", "body": "Wednesday, July 15, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeInvestors are betting on big tech. But they’re worried that everyone else is, too.To the surprise of few, investors think betting on big tech is a trade that is a bit too crowded.In fact, investors think this trade is as crowded as any we’ve ever seen.But in spite of this, bets on big tech names continue to be the most overweighted trade in portfolios.On Tuesday, Bank of America Global Research published its latest monthly fund managers’ survey and surfaced this irony wherein we find investors betting big on tech stocks and investors also worried that too many other people love tech stocks. July’s survey covered 188 fund managers with a total of $570 billion in assets under management.According to BofA’s data, 74% of respondents said that being long U.S. tech stocks is the “most crowded” trade in the market right now, a record high for any trade in the survey’s history.74% of fund managers that replied to Bank of America's latest global fund manager survey said betting on U.S. tech stocks is the most crowded trade in the world right now. (Source: Bank of America Global Research)But this report also shows that a net 42% of investors are overweight technology stocks, the highest of any sector.This measure tracks the differential between the percentage of investors who say they are overweight a sector relative to their benchmark minus those who say they are underweight that sector. It is essentially a way to gauge how much more investors are favoring any one sector more than they typically would.And while 3 out of 4 respondents to BofA’s survey think betting on tech stocks is a crowded trade in the world, it also seems many folks are holding their nose and buying tech stocks considering the sector is most in favor among investors.And despite so many investors calling tech stocks the most crowded trade in this market, managers are more overweight tech stocks relative to their benchmark than any other sector. (Source: Bank of America Global Research)And while these data do seem to be in tension with one another, we also think this serves as a great example of how confounding and challenging this market environment has been for so many.The S&P 500 is coming off one of its best quarters on record while the unemployment rate has surged past the worst levels seen during the financial crisis. And while investors have grown fond of noting that the market looks forward and remains focused on whether things are broadly getting better or broadly getting worse, this divergence remains confounding.Story continuesWe’ve highlighted calls from many strategists, economists, and analysts who believe we have seen the worst days of this crisis. But the market’s persistent rally off the March lows has forced many an investor to capitulate and pile into what’s working.And what’s been working is tech stocks.Against this backdrop, then, it makes some sense that we find investors both concerned about the tech-driven rally and finding few other areas of the market to be excited about.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7:00 a.m. ET: MBA Mortgage Applications, week ended July 10 (2.2% prior week)8:30 a.m. ET: Import price index MoM, June (1.0% expected, 1.0% in June)8:30 a.m. ET: Export price index MoM, June (0.8% expected, 0.5% in May)8:30 a.m. ET: Empire Manufacturing, July (10.0 expected, -0.2 in June)9:15 a.m. ET: Capacity utilization, June (67.8% expected, 64.8% in May)9:15 a.m. ET: Industrial production MoM, June (4.3% expected, 1.4% in May)2:00 p.m. ET: Federal Reserve release Beige BookEarningsPre-market5:55 a.m. ET: UnitedHealth Group (UNH) is expected to report adjusted earnings of $5.25 per share on revenue of $63.3 billion6:30 a.m. ET: Bank of New York Mellon (BK) is expected to report adjusted earnings of 92 cents per share on revenue of $3.89 billion6:40 a.m. ET: PNC Financial Services Group (PNC) is expected to report adjusted earnings of 72 cents per share on revenue of $4.1 billion6:45 a.m. ET: US Bancorp (USB) is expected to report adjusted earnings of per share of 30 cents on revenue of $5.55 billion7:20 a.m. ET: Goldman Sachs (GS) is expected to report adjusted earnings of $3.95 per share on revenue of $9.71 billionPost-market4:10 p.m. ET: Alcoa (AA) is expected to report an adjusted loss per share of 28 cents on revenue of $2.11 billionTop NewsApple wins appeal against $14.7B EU tax ruling [Yahoo Finance UK]Moderna Phase 1 results show coronavirus vaccine safe, induces immune response [Reuters]Trump administration reverses new visa guidelines for international students [Yahoo Finance]Big US banks unwilling to call the economic bottom yet [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSHere’s how Joe Biden says he’ll create 1 million new auto industry jobsBen Carson: All Obama HUD rule does is provide ‘permanent employment for lawyers’Coronavirus depresses venture capital funding, but deal activity and IPOs rebound in Q2—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}