{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-covid-weekly-initial-jobless-claims-june-13-151640589.html", "published": 1592465960.0, "headline": "Jobless claims: Another 1.51 million Americans file for unemployment benefits", "body": "A handful of recent economic data pointed toward a quicker-than-expected recovery, and the weekly initial jobless claims report Thursday provided investors with additional clues on the state of the U.S. labor market.Another 1.508 million Americans filed for unemployment benefits in the week ending June 13, exceeding consensus expectations for 1.29 million. The prior week’s figure was revised higher to 1.57 million from the previously reported 1.54 million jobless claims. While last week marked 11 consecutive week of deceleration, more than 45 million Americans have filed for unemployment insurance over the past 13 weeks.Read more: Coronavirus: How to find a job in a tough economy(Yahoo Finance/David Foster)Continuing claims, which lags initial jobless claims data by one week, totaled 20.54 million in the week ending June 6 following 20.61 million in the prior week. Economists were expecting 19.85 million continuing claims for the week.While weekly claims have fallen for 11 straight weeks, there are signs that the labor market recovery may be stalling, according to ING economist James Knightley. “Today's jobless claims numbers suggest the reopening story isn't having as much of a positive impact on the labour market as hoped. It reinforces the case for more fiscal support to keep the economy on the recovery path,” Knightley said in a note Thursday.In the week ending June 13, California reported the highest number of jobless claims at an estimated 243,000 on an unadjusted basis, down from 256,000 in the previous week. Georgia had 131,000, down from 135,000. New York reported 96,000 and Texas had roughly 94,000 jobless claims.Pandemic Unemployment Assistance (PUA) program claims, which include those who were previously ineligible for unemployment insurance such as self-employed and contracted workers, was closely monitored in Thursday’s report.PUA claims totaled 760,5266 on an unadjusted basis in the week ending June 13, up from the prior week’s 694,463.Story continuesInitial jobless claims data isn’t necessarily a perfect indicator of the U.S. labor market, but it still is useful, according to Wells Fargo Securities. “Over-reliance on jobless claims led every forecaster to miss the increase in May nonfarm employment, but claims are still a useful indicator.”“Initial claims the week ended June 6 fell 19% from the prior week to 1.5M, the largest percentage decrease since April 11. Continuing claims the week ended May 30 fell by 340K t0 20.9M, only the second decrease since the crisis began. The decrease would have been larger if not for outsized increases in California, Florida and Oregon. But both of these numbers are still horrific,” the firm added.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Retail sales jump 17.7% in May amid COVID-19 pandemicJobless claims: Another 1.54 million Americans file for unemployment benefitsA theory for why the 'startling' jobs numbers conflict with the other gloomy dataFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}