{"article": [{"url": "https://finance.yahoo.com/news/i-actually-would-be-tougher-a-democratic-plan-for-changing-the-relationship-with-china-after-trump-152656198.html", "published": 1591871660.0, "headline": "‘I actually would be tougher’: A Democrat's plan for changing the relationship with China after Trump", "body": "Representative Tom Malinowski represents New Jersey’s 7th District in Congress, but before that he served as an assistant secretary of state in the Obama administration and in the National Security Council during the Clinton administration.He’s emerged as a leading voice on how Washington might shift its relationship with China in the coming years with a possible Democratic administration.President Donald Trump has repeatedly attacked former Vice President Joe Biden as someone who would give in to China. Malinowski told Yahoo Finance he aims to flip the perception that Democrats wouldn’t stand up to China.“I actually would be tougher, and hope that Joe Biden would be tougher,” he said during an appearance Wednesday on Yahoo Finance’s “On the Move.”Rep. Tom Malinowski, D-N.J., during a hearing in 2019. (Tom William/CQ-Roll Call, Inc via Getty Images)On trade, Malinowski says he agrees with Trump. “We needed to take on the Chinese on trade,” he said, while also building alliances with European and other Asian nations to make any sanctions or tariffs actually stick.‘This is not rocket science’The congressman has outlined his plan on building coalitions in a variety of forums, including a recent Washington Post op-ed.He argues that the Trump administration has alienated allies while also not being focused on forcing China into structural changes.“We’ve got to be up to the challenge,” he said. “This is not rocket science.\"Rep. Malinowski with House Speaker Nancy Pelosi. (Bill Clark/CQ-Roll Call, Inc via Getty Images)“What I hear from the Trump administration is just, “Please buy some of our American wheat and all is forgiven,” says Malinowski.During the primary campaign, Democrats often shied away from offering specifics on what they would do different than Trump on trade with China. Biden often went the furthest. During the September 12 debate, he said, “You need to organize the world to take on China, to stop the corrupt practices that are underway.”He added, “[The United States makes] up 25 percent of the world economy. We need another 25 percent to join us.”Malinowski endorsed Biden in January, saying that as a former assistant secretary of state, he is “eager to support a nominee with the experience to restore the place of respect America once occupied on the world stage.”Story continues‘We will open our doors to refugees from Hong Kong’Malinowski also discussed what do to about the clashes between protestors in Hong Kong and Chinese authorities.“The strongest, the toughest thing we can do in support of the protesters in Hong Kong” is to signal that “we will allow the people of Hong Kong to rebuild their experiment in capitalism and democracy in the United States,\" he said.In recent weeks, authorities in Beijing announced what they are calling “national security laws” that activists say would curb freedoms and end the traditional \"one country, two systems\" relationship between Hong Kong and mainland China.Representative Malinowski represents a district in Northern New Jersey and recently joined a Black Lives Matter protest in the town of Millburn. (Rich Graessle/Icon Sportswire)“We will open our doors to refugees from Hong Kong,” he says, arguing that doing so would be the “most important deterrent that we can put into place against increased Chinese repression there.”The Trump administration has begun the process of withdrawing special trade benefits for Hong Kong in response to the crisis. But Trump also recently said he was not considering placing sanctions on Chinese President Xi Jinping personally.The China and the 2020 electionThe battle lines for Democrats and Republicans over China have become quite clear in recent weeks with each side seemingly in a contest to accuse the other of being the weaker party on China.Nobody in 50 years has been WEAKER on China than Sleepy Joe Biden. He was asleep at the wheel. He gave them EVERYTHING they wanted, including rip-off Trade Deals. I am getting it all back!— Donald J. Trump (@realDonaldTrump) May 25, 2020In a recent speech, Biden said that Trump has “repeatedly praised China’s containment response, despite a litany of public appeals, including from me, not to bet American lives and the U.S. economy on the word of the Chinese government.”During all the election-year back and forth, Malinowski has tried to make progress on China where he can find it. He recently joined a bipartisan letter to Apple (AAPL), which included signers from Senator Ted Cruz (R-TX) to Representative Alexandria Ocasio-Cortez (D-NY) to condemn what they called the company’s censorship “at the behest of the Chinese government.”For Malinowski, the goal is to change the overall focus. He says the United States needs to show the world “that we are, in every way, different from the Chinese Communist Party.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Senate moves to delist Chinese companies from US stock exchangesWhy Trump is moving closer to punishing China for the coronavirusThe Democrats have no answer to Trump’s reckless trade warRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}