{"article": [{"url": "https://finance.yahoo.com/news/new-home-sales-what-to-know-in-markets-tuesday-231634315.html", "published": 1592850260.0, "headline": "New home sales: What to know in markets Tuesday", "body": "On the heels of bleaker-than-expected U.S. existing home sales data, investors will be looking to the new home sales report due out Tuesday morning for additional clues on how the U.S. housing market is holding up.COVID-19 has been hammering the housing market over the past few months. Existing home sales plunged 9.7% to their lowest level in more than nine years in May, according to the National Association of Realtors. Regions that were hardest hit included the West and Northeast, both of which have been struggling to contain the coronavirus.May’s existing homes sales data reflects the closing contracts signed in March and April. Existing home sales represents about 90% of the U.S. home sales.UNIONDALE, NEW YORK - MAY 27: An aerial view of a construction worker roofing an apartment home on May 27, 2020 in Uniondale, New York. (Photo by Al Bello/Getty Images)New home sales are expected to have bounced 1.9% in May to a seasonally adjusted 635,000 units, up from a modest 0.6% increase in April.“Anecdotal information from several real estate brokerages also indicates an improvement in buyer interest. However, rising concerns over a possible resurgence of COVID-19 outbreaks could dampen home sales activity in the near term,” Nomura economist Lewis Alexander said in a note June 19. “Easing of restrictions on mobility and nonessential business activity suggests contract signings for newly built homes likely rose solidly during the month.”Alexander noted that the weekly volume in mortgage loan applications has been increasing substantially since bottoming in April. All should be positives for the housing market in the near term.Other economic data releases scheduled for Tuesday include the following:Markit US Manufacturing PMI, June preliminary (50.8 expected, 39.8 in May); Markit US Services PMI, June preliminary (48.0 expected, 37.5 in May); Markit US Composite PMI, June preliminary (37.0 in May); New Home Sales, May (635,000 expected, 623,000 in April); New Home Sales month-on-month, May (+1.9% expected, +0.6% in April); Richmond Fed Manufacturing Index, June (-11 expected, -27 in May)Story continues—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:White Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeJobless claims: Another 1.51 million Americans file for unemployment benefitsRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}