{"article": [{"url": "https://finance.yahoo.com/news/walmart-q2-earnings-results-110617852.html", "published": 1597733720.0, "headline": "Walmart Q2 earnings soar, led by nearly 100% surge in e-commerce", "body": "Walmart (WMT), the world’s largest retailer, reported better-than-expected second-quarter earnings results, bolstered by online sales that skyrocketed 97% during the period, as the coronavirus crisis prompted consumers to flock to e-commerce for their needs.Here were the main numbers compared to Bloomberg consensus forecasts:Revenue: $137.7 billion vs. expectations of $135.6 billionAdjusted EPS: $1.56 vs. expectations of $1.24Walmart U.S. comp-store sales (excluding gas): 9.3% versus 5.3% expectationsWalmart U.S. e-commerce sales: up 97 %Walmart’s stock, which closed at $135.60 on Monday, jumped more than 6% in the pre-market before paring gains.“I want to give a big thank you to our associates for their tireless efforts during these unprecedented times,”CEO Doug McMillon said in a statement.“We also appreciate the trust and confidence of our customers. We remain focused on serving them well now and expanding our set of global capabilities to serve them well in the future,” he added.During the quarter, Walmart’r revenue rose 5.6%, or $7.4 billion, from the same quarter a year ago — benefiting from its status as an essential business that remained open during the darkest days of the COVID-19 lockdown.The company’s closely-followed comparable store sales in the U.S. jumped 9.3% in the quarter, “led by strength in general merchandise and food.” Online grocery pickup and delivery “continued to experience all-time high sales volumes,” the company said.Comparable sales for food increased high single-digits as shoppers continued to stock up on consumables, household cleaning products, and paper goods.At the end of the quarter, Walmart offered its online grocery pickup service at 3,450 locations and same-day delivery at 2,730 stores.The stimulus effectThe retail giant's strong quarter was led by buying booms in categories like grocery, health/wellness, and general merchandise.Still, there were some pockets of weakness. Walmart pointed out that comparable transactions declined 14% — impacted by what data analytics firm Placer.ai noted recently was softer store traffic.Story continuesAfter a steep drop in April, Placer.ai data found that Walmart’s in-store traffic rebounded some in May, but dropped sharply in June and July. The firm also noted stiffening “crossover competition” from retail giants like Dollar General (DG) Lowe’s (LOW) and Home Depot (HD)— which also reported strong Q2 earnings on Tuesday.“While Walmart is still king, the pandemic has given rise to more home improvement shopping and growing dollar store visits, two segments that seem to be taking away visits,” noted Ethan Chernofsky, Placer.ai’s VP of marketing.Yet that impact was more than offset by Walmart’s muscular web sales. Comparable average ticked grew 27% as “customers continued to consolidate store stopping trips with larger baskets and shifted more purchases to online.”Walmart also noted that sales, especially in the general merchandise category, were bolstered by government stimulus spending, especially at the start of the quarter. Congress and the White House are currently at odds over a new stimulus package that’s expected to top $1 trillion, and will likely extend additional unemployment benefits.“As stimulus funds tapered off, sales started to normalize, but July comps still grew more than four percent,” the company wrote.The general merchandise category saw comp sales growth in the mid-teens. Some of the areas where shoppers spent stimulus funds include in-home, electronics, outdoor living/ lawn and garden, and sporting goods.Apparel was also “particularly strong” in the quarter across ladies, men’s, and children’s with comps posting mid-single-digit percentage growth.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach predicts that Trump will win re-electionGundlach predicts gold prices will go much higher in the long-termBuffett snapped up Barrick Gold, sold Goldman Sachs"}]}