{"article": [{"url": "https://finance.yahoo.com/news/heres-what-bill-gates-and-warren-buffett-talk-about-during-covid-19-121314292.html", "published": 1596266480.0, "headline": "Here's what Bill Gates and Warren Buffett talk about during COVID-19", "body": "Bill Gates and Warren Buffett are without a doubt the biggest buddy act in the history of American business. And the most consequential too.Just like any close pals, Buffett and Gates are always in touch—even now during the pandemic. So what do two of the richest guys on the planet talk about during this mess?I’ll get to that in a second, but first here’s some context.Buffett and Gates met 29 years ago at the behest of Bill’s formidable mother, Mary, at a gathering of friends, despite protestations from Bill. “Look, [Buffett] just buys and sells pieces of paper. That’s not real value added. I don’t think we’d have much in common,” Gates told his mother in this poignant blog post Gates wrote about their friendship. But mom convinced Gates to come over and soon enough he and Buffett started talking. “We were suddenly lost in conversation and hours and hours slipped by,” Gates recalled.And that was that. Gates and Buffett were hooked on each other, which I totally get. As someone who’s been fortunate enough to have had numerous conversations with both (many more with Buffett), speaking with either one of them is always revelatory. Yes, of course they’re not perfect, nor are they 100% right, I’m just saying that during a half hour conversation with either one, you will always learn something invaluable, and usually have a pretty good time of it too. (That levity part, btw, is something I think to a large degree has rubbed off on Bill from Warren over the years.)They are dissimilar in many ways. For one thing they’re 25 years apart; Buffett is 89 and Gates is 64. (How many close friends do you have with that age difference? ) And then Gates is a scientist and technologist, disciplines that Buffett will happily tell you he is ignorant of and/or eschews. (Buffett called Gates his “science advisor” earlier this year.) Buffett on the other hand, as Gates points out, is a numbers guy. But Buffett is also paradoxically much more the ‘people person’ of this odd couple. So you can see how their personae, skills and interests are complementary.Story continuesBerkshire Hathaway Chairman and CEO Warren Buffett, right, speaks to Microsoft co-founder and director at Berkshire Hathaway, Bill Gates, as they appear to speak on the Fox Business Network with Liz Claman, in Omaha, Neb., Monday, May 8, 2017. (AP Photo/Nati Harnik)What do they have in common? Both their fathers were highly accomplished, Buffett’s late dad was a four-term Republican congressman from Nebraska. Gates’ father, William Gates II, 94, started a prominent law firm in Seattle which was the predecessor of K&L Gates, now one of the nation’s biggest. (I remember the genuine respect that flowed between Bill and his father when I interviewed them at the Hôtel de Crillon in Paris for a story 11 years ago.)But more than that, both Buffett and Gates love to learn. And solve problems. It follows that the primary recreational diversion of their relationship is playing bridge. That along with the thousands of hours of conversation—which continues during this time of COVID-19.It’s something I asked both Buffett and Gates this week.First to Bill, what are you and Warren speaking about?Here’s what Gates told me:“Yeah, actually Warren and I are talking on a more regular basis than ever, because the policy issues, the economic issues, you know, what this means for various companies. Just talking with Warren about okay, furniture sales are actually at a record high, but railroad shipments are 20% below their peak, you know, the economic situation. Overall it's pretty tough, but it's complex to say, OK, which kind of businesses will survive? Why is the stock market at the level that it's at, why are interest rates where they are? And so I find the world fascinating, and there's a lot going on that we're trying to puzzle out, OK, you know, what can we do to help or where is this headed?”And here’s what Buffett told me about Gates:“Bill and I schedule a call for an hour every week. Usually we run a little beyond that. It’s amazing how fast our conversations go. If I were smart, I would let him do all the talking. But naturally I like to chime in about what is going on in some parts of the economy that is fascinating and unreported. So both of us have a great time whether listening or talking.”I wanted to ask Gates one more thing, which concerns a conversation I had back in March when I was interviewing Buffett in Omaha, and he told me that Gates had predicted that the summer would not necessarily cause the coronavirus to disappear, as many predicted. I asked Gates how he knew that.“Well, the U.S. opened up, while infection rates were still going up. Yes, the summer is helpful. High temperature reduces force of infection, people spend more time outdoors. As for the fall, if we didn't have these new innovations coming in, or you know more people adhering to the face mask regulation, the fall could be very tough. And part of the irony is that it's the communities that haven't had it badly, who are going to be most at risk in the fall. And you know, so we saw in the spring, a lot of cities were saying, well, we're not New York. And then even as that rate was creeping up there they opened up. So, the U.S., sadly, is not taking this seriously. The fall could be tough, mostly in new places. And then of course, we have the entire world where there's a lot of places South America is tough today, but Africa, the numbers keep going up. You know, thank goodness, that we have the innovation coming, because otherwise, the eventual damage, would go on for over five years.”Like I said, two guys worth listening to.But what’s most important to recognize is that Buffett and Gates, along with Bill’s wife Melinda, (I spoke with her in May) haven’t been content with just talking. They’ve spent countless hours figuring what they can do to actually address our nation’s, and indeed the world’s, shortcomings. And that is the consequential part of their friendship.The product of those discussions now has a multi-decade narrative arc. First, 20 years ago, Bill and Melinda coalesced their charitable endeavors into the Bill and Melinda Gates Foundation. Its primary focus has been to improve health, and fight poverty and hunger. Since then the foundation has given away more than $50 billion.That’s right $50 billion!In 2006, Buffett decided he would ultimately turn over almost the entirety of his fortune to the Gates Foundation, essentially saying: You guys are the experts, I agree with what you’re doing, let me help. And since then he’s been doing just that. Early last month for instance, Buffett donated $2.9 billion to charity, mostly to the Gates Foundation, bringing the total of his giving to $37.4 billion.Let me pause here. Thanks to the recent, renaissance run-up in Microsoft stock, Gates is now the second-richest man in the world, worth $118 billion (after his cross-Seattle rival Jeff Bezos, $181 billion.) Buffett with $73.5 billion, is tied with Gates’ friend from Harvard, former Microsoft CEO, Steve Ballmer, at No. 6.So if all Buffett and Gates did was actively and intelligently give away say $250 billion, (remember the billions they’ve already donated), that would be a truly jaw-dropping accomplishment. But these buddies wouldn’t be satisfied with ‘just’ that.Ten years ago this month, Bill and Melinda Gates and Buffett founded The Giving Pledge, a program that helps the world’s billionaires, (according to Forbes, as of March 18, 2020 there were 2,095 billionaires worldwide), promise to give away over half their money. At last count, some 204 people or couples have signed, [meaning only some 10%], with pledges totaling $1.2 trillion.Simple question: Has anyone else in modern history done anything anywhere nearly as impactful philanthropically?Simple answer: No.(I have to say, I don’t think Gates and Buffett get enough credit for this.)On August 30, Buffett will turn 90 years old. Happy birthday a few weeks early, Warren. Here’s hoping you and your buddy Bill keep talking for years to come. We’ll be on the lookout for whatever you guys have in store for us.This article was featured in a Saturday edition of the Morning Brief on August 1, 2020. Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAndy Serwer is editor-in-chief of Yahoo Finance. Follow him on Twitter: @serwer.Read the latest financial and business news from Yahoo FinanceRead moreInside Amazon, Apple, Facebook and Google versus the FedsHow to get out of the COVID-19 testing messBillions or trillions: The great coronavirus trade-offHow this week changed America foreverWhat America can learn about reopening from the state of MaineWhat will everything look like after the coronavirusHere’s how the coronavirus divides us"}]}