{"article": [{"url": "https://finance.yahoo.com/news/joe-bidens-controversial-tax-hikes-are-not-antibusiness-former-obama-economic-insider-170535783.html", "published": 1594642400.0, "headline": "Joe Biden's controversial tax hikes are not anti-business: former Obama economic insider", "body": "A corporate tax-hiking, buy America focused president Joe Biden wouldn’t necessarily crush the stock market and the bottom lines of Corporate America.At least that’s the message to investors and CEOs from University of Chicago professor and former chair of the Council of Economic Advisors under president Obama, Austan Goolsbee.“Well, I don’t think that it would mean that,” Goolsbee said on Yahoo Finance’s The First Trade on whether Biden’s economic policy proposals would mean less investment and hiring. “I think that the $2 trillion corporate tax giveaway that we had at the beginning of the Trump administration has not proven to increase investment by anything like what they said. It mostly served as just a windfall handout. And I think that if you back to a totally reasonable level of corporate tax and you couple it with direct public investments as well as incentives for companies to make new investments, you can definitely prevent any downturn in corporate investment and GDP.”Unveiled last week, the former vice president’s “Build Back Better” plan is in line with many traditional Democratic efforts around expanded social safety nets and infrastructure investments. The size of the package tallies $700 billion, and leans a bit more left than some would have thought, according to experts.The former vice president has put forth reversing half of President Trump’s signature tax cuts to help pay for the plan. He would lift the statutory tax rate to 28% from its current 21%, which Trump confidante Stephen Moore said is akin to “supreme economic masochism.” This move alone could slash north of 10% off of 2021 S&P 500 earnings estimates if enacted, various investment banks have written. Investment pros have told Yahoo Finance the hike in corporate taxes by itself could cause at least a 20% stock market correction as investors adjust their profit expectations.Former Vice President Joe Biden speaks during the U.S. Conference of Mayors Annual Winter Meeting in Washington. (AP Photo/Jose Luis Magana, File)Meanwhile, Biden has also proposed lifting capital gains taxes — which could discourage investing in the stock market.Story continues“Throughout this crisis, Donald Trump has been almost singularly focused on the stock market, the Dow and NASDAQ, not you, not your families,” Biden said during a speech outlining his economic plan. He added that it was time to end “shareholder capitalism.”Goolsbee contends Wall Street isn’t totally against Biden’s proposals.“I haven’t gotten that negative vibe from investors. The basics of the plan are about investment and rebuilding the needed infrastructure broadly that the country needs. Physical infrastructure, technological infrastructure, a bunch of things where we let it hollow out. For sure that has affected workers, but it’s not Wall Street and Main Street economy are not on different islands. Wall Street, it might be on an island, but it’s not on an island in the economic sense,” Goolsbee added.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}