{"article": [{"url": "https://finance.yahoo.com/news/public-servants-student-loan-forgiveness-program-151843090.html", "published": 1592130380.0, "headline": "'Designed to fail’: Two public servants describe the government's troubled student loan forgiveness program", "body": "Congress created the Public Service Loan Forgiveness Program (PSLF) in 2007 to help various kinds of public service workers erase their student debt after ten years of loan payments.But management of the program is widely considered to be a failure as more than 98% of applications from teachers, firefighters, police, and other public servants are rejected.Education Secretary Betsy DeVos has been sued multiple times over her department’s high denial rate, while Education Department (ED) officials contend that Congress designed the rules to be too restrictive.To better understand the PSLF process, Yahoo Finance spoke with two public servants who tried to use the PSLF program to get their student debt discharged.San Bernardino County firefighter Javier Marquez uses a water hose to douse a massive warehouse fire on 2200 block of West Lugonia Avenue in Redlands. 2200 block of West Lugonia Avenue on Friday, June 5, 2020 in Redlands, CA. (Irfan Khan / Los Angeles Times via Getty Images)‘It just seemed like it's designed to fail’One is a tale of success through sheer will, while the other is a tale of disappointment.“It was about the most confusing thing I've ever seen in my life, and I'm just being honest,” Ami Sandler, a California-based teacher, told Yahoo Finance. “It was the most tedious, most complicated thing I've ever seen.”Gloria Nolan, who works at a nonprofit in Missouri, echoed the same sentiment. “It's been a very tedious process,” she told Yahoo Finance. “But I told you I was feisty. And I continue to continue to push and continue to try to seek the necessary answers.”While both Nolan and Sandler had their original forgiveness applications rejected, Sandler ultimately ended up having $16,000 of his student loans discharged through a different public service forgiveness program after struggling with PSLF. Nolan, who still has $58,000 in student debt, is currently one of the plaintiffs in a lawsuit filed by the American Federation of Teachers (AFT).“It just seemed like it's designed to fail,” Sandler said of the PSLF program. “Honestly, it is. I feel like the system was designed to fail.”Three men look through the window of the State Capitol building as teachers from across the state of North Carolina march and protest in Raleigh the state capital on May, 16 2018. (Photo: LOGAN CYRUS/AFP via Getty Images)As of April this year, approximately 150,000 borrowers applied for PSLF, the original program. Roughly 1.7% of applications were approved. The average discharged amount was $66,000.Story continuesA big part of why so many applications were thrown out: The borrower had not made enough qualifying payments monthly — all 120 of them — or had missing information in their paperwork. Or, their loans weren’t actually eligible in the first place.When Nolan found out about the program in 2008, she said she was told by her then-loan servicer that she “shouldn’t even be having this conversation” since she had to first make 120 payments to qualify for that program. Once she completed that, she recalled, the servicer promised to set up the loans forgiveness.More context on this data– about 80% of Direct Loan borrowers applicants were not eligible for PSLF because they didn’t have a loan that entered repayment <10 years ago. These borrowers can re-apply for PSLF at a later date: https://t.co/sN15B9DcpA (1/2)— Federal Student Aid (@FAFSA) December 27, 2019Nolan began making those payments but found out after six years that she had been on the wrong payment plan and those payments wouldn’t count. She finally figured out the paperwork and worked with the servicer to enroll in the right payment plan and started all over again.Nevertheless, her application was denied. Nolan then learned about Temporary Expanded Public Service Loan Forgiveness (TEPSLF) — a congressionally-mandated expansion of PSLF that reduced some of the barriers — and applied for that.Nolan's application was denied by the TEPSLF as well. And she isn’t alone: March 2020 data from ED revealed that 29,728 requests were made for TEPSLF and around 6% of requests were approved. The average balance discharged was $42,943.Frustrated, Nolan decided to join the ATF lawsuit to compel ED to fix the system.(Graphic: David Foster)‘I felt betrayed’Sandler went through a similar process. After finding out about PSLF and believing he qualified for forgiveness on his $53,000 in student debt, he formally applied for forgiveness in 2017 after ten years of making payments.“You had to fill out paperwork to verify your employment — seemed pretty easy. You had to verify paperwork that showed that you still have loans — pretty simple,” Sandler recalled. “But then afterwards, after I had sent through the actual PSLF application for the first time, they emailed me back and said, ‘Oh, you sent us the wrong form. You’ll have to start over again.’”He had apparently sent the wrong form for workplace verification, while the correct one from the federal government’s website was “no joke... 95% identical.”“It was about one sentence difference — about 10 words — in the new form,” Sandler said.When he finally filed his application, he continued, ED rejected it because he was technically on the wrong payment plan for more than a decade.“I felt betrayed,” Sandler said. “I thought, wow, that's the stupidest thing I've ever heard.”Occupy Wall Street demonstrators protest against the rising national student debt in Union Square, in New York, April 25, 2012. (Photo: REUTERS/Andrew Burton)Sandler eventually found out about TEPSLF and applied for that since it only required 10 years of payments on any payment plan and 10 years of service.So, he switched to another income-contingent payment plan and made a few more — and bigger — monthly payments (about $500 more) for 12 months and eventually saw his loans erased.“All of your federal student loans serviced by FedLoan Servicing have been forgiven under the TEPSLF opportunity,” the email from FedLoan stated. “You no longer have a remaining balance with FedLoan Servicing.”When he read the email, “I felt like I just lost 30 pounds, easy,” Sandler said. “It was just crazy and it felt so good .... it was $16,000.”He stressed that the fine print was worth reading if people really wanted to get their applications approved.“That's probably why 99% of people that are getting denied, because they don't know that they have to switch to an income-based plan because it's probably like the smallest font on the website about what you need to do,” Sandler said.‘If the government wanted to help teachers...’In early 2020, amid lawsuits against the department and lawmakers decrying that 99% rejection rate, Education Secretary Betsy DeVos agreed to simplify part of the paperwork process.At last! @usedgov announces a streamlined Public Service Loan Forgiveness & TEPSLF certification AND application form, combining many separate steps into one, as @SenateDems have requested for years. #PSLF https://t.co/Vo4Vluh4Ey pic.twitter.com/82VTjgpAcZ— Bryce McKibben (@bmckib) January 30, 2020Before that announcement, the Trump administration had been headed the opposite direction: In his FY21 budget proposal, he stated his intention to sunset the PSLF program to save an estimated $1.9 billion over the course of the year.In May, Democratic senators introduced a bill to amend the Higher Education Act and revamp the PSLF program to ease some of the convoluted rules that ED claimed was the cause of the high rejection rate.The legislation offers a tiered forgiveness program. So instead of making 120 payments over 10 years, borrowers would get 15% of their balance forgiven after 2 years, another 15% of the balance after 4 years, and the entire balance after 10 years.For public servants making untold sacrifices, what better way to say thanks than expanding opportunities to alleviate the weight of student debt. They’ve earned every dime they would get from the Strengthening Loan Forgiveness for Public Servants During the COVID-19 Crisis Act. pic.twitter.com/LlGwpQnCw1— Richard Blumenthal (@SenBlumenthal) May 21, 2020In June, California Attorney General Xavier Becerra filed a lawsuit targeting the TEPSLF program, calling it “virtually inaccessible” with a “convoluted application process” for borrowers.“There was nothing ever that was shared with me, as a borrower,” Sandler lamented. “If the government wanted to help teachers, you would've thought they would've sent something out to every educator that has a loan and said: ‘Here's something you may want to think about. Here's something you could possibly qualify for 10 years from now.’ And I would have done that 100%. I would have done that back then.”—Aarthi Swaminathan and Reggie Wade are reporters for Yahoo Finance.Aarthi can be reached at aarthi@yahoofinance.com and rwade@verizonmedia.com. Follow them on Twitter at @aarthiswami and @ReggieWade.Read more: ‘I was misled’: Public school teacher tells Congress about student debt nightmareU.S. teachers increasingly struggle to find affordable housing: StudyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}