{"article": [{"url": "https://finance.yahoo.com/news/why-netflix-shares-down-10-205232967.html", "published": 1594915220.0, "headline": "Why Netflix shares are down 10%", "body": "Today after the bell, Netflix reported its Q2 financial performance. After its second-quarter numbers were out, the popular video streaming service saw its value drop sharply, with its shares off 10% in after-hours trading as of the time of writing.What happened to the high-flying Netflix, a company that you might have expected to report growth bolstered by the fact that many consumers in its home market are confined to their homes? The company not only failed to produce Q2 numbers that investors were uniformly excited about, but also managed to forecast weaker performance than anticipated.Perhaps either would have been acceptable, but not both. Here's what Netflix told us:Netflix's results: $6.15 billion in Q2 revenue generated operating income of $1.36 billion and net income of $720 million. In per-share terms, the company earned $1.59 in the three-month period.Investors had expected $6.08 billion in revenue and earnings per share of $1.81, according to Yahoo Finance analyst averages. So, Netflix did manage a slim beat on revenue, but missed sharply in profit-terms.The company also beat expectations in terms of net customer adds, with CNBC reporting that Netflix's 10.09 million new subscribers bested estimates of 8.26 million.Ted Sarandos named co-CEO at NetflixNot the worst results, right? To fully understand the company's share price correction, then, we'll have to look ahead to what Netflix said about Q3:Netflix's forecasts: $6.33 billion in revenue leading to operating income of $1.25 billion and net income of $954 million. In per-share terms, the company expects to earn $2.09 in revenue.The company also expects to add 2.5 million net new subscribers in Q3. As the market had expected the company to generate $6.39 billion in third-quarter revenue and $2.00 in per-share profit, we again have a slightly mixed picture. But the modest net subscriber adds tied to Netflix's slower-than-anticipated revenue growth appear to have spooked the street.And with fear in the air that Netflix's growth could fall under expectations, down went its share price. Perhaps the company is being conservative with its net subscriber add forecast, but investors didn't seem to want to give it the benefit of the doubt.More as earnings season gathers steam."}]}