{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-6-2020-222350182.html", "published": 1594048400.0, "headline": "Stock market news live updates: Stocks jump, Nasdaq powers to record high as investors look past virus concerns", "body": "Stocks rose sharply Monday morning, after new economic data showed a much stronger than expected rebound in US service sector activity in June. The upbeat data helped investors shake off fears over rising coronavirus cases, with infections continuing to march higher globally and domestically.[Click here to read what’s moving markets heading into Tuesday, July 7] The three major indices also followed global equities higher, with stocks in Europe and Asia gaining after an editorial in China’s state-run media outlet the Securities Journal suggested the country prioritize fostering a “healthy” bull market after the pandemic. The Shanghai Composite index closed nearly 6% higher for its biggest gain in five years.Developments in the crisis continued to march from bad to worse over the long holiday weekend. New COVID-19 cases in some of the new hot spots in the South and West rose by records — including in current epicenters Florida and Texas on Saturday. The World Health Organization said a record 212,326 coronavirus diagnoses were confirmed globally in 24 hours as of Saturday, with the United States, Brazil and India showing the largest increases.The Lone Star State reported 3,449 new cases of COVID-19 as of Sunday for a 1.8% rise over the prior day — bringing the total number of infections so far in the state to 195,239. Arizona’s one-day case increase of 3,536, or 3.7% over the prior day, was slightly below the state’s two-week average growth of 4.1%. Florida on Monday reported a one-day increase of 3.2%, coming in below the seven-day average of 5.1%.Elsewhere, New York City entered Phase 3 of its reopening process on Monday, bringing with it the reopening of spa, tanning and nail salons, massage parlors, tattoo parlors and some youth sports. The city, however, pulled plans last week to reopen indoor dining as part of Phase 3.The recent resurgences in coronavirus cases in some parts of the country led economists at Goldman Sachs to lower their expectations for U.S. gross domestic product (GDP) growth this year. This comes despite new economic data, including the June jobs report, come in well above expectations.Story continues“A combination of tighter state restrictions and voluntary social distancing is already having a noticeable impact on economic activity,” Goldman Sachs economist led by Jan Hatzius said in a note Sunday.“States with the most severe deterioration in the COVID situation saw declines in consumer and workplace activity at the end of June that will likely continue into July, and activity flattened in other states.”With the expected third quarter rebound now restrained by the surge in new cases, some of the pent-up demand will set the economy up for a stronger 2021, Hatzius estimated. On a full-year basis, our forecast now implies -4.6% GDP growth in 2020 (vs. -4.2% before) and +5.8% growth in 2021 (vs. +5.8%).”Facing a potential protracted slump in the economy, government officials have taken steps to expand stimulus efforts to support individuals and businesses.President Donald Trump on Saturday signed into law an extension for applications into the Paycheck Protection Program (PPP), a key component of the virus-related fiscal stimulus intended to help small businesses receive subsidies for costs including payrolls. The legislation extended the June 30 deadline to apply for the program to August 8.On Thursday, Treasury Secretary Steven Mnuchin told reporters at the White House that the Trump administration was “going to seriously consider” another round of direct checks to taxpayers, following the $1,200 checks sent to Americans under a certain income threshold that had been approved in March.—4:02 p.m. ET: Nasdaq powers to a record high, Amazon shares close above $3,000 for the first timeHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +49.70 (+1.59%) to 3,179.71Dow (^DJI): +459.67 (+1.78%) to 26,287.03Nasdaq (^IXIC): +226.02 (+2.21%) to 10,433.65Crude (CL=F): -$0.07 (-0.17%) to $40.58 a barrelGold (GC=F): +$5.40 (+0.30%) to $1,795.40 per ounce10-year Treasury (^TNX): +1.5 bps to yield 0.6840%—1:07 p.m. ET: Blackrock downgrades US equities to neutral, citing surge of infections, and ‘risks of fading fiscal stimulus’Blackrock equity strategists on Monday downgraded US stocks to neutral from overweight, saying that “risks of fading fiscal stimulus and an extended epidemic are threatening to derail the market’s strong run.”US equities have so far climbed 40% since hitting a low on March 23, outperforming against the MSCI ACWI ex-US index’s about 34% rise over the same period.“The outperformance of US stocks in recent months has largely been supported by the historic policy response. The U.S. has so far delivered coordinated fiscal and monetary support sufficient to offset the estimated initial shock from the pandemic and spillovers to the full economy,” the strategists said in the note.“Yet the resurgence of the virus is taking place just as Congress and the White House face a critical decision over whether to extend a number of crisis measures, including additional federal unemployment benefits set to expire at the end of July,” the added.A premature reduction in stimulus in July “would increase the risk of financial vulnerabilities among businesses and households facing cashflow stresses,” they added. “The risk of retrenching fiscal policy too soon in the U.S. comes as the euro area has been galvanizing its policy response to the coronavirus shock.”The analysts noted that the high concentration of “quality companies” in technology and communication services has kept them at neutral, rather than negative, on the outlook for US equities as a whole. These sectors are likely to benefit from “structural trends accelerated by the pandemic,” they said.—10:51 a.m. ET: Amazon shares jump 3.8% to cross $3,000 per share for the first timeAmazon rallied Monday morning to hit a fresh intraday record high at more than $3,000 per share as of 10:51 a.m. ET. The e-commerce giant has widely been viewed as a beneficiary of broad-based social distancing measures, with customers turning in droves to the platform for home goods, personal protective equipment and grocery delivery.Shares of Amazon have risen 62% for the year to date, far outperforming against the S&P 500’s 1.8% decline.—10:01 a.m. ET: ISM non-manufacturing index rose by a record in JuneThe Institute for Supply Management’s monthly index on US non-manufacturing industry activity broke into expansionary territory for the first time since March, indicating a faster than expected service-sector rebound as social distancing measures eased.The non-manufacturing purchasing managers’ index (PMI) rose to 57.1 in June from 45.4 in May, marking a record increase based on data going back to 1997. The level was the highest in four months.Readings above the neutral level of 50 indicate expansion. Consensus economists had expected the non-manufacturing PMI to tick just above neutral to 50.2.—9:46 a.m. ET: US service sector activity held in contractionary territory in June, but improved from April lows: IHS MarkitActivity in the US services sector contracted for a fifth straight month in June, but registered at the highest level since February as businesses began to reopen.IHS Markit’s final June print for the US services purchasing managers’ index (PMI) was upwardly revised to 47.9 in June from the 46.7 previously reported. Readings below the neutral level of 50 indicate contraction.“June saw a record surge in the PMI’s main gauge of business activity in the US as increasing numbers of companies returned to work and expanded their operations amid the reopening of the economy,” Chris Williamson, chief business economist at IHS Markit, said in a statement.“The survey points to a strong initial rebound from the low point seen at the height of the pandemic lockdown in April, with indicators of output, demand, exports and employment all showing steep gains,” he added. “Financial services and technology companies are now reporting improved demand, as are many consumer-facing companies. Many, however, remain constrained by social distancing measures.”—9:41 a.m. ET: Nasdaq Composite, Nasdaq 100 hit record highs as tech-led rally continuesThe Nasdaq Composite and Nasdaq 100 each hit record intraday highs shortly after market open Monday as shares of tech companies outperformed.Microsoft, Tesla, Zoom Video Communications, Nvidia and Adobe each rose to record intraday highs Monday morning,—9:34 a.m. ET: Stocks open sharply higher, adding to last week’s gainsHere were the main moves in markets, as of 9:34 a.m. ET:S&P 500 (^GSPC): +42.83 points (+1.35%) to 3,172.36Dow (^DJI): +343.02 points (+1.33%) to 26,170.38Nasdaq (^IXIC): +154.93 points (+1.52%) to 10,362.56Crude (CL=F): -$0.39 (-0.96%) to $40.26 a barrelGold (GC=F): +$6.10 (+0.34%) to $1,796.10 per ounce10-year Treasury (^TNX): +2.6 bps to yield 0.697%—8:00 a.m. ET: Uber to acquire food delivery company Postmates, after failed talks to purchase GrubHubUber on Monday said it was set to acquire food delivery company Postmates in a $2.65 billion all-stock transaction. The announcement confirmed multiple media reports of the deal from over the weekend, and came following Uber’s failed talks to purchase GrubHub last month. GrubHub was instead acquired by European food giant Just Eat Takeaway.“Uber and Postmates have long shared a belief that platforms like ours can power much more than just food delivery—they can be a hugely important part of local commerce and communities, all the more important during crises like COVID-19,” Uber CEO Dara Khosrowshahi said in a statement.“As more people and more restaurants have come to use our services, Q2 bookings on Uber Eats are up more than 100% year on year,” he added. “We’re thrilled to welcome Postmates to the Uber family as we innovate together to deliver better experiences for consumers, delivery people, and merchants across the country.”—7:17 a.m. ET Monday: Stock futures extend gainsHere were the main moves in markets, as of 7:17 a.m. ET:S&P 500 futures (ES=F): 3,162.75, up 33.75 points or 1.08%Dow futures (YM=F): 26,097.00, up 338 points, or 1.31%Nasdaq futures (NQ=F): 10,473.75, up 118.00 points, or 1.14%Crude (CL=F): -$0.01 (-0.02%) to $40.64 a barrelGold (GC=F): -$4.10 (-0.23%) to $1,785.90 per ounce10-year Treasury (^TNX): +1.8 bps to yield 0.689%—6:12 p.m. ET Sunday: Stock futures open slightly higherHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:12 p.m. ET:S&P 500 futures (ES=F): 3,129.5, up 0.5 points or 0.02%Dow futures (YM=F): 25,766.00, up 7 points, or 0.03%Nasdaq futures (NQ=F): 10,378.00, up 22.25 points, or 0.21%NEW YORK, NEW YORK - MAY 26: A trader walks by the New York Stock Exchange (NYSE) on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}