{"article": [{"url": "https://finance.yahoo.com/news/microsoft-project-xcloud-game-pass-ultimate-130051827.html", "published": 1596528500.0, "headline": "Microsoft's Xbox Game Pass Ultimate gets Project xCloud cloud gaming on Sept. 15 at no additional cost", "body": "IMAGE DISTRIBUTED FOR XBOX - Gamers will get hands on with Project xCloud at the Xbox E3 Showcase in the Microsoft Theater at L.A. Live, Sunday, June 9, 2019 in Los Angeles. (Photo by Casey Rodgers/Invision for Xbox/AP Images)The still-nascent era of cloud gaming is set to kick into high gear on Sept. 15 when Microsoft (MSFT) officially launches its new Xbox Game Pass Ultimate service complete with the tech giant’s Project xCloud cloud gaming platform.The combined service, which will be available for $14.99 per month, will give gamers the ability to play Microsoft’s library of more than 100 Game Pass titles via their Android (GOOG, GOOGL) smartphones and tablets. There’s no word yet on when versions of the service will be available for Apple’s (AAPL) iOS.It’s a new frontier for Microsoft, which has been running a public beta test of Project xCloud since October 2019. Cloud gaming promises to give gamers the ability to play their favorite console or PC games on virtually any device via an internet connection.The service will be available in 22 markets, including the U.S. and Canada, and include access to users’ Xbox gaming profile from whatever they game, meaning your friends’ list, achievements, and controller settings will carry over with ease.As part of the announcement, Microsoft is also unveiling partnerships with Razer, PowerA, 8BitDo, and NACON through which the companies will build out Xbox-style controllers and holders for smartphones.Microsoft’s hope for the cloud gaming aspect of the service, which the company still considers beta, is that it will help the firm reach gamers outside of traditional console and PC circles. Microsoft says there are currently 2 billion gamers in the world. But reaching populations without the means to access a console or gaming PC is difficult for gaming companies.Cloud gaming, however, offers the promise of gaming on a smartphone or tablet. And considering that many consumers in developing countries use their smartphones as their primary means of connecting to the web, cloud computing could be the means to getting them into gaming.But cloud gaming has had a rocky start. Services like Google’s Stadia and Nvidia’s Geforce Now have had issues getting some publishers to give them access to their titles. Cloud gaming also requires users to have a rock-solid internet connection to avoid issues like slowdown and lag, which can ruin the entire playing experience.Story continuesMicrosoft, however, says that it will provide titles from its first-party game studios the same day they’re released on consoles, and that it will only require a 10-megabit-per-second internet connection for quality performance. Video streaming services like Netflix require 5Mbps speeds to stream HD video but 25Mbps to stream 4K content.Microsoft has the benefit of its global Azure cloud platform to ensure that users are never too far from a cloud computing facility, meaning games should theoretically run without issue as long as users meet that 10Mbps threshold.We’ll have to see for certain when the service goes live next month.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Microsoft and TikTok need each otherDocuments reveal the behind-the-scenes battle between Apple and Spotify that lead to an antitrust investigationApple confirms next iPhone will be delayed “a few weeks”Amazon, Apple, Facebook, and Google CEOs push America-first narrative in effort to avoid antitrust scrutinyFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}