{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-cases-dip-vaccines-take-center-stage-in-congress-165535581.html", "published": 1595333000.0, "headline": "Coronavirus update: US cases dip; vaccines take center stage in Congress as Trump re-starts briefings", "body": "The U.S. saw a reprieve in its seemingly relentless wave of COVID-19 diagnoses, with new cases showing signs of slowing down when compared to the surges in previous weeks, just as President Donald Trump prepared to revive regular coronavirus press conferences on Tuesday.On Monday, the daily count was about 62,000 new cases, down from last week’s record surge of nearly 75,000 cases on July 17. The slowdown was led by modest declines in the rates of new cases in several hard-hit Sun Belt states.However, with the global case count closing in on 15 million and more than 640,000 dead, the U.S. remains a worldwide epicenter. Close to 4 million have been infected domestically, and nearly 141,000 have lost their lives.Tuesday marks the first day that Trump is set to address the nation once again on the status of the U.S. coronavirus response. The president stopped regular briefings in April, not long after an embarrassing moment in which he suggested that ingesting disinfectants could help treat the virus.Meanwhile, as companies push to develop effective coronavirus vaccines at lightning speed, Congress expressed some unease over the unprecedented speed at which the development timetable is unfolding, with the U.S. House Energy and Commerce Committee grilling executives at a hearing on Tuesday.Experts believe a vaccine is likely to be available by the end of 2020 or in early 2021, while several pharmaceutical firms are already ramping up production at-risk on millions of doses.“Never in the history of humankind have we been tasked with finding an affordable vaccine for everyone. We can't even fully immunize the worlds birth cohort against vaccine-preventable childhood diseases, despite decades of effort,” said Dr. Julie Gerberding, Merck’s (MRK) executive vice president and chief patient officerOther witnesses included representatives of AstraZeneca (AZN), Moderna (MRNA), Pfizer (PFE) and Johnson & Johnson(JNJ). Those names are the furthest along in the effort, as well as some of the largest players in the vaccine race.Story continuesChris Meekins, a Raymond James analyst, told Yahoo Finance there are a number of “fireworks” that could occur regarding safety and efficacy, as well as concerns over vaccine nationalism that may complicate the distribution of a cure.“You really have an unprecedented level of commitment form private industry, as well as from the government, and unlike some of the mistakes with testing where they didn’t have the swabs, the government is actually making sure they have all the supplies they need,” Meekins said.Masking policyOnly five states are seeing at least a 10% decline in cases. (Graphic: David Foster/Yahoo Finance)Masks have become a key focus of the administration after months of avoiding taking a public stance on the issue. On Monday, Trump tweeted a photo of himself wearing one — a seeming endorsement of something he’d previously rejected, despite the growing consensus that masking is essential.Trump shocked the nation when he was seen wearing a mask during a visit to the Walter Reed medical hospital last week.U.S. Surgeon General Jerome Adams also advocated for mask-wearing. Contrary to the criticisms that it strips away civil liberties of American citizens, he said it will help making free movement more possible later this year.“(Masks) enable freedom and enable more choices, because we know that if we can get 90% of people to wear face coverings and get people to practice at least six feet of social distancing from their neighbors and practice good hand hygiene, that we can reopen and then we can stay open, we can get back to schools to worship college football in the fall,” Adams told Yahoo Finance.But the federal government is stopping short of a federal mandate, something economists at Goldman Sachs recently recommended as a way to keep the economic recovery going while preventing more spreading.However, efforts have been hampered by the U.S.’s much-criticized patchwork response. Adams said a federal policy would be impractical to enforce, but supports state-level mandates.“I'm not opposed to mandates at the state and local level. We actually support local control and state control,” Adams said.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}