{"article": [{"url": "https://finance.yahoo.com/news/home-depot-beats-quarterly-same-100655479.html", "published": 1597727660.0, "headline": "Home Depot posts record sales as demand for DIY products surges", "body": "By Uday Sampath Kumar(Reuters) - Home Depot Inc <HD.N> reported its biggest rise in quarterly same-store sales in at least two decades on Tuesday as demand for paint, tools and lawn mowers surged from consumers stuck at home due to the COVID-19 pandemic.The company's same-store sales jumped 23.4% in the second quarter, surging past analysts' average estimate of a 10.5% rise, as the home improvement chain emerged as one of the corporate winners during the pandemic.Shares of Home Depot, however, fell about 1% in morning trading after analysts cautioned that its sales might have hit their peak.\"These are record comparable sales - it's really tough to sustain that,\" Wedbush Securities analyst Seth Basham said. \"We will see a slowdown in the back half of the year - the question is the degree to which the slowdown occurs.\"The company said it could not determine whether strong demand from earlier months would continue for the rest of the year, despite the U.S. housing market performing better than the broader economy.People spending more time on do-it-yourself home projects such as painting and gardening pushed Home Depot's overall sales up 23.4% to a record $38.05 billion in the quarter ended Aug. 2.That resulted in the company's highest ever profit sharing payout to its hourly employees.The company spent about $480 million in additional benefits, including weekly bonuses and overtime, to compensate workers required to work in stores and warehouses amid the health crisis.Still, net income rose 24.5% to $4.33 billion, or $4.02 per share. Analysts had expected a profit of $3.71 per share, according to IBES data from Refinitiv. [nCNWz4C6ya]Shares of smaller rival Lowe's Cos Inc <LOW.N>, which reports second-quarter results on Wednesday, were down marginally.Interactive graphic on same-stores sales https://graphics.reuters.com/HOMEIMPROVEMENT-RESULTS/xegvbazrdpq/index.html(Reporting by Uday Sampath in Bengaluru; Editing by Arun Koyyur and Anil D'Silva)"}]}