{"article": [{"url": "https://finance.yahoo.com/news/why-its-hard-to-bet-against-nbc-peacock-in-streaming-wars-analyst-143504776.html", "published": 1594892600.0, "headline": "Why it's 'hard to bet against' NBC's Peacock in streaming wars: Analyst", "body": "NBC launched its new Peacock streaming service on July 15 into the very crowded field of television streaming services. Peacock has a totally free tier with access to most of the content, with ads; or you can pay $5 per month for access to the full catalog, with ads, or $10 per month for no ads. The app is not available on Roku or Amazon Fire TV at launch; HBO Max couldn’t come to terms with those two services either.When Peacock was first announced, there were some groans here and there on social media—yet another streaming service to pay for? In the past nine months alone, we’ve seen the launch of Apple TV+, Disney+, Quibi, HBO Max, and now Peacock.But NBC has enough hit shows in its library, old and newer, to make Peacock a must-have for a lot of people, including “Cheers,” “Frasier,” “30 Rock,” “Parks and Recreation,” “Friday Night Lights,” “Parenthood,” “SNL,” and the “Law & Order” franchise.“They’ve shown to be very effective at building brands,” says Greg Portell, consumer analyst at Kearney. “Whether you talk about a ‘Law & Order,’ or ‘Friends,’ or Peacock, they have the talent to really make this work, and they’re in it for the long game because of the financing backing from Comcast. So it would be hard to bet against Peacock as a long-term player in the space.”It’s a big advantage for Peacock, and will likely stoke downloads, that so much of the content is available for free, if viewers are willing to sit through the ads.Two huge NBC shows are missing from Peacock: “Friends” will not come to Peacock, after WarnerMedia paid $425 million to put the show on HBO Max; and “The Office” won’t hit Peacock until January, but in the meantime Peacock has an “Office Shorts” channel that shows clips from “The Office” 24/7.Those are all well-known core NBC shows, which is not to mention non-NBC shows on Peacock, like “Downton Abbey” (NBCUniversal owns Carnival, the British studio behind the show) and “Yellowstone” (Comcast cut a licensing deal with Viacom for the Paramount show). Then there’s a slew of new original shows and movies that are part of the premium tier, including “Brave New World” and reboots of “Battlestar Galactica” and “Saved By The Bell.”Story continues\"Peacock Investor Day\" at 30 Rockefeller Center in New York, NY on January 16, 2020 -- Pictured: Bonnie Hammer, Chairman, NBCUniversal Content Studios (Photo by: Peter Kramer/Peacock/NBCU Photo Bank via Getty Images)Of course, shooting for much of the planned new original content has been delayed due to the pandemic. Peacock had “an ambitious content schedule that was going to try and create a lot of that must-see, unique, Peacock-only type of viewing,” Portell says, and COVID-19 got in the way.The biggest pandemic hit to Peacock was the delay of the Tokyo Olympics a full year. Live Olympics coverage was originally set to be the tentpole that set Peacock apart. Once the Olympics got delayed, some wondered if Peacock ought to delay its launch.Portell says Peacock couldn’t have afforded to do that. “At this point the market is a mature marketplace, and waiting a year to come out would have been a bit of a disadvantage. The upside of Covid for Peacock is that because sports is delayed, it does give them a little bit of a lower expectation coming out of the gate, so they can get some of their subscriber acquisition strategies, some of their pricing and bundle strategies, tried out and tested before they have to really make a splash with the Olympics.”—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers streaming media. Follow him on Twitter at @readDanwrite.Coronavirus is forcing Quibi, NBC Peacock to change their plans at launchCoronavirus puts 'extreme pressure' on all three pillars of Disney's business'Trolls World Tour' rental success does not spell death for movie theatersBethenny Frankel predicts coronavirus will level the Hollywood playing fieldDisney+ streaming during coronavirus is boosting Hasbro’s Baby Yoda toy salesMovie theaters seek bailout as coronavirus devastates business"}]}