{"article": [{"url": "https://finance.yahoo.com/news/sp-corelogic-case-shiller-home-prices-growth-in-us-surprisingly-stable-amid-the-coronavirus-pandemic-130006063.html", "published": 1593504500.0, "headline": "Home price growth in US surprisingly stable amid the coronavirus pandemic", "body": "Home price growth in the U.S. ticked up even amid the coronavirus pandemic.Standard & Poor’s said Tuesday that its S&P CoreLogic Case-Shiller national home price index posted a 4.7% annual gain in April, up from 4.6% the previous month — beating estimates of 4.5% according to Bloomberg. The 20-City Composite posted a 4% annual gain, up from 3.9% in March, also beating Bloomberg estimates of 3.8%. As in March, the 20-City Composite just represented 19 cities because transaction records for Wayne County, Mich. were unavailable.“The price trend that was in place pre-pandemic seems so far to be undisturbed, at least at the national level,” said Craig J. Lazzara, managing director and global head of index investment strategy at S&P Dow Jones Indices, in a press statement. \"April’s housing price data continue to be remarkably stable. April’s year-over-year gains were ahead of March’s, continuing a trend of gently accelerating home prices that began last fall. Results in April continued to be broad-based.”FILE - In this Sept. 25, 2019, file photo a sign indicating a new selling price for a house sits atop a realtor's sign in Jackson, Miss. On Tuesday, Nov. 26, the Standard & Poor's/Case-Shiller 20-city home price index for September is released. (AP Photo/Rogelio V. Solis, File)Phoenix for the eleventh straight month led the 20-City Composite, posting an 8.8% annual gain in April, Seattle and Minneapolis followed posting a 7.3% and 6.4% gain, respectively.“Even amid millions of lost jobs, health-related fears and an incredibly uncertain economic outlook, historically low mortgage rates in April helped to buoy the strong buyer demand that had been building in the months preceding the pandemic, fueling competition for the relatively few for-sale homes on the market and driving up prices as a result,” said Zillow economist Matthew Speakman, in a press statement. “That heightened demand hasn’t wavered in the months since, as inventory continues to fall, mortgage rates keep finding new lows and measures of buyer activity have picked up markedly.”The price results, while lagging other housing data, come as other data reveal a promising outlook for the housing market. While existing home sales for May fell (for the third consecutive month) as expected given the coronavirus lockdowns, pending home sales in May rebounded sharply, increasing 44.3% from a month earlier — the largest one-month increase ever recorded by the National Association of Realtors.Story continuesPending home sales unlike existing sales are a leading indicator of the health of the housing market and along with other data, new home sales and construction activity, released earlier this month reveal the market is in recovery mode. New home sales rose 16.6% in May to an annualized pace of 676,000 units, beating analysts’ expectations of 640,000. There are also signs that the luxury housing market is on the mend after coronavirus lockdowns basically halted all activity in May.“This has been a spectacular recovery for contract signings, and goes to show the resiliency of American consumers and their evergreen desire for homeownership,” said Lawrence Yun, NAR’s chief economist, in a press statement. “This bounce back also speaks to how the housing sector could lead the way for a broader economic recovery.”Amanda Fung is an editor at Yahoo Finance.Read more:Luxury real estate may be back as the housing market recovers but bewareHome price growth accelerated at the start of 2020 before coronavirus slammed the USEconomist on housing: 'You can't buy what's not for sale'The hottest housing market of 2019Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}