{"article": [{"url": "https://finance.yahoo.com/news/u-justice-department-propose-rolling-140228925.html", "published": 1592385020.0, "headline": "Trump administration proposes rolling back protections for big tech", "body": "By Diane Bartz and Alexandra AlperWASHINGTON (Reuters) - The U.S. Justice Department proposed on Wednesday that Congress take up legislation to curb protections big tech platforms like Alphabet's Google and Facebook have had for decades, a senior official said, following through on President Donald Trump's bid to crack down on tech giants.The goal of the proposal, which is being finalized, is to push tech companies to address criminal content on their platforms such as child exploitation, terrorism or cyber stalking, and boost transparency for users when the outlets take down lawful material, the Justice Department official said, speaking on condition of anonymity.For the proposal to become law, U.S. lawmakers would need to submit an approve a bill.\"These reforms are targeted at platforms to make certain they are appropriately addressing illegal and exploitive content while continuing to preserve a vibrant, open and competitive internet,\" Attorney General William Barr said in a statement.The president, who has battled Twitter and other tech companies over alleged censorship of conservative voices on social media platforms, said in late May he would propose legislation to potentially scrap or weaken the law shielding internet companies, in an extraordinary attempt to regulate outlets where he has been criticized.Trump said he sought to \"remove or change\" Section 230 of the 1996 Communications Decency Act, which generally exempts platforms from responsibility for what their users post and allows them to moderate the content of their sites as they wish.The Justice Department proposal would seek to push platforms to \"address\" illicit content online, such as material that violates federal criminal law, the department said. It would also seek to require the companies to be upfront about content moderation decisions and prevent the big online platforms from invoking Section 230 in antitrust cases.Story continuesFacebook policy chief Nick Clegg told reporters that Section 230 enables the company to remove hate speech and that big changes would, \"in the end, mean less speech of all kinds appearing online.\"The White House, for its part, welcomed news of the Justice Department proposal. \"The president expressly called on DOJ to develop such model legislation in the Executive Order signed recently, and yes, President Trump is pleased to see the department following through,\" said White House spokesman Judd Deere.Trump has attacked Twitter for tagging his tweets about unsubstantiated claims of fraud about mail-in voting with a warning prompting readers to fact-check the posts.Google and Twitter did not comment.Carl Szabo, general counsel of NetChoice, a trade association which counts Google and Facebook among its members, said the proposal would create so many obstacles to removing content that the U.S. House of Representatives would not consider it.Also on Wednesday, Senator Josh Hawley joined with three other Republicans to introduce a bill that would allow people to sue tech companies if they feel that their speech was censored.In a letter to Google CEO Sundar Pichai, Hawley referenced a dispute with the conservative website The Federalist, saying that Google's threat to demonetize the site because of comments made about Black Lives Matter protests was \"profoundly disingenuous.\" Hawley said Google sought to hold The Federalist responsible for its readers' comments even though Google's YouTube is not held responsible for comments because of Section 230.\"In short, Google demands minimum oversight for itself, but maximum power over those who use its platform,\" Hawley wrote.(Reporting by Diane Bartz and Alexandra Alper; Additional reporting by Katie Paul; Editing by Jonathan Oatis, Andrea Ricci and Leslie Adler)"}]}