{"article": [{"url": "https://finance.yahoo.com/news/facebook-says-apple-mobile-software-190943865.html", "published": 1598469560.0, "headline": "Facebook says Apple mobile software will cut ad revenue", "body": "Facebook on Wednesday said a mobile software update about to be released by Apple will slash revenue for developers relying on its in-app ad network.Changes coming to iOS software powering iPhones and iPads includes requiring apps to ask permission of users to collect and share device-identifying data.\"With iOS 14, iPadOS 14, and tvOS 14, you will need to receive the user's permission through the AppTrackingTransparency framework to track them or access their device's advertising identifier,\" Apple said in an online post aimed at developers.\"Tracking refers to the act of linking user or device data collected from your app with user or device data collected from other companies' apps, websites, or offline properties for targeted advertising or advertising measurement purposes.\"Such data is relied on for targeting ads in ways that make them more relevant and likely to make money, according to Facebook.Apple is expected to release the new iOs mobile operating system later this year.But tests found that revenue from the Audience Network platform that lets Facebook's system work behind the scenes to target ads in apps fell by more than half when personalization was thwarted, an online post explained.\"In reality, the impact to Audience Network on iOS 14 may be much more, so we are working on short-and long-term strategies to support publishers through these changes,\" Facebook said in the post.\"Ultimately, despite our best efforts, Apple's updates may render Audience Network so ineffective on iOS 14 that it may not make sense to offer it on iOS 14.\"Facebook won't collect the ad targeting data on its apps tailored for Apple mobile devices, but didn't expect its own advertising revenue to take a big hit, according to the post.\"We understand that iOS 14 will hurt many of our developers and publishers at an already difficult time for businesses,\" Facebook said.Story continues\"This is not a change we want to make, but unfortunately Apple's updates to iOS14 have forced this decision.\"The internet firm's system will still be able to target ads in apps made for Android-powered smartphones or tablets, Facebook said.Apple, which does not rely on digital ad revenue, has been working to limit tracking of online activity and has stressed user privacy as a priority.gc/st"}]}