{"article": [{"url": "https://finance.yahoo.com/news/fed-powell-warns-of-economic-fallout-from-second-outbreak-195656283.html", "published": 1593529460.0, "headline": "Fed Chair Powell warns of economic fallout from a 'second outbreak'", "body": "Federal Reserve Chairman Jerome Powell expressed worry that the U.S. economy is not out of the woods yet, telling Congress Tuesday that failure to properly contain the spread of COVID-19 will set back the recovery.“A second outbreak could force government and force people to withdraw again from economic activity,” Powell said in testimony to the House Financial Services Committee alongside Treasury Secretary Steven Mnuchin.Powell added that a resurgence of cases could undermine confidence in the recovery, which he said was critical to driving consumption and normal economic activity.In the meantime, Powell committed to keeping interest rates low and providing its various liquidity facilities to ensure financial markets are operating properly.“When the economy reopens - remember, we sort of deliberately closed the economy - that expansion can be vigorous and strong, and it’s just beginning now,” Powell said. Powell pointed to the May jobs report surprise as a function of the Fed’s accommodative policies.Powell’s testimony was his first since officially firing up all 11 of its liquidity facilities, touching markets ranging from U.S. dollars to risky corporate debt. The last of its facilities, a program to purchase bonds directly from the corporate issuers themselves, officially opened up for business on Monday.Lawmakers on Tuesday were particularly interested in the Main Street Lending Program, which hopes to offer loans to businesses with less than 15,000 employees, only recently opened up for lender registration. Powell said about 300 lenders had so far registered, a small number when considering there are over 5,000 banks and savings institutions in the U.S.Asked if the Fed could further expand the scope of the facility, Powell said he could see the Fed “down the road looking at a lower threshold” for the program’s minimum loan size, which is currently $250,000. Powell and Mnuchin also said it was evaluating offering an asset-based test for program eligibility, acknowledging that the existing EBITDA test may not be appropriate for some types of borrowers.Story continuesThe announcement effectFederal Reserve Chair Jerome H. Powell and U.S. Secretary of the Treasury Steven Mnuchin greet each other after testifying before the House Financial Services Committee on Capitol Hill on June 30, 2020 in Washington, DC. (Tasos Katopodis/Getty Images)With interest rates already backed up to near-zero, Powell faced more questions on the various other facilities opened up in conjunction with the U.S. Treasury.Asked about the massive budget shortfalls faced by the nation’s states and localities, Powell said the Fed’s Municipal Liquidity Facility appears to have shored up private financing. Powell pointed to the fact that Illinois was able to get most of its financing in the private market after the MLF was set up, relying on the Fed for only the last piece of its fundraising needs.Although the facility has the power to support up to $500 billion in short-term municipal debt, the MLF had only taken on $1.2 billion through the program as of June 24.“That announcement has had an enormous effect on the functioning of that market,” Powell told Congress.Some lawmakers pressed Mnuchin and Powell on funding pressures specifically in commercial real estate and commercial mortgage-backed securities, worrying that travel disruptions may result in financing troubles for hotels in particular.Mnuchin suggested that the Fed and the Treasury had looked at some facility to address those concerns but faced “structural problems” in setting one up, adding that the companies likely wouldn’t benefit from more debt. Mnuchin punted the issue back to Congress, emphasizing that a second relief package should include “additional funding” targeting specific industries to keep hotel employees, for example, on payroll.Powell agreed, adding that “more debt may not be the answer, debt doesn't solve every problem.”The Fed’s next policy-setting meeting will be July 28 and 29.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Former CFPB head: SCOTUS decision allows consumer watchdog to 'go forward'A primer on the Fed's corporate bond-buying programFed to cap bank dividend payments after completing stress test, COVID analysisIMF projects 4.9% economic contraction as concerns mount over second waveA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}