{"article": [{"url": "https://finance.yahoo.com/news/trumps-tricky-tax-ploy-192524140.html", "published": 1597070000.0, "headline": "Trump's tricky tax ploy", "body": "Gimmicks abound during the “silly season” of presidential election campaigns, when candidates make their most grandiose claims and promises. But President Trump may be raising (or lowering) the bar.In an Aug. 8 executive memorandum, Trump directed the Treasury Department to “defer” collection of the payroll tax that most Americans pay, from Sept. 1 through Dec. 31. The payroll tax is a 7.65% mandatory deduction that helps fund Social Security and Medicare. So somebody making $50,000 per year would save about $1,300 during the four-month period. Trump’s order applies only to incomes up to $2,000 per week, or $104,000 per year, giving it some populist flavor.There’s a problem, though. Since it’s a tax deferral, not tax forgiveness, workers would owe the tax back in 2021. The point of that is dubious, since people who need the money most to buy essentials now would be the least likely to come up with the payback amount next year. The obvious solution, politically, is to make the tax deferral a permanent tax cut once the money is due back.Trump says he’ll do that—if elected to a second term. After signing the directive on Aug. 8, Trump said he’ll “terminate” the tax permanently if he gets reelected, so that nobody would have to repay it. Joe Biden, Trump’s Democratic opponent, called Trump’s payroll tax cut “reckless” and described it as an attack on Social Security, indicating he opposes the whole idea and won’t forgive the tax if he wins in November.President Donald Trump signs an executive order during a news conference at the Trump National Golf Club in Bedminster, N.J., Saturday, Aug. 8, 2020. (AP Photo/Susan Walsh)Trump, therefore, has created a framework in which he can claim a gift to workers that they only get to keep if they vote for him in November. If Biden wins, they’ll have to give the money back. Trump is the giver, Biden is the taker. A vote for Trump is a vote for keeping money in your pocket. A vote for Biden is like opening your wallet to Uncle Sam.Will voters buy it? It depends which candidate wins the messaging war during the next 11 weeks. Biden’s challenge seems easier. Social Security and Medicare are very popular programs, especially among the seniors they benefit. By pulling about $100 billion in funding from the two programs, Trump is touching the “third rail of politics” and hoping seniors—who vote in higher proportion than any other age group—won’t punish him. Biden is already hammering Trump for endangering seniors’ livelihoods.Story continuesThere’s also the irritating matter of Congress, which would have to pass legislation in order to forgive any tax owed by law. It’s already questionable whether Trump can legally defer the collection of taxes, as he has proposed. It’s clear he can’t cancel, raise or lower taxes on his own, without legislation. There’s essentially no chance Republicans will take control of the House in November, so at best a reelected Trump would have to deal with a split Congress, as he does now.Why Trump can’t cancel the payroll tax nowA reasonable question for Trump is why wait till you’re re-elected to cancel this tax? Why not just do it now? The answer is that Congress won’t go along with it—not now, and not in 2021. Defending Social Security and Medicare is an existential mission of the Democratic party, and there aren’t a lot of Republicans willing to defund the programs, either.Democratic presidential candidate former Vice President Joe Biden puts on his mask as he leaves a campaign event at the William \"Hicks\" Anderson Community Center in Wilmington, Del., Tuesday, July 28, 2020.(AP Photo/Andrew Harnik)Trump does seem to have won a few brownie points, however, for doing something as Congress dithers over further stimulus measures. If Congress comes through with a large new package, which is likely, Trump’s payroll tax deferral will probably be forgotten. But if not, Trump can claim he did the most he was able to do, absent legislation.Biden is also on record as planning to raise taxes, so Trump won‘t have to stretch that much to label him the tax grinch. The difference is that Biden wants to raise taxes only on those earning at least $400,000 per year. By undoing Trump’s payroll tax deferral, Biden would be “raising” taxes on low-income workers, violating his own ethos of standing up for the little guy.All of this suggests that if Trump’s tax deferral really goes into effect, and Biden wins, he may have no choice but to seek legislation in 2021 forgiving those deferred taxes. At the same time, Democrats would probably try to compensate for the $100 billion in lost funding by raising taxes even more on the wealthy. It could end up being a parting gift from Trump to workers, whether he intends it or not.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:11 ways Trump is out of touch with votersA double-dip recession is formingHow Biden threatens Trump’s fortuneEdgy voters might reject the 2020 election outcomeHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}