{"article": [{"url": "https://finance.yahoo.com/news/united-airlines-warns-36-000-152732127.html", "published": 1594204520.0, "headline": "United Airlines Warns 36,000 Workers They Could Be Laid Off or Furloughed", "body": "United Airlines Warns 36,000 Workers They Could Be Laid Off or FurloughedUnited Airlines soon plans to issue furlough and layoff notices to roughly 36,000 employees, including pilots, flight attendants, customer service agents and maintenance workers, warning them they could lose their jobs by early October, when federal funding for paycheck supports expires, the carrier told workers on Wednesday.United said the estimate may not be exact, and could change as more workers leave voluntarily, or if demand for air travel unexpectedly strengthens. But United’s executives repeatedly have stressed the U.S. airline industry is in dire shape, and this week told investors that this summer’s limited recovery may have stalled, as more U.S. Covid-19 cases pop up in many regions. Several U.S. airlines, particularly ones with robust long-haul networks, like United, expect to be significantly smaller over the next three to five years.United’s job cut proposal is significant. At the end of 2019, the airline had roughly 96,000 employees, and since then about 4,000 have taken voluntary packages to leave, executives have said.The airline expects job loss notices will go to roughly 15,000 flight attendants, 11,000 customer service and gate agents, 800 catering employees, 2,250 pilots, almost 1,000 reservations center employees, 5,500 maintenance workers and 225 employees in its network operations center.While the notices will go out soon, individual employees will not definitively learn of their future until mid-to-late August, an airline official said. But because most of these workers are covered by collective bargaining agreements that reward seniority, the airline’s more recent hires can reasonably expect they will lose their jobs.There also will be other involuntarily job losses. United expects about 1,400 more management employees will lose their jobs later this summer, but they will not receive notices in this round. Those decisions will be made based on merit, not seniority.“The reality is that United simply cannot continue at our current payroll level past October 1 in an environment where travel demand is so depressed. And involuntary furloughs come as a last resort, after months of company-wide cost-cutting and capital-raising,” United said Wednesday in a message to employees.Story continuesNot Final YetU.S. airlines recently took $25 billion in CARES Act funding that they have used to pay employee salaries. Congress gave airlines the money so carriers could pay costs during what it hoped would be short-term drop in travel demand. But with the Coronavirus sticking around, no one expects normal to return soon.Congress could extend the funding, but United executives have said they cannot count on another bailout and must manage their business accordingly.The airline also is not expecting significant turnaround this year, saying Tuesday in an investor filing that August may be its high-water market for 2020 recovery. United is expecting to fly 35 percent of its originally planned schedule next month, a number that could stay roughly stagnant for the rest of the year. Business has been getting slightly worse in recent weeks, the airline has said, as more big cities have instituted new restrictions on travel, including quarantines. If demand unexpectedly returns, United could keep more employees than it outlined on Tuesday. United also may be able to layoff and furlough fewer workers if more employees take voluntary departure packages. The airline has said fewer employees have accepted these voluntary packages than it wanted, but that may change once workers see how many employees will have to leave, without the extra benefits.United is also hoping more workers will agree to work fewer hours, allowing more employees to keep their jobs.Recall RightsMost airline unions are strong, relative to other industries, and contracts tend to require airlines to offer furloughs, rather than layoffs.The majority of unionized workers here will receive open-ended furloughs. That means United will have to offer them their jobs back before it can hire new workers.After previous crises, including 9/11, it has taken airlines several years before they recalled all their employees. Not all will want to come back, however, as some find new jobs and careers while they are on furlough.Subscribe to Skift newsletters for essential news about the business of travel."}]}