{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-why-this-trump-adviser-argues-against-600-unemployment-extension-191529891.html", "published": 1594823240.0, "headline": "Coronavirus stimulus: Trump advisor argues against $600 unemployment extension", "body": "One of President Trump’s close economic advisers isn’t bullish on extending sweetened unemployment checks despite the COVID-19 pandemic continuing to keep unemployment levels elevated.“The single most important thing we have to do going forward is stop the $600 a week [unemployment] payments,” Heritage Foundation economist Stephen Moore said on Yahoo Finance’s The First Trade. Moore estimates the U.S. economy has lost 1 million to 2 million jobs because of the extra unemployment payments.In March, lawmakers passed the $2 trillion Coronavirus Aid, Relief and Economic Security (CARES) Act. Under the plan, individuals were eligible for up to $1,200 (depending on income level) or $2,400 for married couples in stimulus checks. Children under 17 were granted $500. Those unemployed were allowed to claim an extra $600 a week in benefits, known as a “top up” on Wall Street. That top is set to expire at the end of July. Without an extension, millions of those unemployed as a result of COVID-19 business downturns could be thrust into a fresh financial tailspin.Many Republicans have argued the top up is a disincentive for folks to return to work as they earn more sitting at home. Democrats contend the extra payments are required given the levels of ongoing economic stress in the country.It’s wildly unclear if lawmakers will agree on a compromise ahead of the expiration.President Donald Trump speaks during roundtable with people positively impacted by law enforcement, Monday, July 13, 2020, in Washington. (AP Photo/Evan Vucci)“If President Trump were to sign a bill that extended those benefits for another six months, we would have eight to 10 million fewer jobs by the end of the year. It’s a very significant negative. We have 30 million unemployed people and they can’t get workers back on the job because they are making more money than getting back on the job. That is a very, very economically destructive plan,” Moore adds.To be sure, Wall Street is waiting on pins and needles on how lawmakers handle the deadline. The stock market has been bid up 40%-plus since the late March lows on the view that fiscal stimulus of all kinds will continue to be created to cushion the COVID-19 blow. If the market doesn’t get its latest pound of flesh from D.C., it could be lookout below for equities.Story continues“I think you are looking at a 10% to 15% range minimum [stock market hit if there isn’t a new stimulus plan],” warned EvercoreISI senior managing director Dennis DeBusschere.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}