{"article": [{"url": "https://finance.yahoo.com/news/this-is-the-beginning-of-the-end-of-big-tech-as-we-know-it-nyu-professor-galloway-194718192.html", "published": 1596207320.0, "headline": "'This is the beginning of the end of Big Tech as we know it': NYU professor Galloway", "body": "“It is time to return to our roots and break up” Big Tech to “oxygenate the marketplace,” says NYU marketing professor Scott Galloway.“The marketplace is beginning to collectively recognize that when all of the spoils are concentrated among an increasingly small number of firms, it makes for an unhealthy ecosystem and unhealthy economy,” Galloway told Yahoo Finance’s On The Move.On Friday, shares of Apple (AAPL) and Facebook (FB) touched fresh highs, while Amazon (AMZN) soared more than 4% following blowout quarters despite the ongoing pandemic.Amazon posted a record profit as people shopped at home during the COVID-19 outbreak.“The first take-away is that it’s fantastic to be an unregulated monopoly in a pandemic,” said Galloway.“These companies in the first 15 minutes post the close of the market yesterday, post earnings announcement added the value of AT&T (T) Twitter (TWTR) and Pinterest (PINS),” said Galloway.“And yet according to Mark Zuckerberg there’s competitors attacking him from everywhere,” he added.The jaw dropping earnings came just a day after the CEOs of Amazon, Apple, Facebook, and Alphabet (GOOGL) testified before lawmakers during a 5 hour anti-trust hearing.Facebook’s CEO Mark Zuckerberg made a case for why the social media platform is not an illegal monopoly, and actually behind its competition.“After watching the hearings I thought again, this is the beginning of the end of big tech as we know it,” said Galloway.“And I think we have to move from a construct of believing that it’s some sort of punishment or they’ve done something wrong,” he added.“I think America has a proud legacy of anti-trust when any one company gets so powerful that it begins to cut off the oxygen of a sector and the rest of the economy. We go in and we oxygenate the economy by breaking that firm up,” he said.“By the way, as an Amazon and Apple shareholder, I think the value of my shares go up once they announce they’re breaking up,” he said. “I think AWS will be the most valuable company in the world as an independent company in 3-4 years.”Story continuesThe e-commerce giant’s cloud business Amazon Web Services grew 29% year over year.“I do think this is the beginning of the end, even if Trump gets re-elected. I think there’s going to be some action if Biden gets elected — it will go faster. But we are well past due here to ... oxygenate the marketplace.”Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}