{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-checks-white-house-considering-second-round-seriously-since-first-round-worked-very-well-165017526.html", "published": 1593691100.0, "headline": "Coronavirus stimulus checks: Mnuchin says White House considering second round 'seriously' since first round 'worked very well'", "body": "Treasury Secretary Steven Mnuchin told reporters that the White House is seriously considering another round of coronavirus stimulus checks for Americans on Thursday.“We’re going to seriously consider whether we need to do more direct payments,” Mnuchin told reporters on Thursday. “Worked very well.”Read more: Coronavirus stimulus checks: What it means for your taxesPresident Donald Trump expressed support for more stimulus and potentially a second round of checks on Wednesday. At the Thursday morning briefing, Trump said his administration has started working on the next phase of stimulus. The details of the White House stance remain unclear.Under the CARES Act enacted in March, the government sent $270 billion in stimulus checks as of May 31 to over 160 million Americans. Each payment is worth up to $1,200 per qualifying adult, plus a $500 bonus for children under 17. The act also added an extra $600-a-week in unemployment benefits that is set to expire at the end of July.U.S. President Donald Trump, with Director of the National Economic Council Larry Kudlow (L) and U.S. Secretary of the Treasury Steven Mnuchin, speaks to the press in the Brady Briefing Room of the White House in Washington, DC, on July 2, 2020. (Photo by JIM WATSON/AFP via Getty Images)Mnuchin added that a second round of stimulus payments would be sent to “legal Americans” only.The $3 trillion HEROES Act, which passed the House in May and has been held up in the Republican-dominated Senate, proposed $1,200 direct payment per individual with a maximum amount of $6,000 per household.Read more: Coronavirus stimulus checks: How to use your payment debit cardThe payments under the Act would also have been available to those with Individual Taxpayer Identification Numbers (ITINs) and their families. That means that more than 4.3 million adults and 3.5 million children would be eligible for the payment compared with the first round, according to ITEP.In the first round of stimulus, people without a Social Security number and nonresident aliens — those who aren’t a U.S. citizen or U.S. national and don’t have a green card or have not passed the substantial presence test — weren’t eligible for payments.Yahoo Money sister site Cashay has a weekly newsletter.On Thursday, Mnuchin said he’s discussing the need for future stimulus and is, “having conversations with certain members of Democrats and Republicans to get ideas.”Story continues“Our position is that legal Americans — American citizens — should get the payments. That's our focus,” Mnuchin said. “If people are here illegally, they're not going to get economic payments”Denitsa is a writer for Yahoo Finance and Cashay, a new personal finance website. Follow her on Twitter @denitsa_tsekova.Read more:Rich Americans' pullback in spending is hurting the economic recoverySome Americans finally get a living wage — while unemployedRead more personal finance information, news, and tips on CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and Reddit."}]}