{"article": [{"url": "https://finance.yahoo.com/news/michigans-governor-on-whether-biden-has-her-state-sewn-up-i-dont-buy-it-for-a-second-160905004.html", "published": 1597663040.0, "headline": "Michigan’s governor on whether Biden has her state sewn up: ‘I don't buy it for a second’", "body": "Michigan Gov. Gretchen Whitmer has emerged as one of 2020’s most prominent Democrats (who isn’t running for president). She popped up as a respondent to the State of the Union in February and as a finalist in Joe Biden’s VP search more recently. Along the way, she has been the recipient of many presidential taunts on social media.She is set to help open the Democratic National Convention on Monday night as one of the primetime speakers. Before her speech, she sat down virtually with Yahoo Finance’s Andy Serwer for a wide-ranging conversation about the themes to watch in her speech, whether Joe Biden has an insurmountable lead in her state, and how Michigan’s economy is coming back from the coronavirus.“There's a lot to accomplish here,” she says of what she plans to do with her limited time on Monday night. In addition to touting her party’s standard bearers, she is hoping to “focus on those who have sacrificed their own health to take care of others,” including front-line responders who may struggle with PTSD symptoms even after the pandemic recedes.Michigan Governor Gretchen Whitmer in May. (Brittany Greeson for The Washington Post via Getty Images)Monday’s program will feature Whitmer alongside Sen. Bernie Sanders, Michelle Obama, and New York Gov. Andrew Cuomo. Whitmer hopes that the all-virtual proceeding “can show the American people life continues on if we can stay smart, stay safe and do what we need to do.”Whitmer offered repeated praise of Sen. Kamala Harris, the newly minted Vice Presidential candidate. At one point Whitmer, who just days ago had been in contention to join, noted that “my kids are excited about this ticket.”‘I don't think anyone should take Michigan for granted’Whitmer swept into office in 2018 by almost 10 points after Trump’s narrow victory in the state two years earlier. She’s confident that Biden can win Michigan, but says of polls that have shown a big Biden lead: “I don't buy it for a second, to be honest.”Recent polls have shown Biden with a lead between 11 points or 4 or 5 points in Michigan. “I feel good, but I don't think anyone should take Michigan for granted,” says Whitmer.Story continuesGovernor Whitmer, left appeared with Senators Kamala Harris and Cory Booker and former Vice President Joe Biden in March. (Carolyn Van Houten/The Washington Post via Getty Images)Much of her unease comes from the questions around the Postal Service and America’s voting infrastructure that have exploded into public view in recent weeks.President Trump has repeatedly claimed – with little evidence – that voting-by-mail will lead to widespread fraud and reports from around the country in recent days have shown that that new Postmaster General, a prominent Trump supporter, is retiring mail sorting machines and slowing down the mail so much that many voters could be disenfranchised even if they mail in their ballots by the state deadlines.Washington Democrats are hoping to hold hearings on the Postal Service and the election as early as next week.Michigan, meanwhile, is moving forward with plans to send applications for mail-in ballots to all registered voters. Whitmer says “there's an enthusiasm that is real” for Biden and Harris, but she’s concerned whether those votes will be counted.“If the USPS is not reliable – or is being undermined – that constitutional right we have afforded people is undermined,” she says, adding that she is exploring legal options with her state’s Attorney General and Secretary of State.Protestors try to enter the Michigan House of Representative chamber in April to protest Governor Whitmer's mandatory closure of businesses to curtail COVID-19. (JEFF KOWALSKY/AFP via Getty Images)Michigan’s economic re-openingThe governor also discussed Michigan’s relative success containing the virus and its economic re-opening. The state has kept caseloads relatively low and recently announced plans to re-open schools across the state.“We didn't get bullied and we didn't get, you know, drawn into political arguments,” Whitmer says of her administration’s response in the face of pressure from many right-wing groups, often encouraged by President Trump, to open faster.“But this can crop up fast,” Whitmer warned of a second wave. The gains are “all very precarious.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Graphic by Yahoo FinanceRead more:‘We see it here every day’: How a slowdown in the Postal Service is impacting small businessesTrump’s worst campaign promiseSummers says stocks 'do better' during Democratic administrationsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}