{"article": [{"url": "https://finance.yahoo.com/news/tailored-brands-files-bankruptcy-pandemic-033329225.html", "published": 1596408080.0, "headline": "Tailored Brands files for bankruptcy as pandemic hammers sales", "body": "(Reuters) - Men's Wearhouse owner Tailored Brands filed for bankruptcy on Sunday, adding to a list of brick-and-mortar retailers that have succumbed to the economic fallout from the COVID-19 crisis.The retailer filed for Chapter 11 bankruptcy in the U.S. Bankruptcy Court for the Southern District of Texas, according to a court filing.Apparel retailers have been among the worst hit from the coronavirus crisis as their businesses were considered non-essential and their stores had to be closed. They were forced to limit operations to online, which led to furloughing of staff and unpaid leases and rents.Tailored Brands said in a statement that it has entered into a restructuring agreement with more than 75% of its senior lenders, and that could reduce the company's debt by at least $630 million.The company said it has received commitments for $500 million in debtor-in-possession financing from its existing lenders.In the court filing, the company listed both its assets and liabilities in the range of $1 billion to $10 billion.The Houston, Texas-based retailer, which was already struggling with competition from fast-fashion brands and a shift to online shopping before the pandemic, said it will continue to build on its previously announced plans to reduce its corporate workforce by 20% and shut as many as 500 stores.The company added that Men's Wearhouse, Jos. A. Bank, Moores Clothing for Men and K&G Fashion Superstore will continue to serve its customers.Last week, the retailer raised doubts about its ability to continue as a going concern within a year due to reduction in liquidity and failure to make an interest payment.Lord & Taylor, a storied department store chain founded in 1826, billed as the oldest in the United States, also filed for Chapter 11 bankruptcy on Sunday.(Reporting by Sabahatjahan Contractor in Bengaluru; Editing by Aditya Soni and Sherry Jacob-Phillips)"}]}