{"article": [{"url": "https://finance.yahoo.com/news/deficits-with-no-precedent-will-dwarf-the-entire-economy-as-coronavirus-rages-192250940.html", "published": 1593613820.0, "headline": "‘There is no precedent’: Record-breaking U.S. deficits are coming", "body": "Even before the current economic crisis, the federal budget deficit was approaching record levels.Now, after multiple waves of economic stimulus, budget watchers have watched the red ink rise to a level never before seen.“We will have spent as much in the first six months of this crisis as we did on stimulus over five years during the Great Recession,” said Marc Goldwein of the Committee for a Responsible Federal Budget, a bipartisan DC think tank.“That money has done a lot of good,” Goldwein told Yahoo Finance, “but that doesn't mean this borrowing is free.\"According to his group’s projections, the ballooning deficits will lead the national debt to grow from 79% of gross domestic product before the crisis to 101% this year. By 2030, the CRFB estimates, it will grow to somewhere between 118% and 130% of GDP.A billboard displaying the national debt in Des Moines, Iowa from December 2019. It is now estimated to be almost $80,000 per person. (Steven Pope/Getty Images for PGPF)Other analyses have found similar eye-popping numbers. The CATO Institute recently suggested the crisis would add $6 trillion to the U.S. federal debt over time.Trillions out the door in just weeksCongress has authorized about $3.6 trillion in new spending since the crisis began in March. Some of that money will eventually be returned to the Treasury and so the estimates are that the net impact of the spending will be roughly $2.4 trillion.And the money has moved quickly. Over half of the cash from the CARES Act and a follow-up bill is estimated to have already been disbursed or committed. The Paycheck Protection Program has already approved over $520 billion in loans to small business, and the IRS has sent out more than $267 billion in checks to individuals. Treasury Secretary Steven Mnuchin has boasted that help for Americans, like the stimulus checks, went out “in record time.”In fact, while GDP has shrunk in the early months of the recession, personal income is actually up by 5% to 8% compared with February. That’s counterintuitive but true, thanks to direct infusions of cash like unemployment benefits and the direct stimulus checks.Story continuesDebt levels ‘twice our historic average’The Congressional Budget Office has already looked at the spending and estimates a 2020 budget deficit of $3.7 trillion. With another round of stimulus expected from Congress later this summer, it’s likely to grow even higher by the end of the year.The CRFB has run the numbers out for 30 years. On a call with reporters, Goldwein emphasized that they are rough projections but they show “debt will reach 220% of GDP under current law, and about 270%” in 30 years if Congress passes more stimulus.Debt Projections amid COVID-19“There is no precedent for anything close to that,” he said. “We're talking about debt levels that are twice our historic average.”The previous record deficit was $1.4 trillion set in 2009. The CRFB estimates that every single deficit in the coming decade is going to break that record, with an average deficit of $2 trillion over the next decade.“Now, why does this happen? Well, it's a combination of the recession itself, and the response both are actually very costly,” said Goldwein.Why ‘now is exactly the time we should be borrowing’The climbing deficits have led some Republican lawmakers to push for a pause on any more measures. “All of this is either borrowed money or created money and, either way, Americans are going to pay a price,” Pennsylvania Sen. Pat Toomey told Yahoo Finance in a recent interview.Democrats have pushed ahead for more stimulus as soon as possible. The Democratic-led HEROES Act, which passed the House of Representatives in May but has been ignored by the Senate, came with a $3 trillion price tag.\"Now is exactly the time we should be borrowing,” Goldwein said of the money already spent, as it “makes sense to spread [the economic pain] over time.” He appeared as part of Yahoo Finance’s ongoing partnership with the Funding our Future campaign, a group of organizations advocating for increased retirement security for Americans.Congress is set to return in late July to possibly negotiate another stimulus deal and most expect a price tag of somewhere around a trillion dollars.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:One key senator argues against more stimulus: No need to ‘load the money cannon' againCoronavirus stimulus checks: Americans are spending payments in 'two big ways'Coronavirus stimulus checks: What would need to happen before a second roundRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}