{"article": [{"url": "https://finance.yahoo.com/news/nascars-only-black-driver-bubba-wallace-forever-changed-the-sportand-its-having-ripple-effects-beyond-racing-191813950.html", "published": 1591885580.0, "headline": "NASCAR's only black driver Bubba Wallace forever changed the sport—and it's having ripple effects beyond racing", "body": "Bubba Wallace, the only black full-time driver at NASCAR’s highest level, truly seized the moment.On Sunday, amid ongoing national protests over police brutality after the death of George Floyd in Minneapolis police custody, Wallace wore an “I Can’t Breathe / Black Lives Matter” shirt before a race in Atlanta. On Monday, he appeared on CNN and called for the sport to rid itself of Confederate flags, which have long been a staple of NASCAR telecasts, toted by fans, worn on shirts and hats, and emblazoned on RVs in parking lots.“No one should feel uncomfortable when they come to a NASCAR race,” Wallace said. “So it starts with Confederate flags. Get them out of here.”Just two days later, on Wednesday, NASCAR took action. It banned Confederate flags at its events.“The presence of the confederate flag at NASCAR events runs contrary to our commitment to providing a welcoming and inclusive environment for all fans, our competitors, and our industry,” NASCAR said in a statement. “The display of the confederate flag will be prohibited from all NASCAR events and properties.”ESPN’s Ryan McGee called it a “one-man campaign.” And just hours after NASCAR’s announcement, Wallace raced at Martinsville Speedway in Virginia on Wednesday in an all-black #BlackLivesMatter car and pulled off his best-ever finish (No. 11) at the course. He called it the “biggest race of my career.”Sure, fallout may come. Some NASCAR fans won’t like it. (Recall when some NFL fans threatened to boycott the league amid the kneeling protests a few seasons ago.) Ray Ciccarelli, a NASCAR Truck Series driver, posted on Facebook that he will leave the sport after the 2020 season because of NASCAR’s decision: “I don’t believe in kneeling during Anthem nor taken ppl right to fly whatever flag they love. I could care less about the Confederate Flag but there are ppl that do and it doesn’t make them a racist all you are doing is fu**ing one group to cater to another and I ain’t spend the money we are to participate in any political BS.”Story continuesBut the sport is likely to see more praise than criticism for finally taking action. McGee, who has covered the sport for more than two decades, wrote: “I am 100 percent confident that a real NASCAR fan has the ability to enjoy a weekend in the infield just as much while flying an American flag as they do under the flag of a misguided, defeated nation that hasn't existed for 155 years. If they can't, then they've never loved NASCAR as much they have always claimed.”MARTINSVILLE, VIRGINIA - JUNE 10: Bubba Wallace, driver of the #43 Richard Petty Motorsports Chevrolet, wears a \"I Can't Breathee - Black Lives Matter\" t-shirt under his fire suit in solidarity with protesters around the world taking to the streets after the death of George Floyd on May 25, speaks to the media prior to the NASCAR Cup Series Blue-Emu Maximum Pain Relief 500 at Martinsville Speedway on June 10, 2020 in Martinsville, Virginia. (Photo by Jared C. Tilton/Getty Images)NASCAR’s action is one of many big moves adding fuel to the broader reckoning in America: sports leagues and corporations, news outlets and even bands, are cleaning up their act and publicly investigating their own racial insensitivity or institutional racism.Lady Antebellum, a hugely popular Grammy-winning country band, announced on Thursday that they are changing their name to Lady A, a nickname many fans had already used for the band for short. There’s major overlap between NASCAR fans and country music fans; Lady Antebellum performed the pre-race show before the 2017 Daytona 500.“We’ve watched and listened more than ever these last few weeks, and our hearts have been stirred with conviction... We named our band after the Southern ‘antebellum’ style home where we took our first photos. As musicians, it reminded us of all the music born in the South that influenced us... We did not take into account the associations that weigh down this word referring to the period of history before the Civil War, which includes slavery. We are deeply sorry for the hurt this has caused... Today, we speak up and make a change. We hope you will dig in and join us.”No doubt the band, like NASCAR, stands to lose some fans who don’t approve of the decision.But like the NFL, which reportedly plans to allow kneeling protests this coming season, and like Nike, which endorsed Colin Kaepernick in 2018 and will donate $140 million over the next 10 years to racial equality and social justice efforts, and like Reebok, which dumped CrossFit over one offensive tweet from its CEO about George Floyd, the business benefit and reputation boost will likely outweigh any backlash.—Daniel Roberts is an editor-at-large at Yahoo Finance and focuses on sports business. Follow him on Twitter at @readDanwrite.Read more:Reebok ends its CrossFit sponsorship over CrossFit CEO's tweet about George FloydNike is setting the tone for sports brands in its response to the George Floyd protestsDrew Brees on potential return of NFL kneeling protests: 'I will never agree with anybody disrespecting the flag'Under Armour has a chance to radically shift its strategy out of coronavirus—but will it?DraftKings completes merger that brings it public, with no sports going onCoronavirus could have long-lasting impact on live sports ticket salesMLS Commissioner: Playing in empty stadiums would be particularly bad for usCoronavirus hits sports leagues: March Madness canceled; NBA, NHL, MLS seasons on hold"}]}