{"article": [{"url": "https://finance.yahoo.com/news/us-consumer-spending-5-6-123725342.html", "published": 1596181520.0, "headline": "US consumer spending up 5.6%, but virus could stall gains", "body": "WASHINGTON (AP) — American consumers increased their spending in June by a solid 5.6%, helping regain some of record plunge that occurred after the coronavirus struck hard in March and paralyzed the economy. But the virus' resurgence in much of the country could impede further gains.Last month’s rise in consumer spending followed a seasonally adjusted 8.5% surge in May after spending had plunged the previous two months when the pandemic shuttered businesses, caused tens of millions of layoffs and sent the economy into a recession.Now, with confirmed viral infections rising in a majority of states, many businesses have had to pause their re-openings or close a second time and cut jobs, thereby putting consumers under renewed pressure. The number of laid-off Americans who have applied for unemployment benefits has topped 1 million for 19 straight weeks. All told, roughly 30 million people are out of work, the government says.Friday's Commerce Department report showed that the June increase in consumer spending coincided with a 1.1% drop in personal incomes, which followed an even bigger 4.4% fall in incomes in May. Those sharp declines followed a 12.1% surge in incomes in April as a flood of government aid began to be distributed, notably $1,200 checks for many individuals and a $600 a week in federal unemployment benefits.The $1,200 checks have been largely spent, though, and the $600 in unemployment benefits is expiring. A standoff in Congress has prevented lawmakers from agreeing on an extension of the benefits, thereby threatening to squeeze millions of the unemployed. Doing so would weaken spending by consumers, the primary driver of the economy.What's more, recent patterns suggest that consumers have reduced their spending in the past couple of weeks. JPMorgan Chase, which tracks total spending by its 30 million debit and credit card holders, notes that as of July 20, their spending had dropped to a five-week low. Spending levels remain about 12% below pre-pandemic levels, though up from a 40% plunge in early April.Story continues“While consumers felt more at ease spending in June, real-time data point to plateauing demand since early July,\" Gregory Daco, chief U.S. economist at Oxford Economics, wrote in a research note. “With the health situation deteriorating, fiscal aid running dry, employment cooling and confidence ebbing, the risks are skewed to the downside.”The income and spending report came against the backdrop of a devastating economic collapse in the spring. The government estimated Thursday that the economy shrank at a dizzying 32.9% annual rate in the April-June quarter — by far the worst quarterly plunge on records going back to 1947 — as the viral outbreak shut down businesses, threw tens of millions out of work and sent unemployment surging to 14.7%.The economic contraction was driven by a deep pullback in consumer spending, which fell at a record pace as travel froze up and shutdown orders forced many restaurants, bars, entertainment venues and other retailers to close.So steep was the fall last quarter that most analysts expect a sharp economic rebound for the current July-September period. But the pain will likely continue and potentially worsen in the months ahead as the damage from the virus deepens. Over the past week, the average number of COVID-19 deaths per day in the United States has climbed more than 25%. And the number of confirmed infections has topped 4.4 million, which could be even higher because of limits on testing and because some people are infected without feeling sick.A result is that any tentative economic recovery could stall out as state and county governments roll back their reopening efforts and anxious consumers decide to stay at home rather than pursue normal economic activities like shopping, traveling and eating out.On Wednesday, Federal Reserve Chair Jerome Powell warned that the viral epidemic was endangering any modest rebound — a key reason why the Fed plans to keep interest rates pinned near zero well into the future. Powell noted that as new confirmed cases have soared, measures of spending and hiring have slipped or plateaued at low levels.Unemployed Americans have been receiving both state unemployment aid and $600 a week in additional benefits from the federal government. The federal aid has pumped nearly $20 billion a week into the economy and enabled many of the unemployed to stay afloat. But the $600 a week is expiring, and Senate Republicans have favored extending that benefit only at a much-reduced level.Now, though, the White House and some of its Republican allies in the Senate are signaling they want to extend, at least temporarily, the $600-a-week unemployment benefit. Still, any final agreement with the Democratic-led House, which has passed a much more far-reaching rescue package, may be far off.___AP Economics Writer Christopher Rugaber contributed to this report."}]}