{"article": [{"url": "https://finance.yahoo.com/news/bank-analysts-warn-of-confusing-sloppy-shocking-earnings-covid-19-183957962.html", "published": 1594648040.0, "headline": "Bank analysts warn of 'confusing, sloppy, and shocking' earnings as COVID-19 extends grip", "body": "Bank earnings could reveal ugly-looking loan portfolios for the second quarter, but the industry hopes to champion its investment banking and cost-cutting efforts to squeeze out earnings.Earnings season will kick off on Tuesday as JPMorgan Chase (JPM), Citigroup (C), and Wells Fargo (WFC) report earnings before the market bell, covering the large U.S. banks’ performances through the three-month period ended June 30.“The upcoming [second quarter] earnings will be confusing, sloppy, and shocking for some banks,” RBC’s Gerard Cassidy wrote July 11. “But our outlook is cautiously optimistic as we expect the economy to continue to gain momentum into the end of the year.”Earnings growth at the large banks will likely be hobbled by dramatic increases in loan loss reserves, as business struggles and job losses impair loan payments across the U.S. economy.Lower interest rates have also compressed bank profitability, as the Federal Reserve’s rate cuts have spurred lower interest rates of both short and long durations.KBW bank analyst Brian Kleinhanzl expects bank earnings to be down 24.9% year-over-year for the median bank this quarter.“[T]here are still open questions on the ultimate amount of credit losses that will be borne by the banks, and until there is greater certainty on that, we believe it will be difficult for banks to outperform the market,” Kleinhanzl wrote July 1.The bank industry has had a rough 2020 relative to the overall market, suffering steeper losses during late-March’s tumultuous market tumble and a more tepid bounce back in the months following.As of Monday afternoon, the KBW Nasdaq Bank Index (^BKX) was down over 34% year-to-date. The S&P 500, meanwhile, has effectively recovered its losses, and is now down only 1.5% year-to-date.I-banking and cost cuttingAs banks brace for greater loan losses through those reserve builds, large U.S. banks with diversified revenue streams may look beyond the loan books to make money.Story continuesKBW and RBC noted that the companies with large investment banking divisions are poised for success in the second quarter, specifically highlighting JPMorgan Chase, Goldman Sachs (GS), and Morgan Stanley (MS).Capital markets were likely aided during the second quarter by the Federal Reserve’s liquidity interventions in a number of markets (such as municipal debt, corporate debt, U.S. Treasuries, U.S. dollar funding) that restored confidence among market-makers like the large investment banks.“We are expecting very strong trading results this quarter as credit spreads have compressed, bid-ask spreads remain wide, and trading activity remains high,” Kleinhanzl wrote.At RBC, Cassidy expects investment banking revenues to rise by 6.8% year-over-year among the largest U.S. banks, driven by higher gains specifically in debt capital markets.Banks may also highlight cost-cutting in their earnings. Some banks are already trimming headcount; Bloomberg reported last week that Wells Fargo is planning thousands of job cuts.The San Francisco-based bank, however, has been dealing with reputational and regulatory challenges over the past few years and will likely be the only large bank to announce a dividend cut in earnings this week. Due to the COVID-19 disruptions, the Federal Reserve has barred the largest U.S. banks from share buybacks through at least the third quarter, although banks are still allowed to pay out dividends.But secular trends in the banking industry have pointed to reduced headcount well before the arrival of COVID-19. Wells Fargo’s banking analyst Mike Mayo has predicted that automation and the growth of mobile banking will lead to 200,000 job cuts over the next 10 years.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Black-owned small businesses continue to face harsh cash crunchOECD adds risk of COVID-19 'double-hit' in bleak economic forecastsFed Chair Powell warns of economic fallout from a 'second outbreak'Former CFPB head: SCOTUS decision allows consumer watchdog to 'go forward'A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}