{"article": [{"url": "https://finance.yahoo.com/news/walmart-to-trial-on-demand-drone-delivery-with-zipline-040110050.html", "published": 1600038560.0, "headline": "Walmart teams up with Zipline to test limited on-demand drone deliveries", "body": "Walmart (WMT) is teaming up Zipline to test drone delivery early next year, as the world’s largest retailer continues to explore the future of on-demand delivery.Starting next year, Zipline will begin making on-demand deliveries for Walmart for “select health and wellness products with the potential to expand to general merchandise,” Tom Ward, senior vice president of customer product at Walmart, wrote in a blog post.Zipline, which operates the world’s largest drone delivery network, is best known for delivering critical medical supplies — particularly blood — in hard-to-reach areas of Rwanda, the landlocked African country characterized by hilly and mountainous terrain. The company counts Sequoia, A16Z, GV, Temasek, TPG, Baillie Gifford, and Katalyst Ventures among its backers, and was recently valued at $1.2 billion, according to a 2019 report from CNBC.The on-demand drone delivery trials with Zipline will take place near Walmart’s home in Northwest Arkansas.Walmart will begin trialing drone delivery company Zipline's technology early next year.According to Ward, “Zipline will operate from a Walmart store and can service a 50-mile radius, which is about the size of the state of Connecticut.”The system will facilitate rapid delivery times of under an hour, Ward wrote, and helps curb carbon emissions.“The operation will likely begin early next year, and, if successful, we’ll look to expand,” the executive added.Ward added that Zipline had delivered more 200,000 medical products across thousands of medical facilities in multiple countries.“This uniquely positions them for national-scale operations across the United States,” Ward added.Last week, Walmart began testing drone delivery for select groceries and essential items in Fayetteville, North Carolina, by partnering with Flytrex, an end-to-end drone delivery company. Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. How kids and the coronavirus helped Walmart shape its yearly list of hot toysWalmart unveils ‘ultimate life hack,’ a $98 membership with access to groceries, gas, and deliveryWalmart shares ‘real-time’ picture of diversity, inclusion in the workplace"}]}