{"article": [{"url": "https://finance.yahoo.com/news/black-communities-vulnerable-to-debt-traps-as-key-protections-against-payday-loans-removed-205751251.html", "published": 1594224320.0, "headline": "Black communities vulnerable to 'debt traps' as key protections against payday loans removed", "body": "People walking in front of a Money Mart store in Toronto. National Money Mart Company, commonly known as Money Mart, is a Canadian financial services company that provides payday loans, cheque cashing, tax preparation and money transfer services to the underbanked. (Photo by Roberto Machado Noa/LightRocket via Getty Images)In 2017, the Consumer Financial Protection Bureau (CFPB) finalized a rule to combat what’s known as “payday debt traps.”This week, a new rule was finalized to walk back the protections, which stood largely to protect those in precarious economic circumstances from getting trapped in a vicious and expensive cycle of astronomical interest rates — a phenomenon that especially affects Black communities.Meanwhile, the CFPB has announced that next week would be “Consumer Financial Protection Week.”The 2017 rule required payday lenders — which give out short-term loans to people who need to cover expenses just until their payday — to check to see if the people who borrow money are able to pay them back while being able to meet “basic living expenses and major financial obligations.”The rule, passed under then-CFPB director Richard Cordray, fell along a partisan divide. Consumer groups saw it as a triumph (or at least a bare minimum) and a key protection against a predatory financial practice.The lucrative payday loan industry saw it as a threat, and Kathy Kraninger, the Trump-appointee at the head of the agency, is now rolling back a key provision of the original rule.Throughout credit markets, lenders typically check to see if a borrower has the means to repay a loan before money is lent. Although payday lending trade group the Community Financial Services Association of America’s best practices include “reasonable, good-faith effort to determine a customer’s creditworthiness and ability to repay the loan,” the group fought a codified requirement in the original rule for lenders to assess ability-to-repay. The CFSA applauded the news that the CFPB was scratching that requirement, noting that the CFPB “will ensure that essential credit continues to flow to communities.” Other groups like the Consumer Bankers Association echoed the sentiments.The final rule, however, will preserve the original rule’s limitations of how payday lenders can withdraw funds directly from a borrower’s account. Under the rule, a lender will not be able to attempt more than two times to pull money from an account, and will require written notice before making a first attempt.Story continuesAlan Kaplinsky, a partner at law firm Ballard Spahr who works on consumer financial services issues, told Yahoo Finance that “largely, the industry is happy with what they got.”On the other hand, Ashley Harrington, the director of federal advocacy and senior counsel for the Center for Responsible Lending, told Yahoo Finance that “predatory lenders often hide behind the idea that they’re providing access to credit.”Exterior view of a Payday Loan Store in downtown Chicago, Illinois, 2019. (Photo by Interim Archives/Getty Images)“Our belief is access to credit with triple-digit interest rates isn’t access to credit — it’s a debt trap,” she said. “They target communities of color and low-income people and put them in this cycle of debt.”In April, a career economist at the CFPB alleged that political appointees at the CFPB had manipulated research in order to justify the rule's alteration.A huge step back for anti-poverty efforts — and one that disproportionately affects black communitiesIn 2014, a CFPB study found that most payday loans were not as short term as many might hope. Four out of five loans ended up being renewed within 14 days, and 22% of them renewed six times or more. Three out of five of consumers ended up paying more in fees (mostly interest) than the amount they borrowed for multiple loans with one out of five loans costing more in fees than the principle.Though the industry trumpets payday loans as being a lifeline for people needing credit, the previous version of the Bureau found that they were ultimately harmful without the rule. The study didn’t examine the demographics, but many experts and researchers have found that it affects black people and other communities of color the most.African Americans, a Pew study found, were 105% more likely than other groups to use payday loans with 12% of African Americans having used them compared to the next group, \"Hispanic,\" which was 6%. According to New America, a think tank, regular banks' exclusionary practices often contribute to \"’banking deserts’ in which payday lenders, check cashers, and other non-bank services thrive.\"Jacob W. Faber, an associate professor of sociology and public service at NYU who studies inequality and the roles financial institutions play, told Yahoo Finance that the practices of “alternative” providers are a huge focus for anti-poverty advocates.“Most of the people in this space consider payday loans the most predatory of the alternative financial services because people tend to get trapped in these cycles of payday loans,” said Faber. “Subprime lending is another form of financial exploitation.”“Reverse redlining,” as some call it, flips traditional redlining (not giving credit to Black communities) by giving people high interest loans they may not be able to repay easily, trapping them in defaults, foreclosure, or multiple cycles of a payday loan.The situation has deteriorated as well with the coronavirus. A recent report by the Wall Street Journal showed that lenders have begun to target borrowers for loans with \"triple-digit interest rates,\" and are pitching themselves to areas hit hard by the coronavirus, despite Google and Facebook advertising bans. (The companies deleted them when the Journal asked for comment.)“This is the worst possible time for regulators to enable predatory lending,” said Harrington. “We are in such a fraught economic, social, and political time and opening the doors for bad practices makes no sense.”A truck heads east along historic Route 66, past one of the roughly 700 small lenders operating in New Mexico, in Albuquerque, N.M., on Friday, Feb. 3, 2017. Two New Mexico lawmakers have introduced legislation once again targeting the payday and title loan industry, seeking to cap interest rates at 36 percent. (AP Photo/Susan Montoya Bryan)Harrington and the Center for Responsible Lending advocate for a 36% cap on interest rates, which is currently the limit that can be charged to members of the military. In 2019, average payday loan interest rate was 391%.Challenges coming?The consumer watchdog’s work on the rule may, however, be far from over. As has been the case with previous rulemaking, the Kraninger-led version of the payday rule could see a challenge in the courts, as well as on Capitol Hill.While it is possible that a consumer advocacy group could launch a lawsuit against the CFPB, the bigger battle may play out in the halls of Congress and at the White House. Democrats could trip up the final rule in two ways: overturning the rule through the Congressional Review Act or, if Joe Biden wins the election, simply undoing the rule through a new CFPB head.Under the Congressional Review Act, a regulatory rule can be struck down if both the House and the Senate vote to “disapprove” it. A Democratic-led House could kick off a CRA challenge but a Republican majority in the Senate and the veto power in the White House would make the effort virtually impossible at the moment.This means the clearest path to striking down the rule comes from a Biden election in November.Isaac Boltansky, director of policy research at Compass Point, told Yahoo Finance that a Democratic victory would quickly lead to Kraninger’s removal. Her replacement, Boltansky said, will “prioritize a review and reopening of the rule to restore the original ability-to-repay construct that was at the heart of Cordray’s rule.”Kaplinsky said the payday industry itself could also standoff with the CFPB in court. Lenders upset with the payments provision of the rule – the cap on the amount of times a lender can attempt to withdraw funds – may attempt to argue that the rule is a violation of the Administrative Procedure Act governing the bureaucratic rulemaking process.“It’s like everything else, if somebody gets what they want, they always want a little bit more,” Kaplinsky said.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Black-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey'We're seeing a 6,000% increase in spam': IBM cyber VP"}]}