{"article": [{"url": "https://finance.yahoo.com/news/fathers-day-gift-ideas-tech-144913699.html", "published": 1591955840.0, "headline": "5 Father’s Day tech gift ideas: Tech Support", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's dilemma:“What should I get my dad for Father’s Day?”Father’s Day is right around the corner. Luckily, if you’re shopping for your techie dad, there are plenty of gift options to choose from. Whether it’s headphones, video games, or smart watches, I’ve got you covered with the ideas your father is sure to love.Lavatools Javelin Pro Duo — $53.99The Javeline Pro Duo is a lightning fast meat thermometer. (Image: Lavatools)Nothing says Father’s Day quite like the image of dad standing at a flaming grill ... overcooking the burgers, yet again. But there’s hope for your old man. Lavatools Javelin Pro Duo is an electric meat thermometer that can tell your pops the temperature of a cut of meat in 2 to 3 seconds, ensuring he won’t char dinner to a crisp ever again.A backlit, automatic rotating display and motion sensor mean that you can turn on the Pro Duo by simply picking it up, and use it easily in either hand. And with a claimed 4,000 hours of battery life, you shouldn’t have to worry about changing any batteries. A magnet on the back means dad can attach the Duo to the fridge, so it’s always within arms reach.Apple Watch Series 3 — Starts at $179The Apple Watch Series 3 includes a heart rate monitor, fitness tracking, apps, and more. And at $179, it's a steal. (Image: Apple)Apple’s (AAPL) third-generation watch is the best deal the company offers. Starting at $199, or $179 at Amazon, you get one of the top smartwatches in the world complete with GPS, fitness tracking functionality, app connectivity, and the ability to send and receive texts via Apple’s Messages. If you’ve got some extra cash in your wallet, the latest Apple Watch, the Series 5, is $100 off at Amazon, with a new starting price of $299.Story continuesMy family bought my dad an Apple Watch Series 3, and he’s since become addicted to its fitness tracking features. Seriously, he’ll probably tell you about his daily exercise progress within 5 minutes of meeting him. It’s a real problem.Bose Noise Cancelling Headphones 700 — $299The Bose Noise Cancelling 700 Headphones feature 10 noise-cancelling levels, and are $100 off their normal price. (Image: Bose)Sometimes dad just needs a little bit of time to himself. And what better way to help him drown out the world than a pair of noise-cancelling headphones. The top of the heap, according to the experts at LaptopMag and Tom’s Guide, are the Bose Noise Cancelling Headphones 700 over-the-ear headphones. Offering 10 levels of active-noise cancelling, Bose-quality audio, and a fantastic design, the 700s are a heck of a pair of headphones. And with a $100 discount at Amazon, they’re more affordable than ever.If $299 is too pricey, you can always opt for Apple’s incredible AirPods. They don’t offer noise-cancelling technology, but at $159, or $129 on Amazon, they’re a great deal.Roku Smart Soundbar — $149The Roku Smart Soundbar features powerful audio and a built-in Roku player, at a rock-bottom price. (Image: Roku)The thinner TVs get, the worse their speakers. Which is why soundbars are such a welcome addition to many dads’ home theater setups. And Roku’s (ROKU) got the kind of soundbar that’s too good to pass up. Starting at $149, the Roku Smart Soundbar features four 2.5-inch audio drivers for fantastic sound, as well as a built-in Roku player.It’s a two-in-one package that provides audio that’s world’s better than you’ll get out of any TV on the market. And while the Smart Soundbar might not be able to match the quality of a Sonos Beam, it makes up for it in price and ease of use. Seriously, this thing is so easy to set up, your dad would have to actively try to make it more difficult.Nintendo Switch — $299The Nintendo Switch can be used with a TV or as a portable console. (AP Photo/Koji Sasahara, File)If your dad is a gamer, Nintendo’s (NTDOY) Switch is one of the best gifts you can grab. Able to be used as a mobile console or connected to a TV, the Switch, which costs $299, offers titles ranging from “Super Mario Odyssey,” “The Legend of Zelda: Breath of the Wild,” “Pokemon Sword” and “Pokemon Shield,” and “Animal Crossing: New Horizons.” If that’s not enough, Nintendo’s Switch Online gets you access to games from Nintendo’s NES and Super NES consoles.If you’re not looking to spend that much on a gift, you can also opt for the Nintendo Switch Lite for $199. While it can’t be used with a TV and has a smaller display, the Lite still gives you access to the same games, and is incredibly easy to travel with.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple could still go higher after hitting $1.5 trillion: AnalystSocial Chain CEO: Brands need to bring change that ‘lasts longer than a trending topic’Amazon customers are less happy about the service despite massive pandemic boostVenture capitalist Bradley Tusk calls for repeal of law protecting internet companiesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}