{"article": [{"url": "https://finance.yahoo.com/news/luxury-real-estate-may-be-back-as-housing-market-recovers-153905825.html", "published": 1593082040.0, "headline": "Luxury real estate may be back as the housing market recovers but beware", "body": "The housing market is recovering and so is the luxury or high-end of the market, according to at least one new report.Potential homebuyers with deep pockets have been sitting on the sidelines due to coronavirus quarantines and lockdowns. But as the country reopens, they have started to house hunt again, according to a new report by Realtor.com released Thursday morning. And it looks like sellers may be slowly following.But some experts warn that it may be too soon to pop open that bottle of Cristal.“After being cooped up in homes, luxury buyers and the rest of the market are looking for more space,” said George Raitu, senior economist at Realtor.com, adding that secondary home markets outside of major metropolitan areas like the Hamptons, right outside of New York City, are generating a lot of interest because of changing preferences. The Hamptons saw listing views increase 72% in May from a year ago.Demand for million-dollar homes in the U.S. returned to pre-coronavirus pandemic levels in May, according to Realtor.com. Searches for million-dollar homes rose 7.3% in May, outpacing the 6.2% growth before March, when the virus hit the U.S. In April, searches for pricey pads fell 9.5% from a year ago.Meanwhile, sellers of homes priced above $1 million also started to slowly come back to the market with new listings down just 15.1% year-over-year in May, compared to 57.8% in April. The report also shows luxury listing price entry point (defined by Realtor.com as the top 5% of homes listed) reached $2.97 million, up 0.5% from April and up 6.1% from the same time a year ago.Even the high-end market in New York City is seeing some sign of life. Just a month earlier, the coronavirus lockdowns basically ground the city’s luxury housing market to a halt. There were seven contracts totaling $85.275 million signed for properties being sold for at least $4 million the week ending June 8, the highest number and total dollar volume in the past 12 weeks (since the pandemic started), according to residential brokerage Olshan Realty Inc.Story continuesView from Central Park of the Dakota, the Langham and the San Remo apartment buildings at Central Park West, in the Upper West Side of Manhattan, New York CityEarlier this month, developer JDS Development told The Wall Street Journal that two units, asking roughly $30 million each, entered into contract at its condominium being built on what is known as Manhattan’s Billionaires’ Row. One contract was signed in March, when the virus peaked, and the other was signed at the end of May.But some experts aren’t as bullish about the luxury real estate comeback.“The economy and the real estate market are virus dependent,” said Donna Olshan, president of her namesake brokerage, noting that the latest weekly results from her report provide “a spark of hope.”While housing data is pointing in a positive direction, coronavirus cases are spiking in Arizona, Florida, Texas and California, and New York, New Jersey and Connecticut announced restrictions on travelers from the Sun Belt states. Some worry what all of this means for real estate activity.“In my 40 years as a real estate professional, I have seen many markets but I have never seen a pandemic and there are just too many factors involved to make a prediction short or long term,“ Olshan added.Amanda Fung is an editor at Yahoo FinanceRead moreUS home price growth picked up in March despite COVID-19Coronavirus hammers the already battered NYC luxury housing marketEconomist on housing: ‘You can’t buy what’s not for sale’Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}