{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-august-29-2020-202214668.html", "published": 1599118760.0, "headline": "Jobless claims: Another 881,000 Americans filed new unemployment claims last week, as new counting method takes effect", "body": "Another 881,000 Americans filed for first-time unemployment insurance benefits last week, with the number of individuals newly put out of work last week dipping to a pandemic-era low, but remaining stubbornly elevated on a historical basis.That sum marked just the second time during the pandemic that new weekly jobless claims came in below 1 million. Thursday’s report, however, also represented the first time the US Department of Labor (DOL) counted new and continuing jobless claims under an updated system, which had been expected to lower the level of claims reported.Here were the main metrics expected from the DOL’s report, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended Aug. 29: 881,000 vs. 950,000 expectedContinuing claims, week ended Aug. 22: 13.254 million vs. 14.000 million expectedLast week, the DOL announced that it would change the way it adjusts its initial and continuing jobless claims figures to account for seasonal effects, since layoffs over the past few months were inflated by the pandemic and broke from typical seasonal work patterns seen in years past.The change was expected to lead to fewer headline claims being reported than would have been under the previous method. It also rendered comparisons to previous weeks of headline seasonally adjusted initial and continuing unemployment filings useless. Unadjusted new claims were unaffected and remained comparable over previous weeks and months.Unadjusted new weekly jobless claims totaled 833,352 in the week ending August 29, rising by nearly 7,600 over the prior week, and diverging directionally from the decrease reported in the new seasonally adjusted claims. Seasonally adjusted jobless claims for the week ended August 22 totaled 1.011 million, under the old counting system.Stock futures were little changed Thursday morning as investors digested the report, with contracts on the three major indices holding slightly lower after a record-setting rally on Wednesday.Story continuesMost states reported week-on-week declines in their number of new unadjusted claims last week, led by Florida with a decrease of more than 12,000. However, California starkly broke from this trend, with the state reporting an increase of nearly 40,000 unadjusted new jobless claims to bring its one-week total to about 237,000.Jobless claims during the pandemic, March-August 2020 (David Foster/Yahoo Finance)Previously, seasonal adjustments were made on a multiplicative basis, in which the level of claims was multiplied by the expected percentage of increase or decrease that typically happened during a given week, due to seasonal workers starting or ending jobs. But with the new methodology, seasonal adjustments will instead be made on an additive basis, with the DOL adding or subtracting the seasonal changes rather than using a multiplication factor.“In times of relative economic stability, the multiplicative option is generally preferred over the additive option,” the DOL said in a statement last week. “However, in the presence of a large level shift in a time series, multiplicative seasonal adjustment factors can result in systematic over- or under-adjustment of the series; in such cases, additive seasonal adjustment factors are preferred since they tend to more accurately track seasonal fluctuations in the series and have smaller revisions.”The update did not, however, change the overarching takeaway from the past months’ worth of reports: the joblessness driven by the pandemic is historic.Since the pandemic took hold and drove new jobless claims above 1 million for the first time ever in mid-March, unadjusted and seasonally adjusted claims have mostly lined up at least directionally, with both surging in early spring before declining gradually in the months since. And both the unadjusted and seasonally adjusted figures for new jobless claims showed an unprecedented more than 50 million Americans filed new jobless claims between the week ended March 20 through the end of August.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}