{"article": [{"url": "https://finance.yahoo.com/news/white-house-signals-support-600-155851716.html", "published": 1596193580.0, "headline": "Trump, GOP soften on opposition to $600 jobless benefit", "body": "WASHINGTON (AP) — The White House and its GOP allies appear to be retreating from their opposition to a $600-per-week supplemental unemployment benefit that has propped up the economy and family budgets but is expiring Friday.President Donald Trump is eager to extend the benefit, undercutting his GOP allies on Capitol Hill who have spent considerable effort devising an alternative that could unite Republicans.The unemployment insurance is a principal element as talks continue on a COVID-19 relief bill, which is expected to grow considerably from a $1 trillion-plus GOP draft released this week. Top Democrats announced a meeting with administration representatives for Saturday morning after Thursday night talks at the Capitol failed to produce a breakthrough.The two sides took their case to the media Friday morning, with White House chief of staff Mark Meadows speaking to reporters on short notice at the exact moment House Speaker Nancy Pelosi appeared at her weekly news conference.Meadows accused Democrats of refusing to negotiate, saying Trump has instructed him to be “aggressive and forward-leaning” in trying to extend the supplemental jobless benefit.“Democrats have made zero offers over the last three days,” said Meadows, an inexperienced negotiator and former tea party lawmaker. He said Democrats are “willing to play politics\" and are acting like they “hold all the cards.”The White House on Thursday offered a one-week extension of the $600 weekly unemployment benefit, top Democrats said, but Pelosi rejected it, saying it needs to be addressed as part of a far more sweeping bill that would deliver aid to state and local governments, help for the poor and funding for schools and colleges to address the pandemic. Without action, the unemployment benefit runs out Friday — and both the House and Senate have left Washington.\"Clearly they did not understand the gravity of the situation,” Pelosi said. She said a short-term extension only makes sense if the two sides are close to a deal.Story continues“Why don’t we just get the job done?” she asked.An aide familiar with the talks said Pelosi rejected an administration offer of a four-month extension of the benefit at $400 per week, combined with additional provisions for particularly hard-hit businesses and a shield against lawsuits for businesses, schools and other entities that reopen as the pandemic continues to rage. The aide wasn't supposed to divulge contents of the talks and spoke to The Associated Press on condition of anonymity.Pelosi, brimming with confidence, offered a tutorial on negotiating Friday.“There are two things to remember. One is the person you’re negotiating with has to want something” for the American people, Pelosi said. “And they have to know you will walk” if you don't get a good enough agreement.Republicans in the Senate had been fighting to trim back the $600 jobless benefit in the next coronavirus package, but their resolve weakened as the expiration of the popular benefit neared — and as Trump undercut their position by signaling he wants to keep the full $600 benefit for now.“We want a temporary extension of enhanced unemployment benefits,\" Trump said at the White House on Thursday. “This will provide a critical bridge for Americans who lost their jobs to the pandemic through no fault of their own.”On Friday, Trump took to Twitter to explicitly endorse extending the $600 payment and criticizing top Senate Democrat Chuck Schumer.“Very disappointed in @SenSchumer for blocking the temporary extension of the $600 unemployment benefits. The Do Nothing Democrats are more interested in playing politics than in helping our deserving people,” Trump tweeted.There continues to be agreement among Washington's top power players that Congress must pass further relief in the coming days and weeks.“Do we want to continue to come to an agreement? Absolutely,\" Schumer said. “But it’s got to meet the gravity of the problem.”Democrats hold a strong negotiating hand — exploiting GOP divisions over whether more aid is even needed — and they are expected to deliver a necessary trove of votes.Both sides say the talks have not produced much progress, but they could be nearing a critical phase over the weekend and into next week. The pending COVID-19 rescue bill, the fifth since the pandemic has struck, is likely the last one before the November election.Republicans controlling the Senate have kept the relief measure on “pause” in a strategy aimed at reducing its price tag. But as the pandemic has worsened in past weeks — and as fractures inside the GOP have eroded the party's negotiating position — Republicans have displayed some greater flexibility.“The Democrats are playing for Nov. 3, and we’re playing for the good of the people. It is a disgrace that they are not negotiating,” Trump said Friday. “I think it’s a bad political game. I think it hurts them.”Also at issue in the negotiations is an almost $1 trillion Democratic demand for funding for state and local governments, a second $1,200 direct payment to most American adults, more than $100 billion to help schools reopen and a liability shield measure that is essential to Senate Majority Leader Mitch McConnell, R-Ky.Meadows played a role in killing an increase in food aid during talks on a $2 trillion relief bill in March, but Democrats are pressing hard for a boost in food stamp benefits. Republicans added $20 billion for agribusinesses but nothing for greater food stamp benefits.“Traditionally we’ve had a partnership between farms and families, and they’ve consistently broken that,” said Sen. Debbie Stabenow of Michigan, the top Democrat on the Senate Agriculture Committee."}]}