{"article": [{"url": "https://finance.yahoo.com/news/home-searches-reveal-that-swing-states-may-turn-blue-on-election-day-realtorcom-170428358.html", "published": 1601986340.0, "headline": "Home searches reveal that swing states may turn blue on Election Day: Realtor.com", "body": "Suburbanization could turn some swing states blue, according to a new study.Swing states that voted for President Trump in 2016 have become so attractive to city dwellers since the last presidential election that it could tip some of their electoral votes toward former vice president Joe Biden in the 2020 election, according to a Realtor.com analysis of 2017 to August 2020 home searches and 2016 geographical voting data. Home searches have historically been an accurate indicator of U.S. migration patterns.“People are looking for affordability, and that’s driving a lot of home searchers in urban areas to more rural areas,” said Danielle Hale, chief economist at Realtor.com. “It’s interesting when you look through the lens of how people in those areas have traditionally voted. Urban areas are traditionally blue, and affordable areas are traditionally red.”The analysis found that Florida, Michigan, Pennsylvania and Wisconsin — which voted for President Trump in 2016 — could vote for Democratic candidate Biden during the 2020 election due to the influx of migration from Democratic-leaning counties in Georgia and Ohio, plus the blue states of New York, New Jersey, Illinois, California, Maryland, Minnesota and Virginia. Biden was leading in each of the swing states identified by Realtor.com as of October 6, according to the most recent polls. But it’s not just swing states that are drawing city-dwelling Democrats — all 30 states that voted Republican in 2016, except Georgia, had an influx of Democrat voters during Trump’s term, including the swing states of Iowa, North Carolina and Ohio, though not enough to tip voting patterns, according to Realtor.com.“In Wyoming, 68% of voters in 2016 voted Republican. We are seeing an inflow of more people from blue states moving to Wyoming, so it could also be trending bluer, but with a 68% victory in the last election, it’s not a state we think incoming residents could change the outcome of,” said Hale.Story continuesA political poster favoring U.S. presidential candidate former Vice President Joe Biden and Senator Kamala Harris is placed on a front lawn September 11, 2020 in Scranton, Pennsylvania. Republican candidate Donald Trump won this part of northeastern Pennsylvania in 2016. (Photo by Robert Nickelsberg/Getty Images)For years, Republican states have become increasingly attractive for their business-friendly laws and affordable housing prices — especially for young people, who once drove demand for city centers but have aged into prime homebuying ages over the past five years. Only 14% of homebuyers ages 30 to 39, purchased a home in an urban or central city, with most opting for suburban or small-town homes, according to the 2020 Home Buyers and Sellers Generational Trends Report by the National Association of Realtors, which reflected pre-COVID-19 pandemic buying and selling preferences.Suburbanization only accelerated during the coronavirus pandemic as Americans weathered shelter-in-place orders from home — and decided they needed more space. But the pandemic’s impact is limited because in some states, like Wisconsin, residents have to live in the state for a period before registration.“This highlights ongoing trends that we’ve seen of affordability being a major driver of where people want to buy homes, leading them to suburban areas,” said Hale. “In all our studies this summer, we have noticed that there has been more interest in the suburbs than before the pandemic.”The Realtor.com analysis did not account for renters’ migration patterns, and analysts noted that factors such as a change in political alliances could influence moving patterns — but for the purpose of the study, analysts assumed home searchers proportionally matched voting patterns in their county of origin during the 2016 election.“Do people take their political beliefs with them? Are they going to continue to be blue voters, or is there something about living in the suburbs and rural areas that causes people to think differently and maybe shift their political opinions? That we can’t really know. But [it’s] something we’ll definitely look to after the election is completed,” Hale told Yahoo Finance.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:The cities most at risk of a housing bubble: UBSMost Latinos still believe in the American Dream of owning a home: reportHere is where Trump and Biden stand on housing issues"}]}