{"article": [{"url": "https://finance.yahoo.com/news/how-stock-gets-added-to-dow-jones-industrial-average-181311632.html", "published": 1598361680.0, "headline": "How a stock gets added to the Dow Jones Industrial Average", "body": "The Dow Jones Industrial Average is kicking out three iconic players: Exxon Mobil (XOM), Raytheon (RTX), and Pfizer (PFE), replacing them with Salesforce (CRM), Amgen (AMGN), and Honeywell (HON) on August 31.This will be the biggest major change since Walgreens Boots Alliance (WBA) kicked out GE (GE) in 2018.Unlike the S&P 500, which has a long list of eligibility requirements that some big companies can’t meet, the Dow doesn’t really have many rules in terms of how a stock gains entry to the index. To be considered for the Dow, a stock must be a non-transportation or non-utility company in the S&P 500.The Dow, which dates back to the 19th century, is “not governed by quantitative rules,” S&P Global, which runs both the Dow and the S&P 500, describes.The methodology is far more vague: “A stock is typically added only if the company has an excellent reputation, demonstrates sustained growth and is of interest to a large number of investors.”Even though the Dow is often second-fiddle to the S&P 500 in the financial world, it's on display here at the NYSE. (AP Photo/Richard Drew)Additional rules and considerations: it must be a company headquartered and incorporated in the U.S. and have a plurality of its revenue from the country, and a company must help the index maintain its desired exposure to the sector.Changes, S&P notes, are made as needed, not on any special schedule. And those changes are precipitated by market developments and corporate actions like spin-offs. They’re also announced with little lead time, between one and five days before implementation.So, who decides how a company gets on?With far fewer rules than the S&P 500 and a qualitative approach, how does a company actually get added? In lieu of a checklist-type approach, companies are literally at the mercy of a bunch of people who decide whether a company’s inclusion makes sense.On the Dow’s committee, there are two representatives from The Wall Street Journal and three from S&P Global (up until last year, S&P’s reps included one legendary stock-picker).Together, they decide after evaluating the prices and corporate actions and comparing the index to the broad market. For the Dow, share price matters because it’s how the index is weighted. That’s why Apple’s position in the Dow dropped 3% after its recent 4-to-1 stock split — even though its market capitalization didn’t budge.Story continuesOften, the committee will consider and evaluate other candidates, but this information stays confidential as getting into the Dow can be a huge boon for a company’s stock price, just as getting kicked out is considered a blow.The qualitative and somewhat arbitrary nature of the Dow’s blue chip companies has led to the index falling out of favor with many people in the financial world. (Scott Galloway recently told Yahoo Finance that it’s one of the most “dangerous numbers ever manufactured.”) Not only does it have limited methodology, the Dow committee even has leeway to make exceptions.But despite all of that, the Dow has remained the go-to market metric for millions of Americans, consistently googled far more than the S&P 500 or any other index. And for companies, being included is a really big deal.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.'A really tough spot' for employees: How companies are enforcing mask complianceCoronavirus has hurt the credit card businessYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteranMost companies plan to give raises and bonuses in 2021: surveyThe key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right now"}]}