{"article": [{"url": "https://finance.yahoo.com/news/fact-or-fiction-assessing-team-trumps-claims-about-biden-and-china-124754303.html", "published": 1592207720.0, "headline": "Fact or fiction? Assessing Team Trump’s claims about Biden and China", "body": "As the head-to-head matchup between Donald Trump and Joe Biden takes shape, the president and his allies have unleashed a range of charges about Biden’s record on China.They’ve leveled a series of charges – many of which they recently cut into a television advertisement – and have even tried to start a #BeijingBiden hashtag.In an interview with Yahoo Finance Trump economic advisor Peter Navarro added a few more claims during the wide-ranging interview.Many of the statements from Navarro and his colleagues are not backed up by the facts or lack crucial context.The move is part of a strategy shift by Trump and his allies to run against China and its handling of the coronavirus crisis just months after touting the Phase 1 trade deal. Senate Republicans are taking a similar tack.A screengrab from a recent Trumnp campaign advertisement attacking Joe Biden over his record on China.In the early stages of the pandemic, Trump tweeted and repeatedly praised China. “We’ve developed an incredible relationship,” Trump said in January. About four months later, his tone had shifted: the U.S. “wants an open and constructive relationship,” he said, but China has violated its promises.Here’s some of Team Trump’s more notable claims against Biden and some context often left out.Claims that Biden has never stood up to China on trade“China never gave our country anything. China gave us nothing. Not 10 cents. And whether it was Biden in charge of China, which was a joke because he ripped off – they ripped off our country for eight years.” - President Trump on May 1“People are going to have a very clear choice between Joe Biden, who for the last 30 years or more, has been a client of China and helped oversee the export of our manufacturing jobs. He never said a word about intellectual property theft, forced technology transfer, sweatshop labor, or pollution havens or currency manipulation.” - Peter Navarro on June 11“[Biden] has no track record at all on standing up to China and our other enemies.” - Larry Kudlow on June 5The overarching claim from Trump’s re-election effort is that Biden’s record shows he is “weak” on the issue.Story continuesOver his nearly 50-year political career, Biden has indeed generally been supportive of free-trade agreements with China and other countries. He has repeatedly pushed for closer relations between the U.S. and China.He described the two countries as “good friends” in a 2011 speech and said “a rising China is a positive, positive development, not only for China but for America and the world writ large.”As FactCheck.org put it, “while it is true that Biden has said quite positive things about China and its people, so, too, has Trump.”As Vice President, Joe Biden forged a relationship with then-Chinese Vice President Xi Jinping. (Chip Somodevilla/Getty Images)Biden has also spoken about ensuring that human rights and labor provisions are present in various trade deals. One of his key criticisms of Trump’s “Phase 1” deal was that it didn’t impose enough restrictions on things like China’s “illegal and unfair trade practices.”The Biden campaign has cast his long experience as an asset, saying it will be an advantage in office. Biden says he would only re-enter the Trans-Pacific-Partnership after renegotiating it to make sure “environmentalists are there and labor is there.”“Either China’s going to write the rules of the road for the 21st century on trade or we are,” he said.In the Senate, Biden voted to approve things like Permanent Normal Trade Relations with China in 2000. In other votes, he has opposed trade deals without what he saw as sufficient environmental and labor standards.Think tanks have offered a range of analyses of what a Biden trade policy might look like.What Biden said after Trump banned Chinese travel in January“They called me a racist. They said ‘xenophobic.’ Biden said, ‘He was xenophobic.’ Biden has now written a letter of apology because I did the right thing.” - Trump on May 4Sleepy Joe Biden (mostly his reps.) went crazy when I banned, in late January, people coming in from China. He called me “xenophobic” & then went equally “nuts” when we let in 44,000 people - until he was told they were American citizens coming home. He later apologized!— Donald J. Trump (@realDonaldTrump) May 25, 2020This is another claim that has been pulled apart by fact-checkers. Biden did talk about Trump’s “xenophobia” shortly after the administration announced the travel restrictions, but he didn’t mention the travel bans specifically in the remarks.\"You know we have right now a crisis with the coronavirus, emanating from China,\" Biden reportedly said at an event on Jan. 31, adding that this “is no time for Donald Trump’s record of hysteria and xenophobia – hysterical xenophobia – and fear-mongering to lead the way instead of science.\"We are in the midst of a crisis with the coronavirus. We need to lead the way with science — not Donald Trump’s record of hysteria, xenophobia, and fear-mongering. He is the worst possible person to lead our country through a global health emergency.— Joe Biden (@JoeBiden) February 1, 2020The Biden campaign says that the reference “was about Trump’s long record of scapegoating others” and not specifically about the travel ban. On April 3, the Biden campaign announced that the former Vice President supported Trump’s decision to impose travel restrictions on China.There’s also no evidence that Biden delivered any sort of “apology” as Trump has repeatedly claimed. The Biden campaign has denied that any letter exists.Hunter Biden and China“Beijing Biden’s son Hunter penned a $1.5 billion deal with a Chinese investment fund to make $80,000 per month from China in the months leading up to the coronavirus outbreak.” - A voicemail reportedly left for voters from the Republican National CommitteeHunter Biden “got 1.5 Billion Dollars from China despite no experience and for no apparent reason.” - Trump, October 2019Trump and his allies have been making charges about Hunter Biden’s actions in China since before the pandemic to say that his father’s record in dealing with the country is corrupt.Vice President Biden arrives in Beijing during a 2013 trip with his granddaughter Finnegan Biden and his son Hunter Biden. (REUTERS/Ng Han Guan/Pool)Factcheck.org took a look at the phone message and found that it’s “wrong in some respects and misleading in others.” Hunter Biden was indeed involved in the formation of a private equity fund with Chinese firms. The fund held $1.5 billion in total – any profit that Hunter Biden received were surely far less. The deal also occurred in 2014, long before the current pandemic.China has also rejected Trump’s calls to investigate Biden.Most importantly, for Biden’s actual record on dealing with China, Factcheck.org found “no evidence that Joe Biden used his position as vice president to enrich his son.”A claim about Biden and China and space“Contrast that with Joe Biden, who, the last time he ran for president, said that he wanted China to be a full partner in space exploration. And we just know that, under President Trump, the United States is not going to take a backseat to anybody, and certainly will not bring China along for the ride.” -- Trump Campaign Communications Director Tim Murtaugh on May 27This one is true. Then-Sen. Biden was quoted in 2008 talking about China and space in the magazine Nature.Space is an issue that Biden has not talked extensively about during his career but he did praise the SpaceX launch last month.Today, in lifting our ambitions and our imaginations to the heavens, the United States has once more reshaped the future of space travel. https://t.co/AskxceOJJU— Joe Biden (@JoeBiden) May 30, 2020Biden as ‘the most traveled Vice President to China in American history’“Joe Biden, who, you know, basically lived out of a post office box in Delaware where multinational corporations sent our jobs freely offshore, many of them to China. By his travel logs in the White House, he was the most traveled Vice President to China in American history by factors of 2 or 3 or more.” - Peter Navarro on June 11This claim – from Navarro’s Yahoo Finance interview – appears to be a new one.The idea that Biden “basically lived out of a post office box” makes little sense at any point in Biden’s career. During the pandemic, he’s been criticized for not leaving his home in Delaware enough.As recently as last week, Trump tweeted about Biden’s “sanctuary” in Wilmington. Also, during his 30-plus years in the Senate, Biden was known as “Amtrak Joe” for his habit of riding the train home each night to Delaware.Biden did, indeed, live in Washington during his time as vice president. He lived at the official residence of the vice president, just like other VPs, including Mike Pence. He also reportedly rented a home in Northern Virginia for a stretch after leaving the vice presidency.On the claim that Biden is the “most traveled Vice President to China in American history,” the truth is much less dramatic than Navarro might make it sound.Vice President Biden inside the Great Hall of the People in China in December 2013. (Lintao Zhang-Pool/Getty Images)As VP, Biden appears to have traveled to China twice in 8 years. He visited in August 2011 and then again in December 2013. The second trip – which included his son Hunter – is one that Trump’s allies are now scrutinizing.Other vice presidents, like Dick Cheney, have visited the country as part of their duties. Cheney visited in 2004. Mike Pence gave a closely watched speech on China in 2018 but doesn’t appear to have traveled there during his time in office.The White House did not respond to requests to clarify Navarro’s comments.Ben Werschkul is a producer for Yahoo Finance in Washington, D.C.Read more:‘Trump time’: Peter Navarro says the manufacturing of a coronavirus vaccine will be swift‘I actually would be tougher’: A Democrat's plan for changing the relationship with China after TrumpWhy Trump is moving closer to punishing China for the coronavirusRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn,YouTube, and reddit."}]}