{"article": [{"url": "https://finance.yahoo.com/news/corporate-america-leading-way-on-coronavirus-covid-mask-compliance-morning-brief-103429840.html", "published": 1594878140.0, "headline": "Corporate America is leading the way on mask compliance: Morning Brief", "body": "Thursday, July 16, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeWalmart is the latest national chain to mandate mask-wearing.On Wednesday, Walmart (WMT) became the latest — and largest — national chain to mandate customers wear masks inside its stores. The requirement begins at Walmart stores nationwide on July 20.In a blog post on Wednesday, Walmart noted that just 65% of its stores are located in areas where some sort of mask mandate is in place.And with 90% of the U.S. population living within 10 miles of a Walmart, the company’s announcement amounts to the most significant mask mandate put in place nationally during the COVID-19 pandemic.As my colleague Zack Guzman noted Wednesday, Walmart now joins a list that includes Starbucks (SBUX), Costco (COST), Best Buy (BBY), and Apple (AAPL) in requiring customers wear masks inside stores regardless of what local regulations allow.And so in the absence of a national, federally-driven program to mandate mask wearing in public places, Corporate America has taken up a leadership role.“While we’re certainly not the first business to require face coverings, we know this is a simple step everyone can take for their safety and the safety of others in our facilities,” Walmart said in its post.“According to the CDC, face coverings help decrease the spread of COVID-19, and because the virus can be spread by people who don’t have symptoms and don’t know they are infected, it’s critically important for everyone to wear a face covering in public and social distance.”Last month, a research note from economists at Goldman Sachs was widely circulated after the firm argued that a national mask mandate could act as a substitute for future lockdowns that would otherwise take 5% off GDP growth. The firm acknowledged that it is difficult to precisely estimate the positive impact of mask wearing on economic growth but that, “our analysis suggests that the economic benefit from a face mask mandate and increased face mask usage could be sizable.”Story continues“We know some people have differing opinions on this topic,” Walmart said in its post on Wednesday. “We also recognize the role we can play to help protect the health and well-being of the communities we serve by following the evolving guidance of health officials like the CDC.”And as AMC Theatres found out last month, catering to the anti-mask slice of your customer base is a move that will alienate far more shoppers (or in AMC’s case, moviegoers) than requiring masks be worn at stores or theaters. And in response to pushback from customers, the company quickly instituted a policy requiring moviegoers to wear masks in theaters, which are now set to re-open at the end of the month.So while wearing a mask might still be viewed as an inconvenience or a political statement by some, masks are also a part of public life in America in 2020. Gallup polling earlier this month showed that 86% of U.S. adults said they’ve worn a mask in public.And with growing evidence that mask wearing does indeed help curb the spread of the virus — and as lawmakers take steps to re-institute restrictions in several states — corporate leaders have taken it upon themselves to institute a de facto national policy on mask wearing four months into the pandemic.Because ultimately, someone had to do it.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Initial jobless claims, week ended July 11 (1.25 million vs. 1.314 million for the prior week)8:30 a.m. ET: Continuing claims, week ended July 4 (17.5 million vs. 18.062 million for the prior week)8:30 a.m. ET: Retail Sales Advance month-on-month, June (5% expected, 17.7%); Retail Sales excluding Autos & Gas, June (5% expected, 12.4% in May); Retail Sales excluding Autos month-on-month, June (5% expected, 12.4% in May)10 a.m. ET: NAHB Housing Market Index, July (61 expected, 58 in June)EarningsPre-market6:45 a.m. ET: Bank of America (BAC) is expected to report adjusted earnings of 25 cents per share7:15 a.m. ET: Morgan Stanley (MS) is expected to report adjusted earnings of $1.14 per share7:30 a.m. ET: Domino’s Pizza (DPZ) is expected to report adjusted earnings of $2.25 per share7:30 a.m. ET: Abbott Laboratories (ABT) is expected to report adjusted earnings of 42 cents per shareJohnson & Johnson (JNJ) is expected to report adjusted earnings of of $1.50 per sharePost-market4 p.m. ET: Netflix (NFLX) is set to report results after market close is expected to report adjusted earnings of $1.90 cents per shareTop NewsTop court rules against key EU-US privacy agreement in Facebook case [Yahoo Finance UK]High-profile Twitter accounts swept up in wave of apparent hacking [Reuters]American Airlines sending 25,000 furlough warnings: memo [Reuters]China’s economy returns to growth amid global virus struggle [Bloomberg]YAHOO FINANCE HIGHLIGHTSCoronavirus stimulus: Trump advisor argues against $600 unemployment extension IRS turns back to tax enforcement: ‘There’s a lot of money that’s not being paid’Ben Carson on second coronavirus economic shutdown: ‘You do that again, and you completely destroy the financial infrastructure’—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}