{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-numbers-go-from-bad-to-worse-as-states-pull-back-on-reopening-phases-172527948.html", "published": 1594038800.0, "headline": "Coronavirus update: US numbers go from bad to worse as states pull back on reopenings", "body": "The coronavirus continued its relentless march across the globe on Monday, with the U.S. recording its worst daily totals to date over the long holiday weekend, with domestic deaths closing in on nearly 130,000.The pandemic has now infected around nearly 11.5 million Monday. Meanwhile, the world’s largest economy is in the throes of a wave of new cases that has cemented its status as global epicenter, and forced states and localities to hit pause on relaxing some lockdown measures. Over 2.8 million Americans have now been diagnosed, and the sharp resurgence has public health experts worried about the lack of a cohesive federal strategy.Amid a struggle to curb cases on a state-by-state basis, California, Texas and Florida — among the most populous U.S. states — are also three of the hottest COVID-19 zones in the country.Los Angeles County saw a record-breaking 3,000 cases in a single day Friday, followed by a total of more than 7,000 cases over the holiday weekend. The county has seen a 41% rise in cases in the past three weeks.The national spike in cases is having spillover effects in recovering states. Both New York City and New Jersey have hit pause on reopening indoor dining, while Garden State Gov. Phil Murphy implemented an extension of stopping indoor dining last week.New Jersey is seeing a slight uptick in cases as some travelers return from current hotspots, while the Big Apple on Monday entered Phase 3 of its reopening as COVID-19 cases there have leveled off, but with dining rooms still closed.While the world awaits a vaccine to provide the herd immunity required to slow the virus’s spread, treatment options are seeing mixed progress.Regeneron (REGN) and Sanofi (SNY) announced halting the trial of their arthritis drug Kevzara as a potential COVID-19 treatment after it failed phase 3. Regeneron’s antibody therapy however is plowing ahead, the company announced Monday.The double antibody cocktail is being tested in a phase 3 trial for the treatment and prevention of COVID-19.Story continuesMask-wearing ‘not a partisan issue’Health experts and professionals are publicly advocating for more citizens to adopt to mask-wearing in public, hoping to dispel myths about extended wear leading to problems as the debate grows increasingly fractious.The politicizing of mask-wearing is concerning health experts who see the refusal to wear face coverings — and a general lack of political will to enforce a mandate — as a key reason why the U.S. is currently seeing a spike in cases.Hit 50K followers today and my only request is for folx to #WearAMask.— uché blackstock, md (@uche_blackstock) July 3, 2020Former FDA Commissioner Scott Gottlieb told CBS’s Face The Nation this weekend that \"easiest thing we can do is universal mask wearing” to help curb the outbreak.President Donald Trump has refused to wear a mask, as has Vice President Mike Pence. Recently, however, top Republican officials have embraced face coverings in public.“This is not a partisan issue. This is about following public health guidance. Wearing a mask is a show of respect. It means that we care for one another,” said Dr. Leana Wen, an emergency physician and visiting professor at the George Washington University’s Milken School of Public Health.Meanwhile, Dr. Craig Spencer, director of global health in emergency medicine at New York-Presbyterian/Columbia University Medical Center, dismissed concerns about mask-wearing causing hypoxia—a shortage of oxygen— which has been a concern circulating social media in recent weeks.“Early data suggest you can totally breathe just fine in them overnight too!” Spencer said on Twitter early Monday morning, after seven hours of his emergency room shift.The CDC guidelines for wearing a mask doesn’t address the oxygen concerns, but does advise that wearing a wet mask or while swimming will make it harder to breathe. Yet lack of federal leadership, and a delay in implementing mask-wearing, has exacerbated the spread in the U.S.Dr. Esther Choo, an emergency physician and professor at Oregon Health & Science University said cultural and logistical concerns were behind why the U.S. didn’t push for greater mask-wearing early on in the outbreak— despite similar pushes by Asian countries like South Korea.“We didn’t know how well masks work. We don’t have a culture of mask wearing,” Choo said. “We were going for containment. We didn’t have testing and contact tracing to pair with layered measures like masks and social distancing and hand washing.”On Monday, former Centers for Medicare and Medicaid Services Administrator Andy Slavitt said the federal government should be playing a greater role in ensuring mask availability and use.“By now every American should have access to N-95 quality masks. Every day that passes is a scandal & an epic failure of indifference of our government,” Slavitt posted on Twitter.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}