{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-ny-nj-ct-slap-restrictions-on-travelers-as-outlook-darkens-in-other-states-190809231.html", "published": 1593008180.0, "headline": "Coronavirus update: NY, NJ, CT slap restrictions on travelers as outlook darkens in key states", "body": "The U.S.’s inability to curb the coronavirus saw Arizona, Florida, Texas and California reported record jumps in COVID-19 cases on Wednesday, which prompted former hotspots on the East Coast to impose travel restrictions to their states.Read more: Travel and coronavirus: Here are the states where travelers must self-quarantineNew Jersey, New York and Connecticut announced on Wednesday that visitors would be required to quarantine upon arrival, a tough move for a highly-trafficked region that underscored how fortunes have reversed in the fast-moving pandemic.The Tri-State area was once a global epicenter of the COVID-19 crisis, but is now gradually relaxing restrictions, just as cases in the Sun Belt skyrocket, pushing up the overall domestic trend. Florida’s positivity rate hit nearly 16% in a day as the state saw its biggest single-day increase in cases and hospitalizations. Meanwhile, California reported its highest daily surge of over 7,000 cases.Although questions remain about how the NY-NJ-CT rule will be enforced, similar practices were used in Rhode Island, which had the National Guard set up at the borders to screen out-of-state visitors, as well as Hawaii. Florida previously imposed a similar ban that’s still in effect, which included checkpoints to screen drivers.The Lone Star State has emerged as a real source of concern. Texas Gov. Greg Abbott is taking heat for his comments to keep closing down as a last option — despite the state recording a record nearly 5,500 cases in a single day Tuesday. The state, the second largest in the nation, is reaching concerning levels of the outbreak amid rising positivity and hospitalization rates.Dr. Cedric Dark, an assistant professor at Baylor College of Medicine & board member with Doctors for America, told Yahoo Finance on Wednesday that Abbott’s decision to allow local leaders to implement their own masking policies may have made Texas’ outbreak worse.“Now there’s been more clarity and changes on the state level, but I fear the horse is already out of the barn,” he said.Story continuesThe U.S.’s struggles have spurred countries in Europe, which have been successfully managing their spread and fully reopening, to weigh a travel ban on visitors from the world’s largest economy.Patients without symptoms big COVID spreadersThere are over 2.3 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)On Wednesday, the Centers for Disease Control released a new report on the spread of COVID-19 among college-aged travelers, and their contacts from March 26 to April 5 to Mexico from Austin, Texas.The study concluded that 28% of the travelers tested positive — and of those one-fifth were asymptomatic.“Asymptomatic persons or those with mild symptoms likely play an important role in sustaining [coronavirus] transmission during outbreaks, especially in younger populations, such as the one described here,” the CDC wrote.“The high prevalence of asymptomatic persons underscores the importance of testing both symptomatic and asymptomatic persons after a known COVID-19 exposure,” it added.While the CDC said the study was limited in scope, and that the travelers were only tested once due to limited availability at the time, it sheds light on how higher education should proceed in the fall.“As schools and universities make decisions about reopening, it is important that they plan for isolating and testing persons with suspected COVID-19, quarantining their contacts, and implementing suggestions described in CDC’s Considerations for Institutes of Higher Education,” the authors added.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}