{"article": [{"url": "https://finance.yahoo.com/news/trump-biden-offer-clashing-visions-100544901.html", "published": 1600319600.0, "headline": "Trump, Biden offer clashing visions on reopening economy", "body": "By Trevor Hunnicutt and Jason Lange(Reuters) - The coronavirus pandemic threw millions of Americans out of work, ended the longest U.S. economic expansion on record and undermined a key argument for President Donald Trump's re-election.Now, the Republican president and his Democratic opponent in the Nov. 3 election, Joe Biden, want to convince Americans they can get the economy back on track. Here is how they want to revive it:BACK ON TRACKIn the first few months of the crisis, the U.S. Congress approved and Trump signed a series of laws pumping $3.4 trillion in stimulus aid into the economy, including help for businesses, people and local governments. Since May, the parties have not been able to agree on additional steps.Trump in August signed an executive order aimed at boosting some unemployment benefit checks that some economists said would have limited effect. He has continued to call for more stimulus spending, even after his fellow Republicans in the U.S. Senate rejected their own leaders' July proposal.The president has also pushed states to reopen as quickly as possible, even as infections increased.Biden has cautioned against reopening the economy without first ramping up coronavirus testing. The former vice president, who oversaw U.S. stimulus spending after the 2008 financial crisis, says households and local governments need more support to get through the recovery.While Trump has said further stimulus measures must include a cut to the payroll tax that finances the Social Security retirement program, Biden wants Washington to offer states more support in paying for unemployment benefits.TRADEBoth candidates say they want to boost domestic manufacturing. Trump, who ran on the issue in 2016, stepped up verbal attacks on Beijing as his administration accelerates an initiative to remove industrial supply chains from China.He has also argued that America's difficulties in procuring medical supplies internationally during the pandemic are another reason to encourage U.S. companies to avoid offshoring.Story continuesBiden offered his own made-in-American manufacturing plan, pledging to spend $700 billion on American-made products and industrial research, which he said would give at least 5 million more people a paycheck during a job-killing pandemic.He also proposed a 30.8% corporate tax rate on profits from products made overseas and sold in the United States, and would provide incentives to companies that keep jobs in the country. Companies currently pay a 21% rate, which was lowered during the Trump administration.As a senator, Biden voted in 1993 for the North American Free Trade Agreement (NAFTA), a trade pact that in part helped Mexican factories gain access to the U.S. market.Biden has criticized Trump's tariff war with China as bad for U.S. consumers and farmers. However, in 2018, he called for \"retaliation\" on countries like China which he has said subsidize industries and allow intellectual property theft.TAXESThe president, a former real estate developer, has touted 2017 tax cuts he signed into law as stimulating economic growth.Biden said the cuts benefited the wealthy and corporations. He has pledged to reverse some of those cuts, raising the marginal tax rate on the highest income earners back to 39.6%, from 37%, while also lifting investment profit taxes. He also supports raising the national minimum wage to $15 an hour from $7.25 and expanding some tax credits for lower-income workers.Trump has attacked the idea of raising taxes while the economy recovers.GREEN INVESTMENTSBiden wants to spend $2 trillion over four years to improve infrastructure, create zero-emissions public transportation, build sustainable homes and create clean-energy jobs.Trump advocates more spending on U.S. roads, bridges and airports, too, but has signaled little appetite for making \"green\" investments.GRAPHIC: Where Biden and Trump stand on key issues - https://graphics.reuters.com/USA-ELECTION/POLICY/ygdpzwarjvw/index.html(Reporting by Trevor Hunnicutt in New York and Jason Lange in Washington; Editing by Scott Malone and Jonathan Oatis)"}]}