{"article": [{"url": "https://finance.yahoo.com/news/us-airlines-face-prolonged-recovery-190320210.html", "published": 1593439880.0, "headline": "US airlines face prolonged recovery from coronavirus pandemic, Goldman predicts", "body": "The majority of U.S. airlines face a prolonged recovery from the coronavirus pandemic and subsequent economic lockdown, as a resurgence in COVID-19 cases across the country dampens passenger demand, according to a new analysis by Goldman Sachs.\"We are incorporating a slower recovery in demand into our forecasts, particularly for international markets, than we were previously,\" Goldman analyst Catherine O'Brien wrote in a note to clients on Sunday. \"We now expect traffic for the carriers in our coverage universe to recover to 2019 levels in 2023 as opposed to 2022.\"MAJOR US AIRLINES REFUNDING TICKETS FOR PASSENGERS WITH ELEVATED TEMPERATURESAlthough the analysts initially expected U.S. traffic trends to mirror those in China, they said passenger volumes have recovered at a slower pace. According to the note, that's in part because of the \"drastic decline\" in incremental COVID-19 cases in China -- which has been under 500 cases per day since early April. Comparatively, the seven-day average in the U.S. is just under 30,000 incremental cases per day.\"Given current trends, and the incremental uncertainty around additional, potential domestic US travel restrictions over the last several weeks, we now expect the pace of demand recovery in the US to be slower than we were previously expecting,\" O'Brien wrote.AMERICAN AIRLINES REMOVES VIRUS PASSENGER LIMITS STARTING JULY 1Because the analysts anticipate a slower recovery in international travel, they projected that airlines with more international exposure will see an even slower recovery. The so-called \"big three\" will see a \"relatively worse revenue performance over the next several years than more domestic-exposed peers,\" O'Brien wrote. That includes United, Delta and American, respectively.PRIVATE AIR TRAVEL TAKES OFF AFTER CORONAVIRUS DISRUPTIONAllegiant and Southwest are among the airlines least exposed to international travel. Goldman upgraded Southwest shares to buy from sell, \"as we believe the company's predominantly domestic network and industry-leading balance sheet will drive a relatively faster recovery post-COVID-19.\" They boosted their price target to $47 from $35Story continuesSouthwest shares rallied on Monday morning.Still, the analysts said they anticipate demand for air travel to ultimately return to pre-crisis levels and continue growing from there. They forecast that by 2025, the industry net income will increase by 6 percent to $15.5 billion, compared to 2019.A faster return of corporate travel, as well as a vaccine or treatment for the virus, would lead to upside risk in the forecast, they wrote.GET FOX BUSINESS ON THE GO BY CLICKING HERERelated ArticlesSecond coronavirus stimulus check under consideration: How did first $1,200 payment affect economy?Coronavirus has forever transformed travel industry, Airbnb CEO saysCirque du Soleil files for bankruptcy protection"}]}