{"article": [{"url": "https://finance.yahoo.com/news/americans-behind-on-rent-and-mortgage-payments-are-less-likely-to-vote-study-204330920.html", "published": 1602258680.0, "headline": "Americans behind on rent and mortgage payments are less likely to vote: study", "body": "Over 17 million Americans were behind on rent or mortgage payments at the end of September, according to the U.S. Census Bureau — and delinquencies could translate into lower voter turnout, according to a new study.Only 55% of Americans behind on housing costs plan to vote on November 3, compared to 79% of Americans who are up-to-date on mortgage or rent payments, according to Apartment List, a California-based rental listing website.“There is an unfortunate negative correlation between pain and participation,” said Igor Popov, chief economist at Apartment List, who noted that actual voter turnout tends to be significantly lower than polls Americans’ intentions to vote. “Economic hardship is associated with limited bandwidth to engage.”American flag hanging from the front door of a brownstone in a typical middle-class residential neighborhood in Brooklyn, New York City.Because of the coronavirus pandemic, 2020 is the first year that unpaid housing costs have been a significant variable in voting participation. Over 14% of renters and 6.4% of homeowners — 17 million Americans total — reported being behind on housing payments last month, according to the Census, though most have arranged forbearance or alternative (partial or delayed) payment schedules with landlords and lenders, according to the National Multifamily Housing Council.“2020 has really taken whatever existing disparities were there and stretched them out to very meaningful gaps,” said Popov.Renters are already less likely to vote than homeowners, and during the pandemic, renters have had significantly more financial hardship, with higher rates of unemployment and lower rates of savings. Only 48% of tenants behind on rent payments plan to vote on November 3, compared to 60% of homeowners who missed mortgage payments, according to the study.“Though pain is widespread, it’s concentrated in a lot of the occupations and demographic groups and income brackets where renters are overrepresented,” said Popov.Voting based on housing payments. Graphic by Apartment List.Voter opportunityIt could help Republicans or Democrats if they pursue the vote of Americans who are behind on housing payments this year, said Popov.Story continues“There are opportunities to engage with this group of potential voters on both ends [of the political spectrum],” said Popov. “The housing insecurity we’re facing now is not concentrated in Democratic cities or on the coasts — it’s really equivalent in counties that voted for Trump and Clinton in 2016.”President Donald Trump proved his support for renters and homeowners with his moratorium on evictions and foreclosures enacted last month, while former Vice President Joe Biden laid out a $640 billion housing plan. That plan was highlighted during the Vice Presidential debate earlier this week.“We’re looking at people who are trying to figure out how they’re going to pay rent by the end of the month, almost half of American renters are worried about whether they’re going to be able to pay rent by the end of the month,” said Vice Presidential candidate Senator Kamala Harris in the October 7 debate.“As far as I can remember and have studied, rental insecurity or housing affordability was never featured in debates,” said Popov.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:US will ‘become a renter nation,’ says real estate investorOpendoor and other iBuyers’ sales stall despite hot housing marketHome searches reveal that swing states may turn blue on Election Day: Realtor.com"}]}