{"article": [{"url": "https://finance.yahoo.com/news/why-investors-should-be-more-terrified-of-a-blue-wave-of-democrats-than-trump-being-reelected-161803655.html", "published": 1592393180.0, "headline": "Why investors should be more terrified of a 'blue wave' of Democrats than Trump being re-elected", "body": "Another four years of President Trump may not excite everyone, but it could be way better than having what’s known as a ‘blue wave’ of Democrats taking control over the House and Senate in November — at least from an investor standpoint.“I think the markets will be most concerned of what they call the blue wave, not just the executive branch going Democratic but certainly the Senate swings as well,” said Wells Fargo Investment Institute chief investment officer for wealth and investment management Darrell Cronk on Yahoo Finance’s The First Trade. “I think why they would be concerned of that, mostly, is because it would put in jeopardy the 2017 Tax Reform Act. There are discussions that certainly the Democrats would like to repeal that legislation and bring the tax rates back up somewhere around 28% to 29%, which would be pre-2017 levels. That would certainly challenge margins and earnings growth in an environment where it’s already challenged.”Of note is that there are 35 seats identified as up for grabs in the Senate in November, according to polling tracker 270toWin. Currently the Senate has 53 Republicans and 47 Democrats. In the House, Ballotpedia estimates 74 of the 435 House races are in play. The Democrats control the House, 233 to 197.But a blue wave must not be ruled out amid dissatisfaction among voters with how Trump has handled the twin crises of the COVID-19 pandemic and racial injustice.Cronk joins a yawning list of Wall Street strategists voicing concerns on a Joe Biden presidential win unleashes that blue wave in the House and Senate.In this June 11, 2020, photo, Democratic presidential candidate former Vice President Joe Biden speaks during a roundtable on economic reopening with community members in Philadelphia. Biden’s search for a running mate is entering a second round of vetting for a dwindling list of potential vice presidential nominees, with several black women in strong contention. (AP Photo/Matt Slocum)The former vice president has put forth reversing half of the president’s signature tax cuts, lifting the statutory rate to 28%. Credit Suisse estimates this change in taxes would increase the effective rate by 4% to 5%, and cut $9 off estimated S&P 500 earnings per share. Over at Goldman Sachs, it has projected that Biden’s tax plan would lead it to reduce its 2021 earnings estimate by 12%.Story continuesExperts believe Trump would continue to extend his tax cuts in a second term, which could support corporate profits and stocks.“It might put downward pressure and take a little bit of momentum out [of the market],” Cronk said of a potential Biden win.Concerning for investors right now is that the market has yet to price in a Biden win or a blue wave. If Biden pulls further ahead in the presidential race polling, market pros expect stocks to react — perhaps harshly.“The markets are not pricing in a Trump election, but they aren’t pricing it out either. Right now for whatever reason if you talk to the Irish punters, the markets haven’t yet decided which way the election is going to go. If it becomes clear it’s a Biden Democratic more progressive, higher tax environment, the market is not prepared for that at this moment. It’s not pricing it in or out, but it will,” warned SMH Group CEO George Ball on The First Trade.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Coca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}