{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-6-2020-222119969.html", "published": 1596726860.0, "headline": "Stock market news live updates: Nasdaq closes above 11,000 for the first time ever as Big Tech rallies", "body": "Stocks ended higher Thursday as investors digested better-than-expected weekly jobs data, and eyed another set of corporate earnings results and more developments around stimulus talks in Washington. The Nasdaq Composite closed above 11,000 for the first time ever, and Facebook, Apple and Amazon closed at records.[Click here to read what’s moving markets heading into Friday, August 7]The Labor Department’s report on new jobless claims showed that fewer people applied for unemployment insurance in the latest week. New jobless claims improved to a pandemic-era low of 1.19 million, but still held above the 1 million mark for a twentieth consecutive week.The print, however, followed a sharp miss in ADP’s National Employment Report on Wednesday, which showed that private employers added back just 167,000 jobs in July, where 1.2 million had been expected. It also came a day ahead of the Labor Department’s official July jobs report, set for release Friday morning.A mixed picture of economic improvement in the U.S., especially in the labor market, has added urgency for Congress to convene on a new stimulus bill to support those affected by widespread virus-related joblessness. Discussions are set to continue in Washington, though lawmakers on both sides of the aisle appear locked in a stalemate on key issues. President Donald Trump said Thursday he was working on an executive order to implement some of the key measures himself.“Fiscal stimulus that supported the economy during the first half of the year is wearing off and it’s unclear whether Congress will be able to provide more fiscal support, but for now markets continue to price that another stimulus package is a done deal,” Charlie Ripley, senior investment strategist for Allianz Investment Management, said in an email Wednesday.Meanwhile, quarterly earnings reports ahead of the opening bell Thursday came in mixed. Restaurant Brands (QSR), the parent company of Tim Horton’s and Burger King, saw second-quarter revenue slide 25% over last year to $1.05 billion, though the result topped consensus analyst estimates, and the company said it saw “substantial improvement in business performance over the course of the quarter” relative to March. Meanwhile, Hilton Worldwide Holdings (HLT) posted an even wider than expected loss, and saw its revenue per available room slide 81% over last year as consumers eschewed travel during the pandemic.Story continuesAfter market close Wednesday, a handful of smaller-cap tech companies report results that handily topped consensus estimates. Etsy (ETSY), which has benefited from an influx of consumers turning to online shopping, saw a 137% surge in in second-quarter revenue. Gross merchandise sales jumped 146%, and even in absence of face mask sales jumped 93% over last year.Roku (ROKU) also posted estimates-topping top-line results, with sales up 42% as active customers climbed by nearly the same margin to 43 million. The second quarter was the company’s best ever for increases in active accounts outside of the holiday season, with streaming as a whole growing in popularity.—4:02 p.m. ET: S&P 500 rises for fifth straight day after jobless claims beat expectations; Nasdaq Composite closes at a recordHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +21.41 (+0.64%) to 3,349.18Dow (^DJI): +185.46 (+0.68%) to 27,386.98Nasdaq (^IXIC): +109.67 (+1.00%) to 11,108.07Crude (CL=F): -$0.16 (-0.38%) to $42.03 a barrelGold (GC=F): +$24.50 (+1.20%) to $2,073.80 per ounce10-year Treasury (^TNX): -0.7 bps to yield 0.5360%—12:35 p.m. ET: Trump says he is working on an executive order for key stimulus sticking pointsPresident Donald Trump wrote in a Twitter post Thursday that he is working toward an executive order to implement some of the key measures sought in a next round of virus-related stimulus. The post came as Republican and Democratic negotiators continued to struggle to come to a consensus on the details of the next relief legislation.Upon departing the Oval Office for Ohio, I’ve notified my staff to continue working on an Executive Order with respect to Payroll Tax Cut, Eviction Protections, Unemployment Extensions, and Student Loan Repayment Options.— Donald J. Trump (@realDonaldTrump) August 6, 2020—11:24 a.m. ET: Rocket Companies opens for trading at IPO price of $18Rocket Companies (RKT), the parent company of Quicken Loans and Rocket Mortgage, opened for trading on the New York Stock Exchange at $18 per share on Thursday, matching its pricing at its initial public offering.The company’s initial public offering of 100 million shares at $18 apiece last night was a downsized offering, after the company earlier filed to sell 150 million shares at between $20 and $22 apiece.—9:50 a.m. ET: What economists are saying about the better than expected jobless claims reportInitial unemployment insurance claims moderated last week for the first time in three weeks, and fell to the lowest level since the start of the coronavirus pandemic. Still, it was the twentieth straight week that claims remained troublingly elevated at more than 1 million.Here’s what some economists told Yahoo Finance about the latest print on the labor market:“The pressure is coming off just slightly in the labor markets with unemployment claims coming down from recent highs. But we cannot be sure or not if this is good news for the recovery or whether it is the lapse in those $600 weekly checks from the federal government that is now a disincentive for some newly jobless workers to file. There are anecdotal reports that some states are tightening the eligibility requirements for unemployment benefits where jobless workers need to aggressively search for new employment opportunities to continue to receive assistance.” — Chris Rupkey, chief financial economist for MUFG Union Bank“Though the non-seasonally adjusted number of initial unemployment claims dropping is a positive sign, the pain of the coronavirus crisis is still being felt deeply throughout the labor market ... On top of all of this, the $600 expanded federal unemployment benefit has expired. In June, this $600 add-on accounted for 5.2% of all disposable income. This expiration means unemployed people’s incomes will now fall at a time when they already are struggling to pay bills and find work.” — AnnElizabeth Konkel, Indeed Hiring Lab director of economic research“With the trajectory of the recovery still unclear, today’s numbers highlight the uncertainty in the labor market. And with stimulus talks in Washington still volleying for an answer to the unemployment problem, the future is clouded. While any positive momentum is definitely welcomed, let’s keep in mind we’re still far way from pre-pandemic levels.” — Mike Loewengart, managing director of investment strategy for E-Trade Financial—9:35 a.m. ET: Stocks open flat after jobless claims dataHere were the main moves in markets, as of 9:35 a.m. ET:S&P 500 (^GSPC): -3.1 points (-0.09%) to 3,324.67Dow (^DJI): +5.56 points (+0.02%) to 27,207.08Nasdaq (^IXIC): -9.85 points (-0.08%) to 10,990.93Crude (CL=F): +$0.30 (+0.71%) to $42.49 a barrelGold (GC=F): +$21.20 (+1.03%) to $2,070.50 per ounce10-year Treasury (^TNX): -2.3 bps to yield 0.52%—8:30 a.m. ET: Jobless claims better than expected, yet still bleakWith all signs pointing to a loss of momentum in the economic recovery, 1.1 million people filed initial claims in the latest week. That figure was below consensus forecasts of 1.4 million and a drop from the previous week — yet underscoring the labor market still has a long way to go before healing. Meanwhile, the additional $600 unemployment benefit expired last week, and Congress is still hashing out a compromise.Stock futures have pared their overnight losses, yet are still pointing to a slightly lower opening on Wall Street.—7:45 a.m. ET: Premarket earnings come in mixed: Hilton posts wider loss than expected; Papa John’s reports record quarterly revenueA plethora of companies reported quarterly results ahead of market open Thursday, offering a look at the ongoing impacts of the pandemic on different industries and individual corporations. Here were some of the main takeaways:Hilton Worldwide Holdings swung to an adjusted loss per share of 61 cents, versus earnings of $1.06 in the same quarter last year. The loss was nearly twice as wide as the 31 cent loss per-share expected, and came as the company reported an 81% slide in closely watched revenue per available room. However, the company noted that its US hotels saw occupancy increase 20 percentage points from April to June.Restaurant Brands reported second-quarter adjusted earnings of 33 cents per share on revenue of $1.05 billion, topping estimates for 30 cents per share on revenue of $1.03 billion. However, total sales were still down 25% over last year, with comparable sales at Tim Horton’s down 29%, and those at Burger King down more than 13% during the quarter. The company highlighted that it saw a “substantial improvement in business performance over the course of the quarter relative to the performance we saw during the onset of the crisis globally in March.”Papa John’s reported revenue that jumped 15% over last year to a quarterly record of $460.6 million as customers continued to order pizzas during the pandemic. Second-quarter North American franchise comparable sales jumped 29.7%, more than reversing last year’s 5.3% decline during the same quarter. The company estimated that July comparable sales jumped another 30.3% in North America.Bristol-Myers Squibb delivered adjusted earnings of $1.63 per share on revenue of $10.13 billion, topping estimates for $1.49 per share on revenue of $10.02 billion. Sales for its Eliquis and Revlimid drugs – its largest sources of revenue – grew 6% to more than $2 billion each. The pharmaceutical giant also raised its full-year earnings guidance to see adjusted EPS of as much as $6.25, up from the $6.20 forecast previously.—7:27 a.m. ET Thursday: Stock futures point to a lower openHere were the main moves in markets, as of 7:27 a.m. ET:S&P 500 futures (ES=F): 3,309.5, down 6.5 points, or 0.2%Dow futures (YM=F): 27,010.00, down 45 points, or 0.17%Nasdaq futures (NQ=F): 11,074.00, down 17.75 points, or 0.16%Crude (CL=F): -$0.44 (-1.04%) to $41.75 a barrelGold (GC=F): +$13.80 (+0.67%) to $2,063.10 per ounce10-year Treasury (^TNX): -2.5 bps to yield 0.518%—6:09 p.m. ET Wednesday: Stock futures steady in late tradingHere were the main moves in equity markets, as of 6:09 p.m. ET:S&P 500 futures (ES=F): 3,316.5, up 0.5 points, or 0.02%Dow futures (YM=F): 27,052.00, down 3 points, or 0.01%Nasdaq futures (NQ=F): 11,088.00, down 3.75 points, or 0.03%A man wears a protective mask as he walks past the New York Stock Exchange on the corner of Wall and Broad streets during the coronavirus outbreak in New York City, New York, U.S., March 13, 2020. REUTERS/Lucas Jackson—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}