{"article": [{"url": "https://finance.yahoo.com/news/why-black-patients-receive-worse-care-at-the-hospital-184605237.html", "published": 1594389260.0, "headline": "Why Black patients receive worse care at the hospital", "body": "The coronavirus has exposed racial disparities in access to health care by disproportionately impacting Black Americans. The mortality rate for Black Americans, which is highest among all demographics, is 2.3 times higher than the rate for Whites, which is the lowest.“That’s just the uncomfortable reality that we live in, that Black patients and minority patients in general receive worse care, which is leading them to have worse outcomes in cardiac care, kidney disease, cancer, and so on,” Incredible Health CEO Iman Abuzeid told Yahoo Finance. “And honestly, they die more often when they go to the hospital than white patients.”Only 5% of the country’s doctors are Black, according to the Association of American Medical Colleges. Not surprisingly, Black leaders in the medical system have called for racial bias training to be part of physicians' education.A health care worker administers a COVID-19 test at a site sponsored by Community Heath of South Florida at the Martin Luther King, Jr. Clinica Campesina Health Center, during the coronavirus pandemic, Monday, July 6, 2020, in Homestead, Fla. (AP Photo/Lynne Sladky)There’s significant research detailing racial inequities in access to health care. Black patients are disproportionately less likely to be offered the life-saving invasive cardiac procedures known as cardiac catheterization than white patients. Early cancer detection is known to save lives, yet the use of colonoscopies, for instance, a procedure to diagnose cancer, is used most frequently for white male patients. Racial disparities in access to kidney transplants have also resulted from Black patients “being less likely than white patients to be rated as appropriate candidates” for the procedure.“It is critical that the health care workers reflect the same diversity of the patient population,” says Abuzeid. “There are studies that show that if you are treated by a health care worker that looks like you, not only do you report better satisfaction but your actual health care outcomes are better.” According to a Stanford University study, having Black doctors treat Black patients with heart disease could reduce the Black-white cardiovascular mortality gap by 19%.In an effort to reach racial equity between the health care worker and patient populations, Abuzeid co-founded Incredible Health, which serves as a hiring platform for nurses. The racial disparity among registered nurses is projected to be 71% white vs. 11% Black by 2030, according to the National Center for Health Workforce Analysis.Story continuesCoronavirus cases are surging in southern U.S. (Graphic: David Foster/Yahoo Finance)“[At Incredible Health] we have to consider bias all the time, because we are...a hiring platform and that’s what our software does,” says Abuzeid. “We make sure that the employers are applying to the nurses instead of the other way around, which really empowers the nurses.”Incredible Health recently launched a salary estimator to help nurses negotiate their salaries. The company also helps nurses make better-informed career decisions by listing the top 10 highest-paying states.The platform hides the current location of job applicants to help shield them from employer biases. “We removed the current location of the nurse because we noticed that recruiters were biased against nurses from specific locations and nurses that were living further away,” says Abuzeid.More from Sibile:Cost of Confederate symbols comes out of Black workers’ paychecks: EPIThe upside of Trump’s Fourth of July fireworksThe case for higher wages during coronavirus recessionMaster P on Aunt Jemima, Uncle Ben’s: ‘Those are not real people’How JPMorgan Chase is making banking ‘cool’ for black teenagersFind live stock market quotes and the latest business and finance news"}]}