{"article": [{"url": "https://finance.yahoo.com/news/largescale-airline-layoffs-could-cause-great-economic-harm-union-warns-131149509.html", "published": 1599725960.0, "headline": "Large-scale airline layoffs could cause 'great, great economic harm,' union warns", "body": "The largest airline union in North America is warning Congress that compounded economic damage from the coronavirus pandemic, beyond lost jobs, is a certainty if additional stimulus funding is not soon allocated to the industry.“If we don't support the industry what you will definitely see is a reduction in service, maybe no service in a lot of smaller communities, and definitely a cut in frequency in service in larger communities,” James Carlson, Assistant Airline Coordinator for the International Association of Machinists and Aerospace Workers, told Yahoo Finance’s The First Trade on Wednesday.With the exception of pilots, the IAMAW represents airline workers across the industry, including flight attendants, technicians, gate agents, ticketing agents, customer service workers, and ramp workers.Sara Nelson, president of the Association of Flight Attendants, speaks to flight attendants and fellow aviation workers during their protest outside the U.S. Capitol on Wednesday, Sept. 9, 2020. (Photo By Bill Clark/CQ-Roll Call, Inc via Getty Images)These U.S. workers face widespread involuntary layoffs scheduled to go into effect on October 1, absent additional funds to supplement $50 billion in relief distributed among airlines under the coronavirus stimulus package known as the CARES Act in exchange for an agreement to keep all workers on their payrolls.Of the approximately 700,000 workers currently employed in the industry, the union predicts that between 250,000 and 300,000 will lose their jobs if new funding does not come through.“The situation in the airline industry is dire,” Carlson said.“And that’s airline jobs,” Carlson said. “That’s people that are working in the industry. But we’re looking at a multiplying, ripple effect on that because for every 100 airline jobs, [there] are about 300 other jobs that are supported. Those are the folks that work at the news stands. Those are the folks that work in the airports at restaurants, in the hotel industry — so massive loss in the airline industry, but great, great economic harm all around, to come.”The union, among other labor representatives, has requested a 6-month extension of the CARES Act relief that would provide enough funding to continue the Act’s moratorium on involuntary furloughs.Story continuesSenate Republicans unveiled a scaled-back coronavirus relief package on Tuesday, but Congress has made little headway in negotiating another stimulus bill.In addition to service cuts, Carlson said the industry is vulnerable to economic shortfalls that will come from its inability to quickly get furloughed workers back up and running when passenger traffic rebounds.James Carlson speaks to Yahoo Finance's The First Trade.“It’s not like workers that work in supermarkets, for example, where if you get called back to work you can just come back to work,” Carlson said, explaining that airline and airport staff must undergo renewed background checks, drug and alcohol testing, and training that can take up to two months.‘We need Congress to do their jobs’Despite bipartisan support for additional aid, IAMAW is concerned that time is running out.“Airlines and the unions agree, but nobody can seem to get it done,” Carlson said. “We need Congress to do their jobs, and get it done, because if they don't, we're going to have a major problem on our hands.”Asked whether the union would support a measure for stimulus funds that would maintain industry jobs for fewer than 6 months, Carlson said he believes that 6 months is the appropriate amount of time to allow for the potential adoption of a COVID-19 vaccine that could spur passenger demand.Since July, major U.S. airlines have sent “warn notices” to staff both to offer voluntary leave options such as temporary furloughs and early retirement, as well as put staff on notice of potential involuntary layoffs.American Airlines (AAL) announced it could cut up to 19,000 jobs if no additional funding is received from the federal government. Delta Air Lines (DAL) has said it may have to furlough nearly 2,000 pilots. United Airlines (UAL) said it would lay off around 16,000 workers.According to Reuters, the airline reached a tentative agreement with its pilots’ union to avoid pilot furloughs.Read more:Delta, American, United end change fees in an effort to get Americans flying againAlexis Keenan is a reporter for Yahoo Finance and former litigation attorney.Follow Alexis Keenan on Twitter @alexiskweed."}]}