{"article": [{"url": "https://finance.yahoo.com/news/obamacare-flaw-subsidies-125206512.html", "published": 1594022420.0, "headline": "A 'flaw' in Obamacare is costing some Americans thousands of dollars per year", "body": "The Affordable Care Act (ACA), also known as Obamacare, expanded health care access and coverage around the country while also creating some inefficiencies in the U.S. health care system.One of the flaws, according to experts, is the stark difference between costs for those who are subsidized and unsubsidized. According to a report from eHealth, individuals with federal subsidies through the ACA pay an average of $80 per month, which is approximately $720 a year. For those who are unsubsidized, the average monthly premium for individuals was $456 — or $4,572 per year.“It’s not unreasonable to call it a flaw or a limitation in the original design,” Dr. Gerald Kominski, a professor at UCLA’s Fielding School of Public Health, told Yahoo Finance. “The intention was to try and help people who were most likely to be uninsured and also who had the most difficulty affording insurance in the marketplace.”U.S. President Barack Obama speaks on the Affordable Care Act with Vice President Joe Biden in the Rose Garden of the White House April 1, 2014 in Washington, DC. (Photo by Win McNamee/Getty Images)‘It’s the middle-class folks that get the burden there’President Obama signed the ACA into law in March 2010, and the Obamacare health care marketplaces opened for business in the fall of 2013.ACA subsidies were intended to help certain Americans pay for their health insurance premiums if they met the qualifications: They must be U.S. citizens living in the U.S., not incarcerated, and have an income that’s no more than 400% of the federal poverty level.Kominski described the threshold as “a balance between trying to provide the most health care to the most people [and] how much this will cost the federal government.”An insurance agent from Sunshine Life and Health Advisors speaks with Marvin Mojica as he shops for insurance under the Affordable Care Act on November 1, 2017 in Miami, Florida. (Photo by Joe Raedle/Getty Images)In 2019, the federal poverty level was $12,490. If an individual made more than $49,960 a year, they wouldn’t qualify for an ACA subsidy. For a family of four, the threshold would be an annual income of $103,000 (since the poverty level for a four-person household is $25,750).“As soon as you cross the threshold,” Kominski said, “suddenly the subsidies go away completely and a small change in your income can dramatically increase the amount you have to pay for health insurance if you’re buying in the marketplace. That is something that really should be corrected.”Story continues(Source: ACA Index Report on Unsubsidized Consumers in the 2020 Open Enrollment Period).The eHealth report found that individuals and families who don’t meet the subsidy threshold “are often required to pay four to five times more for comparable coverage.” A family of four can pay between $17,000-$25,000 a year for unsubsidized health care coverage, depending on whether or not they received medical care subject to the deductible.“What we’ve found is that people are just right on the cusp for paying four to five times more, comparable to their neighbors who are just under that amount,” Nathan Teater, the manager of IFP sales at eHealth, told Yahoo Finance. “The average subsidy is $500 for those who qualify. We’re really finding that it’s the middle-class folks that get the burden there, that if we expanded it just a little bit, it would encompass them and help with their costs.”‘The ACA was an important step but it doesn’t give everybody access’The candidates in the upcoming U.S. presidential election have very different approaches to Obamacare.U.S. President Donald Trump speaks to the media during a Cabinet meeting at the White House December 20, 2017 in Washington, DC. (Photo: Chris Kleponis-Pool/Getty Images)President Trump aims to eliminate Obamacare altogether, while former Vice President Joe Biden proposes fixing flaws and expanding upon the existing law.Biden’s health care plan would provide federal subsidies to everyone, regardless of income, and ensure that those enrolled in ACA coverage would pay no more than 8.5% of their income. Health insurance is deemed “unaffordable” by the ACA if the annual premiums for the lowest-priced plan costs more than 8.05% of your modified adjusted gross income in 2018.Democratic presidential candidate former Vice President Joe Biden speaks to families who have benefited from the Affordable Care Act during an event on June 25, 2020 in Lancaster, Pennsylvania. (Photo by Joshua Roberts/Getty Images)In the meantime, some states have pursued routes of extending subsidies on their own. California, for example, extended subsidies up to 600% of poverty, which would be an income of up to approximately $150,000 for a family of four.“This report calls attention to it but again for those of us who work in this field and are trying to move the country further to get to universal access — because the ACA was an important step but it doesn’t give everybody access to health insurance — we’re well aware this is a limitation and more is necessary to get truly everybody in the country insured,” Kominski said.Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Coronavirus: Health care experts call for nationwide special enrollment periodU.S. nursing homes face 'a crisis on top of a crisis' with coronavirus and funding woesPresident Trump doubles down on dismantling Obamacare amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}