{"article": [{"url": "https://finance.yahoo.com/news/teachers-education-system-coronavirus-140050666.html", "published": 1598605700.0, "headline": "47% of teachers considered making a job change in the past month: survey", "body": "The 2020 back-to-school season is unconventional and highly unpredictable as the ongoing coronavirus pandemic rages on. Despite many planned reopenings, teachers are still trying to figure out what a successful classroom will look like this year.While many of the country’s largest public school districts, including Los Angeles, Chicago and Houston, have opted to stay virtual through the end of 2020, many rural and suburban communities are experiencing the whiplash of planned reopenings, then abrupt closings. Georgia’s Cherokee County School District currently has 1,200 teachers and students quarantined because of the coronavirus.Amid this tumultuous environment, nearly half (47%) of educators said that they had considered making a job-related change in the last month including taking a leave of absence, retiring, changing their career, or teaching a pod, according to a new survey released Friday morning. Seventeen percent of teachers contemplated pivoting professions entirely.Teachers Pay Teachers (TpT), a widely used U.S. marketplace for lesson plans, learning menus and activities surveyed 1,200 Pre-K to grade 12 teachers online between August 19-21. Eighty-five percent of U.S. teachers, or around 6 million users, buy, sell or share resources on TpT, according to the company.Thirty-two percent of survey respondents said that their morale was low, while 24% indicated morale was high, likely reflecting the eagerness to return closer to normalcy than the spring semester.Thirty-eight percent of teachers feel they can provide effective instruction in their current district’s learning model. Those instructing children face-to-face felt the most confident, with 57% of teachers preparing for in-person instruction feeling good about having a successful school year. Compare that to the 31% of educators preparing for remote instruction and 26% who are implementing or preparing for hybrid instruction, which is completely unfamiliar territory.Story continuesFifth-grade teacher Amanda Cardona talks with 9-year-old Ray Urias about the assignment Tuesday morning, Aug. 25, 2020, in her classroom at St. John's Episcopal School in Odessa Texas. Classes at St. John Episcopal School resumed with a limited classroom student size of 12. (Ben Powell/Odessa American via AP)Many parents, especially those who can afford to homeschool or provide pod-based learning, don’t have confidence in their school administrators, creating opportunity for new education tech companies to fill in the gaps.TpT did not break out primary and secondary educators’ responses, but according to the CDC’s memo on how school administrators can prepare a safe return, adolescents between 10- to 17-years-old may be more likely than young children to become infected with the coronavirus, though teens don’t appear to be at higher risk of developing severe illness. There are currently a higher proportion of COVID-19 cases among Hispanic/Latino children as compared to non-Hispanic white children.Of course, the outbreaks in individual schools are merely a microcosm of the town or city at large.“The most important thing is that we need control in our communities...Anywhere there's virus circulating, where you have test positivity above 3% or 5%, as we're seeing in a lot of places in this country, it's going to be really hard to keep schools open,” Dr. Craig Spencer, an emergency medicine physician and director of Global Health and Emergency Medicine at Columbia University, recently told Yahoo Finance.Teachers, who already found themselves overworked and underpaid prior the pandemic, have been trying to create a semblance of normalcy for their students. Fifty-eight percent of teachers are focusing on distance learning lessons, 38% have been investing in social and emotional learning (SEL) and 38% have been developing classroom culture in a virtual environment.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Serial tech entrepreneur launches ambitious alternative to school: 'It's a very progressive approach to education'The 'modest, unorthodox' newsroom? An experiment marks a new era for digital mediaCoronavirus: US teachers try to ‘bring normalcy’ amid ‘very unique time in their little lives’WNBA Commissioner: 'There is nothing political about Black Lives Matter'"}]}