{"article": [{"url": "https://finance.yahoo.com/news/federal-reserve-jackson-hole-preview-average-inflation-targeting-182750554.html", "published": 1598448920.0, "headline": "Jackson Hole Preview: Fed to take on 'deliberately vague' approach to targeting 2% inflation", "body": "How high and for how long would the Federal Reserve let prices rise before raising interest rates?Those are the core questions ahead of Fed Chairman Jerome Powell’s speech scheduled for Thursday morning, in which the world’s most powerful central banker may unveil changes to the way the Fed approaches its 2% target on inflation.The expectation is for the Fed to unveil a strategy known as flexible average inflation targeting, where policymakers tolerate prices rising above 2% for periods of time to compensate for other periods of time when inflation is running below target.But in the midst of a global pandemic and with mathematical challenges behind getting an average of 2% inflation, the strategy may open the door for more questions than answers.“The new framework will be deliberately vague – it will be a long way from a mechanical rule with actual numbers,” wrote Capital Economics chief U.S. economist Paul Ashworth.So what would flexible average inflation targeting look like? And what does the Fed hope to do with it?The problemSince the Fed adopted the 2% target in 2012, actual inflation has drifted below its goal. Core personal consumption expenditures (the central bank’s preferred measure of inflation, which excludes energy and food prices) has averaged only about 1.6%, touching 2% only briefly in 2018.The Fed, in addition to other central banks around the world, feel 2% is the magic number to support healthy levels of consumption.But steering inflation is like walking a tightrope; rampant inflation brings back nightmares of the runaway prices in the 1970s but persistently low inflation could signal an economy suffering from below-potential levels of consumption and investment.The (possible) solutionA flexible average inflation targeting strategy would allow the Fed to overshoot its 2% target to compensate for periods of time when inflation has run below its target.But basic mathematics shows that achieving an average of 2% depends heavily on the window of time in question and how much undershooting the Fed is trying to compensate for.Story continuesFor example: if the Fed was trying to “make up” for all inflation misses since November 2008, the Fed would need 42 years of 2.1% year-over-year core PCE inflation to average out to 2%, based on estimates from Bank of America’s fixed income research team.Esther George, left, President and CEO of the Federal Reserve Bank of Kansas City, John Williams, center, President and CEO of the Federal Reserve Bank of New York, and Jerome Powell, Chairman of the Board of Governors of the Federal Reserve System walk together at the Jackson Hole Economic Policy Symposium on Friday, Aug. 24, 2018. (AP Photo/Jonathan Crosby)The Fed may not want to lock themselves into a policy with such a wide range of outcomes. Goldman Sachs wrote in a note Tuesday that the Fed is therefore unlikely to take on any strategy “explicitly tracking and committing to make up for past downside misses.”Instead, the Fed may informally aim for inflation between 2% and 2.5% when the economy is at or near full employment.This would advance thinking already communicated by Fed officials, who have been vocal in recent years over the idea of letting inflation run over its target.Problems with the (possible) solutionSkanda Amarnath, director of research and analysis at Employ America, told Yahoo Finance that average inflation targeting comes with some risks. For example, inflation data can be volatile based on temporary industry-level shocks outside of the Fed’s control (such as weather).“By sort of making yourself really locked in on inflation, there’s a very strong risk in certain environments, you are going to overemphasize the inflation process which is just a function of a lot of messy things,” Amarnath said.Inflation is also already a difficult concept to communicate, especially when consumers tend to associate price increases most closely with the costs of groceries or gasoline (two components not counted in the Fed’s preferred measure of core PCE).“When we talk about inflation not hitting a target, you find that the general public, that often doesn't resonate,” Kansas City Fed President Esther George told Yahoo Finance ahead of Powell’s speech. “And they can be perplexed as to why we would be worried about inflation being too low when what they may be seeing in their daily purchases suggest it's not an issue.”Amarnath also expects the Fed to announce some average inflation targeting scheme, but said after a year of listening tours, he would have hoped for a more impactful change with an elevated emphasis on wages.“It’s a missed opportunity,” Amarnath said.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.KC Fed's George: US economy well-positioned 'to recover at some point'World Bank's Malpass: China needs to 'fully participate' in debt reliefWorld Bank's David Malpass: 'Inequality problem is gigantic'Fed will not cap U.S. Treasury yields for the time beingA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}