{"article": [{"url": "https://finance.yahoo.com/news/record-number-of-workers-hired-in-may-job-openings-labor-turnover-jolts-morning-brief-101630007.html", "published": 1594185860.0, "headline": "A record number of workers were hired in May: Morning Brief", "body": "Wednesday, July 8, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeOne month of record hiring won’t come close to fixing the labor market.The labor market is in a fragile state.Last week, the June jobs report showed a net 4.8 million jobs were added to the economy though the unemployment rate remains elevated at 11.1%.And this comes as weekly initial jobless claims have been north of 1 million for three months and the spread of COVID-19 has accelerated in recent weeks, threatening the economic progress made in the last few months.On Tuesday, May data on hiring, firing, and job openings during the month showed that while a record number of hires were made in May there are still severe dislocations in the labor market.The BLS on Tuesday released the Job Openings and Labor Turnover Survey — commonly known as the JOLTS report — for May showed there were 6.49 million hires against 4.15 million separations.In April, some 9.98 million separations were recorded against just 4.06 million hires. Back in March, separations totaled 14.64 million.The situation in the labor market — like much of the rest of the economy — has stabilized at worst and improved nicely at best. But there remains a long way between this condition and anything resembling the economic health seen just six or nine months ago.“While this is encouraging, the latest jobless claims data suggest that the labor market is still bleeding jobs – with initial claims for unemployment at 2.3 [million] last week (including [Pandemic Unemployment Assistance] claims),” said Lydia Boussour, senior U.S. economist at Oxford Economics.As we’ve written previously, in this crisis investors have grown quite enthused about dynamics in the economy no longer getting worse. But not worse is a long way from good.\"It is not surprising that the data from May show the beginning of a bounceback for the labor market,” said Nick Bunker, director of research at the Indeed Hiring Lab.Story continues“Layoffs and discharges are settling back to levels similar to those we saw before the virus, and hiring snapped back as employers recalled workers. But employer demand for working moving forward is still depressed, as job openings are still down 23% compared to where they were in February.”In May, the number of open jobs totaled 5.4 million, a slight improvement from April but down from 7.3 million a year ago and a record 7.5 million in January 2019.Bunker and Boussour also both highlighted that the headline unemployment rate of 11.1% suggests there are just under four workers out of work for each open job. In October 2019, this ratio hit a post-crisis low of 0.8 workers unemployed for each unfilled job.For two years, the number of unemployed workers per open job was below 1. Now, there are nearly 4 folks out of work for every job open in the economy. (Source: FRED)And this ratio shows that while millions of workers are being re-hired, millions more are becoming unemployed in a looser labor market where the balance of power has swung back to employers and away from employees. A dynamic that is negative for wage gains, upward mobility, and future economic growth.“Demand remains the most pressing problem in the US labor market,” Bunker adds.“Job openings are still depressed while the pool of available jobless workers has surged. Jobless workers are currently benefiting from expanded unemployment insurance, but those programs are set to expire this month. These data suggest that even if workers start to search more intensely, they have fewer job opportunities.\"By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomyREAD MORETop NewsThe small businesses getting bailout loans aren’t what you think [Yahoo Finance]Top US home mortgage lender Quicken Loans files to go public [Reuters]Ann Taylor owner prepares bankruptcy to cut debt, stores [Bloomberg]Trump says he’s considering a ban on TikTok in the U.S. [Bloomberg]Disney says it will go ahead with Walt Disney World reopening on Saturday [Reuters]YAHOO FINANCE HIGHLIGHTSScaramucci: Trump is ‘doubling and tripling down on full-on racism’Here's the next big move this summer for the record-setting Nasdaq'The main focus for everybody right now is survival': unemployed Latina millennial—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}