{"article": [{"url": "https://finance.yahoo.com/news/chinas-retail-sales-unexpectedly-fall-041408247.html", "published": 1597360940.0, "headline": "China's economic recovery underwhelms as consumer comeback stays elusive", "body": "By Kevin Yao and Stella QiuBEIJING (Reuters) - China's retail sales slipped in July, dashing expectations for a modest rise, as consumers in the world's second-largest economy failed to shake off wariness about the coronavirus, while the factory sector's recovery struggled to pick up pace.Asian markets pulled back on Friday following the disappointing set of economic indicators, which raised concerns about the fragility of China's emergence from coronavirus.China's recovery had been gaining momentum after the pandemic paralysed huge swathes of the economy as pent-up demand, government stimulus and surprisingly resilient exports revived activity.However, July data from the National Bureau of Statistics on Friday showed weaker-than-expected year-on-year industrial output growth and retail sales extending declines into a seventh straight month. That was slightly offset by firmer property investment, which showed recent stimulus was supporting construction.Some analysts attributed the loss of momentum in the economy to the torrential rains that have flooded Southern China since June and several fresh COVID-19 outbreaks that led to partial lockdowns.\"Although there could be a modest rebound in some investment activities if the floods subside in coming months, we expect sequential recovery momentum to get weaker in H2,\" Nomura analysts said in a note, citing factors such as receding pent-up demand, diminished chances of more policy easing and rising U.S.-China tensions.Industrial output grew 4.8% in July from a year earlier, in line with June's growth but less than a forecast 5.1% rise.Retail sales dropped 1.1% on year, missing predictions for a 0.1% rise and following June's 1.8% fall.The decline in retail sales was broad based with garments, cosmetics, home appliances and furniture all worsening from June.A key exception was auto sales, which surged 12.3%, turning around from a 8.2% fall in June.Story continues\"Despite narrowing declines in investment, consumption remained weak, highlighting the lasting economic shock from the coronavirus pandemic,\" said Zhang Yi, chief economist at Zhonghai Shengrong Capital Management.\"Given we are likely to see a resurgence of COVID in the autumn and winter, it is not recommended that monetary policy be tightened too prematurely and fiscal policy stay insufficient.\"China's July nationwide survey-based jobless rate remained elevated at 5.7%, the same as June.INVESTMENT BRIGHT SPOTHelping carry the recovery, however, was investment, which was driven by the fast expansion in the property sector, with analysts expecting infrastructure spending to accelerate in coming months on the back of government support.China's economy returned to growth in the second quarter after a deep slump at the start of the year, but unexpected weakness in domestic consumption has slowed the momentum.Fixed-asset investment fell 1.6% in January-July from the same period last year, in line with expectations but slower than a 3.1% decline in the first half of the year.July property investment grew at the quickest clip since April last year, underpinned by solid construction activity and easier lending. New home prices rose at a slightly slower pace in July from a month earlier.Infrastructure investment, a powerful driver of growth, fell 1.0% year-on-year, easing from a decline of 2.7% in the first half.\"After the floods are over, I believe the reconstruction work for affected areas will boost fixed-asset investment and industrial production,\" said Iris Pang, chief economist for Greater China at ING.Another major risk is the increasingly tense U.S.-China relationship ahead of the U.S. presidential elections in November, which analysts say has prompted Beijing to focus on domestically driven growth.\"Changes in U.S.-China relations definitely have an impact on China, as well as the United States,\" statistics bureau spokesman Fu Linghui told a press conference.\"We still hope to maintain the equal and mutually beneficial development (in relations).\"(Additional reporting by Colin Qian; Editing by Sam Holmes)"}]}