{"article": [{"url": "https://finance.yahoo.com/news/postal-halts-changes-amid-outcry-041925553.html", "published": 1597793240.0, "headline": "Pelosi says postmaster has no plans to restore mail cuts", "body": "WASHINGTON (AP) — The Postal Service faced more questions and a federal lawsuit Wednesday over mail disruptions, despite assurances by President Donald Trump's postmaster general of no more service changes until after the November election — a pledge made only after a public outcry.House Speaker Nancy Pelosi said Postmaster General Louis DeJoy told her he has no intention of restoring removed blue mailboxes or sorting equipment and no plans for employee overtime. Senate Democratic leader Chuck Schumer said officials are withholding information about DeJoy's selection to the job. With the agency in turmoil, civil and voting rights advocates are suing to bring mail operations back to normal.Pelosi, D-Calif., said she told DeJoy in a phone call that his decision for a temporary pause was \"wholly insufficient and does not reverse damage already wreaked.”The uproar over the Postal Service is expected to spill out Friday as DeJoy testifies before the Senate, and Saturday as the House convenes for a rare session. The House is set to vote on legislation to reverse the service changes and provide $25 billion to shore up operations.Widespread mail disruptions have stunned Americans and led to warnings that Trump is trying to undermine the Postal Service as he rails against mail-in ballots just as millions of people are trying vote absentee to avoid polling places during the COVID-19 crisis.Civil and voting rights organizations said Wednesday they are suing to immediately halt the changes and restore operations.“We never imagined that we would be in this position with one of the oldest and most trusted institutions in our country,” said Virginia Kase, CEO of the League of Women Voters.Kase said even with DeJoy's decision to halt the changes the organization felt it had no choice but to go forward with the others in the lawsuit. “We need guarantees in place that this will not happen again, prior to the election,” she said,Story continuesAt the White House, Trump's team has insisted the president has no intention of disrupting mail delivery now or before Election Day.But Trump leveled more attacks on absentee voting. “IF YOU CAN PROTEST IN PERSON, YOU CAN VOTE IN PERSON!” the president tweeted.Schumer, who spoke to DeJoy late Tuesday, said he asked the postmaster for a written explanation of exactly what changes he was halting and if he would be restoring services.Schumer, D-N.Y., also called on the Postal Service's board of governors to provide “answers on why Mr. DeJoy was selected” for the job. Schumer said that the board told him previously “much of the information I requested was confidential and declined to provide it.”Flares also went up Wednesday over a little-noticed rule that prohibits postal workers from providing witness signatures on absentee ballots while they're working, which could impact rural Alaska voters.DeJoy, a former supply chain CEO, is a Republican donor, and the first postmaster general who did not come from the ranks of the Postal Service. He has pledged to revamp the Postal Service, which has struggled financially ever since 2006, confronting a decline in first-class mail and a new requirement to pre-fund its employee retiree healthcare benefits.On Tuesday, DeJoy said he was halting those initiatives until after the election “to avoid even the appearance of impact on election mail.”“We will deliver the nation’s election mail on time,” DeJoy said in a statement.DeJoy said he is halting the planned removal of mail-processing machines and blue collection boxes, as well as an initiative to change retail hours at post offices. He also said no mail processing facilities will be closed and said the agency has not eliminated overtime.The statement did not specify whether the agency would restore mail-sorting machines that have recently been taken offline. A Postal Service spokesman declined to comment beyond DeJoy’s statement.One initiative that DeJoy didn’t single out in his announcement was the newly imposed constraints on when mail can go out for delivery — a change postal workers have said is fueling delays.Along with the federal lawsuit, more than 20 states announced they would be suing to stop the changes.Several Democratic lawmakers have called for DeJoy to resign, but Republicans are also raising alarms over mail delivery disruptions, which are important not just for ballots, but prescription drugs and ordinary goods, especially in rural communities.Trump made clear last week that he was blocking $25 billion in emergency aid to the Postal Service, acknowledging he wanted to curtail election mail operations, as well as a Democratic proposal to provide $3.6 billion in additional election money to the states to help process an expected surge of mail-in ballots.Those funds are tangled in a broader coronavirus aid package that was approved in the House but stalled in the Senate.Senate Majority Leader Mitch McConnell, R-Ky., has said he's not interested in a separate postal bill. He is eyeing a new virus aid package that would provide $10 billion for the Postal Service.\"We’re certainly open to post office funding,\" said White House Press Secretary Kayleigh McEnany. But she said more important is broader virus relief with unemployment insurance and other aid.Some prominent Trump backers say that his focus on the postal service has not been helpful in his pitch to undecided voters.Dan Eberhart, a major Republican donor, said the president and DeJoy are right that the agency needs an overhaul. But he said the focus now “distracts” from broader campaign messages about the economy and policing issues.___Izaguirre reported from Charleston, West Virginia. Associated Press writers Aamer Madhani and Deb Riechmann in Washington, Bruce Schreiner in Frankfort, Kentucky, Gene Johnson in Seattle contributed to this report.___This story has been corrected to reflect that the name of the CEO of the League of Women Voters is Virginia Kase, not Virginia Case."}]}