{"article": [{"url": "https://finance.yahoo.com/news/nike-celebrates-the-life-and-legacy-of-kobe-bryant-with-mamba-week-140008685.html", "published": 1598173700.0, "headline": "Nike celebrates the life and legacy of Kobe Bryant with 'Mamba Week'", "body": "Nike and Kobe Bryant Logo — NIKENike (NKE) is kicking off a week-long celebration of the life and times of Kobe Bryant in what the brand is dubbing “Mamba Week.” The weeklong celebration kicks off on August 23, which would’ve been Bryant’s 42nd birthday. The tribute includes programming and product launches in honor of the NBA legend. Bryant was tragically killed in a helicopter crash on January 26 alongside his 13-year-old daughter Gianna and seven others.Grammy Award–winning artist Kendrick Lamar narrates a short biographical film about Bryant named “Better,” which opens with the line “Kobe taught us to be better.” The film features Gianna as well as a plethora of famed and amateur athletes.The five-time NBA champion was known for his amazing scoring prowess and clutch performances in big games, but perhaps what he was known most for was his signature grit, drive, and determination, which Bryant referred to as the “Mamba Mentality.”Nike will also donate $1 million to the Mamba & Mambacita Sports Foundation, whose mission is to promote the power of sport for kids.Fans gather around a mural of late NBA great Kobe Bryant and his daughter Gianna Bryant during a public memorial for them and seven others killed in a helicopter crash, at the Staples Center in Los Angeles, California, U.S., February 24, 2020. REUTERS/Kyle GrillotAccording to Nike, the foundation promises to use the funds to further Kobe’s goal of keeping kids active and putting them on a path to success in life. The brand also says that the foundation focuses explicitly on children who live in underserved communities who may face financial challenges when it comes to playing sports. The foundation also looks to provide equal sports opportunities for girls — a cause in which Bryant dedicated much of his post NBA career.“Mamba Week” will not only celebrate Kobe’s most legendary performances but also what he wore on the court. Nike is releasing five pairs of the Lakers legend’s signature shoes. The Kobe V Protro Big Stage celebrates the tenth anniversary of Bryant’s fifth and final NBA championship.Nike \"Mamba Week\" offerings — NIKEThe Kobe V Protro 5x Champ was designed after the championship jackets Kobe was gifted after winning his second and third titles. One pair of the Kobe V Protro x Undefeated “What If” pack features the colors of the 12 teams that passed on drafting Kobe in the 1996 NBA draft. The second pair features a simple yet striking white-and-gold colorway.Story continuesInspired by Greek mythology’s Medusa and her ability to freeze onlookers, the final shoe in the collection is the Kobe V Protro Girls EYBL. It features a green upper paired with gold accents and snake-scale detailing. Nike will also release a limited edition Black Los Angeles Lakers City Edition Jersey, which features both of Bryant’s uniform numbers. Eight is featured on the front and 24 is featured on the back. Each item in the collection will release on its own day, beginning on August 23rd and ending on August 29.Reggie Wade is a writer for Yahoo Finance. Follow him on Twitter at @ReggieWade.Read more:Nike responds to George Floyd attack: Don’t do it — ‘Don’t turn your back on racism’Nike sells out of Kobe Bryant kicks and merchandiseNike exec explains why the company broke up with AmazonAlmost half of teachers work a second job: survey96% of teachers personally pay for students’ supplies: SurveyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}