{"article": [{"url": "https://finance.yahoo.com/news/u-justice-departments-google-lawsuit-012709333.html", "published": 1599165320.0, "headline": "U.S. Justice Department's Google lawsuit expected in weeks ahead: sources", "body": "WASHINGTON (Reuters) - The Justice Department, which has been conducting an antitrust investigation of Alphabet Inc's Google, plans to bring a lawsuit against Google as soon as this month, according to two sources familiar with the probe, who said the focus remains on search and advertising.Deputy Attorney General Jeff Rosen told Reuters last month that the Justice Department was moving \"full tilt\" on a probe of Google and other Big Tech platforms.A complaint, which had been expected around Labor Day, is now expected this month but potentially as late as mid-October, and is likely to focus on two sets of allegations, the sources said.A person briefed on the matter confirmed that some career Justice Department attorneys have pushed to delay filing of a case pending further work, while Attorney General William Barr has pressed to move faster.Barr told the Wall Street Journal last month that he was \"hoping to make a decision by the end of the summer\" on the Google probe.The department is focusing on allegations that Google violates antitrust law by favoring its own businesses, for example YouTube, in search results rather than presenting neutral search results, the sources said.A Federal Trade Commission (FTC) probe of Google that included this allegation and wrapped up in 2013 found no justification to take action on it.Since then, the European Union has fined Google $2.6 billion for favoring its own price-comparison shopping service over smaller European rivals.Executives knowledgeable about the advertising industry have alleged that Google abuses its dominance in display search advertising by requiring companies that want to use Google's popular ad exchange to also use Google Ad Manager to serve their ads. This has pushed several ad tech companies to switch to other businesses.\"While we continue to engage with ongoing investigations, our focus is firmly on providing free services that help people every day, lower costs for small businesses, and enable increased choice and competition,\" Google spokesperson Jose Castaneda said.Story continuesThe Justice Department had no immediate comment.A lawsuit would be the next big step in an investigation that the Justice Department said in July 2019 it opened to determine whether major technology firms engage in anticompetitive practices. The FTC is probing Facebook Inc and Amazon.com Inc.Parallel to the Justice Department, a large group of state attorneys general are probing Google and holding regular meetings with federal law enforcers. At least 12 of these will likely sign on to the Justice Department lawsuit, and perhaps many more, one of the sources said.There is some concern among Democratic state attorneys general that the federal government will move too fast and file a lawsuit that needs more work, the second source said. A third source agreed.(Reporting by Diane Bartz; Additional reporting by Paresh Dave and David Shepardson; Editing by Leslie Adler)"}]}