{"article": [{"url": "https://finance.yahoo.com/news/43-of-retail-investors-are-trading-with-leverage-survey-172744302.html", "published": 1599654920.0, "headline": "43% of retail investors are trading with leverage: survey", "body": "It’s no secret retail investors have been a force in the current bull market, shoveling money into stocks and reaping the benefits of a strong market.Six months into the pandemic, the bullishness has continued. Investors are trading more and even getting into options and margin — two forms of leverage that can magnify wins, but also losses.According to a Yahoo Finance-Harris poll published on Sept. 9, 33% of people holding stock indicated they’ve been trading more since the pandemic began and a similar number said they’re trading individual stocks more, as opposed to ETFs and mutual funds. The poll surveyed more than 1,000 Americans, from Sept. 4 to Sept. 6.On a similarly bullish note, 36% indicated they’ve increased the amount of stock exposure in their portfolio. At the same time, just 16% and 17% own less stock and trade less stock, respectively.Interestingly, respondents with household income less than $50,000 said they traded more frequently since the pandemic and had more stock exposure, even more than the $100,000 or more group. The middle tier of earners, with income between $50,000 and $100,000, were more conservative.So: Trading is up, single stock action is up, and overall market exposure is up.Interestingly, the bullishness has pushed some retail investors into the world of leverage: 43% of retail investors said they are using options, margin, or both. Twenty-three percent of respondents are just using options and 10% are just using margin, which is borrowing money to trade — either borrowing to buy or borrowing to sell a stock short. These strategies amplify gains, but they also magnify losses, which exposes an investor to significant downside risk.(Yahoo Finance)Options trading is easy on platforms like Robinhood and is a very useful financial instrument to hedge risk, but many retail market observers like Chris Larkin, managing director of trading and investment product at E*Trade, are concerned they’re used too much for speculation.Story continuesThe survey’s high options numbers echoed other evidence that we're in an options boom. In 2020 so far, there has been an average of 28 million options contracts per day, up 45% from last year, according to the Options Clearing Corp. The increased options use has been accompanied by stories of riches, but also of heartbreak.Concentrated investors timing the marketThe poll also dove into one area of the coronavirus bull market: the fact that the rally has been largely led by a small number of stocks. The market-cap weighted S&P 500, for example, has become so concentrated by a few mega-cap stocks like Facebook, Apple, Amazon, Microsoft, and Google, that it’s become a problem for some mutual funds. And when these tech stocks got hit this week, the entire index plummeted because of their outsize influence.Though we know investors have been trading individual stocks more, the poll results show this concentration in more detail.(AP Photo/Mark Lennihan, File)More than one in five (21%) respondents with stock positions own Amazon (AMZN), with 19% owning Facebook (FB), 18% owning Netflix (NFLX), 17% owning Apple (AAPL), and 11% owning Tesla (TSLA). On the other hand, 53% of retail investors surveyed don’t own any of those stocks, meaning that a significant number of people are looking to less flashy stocks – or mutual funds and ETFs.(Yahoo Finance)While these mega-cap companies might be held for years, just under half (44%) of the survey respondents said they have been trying to time the market — a fairly high number. And for those investors actively trying to take advantage of the market’s moves, the average number of trades per month is 4.5.With the rise of commission-free trading across the big brokerages like Schwab, E*Trade, and TD Ameritrade, as well as upstart Robinhood, this was the first time retail investors could trade without paying $7 or so each time amid wild volatility in the market and they’re doing a lot of tinkering. The Yahoo Finance-Harris poll results align with anecdotal data from brokerages showing that young people these days have a big appetite for risk.More poll data from Yahoo Finance and the Harris Poll here.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Why the 2020 rally doesn’t feel like a bubble: hedge fund veteranStock split behavior confuses billionaire and analystsMutual funds have a FAAMG problemNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}