{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-states-struggle-to-balance-reopening-with-creeping-rise-in-cases-152556563.html", "published": 1592390000.0, "headline": "Coronavirus update: States struggle to balance reopening with creeping rise in cases", "body": "A patchwork approach among states to curb the unchecked coronavirus outbreak raised new concerns among public health experts, as the pandemic heaps pressure on the drug industry to meet lofty expectations surrounding effective treatments.Globally, deaths on Wednesday ballooned past 444,000, while cases climb to 8.2 million. In the U.S., more than 2.1 million have been diagnosed, while nearly 117,000 have died. In hard-hit Latin America, where the president of Honduras and his wife tested positive for COVID-19, Brazil is quickly threatening to become the second country to top a million cases.Texas saw its largest daily increase Tuesday, and while Gov. Greg Abbott has encouraged mask-wearing, he prevented cities from enforcing it in an April executive order. Arizona is also making officials nervous as cases and hospitalizations soar; meanwhile, Florida — where Miami decided to pause its reopening on Tuesday — currently leads with daily cases counts nationally.Meanwhile, political rallies are a growing concern as President Donald Trump is due in Tulsa this weekend — the first in months. A judge denied an emergency request to stop the rally Tuesday.As states continue to relax restrictive orders shutting down the economy, models project the U.S. will surpass 200,000 deaths by October — which is likely if 600 to 1,000 deaths continue to be reported daily. The world’s largest economy continues to report about 20,000 cases per day.But Dr. Leana Wen, an emergency physician and professor of health policy and management at the George Washington University's Milken School of Public Health, told Yahoo Finance that spiraling case counts don’t have be the reality.“We should not treat this as inevitable because models are based on people’s behavior. It’s not static like a weather forecast,” Wen told Yahoo Finance’s “The Ticker” on Wednesday.You’re not going to be able to stop a hurricane, but you can stop infections and you can prevent deaths,” she added.Story continuesBehaviors such as wearing masks, maintaining physical distance and meeting outdoors rather than indoors are all ways touted by public health experts to reduce transmission risk.Here are the five states with the greatest change in the number of people currently hospitalized. A rising Arizona is about to cross a falling New York. pic.twitter.com/ny80q6Ei5M— The COVID Tracking Project (@COVID19Tracking) June 16, 2020Vaccine deadline loomsThere are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Despite promising news of a generic steroid shown to reduce deaths in the sickest of patients, all hopes remain pinned on a vaccine proving effective by the end of 2020 — a timeline most public health experts say is ambitious at best.Nevertheless, companies are plugging away at a solution. Sinopharm, a Chinese biotech, announced its vaccine has a 100% antibody response to Covid-19, while Germany’s CureVac is slated to begin trials for its mRNA vaccine candidate.China’s biotechs are on track to win the global vaccine race, with two others — Sinovac and CanSino — also reporting favorable trial results. Previously, the world’s second largest economy said it would have a vaccine ready for early September.The mRNA technology is a prominent force among the leading vaccine candidates, including Moderna (MRNA) and Pfizer (PFE), but it is untested in the market. Meanwhile, other leaders are largely using traditional vaccine routes like weakened virus strains, or existing technology like recombinant vaccines.Still, concerns have been raised about White House pressure to produce a vaccine and what impact that could have on the safety of the vaccines.Some companies, like Johnson & Johnson (JNJ) moved up their timelines from clinical trials beginning in September to July. And others shifted from end of year timelines to September for definitive results, all within the past two months.Health experts believe that a successful candidate can be identified by the end of the year, but any successful vaccine will likely go to the most vulnerable individuals first — including the elderly and those with underlying conditions— as well as frontline health and essential workers.Senior officials of Operation Warp Speed told reporters Tuesday that those who cannot afford the vaccine would be provided it for free.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}