{"article": [{"url": "https://finance.yahoo.com/news/cdc-education-schools-coronavirus-pandemic-204734531.html", "published": 1595606120.0, "headline": "'The urgency is real': CDC and Education Department join White House push to open schools amid coronavirus pandemic", "body": "The top U.S. public health agency and Education Department (ED) are echoing the White House’s calls to reopen schools amid the coronavirus pandemic.On Friday, officials from the Centers for Disease Control and Prevention (CDC) told reporters that the agency has been consulting with states and schools to help them with their reopening plans.“President Trump is leading a great American recovery — an essential part of that recovery is getting our kids back in school,” ED Deputy Secretary Mitchell Zais added on the call. “The default needs to be that schools are fully open and operational in the fall so that students can resume full-time learning. And in areas where there are hotspots, remote and distance learning might need to be adopted for a certain amount of time.”Zais asserted that the “research and science continue to suggest that it is safer, healthier, and better for students to be in school full time,” stressing that to the department, \"it's not a matter of if it should be done, but rather how it must be done.”President Donald Trump told reporters on Thursday that reopening schools is “critical to ensuring that parents can go to work and provide for their families.” On Friday, Zais noted: “The urgency is real.”U.S. President Donald Trump stands next to a U.S. map of reported coronavirus cases as he speaks about the administration's plan for reopening schools. (PHOTO: REUTERS/Kevin Lamarque)White House Press Secretary Kayleigh McEnany, citing CDC data, told reporters Friday afternoon that “even if there is transmission… we believe that students should be going back to school because the effect on a child… they are not affected the same way as an adult.” When pressed by a reporter on the transmission rate, she added: “We believe our teachers are essential” and cited an increase in child abuse cases due to the lack of in-person schooling. “That’s a tragedy and our schools must reopen.”The CDC on Thursday also released a checklist for K-12 school administrators preparing to reopen in fall 2020.Some of these recommendations include frequently cleaning and disinfecting frequently touched surfaces, and implementing social distancing, cloth face coverings, and more.Story continuesCalifornia and Texas are still two of the biggest coronavirus hotspots in the U.S. (Graphic: David Foster/Yahoo Finance)School districts weigh fall plansEducation Week’s tracker that lists schools’ reopening plans shows that as of July 23, nine of the 15 largest school districts chose to go remote only, affecting over 2 million students.School districts in Los Angeles, Clark County in Nevada, Puerto Rico, Broward County in Florida, and Houston have all opted for remote learning only. New York City and the Hawaii Department of Education both opted for a hybrid approach, with both in-person and remote learning.School districts Miami-Dade and Hillsborough, both in Florida, meanwhile, will both offer full in-person learning for all students.“A majority of the nation right now actually has positivity rates that are less than 5%,” which are “not inconsistent with their guidance,” CDC Director Redfield noted to reporters on Friday.Epidemiologists generally agree that community spread of coronavirus cannot be controlled if the positivity rate of those tested is above 5%. On the call with reporters, CDC officials cited the 5% threshold for schools remaining open in a given locale.Professor Carol Dysinger of New York University's Tisch School of the Arts, conducts her final remote office hour for the graduate school's filmmaking students at her apartment in Brooklyn. (PHOTO: Robert Nickelsberg/Getty Images)Impact of COVID on childrenChildren (without underlying medical conditions) are at lower risk for contracting COVID-19, according to early studies of the virus, and generally show lighter symptoms if infected.As of July 21, the CDC reports that in America, 6.6% of confirmed U.S. cases and less than 0.1% of COVID-related deaths are among those less than 18 years old.But children between the ages of 10 to 19 transmit the coronavirus much like adults, one study of 5,706 COVID-19 patients from South Korea found, raising the risk for school staff.Schools have reopened in several other countries.In Denmark, the first European country to reopen schools in April, students’ reentry was staggered and class sizes were limited. Students between the ages of 2 to 12 returned first, followed by older students.Students have their temperature checked in class at Yio Chu Kang Secondary School, as schools reopen amid the coronavirus disease (COVID-19) outbreak in Singapore June 2, 2020. (PHOTO: REUTERS/Edgar Su)In Hong Kong, apart from school staff regularly disinfecting surfaces and suspending cafeteria service, students are required to wear masks every day, record their temperature every day before school, as well as socially distance themselves, EdSource reported.In Singapore, one school even went a step further than Hong Kong to motivate students to comply with the mitigation measures by providing children with additional masks that they can decorate themselves, the Straits Times reported.Not all these measures have been entirely successful, though: Israel experienced a surge in cases after reopening schools in May, prompting officials to close them again.Pressure on the CDCThe CDC and other government agencies are facing pressure from President Trump to reopen schools, even though there is considerable pushback from lawmakers and teachers’ unions.Randi Weingarten, president of the second-largest teachers’ union, the American Federation of Teachers, told Yahoo Life that if schools are going to push ahead, they need to consider the following three steps at the minimum, before they proceed:“One, containing virus surge and appropriate testing to stop outbreaks from becoming surges. Two, implementation of the necessary safety measures to prevent virus spread in schools including physical distancing, masks, deep cleaning and ventilation. And, three, the resources to make this all happen.”Weingarten continued: “Students across this country interact with hundreds of adults every day, including their educators, parents, grandparents and other caregivers, and allowing them back in schools to become potential hot spots of virus spread is, at this point, far too great a risk until caseloads go down and serious federal investments in safe and equitable reopening plans are made.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:Coronavirus: 'We cannot' put kids in schools 'if we have a very high level of transmission,' doctor warnsSchools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}