{"article": [{"url": "https://finance.yahoo.com/news/trump-tweets-super-pac-fundraising-for-black-communities-ahead-of-november-elections-002231034.html", "published": 1593199820.0, "headline": "Defeat by Tweet: New Super PAC uses Trump's go-to tool against him", "body": "With the presidential election just 130 days away, progressive activists have a renewed, fiery focus on getting Joe Biden into office. And one serial entrepreneur and social activist has committed to using Donald Trump’s favorite tool to make sure he doesn’t get re-elected.Defeat by Tweet is the Super PAC brainchild of Xander Schultz, whose day job is working at Galaxy Investment Partners, the family office of former hedge fund manager Mike Novogratz, who has made a personal pledge of $1 million.Schultz, who is white, teamed up with Black activists including Color of Change President Rashad Robinson and Black Lives Matter co-founder Patrisse Cullors to launch the micro donation-based campaign that “aims to turn Donald Trump’s controversial Twitter platform against him.” The goal is to get individuals to pledge a small money donation every time Trump tweets, which is a frequent occurrence.According to Schultz, Trump averages 30 tweets per day — or 900 per month. The campaign is encouraging donations as small as a penny per tweet. All donations will be given in Trump’s name and will be distributed into the Justice Fund, a group of 22 Black-led political organizations in swing states that aim to remove Trump from office and support Black communities.“Isn't that tweet number crazy? The guy is president of the United States. 30 tweets a day? It's an insane number. We've been organizing high-net-worth donors to give to this strategy for a few months now. We've been wanting to do a retail strategy as well, we know people want to participate and help get us past this terrible era we're in,” Schultz said in an interview with Yahoo Finance on Friday.The best way I’ve found to put positive energy behind the criminal justice reform movement.I’m proud to be a part of the @DefeatbyTweet team.Think about it, every time @realDonaldTrump tweets he funds black and brown led get out the vote organizers in the swing states. Genius. https://t.co/LYDtmy6KSD— Michael Novogratz (@novogratz) June 26, 2020In addition to Color of Change, the Justice Fund includes Electoral Justice Project (Movement for Black Lives), Black Church PAC, Black Voters Matter Fund, Michigan Liberation, Detroit Action, Our Voice Our Vote Arizona, 1Hood Power, 215 People’s Alliance and SONG Power, among others.Story continuesDefeat by Tweet is also collaborating with Movement Voter PAC, or MVP, which connects donors to local grassroots groups to mobilize voters and build long-term power for progressive politics.“These [social media] platforms are kind of in a bind. They're housing this hate speech, and people who are pushing racism and bigotry are being rewarded with a following or at least attention. I think Trump seems kind of agnostic whether it's good or bad attention, but he wants attention. And so these guys are doing this basically without consequence. And so we wanted to flip that on its head and say, collectively, we can add consequences here,” said Schultz.Translating energy into political and organizing powerBeyond the presidential election, the wide range of organizations in the Justice Fund are focused on getting voters engaged in down-ballot races. In light of the renewed momentum surrounding the Black Lives Matter movement, activists have shone a brighter spotlight on just how influential district attorneys, sheriffs and judges can be in greenlighting initiatives like police reform.Referencing his work at Galaxy investing in criminal justice reform initiatives, Schultz touts many existing relationships with Black community organizers.“We believe one of the best ways [to assist] Black communities is by building the political power they deserve and help them get the officials they deserve, the local officials they deserve. So while we're having this moment where people want to lean in and support Black communities, if we can translate that energy into political power and organizing power, we're really excited to do so,” said Schultz.This Wednesday, June 17, 2020 photo, shows the plans for a the mural being painted on Woodward Ave., in downtown Detroit. (AP Photo/Carlos Osorio)“I'm just here to be a bridge. We already have the heroes we need, they just aren't connected to all the resources. We do a lot of criminal justice reform work so we're funding a lot of these leaders already in different capacities so we've had these relationships for a while. I think in general, in life, I'm here to be a bridge and just try to connect dots as best I can,” he added.Within a few hours, Schultz said close to 1,000 donors had committed to #DefeatbyTweet, with the average donation coming in around $175 per tweet. Actors Noah Centineo and Olivia Wilde are among the influencers who have signed on to promote the initiative.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:CEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperityIf Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAnti-racism movement leads to 'Cops,' 'Gone With the Wind' being pulled from platformsAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and moreTech CEOs decry racial injustice amid George Floyd protestsJack Dorsey’s $1 billion pledge sparks discussion around UBI ‘I feel lost’: America’s freelancers left without income amid coronavirus financial crisis"}]}