{"article": [{"url": "https://finance.yahoo.com/news/u-import-prices-beat-expectations-124122330.html", "published": 1594799360.0, "headline": "U.S. manufacturing snaps back; new COVID-19 cases threaten recovery", "body": "By Lucia MutikaniWASHINGTON (Reuters) - U.S. factory output rose by the most in more than 74 years in June as motor vehicle production accelerated amid the reopening of businesses, but the nascent economic recovery was overshadowed by surging new COVID-19 infections.That was underscored by another report from the Federal Reserve on Wednesday showing a pickup in activity through early July, though the outlook remained highly uncertain and depended on the duration of the pandemic and its impact on the economy.Businesses have resumed operations after being shuttered in mid-March in an effort to slow the spread of the coronavirus. But there has been a resurgence in new infections of the respiratory illness, especially in the highly populated South and West, prompting some authorities in these regions to either shut down businesses again or pause reopenings. The economy slipped into recession in February.\"The manufacturing recovery will proceed at a much slower pace compared to the initial, partial snap-back phase,\" said Oren Klachkin, lead U.S. economist at Oxford Economics in New York. \"The renewed flaring of virus-related uncertainty will add to significant downside risks from sharply curtailed demand, supply chain disruptions and heightened economic uncertainty.\"The Fed said manufacturing production jumped 7.2% last month, the largest gain since March 1947, after climbing 3.8% in May. Despite two straight monthly increases, factory output was 11.1% below its level in February. Economists polled by Reuters had forecast manufacturing output rising 5.6% in June.Production at factories contracted at a 47.0% annualized rate in the second quarter after falling at a 5.5% pace in the January-March period. Manufacturing, which accounts for 11% of the U.S. economy, is also being constrained by the fallout from the Trump administration's trade war with China.Global supply chains remain fragile and demand for crude oil is weak, leading to lower prices that are undercutting spending by oil producers on drilling and shaft exploration equipment.Story continuesEconomists expect business spending to have contracted in the second quarter, the fifth straight quarterly decline. They believe gross domestic product dropped at its steepest pace in the second quarter since the Great Depression.Separately, the Fed said in its Beige Book report of anecdotal information on business activity collected from contacts nationwide, economic activity increased in almost all districts through early July.But the U.S. central bank noted \"outlooks remained highly uncertain, as contacts grappled with how long the COVID-19 pandemic would continue and the magnitude of its economic implications.\"That sentiment was echoed in another report from the New York Fed showing factory activity rebounding in July for the first time since February. But manufacturers in the region were less upbeat about the outlook over the next six months.Stocks on Wall Street rose on promising early data for a potential COVID-19 vaccine. The dollar fell against a basket of currencies. U.S. Treasury prices were mixed.BROAD GAINSManufacturing production in June was boosted by a 105.0% surge in the output of motor vehicles and parts, which was on top of a 120% rise in May. Still, auto output remained nearly 25% below its pre-pandemic level.Excluding autos, manufacturing production increased 3.9%. There were increases in the production of long-lasting consumer goods, business, defense and space equipment.The surge in manufacturing output combined with a 4.2% increase in utilities to offset a 2.9% slump in mining, leading to a 5.4% rise in industrial production in June. That followed a 1.4% gain in May. Oil and gas well drilling fell 18.0% and was about 70% below its year-earlier level.Industrial production contracted at a 42.6% rate in the second quarter, the largest decline since World War II, after decreasing at a 6.8% pace in the first quarter.Capacity utilization for the manufacturing sector, a measure of how fully firms are using their resources, rose 4.6 percentage points to 66.9% in June. Overall capacity use for the industrial sector rose 3.5 percentage points to 68.6%. It is 11.2 percentage points below its 1972-2019 average.\"There is little incentive to invest in capex as yet,\" said James Knightley, chief international economist at ING in New York. \"This is likely to hold back the broader recovery and is a key factor why we doubt the U.S. economy will recover all of its lost output much before the end of 2022.\"Officials at the Fed tend to look at capacity use measures for signals of how much \"slack\" remains in the economy — how far growth has room to run before it becomes inflationary.Inflation is likely to remain weak, though the risk of deflation has significantly diminished. A report from the Labor Department showed import prices accelerated 1.4% last month, the largest increase since March 2012, after rising 0.8% in May. In the 12 months through June, import prices fell 3.8% after dropping 6.2% in May.Deflation, a decline in the general price level, is harmful during a recession as consumers and businesses may delay purchases in anticipation of lower prices.(Reporting by Lucia Mutikani; Editing by Andrea Ricci)"}]}