{"article": [{"url": "https://finance.yahoo.com/news/how-to-delete-facebook-instagram-whatsapp-203559162.html", "published": 1593704600.0, "headline": "How to delete your Facebook, Instagram, and WhatsApp accounts: Tech Support", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's dilemma:“How do I delete my Facebook, Instagram, and WhatsApp accounts?”Facebook (FB) is, once again, mired in a major controversy. The current issue is an ad boycott started by the Stop Hate for Profit campaign, which is, among other things, calling for Facebook to do more to eliminate hate speech on its platform.On Wednesday, Facebook said CEO Mark Zuckerberg is open to meeting with the civil rights groups behind Stop the Hate for Profit including the NAACP, Color of Change, and the Anti-Defamation League to discuss the matter.It’s just the latest in a long string of problems the company has faced, which, after a while, can all be a bit much for some people. Thankfully, if you’re tired of Facebook’s issues, you can quickly delete all of your associated accounts. Here’s how:Saving your old dataBefore you delete Facebook there are a few things to take into account. The first is that without Facebook, you won’t be able to use Messenger. The second is that if you delete your account, you’re also saying goodbye to all of the photos and videos you’ve uploaded to the site over the years.(Image: Facebook)(Image: Facebook)You can, however, download those memories before axing your account. To do that, go into the Facebook Menu and select Settings under Settings & Privacy in the Facebook app.(Image: Facebook)Swipe down to Download Your Information and select the information you want to download, whether that’s your photos and videos or past comments and Likes. It’ll take a bit of time for Facebook to put all of that information together, but when it’s completed, you’ll have access to your data.Story continues(Image: Facebook)If you simply want to transfer your photos and videos to another service, like Google Photos, you can select Settings from the Settings & Privacy menu and swipe down to Transfer a Copy of Your Photos or Videos.(Image: Facebook)You’ll need to enter your password, then select the service you want to transfer your photos and videos to. You’ll also have to provide permission for the transfer by signing into your secondary service, but once you do, you’ll be able to send over your data.You can perform this same set of steps through the main Facebook website via your web browser.Deleting your Facebook accountNow that you’ve backed up your old photos and videos, you can say “so long” to Facebook.To delete your account, navigate to Settings in the Facebook app and select Account Ownership and Control below the Your Facebook Information heading.Choose Deactivation and Deletion, select the box next to Delete Account and tap Continue to Account Deletion.(Image: Facebook)Press Delete Account on the next page, enter your password, and you’re set.If you’re accessing Facebook through your web browser, you’ll need to click the down arrow in the top right corner of the page and select Settings.From there, click Your Facebook Information and then Deactivation and Deletion.Highlight the box next to Permanently Delete Account and select Continue to Account Deletion.(Image: Facebook)Click Delete Account on the next page, enter your password, and you’re done.Cutting your Insta addictionFacebook isn’t just composed of Facebook and Messenger, though. Instagram and WhatsApp are also part of the company’s empire.If you’re trying to reduce your addiction to Instagram, you can delete your account there too.Like Facebook, Instagram lets you download your data that you’ve uploaded to the site, so you’ll be able to get access to all of the selfies and landscapes you’ve posted to the social media site.To do that, open the Settings menu in the Instagram app and tap Security.Choose Download Data under the Data and History heading, select Request Download and enter your Instagram password. Instagram will then send all of the photos and videos you’ve uploaded since you joined the service.Once you’ve got your data, you’re ready to cut your Instagram habit at the source.Unfortunately, Instagram doesn’t let you delete your account through its app, so you’ll need to visit this web page: https://www.instagram.com/accounts/remove/request/permanent/(image: Instagram)Select the reason you want to delete your account from the drop down menu, enter your password, and you’re done.Deleting WhatsAppWhatsApp is far easier to delete than either Facebook or Instagram. If you’re looking to get rid of the service, you simply need to tap the Settings button at the bottom of the screen in the WhatsApp app and choose Account.(Image: WhatsApp)Tap Delete My Account, enter your phone number, and press Delete My Account again. And you’re finished.Image: WhatsApp)Congratulations! You’re officially free of Facebook.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple is closing stores in these 11 states amid new coronavirus outbreaksDespite growing ad boycott, Facebook is too big for many advertisers to ignoreHow iOS 14 will change your iPhone forever: Tech SupportApple’s switch from Intel to its own chip is its smartest move in yearsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}