{"article": [{"url": "https://finance.yahoo.com/news/consumer-confidence-fed-ex-earnings-what-to-know-in-markets-tuesday-211956479.html", "published": 1593448040.0, "headline": "Consumer confidence, FedEx earnings: What to know in markets Tuesday", "body": "The latest consumer confidence reading and FedEx (FDX) earnings will be in focus for investors on Tuesday.Tuesday morning, the Conference Board is scheduled to release its consumer confidence index reading for June. Economists polled by Bloomberg expect a slight rebound to 90.5 from 86.6 in May.“Consumer confidence has held up reasonably well considering the U.S. continues to combat a global pandemic,” Wells Fargo Securities economist Jay Bryson said in a note June 26. “Confidence measured by the Conference Board was down just 46 points in May from its February pre-COVID peak, and at 86.6, confidence is only as low as it was in 2014.”For some historical context, Bryson explained that during the 2008 recession, confidence plunged a total of 86.6 points to a record low of 25.3. While consumer confidence is holding up well, there are still significant risks ahead, according to Bryson.“We expect confidence rose a bit in June as states re-opening plans got underway. But, there remains risk of further declines in coming months, particularly amid increasing positive case counts,” Bryson said.HONG KONG, CHINA - 2020/05/11: A FedEx Express courier prepares the numerous packages inside the delivery truck parked on the street. (Photo by Budrul Chukrut/SOPA Images/LightRocket via Getty Images)Meanwhile, FedEx earnings after the market close will be closely watched by investors. The company is expected to report fourth-quarter adjusted earnings of $1.65 per share on $16.32 billion in revenue, according to Bloomberg-compiled data.Some analysts believe the fourth quarter will finally mark a bottom for FedEx EPS, but guidance will prove to be critical for analysts and investors moving forward.FedEx shares have been rallying as it heads into its earnings report. The stock soared 40% from the March lows; however, it is still down more than 11% year-to-date. The broader market (^GSPC) is down about 5%, and rival UPS (UPS) fell 6% during the same time period.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.48 million Americans file for unemployment benefitsWhite Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance news"}]}