{"article": [{"url": "https://finance.yahoo.com/news/multiple-showdowns-over-the-postal-service-loom-as-a-union-chief-says-trump-is-scapegoating-his-members-211442430.html", "published": 1596616040.0, "headline": "Showdowns over the Postal Service loom as a union chief says Trump is ‘scapegoating’ members", "body": "Twin disputes embroiling the U.S. Post Office are set to come to a head in the coming weeks.Democratic leaders continue to push reluctant Republicans to include money for the Postal Service in the next stimulus deal as a means to shore up the service’s precarious financial situation. The Postal Service could end up getting $25 billion or $10 billion or nothing from any deal.At the same time, the new Postmaster General is a GOP donor named Louis DeJoy, and one of his first acts in office was to announce operational changes that could lead to delays in mail delivery. The Committee on Oversight and Reform has since asked DeJoy to testify at a hearing in September to examine those changes.On Wednesday afternoon, DeJoy is reportedly set to meet with the White House and Congressional leaders working on the stimulus deal and both storylines are likely to come up.It’s all happening fewer than 100 days ahead of elections poised to generate a surge of mail-in voting, have President Trump’s political opponents increasingly describing Republicans’ actions as “sabotage.”I fear Republican sabotage of the USPS, including slowing mail delivery, is a Trump strategy to make voting by mail more difficult this fall. Request your ballots and return them as early as you can. https://t.co/LZONq8EPKE— Hillary Clinton (@HillaryClinton) August 4, 2020Trump has often railed against the USPS and voting by mail. In April, he called the agency “a joke” because of the rates it charges. He has also floated the idea of delaying the election (which he doesn’t have the power to do) because he says mail-in voting poses security issues. (Both of these claims have been refuted by fact checkers.)Mark Dimondstein, president of the American Postal Workers Union, renounced Trump’s claims during an appearance on Yahoo Finance’s The Final Round.” Trump’s “charges of massive fraud are actually fraudulent themselves,” he said, adding that Trump is “scapegoating” union members, who represent the “entire political spectrum.”Story continuesOn Tuesday, however, Trump did a partial about-face, promoting mail-in ballots in Florida, where he votes by mail.Five states have conducted their elections via mail for years, and a range of new states are set to join them in November, with full or partial voting by mail.Whether you call it Vote by Mail or Absentee Voting, in Florida the election system is Safe and Secure, Tried and True. Florida’s Voting system has been cleaned up (we defeated Democrats attempts at change), so in Florida I encourage all to request a Ballot & Vote by Mail! #MAGA— Donald J. Trump (@realDonaldTrump) August 4, 2020‘Just the opposite of what the Postal Service needs’Leaders in Washington are doing “just the opposite of what the Postal Service needs,” says Dimondstein, who asserts that “those votes will be delivered.”For long-term solvency, Dimondstein wants the Postal Service to receive a grant to help it endure the coronavirus pandemic. He says there is a projected revenue loss of $50 billion over the next 10 years “just due to COVID.”A USPS postal worker in El Centro, California in July. (Mario Tama/Getty Images)The House-passed HEROES act, which Democrats are currently using as a negotiating marker, included a $25 billion grant. Republicans have shown little interest in the provision, pointing to a $10 billion loan included in the March CARES Act, for which the Treasury Department recently announced it had reached an agreement on disbursing.“The private sector was largely taken care of,” says Dimondstein, adding that it’s “about time for Congress to take care of the public sector and something that belongs to all of us and all the people in this country.”NOTE: This post has been updated to include new information. Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:This Senator wants to bring back banking at the Post OfficePostal union chief responds to President Trump's ‘joke’ remarksTrump could wreck the Postal Service, but he can’t beat AmazonRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}