{"article": [{"url": "https://finance.yahoo.com/news/fed-keeps-cards-close-to-chest-in-approach-to-higher-inflation-201801954.html", "published": 1601565980.0, "headline": "Fed still faces questions on how high, how long it will let inflation rise", "body": "The Federal Reserve says it will allow inflation to “moderately” rise before raising interest rates, spurring confusion over how high and for how long the central bank will let prices increase.But over the last two weeks, Fed officials have insisted that the specifics behind its new approach to targeting 2% inflation will not be a concern for a while, with the central bank committing to keeping rates near-zero for at least the next few years.“Exactly how we measure it when we're so far away from where we want to be I think is a secondary concern to just trying to get the economy moving more quickly,” Boston Fed President Eric Rosengren told Yahoo Finance Sept. 24.In its last interest rate-setting meeting on Sept. 16, the Federal Open Market Committee said it hoped to nudge inflation “moderately above 2% for some time so that inflation averages 2% over time.”But some Fed watchers are scratching their heads over the vague forward guidance, with little clarity on the definitions of “moderately” and “over time.”Federal Reserve Chairman Jerome Powell, wearing a face mask, testifies before the House of Representatives Financial Services Committee during a hearing on oversight of the Treasury Department and Federal Reserve response to the outbreak of the coronavirus disease (COVID-19), on Capitol Hill in Washington, U.S., June 30, 2020. Tasos Katopodis/Pool via REUTERSNew York Fed President John Williams suggested the language is designed to be flexible.“It’s hard to say exactly what that amount should be or the amount of time it should be, because it will depend on the circumstances, will depend on what the outlook looks like and the various factors that go into that,” Williams told reporters Sept. 29.Putting a number on itOther Fed speakers have attempted to offer some clarity, with Atlanta Fed President Raphael Bostic suggesting that he would be okay with inflation rising to 2.2% or 2.3%.But the difficulty with the Fed’s new policy was made apparent shortly after the September FOMC meeting, when Chicago Fed President Charles Evans on Sept. 21 suggested that the Fed could “start raising rates before we start averaging 2%.”Markets reacted to those remarks, underscoring the “degree to which Fed communications about the new framework and new guidance is a work in progress,” said JPMorgan’s Michael Feroli.Story continuesEvans clarified two days later that a rate hike will not come for some time, adding he does “not fear stronger accommodation” even if inflation rises to 2.5% “or even a little bit more.”San Francisco Federal Reserve Bank President Mary Daly poses at the bank’s headquarters in San Francisco, California, U.S., July 16, 2019. REUTERS/Ann Saphir.Economic projections from the September FOMC meeting indicated that interest rates will likely stay near-zero at least through the end of 2023.Here’s what Fed officials have said about inflation:Fed Chairman Jerome Powell: “These won't be large overshoots and they won't be permanent. But to help anchor inflation expectations at 2%.” (Press conference, Sept. 16)Fed Vice Chairman Randal Quarles: “I likely will be even more patient in reacting to small upward deviations, given the (Fed's) move to focus on shortfalls of employment from maximum employment rather than deviations.” (Remarks at Institute of International Bankers, Sept. 23)Fed Vice Chairman Richard Clarida: “We’re not going to even begin to think about lifting off, we expect, until we actually get observed inflation — and we measure it on a year-over-year basis, equal to 2%.” (Bloomberg interview, Sept. 23)Fed Governor Lael Brainard: No remarks on inflation.Fed Governor Michelle Bowman: No remarks on inflation.Boston Fed President Eric Rosengren: “This is likely to be much more of an issue two or three years down the road...Exactly how we measure it when we're so far away from where we want to be I think is a secondary concern to just trying to get the economy moving more quickly.” (Yahoo Finance interview, Sept. 24)New York Fed President John Williams: “It’s hard to say exactly what that amount should be or the amount of time it should be, because it will depend on the circumstances, will depend on what the outlook looks like and the various factors that go into that.” (Q&A with reporters, Sept. 29)Philadelphia Fed President Patrick Harker: “Moreover, after long periods of sub-2% inflation ― as we now find ourselves in ― we will accept periods of above-2 % inflation.” (Remarks at Official Monetary and Financial Institutions Forum, Sept. 29)Cleveland Fed President Loretta Mester: “It's still far from both of our goals, I'd say, for both employment and inflation.\" Mester said. (Q&A with reporters per Reuters, Sept. 28)Richmond Fed President Thomas Barkin: “You’ll note that our language ‘average ... over time’ permits us to look at our longer-term track record, while the Chairman has made clear we are not committing to a precise formula. I’m happy with that balance, as I remain skeptical of formulaic commitments.” (Remarks at Money Marketeers of New York University, Sept. 24)Atlanta Fed President Raphael Bostic: “I’m comfortable being above 2%, and it’s actually more the trajectory than the levels. So if we were at 2.2% or 2.3% and it looked like we were going to be stable there for a while, that would be fine...by contrast if we were at 2.2%, and then the next quarter we were at 2.4%, and then we were at 2.6%, that trajectory is the thing that would give me some concern.” (Bloomberg interview, Sept. 18)Chicago Fed President Charles Evans: \"I do not fear stronger accommodation in the pursuit of clearly overshooting 2%, even to the point of 2-1/2, or even a little bit more.” (Remarks at MNI event per Reuters, Sept. 23)St. Louis Fed President James Bullard: “We’re going to fix that by having make up strategies which allow inflation to go above target for a while after we’ve missed from the low side for a while. I think this will be quite successful.” (Remarks at Boeing Center for Supply Chain Innovation, Sept. 18)Minneapolis Fed President Neel Kashkari: “Not raising rates for roughly a year after core inflation first crosses 2% is consistent with a strategy of aiming for a modest overshoot in order to achieve average inflation of 2%.” (Online blog post, Sept.18)Kansas City Fed President Esther George: No remarks on inflation.Dallas Fed President Robert Kaplan: “I am skeptical about the benefits of enhanced forward guidance at the moment because rates are already historically low and, even before this meeting, market expectations were for them to stay low for the next few years.” (Online blog post, Sept. 29)San Francisco Fed President Mary Daly: “We are going to let inflation be the guide of that... We are committed to allowing the economy to run until we find out what maximum employment means experientially — when we start seeing it show up in higher wages and higher prices.” (St. Louis Fed event per Reuters, Sept. 23)Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed extends ban on share buybacks at big banks through Q4Fed survey: Racial wealth gaps little changed since 2016Boston Fed's Rosengren: Further QE could help economy, but not as much as fiscal policyCongress debates leaning on Fed or PPP for small business aidA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}