{"article": [{"url": "https://finance.yahoo.com/news/sony-playstation-5-price-190120805.html", "published": 1591970960.0, "headline": "The PlayStation 5’s most important feature will be its price", "body": "Sony on Thursday finally took the wraps off its highly-anticipated PlayStation 5, showing the world for the first time what the next-generation console looks like and providing a glimpse at a wide variety of games that will hit the system between now and 2021.But Sony (SNE), which surprisingly revealed two versions of the console, one with a disc drive and the other without one, still hasn’t provided the most important news about the PlayStation 5: It’s price.So far, the PlayStation 5 is shaping up to be a worthy successor to the wildly-popular PlayStation 4, but that could change dramatically if Sony doesn’t get the price right.Pricey mistakesThe PlayStation 5 has the makings of quite a pricey piece of technology. From its high-powered graphics to its custom solid-state drive, the system, according to Bloomberg, is estimated to be between $499 and $549 at launch, significantly more than the $399 price of the PlayStation 4 at launch, and far more expensive than Nintendo’s (NTDOY) Switch, which starts at $299. We should hear more about pricing ahead of the PlayStation 5’s launch this holiday season.Microsoft (MSFT) is also getting set to launch its own next-generation console in the Xbox Series X. That system, which will be more powerful than Sony’s, also doesn’t have a price yet, but will likely be in the same relative neighborhood as Sony.Sony's PlayStation 5 will need to be priced right if the company hopes it to lead the next console generation. (Image: Sony)Both Sony and Microsoft have made pricing mistakes that hurt long-term console sales for their platforms. In 2006, Sony launched its PlayStation 3 console for $499 and $599 depending on the amount of storage included.Microsoft, meanwhile, launched the Xbox 360 in 2005 at $299 and $399 depending on features you wanted.Gamers, naturally, balked at the PlayStation 3’s initial pricing, opening the door for the Xbox 360 to take off. In its first attempt at a console, the original Xbox, Microsoft sold just over 24 million units, far less than the 155 million PlayStation 2 units Sony sold.Story continuesBut the high price of the PlayStation 3 gave Microsoft an edge, and in the end, the company’s lifetime Xbox 360 sales were on a par with Sony’s, with the Windows-maker selling more than 84 million units to the PlayStation 3’s 87 million units.Microsoft's Xbox Series X will go head-to-head with the PlayStation 5 this holiday season. (Image: Microsoft)With the current console generation, Sony flipped the script, selling the PlayStation 4 at launch for $399, while Microsoft sold the Xbox One for $499. The result? Sony has sold roughly 110 million units of the PlayStation 4, while Microsoft has sold just 47 million units of the Xbox One, according to VGChartz.What’s more, Nintendo’s Switch, which is significantly less powerful than the Xbox One and PlayStation 4, has eclipsed the lifetime sales of the Xbox One, despite Microsoft’s console launching in Nov. 2013 and the Switch launching in March 2017.A lower cost optionSony may be able to escape any pricing controversy, though, thanks to its decision to launch two versions of the PlayStation 5. The version without a drive could cut the price of the console by tens of dollars.With gamers increasingly turning to digital game downloads, it makes sense that Sony would offer a digital-only version of its latest system. Microsoft is expected to do the same thing with the Series X and has already released a console without a disc drive in the Xbox One S.Sony's digital-only PlayStation 5 could sell for as much as $50 less than the standard PlayStation 5. (Image: Sony)The lack of a disc drive in the PlayStation 5 and Series X could also bode well for game publishers, according to a research note by Piper Sandler analyst Yung Kim.“Including our expectation for an acceleration amid covid as consumers stayed at home, we believe a disc-free PS5 option, along with an expected similar skew for Microsoft's Xbox Series X, could boost [full game downloads] even further,” Kim wrote in his note.“We continue to believe the march toward 100% full game downloads (FGDL) on console (PC FGDL is virtually 100%) can drive material op margin expansion for each of the publishers.”Sony’s console will come out of the gate with the wind at its back thanks to the success of the PlayStation 4. Gamers who have fallen for the company’s first-party titles are sure to look to the PlayStation 5 as their first option for a next-generation console. But if the company can’t get the pricing for the system right, it could suffer the same fate as the PlayStation 3.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:5 Father’s Day tech gifts: Tech SupportApple could still go higher after hitting $1.5 trillion: AnalystSocial Chain CEO: Brands need to bring change that ‘lasts longer than a trending topic’Amazon customers are less happy about the service despite massive pandemic boostFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}