{"article": [{"url": "https://finance.yahoo.com/news/american-airlines-sending-25-000-211423218.html", "published": 1594830140.0, "headline": "American Airlines sending 25,000 furlough warnings -memo", "body": "By Tracy RucinskiCHICAGO, July 15 (Reuters) - American Airlines is sending 25,000 notices of potential furloughs to frontline workers, according to a memo released on Wednesday, preparing employees for job cuts in the fall as the coronavirus pandemic forces airlines globally to shrink.American, with more than 130,000 employees in 2019, had already warned that furloughs would be hard to avoid as pandemic-hit revenue remains more sluggish than the airline had hoped.The terms of a $25 billion payroll stimulus package awarded by U.S. Congress in March ban airlines from forced job cuts before October, and under the Worker Adjustment and Retraining Notification Act they are required to provide 60 days' notice of mass layoffs.To cut costs before October and avoid layoffs, U.S. airlines have rolled out buyouts to encourage employees to leave voluntarily.American's memo, reviewed by Reuters, offers extended leave and early out packages for frontline workers.Delta Air Lines Inc said this week it believed it could avoid furloughs in the fall after about 17,000 employees signed up for early departure deals.By encouraging more senior workers to depart, U.S. airlines could trim their labor costs - their main expense - during the recovery, giving them more pricing power. Airline union contracts require airlines to furlough junior workers first.United Airlines has sent 36,000 furlough notices, representing about 45% of workers, and Southwest Airlines has also warned that job losses will be hard to avoid.After boosting summer flying following some signs of pent-up leisure demand in May and June, some airlines are now scaling back their schedules due to a surge in COVID-19 cases across the country.The U.S. outbreak has prompted several countries to impose travel restrictions on Americans. The European Union excluded the United States from its \"safe\" travel list.Both Canada and Mexico want to extend the ban on non-essential travel at U.S. borders.Even within the United States, Americans from 22 states are required to self-quarantine for 14 days if they enter New York or New Jersey, two states that have managed to curb infections.(Reporting by Tracy Rucinski in Chicago Editing by Lisa Shumaker and Matthew Lewis)"}]}