{"article": [{"url": "https://finance.yahoo.com/news/tuesdays-debate-could-determine-whether-trumps-taxes-matter-on-election-day-201210363.html", "published": 1601306420.0, "headline": "Tuesday’s debate could determine whether Trump’s taxes matter on Election Day", "body": "The New York Times’ bombshell report Sunday about President Donald Trump’s tax returns gives the public the best view yet about how he has run his businesses and how little he’s paid in income taxes.But UBS’s global chief economist Paul Donovan says the story is of “is of itself of little interest to financial markets.” He added one big caveat: “The story matters if it has an influence on the election.”The Sept. 29 debate could change the way the public views those returns, which could in turn affect how they cast their ballots on Nov. 3. “The story probably needs to be viewed alongside Tuesday's presidential debate,” Donovan wrote.Among the 18 key takeaways the Times uncovered: Trump paid only $750 in income taxes in 2017 after paying zero in income taxes for 11 of the 18 years the Times looked at. His accounting methods are \"questionable;\" and he writes off personal expenses as tax deductions, The Times found.U.S. President Donald Trump arrives to inspect the Lordstown Motors 2021 endurance truck, an electric pickup truck, on the South Lawn at the White House in Washington, U.S., September 28, 2020. REUTERS/Carlos BarriaFor the most part, voters are decided, limiting the actual effect of stories like this. While a potential black eye for the president — pretty much everyone pays more taxes than he does — it may not have enough firepower to dislodge anyone in his base, limiting the effect to undecided voters.Debates also matter more to undecided voters, which is why Donovan views the two pieces — the tax scandal and the debate — in conjunction.If the news has the potential to move markets, it won’t be realized until after the debate as well as after any subsequent Times stories that the publication said are forthcoming regarding the inner workings of the president’s empire.So far, markets are bracing for significant volatility around election time stemming from the possibility of an uncertain and contested election that is drawn out, similar to Bush v. Gore nearly 20 years ago. That election, in 2000, sent the S&P 500 down 8% in the month after Election Day (it recovered fully, and quickly after). If it turns out that the Times investigation has hurt Trump’s chances, that’s when any effect on the markets will happen.Story continues—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Why savings accounts have fallen — and some more than othersIntergenerational conflict is getting worse, Deutsche Bank warns2 tax safe harbors that new traders need to know aboutNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggests5 rookie mistakes investors make: hedge fund veteran"}]}