{"article": [{"url": "https://finance.yahoo.com/news/earnings-fed-meeting-gdp-what-to-know-in-the-week-ahead-150113903.html", "published": 1595758160.0, "headline": "Big Tech earnings, Fed meeting, GDP: What to know in the week ahead", "body": "Investors this week are gearing up for a busy week of earnings, economic data reports and the Federal Reserve’s July monetary policy meeting.Earnings, earnings, earningsQuarterly earnings season charges ahead this week with a spate of companies across industries reporting results, with these reports reflecting what analysts expect will likely be the worst of the corporate impact from the coronavirus pandemic.As of Friday, 26% of companies in the S&P 500 had reported second-quarter results, according to FactSet’s John Butters. As expected, most companies delivered a steep drop in profits over last year, with the coronavirus pandemic sapping demand and disrupting supply chains for most firms. Still, results thus far have in aggregate exceeded Wall Street’s dismally low bar of earnings expectations.The blended earnings decline for the second quarter was -42.4% as of Friday, with this metric combining both the actual results for companies that have reported along with estimated results for companies that have yet to report, Butters said. That marked an improvement from last week, when the blended earnings decline was 44.1%.“Positive earnings surprises reported by companies in the Health Care and Information Technology sectors were mainly responsible for the decrease in the overall earnings decline during the week,” Butters said. “If -42.4% is the actual decline for the quarter, it will mark the largest year-over-year decline in earnings reported by the index since Q4 2008 (-69.1%).”Some of the major companies set to report this week include Boeing (BA), Starbucks (SBUX), General Electric (GE), Exxon Mobil (XOM), and Gilead Sciences (GILD), along with the majority of the FAANG-names including Facebook (FB), Apple (AAPL), Amazon (AMZN) and Alphabet (GOOG, GOOGL).The bevy of big tech earnings will punctuate this week’s long list of reports, with Wall Street closely monitoring this cohort to see whether results justify tech stocks’ incredible run-up over the past several months. Still, the consistent outperformance has unnerved some investors and analysts bracing for a correction, and the tech-heavy Nasdaq posted its first two-day losing streak in nearly two months last week.Story continuesAn electronic screen displays the Apple Inc. logo on the exterior of the Nasdaq Market Site following the close of the day's trading session in New York City, New York, U.S., August 2, 2018. REUTERS/Mike SegarQ2 GDPOne of the key pieces of economic information set for release this week will be the government’s first print on US gross domestic product (GDP) for the second quarter.While a backwards-looking release, the report will nevertheless reflect the depths of the economic damage induced by the coronavirus pandemic during the period when broad swaths of the country and world were forced to shut businesses and shelter in place. As with corporate profits, overall economic activity is expected to have hit a nadir during the second quarter.Consensus economists expect that GDP for the April through June period sank 35% on a quarter over quarter annualized basis. This would be by far the worst quarterly decline in US economic activity on record, and would deepen the 5% contraction seen during the first three months of the year.Thursday’s GDP report will likely include a grim picture of the US consumer, which up until the pandemic had been the growth engine of the US economy. Personal consumption comprises about two-thirds of domestic economic activity, and is expected to have plummeted 34.5% in the second quarter.“This is a consumer-led downturn, but we are likely to see substantial drags cross all major GDP components,” Bank of America economist Michelle Mayer said Friday. “That said, the quarterly print does mask the underlying picture as the economy bottomed in April with real consumption plunging 12.2% [month over month] before bounding 8.1% in May. Core retail sales and auto sales continued to recovery during June, both rising 5-6% [month over month], as the economy reopened broadly.”Still, the resurgence in coronavirus cases and state and local re-closures that began taking place in mid-June rattled what had looked to be the start of the domestic recovery both on the virus containment and economic fronts.“This recovery is at risk ... given the rising number of Covid-19 cases and states reacting to it by reintroducing containment measures that are closing businesses that had reopened,” ING chief international economist James Knightley said.Fed meetingThe Federal Open Market Committee (FOMC) is poised to assemble for its two-day July meeting this week, with a monetary policy decision and press conference from Federal Reserve Chair Jerome Powell scheduled for Wednesday.Most economists agree that this will likely be a holding meeting. Since the last FOMC meeting in June, members have telegraphed in frequent virtual conferences and interviews their commitment to keeping the benchmark interest rate at a zero lower bound (ZLB) for the time being, given the economic devastation stemming from the pandemic.“Our baseline view is that the July FOMC has no major developments,” UBS economist Seth Carpenter said in a note. “The FOMC appears to be on hold, in a very accommodative stance of policy, waiting for more evidence of the path of the economy. With the federal funds rate at zero and expected to be there for the foreseeable future, asset purchases of $80bn and $40bn per month of Treasuries and MBS [mortgage-backed securities], and a clear willingness to add liquidity if needed, the Fed does not seem to us to have an urgency to change policy stance.”At the same time, FOMC members increasingly brought up the need to offer market participants a clearer outline of the circumstances that would lead to a shift in monetary policy. To that end, the two main policy tools the Fed will be deliberating this week are over their commitments to the zero lower bound and to asset purchases, Carpenter said.Federal Reserve Chairman Jerome Powell, wearing a face mask, testifies before the House of Representatives Financial Services Committee during a hearing on oversight of the Treasury Department and Federal Reserve response to the outbreak of the coronavirus disease (COVID-19), on Capitol Hill in Washington, U.S., June 30, 2020. Tasos Katopodis/Pool via REUTERSIn public remarks since the last FOMC member, “Fed officials all agreed that monetary policy would remain accommodative for an extended period of time,” Goldman Sachs economist Jan Hatzius said. “Several Fed officials tied future forward guidance to inflation outcomes, while Dallas Fed President [Robert] Kaplan preferred a dual mandate framing,” or one that would take into account both inflation and employment outcomes.“Several officials stated that they preferred to wait for more clarity on the economic situation before implementing more specific forward guidance,” Hatzius added.Fed officials are also likely to also debate the idea of using yield curve control to reinforce their forward guidance, wherein the central bank would commit to purchasing US Treasuries of targeted maturities until their yields fall below stated levels.“Many Fed officials raised question on the current need for yield curve control, but largely agreed that it warranted further discussion,” Hatzius said.Earnings calendarMonday: Hasbro (HAS), Albertsons (ACI) before market openTuesday: Centene (CNC), Invesco (IVZ), Pfizer (PFE), 3M (MMM), McDonald’s (MCD), DR Horton (DHI), Amgen (AMGN), Raytheon (RTX), MSCI Inc (MSC), The Sherwin-Williams Co. (SHW), Harley-Davidson (HOG), JetBlue Airways (JBLU), Altria Group (MO), Xerox (XRX), S&P Global (SPGI), before market open; Mondelez International (MDLZ), Aflac (AFL), Juniper Networks (JNPR), Visa (V), Denny’s (DENN), eBay (EBAY), Akamai Technologies (AKAM), FireEye (FEYE), Starbucks (SBUX), Avis Budget Car (CAR), Wyndham Hotels and Resorts (WH), Advanced Micro Devices (AMD) after market closeWednesday: General Electric (GE), CME Group (CME), Automatic Data Processing (ADP), Wingstop (WING), Six Flags Entertainment Corp (SIX), Boeing (BA), Tupperware Brands (TUP), T Rowe Price Group (TROW), General Motors (GM), Shopify (SHOP), Spotify (SPOT) before market open; Qualcomm (QCOM), PayPal (PYPL), Facebook (FB), O’Reilly Automotive (ORLY), ServiceNow (NOW), Teladoc Health (TDOC), Raymond James Financial (RJF), Cheesecake Factory (CAKE), Apache (APA), Ameriprise Financial (AMP) after market closeThursday: United Parcel Services (UPS), Cigna (CI), Yum! Brands (YUM), Grubhub (GRUB), Eli Lilly (LLY), Comcast (CMCSA), ConocoPhillips (COP), Intercontinental Exchange (ICE), Sirius XM Holdings (SIRI), Newmont (NEM), Procter & Gamble (PG), Kraft Heinz (KHC), Mastercard (MA), Molson Coors Beverage Co. (TAP), PG&E (PCG), Moody’s Corp (MCO), Keurig Dr. Pepper (KDP), Kellogg (K) before market open; Ford (F), Apple (AAPL), Mohawk Industries (MHK), Electronic Arts (EA), Gilead Sciences (GILD), Amazon (AMZN), Alphabet (GOOG, GOOGL), Expedia (EXPE)Friday: Caterpillar (CAT), VF Corp (VFC), Under Armour (UAA), Merck & Co (MRK), Colgate-Palmolive (CL), Exxon Mobil (XOM), Dominion Energy (D), CBOE Global Markets (CBOE), Charter Communications (CHTR), AbbVie (ABBV), Chevron (CVX), Pinterest (PINS) before market openEconomic calendarMonday: Durable goods orders, June preliminary (7.0% expected, 15.7% in May); Durable goods orders excluding transportation, June preliminary (3.5% expected, 3.7% in May); Capital goods orders, non-defense excluding aircraft, June preliminary (2.4% expected, 1.6% in May); Capital goods shipments, non-defense excluding aircraft, June preliminary (2.8% expected, 1.5% in May); Dallas Fed Manufacturing Activity Index, July (-4.9 expected, -6.1 in June)Tuesday: S&P CoreLogic Case-Shiller 20-City Composite Home Price Index MoM, May (0.3% expected, 0.33% in April); Conference Board Consumer Confidence, July (94.4 expected, 98.1 in June); Richmond Fed Manufacturing Activity Index, July (5 expected, 0 in June)Wednesday: MBA Mortgage Applications, week ended July 24 (4.1% prior week); Advance goods trade balance, June (-$75.1 billion expected, -$74.3 billion in May); Wholesale inventories MoM, June preliminary (-0.3% expected, -1.2% in May); Retail inventories MoM, June (-6.1% in May); Pending home sales MoM, June (14.5% expected, 44.3% in May); Federal Open Market Committee rate decisionThursday: GDP Annualized QoQ, second quarter advanced print (-35.0% expected, -5.0% prior); Personal consumption, second quarter advanced print (-34.5% expected, -6.8% prior); Core PCE QoQ, second quarter advanced (-0.9% expected, 1.7% prior); Initial jobless claims, week ended July 25 (1.45 million expected, 1.416 million prior week); Continuing unemployment claims, week ended July 18 (16.2 million expected, 16.197 million prior week).Friday: Personal income, June (-1.0% expected, -4.2% in May); Personal spending, June (5.4% expected, 8.2% in May); PCE deflator YoY, June (0.4% expected, 0.5% in May); PCE core deflator YoY, June (1.0% expected, 1.0% in May); Employment cost index, second quarter (0.6% expected, 0.8% prior); MNI Chicago PMI, July (44 expected, 36.6 in June); University of Michigan Surveys of Consumers Sentiment, July final (72.8 expected, 73.2 in June)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}