{"article": [{"url": "https://finance.yahoo.com/news/the-wave-has-already-begun-evictions-surge-as-cities-suspend-moratorium-142522540.html", "published": 1594287200.0, "headline": "‘The wave has already begun:’ Evictions surge as cities suspend moratoriums", "body": "Legal aid groups and housing advocates are bracing for a surge in evictions, as local governments begin lifting moratoriums that deferred rent payments for millions of tenants who lost jobs to the pandemic.In Michigan, where the state is set to lift the eviction moratorium next Wednesday, Ruthie Paulson has seen a 76% spike in calls to her 211 call center, which provides social services to those most in need. Nationally, the call volume has jumped 200%.“A lot of the tenants are living in fear, day to day, not knowing if they’re going to receive a stimulus check, not knowing if they’re going to receive an unemployment check,” Paulson said. “They know that date is coming, when legally they know their landlord will be able to get a court order to officially evict them. They know they’re not going to be able to pay that money.”States that have already lifted the moratorium have seen a dramatic spike in eviction cases. In Memphis, Shelby County courts faced a backlog of 9,000 eviction cases when hearings resumed last month. In Milwaukee, eviction filings spiked 15% since the city’s moratorium was lifted, according to data from the Eviction Lab. Columbus, Ohio, converted the city’s convention center into a socially-distanced housing court to prepare for the impending wave of evictions and homelessness.“In many ways, the wave has already begun. We need to work to stop it from becoming a tsunami and we're running out of time,” said Diane Yentel, President of the National Low-Income Housing Coalition. “We're seeing now a really frankly horrifying confluence of increasing evictions in states where new coronavirus cases are surging.”20 million renters at risk of evictionMore than 20 million people, or one in five of the 110 million Americans who live in households that rent, are at risk of eviction by the end of September, according to the COVID-19 Eviction Defense Project (CEDP). While economic stimulus payments and unemployment insurance have allowed tenants to remain in their homes throughout the pandemic, CEDP Co-Founder Zach Neumann says that is likely to change dramatically, with enhanced unemployment insurance set to expire at the end of the month.Story continuesBlack and Latino families are at highest risk of eviction, according to Yentel.Those seeking help aren’t limited to low-income families, but young professionals now out of work.“You have a lot of folks who had strong incomes, in a lot of cases high five figure or low six figure [salaries]. They didn't have a lot of savings, lost their jobs or were furloughed, and there was not any severance attached to that, but had rents that were in line with the salaries they were earning,” Neumann said. “The client pool economically looks a lot different than it has in the past.”Eviction hearings conducted by ZoomThe threat of homelessness coincides with a troubling uptick in coronavirus cases across the South and West, leaving tenants especially vulnerable. In Tucson, where a surge in infections has filled hospitals to capacity, courts are processing over 52 eviction cases a day, 2 to 5 times the case load from the same period last year, according to Yentel. A disturbing spike in COVID-19 cases and hospitalizations prompted Texas Governor Greg Abbott to roll back the state’s reopening plans last month, but eviction hearings are moving forward on Zoom. That’s complicated the legal fight for tenants, who don’t have access to the technology.Tenant rights vary from state to county to city, adding to the confusion. In some jurisdictions, failure to dial into a hearing by video call paves the way for landlords to move forward with an eviction.“With a Zoom hearing you never have the opportunity to access a lawyer, to speak to someone who can give you advice to explain how the process goes. So the odds of not having your full rights under the law or not having representation, go down even further,” said Neumann, who offers legal aid to tenants in Colorado. “Even before COVID it was an extreme problem — 98% of landlords in Colorado went to court with an attorney and 2% of tenants did. We expect to see that 2% go down to an even lower number, which obviously affects outcomes across the system.”BROOKLYN, NEW YORK, UNITED STATES - 2020/07/05: A participant holding a Can't Pay Won't Pay sign at the protest. Tenants and Housing Activists gathered at Maria Hernandez Park for a rally and march in the streets of Bushwick, demanding the city administration to cancel rent immediately as the financial situation for many New Yorkers remains the same, strapped for cash and out of work. (Photo by Erik McGregor/LightRocket via Getty Images)‘The stakes couldn’t be higher’Housing advocates say the pandemic has exacerbated an affordable housing crisis the country faced even before COVID-19. Yentel says 8 million households, or roughly 25 million people, were paying at least half of their income towards rent each month.“When you have such limited income to begin with and you're paying so much of it for your home, you're always one financial emergency away from not being able to pay the rent and facing eviction, and in worst cases homelessness,” Yentel said.Sen. Elizabeth Warren (D-Mass.) has introduced legislation to extend the 120-day rent moratorium in the CARES Act to March 2021. Though the initial provision, set to expire on July 25, only covers federally assisted housing, or roughly 30% of renters nationwide, Warren’s proposal extends the proposal to include most tenants.But with Congress on recess until July 20, any action may be too late for tenants living in cities where the moratorium has already been lifted.“We’re running out of time,” Yentel said. “The stakes couldn't be higher right now, and every day of inaction is putting more low income people at risk of losing their homes.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaUniversities brace for a permanent wave of school closures as coronavirus pushes schools to brinkSmall businesses operate in limbo as economies begin to reopenLarry Summers: Pandemic marks a ‘fairly profound structural change’ in economy"}]}