{"article": [{"url": "https://finance.yahoo.com/news/disney-reports-q3-earnings-results-coronavirus-pandemic-disneyland-parks-disney-163129316.html", "published": 1596554180.0, "headline": "Disney earnings: Disney 3Q adjusted EPS top expectations, even as pandemic slams theme parks", "body": "Disney (DIS) posted mixed results in its fiscal third quarter, unexpectedly delivering an adjusted profit per share where a loss had been expected, even after the coronavirus pandemic hit the company in its most lucrative theme parks, media networks and studio film businesses. The company forecast another multi-billion-dollar hit to current quarter profit due to the pandemic.Here were the main results from the report, compared to consensus estimates compiled by Bloomberg:Revenue: $11.78 billion vs. $12.39 billion expected, vs. $20.35 billion Y/YAdjusted earnings per share: 8 cents vs. loss of 63 cents per share expected, vs. earnings of $1.35 per share Y/YAs expected, Disney’s parks, experiences and products segment showed the most pronounced impact from the pandemic. The unit swung to an operating loss of $1.96 billion, versus profit of $1.7 billion in the same quarter last year, after Disney grappled with severely reduced levels of theme park attendance as most of its global locations closed for much of the quarter. Disney’s cruises were also halted.“The most signifiant impact in the current quarter from Covid-19 was an approximately $3.5 billion adverse impact on operating income at our parks, experiences and products segment due to revenue lost as a result of the closures,” Disney said in a statement Tuesday.Disney added that it estimates the net adverse impact of Covid-19 on its current quarter operating profit across all business has been about $2.9 billion.Before the pandemic struck, Disney’s parks, experiences and products segment had been a profit engine for the company, comprising nearly half of 2019’s annual operating profit. That dynamic, however, already began to unravel in the fiscal second quarter, when even the very early impacts of the pandemic and park closures drove a 58% reduction in operating profit in the theme parks segment for the company.Partway through its fiscal third quarter, Disney reopened both its Shanghai and Hong Kong theme parks, albeit with some restrictions on attendance. In July – after the end of the third quarter – its Hong Kong theme park was temporarily shut again due to a spike in coronavirus cases in the region.Story continuesThe company also reopened its Florida Disney World, Paris Disneyland and Tokyo Disneyland locations in July, with capacity limitations. Disneyland Park in Anaheim, California, remains closed indefinitely, after shutting in mid-March for only the fourth time in company history.A visitor dressed as a Disney character takes a selfie while wearing a protective face mask at Shanghai Disney Resort as the Shanghai Disneyland theme park reopens following a shutdown due to the coronavirus disease (COVID-19) outbreak, in Shanghai, China May 11, 2020. REUTERS/Aly Song TPX IMAGES OF THE DAYDisney+ subscriber growth disappointsIn a testament to the broad-based struggles for Disney in the third quarter, the company missed expectations for Disney+ subscriber growth, disappointing in the one area that had been expected to be a bright spot for the entertainment giant.As of the end of the third quarter on June 27, Disney+ subscribers rose to 57.5 million, missing expectations for 59.4 million, according to Bloomberg consensus data. The miss suggested a slowing pace of subscriber additions as the quarter rolled on, with Disney having reported 54.5 million subscribers in early May.Disney CEO Bob Chapek added during the company’s earnings call that Disney+ had 60.5 million subscribers as of Monday. The service will expand to Latin America in November.Disney’s direct-to-consumer business unit remained a money-losing endeavor in the third quarter as the company continued investing in the expansion of its streaming services. The segment – which also includes ESPN+ and Hulu – grew revenue by a marginal 2% to $3.97 billion.Meanwhile, a drought of live sporting events had a mixed impact on Disney’s ESPN business and its overall media networks segment, which also includes ABC Television Network and broadcasting. Revenue in the company’s media networks segment fell 2% over last year to $5.5 billion. Operating income, however, rose 48% to $3.2 billion to comprise the lion’s share of company-wide profit, largely due to deferrals of sports programming costs.Both revenue and profitability weakened in Disney’s studio entertainment business during the third quarter, after a slate of Disney’s films previously set for release this summer were pushed back. Disney in July tabled the release of the live-action film “Mulan” for a fourth time since March. Chapek said Tuesday that the company planned to release “Mulan” on Disney+ for a $29.99 fee starting Sept. 4.A spate of stay-in-place orders across the country between mid-March and June also prevented Disney and other film studios from shooting new content during the quarter. That’s expected to impact release schedules down the line as well, though post-production that had already been under way did continue during the quarter.This post is breaking. Check back for updates.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}