{"article": [{"url": "https://finance.yahoo.com/news/june-jobs-report-preview-economists-expect-the-us-added-3-million-payrolls-lowered-unemployment-rate-170827884.html", "published": 1593675620.0, "headline": "June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%", "body": "The U.S. economy regained millions more jobs in June from May, as regions across the country eased social distancing restrictions and allowed more businesses to reopen. At 4.8 million, the net addition in payrolls was handily a record single-month gain, and topped consensus expectations.Meanwhile, the unemployment rate fell from May’s level but held at a historically high level, as millions of Americans remained out of work with the pandemic still under way.Here were the main metrics from the Department of Labor’s report, compared to consensus estimates compiled by Bloomberg:Change in non-farm payrolls: +4.8 million vs. +3.23 million expected, +2.699 million in MayUnemployment rate: 11.1% vs. 12.5% expected, 13.3% in MayAverage hourly earnings, month on month: -1.2% vs. -0.8% expected, -1.0% in MayAverage hourly earnings, year on year: +5.0% vs. +5.3% expected, +6.6% in MayThe June jobs report came following a massive upside surprise in May, during which the economy unexpectedly added payrolls, when a loss of more than 7 million jobs had been expected. Estimates for the June payrolls gain spanned a wide range, though none of the more than 70 economists polled by Bloomberg ahead of time expected to see net job losses for June.Still, the past two months’ worth of better-than-expected payrolls additions has not yet made up for the record decline in April, when virus-related business closures wiped out more than 20 million jobs from the economy that month alone.“The 4.8 million rise in non-farm payrolls in June provides further confirmation that the initial economic rebound has been far faster than we and most others anticipated,” Michael Pearce, senior US economist for Capital Economics, wrote in a note Thursday morning. “But that still leaves employment 9.6% below its February level and with the spread of the virus accelerating again, we expect the recovery from here will be a lot bumpier and job gains far slower on average.”Story continuesApril’s payroll losses were revised down by 100,000 to 20.8 million, while May’s payrolls gain was upwardly revised by 190,000 to 2.699 million.Investors cheered the better than expected report, sending the Dow up more than 400 points, or 1.5%, shortly after market open Thursday morning.By industry, leisure and hospitality again led non-farm payroll advances by a wide margin and accounted for nearly half of June’s gain. These types of jobs increased by 2.088 million to build on May’s increase of 1.4 million.This was followed in the services sector by retail trade, which saw 739,800 payroll additions after May’s 371,500. Information-related jobs were the only services-sector category to see net payroll declines in June.Manufacturing payrolls rose by 356,000 in June, improving from May’s 250,000 but missing consensus expectations for a rise of 425,000. Construction industries added back another 158,000 jobs, while mining lost 10,000 in June.The unemployment rate in June also trended lower from May, falling 2.2 percentage points to 11.1%. A decrease in the number of unemployed individuals on temporary layoff contributed to the improvement, with the number counted in this population falling by 4.8 million to 10.6 million in June, after May’s decline of 2.7 million.The US economy added a better than expected 4.8 million payrolls in June, and the unemployment rate fell to 11.1%. (David Foster/Yahoo Finance)But the percentage of those unemployed classified as not on a temporary layoff also increased, rising by 588,000 to 2.9 million in June and underscoring a rising number of job losses from the pandemic that ultimately turned “permanent,” as opposed to constituting a shorter-term layoff.The Labor Department also noted that the “degree of misclassification” of workers absent due to pandemic-related closures “declined considerably in June,” after saying in the previous jobs report that classification errors arose while designating these individuals.“If the workers who were recorded as employed but absent from work due to ‘other reasons’ (over and above the number absent for other reasons in a typical June) had been classified as unemployed on temporary layoff, the overall unemployment rate would have been about 1 percentage point higher than reported (on a not seasonally adjusted basis),” according to the report. “However, this represents the upper bound of our estimate of misclassification and probably overstates the size of the misclassification error.\"Ahead of the report, data had underscored the labor market’s steady improvement over the past two months. New jobless claims fell in each week since early April, including in the latest report for the week ended June 27, which was also released Thursday morning. Employment indices in each of the Institute for Supply Management’s manufacturing and non-manufacturing surveys improved in the latest reports.Still, ADP’s monthly jobs report Wednesday missed estimates, and showed net private payroll gains edged down to nearly 2.37 million in June, from May’s upwardly revised gain of more than 3 million.The Department of Labor’s June jobs report was released on a Thursday, or a day earlier than typical, due to the market closures in observance of the Fourth of July holiday on Friday.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}