{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-31-2020-224701650.html", "published": 1598886680.0, "headline": "Stock market news live updates: Wall Street ends best month in decades; Apple, Tesla rally into split", "body": "Wall Street closed out a monster August on Monday, with major benchmarks notching their best month in at least 20 years, bolstered by ultra-accomodative Federal Reserve policy, moderating coronavirus infections and rising optimism for a COVID-19 vaccine that may backstop economic growth.Despite giving back some gains on Monday, a formidable string of consecutive winning sessions carried the Dow over 7% higher during August, its best monthly showing since 1986. The S&P 500 Index also saw its best month since 1986, while a brisk rally in tech stocks propelled the Nasdaq to its best monthly performance since 2000, representing a nearly 10% gain.All told, stocks are now deeply entrenched in a new bull market, less than 6 months after a vicious sell-off sparked by the COVID-19 outbreak obliterated all of the Trump era gains.The high-flying tech shares of Apple (AAPL) and Tesla (TSLA) both soared after their stocks split on Monday, on the heels of setting new record highs. Tech stocks have boosted market sentiment, and helped grease the wheels of a rally that’s carried benchmarks higher despite the ongoing pandemic. Amazon (AMZN), Facebook (FB), Netflix (NFLX) and Alphabet (GOOG, GOOGL) have been among the winners.Additionally, July’s high-frequency economic data broadly outperformed Wall Street’s estimates, the latest being robust personal income and spending data released on Friday. Taken together, economists now believe that third quarter growth could be “even boomier” than prior estimates, JPMorgan Chase said on Friday.Given that “July activity indicators have generally printed favorably...we are lifting our tracking of current-quarter growth from 20.0% to 27.5%,” wrote economist Michael Feroli. The bank’s raised expectations were bolstered by data released by the St. Louis and New York Federal Reserve Banks, which also expect Q3 growth to soar.“Even with some slowing in August-September household outlays, perhaps due to the interruption of federal income support, real consumer spending looks set to grow at 36.0% annual rate in Q3,” Feroli added.Story continuesTraders have been encouraged by Fed policy that continues to encourage risk appetite, and the COVID-19 outbreak that has shown signs of tapering off in the Sun Belt region — which until very recently had been a domestic epicenter of new infections. Additionally, encouraging developments in the race for a vaccine have given the market reasons for hope.This week will be an acid test for assumptions about the U.S. recovery, which has defied much of the gloomy expectations associated with a relentless rise of coronavirus cases. With unemployment still elevated, the August payrolls data will be closely watched for signs the labor market is healing, and more displaced workers are finding unemployment.“Recall that the U.S. non-farm payrolls collapsed by 22.1 million in March and April, noted Marc Chandler at Bannockburn Global Forex. “In the three months through July, about 9.28 million workers returned, or about 42%” of those thrown out of work.“With a little bit of luck, the unemployment rate can slip back below 10%, the peak in the Great Financial Crisis,” he said, but warned that “some estimate that around a quarter of the overall job loss may be permanent. That still leaves scope gradual improvement in the coming months.”—4:02 p.m. ET: S&P, Nasdaq, and Dow end best August in decades; Tesla, Apple jump after splitHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): -7.87 (-0.22%) to 3,500.14Dow (^DJI): -226.32 (-0.79%) to 28,427.55Nasdaq (^IXIC): +79.82 (+0.68%) to 11,775.46Crude (CL=F): -$0.14 (-0.33%) to $42.83 a barrelGold (GC=F): +$1.80 (+0.09%) to $1,976.70 per ounce10-year Treasury (^TNX): -3.6 bps to yield 0.6930%—12:45 p.m. ET: Vaccine push gets political as Morningstar predicts $40B marketThe speedy push toward a COVID-19 vaccine, which is at least partly underpinning the market’s rally, has turned political (like everything else nowadays).Over the weekend, the FDA’s chief suggested the agency could approve an inoculation before the critical human trial phase has ended — stoking concerns among scientists that politics was trumping public health. The stakes couldn’t be higher, with President Donald Trump aggressively pushing for a vaccine candidate to boost his troubled reelection bid, and a host of pharmaceutical companies immersed in the effort.In new research published on Monday, Morningstar said a vaccine was “critical to the U.S. recovery” next year, and it expects regulators to approve emergency use in high-risk individuals by year’s end — boosting companies like Moderna (MRNA), Pfizer (PFE) /BioNTech, and AstraZeneca (AZN)/Oxford.Several of Morningstar’s key findings include:Our U.S. forecast assumes 274,000 deaths and nearly 20% infected by the end of 2020. This assumes a small drop in daily infections steadily throughout the remainder of the year, as aggressive reopening plans are being somewhat rolled back and more mask mandates are now in place. In addition, prophylaxis therapy with targeted antibodies or vaccines should start to become available in the fourth quarter, which we expect to counter increased risk from more indoor gatherings as a result of back-to-school and cooler weather.We think the COVID-19 vaccine market could surpass $40 billion through 2021, including at least $11 billion in U.S. government contracts at a $24 average price per course.We think that the U.S. is well positioned for herd immunity in the second half of 2021. Early-stage data is promising and points to potential duration of vaccine efficacy for at least one year. If data remains positive at a high percentage of adults in the U.S. chose to be vaccinated, we think the U.S. is likely to achieve herd immunity in second half of 2021, largely due to vaccination, not infection.—12:05 p.m. ET: Stocks rangebound after brisk August rallyTraders are finding inspiration a tough sell on the last trading day of the month, with stocks flat to slightly weaker. The Dow is taking the brunt of selling pressure, off more than 200 points on the day.Here’s where things stand at midday:S&P 500 (^GSPC): 3,505.30, -2.71 (-0.08%)Dow (^DJI): 28,440.99, -212.88 (-0.74%)Nasdaq (^IXIC): 11,770.42, +74.79 (+0.64%)Crude (CL=F): $43.13, +$0.16 (+0.37%)Gold (GC=F): $1,976.70, +$1.80 (+0.09%)10-year Treasury (^TNX): -0.023 basis points to yield 0.708%—11:30 a.m. ET: United scraps some change fees in bid to boost sluggish demandUnited Airlines (UAL) is permanently scrapping some change fees, underscoring how an airline industry walloped by the COVID-19 crisis is eager for customers to start filling seats again.On Sunday, United became the first U.S. legacy carrier to eliminate fees for standard economy and premium cabin flights, as well as standby fees for all same day departures. The company also extended its unlimited change fee waiver to flights purchased through the end of the year.United’s shift comes at a time when major carriers are in desperate need of more revenue, as the coronavirus crisis crushes demand for leisure travel. Last week, all the major carriers warned the clock was ticking on mass layoffs, as COVID-19 rescue cash dries up and with most carriers operating at dramatically reduced capacity.—10:15 a.m. ET: What stock split? Tesla, Apple keep climbingThe stocks of two tech giants are starting Monday’s trading with split stocks — which isn’t stopping investors from snapping the extra shares up all over again.Tesla (TSLA) shares began trading after its 5 for 1 split-adjusted price this morning. The stock opened at $444.61, and was trading up more than 3% in early trading. Separately, Apple’s 4 for 1 split began trading this morning at its new price of $124.81, and immediately began trading higher following the opening bell.—9:30 a.m. ET: Stocks open flat to slightly weaker after big August gainsHere were the main moves in markets as of 9:30 a.m. ET:S&P 500 (^GSPC): 3,503.08, -4.93 (-0.14%)Dow (^DJI): 28,499.54, -154.33 (-0.54%)Nasdaq (^IXIC): 11,702.16, +6.52 (+0.06%)Crude (CL=F): $43.24 per barrel, +$0.27 (+0.63%)Gold (GC=F): $1,974.80 per ounce, -$0.10 (-0.01%)10-year Treasury (^TNX): flat to yield 0.729%—8:00 a.m. ET: Oil gains; Goldman sees bull trend in 2021Crude is up by over 1% in early dealings, trading comfortably above $43 per barrel. It’s worth noting that oil prices have more than doubled since the startling collapse this spring, prompted by the double-barrel blast of falling demand from the COVID-19 crisis and a price war between Russia and Saudi Arabia.In a research note over the weekend, Goldman said the rebalancing has “slowed sharply” amid a stalled demand recovery and higher OPEC+ quotas. While the bank sees Brent crude peaking at $46 per barrel, it expects 2021 to be more constructive:We believe this reflects growing evidence supporting our bullish 2021 oil forecast. First, the market managed to remain in deficit despite a global second COVID-19 wave, with US cases now declining without US oil demand having to fall. Second, 2021 fundamentals appear skewed to a faster rebalancing than our base case given (1) the rising likelihood of widely available vaccines next spring, (2) discipline by both OPEC+ and shale producers and with the majors’ upstream capex still low and shifting towards renewables.Key to the resilience of spot prices despite stalling inventory draws this summer has been the steady rally in long-dated prices. These have outperformed our expectations once again, rising alongside a weakening dollar as next year’s growth prospects improve. Given our rising confidence in the market rebalancing next year, we are bringing forward our forecast for higher long-dated prices, with 3-year forward Brent expected to reach $58/bbl by end-2021.The bank also sees Brent spot prices jumping to $65 per barrel in Q3 of next year.—7:40 a.m. ET: Futures hold gains as Wall Street closes out AugustStocks are set to extend last week’s rally at the open, with futures in the green as Wall Street kicks off the final trading day of August. All eyes will be on the shares of tech heavyweights Tesla and Apple — which are perched at record highs — as their stocks will split when trading begins.Here are the main pre-market moves ahead of the opening bell:—6:45 p.m. ET Sunday: Stock futures rise as overnight session beginsHere were the main moves in equity markets, as of 6:45 p.m. ET:S&P 500 futures (ES=F): 3,514.50, +10.00 (+0.29%)Dow futures (YM=F): 28,665.00, +54.00 (+0.19%)Nasdaq futures (NQ=F): 12,037.00, +45.25 (+0.38%)Crude (CL=F): $43.50 per barrel, up +$0.53 (+1.23%)Gold (GC=F): $1,974.80 per ounce, -0.10 (-0.01%)10-year Treasury (^TNX): yield 0.729%, flat—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}