{"article": [{"url": "https://finance.yahoo.com/news/covid-19-testing-mess-how-to-solve-it-115228785.html", "published": 1595055620.0, "headline": "How to get out of the COVID-19 testing mess", "body": "Testing for COVID-19 is going great!If you’re a VIP.Or if you live in a developed country other than the United States.For the rest of us, the testing process—standing in long lines, (or even being denied testing), and the interminable wait for results—is an abomination.Here’s some folks who don’t have to deal with delays or sit on their hands for two weeks until they get results back:-President Trump and his family, Mike Pence, Nancy Pelosi, Joe Biden and the rest of the big shots in Clown Town.-Players in the NBA, NFL (72 just tested positive) and MLB.-CEOs and other executives of Quest Diagnostics, LabCorp and other companies that process tests.Everybody else? Get in line.Although, you may be happy to hear (in a perverse way) that ‘everybody else’ extends pretty far up the food chain. Like up to Atlanta Mayor Keisha Lance Bottoms. The Washington Post reports that she and her family were tested on June 29 as a precaution after attending a funeral. A week passed and still no results, at which point her husband felt sick, so the family went to Emory University for a rapid test. The mayor, her sick husband and one of their four children tested positive. The next day, the mayor and her family finally got the first test results back which showed that eight days earlier, the one child was positive. So presumably the child gave it to the parents. A mess, no?Then there’s Mick Mulvaney, formerly President Trump’s chief of staff, who now, as a civilian is shocked, shocked at all this. (Welcome to the world beyond 1600 Pennsylvania Avenue, Mick.) Here’s Mulvaney, complaining in an Op-Ed for CNBC that his son had to wait “5-7 days for results.” (Not sure why he couldn’t be more precise.) And Mulvaney says his daughter, who wanted to visit her grandparents, was denied a test because “she didn’t qualify.”“That is simply inexcusable at this point in the pandemic,” Mulvaney wrote. “I know it isn’t popular to talk about in some Republican circles, but we still have a testing problem in this country.”Story continuesYa think?Honestly I thought I wouldn’t have to write this article.I’ve been eyeballing this testing you-know-what show for a while, and figured that while it was a mess in March, we would get our act together soon enough. I guess I hoped—as Trump said about the coronavirus itself—the testing bottleneck would “like a miracle disappear.”Why in the world did I ever think that?We all know what happened. Federal officials (ahem) did in fact act as if testing problems would (magically) sort themselves out, but instead COVID-19 cases have now surged. More and more Americans have felt sick or wanted to know if they were infected. They’re looking to get tested and the system is overwhelmed. “We’re at this breaking point now,” says Sarita Shah, an epidemiologist at Emory University. “The system is having a heart attack and we’re trying to treat it.”The consequences? Fivethirtyeight puts it thusly: “...the U.S. is caught in a vicious cycle with no end in sight. A lag in testing leads to more cases, which leads to the need for even more tests to finally get a handle on the pandemic. We’ve been playing catch up from the beginning, and, experts say, we’re still not close to closing the gap in most states.”People wait in line outside of a COVID-19 testing site during the coronavirus pandemic, Thursday, July 16, 2020, in Opa-locka, Fla. (AP Photo/Lynne Sladky)According to Harvard researchers, states like Mississippi, Arizona, Alabama and South Carolina are woefully short on testing, (while a few states like Hawaii, Alaska and Vermont are actually testing more than they need to.) Overall though, the Harvard model suggests the U.S. is under testing by a significant margin.As far as global comparisons, Johns Hopkins data shows the U.S. is under testing too, along with Brazil, Mexico, India, Iran and yes, Sweden and France. Countries testing enough include: Germany, Australia, New Zealand, and yes RussiaI asked Dr. Thomas Tsai, an assistant professor in the Department of Health Policy and Management at Harvard, a simple question: What the hell is wrong with our country and testing?“It's deeply frustrating,” Tsai said. “It comes down to a lack of coordinated federal strategy and inconsistent and harmful messages from the White House. The HHS (Department of Health and Human Services) state testing plans are like a cursory outline instead of a detailed report.”One harmful message the good doctor might be referring to is when Trump essentially discourages testing by saying it increases the number of cases.“Testing is a first step in addressing any epidemic,” Shah says. “You have to test to know how much to fight what’s out there. Whether you have enough ammunition or troops or not. You’ve got to know who you’re fighting.”No wonder the logjams are as bad as they’ve ever been.The New York Times notes that “In New Orleans, testing supplies are so limited that one site started testing at 8 a.m. but had only enough to handle the people lined up by 7:33 a.m.”“We're back to a lot of the stories from March and April in terms of delays in getting results back, and shortages of reagents, only now it's more complicated than it was earlier,” says Tsai.Lab companies are insisting that tests results are coming back between three to six days. An HHS concurs. Of course that doesn’t include the time it takes to actually get the results to the patient. (Oh, you mean we should count that too?)It’s just double talk. Here are three cases in point.Example one: A friend of my daughter’s was feeling a bit peaked recently and walked into a clinic in Boston to get tested. He was told he would get the results back within a week (even that’s too long.) It’s now been 14 days and counting (thankfully he’s not feeling sick BTW.) In the meantime what’s he supposed to do, sit in his room and watch Mark Wahlberg movies all day?Example two: A guy from work and his wife went to a CityMD in Queens, New York in late June. He waited nine days for results, while his wife waited 11 days. She ended up having to call for hers, because apparently the testers neglected to post her results online. (Why bother to inform? It’s only a potentially fatal disease.)Example three: A friend made an appointment at a drive-in CVS in New Jersey on July 1. CVS had him do the test himself in his car. My friend was told he would get his results back in two to four days. He didn’t hear for 12 days. (“BTW, did that self-administered test hurt,” I asked? “No they just told me to swirl it around in my nose for 15 seconds,” he said. No wonder he was negative.)Granted I’m not sure when the test centers say two to four days they mean business days or not. I hope they realize COVID works weekends.‘We need an actual nuts and bolts plan’Unforeseen factors have caused delays. “We had this huge surge of people wanting to get tested right before the Fourth of July holiday—some with suitcases,” a medical professional in New York told me. “That backed up results from two to four days, to two weeks. The delay hasn’t gone back down.” The result: I was told the number of people coming in for tests has declined as people hear about the delaysThe same medical expert says their practice is now on its third type of test which they receive from LabCorp, as the first one, (nasal swab) then the second (oral swab) ran out. All three require different protocols making for all kinds of apples and oranges when it comes to tracking and metrics.Yes, we’re testing up to 700,000 people per day now in America, from 25,000 a few months ago, but we’re still behind. That’s inexcusable given that we’ve seen this coming every single day since March. And given the resources available to the richest country on the planet.“We've gotten much better at in-patient testing,” says Dr. Amesh Adjala of Johns Hopkins. “If you're in a hospital, you can get a test back in an hour.” But that’s not how most are tested of course.Out-patient tests with a “seven-day lag period which makes the test basically worthless,” says Adjala. “We need to have a national testing strategy to get them done as rapidly as in-patient. We can't have people waiting 10 days expecting some sort of normalcy and for people to feel safe going out. We're clearly behind when we have people waiting in cars in Arizona for eight hours to get a nasal swab.”So, what can we do?“We need an actual nuts and bolts plan,” says Tsai. “It’s not enough to say in a football game our goal is to score touchdowns. We need to know what plays we're going to run on 3rd and 1.”One idea Tsai has is interstate compacts. “We have interesting compacts for port authorities and interstate compacts for management,” he says. “We can redirect federal dollars and congressional support to really support on-the-ground efforts for testing capacity and break through the bottlenecks which are becoming very local.” That would help address supply-demand mismatches. “A lot of jurisdictions have places with excess capacity, like up north: Massachusetts, New York had high burdens earlier in the pandemic and ramped up capacity but now cases are low,” Tsai says. “The Arizona’s, Texas’s, California’s and Carolina’s have the exact opposite problem.”We need to provide access too. “It’s very important that people are able to have free testing, and drive-thru testing in various areas,” says Saskia Popescu, an epidemiologist at the University of Arizona. “Not just focus on hospitals and emergency clinics where people have to pay for copays. Remove that geographic and economic barrier. It’s very hard to find drive thru clinics and free clinics. We need to communicate that to people.”Tsai says we need to track test-turnaround time. We should create state dashboards to access tests and metrics on turnaround times for testing. “What proportion of tests are from public health labs hospitals versus commercial labs? If we can track, we can measure,” Tsai says, pointing out that right now most of this work is being done by the media. (Heaven help us there.)We also need to enlist or draft more companies into the testing process. Biotech companies, academic facilities and smaller labs, many of which have the necessary expertise at hand, could be steered into this, but they need clear, direct orders from Washington to do so.It’s not so great, but let me end on a positive note from Tsai. “This is a virus, not an enemy. The virus is neither Republican or Democratic,” he says. “We’ve come a long way in four months. It says that we can do it.”And you know what? We will.This article was featured in a Saturday edition of the Morning Brief on July 18, 2020. Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAndy Serwer is editor-in-chief of Yahoo Finance. Follow him on Twitter: @serwer.Read the latest financial and business news from Yahoo FinanceRead moreBillions or trillions: The great coronavirus trade-offHow this week changed America foreverWhat America can learn about reopening from the state of MaineWhat will everything look like after the coronavirusHere’s how the coronavirus divides usThe crazy story of Purell and the coronavirus"}]}