{"article": [{"url": "https://finance.yahoo.com/news/salesforce-ceo-marc-benioff-on-job-cuts-141209612.html", "published": 1598520020.0, "headline": "Salesforce CEO calls coming job cuts 'part of running business in a successful way'", "body": "Salesforce (CRM), coming off a massive second quarter and poised to be added to the Dow Jones Industrial Average, is like all other businesses operating in a pandemic — having to make “difficult decisions” like cutting headcount, CEO Mark Benioff told Yahoo Finance.The billionaire explained that job cuts, especially during a pandemic, is part of running a successful business. According to The Wall Street Journal, Salesforce is eliminating around 1,000 jobs, with the impacted workers given 60 days to find new positions within the company.The move comes at a time when joblessness is at its highest levels in years. Yet with 54,000 employees, the job cuts account for less than 2% of the total headcount. Typically, Salesforce looks at \"rebalancing five to 10%\" of its employees each year, Benioff explained on Wednesday.\"It's part of running our business in a successful way. And that does impact employees at different moments,” he said during an interview.“And at this point, in this quarter, for example, unfortunately, we're going to have to make changes to how our employees are structured and exactly where we're investing,\" Benioff added.On the Q2 earnings call, CFO Mark Hawkins seemed to allude to the impending job cuts. He noted that the company would be \"make a strategic shift in investments today to better position our company for continued growth and customer success in this new, all-digital, work-from-anywhere environment.\"On the surface, Salesforce’s bottom line certainly doesn’t seem to be hurting. The enterprise software giant record second-quarter earnings results, with revenue rising above $5 billion for the first time. Benioff called the results \"a victory for stakeholder capitalism\" during an analyst call.The next day, Salesforce's stock had its best day on record, with shares surging more than 26% to close at $272.32, up $56.27.‘An example of stakeholder capitalism’The 55-year-old billionaire tech chief added that the company is offering re-skilling and re-training, in addition to placement services, for those affected by the job cuts.Story continues\"That idea that we are going to do well and do good also means that we're going to be an example of what stakeholder capitalism means. At the end of the day, we're still running a business, and we're going to have to continue to make investment choices,” Benioff explained.“But we will do it in the best way, a more compassionate way, a more sustainable way, a more equitable way, and more just way. And we'll be an example of exactly how to do that,\" he said.He noted that since going public in 2004, Salesforce's stock had returned more than 5,000%, and the company has \"given back very dramatically\" to the communities in which it operates.When Benioff started Salesforce in 1999, he made integrated philanthropy a critical part of its mission. This month, Salesforce, which has previously adopted more than 100 public schools, gave $20 million across five school districts to help bridge the digital divide as students and teachers continue remote learning from home during the pandemic. To date, Salesforce has contributed $118 million to its local public schools.In early April, Salesforce and Benioff also publicly committed to its employees that there would be no layoffs for 90 days amid the uncertainty.\"Now, we've written our pandemic plan, we're reshaping our business. We're reassessing what Salesforce will look like next year,” Benioff told Yahoo Finance.However, he praised the company’s current performance, noting that there's \"never been an enterprise software company that delivered a $5 billion quarter growing at 29%.\"He added: “So that's why it's really critical for us to continue to make the changes, the additions, the shifts so that we can continue to grow so that we can continue to be successful.\"Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. NYU’s Galloway: The Dow is ‘one of the most dangerous numbers ever manufactured’"}]}