{"article": [{"url": "https://finance.yahoo.com/news/starbucks-policy-on-facial-coverings-inside-caf%C3%A9s-174817915.html", "published": 1594299380.0, "headline": "Starbucks to require masks at US cafés as coronavirus cases spike", "body": "Starting next week, Starbucks (SBUX) will require customers visiting company-operated cafés in the U.S. to wear masks, the company announced on Thursday, as domestic COVID-19 cases continue to climb.Beginning July 15, customers will need to wear facial coverings at Starbucks company-owned café locations. According to the coffee giant, Starbucks is “prioritizing the health and well-being of partners (employees) and customers” at a time when Americans are at each others throats over expanding mandates to wear face coverings in public.“We respectfully require customers follow social distancing and safety protocols recommended by public health officials, including wearing a facial covering when visiting our stores,” Starbucks wrote in a blog.“It is our responsibility to protect our partners and comply with local public health mandates. As such, our partners have the right and responsibility to refuse service to customers who are not wearing facial coverings,” the company added.NEW YORK, NEW YORK - JUNE 23: People wear protective face masks outside Starbucks in midtown as the city moves into Phase 2 of re-opening following restrictions imposed to curb the coronavirus pandemic on June 23, 2020 in New York City. Phase 2 permits the reopening of offices, in-store retail, outdoor dining, barbers and beauty parlors and numerous other businesses. Phase 2 is the second of four-phased stages designated by the state. (Photo by Noam Galai/Getty Images)Starbucks employees, known internally as “partners,” have already been required to wear facial coverings during their shifts.When the coronavirus crisis took hold in the U.S. back in March, Starbucks suspended café seating and pivoted to drive-thru and delivery only to adhere to social distancing rules. Approximately 60% of the 15,000 Starbucks stores in the U.S. offer drive-thru service.As lockdown started easing, Starbucks began reopening most of its U.S. stores, offering customers the option for entryway pickup in addition to drive-thrus. The company also encouraged customers to use its popular mobile app to order ahead.In some places where social distancing can be maintained, customers may pick up “grab and go” orders in the store, using the app. Starbucks added floor decals and signs, and has limited the number of customers allowed inside to promote social distancing. In some areas, the company has offered socially-distanced and limited seating inside cafés and outside on patios.Story continuesIn certain places without a government mandate requiring facial coverings, Starbucks customers that aren’t wearing a mask can still get their coffee fix via the drive-thru, curbside pickup using the app, or via delivery.Meanwhile, the company has also temporarily closed its restrooms to the public where café seating isn’t available.Julia La Roche is a Correspondent at Yahoo Finance. Follow her on Twitter."}]}