{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-cases-rise-doctor-175513623.html", "published": 1592399000.0, "headline": "'No one should be shocked' by alarming rise in U.S. coronavirus cases, Obama-era health official says", "body": "The spike in coronavirus cases in some parts of the U.S. caught many by surprise, but not one former health policy adviser in the Obama administration.Dr. Ezekiel Emanuel, who served as special advisor for health policy to the director of the White House Office of Management and Budget during the Obama administration, criticized the leadership of many of these states for rushing to reopen their economies without taking public health guidelines into consideration.“These places never really came down, never had 14 days of declining cases and hospitalizations — the justification in the president’s own criteria for reopening the economy, plus the president suggested that when we reopen the economy, it should be in stages,” Emanuel said on Yahoo Finance’s The Ticker (video above).“You don’t do it all at once. You do it progressively. ... Absolutely no surprise that you’re getting the increase and no one should be shocked.”There are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)‘Look at New York, look at Pennsylvania’States that previously seemed unscathed at the onset of the coronavirus pandemic are now seeing significant increases in COVID-related hospitalizations and deaths.On Monday, Texas reported record highs in COVID hospitalizations, the fourth day in a row with a new high. There are currently over 2,000 patients with the coronavirus in the state, with increases presumably stemming from Memorial Day weekend activities.Florida, another state that reopened early, is experiencing similar troubles. On Tuesday morning, the state reported 2,783 coronavirus cases, which was the highest number in a single day, according to Florida’s health department data. There are now more than 80,000 cases in Florida and more than 3,000 deaths.Coronavirus cases are increasing in Florida. (Chart: Florida Department of Health)“If you actually look at the states, what you can see clearly is that when they rushed to reopen, four weeks later almost to the day, you see the beginning of this exponential increase in the number of cases,” said Emanuel, who is currently Vice Provost for Global Initiatives and chair of the Department of Medical Ethics and Health Policy at the University of Pennsylvania. “And that, several weeks later, will increase the number of hospitalizations and deaths.”Story continuesOther states in the Northeast held off on beginning their phased re-openings until they were satisfied that every requirement had been met.“Look at New York, look at Pennsylvania, look at Illinois, and if you slowly ease up in the right way, you can actually keep those numbers down,” Emanuel said. “The issue is to do it in the right way and at the right time, and that’s what Florida and Texas and Arizona have not done.”Cases are declining in New York, but rising in other parts of the U.S. (Graphic: David Foster/Yahoo Finance)Lockdowns: Temporary solutionsThe U.S. has the highest case count and death count in the world, far ahead of countries like China, where the virus originated, and Italy, the European epicenter of the virus.And although the number of cases keep rising, President Trump and Vice President Pence have attributed it to increased testing — although experts say this isn’t accurate.There are over 8 million coronavirus cases worldwide. (Graphic: David Foster/Yahoo Finance)“I think the president, the administration, now wants to pretend that COVID doesn’t exist and minimize its impact,” Emanuel said. “But we’re at 115,000 deaths and before the end of the year, we’re almost certainly going to be at 250,000 deaths or more, and that is a huge increase in our death rate in the United States, and I think pretty unacceptable.”There are several factors that need to come together in order for the U.S. to fully gain control over the spread of the virus.A shopper wearing a facemask carries a dog through the Mall of America on June 16, 2020 in Bloomington, Minnesota, after some of the shops at the mall reopened on June 10. (Photo: KEREM YUCEL/AFP via Getty Images)“A lockdown is only a temporary measure to get in place a testing regime, a contact tracing regime, and an ability to isolate the few cases that arise,” Emanuel said. “And you can see when you put in all the public health measures — the lockdown, physical distancing, the face mask wearing, the hand hygiene, the closing of businesses, the limiting of crowds — you get a nice decline.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Coronavirus spread is like 'lighting a campfire,' doctor explainsCoronavirus: 'Children will probably be an important vector for transmission'Coronavirus: Public health experts ranked 36 American activities based on riskRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}