{"article": [{"url": "https://finance.yahoo.com/news/rare-air-jordan-sneakers-up-for-auction-stadium-goods-christies-140018333.html", "published": 1594890500.0, "headline": "Extremely rare Air Jordan sneakers are going up for auction", "body": "Collectors and sneakerheads alike will soon be able to bid on some of the most iconic sneakers worn by Michael Jordan.On July 30 through August 13, famed consignment store Stadium Goods is teaming up with auction house Christie’s to auction “Original Air: Michael Jordan Game-Worn and Player Exclusive Rarities.”The online-only auction is being called by Christie’s and Stadium Goods as “the greatest collection of historic Air Jordan’s.” A portion of the proceeds will go to the NAACP Legal Defense Fund.Among the exclusive items are game-worn AirShip sneakers made exclusively for Jordan (Nike, 1984); game-worn Air Jordan 7 “Olympic” sneakers made exclusively for players (Nike, 1992); and practice-worn Air Jordan 14 “Chicago” sneakers (Nike,1998).The AirShips are expected to go for an estimated $350,000-$500,000. The Air Jordan 7s are estimated to sell for $50,000-$70,000 and the Air Jordan 14s are expected to go for around $6,000-$8,000.Nike AirShip — Stadium Goods and Christie’sThe game-worn Nike AirShip is a sneaker that lives in sneaker lore since each shoe of the pair does not match in size. Jordan had injured his foot during his rookie season, so Nike made the future NBA champion a pair of AirShips that differed in size to accommodate. The right shoe is a size 13, and the left is 13.5.The pair of Air Jordan 7s worn by MJ during the 1992 Summer Olympics on the auction block has a colorful and unique backstory.The pair reportedly comes from a receptionist of the Ambassador Hotel in Barcelona where the Dream Team stayed during the games. Legend has it that it was given as a show of gratitude from the Dream Team for their stay in Barcelona.Michael Jordan from USA during the Final of the 1992 Olympics against Croatia. | Location: Barcelona, Spain. (Photo by Dimitri Iundt/Corbis/VCG via Getty Images)“A lot of people are realizing just how fun sneakers are,” Ben Jacobs, Brand Director at Stadium Goods tells Yahoo Finance. “Sneakers are an item you can collect that has a lot of value and are also highly functional. You can’t wear a lot of traditional collectibles like baseball cards or artwork. Sneakers and bags are becoming more of a status symbol to the masses.”Story continuesOn July 23, the full catalog of rare sneakers will be made public. In addition to the online-only auction, the exhibition will be open to the public by appointment at Christie’s New York gallery at 20 Rockefeller Plaza from July 23-August 13.“People that otherwise might be collecting handbags or watches are now also buying coveted sneakers,” Jacobs said. “Of course, there’s the pop culture element as well. These are wearable artifacts that signify both style and connoisseurship.”—Reggie Wade is a writer for Yahoo Finance. Follow him on Twitter at @ReggieWade.Read more:Nike responds to George Floyd attack: Don’t do it — ‘Don’t turn your back on racism’Nike sells out of Kobe Bryant kicks and merchandiseNike exec explains why the company broke up with AmazonAlmost half of teachers work a second job: survey96% of teachers personally pay for students’ supplies: SurveyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}