{"article": [{"url": "https://finance.yahoo.com/news/what-to-expect-form-the-2020-conventions-as-good-a-tv-show-as-they-can-have-152015606.html", "published": 1597746500.0, "headline": "What to expect from the 2020 conventions: 'As good a TV show as they can have'", "body": "It’s been tradition since 1831: Every four years, in a typical election year, the Republican and Democratic parties gather to don funny hats, wave their signs and send a message to the country.“Most of the time those conventions have been, essentially party commercials,” said Lara Brown, director of the Graduate School of Political Management at George Washington University. “Ways in which the party could showcase its leaders, its platform, its ideas, the enthusiasm and excitement of its activists on the national stage — and it was a moment in which partisans came together to then say, ‘we’re unified, we’re ready, let’s go into the fall campaign.”This year the Democratic convention is virtual, but normally thousands of delegates would travel to their party’s convention to vote on procedural rules, adopt a party platform and officially name the presidential and vice presidential nominees.“These are party decisions, not public decisions, even though it feels like a public decision because there are so many primaries,” said Elaine Kamarck, senior fellow of Governance Studies and director Center for Effective Public Management at the Brookings Institution.The roll callOn Tuesday, the party will officially cast votes to make Joe Biden the nominee. In a traditional roll call vote at a normal convention, state delegations would one-by-one brag about their state and announce how many delegates they’re delivering for the nominee. This year, states will formally nominate Biden with pre-taped segments.The delegates are usually people heavily involved in state politics and they’re awarded to candidates based on the results of primaries and caucuses. When a candidate wins pledged delegates in a state, they are expected to vote for the candidate at the convention.In this image from video, the set in Los Angeles during the first night of the Democratic National Convention on Monday, Aug. 17, 2020. (Democratic National Convention via AP)To secure the nomination, a candidate must win the majority of delegates. This year, President Trump is essentially a shoo-in, but the Democratic candidate will need a total of 1,991 delegates to win. If no one reaches 1,991 votes on the first ballot at the convention, there would be a second ballot.Story continuesClick here for Yahoo Finance's full coverage of the 2020 electionCampaigns and supporters would wheel and deal on the convention floor, trying to convince delegates to support their candidate.“That would be real drama. That would be drama in real time,” said Kamarck.But we haven’t seen that kind of drama recently. There hasn’t been a real nomination fight on the convention floor in decades. By the time the conventions roll around, we usually already know the nominees. Biden hit the magic delegate number back in June, but the vote at the convention makes his nomination official.‘As good a TV show as they can have’“They usually make a big show about it and which state puts the candidate over the top,” said Kamarck. “So usually what will happen is by Monday night, Tuesday night, all the business of the convention is done, and they proceed to have as good a TV show as they can have.”Part of that “TV show” typically includes acceptance speeches by the nominees in front of massive crowds —but the pandemic wrecked both parties’ plans. Biden will accept the nomination from Delaware, instead of Milwaukee as originally planned. President Trump was originally planning to give his acceptance speech from Jacksonville, Fla., before canceling the gathering. He may now give his acceptance speech at the White House.Democratic presidential candidate former Vice President Joe Biden and his running mate Sen. Kamala Harris, D-Calif., arrive to speak at a news conference at Alexis Dupont High School in Wilmington, Del., Wednesday, Aug. 12, 2020. (AP Photo/Carolyn Kaster)The mostly virtual 2020 conventions will be like nothing ever seen before and experts say 2024 could be something entirely new too.“For a number of years, people have said that these conventions needed change. They needed to be rethought or reimagined to meet kind of the needs of a grassroots activist base — which really it hadn’t been able to do in prior years,” said Brown of George Washington University. “The coronavirus pandemic is forcing the parties to rethink what had become something of a staid tradition, and I think we will see in future years, a different looking national party convention.”Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Coronavirus response: Breaking down the debate over liability protectionsCoronavirus stimulus: What’s next for small business?White House, Senate GOP continue to debate stimulus plan as jobless claims riseTwitter hack highlights concerns about disinformation, election securityThe $600 boost in unemployment benefits expires soon. What comes next?Most Americans would not sue over COVID-19 exposure: poll"}]}