{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-trump-diagnosis-rocks-the-globe-shows-no-one-is-safe-164830914.html", "published": 1601639780.0, "headline": "Coronavirus update: Trump being treated with Gilead's remdesivir at Walter Reed hospital", "body": "President Donald Trump and First Lady Melania Trump’s COVID-19 diagnoses shook the world and reverberated across global markets on Friday, underscoring how an “unpredictable” virus remains implacable in the face of multi-pronged efforts to contain it.With barely a month before Election Day, the campaign is facing a significant slowdown on Thursday after top White House aide Hope Hicks had contracted the virus — leading to the disclosure that the president and his wife were infected and would go into isolation.Meanwhile, the virus continues its inexorable spread, with the worldwide death toll reaching 1 million this week and cases climbing around the globe. The president’s illness highlights the urgent search for a vaccine, which could arrive before year’s end.As of Friday, Republican National Committee chair Ronna McDaniel and GOP Senator Mike Lee also tested positive, but Democratic nominee Joe Biden — who appeared on the same stage with Trump during Tuesday’s ferocious debate — has tested negative, as have Vice President Mike Pence, his wife, and first daughter Ivanka Trump and Jared Kushner, her husband.But experts warn many of these negative tests will need to be redone in the coming days, as it remains unclear how long Trump has had the virus and therefore how early on in the incubation period some of the close contacts are in.The latest reports from the White House are that Trump’s symptoms are mild, but as an elderly and overweight male, the president is considered part of a high risk category for the disease to develop into more severe case.“This virus has an unpredictable course,” Yahoo medical contributor Dr. Dara Kass told Yahoo Finance on Friday.Zeke Emanuel, a former National Institute of Health official and current vice provost of global initiatives at the University of Pennsylvania, noted that someone in the President’s age and weight group is like 5% to 12% more likely to die from the virus, but without any additional transparency from the White House, it would be hard to assess the severity.Story continuesStirring even more concern late Friday, the White House reported Trump was being taken to Walter Reed National Military Medical Center for additional tests, after being given a dose of Regeneron’s (REGN) trial antibody therapy, which some health experts said could be risky as the therapy was still in late-stage trials— even though the company announced positive results this week. Trump received the dose through a compassionate use request, according to Regeneron.“Taking an experimental treatment and leaving for Walter Reed on day 1 of his diagnosis is not something you would do just to have access to care,” said Dr. Howard Forman, Yale University professor and health policy expert.Late Friday night, the White House physician reported Trump was being treated with Gilead Science’s (GILD) remdesivir, the only authorized treatment to-date.Health experts noted that if the President was switched to dexamethasone, another promising but generic treatment option, that would be a sign of concern. Trump was also taking zinc, aspirin, and other general medication, per an earlier physician’s report.‘No one is safe’There are over 7 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)Now that several individuals have tested positive, Kass said all of the venues at which Trump has appeared this week have the potential to become “superspreader” events.According to reports, White House staff knew Hicks was confirmed positive before attending a rally in Minnesota on Wednesday but attempted to keep it under wraps as Trump traveled the next day to New Jersey for a campaign event. Trump appeared lethargic at the New Jersey event, according to reports, and once again downplayed the virus while he was at the rally.Kass pointed to the this week’s debate, where Trump’s team did not follow masking rules required by the venue. “If they were within 6 feet of the President, unmasked, for over 15 minutes, they are at risk and need to be quarantined for 14 days, regardless of negative tests,” the doctor said.“That could extend as far as the cabinet” and other officials close to Trump, Kass added. “We just don’t know how many people were in contact with the President or any other positive patients at this point,” she said.The Bidens released a message wishing the Trumps a “swift recovery,” while his running mate, Kamala Harris, tested negative.Jill and I send our thoughts to President Trump and First Lady Melania Trump for a swift recovery. We will continue to pray for the health and safety of the president and his family.— Joe Biden (@JoeBiden) October 2, 2020The White House reported Friday that Judge Amy Coney Barrett, the Supreme Court nominee, has tested negative for the virus — but she already had the virus this summer, so it is likely her antibodies are still in effect.But even with the number of close contacts reporting negative tests, health experts warn it is still too early to tell if those negative results will remain so within the next 14 days. Another focus is the event announcing Barrett’s nomination, attended by Notre Dame President Rev. John Jenkins who reported positive for the virus Friday, adding to the list of concerning events.Emanuel told Yahoo Finance the debate stage and venue in Cleveland could have resulted in dangerous exposure for the two candidates — being stuck in an enclosed space for more than 90 minutes with the amount of high-volume exchanges that meant more air droplets filling the air.“Where was the plexiglass?” Emanuel said, noting that any upcoming debates should consider such a change.Still, the president’s shock revelation will require aggressive contact tracing in the coming days, as well as assessing Trump’s health developments.Dr. Leana Wen, an emergency physician and professor at the George Washington University school of public health, told Yahoo Finance the road ahead is likely to be long and arduous.While the President is currently displaying mild symptoms, it is too early to tell how badly the virus will affect him. Wen noted that of the more than 7.2 million individuals in the U.S. that have tested positive, 40% have mild symptoms.It will be at least 5 to 7 days before he shows any real symptoms, and at least 10 to 12 days from symptom onset before it could — in theory — get more serious. U.K. Prime Minister Boris Johnson, the world’s first major leader who tested positive this spring, had an initially mild case before winding up in intensive care within days of his diagnosis.“We should not breathe a sigh of relief if in the next couple of days he seems fine,” Wen told Yahoo Finance.“It’s important for people to know this is an extremely contagious virus, which easily spreads from person to person. No one is safe from it, not even the President of the United States.”In light of the shocking news, and ongoing monitoring of individuals who may be infected, the White House has now ordered masks to be worn any time staffers are outside their offices in the building. The mandate is a significant shift from Trump’s previous stance, avoiding mask wearing, which stood in stark contrast to his top health officials who have repeatedly pushed for mask-wearing.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}