{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-19-2020-221817551.html", "published": 1597850000.0, "headline": "Stock market news live updates: Stocks drift after S&P 500's record close; Target and Lowe's post blowout earnings", "body": "Stocks ended slightly lower Wednesday, after the S&P 500 broke above its February highs to set a fresh record close a day earlier.[Click here to read what’s moving markets heading into Thursday, August 19]Apple (AAPL) on Wednesday became the first US company worth more than $2 trillion, after shares climbed more than 1% to above the key threshold of $467.77 per share in intraday trading. Meanwhile, Target (TGT) and Lowe’s (LOW) each reported second-quarter results before market open that handily topped consensus expectations, as consumers turned to each retailer in droves during the pandemic and as stay-in-place orders were in effect.The S&P 500’s most recent leg higher brought its total gain from its March lows to 52%. And in taking out its previous record closing high, the S&P 500 ended the shortest-ever recorded bear market, or period following a stock market drop of 20% peak to trough.The advance came as shares of big tech stocks rallied yet again, with Amazon (AMZN) shares rising 4% to its own record close Tuesday after the company announced plans to add thousands more jobs to major hubs across the country. The rise in tech names – and in the Nasdaq Composite, which rallied to yet another record high on Tuesday as well – reflected the trend of the past several months in equity markets, as investors piled heavily into software and tech names as a defensive play against the pandemic and stay-in-place orders.Still, the market’s rally to new highs comes as millions of American remain unemployed at the hands of the coronavirus pandemic, and as the prospects for another fiscal stimulus package hang in balance.But as many analysts have noted, the market has been discounting the future rather than the present, with a plethora of new data coming in better-than-feared and on an improving trajectory relative to trends seen earlier this spring. Virus growth rates have begun to slow even in recent epicenters in the South and West. And data on the housing market, retail sales and manufacturing activity have shown pockets of the economy that have at least begun to recuperate some of the damage done during the height of stay-in-place orders.Story continues“Many people believe that the market isn’t accurately reflecting the severity of the underlying health and economic crisis – that’s because the market is focused on the future versus what’s happening in real-time,” Peter Giacchi, head of designated market maker floor trading for Citadel Securities, said in an email.“The reason we saw real-time record lows at the beginning of the pandemic was because of the uncertainty surrounding the virus,” he added. “Now that investors, to a certain degree, have a handle on the situation, the moves have become more forward-looking, more optimistic and the market is behaving as it historically has to date.”—4:02 p.m. ET: Stocks close slightly lower; Target surges 12.7% after reporting blowout earningsHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): -14.87 points (-0.44%) to 3,374.91Dow (^DJI): -85.12 points (-0.31%) to 27,692.95Nasdaq (^IXIC): -64.38 points (-0.57%) to 11,146.46Crude (CL=F): -$0.10 (-0.23%) to $42.79 a barrelGold (GC=F): -$67.30 (-3.34%) to $1,945.80 per ounce10-year Treasury (^TNX): +0.6 bps to yield 0.6750%—2:05 p.m. ET: FOMC sees pandemic ‘posing considerable risks to the economic outlook over the medium term’The Federal Open Market Committee’s minutes from its July meeting reflected US central bankers’ view that consumer spending trends were improving off early-spring lows, but that overall economic activity remained pressured by the ongoing coronavirus pandemic.“Members agreed that the ongoing public health crisis would weigh heavily on economic activity, employment, and inflation in the near term and was posing considerable risks to the economic outlook over the medium term,” according to the FOMC minutes. “In light of these developments, members decided to maintain the target range for the federal funds rate at 0 to ¼ percent. Members stated that they expected to maintain this target range until they were confident that the economy had weathered recent events and was on track to achieve the Committee’s maximum employment and price stability goals.”“In contrast to the sizable rebound in consumer spending, participants saw less improvement in the business sector in recent months, and they noted that their District business contacts continued to report extraordinarily high levels of uncertainty and risks,” the minutes added.—12:50 p.m. ET: Stocks hold onto narrow gainsThe three major indices were each slightly higher Wednesday afternoon, steadying around record levels. The tech-heavy communication services sector led gains in the S&P 500, followed by industrials and financials. A more than 2% gain in shares of Nike led the advance in the Dow, though a more than 1% drop in shares of Walmart weighed to the downside.Here were the main moves in equity markets as of 12:50 p.m. ET:S&P 500 (^GSPC): +4.86 points (+0.14%) to 3,394.64Dow (^DJI): +39.71 points (+0.14%) to 27,817.78Nasdaq (^IXIC): +28.02 points (+0.25%) to 11,239.00—10:50 a.m. ET: Apple’s market capitalization tops $2 trillion for the first time everApple (AAPL) shares climbed more than 1% intraday Wednesday to more than $467.77 per share, bringing its market capitalization above the $2 trillion mark, based on shares outstanding as listed in public filings.This made Apple the first US company ever to hit the $2 trillion level for market capitalization. Apple is also the world’s most valuable publicly traded company, topping the market value even of Saudi oil giant Saudi Aramco.Shares of Apple have risen 59% so far for the year to date amid a broader run-up in tech shares.—9:32 a.m. ET: Stocks slightly higher as markets open for tradingHere were the main moves in markets, as of 9:33 a.m. ET:S&P 500 (^GSPC): +3.43 points (+0.1%) to 3,393.22Dow (^DJI): +28.15 points (+0.1%) to 27,806.22Nasdaq (^IXIC): +4.17 points (+0.04%) to 11,217.95Crude (CL=F): -$0.34 (-0.79%) to $42.55 a barrelGold (GC=F): -$14.90 (-0.74%) to $1,998.20 per ounce10-year Treasury (^TNX): -1.3 bps to yield 0.656%—7:38 a.m. ET: Lowe’s posts 35% US home-improvement sales growth with customer DIY projects on the riseLowe’s (LOW) mirrored its peer Home Depot in reporting estimates-topping second-quarter sales and profit, as a surge in consumer DIY projects during stay-in-place orders boosted results.Second-quarter US home improvement comparable sales were up 35.1%, or well above the 19.6% gain expected, as every major US geographic segment grew in excess of 30%. Sales were driven by “a consumer focus on the home, core repair and maintenance activities, and wallet share shift away from other discretionary spending,” CEO Marvin Ellison said in a statement. Sales momentum is continuing into August, he added.Overall, Lowe’s second-quarter adjusted earnings per share of $3.75 were better than the $2.90 expected, and revenue of $27.3 billion topped estimates for $24.15 billion.—7:30 a.m. ET: Stock futures point to a mostly higher open after strong set of earningsHere were the main moves in markets, as of 7:30 a.m. ET:S&P 500 futures (ES=F): 3,391.5.00, up 4.5 points or 0.13%Dow futures (YM=F): 27,766.00, up 49 points, or 0.18%Nasdaq futures (NQ=F): 11,409.00, flatCrude (CL=F): -$0.33 (-0.77%) to $42.56 a barrelGold (GC=F): -18.70 (-0.93%) to $1,994.40 per ounce10-year Treasury (^TNX): -2 bps to yield 0.649%—7:25 a.m. ET: Target reports record comp sales growth as digital sales surgeTarget (TGT) posted second-quarter results that shocked to the upside, as the company saw “unusually strong market-share gains” across all of its core categories, as consumers flocked to the big-box retailer online especially during the pandemic.Target’s comparable same-store sales rose by a record 24.3%, or nearly three times the 8.6% growth rate expected. Digital sales were a strong point, climbing 195% to comprise 13.4 percentage points of the headline comp sales growth.Every major category grew sales in the second quarter, including apparel, which swung from a 20% sales decline in the first quarter to double digit growth in the second. Home goods sales grew 30%, electronics jumped 70%, beauty rose 20%, food/beverage increased 20% and essentials sales climbed 20%.—7:00 a.m. ET Wednesday: Mortgage applications fell last week as refinances softened, but purchases continued to climbAn index tracking mortgage applications for home purchases and refinances fell last week, unwinding some recent gains as housing market activity picked up across the country.The Mortgage Bankers’ Association Market Composite Index, which tracks mortgage loan application volume, fell 3.3% on a seasonally adjusted basis for the week ended August 14, following a 6.8% climb during the previous week. The drawdown was driven by a 5% decline in refinances week-over-week, although the level of refinances remained 38% higher than the same week a year ago. Applications for purchases rose 1% week over week.“Positive economic data reported last week on retail sales, as well as a large US Treasury auction, drove mortgage rates to their highest level in two weeks. The rise in rates dampened refinance activity, but purchase applications continued their strong run and were 27% higher than a year ago – the third straight month of year-over-year increases,” Joel Kan, MBA’s associate vice president of economic and industry forecasting, said in a statement.“The housing market remains a bright spot in the current economic recovery and these results, combined with July data on housing starts and homebuilder optimism, suggest that housing supply could be increasing to better meet the strong demand for buying a home,” Kan added.—6:07 p.m. ET Tuesday: Stock futures open flat after record closesHere were the main moves in equity markets, as of 6:07 p.m. ET:S&P 500 futures (ES=F): 3,387.00, flatDow futures (YM=F): 27,719.00, up 2 points, or 0.01%Nasdaq futures (NQ=F): 11,406.75, down 2.5 points, or 0.02%A trader works on the floor of the New York Stock Exchange shortly after the opening bell in New York, August 18, 2015. The Commerce Department report on Tuesday added to solid payrolls, retail sales and industrial output data in suggesting the economy got off to a strong start in the third quarter. The steady flow of upbeat economic reports has bolstered views that the Federal Reserve will raise interest rates in September. REUTERS/Lucas Jackson TPX IMAGES OF THE DAY—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}