{"article": [{"url": "https://finance.yahoo.com/news/aclu-sues-to-stop-sba-from-denying-ppp-loans-to-people-with-criminal-records-151800870.html", "published": 1592303180.0, "headline": "ACLU sues to stop SBA from denying PPP loans to people with criminal records", "body": "Several civil rights groups are filing a lawsuit to stop the Small Business Administration from denying Paycheck Protection loans to people with criminal histories. The American Civil Liberties Union, the Public Interest Law Center and Washington Lawyers Committee filed the suit on June 16.The groups argue the “arbitrary” and “unlawful” rules shut out many small business owners with criminal records, and disproportionately impact people of color.“This really comes at a very trying time and a time when these same communities have been the most affected by COVID. So we are fighting to ensure that all businesses are able to access the support that's been provided by the federal government ” said ReNika Moore, Director of the ACLU’s Racial Justice Program, in an interview with Yahoo Finance. “We don't understand the exclusions that the SBA has imposed.”The groups filed the suit on behalf of Defy Ventures, a nonprofit that helps formerly incarcerated people start their own businesses and two Black business owners, Sekwan Merritt and John Garland.Merritt – who owns Lightning Electric, a small electrical contracting business in Maryland – is still on parole for a 2012 drug conviction.Another barrier to PPP loansIn an interview with Yahoo Finance, Merritt said COVID-19 and the resulting stay-at-home order nearly shut down the business. Merritt said he applied for a Paycheck Protection Program loan, but was denied because he’s still on parole.“It kills me. It kills me,” said Merritt. “It just further shows how tall of a mountain that a person – you know, formerly incarcerated with a past – just continuously has to climb.”Sekwan Merritt, owner of Lightning Electric. (Provided by Sekwan Merritt)Merritt told Yahoo Finance he and his family have used their own savings to fund his business, because his record has made finding financing elsewhere difficult— a common problem for people who have spent time in prison.“This creates a barrier, when we should be encouraging them — and this is really counterproductive in the signal we want to be sending to returning citizens, to be able to become self-sufficient, contributing members of their communities,” said Moore.Story continuesMerritt told Yahoo Finance he aims to hire and train other people who have been released from prison, but without the PPP loan it’s difficult to keep his workers on payroll.“I had a dream to change my life,” said Merritt. “My dream in Lightning Electric is so much more than just an electrical contracting company. You know, it's a hope builder for people that come from those communities, from people that may be out there committing these crimes, to show them that you can do so much more with your life – and that’s the reason why I push so hard.”The Treasury Department and Small Business Administration previously put rules in place keeping people from getting PPP loans if they had a felony on their record in the past five years.Some Republican and Democratic lawmakers opposed the rule and wrote legislation to change it. Sen. Cory Booker (D-NJ), Sen. Rob Portman (R-OH), Sen. Ben Cardin (D-MD) and Sen. James Lankford (R-OK) have introduced the Paycheck Protection Program Second Chance Act, which would remove the ban on people with non-financial felony convictions.New guidance but still not enoughIn a hearing last week, lawmakers pressed Secretary Steven Mnuchin to change the rules. Mnuchin said he planned to reduce the look-back period to three years, but was open to reducing it further. On Friday night, Treasury and SBA released new guidance, reducing the time to one year. The time period remains five years for financial felonies like fraud, bribery and embezzlement.Secretary of the Treasury Steven Mnuchin testifies with Jovita Carranza, Administrator Small Business Administration during the Senate Small Business and Entrepreneurship Hearings to examine implementation of Title I of the CARES Act on Capitol Hill on June 10, 2020. (Photo by Kevin Dietsch/Getty Images)The new guidance also eliminates pretrial diversion status from affecting eligibility — a change Booker (D-NJ) pushed for in the hearing on Wednesday. But Moore argues those changes don’t help the plaintiffs in this case -- Merritt would still be denied because he’s on parole and Garland would be denied because he’s facing a charge, but has not been convicted.Cardin, Booker, Lankford and Portman said in a statement on Tuesday that the updated guidance still failed to fix a “major flaw.”“We remain concerned that individuals who have not yet had their day in court will still be prevented from securing a PPP loan, which violates a core tenet of our society: the presumption of innocence,” said the senators. “We further want to reiterate that it is inappropriate to exclude from the PPP any entrepreneur who has a prior felony unrelated to a financial crime. We will continue working with the Administration to ensure that small business owners and their employees are not unjustly prevented from securing these job-saving loans.”Moore told Yahoo Finance the changes to the guidelines have also been confusing for formerly incarcerated people who are trying to figure out if they are eligible for the loans.The groups are asking the court to eliminate the exclusions and extend the June 30 application deadline by 21 days, to give applicants excluded because of their criminal records more time to apply for the loans. They also want the SBA to set aside some of the PPP money to ensure people who were originally excluded can still access the funding.Without a PPP loan, Merritt says his business is likely at risk, but he’s determined to figure out how to keep going.“My goal is just so much more, that I can't stop,” said Merritt.Yahoo Finance reached out to the Treasury Department and Small Business Administration.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Coronavirus oversight panel Democrats ask banks for info, docs on PPP loansSen. Menendez: May jobs report surprise ‘isn't solace' to unemployed workersFed, Treasury have failed to protect jobs so far: oversight panel memberLawmakers try to change Paycheck Protection Program to give businesses flexibilityWyden pushes for unemployment benefits tied to unemployment rates amid coronavirus pandemic"}]}