{"article": [{"url": "https://finance.yahoo.com/news/tesla-rival-nikola-scores-deal-to-make-thousands-of-1000-horsepower-electric-garbage-trucks-130025051.html", "published": 1597046900.0, "headline": "Tesla rival Nikola scores deal to make thousands of 1,000-horsepower electric garbage trucks", "body": "If Nikola (NKLA) founder Trevor Milton has his way, the garbage trucks emitting black smoke that troll the streets will eventually be a thing of the past.Milton and his team at Nikola took a giant step in that mission on Monday.The upstart electric- and hydrogen-powered truck maker announced a deal with waste management giant Republic Services for 2,500 electric, zero emission garbage trucks. A dollar amount for the contract wasn’t disclosed. The deal is expandable up to 5,000 trucks. Full production deliveries are expected to begin in 2023 — road testing is set to commence in late 2021 and early 2022.Each truck will have its powertrain software limited to 1,000 horsepower.“Nikola specializes in heavy-duty, zero-emission Class 8 trucks. The refuse market is one of the most stable markets in the industry and provides long-term shareholder value,” Milton said in a statement.The Republic Services deal adds to Nikola’s semi-truck backlog, which Milton has told Yahoo Finance far exceeds 14,000 units valued at $10 billion in potential revenue.Republic Services truck.Nikola — which has not yet begun production — plans to have its first electric-powered semi-truck out on the market in 2021 (likely before Tesla’s Semi). Hydrogen-powered options are projected to follow in 2023. The company recently broke ground on its manufacturing facility in Arizona. Once phase three is completed, the site is seen producing 35,000 units a year on two shifts.Meanwhile, the company is poised to announce a manufacturing partner for its new Badger electric pickup truck.To be sure, Nikola shares have been very volatile since the company debuted in early June. The stock nearly tripled to a high of $94 in under two weeks of being public amid hype around the company’s new technologies and its potential to compete effectively with Tesla. It has since come back down to $36 or so as investors better grasp the company’s production timeline and business model.In its first earnings release as a public company on August 4, Nikola revealed it had incurred a $119 million net loss through the first six months of 2020 — in large part because it has no revenues yet.Story continuesBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}