{"article": [{"url": "https://finance.yahoo.com/news/david-chang-eat-a-peach-sexism-in-restaurant-world-202743590.html", "published": 1600788920.0, "headline": "David Chang on sexism in the restaurant industry: ‘I’ve been a bully’", "body": "David Chang has established himself as a bold, brash and innovative chef. Driven by his passion to make Asian food accessible to the average American diner, not just the gourmands, Chang has built an impressive and unconventional empire through the Momofuku restaurant group.In his new book entitled, “Eat a Peach: A Memoir,” Chang — in his signature self-deprecating manner — delves deep into his disillusionment with the high-brow culinary ecosystem, battles with mental health and bipolar disorder and toxic work environments that he was subject to but also helped perpetuate.“The industry, particularly a certain kind of dining, is based on a military system. And a lot of that toxic behavior is...I came from that, right, and I've been a bully, and I've verbally abused people. And it's something that I've worked really hard on,” Chang told Yahoo Finance editor-in-chief Andy Serwer earlier this month, in response to a question about sexism in the restaurant industry. “It’s not the entire culture, but it's certainly been the part that has been celebrated.”David Chang photographed at his restaurant Ko in New York, New York on August 26, 2019. (Photo by Marvin Joseph/The Washington Post via Getty Images)The #MeToo movement rattled the culinary world in the last two and a half years, bringing to light sexual misconduct allegations against celebrity chef Mario Batali and restaurateur Ken Friedman, among others. But the male-dominated, cutthroat pressure cooker that is the culinary world is finally starting to evolve away from being just a “boy’s club,” Chang indicated in his interview with Yahoo Finance.“I think the entire industry is trying to ask themselves the hard questions of why. I've certainly been part of the boys’ club... I think we're at a point about equality, representation and opportunity. And I think treating people the way you would want to be treated,” he said.“And it's long overdue that people are saying ‘this doesn't work anymore.’ In fact, it's never really worked. And I don't know exactly what's going to happen. But I think it's in a good place where people are asking, ‘Let's not continue this. Let's try to come up with a new solution, a new way of doing it,’” he added.Story continuesLast April, Chang stepped down as CEO of the Momofuku restaurant group he carefully crafted over the last decade and a half. He named 31-year-old Marguerite Zabar Mariscal, who started as an intern in 2011, his successor. She now oversees the operations of 15 restaurants and counting.Chang has been focusing on television shows like Netflix’s (NFLX) “Ugly Delicious” and “Breakfast, Lunch & Dinner.” Through his production company Majordomo Media, he is working on a slate of content, including a forthcoming Hulu (DIS) docuseries “The Next Thing You Eat,” in collaboration with documentary filmmaker Morgan Neville.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Paris Hilton explains why TikTok is her favorite appGolf sees huge upswing with women and young adults: ‘You can take your bag full of White Claws’Netflix's Reed Hastings: ‘Thank God’ Blockbuster didn’t want to buy us‘Mulan’ producer on boycott threats: ‘I feel badly...the conversation turns to this’What Silicon Valley still doesn't understand about its diversity problem'People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talent"}]}