{"article": [{"url": "https://finance.yahoo.com/news/slow-september-for-us-economy-morning-brief-095117511.html", "published": 1600405160.0, "headline": "A slow September for the U.S. economy: Morning Brief", "body": "Friday, September 18, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThings could be worse, but this doesn’t make them good.The U.S. economic recovery slowed in September, according to economists.But given the absence of new stimulus and the continued spread of COVID-19, this growth-at-a-slower-pace outcome suggests the recovery may continue even in the absence of a new stimulus package.And the fact that the economy isn’t in an outright contraction is a nice upside surprise given that fresh stimulus had been seen as essential for any recovery to continue just a few months back.“The pace of economic recovery has slowed in the last month, but that is arguably still an impressive result given the surge in coronavirus cases over the summer, and the more recent expiry of the enhanced unemployment benefits,” said Paul Ashworth, an economist at Capital Economics in a note on Thursday.Retail sales, for instance, are back above pre-pandemic levels. But consumption in the services sector — such as at restaurants, where much of current unemployment is focused — has slowed at levels well below those that prevailed last year.September’s data also showed a temporary pop from the Labor Day holiday, with economists at Bank of America Global Research noting that seated diners, according to OpenTable and TSA passenger data, both took a step back last week after a pop around the holiday.Like Capital Economics, however, Bank of America also sees a recovery that continues to be quite resilient. “Bottom line: Labor Day has distorted the signal from many of the high frequency indicators that we track,” the firm said in a report published Wednesday.“However, the New York Fed weekly economic index and Dallas mobility and engagement index continue to signal that the recovery has continued in September, but there is still a long road ahead before the economy is fully healed.”Over at Oxford Economics, Gregory Daco notes that the firm’s proprietary recovery tracker index fell for week ended September 4 — the most recent week for which the firm has complete data — though most of this decline was due to the selloff in markets that tightened financial conditions.Story continuesDaco is also tracking concerning signs in the labor market, however, where gains slowed in early September at both the national and regional level.“Employment continued to climb on stronger job openings and increased employment at small businesses, but momentum slowed,” Daco writes. Adding that, “regional labor market recoveries have lost strength, posing a risk to consumer spending absent additional fiscal aid.”The labor market recovery lost momentum in early September while overall activity has been resilient even amid the absence of additional fiscal stimulus. (Source: Oxford Economics)But given the mid-summer conversation about a “benefits cliff” the economy has now walked off with the CARES Act expiring at the end of July, a slowing but not contracting economy is a positive and surprising development.Which suggests a more durable recovery is possible if either a vaccine is available earlier than expected or fiscal stimulus is made available to consumers in the months ahead.But these positive developments are far from an all-clear that the pandemic-induced downturn is behind us and that further diligence isn’t warranted.“Activity in the housing sector has returned to its level at the beginning of the year, and we are starting to see signs of an improvement in business investment,” Federal Reserve Chair Jerome Powell said Wednesday. “The recovery has progressed more quickly than generally expected, and forecasts from FOMC participants for economic growth this year have been revised up since our June Summary of Economic Projections.”“Even so, overall activity remains well below its level before the pandemic and the path ahead remains highly uncertain,” Powell said.Adding: “A full economic recovery is unlikely until people are confident that it is safe to re-engage in a broad range of activities.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Current account balance, second quarter (-$160.0 billion expected, -$104.2 billion during the first quarter)10:00 a.m. ET: Leading index, August (1.3% expected, 1.4% in July)10:00 a.m. ET: University of Michigan Sentiment, September preliminary (75.0 expected, 74.1 in August)Top NewsEuropean stocks dip as infections rise and central banks 'sit on their hands' [Yahoo Finance UK]TikTok’s owner is getting surer Beijing will OK U.S. deal [Bloomberg]Bank of England stokes negative interest rate speculation [Yahoo Finance UK]In Wisconsin, Trump announces $13 billion in farm aid [Reuters]YAHOO FINANCE HIGHLIGHTSWhole Foods CEO does not think online grocery will remain the norm post-pandemic: 'Food is different'Google-backed 'plumber' Amwell spikes in debut, IPO a barometer of booming telehealth marketWarren and Schumer urge student debt cancellation of up to $50,000 for all federal borrowers—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}