{"article": [{"url": "https://finance.yahoo.com/news/fourth-of-july-coronavirus-june-jobs-report-what-to-know-in-the-week-ahead-221918283.html", "published": 1593365240.0, "headline": "Fourth of July, coronavirus, June jobs report: What to know in the week ahead", "body": "It will be a shortened trading week with major markets closed Friday in observance of the Fourth of July holiday. Nevertheless, it is gearing up to be an important week for markets with the economic recovery in focus. Investors will be closely monitoring the recent resurgence in COVID-19 cases across a handful of states and the big June jobs report due out Thursday.Coronavirus cases are back on the rise in more than 30 U.S. states including Texas, Arizona, California, Florida and Nevada. The seven-day average of new cases in the U.S. jumped by more than 41% compared with a week ago, as of Friday. As a result, Texas and Florida have had to re-close certain businesses and Arizona put its entire reopening plan on pause.According to Johns Hopkins University data, the number of COVID-19 cases in the U.S. surpassed 2.5 million for the first time Saturday.“The U.S. should have benefitted from the earlier successes and failures of plans in Europe and Asia. But over the last few days, more than a dozen states saw a notable rise in the number of cases and nearly half of those states experienced an uptick in the positive test percentage,” Raymond James Chief Investment Officer Larry Adam wrote in a note June 26.“Disappointingly, the U.S., in aggregate, has not experienced a significant, prolonged downward trend in new cases as seen in countries like Italy and Spain. While a slight rise was expected in light of eased restrictions, recent trends suggest the first wave is not over and that an ‘all hands on deck’ approach is needed to prevent new epicenters from forming,” Adam added.Protestors on hand during an appearance by Florida Gov. Ron DeSantis at the Oh Sooo Jazzy hair salon in Orlando, Fla., on Saturday, May 2, 2020. (Stephen M. Dowell/Orlando Sentinel/Tribune News Service via Getty Images)June jobs reportThe Bureau of Labor Statistics is scheduled to release the June jobs report Thursday morning ahead of a long holiday weekend. Economists surveyed by Bloomberg anticipate the U.S. economy added 3 million nonfarm payrolls during the month, up from 2.5 million job additions in May. The unemployment rate is expected to have ticked lower to 12.4% in June from 13.3% in the prior month.Story continues“The U.S. economy shed over 20 million jobs since its February pre-COVID peak. The surprise 2.5 million increase in May nonfarm payrolls, however, suggested the pick-up in employment materialized earlier than expected. The rebound in the labor market likely continued in June,” Wells Fargo Securities wrote in a note June 26.The firm argued that while the June jobs report figure will likely show continued improvement, the payroll additions will still be well below their February peak. “The recovery will take some time, and it will likely be a few years before the level of payrolls gets back to new highs,” according to the firm.Meanwhile, J.P.Morgan explained that it is still rather unclear what the data will show headed into Thursday’s report.“We normally consider the data on unemployment claims to be among our most useful economic indicators. They do not come from surveys, which can be affected by various errors and biases, but instead are based on counts of claimants sourced directly from state unemployment offices. Although processing delays and other issues have been common since COVID-19 arose, the claims data still provided a reasonable guide for what to expect in the historic April payroll report,” J.P.Morgan economist Jesse Edgerton said in a note.Typically weekly jobless claims are a decent indicator for what to expect from the BLS employment report. However, the large discrepancy between the May jobs report and weekly jobless claims makes it harder to predict what the June jobs report will illustrate, according to Edgerton.Economic calendarMonday: Pending Home Sales month-on-month, May (+18% expected, -21.8% in April); Dallas Fed Manufacturing Activity, June (-22 expected, -49.2 in May)Tuesday: MNI Chicago PMI, June (44.0 expected, 32.3 in May); Conference Board Consumer Confidence, June (90.5 expected, 86.6 in May)Wednesday: MBA Mortgage Applications, week ending June 26 (-8.7% prior); ADP Employment Change, June (2.95 million expected, -2.76 million in May); Markit US Manufacturing PMI, June Final (49.6 expected, 49.6 prior); Construction Spending month-on-month, May (+0.9% expected, -2.9% in April); ISM Manufacturing, June (49.5 expected, 43.1 in May); ISM Prices Paid, June (45.0 expected, 40.8 in May); Wards Total Vehicle Sales, June (13 million expected, 12.21 million in May)Thursday: Trade Balance, May (-$53.0 billion expected, -$49.4 billion in April); Change in Nonfarm Payrolls, June (3 million expected, 2.509 million in May); Change in Manufacturing Payrolls, June (425,000 expected, 225,000 in May); Unemployment Rate, June (12.4% expected, 13.3% in May); Initial Jobless Claims, week ending June 27 (1.336 million expected, 1.48 million prior); Continuing Claims, week ending June 20 (18.904 million expected, 19.522 million prior); Bloomberg Consumer Comfort, week ending June 28 (41.4 prior); Durable Goods Orders, May final (15.8% expected, 15.8% prior); Durables excluding Transportation, May final (4.0% expected, 4.0% prior); Factory Orders, May (7.9% expected, -13.0% in April);Friday: Markets closed in observance of Fourth of July holidayEarnings calendarMonday: Micron (MU) after market closeTuesday: ConAgra (CAG) before market open; FedEx (FDX) after market closeWednesday: Constellation Brands (STZ), General Mills (GIS), Macy’s (M) before market openThursday: N/AFriday: Markets closed in observance of Fourth of July holiday—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.48 million Americans file for unemployment benefitsWhite Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance news"}]}