{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-passes-200-k-deaths-as-europe-outlook-darkens-fda-adds-teeth-to-vaccine-approval-202558630.html", "published": 1600788800.0, "headline": "Coronavirus update: US death toll tops 200K as Europe outlook darkens; FDA adds teeth to vaccine process", "body": "The U.S. marked a grim milestone in the coronavirus pandemic, with more than 200,000 deaths reported Tuesday, even as optimism continues to rise over a vaccine.The new total reaches what was seen as the upper limit of deaths in April, when the pandemic was taking hold in the country. Last week, the U.S. Centers for Disease Control and Prevention (CDC) updated its forecast, anticipating a total of 207,000 to 218,00 deaths by the week ending October 10.Back in April, the milestone was one that Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases (NIAID), was optimistic the U.S. could avoid. “I don’t accept every day that we’re going to have to have 100- to 200,000 deaths. I think we can really bring that down,” he said then.But without a cohesive national strategy to curb the outbreak, and amid breakdowns in social distancing and other mitigation strategies in parts of the country, experts have warned the virus is going to continue to impact the U.S. for some time.White House Press Secretary Kayleigh McEnany defended President Donald Trump’s response on Tuesday, as the president comes under increasingly withering criticism about his handling of the crisis. McEnany insisted Trump did not downplay the outbreak or keep critical information from the public, something he admitted doing to Washington Post editor Bob Woodward in a recorded call earlier this year.“The fact that we have come nowhere near [2 million deaths] is a testament to this President taking immediate action,” she said, referring to initial models that projected up to that many fatalities.As Trump continues to ramp up expectations of an effective inoculation before year’s end, The Washington Post reported late Tuesday that the Food and Drug Administration is expected to outline a tougher standard toward emergency approval of any vaccine — making it unlikely to meet the Election Day deadline suggested by the president and others.Story continuesWith experts worried that a rushed development process will undermine the public’s faith in a vaccine, The Post reported that FDA officials are moving to address that with more transparency and strict guidelines for approval of any cure.The U.S. has now surpassed 200,000 deaths from coronavirus. (Graphic: David Foster/Yahoo Finance)Europe not much betterEuropean countries face new restrictions as parts of the continent see surges in cases, some marking a second wave of the outbreak.France reported more than 10,000 cases Sunday, and Britain reported nearly 4,000. As a result, the U.K. government is imposing new restrictions it says will likely last for the next six months.Those restrictions include closing pubs by 10 p.m. and encouraging work from home, Prime Minister Boris Johnson said Tuesday.“We will spare no effort in developing vaccines, treatments and new forms of mass testing, but unless we palpably make progress, we should assume that the restrictions I have announced will remain in place for perhaps six months,” he said.Fall and winter months in the Northern Hemisphere have been expected to result in a second wave of the virus, as the world waits for a vaccine to be approved.The global coalition for a vaccine, COVAX Facility, which includes the world’s top public health, vaccine and philanthropic entities, announced Monday it has the support of 64 high-income countries.But some of the world’s largest economies are notably absent, including the U.S., Russia and China. Beijing and Moscow have already authorized vaccines being distributed to their populations.“Vaccine nationalism will only perpetuate the disease and prolong the global recovery. Working together through the COVAX Facility is not charity, it’s in every country’s own best interests to control the pandemic and accelerate the global economic recovery,” said WHO director general Tedros Adhanom Ghebreyesus.Despite the U.S.’s absence, the global scientific community remains in communication about best practices, as evidenced by presentations during the Advisory Committee on Immunization Practices (ACIP) meeting Tuesday.ACIP will be advising the CDC on the proper strategy to roll out a vaccine once it is authorized or approved. Two leading contenders, Moderna (MRNA) and Pfizer (PFE) along with BioNTech (BNTX), expect initial readings of their vaccine’s safety by earliest end of October or into November.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}