{"article": [{"url": "https://finance.yahoo.com/news/market-volatility-consumer-sentiment-what-to-know-in-markets-friday-000401801.html", "published": 1591902740.0, "headline": "Market volatility, consumer sentiment: What to know in markets Friday", "body": "Investors will be bracing for another potentially volatile day on Wall Street Friday following the carnage during the previous session.After a strong start to the week, stocks took a turn for the worse Thursday and sold off steeply into the close. All three of the major indices logged their worst day since March 16. The Dow (^DJI) saw its fourth worst point loss on record.The selloff on Thursday didn’t appear to be in reaction to specific news, according to Brian Price, head of investments for Commonwealth Financial Network. “The rally that we’ve seen off of the mid-March lows was a little excessive in my opinion so some natural consolidation is not surprising. We’ve been hearing about retail investors increasingly speculating on riskier stocks and sectors of the market, and that type of enthusiasm can sometimes be a contrarian indicator,” Price said in an email Thursday.“There are also some questions about an increasing number of coronavirus infections and hospitalizations in certain U.S. states which is, of course, cause for concern. As we’ve crossed over 2 million cases here in the U.S., it seems as though states are continuing to move forward with reopening plans despite concerns about a next wave of the virus,” he added.Customers dine outside at The Inn at Little Washington, one of the countrys most renowned restaurants, on the first day of Virginia's phase one reopening in Washington, Virginia on May 29, 2020. (Photo by Olivier DOULIERY / AFP) (Photo by OLIVIER DOULIERY/AFP via Getty Images)Meanwhile, on the economic calendar, the University of Michigan will be releasing its consumer sentiment reading for June. Economists surveyed by Bloomberg anticipate consumer sentiment rose for the second straight month to 75.0 from 72.3 in May.“Since troughing in April, both the UMich and the Conference Board measure of consumer confidence have only improved slightly,” Credit Suisse said in a note June 4. “State reopenings and gains in the stock market should help lift consumer optimism, but the enormous economic uncertainty, nationwide protests, and the impaired labor market are like to keep confidence low in coming months.”—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.Story continuesMore from Heidi:Jobless claims: Another 1.54 million Americans file for unemployment benefitsA theory for why the 'startling' jobs numbers conflict with the other gloomy dataPopeyes US sales are making a massive comebackFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}