{"article": [{"url": "https://finance.yahoo.com/news/joe-bidens-tax-plan-may-wallop-the-stock-market-heres-one-disturbing-estimate-173751982.html", "published": 1594298720.0, "headline": "Joe Biden's tax plan may wallop the stock market — here's one disturbing estimate", "body": "Say it ain’t so, Joe.Details on how former vice president Joe Biden would rebuild the U.S. economy in the wake of the COVID-19 pandemic if he were elected president in November hit the newswires on Thursday. And one thing was confirmed for many market watchers: A Biden presidency may not be so great for stock prices.“Biden will ensure that corporate America finally pays their fair share in taxes, puts their workers and communities first rather than their shareholders, and respects their workers’ power and voice in the workplace,” a Biden campaign email memo wrote Thursday. Titled “Build Back Better,” the plan is in line with many traditional Democratic efforts around expanded social safety nets and infrastructure investments.To help pay for it all, Biden is keen on reversing President’s Trump’s signature corporate taxes to businesses that prior to the pandemic, had helped send stock prices to record highs.“He will pay for the ongoing costs of the plan by reversing some of Trump’s tax cuts for corporations and imposing common-sense tax reforms that finally make sure the wealthiest Americans pay their fair share,” the memo outlined in bolded font.The former vice president has put forth reversing half of the president’s signature tax cuts, lifting the statutory rate to 28%. Investment bank Credit Suisse estimates this change in taxes would increase the effective rate by 4% to 5%, and slash $9 off estimated S&P 500 earnings per share. Goldman Sachs has projected that Biden’s tax plan would lead it to reduce its 2021 earnings estimate by 12%.Democratic presidential candidate, former Vice President Joe Biden speaks at Alexis Dupont High School in Wilmington, Del., Tuesday, June 30, 2020. (AP Photo/Patrick Semansky)Theoretically, those estimate revisions would put marked pressure on stock prices.“There’s a problem. It’s all after-tax. That’s unfortunate but at the end of the day, the money you put in your pocket is after-tax. You need to put more money in your pocket. It [the Biden plan] means that stocks — all things being equal — would be lower by 25% than they are today. It may not work that way. That is at least the theory,” explained SMH Group CEO George Ball on Yahoo Finance’s The First Trade.Story continuesBall isn’t alone on the Street in thinking Biden is bad for markets.“Certainly Biden’s tax plan is a headwind for the market,” said Momentum Advisors chief investment officer Allan Boomer on The First Trade. “I estimate that if the corporate tax rate goes up, it could bring down S&P 500 earnings by about 10%. The market is overbought for a lot of reasons. Politics is one headwind. Clearly what is happening with Covid is a headwind. So I think the tax issue with Biden is just one.”One that this rally stock market has overlooked, but perhaps not for long.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}