{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-rising-cases-stoke-testing-debate-fauci-sounds-optimism-on-vaccine-170910469.html", "published": 1592914640.0, "headline": "Coronavirus update: Rising cases fan testing debate; Fauci optimistic on vaccine timeline", "body": "Global coronavirus diagnoses topped 9 million, underscoring the difficulties governments around the world are having in trying to contain the pandemic — which is hammering Brazil and India while sparking more debates over testing and relaxing economic lockdowns.Amid a new controversy over federal support for COVID-19 testing, the U.S. is struggling to contain the virus that’s sickened 2.3 million and killed 120,000. Currently in the U.S., younger individuals are increasingly impacted by the virus, which disproportionately affected older patients in the outbreak’s early stage.Still, most public officials are balking at the idea of reinstating strict stay-at-home orders that have throttled the global economy, with most observers suggesting hospitalizations and deaths are not yet at levels that would force a new lockdown. In Texas, one of the many concerning states in the south with surging hospitalizations, Gov. Greg Abbott said a new lockdown would be the last option.Over the last few days, President Donald Trump sparked concern — and confusion— among health experts by suggesting the U.S. should slow down testing, with increases leading to worrying surges in case counts in Sun Belt states.On Tuesday, White House coronavirus task force members including CDC director Robert Redfield, FDA commissioner Stephen Hahn, National Institute of Allergy and Infectious Diseases director Anthony Fauci and HHS official and testing czar Admiral Brett Giroir, testified in front of the Energy and Commerce committee Tuesday.Fauci remained optimistic on vaccines, saying Tuesday that, “Although you can never guarantee the safety and efficacy of a vaccine until you test it in the field,” it is about “when, not if” one is available by the end of 2020.He has previously said an indication of success is likely by September, meanwhile companies are set to produce millions of doses at-risk in the meantime.Yet questions still remain about what type of vaccine will be most effective, especially on different age groups, as well as how long a vaccine can protect against the virus — and who will get access to a successful vaccine first.Story continuesThere are over 2.3 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)The NIAID director added that none of the task force members have been directed to slow testing, with Giroir adding that the country is on track to complete 40 to 50 million tests by the fall.Meanwhile, health experts have been pushing for more testing, as some vulnerable and minority communities have been left out of the current case count. In response, mobile testing sites have become more prominent, the latest pilot program announced in Chicago by mayor Lori Lightfoot on Tuesday.Sanofi (SNY) has partnered with a U.S. biotech in a deal worth up to $2 billion, to develop an mRNA vaccine candidate for the coronavirus, the company announced Tuesday. Sanofi is already working on a vaccine being developed in partnership with GlaxoSmithKline (GSK), which is set to being clinical trials in September, using a traditional vaccine technology.The mRNA technology is also being used by Moderna (MRNA) — a leader in the vaccine race— as well as Pfizer (PFE), but is untested in the market. The partnership with Translate Bio could see clinical trials begin in the fourth quarter of 2020, according to Sanofi, but its candidates are unlikely to be approved for emergency use until the end of 2020, at the earliest.International outlook grows more direThere are over 9 million coronavirus cases worldwide. (Graphic: David Foster/Yahoo Finance)With Brazil and India emerging as new global epicenters, Germany — Europe’s largest economy — slapped lockdown measures on a part of the country Tuesday after a slaughterhouse reported a surge of cases this week. Officials said 360,000 residents were under strict lockdown orders, and bars and gyms would close, with only restaurants remaining open.Meanwhile, Saudi Arabia has limited the number of visitors to Mecca for the annual pilgrimage (Haj) to 1,000 individuals already in the country, barring any outsiders from visiting, in order to prevent the spread of the virus.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}