{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-16-2020-221811044.html", "published": 1594912280.0, "headline": "Stock market news live updates: Dow ends 4-session winning streak after jobless claims, retail sales", "body": "Stocks fell Thursday, as investors digested a deluge of earnings results and new economic data on the state of the consumer and labor market as the pandemic continues.[Click here to read what’s moving markets heading into Friday, July 17]The ongoing economic impact of the coronavirus pandemic was captured in two key reports Thursday morning. The Labor Department’s weekly jobless claims revealed that another 1.3 million workers filed unemployment claims, in a print that was slightly worse than consensus economists had forecast, and reflected a decelerating pace of improvement in the labor market as coronavirus cases surge in some parts of the country. However, retail sales skyrocketed by 7.5% last month — well above market expectations of 5% and on the heels of a record, upwardly revised 18.2% jump seen in May.\"The retail picture is a reflection of the USA during Covid-19 – all over the place,” said Dr. Kerstin Braun, President of Stenn Group, a global trade finance provider.“The situation varies by household, business, industry sector and state, and will not normalize until the virus is under control,” Braun said. “More than 70% of the country is pausing or reversing reopening plans and credit card data already shows a dip in spending so far in July.”Continuing the run of Wall Street bank earnings, Bank of America (BAC) and Morgan Stanley (MS) reported Q2 earnings, but with different results. BofA saw the pandemic cut its profit in half, while Morgan posted a record quarter on booming fixed-income trading. Separately, the stay-at-home environment was a boost for Dominos Pizza (DPZ), as locked-down consumers sought out comfort food, sending U.S. sales on a tear.At the close of the regular session Wednesday, the S&P 500, Dow and Russell 2000 each rose to their highest levels in five weeks, as optimism over a potential vaccine came alongside stronger than expected earnings results from Goldman Sachs (GS). Anthony Fauci, Director of the National Institute for Allergy and Infectious Diseases, told Reuters he was optimistic that the US would have an effective vaccine by the end of the year.Story continuesNevertheless, companies and individuals across the country continue to contend with the pandemic in the meantime. Walmart (WMT), Kroger (KR) and Kohl’s (KSS) on Wednesday became some of the latest companies to require that customers wear masks while shopping, and the National Retail Federation called on all retailers to adopt nationwide policies of mask-wearing.The new requirements came as the US continued to grapple with an ongoing rise in coronavirus cases, still especially in the South and West. California on Wednesday recorded its second-highest one-day rise at 11,126 new cases, while hospitalizations were at a record 6,786. Cases in Florida and Arizona rose at slower paces than each states’ respective average over the last seven days.—4:02 p.m. ET: Dow ends 4-day win streak after worse than expected jobless claimsHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): -11.59 (-0.36%) to 3,214.97Dow (^DJI): -138.90 (-0.52%) to 26,731.20Nasdaq (^IXIC): -84.76 (-0.80%) to 10,465.73Crude (CL=F): -$0.48 (-1.17%) to $40.72 a barrelGold (GC=F): -$17.50 (-0.96%) to $1,796.30 per ounce10-year Treasury (^TNX): -1.8 bps to yield 0.6120%—2:40 p.m. ET: Crude oil prices settle lower by 1% first first decline in three sessionsUS West Texas intermediate crude oil prices fell on Thursday, tracking broad declines across risk assets following several consecutive sessions of gains. Crude oil prices had settled higher in each of the past two sessions.Futures for August delivery were down 1.09%, or 45 cents, to $40.75 per barrel as of Thursday’s settlement.—11:53 a.m. ET: Stocks hold lower, Dow sheds 100+ pointsThe three major indices held lower as Thursday’s session rolled on, giving back some gains after closing at a five-week high Wednesday.The information technology, real estate and consumer discretionary sectors lagged in the S&P 500, with each falling more than 1% around noon. Boeing and Microsoft each dropped in the Dow, as both travel and leisure stocks and big tech shares declined.—9:43 a.m. ET: Johnson & Johnson opens roughly flat after profit slides 35%, but company raises FY outlookJohnson and Johnson (JNJ) joined a host of other companies in reporting a sales and profit drop over last year, with the pandemic taking a bite especially out of the company’s medical devices business.Second-quarter adjusted earnings were $1.67 a share, down from $2.58 last year. Sales of $18.34 billion fell 11%.Johnson & Johnson’s worldwide pharmaceutical operational sales rose 3.9% during the quarter, driven by strength for Stelara, Darzalex and Imbruvica. However, medical device sales fell 39% to $4.2 billion, as elective surgery cancelations due to Covid-19 hit results in this unit.For the full year, Johnson & Johnson said it now expects adjusted earnings in a range of $7.75 to $7.95 per share on revenue of between $81 billion and $82.5 billion, marking an improvement from previous guidance.—9:34 a.m. ET: Stocks fall, Dow paces toward first down day in 5 sessionsHere were the main moves in markets, as of 9:34 a.m. ET:S&P 500 (^GSPC): -22.58 points (-0.82%) to 3,200.02Dow (^DJI): -179.87 points (-0.67%) to 26,690.23Nasdaq (^IXIC): -132.46 points (-1.26%) to 10,420.80Crude (CL=F): -$0.52 (-1.26%) to $40.68 a barrelGold (GC=F): -$7.50 (-0.41%) to $1,806.30 per ounce10-year Treasury (^TNX): -2 bps to yield 0.61%—9:00 a.m. ET: June retail data suggest recovery still has legsCapital Economics’ Paul Ashworth believes the 7.5% spike in June retail sales is a hint that the wave of new coronavirus infections in the Sun Belt haven’t impacted the consumer (yet):Admittedly, the high frequency data suggest that the recovery lost a lot of momentum in early July – with initial jobless claims basically unchanged at 1,300,000 in the week ending 11th July – but that’s not a disaster because the rebound in sales in June was big enough to eliminate all of the remaining shortfall relative to the pre-pandemic level....That bigger gain in sales in June means that the decline in second-quarter GDP might be a bit smaller than the 30% annualised we currently have pencilled in. Mechanically, it should also mean that the third-quarter rebound could be bigger than the 22.5% we are currently forecasting. But with the new wave of infections leading to renewed closures and restriction in some states, we still think the balance of risks to that third-quarter forecast lie to the downside.—8:30 a.m. ET: Jobless ranks grow, but people keep spendingNew jobless claims dipped by a smaller than expected margin in the Labor Department’s new report Thursday, as a surge in US virus cases threatens the pace of the labor market’s recovery. At 1.3 million, the level of new claims dropped for a fifteenth straight week, with a steady recovery from the late March peak of 6.867 million new claims still under way. Over the past four months, some 50 million Americans have filed new unemployment claims.Separately, consumers kept spending as retail sales surged 7.5% last month, well above Wall Street’s estimates. Stock futures were pinned in the red as investors took a breather from a winning streak that saw major benchmarks close at their highest in over a month on Wednesday.—7:22 a.m. ET: Bank of America says spending on credit and debit cards slumped 36% at ‘lowest point during 2Q’ amid pandemicConsumer banking giant Bank of America said in earnings results Thursday morning that consumer and business total payments fell by 36% at their lowest point during the second-quarter, reflecting individuals’ deteriorating propensity to spend amid the global pandemic. However, payments “improved and were down less than 10% by the end of the quarter,” the bank added.Unlike peer banking giants including JPMorgan and Goldman Sachs, Bank of America put aside a smaller than expected amount in credit reserves during the second quarter. Provisions for credit losses increased to $5.1 billion, whereas consensus analysts expected $5.5 billion.The bank’s second-quarter results were hit by the low-rate environment, however, with net interest income dropping 11% to $10.85 billion for the lowest level in about four years. Bank of America’s revenue net of interest expense was down 3.3% over last year to $22.33 billion.—7:20 a.m. ET: Stock futures point to a lower openHere were the main moves in markets as of 7:20 a.m. ET:S&P 500 (^GSPC): -21 points (+0.65%) to 3,198.5Dow (^DJI): -154 points (-0.58%) to 26,611.00Nasdaq (^IXIC): -148 points (-1.39%) to 10,535.25Crude (CL=F): -$0.45 (-1.09%) to $40.75 a barrelGold (GC=F): -$6.70 (-0.37%) to $1,807.10 per ounce10-year Treasury (^TNX): -0.8 bps to yield 0.622%—6:07 p.m. ET Wednesday: Stock futures open higher after highest close in five weeksHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:07 p.m. ET:S&P 500 futures (ES=F): 3,226.00, up 6.5 points or 0.2%Dow futures (YM=F): 26,840.00, up 75 points, or 0.28%Nasdaq futures (NQ=F): 10,693.5, up 10.25 points, or 0.1%NEW YORK, NY - MARCH 12: A woman wearing a protective mask walks past the New York Stock Exchange on March 12, 2020. in New York City. The Dow Jones industrial average fell 2,352.60 points, a decrease of almost 10% and the largest since 1987. (Photo by Pablo Monsalve/VIEWpress/Corbis via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}