{"article": [{"url": "https://finance.yahoo.com/news/americans-in-both-parties-increasingly-think-the-social-safety-net-needs-to-be-expanded-191508762.html", "published": 1591799000.0, "headline": "Americans in both parties increasingly think the social safety net needs to be expanded", "body": "Since the coronavirus crisis – and accompanying recession – began three months ago. Congress has responded by ushering in a range of changes to the social safety net on things from unemployment insurance to paid family leave.The catch is that nearly all of these changes come with an expiration date. A new survey finds widespread support for making at least some of them permanent.Only 24% of likely voters wanted “the government to return to the role it had before the crisis occurred.”“Far too many hard-working Americans were already living paycheck to paycheck before the pandemic, which has exposed the fragility of America’s social safety net,” said Dr. Rajiv J. Shah, president of The Rockefeller Foundation, which oversaw the survey along with The Bipartisan Policy Center.The survey also laid out just how disproportionate the effect of the crisis has been on communities of color. “It's a pretty troubling story,” said Jason Grumet, president of the Bipartisan Policy Center, in an interview with Yahoo Finance.Grumet said the data “suggests that not only did these minority households enter the crisis in weaker shape, they're leaving in worse shape than they began.”The survey found that 59% of Hispanic and 54% of black voter households are now suffering from unemployment, reduced hours, or pay cuts as a result of the crisis. On average, black and Hispanic households entered the crisis with less saved away and have experienced a greater loss in income during the crisis.1,200 likely voters was were asked a range of questions in early May, before the killing of George Floyd led to nationwide protests in recent weeks. The margin of error was +/- 2.83%.Support for a range of proposalsThe survey floated a range of ideas and found support among big majorities of the respondents across the political spectrum.Permanent unemployment benefit reform – to modernize the program and make it cover more workers – was supported by 89% of respondents. Perhaps not coincidentally, the survey also found that 30% of respondents have had at least one adult in their household apply for unemployment benefits. (Around 48% of households said they had experienced a loss of employment income since March 13, according to an analysis by Deutsche Bank Chief Economist Torsten Sløk.)Story continuesPresident Trump signs the CARES act, a $2 trillion rescue package to provide economic relief amid the coronavirus outbreak on March 27. (JIM WATSON/AFP via Getty Images)The CARES Act, signed into law by President Trump in March, gives states the option of extending unemployment compensation to more workers and also gives a $600 boost to unemployment checks until July 31.On student loans, 83% of respondents supported permanent reforms to how loans work, specifically the idea of setting payments to a certain portion of income to ensure that borrowers can afford the payments. So-called income share agreements have been gaining more supporters around the country. Current provisions allow many student loan holders to stop making payments, but only for a few months.The survey found that 85% of respondents – including 81% of Republicans – supported expanded Paid Family and Medical Leave. Recent legislation expanded Americans’ options for this type of leave, but only until the end of the year.“I think that the trauma of this moment has brought a real realism to the American voter,” says Grumet. “There's actually bipartisan support for a number of practical policies that will bring disparate benefit to these communities.”There was a majority, though a smaller one, in support of more far-reaching policies like universal basic income: 65% of respondents were at least somewhat supportive of making the recent stimulus checks into regular payments.President Trump's name appeared on the economic assistance checks that were sent to citizens across the country. (Chip Somodevilla/Getty Images)Grumet appeared as part of Yahoo Finance’s ongoing partnership with the Funding our Future campaign, a group of organizations advocating for increased retirement security for Americans.The looming question, of course, was whether any of these ideas can make it through Congress. There are plenty of historical examples of Washington seeing a vast majority of voters in support of an idea but responding with inaction.“There's nothing like a global pandemic to kind of shake people out of their trenches a little bit,” says Grumet, noting that Congress can still do big things by pointing to the recent coronavirus response bills.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:COVID-19 crisis highlights housing inequality faced by black AmericansCoronavirus crisis has exposed ‘raw underbelly’ issues in economy: expertCoronavirus could deplete Social Security as early as 'this decade': analysisRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}