{"article": [{"url": "https://finance.yahoo.com/news/so-many-young-adults-living-with-parents-will-have-serious-consequences-for-financial-markets-deutsche-bank-203916555.html", "published": 1600271240.0, "headline": "So many young adults living with parents will have ‘serious consequences’ for financial markets: Deutsche Bank", "body": "Mostly as a result of being priced out of the housing market, the majority of young adults under 30 are living with their parents.While this trend was evident prior to the coronavirus shutdown, the pandemic has exacerbated that trend by packing the one-two punch of making it harder for young college graduates to land a job in a recession while simultaneously triggering layoffs that disproportionately impact them.According to a new report by Deutsche Bank, a worsening generational wealth divide risks ushering in a new “Age of Disorder.”“The widening generational divide should be a key source of alarm for investors, financial markets and society as a whole,” wrote Deutsche Bank analyst Henry Allen, adding that there could be “serious consequences for asset markets” if the gap between older and younger Americans’ wealth isn’t addressed.“Young people perceive themselves as the losers on issues ranging from housing to climate change to student debt. In turn, this anger is manifesting itself into political outcomes, with elections around the world increasingly fought along generational lines.”Getty ImagesThe past decade has been brutal for young adults. The 2008 financial crisis led to a nearly 20% unemployment rate for Americans aged 16-24. While their employment prospects gradually improved, the coronavirus pandemic has wiped away such progress.“The pandemic sent youth unemployment to its highest levels in over 70 years of recorded data,” Allen wrote. Indeed, the unemployment rate for young Americans was 26.9% in April at the height of the government coronavirus shutdown related layoffs, compared to 14.7% for the general population. While the youth unemployment rate has since dropped to 18.5% in July, it continues to surpass the 10.2% rate for the overall workforce during that same time period.Credit: Deutsche BankMaking matters worse, historical evidence has shown that the effects of recessions are long lasting for young adults as their wages “suffer for years afterwards” and they become far less picky when it comes to accepting job offers,” wrote Allen. They’re “more likely to accept a lower-paying role than they might have done in a stronger labor market,” according to Deutsche Bank.Story continuesHousing market divideThe wealth divide among younger and older Americans is most pronounced in the housing market. The report explains that the incentives favoring homeowners (mostly older Americans) are often diametrically opposed to the ones that would benefit first-time buyers (often younger people). According to Deutsche Bank, politicians tend to pursue policies that favor higher home values because they think it will lead to increased consumer confidence and will spur spending.Opposition to new housing developments by homeowners can also have the effect of preventing the types of new home construction young people might actually be able to afford, according to the report.“Ageing populations are tilting the balance further against the young. Expensive house prices are continuing to create anger and resentment. And the Covid-19 pandemic – which has disproportionately hurt the young economically – risks inflaming this resentment further,” Allen wrote.The majority of young adults are left to deal with the social ramifications of being priced out of the housing market, which includes living with their parents and delaying marriage and kids.‘Age of Disorder’Deutsche Bank warns of dire consequences for investors and financial markets if this trend continues.“Investors can expect an abrupt, and significant upheaval in housing and asset markets, tax systems, climate policy, and many other areas,” Allen wrote. “This scenario becomes more likely towards the end of this decade as Millennial and younger voters start to exceed those in older generations.” (This year millennials have surpassed baby boomers as the country’s largest adult population.)Deutsche Bank points to the rise of Sen. Bernie Sanders (I-VT) as indicative of a political trend that could upend the status quo in financial markets.“Bernie Sanders, a self-described democratic socialist, was propelled in part by enthusiasm among younger voters towards his left-wing policies, and in both 2016 and 2020 was the runner-up for the Democratic presidential nomination,” wrote Allen.Sanders, for instance, has pushed for the cancelling of all student loan debt and a 60% tax on what he called “obscene wealth gains” during the pandemic.I will be introducing legislation tomorrow to tax the obscene wealth gains billionaires have made during the public health crisis.— Bernie Sanders (@BernieSanders) August 5, 2020Sanders’ quest to impose higher taxes on the wealthy has sparked criticism by billionaires that such a policy would be punishing success.Deutsche Bank recommends policymakers seek to “level the playing field” between young adults and their older counterparts to avoid “serious consequences for asset markets,” by, for instance, instituting policies that would impose higher taxes on unearned income or wealth.Democratic presidential nominee Joe Biden has promised to repeal President Trump’s signature Tax Cuts and Jobs Act in favor of a plan that would increase taxes on Americans earning over $400,000 a year.More from Sibile:How California wildfires are uniting frenemies Trump and NewsomTrump cuts funding for ‘white privilege’ training as more Republican voters acknowledge systemic racismWe’ll ‘have a way’ to ban fracking in Biden administration: Sierra ClubJob cuts come for white-collar workers: ‘There are no truly recession-proof’ occupationsThe Trump payroll tax break you won’t see on your paycheckFind live stock market quotes and the latest business and finance news"}]}