{"article": [{"url": "https://finance.yahoo.com/news/yahoo-finance-harris-poll-june-work-spending-investing-habits-130047140.html", "published": 1593418100.0, "headline": "Hardly any at-home workers have returned to their normal workplace", "body": "Americans have made sweeping changes to their work, spending and investing habits, according to the first installment of the new Yahoo Finance-Harris poll. Yahoo Finance has teamed with Harris to produce monthly insights on consumer and workplace trends as the nation struggles to recover from the coronavirus pandemic and the punishing recession it has caused.In the Yahoo Finance – Harris poll, conducted from June 15 to 17, 54% of respondents say they’re currently working from home because of the coronavirus—with 40% working from home full-time and 13% doing so part-time. Just 32% say they’re working at their normal workplace, with no change in routine. And only 4% of those who began working from home because of the virus have returned to their normal work sites, revealing the deep disruptions that remain in America’s work life as coronavirus infections surge to new record highs. (Full results are here.)Higher-paid and higher-educated workers are more likely to work from home, most likely because they’re concentrated in white collar jobs that don’t require a physical presence or direct contact with customers. Sixty percent of college graduates say they’re working at home full-time because of the virus, compared with just 26% of workers with a high school degree or less. Among workers who earn $100,000 or more, 52% are working from home, compared with 26% of those earning $50,000 or less.Graphic by David FosterA thin majority of at home workers prefer the change, with 51% saying it’s better than going to their workplace. Thirty percent say it’s worse, with 19% saying it’s about the same.Ten percent of poll respondents say they’ve lost their job because of the coronavirus, with 3% saying it’s a permanent job loss and 7% saying it’s temporary. Sixteen percent say they’re working fewer hours, with 6% saying they’re working more hours. One concern about the depth and duration of the recession is that some temporary job losses could become permanent. Congress has dispersed trillions of dollars in aid to workers and businesses, with incentives to keep people on the payroll even if they aren’t doing their normal jobs. But some businesses are still likely to fail as the virus threat moves around the country and consumers stay home.Story continuesIncomes and spending are downIn the Yahoo Finance-Harris poll, 62% of respondents say their household income has fallen on account of the coronavirus, with 13% saying it has fallen a great deal. Income losses are similar across wealth and education groups, with 64% of more-educated and 62% of less-educated respondents saying they’ve lost income. Among income groups, the percentage losing income was the same for the highest- and lowest-earning groups, at 64%.Graphic by David FosterMost Americans, not surprisingly have cut back on spending, with 82% saying they’re spending less because of the pandemic, and 20% saying they’ve cut back a great deal. A larger portion of high earners—85%--have cut back on spending, with 79% of the lowest-earning group spending less. That dovetails with new research showing the wealthy have cut their spending more than lower-earners, which is a major contributor to the spike in unemployment.Americans see a return to normal in a year or so. Sixty-six percent of respondents expect their spending to fully recover within 12 months, while 17% think it will take more than one year—and 5% say their spending will never return to pre-virus levels. Higher-income Americans see a quicker return to normal, with 74% seeing a full spending recovery in less than a year, compared with 59% for the lowest earners. Future analysis from the Yahoo Finance-Harris poll will reveal whether it’s happening.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Why you’re not hearing about Biden’s economic planTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}