{"article": [{"url": "https://finance.yahoo.com/news/neither-microsoft-nor-oracle-gets-070256361.html", "published": 1600049420.0, "headline": "Neither Microsoft nor Oracle gets to buy TikTok US: Chinese state media", "body": "What a whirlwind of a Monday morning. Shortly after news broke that Microsoft is out of the picture in bidding for TikTok's U.S. operations, and rumors began circulating that Oracle is the winner, China's state broadcaster CGTN reported that ByteDance will not sell TikTok's U.S. operations to Microsoft or Oracle, citing sources.ByteDance, the world's most valuable startup credited with pioneering algorithmic content recommendation for short videos -- a significant key to how TikTok works so well -- won't give its source code to any U.S. buyers, sources told CGTN. A source told the South China Morning Post earlier that the tech upstart has decided not to sell or transfer the source code behind its popular video app.ByteDance said it won’t comment on market rumors.The clock is ticking on TikTok's fate. Beijing was ostensibly absent from ByteDance's negotiations with Washington in the early days, but that seems to have changed as the deal's deadline inches closer, with the U.S. government threatening to shut down the service in 45 days from August 6 (September 20) if ByteDance didn't find a local buyer for the company.First, the Chinese government revised its export rules that could block the transfer or sale of ByteDance's recommendation algorithms, and now there's the state report refuting rumors that Oracle has secured the deal.The acquisition of TikTok's U.S. assets has been rumoured to be for as much as $50 billion, according to reports.ByteDance's rise to prominence is closely linked to its use of algorithms to serve up videos, memes, news articles and other forms of content across its family of apps. Machine learning does away with the need for human curation and even social and interest graphs, forming virtuous cycles within ByteDance services -- the more content one consumes, the better the apps get at predicting one's interest. The data-driven process transcends cultural differences, arguably why TikTok became the first consumer app from China to conquer the West."}]}