{"article": [{"url": "https://finance.yahoo.com/news/biden-vp-pick-michigan-gov-whitmer-has-good-relationship-with-biden-ready-to-lead-says-lt-governor-154157889.html", "published": 1596538160.0, "headline": "Michigan Gov. Whitmer, potential VP pick, has 'good relationship' with Biden, says Lt. Gov.", "body": "Speculation surrounding Joe Biden’s potential running mate pick has reached a fever pitch. His search for a qualified female candidate has entered its final stretch and gossipy intrigue and, not surprisingly, character assassination attempts have proliferated.Potential frontrunners are being criticized for being “too ambitious” in the case of Sen. Kamala Harris (D-CA), for having “a lot of potential baggage” in reference to former UN ambassador Susan Rice, being “dangerous” a label given to former presidential candidate Elizabeth Warren, and “hypocritical” in the case of Michigan Gov. Gretchen Whitmer.As for Whitmer, Michigan Lt. Governor Garlin Gilchrist says Americans need to look no further than her record on handling the coronavirus pandemic for insight into what she could bring to the Democratic ticket.“I think people around this country have seen during this Covid-19 pandemic that she is someone who is thoughtful and conscientious as well as someone who is decisive, who will take in information, who will take in perspectives, and then make choices that are in the best interest of the people who she serves, to protect and promote their public health and public safety and put them on a path to being successful,” Gilchrist told Yahoo Finance.Gov. Whitmer on Friday, July 10, 2020, toughened a requirement to wear masks during the coronavirus pandemic, mandating that businesses open to the public deny service or entry to customers who refuse to wear one. (Michigan Office of the Governor via AP, Pool)Whitmer gained national recognition in large part when she went toe-to-toe with President Trump in a war of words in March as the whole country entered the coronavirus shutdown.In need of more medical supplies for Michigan, Whitmer tweeted at Trump in March, “No more political attacks, just PPEs, ventilators, N95 masks, test kits. You said you stand with Michigan – prove it.\"Trump, careful to separate his criticism of Whitmer from his need to please Michigan swing state voters, sent the following tweet the next day, “I love Michigan, one of the reasons we are doing such a GREAT job for them during this horrible Pandemic. Yet your Governor, Gretchen \"Half\" Whitmer is way in over her head, she doesn't have a clue. Likes blaming everyone for her own ineptitude! #MAGA\".Story continuesWhitmer has also faced opposition from Michigan residents. Business groups and thousands of residents – some armed – protested her extension of stay-at-home orders in April as she sought to contain the spread of the coronavirus. Michigan state police even shut down the state Capitol as protestors gathered there. President Trump sided with the protestors, tweeting “LIBERATE MICHIGAN!”Whitmer’s cautious strategy has helped the state contain the spread of the virus. While coronavirus cases are currently rising in several states, infections in Michigan have plateaued. The state had 5,174 new cases over the past 7 days.‘I know they have a good relationship’Biden is under pressure to select a Black woman as his vice-presidential running mate. But his campaign has signaled that other candidates also have a shot at being on the ticket.Sen. Kamala Harris, D-Calif., speaks at a campaign rally for Democratic presidential candidate former Vice President Joe Biden at Renaissance High School in Detroit, Monday, March 9, 2020. (AP Photo/Paul Sancya)“I think that decision is very deep, very personal and will be [Biden’s] and his alone,” said Gilchrist, adding, “I know [Biden and Whitmer] have a good relationship.”Gilchrist defended Whitmer’s record for supporting the Black community. He highlighted the taskforce she created in April by executive order to examine the racial disparities in coronavirus infections and deaths in the state.“[Whitmer] has experience in developing policies that deliver for people from all backgrounds, he said. “She helped to create the space for me to do the work on racial disparities here in the taskforce.”More from Sibile:Biden’s plan to fight criminal justice injusticeMedia mogul Byron Allen: ‘I think President Trump is totally wrong’Ben Carson on second coronavirus economic shutdown: ‘You do that again, and you completely destroy the financial infrastructure’Ben Carson: All Obama HUD rule does is provide ‘permanent employment for lawyers’Why Black patients receive worse care at the hospitalFind live stock market quotes and the latest business and finance news"}]}