{"article": [{"url": "https://finance.yahoo.com/news/save-on-cable-tech-support-122423322.html", "published": 1600587140.0, "headline": "Paying too much for your cable bill? Here's how to save.", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's Tech Support tip:How to save on your monthly cable bill:If you’re a cable TV subscriber, you’re probably looking for ways to lower your bill. After all, at least three different firms including Comcast (CMCSA), Charter (CHTR), and Optimum (ATUS) have increased their prices this year.Yahoo Finance tech editor Dan Howley doesn't spend more than he has to on cable. Image: Dan HowleyThankfully, you can find a number of ways to reduce your monthly bill, whether that’s by paring back the number of cable boxes you have, or giving up channels that, let’s face it, you don’t even watch to begin with.Ditch the DVRBeing able to record and then watch your favorite TV shows on your time was novel when DVRs first hit the scene. But now there are services like Netflix (NFLX), and Hulu (DIS), and Prime Video (AMZN), and, well you get the picture.DVRs in the age of streaming are unnecessary. And if you’re dropping the extra cash on a DVR, I’m going to assume you’ve also got at least one streaming subscription.With DVRs priced at anywhere from $9.99 to $29.99 per month depending on your cable provider, you’re bleeding your pockets dry for something that’s more or less obsolete at this point. If you’re really trying to save, kick that DVR to the curb.Get rid of all of those extra channelsThe ability to choose from 200 channels sounds great in theory, but you’re probably not taking advantage of all of those options. You likely got roped into your over-the-top plan in the first place because it was the only way to watch that one channel you really like: the adult contemporary music channel.If you’re trying to save, there’s no reason to spend all of that extra money each month on a single channel. But before you ditch your favorite channel, start by asking your provider to lop off any premium channels from your subscription. That should help reduce your monthly bill. And if it’s not enough, slim down your channel package to something more reasonable, even if it means no adult contemporary music channel.Story continuesSend back those extra cable boxesSo you’ve got TVs in the living room, bedroom, and your kids’ rooms, and they’ve all got cable boxes attached. That, dear reader, is a huge waste of money. Each of those cable boxes is a drain on your wallet when each box costs as much as $10 a month.Ditching even one of those boxes will save you roughly $120 a year in fees. And it only goes up from there. Sure, you’re not going to be able to access every single channel from every TV in your home, but the savings are worth it. You’ll likely still need at least one box in your home to ensure you can access certain channels — but I’ll take $10 a month for a single box versus $40 a month for four boxes any day.Try negotiatingMost people know the old trick to lower your cable bill: Threaten to cancel. That tactic used to work, but increasingly, cable companies are letting customers walk away when they threaten to cancel their subscriptions.But that doesn’t mean you shouldn’t at least try to negotiate a better rate. That’s especially true if you’re paying a good deal for your service. Customers on entry-level plans are more likely to be told there’s no wiggle room for them, while those on pricey plans may be able to knock off a few bucks if they make the ask.Just stream itBetween Netflix, Amazon Prime Video, Hulu, and Disney+, there’s more than enough streaming content to keep you occupied until the heat death of the Sun. Really, the only reason to have a cable TV subscription is for live sports, and even those are available through subscription services.If live TV is a necessity, you can always subscribe to over-the-top cable options like YouTube TV or Sling. And if you just want to watch your local broadcast stations, your best bet is to simply purchase an over-the-air antenna.Follow these steps, and you’re all but certain to save on your next bill. And isn’t that all anyone wants?Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple debuts $399 Apple Watch Series 6 and $279 Apple Watch SEOracle’s TikTok win gives it a chance to prove it can take on Amazon and MicrosoftHow to watch the Apple event on Sept. 15, and what to expectNetflix co-CEO on its advantage over Apple and Amazon: We have a ‘single focus’Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}