{"article": [{"url": "https://finance.yahoo.com/news/how-the-biggest-stocks-from-2000-performed-in-subsequent-years-203306692.html", "published": 1600270880.0, "headline": "How the biggest stocks from 2000 performed in subsequent years", "body": "“Where are they now” is always a fascinating game to play, and it works just as well with stocks as it does for your graduating class.Right now, the class presidents are tech stocks. FAAMG – Facebook (FB), Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), and Alphabet (GOOG, GOOGL) – are dominating the major indices and now represent around 23% of the S&P 500 (^GSPC).Since the start of 2016, Goldman Sachs pointed out in a recent note, FAAMG has returned 244%. The rest of the S&P 500 (495 stocks) returned 41%.Goldman acknowledges that the past is useful for reminding us that the top dogs of the past may not necessarily be the top dogs of the future.The last time five stocks exerted such a force on an index was in 2000, at the height of the tech bubble. The top five stocks were Microsoft, Cisco (CSCO), Exxon Mobil (XOM), GE (GE), and Intel (INTC); they represented 18% of the index.Chairman of Microsoft Corporation Bill Gates gestures during news conference in New Delhi September 14, 2000. (Getty)Five years later, Goldman pointed out, they represented just 12% of the index’s market capitalization. And 20 years later, they represent 8%.“As firms become larger, rapid growth is challenging and threats to market positioning are plentiful,” Goldman’s analysts wrote.For tech companies, the biggest threat might be the government’s antitrust probes, which could allow for some new competitors to step in — something that hasn’t really happened much thus far. Of those five current leaders, only Microsoft isn’t facing a federal antitrust investigation (the company faced one in 2001). Most of those top five companies, Goldman notes, didn’t hit their expected sales growth rates or earnings numbers, proving that it’s hard to stay on top.Notably, Microsoft has also maintained its position. It was riding high in 2000, and it’s riding high now. But the market turns over quickly and 5% of the S&P 500 turns over each year and new companies emerge, like Facebook, which Goldman notes was not in existence in 2000.The future big dogs of the indexRapid sales growth in any economic environment (secular) is the defining characteristic of these big five FAAMG stocks, Goldman analysts say, as they look into the index to see which companies might become the usurpers to the big five.Story continuesA view of Google headquarters in New York City. Photo by: John Nacion/STAR MAX/IPxThe analysts use what they call the “rule of 10,” which is checking to see if the company has realized 10% or more in sales growth for each of the past two years, and whether there’s a consensus estimate that it’ll do 10% or more for the next two.“Rule of Ten stocks have generally been more likely to increase than decrease their ranks in the S&P 500 by 10 or more places,” the Goldman analysts wrote.The S&P 500 has 21 stocks that meet that criteria, outside of FAAMG, including Netflix (NFLX), Twitter (TWTR) in the communications services sector, Monster Beverage (MNST); one energy company, Diamondback Energy (FANG); Intuitive Surgical (ISRG) and a few other health stocks; and 10 tech companies, including Salesforce (CRM), Paypal (PYPL), Adobe (ADBE), and Mastercard (MA).While these stocks make the cut for potential index-leaders by Goldman’s test, their estimated sales growth numbers are 18%, which is behind FAAMG’s 22%.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Demand for ‘certified used’ bikes is so strong, some sell above new sticker price2 tax safe harbors that new traders need to know aboutWhy the 2020 rally doesn’t feel like a bubble: hedge fund veteranNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}