{"article": [{"url": "https://finance.yahoo.com/news/nouriel-roubini-on-economic-recovery-post-covid-19-120306765.html", "published": 1593501080.0, "headline": "Economist Roubini expects 'anemic' US recovery -- and a 'Greater Depression' looms", "body": "Nouriel Roubini expects the near-term economic recovery from the coronavirus crisis to be relatively weak, the famed economist told Yahoo Finance in an interview, potentially giving way to an even deeper downturn further down the road.Until very recently, investors have been aggressively ramping up expectations of a ‘V-shaped’ rebound — until COVID-19 infections began surging nationwide.However, the the chairman and CEO of Roubini Macro Associates and NYU Stern economics professor explained to Yahoo Finance that a recovery is likely to be more elongated and sluggish — more like a ‘U-shaped’ recovery.\"Both firms and households are going to be spending less and saving more. That implies a very anemic U-shape recovery,\" Roubini told “The Ticker\" in a broad discussion on Monday.And Roubini — whose bearish predictions have earned him the nickname of \"Dr. Doom” — expects a tepid recovery to eventually morph into a depression even more severe than the 1930s.While the recovery will start to look like a ‘V’ at the start, it will \"soon go into a U,\" the economist added. There's also a risk of a ‘W’, with growth sinking into a double-dip recession if COVID-19 infection rates continue to spike, prompting more lockdowns and pushing the economy into a new contraction.Roubini's bearish prediction for a U-shaped recovery goes back to the considerable number of the debt-laden, highly leveraged firms. While the Federal Reserve’s aggressive monetary policy has helped postpone the day of reckoning, at least of these “zombies” will eventually go broke.For some of these businesses to avoid bankruptcy, they'll have to spend less and save more by capping capital expenditures and slashing jobs.\"If you have to spend less, what is your major cost? It's your labor cost, and they're slashing jobs like we've never seen before. We've lost more jobs in three months than in the last ten years,\" Roubini added.When companies rehire, rather than bringing back full-time jobs with full wages and benefits, they'll opt for more part-time, contractor, and gig workers, according to Roubini.Story continuesISTANBUL, TURKEY - NOVEMBER 26: Nouriel Roubini, professor of economics at New York University speaks during an exclusive interview on Turkey's economy and global markets within the 28th Quality Congress in Istanbul, Turkey on November 26, 2019. (Photo by Emrah Yorulmaz/Anadolu Agency via Getty Images)\"So, there will be a huge amount of uncertainty on labor income, and my labor cost is somebody else's labor income and consumption. So firms have to increase savings and reduce investment,” he explained.“Households are going to have less income because either you are still jobless or if you have a job, it's going to be more precarious. So, you have to spend less and be more risk-averse,” he added. As a result, households will spend less on big-ticket items, discretionary spending, and buying a new home.A ‘Greater Depression’While the U-shaped recovery is his view in the near-term, Roubini worries about a depression over the medium term, in the form of an ‘L-shaped’ recovery.\"I think the sequence is V to U to W, to eventually by the middle of the decade an L,\" the economist told Yahoo Finance. And it gets worse: Roubini suggested the turmoil stemming from the coronavirus pandemic will lead to a years-long retrenchment that will rival the Great Depression.\"I've always said that my prediction for a ‘Greater Depression’ is not about 2020, but the decade of the 2020s, sometime by the middle of the decade,\" he said.There are \"ten deadly drivers\" behind his Greater Depression thesis — which include high levels of debt, aging societies, cheap currencies and a strategic rivalry between the world’s two largest economies that’s getting worse every day.@jamescrabtree. 10 Deadly D's Drive 2020s Depression: Debt, Demographics, Deflation, Debasement, Digital Disruption, De-globalization, Democracy Backlash, Duopolistic Strategic Rivalry, Digital/Tech Warfare, Deadly Disasters (Pandemics, GCC). See my talk: https://t.co/pNYvwgVFTP https://t.co/pOaoAxB1KR— Nouriel Roubini (@Nouriel) April 30, 2020\"This is not a story for this year or next, but for the middle of the decade,\" the economist added.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobs"}]}