{"article": [{"url": "https://finance.yahoo.com/news/housing-data-charts-own-course-amid-covid-backslides-morning-brief-101320575.html", "published": 1593494480.0, "headline": "Housing data charts its own course amid COVID backslides: Morning Brief", "body": "Tuesday, June 30, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeCan the housing market’s huge rebound overcome new COVID cases?The housing market has bounced back from the initial pandemic shutdown in a huge way.On Monday, data on pending home sales in May showed a record increase in the number of signed contracts for home purchases. Pending home sales rose 44.3% in May, the biggest monthly jump in the series which dates back to 2001. Pending home sales, however, are still down more than 10% from where they stood in February.Ian Shepherdson, chief economist at Pantheon Macroeconomics, said in a note Monday that this data shows the housing markets is “well on the way to full recovery, unlike the rest of the economy.”“This has been a spectacular recovery for contract signings, and goes to show the resiliency of American consumers and their evergreen desire for homeownership,” Lawrence Yun, chief economist for the National Association of Realtors, said in a release on Monday.“This bounce back also speaks to how the housing sector could lead the way for a broader economic recovery.”And indeed, housing may well be leading the economy to better days ahead. Just a few weeks ago, the case for housing serving as a leading indicator of overall economic health appeared solid as case counts held stable or falling in many parts of the country while data like mortgage applications recovered faster than some measures of consumer spending.But the recent surge in confirmed COVID cases in states like Texas, Florida, and California, has cast doubt on the idea that after a spring lockdown the economy would follow a steady path back to where it stood in the winter.As Sam Ro highlighted in Monday’s Morning Brief, early indications suggest the recovery is stalling out in parts of the country where case counts have been on the rise. \"The resurgence of the virus will be accompanied by weaker consumer demand among residents of the Southern and Western regions and may even temper the reactions of consumers in the Northeast,” economist Richard Curtin said last week.Story continuesThe latest housing data is also being reported on a one-month lag. And while all economic data comes on a lag and therefore presents challenges when it comes to drawing inferences about the future, some real-time data has shown a rapid change in consumer behavior following a rise in COVID cases. In other words, any beliefs about which data lead, which data lag, and which data give investors the fullest picture of economic health appear subject to revision.Last week, we noted that OpenTable restaurant data showed a sharp drop in seated diners in key states including Arizona, Texas, and Florida at the beginning of last week. And the team at Oxford Economics noted that their proprietary real-time recovery tracker showed the first weekly decline since April at the beginning of this month.Analysts at Bank of America Global Research also highlighted on Monday that Saturday night wait times at Olive Garden’s around the country have continued to decline, a sign of softening demand for dining out. The firm notes that “backtracking has been more pronounced in Florida, Texas and Arizona.”BofA notes that Olive Garden’s parent company Darden (DRI) is the largest market cap casual dining company in the market and that Olive Garden serves as a good proxy for dine-in demand as a whole.In its report, BofA also said OpenTable’s data is the best real-time indicator of demand for the restaurant business, and writes that “week to week improvement (average for the trailing seven days) in reservation counts for the U.S. has slowed and has flipped negative for TX, AZ and FL.”So while the decision to buy a home or go to a restaurant does not get run through the same decision tree for a household, these trends serve as important indicators of how quickly the economic situation has, can, and will likely change during this pandemic. And act as another reminder that there’s little reason to hold any view with much conviction right now.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy9 a.m. ET: S&P CoreLogic CS 20-City MoM SA, April (est. 0.5%, 0.47% in March). S&P CoreLogic CS 20-City YoY NSA, April (est. 3.8%, 3.92 in March). S&P CoreLogic CS 20-City NSA Index, April (est. 224.1, 222.2 in March). S&P CoreLogic CS US HPI YoY NSA, April (est. 4.5%, 4.35% in March).9:45 a.m. ET: MNI Chicago PMI, June (44.0 expected, 32.3 in May)10 a.m. ET: Conference Board Consumer Confidence, June (90.5 expected, 86.6 in May)EarningsPre-market7:30 a.m. ET: ConAgra (CAG) is expected to report earnings of 66 cents per share on $3.24 billion in revenuePost-market4 p.m. ET: FedEx (FDX) is expected to report adjusted earnings of $1.65 per share on $16.32 billion in revenueREAD MORETop NewsShipping containers are seen at the port of Kwai Tsing Container Terminals in Hong Kong, Friday, May 24, 2019. Kwai Tsing Container Terminals is one of the busiest ports in the world. (AP Photo/Kin Cheung)U.S. halts some Hong Kong trade benefits over China law [Bloomberg]Uber to be in talks to buy Food Delivery App Postmates [Bloomberg]Lululemon to buy work-out video maker Mirror for $500 million [Reuters]A primer on the Fed's corporate bond-buying program [Yahoo Finance]From our new Yahoo Finance-Harris Poll partnershipHardly any at-home workers have returned to their normal workplace41% of retail investors expect negative returns in the next 5 yearsWomen far less bullish about their investment goals than menThis demographic tends to rely on news to make money decisionsYAHOO FINANCE HIGHLIGHTS'America’s student debt crisis is a civil rights crisis,' new research concludesHere's what the most sophisticated investors are doing with their cash during the market rallyTaxpayers who filed paper returns could face ‘extreme delays’ in getting refunds—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}