{"article": [{"url": "https://finance.yahoo.com/news/thats-the-only-way-we-survived-government-stimulus-provided-millions-a-lifeline-now-families-are-on-the-brink-142544221.html", "published": 1602056000.0, "headline": "Coronavirus stimulus: 'That's the only way we actually survived'", "body": "Davina Kelly, 39, knew she was taking a risk when she left her Florida home to see her daughter in Ohio at the start of a pandemic. She never expected it would leave her homeless.The downward spiral began in late March, with a text message from her daughter threatening to commit suicide because of an abusive relationship. That sent Kelly scrambling to find a one-way Greyhound bus ticket from Jacksonville, Florida, to Youngstown, Ohio.Within days of her arrival, non-essential businesses were shut down. Travel was dramatically scaled back, effectively stranding her there. With Kelly’s daughter and her two infant grandkids fearful of returning to an abusive home, the family opted to move into a nearby hotel, where they hoped to ride out the pandemic.Davina Kelly, her two grandchildren, and her daughter.“The stimulus check is what got us through those two months. It’s why we could stay in the hotel, because I received one and my daughter received one. And that's the only way we actually survived,” Kelly said.By July, those reserves had dried up. A local church raised money to buy train tickets for her family to return to Florida.But that only proved to be a temporary fix. By the time she returned to Jacksonville, Kelly’s job at Honeybaked Ham had been eliminated. Health concerns from the pandemic severely limited her options for emergency shelter, while friends politely declined her family’s requests to stay with them at the height of COVID-19 infections. She turned to the only certain choice in front of her — living on the street.“We would just spend all day with our stuff, walking around until we just couldn't do it anymore,” Kelly said. “Then we would just find where it looked to be a safe spot to sleep, mainly for my daughter and the babies. I couldn't sleep knowing that, you know, somebody can just come up [to us].”Housing advocates worry Kelly’s story is becoming an increasingly familiar one, with the government now in its third month without additional fiscal bill. A report published by the National Economic Bureau of Research estimates enhanced unemployment insurance and stimulus checks distributed at the start of the pandemic effectively staved off an additional 13.2 million people from falling into poverty.Story continuesWhile federal and statewide eviction moratoriums have largely kept the most vulnerable families in their homes, advocates worry that has only masked the extent of poverty brought on by the crisis. Those like Kelly, who had little savings at the start of the pandemic, relied on government stimulus to make ends meet. With a challenging job market, and prospects of additional fiscal stimulus before the November election waning in Congress, those most in need are faced with a reality void of that lifeline.“So many of our clients were not working. They were crossing our threshold, virtually during this time, excited to work and they're facing all these additional barriers to work because of COVID,” said Aaryn Manning, executive director of Project Place in Boston, a non-profit group that provides job training and related services to low-income and homeless individuals. “Now transportation is so difficult. Then there's all of these additional health barriers in order for them to be working in, in many of the types of positions that they would be working in.”WASHINGTON, DC - SEPTEMBER 24: Steven T. Mnuchin, Secretary, Department of the Treasury during the Senate's Committee on Banking, Housing, and Urban Affairs hearing examining the quarterly CARES Act report to Congress n September 24, 2020 in Washington, DC. (Photo by Toni L. Sandys-Pool/Getty Images)One paycheck away from tragedyThe eviction moratorium didn’t protect Lakisha Cohen in Galveston, Texas, but government funds did help keep the 43-year-old mother of five in her temporary home — a 2006 Buick Rendezvous.In April, her landlord kicked her family out of their house, claiming he was selling the home.Cohen was out within three weeks, loading her youngest kids, 7- and 9-year-old boys into the “old clunker” to map out her next course of action.“I didn't sleep because my brain was going a million miles a second, trying to figure out, trying to pinpoint the moment everything turned wrong,” Cohen said. “Then I had to figure out okay, how do I get out of this. Because I have my babies now. There's no school, there's no nothing.”For months, she took her young kids with her to work at Long John Silver’s, where they had access to free internet to conduct their remote classes. When her car broke down, Lakisha tapped into her stimulus funds to fix the vehicle and search for a new place to live.She visited more than a dozen apartments, but no landlord wanted to take the risk of moving a family in when concerns about COVID-19 infections were so high. So, Lakisha moved her family into a hotel temporarily, until her stimulus funds dried up.“Pre-pandemic, I was pretty much like everybody else. I had a little bit of money in the bank. I worked. I paid my bills. But I was one paycheck away from being in a tragedy ... If the powers that be had to live a day in the lives of people like me, then their argument wouldn't be so great,” Cohen said, referring to lawmakers pushing back against a larger stimulus package.‘We are real people’With President Trump stamping out any hopes of additional fiscal stimulus until after the November election, the burden to help is increasingly falling on non-profit groups like Family Promise.CEO Claas Ehlers says the needs vary widely, from housing assistance to internet connectivity, particularly for families with school-age children. Affiliated organizations have responded by turning buses into internet hot spots in low-income communities, setting up learning centers for parents who cannot tend to their children, while working to make ends meet.“The parents of children in poverty are actually demonstrably more invested in their children's remote education than affluent parents are, but the resource gap is so profound, it obliterates that extra concern on the part of the parents,” Ehlers said. “Add to the fact that you have single parents who are working long hours. You've got all of those stresses and everything. We have just accelerated that divide between affluence and poverty among children.”Kelly and Cohen credit Family Promise for taking their families off the streets. Since the organization took on their cases this summer, both have found temporary homes. Kelly still lives in a hotel, though her daughter and grandkids are now in a house. Cohen recently moved from a temporary church shelter into a new apartment.With plans to return to school in hopes of finding a more stable job, Cohen is more optimistic about her future than she was in May. But she has a message for lawmakers whom she says are dragging their feet on additional funding for people like her.“It's not not a waste of money because we are real people. My children are real children who don't have [a lot]. And it's not from a lack of me trying, it is not from me being too lazy to want to get up and go to work,” she said. “I've worked every day that I could possibly work during this pandemic.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita‘New Reality for California’ : State Insurance Commissioner urges action to stabilize insurance after wildfires‘You have to be flexible:’ U.S. startups accelerate hiring abroad in push to distribute workforceCEOS caught in geopolitical fight, as TikTok deadline loomsInfosys commits to hiring 12,000 American workers, expanding U.S. footprint25% of colleges likely to go out of business: Chegg CEO"}]}