{"article": [{"url": "https://finance.yahoo.com/news/how-to-waste-1-trillion-200156818.html", "published": 1595257760.0, "headline": "How to waste $1 trillion", "body": "So far, Congress has authorized $3.6 trillion in stimulus money to help offset the punishing cost of the lockdowns and business closures caused by the coronavirus pandemic. The various programs funneling all that money to businesses and consumers are far from perfect, but probably necessary.It’s not enough, however, and Congress is now developing another massive round of stimulus spending that will probably top $1 trillion, and maybe double that. This is where the tragedy starts. Had the Trump administration and other U.S. policymakers gotten the virus response right the first time around, the virus would be under control and jobs would be coming back on their own. Instead, we’ve hit new record highs for daily infections for 41 days in a row—the worst performance of any developed country. The recession is now dragging on longer than it ever should have, and instead of a cautious return to near-normal, we’re becoming dependent on borrowed federal spending to keep the economy afloat.The United States is lucky the Treasury can borrow boundless amounts of money at super-low rates. But this privilege also leads to profligacy and abysmal incompetence at many political levels. If the United States weren’t a rich country, it would have had to contain the virus the first time around, or face ruin. The ability to tap another trillion or two as needed in effect finances a bumbling crisis response that has allowed the coronavirus to ravage the U.S. economy.Only five states are seeing at least a 10% decline in cases. (Graphic: David Foster/Yahoo Finance)The Trump administration should have instituted tough nationwide policies to contain the virus—including mandatory mask wearing where infection rates cross a certain threshold—when Congress passed the first big stimulus bill, in late March. Trump should also have established the world’s most aggressive coronavirus testing program the very moment testing shortages became apparent, at the beginning of the crisis, instead of ducking responsibility and telling the states to handle it. And governors and mayors should have complied, instead of making their own patchwork policies that totally failed to account for people crossing borders and bringing the virus with them.Story continuesTrump and his critics argue that it’s easy to look back and argue for actions that nobody knew would be needed at the time. There’s some truth to that. But it’s also true that many smart analysts were calling for actions that would have left the U.S. economy in much better shape by mid-summer had they gone into effect. The best example is the “Road Map to Reopening” plan Scott Gottlieb and several colleagues at the American Enterprise Institute published on March 29. Gottlieb was FDA Commissioner under Trump, and unlike many Trump appointees, he left the administration on good terms, in 2019. So Trump could have embraced Gottlieb’s 4-phase plan for establishing strict procedures for controlling the virus and re-opening gradually and methodically, without losing face. Nah.Some states have essentially followed Gottlieb’s prescription, with predictably good results. New York was the epicenter of the outbreak in March and April, with the nation’s highest infection and death rates, by far. The governor imposed strict lockdown rules and a reopening schedule directly linked to falling infection and hospitalization rates. Masks became mandatory in most public places, with very little foolish opposition or complaining about a “hoax.” It worked. Infection rates in New York are now low, even as stores, restaurants and parks reopen.Source: Raymond JamesFlorida chose to follow Trump’s lead, dismiss the severity of the virus and assume Florida would never become New York. The virus is now spiking there, forcing new rounds of closures, as businesses and their patrons argue over the usefulness of masks. Not all states with rising infection rates have been derelict in encouraging the virus to spread, but many have because of weak rules and a rush to reopen.Source: Raymond JamesMoody’s Analytics recently analyzed unemployment claims and other business indicators in states with and without mandatory mask-wearing policies. States with mask mandates had smaller increases in coronavirus infection rates as they reopened, which, in turn, meant consumers went out and spent more. And businesses in mask-mandate states laid off fewer workers as summer began. In unmasked states, by contrast, it’s now more likely unemployment is going up rather than down. “The worsening pandemic coupled with policy whiplash in many parts of the country jeopardizes the labor market’s tenuous progress,” the forecasting firm noted.Congress is now drafting another must-pass stimulus bill because the virus is still rampant, consumers are still afraid to go out, businesses are still shackled and workers are still losing their jobs. The new bill will contain more of what came before—enhanced unemployment aid, loans for failing businesses—and some new goodies, such as aid to states and cities that will have to axe cops, teachers and firefighters without it.Yes, this new bill will probably be necessary, and better than doing nothing. But it would be better still for the country to show some actual determination to beat the virus, instead of continually funding failure. As we approach $5 trillion in stimulus aid this year alone, voters should ask how much additional stimulus we’re likely to need and whether we can afford it. A blank check might eventually solve the problem, but at an astronomical price.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Edgy voters might reject the 2020 election outcomeWhy Joe Biden is wooing unionsElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}