{"article": [{"url": "https://finance.yahoo.com/news/trump-administration-congress-set-more-100000155.html", "published": 1596085700.0, "headline": "Trump administration, Congress set more talks as coronavirus deadline looms", "body": "By Patricia Zengerle and Susan CornwellWASHINGTON, July 30 (Reuters) - Top officials from President Donald Trump's administration planned more talks with congressional Republicans and Democrats on Thursday, despite flagging hopes of reaching an agreement to extend coronavirus aid before a Friday deadline.Treasury Secretary Steven Mnuchin and White House chief of staff Mark Meadows said they would head to the Capitol for negotiations, even though hours of meetings so far have left deep divisions over how best to help the country recover from the COVID-19 pandemic.The Senate's Republican majority leader, Mitch McConnell, said on Wednesday he still thought there could be some form of an agreement this week. \"Many things around here happen at the last minute,\" McConnell told PBS, adding that \"hope springs eternal.\"A $600-per-week supplemental unemployment benefit, a lifeline for tens of millions of Americans left jobless by the health crisis, expires on Friday. A federal moratorium that prevented evictions ended last Friday, leaving untold numbers of Americans at risk of losing their homes.Congress has already passed aid packages totaling $3 trillion to alleviate the effects of the virus, which has killed 150,000 Americans.The Democratic-led House of Representatives passed a plan, worth another $3 trillion, in May. But the Republican-led Senate refused to consider that bill.Instead, Senate Republicans unveiled on Monday their own plan, reached with the Trump administration, with a $1 trillion price tag.After meeting on Wednesday with the top two Democrats in Congress - House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer - Mnuchin and Meadows said there were still deep divisions on a host of issues.Those include whether to pass a temporary extension of the extended unemployment benefit, whether to provide aid to state and local governments and a Republican plan to prevent liability lawsuits. (Reporting by Patricia Zengerle and Susan Cornwell; Editing by Peter Cooney)"}]}