{"article": [{"url": "https://finance.yahoo.com/news/demand-for-certified-used-bikes-is-so-strong-some-sell-above-new-sticker-price-135820928.html", "published": 1600160780.0, "headline": "Demand for ‘certified used’ bikes is so strong, some sell above new sticker price", "body": "Like so many other industries the coronavirus pandemic has transformed, the bike business is undergoing big changes. The pandemic disrupted the bike industry’s supply chains, and at the same time, it pushed demand to never-before-seen heights, as people seek alternatives to public transportation.New bikes have been in extremely short supply – but the used-bike market is on fire. One big player in the used market is The Pro’s Closet, located in Boulder, Colo. It has a slightly different tactic common in the car industry, but rare in the bike world: certified pre-owned bicycles.The company does do local business, but its main presence is online, selling enthusiast (generally $1,000+) bikes nationally — having originally built up its business via eBay. Unlike bike shops that mostly sell new stock, The Pro’s Closet’s business model is tailor-made for the current coronavirus moment, able to take advantage of the demand thanks to its unique and relatively untapped supply chain of garages around the country.“We’re tapping into every garage to buy bikes from people that have a bike in their garage or a bicycle they’re not using,” Nick Martin, the company’s founder and CEO told Yahoo Finance. “We’re in a unique position to own our own supply chain and provide bikes to meet demand.”Bicyclists wear face masks waiting in line in front of a bicycle shop during the coronavirus pandemic on April 25, 2020 in New York City. (Photo by Jamie McCarthy/Getty Images)The demand, even at the end of the summer, is still high. In April, U.S. sales grew 75% compared to last year, $1 billion, to $7 billion. At the same time, imports fell dramatically and are up just 3% through June, according to trade publication Bicycle Retailer, and bike shops have consistently struggled to maintain inventory given supply chain difficulties.This year, The Pro’s Closet’s revenue is up 130%, and the company says it sells through its inventory every 13 days.“We believe if we could process twice as many bikes, we could sell twice as many, too,” said Martin.Thanks to the pandemic and the huge revenue spike, The Pro’s Closet was able to raise another $12 million in funding to a total investment of $27 million. Money, Martin said, has been the reason why no one has done this before. It’s capital-intensive to ship, sell, and check every bike that comes through the floor. And it requires a lot of expertise to make sure every bike is certified as models differ significantly across brands and years.Story continuesThe used bike market has traditionally been very decentralizedTraditionally, used bikes have been sold through classified ads, Craigslist, newsletters, word of mouth, bike shops on consignment (essentially local certified) and other local means that weren’t particularly scalable. During the pandemic, other bicycle retailers have been getting into the used game as well to help offset the loss in new inventory.As an individual buying and selling out of a shop context, things haven't necessarily been trustworthy or easy over the years.Shipping a bike to another city or state is unwieldy and expensive, leaving most bike owners confined to local markets rather than national ones when they want to sell. And for people transacting, questions of legitimacy and safety are often concerns.People line up outside for their turn to get into at Elevation Cycles bike shop May 31, 2020 in Highlands Ranch, Colorado. (Photo by RJ Sangosti/MediaNews Group/The Denver Post via Getty Images)Martin says that the company’s goal is to “legitimize” the second-hand market, figuring that certification gives people peace of mind — and having a convenient and scaled way for people to dump their bikes would expand the company’s inventory.The company also partners with local bike shops to establish trade-in programs, expanding the national pool of bikes it can sell — while working with trusted and repeat partners.Depreciation doesn’t exist anymore — but a change is comingSince the beginning of the pandemic, the average sale price for the inventory at The Pro’s Closet has risen over 30% due to limited availability of bikes across the country and pent-up demand, The Pro’s Closet’s chief revenue officer Travis Erwin told Yahoo Finance.Essentially, the “drought” in new inventory has spiked prices on the much-more price-fluid secondary market.In this Tuesday, June 9, 2020 photo, Harvey Curtis, left, discusses repair plans with customer Jack Matheson outside Sidecountry Sports, a bike shop in Rockland, Maine. Matheson is looking forward to getting his 40-year-old Raleigh back on the road. (AP Photo/Robert F. Bukaty)In fact, Erwin said, “demand is so strong, specific used models are selling above original MSRP.”“People want to get out and ride by any means possible, which is eliminating depreciation and creating a seller's market,” he said.The company recognizes that all of this is probably temporary, though it hopes the bike boom will endure to some degree.“I believe we'll see a swing in the opposite direction in the near future,” said Erwin. “Fair-weather riders will most likely move on to seasonal sports just as Asian-produced inventory will be hitting our ports. Massive market saturation may be on our horizon.”---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Every investor has 'a silent partner' when trading stocks: veteran CIOPoll: 83% of companies ready to embrace new work conditions after coronavirus2 tax safe harbors that new traders need to know aboutWhy the 2020 rally doesn’t feel like a bubble: hedge fund veteranNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}