{"article": [{"url": "https://finance.yahoo.com/news/adp-jobs-report-ism-manufacturing-macys-earnings-what-to-know-in-markets-wednesday-215744346.html", "published": 1593536720.0, "headline": "ADP jobs report, ISM manufacturing, Macy's earnings: What to know in markets Wednesday", "body": "It is gearing up to be a busy Wednesday, and investors will be turning their attention to the ADP June private employment report, the Institute for Supply Management’s (ISM) manufacturing index reading for June and Macy’s (M) quarterly results.The U.S. private sector is expected to have added 2.95 million jobs in June, up from 2.76 million private sector job losses in May.ADP’s private sector employment report comes ahead of Thursday’s BLS report, and it comes amid historic unemployment levels as a result of the COVID-19 pandemic. Though the ADP report is not always a reliable indicator of what the BLS report will illustrate, it could still provide insight into the current state of employment in the U.S.Economists surveyed by Bloomberg anticipate the U.S. economy added 3 million nonfarm payrolls during the month, up from 2.5 million job additions in May. The unemployment rate is expected to have ticked lower to 12.4% in June from 13.3% in the prior month.Meanwhile, the ISM manufacturing index will likely show continued improvement in June, according to Credit Suisse economist James Sweeney. “Shutdown orders have eased, which is leading to a rebound in the most-impacted sectors, but there is likely to be ongoing stress for manufacturers. In reality, most businesses are likely seeing sequential improvement in the past months, but PMI surveys often seem to measure something closer to 3m/3m growth.”“Falling business confidence and deep uncertainty about future COVID-19 contagion can also weigh on survey measures. Other manufacturing surveys have broadly improved so far in June, but the majority continue to show a slight contraction in growth,” Sweeney added.Economists anticipate the ISM manufacturing index jumped to 49.5 in June from 43.1 in May. A reading above 50 signals expansion and a reading below 50 indicates contractionary territory.NEW YORK, NEW YORK - JUNE 23: People wear protective face masks outside Macy's Herald Square as the city moves into Phase 2 of re-opening following restrictions imposed to curb the coronavirus pandemic on June 23, 2020 in New York City. (Photo by Noam Galai/Getty Images)On the corporate earnings front, department store Macy’s will be reporting ahead of the market open. Macy’s is expected to report an adjusted loss per share of $2.53 on $3.69 billion in revenue during its first quarter.Story continuesA few weeks ago, Macy’s provided preliminary first quarter financial results. “The COVID-19 pandemic significantly impacted our first quarter sales and earnings results, but I am proud of the way our team navigated this difficult period and maintained the business while our stores were closed,” CEO Jeff Gennette said in a statement.“Our strong digital business sales trend continued throughout May, and it is encouraging to see that as we reopen a store, the digital business in that geography continues to be strong. By June 1, we had approximately 450 stores reopened, with the majority opened in their full format. Our reopened stores are performing better than anticipated. Importantly, we are receiving positive feedback on the curbside pickup experience and our efforts to create a safe and welcoming shopping environment,” he added.The company also said that it was seeing strong sell-through of its seasonal merchandise and expects to exit the second quarter in a clean inventory position.Department stores had been struggling even before COVID-19 wreaked havoc on the retail industry. Macy’s peers JCPenney (JCP) and Neiman Marcus both filed for bankruptcy in recent months.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:Jobless claims: Another 1.48 million Americans file for unemployment benefitsWhite Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance news"}]}