{"article": [{"url": "https://finance.yahoo.com/news/a-phony-economy-attended-the-republican-convention-132851886.html", "published": 1598603780.0, "headline": "A phony economy attended the Republican convention", "body": "Obama-Biden: TerribleTrump-Pence: RemarkableThis is the version of economic history you heard if you tuned into the Republican convention this week. President Trump and many other speakers assailed the dark ages of the Obama-Biden administration, when nobody had a job and children were starving everywhere. Then Trump became president and everybody got rich. Would voters really want to give Joe Biden, now Trump’s Democratic opponent in the presidential race, another chance to bankrupt everybody?This fanciful narrative is supposed to make voters think there have been major differences between the Obama and the Trump economies. In reality, trends underway during Obama’s second term largely continued during Trump’s first three years. The coronavirus crisis that erupted in March put an abrupt end to that, of course, and voters will decide if Trump should be punished for soaring unemployment. But there was no Trump economic miracle before that.Here’s what Republicans got wrong at their convention:The greatest economy ever. Trump and Pence both made this silly claim. On their side: the lowest unemployment rate since 1969. But GDP growth under Trump has been lower than the historical average, and far lower than during true boom times like the late 1990s, the mid 1980s or the early 1960s. Growth in the Trump era also came with soaring federal deficits—even before the coronavirus—due to tax cuts that reduced federal revenue as the cost of benefit programs rose steadily and predictably. Wealth and income inequality are worsening problems as well, and there’s no plan to cover a shortfall in Medicare spending that may be just a few years away. It was not the greatest economy before the coronavirus, and it’s a deeply troubled economy now.A recession was about to hit when Trump took office. White House economist Larry Kudlow said this outright, and other speakers implied it. But there was no recession on the horizon when Trump took office, as the charts below reveal. GDP grew 3.1% in 2015 and 1.7% in 2016, Obama’s last two years. Then it grew 2.3% in 2017, Trump’s first year, and 3% in 2018, his second year. Average GDP growth averaged 2.3% during Obama’s last four years, and 2.5% during Trump’s first three years. So Trump outperformed Obama by two-tenths of a point—until the coronavirus arrived.Story continuesGraphic by David FosterEmployment data tells the same story. The pace of job growth was remarkably consistent from 2010 through the beginning of 2020. That slowdown in GDP growth in 2016, from 3.1% to 1.7%, doesn’t show up in the job numbers. Since 2009, when Obama took office, the strongest pace of job growth occurred in 2014, averaging 250,000 new jobs per month. The pace slowed gradually from there, dropping slightly below an average of 200,000 new jobs per month in 2016, and staying there. Job growth was higher on average during Obama’s last four years than Trump’s first three, but not because of anything great Obama did or lousy Trump did. Slowing job growth is normal as a recovery matures and the pool of available workers shrinks.Graphic by David FosterManufacturing and spending booms. Kudlow said 5 booms are underway: in stocks, housing, auto sales, manufacturing, and consumer spending. In reality, there are 1.5 booms, not 5. Stocks are at or near record levels. That’s one boom. Home sales are hitting new records, too. But that’s only a boom for sellers who can demand higher prices. Buyers have to pay more, and even with super-low mortgages rates engineered by the Federal Reserve, housing affordability has worsened lately. The other three areas aren’t booming at all—unless you only measure changes since May. There have been sharp increases since then, but those are nowhere near as large the declines in March and April, as the coronavirus exploded. Auto sales, manufacturing employment and consumer spending are all well below levels of February, before the virus. Here’s one example:Graphic by David Foster“I have done more for the African-American community than any president since Abraham Lincoln.” Trump bases this grandiose whopper on the unemployment rate for blacks, which did hit the lowest level on record—before the coronavirus hit. But since then, the black unemployment rate has soared by 8.8 percentage points, to 14.6%. The white unemployment rate has risen by just 6.1 points, to 9.2%. Black and other minorities are also suffering more from the coronavirus than whites. Blacks are 4.7 times more likely to be hospitalized on account of the virus than whites and 2.1 times more likely to die from it.Wages have “gone through the roof” under Trump. Eric Trump said this at the convention, and there’s some truth to it. Average hourly earnings improved from a growth rate of 2.7% in 2016, Obama’s last year, to 3.4% annual growth in 2018. But when Trump’s son says “through the roof,” he may be referring to an anomalous jump in earnings that occurred after the coronavirus hit. Business shutdowns since then have added nearly 11 million Americans to the unemployment rolls, and those job losses are heavily skewed toward lower-income workers. So the pool of people who still have a job now includes a higher portion of higher-income workers than it used to before a lot of lower-income workers hit the streets. That’s like saying earnings have gone through the roof because the roof burned down.“This president stands by Americans with preexisting conditions.” White House press secretary Kayleigh McEnany said this to reassure voters who may have heard Trump is still trying to kill the Affordable Care Act. The ACA, otherwise known as Obamacare, prevented insurers from denying coverage or charging more to people with preexisting conditions. The Trump administration is backing a lawsuit aiming to kill the ACA completely, which means insurers would once again be able to deny coverage. Trump has said that if the lawsuit succeeds in killing the ACA, he’ll push for new legislation protecting the 54 million Americans with preexisting conditions. Trump has never released a plan to do this, however, and he can’t do it by executive order.Trump made America energy independent. The development of hydraulic fracturing during the last 20 years has caused a boom in U.S. oil and gas production, but Trump has had little to do with it. The United States became a net exporter of oil in 2019, but it still relies on imported oil for about 20% of its consumption. That’s because it’s more efficient to import oil and other energy products to areas such as the East Coast than to move it there from other parts of the United States.“Biden has promised to abolish the production of American oil, coal, shale and natural gas.” You’ll hear this a lot from Trump in coming weeks, because such a ban—which Elizabeth Warren and Bernie Sanders favor, but Biden doesn’t—would kill jobs in swing states such as Pennsylvania. What Biden wants to do is move toward green energy and “net-zero carbon emissions” by 2050. That doesn’t mean no carbon energy. It means less carbon and various types of offsets for the carbon that is burned.Biden will raise everybody’s taxes. Biden does have plans to increase a variety of taxes, but he says those tax hikes would only affect people earning $400,000 or more—about 2% of U.S. households. If Biden’s plan were fully enacted—which would require Democrats to control both houses of Congress, and still be a tough sell—the tax hikes could slightly depress middle-class income. But the hit would probably be too small for most people to notice. Except for Trump.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:5 campaign promises Trump has given up onThe Trump campaign’s bogus boom timesWhy Trump wants to shackle the postal service11 ways Trump is out of touch with votersEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}