{"article": [{"url": "https://finance.yahoo.com/news/robinhood-investors-were-a-marketstabilizing-force-during-the-crash-192847543.html", "published": 1601562980.0, "headline": "Robinhood investors were a market-stabilizing force during the crash", "body": "UKRAINE - 2020/05/02: In this photo illustration a Robinhood logo seen displayed on a smartphone. (Photo Illustration by Igor Golovniov/SOPA Images/LightRocket via Getty Images)Robinhood investors get a bad rep for being wild Tesla (TSLA) bulls who trade penny stocks like Hertz, hoping to make a quick buck at the publicly-traded casino.But according to a new paper from the National Bureau of Economic Research that examined the company’s investors between 2018 and 2020, Robinhood investors actually haven't underperformed or been as reckless as some reports have indicated.\"The narrative of pure irrational exuberance is misleading,\" Ivo Welch, the UCLA economics professor behind the working paper, wrote.Welch’s research finds that Robinhood investors are nothing new. They’re part of a similar group of investors that’s existed for quite some time, though not as “Robinhood investors.”Some of Robinhood investors' core behavioral traits were seen in retail investors in the 1990s: they bought stocks that had either gone up a lot or down a lot in the short term, probably taking note of their volatility or through investors seeking “sensation,” Welch writes.Interestingly, Robinhood user behavior pre-2020 crisis didn’t change during the coronavirus market crash in late March. Welch’s research found investors \"did not panic or experience margin calls.”“Instead, there is evidence that as the stock market declined, investors actively added cash to fund purchases of more stocks,” he wrote. This is in line with much of the anecdotal evidence as well as reports from other fund companies like Fidelity and Vanguard that reported their retail investors both stayed the course and bought the dip in March and April, seeing stocks as a long-term opportunity — so the decline in prices meant they were cheap.The Robinhood investment app is seen on a smartphone on June 24, 2020 in Washington,DC. (Photo by JIM WATSON/AFP via Getty Images)Welch found that retail investors on Robinhood, an investing app that offers no-commission trades, reacted immediately after large movements in the market – either the next day or three to four days later, which Welch noted was the same time it usually takes to make a bank transfer, to add money to their accounts to trade. Most of these large market movements were in April and May.Story continues“Thus, the evidence suggests that Robinhood investors collectively acted as a (small) market-stabilizing force,” Welch writes.‘Plenty of opportunity to poke fun at their holdings’That Robinhood investor behavior may look sensible in many ways in retrospect, buying big stocks at a discount. But at the same time, this new cohort of traders snapped up a lot of tiny stocks and made questionable decisions.“There is plenty of opportunity to poke fun at their holdings,” Welch writes, pointing out that these investors preferred certain stocks like Ford (F) over GM (GM) for potentially arbitrary reasons, or kept Facebook (FB) underweight.“They fell in love with some obscure experience stocks, such as cannabis stocks, and some risky technology/gamble stocks,” Welch found. “And they displayed some of the same behavioral-finance biases documented in previous literature, especially with respect to a liking of stocks experiencing extreme stock price increases or decreases.”Traders work during the opening bell at the New York Stock Exchange (NYSE) on March 5, 2020 at Wall Street in New York City. (Photo by JOHANNES EISELE/AFP via Getty Images)Of course, both of those behavioral finance “biases” are enshrined in popular trading strategies like momentum trading (trading “hot” stocks because they’ll keep zooming) and buying stock that’s fallen in value, expecting it to go up based on fundamentals, or in the case of Hertz, speculation.On the whole, however, the study found that Robinhood investors largely chose stocks of companies they were familiar with, not just megacaps or obscure stocks. \"By mid-2020, Robinhood investors had even pivoted towards fallen old-economy stocks,\" Welch writes.The paper found that Robinhood investors were rewarded by their grit and steadfastness in the face of the market crash in March, something that Welch sees as possibly distinct from investors with larger portfolios. For them, the assumption is they are not new to the market and do not trade with the millennial-friendly app.With more money to lose, that group takes a more conservative approach than the Robinhood crowd — though, as Welch points out, the app’s users are not nearly as aggressive as often portrayed.“it is easy to tell a tale that Robinhood retail investors fit the stereotype of the unsophisticated gambler, earning low returns and being taken advantage of by more sophisticated professional traders,” Welch writes. “However, [my findings] show that this narrative seems incorrect.”—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Why savings accounts have fallen — and some more than othersIntergenerational conflict is getting worse, Deutsche Bank warns2 tax safe harbors that new traders need to know aboutNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggests5 rookie mistakes investors make: hedge fund veteran"}]}