{"article": [{"url": "https://finance.yahoo.com/news/these-managers-earning-over-100000-will-lose-their-jobs-next-in-coronavirus-recession-195541040.html", "published": 1599145400.0, "headline": "Job cuts come for white-collar workers: 'There are no truly recession-proof' occupations", "body": "At the start of the coronavirus pandemic, nearly 40% of low-income workers lost their jobs in March or early April, as many restaurants, stores, and tourism hot spots shut down to slow the spread of the virus.Over that same time period, only 13% of workers earning an income above $100,000 were laid off, according to the Federal Reserve.Recent job cut announcements by companies clearly indicate, however, that more white-collar jobs are on the chopping block.Ford (F) told workers in a memo on Wednesday it plans to cut at least 1,400 salaried jobs. The company warned employees that layoffs could ensue if there aren’t enough workers who choose to leave the company by the end of the year.In announcing that approximately 16,000 workers would be furloughed on Oct. 1 if another bailout of the airline industry doesn’t materialize, United Airlines (UAL) listed over a thousand management and administrative jobs that would be included.“When you see layoffs in management and corporate jobs, it’s a pure indicator of the economic impact of the recession, rather than just the lockdown, since many of these jobs can be done from home and they aren’t necessarily impacted by the lockdown orders,” said Glassdoor senior economist Daniel Zhao. “It’s an indicator that there’s a traditional recession happening beneath the surface of this public health crisis.”Ford and United declined to state the exact job titles or salary range of employees whose jobs would be cut.In this June 25, 2020, file photo, rows of United Airlines check-in counters at O'Hare International Airport in Chicago are unoccupied amid the coronavirus pandemic. (AP Photo/Teresa Crawford, File)However, job search websites such as Glassdoor share salary information with job seekers.According to Glassdoor data, white-collar workers can earn over $100,000 at these companies. For instance, project managers at Ford have an average base salary of $112,408 and senior managers at United earn at least $120,390.“When you have a particularly acute crisis like this, an unprecedented one like this one, there are no truly recession-proof industries or occupations,” said Zhao. “In general, higher wage workers tend to be better positioned to weather recessions because their jobs are more stable, they can have more savings built up, and they have more experience and education to draw on, when they’re looking for a new job. But I think this most recent round of layoffs is a reminder that there is no perfect shelter from the storm.”Story continuesAnother 881,000 Americans filed for first-time unemployment insurance benefits last week.Job openings only grew by 2% in August, a decline from the over 6% growth in July, according to Glassdoor.Job postings have dropped off most in occupations directly affected by the coronavirus, like hospitality, tourism and sports, according to jobs site Indeed.com. “But postings are far below last year’s trend in many higher-wage office sectors, too, like software development and banking and finance,” Indeed wrote recently.“The timing [of ongoing layoffs] is demonstrative here. The fact that these layoffs are happening now indicate that companies are revising expectations of how quickly we can return to economic normal,” said Zhao. “ It’s a sign of...some increasing pessimism about the rate of the recovery.”More from Sibile:The Trump payroll tax break you won’t see on your paycheck‘Ghosting’ is not just for lovers. These job applicants say ‘cruel’ and ‘selfish’ employers do it too.Trump’s $300 per week unemployment boost ‘too little, too late’ to help August spending: GoldmanEconomist: Pay people $1K to take a coronavirus vaccine instead of forcing themDemocratic Rep. blasts Trump on USPS woes: ‘No hope’ of waking up knowing who won the electionFind live stock market quotes and the latest business and finance news"}]}