{"article": [{"url": "https://finance.yahoo.com/news/new-york-fed-president-john-williams-yahoo-finance-transcript-july-2020-200055274.html", "published": 1594912100.0, "headline": "New York Fed President John Williams speaks with Yahoo Finance [Transcript]", "body": "John Williams, president of the Federal Reserve Bank of New York, spoke with Yahoo Finance on July 16 to discuss the U.S. economic outlook and what may lie ahead for Fed policy.Below is a transcript of his appearance:BRIAN CHEUNG: Joining us now is the president of the New York Federal Reserve - that is John Williams. John how are you?JOHN WILLIAMS: Great Brian, good to see you.BRIAN CHEUNG: Good to see you too. So let’s just get right into it. I want to ask about the economic outlook, we did get numbers this morning on retail sales showing a pretty nice rebound in June but then on the other hand you have 17 million Americans still turning to unemployment insurance. That, when you couple it with the epidemiological numbers, I guess I’m just wondering do you still see the baseline as a recovery in the second half of this year as I think you said back in May?JOHN WILLIAMS: Yeah, you highlighted a bunch of the cross currents that we’re trying to analyze and understand. Of course, it’s just an enormous amount of uncertainty and the uncertainty really stems directly with the coronavirus and the pandemic. And how that behaves and how effective and successful the efforts to contain it at the same time to bring the economy back up to full speed so right now the way I'm reading is still consistent with how you describe it. I think we, I've been talking about it. I expect the second half to be a continued period of economic recovery, but still we're in a very deep hole. Unemployment is over 11%.We have a long ways to go to get back to full strength. My hope is, though, that we'll continue to see positive signs of a gradual recovery over the second half of this year, into next year. But right now this is a critical inflection point. We're seeing these mixed signals in different states. In the states where the number of new cases has been rising, we're definitely seeing people pull back from going to restaurants and other things. While in states like where I am in New York, around here, we are still seeing steady improvement in terms of people getting back to work and going out to restaurants and things like that so it's a kind of a complicated situation and we're watching all that high frequency data very closely to see what's going on.Story continues[See Also: NY Fed's Williams: 'Not the time to think' about rate hikes] BRIAN CHEUNG: So something that was interesting from the Beige Book that was just released yesterday was that in New York, this was the case in many other districts as well, there were stories of furloughed workers that have now been laid off permanently and I guess I'm wondering what you're seeing specifically in the second district (again covers New York parts of New Jersey, Connecticut, Puerto Rico, the Virgin Islands), what are you seeing there? You mentioned also earlier this morning that you think it's going to be essential for fiscal authorities to “put cash directly in the hands of Americans.” Based off of what you're seeing in the district, what would that look like? Is that an extension of [unemployment insurance] and maybe more [Paycheck Protection Program], for example?JOHN WILLIAMS: Yeah, so what we are seeing and what I'm hearing is definitely that this obviously is a situation where a lot of employers don't have demand for their products and services. Whether you’re restaurants or other businesses. They are having to layoff workers despite their efforts and despite the PPP and other programs that have been there to provide support to businesses and then obviously to the unemployed and to households more generally.So I would take two signals from what we're seeing. Obviously this is gonna be a longer, more drawn out period of getting through the pandemic. I think that businesses are struggling because they don't have revenue. State, local governments are struggling because they don't have tax revenue or other sources of revenue right now. And I do think an important lesson of the past few months is that the federal actions - and I really don't think of it as “stimulus,” I really think of these as actions - to help support basically grants and transfers to households and businesses has been absolutely critically important. It's meant that people who've lost their jobs have been able to continue to pay the rent, put food on the table.It's also the PPP program, which has obviously had its challenges, has been - I've heard this from businesses in our district - has been effective at getting money to the small businesses so they can keep going and hopefully come back. So my lesson from this is: these have been effective tools, I'm not saying what Congress should or shouldn't do specifically, but this has been effective at dealing with the situation through July, and I think there are lessons to draw from that in terms of getting us through the next six months.BRIAN CHEUNG: In the meantime, the Federal Reserve has pinned interest rates near-zero. But I want to chat about something fun now: forward guidance. I know that you can only speak for yourself but what's your preferred method of messaging to the market how long you will keep rates at the zero-bound especially now that there's been this discussion, as the minutes have noted, of Federal Reserve officials maybe playing around with the idea of an objective-based forward guidance that perhaps might be pinned to inflation, for example.JOHN WILLIAMS: Well, as you know in the recovery period and the expansion following the global financial crisis, we did use forward guidance pretty aggressively and I think very successfully starting in 2011. We did try different versions of that - what we call date-based versus contingent guidance. And I think one of the lessons from that is when market expectations - the public's understanding of what the Fed’s likely to do - is out of sync with our own thinking, the forward guidance has proven to be helpful to help people understand how we're viewing monetary policy. Right now I actually think that the guidance we do have in there, which is maybe more kind of descriptive than formal, forward guidance is serving us well. So we do have some time to think about how we should evolve that guidance as we go forward.To me the critical thing is: what's the problem we're trying to solve. Right now all of us are trying to figure out: where is the economy going today. Where is it likely to go and learn from the experience over the next few months. And from that position we can really consider and decide what's the best way to describe our thinking around the future path of monetary policy and link that obviously to our objectives of achieving maximum employment and price stability goals.BRIAN CHEUNG: Now on inflation, something that's interesting that we're hearing from other Fed officials is: where do you shoot? The target, as we know, is 2% for the Federal Reserve but what we've seen over the past recovery, since 2008, is that that has been undershot. It's been hard to kind of stimulate inflation. How does that guide your thinking for when to maybe lift off. I know you're not thinking about thinking about raising rates but when to lift off?JOHN WILLIAMS: Yeah, that's absolutely right. This is not the time to think about liftoff or normalization or all those words but in terms of your actual question around inflation, I mean the goal here is we want inflation to be you know anchored at 2%. The way I think about it is: a regular person or a business person is thinking, What's inflation likely to be over the time period of the loan I take or the mortgage I take or the car loan? You know what's the inflation rate I should think about, and I want that to be 2% for everybody. And that's what we need to deliver over time: is 2% inflation. And as you pointed out, that's been harder to do than to say, and I would argue that much of that is because of this issue of though the lower bound on interest rates and the limited ability in a global situation, at very low interest rates, to really provide the accommodation or stimulus as needed to boost the economy and get inflation back up to what we want. So my view is pretty simple. I want inflation, people to understand inflation will be 2% over any longer-term horizon, and we just need to both take the actions and communicate them in a way that helps us support that, that's been challenging in the past and obviously that's something that we're thinking hard about how to do for the future.BRIAN CHEUNG: So you mentioned that businesses and households to want certainty in the future and something that kind of plays into that is longer term interest rates and something that's been floated is this idea of yield curve control pinning down yields on the let's say medium term three or five year Treasuries to kind of provide a more a solid guarantee that rates will be lower for longer, but as we know nominal yields are already crazy low for right now, is there pressure within the Federal Reserve to adopt something like a yield curve control strategy as Fed Governor Lael Brainard has has laid out before. What's your thought on that?JOHN WILLIAMS: Well it is something that you know obviously we watched other countries such as Japan and now Australia use versions of yield curve control in their policy strategies. Obviously we study that and try to understand that, and I go back to the comment I made earlier for us, it's really identifying what's the problem we're trying to solve in terms of communicating or our policy action I do think that forward guidance has proven to be very powerful and effective. It's something that I think will be the core of our communication around policy along with our economic projections and other speeches and press conferences that together I think paint a clear picture of what success looks like for monetary policy and how we're going to take policy actions and get there.I view yield curve control as an interesting topic that we've obviously got to study but it would be really probably best used in a situation where we found that our forward guidance and our other communications wasn't being as effective as we would like. So, I think of it as a potential tool but not necessarily a tool for any specific situation. Really I would think of forward guidance and obviously think of asset purchases as our two primary tools to provide extra stimulus when the economy needs it.BRIAN CHEUNG: So one moving part of all this was that the Federal Reserve was midway through a review of its toolkit and audit, if you will, when this COVID-19 crisis happened. I know that the Fed has tabled that but we did get the findings and a summary of that Fed Listens conference series that you had been doing over the past year or so. I'm wondering, are you waiting to wrap up that review and announce the findings of that before then, announcing your strategy for forward guidance or even something like yield curve control.JOHN WILLIAMS: Well, clearly this has been a really important initiative in the Federal Reserve with the FOMC that Chair Powell has led and I think it's an absolutely essential thing for us to once again review very carefully - both our tools as you said, our overall framework and how to best achieve our maximum employment and price stability goals. So I've been a big supporter of that I think we've made a lot of progress and, you know, I hope that we'll be able to to roll that out later this year and I do think it's an important part of explaining to the public. You know how the world has changed. I would argue personally that the lower neutral rate of interest or lower interest rates globally that we've seen the past couple of decades has been a fundamental change in thinking about monetary policy strategy, other developments have changed since 2012 when we first put in the framework statement that we have currently. You know I do call have called for this rethink of the strategy so you know I'm a big proponent of that, and I'm hoping that we'll be able to roll that out later in the year. And I do think it is an important part of our communication package, you know the way I think it was like you know you have this, you know the strategy at the top. We obviously have our maximum employment and price stability goals, those are written to law, how do we define those and how do we define success. And then what are our preferred tools and approaches to achieve that. Now the actual specific action the tactics, those obviously have to be decided, depending on circumstances that the committee and will come out and in statements and so on.BRIAN CHEUNG: Let's switch gears to the Federal Reserve's liquidity facilities. Something that's been in view is in the corporate bond purchases through the primary and secondary market corporate credit facilities, which the New York Fed does operate. For those that are watching from the outside and people who are not Fed insiders, they're wondering why the Federal Reserve is buying bonds in Apple or AT&T for example, could you, I guess briefly explain what the Fed’s thinking is and doing that and I know that it's been mentioned that the Fed could stop that if market functioning resumes. When would that be in your view based on what you're seeing so far?NEW YORK, NY - FEBRUARY 26: San Francisco Federal Reserve President John Williams visits \"Opening Bell With Maria Bartiromo\" on FOX Business Network at FOX Studios on February 26, 2015 in New York City. (Photo by Rob Kim/Getty Images)JOHN WILLIAMS: Well first of all you do have to roll back time to March to understand I think really the context that we're operating in right now, you know, markets are functioning really well, and I'll come back to that point. So right now you might look around and say, you know, why is the Fed doing all this? Things look pretty good in terms of market conditions. I do think you have to remember that you know we are taking a lot of actions - and strong and decisive actions - that I think importantly helped to get us to the point we're at today. And given the uncertainty of the outlook you know we need to continue to be in those positions to support market functioning going forward. So going back to March or even April, we saw the core parts of the financial system - the Treasury market, the mortgage-backed security market and the corporate bond market and others - really become disrupted and in a lot of turmoil. And if those markets stopped functioning then credit basically stops flowing to businesses households and others.So when you get to the corporate credit facility we really saw the corporate bond market, the liquidity drying up. The market kind of shutting down and that would have shut off credit to large employers in the United States, which would have had, I think, devastating effects on jobs and the economy. And really our goal here is to, in the secondary market facility, is to make sure that these markets are functioning and they’re liquid. And so we're buying a very broad based set of securities that meet the eligibility requirements, and we're basically in there - not picking winners and losers at all - buying broadly across the market so that markets continue to work, and then businesses continue to fund themselves. Actually this program we bought relatively small numbers of bonds in the market. And the primary market facility hasn't had any uptake yet. But what's happened is that, I think, two things have happened: one is, it's helped restore confidence that the markets are functioning and if you are buying a bond you'll be able to sell it to somebody later on. And it's a backstop if the conditions get much worse. Then people know the Fed is there to help get support functioning the markets in the flow of credit. So even though we're not getting a lot of uptake from our facilities today, even though we're not having to buy a lot of bonds. And because markets are functioning well I think it does play an important kind of what I would think of as keeping confidence, and that good state of the world in place so that credit continues to flow to businesses. In terms of your question about adjusting we have been adjusting our purchases in the secondary market as the market functions improve, we've been able to step back in our purchases in any future decision the adjustments will obviously be based on how markets are performing but right now we were actually buying a relatively small amount.BRIAN CHEUNG: So one other market that's been in view has been repo and what's been interesting and maybe not as highlighted as the corporate credit facilities is the fact that repo balances from the Fed balance sheet went down to zero as of July 8 based on the most recent balance sheet print from the board. I guess I'm wondering there has been concerned as we saw, not even just from COVID-19 but from the September episode that maybe there's not enough funding out there in the banking industry and there's been fixes proposed like maybe changing the regulation known as the G-SIB surcharge, or perhaps actually directly lending the New York Fed being repo funds to hedge funds Is that something that you're entertaining? I know you talked about that earlier this morning but what's your thinking on that.JOHN WILLIAMS: Well I do think that the experience of September - where we saw a disruption in the repo market. I know September seems like years ago, but it was less than a year ago. And then in March, which was an extraordinary shock and damage and disruption to the Treasury and related markets. This is clearly, you know, part of I think the, you know, will be studied very carefully not only by the Federal Reserve but by others. And academic thought leaders are already thinking about: are there better ways to build a better mousetrap around how these markets function and things. Today is not the time to solve that problem, we're obviously still in a crisis and we're focused on keeping things running smoothly and keeping the markets functioning well, but I do think like the financial crisis, over the next few years, there will be a lot of thought and study given to how to best organize and how to best carry out the core functions in these markets. Right now they're functioning really well. The reason no one's coming to our repos is because the liquidity is ample. Markets are functioning well. And so, right now things are very good but I do think this will be an opportunity over the next couple years for people to think hard about how do we make sure we have a strong financial system, especially in this very important area.BRIAN CHEUNG: So the Treasury market, the rolling off of repo has brought the Fed's balance sheet down, not by a lot, but it did take back below $7 trillion. But I want to ask a big picture question. This is something that former Fed Chairman Ben Bernanke has written extensively about. The idea of the credit channel versus the traditional channel of interest rate policy. As we've seen from the episode after 2008, the Federal Reserve has not been able to get the balance sheet maybe back down to the level that it had hoped maybe out of the QE programs. So I'm wondering: is this a permanent part of the Fed’s toolkit, its balance sheet? Has the credit channel taken on a much more active role in monetary policy relative to just levering interest rates?JOHN WILLIAMS: Well as I said in my remarks actually earlier today, when you go back to 1913 and before that, when the discussion happened in the United States about whether we should have a central bank or not. I mean, it really was about financial panics and crises that led to severe recessions and depressions, which were unfortunately common in the late 19th century and happened again in 1907. In the modern era, including you know most of my career, we think of monetary policy as setting interest rates, but you know more traditionally, going back to the founding of the Fed, and through various crises, providing liquidity to markets supporting market functioning and supporting the flow of credit in a general way - not in terms of choosing winners and losers but providing support overall to to market function and credit flow - I think is a core function of a central bank. And something that when we saw the situation happen in September, when markets weren't functioning repo markets weren't functioning well, we acted quickly, decisively, similarly in March. That's what a central bank can do that nobody else can do: act in that way. And I think that's an important role for us, because in an uncertain world you never, you never know what's going to happen so therefore having the central bank, the Fed in this case, be able to step in and and make sure that markets are liquid and operating I think is absolutely critical.BRIAN CHEUNG: John last question here. When you talk to households or businesses in your district, what's your recommendation for them to do their part right now? I mean I'm not a money center bank or a primary dealer but what can I do, what can people on the street, what can business owners do right now to be part of this healthcare - what is primarily a health response here? Is it wearing a mask? Other economic things that you're thinking about that people can do in their everyday behaviors?JOHN WILLIAMS: Now my wife is a healthcare expert and so she will really not like it if I answer with healthcare advice. But I will tell you that - I have said this earlier in a speech that - we are on a narrow path of how to get our economy back on track, and how to do that safely in terms of the pandemic. And I think that those two are complimentary. Often in the debate that you hear, it's like: should we get the economy back? Or should we deal with the pandemic? You actually have to have both happen. And we're seeing that in parts of the country, where if people feel unsafe because of COVID, they're not going to go into restaurants, they're not going to go into businesses. So what we need, really is to have both of these happening and supporting each other. People behaving safely, businesses operating safely in a way that supports confidence. I mean, confidence is absolutely critical. At the same time, people can ween when, under those conditions, be willing to go out and actively participate in the economy. We're going to get there. I'm confident of that. It's gonna take time and as we're seeing, it's a situation that changes, is in flux all the time. But I'm confident that we'll get there over the next couple years and get this economy back full circle.BRIAN CHEUNG: All right, well I hope she will be satisfied with that answer. But again, New York Fed President John Williams joining us here on Yahoo Finance. Thanks so much for stopping by today.JOHN WILLIAMS: Great to be with you.-Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}