{"article": [{"url": "https://finance.yahoo.com/news/tesla-share-price-is-a-beast-that-cannot-be-stopped-analyst-185726637.html", "published": 1594821920.0, "headline": "Tesla share price is a beast that cannot be stopped: analyst", "body": "With all due respect to the new Ford Bronco, it’s Tesla stock price (TSLA) that is the true wild horse right now.And it’s a horse destined to gallup further up the mountain, says Wedbush tech analyst and Tesla bull Dan Ives.“Tesla is miles ahead of competitors,” Ives said on Yahoo Finance’s The First Trade. “It’s going to dominate 80% to 90% of the EV [electric vehicle] market share going forward and have, what I believe, could be 1 million deliveries by 2022. And remember, right now Tesla is a teflon-like model.”Ives has a Neutral rating on Tesla’s stock and a base case $1,250 price target. He thinks the stock could have potential to $2,000, and continues to be among the more upbeat on Tesla’s future from around Wall Street.For Tesla investors, to say they have been on a wild ride of late would be an understatement.BRUSSELS, BELGIUM - JANUARY 09: Tesla Model 3 compact sedan car in white with a Tesla Model S dual motor all electric sedan in red on display at Brussels Expo on JANUARY 09, 2020 in Brussels, Belgium. (Photo by Sjoerd van der Wal/Getty Images)The stock has exploded 260% year-to-date on optimism about Tesla’s production, profits and future product launches. Nearly 111% of that year-to-date gain has come in the past three months alone, per Yahoo Finance Premium data. Keep in mind that in early May, CEO Elon Musk tweeted to his followers the stock price was too high.Apparently not high enough, in the minds of many punters.Shares touched a record high of $1,794 on July 13, fueled by speculation that a second quarter profit from Tesla would mean addition to the S&P 500. If it were to be added, the stock could soar as it’s bought by fund managers. The bulls have also latched onto Tesla’s September “Battery Day” — where it could unveil a million mile battery — as a catalyst.A battery of that power would be another great selling point to Tesla’s autos, bulls argue.“S&P 500 inclusion seems likely (depending on Q2 results). Is it time to redeploy capital after an amazing run? Resoundingly, we think the answer is NO. In our view, Tesla is the most consequential company in the mobility ecosystem, and this is unlikely to change in the next decade,” wrote Piper Sandler analyst Alexander Potter in a new note to clients on Tuesday. The analyst revealed a Street high price target of $2,322.Story continuesThe research prompted Musk to simply tweet “wow.”Well said.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}