{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-24-2020-111353198.html", "published": 1598281880.0, "headline": "Stock market news live updates: Dow tops 28,000 for the first time since February as Covid-19 vaccine, treatment hopes rise", "body": "Stocks rose Monday, with the S&P 500 and Nasdaq hitting fresh highs and adding to last week’s record levels, as market participants reacted to positive developments over a coronavirus treatment, and signs that a vaccine might be authorized in the near-term. The Dow closed above 28,000 for the first time since February, led by advances in shares of Boeing (BA) and Dow Inc. (DOW).[Click here to read what’s moving markets heading into Tuesday, August 25]Travel, airline and other “reopening” stocks rallied, with shares of American Airlines (AAL), Norwegian Cruise Line Holdings (NCLH), Wynn Resorts (WYNN) and their peers each jumping. Apple (AAPL) shares advanced to their highest intraday level ever ahead of the stock’s four-for-one stock split.The U.S. Food and Drug Administration (FDA) on Sunday said it issued an emergency use authorization for investigational convalescent plasma to treat Covid-19 in hospitalized patients. While the treatment has not yet undergone full clinical trials, the FDA said that it deemed that the data so far suggest “product may be effective in treating Covid-19 and that the known and potential benefits of the product outweigh the known and potential risks of the product.”President Donald Trump, speaking in a press conference, called the approval a “very historic breakthrough,” and said the treatment reduced mortality by 35%, based on a study of patients by the Mayo Clinic.Meanwhile, the Trump administration is also reportedly considering fast-tracking a U.K. coronavirus vaccine candidate by bypassing typical U.S. regulatory standards, the Financial Times reported over the weekend. One of the options reportedly mulled would involve issuing the vaccine candidate being developed by AstraZenaca and Oxford University emergency use authorization. A spokesperson for the U.S. Health and Human Services department, however, also told the Financial Times that it was “absolutely false” that an emergency use authorization would be issued before the US presidential election.Story continuesThis week, the Republican National Convention (RNC) kicks off in Charlotte, North Carolina, days after former Vice President Joe Biden formally accepted the Democratic nomination for president at the Democratic National Convention (DNC) last week. While mostly virtual, some Republican leaders and delegates will be present in-person for Monday’s events. Speakers for Monday are scheduled to include Former Ambassador Nikki Haley, Sen. Tim Scott (R., S.C.) and House Republican Whip Steve Scalise (R., La.), along with President Donald Trump, who will speak during each day of the four-day event.On the earnings front, software company Palo Alto Networks (PANW) is set to report quarterly results after market close.—4:02 p.m. ET: Dow closes above 28,000 for the first time since FebruaryHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +34.21 (+1.01%) to 3,431.37Dow (^DJI): +378.54 (+1.36%) to 28,308.87Nasdaq (^IXIC): +67.92 (+0.60%) to 11,379.72Crude (CL=F): +$0.09 (+0.21%) to $42.43 a barrelGold (GC=F): -$14.30 (-0.73%) to $1,932.70 per ounce10-year Treasury (^TNX): +0.6 bps to yield 0.6460%—1:36 p.m. ET: Stocks hold onto gains, Dow tracks toward first closing level over 28,000 since FebruaryThe three major indices held higher in intraday trading Monday afternoon and the Dow tracked toward its first close of more than 28,000 since February 21. Shares of Boeing and Dow Inc. led advances in the 30-stock index, with each stock rising more than 4.5%.The energy, financials and materials sectors – areas of the market that had lagged in recent months during the height of the pandemic – led advances in the S&P 500. Tech stocks and the Nasdaq also advanced, but underperformed relative to the other two major indices. Small caps also rose, and the Russell 2000 tracked toward its first gain in three sessions.—10:03 a.m. ET: S&P 500, Nasdaq hit intraday record highsStocks rose to record levels shortly after market open Monday morning, adding to last week’s gains. Here were the main moves in markets, as of 10:03 a.m. ET:S&P 500 (^GSPC): +19.93 points (+0.59%) to 3,417.09Dow (^DJI): +163.18 points (+0.58%) to 28,093.51Nasdaq (^IXIC): +53.12 points (+0.47%) to 11,366.91Crude (CL=F): +$0.09 (+0.21%) to $42.43 a barrelGold (GC=F): +$0.80 (+0.04%) to $1,947.80 per ounce10-year Treasury (^TNX): -1.5 bps to yield 0.623%—9:31 a.m. ET: Apple shares open at a record highShares of Apple rocketed to a record high of $515.14 just after market open Monday morning, sending the iPhone-maker’s total market capitalization well above the $2 trillion mark it first exceeded last week.The move higher comes just before the company’s previously announced four-for-one stock split takes effect. Every shareholder of record as of the end of trading Monday will receive three additional shares. Shares will begin trading on a split-adjusted basis next Monday, Aug. 31.—8:32 a.m. ET: Chicago Fed National Activity Index retreats more than expected in July, as production and employment growth slowThe Chicago Federal Reserve’s National Activity Index fell more than expected in July from June, as manufacturing production and employment growth each decelerated amid a resurgence of coronavirus cases in some parts of the US.The headline index came in at 1.18 for July, from June’s upwardly revised 5.33. Consensus economists expected the July index would come in at 3.7. Readings of zero indicate the national economy expanding at its average historical rate of growth, while positive values signal above-average growth.Manufacturing industrial production increased at a more moderate 3.4% rate in July following a 7.4% rise in June. Employment-related indices contributed 0.38 points to the headline index, down from a 1.94-point contribution in June.—8:26 a.m. ET: Despite the new $300 federal unemployment benefit authorization came ‘too little too late for August spending’: Goldman SachsEarlier this month, President Donald Trump authorized a program to implement a $300 supplemental federal unemployment benefit, directing some $40 billion in disaster relief funds for states to distribute as payments to individuals for up to an estimated three to five weeks.While states are able to make payments to individuals retroactive to Aug. 1, the new program is unlikely to help support consumer spending – the biggest component of US economic activity – this month, according to a new note from Goldman Sachs titled, “The New $300 Benefit: Too Little Too Late for August Spending.”“The lapse in the $600 unemployment insurance payments will results in a roughly $70bn decline in monthly personal income in August – a sequential drag on consumer spending power of as much as 6.5% of PCE [personal consumption expenditures] in the month. At best, the new $300 payment would cover half of this decline if implemented in full this month,” Goldman Sachs economist Blake Taylor said. “But given delays in implementing the program and disbursing funds, the new program is unlikely to meaningfully support incomes until September.”“Despite a high saving rate, this hit to income is likely to weigh on consumer spending and retail sales in August,” Blake added.—7:11 a.m. ET: Stocks rally as Covid-19 vaccine, treatment hopes riseHere were the main moves in equity markets, as of 7:15 a.m. ET:S&P 500 futures (ES=F): 3,420.00, up 27.5 points or 0.81%Dow futures (YM=F): 28,130.00, up 271.00 points, or 0.97%Nasdaq futures (NQ=F): 11,661.5, up 99.5 points, or 0.86%Crude (CL=F): +$0.29 (+0.68%) to $42.63 a barrelGold (GC=F): +$11.70 (+0.60%) to $1,958.70 per ounce10-year Treasury (^TNX): +0.1 bps to yield 0.641%NEW YORK, NY - APRIL 02: Traders exit the floor of the New York Stock Exchange at the end of the trading day on April 2, 2013 in New York City. The Dow Jones Industrial average and the S&P 500 rose to new record highs on April 2, with the Dow finishing at a record close of 14,662. All three major indexes are up between about 10 percent and 12 precent for the year. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}