{"article": [{"url": "https://finance.yahoo.com/news/microsoft-surface-duo-dual-screen-smartphone-price-availability-123936989.html", "published": 1597218440.0, "headline": "Microsoft’s Surface Duo dual-screen smartphone coming Sept. 10 for $1,399", "body": "After nearly a year of anticipation, Microsoft has announced that it is officially launching its dual-screen Surface Duo smartphone on Sept. 10. The handset, which the company debuted last October, will be available for pre-order today and cost $1,399.The Duo is Microsoft’s (MSFT) first smartphone since it killed off its Windows Phone brand in 2017, and in an interesting twist of fate, the Surface Duo will run on Google’s (GOOG, GOOGL) Android operating system complete with Windows 365 and Android app support.From the look of it, the Duo, which I got to see during a virtual press demo, could offer the kind of jolt the smartphone industry needs, and may give Microsoft a greater foothold in the mobile market.Microsoft's Surface Duo is available for pre-order now starting at $1,399. (Image: Microsoft)Two screens are better than oneMicrosoft isn’t the only tech giant trying to switch up how we use our devices. Samsung, Motorola, Huawei, LG, and TCL have put out either foldable or dual-screen phones. But Microsoft’s design looks cleaner and more like a reinvention of the smartphone rather than a smartphone that’s been reconfigured to have a foldable or dual-screen setup.The Surface Duo can be used in both dual-screen and single-screen modes. (Image: Microsoft)Microsoft says that the Surface Duo is the thinnest foldable device in the world, and it certainly looks it. Rather than two bulky halves sandwiched together, the Duo’s left and right sides are incredibly slim.When open, the Duo is just 0.19 inches thick, thinner than Samsung’s new Galaxy Z Fold2, which is 0.27 inches thick while open. Closed, the phone is 0.39 inches thick, slightly larger than the 0.34-inch thick iPhone 11 Pro Max. In other words, the Duo should slip nicely in your pocket.So why not use a single foldable screen instead of two separate screens attached at a hinge? According to Microsoft, the decision came down to functionality. The company says that bendable displays are easily damaged compared to standard screens, and that it wouldn’t have been able to include stylus functionality with a folding screen.Apps on two screensIn the stage demo I watched, Microsoft chief product officer Panos Panay showed off how apps work between the two screens. When you pop open the Duo, you’ll be met with a large home screen that spans the two displays. Tap to open an app on the right panel, and it’ll open on that side of the Duo. Tap to open an app on the left side, and it’ll pop up there.Story continuesYou can also save app pairs as home screen shortcuts. So if you want to open Instagram and Twitter or One Note and the Kindle app at the same time, you can save them as a single shortcut to your home screen.The Surface Duo in single-screen mode. (Image: Microsoft)Tap them, and both apps will open up on either side of the handset. You can also copy and paste information from an app on one screen and paste it directly into another app on the other screen.One demonstration Panay offered was a text message thread with a link to a website. Instead of covering up the text thread, tapping the link on the right-hand screen opened the web page in the Edge browser on the empty left-hand display.Unlike Samsung’s Galaxy Z Fold2 or Galaxy Z Flip, the Duo doesn’t have an outside display. When it’s closed, there’s nothing to see but front and back panels. Not even an external camera. Instead, you’ll use the 11-MP internal camera for normal shots and selfies.But the Duo benefits from a 360-degree hinge that allows you to completely unfold the device so that you’re using just one display at a time. That not only allows you to use the camera in different ways, but apps as well. That’s because they behave differently depending on how you’ve got the Duo folded.With the device open, Panay tapped the directions button in the AllTrails app on the right-hand display, which launched Google Maps on the left-hand display.The Duo can also take advantage of Microsoft's Surface Pen stylus. (Image: Microsoft)But when he fully unfolded the phone to use just one screen, tapping the directions button launched Google Maps on top of the AllTrails app as you’d expect from a standard smartphone.The hardware setupThat 360-degree hinge also means you can position the Duo in multiple ways. You can, for example, use tent mode to sit your Duo on a table or countertop to watch videos while cooking, or use it in clamshell mode if you want to view content on one display, while working on the other.Those screens are no slouches either. Microsoft says it married the two 5.6-inch AMOLED PixelSense displays to create what it calls a single 8.1-inch PixelSense Fusion panel when unfolded. There’s a clear gap between the two screens, so they don’t really form one display when the Duo is open, but it still seems to function as one.The point of the Surface Duo is to allow you to do more with an extra screen. Whether that's more work or entertainment is up to you. (Image: Microsoft)Inside, Microsoft paired two batteries, located underneath the Duo’s displays, to act as a single power source. Between the two, the company says users can expect to get 15.5 hours of use from a single charge while watching local video playback. Expect that to be lower if you’re browsing the web or streaming movies all day.In terms of processor, the Surface Duo gets Qualcomm’s (QCOM) Snapdragon 855 processor, 6GB of RAM and 128GB or 256GB of onboard storage.Unfortunately, the Surface Duo doesn’t offer 5G connectivity, but instead relies on 4G LTE. 5G isn’t yet ubiquitous across consumer smartphones, but it’s getting there and will get a huge boost with the launch of Apple’s iPhone 12 later this year. It feels like a missed opportunity not to equip the Duo with 5G functionality, but price or availability of parts likey played into the decision.Speaking of pricing, the Duo’s $1,399 price tag is sure to give consumers pause, but it’s more or less par for the course for premium smartphones at this point. The original Z Fold launched at close to $2,000, while the iPhone 11 Pro Max will set you back $1,099. So the Duo’s price isn’t exactly entry level, but it’s not outrageous in terms of high-end phones.I’ll have to wait to get my hands on the Surface Duo before I can make any real assessments of its capabilities, but based on what Microsoft showed off, it has the makings of one heck of a smartphone.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Free time and ‘Fortnite’: How coronavirus changed video game industry foreverFacebook and Microsoft, smelling blood in the water, clash with Apple amid antitrust probesUber posts $1.8 billion loss in Q2, but deliveries skyrocket during coronavirusSamsung debuts Galaxy Note 20 and Note 20 Ultra smartphonesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}