{"article": [{"url": "https://finance.yahoo.com/news/how-mike-bloomberg-can-help-joe-biden-164223225.html", "published": 1592394620.0, "headline": "How Mike Bloomberg can help Joe Biden", "body": "Michael Bloomberg came and went quickly in the 2020 presidential campaign. He entered the race last November, spent $1 billion on staff and ads, rose briefly in the polls, then quit on March 4, after Joe Biden’s unexpected surge. Bloomberg has been mostly quiet since.But the publishing titan and former New York City mayor could still play a major role in the 2020 election, if he chooses to spend some of his $60 billion fortune helping Biden, a longtime friend. “The one advantage Trump does have over Biden right now is economic,” Bradley Tusk, a longtime Bloomberg adviser, says in the latest episode of the Yahoo Finance Electionomics podcast. “If Mike Bloomberg put in $100 million or $300 million, would that be welcome? I’m sure it would be.”Trump has outraised Biden by about $100 million so far, in part because he has Republican donors all to himself. Democratic donors, by contrast, were splitting their money among several major candidates until March. Biden has been catching up, however, and might be able to match Trump in funding by the home stretch in the fall.Bloomberg endorsed Biden when he dropped out, and said he will do whatever he can to defeat President Trump in November. But his money might help Biden more if directed at races other than the presidential one. “Mike's wealth could really make a difference in what kind of Congress Biden would have to work with,” Tusk says. “If I were Biden and I was asking Mike for help, I'd say focus as much on the key Senatorial races and House races.”[Check out other episodes of our Electionomics podcast.]If Biden wins the White House, control of Congress will become crucially important. Democrats seem likely to maintain control of the House, under any scenario. The Senate is the real battleground. Republicans now have a 3-seat majority. But four races, in Arizona, Colorado, Maine and North Carolina, could flip from Republican to Democrat, while a Democratic seat in Alabama will probably flip the other way. In three other Senate races, in Montana, Iowa and Georgia, Republican incumbents are slight favorites but still vulnerable.Story continuesA big influx of Bloomberg money in any of those races could yield a decisive advantage for Democrats. “If you can drop $20 million on a Senate election, it’s going to have a big impact,” Tusk says. In normal times, campaign money finances ads, along with localized efforts to interact with voters and persuade them to turn out on Election Day. The coronavirus will probably limit in-person campaigning, however, making ads more important than ever. If college and professional sports resume, games broadcast in key Senate states could be plastered wall-to-wall with political ads.Former Democratic presidential candidate Mike Bloomberg addresses his staff and the media after announcing that he will be ending his campaign on March 04, 2020 in New York City. Bloomberg, who has endorsed Joe Biden, spent millions of dollars in his short lived campaign for president. (Photo by Spencer Platt/Getty Images)Bloomberg would have to fund such ads not through donations to Senate campaigns themselves, which have donation limits. Instead, he’d fund or establish super PACs that can raise and spend as much money as they want, as long as they don’t coordinate spending with the campaign. Super PACs have been a huge source of campaign spending since the 2010 Supreme Court decision in the Citizens United case opened the door to vast spending by corporations and wealthy donors.A digital ad agency Bloomberg founded last year, called Hawkfish, was in contention to run the Biden campaign’s online ad efforts this year. But that seems to have fallen through, puncturing the image of a Biden-Bloomberg partnership. There’s still a lot of connectivity between the two camps, however. Top Biden strategist Anita Dunn advised Bloomberg during his four mayoral campaigns in New York City, and other Biden staffers have worked with Bloomberg as well.If Bloomberg does serve as a Biden kingmaker and Senate-deliverer, what might be in it for him? Bloomberg has said he could never work for anybody else, suggesting he’d turn down a Cabinet position if offered. And he’s 78, one year older than Biden. But minds tend to change when the opportunity arises. Some analysts speculate about Biden tapping Bloomberg as Treasury secretary, since he made his fortune on Wall Street and knows financial markets intimately. But Tusk thinks Bloomberg might be more interested in Secretary of State, since he already knows many world leaders and the perch would allow him to directly address climate change, one of Bloomberg’s top philanthropic interests. “If your country says it needs you,” Tusk muses, “maybe you just suit up and march.”Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Biden’s age might work in his favorSome nightmare scenarios for the November electionsThe stock market is off the railsThe risk to Biden if he picks a black running mateHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}