{"article": [{"url": "https://finance.yahoo.com/news/does-the-epic-twitter-hack-mean-you-should-sell-all-your-tech-stocks-161815936.html", "published": 1594898780.0, "headline": "Does the epic Twitter hack mean you should sell all your tech stocks?", "body": "Don’t let Twitter’s failure to keep hackers at bay shake you out of the hot tech stocks that have likely provided a big portfolio boost this year, pros say.Remember, Wall Street’s best minds mostly agree (and they rarely ever do) that it’s the likes of Facebook, Amazon, Apple, Netflix, Salesforce, Microsoft and Google that continue to have some of the best growth prospects amidst a world rife with risks stemming from the COVID-19 pandemic. These are businesses with strong moats albeit with software (see Windows recurring revenue at Microsoft) or hardware (see Apple’s iPhone). In turn, it may be unwise to dump stocks like that simply because of one well-known tech name’s operational missteps.“I don’t know one individual event is really going to be the driver for an unwinding in technology,” said Cowen’s director of market strategy Chris Pollard on Yahoo Finance’s The First Trade. Pollard said these big cap tech high-flyers will continue to be favored by investors for their strong future growth potential in what remains a low growth economic environment.The event that has cast fresh eyes on the explosive tech trade was a doozy, however.A Twitter logo is seen on a computer screen in this photo illustration on October 31, 2017. Material posted on Facebok and other social media directly and indirectly reached over 126 million Americans between 2015 and 2017 according to a company testimony that will be presented to the US Senate judiciary committe on Tuesday. (Photo by Jaap Arriens/NurPhoto via Getty Images)A number of super high-profile Twitter accounts were hacked on Wednesday by a currently unknown group or person. The hack spread a cryptocurrency scam via posts on the accounts of Apple, Tesla CEO Elon Musk, Democratic president hopeful Joe Biden, Amazon founder Jeff Bezos, Microsoft founder Bill Gates, former president Barack Obama, Warren Buffett, Uber and others.‘It’s worth it to pay up for’ growthTwitter’s stock fell as much as 5% Thursday on the news, but recovered most of those losses by early afternoon. It’s up 11% on the year, lagging the Nasdaq Composite’s 16% advance. Meanwhile, the iShares U.S. Tech ETF fell nearly 2% but is still up an impressive 18% year-to-date, according to Yahoo Finance Premium data.The social media giant said it’s looking into the matter — it has not yet shared publicly the source of the hack.Story continues“We’re overweight tech, preferring software and services,” opined Riverfront Investment Group senior portfolio manager Rebecca Felton on The First Trade when asked if the hack would alter her view on tech stocks. “When you think about it, tech is a crowded trade as growth is at a premium. I think it’s worth it to pay up for it [growth] because right now, if you look at tech’s revenue for the second quarter on average the sector’s revenues are expected to be flat to maybe down 1% versus the S&P 500’s where revenues are expected to be down about 10%.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}