{"article": [{"url": "https://finance.yahoo.com/news/delta-ceo-trying-to-avoid-furloughs-any-way-we-possibly-can-204543531.html", "published": 1592495600.0, "headline": "Delta CEO trying to avoid furloughs 'any way we possibly can' as airlines recover", "body": "The major U.S. airlines have all warned the coronavirus pandemic may force them to lay off employees in order to save money, but Delta Air Lines (DAL) CEO Ed Bastian is hoping to avoid cutting staff at all.The airline took $5.4 Billion from the U.S. Treasury under the Coronavirus Aid, Relief, and Economic Security (CARES) Act, which requires Delta to maintain employee salaries and benefits through Sept. 30. Although recent data suggests passengers are starting to fly again, the airline is moving now to downsize.“You know that the telltale sign will come October 1. That's when the restrictions around furloughs will come off and my goal, at Delta, is to avoid furloughs in any way we possibly can,” Bastian told Yahoo Finance’s “On the Move” in an interview.The air carrier employs 90,000 people. Yet almost half — more than 40,000 — have taken voluntary leave to help Delta save money during the COVID-19 crisis.Delta just launched an early retirement program, which Bastian estimates will help it streamline its workforce. The company also cut its cash burn from $100 million a day before the pandemic, to $30 million a day currently. It plans to add 100 flights back to its daily schedule this month as air traffic ticks up again.“You start to see how the revenue is climbing by staying very disciplined on cost, capping load factors and adding flights back as demand returns,” Bastian said.However, according to the CEO, revenue is only running at 15% of what it was a year ago as passengers start flying again. Delta plans to add around 1000 daily flights in July and August as travel demand slowly recovers.“Traffic is back. It bottomed out in April at 5%,’ he said. “I'd expect over In the next few weeks, that number is going to go to 20% and then, hopefully, eventually 30% by the end of the third quarter.”Defending prior buybacksAs airlines bolster their flight and sanitation policies in the post-lockdown era, Bastian said that he expects Delta to break even next spring.Story continuesIn a recent note to clients, Raymond James Analyst Savanthi Syth said Delta had 14 months cash on hand, and available credit that put its liquidity around $19 billion.“I think Delta's doing the right things in being conservative in how they bring the capacity back,” Syth told Yahoo Finance. “And that's because their kind of core business passenger is still not in any meaningful way willing to fly,” she said.One thing that keeps revenue from growing faster is Delta’s decision to only book 60% of its aircraft, and keep middle seats vacant.“We'll bring the middle seat back when customers tell us that they feel safe flying there and we can sell it just like we sell any of our products,” Bastian told Yahoo Finance, without specifying when that might be.Delta also has the option to borrow an additional $4.6 billion from the U.S. Treasury via secured loans, despite critics who say taxpayers have already given the airlines enough cash.Meanwhile, Syth defended Delta’s decision to spend $16 billion on stock buybacks and dividends between 2013 and 2019. She pointed out that Delta spent more than $103 billion on salaries and benefits during that same time period, while contributing to its pension programs above minimum requirements.“Delta’s capital returns were part of a balanced capital deployment strategy that didn’t result in an over-leveraged situation.” Syth said.She pointed out that had the COVID-19 pandemic been a normal cyclical downturn, “most U.S. airlines would have been sufficiently capitalized to make it through in my opinion.”Bastian says Delta’s immediate goal is, “protecting the welfare, the well being and the future of our customers, our people in these very challenging times.” He acknowledged more needs to be done to restore confidence among the flying public.“When you're talking about the virus, it's caused us to revisit the entire mechanism by which we board planes, how we space out on planes, how we clean planes, how we protect ourselves, go through the experience, and the great thing about it, it's working,” he added.Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.J&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesSouthwest warns that revenue could drop as much as 95% in MayDelta shores up liquidity as coronavirus pummels demand, warns of smaller airlineJetBlue Chairman: 'Everybody's working on survival' as coronavirus decimates airlinesTed Cruz: 'We are going to see human lives lost' if coronavirus shutdowns last for monthsJ&J eyes 'imminent' coronavirus vaccine production, aims for a billion doses worldwideFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}