{"article": [{"url": "https://finance.yahoo.com/news/for-profit-college-students-rejected-borrower-defense-203104397.html", "published": 1592235560.0, "headline": "'Just not right': Defrauded for-profit college students suffer rejected relief claims", "body": "This post has been updated with comment from the Education Department and clarifications on one student’s enrollment in ITT Tech.The Education Department (ED) is rejecting borrower defense claims of defrauded victims of predatory for-profit colleges, according to letters and emails received by three applicants who told their stories to Yahoo Finance.Three former students of the now-defunct ITT Tech told Yahoo Finance that their applications to have their student loan debt discharged under a “borrower defense” rule from the 1990s had been rejected.The ED sent these people a letter saying that it had completed a review of the application and “determined that your application is ineligible for relief based on review of the facts of your claim and the regulatory criteria for relief… this decision means that your Direct Loans will not be discharged.”Harold Poling, left, and Ted Weisenberger check the doors to the ITT Technical Institute after ITT Educational Services announced that the school had ceased operating in Rancho Cordova, Calif. on Sept. 6, 2016. (AP: Rich Pedroncelli)Consumer advocates are dismayed by the decisions regarding ITT Tech, which maintained 130 locations across the U.S. before closing down in 2016.“ITT was a predatory and fraudulent company… On every front and by every metric, ITT was a scam,” Toby Merrill, director of the Project on Predatory Lending, told Yahoo Finance. “The fact that the department is denying ITT students relief is unconscionable… it’s just not right.”Merill, whose project represents 750,000 former ITT students, said that the for-profit chain created $6 billion in student loan debt between 2006 and 2016.An ED spokesperson told Yahoo Finance that borrower defense claims “are not ‘approved’ or ‘denied.’ Borrowers are found to be eligible or ineligible for borrower defense relief. Though we can’t comment on these specific cases, each borrower defense application is adjudicated fairly and in a manner that assures that students who have suffered financial harm are provided relief.”April 2020: ‘This is total bunk’ Joseph White, who attended an ITT Technical Institute in Missouri on-and-off from 2001 to 2008, ended up with an associate’s degree and $30,000 in student loan debt.Story continuesAfter joining the military, White had attempted to pursue a bachelor's degree but said “hardly anybody would accept my ITT credits.”He returned to ITT to finish his bachelor's degree. And during the second enrollment, he became disturbed by some of the ITT staff’s actions.According to White, even though he had submitted state tuition assistance to be applied towards his tuition, the funds were “not accounted for, or missing” upon graduation. He also recalled being pressured to take out a private student loan, despite not wanting to hold them.ITT’s career services department was also not much help while White was looking for a job. He said that they kept sending him job postings that looked like they were copied and pasted from a jobs site. Another former ITT student also reported the same experience.White, who is currently trying to buy a home, is worried that the burden will be “overwhelming” between his mortgage payments and student loan repayments.He had submitted a defense to repayment application in 2015, hoping to have his student loan debt discharged. His application was rejected on April 30.“This is total bunk. … Most of these denials look like they are processed using a spam bot,” White told Yahoo Finance. “I’m utterly disgusted at the process. Dozens of other people who have been waiting for DTR responses have also been denied.”DeVos under attack for borrower defense reversalThe so-called borrower defense rules were originally written into law through the Higher Education Act in the early 1990s and were meant to help victims of fraudulent schools seek relief.Under existing law, borrowers with federal loans are eligible for loan forgiveness if a college or a university has misled them or engaged in other misconduct in violation of certain state laws.After the Great Recession, enrollment at for-profit schools “skyrocketed in the first decade of the period, nearly quadrupling between 2000 and 2011,” according to the New York Fed.In 2015, after several for-profit colleges went extinct amid scandals, the Obama administration implemented regulations such that defrauded students who made a successful claim would be granted full debt relief.U.S. Secretary of Education Betsy DeVos durig a cabinet meeting in the East Room of the White House on May 19. (PHOTO: Alex Wong/Getty Images)Education Secretary Betsy DeVos modified that rule in 2019, making it tougher to access relief while alleging that the Obama administration had “weaponized” the regulations..“When borrower defense arrived in 1995, it ... was little used… in the 20 years from 1995 to 2015, fewer than 60 claims were filed,” she said during a previous hearing in front of the House Committee on Education and Labor. “Then the previous administration weaponized the regulation against schools it simply didn’t like. They applied the law in a discriminatory fashion. So since 2015, there has been a 5,000% increase in borrower defense claims.”A political spat ensued: Congress rejected DeVos’ new rules, tried to re-install Obama-era rules, which then passed the GOP-controlled Senate, only to be rejected by President Donald Trump.The House has signaled that it would attempt to override the veto.Meanwhile, DeVos has been the subject of multiple lawsuits on the issue as well, from consumer advocates, aside from lawmakers who decried her reversal.From left, Sen. Tom Harkin, D-Iowa, Sen. Richard Blumenthal, D-Conn., and Rep. Elijah Cummings, D-Md., hold a news conference in the Capitol Visitor Center to unveil a report on the for-profit college industry on Monday, July 30, 2012. (PHOTO: Bill Clark/CQ Roll Call)May 2020: ‘A total shock’Tammi Say, who was in her 40s when she had attended an ITT Tech in California, is carrying $26,000 in student loan debt.After spending nine years in the military, Say became injured while driving trucks. She decided to attend ITT after seeing her brother successfully graduate from it.But the experience, particularly with the financial aid office, was confusing.“How much did I borrow? How many dollars in grants? I didn’t know any of that,” Say recalled. “They didn’t provide me receipts.”After she left ITT, Say said she had filed for her debt to be discharged since she was disabled. After a few years, the debt was finally discharged, only to be reinstated by Sallie Mae around “the same time that ITT got bombarded by Obama and forced to close,” Say said. She is now a few months into a new disability discharge application with Nelnet.Say submitted a borrower defense application, aside from the disability discharge, when “Obama was still president,” hoping to have her student loan debt discharged. Her application was rejected on May 20.“It was a total shock that I got rejected, a total shock,” Say said.U.S. President Barack Obama (C) signs the Bipartisan Student Loan Certainty Act of 2013 on August 9, 2013 in Washington, DC. (Photo: Chip Somodevilla/Getty Images)June 2020: ‘I am so angry and disappointed’Whitley Thompson attended an ITT Tech in South Carolina for five months and left without graduating in 2016. She owes $13,000 in student loan debt.After graduating from high school, Thompson was working odd jobs when she saw an ad for ITT.“They followed up with me constantly... and as the interview process went on, they were more than happy to get me signed up,” Thompson told Yahoo Finance.In hindsight, Thompson noted, there were some actions ITT took that puzzled her. When she was taking out grants for the school, the school told her she needed a co-signer. When her dad, who was just out of jail, offered to be her co-signer, “they even let him sign for me,” she recalled. “That’s how desperate they were to get me in there.”Thompson said that things got worse once she started school. “Some of the projects I had carried out were just complete garbage,” she said. Even though she was studying graphic design, she wasn’t even given access to Photoshop. She was pointed to a free website to download fonts, called DaFont, to practice.“I had no idea that ITT was a for-profit college,” she said. “They never said that.”The Chantilly Campus of ITT Technical Institute sits closed and empty on Tuesday, September 6, 2016, in Chantilly, VA. (Photo: Jahi Chikwendiu/The Washington Post via Getty Images)After a few months, Thompson felt like there was nothing to gain from staying, so she quit. But she couldn’t walk away entirely: “I pretty much just got saddled with the debt.”Thompson filed an application for debt relief in 2016 — which she said was like a “Rubik’s cube” and a “total mess” — hoping that she would receive at least partial relief on the debt she owed for a degree she didn’t even receive. Her application was rejected on June 9.“They’re just shoveling them out the door,” she said. “I have tried really hard. We’ve paid off almost all of our medical debt, all of our consumer debt.”Thompson worried about her child, bills, and medical expenses. She had to cross state lines for her daughter's medical appointments, traveling all the way to Charlotte, since she lived in a rural area.“I am so angry and disappointed,” she said. “I feel like I made a mistake 10 years ago, going to that school, thinking that I was going to learn something and do something.”—Aarthi is a reporter for Yahoo Finance covering consumer finance and education. Follow her on Twitter @aarthiswami. If you attended a for-profit college and would like to share your experience, reach out to her at aarthi@yahoofinance.comRead more:Education Secretary DeVos sued over rule related to for-profit college fraud'They stole my time’: For-profit college students share horror storiesHEROES Act would cancel $10,000 in student debt for ‘economically distressed’ borrowersRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}