{"article": [{"url": "https://finance.yahoo.com/news/exxon-suspend-company-match-employee-050005927.html", "published": 1596586100.0, "headline": "Exxon to suspend company match to employee retirement plans in Oct - sources", "body": "By Erwin SebaHOUSTON (Reuters) - Exxon Mobil Corp told employees it would begin suspending the employer match to retirement savings plans beginning in early October, said sources who received a message from the company on Tuesday.\"Given the current business environment, the corporation is taking steps to reduce costs,\" according to a copy of the message seen by Reuters. \"The company intends to suspend the company match contribution to the U.S. Exxon Mobil Savings Plan for all employees covered by the Savings Plan, effective around Oct. 1, 2020.\"Exxon spokesmen did not reply to messages seeking comment.On Friday, Exxon reported its first back-to-back quarterly loss in 36 years because of the drop in demand during the novel coronavirus pandemic.Exxon Senior Vice President Neil Chapman said on Friday the company was planning both capital and operating expense cuts to defend its dividend, adding that investors \"come to view that dividend as a source of stability in their income.\"Under the plan the company matches a 6% contribution by an employee with a contribution equal to 7% of the employee's pay. Exxon will suspend the contribution beginning in early October.\"As business conditions continue to evolve, company match contributions to the savings plan will be reassessed,\" Exxon told employees on Tuesday.At Exxon's Baytown, Texas, refinery and chemical plant, the United Steelworkers (USW) local union plans file a demand to negotiate over the change in the savings plan, said four sources familiar with the matter.At Exxon's refineries and chemical plants in Beaumont, Texas, Baton Rouge, Louisiana, and Billings, Montana, no decision had been made on how to proceed, said the sources who are familiar with the union's plans.(Reporting by Erwin Seba; editing by Jonathan Oatis and Lisa Shumaker)"}]}