{"article": [{"url": "https://finance.yahoo.com/news/carnival-ceo-arnold-donald-we-are-doing-what-we-need-to-do-to-start-cruising-214553019.html", "published": 1595350400.0, "headline": "Carnival CEO: 'We are doing what we need to do' to start cruising", "body": "Carnival (CCL) CEO Arnold Donald is hopeful that cruising around the world isn’t too far off into the distance.Donald told Yahoo Finance on Tuesday during the All Markets Summit Extra sailing in Germany is about to commence in August and Italy may be next. It remains unclear when cruising in the U.S. will restart as the industry works tirelessly to implement new safety protocols to protect against COVID-19.Carnival’s voyage to the gates of the road to recovery has been turbulent to say the very least.In March, Carnival’s Diamond Princess and Grand Princess ships were the faces of the COVID-19 outbreak. Thousands of passengers were trapped on the quarantined ships, with many live broadcasting their experiences on Twitter and Instagram. COVID-19 infections and deaths among passengers on the two ships mounted in March.It’s estimated that more than 700 people were infected with COVID-19 from the Diamond Princess. Nine people are believed to have died.“We are doing what we need to do” to start cruising, said Donald. “Our priority is public health... there is so much yet to learn about COVID-19.”To be sure, Donald and his executive team have thrown the kitchen sink at keeping the cruise line giant afloat long enough that it sails into calmer waters, perhaps later in 2021.Since the spring, Carnival has taken swift action to shore up its balance sheet. The company has raised a total of $10 billion in liquidity through a mix of debt and equity. In the process, Carnival now counts Saudi Arabia’s sovereign wealth fund as an 8.2% shareholder after it bought a stake in the company via a public share offering.Meantime, Carnival has slashed $7 billion in annualized operating expenses through staff reductions and cut capacity by 9% via ship sales and the recycling of older vessels.Assuming no revenue, Carnival believes it has enough liquidity to last it the next 12 months. The company has said it has more capacity to raise debt if needed.Story continuesThe verdict is out on whether Carnival will require that one (or two) final financial lifeline. Earlier this month, the CDC extended its ‘no sail’ order for U.S. cruises to September 30 from July 24. No serious discussions with the CDC on the resumption of cruising in the U.S. has begun, Donald told investors on an earnings call a few weeks ago.Carnival cruise line ship Carnival Magic is docked at Port Canaveral, Saturday, April 4, 2020, in Cape Canaveral, Fla. (AP Photo/John Raoux)Carnival shares are down about 70% this year, according to Yahoo Finance Premium data. The stock trades at a nearly 46% discount to book value.Despite the uncertainty on the future of cruising post pandemic, there are faint glimmers of hope emerging on the horizon. Carnival’s AIDA brand — which caters to cruise-goers in Germany — has received clearance to sail again, Donald pointed out. It’s likely some European countries such as Italy will give the green light on cruising soon. Carnival’s bookings for 2021 are surprisingly within historical ranges (at lower prices, however, amid discounts), with 60% of reservations from new cruisers.Even still, Donald is realistic on when cruising will return to its pre-pandemic glory days of 2019. He has said cruising levels may not return to pre-pandemic levels until 2022.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}