{"article": [{"url": "https://finance.yahoo.com/news/free-time-fortnite-game-industry-changed-forever-154644087.html", "published": 1597143260.0, "headline": "Free time and ‘Fortnite’: How coronavirus changed the video game industry forever", "body": "As coronavirus lockdowns continue to shutter movie theaters, restaurants, and sports stadiums, Americans are increasingly turning to video games for entertainment and to socialize with their friends and family.And that’s translating to record sales for gaming giants ranging from Microsoft (MSFT) and Nintendo (NTDOY) to Activision Blizzard (ATVI) and Take-Two Interactive (TTWO), with Newzoo estimating that industry revenue will grow 9.3% in 2020 to $159.3 billion due in part to the pandemic.“One of the big trends we’re seeing in player behavior through the pandemic is that video games have become one of the primary ways friends and family have stayed connected,” NPD Group video game industry analyst Mat Piscatella told Yahoo Finance.“Video gaming today is built on social foundations. Getting together for a round of “Fortnite” or “Call of Duty: Warzone” or to visit the islands of friends and family in “Animal Crossing: New Horizons” have become social events. I only see this type of behavior growing.”Online game 'Fortnite' enthusiasts attend the ESL Katowice Royale Featuring Fortnite Tournament during the Intel Extreme Masters Katowice 2019 event in Katowice on March 3, 2019. - World's top gamers vie for $500,000 in prizes at Fortnite International video game tournament. (Photo by BARTOSZ SIEDLIK / AFP) (Photo credit should read BARTOSZ SIEDLIK/AFP/Getty Images)Industry sales growth has been enormousOn Sunday, March 15 the Center for Disease Control issued national guidelines recommending Americans to avoid any gatherings of more than 50 people. That same day, Valve Corporation saw a then-record 20 million concurrent users on its Steam game distribution platform, and Microsoft’s head of Xbox, Phil Spencer, tweeted that the service was seeing increases in users across the board.That uptick in new and returning gamers has translated to huge sales for gaming companies. On Aug. 6 Nintendo reported that its Q1 2020 operating profit grew an incredible 428%, with sales of the company’s social simulator “Animal Crossing: New Horizons” topping out at 10.63 million units for the quarter. Since the game’s launch in March, Nintendo has sold an astonishing 22.4 million copies of the title.Nintendo said on August 6, 2020 that its quarterly net profit leapt to $1 billion, as the gaming industry enjoys extraordinary demand from players stuck at home because of the coronavirus pandemic. (Photo by Kazuhiro NOGI / AFP) (Photo by KAZUHIRO NOGI/AFP via Getty Images)Sales of the company’s Switch and Switch Lite consoles were also up 166% in the quarter, with the company moving 5.68 million units and 50.43 million titles.Story continuesActivision Blizzard, which reported its Q2 earnings on Aug. 4, saw revenue from its Activision business increase by a record 270% year-over-year thanks to its free-to-play “Call of Duty: Warzone,” while the firm’s Blizzard arm, which produces games like “World of Warcraft” and “Overwatch,” saw revenue increase 20% year-over-year. King, Activision Blizzard’s mobile games business, experienced a revenue jump of 11%.Take-Two Interactive (TTWO), which is responsible for games like “Grand Theft Auto,” saw revenue increase by 54%, hitting a record $831.3 million in its fiscal Q1 2020, while both Microsoft and Sony reported double-digit growth in their gaming businesses.Activision Blizzard's 'Call of Duty: Warzone' is a powerhouse that continues to perform for the gaming giant. (Image: Activision Blizzard)(MSFT) said that its Xbox business saw a 64% year-over-year jump in revenue, with Xbox hardware revenue up 49%. That’s particularly impressive considering that Microsoft is expected to launch its new Xbox Series X console later this fall, which would usually translate to a slowdown in hardware sales.Sony (SNE), meanwhile, said that Q1 2020 sales in its PlayStation segment were up 32%. Most of that jump came from increases in game sales, as PlayStation 4 hardware sales were down year-over-year.Gaming’s post-pandemic futureSo will the game industry see a dramatic drop in users when the pandemic subsides and people are once again able to venture out in public? Not according to Needham analyst Laura Martin.“Knowing how long COVID-19 lasts is unimportant to our video game valuation thesis because video game companies benefit near term and long term from rapidly rising hours played, broadening demos, more new games tried, higher in-game spending, and limited/no live sports on TV during the pandemic,” Martin wrote in a recent research note.Piscatella says it’s as though the last two quarters have caused industry trends to jump ahead two years. One of those trends that game makers will be looking at moving forward is how to better integrate social interactions in games.“Building more ways for friends and family to connect in gaming has been a big priority for developers even before the pandemic,” he said. “But what’s been made more clear is that building even more social features is a big part of the future of gaming.”A screengrab from a special in-game showing of \"We The People\" at Fortnite’s Party Royale on July 04, 2020 in South Pasadena, California. We The People is hosted by Van Jones, who is joined by Elaine Welteroth, former Editor-in-Chief of Teen Vogue, Jemele Hill, writer for The Atlantic, Killer Mike, rapper / songwriter, and hip hop musician Lil Baby. Van Jones and guests speak about how to change systemic racism in media, culture and entertainment. (Photo by Neilson Barnard/Getty Images)Titles like “Fortnite” have been taking the lead on that, adding global concerts, movie trailers, and even panel discussions on topics like race in America that players can join in and watch through the game itself.But the impact on the industry goes beyond shortened timelines. Piscatella says that an increase in new gamers could bring about new kinds of games.“In the short term, it’s been all about trying to get enough consoles, accessories and new content to satiate what has been very strong demand. Beyond that I think this increase in audience and engagement will only encourage more new content development, which will hopefully bring even more new players.”And with Microsoft and Sony set to launch their newest consoles, the Xbox Series X and PlayStation 5, in the fall, the industry is likely to see even greater growth moving forward.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Facebook and Microsoft, smelling blood in the water, clash with Apple amid antitrust probesUber posts $1.8 billion loss in Q2, but deliveries skyrocket during coronavirusSamsung debuts Galaxy Note 20 and Note 20 Ultra smartphonesActivision Blizzard earnings blow away expectations as gamers player through pandemicFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}