{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-travel-bans-fly-as-fauci-issues-grim-warning-on-casualties-181900690.html", "published": 1593523640.0, "headline": "Coronavirus update: Travel restrictions fly as Fauci issues grim warning on casualties", "body": "The resurgence of cases affecting more than half of U.S. states and territories stoked more worries among health experts on Tuesday, as new diagnoses continue to climb within America’s borders.With spiking infections in the Sun Belt states, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told a Senate committee Tuesday he is very concerned about the increasing case trend.“I would not be surprised if we go up to 100,000 a day if this does not turn around,” Fauci warned.To-date, the highest single-day case count in the U.S. was more than 47,000 on June 26. According to Fauci, the country is adding 40,000 cases daily on average — double the previous U.S. average of 20,000 cases per day.Yet Centers for Disease Control (CDC) director Robert Redfield recently said the case count in the U.S. is likely ten times more than what has been reported. On Tuesday, he told lawmakers that up to 8% of the U.S. population has likely experienced the virus.The U.S. continues to be a global epicenter of the pandemic, with more than 2.6 million cases reported and more than 126,000 deaths. The global count continues has ballooned past 10.3 million and more than 506,000 have died; yet data shows at least half of all infected have recovered.In a reflection of its status as a COVID-19 hotspot, the European Union on Tuesday reopened its borders to international travel — but the world’s largest economy did not make the list — unlike Canada, which has also kept its borders closed to the U.S.Meanwhile, New York, New Jersey and Connecticut expanded the list of states where travelers will be required to self-quarantine for at least 14 days if they travel to the tri-state area.FDA vaccine guidelinesA volunteer receives an injection from a medical worker during the country's first human clinical trial for a potential vaccine against the novel coronavirus, at the Baragwanath hospital in Soweto, South Africa, June 24, 2020. REUTERS/Siphiwe Sibeko TPX IMAGES OF THE DAYIn his remarks, Fauci also reiterated his guarded optimism about a potential coronavirus vaccine, with a clutch of key pharmaceutical firms spearheading the effort.The FDA on Tuesday released a 24-page guidance document that described safety measures pharma companies need to take in order to receive an emergency use authorization, and eventual approval for any COVID-19 vaccine.Story continuesDespite the urgency and ambitious timetables floated, Commissioner Stephen Hahn reiterated Tuesday that the regulatory body will not be cutting corners in order to approve a vaccineThe agency’s guidance noted that “vaccine immune responses that might predict protection against COVID-19, is currently limited and evolving.” The FDA does not anticipate a high efficacy rate, but has said at least 50% would be acceptable.Yet companies involved in the vaccine race — such as Johnson & Johnson (JNJ) — are setting a relatively high bar for their experimental candidates. A top JNJ executive told Yahoo Finance earlier this month that it is aiming for a success rate in at least 70% of its clinical trials.And while the FDA required testing of the vaccine in older and higher-risk individuals, it encouraged “the inclusion of diverse populations in all phases of vaccine clinical development. This inclusion helps to ensure that vaccines are safe and effective for everyone in the indicated populations.”The FDA also addressed a much-discussed strategy of purposely infecting individuals for trials in the event of decreased cases, making it harder to test the effectiveness of a vaccine.“If it is no longer possible to demonstrate vaccine effectiveness by way of conducting clinical disease endpoint efficacy studies, the use of a controlled human infection model to obtain evidence to support vaccine efficacy may be considered,” the FDA said.However, the agency said that many issues “including logistical, human subject protection, ethical, and scientific issues, would need to be satisfactorily addressed.”Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}