{"article": [{"url": "https://finance.yahoo.com/news/fears-of-new-dot-com-bubble-overblown-205319203.html", "published": 1599580880.0, "headline": "2 reasons fears of a dot-com style tech bubble are overblown", "body": "Mega-cap tech stocks like Apple (AAPL), Amazon (AMZN), Microsoft (MSFT), Facebook (FB), and Tesla (TSLA) (if you consider that a tech stock) have been hammered over the past few days, pulling down the S&P 500 and tech-heavy Nasdaq.During late afternoon trading Tuesday, Tesla was down nearly 20% amid news that it won’t be part of the S&P 500. Meanwhile, Facebook was down nearly 4%, Amazon and Microsoft over 4%, and Apple over 5%. And on Tuesday, workplace collaboration app Slack (WORK) saw its stock plummet over 15% in after-hours trading following a disappointing earnings report.That’s led to rumblings that the market — which has been bounced around by these and other massive tech names — is careening toward a second coming of the dot-com bubble of the late 1990s that came crashing down 20 years ago. That era was best epitomized by Pets.com, which, despite a flashy advertising campaign, flamed out just 9 months after its initial public offering.Fears of a new tech-driven dot-com bubble seem to be overblown, according to analysts. Image: APBut according to Capital Economics’ senior markets economist Oliver Jones, the rapid growth in tech stocks is different from the dot-com bubble for two reasons — most big-name tech stocks are fundamentally sound companies, and, despite recent volatility, tech stocks have provided a safe haven as other industries have faltered amid the pandemic.Tech firms are delivering on fundamentalsAs Jones writes in a research note, one of the key differences between the dot-com bubble and the current Big Tech market leaders is that, unlike many of those first-generation websites that took off, firms like Apple, Amazon, Facebook, and Microsoft have solid fundamentals.“While options market shenanigans may have contributed a bit lately, the main catalyst for their rally is simply the fact that their businesses have done extremely well, in both absolute and relative terms, during the coronavirus crisis. That has not changed in the past week,” Jones wrote in note.The tech firms aren’t just making money — they’re doing so on a sustained basis and cruising past their prior year earnings even amid a global pandemic crippling other parts of the economy.Story continues“Bears will start to make comparisons to the [dot-com bubble] of the late nineties,” David Nelson, chief strategist of Belpointe Asset Management, wrote in a note Tuesday. “As a veteran of that war I can tell you there's little resemblance. While valuations are stretched most of the big cap secular growth stocks are profitable. That was not the case in 2000.”A closed Apple Store in Washington, DC, on April 29, 2020, ahead of their first quarter earnings report after market close on April 30. (Photo by SAUL LOEB / AFP) (Photo by SAUL LOEB/AFP via Getty Images)Take Apple. In the second quarter of 2020, the pandemic shuttered production facilities in China and then forced it to close stores around the world outside of Mainland China. The company still managed to increase revenue year-over-year by 1% to $58.3 billion. In Q3 2020, the company saw revenue grow 11% year-over-year to $59.7 billion.Amazon and Microsoft, meanwhile, have already been on a roll thanks to the performance of their cloud platforms as the pandemic spurs demand for such services. Amazon, of course, has also benefited immensely thanks to its positioning as a lifeline for essential goods when many people were stuck in their homes in the early portion of the pandemic.Google’s parent Alphabet was the outlier, with revenue decreasing year-over-year in Q2 2020 by 2%, partly due to a pullback in ad sales.The tech industry has been a bright spot despite recent volatilityThose performance metrics come as entire swaths of the economy have been decimated by the coronavirus pandemic including the hotel business and airlines. STR, a data analytics firm for the hospitality industry, found the U.S. hotel occupancy was down 27% year-over-year for the week ending Aug. 29. What’s more, revenue per room was off 44.5%.The airline industry has laid off thousands, as consumers either avoid airports entirely or are unable to travel internationally. Airlines including American (AAL), Delta (DAL), and United (UAL) have even gone as far as to eliminate change fees on domestic flights to further entice consumers to fly.The restaurant industry has been similarly impacted by the virus, first by shutdowns and then by an inability to host in-door dining in some states.As Jones explains, there’s little else for investors to be excited about outside of Big Tech. According to his note, there’s been no surge in call options for equity indices, indicating investors were willing to buy, while there has been a slight increase in put volumes, indicating investors are willing to sell if the price is right.“This suggests that investors’ primary concern has been protecting themselves against broad-based weakness, the opposite of the caution-to-the-wind behavior you might expect to see in a bubble,” he wrote.In other words, investors have likely been looking at tech as a safe haven while other industries struggled amid the pandemic. Now, they’re looking to claim the profits they’ve earned in the interim.So don’t break out those Pets.com sock puppets just yet.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple’s iMac 27-inch has a colossal power and a gorgeous displayApple fires shot at Google in new privacy adNvidia debuts latest RTX 3000 series graphics cards, including high-powered RTX 3090Samsung’s Galaxy Z Fold2 5G could be the first foldable phone you want, if you can afford itFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}