{"article": [{"url": "https://finance.yahoo.com/news/tesla-price-target-1400-credit-suisse-hiccup-could-drive-correction-163316679.html", "published": 1594986080.0, "headline": "Tesla price target doubled to $1,400 at Credit Suisse, but a 'hiccup could drive a correction'", "body": "More Wall Street analysts are scrambling to keep up with Tesla’s incredible stock rally.Credit Suisse analyst Dan Levy raised his price target on shares of Tesla to $1,400, or twice the $700 target he’d given previously, on the heels of a monster rally that sent shares as high as $1,794.99 on July 13.Still, the price target implies 6.7% downside from Thursday’s closing price, and Levy reiterated his Neutral rating on shares of Tesla.“The stock seems priced for perfection, and any material hiccup could drive a correction,” Levy said in a note published Thursday.“Tesla is now the world’s most valuable automaker even though it will only sell ~450-500k units this year (<1% global volume,” Levy said. “To justify the current stock price, we believe one must assume that by 2025 Tesla will set 2.2mn units (making it as large as German luxury brands, while trading at an elevated 30x+ PE [price/earnings] multiple.”“It tells us that the onus is now on Tesla to execute to these lofty expectations; albeit, an elevated stock price provides Tesla with a significant cost-of-capital advantage.”Levy attributed Tesla’s recent run-up in share price to the company’s better than expected second-quarter delivery results, announcements on capacity expansion, mass short covering, momentum buying and heightened retail interest. In the past week alone, more than 83,000 Robinhood accounts added Tesla to their portfolios, according to data from Robintrack. That made Tesla the second-most popular stock on the platform after Moderna (MRNA) during the period.NEW YORK, NEW YORK - JANUARY 30: A Tesla vehicle is displayed in a Manhattan dealership on January 30, 2020 in New York City. (Photo by Spencer Platt/Getty Images)CatalystsEven with a Neutral rating, Levy said he still expects Tesla “to continue garnering attention with a number of positive catalysts ahead.”One will be second-quarter earnings results, which are set for release on Wednesday. That report will be closely watched to see whether Tesla manages to eke out a modest profit, based on Generally Accepted Accounting Principles (GAAP). To do so would mark Tesla’s fourth straight GAAP profitable quarter and make the electric-car maker eligible for consideration into the S&P 500 – making shares available to an even wider range of investors.Story continuesOther catalysts include Tesla’s inaugural Battery Day September, which WedBush analyst Dan Ives said in a note earlier this week would will likely include a Tesla announcement for “‘game changing’ battery developments.Further expansion on auto-making capacity will also be a key catalyst to watch for Tesla, Credit Suisse’s Levy said.The capacity “point is crucial, as over the next 18 months Tesla capacity may nearly double for its current level (currently 700k, going to 1.3mn units),” he said. “It potentially implies upside to 2022 volume estimates (we forecast ~970k).”Levy’s new price target of $1,400 on shares of Tesla is well above the $881 average price target on the stock among more than 30 analysts on Wall Street, according to Bloomberg data. Baird analyst Ben Kallo also raised his price target on shares of Tesla to $984 from $700 previously, while maintaining a Neutral rating.Shares of Tesla rose 259% for the year to date through Thursday’s close.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:Jobless claims: Another 1.3 million Americans filed for unemployment benefits last weekJune jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}