{"article": [{"url": "https://finance.yahoo.com/news/yahoo-u-what-are-spac-153617338.html", "published": 1595328260.0, "headline": "Yahoo U: What are SPACs?", "body": "For more business and finance explainers, check out our Yahoo U page.DraftKings (DKNG), Nikola (NKLA), and Virgin Galactic (SPCE) are among the big names that have used a Special Purpose Acquisition Company (or SPAC) to raise capital and list shares for public trading.SPACs have been referred to as “blank check” companies since their defining feature involves going public as an entity with no business. The companies raise money for the purposes of merging with or purchasing a company at some point in the future.The idea of a blank check company has been around for a while, but the financial strategy has become increasingly popular in a market environment still riding the waves of volatility from the coronavirus pandemic.What are SPACs?SPACs are publicly-traded shell companies that have the intention, at some point, of absorbing another company (or multiple companies).The vehicles begin life as a traditional initial public offering: hiring an underwriting bank to help structure the IPO, filing an S-1 document with the Securities and Exchange Commission, embarking on the roadshow to drum up demand for the securities.The difference: The company being pitched is a shell company with no operations. The SPAC’s executives have to explain to potential investors that the company will later use the capital raised to purchase another company.This strategy usually relies on credibility to convince investors to essentially hand the company blank checks. SPACs often tout the experience of its management group (in running companies and/or engineering mergers and acquisitions) as part of its value proposition.In many cases, SPACs will message to investors the types of companies it may target in the future (i.e. a tech-focused or retail-focused SPAC).Because of the unusual structure, SPACs will usually issue “units” instead of “shares” in an IPO. The units involve some mix of common stock and warrants, which entitle the holder to purchase more shares.Story continuesHow do SPACs purchase or merge with companies?After a SPAC raises money in an IPO, the management group will begin shopping for companies.In the event that the target company is more expensive than the money raised in the IPO, the SPAC will have to team up with other investors to raise more capital or turn to other funding sources like issuing debt.If the merger or acquisition is agreed upon by both the target company and the SPAC, the publicly-listed SPAC essentially transforms into the acquired company, even taking on a new stock ticker in many cases.The management group usually takes on an active role in the post-transaction company, helping to steer the company through new life as a publicly-traded company.Why would a target company work with a SPAC to go public?One natural question is: Why would a SPAC be a more attractive method of going public over an IPO?Strategies in going public can never be pinned down to one reason. But despite their complexity, SPACs generally offer a simpler path for companies to raise capital and become publicly listed.From the perspective of a company trying to go public, the IPO’s roadshow can be daunting. Pitching the business model to countless investors across the country requires a lot of work. Share pricing is also heavily contingent on how well the IPO roadshow goes, meaning that there is a good amount of uncertainty about how much capital the company will be able to raise.SPACs offer a one-stop shop for a company to get its capital, since it is the SPAC’s role to scrap together the financing. In the end, the SPAC offers the target company one management group to pitch to. Arguably more importantly, the SPAC can offer an exact figure on how much it is willing to pay — no roadshow or price volatility required.Why are SPACs hot now?Data from Renaissance Capital, and provided to Yahoo Finance, shows that SPACs have raised about $12.5 billion in 2020 (as of July 16). That figure is likely to increase further as billionaire investor Bill Ackman is set to open up a multi-billion dollar SPAC of his own which could break the record for largest-ever blank check IPO.The light green sections of the chart highlight year-to-date figures. With a little less than half of the year to go, 2020 has already set a record for the most amount of proceeds raised by blank check companies.Market conditions have been volatile in 2020 as a result of the COVID-19 crisis. As such, companies hoping to go public are likely concerned that hitting the IPO roadshow will come with heightened uncertainty over where the new shares will price.By merging with or selling to a SPAC, companies are signing up for more certainty over how much capital it can raise.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed expands Main Street loan program to nonprofitsEXCLUSIVE: NY Fed's Williams: 'Not the time to think' about rate hikesBig US banks unwilling to call the economic bottom yetBank analysts warn of 'confusing, sloppy, and shocking' earnings as COVID-19 extends gripA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}