{"article": [{"url": "https://finance.yahoo.com/news/biden-outraises-trump-for-month-of-may-amid-coronavirus-george-floyd-protests-135841094.html", "published": 1592903180.0, "headline": "Biden outraises Trump for month of May amid coronavirus, George Floyd protests", "body": "Democratic presidential candidate Joe Biden has outraised President Trump for the first time this year even as the coronavirus pandemic continues to hit the United States, and George Floyd protests began.The former vice president pulled in $80.8 million for the month of May, topping Trump, who pulled in $74 million.May was the first month Biden has jointly fundraised with the Democratic National Committee, allowing him to compete on even footing with the president, who has been jointly fundraising with the Republican National Committee (RNC) for months.Despite besting the president in total fundraising figures, Biden still lags far behind in cash on hand totals. Trump’s cash on hand equals a staggering $265 million, compared to the less than $150 million in Biden’s coffers.According to the Trump campaign, the president has pulled in over $800 million for this election cycle, nearing the $1 billion figure campaign manager Brad Parscale promised that Trump would raise and spend to ensure victory in the November election.Trump’s May fundraising haul represents an uptick of over $12 million from the April totals.“President Trump's consistent leadership and unprecedented actions during this challenging time has undoubtedly resonated with the American people,” said RNC Chairwoman Ronna McDaniel.Democratic presidential candidate, former Vice President Joe Biden arrives for a meeting with small business owners, Wednesday, June 17, 2020, in Yeadon, Pa. (AP Photo/Matt Slocum)“Support across the country continues to pour in, helping us to build an unparalleled operation that will deliver victories up and down the ballot in November,” she said.Biden’s camp touted grassroots support, highlighting the average donation size of just $30 this past month. According to the campaign, over half of May donors were new, and online donors have tripled since February.The large sums come as the presumptive Democratic nominee has experienced a surge in the polls. Currently, Biden leads Trump in the national polls by 8.9 points.Despite Biden’s current popularity, he has struggled with fundraising, often lagging behind other Democratic presidential candidates like Senators Bernie Sanders (I-VA) and Elizabeth Warren (D-MA).Story continuesBy the third quarter of last year, despite a strong start in fundraising, Biden’s campaign had less than $10 million in its coffers.“Just a few months ago, people were ready to write this campaign off,” Biden said in a statement. “Now, we are making huge dents in Donald Trump’s war chest. Every single dollar is going to make sure he is only a one-term president.”Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:‘We need more funding for police’: Missouri AG SchmittWhy Black wealth has stayed 'relatively flat' since Tulsa massacreFormer Obama advisor Valerie Jarrett talks protests, defunding police, and criminal justice reformCoronavirus pandemic could wipe out Social Security 4 years earlier than predicted: Wharton ModelRepublican states to see biggest economic boosts from reopening amid coronavirus crisisRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}