{"article": [{"url": "https://finance.yahoo.com/news/a-key-ingredient-in-costcos-costsavings-strategy-160653618.html", "published": 1592306060.0, "headline": "A ‘key ingredient’ in Costco’s cost-savings strategy", "body": "Costco‘s (COST) focus on value over selection positions the bulk retailer for a strong performance amid the economic upheaval of COVID-19, says one analyst.“Costco concentrates its buying power on a small number of items, featuring roughly 3,700 stock-keeping units versus about 75,000 to 80,000 at Target or what we estimate as about 140,000 at Walmart supercenters,” Morningstar analyst Zain Akbari wrote in a note to investors.“This creates outsize purchasing leverage that we believe is a key ingredient in delivering the values Costco offers, augmented by a robust private-label offering,” he added.Limiting product variety as measured by stock-keeping units (SKUs) is a strategy highlighted earlier this year.A shopper looks at a display of televisions at a Costco Warehouse in Robinson Township, Pa., on Thursday, May 14, 2020. (AP Photo/Gene J. Puskar)Additionally, Costco’s warehouse format helps to keep internal distribution costs down by reducing the number of times products get shuffled around from delivery to sale. Akbari argues Costco has more “real-estate efficiency” than Walmart (WMT) or Kroger (KR).“Offering customers a select assortment of high-value merchandise in a low-frills environment delivers several benefits that allow Costco to continually hold prices down and leverage its warehouse infrastructure,” said Akbari.[To read the full report from Morningstar, sign up for Yahoo Finance Premium. Click here to start your free trial and step up your investing.]The analyst also points to Costco’s membership renewal rates as a point of strength.“Costco’s membership format exhibits strong customer loyalty, with renewal rates holding steady around 90% in a variety of economic environments and despite Amazon’s growth,” wrote Akbari.The analyst says Costco is “well differentiated,” highlighting the company’s in-store prepared food offerings and fuel, which help create a steady stream of repeat visitors.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the US stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferre.Read more:It would be unprecedented for a bear market to be this short: Wells Fargo StrategistStory continuesRecent rally could be a ‘bear market trap’: Miller Tabak StrategistA view from the trading floor: Algorithms having ‘outsized impact’ amid coronavirus impactFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}