{"article": [{"url": "https://finance.yahoo.com/news/hamilton-popularity-lifts-disney-engagement-20-in-july-data-142944832.html", "published": 1597570640.0, "headline": "'Hamilton' popularity lifts Disney+ engagement 20% in July: Data", "body": "Disney+ saw a 20% surge in engagement for the month of July — and a big reason for that was the much-anticipated release of “Hamilton,” a film featuring a live recording of the hit Broadway musical.“Hamilton,” which made its Disney+ debut on July 3rd, accounted for 7% of time spent across all five major platforms with over 20% of Disney+ users tuning in to watch, according to new data from analytics research firm 7Park.(Source: 7Park Data)Additionally, Disney+ users spent over 100 minutes daily on the platform as overall streaming usage ticked up last month — climbing 3% from June.In total, consumers spent 662 minutes on some type of streaming platform in July— an impressive amount as summer months generally attract fewer users amid the outdoor activity boom.(Source: 7Park Data)The success of “Hamilton” has prompted Disney to look at other musicals that could potentially be adapted for the platform. “Once On This Island” is one show that is reportedly being pursued by the streamer.Netflix is also capitalizing on fans’ musical appetite. The streaming veteran recently secured the rights to the new Princess Diana musical before the show even hits the Broadway stage.‘Diana’ musical will stream on Netflix before Broadway debut“Diana: A New Musical” was originally supposed to premiere on March 31, 2020, but due to Broadway’s coronavirus shutdown (which remains in effect through 2021) the show has now been postponed until May 2021.“We speak for the entire company when we say that we couldn't be more excited to finally be able to share our show with theater lovers everywhere,” the producers said in a joint statement. “Though there is no substitute for the live theater, we are honored to be a part of the quality entertainment that Netflix provides its subscribers worldwide.”Alexandra is a Producer & Entertainment Correspondent at Yahoo Finance. Follow her on Twitter @alliecanal8193Read more:Why 'Tenet's' staggered rollout could be a risky move as on-demand movies soarBeyoncé's 'Black Is King' underwhelms on Disney+ as 'Hamilton' holds strong, data showsAnalyst: VOD deal between NBCUniversal, AMC will likely 'dampen movie attendance,' hurt industryNetflix a 'force to be reckoned with' with Emmy nods, but here's why competitors still have a shotA tale of two streamers: Netflix hits a rough patch as Peacock spreads its wings"}]}