{"article": [{"url": "https://finance.yahoo.com/news/disney-shut-hong-kong-disneyland-151251181.html", "published": 1594635620.0, "headline": "Disney to shut Hong Kong Disneyland again as coronavirus cases rise", "body": "By Helen Coster(Reuters) - Walt Disney Co <DIS.N> is temporarily closing its Hong Kong Disneyland theme park from July 15 amid rising coronavirus cases in the Chinese-ruled city, the company said Monday.The announcement came two days after Disney reopened its biggest resort, Walt Disney World in Orlando, Florida, as coronavirus cases surged in the state.“As required by the government and health authorities in line with prevention efforts taking place across Hong Kong, Hong Kong Disneyland park will temporarily close from July 15,” a Disney spokeswoman said in a statement.The Hong Kong Disneyland Resort hotels will remain open with adjusted services. They have put in place enhanced health and safety measures, the company said.Hong Kong recorded 52 new cases of coronavirus on Monday, including 41 that were locally transmitted, according to health authorities. Since late January, Hong Kong has reported 1,522 cases and local media reported an eighth death on Monday.Florida has emerged as an epicenter of U.S. COVID-19 infections. In Orange County, where Disney World is located, cases rose by 623 to a total of 18,624, the fifth-highest outbreak in the state.Hong Kong is tightening social distancing measures amid growing worries about a third wave of coronavirus infections. The government will limit group gatherings to four people - from 50 - a measure last seen during a second wave of the outbreak in March.Hong Kong Disneyland, which is majority-owned (53%) by the Hong Kong government, reopened in June. Hong Kong Tokyo reopened in July; Disneyland Shanghai reopened in May.Disney’s reopening of its parks in Asia helped provide assurance about moving ahead in Florida, Josh D’Amaro, chairman of Disney’s parks, experiences and products division told Reuters in an interview on Saturday.David Miller, an analyst at investment bank Imperial Capital, estimates that Disney generates 75% of operating income in its parks division from Walt Disney World, compared with 10% from all of the foreign parks combined.(Reporting by Helen Coster in New York. Additional reporting by Lisa Richwine in Los Angeles, Editing by Nick Zieminski and Marguerita Choy)"}]}