{"article": [{"url": "https://finance.yahoo.com/news/12-million-children-live-in-a-household-that-missed-rent-or-mortgage-payments-during-covid-19-191620730.html", "published": 1593699860.0, "headline": "Almost 12 million children live in a household that missed rent or mortgage payments during COVID-19: survey", "body": "More households paid rent and mortgage payments during the pandemic than expected — but some households, particularly those with children, have struggled to make ends meet during the pandemic.Almost 12 million children in the U.S. live in a household that missed rent or mortgage payments in May — and parents were less confident in their ability to pay in June, according to a U.S. Census Bureau Household Pulse Survey report.“Households across the country are facing unprecedented challenges due to the outbreak of COVID-19 and it is clear that those with children are facing very challenging circumstances through no fault of their own,” said Paula Cino, vice president for construction, development and land use policy at the National Multifamily Housing Council, based in Washington, D.C.About one in six households with children under age 18 missed mortgage payments in May, compared to only one in eight in homes without children. The burden is even greater among households who rent: one in four renters with children missed payments in May, compared to only one in six without children.June payment rates are not yet available, but 13.9% of households with children said they had “no confidence” they could pay rent in June, compared to only 7.4% of households without children. For mortgaged households, 4.3% with children said they had “no confidence” they could pay their mortgage, compared to 2.2% of households without children, according to Census data.Credit: GettyThe Coronavirus Aid, Relief, and Economic Security (CARES) Act prohibited evictions and created forbearance options in properties with federally-backed mortgages, but those protections are set to expire on August 31. Over 30 states have also issued bans on evictions and penalties for not paying housing costs, with varying expiration dates.“The government must step in with effective housing policy, like direct, emergency rental assistance, to ensure families remain in their homes,” said Bob Pinnegar, president and CEO of the National Apartment Association, an Arlington, Va.-based trade association.Story continuesOn top of additional expenses associated with raising children, households with children had increased rates of job loss during the pandemic. Some 55.2% of households with children under age 18 had at least one adult lose their job during the pandemic, compared to 43.6% in households without children.In addition to housing instability, 3.9 million children have also gone hungry during the pandemic — and 1.3 million children have experienced both housing instability and food insecurity, according to the Census Bureau.“If greater assistance isn’t forthcoming soon, then families with children will face even more challenges this fall when schools may not be in session and the ability of parents to provide childcare is limited,” said Cino.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:A surprising group of homeowners have paid off their mortgagesRent is getting cheaper in big citiesHouses for sale will be ‘gobbled up’: Barbara Corcoran"}]}