{"article": [{"url": "https://finance.yahoo.com/news/heres-who-trump-likes-to-blame-when-the-stock-market-goes-down-152234488.html", "published": 1600165820.0, "headline": "Here’s who Trump likes to blame when the stock market goes down", "body": "President Trump loves to tweet about stocks. In fact, he has tweeted about the market more in the last year than during any stretch of his presidency.On Monday, as stocks reversed some of the losses from last week, he tweeted “up BIG today.” On Tuesday, during a Fox news appearance, he promised “another good day today.”Trump weighs in on the market frequently, but he prefers to do it when stocks are rallying, and especially when they’re in record territory. But he’ll also mention the market when stocks are falling – usually to assign blame for any downturn to his political enemies.New Stock Market high! I will never get bored of telling you that – and we will never get tired of winning!— Donald J. Trump (@realDonaldTrump) December 16, 2019Using the helpful Trump Twitter Archive, Yahoo Finance isolated over 200 stock market tweets sent by the president since he took office. These are messages that mention stocks or 401(k) accounts specifically. Tweets just about the economy and his economic record were not included.This narrow universe of tweets – within the 22,500+ he has sent since Inauguration Day – provides a window into how Trump approaches an issue which advisors reportedly say the president views as both the most important barometer of the economy and central to his re-election campaign.David Foster/Yahoo FinanceTellingly, over half of Trump’s stock market tweets have come in just the last 15 months.Who gets blamed on the down daysTrump has a range of villains at the ready for days when the market is in the red. The media is a favorite target. Earlier this month he blamed Fox New polls – which had just showed him down in the key states of Wisconsin, Arizona, and North Carolina – as the reason for the decline.On Labor Day, after the market had fallen hard for two straight days, Trump promised big returns ahead as “we’re, hopefully, rounding the final turn in the pandemic.”Story continuesDo you notice that any time Fake News Suppression Polls are put out, like @FoxNews, the Stock Market goes DOWN. We are going to WIN!— Donald J. Trump (@realDonaldTrump) September 3, 2020Over the course of his presidency he’s also blamed other parts of the media like cable news channels and correspondent Brian Ross, formerly of ABC news, for a down market.The Democrats – and specifically their impeachment efforts – have been another favorite target. The market was riding high last December before the emergence of the coronavirus and the president claimed – without evidence – that the market would be “even better” if it wasn’t for the “the horror show that is the Radical Left.”The Federal Reserve has historically been the third main target. Trump repeatedly criticized the central bank in 2019 for raising interest rates and, in his view, holding back the stock market.If the Fed would cut, we would have one of the biggest Stock Market increases in a long time. Badly run and weak companies are smartly blaming these small Tariffs instead of themselves for bad management...and who can really blame them for doing that? Excuses!— Donald J. Trump (@realDonaldTrump) August 30, 2019During this year’s pandemic-induced recession, the Fed has cut interest rates to zero and the president has responded largely with praise for Fed Chairman Jerome Powell. “I called up Jerome Powell, and I said, ‘Jerome, you've done a really good job,’” Trump said in March adding “I'm very happy with the job he did.”‘They will make you very poor, FAST!’Since the 2020 presidential race heated up in July, most of the president’s tweets about the market have focused on Joe Biden, whom he calls part of the “radical left.”Trump has repeatedly claimed that his administration is all that’s standing in the way of an epic economic collapse. In a typical recent tweet, the president said that a Biden victory would mean “[m]arkets would crash and cities would burn.”In fact, the president’s economic fear-mongering has little basis in fact. Recent Democratic and Republican administrations have been good and bad for investors in about equal measure. Biden was also perhaps the most market-friendly candidate to emerge out of the crowded Democratic primary and he has even made significant inroads among Wall Street donors.If you want your 401k’s and Stocks, which are getting close to an all time high (NASDAQ is already there), to disintegrate and disappear, vote for the Radical Left Do Nothing Democrats and Corrupt Joe Biden. Massive Tax Hikes - They will make you very poor, FAST!— Donald J. Trump (@realDonaldTrump) July 6, 2020Trump’s record on the stock market is actually about average and he’s well off the pace of some of his predecessors. Forbes recently ranked modern presidents by stock market performance: Bill Clinton was number one, Barack Obama was second, and Trump was eighth.On the broader economy, Trump has been on the defensive as Democrats now often note that there are fewer jobs in the U.S. today than when he took office in 2017. Biden is also polling close to Trump on who would do a better job on the economy, with some recent polls finding “voters are split 50-50”.‘Stock Market starting to look very good to me!’During his time in office, Trump has publicly forgotten about the stock market for stretches when there’s no good news to report. In the early part of 2018, it appears that nearly 4 months went by without a presidential tweet about the market as S&P 500 returns during that period were decidedly mixed. Once the market got back into record territory, a flurry of tweets followed.It was a bit different in February and March of this year. The S&P 500 dropped over a thousand points as the coronavirus pandemic and recession took hold. As equities dropped off a cliff, Trump tweets became less frequent but they didn’t stop. At one point, he even came close to recommending people buy stocks.The Coronavirus is very much under control in the USA. We are in contact with everyone and all relevant countries. CDC & World Health have been working hard and very smart. Stock Market starting to look very good to me!— Donald J. Trump (@realDonaldTrump) February 24, 2020The market, as it turned out, had a lot further to fall in the weeks that followed, but it has since recovered. During the downward stretch, Trump blamed the media for the falling markets and touted the rare days when the market was up.In recent days, journalist Bob Woodward released tapes withTrump discussing how he intentionally downplayed the crisis despite having evidence to the contrary.\"I wanted to always play it down,\" he said on March 19 as stocks neared their bottom. \"I still like playing it down, because I don't want to create a panic.\"\"He didn't want to cause a panic, Why?” House Speaker Nancy Pelosi asked Thursday as Washington wrestled with this latest scandal. She quickly followed up with a rhetorical: “because of the stock market?\"Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:The US has lost jobs since Trump took office, but so have many other countriesBiden’s top economic priority isn’t what you thinkWhite House on jobs: ‘The numbers are going to slow’ but we’re in a ‘durable recovery’Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}