{"article": [{"url": "https://finance.yahoo.com/news/tesla-shares-open-at-split-price-heres-how-the-stock-is-doing-135556291.html", "published": 1598864600.0, "headline": "Tesla shares surge 12% on day of stock split", "body": "Tesla (TSLA) shares closed 12% higher today on its first day of trading post its stock split. The stock closed at $498.32.The 5-for-1 split — the first in the company’s history—was announced earlier in August when the share price was below $1,400. The stock has gone up since then, closing at $2,213.40 last Friday (that’s $442.68 on a split-adjusted basis).Over the summer Tesla eclipsed Toyota (TM) to become the largest auto company in the world. Its market cap now sits at around $412 billion.The stock has been on fire this year, up about 495% year-to-date, while the S&P 500 (^GSPC) and Nasdaq (^IXIC) have rallied 8.34% and 31.14% respectively.Analysts have been racing to re-rate the stock, with one analyst calling Tesla’s valuation “mind-boggling”.The stock’s price target was recently raised at Jeffries to a street high of $2,500, in part because of the company’s upcoming Battery Day on September 22. Wall Street and competitors will be watching to see if a million-mile battery is unveiled that day.Wedbush’s Dan Ives recently laid out a bull case scenario of $3,500, though his current price target is $1,900. Adjusting for the stock split, Ives’ new price target is $380 with a bull case of $700. He has told Yahoo Finance Tesla “is a tech company, not an automobile company.”Tesla’s latest 2nd quarter results announced in July beat expectations. The company posted a fourth consecutive quarter of GAAP profitability making the stock eligible to be considered for inclusion in to the S&P 500 (^GSPC).Tesla Inc CEO Elon Musk takes off his coat onstage during a delivery event for Tesla China-made Model 3 cars in Shanghai, China January 7, 2020. REUTERS/Aly SongThe adjusted stock split occurred on the same day Apple (AAPL) also split its shares 4-to-1. The move increases the size of the float, but does not change the valuation of the company. More shares at a lower price is as a way to make them more accessible to individual investors.In May, when the stock was around $780, Elon Musk tweeted “Tesla stock price is too high imo,\" sending shares tumbling 9%.Investors have been pouring money into the expanding electric vehicles space. Tesla’s competitor NIO (NIO) has seen gains of about 380% year-to-date on the heels of deliveries which smashed expectations, and better than expected quarterly results.Story continuesXPeng (XPEV), another Chinese electric vehicle maker went public last week, raising $1.5 billion. The stock popped more than 40% on its first day of trading.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}