{"article": [{"url": "https://finance.yahoo.com/news/smarkets-bident-takes-largest-lead-yet-vs-trump-in-race-for-white-house-125829673.html", "published": 1592398040.0, "headline": "Smarkets: Biden takes largest lead yet vs. Trump in race for White House", "body": "Presumptive Democratic presidential nominee Joe Biden has taken a decisive lead over President Donald Trump in his bid to win the White House, data from predictive betting markets showed on Wednesday, with the former vice president appearing to open up double-digit leads in at least two critical swing states.According to Smarkets, Biden is now coasting on his largest-ever lead among the site’s investors, who give him a 53% chance of winning vs. Trump’s 41%. Biden’s chances are being bolstered by sizable leads in Florida and Michigan, states in which the president prevailed in 2016, and will likely need in 2020.The hydra-headed crises engulfing the administration — including social upheaval, an economy in turmoil and the still raging coronavirus outbreak — have sandbagged the president, who until recently was considered the prohibitive favorite.\"With coronavirus numbers rising in 22 states and Black Lives Matter protests across the country, Donald Trump’s presidency is being severely tested,” noted Smarkets Head of Political Markets Sarbjit Bakhshi.Smarkets data mirror major polls that have consolidated in Biden’s favor ahead of the November vote, and other predictive sites have trended in his direction. Amidst the turmoil, Trump’ approval ratings have sagged to the lowest levels of his presidency.“Even though recent polling gave Biden a double-digit lead in the swing state of Florida, nothing can be taken for granted and both candidates will be looking for ways to supercharge their support before November,” Bakhshi said.Moreover, Biden’s coattails may be long enough to carry other Democrats to wins that may swing the Senate in his party’s favor. US Bookies, another predictive betting market, found that Republicans are less likely to retain control of the upper chamber as Democratic candidates take the offensive.“Current data suggests that the Democrats have a strong chance of winning the majority of the Senate,” said US-Bookies betting industry analyst Alex Donohue.Story continues“With polls and betting odds also favoring Joe Biden in the 2020 election, we’re seeing Democrats make a strong push to take the majority,” he said.SMH Group CEO George Ball told Yahoo Finance on Wednesday that at this stage, markets are fairly neutral on whether Trump will return to the Oval Office in November. Investors “haven’t decided which way it’ll go,” he said.Yet neither do markets appear to be pricing in the rising prospects of a Democratic sweep that puts Biden in the White House, while leaving his party with majorities in both chambers of Congress.The challenger’s tax plan will likely raise taxes but “will not be disastrous for Corporate America. The pure Biden plan is not a socialistic plan...it’s very tolerable, but it will impact earnings” which are “somewhat stretched” currently, Ball added.The wild card for the general election remains the economy’s health. After employment and retail sales that posted staggering monthly gains after precipitous drops in the wake of the COVID-19 outbreak, Wall Street is aggressively pricing in a sharp recovery.\"Trump supporters are hoping an economic recovery will boost his chances,” Smarkets’ Bakhshi wrote on Wednesday. Despite the record month of retail sales, economists widely expect a deep recession this year — something no incumbent has ever been able to shake.“At the same time, Biden has everything to gain from a diverse choice of exceptionally talented vice-president candidates who will help him gain support in areas in which he is weaker,” Bakhshi added — which include California Senator Kamala Harris, who’s seen as the front-runner among Smarkets bettors.Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news"}]}