{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-7-2020-222526572.html", "published": 1596813860.0, "headline": "Stock market news live updates: Stocks end mixed after modest boost from July jobs; stimulus talks hit impasse", "body": "Stocks closed mixed on Friday, as investors absorbed a July jobs report that narrowly beat expectations, and momentarily tempered fears about a recovery losing momentum as the coronavirus outbreak strengthens its hold on the world.Simultaneously, contentious negotiations over new fiscal support for the U.S. economy — which broke down late Friday — kept a lid on the rally. The Nasdaq Composite closed lower to end a seven-session winning streak as tech shares faltered. Both the S&P 500 and Dow eked out gains, ending higher for a sixth straight session.Rounding out the economic data calendar for this week, the Labor Department’s monthly jobs report offered a fuller picture of the state of the US economy last month. Employers added 1.8 million non-farm payrolls during the month, beating consensus expectations for 1.48 million new positions in July. The number of payroll gains, however, was down from the record 4.8 million added during June.However, debates in Washington, D.C. over another round of virus-related relief measures continued — albeit with little progress as lawmakers remained locked in disagreements over the size and details of the package. Treasury Secretary Steven Mnuchin said Friday afternoon he would instead recommend that President Donald Trump proceed with using executive actions to implement aid, with negotiations among lawmakers yielding no discernible movement.US-China tensions were also in focus, with the Treasury Department announcing Friday that the Trump administration was placing sanctions on 11 officials in China and Hong Kong, including Hong Kong Chief Executive Carrie Lam, for undermining political freedoms in the region. Separately, late Thursday, President Donald Trump issued two executive orders placing restrictions on Chinese social networks TikTok and WeChat in the US, citing national security concerns.Elsewhere in markets, gold paused its breakneck advance, but hovered above $2,000 per ounce as investors still sought out safe haven assets other than low-yielding Treasuries .Story continues—4:02 p.m. ET: Stocks close mixed amid flurry of jobs data, US-China tensions and stimulus updatesHere’s where the three major indices settled at the end of regular trading Friday:S&P 500 (^GSPC): +2.1 points (+0.06%) to 3,351.26Dow (^DJI): +46.36 points (+0.17%) to 27,433.34Nasdaq (^IXIC): -97.09 points (-0.87%) to 11,010.98—11:50 a.m. ET: What economists are saying about the July jobs reportThe US economy added a better than expected 1.8 million payrolls in July, extending net payroll gains for a third straight month. The upside surprise, however, could lessen pressure on lawmakers to deploy another robust round of fiscal stimulus, some economists flagged.Here’s what a handful of economists had to say to Yahoo Finance about the July jobs report:“The US created more jobs than expected in July. The risk is this eases the pressure on politicians to agree on an immediate fiscal deal. With confidence already under pressure, incomes being squeezed by benefit cuts and Covid containment measures hurting job prospects, we are entering a more challenging period for the economy.” — James Knightley, chief international economist for ING“August employment numbers could still see some lingering pressure from the resurgence in virus cases, but for the most part, we believe the worst of the soft patch in the job market recovery has passed. Starting in mid-June, many businesses were forced to close once-again amid a resurgence of new coronavirus cases in their local area ... More recently, a few high-frequency indicators appear to offer some tentative encouragement that the employment recovery freeze has begun to thaw.” — Russell Price, Ameriprise chief economist“Upward momentum has been fading in the most timely data, and the labor market still has a long way to go before it is recovered. Payrolls are still down 12.9 million since February. Another consideration: The positive data could lessen pressure on Congress and the administration to reach agreement on another fiscal stimulus package.” – Jim O’Sullivan, TD Securities chief US macro strategist“The report shows that the pace of job-gain acceleration has now slowed markedly, and it is our best guess that the rapid rate of return to work will now exhibit a very deliberate pace of rebound from here ... Still, the economy as a whole can ironically do reasonably well, as it has over the past few months, highlighted by improving manufacturing data, consumption and housing data, etc., and we think that the next few months could see a very reasonable rate of economic growth, with a slower pace of job recovery.” – Rick Rieder, BlackRock’s chief investment officer of global fixed income—9:34 a.m. ET: Stocks open lower after jobs reportHere were the main moves in markets, as of 9:34 a.m. ET:S&P 500 (^GSPC): -8.32 (-0.25%) to 3,340.84Dow (^DJI): -78.96 (-0.29%) to 27,308.02Nasdaq (^IXIC): -22.4 (-0.21%) to 11,084.72Crude (CL=F): -$0.43 (-1.03%) to $41.52 a barrelGold (GC=F): -$2.20 (-0.11%) to $2,067.20 per ounce10-year Treasury (^TNX): -1 bp to yield 0.526%—8:30 a.m. ET: July jobs data surprises to the upsideChalk one up to the resilience of the U.S. economy: July payrolls data showed nearly 1.8 million jobs were created last month, ahead of Wall Street’s consensus forecasts and defying a wide berth of economist estimates.The unemployment rate also fell to 10.2%, bolstered by what the Labor Department said was a reflection of “continued resumption of economic activity that had been curtailed” due to lockdowns.Stock futures are paring losses as traders absorb the data, but are still lower after Thursday’s rally.—7:22 a.m. ET Friday: Stock futures extend overnight losses, pointing to a lower openHere were the main moves in markets, as of 7:23 a.m. ET:S&P 500 futures (ES=F): 3,332.75, down 11.5 points, or 0.34%Dow futures (YM=F): 27,185.00, down 100 points, or 0.37%Nasdaq futures (NQ=F): 11,218.00, down 43.25 points, or 0.38%Crude (CL=F): -$0.30 (-0.72%) to $41.65 a barrelGold (GC=F): -$0.70 (-0.03%) to $2,068.70 per ounce10-year Treasury (^TNX): -0.5 bps to yield 0.531%—6:09 p.m. ET Thursday: Stock futures open slightly lowerHere were the main moves in equity markets, as of 6:09 p.m. ET:S&P 500 futures (ES=F): 3,341.25, down 3 points, or 0.09%Dow futures (YM=F): 27,265.00, down 20 points, or 0.07%Nasdaq futures (NQ=F): 11,255.00, down 6.25 points, or 0.06%NEW YORK, NEW YORK - MARCH 10: A man in a medical mask walks by the New York Stock Exchange (NYSE) on March 10, 2020 in New York City. After losing nearly 8 percent in a market rout yesterday, the Dow Jones Industrial Average was up over 700 points in morning trading as investors look to a possible tax cut and other measures by the Trump administration to combat the coronavirus. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}