{"article": [{"url": "https://finance.yahoo.com/news/earnings-season-preview-q2-2020-sp-500-morning-brief-102143074.html", "published": 1594013360.0, "headline": "Get ready for the ugliest earnings season since the financial crisis: Morning Brief", "body": "Monday, July 6, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAnalysts expect a sharp drop in Q2 earnings and the margin of error is highJuly kicks off the third quarter, which means companies will soon reveal how business performed in the recently completed second quarter.This three-month period came amid crippling economic lockdowns around the world aimed at containing the spread of COVID-19.\"The estimated (year-over-year) earnings decline for Q2 2020 is -43.8%, which is below the 5-year average earnings growth rate of 5.5%,” Factset’s John Butters wrote. “If -43.8% is the actual decline for the quarter, it will mark the largest year-over-year decline in earnings for the index since Q4 2008 (-69.1%).”“All eleven sectors are projected to report a year-over-year decline in earnings, led by the Energy, Consumer Discretionary, Industrials, and Financials sectors,” Butters added.Analysts warn of a sharp drop in earnings during Q2. (FactSet)Revenue, a better reflection of the demand and pricing environment, is estimated to have declined by 11.1% during the period. As we’ve previously explained, swings in earnings are more prominent than changes in revenue due to the existence of fixed operating and financing costs.Getting back to earnings, it’s anyone’s guess how accurate the estimates will prove to be. As we’ve seen for months, company’s have been suspending or withdrawing guidance left and right reflecting management’s own lack of confidence in forecasting the direction of business amid the unpredictable pandemic. That in turn has left analysts little to use as a guide in making their own forecasts.“At this point, exactly 400 companies within the S&P 500 have failed to guide over the last three months, a post-Reg. F.D. record, suggesting that corporate sentiment is neither positive nor negative, but simply a big question mark,” Bank of America’s Savita Subramanian wrote on Wednesday.Companies haven't offered much guidance. (BofA)Furthermore, these published estimates often reflect the mean or median of a survey of analysts. The dispersion among these analyst forecasts tend to be narrow, leading these estimates to be characterized as a consensus.Story continues“Not surprisingly, estimate dispersion is near record levels as well,” Subramanian added. And when estimate dispersion is high among the analyst community, then there really is no consensus anymore on where things are heading.Now normally, it’s about this time when we’ll remind you that much of what comes out of earnings season is backwards looking and so the information is stale.But that won’t quite be the case this time around, as investors will get color on how companies across industries have been navigating the pandemic and economic crisis.This information will be critical for analysts and investors moving forward as they form their own expectations, especially as the probability of another major flareup in COVID-19 infections remains non-zero.By Sam Ro, managing editor. Follow him at @SamRoWhat to watch todayEconomy9:45 a.m. ET: Markit US Services PMI, June final (46.7 prior)9:45 a.m. ET: Markit US Composite PMI, June final (46.8 prior)10 a.m. ET: ISM Non-manufacturing, June (50.0 expected, 45.4 in May)READ MORETop NewsBuffett’s Berkshire ends Deal drought with Dominion bet [Bloomberg]European stocks rise after Asian rally [Yahoo Finance UK]Uber, Postmates agree on $2.65 billion all-stock deal [Bloomberg]Luckin Coffee shareholders vote to remove chairman, report says [Bloomberg]YAHOO FINANCE HIGHLIGHTSWhat a bad month could mean for 'Trumpism,' the Senate and the economySallie Krawcheck: Coronavirus pushing gender wealth gap backward at a faster paceGundlach lashes Fed's 'incredible fiscal lending' during coronavirus collapse—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}