{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-22-2020-222239114.html", "published": 1595430800.0, "headline": "Stock market news live updates: Stocks mostly higher despite US-China tensions; Pfizer leads Dow higher", "body": "Stocks rose Wednesday, shaking off earlier concerns as tensions appeared to flare again between the US and China. Pfizer led gains in the 30-stock Dow after the drugmaker and a partner announced a near $2 billion agreement with the US government over their Covid-19 vaccine candidate. And investors also digested a batch of corporate earnings results, and eyed a rocky start to talks over another round of coronavirus-related fiscal stimulus in Washington.China on Wednesday condemned the US decision to order the closure of China’s consulate in Houston, which the US State Department said was a move to “protect American intellectual property and American’s private information,” State Department spokesperson Morgan Ortagus said in an email.This came as relations with the US and China were tested further amid the coronavirus pandemic. The US Justice Department on Tuesday accused two Chinese hackers of attempting to steal data including US research on Covid-19 vaccines on behalf of the Chinese government.China vowed to retaliate against the forced consulate closure. China’s Foreign Ministry spokesperson Wang Wenbin said in a briefing Wednesday that China intended to “react with firm countermeasures” if the decision was not revoked, according to a Bloomberg report of the briefing.The developments sent global equities and contracts on the S&P 500 and Dow lower Wednesday morning in New York, and both indices fell modestly as markets opened. The Nasdaq held slightly higher, paring some losses from the prior session.Internet companies including Facebook (FB) and Pinterest (PINS) extended losses, falling in sympathy with Snap (SNAP) after the social media company reported a smaller than expected increase in second-quarter daily active user numbers after market close on Tuesday. The results tempered investor expectations for the massive growth tech stocks demonstrated in the first quarter to continue at the same rate the rest of the year. Last week, Netflix (NFLX) had topped expectations for net subscriber additions in the second quarter, but disappointed sharply to the downside for third-quarter guidance.Story continuesOn Wednesday, more major tech companies are set to report quarterly results, with Microsoft and Tesla set to be among the most highly anticipated. Many Wall Street analysts expect to see Microsoft (MSFT) post another strong quarter of growth especially in Azure, its cloud unit, as many companies kept working remotely during the quarter and leaned on cloud services for day-to-day operations. And Tesla (TSLA) is set to be eligible for consideration for inclusion in the S&P 500 if it ekes out a GAAP profit in its second quarter, which would mark a fourth straight quarter of GAAP profitability. Shares of both Microsoft and Tesla rose in late trading.Investors also continued to monitor developments in Washington, with debates over another round of fiscal stimulus under way. The White House and Senate Republicans hit impasses on Tuesday, with the two sides sparring over whether or not to include a payroll tax cut, as President Donald Trump has demanded, or add more money for testing and to the Centers for Disease Control and Prevention, among other points of contention.Treasury Secretary and White House Chief of Staff Mark Meadows told Bloomberg they are aiming to get a package through Congress by the end of next week, or the time at which current measures including the $600 per week in additional federal unemployment benefits are set to end. Senate Majority Leader Mitch McConnell, however, was less certain on a deal passing the end of next week, according to Politico.Wednesday afternoon, CNBC reported that Republican lawmakers are considering extending the boosted unemployment benefits at a reduced $100 per week through December, down from the $600 offered previously.—4:03 p.m. ET: S&P 500 closes at 5-month high, Dow adds 165 points or 0.6% as Pfizer jumps after vaccine dealHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +18.75 (+0.58%) to 3,276.05Dow (^DJI): +165.47 (+0.62%) to 27,005.87Nasdaq (^IXIC): +25.76 (+0.24%) to 10,706.13Crude (CL=F): -$0.09 (-0.21%) to $41.83 a barrelGold (GC=F): +$23.80 (+1.29%) to $1,867.70 per ounce10-year Treasury (^TNX): -1.2 bps to yield 0.5950%—12:44 p.m. ET: Stocks push higher in afternoon tradingHere were the main moves in markets, as of 12:44 p.m. ET:S&P 500 (^GSPC): +8.35 points (+0.26%) to 3,265.65Dow (^DJI): +69.77 points (+0.26%) to 26,910.07Nasdaq (^IXIC): +4.14 points (+0.04%) to 10,684.51Crude (CL=F): flat at $41.92 per barrelGold (GC=F): +$26.50 (+1.44%) to $1,870.40 per ounce10-year Treasury (^TNX): -2.1 bps to yield 0.586%—11:20 a.m. ET: Stocks little changed as session rolls onThe S&P 500 and Nasdaq each fell slightly as Wednesday’s session continued. A more than 3% gain in shares of Pfizer led the Dow higher, after the pharmaceutical company announced a $1.95 billion deal to deliver 100 million doses of its Covid-19 vaccine candidate with BioNTech to the US government. Shares of Dow components McDonald’s and IBM each also rose more than 2% intraday.The real estate sector led gains in the S&P 500, after new data Wednesday morning showed a record gain in existing-home sales last month. Industrials and utilities also advanced, while the energy sector lagged after rallying a day earlier. Crude oil futures for September delivery fell 1% to below $42 per barrel, reversing some of Tuesday’s advance.—10:00 a.m. ET: Existing home sales jump by a record as housing market recovery continuesExisting home sales surged 20.7% in June over May to a seasonally adjusted annual rate of 4.72 million, the National Association of Realtors said Wednesday. The jump marked the largest month on month gain recorded in the data series, but was slightly short of the 21.4% advance consensus economists expected, according to Bloomberg data.“The sales recovery is strong, as buyers were eager to purchase homes and properties that they had been eyeing during the shutdown,” Lawrence Yun, NAR’s chief economist, said in a statement. “This revitalization looks to be sustainable for many months ahead as long as mortgage rates remain low and job gains continue.”—9:32 a.m. ET: Stocks hug the flat lineHere were the main moves in markets as of 9:32 a.m. ET:S&P 500 (^GSPC): +1.15 points (+0.04%) to 3,258.45Dow (^DJI): -10.34 points (-0.04%) to 26,830.06Nasdaq (^IXIC): +37.54 points (+0.35%) to 10,717.92Crude (CL=F): -$0.57 (-1.36%) to $41.35 a barrelGold (GC=F): +$4.10 (+0.22%) to $1,848.00 per ounce10-year Treasury (^TNX): -2.1 bps to yield 0.586%—7:31 a.m. ET: Pfizer, BioNTech set to receive nearly $2 billion in pact with US to deliver 100 million doses of Covid-19 vaccineThe US government has offered Pfizer (PFE) and BioNTech (BNTX) $1.95 billion in an initial order for 100 million doses of the companies’ Covid-19 vaccine candidate, according to a statement from the companies Wednesday morning. The US government can also acquire up to another 500 million doses of the inoculation, it added.“Pfizer and BioNTech remain on track to begin an anticipated Phase 2b/3 safety and efficacy trial later this month, seek regulatory review as early as October 2020, and manufacture globally up to 100 million doses by the end of 2020 and potentially more than 1.3 billion doses by the end of 2021,” according to the statement.Shares of Pfizer jumped more than 5% in early trading following the announcement, and shares of BioNTech jumped 7.7%.—7:26 a.m. ET Wednesday: Stock futures mixed as China tensions riseHere were the main moves in markets, as of 7:26 a.m. ET:S&P 500 futures (ES=F): 3,244.5, up 6.75 points or 0.21%Dow futures (YM=F): 26,653.00, down 73 points, or 0.27%Nasdaq futures (NQ=F): 10,872.00, up 21 points, or 0.19%Crude (CL=F): -$0.55 (-1.31%) to $41.37 a barrelGold (GC=F): +$14.70 (+0.8%) to $1,858.60 per ounce10-year Treasury (^TNX): -1.6 bps to yield 0.591%—6:08 p.m. ET Tuesday: Stock futures open little changedHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:08 p.m. ET:S&P 500 futures (ES=F): 3,249.5, down 1.75 points or 0.05%Dow futures (YM=F): 26,717.00, down 9 points, or 0.03%Nasdaq futures (NQ=F): 10,847.00, down 4 points, or 0.04%NEW YORK, NEW YORK - MAY 26: A trader walks by the New York Stock Exchange (NYSE) on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}