{"article": [{"url": "https://finance.yahoo.com/news/blue-ivy-makes-many-stunning-142000434.html", "published": 1596187700.0, "headline": "Blue Ivy Makes So Many Stunning Cameos in 'Black Is King'", "body": "Photo credit: DisneyFrom Marie ClaireBeyoncé's oldest daughter, Blue Ivy Carter, makes multiple cameos in the superstar's new visual album, Black Is King.The singer appeared on Good Morning America on Thursday to talk about the conception of the project and what the phrase, \"Black Is King,\" means to her.Beyoncé's visual album, Black Is King, has officially arrived on Disney+, and to our delightful surprise, her daughter Blue Ivy Carter makes more than one special appearance throughout the stunning work.The eight-year-old doesn't sit passively in the background. She spins in an aerial hoop wearing a sequined leotard and glitter eye shadow; she plays with her mother and poses with her grandmother Tina Knowles-Lawson and younger sister, Rumi Carter; she mimics Beyoncé's dance moves.Photo credit: DisneyPhoto credit: DisneyPhoto credit: DisneyPhoto credit: DisneyBlue even takes the spotlight during her solo in \"Brown Skin Girl,\" which earned the young star her first BET Award (an honor she shares with Bey, WizKid, and Saint Jhn). She's also in the final act, \"Spirit,\" which uses the same footage from Beyoncé's music video that debuted last year ahead of The Lion King's release.Photo credit: DisneyViewers gushed over the little one's impressive surprise appearances, and rightfully so.blue ivy winning the best supporting actress oscar me thinks #BlackIsKing pic.twitter.com/9VPWQubz2w— aiden (@aidensghostin) July 31, 2020Me every time Blue Ivy came on my screen #BlackIsKing pic.twitter.com/8bNq5CqT7W— yoncemyname (@YonceMy) July 31, 2020BEYONCÉ & BLUE IVY in “my power” legendary pic.twitter.com/4547oA0cXP— Niamh🥀 (Fan Acc) (@msyonceslay) July 31, 2020The eight-year-old made a blink-and-you'll-miss-it appearance in a trailer for the project shared to Beyoncé's Instagram late yesterday. In the clip, Blue can be seen in the sweetest princess attire, wearing an off-the-shoulder, cream-colored ball gown with a pearl-strand necklace and gold shell-adorned tiara. Her hair is pulled back into a bun, and she's rocking a glamorous red lip.Story continuesBlue is just one of a slew of high-profile cameos featured in Black Is King. Naomi Campbell, Lupita Nyong'o, Kelly Rowland, and Pharrell, as well as Beyoncé's husband, Jay-Z, and her mother, Tina Knowles Lawson, all make appearances. The superstar shared more insight into the creation of her latest endeavor during a recorded message for Good Morning America today.EXCLUSIVE: A special message from @Beyonce with never-before-seen footage from #BlackIsKing! The visual album streams TOMORROW exclusively on @DisneyPlus. pic.twitter.com/tPFC9gGY9o— Good Morning America (@GMA) July 30, 2020\"Black Is King is finally here! Now I'm so excited you guys get to watch it tonight on Disney+. It's been a year in the making,\" said Beyoncé during her video message. \"I worked with a diverse group of very gifted directors and actors and creatives from all over the world to reimagine the story of The Lion King. The narrative unfolds through music videos, fashion, dance, beautiful natural settings, and raw new talent, but it all started in my backyard.\"Beyoncé also explained what the phrase \"Black Is King\" means to her and the film at large. \"So from my house to Johannesburg to Ghana to London to Belgium to the Grand Canyon—it was truly a journey to bring this film to life,\" she said. \"And my hope for this film is that it shifts the global perception of the word black, which has always meant inspiration and love and strength and beauty to me. Black Is King means 'black is regal and rich in history, in purpose, and in language.' I hope you all love it, I hope you enjoy it, and I hope y'all see it tonight.\"Catch Blue, and so many other celebrities, in the full visual album, now streaming on Disney+.You Might Also LikeThe 5 Best SPF-Filled Moisturizers I Promise Don’t SuckThe 5 Best Self-Tanners That Will Never, Ever, Ever StreakDo Those Jade Rollers Really Work, or Are They Just Pretty?"}]}