{"article": [{"url": "https://finance.yahoo.com/news/case-for-more-fiscal-stimulus-clearer-than-ever-morning-brief-100751703.html", "published": 1594271720.0, "headline": "The case for more fiscal stimulus is clearer than ever: Morning Brief", "body": "Thursday, July 9, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeSending people money works, and the economy is slowing down again.At the end of the month, the U.S. economy faces a critical juncture.Enhanced unemployment insurance that puts an additional $600 in the pockets of those out of work each week is set to expire. These payments, combined with a $1,200 check for those making less than $75,000 with an additional $500 for each child, were a key part of the first round of stimulus passed in March.A package that has helped the economy through one of its darkest periods in modern history.On Tuesday, the economics team at Deutsche Bank led by Brett Ryan said in a note to clients that, “Buoyed by massive fiscal support, consumer spending through May has modestly outperformed expectations, presenting some upside risks to our Q2 and second half spending forecasts.“However, with virus growth rates ticking back up in about three quarters of US states and reopening of activity being rolled back, the outlook for H2 spending remains highly uncertain.”In its note, the firm highlighted the following chart, which shows a sharp rebound in spending for consumers in the lowest quartile of earners.Spending for workers in the lowest quartile of income has recovered to nearly pre-pandemic levels due to fiscal support from Congress. Keeping unemployment and stimulus payments flowing to these consumers will be key to helping the recovery weather an uptick in COVID cases. (Source: Deutsche Bank)“Despite the disproportionate impact on lower income employment, consumption for this group has held up remarkably well, a testament to the fiscal response,” Deutsche Bank said.In late June, Treasury Secretary Steven Mnuchin said the Trump administration is \"very seriously considering\" another stimulus bill that could pass this month. Data on consumer spending alone makes a strong case for extending support to households in the months ahead. But the recent surge in COVID cases and signs of a slowdown in real-time measures of economic activity makes the situation even more urgent.\"The high-frequency data suggest renewed fears about the coronavirus are starting to weigh on consumption even in states that haven’t moved to reimpose restrictions, reinforcing our view that the pace of the economic recovery will slow over the next few months,\" said Andrew Hunter, senior U.S. economist at Capital Economics.Story continuesHunter notes that OpenTable data — which we flagged in the Morning Brief two weeks back — and foot traffic at retail locations show a noted slowdown in economic activity, while polling shows a recent uptick in consumer fears about contracting the virus.On Wednesday, Renaissance Macro flagged data from Homebase which points to softening demand for hourly workers in several key sectors.Earlier this week, we flagged commentary from Neil Dutta that outlined why the markets have continued pushing higher in spite of this downturn in economic and public health data. The Nasdaq closed at a record high on Wednesday.Progress being undone. Homebase data is not looking too good. Hourly employees down across the board. We're using a 7-day average here to smooth out some seasonal volatility. Data goes through July 7. pic.twitter.com/XEZgTgBNge— RenMac: Renaissance Macro Research (@RenMacLLC) July 8, 2020Also on Wednesday, the team at Oxford Economics published their latest recovery tracker index which ran through the week ending June 26, with this index falling for the second time in three weeks.“Five of the six tracker dimensions increased, but the weekly gains were all smaller than in the week prior, and they were offset by the sharpest plunge in the health index since early April,” said Gregory Daco, chief U.S. economist at Oxford Economics.Reminding us once again of the refrain from Fed Chair Jerome Powell that must not be forgotten during this crisis — the virus determines the shape of the recovery.Without successful containment of the coronavirus' spread there will not be a robust, extended economic rebound as current data are showing.And in the interim, Congress must do all it can to help consumers and businesses get to the other side.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Initial Jobless Claims, week ending July 4 (1.375 million expected, 1.427 million prior); Continuing Claims, week ending June 27 (18.75 million expected, 19.29 million prior)9:45 a.m. ET: Bloomberg Consumer Comfort, week ending July 5 (43.3 prior)10 a.m. ET: Wholesale Inventories month-on-month, May final (-1.2% expected, -1.2% prior)EarningsPre-market7 a.m. ET: Walgreens Boots Alliance (WBA) is expected to report adjusted earnings of $1.17 per share on $34.45 billion in revenueREAD MORETop NewsEuropean stocks mixed ahead of meeting of eurozone ministers [Yahoo Finance UK]Gilead begins testing inhalable form of remdisivir for COVID-19 [Reuters]Buffett dropping down world’s richest ranks as tech titans surge [Bloomberg]Tesla 'very close' to level 5 autonomous driving technology, Musk says [Reuters]YAHOO FINANCE HIGHLIGHTSWhat Biden would do about Trump’s China tariffsHarvard and MIT sue ICE over new visa guidelines for international students Facebook is operating like a public utility and has 'huge blind spots': NAACP CEO—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}