{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-october-3-2020-164918818.html", "published": 1602142760.0, "headline": "Jobless claims: Another 840,000 Americans filed new unemployment claims last week", "body": "U.S. states saw another 840,000 jobless claims filed last week, as the number of Americans applying for first-time unemployment insurance benefits each week continues to hover at a historically high level.The U.S. Department of Labor (DOL) released its weekly jobless claims report at 8:30 a.m. ET Thursday. Here were the main metrics from the report, compared to Bloomberg estimates:Initial jobless claims, week ended Oct. 3: 840,000 vs. 820,000 expected and 849,000 during the prior weekContinuing claims, week ended Sept. 26: 10.976 million vs. 11.4 million expected and 11.979 million during the prior weekNew weekly unemployment insurance claims have held below the psychologically important 1 million mark for the past six consecutive weeks, but have so far failed to break below 800,000 since the start of the pandemic. At 840,000 last week’s new claims remained at a level still handily above the pre-pandemic record high of 695,000 from 1982.The past two weeks’ jobless claims totals have also been flattered by an absence of updated new claims out of California. The state – which has consistently been one of the biggest contributors to new weekly claims – announced last week it was taking a two-week pause in processing initial claims to “reduce its claims processing backlog and implement fraud prevention technology,” according to the Labor Department’s statement.Jobless claims have remained historically high over the course of the pandemic (David Foster/Yahoo Finance)Across all programs, the total number of jobless claims decreased for the week ending Sept. 19. Total claims came in at 25.5 million, down from the about 26.5 million during the previous week, as a smaller number of self-employed or gig workers not eligible for regular state programs claimed Pandemic Unemployment Assistance. But the number of workers collecting benefits through the Pandemic Emergency Unemployment Compensation Program – which offers an extra 13 weeks’ worth of federal benefits to those who had exhausted previous state or federal compensation – rose by 154,000 to 1.96 million.Story continuesContinuing jobless claims, which are reported on a one-week lag and represent the total number of individuals still receiving state unemployment benefits, continued their gradual downtrend last week. But as with new jobless claims, continuing claims have held well above pre-pandemic levels, and have not broken below the 10 million mark in more than 6 months.“Net, initial filings fell less than expected last week. The improvement in continuing claims is reflecting people being hired but also individuals exhausting their benefits,” Rubeela Farooqi, chief economist for High Frequency Economics, said in an email. “Overall, the signal from the claims data is still one of ongoing weak conditions in the labor market. Even as filings are declining, levels remain extraordinarily high. Employment growth has already slowed and without fiscal support that protected jobs, risks are skewed to the downside for payrolls going forward.”The latest jobless claims report comes amid dimming hopes for another round of virus relief measures out of Congress, despite increasingly urgent calls from Federal Reserve officials for more fiscal stimulus to support individual Americans more directly.President Donald Trump said Tuesday he had asked his negotiators to halt further stimulus talks until after the election, but added that he would support standalone measures providing tens of billions of dollars for airline payroll support and the Paycheck Protection Program. House Democrats, however, have previously balked at the notion of passing slimmed down versions of a stimulus package – meaning the prospect of further fiscal stimulus in the next month remains unlikely.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}