{"article": [{"url": "https://finance.yahoo.com/news/nvidia-rtx-3090-graphics-cards-164732192.html", "published": 1598961320.0, "headline": "Nvidia debuts latest RTX 3000 series graphics cards, including high-powered RTX 3090", "body": "Nvidia (NVDA) debuted its newest high-powered consumer graphics cards on Tuesday, with performance that easily outpaces its last generation devices, the company said.The new cards, part of the firm's RTX line, include the RTX 3070, RTX 3080, and the outrageously powerful RTX 3090. Available in October, the cards will vary in price, with the RTX 3070 standing as the entry-level option at $499, the RTX 3080 sitting in the middle at $699, and the RTX 3090 ranking atop the rest at $1,499.The new graphics cards are powered by Nvidia's Ampere architecture, marking the first time that the platform has been used in consumer-level cards. The company promises that means big performance improvements over its prior generation options.Nvidia's new RTX 3000 cards are the companies latest and greatest consumer graphics processors, promising dramatically improved speeds and performance. (Image: Nvidia)Graphics cards are essential for PC gamers, providing the backbone for all of the photorealistic on-screen effects that make today's games look so impressive. With its first RTX line of cards, Nvidia began implementing true-to-life lighting effects via what's known as ray-tracing technology, and the RTX 3000 series builds on that. What’s more, the company is bringing the tech to the incredibly popular game “Fortnite,” giving gamers more of a reason to upgrade to the latest chips.Epic's 'Fortnite' is getting the Nvidia RTX lighting treatment. (Image: Nvidia)In terms of performance, Nvidia says the RTX 3070 is faster than its RTX 2080 Ti, despite the fact that the 2080 Ti costs well over $1,000, and is 60% faster than the RTX 2070. The RTX 3070 comes with 8GB of GDDR6 RAM, and can handle running games at resolutions as high as 4K.The RTX 3080, meanwhile, gets 10GB of GDDR6X RAM, which Nvidia says is the fastest discrete graphics memory in the world. The card, according to the company, is 2x as fast as the RTX 2080, and will let gamers play games at 4K resolutions and 60 frames per second. That's quite a feat, and something that would have been unthinkable just a few years ago.Then there's the monster of the group: the RTX 3090. This is the card you get if you want to play games at the highest settings, handle heavy-duty content creation, or, alternatively, operate some kind of Bond villain-style weather-control device.Story continuesThat card, according to Nvidia, is 50% faster than the monstrous TITAN RTX card, and will let players run games at 8K resolutions and 60 frames per second.Nvidia's graphics chips have been the company's main source of revenue for years, but with the realization that graphics processors can be used to handle large workloads like those needed for artificial intelligence, such chips have made their way into high-end servers run by some of the biggest tech names in the world.That, in turn, has led to an increase in Nvidia's data center revenue, which, for the first time, surpassed gaming revenue in Q2 2020. In that quarter, the data center side brought in $1.75 billion in revenue, while the gaming business saw $1.65 billion in revenue. In the prior quarter, the company saw $1.14 billion in data center revenue and $1.34 in gaming revenue.We'll have to see if that remains a trend moving forward as Nvidia continues to see impressive growth.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Samsung’s Galaxy Z Fold2 5G could be the first foldable phone you want, if you can afford itApple’s stock split: How shares are performingSamsung’s Galaxy Note20 Ultra is absurdly large and expensive, but worth it for the power and stylusMicrosoft adds transcription to Microsoft 365 productivity suiteFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}