{"article": [{"url": "https://finance.yahoo.com/news/apple-fortnite-epic-app-store-172404019.html", "published": 1597840340.0, "headline": "Apple faces an App Store reckoning amid gaming and tech uprising", "body": "Apple and Google on August 13, 2020 pulled video game sensation 'Fortnite' from their mobile app shops after its maker Epic Games released an update that dodges revenue sharing with the tech giants. (Photo by Chris DELMAS / AFP) (Photo by CHRIS DELMAS/AFP via Getty Images)Epic Games, maker of the wildly popular “Fortnite,” is at war with Apple (AAPL) and Google (GOOG, GOOGL). It fired its first shots by giving gamers the ability to make in-app purchases directly from its “Fortnite” apps at a reduced price, circumventing Apple’s and Google’s payment systems, ducking the 30% commissions the companies charge for digital purchases.Apple and Google responded by pulling “Fortnite” from their respective app stores, and Epic, in turn, filed a pair of lawsuits seeking injunctions that would prohibit Apple and Google from blocking “Fortnite” and Epic’s other apps from either store.Epic’s move hits both Apple and Google, but its attack on Apple was more highly orchestrated. Not only did the company release a digital short skewering Apple via a remake of its famous “1984” ad for the Macintosh, but it also timed the suit to land less than a month after Apple CEO Tim Cook appeared before the House Judiciary Committee to defend his company against claims that it abuses the App Store’s market power to force developers to pay that 30% commission.Apple isn’t backing down though, because any damage Epic might do to its App Store could have severe ramifications for one of the company’s biggest money makers: its Services business.The App Store is essential to Apple’s growthThe App Store is a multi-billion revenue source for Apple. It’s also a major part of the firm’s Services business, which it increasingly relies on, along its Wearables business, to prove it’s not just an iPhone factory. It’s also part of the reason the company’s market value reached $2 trillion on Wednesday.[Read more: Apple’s now worth $2 trillion]In Apple’s fiscal Q3 2020, the Services business pulled in $13.16 billion, putting it second only to the company’s iPhone business, which saw revenue of $26.42 billion in the quarter. The Wearables, iPad, and Mac businesses all brought in revenue of between $7 billion and $6 billion.Epic Games took a shot at Apple by parodying its famous Macintosh commercial. (Image: Epic)Apple doesn’t separate its App Store revenue from the rest of its Services revenue, which includes things like Apple Care and subscriptions to services like Apple Music and iCloud, but a prior estimate from CNBC put revenue at about $50 billion in 2019, and TechCrunch reported that the company saw as much as $1.42 billion in revenue in the week between Christmas 2019 and New Years 2020.Story continuesAn Epic battleEpic’s beef with Apple stems from the fact that Apple operates its iOS operating system as a “walled garden,” meaning the company controls how and what kind of apps are available for your iPhone or iPad. Google, meanwhile, gives Android users the ability to install apps from third-party app stores. Though using those can be difficult for less tech savvy consumers.According to University of Pennsylvania Carey Law School professor Herbert Hovenkamp, Apple’s App Store policies amount to what’s known as “exclusive dealing,” which ensures developers have to pay that 30% commission if they want to get access to Apple’s customers.“That, I think, is a viable antitrust claim if you state it that way. And I think Apple has some serious exposure mainly because it would be pretty easy for Apple to fix, which is to permit other app stores to locate on the Macintosh or iPhone platform,” Hovenkamp explained.“There’s nothing wrong with the 30% commission. The problem is where the agreement says you have to make all of your sales with us so we get to collect this 30% commission on all of them. And if a plaintiff can prove that, then that sounds to me like a viable exclusive dealing claim.”Apple regularly points to the fact that developers can always run web apps through a browser like Safari rather than operating native apps. But native iOS apps provide far better user experiences versus web applications.Apple isn’t backing down, either. In a statement to Yahoo Finance, a spokesperson said Epic can get “Fortnite” back into the App Store by simply removing the ability of consumers to pay the gaming company directly from within the app.“We won’t make an exception for Epic because we don’t think it’s right to put their business interests ahead of the guidelines that protect our customers,” the spokesperson said.Google, meanwhile, told Yahoo Finance through a spokesperson that while Android lets developers use multiple app stores, they still have to follow Google’s rules if they want their apps to appear in the Play Store.Epic gave customers the option of paying via its own service at a reduced price, or by using Apple or Google's payment platforms. The game was then banned from the companies' respective app stores. (Image: Epic)“While ‘Fortnite’ remains available on Android, we can no longer make it available on Play because it violates our policies. However, we welcome the opportunity to continue our discussions with Epic and bring ‘Fortnite’ back to Google Play,” the spokesperson said.It’s important to note that iOS users are generally more willing to spend on apps than Android users, which incentivizes developers to want to work with Apple.If Apple opened up iOS to other app stores, as Epic proposes, the company would have to contend with competition from those third-party stores. And if those stores are able to undercut Apple’s pricing, it would eat into Services revenue, something the company has made a major focus since Cook’s 2017 promise to double the business’s revenue by 2020. Apple reached that goal by the end of 2019.Epic isn’t Apple’s only problemEpic’s lawsuit comes as state attorneys general, the Department of Justice, and the House Judiciary Committee’s Subcommittee on Antitrust, Commercial, and Administrative Law investigate claims that the App Store functions as an illegal monopoly.It’s also one of several high-profile tech companies that have filed complaints about or publicly indicated their distaste for Apple’s App Store policies.Spotify has repeatedly challenged Apple’s App Store guidelines, saying that it’s unfair that Spotify has to pay a 30% commission on app purchases, while Apple is able to offer its own competing service in Apple Music without having to pay such a fee.And more recently, Microsoft (MSFT) and Facebook (FB) have gone after Apple for not allowing them to operate their Project xCloud cloud gaming and Facebook Gaming apps, respectively. Both of those companies used language in their responses to Apple that would pique the interest of antitrust investigators, with phrases pointing to harm to consumers and an arbitrary application of App Store rules.Apple, for its part, has maintained that it treats all App Store apps equally, and that it offers a host of important services to developers including access to tools and assistance in ensuring apps function properly with Apple devices.Apple’s antitrust issues are unlikely to end in the company being split up, experts say. However, it could end up having to let developers install their apps on Apple devices outside of the App Store, or allow for additional app stores to be made available on the iPhone. And the firm may need to prepare for that eventuality.More from Dan:Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.Apple is now worth $2 trillionSamsung’s Galaxy Buds Live offer premium earbud features without the priceMicrosoft’s Surface Duo dual-screen smartphone coming Sept. 10 for $1,399Free time and ‘Fortnite’: How coronavirus changed video game industry foreverFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}