{"article": [{"url": "https://finance.yahoo.com/news/tik-tok-deal-doesnt-make-sense-for-oracle-beyond-politics-analysts-say-185640712.html", "published": 1600092260.0, "headline": "TikTok deal doesn't make sense for Oracle beyond politics, analysts say", "body": "On the day before President Trump’s Sept. 15 deadline for ByteDance to sell off TikTok in the U.S. or shut the app down, Oracle (ORCL) appeared to beat out Microsoft (MSFT) for the prize.The enterprise software and cloud-computing company confirmed on Monday that it is part of ByteDance’s proposal to U.S. regulators—but the proposal is for a partnership, not an outright sale. Chinese media had reported over the weekend that ByteDance would aim not to fully sell TikTok's US. operations to Microsoft or Oracle, in an attempt to retain partial control. The subtext of the partnership is that Oracle won’t get control of TikTok’s user algorithm, which was seen as the crown jewel of any deal.(In its statement to Yahoo Finance on the news on Monday, TikTok said: “We can confirm that we’ve submitted a proposal to the Treasury Department which we believe would resolve the Administration’s security concerns. This proposal would enable us to continue supporting our community of 100 million people in the US who love TikTok for connection and entertainment, as well as the hundreds of thousands of small business owners and creators who rely upon TikTok to grow their livelihoods and build meaningful careers.”)The proposal will still need approval from the White House.Walmart (WMT), meanwhile, which had reportedly joined the bidding war, would still like to invest in TikTok with Oracle as the lead, Reuters reports.None of the three names that were in the mix over the past few weeks—Microsoft, Oracle, or Walmart—was an obvious fit to buy TikTok.Microsoft does not own any consumer-facing social media apps apart from LinkedIn, which is more of a professional platform and is a far cry from video-sharing apps like Facebook, Instagram, Twitter, Snapchat, and YouTube; Oracle is not in the content or social media business in any form; Walmart is a giant retailer that has not tried social tech apart from its video-streaming platform Vudu. At least in Walmart’s case, analysts could see how owning TikTok might allow Walmart to use TikTok affiliate links and sponsored influencer posts to boost its e-commerce presence.Story continuesAnd now that Oracle is confirming that it has won, analysts still aren’t seeing the logic.Oracle co-founder and Chairman Larry Ellison delivers a keynote address during the Oracle OpenWorld on October 22, 2018 in San Francisco, California. (Photo by Justin Sullivan/Getty Images)“We can’t find a sound rationale for Oracle to focus on TikTok,” wrote Citi analyst Walter Pritchard in a note on Monday. He added the TikTok partnership “isn’t likely to change the competitiveness of Oracle in cloud, and might even weigh on the business due to the “financial resources” the partnership will require.A note from Bank of America on Monday predicted that the deal “may cause an overhang on the stock in the near-term given Oracle's limited experience in consumer media.”“It's a head-scratcher in terms of the strategic merits for Oracle,” Wedbush analyst Dan Ives told Yahoo Finance by phone on Monday. The idea of a partnership rather than full sale, Ives said, “makes it a single, whereas a home run would have been an acquisition. But it's a feather in the cap for [Oracle founder] Larry Ellison in terms of being a partner of the government, coming off the heels of Microsoft winning the JEDI contract. For Oracle, it's actually less about the TikTok partnership and more about the broader ramifications, for a company fighting AWS tooth and nail.”Indeed, the political symbolism of Oracle getting the partnership could be a branding win for Oracle among cloud competitors. And Ellison’s friendship with President Trump is one potential explanation for Oracle’s interest.The Silicon Valley billionaire held a fundraiser for Trump’s reelection campaign in February, and when news of Oracle’s bid for TikTok came out last month, Trump commented at an event in Arizona, “Oracle is a great company. I think its owner is a tremendous guy. He’s a tremendous person. I think that Oracle would be certainly somebody that could handle it.” Oracle CEO Safra Catz is also a Trump supporter.Ives also believes Oracle’s involvement as a “Big Brother, making sure there’s no back door to Beijing” could satisfy the White House’s security concerns.On the other hand, former White House CIO Theresa Payton (who was the first woman to hold that role, in 2006) does not believe a partnership with Oracle would really satisfy Trump’s stated security concerns about the app. “Unless Oracle has access to TikTok’s source code, including their A.I. algorithm, and a direct role in controlling American users’ data privacy, this deal does not quell any national security concerns put forth by the Trump administration,” Payton, now CEO of Fortalice Solutions, tells Yahoo Finance. “Oracle acting as a hall monitor for data simply isn’t good enough.”—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers tech. Follow him on Twitter at @readDanwrite.Read more:Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’What you need to know about unicorn Ant Financial, potentially the largest IPO in historyAirbnb has been brutalized by the pandemic, but will IPO anyway in 'forgiving' marketUber Eats is bigger business than Uber rides right now, but far from profitableEtsy CEO on huge Q2: Etsy is 'becoming much more mainstream'Facebook ad boycott is ‘more noise than fundamental risk’"}]}