{"article": [{"url": "https://finance.yahoo.com/news/senate-efforts-lower-leverage-requirements-small-large-banks-201709628.html", "published": 1597245920.0, "headline": "Senate efforts to slip in lower leverage requirements brushed off by small, large banks", "body": "As Washington continues to scramble together a second coronavirus relief package, policymakers are jostling over whether or not to slip in a legislative change that would give bank regulators the power to temporarily lower bank capital requirements as COVID-19 continues to grip the country.Proponents of the change, which includes the top regulator at the Federal Reserve itself, argue that the change would push the banking industry to amp up lending and support the economy. But banks - large and small - have downplayed the importance of changing the rules.“The sector’s success in this task is a matter of national urgency, and in my view, congressional action to improve regulatory flexibility to respond would only help achieve it,” Fed Vice Chairman of Supervision Randal Quarles wrote in an April 22 letter to the Senate Banking Committee’s chairman and top Republican, Mike Crapo.Chairman, US Senator Mike Crapo, (R-ID), speaks during a Senate Banking, Housing, and Urban Affairs Committee nominations hearing on Capitol Hill in Washington, DC on May 5, 2020. (Photo by Salwan Georges / POOL / AFP) (Photo by SALWAN GEORGES/POOL/AFP via Getty Images)The change concerns a metric known as the “leverage ratio,” which broadly measures the amount of non-liability assets that a bank holds (a.k.a. capital) relative to its entire balance sheet. A higher leverage ratio suggests that a given bank is better positioned to sustain potential losses than another bank with a comparably lower leverage ratio.Crapo, with nudging from the Fed vice chairman, is now floating legislative text that would empower the Fed to skirt a Dodd-Frank component known as the “Collins Amendment” to temporarily ease its regulatory approach to minimum ratios.But banks of all sizes have insisted that they have plenty of capital to lend without the regulatory help, raising questions over whether or not loosening key regulations will have the desired impact of spurring lending.Leverage RatioAn experiment on the effect of loosening the leverage ratio is already playing out at the country’s four largest banks - JPMorgan Chase (JPM), Bank of America (BAC), Citigroup (C), and Wells Fargo (WFC).All four banks face an additional, more stringent leverage requirement called the “supplementary leverage ratio.” Responding to the COVID-19 pandemic, the Fed in April eased its calculation of the SLR through March 31 next year to “increase banking organizations' ability to provide credit to households and businesses.”Story continuesThe SLR is calculated as Tier 1 capital (a standardized definition of bank capital) divided by total leverage exposure, which accounts for a bank’s total balance sheet in addition to any hidden “off-balance sheet” exposures like derivatives and repurchase agreements.The Fed allowed the largest banks to simply not count U.S. Treasuries or deposits at the Federal Reserve towards leverage exposure, boosting the SLRs at all four banks.By reducing the calculation of the total leverage exposure (the denominator of the SLR), all four big banks were able to increase their SLRs in the second quarter. (Credit: David Foster / Yahoo Finance)Quarles has said the change is designed to accommodate the flood of U.S. Treasuries and bank reserves that the private sector has had to absorb as the Fed ballooned its balance sheet to $7 trillion.“If adjustments aren't made to those capital constraints, then the influx of those safe assets will ultimately cause them to have to turn away customers,” Quarles told Congress May 12.The country’s largest bank, JPMorgan Chase, says it will not use temporary buffers, insisting that the bank has enough capital without the relief.“Temporary is a funny thing when you go into a crisis,” JPMorgan Chase CEO Jamie Dimon told investors July 14. “I mean you could use it for a while, but it disappears...so my view is we shouldn't rely on anything like that.”Lending?Small banks face a “community bank leverage ratio” that cannot be adjusted as the SLR was, due to the statutory limitation in the Collins Amendment.But even without further regulatory relief, small banks have outpaced their larger peers in extending credit. Based on Federal Reserve data, year-over-year growth in loan portfolios at the largest 25 banks peaked at about 9% in April but have since come back down.For comparison, small banks (the universe of banks outside the top 25) have supported loan portfolios 13-14% larger than those same portfolios were last year.Small banks grew their loan portfolios more than the largest banks did. Small banks (those not in the top 25) are a major provider of credit; as of June, 38% of the $10.6 trillion in U.S. loans and leases sit on the balance sheets of these small banks based on Federal Reserve data. (Credit: David Foster / Yahoo Finance)“I don’t get the sense that many or any banks aren’t lending now because of a lack of capital,” said Patrick Ryan, the CEO of First Bank, a New Jersey-based community bank with $2.3 billion in total assets. “To the extent that folks aren’t lending, it’s more risk aversion than lack of capital.”Banks across the board are pulling back. A recent Federal Reserve survey of loan officers detailed tighter underwriting standards across all types of commercial and household loans during the second quarter. But the problem is also a lack of interest in borrowing; families have paid down debt and businesses are weary of taking out more loans with so much uncertainty about the future.At superregional bank M&T, CFO Darren King told analysts on July 23 that “we've definitely seen a slowdown in demand.”For now, the banks have messaged that they are confident they will be able to meet credit needs - with or without the legislative change.That approach could save them from the political drama unfolding in DC. As originally reported by The New York Times, Republican Senator Susan Collins - the author of the Collins Amendment - has proposed striking the Crapo bill’s language that would allow the Fed to temporarily ease the leverage ratio.A Democratic-led House also threatens the Crapo proposal’s path into the final coronavirus relief package, which still remains up in the air.The bank lobby, though, is still actively rooting for the legislation. The Bank Policy Institute, representing the nation’s largest banks, told Yahoo Finance in a statement that it “could bolster banks’ ability to support lending and the economic recovery.” The Independent Bankers of America, representing community banks, says the regulatory room for lending may be needed later.“For a lot of small businesses, the need for credit will probably be even greater for next year than what we’re facing right now,” said ICBA executive vice president of government relations Paul Merski.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed lowers pricing for emergency loans to state, local governmentsNY Fed: COVID forces first decline in household debt since 2014Democrats propose expanding Fed mandate to reducing racial inequalityWhat is a stock split: Yahoo UA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}