{"article": [{"url": "https://finance.yahoo.com/news/there-are-two-types-of-stocks-on-robinhood-181831860.html", "published": 1596720380.0, "headline": "There are two types of stocks on Robinhood", "body": "As Tesla stock climbed, Robinhood users bought. Of Robinhood's most popular stocks, around a third are in this \"momentum trading\" category. (Photo by Filip Radwanski/SOPA Images/LightRocket via Getty Images)One of the narratives in the current day trading boom is that investors have completely internalized the buy-the-dip mentality, following Warren Buffett’s legendary quote to be “greedy when others are fearful.”For long-term investors, there’s evidence that this is true. If you look at people investing through 401(k)s plans or even many brokerage clients at places like Fidelity, Vanguard, and T. Rowe Price, didn’t adjust their investment or contributions during March and April’s craziness, staying the course or even buying the dip.Read more: How to think about stock investing: The full breakdownAs the world began to panic over the coronavirus and impending economic fallout, these investors kept to their plans — or even used it as a buying opportunity to add to their portfolio with cheaper prices.At the same time, a fresh class of day-trading investors — or speculators (Hertz, anyone?) — tells another story. On the one hand, they have taken the buy-the-dip philosophy to the extreme. Hertz, JCPenney, and other bankrupt or near bankrupt stocks may not be traditionally the dip people have in mind.The public data from Robintrack, a website unaffiliated with Robinhood that tracks what’s in Robinhood users’ portfolios, illustrates how this new class of day trader, with almost no barriers to entry, behaves in the current market.When Robinhood users buy the dipLooking at the top 15 stocks owned by Robinhood users, a pattern emerges of behavior over the better part of the last two years (the data starts May 2018). The most popular stocks are divided into two baskets: cheaper, more volatile stocks, and tech stocks.Robinhood owners love owning airlines, cruises, two classic American icons (GE and Ford) and many seem to be betting on a GoPro (GPRO) turnaround. What’s especially interesting is that for all of these stocks, which are not very expensive per share, the ownership is inversely proportional to the stock price. In other words, when stocks go down, more people add them to their portfolios – they’re buying the dip.Story continuesRobinhood users added Delta to their portfolios as the stock tanked. (Robintrack)Many of the choices for dip-buyers are big coronavirus-related trades. Besides United (UAL), Delta (DAL), and American (AAL), Carnival (CCL) and Norwegian Cruise Lines (NCLH) saw big gains after steep drops in the stock price. Disney (DIS) counts too, despite the more complex business model.These trades, one could say, are coronavirus trades — perhaps somewhat similar to what we saw with Vanguard, though with individual securities instead of the overall market. But what’s most interesting is that for the most part, the most popular Robinhood stocks either look like a big X, when graphing popularity and price, or look like parallel lines. There’s not much middle ground.When the prices goes up, Robinhood users buy these stocksWhile many Robinhood users buy stocks — usually cheaper stocks — when the price goes down, which suggests they internalized “buy low,” this isn’t the case for one group of stocks: the big tech players.In early April, when Apple (AAPL) shares began to climb, the ownership climbed in lockstep. The higher the price, the more new people became owners of the stock.For Tesla (TSLA), the difference is even more stark. As the stock shot up from $600 to $1,800, it was a momentum trade for 350,000 users who jumped in.It’s the same story for Amazon (AMZN) and battery company Plug Power (PLUG).Amazon prices make Robinhood add Amazon stock to their portfolio. (Robintrack screenshot)Less successful tech companies like Snap (SNAP) and GoPro (GPRO) have slightly more complicated stories, with both dip-buying and momentum trading happening in the past two years.What’s also interesting here is that Robinhood allows for fractional trading — for investors to purchase less than one share – which essentially means more stocks are accessible to more people. If you don’t have the cash or inclination to pay $3,180 for one share of Amazon, you can get, say 1/15th of a share for around $200. For the expensive tech stocks that get more popular as they get more expensive, this has removed a significant barrier to entry. Since any stock can be as affordable as you want — you just buy less — this has likely solidified this trend.-Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Why you should consider deleting your stock trading appCoronavirus crisis fuels push to widen social safety netThe 2008 recession was far worse for young people's careers than previously thoughtBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey"}]}