{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-checks-more-than-1000000-dead-americans-received-14-billion-145832878.html", "published": 1593079580.0, "headline": "Coronavirus stimulus checks: More than 1,000,000 dead Americans received $1.4 billion", "body": "More than 1 million dead Americans received a coronavirus stimulus payment totaling over $1.4 billion, according to a report by the U.S. Government Accountability Office, a government watchdog.The findings come as a part of a review of how federal agencies have been administering the coronavirus relief spending by the government. The Internal Revenues Service and the Treasury Department made over 160 million payments worth almost $270 billion to taxpayers as of May 31, including the payments sent to deceased Americans.Read more: Coronavirus stimulus checks: What it means for your taxes“Where's the Republican oversight?” Senate Minority Leader Chuck Schumer (D-NY) said in a statement in response to the report.“This is a $3 trillion package and every small bit of oversight that the Republicans have done has had to be pushed by Democrats,” he said. “We should be having far more robust oversight over what has happened, as well as moving forward on a new bill.“In this April 23, 2020, photo, President Donald Trump's name is seen on a stimulus check issued by the IRS to help combat the adverse economic effects of the COVID-19 outbreak, in San Antonio. (AP Photo/Eric Gay)To speed up the delivery of the stimulus payments, the IRS relied on information from 2018 tax returns to determine eligibility, Treasury officials said. But the Treasury and IRS didn’t use death records to filter out Americans who had passed when issuing the first three batches of payments in order to distribute the payments as “rapidly as possible.” Those payments accounted for 72% of all payments, the report found.The IRS currently doesn't have a plan to take additional steps to notify ineligible recipients on how to return payments, the report found. But under the FAQ section of the IRS website, the agency does address if someone who has died qualifies for a payment.Read more: Coronavirus stimulus checks: Why your payment would be smaller than expected“No. A Payment made to someone who died before receipt of the Payment should be returned to the IRS by following the instructions in the Q&A about repayments,” the website states. The instructions outline how to return a paper check, direct deposit, and stimulus debit card.Story continuesTreasury Secretary Steven Mnuchin also said in an April 29 statement that relatives who have received a stimulus payment for a deceased family member must return it to the federal government.“You’re not supposed to keep that payment,” Mnuchin said in a statement to Yahoo Money. “We’re checking the databases, but there could be a scenario where we missed something, and yes, the heirs should be returning that money.”What to do if you think you received the wrong amount?Along with their payments, recipients will get a letter confirming the amount of the payment. This letter, called a Notice 1444, will be mailed to each recipient’s address within a few weeks after the stimulus payment has been made. It’s important to save the letter if you believe the amount of your economic impact payment is wrong, according to the Internal Revenue Service.“When you file your 2020 tax return next year, you can refer to Notice 1444 and claim additional credits on your 2020 tax return if you are eligible for them,” the IRS said.To determine the amount you’re eligible for, you can use the IRS’ “Calculate My Payment” chart. If you didn’t receive the full amount that you were entitled to, you can claim the additional amount on your 2020 tax return when you file your taxes next year.The payment amount is based on the information you have provided on your 2019 tax return, if it has been submitted or processed. Otherwise, the size of your payment is based on your 2018 taxes.Those who didn’t receive the additional $500-per-child bonus will also be able to claim the additional amount when they file their 2020 tax return.How to request a stimulus check trace?Notice 1444 will also help some Americans who haven’t received their payment to initiate a stimulus check trace.If you’ve received your Notice 1444 and the IRS ‘Get My Payment’ tracking tool indicates your payment has been issued, but you received no payment, you can request a trace by the IRS.You can request a trace if you haven’t received your payment and it has been:Five days since the scheduled deposit date,Four weeks since it was mailed by check to a standard address,Six weeks since it was mailed, and you have a forwarding address on file with the local post office,or, nine weeks since it was mailed, and you have a foreign address.The IRS advises not to request a payment trace to determine your eligibility, the amount of payment you should have received, or if you haven’t received a Notice 1444 or a payment date from the ‘Get My Payment’ tool.What should I do if I didn’t get a check?If you don’t file taxes and you haven’t received a stimulus check, you can submit your information through IRS Non-Filers Tool by Oct. 15 to get your payment. Americans with income below $12,200 and who haven’t filed a tax return for 2018 and 2019 can use the tool to add basic personal information in order to receive the payment.Those who pay taxes and believe they’re eligible for a stimulus payment but didn’t receive one will be able to claim it when they file their tax returns for 2020. For those who want their payment quicker, try calling the IRS Economic Impact Payment line at 800-919-9835.What would a second round of stimulus checks look like?The House recently passed another coronavirus relief package, dubbed the HEROES Act, that would provide up to $1,200 per individual with a maximum amount of $6,000 per household.Similar to the first stimulus payments, single adults with income up to $75,000 will get the full $1,200 payment. Married couples with income up to $150,000 will get $2,400. Single parents who file as head of household with income up to $112,500 will get the full $1,200 check.The House recently passed another coronavirus relief package, dubbed the HEROES Act, that would provide up to $1,200 per individual with a maximum amount of $6,000 per household. (Photo: Getty Creative)Reduced checks will be available for those who earn above those income thresholds. The payment would be reduced by 5% for every 5% increase in income above $75,000 for individuals and $150,000 for married couples. Eligibility will be based on a taxpayer’s adjusted gross income from their latest tax return.The new bill also gives Americans $1,200 for each dependent for up to three dependents. In the first wave of stimulus checks, there was an additional $500 per child dependent, with no limits.Under this legislation, taxpayers would receive the dependent bonus for any dependent they claimed on their tax return may be eligible. The first stimulus bill provided the additional $500 payment only to dependents aged 16 or under.While the bill likely won’t pass the Senate, experts said another stimulus package may be in the offing and could include another stimulus payout.Who gets the first stimulus payment?As part of a $2 trillion coronavirus relief package, many Americans will get government checks up to $1,200 — plus $500 per child — to help them ride out a job loss, reduced work hours, and other money challenges as the country tries to stem the pandemic.Your eligibility is based on your most recent tax return and your adjusted gross income. If you already filed your 2019 taxes, your eligibility will be based on that. If not, the IRS will use your 2018 taxes to determine if you qualify.The benefit is available not only to those who have filed taxes, but also to those who receive Social Security benefits as long as they’ve received their SSA-1099 or RB-1099 forms.Single adults with income up to $75,000 will get a $1,200 payment. Married couples with income up to $150,000 will get $2,400. Single parents who file as head of household with income up to $112,500 will get the full $1,200 check.And, Americans who qualify for the stimulus payment and have children will get an additional $500 per child under 17.Reduced checks will be available for single adults who earn between $75,001 and $99,000 and married couples who earn between $150,001 and $198,000.The check will be reduced by $5 for every $100 over $75,000 for single adults and $150,000 for married couples. The reduction will apply to the entire amount of the payment including the additional $500 per qualifying child.Who doesn't get a stimulus payment?Single adults who make more than $99,000 and married couples who earn more than $198,000 won’t receive stimulus checks.Read more: Coronavirus stimulus checks: Why many college students won’t get oneThose without a Social Security number and nonresident aliens — those who aren’t a U.S. citizen or U.S. national and don’t have a green card or have not passed the substantial presence test — aren’t eligible. Incarcerated individuals are also not eligible for a payment.You’re also ineligible if your parents claim you as a dependent on their taxes.Economic stimulus checks are printed at the Philadelphia Financial Center May 8, 2008 in Philadelphia, Pennsylvania. (Photo by Jeff Fusco/Getty Images)Who gets their stimulus check by direct deposit?The IRS will use the direct deposit information you provided from the taxes you’ve filed either for 2019 or for 2018.The payments will be deposited directly into your bank account if you received your last tax refund or expect to receive this year’s refund that way.Who gets their stimulus check by paper check?If the IRS doesn’t have direct deposit information on file, checks will be mailed, which could take longer to get to Americans. Adding to the complications, about 6% of U.S. adults — or about 12 million Americans — do not have a checking, savings, or other bank account, according to a 2018 Federal Reserve report.Who gets their stimulus check by debit card?The Treasury Department and the IRS are also distributing payments through prepaid debit cards to individuals without banking information on file.Around 4 million people will get the prepaid debits cards instead of a paper check, according to the Treasury. The recipients are those without bank information on file who are eligible for the payment and had their tax return processed by the Andover or Austin IRS Service Center.The cards will be mailed by the Treasury’s bank agent — MetaBank — along with instructions on how to activate and use the card. The recipients can make purchases, withdraw cash from ATMs, or transfer money to their bank account without additional fees.When are you getting the stimulus payment?This week, the IRS starts sending paper checks on a weekly basis to individuals whose direct deposit information isn’t on file.Paper checks will be issued at a rate of about 5 million per week. The latest projection is that the paper check will be delivered through late May and into June, according to a statement by the IRS.The checks will be issued in reverse “adjusted gross income” order — starting with people with the lowest incomes first. Taxpayers with income up to $10,000 will be the first to get their checks, which were expected to arrive by April 24.If the IRS doesn’t have direct deposit information on file, checks will be mailed, which could take longer to get to Americans. (Photo: Getty Creative)Americans with income up to $20,000 are expected to get their checks by May 1, while those with income up to $40,000 by May 15. The rest of the checks will be issued by gradually increasing income increments each week. Households earning $198,000 who file jointly will get their reduced checks on Sept. 4. The last group of checks will be sent on Sept. 11 to those who didn’t have tax information on file and had to apply for checks.Social Security and other benefits recipients who haven’t filed taxes in the last two years will receive their automatic payment at the end of April.How can you track the stimulus payment?Those who are still waiting can track it online. Americans are also able to provide the IRS with their direct deposit information if it’s not on file with the agency.“If you do not receive them by Wednesday, you’ll be able to put in your direct deposit information, and within several days, we will automatically deposit the money into your account,” Treasury Secretary Steven Mnuchin said on Monday. “We want to do as much of this electronically as we can.”Read more: Coronavirus stimulus checks: Here's why you can't find out your payment statusThe new tool allows Americans to follow the scheduled payment date for either a direct deposit or mailed check. It’s an online app that works on desktops, phones, or tablets and doesn’t need to be downloaded from an app store, The Treasury said.To track your payment, you must provide basic information including:Social Security numberDate of birthMailing addressThe tool also lets people provide their bank account details to get their payment by direct deposit instead of waiting for a mailed check, which go out April 24.If you filed a tax return in 2018 or 2019 but didn’t provide direct deposit information, you’ll be able to identify yourself, input that banking information, and receive the payment in several days in your account, according to Mnuchin.To add direct deposit information, you will need to provide:Adjusted gross income from your most recent tax return submitted, either 2019 or 2018The refund or amount owed from your latest filed tax returnBank account type, account, and routing numbersHow can those who don’t file taxes get a stimulus payment?Americans who don’t usually file taxes can register to get their stimulus aid checks on IRS website or use Turbotax’s free tool to file a minimum tax return.Read more: Coronavirus stimulus check: How to get one if you don't file your taxesThe IRS tool is for eligible U.S. citizens or permanent residents who had gross income below $12,200 ($24,400 for married couples) for 2019 and weren’t required to file a 2019 federal tax return.“There are as many as 10 million Americans who are not required to file a tax return,” TurboTax said in a statement. “Because the IRS will use the federal tax return to determine and send individual stimulus payments, these individuals are at risk of not receiving their stimulus payment.”Economic stimulus checks are prepared for printing at the Philadelphia Financial Center May 8, 2008 in Philadelphia, Pennsylvania. (Photo by Jeff Fusco/Getty Images)The tools will use the information to file and automatically complete a Form 1040 and send it to the IRS.They’ll also help determine if you’re eligible for the stimulus payment. If eligible, you need to answer a few questions, provide the required information, and choose whether to get the payment through direct deposit or check. If you don’t provide direct deposit information, the check will be mailed to you.Social Security recipients and those required to file tax returns don’t need to provide additional information, but still must meet the eligibility criteria to get a payment.Do you have to pay tax on the stimulus check?No. The stimulus payments are federal income tax refunds and aren’t subject to federal income tax.Do you have to pay back the stimulus check?No. The stimulus payment is actually a refundable credit against your 2020 tax liability, according to Kyle Pomerleau of the American Enterprise, and is paid out as an advanced refund. That means you don’t have to wait to file your 2020 taxes to get the money.Read more: Coronavirus stimulus checks: What it means for your taxesIt also doesn’t reduce any refund you would otherwise receive, Watson said.In fact, if you don’t qualify for the stimulus check now based on your 2018 or 2019 tax returns, you may be able to qualify to take the tax credit next year when you file your 2020 taxes if your income meets the thresholds.What about scammers and my stimulus check?Identity thieves will try email, call, or text you with messages linking to a phony government website, but the IRS only contacts taxpayers in two ways: by letter or in person.Read more: Coronavirus stimulus check scams: How to avoid becoming a victimIf the IRS calls you, it will only be after the agency contacted you first by mail. The IRS will also send a letter about your stimulus payment within 15 days after it sends the payment.Be wary of websites, emails, and social media attempts asking for money, personal data, or banking information. Don't click on the links or the attachment in the body of the email. Instead, type in the bank’s address in the browser yourself.If you realize you’re a victim of a stimulus check scam, reach out to your local law enforcement either by contacting the police or your local FBI office, which normally has an outreach number.How to return a dead relative’s stimulus check?Relatives who have received a stimulus payment for a deceased family member must return it to the federal government.Yahoo Money sister site Cashay has a weekly newsletter.To speed up delivery of the stimulus payments, the IRS is relying on information from 2018 tax returns to determine eligibility, which means that some people who passed away since then could be sent a payment. If a deceased loved one receives the check, here’s how to return it.If it’s a paper check:Write \"Void\" in the endorsement section on the back of the check.Mail the check to the correct IRS address included in this link.Don't staple, bend, or paper clip the check.Write a note that states why you’re returning the check.If you have cashed the payment or it was a direct deposit:Send a personal check or money order to the correct IRS address included in this link.Make it payable to U.S. Treasury and write 2020EIP and the recipient’s Social Security number or individual taxpayer identification number on the check.Write a note explaining why you’re returning the stimulus payment.Who can help me with my stimulus check questions?The IRS recently added 3,500 telephone representatives who can answer questions about the stimulus payment. The phone number to call is (800) 919-9835.At first, the service will attempt to answer the caller’s question with an automated message. Those who need additional assistance have the option to talk a representative after they go through the automated messages, according to the IRS.Still, the service, among others, will “remain limited,” the IRS said in a press release. “The IRS anticipates bringing back additional assistors as state and local advisories permit.”The agency also has an FAQ page on its website that addresses many questions about the stimulus check payments.Denitsa is a writer for Yahoo Finance and Cashay, a new personal finance website. Follow her on Twitter @denitsa_tsekova.Read more:Rich Americans' pullback in spending is hurting the economic recoverySome Americans finally get a living wage — while unemployedRead more personal finance information, news, and tips on CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and Reddit."}]}