{"article": [{"url": "https://finance.yahoo.com/news/houses-for-sale-will-be-gobbled-up-barbara-corcoran-163022401.html", "published": 1592566700.0, "headline": "Houses for sale will be ‘gobbled up’: Barbara Corcoran", "body": "Homebuyers will ‘gobble up’ houses for sale this summer, according to Barbara Corcoran, host of ABC’s Shark Tank and founder of the Corcoran Group, an New York City-based residential brokerage firm.Before the coronavirus pandemic, the U.S. did not have enough homes for sale to meet demand. But with sellers slow to re-enter the market because of the nationwide lockdowns and demand higher than ever, the U.S. has become an even more competitive market, said Corcoran.“When the buyers in many of the states that are restricted are allowed to come out and actually look at houses, they’re going to make a lot of purchases very quickly. So even in states where you have excess inventory, it’s going to be gobbled up,” Corcoran told Yahoo Finance.For the week ending June 13, inventory was down 27% compared to last year, according to Realtor.com. Inventory hit a 25-year low in December 2019, with moderate improvement at the beginning of 2020. But it plunged when the pandemic hit the U.S. in mid-March and sellers pulled their homes off the market, according to an analysis by Odeta Kushi, deputy chief economist for First American Financial Corporation, a a Santa Ana, California-based provider of title insurance, settlement services and risk solutions for real estate transactions.FILE - In this Feb. 26, 2020, file photo, visitors look toward the \"Painted Ladies,\" a row of historical Victorian homes, in front of the San Francisco skyline from Alamo Square Park in San Francisco. An estimate released Friday, May 1, 2020, by the California Department of Finance said that more people are leaving California than moving in, evidence of the toll the state's housing crisis is taking as the world's fifth largest economy inches toward 40 million people. (AP Photo/Jeff Chiu, File)The coronavirus forced Americans to work from home and redefined how Americans see their home. Some Americans are now looking for new homes with bigger yards, home offices and more square footage, after spending months in lockdown. Studies also show that more buyers are now looking to the suburbs for their next home, according to Redfin.“Everybody’s reassessed the concept of home, and what that creates is the desire for change. And when you have change, you have a rising housing market,” said Corcoran.Plus, mortgage rates hit an all-time low this week, incentivizing even more buyers into the market. Mortgage applications hit an 11-year high for the week ending June 12, according to the Mortgage Bankers Association.Story continues“[There are] giveaway prices in the mortgage market where money is so cheap it’s almost like you’re embarrassed to say you don’t have a mortgage anymore. There’s so much incentive there,” said Corcoran, who noted that tightened lending restrictions are the one negative.‘Explosion of prices’When more people want a product than the market can supply, the price goes up. Home prices already rose to an all-time high before the pandemic, as homes in the U.S. sold for an average $384,900 in the first quarter of 2020 — well above highs before the Great Recession, which reached an average of $322,100 in its peak, according to the Federal Reserve of St. Louis.With heightened demand, homes in the U.S. could get even more expensive this summer, according to economists.“I think you’re going to see an explosion of prices, really,” said Corcoran. “Prices are going to continue to go up, when the buyers in many of the states that are restricted are allowed to come out and actually look at houses, they’re going to make a lot of purchases very quickly.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:We are headed to a V-shaped housing recovery: expertHouse flipping hits a record before the coronavirus pandemic swept the US: study‘Summer is going to be a good period for the housing market’: economist"}]}