{"article": [{"url": "https://finance.yahoo.com/news/warren-buffett-berkshire-hathaway-buys-barrick-gold-in-q2-120617572.html", "published": 1597648460.0, "headline": "Warren Buffett and Charlie Munger have a history of trashing gold", "body": "Warren Buffett is warming up to gold.During the second quarter, Berkshire Hathaway (BRK-A, BRK-B) made a single new stock purchase, snapping up shares of gold miner Barrick Gold Corp (GOLD). It’s a surprising move for the “Oracle of Omaha” who’s long dismissed the precious metal as an attractive investment.As of June 30, Berkshire Hathaway's closely-followed and famed stock portfolio held 20.9 million shares of Barrick Gold, a position valued at $563.5 million at the quarter's end. Shares of Barrick Gold were up around 8% in the pre-market near $29.05 per share on the heels of the investment being made public.The new position in Barrick Gold ranks as the 22nd biggest investment in the portfolio. It is minuscule compared to the likes of the massive investments in Apple (AAPL), Bank of America (BAC), and Coca-Cola (KO).What's perplexing is that Buffett, and his right-hand man, Berkshire's vice chairman Charlie Munger, have a long history of eschewing gold, characterizing it as an unproductive asset.\"I would rather trust in the intrinsic value of a bunch of really fine businesses run by good managers selling products that people like to buy and have liked to buy for a long time, and then exchanging their future efforts, the money that comes from their wages, for See's Candy or Coca-Cola or whatever, than take some piece of metal that people dig out of the ground in South Africa and then put back in the ground at Fort Knox, you know, after transporting it and insuring it and everything else,\" Buffett said at the 2000 annual meeting. What's more, Buffett has often dismissed the idea of gold as a good store of value.\"I would say that gold would be way down on my list as a store of value,\" Buffett said at the 2005 annual meeting. \"I mean, I would prefer owning a hundred acres of land near here in Nebraska, or an apartment house, or an index fund.\"Buffett, whose father loved gold and was a \"huge enthusiast\" for the gold standard, said at the 2012 annual meeting that he would \"bet\" his life on Berkshire outperforming the precious metal over a 50-year-period.Story continuesIn this May 3, 2019 file photo, Berkshire Hathaway Chairman and CEO Warren Buffett, left, and Vice Chairman Charlie Munger, briefly chat with reporters before Berkshire Hathaway's annual shareholders meeting. (AP Photo/Nati Harnik)\"[Not] only will Berkshire do considerably better than gold, but common stocks as a group will do better than gold, and probably farmland will do better than gold. I mean, if you own an ounce of gold now and, you know, you caress it for the next hundred years, you'll have an ounce of gold a hundred years from now,\" Buffett said at the time.At the time, Munger, known for his quips and one-liners, noted that they \"have never had the slightest interest in owning gold.”\"It's a much better life to work with businesses and people engaged in business. I can't imagine a worse crowd to deal with than a bunch of gold bugs,\" Munger added.Maybe it wasn’t Buffett who made the callPerhaps what can be inferred from Berkshire's latest stock move is that Buffett and Munger can change their minds, or at least they certainly give autonomy to the newer decision-makers, the young investment deputies, Ted Weschler and Todd Combs. It’s unclear who made the decision to buy Barrick Gold.To be sure, though, it's not the first time the famed investing duo have changed their minds.Historically, Buffett and Munger shied away from tech companies, but now Apple is Berkshire's largest stock holding. However, Buffett has hinted that one of his young investment deputies was responsible for the initial purchase of the iPhone maker's stock.In late 2016, Berkshire picked up significant positions in the airlines in late 2016, years after Buffett had sworn off buying an airline stock.At the 2017 Daily Journal Meeting (DJCO) in Los Angeles, Munger explained how he and Buffett have changed with age.\"Warren learned better over time, I've learned better. The nice thing about the game we're in is you can keep learning, and we're still doing it,\" Munger said at the time. He acknowledged that they used to think the airlines were \"a joke it was such a terrible business,\" same as they once did about the railroads.During this year's annual meeting in May, Buffett said Berkshire exited all of its airline stock holdings, including American Airlines (AAL), Delta (DAL), United Continental Holdings (UAL), and Southwest Airlines (LUV), because of COVID-19's disruption to the travel industry.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach predicts that Trump will win re-electionGundlach predicts gold prices will go much higher in the long-term"}]}