{"article": [{"url": "https://finance.yahoo.com/news/michael-jordan-jordan-brand-donate-213048463.html", "published": 1596026300.0, "headline": "Update: Michael Jordan and Jordan Brand Announce First Organizations to Receive Funds From the $100 Million Racial Equality Donation", "body": "Update: July 29, 2020 at 1:30 p.m. ETNBA icon Michael Jordan and his namesake Jordan Brand revealed a plan last month to donate $100 million over the next 10 years to racial equality organizations. Today, they announced the first three partners that will receive donations.More from Footwear NewsA Detailed Look at Union's Upcoming Air Jordan 4 Collaboration Has SurfacedJayson Tatum's Air Jordan 34 'Zoo' Takes a Walk on the Wild SideThis Air Jordan 1 High Can Transform Into a Low-Top SneakerIn a statement, the retired athlete and the company said the NAACP Legal Defense and Educational Fund Inc. will receive $1 million; Formerly Incarcerated & Convicted People and Families Movement will receive $1 million; and Black Voters Matter will receive $500,000.Additionally, three areas of priority for the donation were further explained.Video: Original Michael Jordan sneakers on sale in Christie’s AuctionMJ and Jordan Brand stated one priority is social justice, specifically a goal of increasing civic engagement from the Black community “to address issues that disproportionately affect them, like voter suppression and criminal justice reform.” The second is economic justice with a goal of eliminating the wealth gap “through partnerships that create access to capital, improve the quality and delivery of financial literacy and education programs, and build generational wealth in Black communities.” Lastly is education and awareness surrounding “the role race plays in our history and drive a deeper understanding of the effects and consequences of racism.”“I’m all in with Jordan Brand, the Jordan Family and our partners, who share a commitment to address the historical inequality that continues to plague Black communities in the U.S.,” Jordan said in a statement.What We Originally Reported on June 5Hours after Nike Inc. announced it was investing $40 million to support Black communities in the U.S., Michael Jordan and Jordan Brand revealed an additional commitment to the cause.Story continuesThe basketball icon and his namesake label plan to donate $100 million over the next 10 years to organizations that promote racial equality, social justice and greater access to education.“Through our Jordan Wings Program, we have been focused on providing access to education, mentorship and opportunity for Black youth facing the obstacles of systemic racism. But we know we can do more,” Jordan Brand president Craig Williams said in a statement. “We must join forces with the community, government and civic leaders to create a lasting impact together.”Williams continued, “There is still more work for us to do to drive real impact for the Black Community. We embrace the responsibility.”The statement also emphasized: “Jordan Brand is us, the Black Community.”“Black lives matter. This isn’t a controversial statement. Until the ingrained racism that allows our country’s institutions to fail is completely eradicated, we will remain committed to protecting and improving the lives of Black people,” it read.The news of a donation comes days after the six-time NBA champion released a statement via Jordan Brand’s Instagram account amid the protests over the death of George Floyd, an unarmed 46-year-old black man, at the hands of Minneapolis police officer Derek Chauvin.“I am deeply saddened, truly pained and plain angry. I see and feel everyone’s pain, outrage and frustration,” Jordan said. “I stand with those who are calling out the ingrained racism and violence toward people of color in our country. We have had enough.”Across its social media platforms, the Swoosh a week ago also drew significant attention when it posted a black and white text video with an explicit anti-racist message: “For once, don’t do it.”In recent days, consumers have called on brands to take more steps beyond messaging — including financial commitments to ending racial injustice as well as improving diversity and inclusion within their internal ranks.This morning, Nike revealed its $40 million donation on behalf of the Nike, Jordan and Converse brands.“Systemic racism and the events that have unfolded across America over the past few weeks serve as an urgent reminder of the continued change needed in our society. We know Black Lives Matter. We must educate ourselves more deeply on the issues faced by Black communities and understand the enormous suffering and senseless tragedy racial bigotry creates,” Nike Inc. president and CEO John Donahoe said. “The Nike Inc. family can always do more but will never stop striving to role model how a diverse company acts. We will continue our focus on being more representative of our consumers while doing our part in the communities we serve.”Donahoe also has tapped Williams to head up the company’s initiative with a small task force.The CEO noted that the company will share more about its plan to accelerate diversity and inclusion “in the coming weeks.”“But today, we are uniting around our Black teammates and community,” he wrote.Sign up for FN's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram."}]}