{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-24-2020-222116049.html", "published": 1595603480.0, "headline": "Stock market news live updates: Stocks drop after Intel disappoints, US-China worries flare", "body": "Stocks fell Friday as relations between the US and China were tested further, and after a handful of companies reported quarterly results that disappointed Wall Street. Each of the three major indices logged weekly losses by the end of the session, and the Nasdaq posted its first back-to-back session of losses in 50 days.China on Friday ordered that the US close its consulate in the populous city of Chengdu, in response to the Trump administration’s directive to force Beijing to shut down its consulate in Houston earlier this week.Meanwhile, declines in the 30-stock Dow came as shares of Intel and American Express dropped Friday morning, after the companies reported disappointing developments in the second-quarter results. Intel (INTC) warned in earnings results Thursday evening that it faced another production delay for its advanced chips, with its new 7-nanometer chips now expected for delivery in late 2022 or early 2023, or about a year behind schedule. The chip-maker’s stock sank as much as 18% during intraday trading Friday, for its worst day since March 16 this year.American Express reported a 29% drop in revenue, with a drought of customer spending on credit cards during the pandemic contributing to a top-line miss.Friday’s session came following a tech-led selloff on Wall Street during the regular session. The three major indices ended the day lower, with the S&P 500 and Nasdaq both posting their largest declines in four weeks. Apple (AAPL) – a stock weighed relatively heavily in each of the major indices – dropped by the most since June 11 amid a broad decline in big tech shares and an Axios report that the company was facing a multi-state consumer protection probe.Investors also nervously eyed signs of backsliding in the virus-stricken economic, with new jobless claims last week shown to have risen for the first time since March. New jobless claims came in at about 1.42 million, versus the just over 1.3 million from the prior week.Story continues“Like we have seen in several other economic indicators, the initial claims data signal that the economy has lost some momentum lately following the solid improvement that occurred throughout much of April and May when restrictions on activity were being relaxed across much of the nation,” JPMorgan economist Daniel Silver wrote in a note.Virus cases also mounted further, with US cases topping four million on Thursday to have doubled over the past six weeks alone, and now comprise about one-quarter of the global total, according to Johns Hopkins data. New deaths in each of California and Florida were at records as of Thursday’s counts, and the US death toll rose to more than 143,000. California’s cases rose by more than 12,000 for the second-highest increase since the start of the pandemic.Individual companies have also sounded the alarm on the pace of recovery in their respective industries. Southwest CEO Gary Kelly told Yahoo Finance Wednesday that it will likely take five to 10 years for business travel to recovery to pre-pandemic levels.Market participants also continue to monitor progress in Washington over talks for another round of coronavirus stimulus measures. Treasury Secretary Steven Mnuchin said Thursday that the White House and Senate Republicans had a “fundamental agreement” on a GOP stimulus bill of about $1 trillion, which would not rule out future stimulus, according to Bloomberg. The Republican plan would also include another round of $1,200 stimulus checks to taxpayers, under the same income thresholds as the first round.—4:01 p.m. ET: Stocks end the week lower as US-China concerns, weak earnings and economic fears weigh on investorsHere’s where the three major indices settled at the end of equity trading Friday:S&P 500 (^GSPC): -20.01 (-0.62%) to 3,215.65Dow (^DJI): -182.65 (-0.69%) to 26,469.68Nasdaq (^IXIC): -98.24 (-0.94%) to 10,363.18—3:57 p.m. ET: Big Tech hearing before Congress officially postponedA Congressional hearing of four CEOS of the largest US tech companies has officially been postponed beyond Monday, according to a statement, confirming earlier reports that the testimony would be pushed back.The CEOs of Facebook, Amazon, Alphabet and Apple were previously scheduled to speak virtually on antitrust concerns before the House Judiciary Committee’s antitrust panel on July 27.The postponement was reportedly due to the fact that the service for the late Rep. John Lewis, D-Ga., conflicted with the original date, according to multiple media outlets.—3:15 p.m. ET: Stocks hold lower, pointing toward weekly losesThe three major stock indices were on track to post weekly losses Friday, with less than an hour left of the regular session. Such a result would mark the first weekly loss in a month for each of the S&P 500 and Dow. The Nasdaq posted a weekly loss last week as well.Intel and Pfizer were the laggards in the Dow, with the former still lower by more than 16% in intraday trading. The health-care and information technology sectors led declines in the S&P 500. Of the big tech firms, each of Facebook, Apple, Alphabet and Microsoft were lower.—1:45 p.m. Hedge fund giant Bridgewater cutting staffBridgewater Associates, the world’s biggest hedge fund firm, will reduce headcount in part because more employees are working from home. The news, first reported by The Wall Street Journal, comes as the COVID-19 crisis forces many companies to rethink staffing and real estate needs as work becomes less “office-centric.”—12:58 p.m. ET: McDonald’s becomes latest restaurant to mandate customer face coverings in restaurantsMcDonald’s (MCD) said Friday that all customers will need to wear face coverings upon entering US restaurants, with an effective date of August 1.The announcement puts McDonald’s in the company of a growing number of businesses including Starbucks, Costco, Kroger, Walmart and major US airlines in requiring that customers wear masks.McDonald’s also announced a series of new divider panels and retrofit barrier solutions for front- and back-of-house facilities to help improve safety conditions for employees and customers.—10:00 a.m. ET: New home sales jump 13.8% in June, surging ahead of expectations to the highest level in nearly 13 yearsNew-home sales rose by 13.8% to a seasonally adjusted annual rate of 776,000, the Commerce Department said Friday. This was well above the rise of 3.6% to 700,000 expected, and marked the highest level since July 2007.The jump extended the double-digit percentage rise from May, when new-home sales rose an upwardly revised 19.4% month over month to 682,000.—9:46 a.m. ET: US services sector unexpectedly holds in contractionary territory in July, according to IHS MarkitThe US services sector contracted again at the beginning of July, IHS Markit reported Friday.The firm’s US preliminary services purchasing managers’ index (PMI) improved to 49.6 in July from 47.9 in June, falling short of the improvement to 51.0 expected, according to consensus economists. Readings below the neutral level of 50 indicate contraction, while readings above indicate expansion in a given sector.The manufacturing PMI rose to 51.3 in July from 49.8 in June, but was still short of the 52.0 expected. Taken together, the US composite PMI sat at 50.0 exactly, up from 47.9 in June.“US private sector firms indicated a stabilization of business activity at the start of the third quarter, with the contraction in service sector output slowing further and manufacturers signaling a modest upturn in production,” IHS Markit said in a statement. “Growth was impeded, however, by an increased rate of decline of new orders, linked in part to renewed coronavirus disease 2019 (COVID-19) containment measures.”—9:45 a.m. ET: Stocks drop, S&P 500 heads for back to back sessions of declinesHere were the main moves in markets, as of 9:45 a.m. ET:S&P 500 (^GSPC): -28.95 (-0.89%) to 3,206.71Dow (^DJI): -158.24 (-0.59%) to 26,494.09Nasdaq (^IXIC): -200.45 (-1.92%) to 10,259.85Crude (CL=F): +$0.10 (+0.24%) to $41.17 a barrelGold (GC=F): +$11.80 (+0.62%) to $1,901.80 per ounce10-year Treasury (^TNX): +0.5 bps to yield 0.587%—9:40 a.m. ET: Verizon shares trade higher after company adds more wireless subscribers in Q2Verizon (VZ), the parent company of Yahoo Finance and a Dow component, reported Friday better than expected net additions in subscribers during the second quarter, with customers continuing to turn to the wireless service as working from home and social distancing became more ubiquitous. Shares rose more than 2% shortly after market open.Total net new monthly customers were 352,000 during the quarter, or above the consensus analyst estimate for 278,000. This included 287,000 regular mobile-phone customers.Second-quarter operating revenue of $30.4 billion was down 5% over last year, but better than the $29.95 billion consensus. Adjusted earnings per share of $1.18 were above estimates for $1.15, and included what the company estimated was a 14-cent per share impact directly related to Covid-19.—9:37 a.m. ET: Schlumberger says it will slash 21,000 jobs amid drawdown in oil pricesOilfield service provider Schlumberger (SLB) on Friday reported a 35% drop in second-quarter revenue, and announced a workforce reduction of about one-fifth as energy companies globally struggle to cope with a drop in oil prices. Schlumberger shares were little changed Friday morning, but have fallen more than 50% for the year to date.Schlumberger’s newly announced restructuring plan will include job cuts totaling 21,000, or about one-fifth of its workforce, based on the 105,000 workers it said it employed at the end of 2019.Still, CEO Olivier Le Peuch offered tentative words of optimism in the company’s earnings report this morning, saying, “Oil demand is slowly starting to normalize and is expected to improve as government measures support consumption.”“However, subsequent waves of potential COVID-19 resurgence pose a negative risk to this outlook,” he said.—9:30 a.m. ET: American Express opens lower after reporting 29% Q2 revenue slide, as customer spending on cards declinesAmerican Express (AXP) reported second-quarter profit that topped expectations but estimates-missing revenue of $7.7 billion, representing a drop of 29% over last year. Consensus analysts expected $8.13 billion in sales. Shares of American Express dropped more than 1% shortly after market open.The sales decline was mostly due to a drop in card member spending and a lower average discount rate compared to last year, AmEx said in its earnings release. Global spending on cards sank 34% over last year to $205 billion, versus the $215 billion expected, with the company grappling with a drop in business travel and card expensing.“Spending volumes, which declined to their lowest point this quarter in April, gradually improved in May and June, with small businesses being the most resilient,” CEO Stephen Squeri said in a statement. However, he added that the company has not “seen an increase in total customer attrition from prior years,” suggesting customers are holding onto cards, albeit swiping them less frequently amid the pandemic.—7:18 a.m. ET Friday: Futures drop after China announces retaliationHere were the main moves in markets, as of 7:18 a.m. ET:S&P 500 futures (ES=F): 3,221.5, down 6 points (-0.19%)Dow futures (YM=F): 26,491.00, down 52 points (-0.2%)Nasdaq futures (NQ=F): 10,488.25, down 60 points (-0.57%)Crude (CL=F): +$0.34 (+0.83%) to $41.41 a barrelGold (GC=F): -$0.20 (-0.01%) to $1,889.80 per ounce10-year Treasury (^TNX): +0.2 bps to yield 0.544%—6:09 p.m. ET Thursday: Stock futures rise after selloffHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:09 p.m. ET:S&P 500 futures (ES=F): 3,234.25, up 6.75 points or 0.21%Dow futures (YM=F): 26,580.00, up 37 points, or 0.14%Nasdaq futures (NQ=F): 10,583.75, up 35.5 points, or 0.34%NEW YORK, NEW YORK - MARCH 20: Traders, some in medical masks, work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}