{"article": [{"url": "https://finance.yahoo.com/news/southwest-ceo-itll-take-5-to-10-years-for-business-travel-to-recover-192912938.html", "published": 1595515040.0, "headline": "Southwest CEO: It'll take 5 to 10 years for business travel to recover", "body": "A coronavirus vaccine will hopefully come in 2021, which is critical, as though the only way to fix the economy is to overcome the virus. But the healing will be anything but immediate, at least for airlines, says the chair and CEO of Southwest (LUV).The airline understands the public’s concerns with the dangers from the close confines of air travel. Southwest is keeping middle seats open, enforcing safety measures like mask-wearing, and is stepping up its refund policy, and has pushed for thermal testing by the TSA. (Other airlines are taking similar measures.)But even that may not get it done.\"At a point, you just can't make people fly,” Gary Kelly, Southwest’s CEO, told Yahoo Finance. “You can't send out a memo and say, 'thou shalt travel from A to B’,” he said. “In economic recessions, it's classic that business travel will be cut very sharply.”While consumers will still travel, Kelly added, it’ll be at reduced fares.A Southwest Airlines airplane comes in for a landing at Los Angeles International Airport on May 12, 2020 in Los Angeles, California. (Photo by FREDERIC J. BROWN/AFP via Getty Images)\"I think business travel will be very slow to recover, and my guess is that it will take five to 10 years for business travel to fully recover to 2019 levels,” he said. “So it's a low-cost environment for a long time.”Kelly said airlines need to entice customers to fly, and convince those who already want to that the airline is prioritizing their health and safety.\"I don't think there's any limit to how much we need to message on those points,\" Kelly said, but added there probably weren’t many new ways to keep people safe beyond what Southwest is already doing. “I’m not sure there is a lot more that we can do differently.”For now, it’s about informing people of “hospital-quality” HEPA filters that refresh the air entirely every seven minutes, enhanced cleaning crews, and empty middle seats.The airline clearly has a rocky path, but the CEO said it isn’t now focused on investing in its future but on managing the present.\"The analogy is a patient in intensive care — you are just trying to get through it,\" he said. \"You're trying to survive and you'll worry about the future later.\"Story continues---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Why you should consider deleting your stock trading appCoronavirus crisis fuels push to widen social safety netThe 2008 recession was far worse for young people's careers than previously thoughtBlack communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey"}]}