{"article": [{"url": "https://finance.yahoo.com/news/no-vaccine-no-recovery-rsm-economist-185850317.html", "published": 1595858780.0, "headline": "'No vaccine, no recovery': RSM economist", "body": "The upcoming stimulus policy expected out of Washington in the coming weeks is “absolutely critical to the condition of the U.S. economy,” says RSM chief economist Joe Brusuelas.“The real economy is in a recession. Financial markets had a V-shape [recovery],” Brusuelas told Yahoo Finance’s “On The Move.”“Of course housing is going to be the leader because the Fed sent rates to zero. But if you’re not in those isolated sectors, or really participating in the financial and tech economy, you’re hurting,” he added.On Monday, stocks opened higher on hopes of a stimulus to help individuals deal with the economic fallout of the pandemic and Moderna’s (MRNA) announcement of the start of a phase 3 trial for its COVID-19 vaccine candidate.Nurse Kathe Olmstead prepares a shot as the world's biggest study of a possible COVID-19 vaccine, developed by the National Institutes of Health and Moderna Inc., gets underway Monday, July 27, 2020, in Binghamton, N.Y. (AP Photo/Hans Pennink)‘Middle of the decade’Brusuelas emphasized the importance of a medical breakthrough saying, “no vaccine, no recovery.”“Absent a vaccine, we’re just going to see a sawtooth pattern of openings and re-openings, better growth, slower growth, perhaps a little bit of a contraction mixed in,” he added.The economist doesn’t see the U.S. falling behind other countries long term, thanks to innovation, technology and services — but he does see a “really large output gap for quite a long period of time.”“I don’t expect us to be back to pre-pandemic levels, say January 2020, really until the middle of the decade.”“We’re going to have to collaborate and cooperate with our trade partners to begin thinking about a global production and distribution of those vaccines once they’re available,” he said. “Absent that, we don’t get back to that January 2020 economy that we were all pretty happy with.”Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}