{"article": [{"url": "https://finance.yahoo.com/news/bytedance-picks-oracle-winning-bidder-000109920.html", "published": 1600024160.0, "headline": "ByteDance picks Oracle as partner to try to save TikTok U.S", "body": "By Echo Wang and Greg Roumeliotis(Reuters) - Oracle Corp said on Monday it would team up with China's ByteDance to keep TikTok operating in the United States, beating Microsoft Corp in a deal structured as a partnership rather than an outright sale.ByteDance, TikTok's Beijing-based owner, had been in talks to divest the U.S. business of its hugely popular short-video app to Oracle or Microsoft after U.S. President Donald Trump ordered the sale last month and said he might otherwise shut it down.While TikTok is best known for dancing videos that go viral among teenagers, U.S. officials are concerned user information could be passed to China's Communist Party government. TikTok, which has as many as 100 million U.S. users, has said it would never share such data with Chinese authorities.Sale negotiations were upended when China updated its export control rules last month, giving it a say over the transfer of TikTok's algorithm to a foreign buyer. Reuters reported last week that China would rather see TikTok shut down in the United States than allow a forced sale.Oracle said it was part of a proposal submitted by ByteDance to the U.S. Treasury Department over the weekend in which Oracle would serve as TikTok's \"trusted technology provider.\" Oracle shares were up 6.3%.Under ByteDance's latest proposal, Oracle would assume management of TikTok's U.S. user data, sources told Reuters on Sunday. Oracle is also negotiating taking a stake in TikTok's U.S. operations, the sources added. The TikTok user data is currently stored in Alphabet Inc's cloud, with a backup in Singapore.Some of ByteDance's top investors, including General Atlantic and Sequoia, will also be given minority stakes in those operations, one of the sources said.PRECEDENTIt is unclear whether Trump, who wants a U.S. technology company to own most of TikTok in the United States, will approve the deal. U.S. Treasury Secretary Steven Mnuchin told CNBC on Monday the administration would review it this week.Story continues\"I will just say from our standpoint, we'll need to make sure that the code is, one, secure, Americans' data is secure, that the phones are secure and we'll be looking to have discussions with Oracle over the next few days with our technical teams,\" he said.Mnuchin said the deadline to approve a deal was Sept. 20 and that the current proposal included a commitment to create a U.S.-headquartered company with 20,000 new jobs.The Committee on Foreign Investment in the United States (CFIUS), which reviews deals for national security risk, is overseeing the ByteDance-Oracle talks, and Mnuchin said there would also be a separate national security review by the Trump administration.\"User data protection and assurances around how the company's algorithms push content to U.S. users are thoughtful components of a substantive solution, but whether they can change political outcomes is a much more difficult question,\" said regulatory lawyer John Kabealo, who is not involved in the talks.ByteDance plans to argue that CFIUS' approval two years ago of China Oceanwide Holdings Group Co Ltd's purchase of U.S. insurer Genworth Financial Inc offers a precedent for its proposal with Oracle, the sources said.In that deal, China Oceanwide agreed to use a U.S.-based, third-party service to manage Genworth's U.S. policyholder data. ByteDance will argue a similar arrangement with Oracle can safeguard TikTok's U.S. user data, the sources said.\"We can confirm that we've submitted a proposal to the Treasury Department which we believe would resolve the Administration's security concerns,\" TikTok said in a statement, without disclosing further details.ByteDance and Oracle did not respond to requests for comment. The White House declined to comment.China's foreign ministry spokesman Wang Wenbin declined to comment on Monday when asked at a press conference about the TikTok deal, but said TikTok was being \"encircled\" and \"coerced\" in the United States into a transaction.\"We urge the U.S. government to provide an open, fair, just and non-discriminatory environment for foreign firms operating and investing in the United States,\" he said.ELLISON AND TRUMPOracle's chairman Larry Ellison is one of the tech world's few Trump supporters. His firm has significant technological prowess in handling and safeguarding data, but no social media experience as its clientele comprises companies, rather than consumers.On Sunday, Microsoft said it had been informed by ByteDance that the Chinese firm would not be selling it TikTok's U.S. operations. Walmart Inc, which had joined Microsoft's bid, said it was still interested in investing, and that it would talk further with ByteDance and other parties.As Sino-U.S. relations deteriorate over trade, Hong Kong's autonomy, cybersecurity and the spread of the coronavirus, TikTok has emerged as a flashpoint.As many as 40% of Americans back Trump's threat to ban TikTok if it is not sold to a U.S. buyer, a Reuters/Ipsos national poll found last month. Among Republicans - Trump's party - 69% said they supported the order, though only 32% expressed familiarity with the app.The White House has stepped up efforts to purge what it deems \"untrusted\" Chinese apps from U.S. digital networks. Beyond TikTok, Trump has also issued an order prohibiting transactions with Tencent Holding Ltd's messenger app WeChat.Earlier this year, Chinese gaming company Beijing Kunlun Tech Co Ltd sold gay dating app Grindr, bought in 2016, for $620 million after CFIUS ordered its divestment.ByteDance acquired Shanghai-based video app Musical.ly - whose user base was largely American - for $1 billion in 2017 without seeking CFIUS approval, relaunching it as TikTok the following year. Reuters reported last year that CFIUS was investigating TikTok.(Reporting by Echo Wang and Greg Roumeliotis in New York; Additional reporting by David Shepardson and David Lawder in Washington, Melissa Fares in New York, Stephen Nellis in San Fransisco, Yingzhi Yang and Gabriel Crossley in Beijing; Writing by Joshua Franklin and Brenda Goh; Editing by Mark Potter, Nick Zieminski and Jonathan Oatis)"}]}