{"article": [{"url": "https://finance.yahoo.com/news/chamath-palihapitya-views-on-government-bailouts-and-stimulus-172447226.html", "published": 1594125140.0, "headline": "Palihapitiya: Skip government bailouts, put more money 'into the hands of consumers'", "body": "Billionaire investor Chamath Palihapitiya believes the government's trickle-down economics approach to stimulus during COVID-19 pandemic hasn’t worked — and it’s exacerbated inequality through distorting markets.The 43-year-old investor, who was already well-known on Wall Street and Silicon Valley, emerged as a voice for the retail investor class during the pandemic after a CNBC interview in early April.At the time, the CEO and founder of Social Capital and chairman of Virgin Galactic (SPCE) lambasted the government bailouts of corporations — particularly ones that engaged in massive stock buyback programs to boost share prices. He made his remarks as the Treasury unveiled a list of companies who received government funding to keep workers on their payrolls.Palihapitiya told Yahoo Finance in a recent wide-ranging interview that there were “not enough first principles thinking by the Federal Reserve and Treasury.” He referred to the philosophical framework of examining problems that begins with principles that you believe have no assumptions baked into them.According to Palihapitiya, if officials had used that framework, they'd start by looking at the primary source of the gross domestic product (GDP) in the U.S. — and ensure consumers had enough money to keep spending.\"The majority of GDP in the United States has always come from consumers,” he explained.The coronavirus stimulus included a one-time $1200 payment to those making less than $100,000, but that amount has been widely deemed insufficient as the crisis drags on.If the government wanted \"to make sure that consumers continue to spend because you wanted to see GDP go up, you'd focus on income in their hands. And what you would do is probably give them enough money so that the amount of money they had exceeded the amount of money they needed to live,\" Palihapitiya added.He lauded the U.S.’s economic model, which he argued was “how we've inoculated ourselves from corruption and kleptocracy and, you know, the things that that...plague many other countries, including developed western countries.”Story continuesPalihapitiya argued that by putting that money directly in the hands of consumers, it would result in increased spending of those excess dollars, allowing for businesses to staff up and rehire and reactivate supply chains.\"What you would have is a slow rebuilding of the economic vitality in America. Instead, we didn't think from first principles,” he told Yahoo Finance. “And we did what we've been doing for the last 40 years, which is this top-down idea that trickle-down economics works, and it doesn't work anymore.”‘A failed idea’ that’s ‘gone to waste’The investor pointed out that technology has created a massive deflationary supercycle, where consumers expect future prices to fall, which curbs the incentive to spend money now.Funneling money directly to companies in the hopes that it gets to workers “ is just a failed idea. It's a failed concept that's had its day,” Palihapitiya stated.“So, my frustration is that folks aren't realizing this, because, if you did, what you do is you'd put a lot more money in the hands of consumers. And you'd wait for those dollars to flow up into the companies,\" he added.Palihapitiya added that hundreds of billions of stimulus dollars — like the Paycheck Protection Program — have \"largely gone to waste\" and distorted the stock market along the way.\"It makes it very hard to be anything except long the market. I'm long the market, and I have cash. Would I love to be isolating certain things that I think are, you know, not set up for success or trying to buy things cheap? Sure, but it's not possible right now,\" he added.What's more, the fiscal and monetary policy has \"fundamentally\" exacerbated inequality as its buoyed stock prices. That has implications for small investors who use day-trading platforms like Robinhood, E-Trade or Charles Schwab.\"It's a fallacy that retail Main Street owns equities,” the investor said.“Unfortunately, not enough retail investors own a participation in the equity markets of the United States. And so, we know, when equity markets go up, it disproportionately helps institutional money and multigenerational money. And that doesn't have a real net positive impact to average normal people,” Palihapitiya said.“That's why I think, again, putting money in the hands of those folks would have a much more positive impact,” he added.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investors"}]}