{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-trump-fans-controversy-on-covid-19-testing-as-cases-spike-worldwide-172927247.html", "published": 1592829440.0, "headline": "Coronavirus update: Trump fans controversy over testing as cases spike worldwide", "body": "President Donald Trump sparked a new controversy over the weekend by suggesting that testing more people for the coronavirus has contributed to the U.S. holding the top spot in the world for COVID-19 diagnoses, in the midst of the worst daily case spike the world has seen since the crisis began.With the world’s largest economy struggling to contain the virus, the president made waves after a rally in Tulsa, where turnout was less than expected. Trump said that when testing is widespread, “you’re going to find more people. So I said to my people, ‘slow the testing down please.’”White House officials have said the president was kidding, and never directed the coronavirus task force to slow down testing. However, the comments drew widespread criticism, and flew in the face of worrying trends in states like Florida, which despite a slight decrease in testing is seeing cases surge.Whether the president said in jest or was serious, it was a \"pretty terrible thing to say,” Dr. Anand Parekh, Bipartisan Policy Center Chief Medical Advisor, told Yahoo Finance on Monday. Testing and tracing are critical to capping the COVID-19 surge, he added.Around the world, the pandemic has infected over 9 million, with more than 2.2 million affected in the U.S. on nearly 120,000 deaths. The virus shows few signs of slowing, as the World Health Organization said on Monday that record increases Brazil and India are boosting daily totals.There are over 2.2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)“It seems that almost every day we reach a new and grim record,” WHO director general Tedros Adhanom Ghebreyesus said Monday. “Yesterday, more than 183,000 new cases of COVID-19 were reported to WHO – easily the most in a single day so far.”The resurgence in cases in the country sheds light on the struggles to reopen the economy as the pandemic tightens its grip on the global economy, and key regions grapple with a jump in new infections.Texas, Arizona, North Carolina, South Carolina, Utah and California are among the states being closely watched as they see spikes in cases. Meanwhile, former hotspots like New York City and New Jersey are pressing ahead with plans to reopen indoor seating, salons and other businesses and activities.Story continuesPublic health experts have also noted a trend of younger individuals being affected by the virus in Florida, which explains the country’s surging case count even as the death rate slows.Median age of new Covid cases in outbreak states continues to decline. In Florida, median age fell from 65 in March to 35 last week. Some of trend reflects testing moving away from hospitals (where older individuals are more likely to present) and into community. h/t @DKThomp pic.twitter.com/DTa2YudCN2— Scott Gottlieb, MD (@ScottGottliebMD) June 22, 2020A tale of two treatmentsGilead (GILD) announced Monday it will begin testing an inhaled version of its antiviral drug for use as an early-stage COVID-19 treatment. The announcement is part of the company’s pursuit to determine efficacy in non-hospitalized patients, including nursing homes.Previously, Gilead had expressed interest in an inhaled form, since the ingredients are too dangerous to the liver for an oral option. The drug has show moderate improvements in patients, according to several clinical trials, but is currently only available in a hospital setting intravenously.Amid a surge of COVID-19 testing and treatment options, the U.S. Food and Drug Administration (FDA) revoked emergency use for a number of antibody tests, after reports of low-accuracy tests flooding the market.In a separate move, two clinical trials of hydroxychloroquine were halted over the weekend, adding to waning hopes that the anti-malarial drug could prove effective against the coronavirus. Last week, the FDA revoked the drug’s emergency use authorization.One of the drug’s manufacturers, Novartis (NVS), announced late Friday it would end its clinical trials due to “acute enrollment challenges.” The company said it would continue to provide the drug for other ongoing trials.The same reason was cited by the National Institute of Health, which announced it would end trials of HCQ and azithromycin, because “the rate of participant enrollment has been inadequate for the trial to meet its objectives in a timely manner. No safety concerns were associated with the trial.”The announcements add another twist to the saga involving the controversial drug, which first gained traction as President Donald Trump touted its potential, and recently said he was taking it as a preventative drug.Subsequent studies have shown little or no effect for hospitalized patients, and in some cases increased risk of death. A medical journal article showing positive results was recently retracted due to questionable data sources for the retroactive study.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}