{"article": [{"url": "https://finance.yahoo.com/news/he-will-cheat-dnc-organizes-to-combat-trumps-suppression-efforts-214126897.html", "published": 1597942160.0, "headline": "'He will cheat': DNC organizes to combat Trump's 'suppression efforts'", "body": "As President Trump continues to rail against mail-in voting, Democrats are accusing him of trying to undermine confidence in the election. In response, Democratic National Committee Chairman Tom Perez told Yahoo Finance the party is aggressively organizing to help voters cast their ballots.“We're using every tool in the toolbox to make sure that people are able to exercise their right to vote,” said Perez. “We're going to have record turnout, not withstanding their suppression efforts. I have no doubt because people understand that our democracy, as we know it, is on the ballot.”Postmaster General Louis DeJoy will testify before Congress on Friday and Monday about changes he deems cost-cutting measures, but that critics argue will curb the postal service’s ability to handle an expected surge in mail-in ballots, in the midst of the pandemic.After facing public outcry DeJoy paused the changes until after the election, but Democrats say that doesn’t reverse damage that has already been done. Delays in mail have already been reported around the country, after the postal service removed mail-sorting machines and slashed overtime pay.“You don't need to stop overtime right now. Why are you moving, sorting machines out now? That's only if you want to make it harder for people to exercise their franchise,” said Perez.Postal workers load their mail delivery vehicles at the Panorama city post office on Thursday, Aug. 20, 2020 in the Panorama City section of Los Angeles. (AP Photo/Richard Vogel)‘I don’t trust the postmaster general’The House will consider a bill on Saturday to provide the cash-strapped USPS with $25 billion. While the Trump administration has said it is open to looking at $25 billion under certain conditions, President Trump has also opposed more money for USPS because it would support mail-in voting. Earlier this week, Trump claimed expanded vote-by-mail will lead to “a disaster the likes of which our country has never seen.” Experts say voting fraud is very rare.Click here for Yahoo Finance's full coverage of the 2020 election“We understand that he will cheat. He will try to undermine public confidence. He keeps making these distinctions between absentee voting and vote by mail. There is no difference. Vote by mail is safe and secure,” Perez said.Story continues“We need to make sure that the postal workers have all the tools they need to deliver the mail promptly,” he added.The White House has maintained that Trump is not trying to hinder voters or delay the mail ahead of the election.\"This president believes that the American people, casting their ballot, one at a time, will ultimately make sure that he's the one elected on November 3 and any postal consideration has nothing to do with any ballot initiative or anything else. He wants to make the post office great again,” White House Chief of Staff Mark Meadows told reporters this week.Amid mounting concerns that the postal service won’t be able to deliver ballots in time, Perez said the DNC is working to educate Americans on all their options to vote early. He said the party attempting to make sure there are enough poll workers and early voting days that will allow people to vote in-person safely. The DNC is also trying to secure more drop boxes where voters can hand deliver their ballots instead of sending them through the mail.“Because I don’t trust the postmaster general. I think he should leave,” said Perez. “We are building other contingencies.”Perez said litigation is another tool Democrats are using to ensure everyone will be able to vote. He pointed to a DNC lawsuit in Wisconsin that aims to give voters more time to request absentee ballots and require clerks to count ballots that arrive within a week of Election Day as long as they are postmarked by Nov 3.Perez told Yahoo Finance the decision, which he expects as soon as next week, could enfranchise 100,000 people in Wisconsin.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Trump is trying to 'undermine confidence' in democracy: Democratic rep.What to expect from the 2020 conventions: 'As good a TV show as they can have'Coronavirus response: Breaking down the debate over liability protectionsCoronavirus stimulus: What’s next for small business?White House, Senate GOP continue to debate stimulus plan as jobless claims riseTwitter hack highlights concerns about disinformation, election security"}]}