{"article": [{"url": "https://finance.yahoo.com/news/why-teslas-stock-will-reach-1900-wedbushs-dan-ives-204041174.html", "published": 1597679300.0, "headline": "Why Tesla's stock will reach $1900: Wedbush's Dan Ives", "body": "Electric car maker Tesla (TSLA) closed at a new high on Monday after shares soared 11% following a price target increase from Wedbush Securities.Analyst Dan Ives increased his price target on Tesla by $100 to $1900, based on growth in China. He predicts the EV manufacturer will reach 150,000 vehicle deliveries in China this year, a component worth $400/share.“It’s about pent-up demand,” Ives told Yahoo Finance’s The First Trade.Tesla now has a market cap of $342 billion. The stock is up 734% year-to-date. The company recently announced its first 5-for-1 stock split, which won’t change the valuation of the company, but is expected to make shares more accessible to retail investors.“I think that was a very smart move,” said Ives. “The appetite right now for the stock and the EV story continues to be still in the early innings.”“I believe this is the right valuation especially everything that we’re seeing in the EV market,” he added.Tesla is “a tech company not an automobile company,” said Ives.Next month’s Battery Day is expected to be another catalyst for the stock. Ives believes Tesla could announce a 1 million mile battery at the event.“I think right now in the EV market it continues to be Tesla’s world and everyone else is paying rent,” said Ives.“In our opinion, this battery technology will be very advanced, potentially last for decades, withstand all types of weather/terrain, and be another major milestone for the Tesla ecosystem,” Ives wrote in his note to investors.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}