{"article": [{"url": "https://finance.yahoo.com/news/walmart-piloting-drone-delivery-for-covid-19-test-kits-with-quest-diagnostics-160644579.html", "published": 1600773260.0, "headline": "Walmart ups the ante in contactless delivery, tests drones to send coronavirus kits to homes in Vegas", "body": "Walmart (WMT) announced on Tuesday that it would start testing the use of drones to deliver at-home COVID-19 testing kits.In a move that advances the trend of contactless customer service in an era of social distancing, Walmart teamed up with Quest Diagnostics (DGX) and DroneUp to pilot drone delivery of the kits in North Las Vegas, beginning on Wednesday.“There’s a lot we can learn from our drone delivery pilots to help determine what roles drones can play in pandemic response, health care delivery and retail,” Tom Ward, senior vice president of customer product at Walmart, wrote in a blog post.“Our hope is the drone delivery COVID-19 self-collection kit launch will shape contactless testing capabilities on a larger scale and continue to bolster the innovative ways Walmart plans to use drone delivery in the future,” he added.The big-box retailer plans piloted deliveries for self-administered nasal swab kits for customers living in a single-family home within a one-mile radius of a designated Supercenter store. Walmart, which has also partnered with governments for drive-through coronavirus testing, will not charge a fee for the trial delivery, it added.The automated deliveries will be dropped in the driveway, on the front sidewalk, or in the backyard to avoid trees and cars. Patients can then return the nasal swab samples from the self-administered kits to Quest Diagnostics via a pre-paid shipping label.The retailer plans to trial the COVID-19 collection kit drone delivery in Cheektowaga, New York, early next month.This month, Walmart announced two separate drone trials — one for select groceries and essential items in Fayetteville, North Carolina, in partnership with Flytrex and another for health and wellness products with Zipline in northwest Arkansas. Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. How kids and the coronavirus helped Walmart shape its yearly list of hot toysWalmart unveils ‘ultimate life hack,’ a $98 membership with access to groceries, gas, and delivery"}]}