{"article": [{"url": "https://finance.yahoo.com/news/snowflake-ipo-how-the-stock-is-trading-on-its-debut-165844442.html", "published": 1600257980.0, "headline": "Snowflake IPO: How the stock is trading on its debut", "body": "Snowflake (SNOW) shares soared over 130% during their first minutes of trading on Wednesday. The stock opened at $245 a share. That’s more than double its IPO price of $120.The cloud-data company sold 28 million shares, raising about $3.36 billion, the largest initial public offering of a software company.This was also the biggest IPO of the year, apart from the SPAC backed by billionaire Bill Ackman’s Pershing Square’s Tontine Holdings, which raised $4 billion earlier this year.The cloud industry has been on an hot trajectory garnering increasing enthusiasm.Snowflake’s debut received a further profile boost after it was disclosed in filings last week that Warren Buffett’s Berkshire Hathaway (BRK-A, BRK-B) would invest $250 million at the IPO price. Additionally it would also buy 4 million shares which belong to Snowflake’s former CEO Bob Muglia.Feb 19, 2020 San Mateo / CA / USA - Snowflake corporate headquarters in Silicon Valley; Snowflake Inc. is a cloud-based data-warehousing startupThe filing also showed Salesforce Ventures, the VC arm of Salesforce (CRM) would also be buying $250 million shares of the cloud-based data platform in a private placement following its public debut.For the fiscal year ending January 31, 2020, Snowflake’s revenue grew 174% year-over-year. For the six months ended July 31, 2020, its revenue growth represented a y/y growth of 133%.The stock’s performance on its first day of trading may bring into debate whether the IPO was underpriced.The SEC recently approved a New York Stock Exchange proposal to allow companies to raise new capital in a direct listing, something it wasn’t allowed to do before. This new type of direct listing is seen as a way to avoid costly underwriting fees and underpricing.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreNikola calls short-seller report a 'hit job,' shares still fallWhy Tesla shares are tanking todayTesla analyst is bullish on what the company is doing with its high-priced stock, raises price target to $550Apple analyst says record-breaking share price rally is about 'MOMO' not 'FOMO'Tesla shares surge 12% on day of stock split"}]}