{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-pfizer-spurs-new-hope-in-vaccine-race-as-nyc-pulls-back-on-dining-plans-155021546.html", "published": 1593601100.0, "headline": "Coronavirus update: Pfizer spurs new hope in vaccine race as NYC pulls back on dining plans", "body": "Pfizer (PFE) on Wednesday announced early positive results for the first phase of its coronavirus vaccine trial, sparking hopes that an effective treatment can help turn the tide amid an implacable surge in new infections.The resurgence of COVID-19 cases and hospitalizations in more than half of the U.S. has forced multiple regions to rethink plans to relax their lockdowns. The frontline battle has shifted to states like California, Texas, Florida, Arizona, all of which are responding to surging case counts by rolling back phased reopening plans.Those areas are also mandating masks and closing beaches; meanwhile, states like New Jersey and New York — which have recovered from the darkest days of the outbreak — are also taking precautions by halting plans to reopen indoor dining.New Jersey Gov. Phil Murphy announced this week he would reverse the decision to allow indoor dining in time for the holiday weekend. New York City followed suit Wednesday, with Mayor Bill DeBlasio saying indoor dining would be paused and outdoor dining would be expanded— with more than 6,600 restaurants taking advantage the city’s initiative to qualify restaurants for outdoor dining.“It is not the time to forge ahead with indoor dining,” DeBlasio said, citing the nationwide surge in COVID-19 cases. “I am very convinced we can help restaurants survive, and help bring a lot more revenue to them. We can help bring back a lot of jobs, but do it safely and do it outdoors.”He referenced Dr. Anthony Fauci’s testimony in front of a Senate panel Tuesday as a key reason to remain wary of the outbreak. Fauci, director of the National Institute of Allergy and Infectious Diseases, said the country — which as already doubled from a daily average of 20,000 to 40,000 cases — could end up seeing 100,000 cases per day if the surge continues.Coronavirus cases are increasing in the Sun Belt region. (Graphic: David Foster/Yahoo Finance)Separately, Pfizer and BioNTech emerged as leaders in the hotly-contested global race for a vaccine, sparking a market rally and sending the company’s stock up 5%.Story continuesTheir candidate is using mRNA technology, the same as the leading vaccine candidate from Moderna (MRNA). In both cases, there will be extra regulatory scrutiny as the technology has no precedent on the market.The company tested three different strength doses in 45 participants aged 18-55, and showed neutralizing antibodies were produced at higher levels with the two lower doses. This is ideal for the company as it means less materials required per dose and more vaccine production.While no vaccines have been approved, the global race is heating up with various companies pushing ahead as quickly as possible. Inovio (INO), an early entrant among the smaller biotech players, announced early positive results Tuesday, but has not yet provided study details.The path toward a vaccine is the U.S.’s “Manhattan Project,” said Declan Quirke, Stifel Healthcare Group’s co-head, but even with multiple parties working on a solution, “it’s still going to take time.”Meanwhile, in the treatment space, Gilead (GILD) is under fire again as the U.S. announced it would buy the majority of the company’s supply of the antiviral drug remdesivir.The U.S. Health and Human Services Department (HHS) announced it would be buying half a million treatment courses — the entire supply for the company for July and a majority of the supply for August and September.“President Trump has struck an amazing deal to ensure Americans have access to the first authorized therapeutic for COVID-19,” HHS Sec. Alex Azar said in a prepared statement.“To the extent possible, we want to ensure that any American patient who needs remdesivir can get it,” he added.Anticipating the unprecedented need, Gilead issued voluntary non-exclusive licenses to five generic manufacturers in May. But with a production time of more than six months, that would mean these companies would likely have their first batch produced by late fall at the earliest. Only 10% of the company’s supply would be distributed globally in the meantime.This has many experts concerned about the U.S.-produced vaccines, and how protectionism will play a role in the distribution of a successful candidate.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}