{"article": [{"url": "https://finance.yahoo.com/news/analyst-who-called-rally-off-march-low-now-sees-this-as-the-level-to-watch-for-stocks-104245907.html", "published": 1601445020.0, "headline": "Analyst who called rally off March bottom now sees this as the level to watch for stocks", "body": "When the stock market was in free fall back in March, Fundstrat Global Advisors founder Tom Lee made the bold call of a 25% rally by April.He was right.After that, he predicted a 50% recovery of the losses caused by the coronavirus pandemic would signal an “all-clear” that would accelerate gains to push the S&P 500 back near all-time highs. He was right, again.Read more: Analyzing investments: Fundamental analysis, technical analysis, and moreNow, as the market recovers from a correction that saw the S&P 500 drop to a recent low of 3,236, Lee is naming a new line in the sand for investors to watch as an indicator that investors have overdone pricing in potential risks. So far, the index has held his line in the sand at the 62% retracement level of 3,224 from the August highs, where he would be putting new capital to work.Fundstrat's Tom Lee says his new line in the sand to watch is 3,224 on the S&P 500, which represents the 62% retracement from recent highs and the market pricing in the \"worst\" potential risks to the downside.“One of those things we have to think about is when does nervousness price in the worst that’s yet to come, when do you think the worst is priced in?” he asked in a Tuesday interview with Yahoo Finance’s YFi PM, adding that recovering the 38% retracement of 3,363 would be a bullish trigger.“I think stocks are not in a downtrend because, number one, there’s still $4.3 trillion in cash on the sidelines,” he said. “I don’t think in the history of any financial market in the world do you ever have a top when there is 20% of the equity market sitting in cash — investor cash, that’s excluding the private equity cash, the record cash held by corporates, too, so you got tons of dry powder. People are bearish.”Despite the volatility that could stem from the election and potential second wave of coronavirus cases in the winter months, Lee points out that the economy has already weathered the greatest economic shock since the Great Depression and stocks have still managed to hit new highs.Meanwhile, analysts at Goldman Sachs also echoed the resiliency of stocks in the wake of the March selloff as well, predicting in a note this week that the S&P 500 could hit 4,000 by mid-2021 if the election results in a divided government. Lee sees similar upside given how the recovery has played out so far.Story continues“The U.S. is a dynamic economy and I think people underestimate that,” he said. “In the short run it’s very scary, but in the 2021 framework I’m very optimistic.”Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Americans are shelling out $30,000 on these pop-up backyard home offices during the pandemicThis $3 billion online education company is seeing a 'paradigm shift' due to coronavirusThe NFL overlooking coronavirus threat is 'extremely concerning' says former White House doctor"}]}