{"article": [{"url": "https://finance.yahoo.com/news/cleveland-fed-president-loretta-mester-yahoo-finance-transcript-august-2020-172651054.html", "published": 1598618060.0, "headline": "Jackson Hole 2020: Cleveland Fed’s Loretta Mester speaks with Yahoo Finance [Transcript]", "body": "Loretta Mester, president of the Federal Reserve Bank of Cleveland, joined Yahoo Finance on the virtual sidelines of the annual Jackson Hole symposium to discuss the impact of the COVID-19 pandemic on the U.S. economy and how the Federal Reserve is responding.Below is a transcript of her appearance on August 28:-JULIE HYMAN: Fed Chair Jay Powell said yesterday that the Federal Reserve is going to let the economy get a little hotter than it traditionally has, perhaps let inflation creep up above 2% in the interest of fostering job growth in the United States. To talk more about this we are joined by Loretta Mester. She's the Cleveland Fed president as well as our Brian Cheung, who covers the Federal Reserve for us. President Mester, thank you so much for joining us. So give us a little bit of the nuts and bolts, if you will, of the thinking behind this big policy change expected though it may have been, by economists from the Federal Reserve.LORETTA MESTER: Yeah, thank you and thanks for having me on today. Well, you know there's been a lot of changes in the economy over the past 10 years and I think the new statement really incorporates our thinking now about how it is best to achieve our goals of price stability and full employment: maximum employment, and some of those changes are. One: there's a lower general level of interest rates, we've seen that over the past 10 years and the expectation is that will remain low going forward.The second thing that has happened is that there seems to be less correlation between the resource use, so in other words, unemployment and inflation. So you know we ran what was thought to be very low unemployment rates, and we didn't really see inflation pick up. And those combinations of changes in the structure of the economy really drove part of the framework review and towards the: how can we best achieve our goals of price stability and maximum employment, when we've had these kind of changes in the underlying structure of the economy.Story continuesAnd of course if it isn't resource utilization and unemployment correlated with inflation, then what's driving inflation, that's where inflation expectations are very important. If those are well-anchored, then we're able to sort of mitigate the effects of downward shocks using our interest rate tool, even when interest rates are low. So the framework sort of tries to figure out: well what's the best way to go about hitting our target and that's where letting inflation move up beyond 2% and not only letting it, but actually think saying that we are going to allow that to happen and actually take action for that to happen, after periods where inflation has been low for a while for a long time - that's the change in the strategy: is that we really want inflation to go higher than 2%, moderately higher for some period after it's been running too low that’s the way to make sure that inflation over time is 2%.BRIAN CHEUNG: Hey it's Brian Cheung here so on that point, what level of inflation overshoot as you just mentioned in terms of either magnitude and/or duration is then comfortable for you? What if inflation hits 2.5% or 3%? I know that this is flexible so how would you approach it if inflation goes a little higher.LORETTA MESTER: Yeah, so I mean, again, it's gonna depend on the circumstances for the overall economy, and what that's going to look like in terms of how far above 2%. The key thing is really wanting to anchor inflation expectations so: if we saw that we were allowing inflation to go up and it turned out to be that inflation expectations were being unanchored on the outside, that would be a problem. But we want to make sure that we're going to hit 2% over time so having inflation move up above 2% moderately above, depending on circumstances and risk, right, is the appropriate thing to do after it's been running too low. And it's really going to depend - the number is going to depend, and the duration is going to depend on circumstances which is why when Chair Powell unveiled it yesterday he was very careful to say: this isn't really a numerical averaging kind of regime, right, this is really going to depend on what the economy looks like but the key thing is that we think it's appropriate, in order to hit our 2% goal, to have inflation run above 2% after periods where it's been too low. And that's because, right, we need to counteract the effect of the bias of hitting a lower bound on interest rate, kind of generates, and that we're going to hit the lower bound more often just because the general level of interest rates in the economy, they’re lower. So this is a way to sort of undo that bias.BRIAN CHEUNG: Right so as you mentioned, this is about inflation expectations - that if people expect inflation in the future they would maybe consume more or raise prices now, but how difficult is that from a communication standpoint, there was a paper about that presented today. If you're talking to a household or a business in your district in Cleveland, how do you explain to them what you just did yesterday?LORETTA MESTER: So I think communication is extremely important. And I think that will be one of the things that we need to focus on: is that we're actually communicating to everyone, not just people on Wall Street but also people on Main Street who are actually going out every day. And I do think that's a challenge. I don't think that's an easy thing to do. The Cleveland Fed actually has an inflation Research Center precisely looking at issues, exactly as you put it, like what's the best way to communicate and what's the best way to understand inflation expectations. But I think the key is: what we've learned over the past 10 years is those inflation expectations being well-anchored and being steady and consistent with 2% inflation, are very key to our ability to actually use monetary policy to work against downward shocks and to keep the economy at full employment and at price stability and so that's part of what this was about yesterday: is to make sure that we have a framework and a strategy that will actually meet those two goals.If we have the ability to sort of hit both those goals, then that's a good economy to be in.Cleveland Federal Reserve Bank President Loretta Mester speaks in London, Britain, July 2, 2019. REUTERS/Marc JonesBRIAN CHEUNG: So what's what comes down the road from here, it seemed like the changes to the long-term statement might be setting up what might be the next step for right now which could be some sort of forward guidance, maybe in the next FOMC meeting. I'm wondering where do you land on that debate - it seemed to me that the announcement yesterday might take out any sort of outcome-based guidance specifically only just to employment, that it might have to include some sort of inflation pinning. I'm curious where you land in that debate and what you could see the Fed doing from here.LORETTA MESTER: So I think, you know, one of the things that's true in the framework is that it is sort of a real explanation of our strategy. And what I would support and I will be doing it when I go out talking is using the strategy as a way of framing how I explain monetary policy - just like we use the prior strategy, before it was revised, to frame it. And a lot of parts of that strategy of course remain the same.Whether it's time to go and use more explicit forward guidance or not, that's going to be a decision that we make at upcoming meetings: looking at the economy as we always do before we go in FOMC meetings and what's needed at the time. Currently, I think everyone expects, and has gotten the message from the Fed that we expect interest rates to remain low right for quite some time, given what our outlook for the economy is. So in that sense that communication I think has been effective and I think people get that. So again, whether we're going to change that at upcoming meetings is really going to depend on what's going on in the economy. And I could imagine that the time for doing that might be geared to when you know we've gotten a little bit farther along in terms of it looking like the recovery is on a sustainable path and we want to make sure that people are getting the message that we still think accommodative monetary policy is appropriate. So again: it's going to depend on what the economy looks like going forward. But forward guidance and explaining our policy in terms of making sure that the public understands what we think appropriate policy is going to look like going forward, I think will be part of the toolkit that we use.BRIAN CHEUNG: So then share with us your outlook for the economy based on what you're seeing in your district. So in Ohio and in parts of Pennsylvania I know that the virus cases look different, it might vary by region, but broadly speaking, how do you see the recovery and can you see the United States getting back to the 3.5% unemployment rate that we got before the crisis which is really was a great looking economy.LORETTA MESTER: I hope that we did get back to that. And you should never count out the resilience of the US economy, for sure. I mean, it has surprised us in the past about how resilient it's been, and you know some of the recent data have been on the positive side of a lot of economists’ expectation so that's one thing. But nonetheless you know we're really in a deep hole in terms of the shutdown period, really you can see that in the second quarter GDP numbers and in the unemployment rates across the country - that was a very deep hole. And while, when the economy started reopening, we got some real positives there in terms of activity right we're certainly not back to where we were in February, and my own forecast is that we'll still have to dig out - by the end of this year the level of GDP will still be about 6% below where it was at the end of last year, the unemployment rate will still be quite elevated, certainly not anywhere near February's level, and so we're just going to see how to really keep policy accommodative. And I also think we're going to need more fiscal policy to support households and businesses, as we get through the reopening phase into a more sustainable recovery. The most recent data, like we look at high frequency indicators now of course to kind of get a handle on where things are going, they actually show a tempering of activity in Ohio and Pennsylvania - in our part of the district in Pennsylvania - and it's really tied to the increase in virus cases that started in late June. Now the most recent data on virus cases have come back down and we might see activity pick back up again but remember, it's just a deep hole that we're in. And we're making sure that we can get back to something that's a more sustainable recovery.JULIE HYMAN: President Mester, finally I wanted to ask you about the sort of ongoing debate about the Fed’s role in potentially exacerbating income inequality. We've had a lot of folks who come on and talk about: there's no alternative to buying stocks, in part because rates are so low. We also spoke the other day to Bill Campbell of DoubleLine Capital, who’s thesis is that the money being lent out by banks with very low rates is not going to small and medium businesses, it's going mostly to the largest. Is that the Fed’s problem, first of all, or is that something that Congress needs to address with that fiscal policy that you mentioned?LORETTA MESTER: So I think fiscal policy has a very important role to play here, I think you know you've seen early on in the crisis both monetary policy and fiscal policy really complementing one another in terms of making sure that the economy can get through this, and firms of all sizes can get through. In terms of, what the Fed’s role is: we can lend, but we can't spend, I think that was Chair Powell’s way of putting it yesterday. And that's important to know - so our job is to make sure that the economy we went into the markets in March, we really were making sure that we didn't have a financial crisis on top of a pandemic. It was really important that the financial markets continued to function well. And that was sort of our reason to go into those markets, as we did aggressively, to make sure that the financial markets continue to work, and that credit could flow down to households and to businesses of all sizes. The fiscal authorities stood up some of their programs and, including the Paycheck Protection Program and others, direct grants again to aid both workers who were laid off - the extended unemployment benefits. So there's a joint role that can be played there. The Fed’s policy tools, really can't - are broad tools in the sense of they can't really target one type of borrower or one type of community versus another. We're - our goal is to make sure that the economy is as healthy as it can be and works for everyone but they're blunt tools. So some of the more directed programs are going to have to come from fiscal policy. That said you know we have set up some emergency programs, our so called 13(3) programs that are helping to get funding to firms of all sizes, including small-businesses and medium-sized businesses: the Main Street Lending Program - which was set up, kind of early days for that one. But again that's a way to get loans to businesses. But I emphasize its lending not grant.JULIE HYMAN: Right, of course. Loretta Mester, thank you so much for spending some time with us. The president of the Cleveland Federal Reserve Bank, Loretta Mester joining us there, thank you again. And thanks also to Brian Cheung.LORETTA MESTER: Thank you. Be well.-Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}