{"article": [{"url": "https://finance.yahoo.com/news/majority-of-americans-think-congress-should-extend-enhanced-unemployment-benefits-past-july-poll-132314298.html", "published": 1594629080.0, "headline": "Majority of Americans think Congress should extend enhanced unemployment benefits past July: poll", "body": "The enhanced unemployment benefits passed as part of the CARES Act are set to expire at the end of July if Congress doesn’t act. A new Yahoo Finance-Harris poll finds the majority of Americans believe the extra $600 per week should be extended past July — even though a majority also believes the benefits discourage people from returning to work.Read more: Coronavirus: How to find a job after a layoffThe poll, conducted between July 2 and July 6, found 58% of the 2,094 respondents surveyed support extending the enhanced benefits into August or longer. Forty-two percent said the benefits should expire at the end of July as scheduled.People in the Midwest and Northeast are more likely to support letting the benefits expire than people in the South or West. Forty-nine percent of respondents in the Midwest and 46% of respondents in the Northeast support a July expiration, compared to 39% of people in the South and 39% of people in the West, the poll found.People wait to speak with representatives from the Oklahoma Employment Security Commission about unemployment claims Thursday, July 9, 2020, in Midwest City, Okla. (AP Photo/Sue Ogrocki)Discouraging workers from going back to their jobs?Lawmakers are debating what to do about the benefits as they attempt to pass another coronavirus relief package in the coming weeks. Many Republicans have argued against extending the benefits, saying some workers make more on unemployment than they do at their job, which they say is a disincentive for workers to go back to work.The new poll shows 34% somewhat agree and 28% strongly agree the enhanced benefits discourage people from returning to work.People who have received the additional benefits are less likely to see them as a disincentive for work.A Yahoo Finance poll found 58% of respondents support extending enhanced unemployment benefits beyond July.Of those polled, 44% currently receiving the extra $600 see the benefit as a discouragement from returning to work — compared to 56% of people who previously received the benefit and 64% of people who never did.Young people are also less likely to see the benefits as a disincentive. Half of respondents between 18 and 34 years old said the benefits are a discouragement, compared to 68% of people between 55 and 64 years old.Story continuesDespite those findings, 68% of respondents still said they think the extra $600 per week is beneficial to the U.S. economy.Democratic lawmakers warn eliminating the boosted benefits would push Americans into poverty and cause more damage to the economy in the long run.“Supercharged unemployment benefits have kept the economy afloat and allowed millions of families to pay the rent and buy groceries,” said Sen. Ron Wyden (D-OR) in a statement this week.Of the people surveyed, 107 were receiving the enhanced benefits at the time of the poll. More than half (57%) of that group said they would have to cut back on non-essential spending if the boosted benefits expired. About a quarter (26%) said they would skip paying at least one bill and 20% said they would need to sell belongings for extra income. Eleven percent of respondents said they would lose their home and 6% said they would lose their car.Return-to-work bonusA Yahoo Finance-Harris poll found 68% of respondents think the enhanced unemployment benefits help the economy.Some Republicans have pushed for a back-to-work bonus to encourage workers to get back to their jobs.“I think we need to have something that gets people back to work, but ensures we are taking care of those who really need to help,” Sen. Rob Portman (R-OH) said in an interview with Yahoo Finance.Democratic lawmakers argue the bonus won’t help the many workers who can’t go back to their jobs if their employer went out of business or if their company is still temporarily shut down.The Yahoo Finance-Harris poll found 69% of respondents support a return-to-work bonus – 67% of those currently on unemployment would be more likely to return to their job if they got a bonus for doing so. Seventy-nine percent of respondents said they would support the U.S. government offering incentives like taxes, grants and low-interest loans to rehire workers.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Read more about the Yahoo Finance-Harris pollCoronavirus response: What Washington has accomplished and what's nextCongressional watchdog finds 'significant risk' for fraud in Paycheck Protection ProgramBusiness leaders, tech CEOs bash Trump's visa suspensionNew bill would allow small businesses to get second PPP loanACLU sues to stop SBA from denying PPP loans to people with criminal records"}]}