{"article": [{"url": "https://finance.yahoo.com/news/explainer-rbgs-death-could-shift-161045684.html", "published": 1600514300.0, "headline": "EXPLAINER-How RBG's death could shift the Supreme Court - and American life - rightward", "body": "By Lawrence HurleyWASHINGTON, Sept 19 (Reuters) - The death of liberal U.S. Supreme Court Justice Ruth Bader Ginsburg has huge implications for the future of law and life in the United States, giving Republican President Donald Trump the chance to cement a 6-3 conservative majority on the court.Here are several ways in which a rightward tilt would be felt if Trump gets to pick Ginsburg's successor:ABORTION AND OTHER SOCIAL ISSUESEver since the Supreme Court legalized abortion in its 1973 Roe v. Wade ruling, conservative activists have sought to overturn the decision and always fallen just short. If Trump replaces Ginsburg with a staunch conservative, the chances of the court drastically curbing abortion rights becomes ever more likely.Similarly, the conservative wing of the court may be emboldened to make sweeping moves on other social issues, which could include expanding gun rights, bolstering individual religious rights and curbing voting rights. The court may also have the votes to strike down progressive legislation enacted by Congress in the event Democrats have the votes to pass major bills on issues like climate change.The court would be even less likely to embrace liberal causes, such as ending the death penalty, although its recent 6-3 ruling in favor of LGBT worker rights suggests that issue could be an exception in certain circumstances.OBAMACARE HANGS IN THE BALANCEIn the short term, Ginsburg's absence could be felt most keenly when the court hears oral arguments on Nov. 10 on the latest challenge by conservatives to the Obamacare health law, enacted in 2010 and previously upheld by the Supreme Court on a 5-4 vote in 2012. Ginsburg was one of the five justices in the majority then, which means that her replacement could tilt the balance.Even if no Trump nominee is confirmed by then, the court would go into those arguments with a 5-3 conservative majority.Other cases the court has taken up for its new term, which officially starts on Oct. 5, could also be affected. On Nov. 4 the justices consider a major legal fight over the scope of religious-rights exemptions to certain federal laws. The dispute concerns Philadelphia's decision to bar Catholic Social Services from participating in its foster-care program because the organization prohibited same-sex couples from serving as foster parents.Story continuesIn a politically sensitive case, the court on Dec. 2 weighs a bid by the Democratic-led House of Representatives to obtain material that the Trump administration withheld from former Special Counsel Robert Mueller’s report on Russian political meddling in the 2016 presidential election.PIVOTAL ROLE OF CHIEF JUSTICEFor the last two years, following the retirement of conservative Justice Anthony Kennedy in 2018, Chief Justice John Roberts has been the pivotal figure on the court, but his position of influence would be weakened if Trump replaces Ginsburg.At the ideological center of a nine-member court, Roberts had the option of siding with the four liberal justices to his left or four conservatives to his right to secure a majority opinion.Roberts, known as a defender of the court as an institution and champion of the judiciary as an independent branch of government, sided with Ginsburg and the court's other three liberals in key cases.In June, he helped strike down a restrictive Louisiana abortion law and thwarted Trump's bid to rescind protections for hundreds of thousands of illegal immigrants dubbed \"Dreamers\" who entered the United States as children.Roberts has on occasion sought compromises in big cases, sometimes to the dismay of his more conservative colleagues.In July, for example, he authored both decisions as the court ruled that a New York prosecutor could try to obtain Trump's financial records but prevented Democratic-led House of Representatives committees from immediately getting similar documents.Without Ginsburg, Roberts loses the ability to shift the balance on his own.WAR ON BUREAUCRACYConservatives and business interests have long sought to weaken the power of federal agencies and the Supreme Court has already been a willing ally.That so-called war on the administrative state could expand with a sixth conservative justice on the bench. Most notably, a landmark ruling from 1984 that said courts should defer to federal bureaucrats when interpreting the scope of federal laws could be in danger.If that ruling was overturned, it could potentially give the conservative court greater power to limit efforts by future Democratic administrations to issue regulations on such issues as the environment and consumer protection.(Reporting by Lawrence Hurley in Washington Editing by Scott Malone and Matthew Lewis)"}]}