{"article": [{"url": "https://finance.yahoo.com/news/target-earnings-q2-2020-103214004.html", "published": 1597815620.0, "headline": "Target reports stellar Q2 earnings results — one for the record books", "body": "Two months removed from being a public company for 53 years, Target (TGT) just had its first-ever unicorn quarter.Yes, a unicorn quarter — one that you don’t actually believe could exist until it smacks you up side the skull. Armed with COVID-19 stimulus checks and two index fingers tapping away on an Apple iPhone (or firmly planted on the steering wheel in a drive to the local Target store), U.S. shoppers showed the discount retailer some major love in the second quarter.Here’s how Target performed compared to Wall Street expectations.Net Sales: $23 billion vs. estimates for $19.82 billionComparable Sales: up 24.3% vs. estimates for a 5.8% increaseQuick Sales Highlights: store comp sales up 10.9%; online sales up 195%; number of customer transactions up 4.6%; average transaction amount up 18.8%.Gross Margin: 30.9% vs. estimates for 28.98%Diluted EPS: $3.38 vs. estimates for $1.58 a shareSales and earnings embarrassed the financial modelers on Wall Street. Sales in electronics exploded 70% as people gobbled up tech gear to support their new work-from-home life during the pandemic. Apparel sales rebounded from a 20% first quarter decline to up double-digits in the second quarter. Sales in Target’s food and beverage category rose at a 20% clip.In all, Target noted it just uncorked its best same-store sales increase ever reported. The company said it gained $5 billion in market share through the first six months of the year. Guess sales from bankrupt department stores and closed malls are going right into the registers at Target.And to top it off, Target’s business hasn’t fallen off the map in August. Recall, Walmart warned on Tuesday sales weakened noticeably at the end of July — and remain mixed in the early back-to-school shopping period — as stimulus checks ran out.“Despite the volatility in early August, August sales comps have been running in the low double digits, which shows we are sustaining relevance and the trust we built quarter-after quarter,” Target Chairman and CEO Brian Cornell told reporters on a media call. The only blemish: Similar to Walmart, Cornell acknowledged back-to-school shopping started “slower than usual” in large part as the pandemic wreaks havoc on school openings.Story continuesTech company-like growthTarget’s second quarter earnings report is impressive. The country is locked in a nasty recession, is battling a pandemic and has one eye towards a potentially chaotic presidential election. Oh, and the unemployment rate is still over 10%, some jobs may never come back from the pandemic and retail by and large is in the toilet (putting pressure on even the healthiest of retailers).Yet, Target posted tech company-like growth numbers on the top and bottom lines. Its results are indicative of a company doing a ton right in the minds of shoppers in this topsy-turvy environment. These numbers should be a signal to investors that it’s perhaps time Target’s stock begins to outperform the broader market again.Target’s stock has lagged the S&P 500 for most of 2020, only recently beginning to outperform. Still, Target’s stock is only up a mere 6.3% on the year — in a world of disconnects, this appears to be another one.“We will not,” Cornell told Yahoo Finance when asked if Target will buy back its stock this quarter. The company has $4.5 billion remaining under a prior authorization. “We suspended all share repurchases.”That may change if Target’s August sales momentum continues into September.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}