{"article": [{"url": "https://finance.yahoo.com/news/exclusive-chesapeake-energy-file-bankruptcy-014636990.html", "published": 1592254460.0, "headline": "Exclusive: Chesapeake Energy to file for bankruptcy as soon as this week - sources", "body": "By David French and Mike SpectorNEW YORK (Reuters) - Chesapeake Energy Corp <CHK.N> is preparing to file for bankruptcy as soon as this week, said three people familiar with the matter, becoming the largest oil and gas producer to unravel after an energy market rout caused by the coronavirus outbreak.The Oklahoma City-based company, co-founded by the late wildcatter Aubrey McClendon, is in the final stages of negotiating a roughly $900 million debtor-in-possession loan to support its operations while under Chapter 11 bankruptcy-court protection, two of the sources said.The company is also in talks with creditors to \"roll up\" some of its existing debt and make it part of the bankruptcy loan, bringing the total debtor-in-possession financing closer to $2 billion, the sources added. The company is reeling under a mountain of debt totaling more than $9 billion.Chesapeake is also attempting to negotiate an equity infusion from creditors to help it emerge from bankruptcy proceedings, one of the sources said.Chesapeake plans to complete its negotiations with its creditors and file for bankruptcy as soon as Thursday, the three sources said. The timing could slip to next week depending on the progress the company makes in these discussions, the sources added.If the company manages to emerge from bankruptcy, creditors that include Franklin Resources Inc <BEN.N>, will take over Chesapeake in exchange for eliminating more than $7 billion of its debt under the outlines of a plan being negotiated, one of the sources said. Franklin is among Chesapeake's most significant creditors, holding large portions of its debt.The sources requested anonymity because the bankruptcy preparations are confidential. Chesapeake and Franklin did not immediately respond to requests for comment.Chesapeake, which employed about 2,300 people as of the end of last year, skipped an interest payment on debt due on Monday, two of the sources said. Another obligation looms on July 1.Story continuesIn May, the company warned it might seek bankruptcy protection, and added that there was substantial doubt about its ability to continue as a going concern. Reuters in April reported Chesapeake was preparing a potential bankruptcy filing.Chesapeake helped pioneer the extraction of oil and gas reserves from shale rock formations, an environmentally controversial process called hydraulic fracturing, or fracking.McClendon and Oklahoma businessman Tom Ward founded Chesapeake with a small investment in 1989. McClendon became the company's chairman and chief executive. The company was named for his love of the Chesapeake Bay region around Maryland and Virginia.Over time, the company snapped up land across the United States and became a dominant player in fracking, with McClendon believing that natural gas could eventually supplant oil and coal for energy needs. By 2005, Chesapeake was the second-largest U.S. natural gas producer behind only Exxon Mobil Corp <XOM.N>.McClendon helped create tens of thousands of jobs for the Oklahoma City area and became a well-known community philanthropist while running Chesapeake. He was a part owner of the Oklahoma City Thunder professional basketball team, which he helped bring to town. The team still plays in the Chesapeake Energy Arena.A natural gas glut reversed Chesapeake's fortunes, and prices fell over the past decade. McClendon relinquished his chairmanship and stepped down as chief executive in 2013, as investigations swirled into possible antitrust violations and whether he blurred lines between his personal dealings and those of the company.A federal indictment in March 2016 charged McClendon with conspiring to suppress land prices by rigging bids for leases while he led Chesapeake. At the time, he disputed the charge and vowed to prove his innocence.McClendon died in a single-car crash the following day, which a state medical examiner later determined to be an accident.Chesapeake last year started reworking its balance sheet and pushed out some debt maturities while attempting to pivot away from gas toward a greater emphasis on oil production.But the coronavirus outbreak, which resulted in a sharp travel downturn, and a Saudi-Russian oil price war upended the company's plans.(Reporting by David French and Mike Spector; Editing by Christian Schmollinger)"}]}