{"article": [{"url": "https://finance.yahoo.com/news/airline-hotel-industry-reps-both-say-their-rebound-depends-on-the-return-of-business-travel-180251163.html", "published": 1601385020.0, "headline": "Airline, hotel industry reps both say their rebound depends on the return of business travel", "body": "U.S. airlines received $25 billion of payroll stimulus help from the government back in April. Now that relief is set to expire this week, the near future for the industry is little improved, and now its workers are desperate for another $25 billion in government help.Delta Air Lines, United Airlines, and American Airlines all have plans to lay off or furlough tens of thousands of airline employees this week if Congress doesn’t agree on another relief package.Air travel has yet to return to even half of the pre-pandemic daily levels, and the International Air Transport Association (IATA) in July pushed back its target to 2024 for when air travel will return to pre-pandemic levels.Much has been made about whether Americans are ready to travel again and feel safe doing so, but industry representatives say the issue isn’t passenger comfort level or pleasure travel: it’s the dearth of business travel. (Business passengers typically comprise 75% of airline profits.)Over the Labor Day weekend, airlines on average saw 50% passenger capacity from one year prior, which was actually an improvement over the past few months. But they only saw 25% of the revenue from one year prior, due to blocked-off seats, slashed ticket prices, and lack of business travelers.“Even as leisure travel might pick up a little bit, we don’t see that business travel,” says Sara Nelson, president of the Association of Flight Attendants. “And we don’t see that business travel because people don’t have a place to go to, these businesses have canceled all of their conventions. I have to tell you, I think that is more the issue than the safety issue. It’s really more about the demand because of the other impacts of coronavirus and people not having those business meetings, not having something to go to: to a casino, to restaurants, to a resort. All of those things are going to have to return for the airline industry to return.”UNITED STATES - SEPTEMBER 9: The Association of Flight Attendants and fellow aviation workers protest outside the U.S. Capitol on Wednesday, Sept. 9, 2020. The flight attendants urged Congress to pass a COVID-19 relief package and extend the Payroll Support Program. (Photo By Bill Clark/CQ-Roll Call, Inc via Getty Images)The hotel industry, which has also suffered severe layoffs and faces prolonged pain, is saying the same thing: lack of business travel is the real problem.Story continuesAccording to the American Hotel and Lodging Association (AHLA) at the end of August, 40% of U.S. hotel employees are still not working, the industry is down 4.3 million jobs since February, and 65% of U.S. hotels remain at or below 50% occupancy, which for many hotels is below their break-even point.“This summer, leisure travel was OK, it certainly wasn’t great, nothing close to what last year was, but I think it was as good as we could have expected for leisure travel,” says AHLA president Chip Nelson. “The problem is there’s no business travel, and there’s absolutely no meetings, conventions, and conferences. Because of that, we’re looking at about three quarters of hoteliers saying if there’s no additional fiscal stimulus from Congress, then they’re going to have lay more people off.”The AHLA implemented an industrywide “Safe Stay” cleaning protocol to make travelers feel more comfortable, but business travelers don’t have a business purpose to travel, which makes their comfort level irrelevant.Nelson adds that in cities like Orlando and Las Vegas, “If they don’t get convention business, they can’t survive. But it’s not just places like that. Chicago, New York City, these are places that thrive on the convention business.”As companies continue to have employees work from home and convert in-person conferences to virtual events, airlines and hotels will continue to suffer, and both industries want more government aid. Of course, that is not without controversy, as there are a range of service industries (think: restaurants) that are also suffering, and view further aid to airlines as an unwarranted government bailout.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Best Western CEO says Airbnb can't promise the cleanliness hotels can during pandemicAirbnb has been brutalized by the pandemic, but will IPO anyway in 'forgiving' marketDisney, WB are sending a clear signal: Americans aren't ready to return to movie theatersCurbside pickup is ‘exceptionally sticky’ and will continue post-pandemic: McKinsey retail analystUber Eats is bigger business than Uber rides right now, but far from profitable"}]}