{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-silicon-valley-ipos-venture-capital-funding-160017062.html", "published": 1594724900.0, "headline": "Coronavirus depresses venture capital funding, but deal activity and IPOs rebound in Q2", "body": "U.S. venture capital activity ticked up slightly in the throes of the coronavirus pandemic, though funding is still depressed from a year ago.According to a new PwC and CB Insights report, VC firms backed 1,374 deals in the second quarter of 2020, up 3% from the first quarter, but down 18% year-over-year.The fourth quarter of 2018 remains a historical milestone by one measure: U.S. companies raised a total of $40.1 billion in venture capital, the highest ever recorded in a single quarter. While that number has plummeted to $26.9 billion in the second quarter of this year, deal activity has still managed to reverse the three-quarter decline that the industry had been experiencing.When the coronavirus capsized the economy in the first quarter, which ends at the end of March, many VCs speculated that there would be more cautious and disciplined investing. But, the data suggests that perhaps some of the deals that were shelved were delayed to the second quarter.Sixty-nine companies raised mega-rounds, or financing of $100 million or more, in the quarter, hitting a new record. Stripe, Palantir, Sana Biotech, DoorDash and Magic Leap were the five largest deals.Unicorn on hilltopMeanwhile, the birth of unicorns fell for the fourth consecutive quarter, with only 11 new additions to the $1 billion valuation club. Still, the total population of U.S. unicorns is climbing, with 209 startups making the cut.Regarding liquidity events, the number of mergers and acquisitions fell to 120 in Q2, compared to the 155 in Q1. Notably, in the food delivery space alone, U.K.-based Just Eat Takeaway scooped up GrubHub for $7.3 billion and Uber bought Postmates for $2.7 billion.But more startups took the route of an initial public offering. After three quarters of declines, 24 VC-backed U.S. companies went public in Q2, up from 15 in Q1. The public market had several consumer-facing entrants, ranging from Tesla competitor Nikola (NKLA) to insurance company Lemonade (LMND) and used car seller Vroom (VRM).Story continuesMelody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Social network of 9,000 Black professionals will be much more than 'just a Black talent pool': CEO'People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talentDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperityIf Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and more"}]}