{"article": [{"url": "https://finance.yahoo.com/news/apple-store-closing-states-coronavirus-163844235.html", "published": 1593690380.0, "headline": "Apple is closing stores in these 11 states as coronavirus outbreaks soar", "body": "An employee wearing a protective face covering, right, monitors the flow of customers at an Apple retail store along Lincoln Road Mall during the new coronavirus pandemic, Wednesday, June 17, 2020, in Miami Beach, Fla. (AP Photo/Lynne Sladky)Apple (AAPL) is once again temporarily closing stores in the U.S. where COVID-19 cases are skyrocketing amid a resurgence of the coronavirus. The company is closing a whopping 77 stores across 11 different states on July 2, as those regions report record cases of the virus.States impacted by the move are Alabama, California, Florida, Georgia, Idaho, Louisiana, Nevada, Oklahoma, Mississippi, Texas, and Utah.Of the states, California will see the most store closures, with Apple shuttering 15 locations in the region. Texas is next, with the company closing 10 of its retail stores in the state.Apple previously moved to close stores in Arizona, Florida, North Carolina, and South Carolina, states that were among the first to see a dramatic rise in new cases in June.“Due to current COVID-19 conditions in some of the communities we serve, we are temporarily closing stores in these areas,” Apple said in a statement provided to Yahoo Finance at the time.Apple shut all of its stores across the world during the coronavirus pandemic, initially focusing on China, where the virus first appeared. By the time the outbreaks began to subside there and Apple was opening its stores in that country, the virus had spread worldwide, forcing Apple to shutter all stores outside of mainland China.Apple has been one of the first movers in closing its stores, allowing it to serve as a kind of indicator of conditions in regions impacted by the virus. There’s no word yet as to how long the stores will be closed or when they’ll be reopened.Here’s a list of the store locations that Apple has closed:Alabama- The SummitCalifornia- Glendale Galleria- Northridge- Pasadena- The Grove- Third St. Promenade- Century City- Manhattan Village- Beverly Center- Sherman Oaks- Topanga- Los Cerritos- The Americana at Brand- Valencia Town Center- Victoria Gardens- The OaksFlorida- St. Johns Town Center- University Town CenterGeorgia- Cumberland Mall- Perimeter- Lenox SquareStory continues- Avalon- Mall of GeorgiaIdaho- Boise Towne SquareLouisiana- Baton Rouge- Lakeside Shopping CenterNevada- Fashion Show- The Forum Shops- Town Square- SummerlinOklahoma- Penn Square- Woodland HillsMississippi- Renaissance at Colony ParkTexas- Barton Creek- Domain Northside- La Cantera- North Star- Knox Street- Northpark Center- Galleria Dallas- Ciello Vista Mall- Southlake Town Square- University Park VillageUtah- Station Park- City Creek Center- Fashion PlaceThere are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Despite growing ad boycott, Facebook is too big for many advertisers to ignoreHow iOS 14 will change your iPhone forever: Tech SupportApple’s switch from Intel to its own chip is its smartest move in yearsApple to close retail stores in 4 states amid coronavirus outbreaksFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}