{"article": [{"url": "https://finance.yahoo.com/news/why-tenets-staggered-rollout-plan-could-be-a-risky-move-amid-ondemand-boom-133823714.html", "published": 1596876380.0, "headline": "Why 'Tenet's' staggered rollout could be a risky move as on-demand movies soar", "body": "Christopher Nolan’s “Tenet” has officially selected its China theatrical release date.The movie will debut in China on September 4 following an international rollout that will begin August 26, before hitting select U.S. theaters on September 3.Although not unprecedented, the staggered rollout is a risky move for the $200 million tentpole. Piracy and spoiler risks remain top of mind, with the majority of U.S. theaters still in lockdown-mode.But R. Riley FBR analyst Eric Wold recently noted that “a perfect date may never arrive for studios to release films under the traditional day-and-date model.”He added that it supports the notion that a gradual “Tenet” release plan “would allow for the studio to begin monetizing the film theatrically in a way that would not [cannibalize] potential box office revenues, and help to build buzz for when the film opens into other markets.”Still, a staggered rollout directly contradicts the decision made by fellow blockbusters like Disney’s live-action “Mulan” (DIS) and NBCUniversal’s “Trolls World Tour” (CMCSA). Both media giants opted to skip the theatrical experience entirely, and go directly on-demand.On Disney's second quarter earnings call, the company announced that “Mulan” will head straight to streamer Disney+ as a premium video on demand (PVOD). The offering will cost Disney + subscribers $30, and will be available on September 4th.If successful, Disney could see a sizable return on revenue as it would retain 100% of the PVOD profits, as opposed to the 60/40 split that typically occurs when a studio film is released in the theater.Disney's live-action \"Mulan\" will bypass the theatrical experience and head straight to Disney+ on September 4 as a premium video on demand offeringMeanwhile, “Trolls World Tour,” the industry’s first surprise digital success story during the coronavirus outbreak, nabbed nearly $100 million in on-demand sales for NBCUniversal during its first three weeks. The streaming win has since created a ravenous on-demand appetite for other production houses eager to earn money on stalled releases.However, an on-demand release never seemed to be in the cards for “Tenet,” as director Christopher Nolan has maintained his position that the sci-fi thriller needs a theatrical debut.Story continues“Tenet” director Christopher Nolan has maintained his position that the sci-fi thriller needs a theatrical debut“Chris really would like to be coming out with the film that opens theaters,” IMAX CEO Richard Gelfond said on the company's Q1 earnings call back in April (IMAX). “I don’t know anyone in America who is pushing harder to get the theaters re-opened and to get his movie released than Chris Nolan.”And it looks like international markets agree.Over this past weekend, China saw its largest single-day gross since reopening after the re-release of Nolan’s “Interstellar.” The surge is prompting other titles like “Little Women” to also lock in China re-release dates as theaters get back on their feet.In what seems like optimistic news for the U.S., AMC (AMC) announced that it expects to open two-thirds or more of its U.S. theaters in August. The stock surged on the news despite the company’s disastrous quarterly earnings results, which saw revenue decline 99%.Alexandra is a Producer & Entertainment Correspondent at Yahoo Finance. Follow her on Twitter @alliecanal8193Read more:Beyoncé's 'Black Is King' underwhelms on Disney+ as 'Hamilton' holds strong, data showsAnalyst: VOD deal between NBCUniversal, AMC will likely 'dampen movie attendance,' hurt industryNetflix a 'force to be reckoned with' with Emmy nods, but here's why competitors still have a shotA tale of two streamers: Netflix hits a rough patch as Peacock spreads its wings"}]}