{"article": [{"url": "https://finance.yahoo.com/news/ben-carson-all-new-hud-rule-does-is-provide-permanent-employment-for-lawyers-214419429.html", "published": 1594745540.0, "headline": "Ben Carson: All Obama HUD rule does is provide ‘permanent employment for lawyers’", "body": "The protests following the death of George Floyd have exposed institutional racism that extends far beyond policing. The racial gap in homeownership between Black and white Americans, for instance, is worse now than it was in the 1960’s.A report by the Urban Institute says that “the gap in the homeownership rate between black and white families in the US is bigger today than it was when it was legal to refuse to sell someone a home because of the color of their skin.”The U.S. Department of Housing and Urban Development published a plan last August that critics say would make it harder to prove housing discrimination. Rather than allow plaintiffs to use statistical evidence to claim a developer or lender has policies that have a disparate impact on minorities, they would have to clear more hurdles and prove that those policies are “arbitrary, artificial and unnecessary.”With the recent spotlight shed on issues of racial discrimination, the National Association of Realtors and lenders, including Bank of America, have urged President Trump’s administration to drop the plan.President Donald Trump listens as Housing and Urban Development Secretary Ben Carson speaks during a coronavirus task force briefing at the White House, Saturday, March 21, 2020, in Washington. (AP Photo/Patrick Semansky)“We have all heard the legitimate concerns that have been raised that the proposed rule could make it more difficult to ensure that the Fair Housing Act’s protections and avenues of redress against unlawful discrimination are available to all Americans,” wrote Bank of America Vice Chairman Anne Finucane to Deputy HUD Secretary Brian Montgomery on June 29.In an exclusive interview with Yahoo Finance, HUD Secretary Ben Carson responded to Bank of America’s letter.“I’m very glad that Bank of America is interested in this issue. And you know, they could do a whole lot to improve the situation for minorities by rejoining the FHA’s program for housing. FHA, as you know, is the largest backer of insurance for forward mortgages for minorities, for first-time homebuyers, doing over a million cases last year. Bank of America did about 2,200. So if they really want to have an impact, this is what they should be thinking about, rather than criticizing a program that they haven't even seen and don't know anything about,” said Carson.Story continuesIn a statement to Yahoo Finance, Bank of America spokesperson Bill Halldin said, \"Bank of America is committed to fair lending and supporting communities of color. We look forward to continuing to work with Secretary Carson.\" The bank launched a $5 billion affordable homeownership initiative last year.Carson defended HUD’s efforts to change the disparate impact standard. “What people need to understand is it is so wide and so broad the way it is written, all it provides is permanent employment for lawyers,” he said, referring to the rule as it was under President Obama with a lower bar to prove discrimination.In response to the announcement of the regulation change last year, the Center for Responsible Lending said in a statement: “backtracking on disparate impact theory will hurt borrowers’ access to safe and affordable mortgage credit as well as hurt lenders’ bottom line. Moreover, it will perpetuate racial homeownership rate gaps and wealth gaps, especially today’s low Black homeownership rate that stands at 40.6 percent, which is lower than when the Fair Housing Act became law in 1968.”HUD rejects criticism that its actions would weaken efforts to combat housing discrimination. “If anybody knows of discrimination cases in housing, please tell us, because we are on them like white on rice,” said Carson.More from Sibile:Why Black patients receive worse care at the hospitalCost of Confederate symbols comes out of Black workers’ paychecks: EPIThe upside of Trump’s Fourth of July fireworksThe case for higher wages during coronavirus recessionMaster P on Aunt Jemima, Uncle Ben’s: ‘Those are not real people’Find live stock market quotes and the latest business and finance news"}]}