{"article": [{"url": "https://finance.yahoo.com/news/3-reasons-worry-about-stock-market-morning-brief-102554022.html", "published": 1597124000.0, "headline": "3 challenges facing the stock market right now: Morning Brief", "body": "Tuesday, August 11, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAnd why one strategist thinks investors should look past these risks.Stocks opened the week with a mixed session as tech stocks lagged and cyclical sectors lead the way higher.As of Monday’s close, the S&P 500 is now just 0.4% below a record high.But in a note to clients published Monday, Morgan Stanley’s Mike Wilson outlined the three issues right now that are cause for concern among investors — rising COVID case counts, a looming fiscal cliff, and a Democratic sweep in November.And while stocks have tempered the pace of their advance since June, the market has indeed pushed higher even as risks to the outlook have mounted.“Most stocks have been in a correction/consolidation since June 8 when the equal-weighted S&P 500 made its recovery highs (that have yet to be taken out),” Wilson writes. “Many of the weakest stocks since then were some of the biggest winners during the initial rally of this new bull market — i.e., the re-opening/recovery winners. The reasons for this correction are 3-fold — new COVID case [spikes], concerns about a potential Blue Sweep in this year’s U.S. election, and the looming fiscal cliff.”Amid this backdrop, however, Wilson sees the recovery narrative remaining very much intact. And suggests that investors not scramble only into stocks that benefit from a prolonged pandemic but keep or increase exposure to more cyclical sectors that could benefit from a return to something more normal.Additionally, two of these three worries are currently being tempered to some degree.Case counts across the country have been declining in recent weeks and we’re now nearly a month past the July 16 record of more than 75,000 positive daily tests. And the “fiscal cliff” that consumers were sent off when enhanced unemployment benefits expired with no replacement on July 31 came and went without much market reaction. Investors, it seems, are more than comfortable betting on Congress getting something done. Even if it takes a while.Story continuesThe Trump administration has also signed executive orders in recent days deferring payroll taxes, suggesting the White House retains an appetite for more fiscal support for consumers.And as for the election? Well, stocks tend to do better under Democratic presidents anyway.“We view these real concerns as bumps along the road of what we believe should ultimately be a very sharp and persistent recovery,” Wilson writes.Wilson adds that earnings season has highlighted a few of the themes we discussed in the Morning Brief last month, many of which are positive for the market.Results are currently topping expectations, cost cuts are protecting profit margins, and the median company’s earnings are holding up better than index-level declines. Aggregate S&P 500 earnings have declined about 33% in the second quarter, but the median company has seen earnings fall just over 14%. Big declines in energy, airlines, and banks have dragged down the average drop in earnings.All of which suggests that investors are not betting on some outcome that is entirely detached from reality.Moreover, Wilson sees earnings season as affirming the core of his bullish thesis that positive operating leverage dynamics — essentially the ability to grow profit without increasing costs — should support stocks next year.“The bottom line,” Wilson writes, “is that equity markets may not be as dislocated from reality as many have been suggesting.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy6:00 a.m. ET: NIFB Small Business Optimism, July (100.5 expected, 100.6 in June)8:30 a.m. ET: PPI Final Demand, July MoM (0.3% expected, -0.2% in June)8:30 a.m. ET: PPI excluding food and energy, July MoM (0.1% expected, -0.3% in June)8:30 a.m. ET: PPI final demand, July YoY (-0.7% expected, -0.8% in June)8:30 a.m. ET: PPI excluding food and energy, July YoY (0.0% expected, 0.1% in June)Earnings6:00 a.m. ET: Nio (NIO) is expected to report an adjusted loss of 1.66 CNY on revenue of 3.49 billion CNY7:00 a.m. ET: InterContinental Hotels (IHG) is expected to report adjusted earnings of 60 cents per share on revenue of $1.16 billionTop NewsEuropean stocks climb as investors brush off US-China tensions [Yahoo Finance UK]Chinese firms that fail U.S. accounting standards to be delisted as of 2022: Mnuchin [Reuters]Brooks Brothers bidding narrows to venture backed by new Barneys owner [Bloomberg]SoftBank returns to profit after record losses [Bloomberg]YAHOO FINANCE HIGHLIGHTSTrump's tricky tax ployTesla has raised close to $20 billion, Nikola founder says it won't have to raise as much money‘We see it here every day’: How a slowdown in the Postal Service is impacting small businesses—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}