{"article": [{"url": "https://finance.yahoo.com/news/trumps-housewife-myth-201954322.html", "published": 1597418840.0, "headline": "Trump's 'housewife' myth", "body": "I’m not a suburban housewife, so I can’t speak for this coveted cohort. But it’s a safe bet that far fewer women consider themselves suburban housewives than President Trump seems to think.Trump has begun wooing these voters amid reports that his Democratic presidential foe, Joe Biden, has a commanding lead among female voters—especially now that Biden has named a Black woman, Sen. Kamala Harris, as his running mate. “The ‘suburban housewife’ will be voting for me,” Trump tweeted on Aug. 12. “They want safety & are thrilled that I ended the long running program where low income housing would invade their neighborhoods. Biden would reinstall it, in a bigger form.”For anybody who needs a translation, “low-income housing” is code for minorities and immigrants who are most likely to inhabit it. When Trump addresses the “suburban housewife,” he obviously thinks he’s speaking to a married white woman with kids who doesn’t have or want a paying job and worries about non-white families moving to her neighborhood. How many such women are there?Some, probably. But the placidly domesticated TV mom from the 1950s has become something of a rarity, and wasn’t even all that common back then. “Trump is nostalgic for this TV version of events that never really existed,” says sociologist Sarah Jane Glynn of the left-leaning Center for American Progress. “The majority of women under 65 work, and most mothers work. And for immigrant families, working-class families, and women of color that was never their reality.”Men participate in the labor force more than women, but the gap has been narrowing for decades. The latest numbers show the labor force participation rate is 67.1% for men and 56% for women. That includes everybody over 16, whether they’re parents or not.Trump has begun wooing \"suburban housewife\" voters. (Getty Images)Mothers work at a higher rate than women overall. Census data shows that the portion of mothers who work at a paying job rose from 56.3% in 1976 to 69.6% in 2017, the last year for which data is available. Forty-one percent of mothers are sole or primary breadwinners, earning at least half the total family income. Another 23% of mothers are “co-breadwinners” who earn at least 25% of the family income.Story continuesOversimplification of suburbsIt’s hard to break down these numbers according to who lives in cities, suburbs and rural areas. But here, too, Trump seems to be stuck on the oversimplified notion of suburbs as white-only enclaves. “White flight” has definitely been a real phenomenon, with wealthier whites abandoning cities for suburbs with better schools and fewer challenges. But recent trends have included gentrification and urbanization, with wealthy whites going the other direction and even threatening to push minorities out of some urban areas as living costs rise.This still leaves some women who fit Trump’s profile of (white) non-working moms living in the suburbs. But that doesn’t mean they fear minorities moving in and want Trump to protect them. Trump clearly tapped into a current of socioeconomic fear in 2016, when his vilification of immigrants and his outreach to working-class whites launched his surprise bid to the White House. The question is whether Trump can expand on that in 2020 by winning suburban women who didn’t support him in 2016.He probably can’t. In six swing states likely to determine the presidential election outcome, the portion of mothers with kids under 18 who work ranges from a low of 68.7% in Arizona to a high of 80.8% in Wisconsin. In other words, only a small portion of mothers in swing states fit Trump’s dated notion of a non-working housewife. Working mothers care about a lot of political issues, including personal safety and property values. But they arguably care more about education, health care, child care and equal pay for equal work. Trump isn’t talking to housewives about those issues. Biden is, but without calling those voters housewives.Trump’s blatant appeal to racial fear will certainly win some votes in 2020, as it did in 2016. But #HousewivesForTrump aren’t likely to be a large constituency. If anything, Trump probably has to worry about #HousewivesAgainstTrump.Share your thoughts on Trump’s appeal to “suburban housewives” on Twitter: Tweet @YahooFinance with a hashtag #YFHousewives.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Trump is martyring the postal serviceTrump’s tricky tax ploy11 ways Trump is out of touch with votersA double-dip recession is formingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}