{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-cdc-astra-zeneca-moves-heat-up-vaccine-hopes-gsk-sanofi-start-phase-1-165731410.html", "published": 1599134720.0, "headline": "Coronavirus update: CDC, Fauci optimism fan vaccine hopes; GSK, Sanofi start Phase 1 trials", "body": "America’s race for a COVID-19 vaccine is heating up on multiple fronts, raising hopes that a cure can be found sooner rather than later — but is also stirring up concerns about politics influencing the process.A letter from the U.S. Centers for Disease Control and Prevention (CDC) last week indicates the federal government is likely to push through an emergency use authorization, at the least, before the start of November.Authored by CDC director Dr. Robert Redfield, it asked states to be prepared to distribute a vaccine by November. In an exclusive interview on Wednesday with Yahoo Finance, he reiterated that timetable.“We're preparing earnestly for what I anticipate will be reality, is that there will be one or more vaccines available for us in November, December,” Redfield said.Meanwhile, Dr. Anthony Fauci, director of the National Institute for Allergy and Infectious Diseases (NIAID) has said the safety board that monitors clinical trials could be morally obligated to approve a fast-track, if benefits are overwhelmingly better than the risks seen early on in Phase 3 trials. Fauci told CNN on Thursday that a vaccine by October was a “conceivable” goal.But even as the COVID-19 casualty count rises — and companies and regulators accelerate plans to have an inoculation ready to roll within months — at least a few health experts have voiced worries about the safety of a product that was approved or authorized on such an aggressive timetable.“It seems a bit premature to say that there’s going to be a vaccine as early as November. That just seems scientifically unfeasible,” Meharry Medical College CEO and president Dr. James Hildreth told Yahoo Finance on Thursday.The vaccine has been seen as a critical endpoint to the pandemic, which has sickened more than 26 million globally and killed more than 864,000. In the U.S., more than 6.1 million have been affected, and while deaths have slowed, nearly 186,000 have lost their lives to the virus.Story continuesThere are over 6 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)Super-spreader events like a motorcycle rally in South Dakota have sparked a new surge in the Midwest, with states like Idaho emerging as new hotspots in the past week.Health officials have warned the remainder of the year could see a second wave in all parts of the country. Coinciding with flu season, a rise of new infections could over-burden hospitals once again.Meanwhile, administration officials have sought to blunt concerns about politics. U.S. Food and Drug Administration (FDA) Commissioner Stephen Hahn announced on Wednesday meetings of an independent advisory board are in the works, and that those meetings will be public.Separately, Health and Human Services (HHS) Sec. Alex Azar told CBS Thursday the push to approve a vaccine is not political and has been determined by some of the most respected officials in the country. He referenced the support of the CDC’s Dr. Nancy Messonnier, who is director of the Center for the National Center for Immunization and Respiratory Diseases.The date “came out of the career people at the CDC,” and questions about the date would have to be pointed to Messonnier, Azar said.Through Operation Warp Speed, three candidates have now entered late-stage trials, with at least one more anticipated by the end of the month. Of those, the two front-runners include Moderna (MRNA) and Pfizer (PFE) with BioNTech (BNTX).The former is working closely with and funded by the administration and the National Institute of Health, while the latter are developing theirs independently, with a purchase order already in place from the U.S. government. Pfizer has also indicated the company anticipates the next step, regulatory review, is likely to be done by October.But of the 30,000 trial participants needed in each study, only about half are enrolled.Meanwhile, GlaxoSmithKline (GSK) and Sanofi (SNY) began Phase 1 trials of a coronavirus vaccine they are jointly manufacturing Thursday. The companies expect results by the end of the year and a vaccine on the market by the first half of 2021.Also on Thursday, AstraZeneca (ASK) signed a manufacturing deal with privately held Albany Molecular Research to produce millions of doses of the British drugmaker's experimental coronavirus vaccine annually. The company is also receiving U.S. federal funding to develop and distribute its vaccine candidate, which is co-developed by Oxford University. The Department of Defense announced five trial sites have been selected for Phase 3.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}