{"article": [{"url": "https://finance.yahoo.com/news/benioff-renews-facebook-criticism-as-harmful-as-cigarettes-125403854.html", "published": 1593244940.0, "headline": "Salesforce's Benioff blasts Facebook, renews 'cigarettes' charge: 'They're after your kids'", "body": "Salesforce (CRM) CEO Marc Benioff renewed his long-standing critique of Facebook (FB), as the social platform comes under withering criticism for its content policies.Ahead of a polarizing general election, Facebook is embroiled in a controversy around the spread of misinformation and its content moderation policies. As part of a coalition called “Stop Hate for Profit” organized by the NAACP and the Anti-Defamation League, among others, nearly 100 companies have hit pause on advertising during the month of July — the latest being Coca-Cola (KO).In an interview with Yahoo Finance, Benioff once again blasted Facebook for being “the new cigarettes. It’s addictive. It’s not good for you. They are after your kids.” He pointed to Messenger Kids, Facebook’s product for children that functions as a free video and messaging app that can be controlled by parents.The outspoken tech CEO first made the cigarettes comparison at the 2018 World Economic Forum, months before the Cambridge Analytica scandal surfaced.In a statement issued Friday, Facebook defended itself by saying it spends “billions” on content moderation, and works with experts to promote online safety.“We know we have more work to do, and we’ll continue to work with civil rights groups...and other experts to develop even more tools, technology and policies to continue this fight,” it added.However, Benioff charged that Facebook’s policies imply that “their highest values are not truth and trust, that they don’t really care what the quality is of their content on their platform.”He added: “That’s amazing to me. And you know, if your company values are not about truth, the highest value and most important thing to you in the business world, is not about trust, I don’t have a lot of time for that. That’s amazing.”Facebook’s ad dollars squeezedFacebook Chairman and CEO Mark Zuckerberg testifies in front of a projection of a \"Zuck Buck\" at a House Financial Services Committee hearing examining the company's plan to launch a digital currency on Capitol Hill in Washington, U.S., October 23, 2019. REUTERS/Erin Scott TPX IMAGES OF THE DAYThe “Stop Hate for Profit” campaign asked companies to pause advertising, the bulk of Facebook’s revenues, during July, as a way to crack down on the social network’s policies governing hate speech. Among those suggest changes for the social network is automatically removing ads from content labeled as misinformation or hate, and letting advertisers know their ads ran by such content.Story continuesSome big names have come on board, including The North Face, Patagonia, and Yahoo Finance’s parent company Verizon (VZ), all hitting pause on advertising next month. Late Friday, Coke made the decision to suspend all social media ad spending for at least 30 days, pending a wider strategy review.“So this is a moment in time where all of us have to ask that question for our companies. Number one, what are our most important values? What are the values?” Benioff told Yahoo Finance.“But when we look at a company like Facebook or other social media, where we’re getting news and information, and it might not be accurate, or we might be being misled, or there might be misinformation... we’ve got to come back to truth and trust,” the billionaire added.Benioff and his wife also own Time magazine, which he purchased in 2018. He emphasized that news publishers and social media have a responsibility to give the public “true information” — especially with a pandemic roiling society.“Otherwise, you’re going to end up with more sick people, who wants that?”Julia La Roche is a Correspondent at Yahoo Finance. Follow her on Twitter."}]}