{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-october-2-2020-221241295.html", "published": 1601651420.0, "headline": "Stock market news live updates: Stocks curb losses, but end lower on Trump virus fears, soft jobs data", "body": "Stocks fell Friday, but pared earlier loses, after President Donald Trump revealed he had tested positive for Covid-19, injecting further uncertainty into an environment roiled by the coronavirus and the upcoming election.The Labor Department’s September jobs report showed the economy added 661,000 new positions last month, below Wall Street’s expectations and cementing the belief that the recovery is losing steam. The figures should add to the urgency being heaped on Congress and the White House to enact a new stimulus bill ahead of Election Day, but talks have largely stagnated in recent weeks.Overnight, the world was rocked by the revelation that the president and First Lady Melania Trump, who also tested positive for Covid-19, would begin the “quarantine and recovery process immediately.” The White House has canceled all of Trump’s previously scheduled public events, which included a rally in Florida on Friday.The three major indices sold off on the news, but pared some losses as the session rolled on, after White House chief of staff Mark Meadows said Trump was experiencing just “mild symptoms.” The Dow fell by as many as 434 points, or 1.6%, at session lows Friday morning. The Nasdaq lagged as tech stocks gave back Thursday’s advances.The risk-off mood broadened out into other asset classes as well, with crude oil prices extending Thursday’s drop to plunge another 4%.“Markets (being impersonal) will focus on whether this affects the election outcome or public health policy,” UBS economist Paul Donovan said in a note Friday. “The future presidential debates may not happen; these were not seen as especially significant. Those opposed to mask-wearing may revise their views, and the president's experience may impact US public health policy.”Other members of the Trump administration reported negative tests for Covid-19. Treasury Secretary Steven Mnuchin and Vice President Mike Pence each tested negative for the coronavirus, according to their respective spokespeople.Story continuesThe moves in equity markets were a sharp contrast to the strong advances during Thursday’s regular session, when a tech-led advance powered the Nasdaq higher by 1.4%. Gains in the S&P 500 and Dow, however, had been much more muted. The two indices lost steam in afternoon trading, after discussions between House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin on Thursday apparently yielded no agreement on a virus-related relief proposal. Republican and Democratic lawmakers remain far apart on the dollar amount of another round of stimulus, as well as on details on sums for state and local aid.House Democrats, however, still on Thursday evening voted to advance their $2.2 trillion stimulus proposal unveiled earlier this week. However, the package is almost certain to be struck down by Senate Republican lawmakers, who have balked at the high price tag of the proposal.—4:01 p.m. ET: Stocks end lower as tech stocks slide, after Trump tests positive for Covid-19Here’s where the three major indices settled at the end of Friday’s session:S&P 500 (^GSPC): -33.07 points (-0.98%) to 3,347.73Dow (^DJI): -133.49 points (-0.48%) to 27,683.41Nasdaq (^IXIC): -251.49 points (-2.22%) to 11,075.02—1:02 p.m. ET: Dow turns positive as markets cut losses furtherThe three major indices pared more losses Friday afternoon and the Dow popped into slightly positive territory.Here were the main moves in markets, as of 1:03 p.m. ET:S&P 500 (^GSPC): -16.19 points (-0.48%) to 3,364.61Dow (^DJI): +1.86 points (+0.01%) to 27,818.76Nasdaq (^IXIC): -196.45 points (-1.73%) to 11,130.75Crude (CL=F): -$1.18 (-3.05%) to $37.54 a barrelGold (GC=F): -$3.30 (-0.17%) to $1,913.00 per ounce10-year Treasury (^TNX): +2.4 bps to yield 0.701%—11:07 a.m. ET: Stocks cut losses, Dow sheds 100+ pointsThe three major indices held lower in intraday trading, but came off session lows after Trump’s Covid-19 symptoms were reported as “mild” and other members of his administration reported negative test results.The S&P 500 fell 0.8% shortly after 11 a.m. ET, with the utilities, materials and industrials sectors in the green. The communication services, information technology and energy sectors lagged.—10:02 a.m. ET: Consumer sentiment improved in late September to a six-month high: U. MichiganThe University of Michigan’s final September consumer sentiment index increased more than expected, reflecting a pick-up in consumers’ assessments of current conditions and outlook for the economy, according to a statement Friday.The index ticked up to a six-month high of 80.4 in the final September print from 74.1 in August. The preliminary September print had been at 78.9.“While consumers have anticipated gains in the national economy ever since the April shutdown, the September survey recorded a significant increase in the proportion that expected a reestablishment of good times financially in the overall economy,” Richard Curtin, Surveys of Consumers chief economist, said in a statement.“The recent gains are encouraging even though they were largely due to upper income households. Indeed, the data indicate that lower income households face continued income and job losses compared with the modest gains expected by upper income households,” he added. “Without a renewed federal stimulus and enhanced unemployment payments, the income gap will widen.”—10:00 a.m. ET: Factory orders rise less than expected in August as manufacturing activity slowsUS factory orders rose 0.7% in August, the Commerce Department said Friday, marking a slowdown from July’s upwardly revised 6.5% gain. Consensus economists were looking for August factory orders to increase 0.9%.Excluding transportation orders, orders for new manufactured goods also rose 0.7%, missing consensus estimates for a 1.1% rise.—9:31 a.m. ET: Stocks open lower as political uncertainty roils marketsHere were the main moves in markets, as of 9:31 a.m. ET:S&P 500 (^GSPC): -47.13 points (-1.39%) to 3,333.82Dow (^DJI): -341.17 points (-1.23%) to 27,475.73Nasdaq (^IXIC): -191.86 points (-1.69%) to 11,132.48Crude (CL=F): -$1.90 (-4.91%) to $36.82 a barrelGold (GC=F): -$7.50 (-0.39%) to $1,908.80 per ounce10-year Treasury (^TNX): -0.4 bps to yield 0.673%—8:30 a.m. ET: Economy created fewer jobs than expected last monthThe September jobs report was a letdown: There were 661,000 jobs added during the month, below consensus forecasts of 859,000, but the unemployment rate fell to 7.9%. Meanwhile, August’s figures were revised up slightly to nearly 1.5 million (versus 1.37 million prior).All told, September’s figures cement the belief that the recovery is losing steam, and adds to Wall Street’s gloom in the wake of Trump contracting COVID-19. Futures are down more than 1%, pointing to a rough day when the opening bell rings at the NYSE.—8:20 a.m. ET: Tesla delivers record number of vehicles in Q3Tesla (TSLA) reported third-quarter deliveries of 139,300 for a record single-quarter sum and jump of 44% year-over-year. The sum was well above consensus estimates for 129,950, according to Bloomberg data.The electric vehicle maker has targeted delivering some 500,000 vehicles in 2020, after delivering about 367,500 in 2019. For the year to date, the company has delivered nearly 319,000.—7:20 a.m. ET Friday: Stock futures slide after Trump tests positive for Covid-19Here were the main moves in markets, as of 7:20 a.m. ET:S&P 500 futures (ES=F): 3,319.5, down 48.25 points or 1.43%Dow futures (YM=F): 27,326.00, down 363 points or 1.31%Nasdaq futures (NQ=F): 11,336.5, down 238.25 points or 2.06%Crude (CL=F): -$1.72 (-4.44%) to $37.00 a barrelGold (GC=F): -$2.90 (-0.15%) to $1,913.40 per ounce10-year Treasury (^TNX): -1.8 bps to yield 0.659%—6:00 p.m. ET Thursday: Stock futures trade flat ahead of September jobs reportHere were the main moves in equity markets, as of 6:00 p.m. ET Thursday:S&P 500 futures (ES=F): 3,368.00, up 0.25 points or 0.01%Dow futures (YM=F): 27,687.00, down 2 points or 0.01%Nasdaq futures (NQ=F): 11,568.5, down 6.25 points or 0.05%NEW YORK, NEW YORK - MARCH 17: Traders work on the floor of the New York Stock Exchange (NYSE) on March 17, 2020 in New York City. The Dow was up slightly in morning trading following a day that saw one of the worst drops in the market's history as America and the world react to the spreading of the coronavirus. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}