{"article": [{"url": "https://finance.yahoo.com/news/donald-trump-john-kerry-tax-information-billionaire-status-192045246.html", "published": 1601389700.0, "headline": "People from John Kerry to Matt Drudge are now asking if Donald Trump is actually a billionaire", "body": "According to Forbes, Donald Trump is currently the 1056th richest person in the world, with a net worth of $2.5 billion.But this week’s blockbuster story from The New York Times reported he is “personally responsible for loans and other debts totaling $421 million.” The story also found that the president paid just $750 in federal income taxes in 2016 and again in 2017 and no federal income taxes in 10 of the previous 15 years in part because he reported losing more money than he made.This new information, which Trump has denied though not formally refuted by releasing his tax returns, has led some to ask if the president actually is a billionaire.John Kerry in the East Room of the White House in 2016. (REUTERS/Carlos Barria)John Kerry — former U.S. Secretary of State, Massachusetts Senator, and Democratic nominee for president — recently noted that Trump “claims to be a multi-billionaire,” but added “there's no evidence that he really is.”However, Kerry added, “He’s been good at losing money.”The comments came during a Yahoo Finance Presents interview on Monday with editor-in-chief Andy Serwer. The interview was largely focused on Kerry’s backing of KFA Global Carbon ETF, an exchange-traded fund which allows investors to get involved in the carbon credit market. But the discussion, like most conversations around the political world these days, circled back to the president’s taxes.‘Fake billionaire?’Kerry is just one voice in recent days to raise questions about Trump’s worth. Matt Drudge’s conservative-leaning site, which had a falling out with the president, asked if he were a “fake billionaire.”Does Joe Biden have a higher net worth than Donald Trump? https://t.co/HUIh2TTqDV— Lloyd Blankfein (@lloydblankfein) September 27, 2020Forbes itself jumped into the fray to say that by its calculations, Trump is indeed a billionaire. It notes that the site tracks both assets and debts, and that Trump was able to hide operating profits, and in the process “figured out how to share very little of his fortune with the country he now leads.”Story continuesOther recent reports have also noted that the president is still in all likelihood a billionaire.But Forbes has revised its assessment of Trump’s wealth before. In 1990, they removed Trump from the Forbes 400 after an investigation revealed he wasn’t as rich as he said he is. “Forbes fell for that ruse,” it said.A ‘national security story’Kerry and other critics are also raising questions about the national security implications of a president deeply in debt. The names of the Trump’s creditors should be made public, Kerry said, adding, “Some country can hold him, you know, hostage.”There's evidence “that a considerable amount of money comes from abroad,” he said. “We have watched the president's behavior with respect to Russia and President Putin, and it raises very serious questions about the nature of Deutsche Bank loans and other money.”The Trump tax story is a national security story.— Claire McCaskill (@clairecmc) September 28, 2020Kerry also pointed out that if Trump is reelected, his “lenders could be placed in the unprecedented position of weighing whether to foreclose on a sitting president.”Speaker of the House Nancy Pelosi has made similar comments in recent days. “The public has a right to know,” she said during a television interview.Kerry is pushing hard for Biden to get elected in November but wrapped up the conversation by reflecting on his own 2004 run for the presidency.“I was allegedly winning, and our polls showed that I was winning in the last week,” he said of his run against George W. Bush, the last time a Democrat challenged an incumbent Republican president.“Am I sanguine? No, not in the least,” he said about the upcoming election, adding, “Nobody in the Biden campaign is taking anything for granted.”Ben Werschkul is a producer for Yahoo Finance in Washington, D.C.Read more:Trump's past tweets slammed others for not paying enough taxes and claimed he pays 'more'Tuesday’s debate could determine whether Trump’s taxes matter on Election DayTrump reportedly paid no federal tax in 10 of the last 15 years: 75 million of Americans pay no federal income tax — here’s whyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}