{"article": [{"url": "https://finance.yahoo.com/news/u-housing-starts-drop-multi-125237674.html", "published": 1600329620.0, "headline": "U.S. housing starts drop as multi-family home construction slumps", "body": "WASHINGTON, Sept 17 (Reuters) - U.S. homebuilding fell in August after strong gains in the prior three months, but the housing market remains supported by record low interest rates and demand for properties in the suburbs and low-density areas as many people work from home.Housing starts dropped 5.1% to a seasonally adjusted annual rate of 1.416 million units last month, the Commerce Department said on Thursday. Data for July was revised slightly lower to a 1.492 million-unit pace from the previously reported 1.496 million. Economists polled by Reuters had forecast starts slipping to a rate of 1.478 million units.A survey on Wednesday showed confidence among single-family homebuilders increased to a record high in September. Builders, however, remained concerned about rising costs for materials and delivery delays, especially for lumber.The housing market has outperformed the broader economy despite nearly 30 million people being on unemployment benefits. Unemployment has disproportionately affected low-wage workers, who are typically renters. The 30-year fixed mortgage rate is around an average of 2.86%, according to data from mortgage finance agency Freddie Mac.Home building last month was pulled down by a 22.7% tumble in starts for the volatile multi-family housing segment to a pace of 395,000 units. But construction of singe-family housing units, which accounts for the largest share of the housing market, increased 4.1% to a rate of 1.021 million units.Groundbreaking activity rose in the West and Midwest, but fell in the South and Northeast.Permits for future homebuilding dropped 0.9% to a rate of 1.470 million units in August. Single-family building permits increased 6.0% to a rate of 1.036 million units. Multi-family building permits decreased 14.2% to a rate of 434,000 units. (Reporting by Lucia Mutikani; Editing by Andrea Ricci)"}]}