{"article": [{"url": "https://finance.yahoo.com/news/homebuilders-are-holding-back-sales-amid-historic-demand-175323289.html", "published": 1600952480.0, "headline": "Homebuilders are holding back sales amid historic demand", "body": "The last time Los Angeles-based custom homebuilder KB Home (KBH) saw sales like this was during the housing bubble of 2007. Now, the builder is trying to pace itself as it fields record numbers of home orders.Homebuilders across the country sold homes at a record pace this summer, burning through their supply. To slow down the sales activity, homebuilders have started to restrain sales as they look toward preserving supply for 2021, according to economists.Read more: Buying a house: What you need to know about home ownership“At first, builders weren’t being overly careful about holding back sales — they were just excited about how many homes they were selling. Then one day they woke up and said, ‘This demand is real, it’s sustainable and it’s burning through our lots — which are really hard to replace,’” said Ali Wolf, chief economist at Meyers Research, a California-based housing market data firm.KB Home had a 27% increase in net orders this quarter, its highest sales pace since 2005. The spike in orders caused a 12% increase in backlogged orders and 7% fewer communities available for sale at the end of the quarter. During an investor call this week, the company said it expects “significantly higher backlog” by the end of the year, and inventory won’t rise until the second quarter of 2021.The company’s order growth is in line with the overall market. New home sales reached a 14-year high in August, up 4.8% after a 13.9% jump in July, the Commerce Department said Thursday morning. And mortgage applications are up 25% compared to this time last year, according to the Mortgage Bankers Association.Home renovation, repair and construction: isometric model house and tools with copy space“We are working to convert this backlog to deliveries, pacing our starts with our order rate,” said Jeff Mezger, chairman, president and chief executive officer of KB Home, in an earnings call Tuesday. “We're not to sell them [houses] unless we can start and then close them. So we're pretty much in balance right now. Our starts are ramping up proportionate to the sales growth.”Story continuesLow inventory levels have investors concerned. Cleveland-based KeyBanc Capital Markets’ equity research team downgraded KB Home to sector Weight from Overweight, citing limited community (inventory) growth. KB Home shares fell 4% to $36.78 per share Thursday morning.Limited inventory is attributable to a pause in development during the coronavirus pandemic, plus renewed demand. KB Home plans to add 135 communities in 2021, “the highest annual number of openings in many years,” said Mezger.“Our sizable absorption rate [5.9 orders per community, compared to 4.3 per community at this time last year] contributed to selling through more communities than we had anticipated just three months ago,” said Mezger.In earnings releases earlier this month, Lennar (LEN), Toll Brothers (TOL) and D.R. Horton (DHI) also reported a need to pace sales amid historic demand.“They [builders] did it [sold less] on purpose to be a long-term sustainable operation — not just on a sugar high,” said Wolf.“We remain focused on managing the pricing incentives and sales pace in each of our communities to optimize the return on our inventory investments and adjust to local market conditions and new home demand,” said Jessica Hansen, vice president of investor relations at D. R. Horton on the company’s July 28 earnings call. The company projects steady or declining inventory in the fourth quarter.Not afraid to hike pricesHomebuilders are also hiking prices to match — and temper — rising demand. About 60% of builders raised prices in September compared to only 40% last year, according to a September 14-18 survey of 300 homebuilders by Meyers Research.“We will continue to balance that pace [of home sales] in prices… to maximize returns for both inventory and equity,” said Hansen on D.R. Horton’s earnings call.“Sales could have been stronger with a singular focus on volume, but instead we drove margin growth and cash flow,” said Stuart Miller, chief executive officer of the Lennar Corporation on the company’s September 15 earnings call. “Accordingly, while managing sales pace, our margins have grown as demand has grown, and supply has remained limited.”KB Home said during its earnings call that it plans to increase its average selling price to $415,000 in the fourth quarter from $385,000 in the third quarter. And Toll Brothers projects increasing average sales price to between $815,000 and $835,000 in the fourth quarter, compared to $805,000 in the third quarter.“We will be closely monitoring our ability to deliver houses in time frames that are acceptable to us. And if the production schedules extend because of those issues then we will more aggressively raise prices to manage those backlogs and manage the delivery dates,” said Douglas Yearley, Jr., chairman and chief executive officer of Toll Brothers, Inc. on the homebuilder’s earnings call on August 26.Part of the reason for the hike is also that homebuilders are worried that the asking price today won’t be competitive when they actually deliver the houses, due to fluctuating labor and supply costs.“We want to stay ahead of the cost moves for sure. And if the market allows it, we'd like to be able to price for that,” said Matt Mandino, KB Home chief operating officer during the company’s earnings call.“If builders sell a home today and it’s not built yet, they might sell it at $400,000 with costs set at what they are today. But three months from now, the house is worth $430,000 and costs are up 10%. So they have hurt themselves by selling the home now when they can’t build it till later,” said Wolf.Price hikes come amidst a national affordable housing crisis, but builders aren’t yet concerned about scaring buyers away with record asking prices. Almost 40% of builders said they are having “no challenges” in their operation even as they raise prices, according to Meyers Research.But economists say if builders keep increasing prices, homebuilders could reach a cliff down the line.“It’s keeping me up at night because wages aren’t going up that fast. I keep saying, ‘This is unsustainable. You’re going to push prices so high.’ Rates are low and prices up — what challenge has this created? Majority of builders say ‘nothing,’ but that’s today. That’s fine, but in a year if you keep pushing prices, you’re pricing people out. There’s no way around that,” said Wolf.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:If lumber prices ‘don’t come down, you will see a slowdown in housing’: NAHB CEO‘Lenders don’t have the capacity’ to meet mortgage demand: expertThere’s a ‘staggering shortage of homes on the market’: economist"}]}