{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-school-guidelines-bring-cdc-more-inline-with-trump-on-reopening-171529737.html", "published": 1595593400.0, "headline": "Coronavirus update: Trump signs drug pricing orders; CDC releases school reopening guidelines", "body": "The U.S. Centers for Disease Control and Prevention (CDC) released guidelines for opening schools that endorsed physical attendance — aligning the agency more closely with President Donald Trump’s views on the subject, even as the world’s largest economy struggles to contain surging COVID-19 cases.Concerns about reopening are widespread. Schools have become a central focus as fall approaches, with districts across the country scrambling to find — and fund— appropriate plans. However, no consensus has been reached, and Trump himself softened his position on Thursday by saying hot zones should delay reopening plans.“This guidance is intended to aid school administrators as they consider how to protect the health, safety, and wellbeing of students, teachers, other school staff, their families, and communities and prepare for educating students this fall,” the agency wrote, outlining a lengthy list of mitigation strategies to prevent more spreading.The CDC’s recommendations comes as the nation remains deeply divided on how to reopen schools safely, and in the wake of the president’s criticism of the agency’s earlier guidance. Polls show that many parents remain nervous about sending their children back into schoolhouses, even as many criticize the remote learning process, and at least one panel of experts has urged a full reopening.With less than 2 months to go until the academic year begins, the U.S.’s confirmed infection numbers continue to climb, once again topping 70,000 per day amid a global count of nearly 16 million. This week, America topped 4 million total cases, led by surges in the Sun Belt.Among the largest states, California and Florida remain a concern. The Sunshine State recorded more than 12,000 cases with a positivity rate of more than 16%, while hospitalizations hit a new record on Friday. Deaths in Florida are starting to climb again after a brief pause, following the trend of lagging a rise in cases by a few weeks.Story continuesThe relentless spread has forced the president to publicly acknowledge certain realities associated with social distancing — which this week led him to back face coverings in public. On Thursday, Trump also announced the GOP was moving the Republican National Convention from Jacksonville, Florida back to North Carolina, as well as shifting to more virtual segments for the convention — something some observers said was ironic given his position on opening schools.In his briefing, Trump called for the reopening of the economy, but also said a full nominating convention was “not the right time. I have to protect the American people.\"Drug pricingThere are still three states with no mask mandates at all. (Graphic: David Foster/Yahoo Finance)Despite what appeared to be a reprieve on the drug pricing debate, which had been moving through Congress prior to the coronavirus outbreak, Trump signed four executive orders Friday to address the issue.The timing caught drug companies and lobbying groups off guard, as they had been enjoying the spotlight for their efforts to battle the coronavirus— whether through diagnostics, treatments or a vaccine search.The Trump administration previously revealed a plan to reduce drug costs, and Trump was previously reported to be looking at three executive orders earlier this month.The four orders include limiting insulin and epinephrine pricing by passing on discounts to patients, allowing importation of drugs from Canada, passing on rebates to patients, and tying Medicare cost for drugs to international pricing.U.S. Health Secretary Alex Azar highlighted that most of the benefits will reach low-income and senior patients.The fourth EO would be delayed until August 24, and could be removed if talks with industry executives — scheduled for July 28— are “successful,” Trump said Friday.Dr. Michelle McMurry-Heath, president and CEO of BIO, the largest industry trade group, told Yahoo Finance Friday that the executive orders are ill-timed amid the pandemic and could hurt the industry.PhRMA president and CEO Steve Ubl, who represents the largest industry lobbying group, echoed her sentiments.“The president’s attempt to open our country up to socialized health care sets America, our economic recovery and scientific progress back at a time when we need them most,” Ubl said in a statement.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}