{"article": [{"url": "https://finance.yahoo.com/news/ex-white-house-adviser-steve-134607011.html", "published": 1597913660.0, "headline": "Ex-Trump aide Bannon pleads not guilty in border wall scheme", "body": "NEW YORK (AP) — President Donald Trump’s former chief strategist, Steve Bannon, was pulled from a luxury yacht and arrested Thursday on allegations that he and three associates ripped off donors trying to fund a southern border wall, making him the latest in a long list of Trump allies to be charged with a crime.The organizers of the “We Build The Wall” group portrayed themselves as eager to help the president build a “big beautiful” barrier along the U.S.-Mexico border, as he promised during the 2016 campaign. They raised more than $25 million from thousands of donors and pledged that 100% of the money would be used for the project.But according to the criminal charges unsealed Thursday, much of the money never made it to the wall. Instead, it was used to line the pockets of group members, including Bannon, who served in Trump's White House and worked for his campaign.He allegedly took over $1 million, using some to secretly pay co-defendant Brian Kolfage, an Air Force veteran who lost both legs in a mortar attack in Iraq and the founder of the project, and to cover hundreds of thousands of dollars in personal expenses.“This case should serve as a warning to other fraudsters that no one is above the law, not even a disabled war veteran or a millionaire political strategist,” said Philip R. Bartlett, inspector-in-charge of the New York office of the U.S. Postal Inspection Service, which arrested Bannon aboard a luxury yacht at 7 a.m.Hours after his arrest, Bannon, 66, of Washington, D.C., pleaded not guilty during an appearance in a Manhattan federal court. He is the latest addition to a startlingly long list of Trump associates who have been prosecute d, including his former campaign chair, Paul Manafort, whom Bannon replaced, his longtime lawyer, Michael Cohen, and his former national security adviser, Michael Flynn.Trump has also made clear that he is willing to use his near-limitless pardon power to help political allies escape legal jeopardy, most recently commuting the sentence of longtime political adviser Roger Stone.Story continuesBannon was taken into custody on a 150-foot (45-meter) yacht called Lady May, which was off the coast of Connecticut, authorities said. The boat is owned by exiled Chinese billionaire Guo Wengui and currently for sale for nearly $28 million. According to Marine Traffic, a commercial tracking service, the vessel's transponder signal went dark on June 17, shortly after it departed a port in Connecticut en route to Miami, potentially indicating its beacon was inoperable or had been turned off.At his hearing, Bannon appeared by video with his hands cuffed in front of him and a white mask covering most of his face. He rocked back and forth on a chair in a holding cell with his lawyers on the telephone. The magistrate judge approved Bannon’s release on $5 million bail, secured by $1.75 million in assets.When he emerged from the courthouse, Bannon tore off his mask, smiled and waved to news cameras. As he went to a waiting vehicle, he shouted, “This entire fiasco is to stop people who want to build the wall.”Kolfage, 38, of Miramar Beach, Florida, did not respond to requests for comment. Also charged were Andrew Badolato, 56, of Sarasota, Florida, and Timothy Shea, 49, of Castle Rock, Colorado, the owner of an energy drink company called Winning Energy. The company's cans feature a cartoon superhero image of Trump and claim to contain “12 oz. of liberal tears.” Shea appeared at a brief virtual hearing in Denver.Other prominent members of the wall group included former Kansas Secretary of State Kris Kobach, its general counsel; Erik Prince, founder of the controversial security firm Blackwater; former Republican Rep. Tom Tancredo of Colorado; and former major league baseball pitcher Curt Schilling. They were not named in the indictment.After the arrest, Trump quickly distanced himself from Bannon and the project.“When I read about it, I didn’t like it. I said this is for government, this isn’t for private people. And it sounded to me like showboating,” he told reporters at the White House.An immigration plan unveiled by Trump last year included a proposal to allow the public to donate toward his long-promised wall, as the Kolfage group had originally said was its mission before shifting its focus to private construction. But Trump later denounced the project publicly, tweeting last month that he “disagreed with doing this very small (tiny) section of wall, in a tricky area, by a private group which raised money by ads” and claiming, “It was only done to make me look bad.”Attorney General William Barr told The Associated Press he had been made aware of the investigation into Bannon months ago but did not say whether the president had been informed.According to the indictment, the defendants used fake invoices, another nonprofit and sham vendor arrangements to try to hide their efforts to siphon money. Under the arrangement, Bannon and his co-defendants allegedly paid Kolfage $100,000 up front and an additional $20,000 monthly, all while claiming they served as volunteers and that Kolfage was not paid.The indictment said Kolfage “went so far as to send mass emails to his donors asking them to purchase coffee from his unrelated business, telling donors the coffee company was the only way he ‘keeps his family fed and a roof over their head.’”Kolfage eventually spent some of the over $350,000 he received on home renovations, payments toward a boat, a luxury SUV, a golf cart, jewelry, cosmetic surgery, personal tax payments and credit card debt.All four were charged with conspiracy to commit wire fraud and conspiracy to commit money laundering. Each charge carries a potential penalty of up to 20 years in prison.Originally called “We the People Build the Wall,” the campaign launched in December 2018 and raised approximately $17 million in its first week. But it soon drew scrutiny, according to the indictment. The crowdfunding site that hosted the campaign suspended it and threatened to return donations unless the money was transferred to a legitimate nonprofit. Bannon was brought in around that time.Dustin Stockton, who helped start the campaign and then left the project to work on the upcoming presidential election, said it seemed clear that prosecutors were “attacking political infrastructure that supports President Trump right before the election.\" He was not charged in the case.Benjamin Harnwell, who with Bannon launched an institute in Italy to train future populists, called the indictment “spurious” and evidence that the “forces of darkness” would stop at nothing to destroy the combative Bannon.A voice of nationalist, outsider conservatism, Bannon led the conservative Breitbart News before being tapped to serve as chief executive officer of Trump’s campaign in its critical final months. He later served as chief strategist during the turbulent early days of Trump’s administration and was at the forefront of many of its most contentious policies, including its travel ban on several majority-Muslim countries.But Bannon, who clashed with other top advisers, was pushed out after less than a year. And his split with Trump deepened after he was quoted in a 2018 book making critical remarks about some of Trump’s adult children. Bannon apologized and soon stepped down as chairman of Breitbart.Bannon, who served in the Navy and worked as an investment banker at Goldman Sachs and as a Hollywood producer before turning to politics, now hosts a pro-Trump podcast called “War Room,” which began during the president’s impeachment proceedings and has continued during the pandemic.A day before the indictment was unsealed, Kolfage was a featured guest on the show and solicited donations.___Long and Colvin reported from Washington. Associated Press writers Jennifer Peltz in New York; Nomaan Merchant in Northbrook, Illinois; Cedar Attanasio in Santa Fe, New Mexico; Dave Collins in Hartford, Connecticut; Mike Balsamo in Cleveland; Nicole Winfield in Rome and Michael Biesecker in Washington contributed to this report."}]}