{"article": [{"url": "https://finance.yahoo.com/news/why-investors-are-ignoring-trump-versus-biden-171235511.html", "published": 1597148420.0, "headline": "Why investors are ignoring Trump versus Biden", "body": "To the casual investor, what’s happening in the stock market right now is bewildering.The S&P 500 is flirting near a record high despite a very real, and raging pandemic. In turn, companies of all walks are being battered financially by the coronavirus pandemic. Millions of people across the country remain out of work. When they will return to work is anyone’s guess. The folks down in D.C. can’t agree on a fresh round of stimulus to support those unemployed fellow Americans.And yet, there is the S&P 500 on the cusp of a record.Talk up people on Wall Street (digitally of course, not in person because of that aforementioned pandemic) and the reason for the market’s ongoing resilience isn’t that bewildering. In effect, Mr. Market is done with 2020 and has already built a home in 2021. That home is surrounded by acres of much better earnings reports from Corporate America, a COVID-19 vaccine, low interest rates from the Federal Reserve and a conclusion (hopefully...) to the presidential election.It’s a land way more fun than 2020, which explains why Mr. Market is eager to call it home.“I think the market is clearly looking to next year’s earnings. If you think about next year’s earnings on the S&P 500 they could be $170. A 21 times P/E multiple [on those earnings] would dictate an S&P 500 that is probably, believe it or not, 100 points higher than now. So much of this is what happens to next year’s earnings,” Wells Fargo Asset Management global chief investment officer Kirk Hartman told Yahoo Finance’s The First Trade.Photo by: STRF/STAR MAX/IPx 2020Hartman is among the early group on Wall Street to highlight the focus by sophisticated investors on 2021.Earlier this week, Goldman Sachs strategist David Kostin reiterated his 2021 S&P 500 earnings estimate of $170. The number is some 30% above the current consensus forecast. If hit, it would represent a 31% year-over-year increase in earnings for the S&P 500.“The primary driver of our above-consensus 2021 forecast is our economic growth outlook,” Kostin writes, pointing out Goldman’s macroeconomic team is looking for 5.6% GDP growth next year. For 2020, Goldman forecasts a 5% GDP decline.Story continuesAdds Kostin, “While positive consensus EPS revisions are rare, they typically occur as the economy emerges from recessions.”So in other words, expect others on Wall Street to start buying homes in 2021 and stocks to possibly maintain an upward bias. That is until they don’t.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}