{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-4-2020-221302791.html", "published": 1599232340.0, "headline": "Stock market news live updates: Nasdaq posts worst week since March as tech shares slide", "body": "Stocks fell Friday, extending declines after a selloff a day earlier led the S&P 500 to its worst single-session drop in nearly three months.While ending the day off the lows of the session, each of the three major indices posted steep declines for the week, as Thursday’s rout took out gains from earlier sessions this week. The S&P 500 ended the week 2.3% lower, the Dow fell 1.8% and the Nasdaq dropped nearly 4% for its worst week since March.The Nasdaq underperformed especially on the day, falling as much as 5% intraday Friday before paring losses, as tech stocks continued to lag. The index on Thursday had dipped back below 12,000, after crossing that threshold for the first time every just a day earlier. Apple (AAPL) shares steadied after an 8% drop on Thursday. Amazon (AMZN) and Zoom Video Communications (ZM) – both darlings of the “stay at home” trade in recent months – extended losses from Thursday.“Thursday’s mini-crash left the door open for more selling, and investors have rushed through it today in a hurry to take profits before more downside arrives,” Chris Beauchamp, chief market analyst at IG, said in a note. “If there is to be a crash, then the end of the first week in September, following non-farms and ahead of a long weekend in the US, is probably the perfect time to do it.”Over the past couple months, a number of market pundits had warned of frothiness in the markets and crowding in tech stocks especially, as investors sought haven in software stocks during the pandemic.“A sudden sell-off in tech may raise some red flags, but sector rotation is a good thing,” Rick Swope, senior director of investor education for E-Trade Financial Corporation, said in an email Thursday. “While adding breadth to the market, dedicated traders may benefit from seeking opportunities outside of overbought names.”Thursday’s plunge came in absence of a clear external catalyst, with newly released data on weekly jobless claims in fact topping expectations Thursday morning, and developments around a coronavirus vaccine candidate coming in increasingly constructively. Friday’s August jobs report from the US Labor Department showed better than expected but moderating gains in net payrolls relative to earlier months in the summer. It also showed the first unemployment rate below 10% since March.Story continues“Most signs still point to an economic recovery. But there are a lot of obstacles between now and the end of the year: Stimulus uncertainty, budget negotiations, presidential debates, corporate conferences, and the election,” said Lindsey Bell, Chief Investment Strategist for Ally Invest. “The next few months could be a bumpy ride.”Some of the more downtrodden names for the year to date so far managed to stay in positive territory during Thursday’s session, or at least averted the worst of Thursday’s drop. While all 12 sectors in the S&P 500 were down on the day, the energy, utilities and financials sectors outperformed, falling no more than 1.6% each. Shares of Carnival Corporation (CCL) rose 5% and added to gains on Friday, after the company said it would be resuming some cruise operations under its Costa brand this weekend, with the announcement bringing some other peer cruise and travel stocks higher in sympathy.—4:01 p.m. ET: Stocks pare losses during Friday’s session but end week lower after selloffThe three major indices closed out Friday’s session lower, but at least clawed back from session lows during intraday trading.Here’s where the three major indices settled at the close of regular equity trading:S&P 500 (^GSPC): -28.2 points (-0.82%) to 3,426.86Dow (^DJI): -159.48 points (-0.56%) to 28,133.25Nasdaq (^IXIC): -144.97 points (-1.27%) to 11,313.13—11:34 a.m. ET: Dow extends declines to 500+ points; Nasdaq tumbles 3.7%The three major indices added to losses intraday Friday, with the Dow extending its losses to more than 500 points, or 1.8%. The Nasdaq slumped 3.6%, or 413 points, while the S&P 500 was down 80 points, or 2.3%. The tech-heavy index was on track to post its worst two-day slide since mid-March, when market volatility peaked during the start of the pandemic in the US.Shares of Salesforce led declines in the Dow, with the newly inducted component sliding 7% in intraday trading. Apple followed closely thereafter, with shares down 4%.—10:15 a.m. ET: All three major indices turn negative as jobs report boost fadesThe three major indices each fell Friday morning, reversing some earlier gains. The Nasdaq sharply underperformed and fell more than 2%, as investors continued to take profits from tech stocks that up until this week had handily outperformed the broader market.The S&P 500 fell 1%, or about 38 points, while the Dow dropped 84 points, or 0.3%. The financials, industrials and real estate sectors outperformed and held in positive territory in the S&P 500, though the heavily weighed information technology, communication services and consumer discretionary sectors slumped again.—9:45 a.m. ET: What economists are saying about the August jobs reportWhile the August jobs report topped estimates on almost every major metric, a number of economists cautioned that the labor market recovery remains on shaky ground, with the lingering impact of the coronavirus pandemic still threatening the rebound from here.Here’s what some economists had to say about this morning’s report, according to commentary to Yahoo Finance:“Net, net, the economy is recovering with a sharp rebound in retail sales and business new orders and the while labor market gains are on a slower path, the job gains are undeniable. The spread of the coronavirus cases to new regions of the country in August and the loss of those $600 weekly unemployment checks at the end of July did not stop companies from bringing back more workers this month after being furloughed during the pandemic earlier this year. The virus is in the driver's seat controlling the speed of the labor market recovery, and despite the fears of another outbreak later in the fall, businesses are slowly returning to normal and this means the worst of the recession is fading behind us in the rear-view mirror.” – Chris Rupkey, chief financial economist for MUFG Union Bank“The jobs data today were solid; however, now the real work begins. The next 2-3% of employment gains are going to be very tough because there is no total re-opening in sight. PPP funds are running dry and the impasse in Congress to reauthorize another round for struggling small businesses most affected by the pandemic are recipes for a wave of small business closures, particularly among restaurants and small retailers.” – Jamie Cox, managing partner for Harris Financial Group“One small negative from today’s report is the impact it may have on fiscal support discussions. With growing signs that US activity is improving and jobs are coming back, there is less pressure on Congress to deliver a new fiscal stimulus package. That will be a mistake. The strength of the economy and labour market rests on just a handful of factors: the release of pent up demand accumulating during lockdown; monetary stimulus; and fiscal stimulus.” – Seemah Shah, chief strategist for Principal Global Investors“The job market broadly is something like a whirlpool, where beneath the surface there are swift cross currents including job loss. Many of the recent large company announcements regarding furloughs and job cuts have yet to hit, indicating that the economy continues to face challenges in the months to come.” – Mark Hamrick, Bankrate.com senior economic analyst—9:30 a.m. ET: Stocks open mostly higher after estimates-topping jobs reportHere were the main moves in markets, as of 9:32 a.m. ET:S&P 500 (^GSPC): +10.93 points (+0.32%) to 3,465.99Dow (^DJI): +148.21 points (+0.52%) to 28,440.94Nasdaq (^IXIC): +8.1 points (+0.07%) to 11,465.31Crude (CL=F): -$0.35 (-0.85%) to $41.02 a barrelGold (GC=F): -$4.50 (-0.23%) to $1,933.30 per ounce10-year Treasury (^TNX): +5.5 bps to yield 0.677%—8:30 a.m. ET: August non-farm payrolls, unemployment rate come in better than expected; S&P 500 and Dow futures extend gainsThe US economy added back a greater than expected number of payrolls in August and the unemployment rate improved by a larger than anticipated margin, as employers continued to bring back workers as virus-related business disruptions abated. Still, the pace of payroll gains slowed relative to recent months.Non-farm payrolls rose by 1.371 million in August, topping expectations for 1.35 million. This followed a gain of 1.734 million payrolls in July, which itself was a step down from the record more than 4.7 million jobs added back in June.A rise in temporary hiring for the 2020 Census helped boost non-farm payrolls in August, with government jobs jumping by 344,000 month-on-month. But in the private sector, nearly ever major industry group in both services and manufacturing added payrolls on net as well.The overall unemployment rate improved to 8.4% in August for the first reading below 10% since March.—7:18 a.m. ET Friday: Stock futures mixed, Nasdaq futures hold lowerHere were the main moves in markets, as of 7:18 a.m. ET:S&P 500 futures (ES=F): 3,466.75, up 5.25 points or 0.15%Dow futures (YM=F): 28,460.00, up 109 points or 0.38%Nasdaq futures (NQ=F): 11,708.5, down 92 points, or 0.78%Crude (CL=F): +$0.32 (+0.77%) to $41.69 a barrelGold (GC=F): +$7.10 (+0.37%) to $1,944.90 per ounce10-year Treasury (^TNX): +2.3 bps to yield 0.645%—6:01 p.m. ET Thursday: Stock futures open lower after S&P 500’s worst day since JuneHere were the main moves in equity markets, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,450.25, down 11.25 points or 0.33%Dow futures (YM=F): 28,269.00, down 82 points or 0.29%Nasdaq futures (NQ=F): 11,725.5, down 75 points, or 0.64%NEW YORK, NEW YORK - MARCH 18: Traders work on the floor of the New York Stock Exchange (NYSE) on March 18, 2020 in New York City. The Dow fell more than 1,200 points today as COVID-19 fears continue to roil world markets. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}