{"article": [{"url": "https://finance.yahoo.com/news/us-threatens-restrict-wechat-following-094150941.html", "published": 1594615760.0, "headline": "US threatens to restrict WeChat following TikTok backlash", "body": "Amid intense scrutiny over TikTok as a potential national security risk in the U.S., WeChat, the essential tool for Chinese people's day-to-day life, is also taking heat from Washington.White House trade advisor Peter Navarro told Fox Business on Sunday that \"[TikTok] and WeChat are the biggest forms of censorship on the Chinese mainland, and so expect strong action on that.\"Navarro alleged that \"all of the data that goes into those mobile apps that kids have so much fun with and seem so convenient, it goes right to servers in China, right to the Chinese military, the Chinese communist party, and the agencies which want to steal our intellectual property.\"WeChat declined to comment for the story. TikTok said in a statement to TechCrunch that \"protecting the privacy of our users’ data is a critical priority for TikTok\" and it has \"never shared TikTok user data with the Chinese government, and would not do so if asked.\"The biggest difference between restricting the two apps is the demographics that will be affected: outside of China, WeChat is mainly used by Chinese diaspora and foreign businesses with a footprint or connection in China, while TikTok is primarily used by young, local users across international markets.While WeChat powers myriad daily activities in China, from paying in a restaurant to booking a doctor's appointment, the app's function is mostly limited to messaging outside of China as foreign competitors fill its role in other aspects.It's unclear how the U.S. restriction will play out, if it will at all, though some WeChat users are already speculating workarounds to stay in touch with their family and friends back home. In the case that the Tencent-owned messenger is removed by Apple App Store or Google Play, U.S.-based users could switch to another regional store to download the app. If it were an IP address ban, they could potentially access the app through virtual private networks (VPNs), tools that are familiar to many in China to access online services blocked by Beijing's Great Firewall.Story continuesVPNs are not necessarily for battling censorship. It's not uncommon to see overseas Chinese setting their IP address to their home country in order to stream shows on Chinese video platforms that are unavailable abroad due to licensing restrictions.Navarro's message arrived shortly after Secretary of State Mike Pompeo revealed that the U.S. government is looking to ban TikTok. Launched by Chinese internet upstart ByteDance, TikTok has been working to distance itself from its Chinese association through efforts such as storing data in America and Singapore as well as overhauling its corporate structure.It stressed in its statement that \"our American chief information security officer has decades of U.S. law enforcement and security experience. TikTok's parent is a privately owned company backed by some of the best-known U.S. investors, which hold four of its five board seats.\"Nonetheless, American corporations are responding to the politicians' call to boycott TikTok over security concerns. Wells Fargo told employees to remove TikTok from their phones. Amazon asked its staff to do the same but quickly backtracked from its demand."}]}