{"article": [{"url": "https://finance.yahoo.com/news/jeffrey-gundlach-on-risk-the-dollar-weakens-163241295.html", "published": 1594035620.0, "headline": "Gundlach: Why the dollar and the tech rally are 'real risks' to investors", "body": "Bond investor Jeffrey Gundlach believes the “fiscal explosion” associated with the coronavirus will ultimately lead to a weaker dollar — and investors aren’t giving enough weight to that risk.The “twin deficits” created by runaway government spending and continued U.S. appetite for foreign purchases have long been seen as a negative for the greenback, the world’s most dominant fiat and reserve currency. However, the CEO of DoubleLine Capital said a dollar crash — if and when it happens — could easily cause the U.S.’s financial dominance to “fade away.”While it’s not imminent, “there’s a risk that the dollar starts to reverse into a significant downtrend because the value of the dollar versus other currencies is greatly affected by the growth in our budget and trade deficit,\" Gundlach told Yahoo Finance in a wide-ranging interview.While the U.S. trade deficit has fallen because of the COVID-19 crisis’ impact on global growth, the same factor has sent the fiscal deficit exploding.Although every major economy is “doing strange policies” to thwart the virus’ effect on their economy, Gundlach insisted the U.S.’s balance sheet is worse.The world’s largest economy “dwarfs the policies, particularly what the Federal Reserve is doing, versus the European Central Bank (ECB) and other central banks. What we're doing dwarfs who they've been up to. We're really carrying the burden here in terms of fiscal explosion,\" Gundlach added.A number of economists have warned the fiscal surge could result in a weaker dollar, which might create purchasing power problems. Additionally, \"the dominance of the U.S. markets will start to fade away,\" the billionaire added.Six problems with the rallyIn the midst of a record second-quarter rally, Gundlach told Yahoo Finance that Wall Street’s recent outperformance in the face of surging coronavirus infections was actually driven by what he dubs the \"Super 6,\" which consists of Facebook (FB), Amazon (AMZN), Apple (AAPL), Alphabet (GOOGL), Netflix (NFLX), and Microsoft (MSFT).Story continues\"Without the Super 6, there is no earnings growth in the United States stock market. There isn't any for the past five years. If you take them out, there's nothing,” the investor said.“There's no earnings growth at all in the small caps. So this is all being driven by price, it is not by earnings. And, of course, earnings have taken a tremendous hit,\" Gundlach added.He estimated that earnings in the stock market were the equivalent to where they were in 2016, when the market was a third lower. \"So, the fundamentals are completely out of sync with how the market has been manipulated,\" he added.Another driver of the markets, according to Gundlach, has been the “unnerving” spike in retail investor activity.\"The stock market is partially up because of all the money that the government has given people who are unemployed,\" Gundlach said. He speculated that some of that stimulus money is heading into the stock market as brokerages debut new products that allow retail investors to buy slices of companies.\"I think that's pretty dangerous,” the billionaire said, pointing at an unusually active options market that helped feed the frenzy.It suggested that “there's kind of euphoria, weirdly, from people who maybe they would normally gamble the money that they're getting from the government. But the casinos are closed, so the race tracks are closed, so instead, you can take a flyer on the FAANGs,” Gundlach said.He added that the retail investors \"buying slices of the stock market that don't even know what they're doing and have probably lost money already\" if they entered June 8th, referencing the date that saw high levels of call option activity amongst retail investors.\"I just don't think that they understand that this is not a fixed situation, and there are several more shoes, if not Imelda Marcos' closet full of shoes to fall on this situation,\" he said — referencing the former First Lady of the Philippines and her infamous collection of more than 1,000 pairs of expensive shoes.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapse"}]}