{"article": [{"url": "https://finance.yahoo.com/news/samsung-galaxy-note-20-galaxy-buds-live-galaxy-watch3-140904603.html", "published": 1596619040.0, "headline": "Samsung debuts Galaxy Note 20 and Note 20 Ultra alongside new Galaxy Buds Live and Galaxy Watch3", "body": "Samsung's Galaxy Note 20 and Galaxy Note 20 Ultra hit stores Aug. 21. (Image: Samsung)Samsung unloaded a boatload of new products Wednesday, debuting its new Galaxy Note 20 and Galaxy Note 20 Ultra smartphones, Galaxy Tab S7 and Tab S7+, Galaxy Watch3, and Galaxy Buds Live as part of its virtual Galaxy Unpacked event.The stars of the show are the Note 20 devices, which pack full 5G cellular connectivity, absolutely massive displays, and serious performance including a display refresh rate of 120hz on the 20 Ultra.The Tab S7, Watch3, and Buds Live are no slouches, either though, and all serve as a means to pull and keep customers in the company’s Galaxy ecosystem of products.Note 20 and Note 20 UltraSamsung’s Android-powered Galaxy Note series of products is always its most ambitious, offering huge displays, powerful processors, and, of course, the company’s S Pen stylus. Available for pre-order Aug 6 with full availability Aug. 21, the $999 Note 20 and $1,299 Note 20 Ultra stretch the line’s display sizes even further with the Note 20 sporting a whopping 6.7-inch screen and the Note 20 Ultra getting a 6.9-inch panel.Both displays use Samsung’s Infinity-O AMOLED technology with the Ultra getting the benefit of a 120hz screen refresh rate. A screen’s refresh rate is the number of times it refreshes each second. The higher the refresh rate, the smoother things like scrolling, swiping, and video look on your phone.Samsung has also improved the look and design of the Note, exaggerating the camera lens holes, and keeping the rest of the phone relatively minimalistic. The cameras themself are more or less taken from Samsung’s S20 and S20 Ultra.The Galaxy Note 20 Ultra has a relatively minimalist design with the exception of its exaggerated camera cover. (Image: Samsung)The Note 20 gets a 12-megapixel ultra-wide angle camera, a 12-MP wide-angle camera, and a 64-MP telephoto camera with the company’s 3x hybrid zoom and 30x Super Resolution zoom, which uses a mix of the camera’s lens and computer processing to let you zoom in on your subjects further than most competing smartphone cameras.The Note 20 Ultra, meanwhile, gets a 12-MP ultra-wide angle camera, a 108-MP wide-angle camera, and a 12-MP telephoto camera. The Ultra also gets an impressive 5x optical zoom, far better than the standard 2x you’ll find on competing handsets.Story continuesThen there’s the 50x Super Resolution zoom, which is really more of a gimmick than something you’ll use in your day-to-day photos and videos, but worth trying nonetheless.From a performance perspective, both versions of the Note 20 get Qualcomm’s Snapdragon 865+ processor. The Note 20 also gets 8GB of RAM and 128GB of onboard storage, while the Note 20 Ultra gets an impressive 12GB of RAM and your choice of 128GB or 512GB of storage.Naturally, the Notes also get Samsung’s S Pen stylus for taking notes on the go.Impressively, both versions of the Note will get 5G support for Sub-6 and mmWave networks. That’s important as it means you’ll be able to access the full range of 5G networks on a single device.Galaxy Watch3Samsung has also rolled out a new version of its Galaxy Watch line with the Galaxy Watch3. Available Aug. 6, the new smartwatches come with either a 41mm face for $399 or a 45mm face for $429, and bring back Samsung’s slick rotating bezel for selecting on-screen items.Samsung's Galaxy Watch3 comes with either a 41mm or 45mm watch face. (Image: Samsung)The watch gets a host of fitness features including run coaching, sleep tracking, heart rate tracking, and VO2 max tracking. Samsung says you can also follow along with 120 different video workouts using the Samsung Health app on the Note.Galaxy Buds LiveThe South Korean tech giant also revealed its new in-ear wireless earbuds, the Galaxy Buds Live. The Buds Live have a unique, bean-like design that slips into the outer part of your ear, so you don’t have to slide them into your actual ear canal.Samsung's Galaxy Buds Live offer active noise-cancelling technology for just $169. (Image: Samsung)The buds also get active noise-cancelling technology putting them in direct competition with Apple’s AirPods Pro. Like Samsung’s other wireless earbuds, the Galaxy Buds Live feature a charging case that recharges the buds when you’re not using them.The Buds Live, which launch Aug. 6, cost just $169, which is nearly $100 less than Apple’s AirPods Pro with noise-cancelling technology. We’ll have to how the two stack up in terms of performance and audio quality to determine if that price difference also leads to a difference in sound.Galaxy Tab S7 and S7+Finally, Samsung unveiled its Android-powered Galaxy Tab S7 and Tab S7+. Both tablets are marketed as productivity slates and feature Samsung’s S Pen, and optional 5G connectivity. The Tab S7 packs an 11-inch display, while the Tab S7+ gets a 12.4-inch panel. Both offer 120Hz screen refresh rates.Inside the tablets get 64-bit, 8-core processors, and can be outfitted with either 6GB or 8GB of RAM with storage options of 128GB or 256GB. To get the most out of the slate, though, you’ll need to purchase Samsung’s keyboard cover, which is a separate cost.Both tablets will be available later this fall, with the Tab S7 starting at $649 and the Tab S7+ starting at $849.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Activision Blizzard earnings blow away expectations as gamers player through pandemicMicrosoft’s Xbox Game Pass Ultimate gets Project xCloud cloud gaming on Sept. 15 for $14.99 per monthMicrosoft and TikTok need each otherDocuments reveal the behind-the-scenes battle between Apple and Spotify that lead to an antitrust investigationFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}