{"article": [{"url": "https://finance.yahoo.com/news/democrats-are-planning-monster-stimulusif-biden-wins-164458418.html", "published": 1601639540.0, "headline": "Democrats are planning monster stimulus—if Biden wins", "body": "With her usual sorcery, House Speaker Nancy Pelosi has effectively killed a fourth stimulus bill while making it seem like she really wants one. This is bad for struggling Americans now. But it could lead to a huge package of aid early next year if Joe Biden wins the presidency.The Democratic-controlled House passed a $2.2 trillion stimulus bill on Oct. 1 that includes $500 billion in aid for cities and states, a renewal of $600 payments for the newly unemployed, another round of $1,200 stimulus for most Americans and many other things. The White House supports a slightly smaller bill of $1.6 trillion, so you might think they could split the difference and get some quick money out to people who need it.Speaker of the House Nancy Pelosi (D-CA) talks to reporters during her weekly news conference in the House Visitors Center at the U.S. Capitol on October 01, 2020 in Washington, DC. (Photo by Chip Somodevilla/Getty Images)Not a chance.Pelosi has structured her bill as a measure Senate Republicans can’t possibly approve, with a price tag Senate Majority Leader Mitch McConnell has clearly indicated is way too high. From an economic perspective, it would be best for Congress to pass even a lowest-common-denominator bill with, say, $500 billion in aid. If the economy needs further help after the election, pass another $500 billion bill. And another, if needed.US President Donald Trump steps off Marine One after arriving on the South Lawn of the White House in Washington, DC, October 1, 2020, following campaign events in New Jersey. (Photo by SAUL LOEB/AFP via Getty Images)But politics, not economics, now dominates the stimulus debate. And while that might depress the economy now, it could generate a giant boost a few months from now.If Joe Biden wins the White House in November, and Democrats take control of the Senate, Democrats will have total control of the stimulus process. “While Pelosi continues to say she is ‘hopeful’ a deal can be reached, in reality, she has little interest in making a deal that is below $2 trillion,” Beacon Policy Advisers wrote in an Oct. 2 analysis. “This is not the negotiating position of someone who is champing at the bit to make a deal. Pelosi sees the Democratic hand strengthening with the upcoming election.”If Dems sweep in November, they’ll probably revive the $3.4 trillion HEROES Act the House passed in May, modified to address economic and public health developments since then. That act contains many of the provisions in the latest $2.2 trillion bill, but with longer timelines and therefore more money. It does not contain a key Republican proposal—liability protection for businesses if workers or customers get sick on premises. Democrats could pass such a bill with a simple majority in the Senate, and Biden could sign it quickly once he’s sworn in on Jan. 20.Story continuesMarkets are swooning on the apparent demise of an October stimulus bill. But they’d perk up at the prospect of a much larger bill early next year. And if Biden wins, he and Pelosi and other Democrats will probably signal right away what they plan to do, giving markets a boost soon after the election outcome is affirmed.Biden seems to have a comfortable lead over Trump, and that could widen now that Trump, who has long dismissed the Covid-19 threat, has become infected himself. At a minimum, it will derail Trump’s campaigning in the home stretch of the election. If Trump becomes seriously ill it would obviously have more dire implications.But everybody knows this is a wildly unpredictable year, and it’s still possible Trump could recover quickly from Covid and win in November. If that happens, Pelosi & Co. will no longer have anything to gain by holding out for a huge stimulus bill in 2021. They’ll only be able to take credit for whatever Republicans are willing to pass, which might revert to the current White House proposal of a $1.6 trillion bill. That might also be the ceiling if Biden wins but Republicans keep control of the Senate. Many struggling workers and businesses can’t wait even a month or two, but it might lessen their despair to know something is probably coming after the election, one way or another.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Democrats can save ObamacareTrump’s health care sham5 campaign promises Trump has given up onTrumpworld is implodingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}