{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-october-7-2020-222054367.html", "published": 1602087260.0, "headline": "Stock market news live updates: Stocks rise after Trumps signals support for some virus relief", "body": "Stocks rose after a flurry of Twitter posts from President Donald Trump, who announced his support for specific virus relief measures, despite saying earlier that he told negotiators to end stimulus talks until after the election.[Click here to read what’s moving markets heading into Thursday, Oct. 8]The three major indices extended gains intraday Wednesday after dropping on Tuesday. The Dow added more than 400 points shortly before noon in New York. Airline, cruise line and lodging stocks rose as the prospects of at least some stimulus appeared back on the table. Shares of Eli Lilly (LLY) rose after the drugmaker announced it was seeking emergency use authorization from the FDA for its experimental Covid-19 antibody treatment.“The House & Senate should IMMEDIATELY Approve 25 Billion Dollars for Airline Payroll Support, & 135 Billion Dollars for Paycheck Protection Program for Small Business,” Trump wrote in a Twitter post late Tuesday. “Both of these will be fully paid for with unused funds from the Cares Act. Have this money. I will sign now!”Trump also added that he was “ready to sign now” a standalone bill to send another round of $1,200 stimulus checks to taxpayers.Earlier Tuesday afternoon, Trump said in his Twitter posts that he instructed his representatives “to stop negotiating until after the election,” after which he expected to win and “pass a major Stimulus Bill that focuses on hardworking Americans and Small Business.”Previously, investors had held onto slim hopes that lawmakers might succeed in passing another comprehensive fiscal stimulus package before Election Day on Nov. 3. Treasury Secretary Steven Mnuchin and House Speaker Nancy Pelosi held talks over the deal regularly over the past week, though the officials for months had failed to reconcile the discrepancies between their plans, which last stood at $2.2 trillion for House Democrats versus an about $1.6 trillion offer from Mnuchin.Even before Trump’s announcement Tuesday afternoon, analysts at Eurasia Group said they believed passage of a pre-election stimulus package had an only 20% probability of transpiring, according to a research note Monday.Story continuesThe announcement came just hours after Federal Reserve Chair Jerome Powell issued in a speech one of his firmest calls yet for lawmakers to advance fiscal stimulus to promote the economic recovery, saying that the rebound would be “stronger and move faster if monetary policy and fiscal policy continue to work side by side to provide support to the economy until it is clearly out of the woods.”Elsewhere, Big Tech companies including Amazon (AMZN), Apple (AAPL), Alphabet (GOOG, GOOGL) and Facebook (FB) traded higher and shook off Tuesday’s declines, after the House Judiciary’s Antitrust Subcommittee released an about 450-page report describing these companies as having “expanded and exploited their power of the marketplace in anticompetitive ways.” The report outlined a wide-reaching array of measures to try and curb these companies’ power, which, if advanced into legislation, could eventually lead to breaking up parts of the companies’ businesses.Still, some analysts said that it remains a reach for Congress in its current form to pose a meaningful threat to these corporations. However, a major shift of power to a Democratic majority in both chambers of Congress and the presidency post-election would raise the likelihood of more pressure, according to WedBush analyst Dan Ives.“Absent a legislative fix, we do not see meaningful change in regulation for now,” Ives said in a note late Tuesday. “We likely do not see Congress agreeing on legislation unless both houses of Congress and the Presidency are controlled by the same party, as the parties have had difficulty reaching consensus on more pressing issues. However, a potential 'blue wave' in November would change the game on this front and make a formidable force going after antitrust law changes with breakups possibly on the radar.”—4:05 p.m. ET: Dow gains 530 points, or 1.9%, to rise to the highest level in more than one monthHere were the main moves in markets as of 4:05 p.m. ET:S&P 500 (^GSPC): +58.50 (+1.74%) to 3,419.45Dow (^DJI): +530.70 (+1.91%) to 28,303.46Nasdaq (^IXIC): +210.00 (+1.88%) to 11,364.60Crude (CL=F): -$0.65 (-1.60%) to $40.02 a barrelGold (GC=F): -$18.80 (-0.98%) to $1,890.00 per ounce10-year Treasury (^TNX): +4.3 bps to yield 0.7850%—2:15 p.m. ET: Federal Reserve says recovery could be ‘slower than anticipated’ in absence of future fiscal supportThe Federal Reserve released meeting minutes from its Sept. 15-16 meeting Wednesday afternoon, which shed more light on central bank officials’ concerns that the economic recovery might be curbed in absence of further support from Congress.“Indeed, many participants noted that their economic outlook assumed additional fiscal support and that if future fiscal support was significantly smaller or arrived significantly later than they expected, the pace of the recovery could be slower than anticipated,” according to the meeting minutes.The minutes also revealed that Federal Open Market Committee (FOMC) participants did not view the outcome-based forward guidance on rates that had been put forth in the last FOMC statement as “an unconditional commitment to a particular path.”“Most participants supported providing more explicit outcome-based forward guidance for the federal funds rate that included establishing criteria for lifting the federal funds rate above the ELB [effective lower bound] in terms of the paths for employment or inflation or both,” according to the minutes. “Among the participants who favored providing more explicit forward guidance at this meeting, all but a couple supported a formulation in which the forward guidance included language indicating that it would likely be appropriate to maintain the current target range until labor market conditions were judged to be consistent with the Committee’s assessments of maximum employment and inflation had risen to 2% and was on track to moderately exceed 2 percent for some time.”“Participants generally noted that outcome-based forward guidance for the federal funds rate of this type was not an unconditional commitment to a particular path,” the minutes added.—1:20 p.m. ET: Trump has been ‘symptom-free’ for more than 24 hours, White House physician saysPresident Donald Trump has been “fever-free for more than 4 days, symptom-free for over 24 hours, and has not needed nor received any supplemental oxygen since initial hospitalization,” White House physician Dr. Sean Conley wrote in a memo Wednesday afternoon.The president has been out of the hospital since Monday evening, after being taken to Walter Reed National Military Medical Center late Friday and staying the weekend to be treated for Covid-19.—11:57 a.m. ET: Stocks extend gains, three major indices each advance more than 1%The three major indices added to gains in intraday trading Wednesday. The Dow outperformed with a rise of 1.5%, or 426 points, led by gains in Salesforce and Boeing. The S&P 500 and Nasdaq each also rose at least 1.3%.Gains in the S&P 500 were led by the materials, consumer discretionary and industrials sectors. Each of the 11 major sectors were positive on the day, though the communication services, energy and real estate sectors lagged.—9:31 a.m. ET: Stocks open sharply higher amid stimulus talks, Covid-19 treatment hopesHere were the main moves in markets, as of 9:31 a.m. ET:S&P 500 (^GSPC): +39.14 points (+1.16%) to 3,400Dow (^DJI): +320.57 points (+1.15%) to 28,093.33Nasdaq (^IXIC): +132.13 points (+1.18%) to 11,286.39Crude (CL=F): -$1.01 (-2.48%) to $39.66 a barrelGold (GC=F): -$20.50 (-1.07%) to $1,888.30 per ounce10-year Treasury (^TNX): +3.8 bps to yield 0.778%—8:50 a.m. ET: Eli Lilly shares rise after company applies for FDA emergency use authorization for Covid-19 antibody therapyDrugmaker Eli Lilly & Co. (LLY) said Wednesday it has requested that the U.S. Food and Drug Administration authorize its experimental Covid-19 antibody therapy for emergency use. The company said new data showed its treatment helped reduce “viral load, symptoms and COVID-related hospitalization and ER visits,” according to a statement.Shares of Eli Lilly rose more than 3% in pre-market trading.—7:26 a.m. ET: Stock futures rise after Trump signals support for some stimulus measuresHere were the main moves in markets, as of 7:28 a.m. ET:S&P 500 futures (ES=F): 3,372.5, up 19.25 points or 0.57%Dow futures (YM=F): 27,877.00, up 177 points or 0.64%Nasdaq futures (NQ=F): 11,331.00, up 57.27 points or 0.51%Crude (CL=F): -$1.13 (-2.78%) to $39.54 a barrelGold (GC=F): -$22.40 (-1.17%) to $1,886.40 per ounce10-year Treasury (^TNX): +3.5 bps to yield 0.775%—7:00 a.m. ET Wednesday: Weekly mortgage applications as record low rates support housing marketThe Mortgage Bankers Association’s (MBA) weekly index tracking mortgage application volume jumped 4.6% for the week ended Oct. 2, following a 4.8% drop during the prior week.Refinances led the gain, with this index increasing 8% over last week to the highest level since mid-August. The refinance index was up 50% over last year. However, an index tracking purchases fell 2% week-over-week, seasonally adjusted, but was still 21% higher than the same period last week on an unadjusted basis.“Mortgage rates declined across the board last week – with most falling to record lows – and borrowers responded,” Joel Kan, MBA’s associate vice president of economic and industry forecasting, said in a statement. ““Continuing the trend seen in recent months, the purchase market is growing at a strong clip, with activity last week up 21 percent from a year ago. The average loan size increased again to a new record at $371,500, as activity in the higher loan size categories continues to lead growth.”—6:08 p.m. ET Tuesday: Stock futures open lower as stimulus hopes waneHere were the main moves in equity markets, as of 6:08 p.m. ET Tuesday:S&P 500 futures (ES=F): 3,338.00, down 15.25 points or 0.45%Dow futures (YM=F): 27,588.00, down 112 points or 0.4%Nasdaq futures (NQ=F): 11,230.00, down 43.75 points or 0.39%Traders work on the floor of the New York Stock Exchange, October 2, 2008. U.S. stocks slid on Thursday as tight credit markets and bleak economic data forced investors to focus on the rocky road still ahead for the U.S. economy even if Congress passes a $700 billion rescue package. REUTERS/Brendan McDermid (UNITED STATES)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}