{"article": [{"url": "https://finance.yahoo.com/news/dont-expect-shale-to-rise-like-the-phoenix-from-the-ashes-oil-expert-200047707.html", "published": 1592838500.0, "headline": "Don't expect shale to rise like a 'phoenix from the ashes': Oil expert", "body": "Don’t expect the U.S. shale industry, battered by the pandemic and an oil price war earlier this year, to move into strong growth levels any time soon, says one oil expert.“There are those who think that shale will still rise like the Phoenix from the ashes like it has, in the previous downturns,” Vandana Hari, founder and CEO of Vanda Insights, told Yahoo Finance’s The First Trade.“I think that shale has taken a really hard knock this time. It will be very hard for it to come back,” she added.“It’s a very debt-dependent sector, unlike a lot of other oil and gas producers globally. And I think the investors have soured quite a bit on the shale sector; they're just not going to be ready to jump back in.” said Hari.A study by Deloitte shows when crude futures are at $35 a barrel, about 30% of U.S. shale companies are “technically insolvent.”The study also noted that “challenging oil market conditions could prompt the shale industry to impair or write-down the value of their assets by as much as $300 billion—with significant impairments expected in Q2 2020.”The research indicates deep consolidation in the industry is likely to follow.Big oil companies expected to fair betterHari sees the major oil companies coming out strong from the pandemic.“The oil majors generally — those with deep pockets —those who are staying on track with regards to new energies, environmentally-friendly businesses, those usually tend to do better,” said Hari“The BPs (BP), Shells (RDS-A), Exxon Mobils (XOM) at the world, they are also able to raise a debt, even in the current circumstances,” she added.Oil service companies which normally provide engineering, fluid hauling, surveying, and testing are not expected to fair as well.“Services companies, really, their fate depends on how quickly upstream investment globally rebounds and really, I don't see that happening anytime soon.”In this photo made on Thursday, March 12, 2020, workers change the equipment on the drilling platform at a Seneca Resources shale gas well drilling site in St. Mary's, Pa. (AP Photo/Keith Srakocic)‘Shadow still lingering on the markets’Oil prices have seen weekly gains for seven out of the last eight weeks, thanks to OPEC+ cuts and renewed optimism over rebounding demand.Story continuesOn Monday, Brent crude (BZ=F) futures gained +2% to settle at 43.08 a barrel. The West Texas Intermediate (CL=F) contract for August rose +1% to settle above $40 a barrel for the first time since March.Prices could hover around current levels as COVID-19 cases resurface in some areas of the US and abroad.“There’s a shadow still lingering on the markets,” said Hari. “The emergence of the economies out of the coronavirus lockdowns have proved anything but smooth so far.”Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreRead more:Put money in the hands of consumers not businesses: NYU Professor Galloway‘Don’t fight the Fed’ mantra is working: Stifel strategistIt would be unprecedented for a bear market to be this short: Wells Fargo StrategistRecent rally could be a ‘bear market trap’: Miller Tabak StrategistFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}