{"article": [{"url": "https://finance.yahoo.com/news/most-americans-would-not-sue-over-covid-19-exposure-poll-134658906.html", "published": 1594716860.0, "headline": "Most Americans would not sue over COVID-19 exposure: poll", "body": "Less than a third of Americans say they would sue a business if they were exposed to COVID-19 while visiting the establishment, according to a new Yahoo Finance-Harris poll.Republicans are pushing for liability protections for businesses in the next round of coronavirus relief, but the new survey shows most Americans would not sue over exposure to COVID-19.Thirty percent of the 2,094 respondents surveyed between July 6 and July 12 said they would be likely to sue the business – 18% said they’d be “somewhat likely” and only 12% of people said they would be “very likely” to file a lawsuit. Seventy percent of respondents said they would not be likely to sue.Americans are a little more likely to sue their employer: 34% of respondents said they would be likely to sue their employer if they were exposed to COVID-19 at work.70% of Americans say they would not be likely to sue a business if they were exposed to COVID-19 while visiting it.A healthcare worker seen taking a swab sample from a driver at the Coronavirus (COVID-19) drive in testing site, set up in the parking lot of Hard Rock Stadium as Florida reports another record spike 11K in coronavirus cases, July 10, 2020 in Miami Gardens, Florida. Credit: mpi04/MediaPunch /IPXAttorneys have told Yahoo Finance they expect to see a spike in litigation when people go back to work.Respondents making more than $100,000 were most likely to sue their employer, according to the poll. Fourteen percent of the most wealthy people surveyed were “very likely” to sue, compared to 13% of people making less than $50,000, 11% of people with income between $75,000-$99,000 and 9% of those earning between $50,000 and $74,900.Men are more likely to sue than women – regardless of whether they were exposed to COVID-19 at work or while visiting a business. Thirty-four percent of men might sue an establishment they visited, compared to 26% of women. Thirty-seven percent of men would be likely to sue their employer, while only 31% of women might sue.Senate Majority Leader Mitch McConnell called liability protections a “red line” earlier this year. The U.S. Chamber of Commerce and other business groups have also called for liability shields.The U.S. Chamber of Commerce has said it's not advocating protections for 'bad actors' or 'grossly negligent' businesses – but protections from 'unfair' lawsuits against businesses trying to follow healthy and safety guidelines.Story continuesLawmakers hope to pass another relief package in the coming weeks. Isaac Boltansky, director of policy research at Compass Point, told Yahoo Finance he’s bullish about a Phase 4 deal coming together.“I think there’s this foundational trade which will give Republicans business liability clarification and give Democrats state and local funding,” said Boltansky. “I think that trade is going to be the basis of a deal.”Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:Majority of Americans think Congress should extend enhanced unemployment benefits past July: pollCoronavirus response: What Washington has accomplished and what's nextCongressional watchdog finds 'significant risk' for fraud in Paycheck Protection ProgramBusiness leaders, tech CEOs bash Trump's visa suspensionNew bill would allow small businesses to get second PPP loanThe Yahoo Finance-Harris poll"}]}