{"article": [{"url": "https://finance.yahoo.com/news/apple-event-sept-15-iphone-apple-watch-194341769.html", "published": 1599663080.0, "headline": "Apple’s Sept. 15 event is all about the Apple Watch", "body": "Wednesday, September 9, 2020This article was first featured in Yahoo Finance Tech, a weekly newsletter highlighting our original content on the industry. Get it sent directly to your inbox every Wednesday by 4 p.m. ET. SubscribeSo when’s the iPhone 12 coming?Apple (AAPL) has officially announced it’s hosting a major event on September 15, but the tech giant has yet to reveal the products it will unveil that day. The tech giant normally announces its latest and greatest iPhones around early to mid-September, but according to Apple soothsayer Mark Gurman over at Bloomberg, the September 15 event won’t be for the iPhone, but rather the Apple Watch and iPad.While that means we might have to wait a bit longer to get a look at the iPhone 12 and its 5G capabilities, it’s not exactly unexpected. Apple has already said that it will release its iPhones a few weeks later than the usual September time frame due to production delays. That tends to happen when you’re putting together one of your most anticipated devices in years amid a global pandemic.Apple CEO Tim Cook arrives to the global premiere for Apple's \"The Morning Show\" at the Lincoln Center in the Manhattan borough of New York City, U.S., October 28, 2019. REUTERS/Eduardo MunozShould that be cause for alarm for investors? Not necessarily. A delay of a few weeks isn’t going to change consumers’ minds about buying a new iPhone, especially one that according to Wedbush analyst Dan Ives, will launch an iPhone sales supercycle.What to expect from the new Apple WatchSo how about that new watch? Well, the next-generation Apple Watch, which we’ll refer to as the Apple Watch Series 6, is somewhat of a known unknown. We’re aware that it’s on its way, but not much information about it has leaked out into the public.As this point, the biggest changes you can likely expect out of the Series 6 are a new blood oxygen sensor, which will provide you with a better understanding of how much oxygen is in your, well, blood, and improved sleep tracking. The company is also expected to debut a new entry-level Apple Watch to replace the $199 Apple Watch Series 3.A man shows the new model of Apple Watch during the opening of Mexico's first flagship Apple store at Antara shopping mall in Mexico City, Mexico September 27, 2019. REUTERS/Luis CortesWhile the iPhone is still the breadwinner of Apple’s stable of devices, the Apple Watch has become an important device in its own right. Not only is it the best-selling smartwatch in the world, according to Statista, but it’s also another means of locking consumers into the Apple ecosystem.Story continuesSure, the iPhone is the gateway that gets you to sign up for services like Apple Music and Apple TV+, but buying accessories like the Apple Watch, and of course AirPods, ensures you won’t ditch your iPhone for an Android device down the line. After all, you can’t use your Apple Watch with a Samsung phone.The September 15 event is also expected to feature a new version of the iPad Air complete with an edge-to-edge screen similar to what Apple offers with the iPad Pro. There are even rumors of Apple bringing back its Touch ID fingerprint reader. But instead of placing it on the Home button, it would be part of the power button.But what about the iPhone?So when can we expect the iPhone 12 lineup to finally make its debut? My money is on October. The company has a history of hosting events during the spookiest month of the year after its normal September iPhone launch, so it makes sense for Apple to simply flip the script this year.Apple’s device lineup isn’t the only thing it needs to impress investors. Pricing will be of the utmost importance this time around. The company is largely expected to launch two entry-level iPhone models and two Pro models. Currently, Apple offers its iPhone 11 at $699, iPhone 11 Pro at $999, and iPhone 11 Pro Max at $1,099. There’s also the iPhone SE, which starts at $399.The issue for Apple will be balancing its iPhone average selling price (ASP) given that it will likely have five different models on the market. As Bank of American’s Wamsi Mohan points out, there’s less room to move ASP any higher, and Huawei is already sitting in the $300 to $400 range.That means Apple’s pricing scheme may end up getting squeezed, as fewer people could be willing to drop a boatload of cash on a new high-end iPhone given the current economic climate. And that’s especially important in China, which makes up about 20% of Apple’s revenue.If Apple can get the pricing right for its expanded lineup, it could go a long way in ensuring predictions of a sales supercycle come true.By Daniel Howley, tech editor. Follow him at @DanielHowleyMore Tech NewsSlack misses expectations on quarterly billings, stock plummets2 reasons fears of a dot-com style tech bubble are overblownNikola and GM team up to make this 900-horsepower super electric truckPeloton bike gets some big changes — here's how much it will cost and why investors should careNetflix co-founder on creative culture: We ‘manage on the edge of chaos’Netflix co-CEO says many tech giants are 'data-exploiting'—Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn,YouTube, and reddit."}]}