{"article": [{"url": "https://finance.yahoo.com/news/black-unemployment-rate-black-lives-matter-diverse-talent-223846350.html", "published": 1593711980.0, "headline": "'People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talent", "body": "The U.S. economy added 4.8 million jobs in June, a dramatic improvement from the 2.5 million added in May. Still, 48.7 million Americans have filed for unemployment insurance since the pandemic started. Thursday’s Labor Department data shows unemployment claims exceeding 1 million for 15 consecutive weeks. But with the U.S. setting new case records, many of the businesses that had reopened their restaurants and stores are closing once again, adding to the murky outlook for the job market.The coronavirus, coupled with the momentum surrounding the Black Lives Matter movement, has illuminated the widening racial disparity in the U.S. As Linkedin (MSFT) principal economist Guy Berger said, “At the beginning of this crisis, people claimed that COVID was going to be this great equalizer. But if anything, we’ve seen it intensify inequalities in the U.S. economy.” Center for American Progress senior economist Gbenga Ajilore further highlighted on Twitter how racial inequities are as stark as ever.This month’s #JobsReport shows unemployment fell to 11.1% & for African Americans it fell to 15.4%. Many would tout this as a good thing, but this continues to ignore racial disparities. To wit, the Black-White unemployment ratio has risen to 1.5. #MindTheGap pic.twitter.com/VYkpTKoung— Gbenga Ajilore 🏃🏾‍♂️ (@gbenga_ajilore) July 2, 2020Companies across the country, in addition to navigating their business operations, are facing a racial reckoning, having to check their biases, hiring practices and overall lack of diversity.Startups that are exclusively led by women and racial minority groups only raised about 3% of all VC funding, despite being 75% of the U.S. population. Of course, the problem stems from the lack of diversity on the investor side; only one to three percent of them are Black, according to Harlem Capital managing partner Jarrid Tingle.Story continuesHarlem Capital Partners is an early-stage venture fund with a mission to change the face of entrepreneurship. Tingle’s goal is to invest in 1,000 diverse founders over the next 20 years. HCP’s portfolio includes news site Blavity, pet insurance firm Wagmo, gig economy marketplace Jobble and AI robotics company Dexai.In addition to searching for new revenue-generating diversely operated companies, Tingle said he wants to be of service to the broader community looking to make long overdue structural changes. And sometimes the solution can be quite simple.“First, it’s posting job [listings] publicly, which a lot of small organizations don't want to do. But people can't apply to jobs they don't know exist. And if you don't have a public job posting, you’re just going to go to folks you've known over time and given how housing, networks, friendships work, you're just not going to organically get those diverse folks in the ecosystem. That's number one, which does take time, but I do think it's worthwhile,” Tingle said in an interview with Yahoo Finance this week.“I think the second thing you can do is make an effort to work with folks that have cracked the code. Work with organizations that do focus on diversity, like us if you’re in the VC space. There are other companies that are actually specializing in helping folks find diverse pipelines,” he added.Sites like Jopwell and Aquent place BIPOC individuals in roles across a wide array of industries. Valence, a social network for Black professionals, has a new initiative that aims to connect Black entrepreneurs with VCs from 25 different firms, including Sequoia, General Catalyst and Greylock Partners.“The first step is taking the interview. You don't have to change your workforce overnight but you should at minimum make sure the folks you're bringing in to interview are diverse and at least represent the country,” said Tingle.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Defeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperityIf Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAnti-racism movement leads to 'Cops,' 'Gone With the Wind' being pulled from platformsAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and moreTech CEOs decry racial injustice amid George Floyd protests"}]}