{"article": [{"url": "https://finance.yahoo.com/news/jeffrey-gundlach-on-economy-post-covid-19-141054509.html", "published": 1593681500.0, "headline": "Gundlach sounds off on V-shaped recovery prospects: 'Highly optimistic' at best", "body": "Billionaire bond investor Jeffrey Gundlach believes a quick economic recovery is \"highly optimistic\" — and probably not even plausible given that a rebound to pre-coronavirus levels will take at least a year to materialize.The market’s powerful surge from its March lows has been propelled in part by investor expectations of a rapid “V-shaped” rebound, especially as coronavirus lockdowns get eased. However, Gundlach told Yahoo Finance in an interview that scenario is unlikely for a number of reasons.\"I think that whatever the consensus is on the so-called shape of the recovery, I'm taking the under,\" the CEO of $135 billion DoubleLine Capital, said on Wednesday.According to Gundlach, a sharp recovery from a steep, depression-like plunge \"basically implies is that you can take 20% of the entire workforce...[and] put them on unemployment benefits, have them produce nothing,” the investor said, referring to the staggering post-lockdown job losses. To date, nearly 50 million people have filed jobless claims in the wake of the COVID-19 crisis.Gundlach also took aim at ultra-accommodative monetary policy, saying those workers are basically receiving money “that's being lent by the Federal Reserve to buy the bonds, and that you could do that and nothing bad happens, and nobody gets hurt.”He added: “That doesn't seem very likely to me that you can have that type of hardship roll over the economy, and it’s like nothing happened.”Angst over employmentNearly 50 million Americans total have filed for unemployment since the coronavirus lockdowns took effect.The 60-year-old bond investor also believes there isn't an appreciation of \"the fear that's been instilled in people's psyches\" from the economic disruption. Although job creation has now logged two consecutive months of record gains, the damage has been deep and lasting.With the $600 per week federal boost in unemployment benefits from the CARES Act expected to roll off on July 31, it could create \"economic angst\" and create a \"major jolt\" to the psyche of out-of-work Americans, Gundlach added.Story continuesWhile the bulk of these job losses hit lower-income households the hardest, Gundlach reiterated his belief that \"another wave\" of layoffs loom for white-collar workers.People in the $100,000 to $150,000 bracket “might be at risk also in another wave of layoffs because those people don't really have any savings by and large. But also, the government's unlikely, I think, to come to the rescue for those types of people quite as readily as they did for people who are living more paycheck to paycheck in a real literal kind of sense,\" he added.If that were to happen, one of the consequences is that it would be push down wages, as there will be fewer job openings when companies downsize. Meanwhile, widespread work-from-home protocols are raising additional questions about manpower and employee productivity.\"We have all these people that are working and are at risk. You might decide, through work-at-home and other things, that there are more efficient ways doing things that we did prior to February of 2020,” Gundlach told Yahoo Finance.“I could see that there could be a round of middle management layoffs that come around because people might be revealed for not being that productive when you're doing work at home,\" he added.As a CEO, Gundlach explained that remote work has made it easy for him to discern who's contributing and who’s not.\"I just think that companies will realize that they could right size with the knowledge they have gained through this pandemic,” the billionaire said.“And so, we could see people who are making $120,000 a year and have de minimis savings, if they get pink-slipped, they're going to be in a real panic because there's not a lot of jobs open,” Gundlach stated.“They'll probably have a lot of company that are in that position. That will put downward pressure on these wages,” he added.The COVID-19 pandemic effects on the economy are also uneven — with big cities likely to suffer an exodus, especially in high cost-of-living hubs like San Francisco and Manhattan.\"That means that other parts of the country are going to start to see perhaps inflow of population. We've been tracking these kind of showings, the requests for showings of homes in various parts of the country. It's very uneven,” Gundlach said.“There are parts that are more suburban-like. It's a reversal of the trend that we had a decade ago, and so an uneven type of effect to the economy,” he added. Meanwhile, cash-strapped cities and states are “really in trouble,” he said.\"The tax revenue from states has completely collapsed. It's unlikely to improve,\" Gundlach said. He pointed to a long queue of entities that want or need government bailouts, which adds to the gloom.\"I think that the economy is going to feel the effects of the recession that we're in now for quite some time to come,” the investor said. “I think it's very unlikely that we'll get back to our peak economic growth even in 2021.\"Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsA V-shaped recovery in earnings is ‘far from certain:’ Cecchini"}]}