{"article": [{"url": "https://finance.yahoo.com/news/weve-really-had-to-tighten-our-belt-cornell-pushes-ahead-with-reopening-plan-195120743.html", "published": 1594047560.0, "headline": "'We've really had to tighten our belt': Cornell pushes ahead with reopening plan", "body": "Universities are confronting the difficult decision on whether to reopen in the fall amid the coronavirus pandemic, while trying to grapple with the financial pain brought about by state lockdowns.Cornell University, in Ithaca, N.Y., is slated to reopen its doors to around 15,000 undergraduate students on Sept. 2. To prepare, the school has spent between $3 million and $5 million on testing, tracing and isolation.“The biggest thing that we're going to do is to do surveillance testing,” Cornell Provost Michael Kotlikoff told Yahoo Finance’s On The Move. “We think that's the key thing that colleges need to do to be able to assure safety in public health.”Identifying individuals — even those without symptoms of COVID-19 — and isolating them allows the school to control the spread of the virus, Kotlikoff said.But testing 24,000 people (total Cornell population) individually is not an easy task — it’s expensive and time consuming. But that’s why the surveillance testing method is useful, the provost explained.“We are relying on pool testing… [so] we're testing asymptomatic individuals, doing it on a screening basis,” Kotlikoff said. “We will be doing surveillance testing by pool and samples and then identifying the positive pools and sending those for confirmation in a certified individual diagnostics manner.”That’s “really is the only way to effectively surveil a population that's this large,” he said.Barnes Hall, Cornell University, Ithaca, New York, USA. (PHOTO: Education Images/Universal Images Group via Getty Images)Aside from testing students regularly on campus, classes are also going to be scaled back. Cornell has opted for a hybrid approach of both in-person and online classes, according to a letter from the university’s president, Martha Pollack.“It will be different,” Kotlikoff said. Aside from mandating social distancing, and that students and faculty wear masks, the school is also going to attempt to limit interactions, and is also putting out travel guidelines.But he lamented the fact that there wasn’t a way for a business or a university to mass-order and fund COVID-19 tests, which is weighing on the school’s bottom line.Story continues“One issue here is that we don't have a good model across the country to fund surveillance testing,” Kotlikoff said. “We have, of course, insurance paying for individual tests. But we really don't have this as a general way for businesses and universities to fund and approach at this time.”He added: “So we've really had to tighten our belt, make sure we have the resources to mount something we think is safe.”Samuel Curtis Johnson Hall, School of Management on the campus of Cornell University. (PHOTO: John Greim/LightRocket via Getty Images)In recent weeks, Cornell has said that it’s safer to actually hold in-person classes in the fall, rather than opting to go completely virtual, based on epidemiological modeling by one of its professors, Peter Frazier.The “counterintuitive” logic is explained like this: If students are on campus, then Cornell can “mandate” testing, tracing and isolation regularly, as compared to students who are spread out across the country or even within Ithaca. A higher degree of control, they argued, allows for better control of the virus.\"If we have a residential, on-campus semester, then we have the authority to put all kinds of expectations and requirements on our students,\" Pollack told Inside Higher Ed. \"If we were only in an online basis, then it would be really difficult to impose regulations on students who happen to be living in Ithaca, as opposed to, say, happen to be living in Atlanta or San Francisco.\"Ivy League schools make a decisionOther Ivy League schools have also opted to offer a hybrid model, albeit with slight differences.Princeton, for instance, is allowing undergrads to return to campus in the fall for one semester with a similar hybrid approach, but is expecting to hold most classes online. Tuition will be discounted by 10% for all undergraduates, regardless of whether they’re on campus or learning remotely, the school announced.Harvard is inviting freshmen to live on campus, along with students who are having problems with remote learning — totaling around 40% of undergrads — but all classes will be held online. Even if students are on campus, they’ll learn remotely, according to the school. Students on campus are expected to move out by Thanksgiving. (Cornell is also sending students home during Thanksgiving, and they’re expected to finish the semester online.)Other colleges are also making decisions ahead of the fall semester: Rutgers in New Jersey is opting for a mostly-remote environment in the fall, with a “limited number” of in-person lessons.Some schools have sparked a plexiglass race, buying miles of the plastic ahead of reopening to ensure a barrier between individuals on campus.Associate Professor Carol Dysinger of New York University's Tisch School of the Arts, conducts her final remote office hour for the graduate school's filmmaking students May 29, 2020 at her apartment in the Brooklyn borough of New York City. (PHOTO: Robert Nickelsberg/Getty Images)Financial woes plague higher edColleges and universities across the board are reeling from the financial impact of the COVID-19-induced closures.For instance, 174-year old MacMurray College announced that it was closing in March, after the pandemic hit its finances severely. San Francisco Art Institute suspended admissions due to the coronavirus.While well-endowed Ivy League schools have managed to weather the COVID storm, they’ve still seen a hit.“We're facing substantial financial pressure from a lot of areas, particularly financial aid, where students’ [parents] are in a different economic situation … than the previous year, and we scale our financial aid and make sure they can attend Cornell,” Kotlikoff said.And since Cornell is need-blind, “that creates a significant financial pressure,” he added.—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:Schools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}