{"article": [{"url": "https://finance.yahoo.com/news/one-of-the-busiest-periods-in-history-for-public-market-debuts-nyse-executive-171649421.html", "published": 1601468660.0, "headline": "This is one of the 'busiest periods in history' for public market debuts: NYSE executive", "body": "Companies have more options to go public now than ever before, says New York Stock Exchange vice-chairman and chief commercial officer John Tuttle.“There are more pathways to the public markets that have been really created or, or resuscitated in the past few years than in the preceding few decades,” Tuttle told Yahoo Finance’s the First Trade.“If you look at an IPO, a direct listing, a SPAC, a direct listing 2.0— the IPO with the capital raise— all of them are new pathways to the public markets,” he added.Read more: What are IPO's (Initial Public Offerings)? Here's the full breakdownOn Wednesday, data mining company Palantir (PLTR) and work management software firm Asana (ASAN) were both set to go public via direct listings.The last two notable companies to go public via a direct listing over the last couple of years are Slack (WORK) and Spotify (SPOT).In this photo taken Thursday, April 3, 2014, Asana co-founders Dustin Moskovitz, left, and Justin Rosenstein, pose at the company's headquarters in San Francisco. Asana peddles software that combines the elements of a communal notebook, social network, instant messaging application and online calendar to enable teams of employees to share information and do most of their jobs without relying on email. (AP Photo/Eric Risberg)Despite a year hit with a pandemic and the uncertainty of elections, the public debut market is hotter than ever.“We thought 2020 was going to be a bit quieter because of the crisis in the first half of the year, and of course the election in the back half of year. But it's turned out to be one of the busiest periods in history, “ said Tuttle.“August was our busiest August in the history of the New York Stock Exchange. Today we’re wrapping up the busiest month in the history of the New York Stock Exchange,” he added.He says “a strong pipeline of deals” are looking to come out to market between now and the election, as well as post election.“November, December and the first quarter are continuing to line up to be busy months,” said Tuttle.Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreHere's why Tesla's stock tumbled after Battery Day, and why analysts are still bullishNikola calls short-seller report a 'hit job,' shares still fallTesla analyst is bullish on what the company is doing with its high-priced stock, raises price target to $550Apple analyst says record-breaking share price rally is about 'MOMO' not 'FOMO'Tesla shares surge 12% on day of stock split"}]}