{"article": [{"url": "https://finance.yahoo.com/news/tech-diversity-black-americans-computer-science-155931826.html", "published": 1599131240.0, "headline": "What Silicon Valley still doesn't understand about its diversity problem", "body": "While recent conversations around racial equality in the U.S. have been somewhat of a wake-up call for employers to look inward, tech giants face even more scrutiny for lagging behind others on diversity and inclusion even as they wield more power.Only 1.7% of Facebook’s (FB) technical roles are held by Black employees, according to its own diversity report. At Google (GOOG, GOOGL), which employs some 119,000 workers, a mere 3.7% are Black. Apple (AAPL) hasn’t published a fresh report since 2018, when it disclosed that 6% of its tech jobs went to Black professionals.So what’s Silicon Valley getting wrong on diversity? “What the tech industry and many large employers have gotten wrong is focusing too much on quarter-to-quarter hiring numbers,” says Michael Ellison, co-founder and CEO of CodePath, a San Francisco-based nonprofit that provides free support, mentorship, and career coaching for computer science college students throughout the U.S.CodePath founder and CEO Michael Ellison speaks with Yahoo Finance's On The Move.Instead, Ellison says tech companies need to focus on long-term systemic change that educates a more diverse group of students to enter the tech industry.“When you look at trying to fill the talent pipeline this quarter, this year, you're ignoring the fact that there are only 7,360 Black computer science graduates in all of 2019 and only 8% of them ended up becoming software engineers. So this means only 588 career-ready Black software developers each year graduating in an industry with 1.4 million software developers,” he explained an interview with Yahoo Finance’s On the Move on Wednesday. “You can't fill a diversity gap with numbers so small.”‘A strong equity lens’While Silicon Valley titans have made significant financial commitments and pledges to diversity, there’s something fundamentally broken about the system at large, according to Ellison, whose nonprofit works with 4,500 students, 95% of whom are Black, Latinx, or women.The Silicon Valley operating system is flawed in two key ways — having too much of a myopic approach, in part by recruiting largely from elite schools, and not valuing true equity, according to Ellison. The idea of eliminating inequity is to take into account the circumstances that may have helped or hurt a candidate and try to level the playing field, he explained.Story continues“When you talk about diversity but you don’t have a lens of ‘Am I working with first-generation college students?’ ‘Am I looking at low-income populations?’ Guess what? You end up going to the same places you always go to — elite schools, you look at students with lots [on their] resumes,” said Ellison.And if students from more diverse backgrounds do make their way through the door, tech companies often have a hard time retaining them, Ellison explained.“The students who are the first in are the ones who have the connections. The students who are the last ones in and the first ones out in a pandemic like this are the ones from lower income backgrounds,” he said. “So we need to have that strong equity lens and shift our thinking to go beyond numbers and focus more on long-term sustainable community change with employers.”Apple CEO Tim Cook watches from behind at an Apple Store, in New York, as Apple hosted Hour of Code events around the world as part of Computer Science Education Week. (AP Photo/Mark Lennihan, File)A critical command centerFounded in August 2017, CodePath has partnered with 50 different higher education institutions, including Howard University, Jackson State University, Virginia Tech, University of Arizona, City University of New York Queens College, Mount Holyoke College, and University of California San Diego.Especially during a pandemic, with colleges and universities scrambling to put together a fall semester, CodePath has been serving as a critical command center, according to Ellison.“We're running in-person for credit computer science courses across the country. In the first two weeks of the pandemic, we ended up helping 26 colleges and universities transition to online courses. We've been the first layer...for many of our students that are losing access to different support services.”In some ways, CodePath is acting as the hands-on, liberal arts supplement to a CS degree.“Many Black computer science graduates are not prepared for the industry. They're starting behind. They're coming from institutions that may not have the support. There’s a nationwide shortage of CS professors. So, they're already coming in and they need additional support,” said Ellison.A multi-faceted approachThis laser focus on getting underrepresented and underserved groups into tech makes a lot of sense. Some of the highest paying and most abundant job opportunities remain in the industry, and that trend has been merely accelerated by the pandemic. A new Glassdoor report found a 13.4% month-over-month increase in technology job openings compared to 2% overall in August.CodePath’s approach of working within the existing higher education system is one way to tackle this structural imbalance. Alternatives to a traditional four-year degree like Lambda School, to Codecademy and General Assembly have also been popular options for those trying to position themselves for a technical career.CodePath’s funders include Facebook (FB), Microsoft (MSFT), Yahoo Finance parent company Verizon (VZ), Walmart (WMT), Wayfair (W), venture capital firm Andreessen Horowitz, and the Federal Reserve Bank of Atlanta.Meanwhile, outside of the education, organizations are trying to lay the groundwork for Black communities to thrive in the tech world. Early stage venture capital firm Harlem Capital has the goal to invest in 1,000 diverse founders over the next 20 years. Valence, a new social network for Black professionals, connects newcomers to the workforce with well-established executives whom they may otherwise never have connected with, particularly during a global health crisis.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:47% of teachers considered making a job change in the past month: surveySerial tech entrepreneur launches ambitious alternative to school: 'It's a very progressive approach to education''People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talentWNBA Commissioner: 'There is nothing political about Black Lives Matter'"}]}