{"article": [{"url": "https://finance.yahoo.com/news/open-table-ceo-says-25-of-americas-restaurants-will-close-for-good-due-to-coronavirus-102751653.html", "published": 1593063320.0, "headline": "OpenTable CEO says 25% of America's restaurants will close for good due to coronavirus", "body": "As the world’s largest restaurant reservations platform, OpenTable has unique insight into the recovery restaurants are making as economies start to open back up from coronavirus lockdowns.Unfortunately, OpenTable data shows the tough road ahead is pointing to the grim reality that up to 25% of restaurants in the U.S. might permanently close due to the pandemic, according to OpenTable and Kayak CEO Steve Hafner.“Twenty-five percent [of restaurants closing] is still what we’re projecting,” he told Yahoo Finance’s YFi PM, reaffirming his company’s dire projection from back in May despite a recent uptick in restaurant reservations. “Even in the best of times, restaurants operate on really thin margins. So if you add on capacity restrictions, new safety and service protocols, it's really tough for a restaurant to make it.”OpenTable data, which comes from a fraction of the nearly 60,000 restaurants around the globe, shows a modest recovery for establishments in some U.S. cities as states have allowed restaurants to open dining options. Unsurprisingly, when most of the country initiated lockdowns back in March and April diners plummeted 100% year-over-year, but have since nationally recovered to about only a 65% drop relative to last year.“If you look at the individual restaurants that are open, they’re filling every table they put out there,” Hafner said.That only makes worrying spikes of coronavirus cases in some parts of the country even more problematic if they threaten more restaurants from either reopening or with seating-capacity limits. In Maine, for example, indoor bars won’t be reopening as quickly as planned. In Louisiana, occupancy limits for many establishments were recently extended. If that trend continues, more restaurants barely staying above water might shutter.Luckily for smaller restaurants, when it comes to support from those patronizing restaurants in their community, diners seem to be favoring local restaurants over big chains, according to Hafner.Story continues“In general, people are choosing to go to smaller, local restaurants than big chain venues,” he said. “I think we are seeing some shifts there.”Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Most 2020 grads are desperate and applying for jobs that aren't the right fit: MonsterMayor of city famed for defunding police says abolishing police is not the solutionAnalyst who predicted market's 40% rally says these stocks will lead to all-time highsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}