{"article": [{"url": "https://finance.yahoo.com/news/nvidia-beats-estimates-data-center-022854397.html", "published": 1597872980.0, "headline": "Nvidia beats estimates but data center performance leaves shares flat", "body": "By Stephen Nellis and Neha Malara(Reuters) - Nvidia Corp forecast third-quarter sales above expectations on Wednesday, but results from the data center business of the rising semiconductor industry star disappointed some investors, pressuring shares.The company, with a market cap that has eclipsed Intel Corp, also beat Wall Street expectations for the second quarter.Still, the results sent shares down 1.5% in trading after the bell. Before the market close on Wednesday, Nvidia's shares had gained more than 185% over the past year and with a valuation of about 53 times expected earnings over the next 12 months.Nvidia said it expects third-quarter revenue of $4.40 billion, plus or minus 2%, compared with analysts' estimates of $3.97 billion, according to IBES data from Refinitiv.The company's data center segment reported second-quarter revenue of $1.75 billion beating estimates of $1.71 billion, according to FactSet data.Nvidia said Mellanox, the Israeli networking chip firm that it acquired for $7 billion in cash this year, contributed 30% of data center segment sales.Stacy Rasgon, an analyst with Bernstein, said the figure implied that Nvidia's core data center chips grew only about 6% on a quarterly basis, which may have been lower than some investors with sky-high expectations had hoped.In an interview with Reuters, Chief Executive and co-founder Jensen Huang said the company is shipping its newest data center products as fast as possible after both introducing them and starting shipments in the second quarter, a process that in the past would play out over several quarters.\"We're going to do a lot more next quarter. We're going to do a lot more the quarter after that,\" he said. \"We're going ramp up here in the second half, and that's going give us another boost.\"Nvidia's gaming business posted revenue of $1.65 billion, beating FactSet estimates of $1.41 billion.Story continuesRevenue rose nearly 50% to $3.87 billion in the second quarter ended July 26, Nvidia said, above Refinitiv IBES estimates of $3.65 billion.Net income rose to $622 million, or $0.99 per share, in the quarter, from $552 million, or $0.90 per share, a year earlier.On an adjusted basis, the company earned $2.18 per share in the quarter compared with analysts' estimates of $1.97 per share.Nvidia was once primarily known for chips that helped video game graphics look more realistic. But more than a decade ago, Huang placed a major bet on the rise of artificial intelligence applications such as the image recognition or natural language processing computing that powers everything from autonomous vehicle development to voice assistants.The rise of those technologies helped make Nvidia the biggest U.S. chip company by market capitalization in July, when it overtook Intel, which has long dominated chips for both personal computers and inside data centers.In recent weeks, Intel shares have plunged nearly 20% as the company struggles with its chip manufacturing operations while Nvidia shares have continued to rise, leaving Nvidia with a market cap of $301.6 billion before markets closed Wednesday compared with Intel' $206.9 billion.(Reporting by Neha Malara in Bengaluru and Stephen Nellis in San Francisco; Editing by Shounak Dasgupta and Tom Brown)"}]}