{"article": [{"url": "https://finance.yahoo.com/news/these-states-had-the-most-housing-hardship-during-the-coronavirus-pandemic-191806440.html", "published": 1594218380.0, "headline": "These states had the most housing hardship during the coronavirus pandemic", "body": "States with a tourism-dependent economy, Nevada and Hawaii, were hit the hardest with the highest rates of unemployment and mortgage delinquency.When the coronavirus pandemic prompted mass layoffs in March, many newly-unemployed homeowners suddenly couldn’t pay their mortgages.A new study breaks down which states had the worst housing hardship during the pandemic. States with a tourism-dependent economy, Nevada and Hawaii, were hit the hardest with the highest rates of unemployment and mortgage delinquency over 30 days past due in May, according to a study by Bankrate, a New York City-based personal finance company.“The two states that have ranked the worst don’t have a whole lot of coronavirus cases. But for those two states, the depth of the recession has been a function of the structure of their economies. Both are very tourism heavy, and there is not a lot of diversification in their economies outside of tourism,” said Jeff Ostrowski, senior mortgage reporter at Bankrate.Unemployment in the tourism-driven economies of Nevada and Hawaii, reached 25.3% and 22.6%, respectively — and almost 10% of Nevadians and 9.3% of Hawaiians were delinquent on their mortgage in May. Nevada and Hawaii were also the hardest hit-states in April, with delinquency rates of 8% and 7.1% respectively.Unemployment in Nevada's tourism-driven economy reached 25.3% — and almost 10% of Nevadians were delinquent on their mortgage in May.And in states with high rates of coronavirus infections and deaths, housing costs also became a significant burden. Michigan, New Jersey and Rhode Island ranked just behind Nevada and Hawaii as the worst states for housing hardship. Michigan had 6.59% delinquency from 5.7% in April, and New Jersey had 10.49% delinquency in May, compared to 8.81% in April. Rhode Island’s delinquency rate was 8.41% from 7.27% in April.“In those states, things have been slowing down because they had to respond so dramatically to the public health threat,” said Ostrowski, who said these states were doubly vulnerable because Michigan had underlying economic issues and New Jersey’s housing market hasn’t quite fully recovered from the Great Recession.Alternatively, states in the upper Midwest and the Great Plains — especially the Dakotas, Montana, Idaho and Nebraska — had the least housing hardship, with less than 5.2% delinquency and single-digit unemployment.Story continues“They [Midwest states] just have not had a whole lot of coronavirus cases, so they didn’t have to shut down as severely,” said Ostrowski. “States doing comparatively well tend to be smaller states as far as population and size of the economy.”Big cities were hit hard by the coronavirus in March, April and May. But as lockdowns lifted in major cities like New York City and Seattle, cases spiked in states with smaller populations and economies, like Georgia, Arkansas, Idaho and Texas.New coronavirus cases could shift trendsBig cities were hit hard by the coronavirus in March, April and May. But as lockdowns lifted in major cities like New York City and Seattle, cases spiked in states with smaller populations and economies, like Georgia, Arkansas, Idaho and Texas. If companies in these states lay off employees, it could bring housing hardship to other parts of the country.“The states that have really had to shut down have seen unemployment rates go up. We could start to see some of these states that are being hit now have poorer performance,” said Ostrowski.There is some hope for the summer, though. State-by-state delinquency numbers for June are not yet available, but mortgages in forbearance had been decreasing for three consecutive weeks as of July 7, according to the Mortgage Bankers Association. Forbearance is a type of delinquency, where lenders and borrowers agree to postpone payments. The Coronavirus Aid, Relief, and Economic Security (CARES) Act prohibited evictions and mandated forbearance options in properties with federally-backed mortgages.“I think it [declining forbearance rates] is a good sign,” said Ostrowski, noting that “it’s hard to read into what will happen next.”Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Rent is getting cheaper in big citiesA surprising group of homeowners have paid off their mortgagesAlmost 12 million children live in a household that missed rent or mortgage payments during COVID-19: survey"}]}