{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-21-2020-222325606.html", "published": 1598023040.0, "headline": "Stock market news live updates: S&P 500, Nasdaq set fresh record closing highs", "body": "Stocks rose Friday and the S&P 500 and Nasdaq each set fresh record closing highs, after a slew of economic data released earlier reflected a faster than expected pick-up in multiple parts of the economy. Corporate earnings results Friday also came in better than expected.Tesla (TSLA) shares extended gains to hit their highest level yet, rallying further above $2,000 per share ahead of a stock split at the end of this month. Apple (AAPL) shares also hit a record high, solidifying its market capitalization at more than $2 trillion.Uber (UBER) and Lyft (LYFT) shares turned lower following a jump on Thursday, after the ride-hailing giants received a temporary extension from a California appeals court on having to reclassify their drivers as employees rather than contract gig workers.So far this week, the broader market’s gain was led once again by technology and “stay-at-home” stocks, as conflicting signs emerged that the economic recovery may drag on, and be weighed down by a lack of new fiscal stimulus into the domestic economy in the near-term. On Thursday, the Labor Department’s latest weekly jobless claims report showed new unemployment claims rose back above 1 million after briefly improving to below that level last week, highlighting the distance the economy and labor market especially still have to regain amid the pandemic.“This is a temporary setback, as Covid-19 levels are still high but dropping, and re-openings continue, though at a slower pace given Covid-19's surge in July,” Robert Frick, corporate economist at Navy Federal Credit Union, said in an email Thursday. “Though temporary, it underscores the economy is fighting in the trenches with Covid-19 now and Americans are losing jobs through secondary layoffs, bankruptcies and other factors that happen too quickly and too chaotically to accurately be accounted for week-to-week.\"New data Friday, however, showed pockets of the economy posting quicker rates of recovery. Existing home sales rose by a record in July to surpass their pre-virus level, as low rates and pent-up demand drove a surge of home purchases. And IHS Markit’s flash PMIs showed the service economy tipped into expansionary territory in August, and that manufacturing activity accelerated more than expected.Story continues—4:05 p.m. ET: Stocks close at record highsHere’s where the three major indices settled at the end of regular equity trading:S&P 500 (^GSPC): +11.65 points (+0.34%) to 3,3397.16Dow (^DJI): +190.6 points (+0.69%) to 27,930.33Nasdaq (^IXIC): +46.85 points (+0.42%) to 11,311.8—10:57 a.m. ET: Three major indices rise, S&P 500 comes within striking distance of fresh highThe three major indices pushed higher Friday mid-morning, with the Nasdaq leading the way higher with a 0.5% gain as tech stocks extended advances.The S&P 500 touched as high as 3,392.5 points as of 10:57 a.m. ET, bringing it within 10 points of its all-time intraday high set earlier this week. The information tech and Amazon-heavy consumer discretionary sectors led the rise in the index.—10:00 a.m. ET: July existing home sales unexpectedly surge by record 24.7% as housing market recovery acceleratesExisting home sales jumped 24.7% in July, accelerating to a fresh record following a 20.2% month over month gain in June, according to the National Association of Realtors’ report Friday. This brought sales of previously owned homes up to a seasonally adjusted annualized rate of 5.86 million.Existing home sales in the Northeast posted the largest monthly increase at more than 30%, followed by a 29.4% rise in sales in the west. The Midwest and South each also posted double-digit percent increases in existing home sales in July.—9:45 a.m. ET: US manufacturing, service sector activity expands more than expected in August as recovery picks up steamThe US manufacturing and services sectors each posted a faster than expected expansion in August, according to IHS Markit’s flash purchasing managers’ indices (PMI) released Friday morning.The manufacturing PMI rose to 53.6 in August from 50.9 in July. Consensus economists had expected a rise to just 51.0, according to Bloomberg-compiled data. Readings above the neutral level of 50.0 indicate expansion in a sector.The service sector PMI tipped into expansionary territory with a reading of 54.8, up from a reading of 50.0 in July. Consensus economists had expected a reading of 51.0.“August data pointed to a further improvement in business conditions across the private sector as client demand picked up among both manufacturers and service providers,” said Siân Jones, IHS Markit economist. “Notably, the renewed increase in sales among service sector firms was welcome news following five months of declines.”“Encouragingly, firms signaled an accelerated rise in hiring, as greater new business inflows led to increased pressure on capacity,” Jones added. “Some also mentioned that time taken to establish safe businesses practices had now allowed them to expand their workforce numbers. “However, expectations regarding output over the coming year dipped slightly from July due to uncertainty stemming from the pandemic and the upcoming election.”—9:36 a.m. ET: Deere, FootLocker post stronger than expected quarterly results; shares of both companies open higherDeere (DE) and FootLocker (FL), the two biggest US companies to report quarterly results Friday morning, each posted sales and profit that topped consensus expectations, adding to a growing list of corporations surprising to the upside in coping with fallout from the coronavirus pandemic.FootLocker grew comparable same-store sales 18.6%, a staggering increase from the 0.8% comps growth in the same quarter last year as the athletic-wear retailer grew online sales and got a boost from government stimulus to consumers. The company reinstated its dividend at 15 cents per share.While Deere’s fiscal third-quarter sales of $7.86 billion fell 12% over last year, the decline was much shallower expected, with consensus analysts having expected sales of about $6.7 billion. Deere raised its fiscal-year profit guidance, and now sees net income of $2.25 billion, up from its prior range of $1.6 billion to $2 billion seen previously. It estimated agriculture and turf equipment sales would fall 10%, versus the as much as 15% decline seen earlier, and said construction and forestry equipment sales would likely decline 25%, or better than the as much as 40% drop seen previously.—9:33 a.m. ET: Stocks struggle for direction to cap off a record weekHere were the main moves in markets, as of 9:34 a.m. ET:S&P 500 (^GSPC): -1.42 points (-0.04%) to 3,384.09Dow (^DJI): -3.73 points (-0.01%) to 27,736.00Nasdaq (^IXIC): -9.2 points (-0.08%) to 11,255.76Crude (CL=F): -$0.83 (-1.94%) to $41.99 a barrelGold (GC=F): -$0.10 (-0.01%) to $1,946.40 per ounce10-year Treasury (^TNX): -0.6 bps to yield 0.638%—9:30 a.m. ET: Amazon’s CEO of Worldwide Consumer to retireAmazon’s (AMZN) CEO of Worldwide Consumer is set to retire from the e-commerce giant in the first quarter of 2021, the company said in a filing Friday morning. Wilke took on the post as leader of Amazon’s global consumer unit in earlier 2013, and had been with the company since 1999.He will be replaced by Dave Clark, current senior vice president of worldwide operations.—7:19 a.m. ET Friday: Stock futures point to a slightly lower openHere were the main moves in markets, as of 7:19 a.m. ET Friday:S&P 500 futures (ES=F): 3,373.75, down 7 points or 0.21%Dow futures (YM=F): 27,617.00, down 52 points, or 0.19%Nasdaq futures (NQ=F): 11,465.00, down 12.25 points, or 0.11%Crude (CL=F): -$0.48 (-1.12%) to $42.34 a barrelGold (GC=F): -$7.80 (-0.40%) to $1,938.70 per ounce10-year Treasury (^TNX): -0.6 bps to yield 0.638%—6:11 p.m. ET Thursday: Stock futures open higherHere were the main moves in equity markets, as of 6:11 p.m. ET:S&P 500 futures (ES=F): 3,385.00, up 4.25 points or 0.13%Dow futures (YM=F): 27,707.00, up 38 points, or 0.14%Nasdaq futures (NQ=F): 11,488.5, up 11.25 points, or 0.1%NEW YORK, NEW YORK - MAY 26: A trader walks by the New York Stock Exchange (NYSE) on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}