{"article": [{"url": "https://finance.yahoo.com/news/why-the-coronavirusled-boom-in-digital-health-may-or-may-not-last-for-long-134146706.html", "published": 1599986960.0, "headline": "The coronavirus has sparked a boom in digital health, but some say it may not last", "body": "Digital health services, which surged during the COVID-19 outbreak as a placeholder to help patients while doctors offices were shuttered and prevented health systems from being overwhelmed, have long been seen as critical in addressing shortages in rural health services.Before the coronavirus pandemic, virtual health got scarce attention or appreciation. Yet as the world continues to battle the virus — and digital health enjoys its best year as a sector, with companies scaling to meet spiking demand — a debate is emerging over whether the trend is sustainable.Mega-deals like Teladoc’s (TDOC) $18.5 billion acquisition of Livongo have punctuated a trend of major money flowing into the sector. According to a report from Silicon Valley Bank and EY, health tech deals increased by 18% in the first half of 2020, compared to 2019. And the trend isn’t slowing down, with American Well recently going public, and MDLive reportedly pursuing the same for early 2021.Still, big questions remain about whether telehealth and other digital platforms are here to stay. As life slowly returns to normal, it’s possible that in-person visits may stage a comeback.At least a few big employers seem to think the trend is permanent, according to an annual survey by Business Group on Health (BGH). A whopping 80% of those surveyed believe virtual health will play a significant role in how care is delivered in the future — a sharp increase from 64% last year and 52% in 2018. And over half (52%) expect more virtual care options next year, including for mental health, according to the survey.“Virtual care is here to stay. While employers have been implementing more virtual solutions in recent years, the pandemic caused the pace to accelerate at an astronomical rate. And virtual care is now garnering growing interest and receptivity from both employees and providers who increasingly see its benefit,” said Ellen Kelsay,president and CEO of BGH.Keeping the money spigot openStory continuesConfirmed coronavirus cases. (David Foster/Yahoo Finance)But some in the industry itself aren’t so sure. The Kaiser Family Foundation, which has been tracking the telemedicine trend, has observed that many regulatory and practice changes to utilization and reimbursement are temporary. With hopes riding high on a vaccine that could reset public life next year, the gradual lifting of social distancing restrictions may make the boom untenable, the study suggested.“Overall, it is unclear whether we will continue to see high rates of telehealth utilization once the pandemic is over,” the Kaiser study’s authors wrote.“Many of the policies enacted for private insurance plans have sunset dates, though several have extended the policies, some through the end of 2020 or until the public emergency is over,” it added.Teladoc CEO Jason Gorevic recently told Yahoo Finance he believes better reimbursement is likely to continue, and demand for the technology has become mainstream.“I think all signs indicate that reimbursement is here to stay, and specific to government-based Medicare reimbursement,” he said. “We’re seeing the COVID relief package with waivers through the end of 2021.”However, Dr. Stephen Klasko, CEO of Jefferson Health, believes there isn’t enough momentum to sustain the telehealth wave — at least not without significant changes to reimbursements.Insurers are currently “willing to pay $1,500 in for emergency visits and $49 for telehealth,” Klasko said, highlighting the misalignment of incentives for payors and providers.It’s why when offices had to close in areas where the virus transmission spiked, doctors faced a sudden erosion of their annual revenues — with reports of at least a 40% drop in visit volumes.Though insurers and the government increased reimbursement to match, or come close to, in-person visits, the lower volume of patients impacted doctors’ bottom lines — especially those who were not prepared to immediately jump into virtual visits and remote monitoring of their patients.And Klasko believes there will be an immediate return to in-person visits when the pandemic is over— a trend already occurring as the gradual end of restrictions in many areas allow offices to reopen. Though not at the rate most experts would like, since preventative care is being ignored.On January 1, prior to the pandemic hitting the U.S., Aetna (CVS) changed reimbursement in all 50 states to reflect equivalent pay for in-person or virtual visits. The caveat was that providers in-network would benefit, while out-of-network doctors would see a different reimbursement rate.If other insurers follow Aetna’s lead, that creates another layer of concern about whether virtual visits will add to the overall spend in health care through redundant visits, or whether it will help avoid costly emergency visits.Many health experts believe focusing on value-based care — where doctors are paid to care for a patient overall, rather than per visit or service rendered — is the key to avoiding that problem.Insurers have long pushed the idea of value-based reimbursements because it ensures more control over expenses, rather than having to review and approve or deny each claim, item by item. Humana (HUM) also backs the idea in principle.“The beauty of this model is that it makes how you're accessing health services —whether in person or through telehealth — irrelevant because payment is not based on the volume or the service but instead on the overall health outcomes,” spokesperson Kate Marx recently told Yahoo Finance.Dr Greg Gulbransen takes part in a telemedicine call with a patient while maintaining visits with both his regular patients and those confirmed to have the coronavirus disease (COVID-19) at his pediatric practice in Oyster Bay, New York, U.S., April 13, 2020. Picture taken April 13, 2020. REUTERS/Lucas JacksonHow doctors see itDr. Wyatt Decker, CEO of OptumHealth, the provider arm of United Health Group (UNH), believes the landscape will be “forever...changed” by outcome-based payments, which he believes will make provides and patients more comfortable.And while telehealth usage has waned compared to the sudden spike over late spring and early summer when the pandemic surged throughout the U.S., Decker told Yahoo Finance there is room to keep the momentum going.“As we get more scientific data around the value virtual care provides, that should guide the level of reimbursement,” Decker said.However, virtual health may be “at a crossroads,” according to Aledade chief administrative officer Sean Cavanaugh, warning that the industry should not become “another piston in the fee-for-service engine.”The former deputy administrator at the Centers for Medicare and Medicaid Services (CMS) told Yahoo Finance that an area where telehealth can be beneficial in a post-pandemic world is transition care. When a patient is discharged from a hospital, they can be monitored remotely instead of in person.SIOUX FALLS, SD- OCTOBER 17: Hannah Schulte, RN has a quiet moment after a patient had passed away on October 17, 2019. As hospitals and physicians continue to disappear from rural America there is an attempt to fill the void: a telemedicine center run by Avera Health that provides remote emergency care for more than 175 understaffed hospitals across thirty states. (Photo by Michael S. Williamson/The Washington Post via Getty Images)Different trends for different technologiesMeanwhile, technology is helping the industry adapt to changes in demand. The need to monitor chronic or vulnerable patients from a distance provides a perfect use case for remote monitoring, communication and wearable devices. For instance K Health, a service co-branded by insurer Anthem (ANTM), allows unlimited chat messages with a primary care doctor.It has also increased sales for traditional medical device companies like Abbott, and interest in smaller players like Current Health and Tomorrow Health, which are focused on remote monitoring devices.Abbott saw interest spike in its remote glucose monitoring devices at hospitals to allow diabetic patients to be monitored without excess interactions with nurses. Similarly, devices like heart rate monitors, blood pressure cuffs and weighing scales are also picking up.Separately, mental health providers like Hazel Health — which recently got backing from Centene (CNC) — has seen a spike in usage as well. Meanwhile, as the focus on diversity grows, so too do companies like Hoy Health, which has focused on multi-lingual patients. Both provide services to the uninsured populations, with varying levels of out-of-pocket costs.How usage trends behave for the remainder of the year, and into next year, will determine how overall health spend in the U.S. is impacted. Kaiser’s analysis found that telemedicine could impact other areas of health spending and outcomes.“On one hand, if providers are reimbursed at lower rates, telehealth could offer savings. On the other hand, there may be concerns that these services could be additive (increasing health utilization overall) rather than just replacing in-person visits,” the study said.“Another important question for researchers and policymakers to continue monitoring is whether telehealth services are providing care that can truly replace in-person visits,” it added.Yet its clear that digital health has at least something to offer, even if demand tapers off.“I’m bullish because people are coming to us, payors, vendors, doctors— that tells you the supply side is looking. They think there’s a business there. The demand side we experienced through [COVID-19],“ Privia Health CEO Shawn Morris told Yahoo Finance.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}