{"article": [{"url": "https://finance.yahoo.com/news/schools-reopening-amid-coronavirus-pandemic-205923992.html", "published": 1593965840.0, "headline": "Schools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemic", "body": "As millions of students return to school — be it K-12 or university — they’ll return to familiar settings in their classrooms with one obvious addition: layers of plexiglass.It remains unclear if schools — universities in particular — can reopen campuses amid a surge of coronavirus cases and new restrictions, such as the 14-day quarantines demanded from those who travel from various to the Tri-state area of Connecticut, New Jersey, and New York.Sheets of plexiglass would play a big role in a reopening, and schools across the country are investing in the plastic sheet to create a division in common spaces such as in libraries, classrooms, and even school buses to defend against transmission of coronavirus.“We’re hitting records… week in week out, at this point from a sales perspective,” Ryan Schroeder, CEO of Plaskolite, one of the country’s biggest plexiglass makers, told Yahoo Finance. “Orders have been substantially higher [than normal]. So we are really, at this point, running all our sheet machines at full capacity… around the clock.”Pupils sitting behind partition boards made of plexiglass attend a class at a primary school, during the coronavirus disease (COVID-19) outbreak, in Den Bosch, Netherlands, May 8, 2020. (PHOTO: REUTERS/Piroschka van de Wouw)Plexiglass seller is ‘hitting records’A Dallas-area school district recently ordered 30,000 sheets of plexiglass, or about five miles.In Roanoke County, Virginia, the school district has placed an order for 3,600 square feet of plexiglass “to create barriers for each school front office,” spokesperson Chuck Lionberger told Yahoo Finance. “We are in the process of getting quotes for 2,800 plexiglass portable dividers (30x24”) for use in classrooms” on students’ desks, as well as dividers between them on tables.San Jose State University told Yahoo Finance that it is continuing to “outfit several of our front-of-house services and customer service areas, such as dining commons, library, and housing front desks, with plexiglass.”Spokesperson Kenneth Mashinchi added that some classrooms may also have some plexiglass, but the school’s trying to avoid using it in labs and classrooms as much as possible, “instead focusing on reduction in density and physical distancing.”Story continues(PHOTO: PURDUE)Purdue University, which has purchased more than five miles of plexiglass, told Yahoo Finance that it plans to place the plexiglass in areas where face-to-face interactions occur. That would be a lot of places such as classrooms, hallways, offices, book stores, and reception areas.Plaskolite, an Ohio-based company, has 10 factories across the country and is currently facing a 30-week backlog.“Our lead times are extended substantially, partly because of our other conditional customers — as they come back online, we need to be able to serve them as well, and not throw the baby out with the bath water,” said Schroeder, the Plaskolite CEO.Some of the orders placed by schools include requests for plexiglass sheets placed on mounts so that they can be rearranged if needed, as well as custom-made sheets to be placed inside a school bus.“We’ve seen more demand and interest from K-12 [schools],” Schroeder said, adding that there’s been a mix of orders from both private and public schools from New York to Los Angeles.“It has been straight across the country… [but with] certainty more interest win urban environments,” he added. “There’s definitely a lot of work going into… having kids that go back to school in the fall.”The cost of these sheets varies according to the products — whether the customer is ordering acrylic or polycarbonate. A pound of either could run from $4 to $6.(PHOTO: PLASKOLITE)Acrylic is generally a stronger product that doesn’t crack or break easily, Plaskolite noted, and estimates that the cost of a typical 4’ by 8’ sheet with 1/4” plastic weighs around 40 pounds.Schroeder said that the average size ordered was around 2,500 sheets. If a school ordered 2,500 sheets, that’d be roughly $100,000.Staff install a Plexiglass pane on the teacher's table during preparations for reopening the temporarily-closed Schloss-Schule elementary school on April 21, 2020 in Heppenheim, Germany. (PHOTO: Alex Grimm/Getty Images)Costs adding up The expenses don’t end there.“There is a lot more than just plexiglass,” said Tim Doty, a spokesperson for Purdue.Purdue is also spending millions in heating, ventilation and air-conditioning (HVAC) systems, disinfecting improvements, boosting student testing, and creating safety kits, among other efforts.And it’s not going to be easy for schools and universities to take on these safety measures, as not all have the same amount of resources, particularly at the K-12 level.A recent Government Accountability Office (GAO) report found that when looking at K-12, 41% of school districts need to replace their HVAC systems in at least half their schools.(Source: Government Accountability Office)“Even before the COVID-19 pandemic, outdated and hazardous school buildings were undermining the quality of public education and putting students and educators at risk,” House Committee on Education and Labor Chairman Bobby Scott said in a statement. “Now, the pandemic is exacerbating the consequences of our failure to make necessary investments in school infrastructure.”Another obstacle, particularly for colleges, is whether professors —most of whom are older and therefore more vulnerable to contracting COVID-19, the disease caused by coronavirus — will be willing to return in the fall.“Until there’s a vaccine, I’m not setting foot on campus,” Dana Ward, 70, an emeritus professor of political studies at Pitzer College in California, told the New York Times. “Going into the classroom is like playing Russian roulette.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:The American teacher crisis is getting rapidly worse amid coronavirus pandemic'It’s a freaking circus': Unemployed Americans share tales of an overloaded system'Struggling so severely': Coronavirus exposes the gulf between the haves and have-notsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}