{"article": [{"url": "https://finance.yahoo.com/news/ll-cool-j-on-his-rock-the-bells-brand-and-hiphop-its-time-for-us-to-lift-up-our-own-131150435.html", "published": 1592554760.0, "headline": "LL Cool J on his Rock The Bells brand and hip-hop: 'It's time for us to lift up our own'", "body": "For LL Cool J, his latest business venture is rooted in reminding the world of the greats in hip-hop who charted the path for today’s generation of stars.These trailblazers have been forgotten for too long, the music icon tells Yahoo Finance, and it’s time to change that.“I think the reason that people forgot is just because time moves on and somebody had to step up and say, and get the narrative right you know what I mean because 200 to 300 years from now, I want people to really be thinking about Rock The Bells and you know history is written by the winners,” LL Cool J said.LL Cool J is coming off a major expansion of his Rock The Bells brand online (the name pays homage to one of his hits, Rock The Bells) this week. More than a year in the works, the brainchild of LL Cool J — targeted to the Gen X fans of classic hip-hop (which includes this writer) is a website that features written and video content from the legends of hip-hop such as Big Daddy Kane, Run DMC, Eric B, Salt-N-Pepa, Fab 5 Freddy, Risk, Crazy Legs, Roxanne Shanté and Jonathan Mannion. All nine were hand-selected by LL Cool J to receive ownership in Rock The Bells brand.“We wanted to build a company where they [the artists] had an opportunity to capture value because so many times, you have the mega million dollar and the mega trillion dollar companies, and they have basically got all of the value. You know they have monetized the culture, they monetize hip-hop culture in a major way. Very few, you have maybe three or four guys that you can point to and say, Oh, he's on Forbes he, this and that but they're like, they are anomalies,” explained LL Cool J.He added, “The majority didn't really get that bite at the apple, to get that opportunity. So the thing that drives me is just seeing these artists not only have ownership in a company, but be lifted up and put on a pedestal that they deserve to be on. Why can't a writer like a Rakim get the same respect as a guy like Bob Dylan? Why can't you know, why can't LL Cool J get the same respect as a guy like Bono? I think that we have the same fans. We have, you know, a huge culture that's global and you know I just think it's time for us to lift up our own, so I just went for it, man I said, this has to happen.”Story continuesLOS ANGELES, CA - MARCH 28: LL COOL J poses onstage during LL COOL J Celebrates the Launch of His Exclusive SiriusXM Channel \"Rock The Bells Radio\" at World on Wheels in Los Angeles on March 28. (Photo by Neilson Barnard/Getty Images for SiriusXM)An interesting aside, LL Cool J has launched a carefully curated marketplace on Rock The Bells dedicated to buy limited-edition products synonymous with the classic hip-hop era. Think Amazon, except heavily tailored to the Rock The Bells mission statement of promoting OGs (“original gangsters”) in hip stock. For example, you could buy ‘90s inspired Nike Air Jordan retro sneakers for $1,100.LL Cool J’s goal is to continue to build out the content and marketplace, including the addition of virtual content in 2021.The potential for the business could be seen in the impressive backers brought on board. Redpoint Ventures’ founding partner Geoff Yang is an investor and coming on as a co-founder and chairman. Glenn Hutchin’s (co-founder of Silver Lake Partners and AT&T board member) North Island is on board. And so is Mark Cuban’s Radical Investments and Apple senior vice president of internet software and services Eddy Cue.Executive talent has been brought on board from Facebook, Farfetch, Highsnobiety and Lollapalooza.“I was attracted by the size of the potential market, the vision of passion of the founder (LL Cool J), and a competitive advantage (the fact that he is the perfect person to do it.),” explained Yang in an email to Yahoo Finance. “The space is interesting because it is not just a popular genre of music. Hip-hop (and classic hip-hop by interference because it represents the roots of hip-hop) is deeply rooted in culture and lifestyle. That culture is manifested in TV, film, art, fashion, and politics. In many ways, it speaks to the struggles that our current society sees today in the form of protests and social commentary.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Magic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}