{"article": [{"url": "https://finance.yahoo.com/news/home-depot-cofounder-and-atlanta-falcons-owners-best-advice-for-new-york-mets-owner-steve-cohen-161515632.html", "published": 1600169000.0, "headline": "Home Depot co-founder and Atlanta Falcons owner's best advice for New York Mets owner Steve Cohen", "body": "Here’s a big tip on how to run a successful sports franchise from one born and bred New Yorker to another.“It’s not very complicated to be a team owner,” Home Depot co-founder and long-time Atlanta Falcons owner Arthur Blank told Yahoo Finance’s The First Trade. When asked what advice he would give new New York Mets owner and financier Steve Cohen, the Queens-born Blank and author of new book “Good Company” said a tremendous amount of listening needs to be done to make the Mets a winning organization again. Cohen’s listening tour should run from fans’ gripes about the team (and there are many with the Mets) and issues inside the organization.That approach is the only way the long under-achieving Mets may find success, well, that and Cohen (worth a reported $14 billion) opening up the payroll pocketbook that outgoing owners the Wilpons have mostly kept closed in recent years, post Madoff scandal.Says Blank, “So I would say in the case of the Mets and the people inside the building, tell [Cohen should tell them] them I understand your feelings. I understand your ideas and notions and what we have to do to fix the franchise.”The Long Island, N.Y.-born Cohen finally won the bidding battle for the Mets this week, shelling out $2.4 billion to get the job done.To be sure, the controversial Cohen would be wise to read up on Blank’s story — he has a knack for winning.Feb 1, 2020; Miami, Florida, USA; Atlanta Falcons owner Arthur Blank appears on the red carpet prior to the NFL Honors awards presentation at Adrienne Arsht Center. Mandatory Credit: Kirby Lee-USA TODAY SportsBlank and Bernie Marcus co-founded Home Depot in 1978 after being surprisingly fired from their jobs at Handy Dan Home Improvement. Joining Blank and Marcus in the venture — which was seen as novel at the time for its expansive array of home improvement products in a large store format — was financier Ken Langone and veteran retail executive Pat Farrah.Blank was forced out as CEO in 2001 (a position he assumed in 1997) as he moved to an executive chairman role) in a shocking move by the board. In came GE Jack Welch disciple Bob Nardelli as CEO, who viewed by many inside and outside Home Depot as almost ruining the company by slashing costs and caring little about customer service. While Nardelli was running Home Depot into the ground (as detailed in Blank’s book), Blank bought the Atlanta Falcons in 2002 for $545 million.Story continuesHe has remained an owner ever since. Meantime, Nardelli received the boot long ago — replaced by highly regarded retail executive Frank Blake and then more recently, his hand-picked successor Craig Menear. Both executives have done their part in leading Home Depot’s stock price to record highs by re-focusing the company back on Blank’s core values and making an aggressive push online.Today, Home Depot’s market cap is a cool $306 billion and the Falcons are reportedly worth nearly $3 billion.Here’s what Blank’s co-founder Bernie Marcus recently told Yahoo Finance about the state of small businesses amidst the COVID-19 pandemic.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}