{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-vaccine-possible-by-winter-top-harvard-scientist-113444435.html", "published": 1597905740.0, "headline": "Coronavirus vaccine 'possible' by winter: Top Harvard scientist", "body": "A coronavirus vaccine is “possible” by the end of 2020, but will not become widely available until 2021, Harvard University vaccine researcher Dr. Dan Barouch told Yahoo Finance in a recent interview.He hailed the preliminary success of multiple vaccine candidates but warned that safety precautions and unforeseen difficulties could push back the timeline.“It's theoretically possible that there could be one or more vaccines available for emergency use authorization this winter, by the end of this year,” Barouch said. “Or perhaps more likely beginning of 2021.”“In terms of the current clinical trials that are underway, the hope is that those might read out by late fall, perhaps by the end of this year,” Barouch, who directs the Center for Virology and Vaccine Research and has collaborated with pharmaceutical company Johnson & Johnson (JNJ) on the development of a vaccine, said on Monday.There are 32 vaccines currently undergoing human trials, including eight candidates that have entered phase three trials involving thousands of test subjects, the New York Times reports. Last month, pharmaceutical companies Moderna (MRNA) and Pfizer (PFE) announced that each had begun phase three trials on a respective vaccine candidate.Moderna will likely complete phase three trials by Thanksgiving, the company’s CEO Stephane Bancel said.Earlier this month, President Donald Trump said he was “optimistic” that a vaccine will be ready around Election Day, Nov. 3, while Barouch said the best possible timeline would deliver a vaccine by the end of 2020.“The most optimistic scenario is that one or more vaccines will be available for emergency use authorization by the end of this calendar year or beginning of 2021,” he says. “Then vaccines becoming more available for the general public sort of throughout the 2021 calendar year.”“Of course, we also know that not everything goes absolutely perfectly the first time in science and medicine. In which case, then, of course, the timelines will have to be revised,” he adds.Story continuesBarouch spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Dr. Dan Barouch is pictured at Beth Israel Deaconess Medical Center's Center for Virology and Vaccine Research in Boston, MA on March 5, 2020. Barouch Laboratory is working to develop a coronavirus (COVID-19) vaccine using the genetic sequence of the virus. (Photo by Craig F. Walker/The Boston Globe via Getty Images)The U.S. government and Johnson & Johnson have invested a combined $1 billion in a vaccine candidate co-developed by Beth Israel Deaconess Medical Center, where Barouch runs the Center for Virology and Vaccine Research. The vaccine is currently undergoing phase one and two trials but aims to begin phase three trials next month, Barouch saidAmid widespread eagerness for a vaccine, Barouch stressed the importance of tests that ensure the vaccine works and doesn’t do harm.“It's very difficult to predict the future. We, of course, would hope to have a vaccine as soon as possible, but at least in my opinion, only when it's been proven to be safe and effective, because I think that's absolutely critically important for any vaccine, even during a pandemic period,” he says.Vaccine development has served as a bright spot alongside the difficulties faced in fighting the coronavirus, he added.“There have been a lot of challenges and issues with COVID-19 that have really not gone very well,” he says. “But I would say that vaccine research overall for the field has gone very well so far, in terms of the field developing not one but multiple different vaccine candidates.”Read more:Economy may undergo ‘sawtooth’ recovery from coronavirus: Former Fed Vice ChairBill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}