{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-20-2020-221258239.html", "published": 1597936340.0, "headline": "Stock market news live updates: Stocks slightly positive despite surprise spike in jobless claims; Tesla sets new record", "body": "Stocks turned slightly higher Thursday afternoon as investors absorbed a rise in the Labor Department’s weekly jobless claims report, and digested more earnings from Corporate America.[Click here to read what’s moving markets heading into Friday, Aug. 21]The latest read on the labor market suggests the recovery is losing steam. The Labor Department’s weekly unemployment claims report showed that 1.1 million workers filed for benefits last week, well above consensus economists expectations of another 920,000. Analysts have been hopeful that claims could one again dip below the 1 million mark for a second time since the start of the pandemic, yet the numbers are still well above the pre-pandemic record of 665,000 new claims from March 2009.The data couldn’t have come at a more inopportune moment, as Washington has yet to agree on a new stimulus package, and the coveted $600 per week unemployment bonus has expired.“Net, net, new jobless filings are rising again which means the economy isn't out of the woods yet with many businesses across the country still in full or partial shut down and unable to pay all their employees or make the mortgage rent and keep the lights on,” Chris Rupkey, chief financial economist for MUFG Union Bank, said in an email. “The stock market rally on confidence the worst of the recession is behind us may be premature.”Market participants also reacted to the cautious tone struck in the Federal Open Market Committee’s July meeting minutes, as well as officials’ apparent unreadiness to clearly signal their guidance on the path forward for interest rates at their next meeting. In the minutes released Wednesday afternoon, policymakers also appeared to shirk the prospects of adopting formal yield curve targets in the near-term. Treasury yields fell Thursday morning.On the US economy, US central bankers agreed that “the ongoing public health crisis would weigh heavily on economic activity, employment, and inflation in the near term and was posing considerable risks to the economic outlook over the medium term.”Story continuesPaul Ashworth, Capital Economics chief US economist, said in a note that “despite evident concerns that the resurgence in infections could weigh on the economy, the majority of officials were content to wait for more incoming information.”However, “with the infection rate falling again, there may be less urgency to add to the monetary policy stimulus. But the other thing that stands out from the minutes is that Fed officials still believe ‘strong fiscal policy support’ is ‘necessary to encourage expeditious improvements in labor market condition. With Congress failing to extend the fiscal stimulus, more of the burden will fall to monetary policy,” he added.—4:03 p.m. ET: Stocks shake off jobless claims spike, Nasdaq closes at a record as tech ralliesHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +10.68 (+0.32%) to 3,385.53Dow (^DJI): +46.98 (+0.17%) to 27,739.86Nasdaq (^IXIC): +118.49 (+1.06%) to 11,264.95Crude (CL=F): -$0.31 (-0.72%) to $42.62 a barrelGold (GC=F): -$9.90 (-0.50%) to $1,960.40 per ounce10-year Treasury (^TNX): -3.1 bps to yield 0.6440%—3:10 p.m. ET: Uber, Lyft win temporary reprieve on order reclassifying drivers as employeesA California state appeals court granted ride-hailing companies Uber and Lyft an extension from having to quickly convert their drivers in the state to employees, allowing them to keep their current business model intact for the time being. The decision comes after Lyft earlier in the day said it would temporarily shut down its operations in California to comply with the judge’s orders.Uber and Lyft are in the midst of fighting a California court ruling in which a judge said that drivers must be classified as employees rather than as independent contractors.—1:59 p.m. ET: Stocks turn slightly positive, shaking off earlier lossesHere were the main moves in equity markets, as of 1:59 p.m. ET:S&P 500 (^GSPC): +4.42 points (+0.13%) to 3,379.27Dow (^DJI): +8.95 points (+0.03%) to 27,701.83Nasdaq (^IXIC): +78.20 points (+0.7%) to 11,225.07—1:15 p.m. ET: Lyft stock slides after company announces plans to suspend ride-sharing in CaliforniaLyft (LYFT) said in a statement that it would suspend its ride-sharing operations in California starting at 11:59 p.m. PT Thursday. The announcement came after a California judge last week ordered Uber and Lyft to reclassify their drivers as employees, after the state sued the ride-hailing companies in May.“This is not something we wanted to do, as we know millions of Californians depend on Lyft for daily, essential trips,” Lyft said in its decision to halt California operations. “For multiple years, we’ve been advocating for a path to offer benefits to drivers who use the Lyft platform — including a minimum earnings guarantee and a healthcare subsidy — while maintaining the flexibility and control that independent contractors enjoy. This is something drivers have told us over and over again that they want.”—1:05 p.m. ET: Tesla keeps foot on the gas, stock hits $2000 per shareTesla Inc CEO Elon Musk takes off his coat onstage during a delivery event for Tesla China-made Model 3 cars in Shanghai, China January 7, 2020. REUTERS/Aly SongThe electric carmaker has hit a new intraday record at $2003 per share, as bullish investors won’t be denied ahead of a stock split, and its inclusion in the S&P 500. There’s no new driver but traders are hyped over the company’s future prospects.—12:11 p.m. ET: Delta Air Lines to block middle seat on flights through the holiday travel seasonDelta Air Lines (DAL) extended its policy of blocking middle seats beyond September, taking a precautionary measure of continuing to encourage social distancing even as airlines face an unprecedented drop-off in travel demand.Under the new policy, the airline said it will block middle seat assignments for most passengers through Jan. 6. Still, the company is increasing the maximum number of passengers that will be allowed on each flight starting in October.The announcement comes a day after Delta on Wednesday announced it would add back two weekly flights between the US and China starting next week, for a total of four between these destinations.—10:25 a.m. ET: Stocks pare some losses; Nasdaq turns positive as tech shares climbStocks cut some of their earlier losses to trade near the flat line Thursday morning. The Nasdaq turned positive as each of Facebook, Apple, Amazon, Google-parent Alphabet and Netflix gained. The 30-stock Dow fell as shares of materials company Dow Inc., Walmart and Chevron each declined more than 1%.The S&P 500 was weighed down by a drop in the energy sector, as US crude oil futures slid 3% and paced toward their first decline in four sessions. The real estate, information tech and communication services sectors rose.—9:31 a.m. ET: Stocks open lower after disappointing jobless claims reportHere were the main moves in markets, as of 9:31 a.m. ET:S&P 500 (^GSPC): -20.04 points (-0.59%) to 3,355.01Dow (^DJI): -152.46 points (-0.55%) to 27,540.42Nasdaq (^IXIC): -48.42 points (-0.44%) to 11,098.51Crude (CL=F): -$0.94 (-2.19%) to $41.99 a barrelGold (GC=F): -$30.90 (-1.57%) to $1,939.40 per ounce10-year Treasury (^TNX): -3.4 bps to yield 0.641%—8:30 a.m. ET: Jobless claims spike again in the latest weekBad news for the labor market as new unemployment claims jump to 1.1 million in the latest week, well above consensus expectations for a sub- 1million reading and a sign that the recovery is losing momentum. Last week’s better-than-expected figure raised hopes that the COVID-19 outbreak’s impact on jobs could be waning, but with new infections still on the rise, those hopes have been tempered.Stock futures are lower on the news, pointing to a weak open for Wall Street.—7:21 a.m. ET: Alibaba quarterly results top estimates as core commerce business ‘fully recovered to pre-Covid-19 levels’Alibaba (BABA) posted second-quarter sales and profit that handily topped estimates, as a recovery in Chinese consumer spending helped the e-commerce giant’s core business return to pre-pandemic levels of performance.Quarterly sales grew 34% to 153.75 billion yuan, or about $21.8 billion, and topped estimates for 148.06 billion yuan. Adjusted earnings of 14.82 yuan were better than the 13.79 yuan expected. Mobile monthly active users grew to 874 million, beating estimates by about 3 million.“Our domestic core commerce business has fully recovered to pre-COVID-19 levels across the board, while cloud computing revenue grew 59% year-over-year,” Maggie Wu, chief financial officer of Alibaba Group, said in a statement. “Our strong profit growth and cash flow enable us to continue to strengthen our core business and invest for long term growth.”—7:06 a.m. ET Thursday: Stock futures point to a lower openHere were the main moves in markets, as of 7:06 a.m. ET:S&P 500 futures (ES=F): 3,367.5, down 5.25 points or 0.16%Dow futures (YM=F): 27,588.00, down 44 points, or 0.16%Nasdaq futures (NQ=F): 11,335.25, up 3.25 points, or 0.03%Crude (CL=F): -$0.48 (-1.12%) to $42.45 a barrelGold (GC=F): -$32.40 (-1.64%) to $1,937.90 per ounce10-year Treasury (^TNX): -2.1 bps to yield 0.654%—6:01 p.m. ET Wednesday: Stock futures open slightly lowerHere were the main moves in equity markets, as of 6:01 p.m. ET:S&P 500 futures (ES=F): 3,370.25, down 2.5 points or 0.07%Dow futures (YM=F): 27,628.00, down 4 points, or 0.01%Nasdaq futures (NQ=F): 11,326.5, down 5.5 points, or 0.05%NEW YORK, NEW YORK - MAY 26: Television journalists and others gather across from the entrance to the New York Stock Exchange (NYSE) on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}