{"article": [{"url": "https://finance.yahoo.com/news/google-parent-alphabet-tops-quarterly-202152925.html", "published": 1596122960.0, "headline": "Google ad rebound offsets Alphabet's first-ever sales drop", "body": "By Paresh Dave and Munsif VengattilOAKLAND, Calif./BENGALURU (Reuters) - Google's ad sales have recovered since plummeting in March during the coronavirus pandemic, parent Alphabet Inc <GOOGL.O> said on Thursday, easing concerns about its first quarterly sales slide in its 16 years as a public company.Alphabet shares were barely changed at $1,552, above their pre-pandemic high, after it said revenue fell 2% in the second quarter, less than analysts' estimate of a 4% decline.Alphabet, whose ad sales account for about 78% of its revenue, has struggled during past economic slowdowns, as marketing is often the first budget item to get slashed.But Google and its online advertising rivals Facebook Inc <FB.O> and Amazon.com Inc <AMZN.O> on Thursday all reported better results in the pandemic than in past recessions.With its mostly free tools for web browsing, video watching and teleconferencing, Google has become a larger part of many consumers' lives as lockdown orders force people to rely on the internet for work and entertainment. In turn, the internet has become more attractive to advertisers than TV, radio and other avenues.\"We saw the early signs of stabilization as users returned to commercial activity online,\" Alphabet Chief Executive Sundar Pichai told analysts during a conference call on Thursday.Search ad sales at the end of June were about flat with a year ago, marking an improvement from a \"mid-teens\" percentage decline in March, Alphabet Chief Financial Officer Ruth Porat told the analysts.YouTube ad sales rose 6% in the second quarter, and were growing even faster by late June, Porat said. Sales of ads on partner properties fell 10% but were \"improving somewhat toward the end of the quarter as advertisers' spend began to return,\" she added.Overall second-quarter revenue was $38.3 billion, with the slowest growth since a 2.9% increase during the Great Recession in 2009.Story continuesAlphabet announced a $28 billion boost to its share buyback program. It said it would still hire a big class of recent graduates even as it slashes spending on real estate and other activities.\"What we're looking at is really how to reimagine what the workplace will look like,\" Porat said.Total costs and expenses rose about 7% from a year ago to $31.9 billion in the second quarter, compared with a 12% jump a quarter ago.Capital expenditures fell 12% to $5.4 billion, compared with a 3% drop last quarter.Alphabet's profit was nearly $7 billion, or $10.13 per share, above analysts' average estimate of $5.6 billion, or $8.29 per share, for the quarter.About 66% of its revenue came from Google search and YouTube ads, 12% from ads sold on partner properties online, 8% from its cloud business, and 14% from its mobile app store and about a dozen other smaller businesses.But the company faces challenges across all those fronts. New data privacy laws, including one that went into effect this month in Google's home state of California, are depressing ad prices.Antitrust regulators across the Americas, Europe and Asia are weighing whether Google has stifled competition on its way to dominating search, mobile software and other businesses, with some bodies even considering forcing it divest parts of its operations.About 2,000 employees last month petitioned Google's emerging cloud business to scuttle deals with some police agencies, citing racial discrimination concerns. And whether a massive hiring spree will win other cloud clients is uncertain. Cloud sales in the second quarter of about $3 billion were in line with analysts' estimates.(Reporting by Paresh Dave in Oakland, Calif. and Munsif Vengattil in Bengaluru; Editing by Shailesh Kuber and Richard Chang)"}]}