{"article": [{"url": "https://finance.yahoo.com/news/u-postal-chaos-prompts-democrats-110000018.html", "published": 1597817300.0, "headline": "U.S. postal chaos prompts Democrats to reassess mail-ballot plan", "body": "By Jarrett Renshaw and Andy SullivanAug 19 (Reuters) - Turmoil at the U.S. Postal Service (USPS) is causing some Democrats and local election officials to rethink their vote-by-mail strategies for November's presidential election, shifting emphasis to drop boxes and early voting that bypass the post office.The 2020 contest promises to be the nation’s largest test of voting by mail. But U.S. President Donald Trump’s relentless, unsubstantiated attacks on mail balloting, along with cost-cutting that has delayed mail service nationwide, have sown worry and confusion among many voters.Democratic officials who just weeks ago were touting their dominance in mail balloting during a recent rash of primaries are now cautioning supporters of presidential challenger Joe Biden to be wary. Operatives in battleground states, including Pennsylvania, are particularly concerned about ballots arriving too late to count for the Nov. 3 election.“We are considering telling voters that if they haven’t mailed out their complete ballot by Oct. 15, don’t bother. Instead, vote in person or drop off the ballot\" at an elections office, said Joe Foster, the chairman of the Democratic Party in Montgomery County, the most populous of Philadelphia’s suburban counties. \"We want to make sure every vote counts.\"Other local Democratic leaders, from states like Florida and North Carolina, told Reuters they also are weighing urging voters to submit mail ballots weeks ahead of the election or else vote in person.On Tuesday, Postmaster General Louis DeJoy announced he was suspending cost-cutting measures he had put in place in recent weeks that had led to widespread service disruptions. Those changes included limits on employee overtime, orders for trucks to depart on schedule even if there was mail still to be loaded, and the removal of some mail sorting machines.\"The Postal Service is ready today to handle whatever volume of election mail it receives this fall,\" DeJoy said in a statement. He also promised to deploy \"standby resources\" beginning Oct. 1 to satisfy any unforeseen demand.Story continuesBut some Democrats said the damage is already done. Many don't trust DeJoy - who was a major Trump campaign donor before becoming postal chief - to restore service at the independent government agency amid a presidential race that polls say Biden is leading.\"Return the mailboxes you removed,\" Rep. David Cicilline of Rhode Island said on Twitter. \"Return the sorting machines you took out. Restore the regular hours of post offices you cut short. Return postal vehicles you took. The list goes on.\"A USPS spokesman declined to comment. DeJoy is expected to provide more detail on his plans in testimony before the Senate on Friday and the House of Representatives on Monday.White House Chief of Staff Mark Meadows said Tuesday that Trump never told the Postal Service to change its operations.Democrats asked for $25 billion to shore up the balance sheet of the USPS in a massive virus aid package that passed the House of Representatives in May. Republicans have balked at that figure, and Trump last week said he opposed that funding because it might be used to encourage mail voting. But administration officials in recent days have said they are open to additional funding as public outrage over the USPS drama has grown.Local Democratic officials, operatives and campaign workers said they are not waiting for a Washington solution.In the competitive state of Michigan, Democratic voter outreach volunteer Karen McJimpson, 64, is phoning voters to encourage them to hand-deliver their absentee ballots directly to specified drop boxes or elections offices in light of concerns about mail delivery. She said Tuesday's news about restored service gave her no comfort.“I don’t trust it,\" said McJimpson, who volunteers with a nonprofit called Michigan United. \"There has been too much noise around this, and someone is clearly pulling the strings. We are going to proceed as planned: drop the ballots off.”Upheaval at the USPS has reshuffled some Democrats' plans for other types of election mail as well.Brad Crone, a Democratic strategist in North Carolina, plans to send up to two million mailers between now and Election Day supporting various state and congressional candidates. The campaign flyers are mailed directly from his printer, who last week sent him a notice: If Crone wants to mail anything beyond Oct. 19, he must sign a waiver acknowledging that it might not get there before Election Day.Crone said he will now stop his mailings by Oct. 4, three weeks earlier than he had originally planned.“It’s alarming,\" Crone said. \"Americans are witnessing major system breakdowns, whether it’s the postal system, COVID testing or their local schools. The average voter is seeing this and is just floored.\"DROP BOX BATTLEMail voting has grown steadily since the turn of the century. In the 2016 presidential election, mail ballots accounted for 23.6% of all ballots cast, up from 19.2% in 2008, according to the U.S. Election Assistance Commission.Interest has exploded this year as voters have sought to avoid crowded polling places due to the coronavirus pandemic. Mail ballots accounted for 80% of all votes cast in 16 state primaries this year, including Wisconsin, Nevada and Pennsylvania, according to an estimate by Charles Stewart III, a professor at the Massachusetts Institute of Technology. Some states, such as New York, have struggled to handle the crush.The surge has sparked a slew of litigation. Republicans in Texas, for example, fended off a recent Democratic effort to make it easier for its citizens to vote by mail in the pandemic. The vast majority of Texans will be required to vote in person in November.Democrats have prevailed elsewhere. In South Carolina, officials have agreed to provide prepaid postage for absentee ballots, easing a barrier for those who otherwise would have to provide their own stamps. In Minnesota, the state agreed to suspend a requirement that absentee voters get a witness to sign their ballots and to count ballots that are postmarked by Election Day.The Democratic Party currently has ongoing litigation on mail voting in 14 states, according to Marc Elias, the lawyer overseeing the effort.Trump has spent the last few weeks making unsupported allegations that mail voting is vulnerable to tampering and would result in Democrats stealing the election. He has sought to distinguish between states that provide mail ballots only to voters who request them - including Florida, where Trump himself votes absentee - and those that are moving to conduct their elections entirely by mail, which he claims could lead to widespread cheating.Election experts say mail voting is as secure as any other method.Trump's attacks have forced state and local Republicans to engage in some damage control. Many of their most reliable supporters, particularly elderly voters, have long used mail balloting. Some Republicans fear the president's broadsides will depress turnout.A Wall Street Journal/NBC poll released on Monday found that nearly half of Biden supporters plan to vote by mail in November, while just 11% of Trump supporters plan to do so.The latest front in the voting battle is the dedicated election drop box, a sealed, sturdily built receptacle that has been a popular option for voters who prefer mail ballots but don't want to return them via the USPS. Election officials collect those ballots and take them to polling locations for counting.Election officials in South Carolina, Florida, Virginia, Pennsylvania and elsewhere are seeking to expand drop-off locations or ease requirements such as those mandating that voters show identification to use them.Those changes have met resistance from Republicans over concerns about fraud. On Monday, Trump turned his fire on drop boxes.“Some states use ‘drop boxes’ for the collection of Universal Mail-In Ballots. So who is going to ‘collect’ the Ballots, and what might be done to them prior to tabulation?” he wrote on Twitter. “A Rigged Election? So bad for our Country.”Rob Daniel, chairman of the Charleston County Democratic Party in South Carolina, said there is just one election drop box in the county of roughly 400,0000 people. He said some voters must drive 45 minutes to reach it because of the county's odd shape.Daniel said the county board of elections is seeking permission from the state to add more boxes, but that is no certainty. As a backup, the party is urging voters to request their mail ballots early and return them via the USPS as soon as possible.\"Even Trump can’t screw up the Postal Service so much that it can’t deliver mail across town in 30 days,” Daniel said.Still, Democrats see a bigger worry: Trump has already raised the possibility that he might not accept the results of an election whose outcome could take days to decide because of the quantity of mail ballots that will need to be counted.\"That is absolutely our biggest threat,\" Michigan’s Lieutenant Governor Garlin Gilchrist said.(Reporting By Jarrett Renshaw in Pennsylvania and Andy Sullivan in Washington; Additional reporting by Michael Martina in Detroit and David Shepardson in Washington; Editing by Marla Dickerson)"}]}