{"article": [{"url": "https://finance.yahoo.com/news/investors-in-the-stock-market-are-facing-a-summer-of-crap-170419323.html", "published": 1592395940.0, "headline": "Investors in the stock market are facing a summer of C.R.A.P.", "body": "A summer of steaming hot stinky markets — created by a concoction of heightened volatility fueled by fears of a second wave of COVID-19 and election season jitters — looks all but inevitable says one market veteran.“The trading desks right now are talking about corona recovery, alienation and protest, — C.R.A.P., that’s what traders say,” explained Sanders Morris Harris CEO George Ball on Yahoo Finance’s The First Trade. To Ball — who has decades of experience in the markets — a C.R.A.P. stock market is one prone to a noticeable correction this summer.Read more: Here's what to consider before getting into day tradingBall is most concerned about the looming fiscal cliff that are Paycheck Protection Program (PPP) loans.The government passed the Coronavirus Aid, Relief, and Economic Security (CARES) Act to cushion the blow from the COVID-19 pandemic in late March. As part of the scheme, $350 billion was dedicated to forgivable loans for businesses to prevent layoffs and business closures. Companies with 500 or fewer employees were able to receive up to eight weeks of financial assistance.But with that cash flow largely being eaten up by businesses large and small still dealing with a bruising recession, investing experts like Ball think a fresh round of layoffs is looming.That could have negative ramifications for a stock market still riding high on the better than expected May employment report and the specter of more improvement in June, July and August.WASHINGTON, DC - APRIL 24: U.S. President Donald Trump participates in a signing ceremony for H.R.266, the Paycheck Protection Program and Health Care Enhancement Act, with members of his administration and Republican lawmakers in the Oval Office of the White House in Washington DC on April 24th, 2020. The bill includes an additional $321 billion for the Paycheck Protection Programs forgivable loans to cover payroll and other costs for small businesses. Hospitals and other health care providers will receive $75 billion and another $25 billion is allocated for COVID-19 testing. (Photo by Anna Moneymaker/The New York Times/POOL/Getty Images)“I think the next big market mover is going to be the realization that the PPP program actually had an enormous impact. It worked. It kept the patient alive. But the half-life of the forgivable loans to small businesses comes up pretty soon, comes up mid-July to August. That may well mean there will a round of layoffs of people who were kept on the job or not furloughed because of the PPP program who are laid off when it comes to an end. So I think the next signals have to be a worrisome one rather than a positive one,” Ball added.Story continuesThe wildcard to Ball’s summer correction thesis is whether Congress passes a $1 trillion infrastructure plan as recently floated by the Trump administration. Or, pass a new stimulus plan along the lines of a $3 trillion scheme proposed recently by Democrats.Until that gets decided one way or another, C.R.A.P. may be the newest most applicable investing acronym around.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Coca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}