{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-13-2020-221336773.html", "published": 1597331540.0, "headline": "Stock market news live updates: Nasdaq rises as tech shares gain; S&P 500 drifts after touching record", "body": "The S&P 500 and Dow dipped Thursday, after a rally Wednesday briefly sent the S&P 500 to record levels. The Nasdaq gained as tech shares renewed their run of outperformance.[Click here to read what’s moving markets heading into Friday, Aug. 14]Investors also digested a jobless claims report that came in much better than expected, with new weekly unemployment insurance claims falling below 1 million for the first time during the pandemic period. New jobless claims totaled 963,000 for the week ended Aug. 8, ending what had been a 20-week streak that initial claims topped 1 million.During the regular session on Wednesday, the S&P 500 briefly topped its record closing level of 3,386.15 from Feb. 19 before ending just slightly below that level. On Thursday, the consumer discretionary, and tech-heavy communication services and information technology sectors rose in the blue-chip index, but were outweighed by declines in utilities, financials and energy stocks.In the 30-stock Dow, shares of Cisco (CSCO) underperformed and fell 11% in intraday trading, after the tech company guided toward a fourth straight year-over-year slump in quarterly revenue and highlighted ongoing weakness in its small- and mid-sized business customer base.After market close Wednesday, Lyft (LYFT) reported a narrower than expected second-quarter loss, and its 61% decline in second-quarter revenue was a shallower drop than feared, as the pandemic wiped out demand for ride-hailing. The company said ridership was up 78% in July compared with April’s lows, and the company maintained its outlook to hit adjusted EBITDA profitability by the end of next year.Investors also continued to hold onto hopes that lawmakers would eventually reconcile their disparate demands and pass another coronavirus relief package.However, prospects of a near-term deal appeared slim as of Wednesday as policymakers continued to verbally spar rather than return to the negotiating table. Treasury Secretary Steven Mnuchin suggested in an interview with Fox Business that the White House would not budge on its stance of moving ahead with Senate Republicans’ $1 trillion proposal, despite Democratic lawmakers’ calls for at least twice as much in aid. Senate Democratic Leader Chuck Schumer and House Speaker Nancy Pelosi said in a joint statement in response to Mnuchin’s remarks that they had “made clear” that they were “willing to come down $1 trillion if they will come up $1 trillion.”Story continues—4:03 p.m. ET: Stocks end mixed, Nasdaq gains as Apple closes at a recordHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -6.95 (-0.21%) to 3,373.40Dow (^DJI): -79.98 (-0.29%) to 27,896.86Nasdaq (^IXIC): +30.26 (+0.27%) to 11,042.50Crude (CL=F): -$0.30 (-0.70%) to $42.37 a barrelGold (GC=F): +$14.40 (+0.74%) to $1,963.40 per ounce10-year Treasury (^TNX): +4.6 bps to yield 0.7160%—2:35 p.m. ET: Market conditions this year are ‘far from a bubble’: AnalystTechnology stocks’ run-up so far this year has been amplified by the fact that cyclical stocks have underperformed so sharply, even in the period preceding the pandemic, Ari Wald, senior analyst at Oppenheimer, told Yahoo Finance on Thursday. He argued that some market participants’ declarations that tech stocks are currently in a bubble is a misleadingly simplistic characterization.“One point that we’re making is that market conditions overall [are] far from a bubble,” Wald said. “But we are seeing a bubble emerging in sector dispersion, measured by the spread between the best and worst performing S&P sector. You’re seeing that gap widen to the point we haven’t seen really since the TMT bubble.”“Right now as it stands over a two-year period, tech’s up about 50%, energy’s down about 50%. But if you were to kind of dig into those sectors, it’s not tech. The rate of change of the tech sector [has been] really consistent with history – it’s far from extreme, nowhere close to what we’d seen in the late ‘90s,” he said.“The extreme that we’re seeing is happening in the weakness in value. This bubble and dispersion is being inflated by this weakness in value, and that really represents this difficult two-year period we’ve been in in the equity market really since 2018, when most global equities peaked,” he added.” Small caps peaked, value peaked. It’s been a tough two-year period. We think the contrarian case is for long-term upside in the market if those beaten up value areas start to participate and act better. We think it’s just a matter of time, but indeed more is needed for those groups.—2:06 p.m. ET: Cisco shares slide 11% intraday after company offers weak guidance, suggesting weak business spending plans among customersTech company and Dow component Cisco lagged in the Dow on Thursday after reporting a third straight quarter of revenue declines on a year over year basis and guiding toward a fourth, with customer demand for Cisco’s software, cloud and networking businesses especially weak among small- and mid-sized businesses.Cisco said it sees current-quarter revenue down between 9% to 11%, or steeper than the drop of 7.2% expected, based on Bloomberg-compiled estimates. Fiscal first-quarter adjusted earnings will likely be between 69 cents and 71 cents a share, Cisco said, also missing the 76 cents per share consensus.Cisco also said it planned to cut costs by $1 billion on an annualized basis over the next few quarters. And during the company’s earnings call Thursday, executives announced the Chief Financial Officer Kelly Kramer would resign to retire, but will stay on until the company finds a successor.—12:16 p.m. ET: ‘It’s very difficult to say which direction things will move as a result of the election, and what magnitude they will move’: AnalystInvestors should be wary of adjusting their portfolios exclusively based on their predictions for the results of the 2020 Presidential Election, since the ultimate market response to the event remains obscure given the bevy of broader macro developments so far this year, according to at least one analyst.“If you look at betting markets right now as an example, prediction markets have Joe Biden and Kamala Harris as roughly a 55-60% chance of winning in November. And as those odds change over time, and as we get closer to the election or as events evolve, new polls come out, things like that, the market will continue to reevaluate those potential odds and will readjust based on that future forecast,” Kevin Grogan, managing director of investment strategy for Buckingham Strategic Wealth, told Yahoo Finance’s The First Trade on Thursday.“But one thing I would caution investors on, what I’ve told our clients as they ask about the upcoming election, is that you could be right that, let’s say a Biden/Harris election would be bad for the markets. You could be potentially right about them winning, about them being bad for the markets, but the market could still go up for other reasons,” Grogan added. “We know that over time, stocks have positive returns well in excess of cash, so things can happen in the market and in the world that supersede you being right about the election and right about the potential impacts of the election. You could still wind up being wrong if you decide to make changes in your portfolio as a result of an upcoming election.”Grogan also cited the unexpected move higher in the markets the day immediately following Election Day 2016. That day, on Nov. 9, 2016, the S&P 500 closed higher by 1.1%, despite the fact that a host of analysts ahead of the event had suggested a Trump victory in that election would cause upheaval in markets.“It’s very difficult to say which direction things will move as a result of the election and what magnitude they will move,” Grogan said.—10:44 a.m. ET: American Airlines prepares to scrap service to some smaller cities as travel demand holds low: ReportAmerican Airlines (AAL) is reportedly planning to end flights to and from some two dozen small- and medium-sized cities following the expiration of federal coronavirus aid to airlines, CNBC reported, citing unnamed people with the matter.The new cancellations could begin to appear on schedules as early as next week, CNBC reported. Airlines still must maintain a minimum level of service and not conduct layoffs through the end of September as part of the terms of a multi-billion federal aid package.—9:35 a.m. ET: Stocks open mixed, Nasdaq outperformsHere were the main moves in markets, as of 9:35 a.m. ET:S&P 500 (^GSPC): -7.68 points (-0.23%) to 3,372.67Dow (^DJI): -84.49 points (-0.3%) to 27,892.35Nasdaq (^IXIC): +32.44 points (+0.29%) to 11,044.21Crude (CL=F): -$0.14 (-0.33%) to $42.53 a barrelGold (GC=F): -$2.20 (-0.11%) to $1,946.80 per ounce10-year Treasury (^TNX): +0.1 bps to yield 0.687%——8:30 a.m. ET: New weekly jobless claims dip below 1 million for the first time since MarchWeekly unemployment insurance claims fell below the 1 million mark for the first time since the start of the pandemic, in a sign of a better than feared improvement in the labor market as of late.New jobless claims were at 963,000 for the week ended Aug. 8, or better than the 1.1 million expected. Thursday’s report ended what had been a previous 20-week streak that new claims totaled more than 1 million, with tens of millions of Americans put out of work during the coronavirus pandemic and forced business closures that ensued.Continuing claims, which are reported on a one-week lag, also fell to a pandemic-era low of 15.486 million, dipping below 16 million for the first time during the pandemic period. This metric, which captures the number of individuals still receiving unemployment insurance benefits, has improved in seven of the last eight weeks’ worth of reports.——7:18 a.m. ET Thursday: Stock futures struggle for directionHere were the main moves in markets, as of 7:18 a.m. ET:S&P 500 futures (ES=F): 3,367.5, down 2.5 points, or 0.07%Dow futures (YM=F): 27,857.00, down 9 points, or 0.03%Nasdaq futures (NQ=F): 11,130.00, up 4 points, or 0.04%Crude (CL=F): -$0.03 (-0.07%) to $42.64 a barrelGold (GC=F): -$0.40 (-0.02%) to $1,948.60 per ounce10-year Treasury (^TNX): -1.1 bps to yield 0.675%—6:03 p.m. ET Wednesday: Stock futures hug the flat lineHere were the main moves in equity markets, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,369.5, down 0.5 points, or 0.01%Dow futures (YM=F): 27,868.00, up 2 points, or 0.01%Nasdaq futures (NQ=F): 11,123.5, down 2.5 points, or 0.02%A trader walks in front of the New York Stock Exchange (NYSE) on May 26, 2020 at Wall Street in New York City. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}