{"article": [{"url": "https://finance.yahoo.com/news/intel-forecasts-third-quarter-revenue-200913564.html", "published": 1595517440.0, "headline": "Intel chip delay forces shift to using more outside factories, shares drop", "body": "By Stephen Nellis and Munsif Vengattil(Reuters) - Intel Corp <INTC.O> said on Thursday its new 7-nanometer chip technology was six months behind schedule and it would consider farming out more work to outside semiconductor foundries, eroding a founding principle that manufacturing is key to its success.Intel shares fell 9%.The setbacks will have little effect in the next few quarters, but will cause a years-long domino effect, delaying chips meant to counter the rise of rivals Advanced Micro Devices Inc <AMD.O> and Nvidia Corp <NVDA.O> until late 2021 or even 2023.Intel's 7nm delays extend the lead in the smaller, faster chip technology held by Taiwan Semiconductor Manufacturing Co Ltd <2330.TW>, which is now expected to remain at least one generation of technology ahead for years to come. They will likely benefit rivals AMD and Nvidia, which outsource their manufacturing to TSMC.\"We're going to be pretty pragmatic about if and when we should be making stuff inside or making outside, and making sure that we have optionality to build internally, mix and match inside and outside, or go outside in its entirety if we need to,\" Chief Executive Bob Swan said on a call with investors.Shares of AMD rose 6%.Intel is the top supplier for processors for PCs and data centers, but Nvidia and TSMC are challenging the logic of Intel's business model as a both a designer and manufacturer of its own chips.Swan told investors that Intel's \"Ponte Vecchio,\" a data center graphics chip meant to compete with Nvidia, will not be released until late 2021 or early 2022 and could use outside chip factories. He said Intel's first 7nm chip, meant for personal computers, will not arrive until late 2022 or early 2023. Its first 7nm data center processor will not ship until the first half of 2023.In recent years, Intel has relied on booming growth in data centers that power cloud computing as PC sales declined, though both segments have expanded as the pandemic forced increased technology spending to facilitate working from home.Story continuesThe company estimated third-quarter revenue of about $18.2 billion on adjusted earnings of $1.10 per share, compared with analysts' average forecast of $17.9 billion and $1.14 per share, according to IBES data from Refinitiv.It updated its full-year 2020 revenue guidance to $75 billion versus analysts' consensus estimate of $73.86 billion, according to Refinitiv data.For the second quarter ended in June, Intel said overall revenue and adjusted profits were $19.73 billion and $1.23 per share, compared with analysts' estimates of $18.55 billion and $1.11 per share, according to Refinitiv.Revenue for its data center segment was $7.1 billion compared to estimates of $6.61 billion, according to data from FactSet. Sales for PC chips were $9.5 billion, compared to analyst estimates of $9.10 billion, according to FactSet data.Nvidia, which designs but does not make its own chips, earlier this month overtook Intel as the most valuable U.S. chip supplier, thanks to strong sales to data centers using Nvidia chips for artificial intelligence work.In the PC market, longtime Intel rival Advanced Micro Devices <AMD.O> this week announced new PC chips that analysts expect to be powered by TSMC's manufacturing processes. Last month, Apple Inc <AAPL.O> said it would end its reliance on Intel chips for Mac computers after nearly 15 years. Apple uses chip technology from SoftBank Group Corp-owed <9984.T> Arm Ltd.\"The delay of its 7nm roadmap timing will create even more headwinds for Intel as its risk increased probability of further share loss to AMD and to other architecture like Arm in both its client and data center markets in the next two to three years,\" said Kinngai Chan, an analyst at Summit Insights Group.(Reporting by Stephen Nellis in San Francisco and Munsif Vengattil in Bengaluru; Editing by Anil D'Silva and Richard Chang)"}]}