{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-world-nears-1-m-deaths-inovio-delays-latestage-trial-as-vaccine-race-quickens-173116124.html", "published": 1601323640.0, "headline": "Coronavirus update: World tops 1M deaths; Inovio delays late-stage trial as vaccine race quickens", "body": "The coronavirus pandemic topped a grim new milestone of 1 million deaths late Monday, as new diagnoses in the around the world continue to outpace a slowdown in the rate of fatalities.America remains the world’s epicenter of coronavirus casualties, according to a widely followed global tracker maintained by John’s Hopkins, with over 7 million confirmed cases and 200,000 deaths. However, India is close behind with over 6 million, and Brazil is currently Latin America’s largest hotspot with over 4.7 million cases.A second wave of COVID-19 is swamping parts of Europe, as the world’s largest economy faces a new infection surge even before effectively extinguishing the first. As a result, health experts say the big focus of hospitals has shifted to ensuring all patents have sufficient seasonal flu vaccines.Where the coronavirus is surging and falling in regions around the globe.Experts have warned the double whammy of an ongoing pandemic and the flu— both of which attack the upper respiratory system— will undoubtedly overwhelm hospitals in the coming months.“The flu season is upon us, and unfortunately the flu and coronavirus kind of mimics each other,” Dr. Sampson Davis, a New Jersey emergency doctor and author, told Yahoo Finance Monday. He added that his health system is focused on ensuring that as many people as possible are vaccinated ahead of flu season.Davis also noted that while hospitals have been able to adopt medical protocols that help reduce the need for ventilators, the “golden key” to ending ongoing fears about the virus is an effective coronavirus vaccine.While the U.S. now has four vaccines in Phase 3 trials, with Johnson & Johnson (JNJ) being the latest on board, there are still some hiccups along the way.The latest is Inovio (INO) which has had to delay its late-stage trial, the company announced Monday, amid new questions from the U.S. Food and Drug Administration. Those will need to be answered before the application to begin the late-stage trial is approved, Inovio stated.Story continues“Until the FDA's questions have been satisfactorily addressed, INOVIO's [vaccine candidate] is on partial clinical hold. The company is actively working to address the FDA's questions and plans to respond in October, after which the FDA will have up to 30 days to notify INOVIO of its decision as to whether the trial may proceed,” it added.Inovio’s shared tumbled on the news, marking yet another setback for the biotech. Earlier this year, the company was entangled in a securities lawsuit, and has been sued by a manufacturing partner.Where the outbreak is surging and falling in the U.S., by region.U.S. government responseMeanwhile, the U.S. government’s response to the virus continues to plod along, weighed down by political tension.The White House’s coronavirus advisor, Scott Atlas, faces growing criticism from the scientific community — with the latest coming from a top health official. U.S. Centers for Disease Control and Prevention (CDC) Director Dr. Robert Redfield confirmed an NBC News report that he believes everything Atlas says “is false.”Atlas has already been publicly criticized by his peers at Stanford University, some of whom have called for his removal, for spreading inaccurate information and supporting President Donald Trump’s views on not wearing a mask. He has also claimed that the media is sharing half-truths and scaring the public.The news comes at a time when the White House coronavirus task force has been all but disbanded. Last week, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious DIseases, said the task force does not meet as regularly as it once did, and the focus has pivoted away from strategies to curb the outbreak.The political tensions are playing out against an ever-growing case count in the country. Major early hotspots like New York and New Jersey have managed their case and positivity rates, but new surges have occurred as lockdowns are relaxed.The country is now reporting upward trends of cases in at least 21 states, as of Monday. New York, which had low positivity rates, is also seeing an upward trend — just as the governor was set to reopen businesses more broadly, including indoor dining, with occupancy limitations.Meanwhile, New York City is seeing concerning rises in Brooklyn and Queens, according to health commissioner Dave Chokshi. On Sunday, Chokshi said officials “are starting to see an uptick in the number of hospitalized patients in two hospitals in Brooklyn and at least one in Queens.”New York native Fauci told Good Morning America that the U.S. is “not in a good place,” add that “there are states that are starting to show uptick in cases and even some increases in hospitalizations in some states. And, I hope not but, we very well might start seeing increases in deaths.\"More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}