{"article": [{"url": "https://finance.yahoo.com/news/pmi-european-stocks-markets-wall-street-coronavirus-074336184.html", "published": 1600829480.0, "headline": "European stocks higher as factory output hits two-year high", "body": "Cranes in Berlin as new PMI data highlights the state of Europe's biggest economy. Photo: Tobias Schwarz/ReutersEuropean stocks continued to recover from Monday’s sharp sell-off on Wednesday, with tech gains on Wall Street and strong eurozone manufacturing data lifting markets.After a rout earlier in the week, Britain’s FTSE 100 (^FTSE) climbed 2.1%, France’s CAC 40 (^FCHI) rose 1.9%, and the DAX (^GDAXI) rose 1.7% in Germany.It came after gains for tech lifted stocks on Wall Street on Tuesday, with the tech-heavy Nasdaq (^IXIC) leading the charge and the S&P 500 (^GSPC) rising for the first time in five sessions. Amazon (AMZN) jumped 5.7% and led other tech giants higher after analyst Bernstein upgraded the stock to “outperform,” while better-than-expected Nike results lifted German rival Adidas 6.5% (ADS.DE).Watch: Tighter COVID-19 restrictions to hit firms in EnglandClosely watched purchasing managers’ index (PMI) data in Europe also boosted markets. Activity dropped for most services sector firms in September, but manufacturing activity was at its strongest in more than two years.The survey data by market research firm IHS Markit found the recovery in the eurozone “stalled,” but the manufacturing rebound was enough to boost investors’ moods. The headline figure for services came in at 47.6, down from 50.5 in August, but the manufacturing figure rose from 51.7 to 53.7. Figures below 50 suggest most firms have seen activity decline, and figures above 50 suggest growth.READ MORE: Eurozone business activity stagnates as recovery falters“A two-speed economy is evident, with factories reporting that production growth was buoyed by rising demand, notably from export markets and the reopening of retail in many countries, but the larger service sector has sunk back into decline as face-to-face consumer businesses in particular have been hit by intensifying virus concerns,” said Chris Williamson, chief business economist at IHS Markit.Watch: What is a V-shaped economic recovery?US futures were also pointing to a continued rebound on Wednesday. S&P 500 futures (ES=F) were up 0.5%, Dow Jones Industrial Average futures (YM=F) were 0.8% higher, and Nasdaq futures (NQ=F) were up 0.4% at around 5am eastern time in the US (10am in the UK).Stocks had been mixed overnight in Asia. Japan’s Nikkei (^N225) and Hong Kong’s Hang Seng (^HSI) both lost 0.1%, while China’s Shanghai Composite (000001.SS) rose 0.2%. The KOSPI (^KOSPI) in South Korea was flat."}]}