{"article": [{"url": "https://finance.yahoo.com/news/federal-reserve-chief-jerome-powell-millions-of-people-wont-return-to-work-because-of-covid-19-pandemic-200434497.html", "published": 1591801940.0, "headline": "Federal Reserve chief: Millions of people won't return to work because of COVID-19 pandemic", "body": "Enter Federal Reserve Chair Jerome Powell to toss some cold water on those giddy Wall Street bulls continuing to cheer the surprisingly upbeat May jobs report that sparked hopes for a V-shaped economic recovery after the worst of the COVID-19 pandemic.Powell — speaking to reporters following the Fed’s latest decision on rates — said “millions” of people will not return to work for some time because of the aftershocks to businesses from the health scare. The Fed chief suggested the lack of jobs would be rooted in the reality that companies were unable to survive the pandemic or the role no longer exists in the new world order.By extension, that would suggest a certain kind of structural unemployment that may continue to weigh on U.S. growth unless workers get re-trained for new jobs.Federal Reserve Chair Jerome Powell pauses during a news conference, Tuesday, March 3, 2020, while discussing an announcement from the Federal Open Market Committee, in Washington. In a surprise move, the Federal Reserve cut its benchmark interest rate by a sizable half-percentage point in an effort to support the economy in the face of the spreading coronavirus. Chairman Jerome Powell noted that the coronavirus \"poses evolving risks to economic activity.\" (AP Photo/Jacquelyn Martin)The Fed’s concern around longer term unemployment was captured in its updated summary of economic projections released today.Officials expect the U.S. unemployment rate to hit 9.3% this year, dipping to 6.5% in 2021 and falling further to 5.5% in 2022. The unemployment rate in May dropped to 13.3% from 14.7% in April.Just before the pandemic took hold this past spring, the U.S. unemployment rate was hovering near 50-year lows around 3.6%.The Fed’s muted employment outlook underscores its latest take on policy.Powell & Co. reiterated the Fed funds rate would stay in the 0% to 0.25% range for the foreseeable future and stressed continued bond-buying to support market functioning. During the press conference, Powell clung to the view aggressive accommodation is needed to help pull the economy out of the COVID-19 induced downturn.“The Fed is not even thinking about raising rates, we will do whatever we can and as long as it takes,” Powell said.The policy guidance renews the Fed’s commitment to a lengthy period of accommodation, wrote macro strategists at Wells Fargo Securities.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Story continuesCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}