{"article": [{"url": "https://finance.yahoo.com/news/why-trump-wants-to-shackle-the-postal-service-185554477.html", "published": 1597759400.0, "headline": "Why Trump wants to shackle the postal service", "body": "President Trump spouts some wacky ideas that are easy to dismiss, such as his bogus claim that mail voting leads to widespread fraud. But some of his thinking is spot-on, even if it’s diabolical.Trump has one solid reason for wanting to curtail mail voting: Democrats are far more likely to vote by mail than Republicans. “That’s why you’re seeing the president trying to put a roadblock in front of the mail,” Lee Miringoff, polling director at Marist College, says in the latest episode of the Yahoo Finance Electionomics podcast. “If you’re a strategist, it’s huge.”In the latest Marist poll, 62% of Biden backers said they plan to vote by mail, while 36% plan to vote in person. Among Trump backers, just 24% plan to vote by mail, while 72% plan to show up at a polling place on Election Day. That’s a giant gap that, in theory, would hurt Democrats if the US Postal Service was unable to deliver some ballots. If 10% of mailed-in ballots got lost or arrived too late to be counted, for instance, it would eliminate 6.2% of the Democratic vote but just 2.4% of the Republican vote. That could easily be decisive in swing states where turnout is crucial and the winning margin could be just a percentage point or two.[Check out other episodes of the Electionomics podcast.]The prospect of a surge in mail-in voting, amid the coronavirus pandemic, has led to an unlikely uproar at the USPS, where the new postmaster general, appointed by Trump, has started making changes that could interfere with voting in the fall. The postmaster, Louis DeJoy, now says he’ll postpone any changes until after the election. But Democrats remain outraged and will attempt to pass legislation in Congress to prevent any action at the postal service that could delay or invalidate mail-in ballots.A customer wears a face mask and gloves as she drops mail into a curbside mail collection box in Los Angeles Monday, Aug. 17, 2020. (AP Photo/Damian Dovarganes)Republicans vs. Democrats and in-person votingRepublicans might be more reluctant to vote by mail because they believe Trump’s unsubstantiated claims about the higher likelihood of fraud. But demographic factors probably explain most of the difference between Rs and Ds. Republicans tend to be older, and perhaps more inclined to vote in person simply out of habit. Young voters are more likely to be Democrats, with many away at college on Election Day. The Democratic Party has also pushed its members to vote by mail more aggressively than the GOP.Story continuesClick here for Yahoo Finance's full coverage of the 2020 electionTrump has said openly that he fears a surge in mail voting because he thinks it would hurt Republican electoral odds. In March, Trump said if voting were easier, thanks to mail ballots and other steps, “if you’d ever agreed to it, you’d never have a Republican elected in this country again.” That’s debatable: Utah relies heavily on mail-in voting, and it’s a reliable red state.Recent actions at the postal service appear to be part of a Trumpian effort to curtail mail-in voting. DeJoy, the new postmaster, is a millionaire Trump donor appointed to the job in June. This summer, he slashed overtime pay for postal workers, which has slowed the processing of mail and caused delivery delays. DeJoy has also ordered the removal of automating sorting machines and some blue USPS drop boxes.DeJoy says these moves are necessary to get costs under control at an organization that perennially loses money. But the timing—and Trump’s own words—suggest Trump is pushing the moves to help his reelection odds. In an Aug. 13 interview with Fox Business, Trump explained that he opposes new funding for the post office because it could help more people vote. “They need that money in order to make the post office work, so it can take all of these millions and millions of ballots,” Trump said. “But if they don’t get [the funding], that means you can’t have universal mail-in voting.”The United States Postal Service (USPS) truck drives outside a post office on August 17, 2020 in Jersey City, New Jersey. (Photo by Gary Hershorn/Getty Images)Under intense public pressure, DeJoy said on Aug. 18 he’ll suspend all operational changes at the USPS until after the November election. But House Democrats still plan to rush a standalone bill providing more aid for the post office and preventing the service from suppressing voting in the fall. It’s not clear if Republicans who control the Senate will go along with that. But public opinion is with the Democrats. A recent Yahoo News/YouGov poll found that 61% of Americans disapprove of Trump’s changes at the postal service, while just 28% approve. Trump and DeJoy may have miscalculated how much seniors, rural Americans and other key voting blocs rely on the postal service.Trump could take another approach: He could encourage his own supporters to vote by mail and try to raise the portion of Republicans mailing it in to Democratic levels. Then there’d be no controversy at all. But that is not the Trumpy thing to do.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Trump is martyring the postal serviceTrump’s “housewife” myth11 ways Trump is out of touch with votersA double-dip recession is formingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}