{"article": [{"url": "https://finance.yahoo.com/news/stock-market-history-v-shaped-rally-corporate-profits-morning-brief-101108733.html", "published": 1592457560.0, "headline": "Stock market history says a V-shaped rally makes total sense: Morning Brief", "body": "Thursday, June 18, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeCorporate profits always ‘V’ no matter the recession.The current recession has no parallel.The coronavirus pandemic resulted in mandated closures of thousands of businesses across the country while tens of millions of workers lost jobs overnight. The stock market fell more than 30% in a matter of weeks. Economists called for the worst downturn on record.And while signs of recovery in the labor market, the housing market, and consumer spending are encouraging, nowhere has enthusiasm about the economic future been as widespread as the stock market.Earlier this month, the S&P 500 capped off its biggest 50-day rally in history. And while last Thursday saw stocks slide more than 5% in a single session, as of Wednesday’s close the market had clawed back more than half of those losses.The stock market’s rally coinciding with a still-dire economic picture, leaving many casual and professional observers perplexed by investor enthusiasm in this environment.But history suggests that corporate profits — the ultimate long-run driver of stock prices — tend to form V-shaped recoveries no matter the recession. Which would argue that the market is responding to what history says will be the likely arc of corporate profit growth over the coming quarters.Writing in a note to clients on Wednesday, Nicholas Colas, co-founder of DataTrek Research, highlighted data showing the corporate profits as a percentage of GDP. And during each recession since World War II, profits have declined to ~5% of GDP and then bounced in a V-shaped recovery that often lasts for a year or more.“We have resisted from participating in the alphabet soup debate of whether the US economic recovery from the COVID Crisis will be a V, W, U, L, or some other letter,” Colas writes. “We’ve even read about “Nike swooshes”, square root signs, and other symbolic representations of what might come to pass.”Story continuesOn Tuesday, Larry Adam, chief investment officer at Raymond James, joined The Final Round and outlined his thesis for a K-shaped recovery. A novel outline for the future of economic growth in an already crowded genre.But in Colas’ view, all these shapes and letters ignore what history says about how the corporate sector recovers from recessions.“Corporate profits almost always make ‘V’ bottoms, and it is market perceptions of those future cash flows that drive stock and bond valuations today,” Colas writes. “Yes, the health of the economy will eventually determine sustainable profitability, and that is certainly important. But history shows the lift in profits after a low is sharp and sustainable for at least 4 quarters and usually much longer.”Colas writes that “it would be reasonable to expect Q2 2020 will look very much like the 5% reading common to every recession since the 1950s,” and highlights the following chart from the Federal Reserve, showing a simple outline of corporate profits as a percent of GDP.We’ve added the arrows to show prior troughs and the corresponding recoveries. Only the recession of the early 1980s and the 1990-91 downturn weren’t followed by sharp, enthusiastic rebounds in corporate profits. The 1973-75 recession is the only downturn since World War II that saw profits as a percent of GDP stay closer to 6%.Corporate profits tend to fall to 5% of GDP during recessions before quick, and often sustained, rebounds. Some analysts believe the same pattern will play out during the current recession and the stock market's rally is anticipating this dynamic. (Source: FRED, DataTrek)And while this current recession and recovery presents several known unknowns — how widely does the virus spread over the next year, how many temporary layoffs become permanent, how much more stimulus is or is not passed by Congress, and so on — it is still likely, in Colas’ view, that Corporate America will break out their standard recession playbook.A playbook that tends to see profits stabilize before the economy. And one that offers investors primarily focused on corporate profit growth something to get excited about.“While the COVID Crisis has been a different sort of economic catalyst than the causes of prior recessions, companies will do what they always do during downturns,” Colas writes.“First, they hunker down. Then, once they think the bottom is in, they adjust their cost structure to current conditions. Finally, once they are more confident in a sustained recovery, they start hiring and investing again.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Philadelphia Fed Business Outlook, June (-25.0 expected, -43.1 in May)8:30 a.m. ET: Initial Jobless Claims, week ending June 13 (1.29 million expected, 1.542 prior)8:30 a.m. ET: Continuing Claims, week ending June 6 (19.85 million expected, 20.93 million prior)9:45 a.m. ET: Bloomberg Consumer Comfort, week ending June 14 (38.7 prior)10 a.m. ET: Leading Index, May (2.4% expected, -4.4% in April)EarningsPre-market8:30 a.m. ET: Kroger (KR) is expected to report earnings of $1.12 per share on $40.12 billion in revenueREAD MORETop NewsGlobal markets slide as US states and Beijing fight new spikes [Yahoo Finance UK]Hertz suspends plan to sell ‘worthless’ stock after SEC scrutiny [Bloomberg]Powell urges Congressional help for unemployed, municipalities as economy recovers from coronavirus [Yahoo Finance]B&G Foods to review Cream of Wheat brand amid debate on racial inequality [Reuters]YAHOO FINANCE HIGHLIGHTSHow Mike Bloomberg can help Joe BidenWhy Microsoft and Amazon are calling on Congress to regulate facial recognition techInvestors in the stock market are facing a summer of C.R.A.P.—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}