{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-24-2020-224347265.html", "published": 1600960460.0, "headline": "Stock market news live updates: Stocks push higher, shaking off earlier declines after weak jobless claims report", "body": "Stocks traded choppily on Thursday, with nervous investors attempting to recuperate from a selloff that’s yanked benchmarks within view of a correction. At the lows of Thursday’s session, the S&P 500 was more than 10% below its recent closing high from Sep. 2.The Labor Department’s weekly jobless claims report showed that another 870,000 workers filed new unemployment claims, slightly above Wall Street’s estimates but below the psychologically key 1 million water mark that’s become critical in the post-coronavirus lockdown jobs market. All told, the data shows how workers are continuing to struggle in an economy that’s healing in fits and starts.“The labor market losses are stunning in that they show there isn't enough work out there yet in the middle of September nine months after the Covid-19 virus shut the economy down,” Chris Rupkey, chief business economist for MUFG Union Bank, said in an email Thursday. “The stock market is falling again over the concerns for the economy as well they should because the high-level of joblessness shows that country isn't out of the woods yet and it won't be if the pleading of Fed officials for more stimulus isn't heard by Federal government officials down in Washington.”Meanwhile, tech stocks have also become a major focus of the market, where heavy selling has dragged the three major indices into a September selloff that most analysts had hoped to avoid. Another day of declines pulled the S&P 500 and Nasdaq to their lowest closing levels since late July.Equity investors are digesting a confluence of concerns, including increased uncertainty around the US presidential elections, signs of a growth slowdown, dimming hopes for fiscal stimulus and worsening trends in Covid-19 cases in the US and Europe, even as drugmakers race to develop an effective Covid-19 vaccine. JPMorgan Chase analysts said Tuesday that a contested US election is now their baseline view, given the expected rise in postal voting and President Donald Trump’s baseless but repeated allegations that the voting method is more conducive to fraud.Story continuesOn stimulus, a number of Federal Reserve officials doubled down on assertions that it remained up to Congress to unleash more fiscal stimulus to encourage a continued economic recovery.These remarks were spearheaded by Fed Chair Jerome Powell, who appeared before Congress for a second day of testimony on Wednesday. He reiterated that more support was likely to be necessary, even as lawmakers remain at an impasse over how much fiscal stimulus should be unleashed and to whom it should be directed.In separate appearances on Wednesday, Cleveland Fed President Loretta Mester and Boston Federal Reserve President Eric Rosengren also echoed Powell’s remarks.—4:04 p.m. ET: Stocks eke out gains, shaking off earlier losses after weak jobless claims reportHere were the main moves in markets as of 4:04 p.m. ET:S&P 500 (^GSPC): +9.67 (+0.30%) to 3,246.59Dow (^DJI): +52.31 (+0.20%) to 26,815.44Nasdaq (^IXIC): +39.28 (+0.37%) to 10,672.27Crude (CL=F): +$0.31 (+0.78%) to $40.24 a barrelGold (GC=F): +$3.40 (+0.18%) to $1,871.80 per ounce10-year Treasury (^TNX): -1 bps to yield 0.6660%—3:04 p.m. ET: Stocks pare gains in last hour of tradingThe three major indices cut gains in their final hour of trading during Thursday’s regular session. The Dow rose just 18 points, or 0.07%, after previously jumping as much as 1.2%, or 331 points.The utilities, consumer staples and information technology sectors led to the upside in the S&P 500, while the health-care and energy sectors lagged. In the Dow, Boeing shares dropped more than 3% and Nike shares fell 1.5% to give back some of its record-setting gains from Wednesday.—12:00 p.m. ET: Three major indices push into positive territory, led by techThe S&P 500, Dow and Nasdaq turned positive heading into afternoon trading in New York, as the recently volatile tech names led to the upside. The information technology and real estate sectors led gains in the S&P 500, with the latter’s advance coming following yet another strong report on the state of the housing market in the US.Here were the main moves in markets, as of 12:00 p.m. ET:S&P 500 (^GSPC): +18.98 points (+0.59%) to 3,255.90Dow (^DJI): +90.99 points (+0.34%) to 26,854.12Nasdaq (^IXIC): +111.83 (+1.05%) to 10,743.4Crude (CL=F): -$0.19 (-0.48%) to $39.74 a barrelGold (GC=F): +$2.90 (+0.16%) to $1,871.30 per ounce10-year Treasury (^TNX): -0.2 bp to yield 0.674%—10:00 a.m. ET: New home sales unexpectedly surge in August, hitting 14-year highUS new-home sales unexpectedly rose for a fourth consecutive month in August, according to the Commerce Department, with the housing market continuing to make outsized gains relative to the rest of the economy as mortgage rates hold near record lows.New single-family home purchases rose 4.8% to a seasonally adjusted annualized rate of 1.011 million in August, with sales in the South leading advances. This marked the greatest level since September 2006, and was much better than the 890,000 pace expected by consensus analysts, according to Bloomberg data.—9:33 a.m. ET: Stocks open lower after disappointing jobless claimsHere were the main moves in markets, as of 9:33 a.m. ET:S&P 500 (^GSPC): -11.92 points (-0.37%) to 3,225.00Dow (^DJI): -100.66 points (-0.38%) to 26,662.47Nasdaq (^IXIC): -71.91 (-0.68%) to 10,558.72Crude (CL=F): -$0.12 (-0.3%) to $39.81 a barrelGold (GC=F): -$9.20 (-0.49%) to $1,859.20 per ounce10-year Treasury (^TNX): -1 bp to yield 0.666%—8:30 a.m. ET: Jobless claims stay below 1 million, but come in worse than expectedThe ranks of the unemployed grew again last week, with 870,000 filing for new jobless benefits. That figure was slightly above expectations, but below the critical 1 million threshold that’s defined the COVID-19 era data series. Meanwhile, continuing claims crept up to 12.580 million (versus 12.275 million expected), up slightly from 12.747 million during the prior week.After Wednesday’s sharp sell-off, futures are still pointing to a modestly weaker open on Wall Street.—7:58 a.m. ET: Rite Aid tops quarterly sales expectations as retail pharmacy same-store sales rise; Darden Restaurants misses top-line estimatesRite Aid (RAD) posted a quarterly revenue increase of 11.5% for its fiscal second quarter, bringing total sales to $5.98 billion versus the $5.75 billion consensus analysts expected. Adjusted earnings from continuing operations were 25 cents per share, more than doubling over last year and coming in well above estimates for 1 cent.Retail pharmacy same-store sales jumped 3.5% over last year, which comprised a 4.6% rise in front-of-store sales and a 2.3% increase in pharmacy sales. Pharmacy service segment revenue jumped 29.1% over last year to $2 billion, driven primarily to an increase of 259,000 Medicare Part D members.Rite Aid also offered fiscal 2021 guidance, to see revenues of between $23.5 billion to $24.0 billion this fiscal year, with same store sales rising as much as 4.0%. The company, however, still expects to post a full-year net loss of between $190 million and $140 million. Shares of Rite Aid were flat in early trading.Meanwhile, Olive Garden parent company Darden Restaurants (DRI) missed consensus estimates for fiscal first-quarter sales, as consumers dined out less during the pandemic. Company-wide same-store sales sank 29%, versus the 26% drop expected, though its adjusted earnings per share from continuing operations of 56 cents were much better than the 5 cents expected. Darden reinstated its quarterly dividend of 30 cents per share.Olive Garden, the company’s biggest restaurant segment, posted a comparable sales decline of 28%, dropping significantly after last year’s 2.2% increase in the same quarter, and missing estimates for an increase of about 24%.Darden offered current-quarter guidance for total sales to total approximately 82% of those in the prior year, and that diluted net earnings per share from continuing operations would total as much as 75 cents.—7:20 a.m. ET Thursday: Stock futures mixed ahead of jobless claims reportHere were the main moves in markets as of 7:20 a.m. ET:S&P 500 futures (ES=F): 3,230.00, down 1.25 points or 0.04%Dow futures (YM=F): 26,689.00, up 4 points or 0.01%Nasdaq futures (NQ=F): 10,799.75, down 29.25 points, or 0.27%Crude (CL=F): +$0.04 (+0.1%) to $39.97 a barrelGold (GC=F): -$7.10 (-0.38%) to $1,861.30 per ounce10-year Treasury (^TNX): -0.7 bps to yield 0.669%—6:30 p.m. ET Wednesday: Stock futures trade mixed after selloffHere were the main moves in equity markets, as of 6:30 p.m. ET Wednesday:S&P 500 futures (ES=F): 3,234.00, up 2.75 points or 0.09%Dow futures (YM=F): 26,728.00, up 43 points or 0.16%Nasdaq futures (NQ=F): 10,821.75, down 7.25 points, or 0.07%Traders work on the floor of the New York Stock Exchange shortly after the opening bell in New York, December 28, 2015. REUTERS/Lucas Jackson TPX IMAGES OF THE DAY—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}