{"article": [{"url": "https://finance.yahoo.com/news/bidens-tax-plan-eyes-on-the-1-and-corporations-like-amazon-171224269.html", "published": 1597753220.0, "headline": "Biden's tax plan: Eyes on the 1% and corporations like Amazon", "body": "The first night of the Democratic National Convention featured attacks on President Trump’s record and character from figures like Michelle Obama, Sen. Bernie Sanders and others. “He is clearly in over his head,” said the former First Lady.The Trump campaign’s official response largely ignored that and started by bringing up a different subject entirely: taxes.Trump’s press secretary opened by saying that “the first night of the Democratic convention left out the fact that Joe Biden would raise taxes on more than 80% of Americans by at least $4 trillion.”The numbers were slightly off but are true in the broad strokes. According to analysts, Biden’s tax plan would raise “between $3.35 trillion and $3.67 trillion” in the coming decade.And Biden himself isn’t denying it. He has directly said to high-income earners that “if you elect me your taxes are going to be raised.”Former Vice President Joe Biden before signing required documents for receiving the Democratic nomination for President. (Drew Angerer/Getty Images)Biden’s increases would “primarily aim at raising taxes on higher earners, raising taxes on corporations, and raising taxes on business and investment income for those higher earners,” says Garrett Watson, a senior policy analyst at the Tax Foundation who has analyzed the candidate’s plans.Biden’s tax plans have been analyzed by a range of groups, including the American Enterprise Institute to the Brookings Institution. A combination of multiple analyses found that Biden’s plans would mean that the richest Americans would see their taxes go up by 13% to 18%. Americans of more moderate means would also see tax increases, but they have been called “indirect” and amount to a smaller increase: around 0.2% to 0.6%.Click here for Yahoo Finance's full coverage of the 2020 electionA President Biden would push for higher taxes on people making more than $400,000 a year for both payroll taxes and capital gains. It takes an income of $538,926 to be among the top 1% of earners nationwide.Biden confidante and former governor of Virginia, Terry McAuliffe, didn’t shy away from the question during a Yahoo Finance interview on Monday. “Yeah, people are going to have to pay more taxes,” he said, and predicted that Americans would understand and accept them given the record deficits and the range of crises facing the country.Story continuesA ‘tradeoff’ between GDP growth and higher taxesBiden’s tax plan – if implemented – would slow the pace of economic growth. Watson estimates GDP growth would be reduced by about 1.5% over the long term, and notes that hard conversations will be needed – whoever is president – after the pandemic ends about spending cuts and the “tradeoff when it comes to these tax hikes in the form of reduced growth.”President Trump has said he wants to extend his 2017 tax cuts and has also floated ideas for permanent cuts to payroll taxes if he is re-elected.Biden’s proposals, while highly progressive, would increase the tax burden on the rich less than many of his former Democratic primary challengers. Senators Bernie Sanders and Elizabeth Warren have pushed for higher rates and even a wealth tax, which Biden has not shown interest in. During her campaign, Sen. Kamala Harris proposed tax plans largely in line with Biden’s, but Watson notes that she “is more aggressive” on pushing for even higher rates and also has talked more about tax credits for lower-income earners.Joe Biden with his vice presidential running mate, Senator Kamala Harris in Wilmington, Delaware. (MANDEL NGAN/AFP via Getty Images)The plan for corporate tax ratesA Biden administration would also push to raise the corporate tax rate to 28%, back up toward the level it was during the Obama administration. In 2017, Trump’s tax cut lowered the corporate rate from 35% to 21%.Biden also wants certain corporations to pay more. Companies like Amazon have avoided federal income taxes entirely in recent years and paid just 1.2% in 2019.Biden’s “minimum book tax” would set a minimum rate of 15% on firms that have $100 million or more in income. “I think Amazon should start paying their taxes,” the former VP said in a May interview.Watson has written that the proposals would cause “needless complexity,” and says they are a blunt instrument. “It would be better for policymakers to think about ways to tweak the tax code directly in terms of taxing corporations rather than going the route of minimum taxes,” he says, adding that the move risks disincentivizing investments in things like research and development.It remains to be seen whether Democrats discuss tax rates much in the coming days of their convention. President Bill Clinton – who raised taxes on higher-income taxpayers during his presidency – speaks Aug. 18, President Barack Obama and Elizabeth Warren coming later in the week in addition, to the candidates themselves.Either way, it’s a safe bet to expect a whole lot more discussion of taxes next week when Republicans gather for their convention.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Terry McAuliffe on why ‘business should be happy that Joe Biden is coming in’Michigan’s governor on whether Biden has her state sewn up: ‘I don't buy it for a second’Summers says stocks 'do better' during Democratic administrationsRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}