{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-ca-reverses-key-planks-of-reopening-strategy-tokyo-mulls-toneddown-olympics-165650917.html", "published": 1594728260.0, "headline": "Coronavirus update: CA reverses key planks of reopening; Tokyo mulls toned-down Olympics", "body": "California’s decision to roll back key elements of its phased reopening underscored the continued risks posed by the coronavirus’ relentless spread, which is ripping through Sun Belt at an alarming rate.The global pandemic has surged to more than 13 million Tuesday, while the U.S. climbs toward 3.4 million cases. In the past week, global cases have been increasing by roughly 200,000 per day, evidence the outbreak is accelerating its spread.The spread prompted the Golden State on Monday to reverse its reopening plans, barring indoor dining, bars and movie theaters. Amid a furious debate about whether its feasible to reopen schools for the upcoming fall session, several counties — including hard-hit Los Angeles — have adopted distance learning for the school year, given that the virus shows no signs of waning.Dr. Jennifer Ellice, an emergency physician in Los Angeles, told Yahoo Finance Tuesday the shift to distance learning was the right one, even as some health and education experts argue that children should be in school.“If we had the pandemic under better control, if we had used the first shutdown to get effective contact tracing...if we had used it to decrease the number of infections, I think I would have felt more comfortable,” Ellice said.The seemingly relentless spike in new COVID-19 diagnoses is shifting attention to testing and equipment shortages in heavily impacted states, and forcing some regions to revert to strict social distancing measures. Cases are surging in Texas and Florida, with the latter having reported over 10,000 cases daily.The Lone Star state’s hospital system is teetering on the brink of being swamped. In an interview with IHS Markit, Houston Mayor Sylvester Turner warned that COVID-19 is now moving “at a much faster rate” than it did during the early stages of its U.S. appearance.“I advocate a shutdown for a couple of weeks, two to three weeks as a matter of fact, to give us opportunity to take the energy away from this virus,” Turner told IHS.Story continuesBy contrast, Rhode Island, New York and New Jersey are pushing ahead with reopening, and much of the northeast is trending in a positive direction. New York has implemented a fine on any travelers from Sun Belt states who do not provide contact information and visit from the hard-hit state.Abroad, a resurgence of cases in Hong Kong forced Disney to shut down the park there once again. Meanwhile Japan is looking at ways to ensure the Olympics take place at the rescheduled time in March 2021 — but possibly less extravagant than usual.Vaccine race keeps rollingA comparison of where the virus is surging, stable, or declining.Globally, the vaccine race continues, even as the U.S. has increased politicizing of all things response related— from withdrawing from the World Health Organization to the federal government heavily investing in vaccines, treatments and boosting domestic production.On a call with reporters Monday, HHS officials hinted at more support for vaccines and treatments, even though Operation Warp Speed has already announced support for four entities. The officials said small biotechs, large pharmaceutical companies and manufacturers of necessary supplies are all in the mix, in order to ensure greater production of the items needed to curb the outbreak.The officials added that a vaccine is likely to be available this year, pointing to the start of at least one —Moderna (MRNA)— and possibly two final-stage clinical trials for candidates this month.Moderna is slated to begin its Phase 3 trial on July 27.COVID-19’s effect on health careThe outbreak has impacted health care trends, from unemployment and its impact on insurance to doctors visits and prescription adherence. Some interesting new trends have been uncovered, most notably the disruption in vaccine delivery throughout the world.However, one company saw an interesting spike in vaccine use early on. SingleCare, a drug discount company, published a report Monday looking at the effect of the coronavirus on drug spending and trends.According to its findings, flu vaccinations soared 500% year-over-year at the start of the pandemic in late February and early March, supposedly in hopes of preventing COVID-19 that way. Yet ironically, cold and flu medicine purchases declined as quarantine curbed the spread of the flu.Meanwhile, antidepressants spiked in March and June, likely due to longer-term and mail order prescriptions being filled. Separately, allergy and asthma medications surged — such as inhalers, which were prescribed to treat some COVID symptoms.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}