{"article": [{"url": "https://finance.yahoo.com/news/heres-why-biden-will-be-good-for-the-investing-climate-141331072.html", "published": 1598952080.0, "headline": "Here’s why Biden may be good for ‘the investing climate’", "body": "Wall Street leaders have often favored Republican presidents (and either Republican or divided control on Capitol Hill) as that’s often resulted in more market-friendly policies. But in an interview with Yahoo Finance, Jared Bernstein, one of Joe Biden’s top economic advisors, laid out the case for the former vice president to the business community.“Many people in the markets are telling me that they look forward to a Biden presidency,” Bernstein, a former chief economist in the White House and a close advisor to the Biden 2020 campaign, said.In Bernstein’s view, Biden’s number one priority will be to get the pandemic under control and implement his plan to rebuild the economy. Rick Newman also asked how the former Vice President is “going to affect the investing climate” after 4 years of strong returns.‘Trumpian chaos’Bernstein highlighted perhaps the biggest distinction between the two candidates: the uncertainty and instability President Trump has brought to the White House, contrasted with Biden’s steady hand.Democratic nominee Joe Biden arrives to board an airplane headed for a campaign stop in Pennsylvania on Monday. (SAUL LOEB/AFP via Getty Images)“I think that you have to evaluate the impact of Trumpian chaos,” he said, citing trade wars (“a huge negative for globalization”) and “just lurching economic policies.”It’s part of Biden’s overall bet in the 2020 election. His candidacy has been built on the idea that voters are hungry for a return to a more stable government after four years of Trump. The proper functioning of capital markets might not make for an engaging tweet, but it’s an example of an issue that the Biden campaign hopes will resonate with voters.During a speech in Pittsburgh on Monday, Biden listed a range of maladies facing the country right now, from race relations to the pandemic to the economy, and said the common thread is “an incumbent president who sows chaos rather than providing order.”Republicans are making the opposite case in many ways. During the recent Republican convention, Trump’s rough edges and unconventional style were readily acknowledged, and often celebrated as part of what’s needed to get results.Story continuesTrump himself is often citing the stock market – at least on the days it does well – as reason alone to re-elect him.Bernstein said the investors he talks to “just can't take the uncertainty.”RECORD HIGH NASDAQ! It would all come crashing down, including your Jobs, Stocks, and 401k’s, if Sleepy Joe ever became President. China and others would own us!!!— Donald J. Trump (@realDonaldTrump) August 3, 2020New investing opportunities in clean energyBernstein also had a tip for investors: look at the domestic investments Biden is promising to make. “There are literally trillions of investments in clean and renewable energy,” Bernstein said. “We're going to be doing well by doing good.”Biden’s plan calls for $2 trillion in new clean energy investments, which he says will help “build a more resilient, sustainable economy.”Getting “a clean energy sector off and running is something that capital markets care a lot about,” said Bernstein. The Biden plan wouldn’t eliminate jobs from older energy sources but instead focus on the future. “It hastens the transition out of extractive industries to one that I would argue energy investment is going all by itself,” he said.Trump’s rebuttal on this front almost always involves three words: Green New Deal. Biden has never endorsed the plan championed by progressives like Rep. Alexandria Ocasio-Cortez, though his climate plan does call it a “crucial framework.”Trump has tweeted about the “Bernie/Biden/AOC Green New Deal plan” and his allies say it would destroy millions of jobs.‘A big missing market in this country for childcare’Another area Bernstein made sure to highlight is childcare. It may not have as much direct market impact but he says it’s a huge opportunity for the country.“I think that's a huge plus for America – not just for markets but for everybody else,” he said.Jared Bernstein served as chief economic advisor to Vice President Joe Biden from 2009-2011. (REUTERS/Kevin Lamarque)Biden’s plan would spend $775 billion to build up what it describes as a “21st century caregiving and education workforce.” The goal is to make childcare more affordable and accessible to a wider swath of the population.Sen. Elizabeth Warren (D-MA) telegraphed the importance of the issue for Democrats during the Democrats’ recent convention. Her speech was highly anticipated by business leaders during a part of program called “a more perfect economy.”Warren did get in a few digs against corporate America but her speech was largely focused on investments in childcare. “It’s time to recognize that childcare is part of the basic infrastructure of this nation,” she said.The question of course is how resonant Bernstein’s argument will be with investors after 4 years – even with all the chaos and a lingering pandemic – that has seen strong stock market performance.There are signs that Wall Street’s donors are getting on board with Biden, but Trump does have a lead in other areas, like how voters assess his handling of the economy.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Why Joe Biden still has ‘work to do’ to catch up to Trump on the economyBiden's tax plan: Eyes on the 1% and corporations like AmazonTerry McAuliffe on why ‘business should be happy that Joe Biden is coming in’Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}