{"article": [{"url": "https://finance.yahoo.com/news/walmart-releases-annual-top-rated-by-kids-toy-list-040120354.html", "published": 1599088160.0, "headline": "How kids, and the coronavirus, helped Walmart shape its yearly list of hot toys", "body": "Walmart (WMT) on Thursday released its annual roundup of the hottest toys, a list reviewed and rated by kids.Like most other things nowadays, the list revealed that children’s entertainment choices have been influenced by the coronavirus, especially during lockdowns.Walmart's annual \"Top Rated by Kids Toy List\" is traditionally compiled by kids who test and play with toys and gadgets at in-person events. This year, the retail giant took a different approach because of the pandemic and shipped the toy suppliers’ contenders directly to the kids' homes.A representative group of kids, ages 2 to 12, from across the U.S. narrowed this year's list to just 36 toys, down from last year's 48 items. As shutdowns took hold in March, Walmart saw an uptick in crafting supplies, puzzles and games, as families sought outlets to entertain and educate at home.\"What's really interesting this year is what we're seeing in toys, specifically, is how critical a how critical a role they are playing with families,\" Erin Fish, Walmart's merchandising director for girls fashion dolls, told Yahoo Finance.\"The toys selected this year are really focused more on the learning-based play,\" Fish added.This year's major toy trends are energy-burning outdoor toys, items inspired by streaming content, interactive play, and screen-free indoor entertainment.During the pandemic, Walmart saw demand pickup for outdoor activities, and that trend is expected to continue.\"When we look at the trends, outdoor, in general, has really skyrocketed, and I think it's because kids want to get out and burn their energy,\" Fish added.The popular outdoor toy this year is the Jetson Plasma Light Up Hoverboard for $148.Kids cooped up at home are also influenced more than ever by the immense amount of content they are streaming.Between entertainment and virtual learning, “I think both their parents and the kids, what we see in the trends with the toys that were selected is really toys that were inspired by the content they were seeing,\" Fish said.Story continuesLittle Live Pets Gotta Go Flamingo, Dancing, Wiggling, & Pooping Toy is one of Walmart's top rated toys for 2020.The kid experts picked Blue's Clues & You Peek-A-Boo toy for $24.84, following the television series reboot, along with the Paw Patrol Dino Patroller, priced at $59.More time at home also means more time to play with interactive toys.\"With the at-home environment, they really have the opportunity to engage with all of the elements that an interactive toy would have,\" Fish said.Making the interactive toy list is \"Squeakee the Balloon Dog,\" a $58 toy pet that makes sounds, deflates, and does tricks with the touch of a plastic pin. The kids also selected the \"Gotta Go Flamingo,\" a $28.82 bird toy that dances and sings when fed — all before making poop in a plastic toilet.\"I think it's a nod to being in an in-home environment and really have a chance to sit down and play with the toys,\" Fish added.This year, kids can remotely examine the toys without visiting the store by going on Walmart's \"Wonder Lab,\" a virtual experience that lets kids unbox and interact with toys.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Walmart unveils ‘ultimate life hack,’ a $98 membership with access to free delivery and gas discounts"}]}