{"article": [{"url": "https://finance.yahoo.com/news/bill-ackman-on-economic-recovery-and-future-of-cities-194919236.html", "published": 1595602640.0, "headline": "Ackman sees 'real recovery' in second half of 2021, remains upbeat on offices and restaurants", "body": "Billionaire activist investor Bill Ackman — who famously issued a dramatic call for a national shutdown at the beginning of the coronavirus outbreak — expects a real economic recovery in the second half of 2021 that can bolster beaten-up commercial real estate and eateries.In mid-March, the hedge fund manager took to Twitter to call for shutting down the U.S. for several weeks as the COVID-19 pandemic took hold. At the time, Ackman said the government should offer a \"30-day rent, interest and tax holiday for all\" to protect from the economic blow delivered by the virus.Had the country followed those suggestions, “we would have had a better outcome on the virus and a more rapid recovery of the economy,\" Ackman told Yahoo Finance this week, following the public debut of Pershing Square’s Tontine Holdings (PSTH.U), a special purpose acquisition company (SPAC).Instead, the U.S. has had \"something in the middle,\" characterized by a state-by-state rolling closures, he explained. The result is a patchwork of mitigation strategies and a resurgence of infections in key regions.\"We're having kind of the inverse now today and all the problems associated with that. So, it's not ideal, but it's much better than the alternative, which is we let the virus run roughshod around the country,\" Ackman added.‘A tough six months’ aheadEAST HAMPTON, NY - AUGUST 06: Bill Ackman attends the Hamptons International Film Festival SummerDocs Series screening of \"Betting On Zero\" at Guild Hall on August 6, 2016 in East Hampton, New York. (Photo by Matthew Eisman/Getty Images for Hamptons International Film Festival)The 54-year-old CEO of $11 billion Pershing Square Capital Management says the economy \"is going to be middling\" until certain conditions to mitigate the spread are met.Those include a therapeutic that works, an effective vaccine, or everyone wears a mask in public. However, he does expect the green shoots of a rebound in 2021.\"I think it's going to be a tough six months, nine months, but I'm looking toward the back half of next year as the beginning of a real recovery or something getting back to something approaching normal with maybe Q1 being a transition moment,” he added.Offices will survive, but rents will fallStory continuesDespite gloomy warnings about the work-from-home impact on real estate, Ackman doesn't see the end of office space in big cities — noting that it comes down to a \"building-by-building\" analysis.However, he believes office density will go down, estimating that 5% to 10% of the workforce for most companies will work from home, or at least several days from home.\"I think office survives. I do think there will be certain office space will be outmoded, sort of the cramped, low-ceiling, old-fashion office space probably needs to be torn down and rebuilt,” the billionaire said.“The high-ceiling more modern layouts, outdoor space, will be a real premium asset, I think, for offices,\" he added.In street-level retail, many businesses had been priced out because of exorbitant rents in New York City, with the exception of national and global chains, he explained.\"The good news [is]... it's probably the best time in New York City to open a restaurant,” Ackman told Yahoo Finance — even as the industry has been decimated by lockdowns and social distancing measures associated with COVID-19.“I know that sounds like a funny statement, but rents are going to be lower than ever. There's going to be less competition than ever,\" he said, despite acknowledging winter will be “a challenging period\" for many.As confidence returns, people will be “dying to eat out and enjoy all the great things that a city has to offer.\"Back in March, Ackman parlayed a $27 million bet into $2.6 billion via credit market hedges. Ackman told Yahoo Finance at the time that he'd been an \"aggressive buyer\" of stocks, putting that money into stocks.Pershing Square Capital's publicly-traded vehicle, Pershing Square Holdings, is up 34.7% this year as of Tuesday, far outpacing the broader market. The hedge fund has exposure across consumer names and real estate.Among the big bets in the portfolio are Restaurant Brands International (QSR), Lowe's (LOW), Chipotle (CMG), Starbucks (SBUX), Hilton Hotels (HLT), and Howard Hughes Corporation (HHC), according to the most recent regulatory filing.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Ackman looks to ‘marry a unicorn’ with record-breaking SPACPalihapitiya: Skip government bailouts, put ‘more money into the hands of consumers’Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investorsBillionaire Palihapitiya on the phenomenon of ‘spectacular’ AOC"}]}