{"article": [{"url": "https://finance.yahoo.com/news/the-cities-most-at-risk-of-a-real-estate-bubble-ubs-203301974.html", "published": 1601559680.0, "headline": "The cities most at risk of a real estate bubble: UBS", "body": "Home price growth in major housing markets across the globe have held up during the COVID-19 pandemic — but a few cities could be due for a sharp price correction, according to a new study.The coronavirus pandemic has lowered demand for city living as families seek out more space to shelter-in-place and work remotely, and properties in major cities aren’t expected to continue appreciating as they have over the past year, according to the 2020 UBS Global Real Estate Bubble index, which analyzed 25 global housing markets.“Even in the absence of a broad market correction, the potential for further capital gains seem depleted,” said a statement by Matthias Holzhey, lead author of the study and head of Swiss real estate investments at UBS Global Wealth Management, a Switzerland-based investment firm.The top four cities at risk of a housing bubble were Munich, Frankfurt, Paris and Amsterdam. These Eurozone cities have sky-high asking prices paired with local laws that limit profitability for real estate investors — and they might not be willing to pay anymore.“In some of the European cities, there is a high degree of rent control,” said Jonathan Woloshin, head of U.S. real estate at UBS Global wealth management’s chief investment office. “Especially if you are buying a property to rent it out, it’s less attractive.”And for the first time, Zurich also joined the list of cities that are at risk of a housing bubble. Employment growth, investment appeal and falling mortgage rates have driven up prices in the Swiss city 50% since 2010 — prices which experts believe people will be unwilling to pay within the next few quarters, causing high prices to drop.Credit: UBS Global Real Estate Bubble index“It’s clear that the current acceleration is not sustainable. Rents have been falling already in most cities, indicating that a correction phase will likely emerge,” said the report.The only North American city at risk of a housing bubble was Toronto, but its ranking improved from last year, when prices were even higher. Toronto cooled when the government instituted taxes on foreign buyers, vacancy fees and stricter rent controls, which prompted a 10% price correction in 2019, according to the study.Story continuesThe only city in Asia at risk of a housing bubble was Hong Kong, but it too cooled down this year. Home prices in Hong Kong almost quadrupled from 2003 to 2019, but prices came down 5% from their peak.“We definitely have some reshuffling of the deck. Near term, some markets with traditional strength — some of that strength is pulling back,” said Woloshin.Chicago was the only city considered \"undervalued\" in the study. Photo: August 16, 2019 - Chicago, USA.No risk of housing bubble in USMeanwhile, UBS found that none of the major cities in the U.S. are considered to be at risk of a housing bubble. Most cities like New York and San Francisco were rated as “overvalued” but not at risk of a sharp price correction, even as the U.S. experiences suburbanization.Though record numbers of city-dwellers have moved to the suburbs during the coronavirus pandemic, New York City and San Francisco are not at high risk of a sharp price correction because of a historic supply shortage and sustained global demand from wealthy investors, according to the study.“Especially in New York, we have seen some outmigration — with people working from home, they don’t need to stay in expensive cities. So there’s a cooling in prices,” said Woloshin. “And San Francisco was the most expensive city in the U.S. for a number of years — and it’s still very expensive — but so many tech companies are allowing people to work remotely that there is out-migration to less expensive markets.”The only undervalued city in the study was Chicago, though it is slightly less undervalued than it was last year. Since 2015, home prices in Chicago have appreciated at half the rate of the average home in the U.S., in part due to population decline and the city government’s high debt.“Chicago’s the one market that has been pretty consistent in terms of being lower on the bubble risk, and that’s really a function of the fact that they haven’t experienced the price growth that other cities have seen,” said Woloshin.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Most Latinos still believe in the American Dream of owning a home: reportHere is where Trump and Biden stand on housing issuesHomebuilders are holding back sales amid historic demand"}]}