{"article": [{"url": "https://finance.yahoo.com/news/trump-nominee-judy-shelton-lacks-votes-for-spot-at-the-fed-203726887.html", "published": 1600184720.0, "headline": "Trump nominee Judy Shelton lacks votes for spot at the Fed, Sen. Thune says", "body": "WASHINGTON, DC - FEBRUARY 13: Judy Shelton testifies before the Senate Banking, Housing and Urban Affairs Committee during a hearing on their nomination to be member-designate on the Federal Reserve Board of Governors on February 13, 2020 in Washington, DC. (Photo by Sarah Silbiger/Getty Images)Former Trump transition economic adviser Judy Shelton’s nomination to a spot at the Federal Reserve may be in peril, as a top Republican in the Senate notes that she may not have enough support.Bloomberg reported Tuesday that South Dakota Sen. John Thune, the second highest ranking Republican in the Senate, does not currently have the 51 votes needed to secure confirmation to become a Fed governor.“We’re still working it,” Thune reportedly said. “It’s the Federal Reserve, it’s important so obviously we want to get it done. But we’re not going to bring it up until we have the votes to confirm her.”Thune’s comments suggest that there may still be efforts to drum up enough support for a majority, which will be difficult with the GOP controlling a narrow 53-47 majority.The White House told Yahoo Finance Tuesday that it has not pulled her confirmation.“President Trump is firmly behind his nomination of Judy Shelton, who is exceptionally qualified, to the Federal Reserve,” said White House spokesperson Judd Deere. “Senate Democrats should stop playing politics and confirm the President’s nominee.”But the challenge may be on the GOP side of the Senate, where Republicans Susan Collins and Mitt Romney have committed to voting against her. Alaska Senator Lisa Murkowski is also reportedly still mulling over whether or not she will support the nomination.Shelton’s nomination nearly failed to make it out of the Senate Banking Committee, where she survived a party-line 13-12 vote. Shelton, previously a vocal advocate of re-installing the gold standard, endured a contentious confirmation hearing in February in which she backtracked on her support of such a monetary system.“I would not advocate going back to a prior historical monetary arrangement,” Shelton told the Senate Banking Committee February 13.Former Fed officials and economists have since rallied against her confirmation, with an open letter racking up over 125 signees describing her views as “extreme and ill-considered.”Story continuesSt. Louis Fed economist Christopher Waller was nominated alongside Shelton, but his path to confirmation has faced fewer obstacles. Waller advanced in the Senate Banking Committee in an 18-7 vote.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.FOMC Preview: Lack of fiscal stimulus casts shadow over FedAmericans are again growing concerned about losing their jobs: NY FedLower-for-longer rates from the Fed point to a weaker-for-longer dollarSenate GOP sends mixed messages on need for Federal Reserve emergency loansA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}