{"article": [{"url": "https://finance.yahoo.com/news/shale-pioneer-chesapeake-energy-files-201347002.html", "published": 1593357680.0, "headline": "Shale pioneer Chesapeake Energy files for bankruptcy", "body": "By David French and Rama VenkatNEW YORK (Reuters) - Chesapeake Energy Corp <CHK.N> filed for Chapter 11 on Sunday, becoming the largest U.S. oil and gas producer to seek bankruptcy protection in recent years as it bowed to heavy debts and the impact of the coronavirus outbreak on energy markets.The filing marks an end of an era for the Oklahoma City-based shale pioneer, and comes after months of negotiations with creditors. Reuters first reported in March the company had retained debt advisers.Chesapeake was co-founded by Aubrey McClendon, an early and high profile advocate of shale drilling who died in 2016 in a fiery one-car crash in Oklahoma while facing a federal probe into bid rigging. Over more than two decades, McClendon built Chesapeake from a small wildcatter to a top U.S. producer of natural gas. It remains the sixth-largest producer by volume.Current CEO Doug Lawler, who inherited a company saddled with about $13 billion in debt in 2013, managed to chip at the debt pile with spending cuts and asset sales, but this year's historic oil price rout left Chesapeake without the ability to refinance that debt.\"Despite having removed over $20 billion of leverage and financial commitments, we believe this restructuring is necessary for the long-term success and value creation of the business,\" Lawler said in a statement announcing the filing.Lawler last year spent $4 billion on an ill-timed push to reduce Chesapeake's reliance on natural gas. The purchase sent its shares lower and this year the value of Chesapeake's oil and gas holdings fell by $700 million this quarter. The company last month warned it may not be able to continue operations.Chesapeake plans to eliminate approximately $7 billion of its debt, the statement said. A separate court filing indicated that Chesapeake has more than $10 billion in liabilities and assets, respectively.Chesapeake's outlook plunged this year as the coronavirus outbreak and a Saudi-Russia price war sharply cut energy prices and drove its first-quarter losses to more than $8 billion. On Friday, its stock traded at $11.85, down 93% since the start of the year, leaving it with a market value of $116 million.Story continuesThe company has entered into a restructuring support agreement, which has the backing of lenders to its main revolving credit facility - some of which are providing $925 million of debtor-in-possession (DIP) financing to help fund operations during the bankruptcy proceedings.The agreement also has backing from portions of other creditors, including those behind 87% of its term loan, and holders of 60% and 27%, respectively, of its senior secured second lien notes due 2025, and senior unsecured notes.While the statement does not name Chesapeake's creditors, investment firm Franklin Resources is among the most significant. On June 15, Reuters reported that Chesapeake's impending restructuring would turn over control of the company to creditors including Franklin.Chesapeake also has agreed the principal terms for a $2.5 billion exit financing, while some of its lenders and secured note holders have agreed to backstop a $600 million offering of new shares, to take place upon exiting the Chapter 11 process, the statement added.Chesapeake's filing in U.S. Bankruptcy Court for the Southern District of Texas makes it the largest bankruptcy of an U.S. oil and gas producer since at least 2015, when law firm Haynes & Boone began publishing data on restructurings.Chesapeake's advisers are investment banks Rothschild & Co and Intrepid Partners, law firm Kirkland & Ellis LLP, and turnaround specialists Alvarez & Marsal.(Reporting by David French in New York, Rama Venkat and Shariq Khan in Bengaluru and Jennifer Hiller in Houston; editing by Diane Craft)"}]}