{"article": [{"url": "https://finance.yahoo.com/news/tiktok-owner-gaining-confidence-beijing-021148953.html", "published": 1600398440.0, "headline": "TikTok Owner Is Gaining Confidence Beijing to Okay U.S. Deal", "body": "(Bloomberg) -- TikTok-owner ByteDance Ltd. is getting more confident its envisioned alliance with Oracle Corp. will pass muster with China’s regulators, a critical step in the political clash over the popular video app, people familiar with the matter said.While Beijing has asserted its right to block the sale of critical technologies, it is likely to greenlight a deal as long as it doesn’t involve the transfer of the artificial intelligence algorithms that drive TikTok’s service, they said, asking not to be identified discussing a private deal. That’s true even if ByteDance were to cede majority control over TikTok, they said.ByteDance struck a deal with Oracle and later made revisions put forward by the Treasury Department aimed at addressing U.S. national security concerns, Bloomberg reported Thursday. The proposal calls for ByteDance to own most of a ringfenced TikTok, with Oracle, Walmart Inc. and venture capital investors holding a minority of a new company that will pursue an initial public offering in about a year. But President Donald Trump has the final word and has said he doesn’t want the Chinese parent to retain majority control.It’s unclear if ByteDance founder Zhang Yiming will relinquish that much ownership over the app he built into a challenger to Google and Facebook Inc. But Beijing’s stance gives him that option -- so long as he maintains a tight grip over the service’s core technology.“The most worrying part for the Chinese government has been the algorithm, which is the most valuable asset for TikTok,” said Yik Chan Chin, who researches global media and communications policy at the Xi’an Jiaotong-Liverpool University in Suzhou. If the latest proposal is okayed by Trump, “we can’t say Beijing wins, but it definitely loses less.”Read more: ByteDance Plan for U.S. TikTok Company Envisions IPO in a YearIn a sign the deal may go through, Secretary of State Michael Pompeo, who held some of the strongest reservations about the agreement, has softened his opposition and told Trump so on Wednesday, according to two people familiar with the matter.Story continuesThe plan revised with Treasury calls for the new TikTok to be headquartered in the U.S. with an independent board, approved by the U.S. government and made up entirely of U.S. citizens. The board would include a national security committee -- led by an American data-security expert who would be the primary contact with the Committee on Foreign Investment in the U.S. -- which would oversee any issues of concern to Washington.The new terms include 20 pages of detailed provisions over data and national security, the people said. Under the existing proposal, Oracle has power to review the software or source code underlying the TikTok service, but ByteDance maintains ownership.That technological division could remain even if American investors end up with control of TikTok’s equity. Oracle and ByteDance have accepted Treasury’s conditions, people familiar with the talks have said.ByteDance executives have also spoken to Instagram co-founder Kevin Systrom about a possible role in the new organization, according to another person familiar with the discussions. It’s not clear if the discussions are advanced, the person said.ByteDance representatives declined to comment. In its latest statement to Chinese media, ByteDance said a final deal needs approval from Chinese and U.S. regulators.TikTok Drags On: Next ChinaTikTok has emerged as a top target in Trump’s effort to crack down on China ahead of the Nov. 3 election. The president is trailing his Democratic opponent Joe Biden in the polls and seeking to use a tough stance with Beijing as a selling point to voters. That’s despite the fact that American investors collectively hold roughly 40% of ByteDance’s equity, with the rest owned by Zhang, his employees and a clutch of non-U.S. investors such as SoftBank Group Corp., a person familiar with the structure has said.On the flip side, there are signs Beijing is backing one of its biggest internet companies, firing off a litany of comments condemning U.S. “coercion” and “bullying.” ByteDance also recently acquired a company with a coveted national digital payment license — a competitive arena that Beijing rigidly controls.“ByteDance has been trying to get this license for a long time,” said Mason Xu, founding partner of Heyi Capital. “The fact that it happened only recently, I would say -- at least from an external perspective -- it is a kind of endorsement from the Chinese government.”ByteDance Is Playing Chicken With Trump on TikTok: Tim CulpanDespite the security measures in the revised Oracle deal, Trump administration officials remain wary about the proposed new ownership structure and how much influence that would give China over the company. If Trump balks, ByteDance and Oracle may have to tweak the deal.In their opening proposal to the Trump administration, ByteDance and Oracle outlined a plan for Oracle and other American investors -- including Sequoia Capital, General Atlantic and Coatue Management -- to get minority stakes in the standalone business. The newly formed U.S. company will then hire 25,000 American workers in a wide range of jobs from content moderation and engineering to product and marketing.ByteDance has tried to argue that TikTok will in effect have majority American ownership -- if you combine the minority direct stake in TikTok Global with the 40% of parent ByteDance that U.S. investors already hold. Yet some of Trump’s advisors have advocated for Americans to hold a direct majority of the new TikTok outright.Regardless, ByteDance will not sell or transfer its proprietary technologies to Oracle. The newly created company isn’t going to recreate the powerful algorithms that ByteDance has built and trained with the help of data collected over many years, one of the people said.Instead, the U.S. software giant will be able to check all source code to make sure there’re no back doors that may let ByteDance gather data on the video-sharing app’s users, according to people familiar with the matter. The world’s second-largest software maker can continue to review the code as updates come in, to make sure ByteDance doesn’t create new points of access to the data, the people said. ByteDance itself will still have visibility into the algorithms, but Oracle will be able to monitor the data flows and review and approve all updates to the code.(Updates with Pompeo’s stance and analyst’s comment from the fifth paragraph)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}