{"article": [{"url": "https://finance.yahoo.com/news/how-a-president-joe-biden-would-handle-pandemics-differently-than-trump-162806897.html", "published": 1594985780.0, "headline": "Here's how a president Joe Biden would handle pandemics differently than Trump", "body": "Connecticut Governor Ned Lamont says a president Joe Biden would handle a pandemic far differently than President Trump is currently.Think bigly different.“He would put public health first. He would have a consistent message. And he would listen to the scientists. That’s a big difference,” Lamont said on Yahoo Finance’s The First Trade. Lamont — a Democrat credited for a near expert handling of the COVID-19 pandemic in his state of 3.5 million residents — was among the first to support Joe Biden’s run for the White House.Suffice it to say, Trump’s handling of the health crisis has been anything but consistent.This week, members of the administration — namely trade hawk Peter Navarro — have publicly criticized the nation’s leading infectious disease specialist Dr. Anthony Fauci. The bizarre attacks have been met with swift backlash from both sides of the aisle given Fauci’s impressive track record and good standing in the public.Democratic presidential candidate, former Vice President Joe Biden removes a face mask to protect against the spread of the new coronavirus as he arrives to speak at Alexis Dupont High School in Wilmington, Del., Tuesday, June 30, 2020. (AP Photo/Patrick Semansky)“I think it’s dumb,” Lamont — who has consulted with Fauci frequently during the pandemic — said of the public attacks. “I mean, Fauci has so much credibility on both sides of the aisle, and with consumers, and business and labor. You want somebody with credibility talking to the groups out there so we know what’s going on.”The criticism of Fauci comes amid disappointment in how the administration has managed the pandemic — everything from the president refusing to wear a mask to continued downplaying of the threat to public health.Meanwhile, COVID-19 continues to rage on in the country and in fact, may be picking up steam again as some states likely opened too soon.There has been more than 13.8 million confirmed coronavirus cases worldwide, with the U.S. having 3.53 million of them. Out of the 591,000 worldwide deaths, the U.S. has had 138,000.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}