{"article": [{"url": "https://finance.yahoo.com/news/white-house-donald-trump-response-jobs-report-180146308.html", "published": 1601644160.0, "headline": "Here’s why the White House is saying the jobs report isn’t as bad as you think", "body": "September’s jobs report – the last before Election Day – showed a long recovery ahead at the very least.The economy added 661,000 jobs but the labor market is down over 10 million jobs since before the coronavirus took hold.On a day where the ongoing pandemic hit the White House directly, Joseph LaVorgna, the National Economic Council’s chief economist, appeared on Yahoo Finance’s On the Move to highlight the “good news” in the report that many analysts and traders aren’t seeing.“I would be careful” not to write the economy off too quickly, he said.‘Those numbers bounce around a lot’The report showed 661,000 jobs added back in September falling short of the 859,000 that had been expected. The unemployment rate fell to 7.9%.President Trump at the White House on Thursday before confirming announcing he had tested positive for Covid-19 later that night. (SAUL LOEB/AFP via Getty Images)A more worrying number was that many jobs appear to be gone permanently. The number of permanent job losers jumped by 345,000 to 3.8 million, an increase of 2.5 million since February.As for those jobs, LaVorgna said \"those numbers bounce around a lot,\" adding \"I would take issue with that and say the economy is coming back.”“We are creating a lot of jobs, a record amount of jobs, and also we've got a lot of new industries that are coming post coronavirus,\" he said, noting that the “super V” shaped recovery is still on.Other observers are discussing a K-shaped recovery with some people returning to normal but others continuing to struggle.LaVorgna also pointed to the private sector as a reason to be bullish. \"The headline may have been weaker, but keep in mind that the private number was bang on with consensus expectations,\" he said.Government jobs were, indeed, the only category which declined in September, driven by temporary Census 2020 workers ending their duties.Joseph Lavorgna is the Chief Economist of the the National Economic Council. (Drew Angerer/Getty Images)‘We are up over a point’The unemployment rate – which dropped to 7.9% from 8.4% largely due to 700,000 workers leaving the labor force – was another aspect of the report LaVorgna highlighted.Answering questions from reporters on Friday morning, White Chief of Staff Mark Meadows said it was a “great” jobs report specifically mentioned the unemployment falling below 8%. He also said the president was focused on work even though he was displaying coronavirus symptoms.Story continues“His first question to me this morning is how is the economy doing, how are the stimulus talks going on Capitol Hill,” Meadows said.LaVorgna added of the president’s positive Covid-19 test, “we are praying and wishing for a speedy recovery, but we’re working and business goes on.\"Other analysts see a stagnating recovery. Gregory Daco, chief U.S. economist at Oxford Economics, noted during an earlier appearance on Yahoo Finance that the economy is entering the fall with “much less momentum” than he would have hoped.LaVorgna went deeper into the numbers: \"We are up over a point on participation rate since April,\" he said of the 6-month trend, and also pointed to the U-6 – the broadest measure of unemployment – which fell from 14.2% to 12.8%.He pointed to three sectors – retail trade; leisure and hospitality; and healthcare and social assistance – noting they \"accounted for two-thirds of the almost 11.5 million available jobs that have been created since April.\" Left unsaid, of course, was that all three sectors remain down from before the virus struck.On the need for more stimulus, LaVorgna says that he and the president would like another stimulus bill to get the economy moving, but either way \"we clearly see in the data a self-feeding, self-sustaining recovery.\"Larry Kudlow, the director of the NEC, made a more direct call on Friday. He said relief is currently “zero” and called for at least some stimulus. “Let’s find the key points and pass it,” he told reporters, noting that airlines in particular need help.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:This is the worst unemployment ever seen before a US presidential electionStock market news live updates: Wall Street reels as Trump contracts Covid-19, jobs data disappointSeptember jobs report: US economy gains 661,000 payrolls, unemployment rate ticks down to 7.9%Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}