{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-7-2020-222809279.html", "published": 1594134920.0, "headline": "Stock market news live updates: Stocks mixed as economic, virus fears linger", "body": "Stocks ended Tuesday’s session lower, with each of the S&P 500 and Nasdaq ending a previous five-session winning streak.[Click here to read what’s moving markets heading into July 8, 2020]Fears over global economic activity in the wake of the virus flared after the Organization for Economic Cooperation and Development issued a dismal economic forecast, given risks of a second wave of Covid-19. The unemployment rate among the OECD’s 37 member countries edged down from a 10-year high of 8.5% in April to 8.4% in May.German industrial production data also came in weaker than expected Tuesday, with the country’s output rising 7.8% in May after a 17.5% drop in April, but missing consensus expectations for 11.1%.The choppy session Tuesday came following stocks’ fifth straight session of gains a day earlier, with the Nasdaq Composite rising to a record high. Big tech stocks led advances, and Amazon (AMZN) rocketed above $3,000 per share for the first time ever and held onto these gains during the pre-market session. On Tuesday, Tesla (TSLA) extended its rally to more than 45% in six sessions – its biggest gain over that time period in almost three months.Domestic economic data Monday morning showed a much stronger than expected rebound in US service sector activity in June, underscoring a recovery in the industries hardest hit by the pandemic. On Tuesday, the Labor Department’s May JOLTS report showed an unexpected rise in job openings, along with a record rise in hiring.Still, an eruption of cases in the South and West continued over the holiday weekend and into this week, leaving the risk that ensuing business re-closures would jeopardize the pace of the recovery. The mayor of Miami-Dade in Florida said he intends to close restaurants and gyms again on Wednesday. Cases throughout Florida rose 3.2% on a one-day basis as of Monday, coming in below the state’s seven-day average increase of 5.1%, but holding at a high level relative to other regions.Story continuesArizona, another new hot spot, reported a 3.6% one-day increase in cases on Tuesday, which was also below its seven-day average of 4.5%.—4:04 p.m. ET: Dow drops 396 points, or 1.5%, S&P 500 falls 1.1% to end 5-day winning streakHere were the main moves in markets as of 4:04 p.m. ET:S&P 500 (^GSPC): -34.40 (-1.08%) to 3,145.32Dow (^DJI): -396.85 (-1.51%) to 25,890.18Nasdaq (^IXIC): -89.76 (-0.86%) to 10,343.89Crude (CL=F): -$0.31 (-0.76%) to $40.32 a barrelGold (GC=F): +$15.60 (+0.87%) to $1,809.10 per ounce10-year Treasury (^TNX): -3.4 bps to yield 0.6500%—1:19 p.m. ET: Stocks mixed, Dow drops 200+ pointsThe S&P 500 and Dow dropped Tuesday afternoon while the Nasdaq held onto narrow gains, buoyed by a continued rise in tech stocks. The financials and energy sectors lagged in the S&P 500, while the consumer staples, communication services, materials and information technology sectors held in positive territory.Here were the main moves in markets, as of 1:10 p.m. ET:S&P 500 (^GSPC): -9.25 points (-0.29%) to 3,170.47Dow (^DJI): -204.54 points (-0.78%) to 26,082.49Nasdaq (^IXIC): +7.85 points (+0.08%) to 10,441.71Crude (CL=F): +$0.13 (+0.32%) to $40.76 a barrelGold (GC=F): +$15.20 (+0.85%) to $1,808.70 per ounce10-year Treasury (^TNX): -2.8 bps to yield 0.656%—11:17 a.m. ET: Shake Shack stock falls more than 4% after reporting weaker than expected preliminary Q2 salesShake Shack (SHAK) on Tuesday preliminarily announced second-quarter sales of $91.8 million for the three months ended June 24, which was below FactSet estimates for $101 million.Same-restaurant sales, a closely watched measure of efficiency for food establishments, fell 49% with traffic down just over 60% during the quarter. The company said it expects third-quarter comparable sales would decline 39%.The company cited a $3.2 million hit to sales “due to nationwide protest activity and resulting curfews causing temporary Shack closures and reduced operating hours.”Shake Shack is set to report full second-quarter earnings results on August 11.—10:01 a.m. ET: Job openings unexpectedly rose in May, hiring rises by a recordJob openings as of the final day of May unexpectedly increased to about 5.4 million, the Bureau of Labor Statistics reported Tuesday, coming in above expectations for a rise to 4.5 million. In April, job openings fell to the lowest level since 2014 at 4.996 million.The number of hires, which includes employees temporarily laid off who returned to work, rose by a record 2.4 million to 6.5 million in May.Separations, which includes layoffs and voluntary quits, fell by 5.8 million to 4.1 million for the largest one-month decrease on record.“These improvements in the labor market reflected a limited resumption of economic activity that had been curtailed in March and April due to the coronavirus pandemic and efforts to contain it,” the BLS said in a statement.—9:32 a.m. ET: Stocks open lowerHere were the main moves in markets, as of 9:32 a.m. ET:S&P 500 (^GSPC): -14.86 points (-0.47%) to 3,164.89Dow (^DJI): -164.88 points (-0.63%) to 26,122.15Nasdaq (^IXIC): -11.84 (-0.06%) to 10,427.74Crude (CL=F): -$0.32 (-0.79%) to $40.31 a barrelGold (GC=F): -$4.20 (-0.23%) to $1,789.30 per ounce10-year Treasury (^TNX): -1.5 bps to yield 0.669%—9:09 a.m. ET: Novavax shares spike more than 30% after announcing $1.6 billion in federal funding for Covid-19 vaccine developmentBiotech company Novavax (NVAX) shares jumped more than 30% in early trading Tuesday after announcing it received $1.6 billion in funding from the US Operation Warp Speed to develop and manufacturing a Covid-19 vaccine.The funding amount is the largest granted so far through Operation Warp Speed, a federal program aimed at fast-tracking the development of a coronavirus vaccine to months rather than years. Other earlier recipients of the funds were companies including AstraZeneca, Moderna and Johnson & JohnsonWith the funds, Novavax is set to begin a late-stage clinical study of its vaccine candidate as soon as this fall, with up to 30,000 subjects. Its phase 1/2 (one-two) trials began in May in Australia, and Novavax expects to have results from this at the end of July. The company is looking to begin delivering 100 million doses for Americans as soon as late 2020.Shares of Novavax were up nearly 1,900% for the year to date through Monday’s close.—7:21 a.m. ET Tuesday: Stock futures drop, Dow futures give back 200+ pointsHere were the main moves in markets, as of 7:21 a.m. ET:S&P 500 futures (ES=F): 3,144.00, down 28 points or 0.88%Dow futures (YM=F): 25,908.00, down 271 points, or 1.04%Nasdaq futures (NQ=F): 10,549.75, down 48.75 points, or 0.46Crude (CL=F): -$0.48 (-1.18%) to $40.15 a barrelGold (GC=F): -$9.90 (-0.55%) to $1,783.60 per ounce10-year Treasury (^TNX): -0.8 bps to yield 0.676%—6:15 p.m. ET Monday: Stock futures edge lowerHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:15 p.m. ET:S&P 500 futures (ES=F): 3,167.75, down 4.25 points or 0.13%Dow futures (YM=F): 26,140.00, down 39 points, or 0.15%Nasdaq futures (NQ=F): 10,598.00, down 0.5 points, or little changedA trader wears a face mask on the floor of the New York Stock Exchange (NYSE) following traders testing positive for Coronavirus disease (COVID-19), in New York, U.S., March 19, 2020. REUTERS/Lucas Jackson—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}