{"article": [{"url": "https://finance.yahoo.com/news/a-business-operating-like-the-white-house-would-be-in-trouble-175655250.html", "published": 1601989460.0, "headline": "A business operating like the White House would be in trouble", "body": "If the White House were a typical business, it would face legal peril for endangering workers and visitors amid the coronavirus pandemic.Guidelines from the Centers for Disease Control call for businesses to allow safe distancing among workers, require face coverings and take other precautions to limit spread of the COVID-19 virus. Washington, D.C., where the White House is located, requires workers and customers to wear masks at every business, while businesses must have a workplace safety plan and allow employees to distance safely.The Trump White House has flagrantly flouted such guidelines, for all the world to see. At the Sept. 26 reception for Supreme Court nominee Amy Coney Barrett in the outdoor Rose Garden, attendees sat elbow-to-elbow, most of them maskless. That event moved indoors, where there was more maskless mingling. And there has never been a formal masking policy in the White House’s work areas, where President Trump himself is the most prominent mask shunner.In this Sept. 26, 2020, photo President Donald Trump, center, stands with Judge Amy Coney Barrett as they arrive for a news conference to announce Barrett as his nominee to the Supreme Court, in the Rose Garden at the White House in Washington. Former New Jersey Gov. Chris Christie watches from fourth row from front on far right. (AP Photo/Alex Brandon)With Trump and at least 30 staffers and associates now testing positive for COVID-19, White House protocols—or lack of them—may meet the standard for recklessness that would make a normal business liable for harm caused to workers or customers. “The White House behaved in a textbook way to open yourself to tort liability,” says professor Heidi Li Feldman of Georgetown University Law Center. “It’s instructive for other American businesses. It’s a good lesson in how not to run your business.”It’s difficult to sue the government, because of the principle of sovereign immunity. But the law does allow suits when the government does something similar to what a private person or organization would do, and there’s harm that would generate liability in the private sector. The Barrett ceremony on Sept. 26 might have been such an event, similar to a promotional event or press conference a corporation might hold.White House employees are ‘on their own’Employees hurt or sickened on the job typically file for workers’ compensation, and it can be difficult to sue for additional damages beyond that. CDC guidelines are voluntary. The White House and other federal agencies must follow rules set by the Occupational Health and Safety Administration—not state or local regulation. But Trump’s OSHA hasn’t established any rules for what government agencies must do to protect workers from COVID, despite calls for it to do so.Story continues“Those White House employees are on their own,” says Debbie Berkowitz, who was a senior OSHA official during the Obama administration and is now a safety expert at the National Employment Law Project. “They probably can’t sue if they get sick or die. This is probably the cleanest example of how this president thinks our essential workers should be treated.”A workers’ compensation claim could still provide some relief to sickened White House employees. “If I got COVID because I worked at the White House, I’d be talking to a lawyer,” Feldman says. “The statistically unusual number of people who got sick looks like you might have a workers comp claim. I would definitely be thinking of filing a claim and if it didn’t cover all expenses, I would look at whether I had any residual rights to bring suit.”A member of the cleaning staff sprays The James Brady Briefing Room of the White House, Monday, Oct. 5, 2020, in Washington. (AP Photo/Alex Brandon)Customers at a business, or other third parties, such as students at a university, have better odds of suing if they can show the business was responsible for harming or making them sick. And there were third parties at the Sept. 26 Barrett event who later contracted COVID, such as two Republican senators, the president of the University of Notre Dame, and former New Jersey Gov. Chris Christie. But there’s footage of all of them without masks, and it’s hard to sue an organization for reckless endangerment if your own personal behavior was also reckless, and you were a voluntary attendee. At least three White House reporters also contracted COVID-19 since the Barrett event.Fourteen states have established new standards to protect workers from COVID, though even in those states, it remains difficult for workers to prove they got infected on the job, rather than elsewhere in the community. Congressional Republicans want to pass legislation giving businesses blanket immunity if workers or customers contract COVID. Democrats insist any liability shield be paired with tough federal standards all businesses in the country must meet to protect workers. This is one of many standoffs preventing Congress from passing a fourth stimulus bill.So far, there doesn’t seem to be an explosion of COVID litigation by workers or consumers against businesses. (Less than a third of Americans say they would sue a business if they were exposed to COVID-19 while visiting the establishment, according to a Yahoo Finance-Harris poll taken in July.) A COVID complaint database run by law firm Hunton Andrews Kurth includes 93 legal complaints for risky work conditions, such as lack of protective gear, and only 5 for death or injury not in a health care facility. A group of workers is suing Amazon for unsafe work conditions that allegedly caused the COVID death of an employee’s family member. Nursing homes are beginning to face lawsuits relating to thousands of COVID deaths.There are over 7.4 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)Businesses that comply with state and local safety regulations typically have strong protection against lawsuits. If there are no state or local rules, complying with CDC guidelines helps—and disregarding them hurts. “Nursing home liability boils down to things they did that were clearly not what the CDC advises,” says lawyer Eric Robbie of Boston law firm CMBG3. “That’s enough for a plaintiff to bring a lawsuit.”If the White House were a business—even an essential one—violating CDC guidance would be a similar risk. “People outdoors, no masks, some instances of not social distancing—those things would weigh in the favor of a potential plaintiff,” Robbie says. “They’re not proof of negligence, but evidence of negligence.” A jury might be the ultimate arbiter—if it weren’t the White House.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Democrats are planning massive stimulus—if Biden winsHow Democrats can save ObamacareTrump’s health care shamTrumpworld is implodingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}