{"article": [{"url": "https://finance.yahoo.com/news/why-the-2020-rally-does-not-look-like-a-bubble-hedge-fund-veteran-115115109.html", "published": 1599029960.0, "headline": "Why the 2020 rally does not look like a bubble: hedge fund veteran", "body": "The stock market (^GSPC) is at record highs, but millions of Americans are struggling and in need of further stimulus as food insecurity and unemployment are still high.This has led many people to comment that the market is “crazy” and not reflective of the country’s economic reality and thus could pop at any time.But Nicholas Colas, co-founder of investment research firm DataTrek, says that because the current rally lacks many of the key ingredients that make a bubble, we’re not in a bubble.Some of the signs are there, the veteran hedge funder pointed out, like retail investors' visible role in the market. Retail investors have powered the rally thanks to Robinhood’s innovations pushing the industry to no-fee commissions — a move that has completely removed the costs of trading, save taxes.Also, tech stocks have driven the market higher — so high in fact that some mutual funds are incapable of adding enough of the stocks due to concentration issues.Another sign: The Fed’s low interest rates are incentivizing people to put money into the S&P 500 — because Treasuries are paying so little. And lastly, a handful of stocks with crazy-high valuations are dominating headlines.Add all of that to the feeling that “prices are too high” and it may smell like a bubble. And it could be, of course — most of the time people don’t really see bubbles until they pop.But in his DataTrek newsletter, Colas points to a few key differences between 2020 and other years, like 2000 and 2007, that make this far more complicated.Some reasons why it’s not bubbleFirst off, bubbles do not usually happen when unemployment is this high — at 10% now, it's still higher than it was during the last crisis.A trader has his head in his hand on the floor of the New York Stock Exchange, Thursday, March 12, 2020. (AP Photo/Richard Drew)\"There is no history of this ever happening before,\" Colas wrote. “When the S&P 500 peaked in October 2007 during the US housing bubble, unemployment was 4.7%.”This is important because when unemployment is low, the government is expected to help out far less. That’s why some of the stock market’s juice comes from Washington.Story continues“What looks like a bubble is really just investors discounting further government action in an election year,” Colas writes.Bubbles, Colas said, often occur when labor force participation is at generational highs, and we are at a generational low because of the coronavirus fallout. Colas called the labor force participation, which is 61.4%, an \"underappreciated\" factor in how investors see corporate earnings power in the future. The high water mark was in 2000 when participation was 67.3%.So what’s actually going on? The theory that many market observers, including Colas, are taking is that the S&P 500 index and its high reflect the future, especially the future of corporate earnings, as forward 12-month EPS ticked up. It has less to do with the current climate of pandemic-induced economic weakness.That doesn’t mean the house can’t come crashing down, of course. The market, Colas wrote, is “priced for predictability related to improvement in corporate profits and economic conditions.”“To our thinking,” he wrote, “it takes more than just frothy Tech/story stocks or Robinhood traders to say US equities are in a bubble that will soon burst.”--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Stock split behavior confuses billionaire and analystsMutual funds have a FAAMG problemNYU professor: Make sure young investors 'don't become addicted' to online stock tradingHow a stock gets added to the Dow Jones Industrial AverageCoronavirus has hurt the credit card businessYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}