{"article": [{"url": "https://finance.yahoo.com/news/scaramucci-jerome-adams-ce-os-join-yahoo-finances-virtual-summit-114736562.html", "published": 1595314520.0, "headline": "Anthony Scaramucci, Jerome Adams, top CEOs offer clarity amid crisis", "body": "The year 2020 has become shorthand for relentless setbacks big and small while the U.S. undergoes overlapping economic, political, and public health crises. As in, there goes 2020 — again.But stock portfolios and ballots cannot wait for the clarity that this fall or even 2021 might afford, especially as initial signs of economic recovery raise a new set of questions.In turn, Yahoo Finance on Tuesday airs a special All Markets Summit Extra: Road to Recovery from 5 to 6:30 p.m. on July 21 ahead of its annual All Markets Summit: Road to Recovery that will take place virtually in October.The special features conversations with executives and experts across American life who can help make sense of this uncertain moment and where it may go from here.Guests include Surgeon General Jerome Adams, former White House Communications Director and SkyBridge Capital founder Anthony Scaramucci, Airbnb CEO Brian Chesky, Carnival CEO Arnold Donald, and Misty Copeland, principal dancer with the American Ballet Theater — all of whom have watched the coronavirus outbreak upend their sectors and put together a blueprint for how to get through it.“Travel has changed forever,” says Chesky, whose company Airbnb suffered hundreds of millions in losses and laid off a quarter of its staff in the aftermath of the outbreak. “We spent 12 years building our business, and within six weeks lost about 80% of it.”But in recent weeks, demand for Airbnb has returned to the same level as last year but with dramatically different booking preferences, Chesky says: “Now, a whole bunch of things are happening.”Yahoo Finance holds a special \"All Markets Summit Extra: Road to Recovery\" from 5 to 6:30 pm on Tuesday. Adams, the surgeon general and one of the top public health officials in the Trump administration, explains why protective masks play a central role in the reopening of the U.S. economy.“The masks actually don't inhibit your freedom. They don't inhibit your choice,” he says. “They enable freedom and enable more choices.”“Because we know that if we can get 90% of people to wear face coverings and get people to practice at least six feet of social distancing from their neighbors and practice good hand hygiene, that we can reopen and then we can stay open,” he adds.Story continuesThe special will also feature appearances from Accenture CEO Julie Sweet; Byron Allen, founder and CEO of Allen Media; Adobe Chief Information Officer Cynthia Stoddard; Mary Mack, senior executive vice president of consumer banking at Wells Fargo; and Ravi Kumar, president of Infosys.Plus, former agriculture secretary Tom Vilsack will discuss the escalating challenge of food insecurity, alongside Claire Babineaux-Fontenot, CEO of Feeding America.“It appears that we're actually going to see food insecurity rates as a result of this pandemic go even higher than they were in the last Great Depression,” Babineaux-Fontenot says. “Which was, at that time, unprecedented.”Read more:Jump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinBusiness leaders fear 'flaming on social media' if they criticize Trump: Fast Company Editor-in-ChiefMichael Dell: ‘Not enough’ progress on diversity in the tech industry‘We may need to quarantine our books' when libraries reopen, New York Public Library CEO saysRead the latest financial and business news from Yahoo Finance"}]}