{"article": [{"url": "https://finance.yahoo.com/news/renters-homeowners-face-new-phase-of-coronavirus-crisis-evictions-172940378.html", "published": 1594384640.0, "headline": "Renters, homeowners face new phase of coronavirus crisis with evictions, foreclosures looming", "body": "A potential housing crisis is on the way for millions of Americans whose mortgage and rent deferrals are about to sunset.Evictions loom as the end of state and local moratoriums will no longer protect homeowners and tenants unable to make payments because of COVID-19 lockdowns. A minority of U.S. states have already expired orders against evictions, and a host of others across the country are set to expire over the next two months.Once they do, residents are facing a possible flood of non-payment legal actions. The COVID-19 Eviction Defense Project (CEDP) predicted recently that by the end of September, more than 20 million U.S. renters —many of them Black and Latino located in big cities — will be at risk for eviction.According to data released on Friday by mortgage tracking firm ATTOM Data Solutions, homeowners most at risk for foreclosures during the second quarter were those in metropolitan markets along the East Coast and in Northern Illinois, with clusters of troubled borrowers in New York City, Chicago, Baltimore and Washington, D.C.“There are millions of Americans now unemployed due to the pandemic with greatly reduced means to keep up on their mortgages,” Todd Teta, ATTOM’s chief product officer, told Yahoo Finance in an email.“At some point, banks are going to need mortgage holders to pay what they owe and go after those who don't,” he added.Leaning foreclosure sign in front of a modern single family home on a cloudy cold dayFederally mandated foreclosure moratoriums were granted to homeowners with government-backed loans when the crisis began, but those will begin to expire on August 31. Until then, the CARES Act prohibits lenders and servicers from initiating or finalizing foreclosure proceedings.Borrowers already facing foreclosure before the measure was put into place are in the most imminent jeopardy, while homeowners with FHA-insured mortgages that are in good standing are eligible for up to a year's worth of delayed payment forbearance, if COVID-19 impacts their ability to continue payments.Story continuesAccording to the Mortgage Bankers Association, among 38.2 million U.S. residential mortgage loans representing 76% of the first mortgage servicing market, about 4.2 million were in forbearance during the week of June 22 to June 28.The number represents all mortgages in the data set that were in forbearance, regardless of whether they were FHA-insured and obtained under the CARES Act. Non-FHA-insured borrowers have no federal right to halt payments based on COVID-19-related financial hardship. However, MBA’s director of Public Affairs Adam DeSanctis told Yahoo Finance that most lenders are offering similar protections to those with private loans.Meanwhile, some states like Delaware have stepped in with even more aggressive measures than the federal government’s. The state’s governor signed an order extending foreclosure moratoriums so long as the state of emergency remains in effect.‘Dozens of calls’For renters, a handful of state and local orders that outlawed evictions against tenants facing COVID-19 hardship have already expired. Idaho, Iowa and Alabama are among a clutch of states that have allowed evictions to resume.Some states — including Arkansas and Georgia (with the exception of Atlanta), never adopted tenant protections, while places like Denver and Massachusetts placed an indefinite ban on evictions.A federal moratorium that protects tenants from eviction from FHA-secured properties expires July 25.Beyond that date, landlords must give tenants 30 days notice before requiring them to vacate the property, making August 25 a key date on which vulnerable Americans could lose their homes. Aside from that federal guideline, tenants of FHA- and non-FHA-secured properties can consult their state and local rules, which vary widely concerning additional time to defer lease payments.However, public housing residents are likely to find greater protections, as their rents are often directly tied to income level — and in some cases can fall as low as $0.Frederick Neustein, a Florida foreclosure attorney, explained there are additional methods for homeowners to further delay getting booted from their homes. With or without a forbearance, he said an aggressive foreclosure defense is key to staying put.“It’s better to defend the foreclosure on the merits of the case because we can hold the bank off for a long long time,” he said. “If a case is not defended very well, a bank can foreclose in 4 to 6 months, versus a good defense that can keep homeowners in their home for 2 to 3 years.”Neustein also said there’s a misconception that foreclosure proceedings have not been going ahead during the pandemic. In the Sunshine State, Governor Ron DeSantis ordered a moratorium on evictions and foreclosures until August 1; but in practice, Neustein said the order only stops law enforcement and judges from finalizing proceedings.“I’m getting dozens of calls every day with clients getting serviced with foreclosure papers,” Neustein said. “Banks are mostly going forward,” he said, though entries for final judgements and sheriff’s sales are being put on hold for the time being.Meanwhile, Neustein said homeowners also often make the mistake of declaring bankruptcy before defending a foreclosure action.“I tell people that's a final last resort because that puts only a temporary stay on any proceedings,” he said. Neustein also recommends that homeowners first make direct contact with their lenders to try to negotiate a coronavirus-related deferral.BROOKLYN, NEW YORK, UNITED STATES - 2020/07/05: Participants hold a #CancelRent banner at the protest. Tenants and Housing Activists gathered at Maria Hernandez Park for a rally and march in the streets of Bushwick, demanding the city administration to cancel rent immediately as the financial situation for many New Yorkers remains the same, strapped for cash and out of work. (Photo by Erik McGregor/LightRocket via Getty Images)Roughly 40% of borrowers in forbearance posted payment for April, but that share declined to 28% for May, the MBA’s DeSanctis said. However, he pointed out that requests for forbearances had dropped sharply between March and June, and that the number of loans in forbearance decreased during the week ending June 28 by 8 basis points relative to the prior week, from 8.47% to 8.39%.That same week, the number of loans in forbearance extensions increased from 17% to 26%. Additional questions remain over whether the number of initial requests will rise in states that waited longer to impose shutdown orders.And those who can afford to purchase a home are coming out in droves. Last week, historically low interest rates fueled a spike in mortgage applications for home purchases.ATTOM’s Teta said it should become more clear how deeply the pandemic fallout is affecting homeowners once moratoriums are lifted, with foreclosures almost sure to jump this year and into 2021.“Once we see these forbearances end, we are expecting a huge wave,” Neustein said.Alexis Keenan is a reporter for Yahoo Finance. Follow on Twitter @alexiskweed.[Click the following links for more of Yahoo Finance’s coronavirus coverage: Personal finance tips, news, policy, graphics & more from Yahoo Finance]Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news."}]}