{"article": [{"url": "https://finance.yahoo.com/news/americans-buying-rabid-pro-trump-conspiracy-theories-120653906-180250093.html", "published": 1593695420.0, "headline": "QAnon: Why rabid pro-Trump conspiracy theories keep gaining steam", "body": "A conspiratorial pro-Trump subculture known as QAnon is lurking in mainstream American society while spreading baseless accusations against prominent people in politics, business, and culture.The internet-fueled movement began gaining traction with some of the president’s supporters back in 2017 and has slowly grown to the point where QAnon-supporting politicians are being elected. More generally, the FBI describes “conspiracy theory-driven domestic extremists” as a growing threat.And while President Trump has not outwardly supported QAnon, he has retweeted its conspiracy theories on multiple occasions (while his son, Eric, posted and then deleted a QAnon graphic on Instagram ahead of Trump’s campaign rally in Tulsa, Oklahoma). Trump’s supporters, though, have been more vocal about it.Eric Trump posting a QAnon graphic on Instagram pic.twitter.com/4U7QX1MIlr— Jared Holt (@jaredlholt) June 20, 2020“Trump supporters’ fixation on QAnon shows that they really don’t feel like they’re winning, even as they hold the reins of power,” Paul Musgrave, an assistant professor at the University of Massachusetts Amherst, wrote in the Washington Post. “The mystique of QAnon is yet another example of how Trumpism is built on the politics of resentment.”Conspiracy theories ‘fill an important psychological role for many people’QAnon began with “Q,” a persona claiming to be someone within the government, promising to expose how dark forces are working against Trump and his administration. The “Anon” part comes from Q’s readers, who decipher Q’s “clues” on message boards and build outlandish interpretations. Posters named “Q” have been instigating unfounded theories on social networks including 4Chan, 8Chan, and Reddit.“[Conspiracy theories] like this fill an important psychological role for many people,” Thomas J. Wood, an assistant professor of Political Science at Ohio State University who has studied how conspiracy theories gain public support, told Yahoo Finance. “It tends to sway those who have chronic anxiety and feel disaffected by politics by providing a symbolic and intuitive story for them.”Story continuesA Q-Anon supporter during a protest at the State Capitol in Salem, Oregon, United States on May 2, 2020. (Photo by John Rudoff/Anadolu Agency via Getty Images)Previous research, summarized by the New York Times, has found that people who believe in conspiracy theories “are more likely to be cynical about the world in general and politics in particular. Conspiracy theories also seem to be more compelling to those with low self-worth, especially with regard to their sense of agency in the world at large. Conspiracy theories appear to be a way of reacting to uncertainty and powerlessness.”The movement has reached the point where politicians openly supporting QAnon are being elected: Lauren Boebert won the Republican congressional primary for her Colorado district despite her opponent being an incumbent backed by Trump. Boebert has spoken positively of QAnon, stating: “I hope that this is real because it only means America is getting stronger and better, and people are returning to conservative values, and that’s what I am for. ... If this is real, then it could be really great for our country.”Conspiracy theorist QAnon demonstrators protest during a rally to re-open California and against Stay-At-Home directives on May 1, 2020 in San Diego, California. (Photo by SANDY HUFFAKER/AFP via Getty Images)Another notable candidate is Marjorie Taylor Greene, who will face John Cowan in a primary runoff for a Georgia congressional seat on Aug. 11. Back in 2017, Green described “Q” as “a patriot.”“He is someone that very much loves his country, and he’s on the same page as us, and he is very pro-Trump,” Greene said. “I’m very excited about that now there’s a once-in-a-lifetime opportunity to take this global cabal of Satan-worshipping pedophiles out, and I think we have the president to do it.”‘A collective populous moving further away from critical thinking’Much of the traction stems from a distrust in the media and the government. QAnon appears to be an evolution of Pizzagate, the internet conspiracy theory that led one man to bring a gun to a pizza shop because he thought there were child slaves in the basement.Wood said there’s always a chance of unfounded allegations like these picking up steam and spilling into the mainstream, which happened with Pizzagate or Obama birtherism (i.e., the notion that the former president was born outside of the U.S.).QAnon supporters are convinced that the government is working against Trump and his administration. REUTERS/Leah MillisSocial media plays a major role in it as well. A viral conspiracy theory about Justin Bieber being a victim of Pizzagate went viral recently on TikTok, a video app popular among young adults. And private Facebook groups are reportedly becoming a new haven for QAnon supporters to share their conspiracy theories with each other.Based on Wood’s research, groups like QAnon rely on the attention they receive from the public, particularly the media: “For the theory to cross over and gain mainstream currency, it can’t just exist in the pockets of a chatroom,” he said.‘It will continue to happen’The conditions that created QAnon will continue to exist for the foreseeable future.A Donald Trump supporter holding a QAnon flag visits Mount Rushmore National Monument on July 01, 2020 in Keystone, South Dakota. (Photo by Scott Olson/Getty Images)“We live in a free society and in that, people are allowed to offer their opinions, regardless of whether or not they’re music to our ears,” Ryan McCormick, co-founder and media relations specialist of Goldman McCormick Public Relations, told Yahoo Finance. “It’s a part of our culture and it will continue to happen.”Consequently, various parts of American society — including businesses, social media platforms, the voting public, and the press — may find themselves seeing internet-fueled conspiracy campaigns like QAnon going into midterm elections and beyond.Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Immigrants actually help Americans get better jobs, study findsTrump administration 'doubled down on' converting private land for border wall amid coronavirus pandemicTrump's drug czar makes case for border wall being 'a force multiplier'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}