{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-moderna-starts-next-vaccine-phase-as-crisis-grows-for-florida-185009261.html", "published": 1595858300.0, "headline": "Coronavirus update: Moderna starts next vaccine phase as crisis grows for FL, CA", "body": "Florida and California entrenched their status as epicenters of the U.S.’s coronavirus crisis, with both states hammered by rising COVID-19 cases that exceed New York, formerly the domestic leader in infections.As the outbreak continues to hamper reopening efforts nationwide, the outbreak in the Sun Belt region has been supercharged by the Sunshine and Golden States. The rising stakes have spotlighted the increasingly urgent search for an effective coronavirus vaccine, which entered a new phase on Monday as biotech upstart Moderna began a Phase 3 human trial, with the help of funding from the U.S. government.With Congress and the White House debating the outline of a new stimulus package that is expected to cost another $1 trillion, the crisis hit close to home as President Donald Trump’s National Security Advisor, Robert O’Brien was revealed on Monday to have tested positive for the virus.Meanwhile, World Health Organization director Tedros Adhanom Ghebreyesus is reconvening an emergency committee later this week to evaluate the pandemic — the sixth ever in the organization’s history— and the need to continue the public health emergency status of the coronavirus outbreak.\"When I declared a public health emergency of international concern on the 30th of January – the highest level of alarm under international law – there were less than 100 COVID-19 cases outside of China, and no deaths,” Ghebreyesus said Monday during a media briefing.Now, cases across the world have surpassed 16 million — a number that doubled in just six weeks, according to WHO data.Cases are surging in countries like China and Argentina. (Graphic: David Foster/Yahoo Finance)Vaccine race heats upThe global vaccine race passed a milestone on Monday, with Moderna (MRNA) entering into the third phase of clinical trials, and Johnson & Johnson (JNJ) beginning the first phase for its candidate.Globally, other candidates are further along, including China’s candidates with CanSino and Sinopharm, as well as the U.K. with Oxford University’s vaccine — in partnership with AstraZeneca (AZN).Story continuesModerna’s trial was boosted by a new round of $472 million in federal funding to test the 100 microgram two-shot vaccine dose on 30,000 participants. CEO Stéphane Bancel told Yahoo Finance Monday the company had considered a 10,000-person Phase 3 in April, before the additional funding.Currently, federal support for Moderna is now close to $1 billion. But the record-holder remains Novavax (NVAX), which received $1.6 billion in addition to $60 million from the Department of Defense.The need for a vaccine will dictate the global economy’s effort to return to some level of normalcy, especially as developing countries struggle to battle the outbreak. The need for billions of doses — including the manufacturing, transporting and delivery— are all looming obstacles for companies responding to the challenge.Additionally, shortages of necessary equipment persist in the U.S., including personal protective gear, testing supplies, as well as household items like disinfectants, wipes and hand sanitizer.The U.S. Food and Drug Administration (FDA) released a new warning Monday to highlight makeshift hand sanitizers finding their way on the market, despite including dangerous chemicals like methanol.“Methanol is not an acceptable ingredient for hand sanitizers and must not be used due to its toxic effects,” the FDA said in a statement. The regulatory body previously warned against such products in early July.And with cases surging in various parts of the U.S., remote working remains the norm across Corporate America. On Monday, Google announced its voluntary return to work program will be extended until June 30 of next year, according to a memo from CEO Sundar Pichai. The company has already reopened several offices worldwide, especially in countries that have successfully reopened.Separately, Major League Baseball (MLB) postponed two games Monday due to players and coaches on some teams testing positive for COVID-19. The league had just started the modified season late last week, with hopes to complete the shortened season.Yahoo Finance’s The Market Wake-UpAnjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}