{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-17-2020-223005390.html", "published": 1600356260.0, "headline": "Stock market news live updates: Tech stocks drag Nasdaq to worst day in 5; Dow snaps 4-day win streak", "body": "Stocks ended Thursday’s session sharply lower, with selling pressure on tech stocks dragging down the broader market, as caution returned to the market in the wake of the Federal Reserve’s decision to keep monetary policy loose for the immediate future, and new data suggested the rebound was losing momentum.Investors continued to jettison big tech stocks like Amazon (AMZN), Facebook (FB) and Apple (AAPL), souring market sentiment and pushing the Nasdaq to its worst day in 5 sessions. Tech newcomers Snowflake (SNOW) and JFrog (FROG) also closed lower, amid a flood of initial public offerings (IPO) that traders are snapping up with abandon.The Dow also snapped a 4-day winning streak, reflecting how investors — who have bid up stocks relentlessly since late spring — are now rethinking prospects for a sharp economic rebound in the wake of a still raging COVID-19 pandemic and no immediate fiscal boost on the table.Along those lines, another 860,000 workers filed unemployment claims in the latest period, but that figure remained below 1 million for a third straight week. In a partly encouraging sign, continuing claims — a closely watched metric of the labor market’s health in real time — fell below 13 million.However, new housing starts fell sharply last month, new data showed, a worrying harbinger that a hot housing market could be cooling despite record low interest rates.On Wednesday, the Fed signaled that near-zero interest rates would remain for at least the next three years, as the US economy continues to face risks around the ongoing pandemic. The Federal Open Market Committee’s newly issued expectation for interest rates to remain near zero until at least the end of 2023.Fed officials upgraded their economic projections for this year, and now anticipate a shallower decline in real GDP and a lower unemployment rate by year-end versus their early-summer projections. Still, officials suggested that the quicker-than-expected early economic recovery could be jeopardized in absence of further fiscal stimulus.Story continues“The fiscal policy actions that have been taken thus far have made a critical difference to families, businesses, and communities across the country. Even so, the current economic downturn is the most severe in our lifetimes,” Fed Chair Jerome Powell said in remarks Wednesday.“It will take a while to get back to the levels of economic activity and employment that prevailed at the beginning of this year, and it may take continued support from both monetary and fiscal policy to achieve that,” the central banker added.Prospects of further support from Congress before the November presidential elections remain dim, however, especially after the Senate failed last week to advance another coronavirus relief package.“With U.S. interest rates locked at record lows for years into the future and the Fed holding back on incremental QE measures, the recovery path from here will depend on vaccine progress, virus dynamics, fiscal support, and presidential election politics,” said Mark Haefele, chief investment officer at UBS Global Wealth Management.“Our base case is continued reopening momentum, widespread vaccine availability by 2Q21, and an eventual compromise deal on US fiscal stimulus. The U.S. presidential contest may kick up some near-term volatility before its eventual resolution,” he added.The expiration of the federal enhanced unemployment benefits has left tens of millions of Americans put out of work during the pandemic without additional support, with the lapse of these benefits expected to weigh on consumer spending and economic activity as a whole. The Commerce Department on Wednesday reported that retail sales growth slowed for a fourth straight month in August.—4:03 p.m. ET: Tech selling drags Nasdaq down in worst day in 5 sessions as Dow snaps 4-day winning streakHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -28.48 (-0.84%) to 3,357.01Dow (^DJI): -130.40 (-0.47%) to 27,901.98Nasdaq (^IXIC): -140.19 (-1.27%) to 10,910.28Crude (CL=F): +$0.87 (+2.17%) to $41.03 a barrelGold (GC=F): -$15.60 (-0.79%) to $1,954.90 per ounce10-year Treasury (^TNX): -0.3 bps to yield 0.6840%—2:05 p.m. ET: Bloomberg says TikTok/Oracle venture plans IPO within a yearReuters and Bloomberg report that the TikTok saga may end with the embattled viral video platform tapping the market in 2021. Citing people familiar with the matter, the new U.S. company that TikTok’s owner Bytedance Ltd.plans to form with Oracle intends to hold an initial public offering in about a year.—2:00 p.m. ET: AmWell IPO shines as market absorbs flood of new offeringsAmerican Well Corp. (AMWL), began trading Thursday in a long-awaited move that may help boost competition in the increasingly hot telehealth market, and rides a wave of growing enthusiasm for virtual doctor visits that swelled during the COVID-19 pandemic.AmWell’s stock opened at $25 per share, well above the initial public offering (IPO) of $18 and up nearly 40% on the day. AmWell is backed by Google, as well as pharmaceutical company Teva. Another health stock, Dyne Therapeutics (DYN), also jumped in its market debut.But elsewhere, newly public tech companies Snowflake (SNOW) and JFrog (FROG) each retraced after surging in their public debuts, as investors digested a fresh set of high-growth software names.—Noon ET: ‘Spooked’ stocks stay in the redHere were the main moves in markets as of 12:00 p.m. ET:S&P 500 (^GSPC): 3,350.80, -34.69 (-1.02%)Dow (^DJI): 27,902.50, -129.88 (-0.46%)Nasdaq (^IXIC): 10,871.92, -178.55 (-1.62%)Crude (CL=F): $40.88, +0.72 (+1.79%)Gold (GC=F): $1,951.40 per ounce, -$19.10 (-0.97%)10-year Treasury (^TNX): -0.03 bps to yield 0.656%Tim Courtney, CIO of Excencial Wealth Advisors, told Yahoo Finance in an interview that Thursday’s price action reflected “spooked” investors in a market that was priced for a rapid, ‘V-shaped’ recovery. However, that trajectory hasn’t materialized yet, and some worry that stocks have come too far, too fast.—11:15 a.m. ET: Stocks pare losses in volatile tradingWall Street is having a whipsaw day, with the Dow turning positive after opening with triple-digit losses. Tech stocks are still heavy, but have also pulled back from the session’s lows.“It's time to buy the stock dips, but be careful,” warned Greg Swenson, founding partner of Brigg Macadam, a London-based investment bank. “There has been such a huge stock rally in recent months that buying the dips can be dangerous.”—10:20 a.m. Oracle eyes 20% stake in TikTok as Trump said to rule on the dealAccording to CNBC, Oracle (ORCL) is going to own roughly 20% of the new TikTok entity, with Walmart (WMT) still in the fray. In keeping with a national security maneuver, President Trump is expected to rule on TikTok in the next 24-36 hours, reported CNBC, citing people familiar with the matter.—10:00 a.m. ET: New Jersey eyes millionaire taxWith cities and states reeling from the tax revenue hit of the coronavirus pandemic, New Jersey is moving quickly to fill its gap. The state — which has been mulling a tax on financial transactions that drew the ire of the NYSE — has agreed on a budget that will tax over 36,000 millionaires that reside in New Jersey. It’s a test of the COVID-19 era’s approach to compensating for deteriorating fiscal balances — but it remains to be seen whether the wealthy will stick around to pay the bill.—9:30 a.m ET: Stocks open to the downsideHere were the main moves in markets as of 9:30 a.m. ET:S&P 500 (^GSPC): 3,332.59, -52.90 (-1.56%)Dow (^DJI): 27,681.27,-351.11 (-1.25%)Nasdaq (^IXIC): 10,834.97, -215.50 (-1.95%)Crude (CL=F): $39.89 per barrel, -$0.27 (-0.67%)Gold (GC=F): $1,941.70 per ounce, -$28.80 (-1.46%)10-year Treasury (^TNX): -0.03 bps to yield 0.656%—9:00 a.m. ET: Housing starts slump in AugustA hot housing market is showing signs of cooling off, as the Commerce Department reported that Americans broke ground on fewer houses last month.Housing starts dropped 5.1% to a seasonally adjusted annual rate of 1.416 million units last month, while July’s data was revised slightly lower to a 1.492 million-unit pace from the previously reported 1.496 million.—8:30 a.m ET: Jobless claims stay below 1 millionThe ranks of jobless Americans grew yet again last week, with 860,000 first-time unemployment benefits filed last week. The number rose slightly from the prior week’s level, but stayed below 1 million for the 3rd consecutive week. In a more encouraging sign, continued claims dipped below 13 million. Stock futures are still indicating a rough day on Wall Street, with benchmarks off by over 1%.—8:00 a.m. ET Thursday: Futures slump as jobless claims loomHere were the main moves in equity markets, as of 6:17 p.m. ET Wednesday:S&P 500 futures (ES=F): 3,346.75, -42.75 (-1.26%)Dow futures (YM=F): 27,811.00, -243.00 (-0.87%)Nasdaq futures (NQ=F): 11,047.25, -221.50 (-1.97%)—6:17 p.m. ET Wednesday: Stock futures open slightly higherHere were the main moves in equity markets, as of 6:17 p.m. ET Wednesday:S&P 500 futures (ES=F): 3,395.00, up 5.5 points or 0.16%Dow futures (YM=F): 28,099.00, up 45 points or 0.16%Nasdaq futures (NQ=F): 11,292.75, up 24 points, or 0.21%Traders work on the floor at the New York Stock Exchange (NYSE) in New York, U.S., October 30, 2019. REUTERS/Brendan McDermid—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}