{"article": [{"url": "https://finance.yahoo.com/news/labor-market-at-inflection-point-shifting-from-degrees-to-skills-infosys-president-010152450.html", "published": 1595362160.0, "headline": "Labor market at 'inflection point' shifting 'from degrees to skills': Infosys President", "body": "The digital transformation accelerated by the coronavirus marks an “inflection point” that will fundamentally shift labor market dynamics, according to Infosys (INFY) President Ravi Kumar.Speaking at Yahoo Finance’s All Markets Summit Extra, the executive from one of India’s largest IT services company said the new emphasis on remote working will lead to a more inclusive workforce that prioritizes “skills over degrees,” in part because employers will have a larger pool to recruit from.Read more: Coronavirus: How to find a job in a tough economy“There’s never been a time before where enterprises are going to change on all three dimensions: work, workplace, and workforce,” Kumar said. “Work is going to become very modular, workplaces are going to become very hybrid, and workforces are going to become people plus [gig-workers]. Because work is very modular you could take it across to different parts of the world you could split it into small components.”The Infosys logo is seen at the SIBOS banking and financial conference in Toronto, Ontario, Canada October 19, 2017. Picture taken October 19, 2017. REUTERS/Chris HelgrenThe sudden stay-at-home orders brought on by the covid-19 pandemic have prompted companies to quickly adapt to remote working. Tech companies including Facebook (FB) and Twitter (TWTR) have been at the forefront of the moves, opting for a more permanent shift to work from home. In a recent survey by Cushman and Wakefield, 73% of respondents said they expected their companies to embrace long-term or permanent flexible working policies.Kumar says that flexible workspace will not only push employees out of major city centers like New York and San Francisco, but bring prospective employees priced out of those markets, back into the recruitment pool, expanding opportunities.As employers seek to expand their pool of candidates, gig-workers with the most flexible schedules and the skill sets most matching the jobs are most likely to emerge as the biggest winners, even without a traditional university degree.“In the United States 40 million people have lost jobs, 70% of the people who have lost jobs do not have an undergraduate degree. They either have a high school or associate degree,” Kumar said. “I believe this is an inflection point where we will move from degrees to skills. Just before the pandemic, the change was gradual. You will now find this to be sudden.”Story continuesThe transition into a hybrid workplace, which Kumar calls the “new equilibrium,” will require retraining newly displaced workers on a large scale. Specifically, he stressed the need to adapt to a shift towards automation and artificial intelligence, citing a World Economic Forum study that pointed 133 million new jobs that are likely to be created as a result of emerging technology. That same study highlighted 75 million existing jobs that are likely to be lost to automation.“We have a choice to either reset back to the past or the future. If we decide to reset it to the future we need a radical rescaling or a chain of learning. Radical rescaling starts from evaluation of skills to finding the pathways to online training to hand holding and apprenticeship,” Kumar said. “Machines and AI, being a part of workplaces was always happening for the last few years. This pandemic is going to actually accelerate the embrace of machines and AI software into workplaces.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita‘China’s goal is to replace you’: Barr warns leaders of America’s biggest businesses‘An unprecedented case”: What a U.S. TikTok ban would look likeFormer Trump trade adviser: Covid-19 disruption and USMCA ‘provides an opportunity’ to bring supply chains back to North America"}]}