{"article": [{"url": "https://finance.yahoo.com/news/how-biden-would-undo-the-trump-tax-cuts-170858098.html", "published": 1599295940.0, "headline": "How Biden would undo the Trump tax cuts", "body": "Democratic presidential nominee Joe Biden says that, if elected president, he would seek to repeal most of the 2017 Trump tax cuts. But which ones?It’s a source of some confusion. Conservative news sites are circulating a remark Biden made in South Carolina in 2019, saying, “first thing I’d do is repeal those Trump tax cuts.” Some voters think Biden means he would kill all of the Trump tax cuts, including modest cuts for middle- and lower-income workers. But Biden says now his tax plans would only raise taxes on people earning $400,000 or more.“Joe Biden's tax plan does not raise taxes on anyone under $400,000,” senior campaign advisor Jared Bernstein told Yahoo Finance recently. “We worked very hard to craft the tax plan to make sure that we hew very closely and don't allow that promise to be broken at all.”There are other parts of the Trump tax cuts, passed in 2017, that Biden would modify but not repeal completely. Trump cut the business tax rate from 35% to 21%. Biden would raise it, but only to 28%. There would also be a few new benefits, such as an earned-income tax credit for older workers without kids and a tax credit for child care expenses.Democratic presidential candidate former Vice President Joe Biden speaks at campaign event at Mill 19 in Pittsburgh, Pa., Monday, Aug. 31, 2020. (AP Photo/Carolyn Kaster)On individual tax rates, Biden wants to raise the top tax rate from 37% to the old rate of 39.6%, the level before Trump cut it in 2017. For people with incomes of $1 million or more, Biden would also tax capital gains at the labor-income rate, 39.6%, up from the 20% rate that now applies to higher earners. There would be other taxes on the wealthy, but Biden would keep individual brackets and capital gains rates where they are now for everybody else.Trump says Biden has “pledged a $4 trillion tax hike on almost all American families, which would totally collapse our rapidly improving economy.” The price tag is in the ballpark, but the hit to most American families is wrong. The only possible impact on middle-class incomes is a trickle-down effect from raising the corporate tax rate. In a detailed analysis, the Tax Policy Center found raising the corporate rate would have a slight negative impact on worker incomes over time. That would reduce the typical middle-class income by $330 per year, or $27.50 per month. The top 20% of earners, by contrast, would pay an additional $18,620 in tax, and the top 1% would pay an extra $295,240.Story continuesMost Americans don’t even think the Trump tax cuts saved them money. Only about 42% of middle-income taxpayers think they got a tax cut from the 2017 law, when in reality about 82% did. Americans probably didn’t notice because the savings were small for ordinary workers earning most or all of their income through labor. A typical middle-income worker saved about $780 per year from Trump’s tax cuts, or $65 per month, according to the Tax Policy Center. Business owners saved more, even if their incomes weren’t high, because of the large business-tax reduction. The top 20% of earners saved $5,790 in lower taxes from the Trump law, while the top 1% saved $32,650.Democratic presidential candidate former Vice President Joe Biden and his wife Jill Biden walks from the stage during the fourth day of the Democratic National Convention, Thursday, Aug. 20, 2020, at the Chase Center in Wilmington, Del. (AP Photo/Andrew Harnik)While negotiating the law in 2017, White House economists argued that the Trump tax cuts would boost middle-class incomes by $4,000 per year, and that the loss of federal tax revenue would be more than offset by a surge in business activity that generated even more tax revenue. There’s been no sign either of those things happened, and the federal budget deficit was soaring even before the coronavirus pandemic exploded in March. That suggests businesses and wealthy taxpayers were pocketing gains in tax savings without doing anything that triggered growth more broadly.Biden doesn’t want to raise taxes just for the sake of it. Each tax hike is aligned with a plan to spend more federal revenue on programs such as an accelerated shift to green energy, more aid for college students, and more affordable housing. Bernstein suggests Biden would only push for those programs once the coronavirus is under control and Congress has passed all the stimulus needed to get the economy back on track. That could make tax hikes a Year 2 or even Year 3 priority in a Biden administration. And no tax hikes are likely if Republicans keep control of the Senate—or Trump wins in November.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:5 campaign promises Trump has given up onThe Trump campaign’s bogus boom timesWhy Trump wants to shackle the postal service11 ways Trump is out of touch with votersEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}