{"article": [{"url": "https://finance.yahoo.com/news/devos-sued-borrower-defense-202026199.html", "published": 1594826900.0, "headline": "'They rigged the system': DeVos sued by California and Massachusetts attorneys general over troubled borrower defense rule", "body": "Attorneys general of 23 states, led by California and Massachusetts, are suing Education Secretary Betsy DeVos over her revision of an Obama-era rule that was meant to help defrauded students of for-profit colleges seek debt relief.“Once again, it shouldn't surprise you,” California AG Xavier Becerra said on a call with reporters. “It's sort of a bad old B-movie again. The Department of Education, Secretary DeVos didn't follow the rules in trying to promulgate this new rule — they didn't follow the administrative procedures act requirements.”The lawsuit, filed in the U.S. District Court for the Northern District of California, argues that the Education Department (ED)’s decision to repeal the Obama-era regulations “violates the Administrative Procedure Act (APA)” and also asked the court to “require ED to reimplement the Obama-era processes and protections.”Becerra added that the ED actions under DeVos “are arbitrary and capricious … they rigged the system against students, flat and simple — they rigged the system.”The Department of Education provided the following comment: “This is yet another grandstanding, politically driven lawsuit meant to grab a cheap headline, and the media seems to always oblige. To any objective observer, our borrower defense rule clearly protects students from fraud, ensures they are entitled to financial relief if they suffered harm and holds schools accountable.”U.S. Secretary of Education Betsy DeVos speaks during a White House Coronavirus Task Force press briefing at the U.S. Department of Education July 8, 2020. (PHOTO: Alex Wong/Getty Images)History of borrower defenseUnder existing law, borrowers with federal loans are eligible for loan forgiveness if a college or a university has misled them or engaged in other misconduct in violation of certain state laws.In 2015, after several for-profit colleges went extinct amid scandals, the Obama administration implemented regulations such that defrauded students who made a successful claim would be granted full debt relief.Becerra had previously sued DeVos in December 2017, pushing DeVos to grant promised loan relief to students who attended the now-defunct Corinthian Colleges.Story continuesDeVos modified the Obama-era rule in 2019, making it tougher to access relief and alleging that the Obama administration “weaponized” the policy.“When borrower defense arrived in 1995, it ... was little used… in the 20 years from 1995 to 2015, fewer than 60 claims were filed,” she said during a previous hearing in front of the House Committee on Education and Labor. “Then the previous administration weaponized the regulation against schools it simply didn’t like. They applied the law in a discriminatory fashion. So since 2015, there has been a 5,000% increase in borrower defense claims.”U.S. President Donald Trump sas Secretary of Education Betsy DeVos and Secretary of Agriculture Sonny Perdue look on during a briefing on the coronavirus pandemic in the press briefing room of the White House on March 27, 2020 in Washington, DC. (Photo by Drew Angerer/Getty Images)‘Arbitrary and capricious’The DeVos-led rule change has been in effect since July 1. Congress tried to stop the change but that effort failed after President Trump vetoed the reversal on June 28 and the resulting Congressional vote failed to overrule the veto.The new lawsuit argues that the new rule is not only “arbitrary and capricious” but also doesn’t “comply with Congress’s requirement that the Secretary implement a meaningful process for borrowers to obtain relief.”The attorneys general also cited a document published by ED in the federal register in September 2019 that showed how exactly the DeVos policy tightens debt relief: For every 100 students who applied for debt relief through this program for their loans, only four qualified.Comparing the Obama rule (Nov. 2016) to the DeVos (Feb. 2018) rule, looking at the percentage of loan volume that’s associated with “approved defense to repayment applications,” it was 42.4% to 4.95%.This isn’t the first lawsuit against DeVos on borrower defense. The most recent one targets the “Partial Relief Rule,” a rule implemented by ED in December 2019.—Aarthi is a reporter for Yahoo Finance covering consumer finance and education. Follow her on Twitter @aarthiswami. If you attended a for-profit college and would like to share your experience, reach out to her at aarthi@yahoofinance.comRead more:'They stole my time’: For-profit college students share horror storiesHEROES Act would cancel $10,000 in student debt for ‘economically distressed’ borrowersRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}