{"article": [{"url": "https://finance.yahoo.com/news/virtual-reality-meeting-startup-vir-bela-posts-260-growth-amid-pandemic-and-potential-spinoff-141226592.html", "published": 1597483220.0, "headline": "Virtual reality meeting startup VirBELA posts 260% growth amid COVID-19 pandemic and potential spinoff", "body": "It’s no secret that any company linked to virtual connection during the coronavirus pandemic has enjoyed a boost. Video conferencing company Zoom Video Communications (ZM), for example, has seen its stock more than triple this year despite the fact the overall market has mostly traded sideways.And yet, for anyone who has mostly been interacting with co-workers and friends through video chat amid the pandemic, it’s easy to feel like there is still something missing in the way we interact.At least that’s the problem virtual reality interaction startup VirBELA has found success in solving. The company that developed a Sims-like virtual world with controllable and personalized avatars has seen business explode by offering virtual venues for meetings, conferences, and concerts. In the second quarter, its publicly traded parent company eXp World Holdings (EXPI) revealed VirBELA saw a 260% increase in revenue and a quintupling of monthly active users.“It’s been a really fast rocket ride in a very short period of time,” eXp World Holdings founder and largest shareholder Glenn Sanford told Yahoo Finance’s YFi PM. “We've launched almost 30 private campuses, so these are generally organizations that want to have their own private space to actually have their employees ... working entirely through the virtual campus.”Virtual Reality meeting startup VirBELA has seen has seen a 260% increase in revenue and a 5X increase in monthly active users amid the pandemicAs people turn to their world, I'll chat with the CEO of VirBELA's public parent company on @YahooFinance for what it says about ours pic.twitter.com/YWXHMm33mx— Zack Guzman (@zGuz) August 12, 2020VirBELA, which eXp acquired in 2018, has grown its own employee count from 20 employees at the start of the year to 105, as of August, to keep up with client demand. Sanford says requests have grown from mainly virtual corporate campuses to virtual school programs like its latest partnership with Stanford’s Graduate School of Business, or more social events like concerts put on through its partner Event Farm.Story continues“They've had three live concerts going on simultaneously on the same campus where people would go by avatar concert to concert,” Sanford explains.Overall, having to move your avatar around in the virtual world feels more like a video game, enabling more spontaneous run-ins with coworkers that enable the kind of random water cooler conversations we might be more accustomed to in everyday life. Moving farther away from another avatar, for example, makes it impossible to hear them. Walking by a conversation allows for some interesting eavesdropping. Both are things that can’t quite be replaced by a Zoom call, and could explain why VirBELA seems to be attracting so many new users.“We've introduced live web cam and screen sharing so you can get a Zoom-like experience if you want to,” Sanford said. “But for the most part, people are using it as avatar to avatar.”Interestingly, VirBELA sits inside eXp World Holdings, a public holding company for the venture Sanford originally founded in eXp Realty, a real estate brokerage that offers cloud-based internet marketing technology to help realtors find, buy or sell homes without a brick and mortar office. Sanford told Yahoo Finance he’s held talks to explore spinning off the quickly growing VirBELA team to capitalize on investor interest in virtual communication due to the pandemic.“Obviously a real estate brokerage and a virtual world for business platform are two disparate type of business models, so different types of investors and shareholders,” he said. “We’ve had conversations [about a spinoff] we’re probably talking six to nine months to be able to build all of that out if we go that direction.”Earlier this month, eXp reported $8.3 million in net income for its second quarter ended June 30, compared to a net loss of $2.2 million in the same year-ago period. In the update eXp gave to investors, the company noted that recent adoption by the events industry is driving new use and increased awareness.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:This $3 billion online education company is seeing a 'paradigm shift' due to coronavirusNetflix co-founder brushes off NBC's new Peacock streaming competitorSmall US towns are neglected from coronavirus relief and it's a 'slap in the face': Georgia mayorWhy Costco could see a lasting boost from coronavirus panic buying"}]}