{"article": [{"url": "https://finance.yahoo.com/news/player-activism-the-status-quo-moving-forward-former-miami-heat-star-chris-bosh-223529392.html", "published": 1602265400.0, "headline": "Player activism is 'the status quo moving forward': Former Miami Heat star Chris Bosh", "body": "Former Miami Heat star Chris Bosh had never been one to wade deep into politics. As an NBA player, he characterized politics as “more heavier than religion.”Yet, as the Los Angeles Lakers and Miami Heat look to close out a remarkable 2019-2020 season defined by social activism, the two-time NBA champion is imploring athletes to keep their movement for racial equality going.“I'm really proud of the guys for standing up and speaking on causes, and making things happen. But like I always say, that's the beginning,” Bosh said. “You know, now it's on all of us to continue the conversations, to continue the work that we're doing. And make sure that this is pretty much the status quo moving forward.”There’s been nothing normal about the 2019-2020 NBA season. From a preseason that began with Chinese uproar over a Daryl Morrey tweet, to the tragic death of Kobe Bryant, and a pandemic that pushed players into a Florida bubble, the league has been tasked with adapting to crisis at every level.But, the police shooting of Jacob Blake in Kenosha, Wisconsin, this summer put basketball at the forefront of a national conversation on race and the Black Lives Matter movement. Milwaukee Bucks players led a three-day, league-wide protest that brought the NBA playoffs to a halt. Other sports leagues, including the MLB and NHL, followed.Former Miami Heat player Chris Bosh reacts after being introduced at the team's retirement of his jersey at halftime of an NBA game between the Heat and the Orlando Magic, Tuesday, March 26, 2019, in Miami. Bosh played 13 seasons, the first seven in Toronto and the last six in Miami. He averaged 19.2 points and 8.5 rebounds, was an All-Star 11 times and won two championships.(AP Photo/Joe Skipper)The move prompted the NBA and its players to establish a coalition to promote civic engagement and advocate for police and criminal justice reform, while individual franchises committed to turning their sports arenas into polling sites for the November 3 general election.“It’s just reached a tipping point, not only with the players, but with America in general. Seeing another black man getting killed at the hands of police just drove everything over,” Bosh said. “I think it really hit close to home not only because there is a large amount of African American males in the NBA, but Milwaukee, Wisconsin, you know, the tragedy happened right down the street ... Eventually, you have to stand up and say something because things outside of your world are happening. To be complacent and silent and kind of stand by and let things [happen] without using your platform for a positive message, you wouldn't be able to justify it to your kids or to yourself later on in the future.”Story continuesBosh has been vocal in his support, using social media platforms to educate people on the importance of voting. He was among a group of former athletes that successfully advocated for the NCAA to prohibit Division-1 student athletes from practicing or competing on Election Day, in order to give them time to vote at polling sites.“We want to make sure that, one, the education continues, and two, that people are aware of what they can do,” Bosh said. “I think that would be [considered a] success, enabling people to understand their rights as a citizen, and try to get more into it. I think that's the biggest, biggest success that could be had with this.”That awareness had already led to a huge improvement in voter registration among NBA players themselves. While just 20% of players voted in the last election, nearly every player is now registered to vote.Still, NBA Commissioner Adam Silver said this week, the league would look to scale back its social justice messaging next season, amid criticism that player activism has contributed to a 48% decline in ratings for the Finals.“It still is a business. That's one of the things that we always have to understand in those decisions,” Bosh said, though he praised the commissioner for his actions this season. “He has allowed that conversation [on social justice] to happen by being open to listening to the players, by empowering the players to do things that they think are important.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaCoronavirus stimulus: ‘That’s the only way we actually survived’‘New Reality for California’ : State Insurance Commissioner urges action to stabilize insurance after wildfires‘You have to be flexible:’ U.S. startups accelerate hiring abroad in push to distribute workforceCEOS caught in geopolitical fight, as TikTok deadline loomsInfosys commits to hiring 12,000 American workers, expanding U.S. footprint"}]}