{"article": [{"url": "https://finance.yahoo.com/news/most-americans-support-higher-taxes-if-it-goes-to-these-2-things-poll-181050357.html", "published": 1602076700.0, "headline": "Most Americans support higher taxes if it's spent on these 2 things: Poll", "body": "Americans aren’t optimistic about where things are headed in the coming months, but they might be willing to pay up to improve things.Yahoo Finance and Harris Poll recently surveyed Americans about taxes and asked if respondents would support an income tax increase in 2021 — which would likely hit them personally — if the additional funds went to either government services or toward paying down the national debt.Three-quarters of Americans said they’re either strongly or somewhat in support of higher income taxes if the funds go toward government services. Additionally, 68% are in favor if the money goes toward paying down the national debt, which currently sits at over $27 trillion and could grow fast in the coming years. (Read the full poll results here.)The Internal Revenue Service headquarters building in Washington, DC. (Chip Somodevilla/Getty Images)Both are expected to be pressing needs in the years ahead. Either a Biden administration or a second term from President Trump is expected to balloon the record deficit even further all while additional government support is needed for the struggling economy.Nearly half of respondents think the education system will be much or somewhat worse in three months and 49% think public safety will be much or somewhat worse three months from now.Traditionally, \"taxing the richest Americans is a very popular policy,\" said Amir Kanpurwala, the Harris Poll Managing Director of Brand Strategy, in an appearance on Yahoo Finance.Support for an increase in taxing wealthy Americans is always high, he said, but \"the question becomes whether or not I classify as a rich American.\"‘Should the U.S. income tax system be overhauled?’Harris conducted the survey from Oct. 2-5 and interviewed 1,003 adults with results broken down by gender, age, and geographic area.Throughout the poll was evidence that Americans could be willing to support major changes to the tax system in the years ahead.It’s no secret that some people don’t pay their fair share in taxes. When they hear about individuals and corporations that avoid paying taxes, 42% of survey respondents said those people and corporations are cheating the system. Just 14% said they’re simply being smart, while 34% said they are taking advantage of a broken system.Story continuesMeanwhile, 43% of respondents said they personally pay more than their fair share in income taxes in exchange for what they get back from the government.A copy of a IRS 1040 tax form. (Joe Raedle/Getty Images)As a result, 68% said the U.S. income tax system should be overhauled in the years ahead to “ensure that the richest Americans pay more than they are currently paying” in taxes. Indeed, a recent Congressional Budget Office report suggested that a cash infusion for the IRS would pay for itself three times over. “Increasing the IRS’s funding for examinations and collections by $20 billion over 10 years would boost revenues by $61 billion,\" the report found.And support for tax reform strengthens the older you get: 56% of 18- to 34-year-olds support such an overhaul, compared to 79% of 55- to 64-year-olds. The support for income-tax increases cut across different groups of Americans in the survey, which broke down the findings by gender, age, and geographic region.David Foster/Yahoo FinanceThe survey was conducted after the New York Times published a series of blockbuster stories last month that showed President Trump paid just $750 in federal income taxes the year he won the presidency and another $750 in 2017. He also paid no income taxes at all in 10 of the previous 15 years, the report found.The Times concluded that he “has been more successful playing a business mogul than being one in real life.” Trump has denied the report, calling it “totally fake news” while declining to release his tax returns.On the campaign trail, both Joe Biden and Trump have promised no tax increases for the vast majority of Americans. Biden’s tax plan would include higher taxes on those earning more than $400,000 a year, and a higher corporate tax rate.Trump has declined to release any sort of detailed tax plan but recently promised tax cuts if reelected.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:The Yahoo Finance-Harris PollAmericans expect things to get worse between now and the inauguration: PollBiggest election loser: America’s national debtBiden's tax plan: Eyes on the 1% and corporations like AmazonRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}