{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-global-infections-tops-10-m-gilead-sets-eyepopping-remdesivir-price-165633689.html", "published": 1593432260.0, "headline": "Coronavirus update: Global infections tops 10M; Gilead sets eye-popping remdesivir price", "body": "More than 10 million people worldwide have been infected with the coronavirus as of Monday, with over half a million dead as the U.S. struggled to contain a spike in infections jeopardizing efforts to restart the world’s largest economy.Domestically, over 2.5 million have been diagnosed and more than 125,000 have died from the virus. Texas and Florida — which on Monday reported its 7-day rolling average dropped from a relatively high level — are emerging as the newest hotspots. Soaring case numbers have heaped pressure on hospital systems in both states, and forced investors to rethink their lofty expectations of a rapid recovery.Texas’s largest medical center pulled its intensive care unit (ICU) capacity reporting over the weekend, after reports of confusion over how to classify bed use. Meanwhile in Florida, reports of ICU cases no longer being reported last week have concerning some experts about the ability to accurately track the surging outbreak in the state.The latest surge is partly attributed to increased testing, but experts argue that there’s more to the story. Segments of the population have been reluctant to adopt universal masking, while social distancing policies have been breaking down as the weather warms, and more cities relax tough lockdown measures.Dara Kass, a Columbia University physician and Yahoo Finance contributor, told “The First Trade” on Monday that to some degree, a rollback of re-openings was always a possibility.“There was a lot of false hope and misinformation,” she said, warning that a second COVID-19 wave “may be even worse because people may not follow the requirements” of another lockdown.There are over 2.4 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)As the world waits for a safe and effective vaccine, Dr. Anthony Fauci told CNN Sunday he will have to accept an efficacy level of 70% to 75%. Fauci, the director of the National Institute for Allergy and Infectious Diseases, said the closest to 100% effective has been the measles vaccine.The furthest ahead in clinical trials is Moderna (MRNA), one of three companies selected by the federal government for financial and logistical support to meet aggressive development timelines. Moderna is set to begin phase 3 trials in July.Story continuesMeanwhile in China, the country has approved a candidate from CanSino Biologics, the candidate furthest along in the search for a vaccine. China’s military will use the treatment for a year that began on June 25, making it the first widely used COVID-19 vaccine in the world.The move comes after China already approved two other vaccine candidates for use by employees in state-owned firms traveling overseas, according to Reuters.Remdesivir’s big price tagGilead Sciences announced it will begin charging $390 per dose for government funded insurance, and $520 per dose for private insurance Monday, significantly lower than the estimated $4,000+ per dose from non-profit ICER last week.However, critics highlighted that the total for a five-day treatment course of six doses would be about $2,300 for government-funded coverage, and $3,200 for commercially-insured patients. The pricing is only applicable to the intravenous form of the drug— the only way it is available now— but could be different for the inhaled form the company is currently working on.Columbia’s Kass pointed out that the drug is priced based largely on the ability to save a patient hospital time, rather than saving their lives. The savings are the equivalent of about $12,000, she told Yahoo Finance — even though remdesivir “doesn’t actually save lives yet.”Eli Zupnick, spokesman for Patients Over Pharma, a consumer advocacy group, blasted Gilead’s pricing move in a statement. “This is exactly why policymakers shouldn’t leave it up to the drug companies to unilaterally set prices on drugs that wouldn’t exist without taxpayer support.Pointing to an analysis that suggested Gilead could theoretically set remdesivir’s price at less than $1 per dose, Zupnick added that Monday’s news should be “a wake-up call for Congress to push aside the drug company lobbyists and move quickly to ensure that the vaccines that the Administration is currently pouring billions of taxpayer dollars into are affordable for every American.”Gilead has faced intense pressure to ensure the price of the drug remains affordable, to ensure universal access both in the developing world and developed countries.In late March, when U.S. reported cases were still under 100,000, the company applied for Orphan Drug status, which would allow the company to have a seven-year period of market exclusivity for remdesivir. After public pressure from a number of advocacy groups, Gilead rescinded the designation and pledged to donate a majority of its existing supply to the federal stockpile, as well as ensured accessibility for all.While some still question the price which has been set in the U.S. versus abroad, considering U.S. taxpayer money has funded some of the research, Gilead CEO Daniel O’Day said in his letter the value of the drug was much higher — which is normally how drugs are priced.“As the world continues to reel from the human, social and economic impact of this pandemic, we believe that pricing remdesivir well below value is the right and responsible thing to do,” he wrote.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}