{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-12-2020-221717481.html", "published": 1591974920.0, "headline": "Stock market news: Dow rises 2%, or 477 points, but posts first weekly loss in a month", "body": "Stocks ended a choppy session in positive territory, with the Dow up nearly 2%, but the three major indices posted their first weekly declines in a month as renewed concerns over rising coronavirus cases dampened optimism over a smooth recovery.Stocks kicked off Friday’s trading day higher in a rebound from the previous session. But the three major indices turned slightly negative just before 2 p.m. ET Friday, with the Dow briefly erasing gains after adding as many as 837 points, or 3.33%, shortly after market open. A day earlier, the 30-stock index posted its worst session since March 16, and suffered its fourth largest point-decline on record.Thursday’s rout came as investors nervously eyed rising coronavirus cases in some parts of the country, and considered officials’ warnings of sustained economic damage due to the outbreak’s after-effects.“Stocks were overdue for a pullback after rallying more than 40% off the March lows and pricing in what we believe is an overly optimistic economic outlook,” Jeff Buchbinder, equity strategist for LPL Financial, said in an email.“More COVID-19 spread in a few southern and western states and a gloomy outlook from the Fed provided the spark for some of the froth to come out.”Increases in new coronavirus cases in some parts of the country contributed to investors’ worries, triggering the steep sell-off in risk assets and among travel and leisure stocks especially. Officials in Houston, Texas suggested they were considering reestablishing stay-at-home orders amid the latest rise in local cases, and Texas reported a fresh record high in new coronavirus cases as of Friday.Cases in Florida – another densely populated US state – rose by 1,902, also marking a record high in new cases as of the latest count Friday morning.Comments from Federal Reserve Chair Jerome Powell were also still fresh in the minds of investors, with the head of the central bank underscoring concerns of a drawn-out recovery process. In his latest press conference Wednesday, Powell flagged the Fed’s “high level of uncertainty” about the economic outlook, and warned there could be a “good number of millions” of Americans sustaining longer-term unemployment due to virus-related disruptions.Story continues“We think that the more positive tone in stock markets today is a sign of things to come. This is partly because we expect economies to continue to recover from their slumps, provided second waves do not lead to renewed widespread lockdowns,” analysts at Capital Economics said in a Friday research note.“And, just as importantly, it reflects our view that exceptional policy support will foster an ongoing hunt for yield,” the firm added.—4:05 p.m. ET: Stocks end higher Friday, but decline on the weekHere’s where the three major indices settled Friday:S&P 500 (^GSPC): +39.21 points (+1.31%) to 3,041.31Dow (^DJI): +477.37 points (+1.9%) to 25,605.54Nasdaq (^IXIC): +96.08 points (+1.01%) to 9,588.81—1:50 p.m. ET: Stocks turn around, dipping back into the redHere were the main moves in markets, as of 1:50 p.m. ET:S&P 500 (^GSPC): -10.41 points (-0.35%) to 2,991.69Dow (^DJI): -9.52 points (-0.04%) to 25,118.65Nasdaq (^IXIC): -45.38 points (-0.54%) to 9,551.39Crude (CL=F): -$0.42 (-1.16%) to $35.92 a barrelGold (GC=F): -$1.50 (-0.09%) to $1,738.30 per ounce10-year Treasury (^TNX): +2.9 bps to yield 0.682%—12:52 p.m. ET: Stocks hold in positive territory, but come off session highsThe three major indices held higher Friday afternoon, but were off session highs from shortly after market open.The Dow rose 1.3%, or about 325 points, with gains led by a more than 7% advance in shares of Boeing. The real estate, financials and materials sectors led advances in the S&P 500.—10:01 a.m. ET: Consumer sentiment posts second straight monthly rise in June: University of MichiganAn index tracking consumer sentiment rose more than expected in its second straight monthly gain in June, according to the University of Michigan’s preliminary monthly report.Headline consumer sentiment rose to 78.9 in June from 72.3 in May. This was above consensus estimates for 75.0, according to Bloomberg data, and the margin of increase was the largest since 2016. Subindices tracking consumers’ assessments of current conditions and future expectations for the economy also rose more than expected.“The turnaround is largely due to renewed gains in employment, with more consumers expecting declines in the jobless rate than at any other time in the long history of the Michigan surveys,” Richard Curtin, chief economist for the university’s Surveys of Consumers, said in a statement.“Despite the expected economic gains, few consumers anticipate the reestablishment of favorable economic conditions anytime soon. Bad times financially in the economy as a whole during the year ahead were still expected by two-thirds of all consumers, and a renewed downturn was anticipated by nearly half over the longer term,” he added. “The most often cited cause of a renewed downturn is a resurgence in the spread of the coronavirus, and the most often cited cause of a slow economic recovery is the financial damage from persistently high unemployment.”—9:30 a.m. ET: Stocks bounce, recovering some lossesHere’s where equity indices opened, as of 9:30 a.m. ET:S&P 500 (^GSPC): +76.64 points (+2.55%) to 3,078.74Dow (^DJI): +688.09 points (+2.74%) to 25,816.26Nasdaq (^IXIC): +230.40 (+2.36%) to 9,718.93Crude (CL=F): +$0.30 (+0.83%) to $36.64 a barrelGold (GC=F): +$6.50 (+0.37%) to $1,746.30 per ounce10-year Treasury (^TNX): +4.7 bps to yield 0.7%—7:20 a.m. ET Friday: Stock futures rise overnight, pointing sharply higher into the openHere were the main moves in markets as of 7:20 a.m. ET:S&P 500 futures (ES=F): 3,068.50, up 58.25 points, or 1.94%Dow futures (YM=F): 25,740, up 575.00 points, or 2.28%Nasdaq futures (NQ=F): 9,759.75, up 143 points or 1.49%Crude (CL=F): +$0.19 (+0.52%) to $36.53 a barrelGold (GC=F): +$2.90 (+0.17%) to $1,742.70 per ounce10-year Treasury (^TNX): +5.5 bps to yield 0.708%—6:04 p.m. ET Thursday: Stock futures fallHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:05 p.m. ET:S&P 500 futures (ES=F): 3,007.00, down 3.25 points or 0.11%Dow futures (YM=F): 25,153, down 12 points, or 0.05%Nasdaq futures (NQ=F): 9,604.00, down 12.75 points, or 0.13%NEW YORK, NEW YORK - MAY 26: The New York Stock Exchange (NYSE) stands in lower Manhattan on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}