{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-2-2020-221826705.html", "published": 1593702920.0, "headline": "Stock market news live updates: Stocks jump after June jobs data smash expectations", "body": "Stock rose on Thursday and gained for the week, as investors cheered the resiliency of a U.S. economy that created nearly 5 million jobs last month in the throes of the raging coronavirus pandemic.The U.S. economy added a greater than expected number of payrolls in June from May, as regions across the country eased social distancing restrictions and allowed more businesses to reopen. The net additions in payrolls topped consensus expectations, and far exceeded ADP’s private payrolls data on Wednesday, which logged a gain of over 2.3 million jobs.Although new unemployment insurance claims were higher than expectations, investors shrugged off the report in favor of the boom of workers returning to the labor force. The S&P 500 rose about 0.5% on Thursday to cap off an advance of 4% since market close last Friday. The Dow rose 4.6%, while the Nasdaq rose 3.25% on the week.Wall Street ended July’s first two trading days in the third quarter on a positive note, buoyed over the past two days both after Pfizer’s (PFE) coronavirus vaccine candidate showing progress in a trial phase — and the Federal Reserve’s pledge to keep the monetary spigots open “for years.” News Thursday that Moderna’s Covid-19 vaccine trial would be delayed past next week did little to knock the risk-on mood across markets.Still, record-breaking surges in coronavirus infections are overshadowing market psychology, and setting the tone for the start of the second half of a turbulent year.New York City on Wednesday joined New Jersey in postponing plans to reopen indoor dining, with cases outside the Tri-state area skyrocketing. Meanwhile, a spike in California’s infections reportedly prompted the state to shutter indoor activities, including dining, to mitigate the spread.And investor expectations are intricately tied to new surges in COVID-19 infections, which are walloping the Sun Belt states and prompting more regions to rethink reopening plans. That may put a definitive cap on a market that’s skyrocketed since plunging to multi-year lows in when lockdowns first began in March.Story continuesMarkets will be closed Friday in observance of the Fourth of July holiday.—4:04 p.m. ET: Stocks end the week higher after strong jobs reportHere were the main moves in markets, as of 4:04 p.m. ET:S&P 500 (^GSPC): +14.15 points (+0.45%) to 3,130.01Dow (^DJI): +92.39 points (+0.36%) to 25,827.36Nasdaq (^IXIC): +53 points (+0.52%) to 10,207.63Crude (CL=F): +$0.44 (+1.1%) to $40.26 a barrelGold (GC=F): +$8.30 (+0.47%) to $1,788.20 per ounce10-year Treasury (^TNX): -1.3 bps to yield 0.669%—3:03 p.m. ET: Stocks pace toward weekly gains ahead of holidayThe three major indices were on track to rise for the holiday-shortened week, with an hour left to go in Thursday’s session. Each of the S&P 500 and Nasdaq rose more than 1% on the day.Walgreens Boots Alliance and Pfizer each jumped more than 3%, leading the Dow’s more than 200-point advance. The materials and energy sectors led gains in the S&P 500.—11:47 a.m. ET: SoftBank-backed Lemonade opens for trading at $50.06, rising above $29 IPO priceLemonade (LMND), a home insurance company backed by venture capital firms including SoftBank, opened for trading on the New York Stock Exchange in its public debut at $50.06 a share on Thursday, leaping nearly 73% above its IPO price of $29.Shares extended gains after the opening trade, rising to more than $52 per share.The company sold 11 million shares in its initial public offering, raising $319 million.—9:34 a.m. ET: Stocks open sharply higher after jobs dataHere were the main moves in markets, as of 9:34 a.m. ET:S&P 500 (^GSPC): +44.07 points (+1.41%) to 3,159.93Dow (^DJI): +409.40 points (+1.59%) to 26,144.37Nasdaq (^IXIC): +135.88 points (+1.34%) to 10,290.41Crude (CL=F): +$0.41 (+1.03%) to $40.23 a barrelGold (GC=F): -$4.50 (-0.25%) to $1,775.40 per ounce10-year Treasury (^TNX): +1.9 bps to yield 0.701%—8:31 a.m. ET: New weekly jobless claims come in worse than expected, but extend downward trend since early AprilThe Labor Department released its new report on weekly unemployment claims Thursday morning, concurrently with the June jobs report due to the Fourth of July holiday observed Friday.Initial jobless claims totaled 1.427 million for the week ended June 27, coming in higher than the 1.35 million consensus economists expected. The level was down slightly from the previous week’s upwardly revised 1.482 million.Continuing unemployment claims, representing those still receiving unemployment insurance benefits, totaled 19.29 million for the week ending June 20, ticking up from the 19.23 million during the prior week and exceeding consensus expectations.—8:30 a.m. ET: June jobs crush expectations, sending futures higherNearly 50 million Americans total have filed for unemployment since the coronavirus lockdowns took effect.Another month, another record number of jobs created in the midst of the pandemic: June payrolls smash expectations as the economy cranks out 4.8 million jobs, underscoring that May wasn’t a fluke. Stock futures are leaping higher on the number, indicating Wall Street is poised to open sharply higher.—8:13 a.m. ET: Tesla tops 2Q delivery expectations, sending shares surging above $1,200Tesla (TSLA) on Thursday reported better than expected second-quarter delivery results, sending shares surging more than 8% to more than $1,200 per share in pre-market trading.Deliveries totaled 90,650 for the second quarter, rising 2.5% versus the first three months of the year. Consensus analysts expected just over 83,000 deliveries, according to Bloomberg-compiled data.The stock, which had hit a record intraday high of $1,119.63, was on track to open at a fresh record level.—7:18 a.m. ET: Stocks point to sharply higher open ahead of jobs dataHere were the main moves in markets, as of 7:18 a.m. ET:S&P 500 futures (ES=F): 3,124.25, up 21.25 points (+0.68%)Dow futures (YM=F): 25,828.00, up 253 points (+0.99%)Nasdaq futures (NQ=F): 10,312.25, up 43.5 points (+0.42%)Crude (CL=F): +$0.27 (+0.68%) to $40.09 a barrelGold (GC=F): +$4.30 (+0.24%) to $1,784.20 per ounce10-year Treasury (^TNX): +0.7 bps to yield 0.689%—6:15 p.m. ET: Stock futures open slightly lowerHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:15 p.m. ET:S&P 500 futures (ES=F): 3,101.75, off -1.25 (-0.04%)Dow futures (YM=F): 25,557.00, down -18.00 (-0.07%)Nasdaq futures (NQ=F): 10,257.25, down -11.50 (-0.11%)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}