{"article": [{"url": "https://finance.yahoo.com/news/apple-wwdc-2020-preview-205750341.html", "published": 1592582720.0, "headline": "Here’s what to expect from Apple’s WWDC 2020 event", "body": "Apple’s WWDC kicks off June 22. But rather than the company’s traditional developer conference held in a large, packed event space, the COVID-19 era has forced Apple to take one of its most important events of the year entirely online.But don’t expect Apple (AAPL) to pull its punches in terms of news. You can count on the tech giant to make a host of major announcements including the debut of the latest version of iOS, and maybe even a few surprises.Here’s what you can expect from WWDC 2020.The first ARM-powered MacsApple has been rumored to be working on its own processors for its Mac and MacBook lines of computers for some time. And according to Bloomberg, the firm will finally make the move at WWDC.The company first began using Intel chips in its systems in 2006 after transitioning away from its PowerPC architecture. Intel’s chipsets have given the tech giant’s computers plenty of power over the years, but Apple is keen on bringing more of its devices’ components in house, minimizing its dependence on outside suppliers.CEO Tim Cook and company are no strangers to ARM, either. The chips found in the iPhone and iPad are ARM-based designs, meaning Apple has plenty of experience working with the processor architecture.The challenge for Apple will be ensuring that it can squeeze the same amount of horsepower out of its new ARM chips to rival, or overtake, those made by Intel. ARM chips are great for mobile devices because of their impressive energy efficiency, which enables smartphones and tablets to run for hours at a time without needing a charge.But performance has never been their strong suit. Look no further than reviews of recent Windows PCs running ARM-based processors. While they pack plenty of battery life, they lack in speed and functionality compared to Intel-based systems.Apple will have its work cut out for it ensuring that the only differences between its ARM-powered computers and its existing Intel-powered machines are nothing but positives, and not a list of trade-offs consumers will have to make.Story continuesApple CEO Tim Cook waves after speaking at the Apple Worldwide Developers Conference in San Jose, Calif., Monday, June 3, 2019. (AP Photo/Jeff Chiu)Hello, iOS 14Always the star of Apple’s WWDC, iOS, the operating system that powers the iPhone, is expected to get its latest major update in the form of iOS 14. Perhaps one of the most important change rumored for iOS 14 is the ability to change your default apps on the iPhone.According to a February report by Bloomberg, Apple is considering giving users the option to set third-party apps like Gmail, Spotify, and Chrome as their defaults. Currently, if you tap a link in, say, Twitter, your iPhone will open it in Safari even if you regularly use Chrome or Firefox.The change would not only give users more control over their own devices, but could also help ease some of the antitrust concerns swirling around the company. Apple’s strict control over what apps are able to function as defaults has been one of the issues that critics have pointed to as proof that the company follows a pattern of monopolistic behavior.The move, though, wouldn’t solve all of Apple’s antitrust issues. The firm has come under increased scrutiny lately about how it handles third-party apps in its App Store, and the fees it charges developers.In addition to changing default apps, rumors indicate that Apple will let users view their home screen apps in a new list-style view rather than the grid view the iPhone has used for years. According to 9to5Mac, the list view would look similar to the way apps are displayed on the Apple Watch.9to5Mac also says the new version of iOS will allow users to place widgets on their home screens similar to what Apple did with iPadOS. Android users have been able to do this for years, placing things like their calendars and weather reports on their home screens. It’s a worthwhile feature that I’m hoping Apple finally moves forward with.Finally, according to MacRumors, iOS 14 could come with a new mention feature in Apple’s Messages app that will allow you to nudge specific contacts in group messages. There’s also word that you may be able to retract sent messages, which would be a godsend for those texts you really wish you could take back the moment you push send.WatchOS 7 could be hugeThe Apple Watch should see some big time improvements via its watchOS 7 update. Major changes, according to 9to5Mac, include the potential for a sleep tracking feature and a new blood oxygen level monitor.Sleep tracking has been a most-wanted feature for the Apple Watch for some time, but Apple hasn’t offered it yet, likely due to the battery life needed to ensure you can use the watch all day and throughout the night. It’s unclear whether Apple would be able to add sleep tracking to existing watches, though, since the company may need to build out a larger battery for the device.A blood oxygen monitor, meanwhile, would let you see the level of oxygen circulating throughout your blood.We’ll be following all of the developments from WWDC 2020 as they happen. Stay tuned.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple to close retail stores in 4 states amid coronavirus outbreaksWhy Microsoft and Amazon are calling on Congress to regulate facial recognition technologyThe PlayStation 5’s most important feature will be its price5 Father’s Day tech gifts: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}