{"article": [{"url": "https://finance.yahoo.com/news/delta-posts-nearly-4-billion-q-2-earnings-loss-110719723.html", "published": 1594707320.0, "headline": "Delta posts massive Q2 earnings loss, crushed by 'truly staggering' coronavirus crisis", "body": "Delta Air Lines (DAL) on Tuesday reported a steep plunge in second quarter revenues and profit, as the COVID-19 pandemic hammering the travel industry ravaged the company’s bottom line.Here were the main results from the report, compared to consensus estimates compiled by Bloomberg:Revenue: $1.2 billion vs. $1.43 billion expectedAdjusted loss per share: $4.43 vs. $4.22 expectedAdjusted pre-tax loss: $3.9 billionAdjusted net income loss: $2.81 billion vs. $2.66 billion expectedWith worldwide travel demand crushed by the coronavirus pandemic, Delta CEO Ed Bastian said in a statement that the quarter’s results “illustrates the truly staggering impact of the COVID-19 pandemic on our business.”Over the last year, the company lost over $11 billion in revenue, but raised nearly $15 billion in financing — which includes $5.4 billion in loans and grants from the U.S. Treasury under the Coronavirus Aid, Relief, and Economic Security (CARES) Act. In return, Delta agreed not to furlough employees, if necessary, until October 1.Delta says it had $15.7 billion in liquidity at the end of Q2, with an option to borrow an additional $4.6 billion from U.S. taxpayers.However, the air carrier posted total adjusted revenue of $1.2 billion, representing a staggering 91% dive from the comparable year-ago period, as Delta was forced to shave capacity by 85%. Even still, the company intends to join other air carriers by spending more on anti-coronavirus cleaning protocols.Meanwhile, passenger traffic was down 93% in Q2 versus the comparable year-ago period. As a result, Delta intends to retire its fleet of MD 88, MD 90, 777 and 737-700 aircraft.The airline cut its total operating expenses by $5.5 billion during the quarter, as more than 40,000 employees took voluntary leaves of absence protected by the CARES act deal. Delta also parked more than 700 aircraft, which helped it cut its average daily cash burn from $100 million to $43 million. In June it fell to $27 million.Story continuesAirline recovery slowing downLike other major air carriers, Delta has resorted to extraordinary measures in order to survive coronavirus lockdowns. Last week, United Airlines scaled back plans to add 25,000 flights to its schedule by the end of August. United (UAL) also warned it may have to lay off upto 36,000 employees.Bastian told Yahoo Finance last month it planned to add just 1000 flights by the end of August, and would do all it could to avoid layoffs, adding that the “telltale sign” will arrive on October 1.“That's when the restrictions around furloughs will come off and my goal, at Delta, is to avoid furloughs in any way we possibly can,” Bastian said.Passenger traffic at the nation's airports continued to improve last week, but the TSA says that improvement grew at a slower pace, 8%, than the prior two weeks when it grew 12%. Overall traffic through TSA checkpoints was down 73% year over year.Meanwhile, a resurgence in coronavirus infections hasn’t helped at all. Raymond James analyst Savanthi Syth told clients in her most recent note that slowing demand “is indicative of...recent upticks of COVID-19 in select states.”Bastian reiterated his warning that Delta will be a smaller airline post-pandemic. “Given the combined effects of the pandemic and associated financial impact on the global economy, we continue to believe that it will be more than two years before we see a sustainable recovery.”The company’s stock has been more than halved over the last year. Delta shed 1% to close Monday’s session around $26.82.Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.United Airlines is tripling flights despite a spike in coronavirus infections'The corporate tax rate — I’m actually OK at 28%': Gary CohnDelta CEO trying to avoid furloughs 'any way we possibly can' as airlines recoverJ&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesSouthwest warns that revenue could drop as much as 95% in MayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}