{"article": [{"url": "https://finance.yahoo.com/news/dow-outlines-actions-deliver-structural-100000868.html", "published": 1601442500.0, "headline": "Dow outlines actions to deliver structural cost improvements and further enhance competitiveness", "body": "Today Dow will close the sale of its rail infrastructure assets at six North American sites; transaction to close three months earlier than planned and demonstrates best-owner mindset and continued evaluation of non-revenue-generating assets across its global portfolioDow Inc. (NYSE: DOW) today outlined the series of actions it will take to achieve previously announced structural cost improvement targets and further enhance its long-term competitiveness as the global economy recovers from the coronavirus pandemic.As announced during the Company’s second quarter earnings on July 23, 2020, Dow is implementing a restructuring program to reduce its global workforce costs by approximately six percent and to rationalize certain manufacturing assets. These actions are expected to result in total annualized EBITDA savings of more than $300 million by the end of 2021.Manufacturing asset impacts include:Industrial Intermediates & Infrastructure will rationalize its asset footprint by shutting down certain amines and solvents facilities in the United States and Europe as well as select small-scale downstream polyurethanes manufacturing facilities.Performance Materials & Coatings will shut down manufacturing assets, primarily small-scale coatings reactors, and will also rationalize its upstream asset footprint in Europe and in the United States and Canada by adjusting the supply of siloxane and silicon metal to balance to regional needs.\"Given the expected gradual and uneven global economic recovery from COVID-19, we announced in July that we are taking necessary actions to continue to optimize our asset footprint, reduce structural costs and enhance the competitiveness of our business over the long-term,\" said Jim Fitterling, Dow chairman and CEO. \"We continue to stay focused on delivering strong cashflow, strengthening our financial profile and maximizing our operational advantages, and we remain well positioned to capture significant growth as market conditions improve.\"Story continuesThe Company will record a charge in the third quarter of 2020 for costs associated with the restructuring program activities. In total, these costs are expected to be in the range of $500 million to $600 million and will consist of severance and related benefit costs; costs associated with exit and disposal activities; and asset write-downs and write-offs.The restructuring program is in addition to the $500 million of operating expense savings Dow will achieve by the end of 2020. The Company also remains on target to achieve its reduced target of $1.25 billion for capital expenditures in 2020, down from $2 billion in 2019.Dow will involve local stakeholders as defined in each country and in compliance with relevant information and consultation processes.Dow also confirmed that today it will close the sale of its rail infrastructure assets at six North American sites to Watco, three months ahead of its initial planned closing, for cash proceeds in excess of $310 million. Earlier this month the Company also announced plans to divest certain marine and terminal operations and assets to Vopak Industrial Infrastructure Americas for cash proceeds of $620 million, which is expected to close by year-end.About DowDow (NYSE: DOW) combines global breadth, asset integration and scale, focused innovation and leading business positions to achieve profitable growth. The Company’s ambition is to become the most innovative, customer centric, inclusive and sustainable materials science company. Dow’s portfolio of plastics, industrial intermediates, coatings and silicones businesses delivers a broad range of differentiated science-based products and solutions for its customers in high-growth market segments, such as packaging, infrastructure and consumer care. Dow operates 109 manufacturing sites in 31 countries and employs approximately 36,500 people. Dow delivered sales of approximately $43 billion in 2019. References to Dow or the Company mean Dow Inc. and its subsidiaries. For more information, please visit www.dow.com or follow @DowNewsroom on Twitter.Cautionary Statement about Forward-Looking StatementsThis press release contains \"forward-looking statements\" within the meaning of the federal securities laws, including Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. In this context, forward-looking statements often address expected future business and financial performance, financial condition, and other matters, and often contain words such as \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"opportunity,\" \"outlook,\" \"plan,\" \"project,\" \"seek,\" \"should,\" \"strategy,\" \"target,\" \"will,\" \"will be,\" \"will continue,\" \"will likely result,\" \"would\" and similar expressions, and variations or negatives of these words. Forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties which may cause actual results to differ materially from the forward-looking statements.Forward-looking statements include, but are not limited to: expectations as to future sales of Dow’s products; the ability to protect Dow’s intellectual property in the United States and abroad; estimates regarding Dow’s capital requirements and need for and availability of financing; estimates of Dow’s expenses, future revenues and profitability; estimates of the size of the markets for Dow’s products and services and Dow’s ability to compete in such markets; expectations related to the rate and degree of market acceptance of Dow’s products; the outcome of certain Dow contingencies, such as litigation and environmental matters; estimates of the success of competing technologies that may become available; the continuing global and regional economic impacts of the coronavirus disease 2019 (\"COVID-19\") pandemic and crude oil supply and price volatility; estimates regarding benefits achieved through contemplated restructuring activities, such as workforce reduction, exit and disposal activities; and expectations regarding the benefits and costs associated with each of the foregoing.Forward-looking statements by their nature address matters that are, to different degrees, uncertain. Forward-looking statements are based on certain assumptions and expectations of future events which may not be realized and speak only as of the date the statements were made. In addition, forward-looking statements also involve risks, uncertainties and other factors that are beyond Dow’s control that could cause Dow’s actual results to differ materially from those projected, anticipated or implied in the forward-looking statements. These factors include, but are not limited to: fluctuations in energy and raw material prices; failure to develop and market new products and optimally manage product life cycles; significant litigation and environmental matters; failure to appropriately manage process safety and product stewardship issues; changes in laws and regulations or political conditions; global economic and capital markets conditions, such as inflation, market uncertainty, interest and currency exchange rates, and equity and commodity prices; business or supply disruptions; security threats, such as acts of sabotage, terrorism or war; weather events and natural disasters; ability to protect, defend and enforce Dow’s intellectual property rights; increased competition; changes in relationships with Dow’s significant customers and suppliers; unanticipated expenses such as litigation or legal settlement expenses; unanticipated business disruptions; Dow’s ability to predict, identify and interpret changes in consumer preferences and demand; Dow’s ability to complete proposed divestitures or acquisitions; Dow’s ability to realize the expected benefits of acquisitions if they are completed; the availability of financing to Dow in the future and the terms and conditions of such financing; disruptions in Dow’s information technology networks and systems; the continuing risks related to the COVID-19 pandemic and crude oil supply and price volatility; and Dow’s ability to realize the expected benefits of restructuring activities if they are approved and completed. Additionally, there may be other risks and uncertainties that Dow is unable to identify at this time or that Dow does not currently expect to have a material impact on its business.Risks related to achieving the anticipated benefits of Dow's separation from DowDuPont include, but are not limited to, a number of conditions outside the control of Dow, including risks related to: (i) Dow's inability to achieve some or all of the benefits that it expects to receive from the separation from DowDuPont; (ii) certain tax risks associated with the separation; (iii) the failure of Dow's pro forma financial information to be a reliable indicator of Dow's future results; (iv) Dow's inability to receive third-party consents required under the separation agreement; (v) non-compete restrictions under the separation agreement; (vi) receipt of less favorable terms in the commercial agreements Dow entered into with DuPont and Corteva, Inc. (\"Corteva\"), including restrictions under intellectual property cross-license agreements, than Dow would have received from an unaffiliated third party; and (vii) Dow's obligation to indemnify DuPont and/or Corteva for certain liabilities.Where, in any forward-looking statement, an expectation or belief as to future results or events is expressed, such expectation or belief is based on the current plans and expectations of management and expressed in good faith and believed to have a reasonable basis, but there can be no assurance that the expectation or belief will result or be achieved or accomplished. For a more detailed discussion of Dow’s risks and uncertainties, see the section titled \"Risk Factors\" contained in Part II, Item 1A of the combined Dow Inc. and TDCC Quarterly Reports on Form 10-Q for the quarters ended March 31, 2020 and June 30, 2020, and Part I, Item 1A of the combined Dow Inc. and TDCC Annual Report on Form 10-K for the fiscal year ended December 31, 2019. Dow Inc. and TDCC assume no obligation to update or revise publicly any forward-looking statements whether because of new information, future events or otherwise, except as required by securities and other applicable laws.View source version on businesswire.com: https://www.businesswire.com/news/home/20200930005219/en/ContactsINVESTORS: Colleen Kay+1 989-636-0920ckay@dow.comMEDIA: Kyle Bandlow+1 989-638-2417kbandlow@dow.com"}]}