{"article": [{"url": "https://finance.yahoo.com/news/college-football-cancelations-will-cost-big-universities-billions-of-dollars-172307334.html", "published": 1597235480.0, "headline": "College football cancellations will cost big universities billions of dollars", "body": "Just two months ago, despite the ongoing pandemic, college football insiders widely expected the fall season to happen as planned, and the biggest question was whether schools would be able to host fans in the stands at their games. Even after the Ivy League canceled fall sports last month, it appeared the “Power 5” conferences (Big Ten, Big 12, SEC, ACC, and PAC-12) would still play on.Now it’s all crumbling. On Tuesday, the Big Ten announced it will not play football in the fall. The PAC-12 quickly followed. The MAC and Mountain West Conference, non-Power 5 conferences, canceled their fall seasons over the weekend. Of the 130 schools in the FBS system (Football Bowl Subdivision), 53 now say they won’t play in the fall.The Big Ten and PAC-12 comprise 26 of the 65 Power 5 schools, including big names like Ohio State, Michigan, Michigan State, and Penn State in the Big Ten, and USC, UCLA, Stanford, and Oregon in the PAC-12.Brutus Buckeye, the Ohio State Buckeyes mascot on the field during the Big Ten Championship game against the Wisconsin Badgers at Lucas Oil Stadium on December 07, 2019 in Indianapolis. (Photo by Justin Casterline/Getty Images)The Big Ten and PAC-12 claim they will aim to play in the spring, but spring college football would not be feasible for a range of reasons, including the unlikelihood of a widely available COVID-19 vaccine by spring, and the proximity to the fall college football season. (Former Ohio State University football coach Urban Meyer declared on Tuesday, “You can't ask student-athletes to play two seasons in one calendar year.”) Moreover, the biggest college stars will surely opt out of playing in the spring to prepare for the NFL Draft.Canceling the fall season is widely seen as a cancellation of the entire 2020 season. And it will hit the financials of big universities hard.More than $4 billion in lost revenueAt Division I schools, financing of all sports flows from football. The typical Power 5 athletic department gets well over half of its total revenue from football. In 2019, Power 5 schools reported more than $1 billion from football ticket sales.According to a new report from Washington University in St. Louis, Power 5 schools stand to lose $4 billion in combined revenue without a 2020 football season. And that’s a conservative estimate: it doesn’t include broadcast revenue, conference payouts from bowl games and the College Football Playoff, fees that smaller schools get for playing guarantee games (or “cupcake games”) against bigger schools, corporate sponsorships, and missed donations from boosters. A study from USA Today pegs the number at $4.1 billion. The total losses will almost surely be higher.Story continuesNEW ORLEANS, LOUISIANA - JANUARY 13: Head coach Ed Orgeron of the LSU Tigers raises the National Championship Trophy with Joe Burrow #9, Grant Delpit #7, and Patrick Queen #8 after the College Football Playoff National Championship game at the Mercedes Benz Superdome on January 13, 2020 in New Orleans, Louisiana. The LSU Tigers topped the Clemson Tigers, 42-25. (Photo by Alika Jenner/Getty Images)To zoom in on one school, take Louisiana State University, last season’s college football champion.According to LSU’s 2020 financial report, the football program brought in $92 million in 2019, or 59% of the school’s overall athletic revenue of $157 million. Forty percent of the football revenue came from ticket sales; the next largest portion was from booster donations (26%).At LSU, football, men’s basketball, and men’s baseball were the only profitable sports; those sports alone (and mostly football) fund LSU track and field, tennis, golf, and the rest.Without football, ticket sales, concessions, and parking fees all go away; booster donations likely shrink for the year; merchandise sales surely take a hit. Wisconsin and Nebraska, both in the Big Ten, have already said they project a shortfall of more than $100 million. According to the Mercury News, the PAC-12 is arranging a massive loan program for member schools to survive 2020 without football.Canceling the 2020 college football season won’t just mean lost football revenue; it will have financial ripple effects on recruiting, athletic staff, student athlete travel, and overall university budgets for years to come. Yahoo Sports reporter Pete Thamel calls it “the single most transformative financial decision in the history of college sports.”Lack of CFB leadershipAs of Wednesday, the Big 12, ACC, and SEC all still plan to play in the fall. (Ryan Day, Ohio State’s head coach, quickly came out and said he hopes to start playing in January.) That split from the Big Ten and PAC-12 illustrates a glaring problem in college football that has come to light more than ever before amid the pandemic: lack of clear leadership or governance at the top.Each Power 5 conference operates independently, with very little cross-communication on decision-making. Each conference has its own commissioner, but there is no overall commissioner or czar for college football. Many casual fans may assume the NCAA serves that function, but it does not; the NCAA does not even run, for example, the College Football Playoff, which concludes each college football season. As Yahoo Sports reporter Nick Bromberg puts it, “It’s not like the NFL, where you can point to Roger Goodell and say he’s the guy who’s ultimately making the decision here.”Florida State University President John Thrasher answers questions after the collegiate athletics roundtable about fall sports at the Albert J. Dunlap Athletic Training Facility on the campus of Florida State University on August 11, 2020 in Tallahassee, Florida. (Photo by Don Juan Moore/Getty Images)As a result, “We are absolutely looking at a chaos theory here over the next six months,” says Bromberg. Top players will opt out if there’s football in the spring; schools that attempt to play in spring will have to completely overhaul their schedules to remove games against schools that aren’t playing; and depleted coffers of big schools could lead to permanent cancellation of some non-revenue sports.Add to all of that the fact that 2021 happens to be the year the NCAA will begin allowing student athletes to sign personal endorsement deals, and you can expect major permanent change to the college sports landscape.—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers sports business. Follow him on Twitter at @readDanwrite.Read more on how the sports industry is faring amid the pandemic:College football aims to return, but a huge financial question remains: fans in the standsMajority of Americans are not ready to go to a sports event, even with masks: pollMLS delays launch of expansion teams in Charlotte, Sacramento, and St. Louis due to pandemicCoronavirus could have long-lasting impact on live sports ticket salesMLS Commissioner: Playing in empty stadiums would be particularly bad for usNHL Commissioner Gary Bettman: Money 'is not what's driving' return planHere's every sports league's current plan to return from coronavirus lockdown"}]}