{"article": [{"url": "https://finance.yahoo.com/news/boston-feds-rosengren-further-qe-could-help-economy-but-not-as-much-as-fiscal-policy-140251491.html", "published": 1600938620.0, "headline": "Boston Fed's Rosengren: Further QE could help economy, but not as much as fiscal policy", "body": "Federal Reserve Bank of Boston President Eric Rosengren told Yahoo Finance on Thursday that the central bank could lean on ramped up asset purchases to support the economy, but added that Congress and the White House would be better suited in delivering stimulus.“While I think it would help to do more quantitative easing, I’m not sure it would be nearly as supportive, for example, as fiscal policy,” Rosengren said.Rosengren suggested that the Fed could ramp up its purchases of mortgage-backed securities and U.S. government debt.The central bank left the door open to further leveraging its $7 trillion balance sheet by saying last week that quantitative easing, or QE, could be used to “maintain an accommodative stance of monetary policy.”But Rosengren cautioned that purchases of long-term debt may have reduced effect with bond yields already so low. As of Thursday morning, the 10-year U.S. Treasury (^TNX) was hovering near 67 basis points.The Federal Reserve Bank of Boston's President and CEO Eric S. Rosengren speaks during the \"Hyman P. Minsky Conference on the State of the U.S. and World Economies\", in New York, April 17, 2013. REUTERS/Keith Bedford (UNITED STATES - Tags: BUSINESS POLITICS)Rosengren admitted that his outlook for the economy is more pessimistic than those of his colleagues on the Federal Open Market Committee.In projections released by the FOMC last week, the median member of the 17-person committee forecast unemployment falling to 5.5% by the end of next year. But Rosengren suggested that unemployment could linger at higher levels if many of the temporary layoffs turned into permanent job losses as businesses shutter for good.Rosengren said fiscal support should prioritize relief for low and moderate income households, state and local governments, and small businesses.“We wouldn't need it if the pandemic was under control,” Rosengren said. “But since the pandemic is not fully under control, I think it has to be targeted to those sectors of the economy that's been most impacted by the pandemic.”‘Long way away’ from raising ratesRosengren said the Fed is a “long way away” from raising interest rates, adding that the conversation over a rate hike may not be an issue until “two or three years down the road.”Story continuesIn a speech Wednesday, Rosengren said the Fed would keep rates near-zero until the economy reaches maximum employment and inflation appears on track to moderately exceed its 2% target for some time.Last month, the Fed announced a new approach to inflation that would allow the central bank to “moderately” overshoot its 2% inflation target. The change is designed to compensate for years of undershooting its target, risking erosion of the Fed’s credibility in stimulating the economy during downturns.However, Rosengren said a caveat is that if financial stability issues arise, the Fed could raise interest rates. The Boston Fed chief added that low interest rates are a contributing factor in the buildup of leveraged firms now going bust.“The hope is that financial stability issues are not that serious and that we're able to fully keep interest rates low in order to meet our inflation goal that [we] set out in the statement,” Rosengren said.The next FOMC meeting is scheduled to take place November 4 and 5.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Congress debates leaning on Fed or PPP for small business aidPowell pushes on 'very strong, very powerful' guidance on interest ratesFed signals interest rates to stay near-zero through 2023Trump nominee Judy Shelton lacks votes for spot at the Fed, Sen. Thune saysA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}