{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-how-to-open-schools-the-right-way-this-fall-113727311.html", "published": 1597473920.0, "headline": "How to open schools the right way this fall", "body": "Of all the challenges COVID-19 has thrown at us, nothing is more daunting than figuring out how to open and operate schools this fall. The problems are complex, multifaceted and impact almost all of us. As an education official in Richmond, Virginia said: “...planning for reopening school this fall is like playing a game of 3-D chess while standing on one leg in the middle of a hurricane.”That’s a simile as powerful as it is apt. (It also kind of sounds like Mr. Spock-meets-Jumpin’ Jack Flash.)And this most fraught back-to-school of all time has begun of course. (Depending on where you live, kids return to school as early as the first week of August or as late as the second week of September. Every one of the nation’s 13,000 school districts has its own calendar. Ditto for colleges and universities.) But opening day is just the starting point. We are about to embark on a journey that will make the spring semester—send the kids home, turn on the internet and that’s it—look like child’s play.So yes, our nation has a massive, incredibly difficult and unprecedented task on its hands, but no, now is not the time to point fingers and whine about how we got into this mess. We simply have to sort things out and move forward. We should be incredibly grateful to the thousands of teachers, administrators, doctors and scientists who are working all day, every day to do just that.Because every district, institution, participant and location is unique, I’m loath to generalize, but what follows are some considerations that I think could help guide us.First though, some numbers.According to the National Center for Education Statistics, 56.6 million students attended elementary, middle and high schools in the U.S. last year, and 19.9 million students were enrolled at U.S. colleges and universities. In addition there are some 3.7 million teachers and 1.5 million college professors. That’s a lot of people. And that doesn’t include staff, coaches, bus drivers, etc.Story continuesReuters notes that “public education is one of the largest U.S. employment sectors, exceeding construction, hospitals, finance and insurance and transportation and warehousing. Total expenditures for these schools were $721 billion during the 2018 fiscal year, according to U.S. Census Bureau data...more than the U.S. Defense Department’s $705 billion budget request for fiscal 2021.” Closing schools cost some $50 billion a month to the U.S. economy, by some measures. And according to JPMorgan Chase, education accounts for about 6% of GDP, and “spillovers touch a much broader swath of the economy.”Going forward Bankrate reports that 61% of parents with school-aged children say remote learning during the 2020-21 school year would negatively impact their finances. Nearly three-fourths of parents say they plan to make major changes to their professional lives to accommodate the lack of child care.“Basically education and the public school system is a form of child care that allows parents to make contributions to the labor force. It raises the output of the economy,” says Sarah House, senior economist at Wells Fargo who co-authored a recent report on the pandemic’s effect on education and the workforce. House notes that the U.S. workforce has about 45 million people with kids under 18, which equates to about 30% of employed Americans.Given all that, even W.C. Fields would have to concede this business of young people is a big deal.OK, now here are the considerations.Understand trade-offs.“We definitely want to open our schools,” says Kristi Wilson, American Association of School Administrators president and superintendent of Buckeye Elementary School District in Arizona. “I think every superintendent, principal, student, and parent wants nothing more than that. [But] we just don’t want to risk lives putting people in non-safe environments. There’s no perfect answer. No win-win-win on this.”That’s right. We all want to open schools. We all want everyone to be safe. We all want to get our economy back in one fell swoop. And other stuff, like a full complement of fall sports. (Never mind that football brings in over $4 billion to major colleges and universities.) The problem is we just can’t have it all in America right now. And that’s painful and difficult.And so there is a tug and pull between science and everything else. The New York Times ran a graphic that indicates very few school districts are ready for a full opening. The CDC has guidelines as well. There’s no way though, decision makers will be as conservative as these numbers suggest they should be. No doubt some colleges for instance are being more aggressive about opening because of budgets. There are trade-offs galore here. And consequences.Pay attention to distinctions.Scientists are learning more about COVID by the hour. For instance, it appears to be the case that younger children and their classrooms are not germ factories when it comes to the coronavirus. In fact young children appear to be low transmitters. High schoolers on the other hand are likely to spread the disease just as easily as adults do.And then there’s college students who appear to transmit more, are less supervised and have a tendency to congregate, er party. “I’m hopeful that the culture of colleges will get them back towards public health measures,” says Yahoo Finance contributor Dr. Dara Kass of Columbia University Irving Medical Center. “I'm hopeful that younger children can stay in school. But if I had to take a guess I'm more bullish on the children than I am the college students.” And get this, right now we appear to be closing more elementary schools and opening more colleges, exactly the opposite of what we should be doing.Fourth grade teacher Krileshia Boyd speaks to her students at Northeast Lauderdale Elementary School in Lauderdale County, Miss., Monday, Aug. 10, 2020. Schools are reopening this week under new guidelines after being closed in March as the COVID-19 pandemic spread. School staff and students are both required to wear masks under an order signed by Gov. Tate Reeves last week. (Bill Graham/The Meridian Star via AP)Other considerations: Some communities have higher infection rates than others which of course will change over time and inform decision-making. Weather and changing weather will also inform. And then there’s money. Always money. Which schools have it and which don’t unfortunately will influence outcomes, at least until or if government aid levels the playing field. The CARES Act, passed in March, allocated schools around $17 billion. The great majority of it has yet to be disbursed. Now politicians are arguing over whether or not private schools can get aid. All this serves to accentuate wealth gaps, as well-funded private schools can make choices free of economic considerations, conferring even more advantages.Maximize flexibility. “I suspect we’re going to see changes in regulations up until the day freshman arrive on campus for their first day of orientation and it’s going to keep changing all through the fall semester,” says Dr. Robbie Goldstein who happens to be running for Congress in Massachusetts’ 8th District, which is around and includes part of Boston.I know a little bit about where the good doctor is coming from. I serve on the board of Bowdoin College and I can tell you the amount of thinking and planning that has gone into a limited opening of the school on August 29 and beyond has been massive. (See plan here.) As part of that planning, if there’s a spate of positive COVID-19 tests, the college hopes it has the right contingencies. Preparing for that scenario and others is of paramount importance.Whatever plan is implemented, it must allow for change. For better or for worse. In north Georgia, the Cherokee County School District “has directed 826 students and 42 teachers to quarantine as a result of exposure to COVID-19 after being back to school for only six days.” Bad news for the Etowah Eagles (Etowah H.S. reportedly being the school with the greatest number of students placed under quarantine.) Sadly, I bet the Eagles won’t be flying solo this fall.Parents need help from employers too, especially working women, says House of Wells Fargo. “We need to give workers flexibility if a child has a Zoom lesson from 10 to 12 so they can be sitting with them. Then maybe the employee can make up two hours in the evenings or first thing in the morning when kids are sleeping.”Here’s what doesn’t help. Waivers that some schools are making students sign. Legal beagles at some colleges and universities are attempting to protect themselves against possible legal blowback with legal liability waivers, according to Yahoo Finance’s Aarthi Swaminathan.“Institutions are basically trying to have it both ways,” Kevin McClure, associate professor of higher education at the University of North Carolina Wilmington, told Yahoo Finance. “They're trying to say: ‘We are opening in the midst of significant risk, and at the same time we want you — as students or faculty or staff — to assume that risk and to not hold us responsible for the decisions that we've made.’”Stop.Other schools are asking students to “narc” (remember that one?) on other students. Ehhhh…Stop that too.Adopt new models.I’ve always been impressed by Sal Khan, founder and CEO of Khan Academy, which offers free online learning for preschool up to college. Khan recently wrote in an Op-Ed for the New York Times that teachers shouldn’t simply port over what they were doing in the classroom to online.“Traditional lessons are...too long and not interactive enough to hold a student’s attention over a video conference,” Khan wrote. “Sessions need to drive conversations between students and teachers and among the students themselves. Teachers should do cold calling to ensure students are on their toes and to pull them out of their screens. Teachers need to constantly ask students to work on questions together and share their thinking. Teachers could ask students to submit recordings of themselves thinking out loud while taking an exam.”East College Prep High School senior Jocelyn Hernandez follows a remote Advanced Placement (AP) Calculus class while sitting in a community garden near her home, August 14, 2020 in the Boyle Heights neighborhood of Los Angeles, California. - Due to the continuing coronavirus pandemic all Los Angeles Unified School District (LAUSD) schools will be closed and students will return to class via remote learning when the 2020-21 school year starts on August 18, 2020. (Photo by Robyn Beck / AFP) (Photo by ROBYN BECK/AFP via Getty Images)“I’ve noticed that some teachers are replicating their lectures in YouTube video form, and this has been incredibly time consuming and depleting for them,” Khan continued. “But doing this isn’t necessary...video lessons on almost every topic already exist on the internet.” Khan also noted that there’s a huge need to ensure all students have access to the internet, a subject I wrote up last week.There are a slew of other models and startups as well. For instance, Victoria Ransom, a former product manager at Google, founded a company called Prisma, which bills itself as “the world's first co-learning network that gives kids the freedom to be their best selves.” In others words, Prisma organizes online ‘pods’ for kids to learn with and from each other.And remember MOOCs (Massive Open Online Courses)? Maybe their time has finally come. “Education is one sector of the economy where we haven’t had big productivity enhancements. We teach, what, 20 or 30 kids in a class now; the same amount in 1920,” says Michael Feroli, Chief U.S. Economist at JPMorgan Chase. Feroli adds that there may have been some “reluctance to embrace MOOCs,” and that it may be time to lose that reluctance.Prioritize constituencies.Think about everyone connected to schools: Students, teachers, staff, coaches, parents, community, sports fans (sometimes TV networks), and on and on.They have conflicting wants and needs in the best of times. Now? Well you can imagine.Take parents. (Please!) Some are outraged by their kids’ school being: open, or closed, or partly open. Both my parents were teachers—my mother at the elementary level and my father a college professor (I know, it explains a lot)—and they would tell me that some parents were always griping. (Art classes switching to acrylic paints from oils. Or vice versa.) In today’s helicopter environment parents complain more and louder. And the loudest ones watch a lot of cable TV news.Consider bus drivers for a minute. Maine Governor Janet Mills pointed out on public radio this week that certain districts in her state had much longer bus rides than others, which would require drivers to essentially become health proctors for hours every day. (Not just, ‘Sit down!’ But also “Separate yourselves! “Put your mask back on!”) Who trains these drivers, (some of whom may be older, or in higher risk groups)?”It has to be toughest on teachers though. After all, they’re on the front lines. “Unfortunately this country is now reaping the consequences of decades of underinvestment in our public schools,” says Mark Weber, a K-8 teacher in New Jersey and a special analyst for education policy at the Education Policy at the New Jersey Policy Perspective. “You can’t automatically make buildings have adequate ventilation when for years you were putting off making a meaningful investment. You can’t automatically cut down the size of classes when for decades you have not been providing enough resources so they can have small class sizes. I see people talking about taking kids outside for class, but human beings built buildings for a reason. Outside is not nice a lot of times.”And then this super important contingent: Kids in need. In normal times U.S. public schools provide 30 million free or nearly-free meals a day. “We are busing lunch out into communities through bus routes, where students had normally walked to the bus stop, they now walk to the bus and pick up lunch,” says Wilson of the Buckeye Elementary School District in Arizona. “We have a lot of mobile home parks and we deliver to those parks. We work really diligently to make sure no child is without a meal.”So much to work out, roll with and solve, right? It’s super important we get it as right as possible.“The inability of the school system to provide education this year won’t necessarily show up in growth outcomes next year, but could show up in growth outcomes in many years to come,” says Feroli of JPMorgan Chase. That needs to be mitigated.Some teachers are clearly up for it.“I’m not saying there won’t be educational damage, emotional damage and that won’t reflect in the economy, but kids are tough,” says Mark Weber of New Jersey.” We’ve bounced back from two world wars, we can come back from something like this.”That’s the spirit Mark.So while this semester may be a one-legged, brainiac chess match in a crossfire hurricane, it’s not going to be World War III.We can do this.This article was featured in a Saturday edition of the Morning Brief on August 15, 2020. Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeAndy Serwer is editor-in-chief of Yahoo Finance. Follow him on Twitter: @serwer.Read the latest financial and business news from Yahoo FinanceRead moreHere's what Bill Gates and Warren Buffett talk about during COVID-19Inside Amazon, Apple, Facebook and Google versus the FedsHow to get out of the COVID-19 testing messBillions or trillions: The great coronavirus trade-offWhat America can learn about reopening from the state of MaineWhat will everything look like after the coronavirus"}]}