{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-extra-unemployment-benefits-155100583.html", "published": 1596279560.0, "headline": "Coronavirus stimulus: Extra unemployment benefits cannot restart for at least several weeks, experts warn", "body": "The Senate adjourned on Thursday evening without Republicans and Democrats reaching a deal on the next stimulus package amid the coronavirus pandemic, meaning the extra $600 in unemployment benefits expired after Friday.And regardless of whether Congress agrees to resume the extra $600 per week or decreases the amount to $200 — as some Republicans propose — experts say that roughly 30 million jobless Americans collecting benefits will not receive any extra stimulus for several weeks.“It's going to take maybe three to four weeks to ramp it back up again” after any deal, Gbenga Ajilore, a senior economist at the Center for American Progress, a non-profit for public policy research and advocacy, told Yahoo Money.Senate Majority Leader Mitch McConnell, a Republican from Kentucky, wears a protective mask while arriving to a Senate Republican luncheon on Capitol Hill in Washington, D.C., U.S., on Tuesday, July 28, 2020. (Photo: Stefani Reynolds/Bloomberg via Getty Images)To simply restart the extra $600 now that they’ve expired would take up to five weeks, according to an estimate by the National Association of State Workforce Agencies (NASWA) provided to Yahoo Money by The Committee on Ways and Means.“A month is a pretty good bet,” Michele Evermore, senior policy analyst at the National Employment Law Project, told Yahoo Money.After Congress passes a deal, the Department of Labor would have to issue regulations that states implement. Each step of that process — starting with deadlocked negotiations — will require time.Meanwhile, the median decrease in unemployment benefits Americans will now see would range from 52% to 72%, according to an analysis by Evercore ISI provided to Yahoo Money.Unemployed Americans will see a drop in their unemployment benefits between 52% to 72%, according to an analysis by Evercore ISI. Graphic: David Foster / Yahoo Finance“Imagine waking up and making half to a quarter of what you made the day before,” said Ernie Tedeschi, a managing director, and policy economist for Evercore ISI previously told Yahoo Money. “It's like a self-inflicted recession.”The $2.2 trillion CARES Act provided an extra $600 in unemployment benefits that were set to expire at the end of July. The Democrat-controlled House of Representatives passed the $3 trillion HEROES Act, which would have extended extra UI benefits among other stimulus measures, through the end of the year. The Senate never considered the HEROES Act.Story continuesBy the time Congress actually began negotiating an extension in late July, it was already technically too late. Most states pay those benefits on weeks ending on Saturday or Sunday, so July 25 or July 26 was the last time jobless Americans got the extra $600.“Republicans just came to the table in the middle to the end of July to start the negotiations,” Ajilore. “The question is what the Republicans and the White House were doing all the month of June and early July.”Yahoo Money sister site Cashay has a weekly newsletter.‘Outside of a pandemic, we would give them two years to conform’On July 27, the GOP released a stimulus proposal calling for cutting the extra unemployment benefits to $200 a week through September and then ultimately transitioning to unemployment benefits that replace only 70% of wages.On Thursday, hours before Congress adjourned, Republican senators including Mitt Romney (R-UT) introduced an alternative unemployment benefits legislation allowing states to choose between reducing the unemployment benefits to an 80% wage replacement rate or gradually reducing the extra benefits to each month.Read more: Do you have to pay taxes on unemployment benefits?Carlos Ponce joins other demonstrators participating in a protest asking Senators to support the continuation of unemployment benefits on July 16, 2020 in Miami Springs, Florida. (Photo by Joe Raedle/Getty Images)Both Republican proposals suggest using a different approach to distributing the extra benefits — based on wage replacement rate — which would take months to reprogram due to the complexity of how different states calculate unemployment benefits.“Ordinarily if we were to ask states to do something like that, outside of a pandemic, we would give them two years to conform,” Evermore said about the wage replacement approach. \"That's how it usually works.”Some Republican senators and President Donald Trump hinted at a short-term extension of the extra $600, but Democrats rejected that idea. Evermore said the temporary extension wouldn’t have worked anyway.“The temporary extension that they were talking about,” she noted, “that wouldn't kick in for a couple of weeks.”Denitsa is a writer for Yahoo Finance and Cashay, a new personal finance website. Follow her on Twitter @denitsa_tsekova.Read more:Rich Americans' pullback in spending is hurting the economic recoveryEven as GDP tanked, personal income grew thanks to government supportRead more personal finance information, news, and tips on CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and Reddit."}]}