{"article": [{"url": "https://finance.yahoo.com/news/the-upside-of-trumps-4th-of-july-fireworks-184709504.html", "published": 1593525320.0, "headline": "The upside of Trump's Fourth of July fireworks", "body": "President Trump plans to headline fireworks at Mount Rushmore on Friday to kickstart Fourth of July celebrations.Some worry that the fireworks could draw crowds in South Dakota and cause the coronavirus to spread, as cases surge in states like Texas, Florida and California.But for the fireworks industry, which, like so many others, has been devastated by the pandemic and lockdowns, the president’s plan is a welcome event.“We’ve been celebrating it for 244 years. Everything that is Americana is fireworks and celebration,” Stephen Pelkey, CEO of fireworks display company Atlas PyroVision Entertainment, told Yahoo Finance.“We celebrate victories, we celebrate our nation’s independence,” said Pelkey.The pandemic could not have hit at a worse time for the fireworks industry, which makes the bulk of its profits in June and July.The fireworks industry has grown over the past decade. In 2019, consumer fireworks revenue hit $1 billion, compared with $636 million in 2010. Display fireworks brought in $375 million in revenue, vs. $316 million in 2010, according to the American Pyrotechnics Association.As coronavirus hit the U.S. in mid-March, major sporting and entertainment events got cancelled, along with their need for celebratory fireworks. Hopes for an economic rebound in July fizzled as many cities and towns across the country cancelled their Fourth of July fireworks. The industry projects a more than 70% loss in annual revenue in 2020.In this Friday, June 19, 2020 photo, fireworks explode during Juneteenth celebrations above the Bedford-Stuyvesant neighborhood in the Brooklyn borough of New York. (AP Photo/John Minchillo, File)Many pyrotechnic companies have been left with large quantities of explosives, which they’ll be forced to store year round.“You have 150 major pyrotechnic live entertainment companies across the country that are storing in excess of 10 million pounds of low explosives,” said Pelkey, who also serves as secretary of the American Pyrotechnics Association. “With all mass gatherings cancelled, all of these display companies are forced to comply with strict ATF regulations for securing and insuring all of this inventory.”Story continuesThe fireworks industry is asking Congress for relief to deal with explosive storage costs and lost sales.“Many of these small multigenerational family businesses are just trying to stay alive until the next Fourth of July. And in order to do that, they’re going to need in excess of $2 million in loans that they’re not getting right now,” Pelkey said. “Most of them have been capped at $500,000 or $150,000 and they’re just not going to get there.”Access to more small business forgivable loans would help support the fireworks industry, explained Pelkey. He hopes that in the next round of fiscal stimulus, lawmakers will make more Economic Injury Disaster Loans available to the fireworks industry.More from Sibile:The case for higher wages during coronavirus recessionMaster P on Aunt Jemima, Uncle Ben’s: ‘Those are not real people’How JPMorgan Chase is making banking ‘cool’ for black teenagersKareem Abdul-Jabbar on how Bruce Lee beat the system, fought racismKareem Abdul-Jabbar on George Floyd protests: Black Americans have been playing catch-up economically since the Civil WarFind live stock market quotes and the latest business and finance news"}]}