{"article": [{"url": "https://finance.yahoo.com/news/sen-toomey-fed-gets-good-marks-on-crisis-response-192235011.html", "published": 1592490620.0, "headline": "Sen. Toomey: Fed gets ‘good marks’ on crisis response", "body": "Despite grilling Federal Reserve Chairman Jay Powell on the central bank’s corporate bond purchases earlier this week, Sen. Pat Toomey (R-PA) says the Fed gets “good marks” for its response to the economic crisis spurred by the COVID-19 pandemic.“We need to follow very carefully what the Fed and the Treasury are doing,” Toomey told Yahoo Finance on Thursday. “But I think so far, they have complied with the law and I think so far it looks like it’s been successful.”On Tuesday, Toomey pressed Powell on the Fed’s efforts to backstop the corporate debt market by purchasing corporate bond ETFs and, as of this week, individual corporate bonds in the secondary market. Responding to the Republican’s concerns that the purchases may “diminish price signals” in the market, Powell said the Fed is trying to ensure that markets continue to function properly.“I don’t see us as wanting to run through the bond market like an elephant doing things and snuffing out price signals or anything,” Powell told the Senate Banking Committee. “We want to be there if things turn bad in the economy.”Toomey said Thursday that he remains skeptical of the need for those purchases, arguing that high levels of corporate debt issuance and tightening spreads are tell-tale signs of bond market health.“It's not clear to me that this activity needs to continue at all at this point,” Toomey said.The Fed is facing scrutiny from Toomey and other members of the Congressional Oversight Commission, a bipartisan and bicameral group tasked with overseeing the Fed and U.S. Treasury’s use of the $500 billion appropriated to them through the Coronavirus Aid, Relief, and Economic Security (CARES) Act.About $454 billion of that pot was set aside for liquidity facilities, of which the Fed and the Treasury have used up only $195 billion. The Fed has announced 11 facilities, including the Secondary Market Corporate Credit Facility referenced in Toomey’s questioning. The Fed also has a Primary Market Corporate Credit Facility that could directly purchase bonds from corporate issuers, but has yet to officially open that facility.Story continuesThe commission released its second report on Thursday, questioning the Fed’s decision to target the bond market through ETFs and individual bond purchases in the secondary market. The report argued that if the Fed’s goal was to ensure access to capital on the primary market, “it is unclear why the PMCCF alone does not serve that function.”Next stepsToomey said the Fed had broadly done well with its crisis response, adding that he will specifically be watching its effort to offer loans to Main Street businesses.WASHINGTON, DC - MARCH 03: Federal Reserve Chair Jerome H. Powell announces a half percentage point interest rate cut during a speech on March 3, 2020 in Washington, DC. (Photo by Mark Makela/Getty Images)The Fed’s Main Street Lending Program, which officially launched for lender registration on Monday, will offer five-year loans to businesses with less than 15,000 employees or less than $5 billion in annual revenues. The Fed hopes to offer similar loans to nonprofits, like universities and charitable organizations, through an extension of the facility.Toomey said success will have to be measured in figures other than the number or dollar amount of loans through the facility.“We shouldn’t automatically assume that if the take-up is low that it is a failure,” Toomey said. “Because it could be that the take-up is low because borrowers are able to go and draw down on bank lines and get the liquidity they need through private sources.”Toomey expressed optimism over the re-openings of parts of the economy, even though some states in the process of reopening, such as Texas, have seen hospitalizations rise.Powell has warned that a slow slog in getting people back to work may require Congressional work on extending the $600-per-week unemployment insurance benefit, which is set to expire in July. But Toomey did not embrace Powell’s recommendation for more fiscal help.“It’s not obvious to me that we need to load the money cannon and fire that off again,” Toomey said.Toomey warned of the rising federal debt, adding that lawmakers will be “cautiously” approaching future legislation.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Powell urges Congressional help for unemployed, municipalities as economy recovers from coronavirusPowell: Fed trying not to 'run through the bond market like an elephant'Fed proposes expanding Main Street loan program to nonprofitsFed to expand purchases of corporate bonds in secondary marketA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}