{"article": [{"url": "https://finance.yahoo.com/news/student-loans-borrower-defense-court-ruling-trump-151811806.html", "published": 1593339980.0, "headline": "Landmark court ruling on student borrower defense flies in face of Trump veto", "body": "A federal court ordered the discharge of student loans under an Obama-era borrower defense rule for the first time on the same day that a vote to override President Trump's veto related to the same rule failed in the House.The implications of Friday's events bring more uncertainty to hundreds of thousands of affected borrowers as the watershed court ruling faces a potential appeal and consumer advocates vow to continue fighting the Trump administration's repeal of rules designed to protect defrauded student borrowers.U.S. President Donald Trump looks toward Secretary of Education Betsy DeVos before he announced a Historically Black Colleges and Universities (HBCUs) initiative at the White House in Washington, U.S., February 27, 2018. REUTERS/Kevin LamarqueMassachusetts ruling grants debt relief to 7,200On Friday afternoon, a federal judge ordered the Department of Education (ED) to cancel roughly 7,200 former Corinthian Colleges’ student debt in Massachusetts.“Thousands of Massachusetts students cheated by Corinthian have finally had their day in court, and they have won,” Massachusetts Attorney General Maura Healey stated. “This landmark victory for students will cancel the federal loans for thousands of defrauded borrowers, mostly Black and Latinx students, targeted by a predatory for-profit school and abandoned by Secretary DeVos and the Trump Administration. For five years, our office and the Project on Predatory Student Lending have fought to win students the relief they deserve and today we have won decisively.”An Everest College campus in Santa Ana, California.Beyond erasing debt for the defrauded students, who had attended Everest schools operated by now-defunct for-profit giant Corinthian, the decision instructed the ED to make borrower defense to repayment process less opaque.But while the Massachusetts ruling only applies to the 7,200 members of the class action suit (which may face an appeal by ED or the Department of Justice), the remainder of borrower defense applicants are uncertain. Defrauded students previously told Yahoo Finance that their claims continued to be denied.Those applications were deemed to be ineligible for loan forgiveness, even though some of the students had not even obtained a degree and could neither transfer their credits to complete it nor access further federal funding to support a fresh start.Story continuesAbout 200,000 to 300,000 defrauded students have filed an application for debt relief but are still in the queue or have been recently deemed ineligible (and are able to appeal). The Massachusetts ruling provides hope for similar class actions suits.(Graphic: David Foster)Debt relief made harder for future applicantsThe Massachusetts ruling is good news for past student borrowers who allege fraud, while a failure to override a presidential veto on the same day is bad news for future student borrowers.In May, President Donald Trump vetoed a bipartisan resolution passed both by the House and the GOP-controlled Senate that aimed to re-establish a loan forgiveness policy designed in 1995 and bolstered during the Obama administration.On Friday, House Democrats Capitol Hill failed to secure sufficient votes to override the Trump veto on borrower defense. The chamber voted 238-173 on H.J.Res 76, failing to secure a two-thirds majority that was needed to override the presidential veto.“Today the House has one final opportunity to ensure the defrauded students get the relief they deserve by overriding that veto,” Congressman Bobby Scott (D-VA) argued on the floor of the House on Friday morning, prior to the vote. “I urge my colleagues to vote to override the president’s veto.”A campus of now-defunct for-profit college ITT Technical Institute sits closed and empty on Tuesday, September 6, 2016. (Photo: Jahi Chikwendiu/The Washington Post via Getty Images)Trump-appointed Education Secretary Betsy DeVos dismantled the established borrower defense policy in July 2019 by changing how the ED processed debt relief claims made by students who had been defrauded by mainly for-profit colleges that were deemed predatory. The new policy goes into effect on July 1, 2020.“The DeVos rules will limit relief to only about 3% of defrauded student borrowers, and only 1% of schools guilty of misleading students would have to reimburse taxpayers, leaving hundreds of thousands of students trapped deep in debt with no job and a worthless degree,” the National Consumer Law Center said in a press release.New America’s Wesley Whistle, who was following the vote on Friday, told Yahoo Finance that the new policy does not bode well for defrauded student borrowers or American taxpayers.“DeVos's rule fails to protect students or taxpayers because it lets sham colleges off the hook and shifts the burden to students,” Whistle said. “And when those students default on their loans, that costs taxpayers too.”Ben Miller at the Center for American Progress agreed with that sentiment.“From the start, this administration has sat on its hands while tens of thousands more borrowers lawfully seek relief,” Miller said. “And it has denied significant relief to students inarguably ripped off by predatory actors such as Corinthian Colleges through innumerate formulas that do things such as deny full relief to borrowers for not having negative earnings.”—Aarthi is a writer for Yahoo Finance. She can be reached at aarthi@yahoofinance.com. Follow her on Twitter @aarthiswami. Read more: 19 attorneys general sue Education Secretary Betsy DeVos over gainful employment ruleCalifornia AG sues Betsy DeVos for overturning Obama-era rule aimed at for-profit collegesTeachers union sues Betsy DeVos for overturning Obama-era ruleRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}