{"article": [{"url": "https://finance.yahoo.com/news/teslas-stock-hits-2000-as-bulls-run-wild-165757843.html", "published": 1597938080.0, "headline": "Tesla's stock hits $2000 as bulls run wild, market cap zeroes in on $400B", "body": "Tesla (TSLA) extended its rally on Thursday, spiking decisively above $2000 per share and setting a new record high ahead of an expected 5 to 1 stock split, and its soon-to-be inclusion in the S&P 500 Index (GSPC).The eco-friendly car maker’s stock, currently one of the most expensive on Wall Street and up nearly 7%, has been soaring without an immediate catalyst. Tesla rose as high as $2021.99 before paring those gains to close at $2,001.83.Yet CEO Elon Musk, a prolific voice on Twitter who’s courted multiple controversies with regulators and investors with his posts, has exulted as Tesla rallies to new heights — in the process burning the bearish short-sellers arrayed against the shares. The company is also bolstered by a vocal and passionate core of supporters among its investor class.However, the good news has been stacking up for a company that spent much of last year under withering pressure from analysts and investors. Its market capitalization — currently nearing $400 billion — dwarfs that of its more established competitors in the auto space, including General Motors (GM), Ford (F), and BMW, the German luxury car purveyor (BMW).Most recently, Tesla posted a surprise second-quarter profit with the electric car-maker delivering more vehicles than expected despite virus-related disruptions. And as consumer demand for electric vehicles (EV) grows both domestically and internationally, Teslas account for nearly 82% of all EVs sold in the U.S. during the first half of the year, according to data from Buy Shares. According to the data, 71,375 Teslas EV models were sold, led by the company’s booming Model 3.Wedbush Securities, which earlier this week predicted a move to $1900, expects the car maker to extend its grip on the all important Chinese market this year — reaching 150,000 vehicles delivered.“It’s about pent-up demand,” Analyst Dan Ives told Yahoo Finance’s The First Trade.However, other analysts see risks to a stock that, while wrongfooting short-sellers, still faces significant headwinds.Story continuesDavid Trainer, CEO of investment research firm New Constructs, said in a research note earlier this month that investors will eventually “wake up to Tesla’s competitive disadvantages and knock the stock down to $250-300/share where a white knight buyer might scoop it up.”He added that Tesla’s bulls “tend to overlook the slow, but deliberate and large, entrance that incumbent automakers will make in the electric vehicle market. By 2025, these firms are expected to sell ~3.1 million EVs, which is significantly more than even the most optimistic estimates for Tesla sales in 2025.”Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}