{"article": [{"url": "https://finance.yahoo.com/news/powell-congress-should-prioritize-unemployment-insurance-help-to-municipalities-200942721.html", "published": 1592407040.0, "headline": "Powell urges Congressional help for unemployed, municipalities as economy recovers from coronavirus", "body": "Federal Reserve Chairman Jerome Powell on Wednesday specifically recommended that Congress extend unemployment insurance benefits, support state and local governments, and funnel more help to cash-strapped small businesses.Historically, the central banker has shied away from providing recommendations on what policies Congress should pursue. However, Powell expressed concern that an emerging recovery from the coronavirus pandemic could prompt lawmakers to curtail support prematurely.“I would think that it would be a concern if Congress were to pull back from the support that it is providing too quickly,” Powell said in virtual testimony to the House Financial Services Committee. He repeated that both the Fed and Congress should be prepared to do more based on the trajectory of the recovery.Through the Coronavirus Aid, Relief, and Economic Security (CARES) Act passed in late March, those laid off from their jobs during the crisis are entitled to receive up to $600 a week in additional unemployment insurance. However, the additional payment only lasts through July.Powell added that while the May jobs report showed Americans going back to work fairly quickly, not all industries should expect to see rehiring right away. In high-contact services industries like food and accommodation, travel, and tourism, Powell warned that unemployment benefits may be needed past July, as unemployment could persist for a while.“I think better to keep them in their apartments, better to keep them paying their bills,” Powell said, declining to offer recommendations on specific policies.Over the last few weeks, the Fed has emphasized that more help may be needed from monetary policy in addition to fiscal policy. In a speech Tuesday night, Fed Vice Chairman Richard Clarida acknowledged the central bank’s unprecedented effort to ease financial conditions “may not prove to be durable, depending on the course that the coronavirus contagion takes.”Story continuesThere are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Municipal helpFed chairs are usually reluctant to offer recommendations on fiscal policy, part of the central bank’s efforts to insulate its actions from the politics of Capitol Hill.But amid the COVID-19 crisis, Powell has gradually offered more commentary on Congressional actions, in part because much of the Fed’s emergency actions are rooted in the CARES Act.The Fed has launched eleven liquidity facilities as part of an unprecedented response to backstop a collapsing economy. Those include aid to corporate debt markets and loans to Main Street businesses, many of which are backed by over $200 billion of the $454 billion pot of money appropriated to the Fed and the U.S. Treasury via the CARES Act.In May, Powell deflected a question about what to do about municipalities across the country facing funding gaps, due to income and business tax bases drying up from the COVID-19 crisis.“We try to stick to our knitting over here,” Powell said in testimony to the Senate on May 19.Powell’s tone was markedly different on Wednesday, as he expressed concern that budget shortfalls are already leading to widespread layoffs in state and local governments. In April, 981,000 state and local government jobs were lost, and even the overall positive May jobs report detailed another 571,000 job losses in the sector.“It will hold back the economic recovery if they continue to lay people off and if they continue to cut essential services,” Powell warned.Powell said direct support for municipalities would be “worth looking at.” For the Fed’s part, the central bank has stood up a Municipal Liquidity Facility to offer loans to states, local governments, and even some public authorities (like the New York Metropolitan Transit Authority).Powell emphasized that small businesses would also need further support, warning that some businesses may not be “well served” by Paycheck Protection Program (PPP) loans that cannot be converted into a grant. Based on recent tweaks to the program, a PPP loan is only forgiven if at least 60% of the borrowed amount is used towards keeping employees on payroll.“We don’t want to lose any more small businesses than we have to,” Powell said.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Powell: Fed trying not to 'run through the bond market like an elephant'Fed proposes expanding Main Street loan program to nonprofitsFed to expand purchases of corporate bonds in secondary marketFederal Reserve grapples with links between monetary policy and income inequalityA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}