{"article": [{"url": "https://finance.yahoo.com/news/nascar-exec-says-bubba-wallace-has-thrived-under-intense-scrutiny-114435849.html", "published": 1592895140.0, "headline": "NASCAR exec says Bubba Wallace has thrived 'under intense scrutiny'", "body": "NASCAR has held the attention of the entire sports world this month—driven by Bubba Wallace, the only black full-time driver in the NASCAR Cup Series.The Cup Series returned on May 17 at Darlington Raceway in South Carolina, after hitting pause in mid-March. After the UFC on May 9, NASCAR was the first major sport to return to competition after coronavirus lockdown, filling a long gap in live U.S. sports broadcasting. It has held nine races since returning, and the TV ratings have been strong.On June 8, amid the ongoing national social justice protests after the May 25 death of George Floyd in Minneapolis police custody, Bubba Wallace appeared on CNN and called for his sport to ban Confederate flags, a longtime staple at NASCAR races on t-shirts, hats, and fan vehicles in parking lots. The change took just two days. On June 10, NASCAR banned Confederate flags at its events.Just a few hours later, Wallace raced at Martinsville Speedway in Virginia in an all-black #BlackLivesMatter car and had his best-ever finish (No. 11) at the course. The conversation around the sport continued on social media.“It's been a big couple of weeks,” NASCAR executive vice president Daryl Wolfe told Yahoo Finance on Friday. “We are really proud of Bubba Wallace and the way he's handled a very delicate, sensitive situation... He's under intense scrutiny right now, and he's done a wonderful job talking to this issue. Listen to the other drivers and competitors and how they're educating and listening and making sure they have a transparent dialogue... I'm really encouraged at the direction that we're on right now.”Bubba Wallace, driver of the #43 Richard Petty Motorsports Chevrolet, wears a \"I Can't Breathe - Black Lives Matter\" t-shirt under his fire suit in solidarity with protesters around the world taking to the streets after the death of George Floyd on May 25 , stands next to his car painted with \"#Black Lives Matter\" prior to the NASCAR Cup Series Blue-Emu Maximum Pain Relief 500 at Martinsville Speedway on June 10, 2020 in Martinsville, Virginia. (Photo by Jared C. Tilton/Getty Images)That was all before Talladega.On Sunday afternoon, before the start of the Geico 500 at Talladega Superspeedway in Alabama, a number of fans toted Confederate flags from trucks (outside of the speedway facility), and someone flew a small plane over the track towing a Confederate flag and a banner that said, \"Defund NASCAR.”That same afternoon, a member of Wallace’s team found a noose in his racing stall. NASCAR said in a statement, “We are angry and outraged, and cannot state strongly enough how seriously we take this heinous act.” NASCAR vowed to investigate, as did the FBI and the Department of Justice’s Civil Rights Division.Story continuesThe race was delayed one day due to lightning. Before the start of the race on Monday, the entire field of drivers made a public display of rallying around Wallace by pushing his car to the starting line. Wallace finished the day No. 14, his best career finish at Talladega, after holding third for a period of time and even leading the entire field for one lap. Ryan Blaney won the day in a thrilling photo finish.Alex Hayden, a NASCAR radio announcer on Motor Racing Network, reflected on air, “In my opinion, our sport has never been tighter and has never had as much positive energy than it does today.”Talladega was just the second race since NASCAR’s return from lockdown that allowed fans. The sport allowed 1,000 fans on June 14 at Homestead-Miami Speedway, and brought in 5,000 fans at Talladega.After the race, Wallace greeted a group of first-time fans, many of whom were wearing Black Lives Matter shirts. The significance of the moment was not lost on him. “The sport is changing,” he declared in an interview. “The deal that happened yesterday, sorry I’m not wearing my mask, but I wanted to show whoever it was that you’re not going to take away my smile, and I’m going to keep on going... I know I should have won that damn race, I ran out of gas... but all in all, we won today.”Regardless of where Wallace finishes each race, he will likely continue to be a focal point for the rest of the 2020 Cup Series. His mother Desiree Wallace, speaking on “The Joe Madison Show” on Sirius XM on Monday, said her son has dealt with racism in the sport before: “This is not his first incident. If he gets into it with another driver, they’re quick to bring out the n-word.”By Tuesday evening, the FBI completed its investigation into the “noose” found in Wallace’s stall on Sunday: it was not a hate crime, but a “garage door pull rope fashioned like a noose” that had been there since October, NASCAR said in a statement. “This was obviously well before the 43 team’s arrival and garage assignment. We appreciate the FBI’s quick and thorough investigation and are thankful to learn that this was not an intentional, racist act against Bubba.”The mixup is embarrassing for NASCAR, but doesn’t lessen the impact drivers made with their show of support for Wallace on Monday.As for NASCAR, the organization is well aware that its ban on Confederate flags outraged many of its core fans, the same people who showed up at Talladega displaying the flags to prove a point. But the sport can’t backpedal now.Wolfe told Yahoo Finance about the ban, “At the end of the day, the bottom line is this: We want our sport and our events to be welcoming to all and inclusive to all, and that's exactly what we're going to do.”This post was updated at 6:40pm EST on June 23 with the FBI’s findings on the “noose” incident.—Daniel Roberts is an editor-at-large at Yahoo Finance and focuses on sports business. Follow him on Twitter at @readDanwrite.Read more:NASCAR's only black driver Bubba Wallace changed the sport forever in 2 daysReebok ends its CrossFit sponsorship over CrossFit CEO's tweet about George FloydNike is setting the tone for sports brands in its response to the George Floyd protestsDrew Brees on potential return of NFL kneeling protests: 'I will never agree with anybody disrespecting the flag'Under Armour has a chance to radically shift its strategy out of coronavirus—but will it?DraftKings completes merger that brings it public, with no sports going onCoronavirus could have long-lasting impact on live sports ticket salesMLS Commissioner: Playing in empty stadiums would be particularly bad for usCoronavirus hits sports leagues: March Madness canceled; NBA, NHL, MLS seasons on hold"}]}