{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-astra-zeneca-oxford-vaccine-shows-promise-spiking-cases-ramp-up-fear-factor-185911791.html", "published": 1595254040.0, "headline": "Coronavirus update: AstraZeneca/Oxford vaccine shows promise; spiking cases ramp up fear factor", "body": "With the U.S. coronavirus case count zeroing in on 4 million, health experts ramped up their calls for a stronger federal leadership, as the world’s largest economy’s struggles against the virus underscored the urgency of the situation.Led by epicenters in Brazil, India and the U.S., skyrocketing cases around the world are nearing 15 million, even as new developments in the search for a potential vaccine are stoking optimism. On Monday, AstraZeneca (AZN) said its experimental COVID-19 vaccine was safe and produced an immune response in early-stage clinical trials.According to the U.S. Surgeon General Jerome Adams, a slowing number of deaths are due to a variety of treatment protocols that include Gilead’s (GILD) remdesivir, the generic drug dexamethasone as well as convalescent plasma therapy; still, there are new reports of increased casualties which are lagging the surging cases.Meanwhile, cases do appear to be leveling off in some hard-hit states like Arizona and Florida and California — all of which reported slower case rates on Monday that were lower than the prior 7-day average. The Sunshine State, which has seen roughly 10,000 new cases daily, and the Lone Star State are among the biggest concerns, yet Idaho has also emerged as a new worry.On Twitter, Harvard Global Health Institute director Ashish Jha pointed out the state — along with other rural areas — has seen a “very concerning rise” in cases. It bodes poorly for the ability to grapple with hospitalizations as the surge continues, and a fierce debate escalates over the need for a nationwide public masking policy.Vaccines race aheadOnly five states are seeing at least a 10% decline in cases. (Graphic: David Foster/Yahoo Finance)Promising coronavirus vaccine news emerged Monday from Oxford University’s candidate, which is being developed in partnership with AstraZeneca, showing 100% effectiveness in producing an immune response after two shots.Yet it is still an open question about how long the protection against the virus will last.Separately, Moderna (MRNA) and Pfizer/BioNTech (PFE) (BNTX) are part of an exclusive club of pharma giants developing a COVID vaccine. Both other candidates have also cleared early stage trials with positive results and are progressing ahead in clinical trials.Story continuesPfizer has also secured a deal with Britain for 30 million doses of its candidate, if successful. The UK also has a deal in place for the Oxford vaccine, including with AstraZeneca and the Serum Institute of India, which has promised 1 billion doses.July is shaping up to be a decisive month in the race for a cure, as results were due for some trials. Among the afore-mentioned candidates is China’s frontrunner CanSino, whose seults of a Phase 2 trial were also released Monday.Meanwhile in India, the country’s first vaccine candidate has begun the first phase of its clinical trials. Covaxin, produced by Hyderabad-based Bharat Biotech, will enroll more than 1,100 individuals for its Phase 1 and 2 trials.Impact on other drugsAmid increasing hopes for a COVID-19 cure, new studies are underscoring the virus’ impact on the health sector, particularly drugs. SingleCare, a discount pharmacy program, has tracked prescription trends since the start of the pandemic.CEO Rick Bates told Yahoo Finance Monday that at the start of the outbreak there was a 500% increase of flu vaccines administered, likely in hopes of preventing the coronavirus — as the two were being compared at the time in mid-March. Yet more people are filling longer prescriptions to avoid having to go out as often.“Our 90-day prescriptions are up about 30% year-over-year, and that growth I think is going to hold as we watch...this resurgence of cases throughout the country,” Bates said.And as mental health needs have skyrocketed amid the lockdowns, anti-depressants have spiked 50% year over year, Bates said.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube.Yahoo Finance’s The Market Wake-Up"}]}