{"article": [{"url": "https://finance.yahoo.com/news/economic-data-point-to-labor-market-flatline-july-morning-brief-100306152.html", "published": 1596690680.0, "headline": "All signs point to a labor market flatline in July: Morning Brief", "body": "Thursday, August 6, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeA summer lull after a roaring spring recovery.In May and June, the U.S. economy started showing notable signs of life after an early spring shutdown.More than 7 million jobs were added back to the economy after 20.8 million jobs were lost in April. Consumer spending rebounded sharply, with retail sales getting all the way back to its pre-pandemic trend in June.But data in recent weeks has shown the economy stalling out in July as the number of COVID-19 cases rose across the country.On Wednesday, ADP’s private payroll data for July showed that just 167,000 private sector jobs were created last month, far short of expectations. And it is worth noting at this point in the recovery that “created” jobs are really just positions that were reclaimed after shutdown measures were imposed nationwide in March.Ian Shepherdson, chief economist at Pantheon Macroeconomics, said in a note Wednesday that the ADP data squares with data from Homebase, a small business employee management provider, which showed a slowdown in demand for working hours last month.“This is a disappointing result,” Shepherdson said, “and with the August payroll survey period coming next week amid a continuing gentle slide in the Homebase numbers, the next ADP report is shaping up to be flat at best; it could easily dip.”Private payroll readings from ADP and data from Homebase both suggest that after a sharp rebound in April and May, the labor market leveled off in July. (Source: Pantheon Macroeconomics)Elsewhere in labor market data, the Institute for Supply Management published its July reading on activity in the services sector on Wednesday. And while this data showed a continued rebound in overall activity, employment was the most discouraging area of this report.ISM’s employment subindex fell further into contraction territory in July while overall activity moved further into expansion. The report said comments from survey respondents included: “Current freeze on all open positions” and “[Employment lower] due to retirements and departures; limited new hiring at this time.”Story continuesOren Klachkin, lead U.S. economist at Oxford Economics, said this data, while encouraging for the broader economy, suggests that employment will lag output as the economy heals.But if hiring lags, then consumer spending — which has fueled so much of this recovery — is at risk of remaining stalled or perhaps rolling over.Data from JPMorgan’s daily spending tracker, for example, has showed spending running consistently between 10%-12% below last year’s level for over a month now. In a note to clients published Tuesday, JPMorgan economist Jesse Edgerton called spending “decisively unchanged” since mid-June.JP Morgan's daily update on consumer spending shows that spending has remained flat for the last six weeks at levels right around 10% below last year's level. (Source: JP Morgan)A reminder that while initial policy steps were effective in replacing lost income and keeping consumption somewhat afloat, those measures are currently paused and may not come back. And with the labor market looking softer as temporarily lost jobs turn into permanently lost jobs, downside risks to consumer spending bear close watching.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7:30 a.m. ET: Challenger job cuts, July year over year (305.5% in June)8:30 a.m. ET: Initial jobless claims, week ended August 1 (1.415 million expected, 1.434 million prior week)8:30 a.m. ET: Continuing jobless claims, week ended July 25 (16.94 million expected, 17.018 million prior week)EarningsPre-market6:00 a.m. ET: Hilton Worldwide Holdings (HLT) is expected to report an adjusted loss of 31 cents per share on revenue of $769.58 million6:00 a.m. ET: YETI Holdings (YETI) is expected to report adjusted earnings of 16 cents per share on revenue of $187.92 million7:00 a.m. ET: Norwegian Cruise Line Holdings (NCLH) is expected to report an adjusted loss of $2.29 per share on revenue of $42.79 million7:00 a.m. ET: Bristol-Myers Squibb (BMY) is expected to report adjusted earnings of $1.49 per share on revenue of $10.02 billion7:00 a.m. ET: iHeartMedia (IHRT) is expected to report an adjusted loss of 67 cents per share on revenue of $562.43 million7:00 a.m. ET: Papa John’s International (PZZA) is expected to report adjusted earnings of 48 cents on revenue of $467.46 million8:15 a.m. ET: Mylan (MYL) is expected to report adjusted earnings of 98 cents per share on revenue of $2.73 billionPost-market4:00 p.m. ET: Booking Holdings (BKNG) is expected to report an adjusted loss of $11.36 per share on revenue of $569.38 million4:00 p.m. ET: Caesars Entertainment (CZR) is expected to report an adjusted loss of $2.27 per share on revenue of $109.27 million4:00 p.m. ET: Dropbox (DBX) is expected to report adjusted earnings of 17 cents per share on revenue of $465.3 million4:00 p.m. ET: T-Mobile (TMUS) is expected to report adjusted earnings of 3 cents per share on revenue of $17.66 billion4:05 p.m. ET: Uber (UBER) is expected to report an adjusted loss of 81 cents per share on revenue of $1.82 billion4:05 p.m. ET: Zillow Group (ZG) is expected to report an adjusted loss of 47 cents per share on revenue of $615.26 million4:05 p.m. ET: The RealReal (REAL) is expected to report an adjusted loss of 37 cents per share on revenue of $53.45 million4:10 p.m. ET: Datadog (DDOG) is expected to report adjusted earnings of 1 penny per share on revenue of $135.4 million4:15 p.m. ET: Cloudflare (NET) is expected to report an adjusted loss of 6 cents per share on revenue of $94.17 million4:20 p.m. ET: TripAdvisor (TRIP) is expected to report an adjusted loss of 59 cents per share on revenue of $48.78 million4:30 p.m. ET: Stamps.com (STMP) is expected to report adjusted earnings of $1.09 per share on revenue of $144 millionTop NewsEuropean stocks mixed after stark Bank of England forecast [Yahoo Finance UK]New York prosecutors subpoenaed Deutsche Bank in Trump probe: New York Times [Reuters]Gilbert’s Rocket to raise $1.8 billion in downsized IPO [Bloomberg]Bezos sells $3.1 billion of Amazon shares after wealth jumps [Bloomberg]YAHOO FINANCE HIGHLIGHTSDemocrats propose adding Fed mandate: reducing racial inequalitySoaring gold prices could mean chaotic election day: strategistToo much gov't intervention leads to lower productivity, rise of 'zombie companies': Morgan Stanley strategist—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}