{"article": [{"url": "https://finance.yahoo.com/news/what-biden-would-do-about-trumps-china-tariffs-195835075.html", "published": 1594220780.0, "headline": "What Biden would do about Trump’s China tariffs", "body": "A standout feature of Donald Trump’s presidency has been his tough approach to China on trade. Trump has demanded that China even out a lopsided U.S. trade deficit with China and buy more American products. As leverage, Trump has imposed tariffs on Chinese imports that cost U.S. businesses and consumers around $54 billion per year. Trump’s “phase one” trade deal with China from earlier this year was supposed to include a big boost in Chinese purchases of U.S. crops and other products. But the deal is falling apart and Trump has threatened further punitive measures against China.One of the biggest questions for businesses in the 2020 presidential election is whether Joe Biden, the Democratic contender, would end Trump’s tariffs and repair a frayed relationship with China if he wins in November. Trump’s trade war with China routinely rattled financial markets in 2018 and 2019, when Trump was ratcheting up the tariffs and China began retaliating. Some U.S. companies moved supply chains out of China, while others made plans to.Biden hasn’t showed his hand on China yet, but businesses can probably hope for a reprieve from the tariffs if Biden is the next president. “I don't expect that they would go away immediately,” Todd Mariano of the Eurasia Group says on the latest episode of the Yahoo Finance Electionomics podcast. “But I do expect that they would eventually go away. My general assumption is that Biden is going to employ a different approach towards China.”It wouldn’t make sense for Biden to remove Trump’s tariffs without demanding something in return. So what might Biden ask for? There are many possibilities. Like Trump, many Democrats think China should be punished for stealing western technology and using state-backed firms to lower prices below cost and capture market share from producers in other countries. Biden could press China on non-economic issues, as well. Trump has shown little interest in human rights issues in China, but Biden and many Democrats care more about mistreatment of the Uighur minority in western China, and could demand improved treatment. Hong Kong is a new flash point, now that Chinese President Xi Jinping has accelerated efforts to extinguish democratic freedoms in the former British colony. China’s territorial expansionism in the South China Sea is another point of tension.Story continues[Check out prior episodes of the Yahoo Finance Electionomics podcast.]Confronting ChinaBiden has long been a foreign policy traditionalist who supported China’s entry into the World Trade Organization more than two decades ago, and has generally viewed China as an important trading partner rather than an enemy. Trump argues that Biden is soft on China, while Biden has begun airing ads leveling the same charge at Trump, for his praise of Xi and China early in the coronavirus pandemic. That leaves each candidate with something to prove: That he’s tougher on China than the other guy.Protesters against the new national security law gesture with five fingers, signifying the \"Five demands - not one less\" on the anniversary of Hong Kong's handover to China from Britain in Hong Kong, Wednesday, July. 1, 2020. Hong Kong marked the 23rd anniversary of its handover to China in 1997, and just one day after China enacted a national security law that cracks down on protests in the territory. (AP Photo/Vincent Yu)Some of Biden’s foreign-policy advisers are reportedly urging the former vice president to adopt a more confrontational approach toward China, which itself has become more bellicose under Xi. When China joined the WTO in 2001, many analysts thought China would become more like the west and drift toward democratic norms. Instead, China has remained an authoritarian state dominated by the Communist Party, while exploiting its growing wealth to expand its own territorial and nationalist ambitions. Instead of playing by WTO rules, China has bent and arguably broken them, with little accountability.Biden would be much more likely than Trump to band together with other nations and confront China as a bloc, demanding an end to corporate espionage and intellectual property theft, greater access to the Chinese market, and other reforms. Many trade experts view that as the most effective way to force China to change. Trump, by contrast, has alienated allies by hitting many of them with the same types of tariffs he has levied on China, while confronting China alone.China, for its part, may prefer another four years of Trump to an emboldened Biden, who would probably challenge China more on human rights and territorial aggression in the South China Sea. “I think they're worried that Biden may be able to unite Western opposition on some of these issues,” Mariano says. “And he may focus on them more than Trump.”Whoever wins in November is likely to have his hands full with China, no matter what. China clearly views itself as a rising superpower, and Xi seems more willing to take the risk of expanding China’s power than his predecessors. Under the 1997 deal with the U.K., Hong Kong was supposed to remain an autonomous capitalist democracy until 2047. Xi is pulling the plug 27 years early. If he succeeds in suppressing democracy in Hong Kong, he could next turn to Taiwan, which the United States views as an independent nation but China declares as a renegade province. Tariffs might seem relatively harmless compared with what comes next in China.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Edgy voters might reject the 2020 election outcomeTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}