{"article": [{"url": "https://finance.yahoo.com/news/apple-iphone-delay-confirm-214717632.html", "published": 1596128120.0, "headline": "Apple confirms next iPhone will be delayed 'a few weeks'", "body": "Apple (AAPL) on Thursday confirmed that its next iPhone, presumably called the iPhone 12, will be delayed “a few weeks.” The announcement came during the company’s Q3 2020 earnings call with Apple CFO Luca Maestri saying that while last year’s iPhone launched in late September, the next-generation device will launch a few weeks later.Apple’s next iPhone is expected to be the company’s first 5G-capable product. It’s that functionality, which promises dramatically faster download and upload speeds, that analysts believe will lead to a so-called “super cycle” during which a larger number of customers would upgrade their iPhones to the latest devices.Photo by: zz/STRF/STAR MAX/IPx 2020 7/19/20 Social distancing measures at The Apple Store on Fifth Avenue in Midtown Manhattan on July 19, 2020 as certain restrictions are eased as part of the Phase 3 Reopening in New York City during the worldwide coronavirus pandemic. (NYC)Apple’s iPhone line has been the key driver behind the company’s success since its launch in 2007. And while sales numbers have been in decline from prior highs due to the saturation of the smartphone market, the tech giant posted a year-over-year increase in iPhone revenue in Q3 2020.[Read more: Apple earnings: Apple crushes Q3 expectations, announces 4-1 stock split]A delay in iPhone sales would have an impact on the company’s Q4 2020 earnings. The phones typically launch in the latter half of September, and while they add a small amount to the quarter’s overall iPhone revenue, the impact would likely be missed.Analysts were hoping Apple would provide some form of forward-looking guidance for the firm’s Q4 revenue, but Cook and company demurred, saying that the economic environment created by the coronavirus pandemic would make it difficult for the company to provide anything beyond general color for the coming quarter.The news follows a massive quarter for Apple, which saw the company pull in $59.7 billion in revenue versus analysts’ expectations of $52.3 billion. The firm saw iPhone revenue of $26.4 billion, Services revenue of $13.2 billion, and Accessories revenue of $6.5 billion.The day before issuing Apple’s report, Cook sat before the House Judiciary Committee’s Subcommittee on Antitrust, Commercial, and Administrative Law to defend the company against accusations that it abuses its market power by requiring app developers to pay a 30% commission on apps sold through the App Store.Story continuesGot a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Amazon, Apple, Facebook, and Google CEOs push America-first narrative in effort to avoid antitrust scrutinyAnalysts look to hints of iPhone 12 delays in Q3 earningsTop back-to-school gear: Tech SupportTwitter hack could have been ‘much, much worse’ say cybersecurity expertsShould you delete TikTok?: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}