{"article": [{"url": "https://finance.yahoo.com/news/why-us-china-relations-are-worsening-on-almost-every-front-213714768.html", "published": 1593189920.0, "headline": "It's not just coronavirus: Why US-China relations are worsening on 'almost every front'", "body": "The U.S.-China trade deal is increasingly embattled, and its terms may not survive until November as tensions between the world’s two largest economies boil over, a top international analyst told Yahoo Finance on Friday.As the U.S. struggles to control the rampant spread of the coronavirus in several states, ructions on the trade front may soon shake the markets. Earlier this week, markets sold off after White House Trade Adviser Peter Navarro told Fox News America’s trade deal with China was “over.”Navarro and President Donald Trump have since walked back those comments, but the underlying strains are likely to remain front and center.“Trump is holding on to this Phase One trade deal and it's because he knows what it's going to do to the markets if it blows up,” Ian Bremmer, founder & president of the Eurasia Group told Yahoo Finance’s On the Move.While the president may be holding on to the message the deal is still on, Bremmer warned some in his own circle are not sold.“The advisors I’ve spoke to in the White House, including some very senior ones, are telling me that on balance, they think the deal will not last through the election. But it's very close,” he added.President Donald Trump, left, meets with Chinese President Xi Jinping during a meeting on the sidelines of the G-20 summit in Osaka, Japan, Saturday, June 29, 2019. (AP Photo/Susan Walsh)Not Just About TradeBremer is hardly alone in thinking the Sino-American accord is on the ropes. In a research note to clients on Friday, Capital Economics chief U.S. economist Paul Ashworth linked Trump’s waning electoral fortunes to his saber-rattling at China.The president “has taken an increasingly belligerent stance toward China in his recent public appearances, albeit aimed mostly at China’s coronavirus response rather than trade relations. The further behind in the polls he falls, the more he is likely to fall back on bashing China to shore up his support,” Ashworth wrote.“The upshot is that we doubt the Phase One trade deal will survive intact until the election in November,” he said, adding that the chances of China fulfilling its own obligations under the accord are “close to zero now.”Story continuesAccording to Ashworth, “at some point it will be too tempting for Trump to try and boost his support by unilaterally withdrawing. Whether Trump would impose additional tariffs is unclear, however.”Eurasia’s Bremmer told Yahoo Finance that a host of factors other than COVID-19 and trade are making U.S. China relations “worse on almost every front.”From the South China Sea to Taiwan and Hong Kong, fights between the two superpowers are breaking out on almost every front, Bremmer noted. “You cannot look at an issue between the US and China right now that is moving in a good direction there.”The rising Tensions will also likely be at the front of voter’s minds when they head to the polls in November, something Bremmer says the President is very aware of.“Trump clearly understands that a hard line on China is particularly useful to distract from his own missteps around coronavirus. And blaming the Chinese and even using racist terminology for Coronavirus itself is part of that strategy. He knows what he's doing,” the analyst added.Kenneth Underwood is a senior producer for Yahoo Finance. Follow him on Twitter@TheKennyU.Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook,Instagram,Flipboard,SmartNews,LinkedIn, YouTube, and reddit."}]}