{"article": [{"url": "https://finance.yahoo.com/news/as-live-sports-return-to-tv-so-do-draft-kings-and-fan-duel-ads-204403327.html", "published": 1596469940.0, "headline": "As live sports return to TV, so do DraftKings and FanDuel ads", "body": "The NBA, WNBA, and MLB all returned to play in the last two weeks. And if you’ve watched any of the games live, you’ve surely noticed: DraftKings and FanDuel ads are back on television in full-force.It feels a little like 2015 all over again.At that time, DraftKings and FanDuel were two notorious, fast-growing “unicorn” startups credited with popularizing the daily fantasy sports (DFS) category. In just the first week of the 2015 NFL season, the two companies spent more than $30 million combined on TV advertising, with ads often running back to back on ESPN. The incessant ads made the two brands household names among sports fans, even if they annoyed the same sports fans. (As one Digiday headline declared, “Everybody hated those DraftKings and FanDuel commercials.”) But the advertising onslaught also caught the attention of lawmakers, who in many states (most notably in New York) went after the companies, accusing their fantasy contests of being illegal gambling pools.A lot has changed for these companies and their industry since then.In May 2018, the U.S. Supreme Court struck down the federal ban on sports betting, which allowed states to legalize sports betting on a state-by-state basis. Nearly 20 states have done so, joining Nevada.DraftKings and FanDuel moved quickly to open up legal sportsbook operations in many of those states, and now they proudly advertise their betting operations. DraftKings and FanDuel have both opened physical sportsbooks in New Jersey, Mississippi, New York, and Iowa, and launched mobile sportsbook apps in Colorado, New Jersey, Pennsylvania, Indiana, and West Virginia.Both companies also made their way to the public markets.FanDuel in 2018 sold to Paddy Power BetFair, an Irish bookmaker, which rebranded as Flutter Entertainment last year and, unlike DraftKings, also operates a U.S. online poker business.DraftKings went public in April by merging with the Diamond Eagle SPAC (special-purpose acquisition vehicle), which changed its name and ticker to DraftKings (DKNG). The stock has soared along with other betting names like Penn Gaming, even with sports shut down due to the pandemic.Story continuesNow sports are (tenuously) back, and thus: aggressive advertising of the betting apps (and, you’ll notice, less pushing of the fantasy contests).NHL Commissioner Gary Bettman speaks at a New Jersey Devils press conference for the opening of the FanDuel Sportsbook at the Meadowlands Racetrack on Nov. 5, 2018 in East Rutherford, NJ. (Photo by Andy Marlin/NHLI via Getty Images)FanDuel’s new TV ads began airing on July 21 on ESPN, Fox Sports, NBC Sports and Golf Channel, TNT, and MLB Network. DraftKings returned to airwaves on July 25 and is running its ads on ESPN and TNT. FanDuel is the No. 3 advertiser during NBA games since the league returned on July 30, according to ad tracker iSpot. The firm also notes that after last NFL season, DraftKings and FanDuel ads left TV for the most part until very recently.Both companies, in their new ads, promise signup bonuses for new users. The DraftKings ads play it straight, with slides showing images of its sportsbook app. In an NHL-specific ad, DraftKings invites fans to “slide into your bets in no time.” (The MLB version of the ad says, “Swing away at your bets in no time.”)FanDuel’s campaign uses real videos from social media of people creating their own goofy sports at home during lockdown, and says, “You earned this season, fans.” The company says it has added a $10 credit to every existing user’s account, “no strings attached.”All of this—the advertising, the free contest credits—cost marketing dollars. And neither company is profitable yet. But both are banking on huge pent-up demand for sports betting after the drought of lockdown.“People will be eager to reactivate when sports do come back,” DraftKings CEO Jason Robins told Yahoo Finance in April after the company went public.FanDuel CEO Matt King told Yahoo Finance last week that the app had its “biggest night ever” on MLB Opening Day on July 23, and has equally high expectations for NBA signups: “There’s going to be a lot of volume on basketball, it could easily be a third to half the business today, so the fact that it’s back means a lot more players and a lot more volume.”—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how the sports industry is faring amid the pandemic:Majority of Americans are not ready to go to a sports event, even with masks: pollMLS delays launch of expansion teams in Charlotte, Sacramento, and St. Louis due to pandemicCollege football plans to return, but a huge financial question remains: fans in the standsHere's every sports league's current plan to return from coronavirus lockdownMLS Commissioner: Playing in empty stadiums would be particularly bad for usNHL Commissioner Gary Bettman: Money 'is not what's driving' return planCoronavirus could have long-lasting impact on live sports ticket sales"}]}