{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-number-of-people-paying-rent-at-lowest-level-since-the-start-of-the-pandemic-192555579.html", "published": 1600266800.0, "headline": "Coronavirus: Number of people paying rent at lowest level since the start of the pandemic", "body": "Only 86.2% of renters made full or partial rent payments by September 13 — the lowest mid-month payment rate since the start of the coronavirus pandemic, according to new data released this morning.Almost 14% of renters had not paid any rent by September 13, up from the previous high of 12.4% delinquent renters in August and up from 11.3% in September 2019, according to the National Multifamily Housing Council's (NMHC) rent tracker, which compiles statistics from major real estate data providers including Entrata, MRI Software, RealPage, ResMan, and Yardi.“The second week of September figures shows ongoing deterioration of rent payment figures — representing hundreds of thousands of households who are increasingly at risk,” said Doug Bibby, NMHC president, in a statement. “Many apartment residents continue to prioritize their housing obligations and that apartment owners and operators remain committed to meeting them halfway with creative and nuanced approaches.”Hardship was greatest in Louisiana, Maryland, Florida, Hawaii and Nevada during the last week of August, according to the U.S. Census Bureau’s weekly pulse survey. Hawaii, Louisiana and Nevada have had some of the highest unemployment rates in the country. Tourism-based economies like Florida’s have also stagnated during the coronavirus pandemic, causing housing insecurity.“The Trump administration has maintained that no one should risk losing their home due to the coronavirus,” said U.S. Housing and Urban Development Secretary Ben Carson.Policy changes impacting rent paymentThe nadir of rent payment comes during the first month of President Trump’s eviction moratorium, instituted September 1, which bans evictions — in effect, allowing delayed rent payments — through December 31.“The Trump administration has maintained that no one should risk losing their home due to the coronavirus,” said U.S. Housing and Urban Development Secretary Ben Carson in a statement. “We’ve taken several actions since the beginning of this pandemic to keep Americans in their homes.”Despite the short-term relief, some critics say the program leaves landlords in the lurch and renters with months of delayed payments will come due in January, unless further action is taken. A third of renters had unpaid back-rent in September, according to Apartment List, a San Francisco-based renting platform.Story continues“The latest eviction ban from the CDC may apply to more tenants than the previous moratorium, but it comes with requirements. Tenants feeling the pinch and unable to make their monthly rent are no doubt scrambling for answers. And landlords with a mortgage payment likely are too,” said Elizabeth Renter, data analyst at NerdWallet, a San Francisco-based personal finance company.The low payment rate also comes as renters are in the second month without extra unemployment benefits provided in the Coronavirus Aid, Relief, and Economic Security Act (CARES), when many experts predicted unemployed renters would run out of savings to pay bills. The CARES Act also prohibited evictions in properties with federally-backed mortgages.“Instead of being satisfied with a half-baked nationwide eviction moratorium which does nothing to deal with renters’ real underlying problem – financial distress – lawmakers should instead look to the successful model of the CARES Act and provide economic support to those who need it most – the tens-of-millions that call an apartment home, revitalizing the recovery at the same time,” said Bibby.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:‘Lenders don’t have the capacity’ to meet mortgage demand: expertThere’s a ‘staggering shortage of homes on the market’: economist‘New York and California are the land of the flee, and Texas is the land of the free’: real estate investor"}]}