{"article": [{"url": "https://finance.yahoo.com/news/uber-q2-earnings-2020-185330997.html", "published": 1596726980.0, "headline": "Uber posts $1.8B loss in Q2 but deliveries skyrocket during coronavirus", "body": "Uber (UBER) reported its Q2 2020 earnings after the bell on Thursday with much of the focus on the impact the coronavirus pandemic has had on the business so far.These are the most important numbers from the report compared to what analysts were expecting for the quarter.Uber was not immediately able to say how much it has paid drivers so far as part of its coronavirus assistance policy. (Getty Images)Gross bookings: $10.2 billion versus $10.4 billion expected.Rides gross bookings: $3.05 billion versus $3.96 billion expected.Eats gross bookings: $6.96 versus $6.23 billion expected.Losses per share: $1.02 versus $0.84 expected.Uber’s quarter was a tale of two businesses. The ride-sharing side saw an incredible collapse of 73% compared to Q2 2019 results, as the full shock of the pandemic became clear for the company. But the delivery Eats service was up a whopping 113%.For the quarter the company lost a staggering $1.8 billion.“We are fortunate to have both a global footprint and such a natural hedge across our two core segments: as some people stay closer to home, more people are ordering from Uber Eats than ever before,” CEO Dara Khosrowshahi said in a statement following the report.The majority of Uber’s Q1 wasn’t hurt by the coronavirus, as lockdowns went into effect in mid-March. The quarter itself ended March 31, so the company had the benefit of several weeks without full lockdowns to pad its results.But Q2 was the first quarter during which Uber operated under full coronavirus lockdowns. And with users forced to stay home or a lack of available entertainment options available such as bars, movies, and concerts, there was significantly less need for Uber rides.On the flip side, with restaurants closed to in-person dining in many states, Uber’s Eats business saw a large uptick in use.As the pandemic took hold in the U.S. Uber, and its chief North American rival Lyft (LYFT), took drastic cost-cutting measures to firm-up the overall business.In May, Uber filed paperwork with the SEC indicating that it was to cut roughly 14% of its workforce, or 3,700 jobs, primarily in its customer support and recruiting divisions. Lyft, meanwhile, announced it was cutting its workforce roughly 17%, or 982 jobs, and furloughing another 288 employees.Story continuesUber will have a long road to recovery ahead. But according to Wedbush analyst Dan Ives, the company could see a boost from travelers wary of taking public transit options such as subways and buses.Ives said he believes, “a consumer dynamic that is becoming commonplace across cities both in the US and internationally is many steering clear of mass transportation given health concerns and lack of comfort taking subways/buses and thus could be an incremental demand driver for ride-sharing vendors over the next few quarters (at least).”For the services to truly bounce back, though, cities and businesses will need to fully reopen, and that’s not likely to happen anytime soon as the pandemic continues to rage across the U.S.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Samsung debuts Galaxy Note 20 and Note 20 Ultra smartphonesActivision Blizzard earnings blow away expectations as gamers player through pandemicMicrosoft’s Xbox Game Pass Ultimate gets Project xCloud cloud gaming on Sept. 15 for $14.99 per monthMicrosoft and TikTok need each otherFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}