{"article": [{"url": "https://finance.yahoo.com/news/peloton-bike-treadmillgets-some-big-changes-heres-how-much-it-will-cost-and-why-investors-should-care-110007518.html", "published": 1599545300.0, "headline": "Peloton bike gets some big changes — here's how much it will cost and why investors should care", "body": "Rather than bomb a space-deprived, quarantined nation with an extra large digitally fueled new rowing machine or massive inflated punching bag that counts kicks and punches on an app, Peloton (PTON) is taking a page out of tech king Apple and tiering its product line to expand its subscriber base.Peloton announced a long-awaited product refresh on Tuesday, revealing its Bike+ and a cheaper Tread (or treadmill for those not hip on Peloton lingo). The Bike+ is the original Peloton bike on steroids: it offers a 23.8 inch rotating HD screen (current bike has a stationary screen, one of the main gripes among users) to transition easily from rides to mat workouts and easy Apple Watch integration (you just tap the watch to the screen).This writer (full disclosure: and Peloton bike owner) has been testing the Bike+ for two weeks and have come away mostly impressed. The rotating screen works as advertised — as in easy transitions to mat workouts — and is higher quality visually and audio wise. Apple Watch integration is great (it’s not so great on the original bike) as are the smaller upgrades like a new resistance knob that should prevent the crazies from inflating their live ride metrics (a well-known issue for Peloton users that hustle hard and follow the rules).Now Peloton just has to figure out a way to drive iPhone-like upgrades to a pricier (by $200 or so) new bike than the original, which is noticeably better than what users currently have in their house. The company is offering a $700 credit for existing users on the $2,495 Bike+. Peloton will come and take away your old bike and bring with them a complimentary yoga and toning accessories package. Not a bad incentive. Bike+ goes on sale Sept. 9.The existing Peloton bike will see its price cut to $1,895 from $2,245.As for the cheaper Tread, it will go on sale in the U.S. in early 2021 for $2,495 or similar to the existing Peloton bike. The current Tread will be renamed Tread+ and still sell for $4,295. It’s not entirely clear how Peloton whacked $2,000 off the price of a treadmill, but it reportedly is using a different mechanical setup than its more expensive option. That likely helped bring down the manufacturing cost while preserving the key features of the premium offering.Story continuesPeloton's new Bike+ has some key upgrades such as a rotating screen.All in, a solid approach here by Peloton in taking a page out of Apple’s proven playbook. Will there perhaps be some disappointment on the Street that Peloton didn’t venture into a new product category amid the rise of closed gyms and working out at home? Of course,an argument could be made that part of Peloton’s stock is up a healthy 183% this year on expectations of a new category launch. Perhaps there is a bit of short-term profit-taking on the news.But if an investor thinks about it for a second, the company is actually giving the bulls what they want. New products and new price points that should expand Peloton’s total addressable market and drive more recurring revenue. As that recurring revenue base expands, then it’s more likely Peloton ventures into a new product category with something it creates itself or acquires. Recall that the Apple Watch didn’t launch at the same time as the first iPhone.“We believe these new product launches come at an important time, as gyms have been re-opening across most states, and consumers will be/have been faced with the question of whether to continue their current memberships/sign up for new memberships at brick-and-mortar facilities, or invest in at-home interactive platforms,” says Macquarie analyst Paul Golding.Stein adds, “The new more accessible price-points have the potential to drive the next leg of growth, in our view, and make both the Bike + tread installment amounts even more compelling as a marketing tool/value proposition vs. freestanding gyms. We agree with management that the market for running/treadmills could be far greater than spin bikes, and the lower price not only makes for a larger SOM but could also drive some existing customers to add complementary units.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Honeywell CEO: here’s how I found out about us being added to the DowLL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}