{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-august-8-2020-171744189.html", "published": 1597304360.0, "headline": "Jobless claims: New unemployment claims come in below 1 million for the first time since March", "body": "The number of individuals filing new unemployment insurance claims improved to a fresh pandemic-era low last week, falling below the 1 million mark for the first time since March.The Labor Department released its report on weekly unemployment insurance claims Thursday at 8:30 a.m. ET. Here were the main metrics from the report, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended Aug. 8: 963,000 vs. 1.1 million expected and 1.191 million during the prior weekContinuing claims, week ended Aug. 1: 15.486 million vs. 15.8 million expected and 16.107 million during the prior weekThursday’s report ended what had been a previous 20-week streak that new claims totaled more than 1 million, with tens of millions of Americans put out of work during the coronavirus pandemic and forced business closures that ensued. Since the week ended March 20, more than 56 million individuals have filed new unemployment insurance claims.At 963,000, the number of new claims last week was at the lowest level since the start of the pandemic. Jobless claims peaked with a one-week increase of about 6.9 million in late March. Prior to the pandemic, however, weekly jobless claims were coming in consistently below 250,000.Nearly every state across the country reported a decline in new claims last week on an unadjusted basis. Florida’s new unadjusted jobless claims improved by 23,000 last week for the largest numerical drop of any state. New York state followed close behind, with 22,000 fewer new claims filed last week than the week before.Meanwhile, continuing claims, which are reported on a one-week lag, also fell to a pandemic-era low of 15.486 million, dipping below 16 million for the first time during the pandemic period. This metric, which captures the number of individuals still receiving unemployment insurance benefits, has improved in seven of the last eight weeks’ worth of reports.Weekly unemployment insurance claims came in below 1 million for the first time since March during the week ended Aug. 8. (David Foster/Yahoo Finance)The steadily decreasing numbers of new and continuing unemployment claims appear to indicate a labor market recovering from the trenches earlier this spring. However, some economists pointed out that the recent decline in new claims may reflect jobless workers’ reluctance to file, with the federal government’s enhanced unemployment benefits having stopped at the end of July.Story continues“The pressure is coming off just slightly in the labor market with unemployment claims coming down from recent highs. But we cannot be sure or not if this is good news for the recovery or whether it is the lapse in those $600 weekly checks from the federal government that is now a disincentive for some newly jobless workers to file,” Chris Rupkey, chief financial economist for MUFG Union Bank, said in a note ahead of results. “There are anecdotal reports that some states are tightening the eligibility requirements for unemployment benefits where jobless workers need to aggressively search for new employment opportunities to receive assistance.”“Any way you look at it, the party may be over for those getting government assistance after being made redundant after this recession,” he added. “Unless the unemployment rate starts to climb, both federal and state governments may be growing more reluctant to bail out jobless workers.”This post is breaking. Check back for updates.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}