{"article": [{"url": "https://finance.yahoo.com/news/the-small-businesses-getting-bailout-loans-arent-what-you-think-201841546.html", "published": 1594135580.0, "headline": "The small businesses getting bailout loans aren’t what you think", "body": "You might think of a small business as your local florist, barbershop, delicatessen or clothing boutique. But the government’s massive list of “small businesses” that received stimulus loans through the Paycheck Protection Program includes many large and prosperous firms that aren’t necessarily the fragile businesses the bailout program was meant to protect.The largest group of businesses receiving sizable loans isn’t surprising: 33,608 full-service restaurants have received federal loans of $150,000 or more, according to Yahoo Finance analysis of data the Small Business Administration released July 6. But many people might not guess the second- or third-largest groups of loan recipients. Nearly 21,000 medical practices got large PPP loans, along with 14,310 law firms. At least 167 medical practices got loans ranging from $5 million to $10 million, the largest loans available. And at least 128 law firms got the largest loans.Graphic by David FosterSeveral prosperous firms run by politically connected insiders have received government loans, generating concerns about abuse of the program. At least five law firms where partners average a minimum of $1.2 million in annual pay got loans of $5 million or more, including firms run by prominent litigators David Boies and Marc Kasowitz, according to the Wall Street Journal. A company linked with Brad Parscale, President Trump’s reelection campaign manager, got a loan, along with companies associated with several other Trump friends. And loans went to companies owned by at least 7 members of Congress or their spouses, including one partially owned by House Speaker Nancy Pelosi’s husband, Paul.Other loans went to well-financed companies Congress almost certainly wouldn’t bail out on their own. Restaurant chains PF Chang and Silver Diner, both owned by private-equity firms, got loans of at least $5 million. Kanye West’s Yeezy clothing brand got a loan of at least $2 million. The program is supposed to help small businesses with fewer than 500 workers unable to get traditional financing amid the uncertainty of the coronavirus recession. The loans become grants for companies that can demonstrate they used the money to keep workers on staff at their normal pay.Story continuesOverall, the SBA says 4.9 million U.S. businesses have received PPP loans totaling $521 billion. The average loan size is $107,000. About 661,000 firms got loans of more than $150,000. The government identified all of those companies by name. It did not identify the other 4.24 million firms that got smaller loans, but it did provide data on what types of firms they are.Matt \"Kush\" Kusher stands outside his restaurant KUSH in Wynwood, Miami, Fla., April 29, 2020. Kusher and other restaurant owners are struggling after being denied funds from the first Paycheck Protection Program, PPP, and need the help from the second roll out to prevent from closing their businesses. (Charles Trainor Jr./Miami Herald/Tribune News Service via Getty Images)Law firms and medical practices were among the largest recipients of both large and small loans. A spot check of loans under $150,000 in 5 states, for instance, shows that law firms got more loans than any other type of firm in Alabama, second most in New York, third most in Texas and Nevada, and fourth most in Michigan. Medical offices were the second-most frequent recipients of small loans in Texas, fourth in Nevada and New York and fifth in Alabama and Michigan.In most states, restaurants got the biggest number of small loans, by far, which makes sense because there are lots of restaurants, and the coronavirus pandemic has completely disrupted their business model. Several other types of firms typically rounded out the top 10 businesses getting smaller loans, including real-estate agencies, beauty salons, insurance agencies and miscellaneous retail outlets. Those types of organizations are more likely to be traditional Main Street businesses—small and family-owned—than chains or franchises that got some of the larger loans.The PPP is meant to keep workers on the payroll, even if there’s no work to do while businesses close or scale back amid the pandemic. So even if the loans go to a law firm or restaurant chain that doesn’t really need the money, they’re still benefiting workers at those companies, in theory. But when money is flowing out of Washington, everybody wants their share, whether Congress meant to give it or not.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Edgy voters might reject the 2020 election outcomeTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}