{"article": [{"url": "https://finance.yahoo.com/news/us-economy-adds-private-payrolls-in-september-adp-jobs-report-coronavirus-labor-121650081.html", "published": 1601450660.0, "headline": "US economy adds 749,000 private payrolls in September, topping expectations: ADP", "body": "US private employers added back a greater than expected 749,000 payrolls in September, according to ADP’s closely watched monthly private jobs report.Consensus economists were looking for private job gains to total 649,000 for the month, according to Bloomberg data. August’s increase in payrolls was upwardly revised to 481,000, from the 428,000 previously reported.The service-providing sector, which had been hardest hit initially by the pandemic and business closures, added back by far the bulk of payrolls, with net payrolls gains totaling 552,000 in September. Trade, transportation and utilities industries added 186,000 jobs, and health-care and social assistance positions rose by 101,000. Education, meanwhile, was the only industry to shed payrolls on net, with these falling by 11,000.The goods-producing sector also continued to add back jobs. Sector-wide, employment rose by 196,000 in September, led by a gain of 130,000 in manufacturing industries.Businesses of all sizes increased their payrolls during the month, led by large businesses with at least 500 employees, which added back on net 297,000. Small- and medium-sized businesses brought back 192,000 and 259,000, respectively.By ADP’s measure, domestic employers have on net added back payrolls for the past five consecutive months. However, the pace of increase has slowed considerably from the nearly 4.5 million the firm reported were created in June this year, when the first wave of business reopenings drove record surges in business rehiring.Both ADP’s jobs report and the Department of Labor’s (DOL) September non-farm payrolls report due Friday mark the last before Election Day. Data since the summer has reflected a labor market recovery quickly losing steam, with earlier surges in job creation and re-creation after stay-in-place orders were lifted struggling to be maintained. The end-of-July expiration of federal enhanced unemployment benefits and other virus relief-related programs from Washington has also weighed tens of millions of still jobless Americans.Story continuesJust this week, Disney (DIS) said it would be cutting 28,000 jobs in its resort business, in one of the deepest reductions during the pandemic period. Shell (RDS-A) on Wednesday said it planned to slash up to 9,000 positions by the end of 2022. And airlines including American Airlines and United Airlines Holdings have each warned they could furlough some 19,000 and 12,000 workers, respectively, following the October lapse of provisions under Congress’s CARES Act that gave the industry billions to help keep workers on payrolls.Looking ahead to Friday’s DOL jobs report, consensus economists expect to see that non-farm payrolls increased by 850,000 in September, including a net 875,000 increase in private payrolls. ADP’s private jobs report has been an imprecise indicator of the figures included in the DOL’s own report during the pandemic. In each of July and August, ADP reported just hundreds of thousands of new private payrolls were created, while the DOL’s release reflected well over 1 million in each month.NEW YORK, NEW YORK - SEPTEMBER 29: People wearing masks walk past a Coronavirus Rapid Test Center as the city continues Phase 4 of re-opening following restrictions imposed to slow the spread of coronavirus on September 29, 2020 in New York City. The fourth phase allows outdoor arts and entertainment, sporting events without fans and media production. (Photo by Alexi Rosenfeld/Getty Images)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}