{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-11-2020-222729869.html", "published": 1597158800.0, "headline": "Stock market news live updates: Stocks give up gains, S&P 500 ends 7-session winning streak as tech shares fall again", "body": "Stocks fell Tuesday, with the S&P 500 closing in on a record level earlier in the session as hopes for a vaccine and further stimulus spurred a global risk rally and a pop in “reopening” stocks. The Nasdaq underperformed again, with some major tech names that had recently led the market higher giving back some gains.[Click here to read what’s moving markets heading into Wednesday, August 12] Russia’s President Vladimir Putin said Tuesday that Russia became the first country globally to give regulatory approval to a Covid-19 vaccine, with the move coming less than two months after human testing of the inoculation began. The vaccine still must complete final trials, though mass production is expected by the end of the year.“Every time you get some good news on Covid, and now we’ve got a potential vaccine coming from Russia – it’s skeptical at best, but nevertheless, the market is embracing it at this point,” David Nelson, Belpointe chief strategist, told Yahoo Finance’s “The First Trade” on Tuesday.“Every time we get news on that, or something bright economically, we start to move out of these large cap secular growth names and move down that valuation trade to more cyclical shares,” he said. “And it makes sense, because some names in the Nasdaq – in particular, cloud and some other areas like stay-at-home stocks, are pretty egregiously expensive. Some of these names are a 1000x earnings, 50x cash flow.”Shares of travel companies including Wynn Resorts (WYNN), Norwegian Cruise Line Holdings (NCLH), Carnival Corp. (CCL) and a host of airlines jumped amid the vaccine news, and after InterContinental Hotels (IHG) suggested an improvement in travel demand in first-half results released before the bell on Tuesday. The commentary added to other recent upbeat assessments of consumer sentiment around travel, with Marriott (MAR) on Monday also suggesting travel trends were improving from an April low. Chinese electric car-maker Nio (NIO) rose after giving strong deliveries and revenue guidance for the current quarter, with auto demand in China rebounding.Story continuesElsewhere in markets, US crude oil futures added to gains after rising by the most in nearly 3 weeks as of Monday’s settlement. Gold stumbled below $2,000 per ounce, falling by the most since March. Treasury yields rose as prices fell.Investor attention also remained locked on prospects of further fiscal stimulus from Congress, after President Donald Trump over the weekend unleashed a set of executive orders to provide some economic support without congressional action. The moves have already led some states to push back, and New York Governor Andrew Cuomo said the order to have states chalk up a portion of the funds the proposed enhanced unemployment benefit “only digs the hole deeper” for states already grappling with budget deficits. Further stimulus discussions in Congress, however, hang in abeyance.During remarks late Monday, Trump added that he was considering a capital gains tax cut.—4:17 p.m. ET: Joe Biden, presumptive Democratic nominee, selects Sen. Kamala Harris as his running mateFormer Vice President Joe Biden, the presumptive Democratic presidential nominee, announced Tuesday that Sen. Kamala Harris of California would be his VP pick.Harris, who ran against Biden in the Democratic presidential primaries before dropping out in December, becomes the first Black woman to be on a major party presidential ticket. She is currently a first-term senator and a member of the Judiciary Committee, and served as California’s attorney general from 2010 through 2016.I have the great honor to announce that I’ve picked @KamalaHarris — a fearless fighter for the little guy, and one of the country’s finest public servants — as my running mate.— Joe Biden (@JoeBiden) August 11, 2020—4:04 p.m. ET: Stocks give up gains, S&P 500 ends 7-session winning streak as tech shares fall againHere were the main moves in markets as of 4:04 p.m. ET:S&P 500 (^GSPC): -26.77 (-0.80%) to 3,333.70Dow (^DJI): -104.53 (-0.38%) to 27,686.91Nasdaq (^IXIC): -185.53 (-1.69%) to 10,782.82Crude (CL=F): -$0.44 (-1.05%) to $41.50 a barrelGold (GC=F): -$111.10 (-5.45%) to $1,928.60 per ounce10-year Treasury (^TNX): +8.4 bps to yield 0.6580%—1:24 p.m. ET: Nasdaq trades higher, joining S&P 500 and Dow in the greenThe Nasdaq popped back into positive territory Tuesday afternoon, pacing toward its first up day since last Thursday. The Dow and S&P 500 were each on track for their eighth straight session of gains.The financials, energy and industrials sectors led advances in the S&P 500 Tuesday afternoon, with a recent rotation back into cyclical and value stocks extending. At session highs, the S&P 500 was fewer than 10 points below its recent closing high from February.The Dow’s advance of more than 1%, or 300 points, was led by JPMorgan Chase, American Express and Boeing.—11:36 a.m. ET: Markets are ‘not really too focused on the election’: Kirk HartmanMarkets so far have largely looked through the 2020 elections to instead fixate on upcoming 2021 earnings results, which are expected to strengthen versus this year, said Kirk Hartman, Wells Fargo Asset Management president and global chief investment officer.“I think the market again is just looking through the election to the earnings for next year. I think there’s the view that whoever the potential winner is, that the vaccine will be here and that things will recover,” Hartman said during Yahoo Finance’s “The First Trade.”“Clearly there are differences in the positions of the parties. And on the margin one could argue that depending on your political view, one party may stimulate the economy more than the other,” he added. “I think right now the market is kind of discounting that and looking at the fact that the Fed this year – we’ve got the Fed put. There’s a lot of stimulus in the market, the money supply’s up 20%, and corporate earnings look pretty good next year. Right now I would say it’s not really too focused on the election.”—9:35 a.m. ET: S&P 500, Dow open higher; Nasdaq declines againHere were the main moves in markets, as of 9:35 a.m. ET:S&P 500 (^GSPC): +12.87 points (+0.38%) to 3,373.34Dow (^DJI): +324.59 points (+1.17%) to 28,116.03Nasdaq (^IXIC): -83.26 points (-0.8%) to 10,885.10Crude (CL=F): +$0.80 (+1.91%) to $42.74 a barrelGold (GC=F): -$79.30 (-3.89%) to $1,960.40 per ounce10-year Treasury (^TNX): +6.4 bps to yield 0.638%—9:26 a.m. ET: General Motors’ CFO Dhivya Suryadevara resignsGeneral Motors (GM) announced Tuesday its Chief Financial Officer Dhivya Suryadevara was resigning to pursue an opportunity outside the auto industry. John Stapleton, GM North America chief financial officer, was named acting global CFO, effective Aug. 15.General Motors is conducting an internal and external search for a successor to Suryadevara, the company added.—8:31 a.m. ET: Producer prices rebound more than expected in July, rising by the most in two yearsThe Bureau of Labor Statistics’ producer price index (PPI) rose more than expected in July, as pricing power improved for suppliers as demand came back online.Headline producer prices rose 0.6% in July month over month for the biggest monthly jump since October 2018, after a 0.2% decline in June, the BLS said Tuesday morning. Consensus economists had been looking for a rise of 0.3%, according to Bloomberg-compiled estimates.Excluding more volatile food and energy prices, PPI still rose 0.5% over last month, versus a tick up of just 0.1% expected. Over last year, this core measure of underlying producer price trends increased 0.3%, following a 0.1% year over year increase in June.——7:35 a.m. ET Tuesday: Stocks point to higher openHere were the main moves in markets, as of 7:35 a.m. ET:S&P 500 futures (ES=F): 3,371.25, up 18.5 points, or 0.55%Dow futures (YM=F): 27,936.00, up 257 points, or 0.93%Nasdaq futures (NQ=F): 11,104.00, up 32 points, or 0.29%Crude (CL=F): +$0.80 (+1.91%) to $42.74 a barrelGold (GC=F): -$48.40 (-2.37%) to $1,991.30 per ounce10-year Treasury (^TNX): +3.4 bps to yield 0.608%—6:15 p.m. ET Monday: Stocks open slightly lowerHere were the main moves in equity markets, as of 6:15 p.m. ET:S&P 500 futures (ES=F): 3,350.00, down 2.75 points, or 0.08%Dow futures (YM=F): 27,667.00, down 12 points, or 0.04%Nasdaq futures (NQ=F): 11,064.75, down 7.25 points, or 0.07%NEW YORK, NEW YORK - MARCH 20: Traders work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}