{"article": [{"url": "https://finance.yahoo.com/news/former-mgm-ceo-jim-murren-lists-desert-mansion-for-105-million-210306028.html", "published": 1594829480.0, "headline": "Former MGM CEO Jim Murren lists desert mansion for $10.5 million", "body": "Former MGM Resorts International CEO Jim Murren has put his Las Vegas home up for sale. Photo credit: The Ivan Sher Group.Former MGM Resorts International CEO Jim Murren has put his Las Vegas home up for sale and he’s asking $10.5 million for it.Murren and his wife Heather Murren commissioned the desert mansion in 2009 as a family home to raise their children. Now that their children are grown, the Murrens plan to downsize from their 13,000-square-foot, five-bedroom, three-bathroom mansion, said broker Ivan Sher, principal of The Ivan Sher Group of Berkshire Hathaway HomeServices Nevada Properties, who listed the home for sale on July 7.Former MGM Resorts International CEO Jim Murren has put his Las Vegas home up for sale. Photo credit: The Ivan Sher Group“Modern designs can tend to be cold, but the wooden floors really warm it up. It’s a home for entertaining, but this is also where the Murrens raised their family,” said Sher.The mansion is made of glass, concrete and steel, and its floor-to-ceiling windows offer some of the most striking views in the Las Vegas area. It has five half-bathrooms, a half-basketball course, a fitness room, an office, an in-home movie theater and a wine cellar. It is a 1.5 acre property in The Ridges, an exclusive community in the Red Rock Canyon.Former MGM Resorts International CEO Jim Murren has put his Las Vegas home up for sale. Photo credit: The Ivan Sher Group.“It’s almost all floor-to-ceiling windows… You can see all of the strip [golf course], the city lights, the lake, the mountains — and it’s just breathtaking,” said Sher. It was designed by the Marmol Radziner architecture firm, which expanded actor Ashton Kutcher and actress Demi Moore’s Los Angeles house in 2007. Local builder Jack Raftery, known for his Nevada homes, also worked on the project.Former MGM Resorts International CEO Jim Murren has put his Las Vegas home up for sale. Photo credit: The Ivan Sher GroupThe mansion’s design integrates outdoor and indoor living. The floor-to-ceiling windows allow fresh air to flow into the house. Outside, the private terrace has a spa, a Zen garden, a jacuzzi, a cold plunge and a pool — plus an outdoor kitchen and surround-sound audio system. And a patio extends around the outside of the house with steel overhangs for shade.“In the desert, you need to have shaded areas,” said Sher. The desert landscape, designed by Sage Design Studios and the Las Vegas Springs Preserve, offers walking paths throughout the property.Story continuesFormer MGM Resorts International CEO Jim Murren has put his Las Vegas home up for sale. Photo credit: The Ivan Sher Group.In a red dome outdoors, artist James Turrellis uses tricks of light to create the illusion of floating through space. But if the art installation is to stay, the buyer will have to negotiate with the Murrens separately. If the Murrens decide to take the lights with them, the bunker could be transformed into a meditative space or collapsed. The value of the experiential sculpture is in the seven figures, said Sher.“It is absolutely unreal,” said Sher about the installation. “The experience feels like complete serenity. Sunrise and sunset are the only times it is supposed to be experienced, and as the light changes outside, the experience changes inside. It is meditative, relaxing and unique.”Former MGM Resorts International CEO Jim Murren has put his Las Vegas home up for sale. Photo credit: The Ivan Sher GroupSarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:A property auction is coming to America’s wealthiest ZIP code —a firstA surprising group of homeowners have paid off their mortgagesHouses for sale will be ‘gobbled up’: Barbara Corcoran"}]}