{"article": [{"url": "https://finance.yahoo.com/news/3-simple-reasons-behind-americans-housing-boom-175034932.html", "published": 1598360300.0, "headline": "3 simple reasons behind America's housing boom", "body": "Smack in the middle of major pandemic that has thrust the country into a recession, the U.S. is seeing another housing demand boom.Housing sector veterans say what we are witnessing across the country may not be as bizarre as it first appears, however.“I see three reasons why this is happening. We all know low mortgage rates have definitely been helping the housing market. Second is the old pent up demand argument,” explained Cortland chief economist Brad Dillman on Yahoo Finance’s The First Trade. Dillman is the former director of research at homebuilder PulteGroup.Dillman adds, “And finally, we are seeing new home sales and new supply really starting to come to the market.”The latest reads on housing — in large part fueled by the three trends Dillman points out — have been nothing short of eye-popping.Sales of new homes in July surged to a more than 13-year high, according to data released on Tuesday by The Commerce Department. New home sales rose 13.9% to a seasonally adjusted 901,000 in the month. The data comes on the heels of the National Association of Realtors saying last Friday existing home sales popped 24.7% in July.And earlier last week, the Commerce Department reported housing starts surged 22.6% in July. It marked the best showing since October 2016. Building permits — long viewed as a leading indicator of housing demand — spiked 18.8%.In this image from a drone, workers construct a new house elevated with cinder blocks in Stone Harbor, N.J., on Thursday, July 23, 2020. (AP Photo/Ted Shaffrey)Bank of America Merrill Lynch also point to millennials — no longer keen on renting space in crowded cities amid a pandemic — buying their first homes as a key driver of demand right now.“The need for more space and the desire for a lower cost of living were among the top two reasons selected by those wanting to move to a new city/town, each with a 36% overall hit rate. The \"more space\" response was highest among millennials, which is consistent with our view that this cohort will support housing demand over at least the next five years as constituents reach prime home buying age at an accelerated pace and embark upon life events such as marriage/child-rearing,” BofA researchers revealed Tuesday in a new survey.Story continuesThe tailwinds in housing have lit a fire on stocks in the homebuilding, building products and home improvement sectors.Home Depot and Lowe’s are fresh off mind-blowing second quarter earnings reports — shares are up 18% and 35%, respectively, in the past six months. Sustainable deck maker The Azek Company — which went public in June — has seen its stock go up in a straight line since its trading debut as people added decks to their new or existing homes.“Coming into the pandemic, we really saw strong sales. After a pause in April and May, we returned to growth. So sales have been steady and actually accelerating as we went into the most recent quarter,” The Azek Company CEO Jesse Singh told Yahoo Finance’s The First Trade.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}