{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-24-2020-221938970.html", "published": 1593011540.0, "headline": "Stock market news live updates: Stock slide as coronavirus cases surge in some states", "body": "Stocks sank Wednesday, with the S&P 500 and Dow selling off by more than 3% at session lows as rising numbers of Covid-19 infections in some regions spooked investors.[Click here to read what’s moving markets heading into June 25, 2020]Florida and California on Wednesday reported record high one-day tallies for new confirmed coronavirus cases at 5,508 and 7,149, respectively. Arizona on Wednesday saw another 1,795 positive cases after adding a record 3,591 on Tuesday. In Texas, Houston Mayor Sylvestor Turner said that the city’s intensive care units were at 97% of capacity, according to a Twitter post from a Houston city councilwoman.Meanwhile, New York Governor Andrew Cuomo announced Wednesday that travelers to New York, New Jersey and Connecticut coming from Covid-19 hot spots would be subject to a 14-day quarantine.“The latest coronavirus news is not positive for the stock market which was betting the worst of the pandemic recession was behind us,” Chris Rupkey, chief financial economist for MUFG Union Bank, said in an email. “All the hopes of investors looking for a better economy to improve the bottom lines of companies shut down in the recession have been dashed. Forget about the fears of the virus coming back in the fall, the number of new cases and hospitalizations in states like Arizona, Texas, and Florida says the threat is happening right now.”The increases in new cases also came in states that comprise major portions of overall economic activity to the country, based on gross domestic product (GDP). Neil Dutta, head of economic research at Renaissance Macro Research, pointed out in a note Wednesday that California, Texas, Arizona and Florida together contribute 30.3% of US GDP.Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said during an appearance before the House Energy and Commerce Committee Tuesday that the “next couple of weeks are going to be critical” in containing the virus in states in the South and West where surges have appeared.Story continuesStill, state and local officials have so far largely tabled the idea of shutting down their state economies again, with Texas Gov. Greg Abott saying that a new lockdown would be the last option. Fauci also added during his testimony that states might not require going back into “an absolute lockdown” to contend with the latest rise in cases.Despite the uncertainty around the virus, stocks still closed higher at the end of the regular session Tuesday, helped in part by optimism over a coronavirus vaccine and some improving economic data. And investors have continued to bet on increased stimulus from policymakers to boost the economy in the face of the pandemic, with the Washington Post reporting Tuesday that President Donald Trump supported another round of direct checks to taxpayers.Still, concerns over the trajectory of economic activity have mounted as the coronavirus pandemic continues. The International Monetary Fund on Wednesday downgraded its global growth forecast for 2020 to -4.9% from -3.0% in April, marking the institution’s lowest estimate in the history of is forecasts.—4:02 p.m. ET: Dow drops 708 points after California, Florida report daily records for virus casesHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): -80.83 (-2.58%) to 3,050.46Dow (^DJI): -709.06 (-2.71%) to 25,447.04Nasdaq (^IXIC): -222.20 (-2.19%) to 9,909.17Crude (CL=F): -$2.53 (-6.27%) to $37.84 a barrelGold (GC=F): -$7.70 (-0.43%) to $1,774.30 per ounce10-year Treasury (^TNX): -2.5 bps to yield 0.6840%—3:24 p.m. ET: Apple adds Houston to list of cities with renewed store closures following coronavirus spikeApple (AAPL) said on Wednesday it is re-closing seven stores in Houston, Texas due to the city’s recent jump in coronavirus cases. The store closures will be temporary.Last week, the company re-closed 11 stores among four states – Florida, Arizona, North Carolina and South Carolina – due to sharp increases in Covid-19 cases in these regions. However, most of Apple’s 271 domestic stores have reopened and stayed open.—11:51 a.m. ET: S&P 500, Dow drop more than 3%Here were the main moves in markets as of 11:51 a.m. ET:S&P 500 (^GSPC): -94.67 points (-3.02%) to 3,036.62Dow (^DJI): -824.54 points (-3.15%) to 25,331.56Nasdaq (^IXIC): -277.6 points (-2.74%) to 9,853.77Crude (CL=F): -$2.58 (-6.39%) to $37.79 a barrelGold (GC=F): -$5.10 (-0.29%) to $1,776.90 per ounce10-year Treasury (^TNX): -2.5 bps to yield 0.684%—11:20 a.m. ET: Stocks extend losses as coronavirus case jump rattles investorsWall Street’s woes deepened in late morning trading, with spiking cases in Texas and Florida shaking investors out of their complacency. While analysts believe hospitalizations and deaths are the best metric for judging the path to a recovery, growing COVID-19 diagnoses is underscoring how the world’s largest economy has failed to control the outbreak — and a rally that some think has defied gravity could be in trouble.—9:31 a.m. ET: Stocks open lowerHere were the main moves in markets as of 9:31 a.m. ET:S&P 500 (^GSPC): -22.33 points (-0.71%) to 3,108.96Dow (^DJI): -232.93 points (-0.89%) to 25,923.17Nasdaq (^IXIC): -26.26 points (-0.26%) to 10,104.59Crude (CL=F): -$0.53 (-1.31%) to $39.84 a barrelGold (GC=F): -$8.60 (-0.48%) to $1,773.40 per ounce10-year Treasury (^TNX): +1.1 bps to yield 0.72%—9:01 a.m. ET: IMF downgrades global growth expectations, with recovery ‘projected to be more gradual than previously forecast’The International Monetary Fund (IMF) slashed its expectations for global economic activity this year and said it anticipated negative growth for every global region for the first time in the history of the forecasts.The IMF sees 2020 global economic activity contracting by 4.9%, the institution’s steepest contraction estimate ever. In April, the IMF projected a 3% contraction in global economic activity. US growth is expected to drop by 8.0%, versus the 5.9% drop anticipated as of April’s forecast.“The COVID-19 pandemic has had a more negative impact on activity in the first half of 2020 than anticipated, and the recovery is projected to be more gradual than previously forecast,” the IMF said in its World Economic Outlook report.—7:29 a.m. ET Wednesday: Stock futures dropHere were the main moves in markets as of 7:29 a.m. ET:S&P 500 futures (ES=F): 3,097.5, down 21 points or 0.67%Dow futures (YM=F): 25,809.00, down 211 points, or 0.81%Nasdaq futures (NQ=F): 10,161.00, down 35 points, or 0.34%Crude (CL=F): -$0.82 (-2.03%) to $39.55 a barrelGold (GC=F): +$9.40 (+0.53%) to $1,791.40 per ounce10-year Treasury (^TNX): +0.9 bps to yield 0.719%—7:01 a.m. ET Wednesday: Weekly mortgage applications for home purchases fall for the first time in 10 weeksAn index tracking mortgage applications for home purchases dropped by a seasonally adjusted 3% week on week for the period ending June 19, the Mortgage Bankers Association said Wednesday. This marked the first weekly decline after nine consecutive weeks of gains.However, the index was still 18% higher than the same week a year ago on an unadjusted basis.Mortgage applications for refinances fell 12% from the prior week, but held 76% higher than the same week a year ago.“Even with high unemployment and economic uncertainty, the purchase market is strong. Activity has climbed above year-ago levels for five straight weeks and was 18% higher than a year ago last week,” Joel Khan, MBA’s associate vice president of economic and industry forecasting, said in a statement. “One factor that may potentially crimp growth in the months ahead is that the release of pent-up demand from earlier this spring is clashing with the tight supply of new and existing homes on the market. Additional housing inventory is needed to give buyers more options and to keep home prices from rising too fast.”—6:05 p.m. ET Tuesday: Stock futures little changed to slightly lowerHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:05 p.m. ET:S&P 500 futures (ES=F): 3,116.25, down 2.25 points or 0.07%Dow futures (YM=F): 26,001.00, down 19 points, or 0.07%Nasdaq futures (NQ=F): 10,195.75, down 0.25 points, or 0.00%NEW YORK, NEW YORK - MAY 26: The New York Stock Exchange (NYSE) stands in lower Manhattan on the first day that traders are allowed back onto the historic floor of the exchange on May 26, 2020 in New York City. While only a small number of traders will be returning at this time, those that do will have to take temperature checks and wear face masks at all times while on the floor. The Dow rose over 600 points in morning trading as investors see economic activity in America picking up (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}