{"article": [{"url": "https://finance.yahoo.com/news/august-jobs-report-labor-department-coronavirus-pandemic-unemployment-200735185.html", "published": 1599205160.0, "headline": "Jobs report: US economy adds 1.371 million payrolls in August, unemployment rate dips to 8.4%", "body": "The US economy added back a greater than expected number of payrolls in August and the unemployment rate improved by a larger than anticipated margin, as employers continued to bring back workers as virus-related business disruptions abated. Still, the pace of payroll gains slowed relative to recent months.Here were the main metrics from the Department of Labor’s August jobs report released Friday morning, compared to consensus estimates compiled by Bloomberg:Change in non-farm payrolls: +1.371 million vs. +1.350 million expected, vs. +1.734 million in JulyUnemployment rate: 8.4% vs. 9.8% expected, vs. 10.2% in JulyAverage hourly earnings, month over month: 0.4% vs. 0.0% expected, +0.1% in JulyAverage hourly earnings, year over year: 4.7% vs. 4.5% expected, 4.7% in JulyLabor force participation rate: 61.7% vs. 61.8% expected, 61.4% in JulyEven with another print above 1 million, the number of non-farm payrolls added in August has not come close to fully plugging the deficit created during the earlier months of the pandemic. In March and April, non-farm payrolls plunged 1.373 million and then by a record 20.787 million, respectively, in a testament to the devastating blow the virus dealt to the US economy. Payrolls in June had risen by a record 4.781 million, after a gain of 2.725 million in May, leaving the total net jobs lost since March at about 11.5 million.A rise in temporary hiring for the 2020 Census helped boost non-farm payrolls in August, with government jobs jumping by 344,000 month-on-month, including a gain of 238,000 directly due to Census hiring. But in the private sector, nearly ever major industry group in both services and manufacturing added payrolls on net as well.Within services, retail trade again led advances, with payrolls rising by 248,900 to extend July’s gain of 236,200. This was followed by leisure and hospital with 174,000 job additions, though this sum marked a major step down from the 621,000 positions added in July. Education and health services added gained 147,000 payrolls.Story continues“Employment growth is still set to lag the recovery in broader economic activity over the coming months given its greater exposure to the services sectors worst affected by the pandemic,” Andrew Hunter, senior US economist for Capital Economics, said in a note Friday. “Nevertheless, the August data illustrate that, despite the earlier surge in virus cases and more recent fading of fiscal support, the recovery continues to plough on.”Manufacturing payrolls rose by 29,000, sharply missing consensus expectations for 65,000. This came as motor vehicle and parts industries lost 5,300 payrolls in August, giving back some of July’s gain of more than 40,000.The overall unemployment rate improved to 8.4% in August for the first reading below 10% since March. This came as the labor force participation rate also improved to 61.7%, or a level now 1.5 percentage points above the pandemic-era low, but still 1.7 percentage points below its February pre-pandemic print.Economists and officials have also now focused more closely on the Labor Department’s data on “permanent job losers,” or those who do not expect to be called back from temporary layoffs, as a warning sign of the longer-term impacts of the pandemic on the labor market. In August, the number of permanent job losers increased by 534,000 to 3.4 million after holding steady month over month at about 2.9 million in July. Since February, the number of individuals counted as permanent job losers has increased by 2.1 million.“The duration of unemployment acts as an additional headwind to a robust jobs recovery, even as the number of unemployed workers decreases,” said John Leer, economist at data intelligence company Morning Consult. “History has shown that it becomes increasingly difficult for unemployed workers to find jobs the longer they remain unemployed, either because they lose the skills they need to compete, or due to the stigma of long-term unemployment.”The US economy added a greater than expected number of payrolls in August, and the unemployment rate improved by a greater than expected margin. (David Foster/Yahoo Finance)Concerns that a sizable portion of the working age population could be out of work for the long-term in the wake of the pandemic have not been lost on policymakers. Federal Reserve officials on Wednesday highlighted in their September Beige Book, “Employment increased overall among Districts, with gains in manufacturing cited most often,” in the period up until August 24. However, they added that “some Districts also reported slowing job growth and increased hiring volatility, particularly in service industries, with rising instances of furloughed workers being laid off permanently as demand remained soft.”Ahead of the August jobs report, other data on the state of the US labor market in late summer came in mixed. ADP’s report out Wednesday on private payrolls showed 428,000 jobs were added in August, sharply missing estimates for 1 million. The report, however, has consistently undershot the results of the Department of Labor’s jobs release especially during the pandemic.Elsewhere, the Institute for Supply Management’s (ISM) manufacturing and service sector employment indices showed further improvements in August from earlier this summer, but each still held in contractionary territory. And leading up to the jobs report survey week in mid-August, the Labor Department’s report on weekly jobless claims showed an improvement in the number of new unemployment claims filed relative to July.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}