{"article": [{"url": "https://finance.yahoo.com/news/jeffrey-gundlach-outlook-on-gold-134509885.html", "published": 1597222400.0, "headline": "Billionaire investor Jeffrey Gundlach predicts gold prices will 'go much higher' in the long-term", "body": "Billionaire bond investor Jeffrey Gundlach believes that gold (GC=F) prices will go higher in the long-term, but warns of a short-term reversal.\"There's a whole bunch of questions about gold. Suddenly, everyone wants to talk about gold,\" Gundlach, the CEO of $135 billion DoubleLine Capital, said during a Q&A for the firm's closed-end funds' webcast on Tuesday afternoon.On prior webcasts, Gundlach has talked favorably about the long-term prospects of the precious metal, saying in early June that he’s “unequivocally bullish” on gold in the longer-term.Gold rallied to a new high all-time high of $2,075 last week but has since dropped dramatically.\"It also had previously gone to a new high in just about every other currency as the dollar held up pretty well until recent months when the DXY index dropped about 10% or so from high to low, and that went along with gold going to new highs,\" Gundlach noted.Gold. (Yahoo Finance, GC=F)Gundlach believes that \"most markets right now are at a reversal stage.\"\"I'm not surprised to see gold drop $100-plus [Tuesday]. I think yields have started to drift higher at the long end. I'm not interested in long-term treasury bonds at all. I'm not interested in short-term treasury bonds really at all, either,\" Gundlach added.He referenced the U.S. budget deficit, calling out the explosive growth in the deficit this summer because of coronavirus aid.\"If we are going to continue that type of a pace, we'd be looking at over 50% of GDP in terms of the budget deficit, which is getting almost surreal in terms of what's happening,\" he added.“Gold will ultimately go much higher because I think the dollar's going to go much lower,” he said.To be sure, he thinks the dollar’s decline at the moment \"is probably nearly over.\"\"I think the dollar goes lower in the long-term for sure, but in the short-term, I think most markets have lost some of their momentum of the recent moves,\" Gundlach said.He noted that gold could \"always retest\" its recent highs in the near-term.Story continuesElsewhere, he pointed to interest rates, which he noted look like they're “rising gradually until the Federal Reserve institutes yield curve control. Whenever that might be, they've talked about it a lot.”Gundlach also thinks “the risk rally off of the March lows is probably getting long in the tooth.\"\"So, I'm looking for short-term reversals as a general theme in markets, and that goes for gold as well,\" the investor said.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach predicts that Trump will win re-electionAckman looks to ‘marry a unicorn’ with record-breaking SPACAckman sees ‘real recovery’ in back half of 2021, remains upbeat of offices and restaurantsPalihapitiya: Skip government bailouts, put ‘more money into the hands of consumers’Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investorsBillionaire Palihapitiya on the phenomenon of ‘spectacular’ AOCRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}