{"article": [{"url": "https://finance.yahoo.com/news/u-democrats-push-extend-600-132413076.html", "published": 1593592340.0, "headline": "U.S. Democrats push to extend $600 weekly coronavirus unemployment benefit", "body": "WASHINGTON, July 1 (Reuters) - Democrats in the U.S. Senate, impatient with the pace of Republicans' consideration of additional aid related to the coronavirus pandemic, on Wednesday proposed long-term extensions to a temporary unemployment insurance program.The $600-per-week payments to laid-off workers, which began at the end of March and are set to expire on July 31, would be extended until jobless rates in individual states fell below 11%.On June 5 the U.S. unemployment rate stood at 13.3%.Under the Democrats' legislation, these federally backed benefits would fall by $100 for every percentage-point decrease in a state’s unemployment rate, until joblessness falls below 6%.The proposal comes as 33 million people in the United States are either receiving unemployment benefits or awaiting approval, Senate Democratic Leader Chuck Schumer said.While many workers have been returning to their jobs after states loosened self-quarantine steps in response to the coronavirus pandemic, a significant increase in hospitalizations in several states has since caused some governors to rein in those actions.On Tuesday, Senate Majority Leader Mitch McConnell, a Republican, said he supports continuing expanded unemployment insurance benefits during the pandemic but said the size of the $600-per-week payments have discouraged some workers from returning to their jobs.McConnell has ignored a $3 trillion coronavirus aid bill passed by the House of Representatives in May, saying he wanted to first gauge the state of the hobbled U.S. economy before acting on a bill at the end of this month.But even Republicans wanted to take some action sooner. Late on Tuesday, the Senate unanimously approved a Democratic bill to extend an expiring $660 billion small business emergency loan program through Aug. 8. (Reporting by Richard Cowan; editing by Jonathan Oatis)"}]}