{"article": [{"url": "https://finance.yahoo.com/news/goldman-sachs-the-next-big-investment-opportunity-170310214.html", "published": 1597234280.0, "headline": "Goldman Sachs: The next big investment opportunity", "body": "It may be time to hit pause on the red-hot big cap tech trade of 2020 fueled by names such as Zoom (ZM) and Advanced Micro Devices (AMD) and take a ride on some less exciting industrial and utilities stocks.Well, perhaps movers of dirt and sellers of electricity are more exciting investments than one thinks if listening to the new pitch from strategists at Goldman Sachs. The investment bank lifted its outlook on the industrials and utilities sector on Wednesday, citing a host of reasons to get long in a space that had fallen out of favor amidst the COVID-19 pandemic.“Industrials should benefit from improving global economic growth and potential infrastructure spending while Utilities’ dividend yield relative to the level of interest rates is near a 25-year high,” writes Goldman’s Arjun Menon. Goldman is looking for 5.6% global GDP growth in 2021, which would be vastly improved from the 5% plunge expected this year.The Dow Transports have come on strong.Menon adds, “Improving global economic growth and low interest rates should also be tailwinds to select cyclical and defensive pockets within the equity market. Within cyclicals, stocks that are most positively correlated with global economic growth should see their businesses normalize faster than companies that are more tied to the domestic economy. Among defensives, low interest rates mean total cash return yields will likely be a key determinant of performance through the remainder of this year.”Goldman retained its overweight recommendation on information technology, citing attractive fundamentals. It continues to hold bearish views on health care, real estate, energy and materials.Only until recently have more cyclical areas of the market begun to catch bids. So if anything, Goldman’s upgrade lends validity to a move in markets that hasn’t gotten a ton of attention. Prior to Wednesday’s session, the Dow Jones Transportation Average had risen for 10 straight sessions. The index has quietly outperformed the S&P 500 and Nasdaq Composite this past month (see chart above), according to Yahoo Finance Premium data.Story continuesNot everyone on Wall Street is sold just yet on Goldman’s call.“We want to see if it’s more sustainable. If you look at historical cycles, once the economy truly starts to recover it is all about getting cyclical — or the stocks that got beaten down the most during the decline. They tend to rally. Normally we would have seen it by now. Because it’s such a unique recession, we haven’t seen it yet. So eventually, yes, it will be the big trade probably over the next 12 to 18 months,” Ned Davis Research chief U.S. strategist Ed Clissold told Yahoo Finance’s The First Trade.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}