{"article": [{"url": "https://finance.yahoo.com/news/what-the-feds-coronavirus-response-means-for-the-growing-problem-of-zombie-debt-105613845.html", "published": 1591941860.0, "headline": "What the Fed's coronavirus policy means for mushrooming 'zombie' corporate debt", "body": "By resolving to keep its foot on the pedal of easy monetary policy, the Federal Reserve is likely to continue fueling a binge in corporate borrowing, which carries the risk of postponing the day of reckoning for financially distressed companies.The boom in investment grade and high yield issuance has sent non-financial corporate debt levels to over $10 trillion, according to Federal Reserve data. As the coronavirus crisis gained a foothold in the world’s largest economy back in March, yields — which move inversely to prices — surged as investors priced in a looming financial disaster.However, the Fed’s crisis policy, which includes zero interest rates and purchases of exchange-traded funds and corporate debt, has bolstered the sector and sparked at least $1 trillion more in fresh issuance last month. The central bank’s ultra-loose policy has been credited with helping to fuel Wall Street’s rally, which until this week seemed unstoppable.“It’s very clear to me given where we are on the growth/inflation outlook the Fed will keep pushing policy in a dovish direction and rising asset markets won’t deter them at all,” said Eric Stein, co-director of global income for Eaton Vance Management.It’s also raised growing concerns about the prospect for so-called “zombie companies” haunting markets indefinitely, when some might be better off going under.“Allowing zombie companies to linger might be why long term growth suffers as a consequence of a severe financial crisis and recession,” BNY Mellon Asset Management chief economist Vincent Reinhart told Yahoo Finance’s On The Move on Thursday.File-This July 31, 2019 file photo shows the Federal Reserve Building in Washington. The Federal Reserve says corporate debt remains at historically high levels but overall the U.S. financial system is resilient, a view in sharp contrast to the problems that led to the 2008 financial crisis. (AP Photo/Patrick Semansky, File)‘Speculative fever’The risks are multiplying, as major companies in some of the hardest-hit sectors of the COVID-19 crisis have used favorable market conditions to tap debt markets in offerings worth billions of dollars — including Marriott (MAR), Carnival (CCL), Delta (DAL) and Avis (CAR). In May, Boeing (BA), sandbagged by the coronavirus and an ongoing crisis with its flagship 737 MAX, was still able to raise $25 billion in a blockbuster debt sale.Story continuesAccording to Fitch Ratings, U.S. non-financials flooded the market with a record $584 billion of investment-grade debt alone last month —more than twice the amount from the comparable year-ago period.The market is set to eclipse the previous record high of $644 billion in 2017, Fitch noted, with the value of all investment grade bonds now over $4.4 trillion.It’s part of what Kathy Jones, Charles Schwab’s chief fixed income strategist called a “speculative fever” feeding the market’s appetite for debt, and companies’ desire to issue it.While bonds’ yields have recovered from the blow out earlier this year, “not that much has changed for a lot of these companies that find themselves with a certain amount of stress,” Jones told Yahoo Finance.“Interest rates are lower so that may help them roll over some loans but clearly the economy is in a deep recession and a lot of people have rushed in...and its lifted all boats,” she added.That’s bad news given that some marginal companies are less productive than their peers, and keeping them afloat has spillover economic effects, according to Torsten Slok, Deutsche Bank’s chief economist.“One consequence of aggressive Fed support to credit markets and long periods of low interest rates is that it interferes with the process of creative destruction and keeps companies alive that would otherwise have gone out of business,” Slok wrote in a client research note this week.“This is a macroeconomic problem because zombie firms are less productive, and their existence lowers investment in and employment at more productive firms,” he added.“In short, one side effect of central banks keeping rates low for a long time is that it keeps more unproductive firms alive, which ultimately lowers the long-run growth rate of the economy,” Slok wrote.According to data from Goldman Sachs, corporate bonds have retraced over 90% of the spread widening from the beginning of 2020 to the March 23 peak, with investment grade and junk issuance up 90% and 57% year-over-year, respectively.That may not be a problem if a V-shaped recovery emerges. However, new COVID-19 infections have spooked markets, and thrown rosier scenarios into doubt.Both quality and high yield issuers “have responded to the crisis by increasing gross leverage, which has allowed them to strengthen their liquidity positions. But should the economic recovery disappoint, the recent increase in gross leverage could become permanent, or worse, translate into higher net leverage as earnings continue to contract,” Goldman added.Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news"}]}