{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-fda-defends-plasma-authorization-as-antibody-treatment-options-expand-180907542.html", "published": 1598361440.0, "headline": "Coronavirus update: FDA defends plasma authorization as antibody treatment options expand", "body": "In the absence of widespread vaccine availability to curb the COVID-19 pandemic, momentum behind antibody treatments is ramping up — yet not without some controversy.A number of trials to determine the effectiveness of convalescent plasma and monoclonal antibodies are under way, with some of the largest pharmaceutical companies getting in on the action. Earlier this week, the Food and Drug Administration moved to grant emergency use authorization (EUA) to a coronavirus plasma treatment, which has drawn intense scrutiny from within the scientific community.FDA Commissioner Stephen Hahn defended the regulatory decision to authorize the use of convalescent plasma as a treatment for COVID-19, after harsh criticism, even as he acknowledged he erred in describing the treatment initially.In a series of tweets, Hahn denied political pressure from the White House, but insisted that the decision had been in the works for weeks.“Media coverage of FDA’s decision...questioned whether this was a politically motivated decision. The decision was made by FDA career scientists based on data submitted a few weeks ago,” Hahn posted on Twitter.“The authorization of emergency use of convalescent plasma is not a final approval. FDA will continue to monitor its use and will revoke authorization if needed,” he added.The scientific community also criticized a statistic touted both by Hahn and Health and Human Services Sec. Alex Azar — that the plasma resulted in a 35% reduction in mortality.The data came from the expanded access program at Mayo Clinic, which includes collaborations with hospitals around the country. That data is not from a randomized, placebo-controlled trial, which is the gold standard of human testing.Dr. Michael Joyner, who lead the Mayo Clinic program, told Yahoo Finance Tuesday the study has ended now that there is wider access to the treatment option, and health systems and research institutions have the liberty to enroll patients in controlled trials.Story continuesSome health experts said the EUA is likely to make enrollment in trials harder, but Joyner rebutted the idea.Globally, “accrual has been challenging. There are still a number of trials in the outpatient space and early disease state that will not be affected by this,” Joyner said.Hopes are now pinned on a treatment approval by this year, as the global count nears 24 million, with the U.S. still leading every country and on track to hit 6 million. Though the rate of new cases have decreased domestically, the reopening of schools and upcoming Labor Day holiday threaten to disrupt the trend.Universities opening for the fall have already had to reverse course after a spike in cases within days after reopening the campus for in-person classes.On Tuesday, South Korea, which had successfully curbed its outbreak, is closing schools after nearly 300 new cases were reported. The move highlights the difficulty in containing the virus that has spurred teachers union strikes in some major U.S. cities, with many fearful of a resurgence in areas where infections have been on the decline.Other antibody treatments in the worksCases in the U.S. are down by over 10%. (Graphic: David Foster/Yahoo Finance)On Tuesday, AstraZeneca (AZN) announced it is entering early-stage human trials for its monoclonal antibody treatment, which is similar to convalescent plasma in that they rely on the body’s production of antibodies to fight of the virus.The company is receiving federal funding from both the U.S. Department of Defense (DoD) and Biomedical Advanced Research and Development Authority (BARDA), part of Health and Human Services (HHS).The key difference between the two antibody options is convalescent plasma is directly donated from recovered COVID-19 patients. Meanwhile, monoclonal antibodies are copies created in laboratories. Yet both carry the potential to not only treat patients with the virus, but also act as a defense against contracting the virus.Regeneron (REGN) and Eli Lilly (LLY) are two other companies testing similar treatments. The former recently partnered with Roche (RHHBY) to manufacture its antibody cocktail treatment, and the U.S. recently began two trials of Eli Lilly’s antibody treatments at the beginning of the month.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}