{"article": [{"url": "https://finance.yahoo.com/news/trump-cuts-funding-for-white-privilege-training-as-more-republican-voters-acknowledge-systematic-racism-201317594.html", "published": 1599837680.0, "headline": "Trump cuts funding for 'white privilege' training as more Republican voters acknowledge systemic racism", "body": "President Trump recently directed federal agencies to divert dollars away from racial sensitivity training on white privilege.In a Sept. 4 letter addressed to the heads of executive departments and agencies, Russell Vought, director of the Office of Management and Budget, wrote, “It has come to the President's attention that Executive Branch agencies have spent millions of taxpayer dollars to date ‘training government workers to believe divisive, anti-American propaganda” that “teaches or suggests either (1) that the United States is an inherently racist or evil country or (2) that any race or ethnicity is inherently racist or evil.”Vought added, “The President has directed me to ensure that Federal agencies cease and desist from using taxpayer dollars to fund...any training on ‘critical race theory,’ ‘white privilege,’ or any other training or propaganda effort.”The president’s actions come as a growing number of Republican voters say they personally believe that systemic racism exists in the country today, according to a new report on “The Fight for Racial Justice in America” by Edelman, the global public relations and marketing firm.The Aug. 23 shooting of Jacob Blake by a white police officer in Kenosha, Wisc., impacted Americans’ views of systemic racism in the U.S, according to the report. (Edelman surveyed 2,000 respondents from Aug. 14- 21, and performed additional fieldwork from Aug. 28-31.)President Donald Trump speaks at a 19th anniversary observance of the Sept. 11 terror attacks, at the Flight 93 National Memorial in Shanksville, Pa., Friday, Sept. 11, 2020. (AP Photo/Gene J. Puskar)More than three-quarters (76%) of survey respondents acknowledged that systemic racism is a problem in America in the wake of Blake’s shooting, a 5-point increase from survey results prior to his shooting.The greatest increase in awareness of racism in the country was among respondents who identified as Republicans – 57% – a 12-point jump the week of Aug. 28 from the week of Aug. 21 (before Blake’s shooting). That compares with a 2-point increase among the 93% of Democrats who said systemic racism exists in the U.S. over that same period.Story continuesIn a previous report conducted by Edelman about two weeks after the death of George Floyd in May, 63% of Americans indicated they were concerned about systemic racism. Only 40% of Republicans were, compared to 84% of Democrats. (Edelman surveyed 2,000 respondents from June 5-7).“I think that systemic racism is the cancer of our society and I hope that people just process that when they decide whether or not to vote and for whom to vote,” Edelman CEO Richard Edelman told Yahoo Finance.Overall, only 33% of Americans trust the federal government to do what’s right when it comes to responding to the problem of systemic racism, according to the report. “Government at the moment is in its sort of low ebb because of politics,” said Edelman.While most Americans do not trust the federal government on its racism response, 71% of people say their employer is the only institution they trust to do what’s right. However, most Americans believe that employers have a lot of work to do to address racism.“That’s a big clue for all the companies in the country where [Americans] are looking for you to fix your supply chain, to make sure that you’ve got diverse population within your executive ranks, that you’re doing everything you can to offer financing to small business, and making sure that the people who are in community of color in this country feel as if they’re being properly treated at work,” said Edelman.According to the report, 58% of Americans see some amount of racism in their workplace.“Seventy-five percent of the African Americans who we studied said they’ve had experience with racism in their company. That’s shocking. It’s not supposed to be,” said Edelman.More from Sibile:We’ll ‘have a way’ to ban fracking in Biden administration: Sierra ClubJob cuts come for white-collar workers: ‘There are no truly recession-proof’ occupationsThe Trump payroll tax break you won’t see on your paycheck‘Ghosting’ is not just for lovers. These job applicants say ‘cruel’ and ‘selfish’ employers do it too.Trump’s $300 per week unemployment boost ‘too little, too late’ to help August spending: GoldmanFind live stock market quotes and the latest business and finance news"}]}