{"article": [{"url": "https://finance.yahoo.com/news/consumer-spending-gains-slows-1-125158760.html", "published": 1601539160.0, "headline": "Consumer spending gains slow to 1% in August", "body": "WASHINGTON (AP) — U.S. consumer spending slowed in August and personal income fell as a $600 weekly benefit for Americans who are unemployed during the pandemic expired.The Commerce Department reported Thursday that spending grew by just 1%, the weakest growth since spending fell 12.7% in April when rapidly spreading COVID-19 infections shut down large parts of the economy.A 2.7% drop in income in August followed a gain of 0.5% in the previous month. The drop reflected the expiration of the $600 expanded unemployment benefit on July 31. Congress has so far failed to come up with a new virus relief package that would restore that benefit.Economists fear that without further government support, the economy will slow significantly in the final three months of this year as consumer spending slows with millions of people still out of work and government support fading.“Unless employment growth picks up or additional fiscal aid is extended, consumer spending is at risk of slowing dramatically,” said Gregory Daco, chief U.S. economist at Oxford Economics.Inflation, as measured by a gauge tied to consumer spending, rose 0.3% in August and is up 1.4% over the past 12 months. That is well below the Federal Reserve’s target to achieve 2% annual gains in inflation.The Fed in August said it was changing its policy to delay rate hikes until inflation has risen above 2% for a period of time, a change that should keep consumer and business borrowing costs lower for an extended period of time. The Fed projected no hikes of its benchmark rate through 2023.The 2.7% drop in incomes reflected a huge 14.8% decline in the category that covers government payments including unemployment benefits. Democrats and Republicans have been unable to restore the expired benefits because of wide differences between the two sides on how much additional support to provide.House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin held talks Wednesday about a massive COVID-19 rescue package, meeting face to face for the first time in more than a month in a last-ditch effort to seal a tentative accord on an additional round of coronavirus relief.Story continuesAt issue is a long-delayed package that would extend another round of $1,200 direct stimulus payments, restore bonus pandemic jobless benefits, speed aid to schools and extend assistance to airlines, restaurants and other struggling businesses. A landmark $2 trillion relief bill in March passed with sweeping support and is credited with helping the economy through the spring and summer.The 1% rise in consumer spending was driven by a 1.4% gain in spending on services with big gains coming for spending on food services and hotel and motel accommodations, two areas that were hit hard during the lockdowns. Spending on goods durable goods such as autos was up 0.9% in August while spending on nondurable goods such as food and clothing fell 0.1%.Consumer spending is closely watched because it accounts for 70% of economic activity in the U.S.Economists believe GDP growth, which fell at a record annual rate of 31.4% in the April-June quarter will rebound by a record amount in the July-September quarter but could face a severe slowdown in the current quarter in the absence of further government help."}]}