{"article": [{"url": "https://finance.yahoo.com/news/york-city-restaurants-resume-indoor-172501572.html", "published": 1599654800.0, "headline": "New York City restaurants can resume indoor dining at one-quarter capacity this month", "body": "By Nathan Layne and Maria Caspani(Reuters) - New York City restaurants will be able to resume indoor dining at 25% capacity at the end of the month, New York Governor Andrew Cuomo said on Wednesday, relaxing one of last big COVID-19 limitations in the nation's most populous city.New York City has been the only region in the state where indoor dining was not allowed during the third phase of its reopening plan, as health officials worried that people eating inside without masks could spread the novel coronavirus.Cuomo said the decision was made following compliance and rule enforcement improvements. He said the city's coronavirus positivity rate, the proportion of daily tests with positive results, holding steady below 1% was another important factor.The city banned indoor dining in mid-March as the pandemic worsened. Hammered by the loss in business, restaurants looked to takeout and delivery orders to keep them afloat.In June, outdoor dining was approved, and restaurants got creative by putting tables on sidewalks, rooftops and even boats, festooning them with lights, umbrellas and festive decor. A plan to reopen indoor dining in July was delayed due to COVID-19 concerns.Restaurateurs cautiously welcomed the news.\"Twenty-five percent is not that much, but it's something where you can do some math and know, more or less, how many customers you can have every day,\" said Giovanni Gelfini, the owner of Santa Panza, a restaurant in Brooklyn.Julie Lumia, co-owner of the venerable theater district restaurant Joe Allen, said she can rehire about 15% of the staff with the limited reopening, but will still lose money.\"We'll exist again, that's the important thing,\" she said. \"But we really have to see how comfortable everybody feels about going inside. It's a tricky one.\"At a news conference, Cuomo acknowledged the risk of future outbreaks but also stressed the economic pain the restrictions have caused. He said capacity could be lifted to 50% by Nov. 1.Story continues\"A restaurant is not just the restaurant owner. ... There is a whole industry around restaurants,\" Cuomo said.The state will expand its task force charged with enforcing restaurant compliance, and New York City will provide 400 additional inspectors to support that effort, he said.Restaurants will have to check the temperature of customers at the door and obtain contact information for contact tracing should there be an outbreak.Cuomo said the state would also establish a system encouraging customers to report restaurants not in compliance.\"This may not look like the indoor dining that we all know and love, but it is progress for restaurant workers and all New Yorkers,\" Mayor Bill de Blasio said.(Reporting by Nathan Layne in Wilton, Connecticut and Maria Caspani in New York; Additional reporting by Peter Szekely in New York; Editing by David Gregorio, Alistair Bell, Cynthia Osterman and Richard Chang)"}]}