{"article": [{"url": "https://finance.yahoo.com/news/walmart-and-marcus-by-goldman-sachs-to-offer-lines-of-business-credit-040125003.html", "published": 1600729760.0, "headline": "Walmart teams up with Goldman Sachs to offer online sellers business credit lines", "body": "Walmart (WMT) is getting into business lending — with some help from Goldman Sachs (GS).Beginning on Tuesday, small and medium-sized businesses that sell on the retail giant’s Marketplace will see invites to apply for business lines of credit offered by Marcus, Goldman’s online consumer banking unit. It’s part of a new partnership between the big-box retailer and the Wall Street giant.\"Access to affordable capital is more important than ever as businesses large and small work to adapt and evolve to serve customers and grow their businesses,\" Jeff Clementz, vice president of Walmart Marketplace, said in a blog post.Walmart.com sellers invited to apply for a business line of credit from Marcus will see a notification in the Seller Center dashboard.Initially, sellers can access lines of credit between $10,000 and up to $75,000. A source familiar with the matter told Yahoo Finance that, over time, Marcus hopes to raise the potential line of credit for qualifying customers to as high as $1 million.The credit lines have a fixed annual interest rate between 6.99% and 20.99%, depending on the business's creditworthiness.\"Lines of credit offer businesses the flexibility to access money when they need, which could help them move fast and meet during customer demand. It could also help fund innovation as we’re all working to adapt to changing customer behavior and preferences,\" Clementz wrote.Marcus by Goldman Sachs is offering business line of credit available for Walmart.com's Marketplace sellers.For Walmart, e-commerce has continued to show strong growth, especially during the coronavirus pandemic. Online sales skyrocketed 97% year-over-year during the second quarter, and Walmart.com's Marketplace sales grew triple digits.And while Walmart hasn’t publicly shared the number of sellers on its Marketplace, the site now features than 75 million items as it continues to challenge Amazon (AMZN) in e-commerce. This summer, Walmart partnered with Shopify (SHOP), an online e-commerce platform that caters to small and medium-sized businesses, to allow its sellers to list items on Walmart.com.Story continuesGoldman has also benefitted from the shift to the Web, amid an acceleration of digital-only banking during COVID-19 lockdowns. The bank has been working on expanding Marcus, its four-year-old digital-first consumer bank named after the 150-year-old Wall Street firm’s founder.Specifically, Goldman has taken a two-pronged approach by offering products through Marcus.com and its mobile app, and embedding its products into large partners' ecosystems, a strategy known as Banking-as-a-Service (BaaS).Toward this end, it’s partnered with JetBlue (JBLU), allowing travelers to access a no deposit, no-fee, fixed-rate point-of-sale installment loan for flights and vacations. And last year, Marcus teamed up with Apple (AAPL) and Mastercard (MA) to release its first-ever digital and physical credit card called the Apple Card.\"We are very excited about this partnership with Walmart. We built our seller financing platform with flexible technology architecture to enable us to meet end consumer's needs within the ecosystem of our partner,\" Abhinav Anand, managing director for Marcus by Goldman Sachs, said in a statement.Like the Walmart partnership, Goldman Sachs partnered with Amazon in June to offer its fixed-rate lines of credit to third party sellers.Consumer banking is becoming an ever increasing slice of Goldman’s revenue. In the second quarter, the segment posted revenues of $258 million, up 19% from the same period a year ago and amid a surge in consumer deposits that grew to $92 billion.The bank ended the quarter with $7 billion in loan balances, with about $2 billion from the Apple Card and $5 billion from Marcus' loan business.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. How kids and the coronavirus helped Walmart shape its yearly list of hot toysWalmart unveils ‘ultimate life hack,’ a $98 membership with access to groceries, gas, and delivery"}]}