{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-15-2020-221127015.html", "published": 1594825940.0, "headline": "Stock market news live updates: Dow rises as vaccine hopes, better than expected earnings buoy stocks", "body": "Stocks rose Wednesday after a strong set of earnings results before market open added to earlier hopes for a coronavirus vaccine. The Nasdaq traded choppily, however, as the big-tech FAANG stocks wavered. Cruise line, air line and other travel stocks jumped, and crude oil prices rose.[Click here to read what’s moving markets heading into Thursday, July 16]Goldman Sachs (GS) rose but pared gains, after the bank reported much stronger than expected Q2 revenue and held profit steady over last year despite disruptions from the pandemic. The bank’s quarterly investment banking revenue hit a record, and trading revenue more than doubled over last year as both fixed-income and equity trading picked up in the wake of the market run-up since March.Still, as with other banks including JPMorgan, Citigroup and Wells Fargo, Goldman Sachs stashed away an increasing sum in loan-loss provisions during the quarter to brace for potential customer defaults due to the pandemic. CEO David Solomon noted that the economic outlook “remains uncertain,” recapitulating the cautious tone other CEOs have offered in recent reports.Earlier after market close Tuesday, newly published data from Moderna (MRNA) fueled hopes that a vaccine providing protection against Covid-19 would be developed in the relative near-term. Moderna’s vaccine produced neutralizing antibodies in all 45 patients included in an early-stage human safety trial, according to data published after market close by the peer-reviewed New England Journal of Medicine.The data built on earlier promising, but incomplete, results Moderna had reported in May. A late-stage trial of the vaccine candidate is set to begin July 27, with Moderna representing one of the companies farthest along in creating a potential inoculation against the coronavirus. Shares of Moderna surged as much as 22.5% as of 4:00 a.m. ET Wednesday, adding to a year to date advance of more than 280% through market close a day earlier.Story continuesThe development, manufacturing and distribution of a vaccine against the coronavirus has been viewed by many as the critical component to bringing daily life back meaningfully to a semblance of normalcy. The US government has offered billions in funds among a number of drugmakers including Moderna, with the hope of delivering 300 million doses of a safe and effective vaccine against Covid-19 by January 2021.—4:03 p.m. ET: Dow gains 227 points or 0.85% amid vaccine hopes, better-than-expected earningsHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +29.05 (+0.91%) to 3,226.57Dow (^DJI): +227.51 (+0.85%) to 26,870.10Nasdaq (^IXIC): +61.92 (+0.59%) to 10,550.49Crude (CL=F): +$0.67 (+1.66%) to $40.96 a barrelGold (GC=F): +$0.50 (+0.03%) to $1,813.90 per ounce10-year Treasury (^TNX): +1.5 bps to yield 0.6300%—2:35 p.m. ET: All three major indices in the greenHere were the main moves in markets, as of 2:35 p.m. ET:S&P 500 (^GSPC): +30.5 points (+0.95%) to 3,228.02Dow (^DJI): +210.57 points (+0.79%) to 26,853.16Nasdaq (^IXIC): +71.72 points (+0.68%) to 10,560.32Crude (CL=F): +$0.92 (+2.28%) to $41.21 a barrelGold (GC=F): +$0.60 (+0.03%) to $1,814.00 per ounce10-year Treasury (^TNX): +1.8 bps to yield 0.632%—12:12 p.m. ET: Stocks pare gains, Nasdaq turns negative as big tech trade falters againThe S&P 500 and Dow rose but came off session highs Wednesday afternoon. The Dow cut its advance to fewer than 100 points, or about 0.3%, after being higher by 1.6%, or 428 points, earlier in the session.The industrials and materials sectors led gains in the S&P 500, while the tech-heavy communication services and information tech sectors lagged. Raytheon and Coca-Cola led gains in the Dow, as Goldman Sachs cut its advance from more than 5% earlier in the session to just over 1%.—10:30 a.m. ET: US crude oil inventories unexpectedly declined by 7.5 million barrels last week: EIAUS crude oil inventories dropped by 7.5 million barrels during the week ending July 10 over the prior week, according to the Energy Information Administration’s weekly report Wednesday morning. The result was an unexpected decline versus the build of 250,000 barrels expected, according to Bloomberg data. Still, inventories remain about 17% above the five-year average for this time of year, with energy demand still anchored by the coronavirus pandemic.US West Texas intermediate crude oil futures rose modestly after the report.—10:01 a.m. ET: Jefferies raises S&P 500 price target to 3,100, saying downside risks to earnings from Covid-19 ‘over-estimated’Jefferies equity strategist Sean Darby on Wednesday raised his price target on the S&P 500 to 3,100, citing a collapse in Treasury yields and the firm’s improving outlook on corporate earnings. The target implies about 3% downside from Tuesday’s closing prices, but marks a step up from Darby’s earlier price target for 2,800.“With credit spreads having done a significant amount of the heavy lifting in backstopping US equity markets since March, the invisible hand of easing financial conditions helped by a weaker dollar, a decline in two-year yields coupled with a shift downwards in the whole US yield curve has underwritten performance from June,” Darby wrote of stocks’ recent run-up.“However, there have been some other subtle and not so subtle shifts on a micro level,” he added. “It appears that analysts have over-estimated the downside risks to earnings from Covid-19, in contrast to the GFC when they under-estimated the downside risks.”Still, Darby highlighted two “non-economic risks” for the S&P 500.“Firstly, is the run-in to the US election, which tends to lead to higher volatility,” he said. “Secondly, is the high weighting of tech stocks within the S&P 500 and Nasdaq. High earnings expectations are becoming embedded in share prices while there is a tighter correlation amongst the stocks.”—9:31 a.m. ET: Stocks open higher, Dow adds 350+ pointsHere were the main moves in markets as of 9:31 a.m. ET:S&P 500 (^GSPC): +34.14 points (+1.07%) to 3,231.66Dow (^DJI): +372.3 points (+1.4%) to 27,014.89Nasdaq (^IXIC): +77.16 points (+0.74%) to 10,565.74Crude (CL=F): +$0.08 (+0.2%) to $40.37 a barrelGold (GC=F): -$5.90 (-0.33%) to $1,807.50 per ounce10-year Treasury (^TNX): -2.5 bps to yield 0.6150%—9:15 a.m. ET: Industrial production jumps by most since 1959 with reopening under wayIndustrial production in the US rose in June by the greatest month over month margin in over six decades, with businesses and manufacturing coming back after coronavirus-induced shutdowns across the country.Industrial production – a gauge of output at factories, mines and utility companies – surged 5.4% in June over May, following May’s 1.4% month on month increase, according to the Federal Reserve. Even with the month over month surge, however, the level of production remained 10.9% below its pre-pandemic level from February.“For the second quarter as a whole, the index fell 42.6 percent at an annual rate, its largest quarterly decrease since the industrial sector retrenched after World War II,” according to the Fed release. “Manufacturing output climbed 7.2 percent in June, as all major industries posted increases. The largest gain—105.0 percent—was registered by motor vehicles and parts, while factory production elsewhere rose 3.9 percent.”—8:31 a.m. ET: Import prices jump by greater than expected 1.4% in June for biggest rise since 2012Import prices rose at a quicker than expected pace in June as fuel costs rose, despite weakening trends in other categories.Headline import prices were up 1.4% in June over May, versus a 1.0% increase expected and May’s 0.8% rise, according to the Bureau of Labor Statistics. The gain was the largest since March 2012. Excluding petroleum prices, import prices rose 0.3% in June, though this was still faster than the 0.1% gain expected.—7:19 a.m. ET Wednesday: Stock futures extend gains on vaccine hopes, Dow futures climb 400+ pointsHere were the main moves in markets, as of 7:19 a.m. ET:S&P 500 futures (ES=F): 3,224.5, up 41 points or 1.29%Dow futures (YM=F): 26,915.00 up 424 points, or 1.6%Nasdaq futures (NQ=F): 10,749.5, up 103.25 points, or 0.97%Crude (CL=F): +$0.65 (+1.61%) to $40.94 a barrelGold (GC=F): -$5.80 (-0.32%) to $1,807.60 per ounce10-year Treasury (^TNX): +2.7 bps to yield 0.641%—6:00 p.m. ET Tuesday: Stock futures open higher, Moderna shares surge in late trading after promising trial dataHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:00 p.m. ET:S&P 500 futures (ES=F): 3,210.00, up 26.5 points or 0.83%Dow futures (YM=F): 26,744.00, up 253 points, or 0.96%Nasdaq futures (NQ=F): 10,733.75, up 87.5 points, or 0.82%NEW YORK, NEW YORK - MARCH 20: Traders, some in medical masks, work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}