{"article": [{"url": "https://finance.yahoo.com/news/trump-steel-tariffs-bring-job-110605592.html", "published": 1602224060.0, "headline": "Trump steel tariffs bring job losses to swing state Michigan", "body": "By Rajesh Kumar SinghCHICAGO(Reuters) - President Donald Trump promised a new dawn for the struggling U.S. steel industry in 2016, and the lure of new jobs in Midwestern states including Michigan helped him eke out a surprise election win.Four years later, Great Lakes Works - once among the state's largest steel plants - has shut down steelmaking operations and put 1,250 workers out of a job. A year before the June layoffs, plant owner United States Steel Corp called off a plan to invest $600 million in upgrades amid deteriorating market conditions.Trump's strategy centered on shielding U.S. steel mills from foreign competition with a 25% tariff imposed in March 2018. He also promised to boost steel demand through major investments in roads, bridges and other infrastructure.But higher steel prices resulting from the tariffs dented demand from the Michigan-based U.S. auto industry and other steel consumers. And the Trump administration has never followed through on an infrastructure plan.Michigan's heavy reliance on the steel and auto industries puts Trump's trade policy in sharp focus ahead of the Nov. 3 presidential election in this battleground state. Democrats say they aim to recapture the votes of blue-collar workers they lost to Trump four years ago - one key factor in his victory over Hillary Clinton. Trump won Michigan by less than one percent of the statewide vote total. The competition for the votes of often-unionized manufacturing workers - who historically have voted Democratic - will be just as fierce in the battleground states of Wisconsin and Pennsylvania, political analysts say.Biden leads Trump in Michigan by 8 percentage points, according to a Reuters/Ipsos state opinion poll of likely voters conducted from Sept. 29 - Oct. 6, widening his lead from a few weeks earlier.Nationally, the steel industry has been shedding jobs for the past year - since before the wider economic downturn caused by the COVID-19 pandemic - and now employs 1,900 fewer workers than it did when Trump took office, according to U.S. Labor Department data. (For a graphic on steel jobs, click https://tmsnrt.rs/2SRIEaF)Story continuesWhile the tariffs failed to boost overall steel employment, economists say they created higher costs for major steel consumers - killing jobs at companies including Detroit-based automakers General Motors Co and Ford Motor Co. Nationally, steel and aluminum tariffs resulted in at least 75,000 job losses in metal-using industries by the end of last year, according to an analysis by Lydia Cox, a Ph.D. candidate in economics at Harvard University, and Kadee Russ, an economics professor at the University of California, Davis. In all, they estimated, the trade war had caused a net loss of 175,000 U.S. manufacturing jobs by mid-2019.In Michigan, steelmakers have served layoff notices to nearly 2,000 workers since the tariff took effect, according to a Reuters analysis of the notices steel companies filed with the state. The state's primary metals manufacturing industry, which includes iron and steel mills, employed about 7,300 fewer workers in August than in March 2018, when Trump announced metal tariffs, according to data from Federal Reserve Bank of St. Louis.The steel-industry setbacks account for just a fraction of the job losses in Michigan's manufacturing sector - which now employs 55,100 fewer workers than it did when Trump took office in January 2017, U.S. Labor Department data shows. The state's automotive industry accounted for 35% of the manufacturing job losses, according to the St. Louis Fed.Whether such statistics will change swing-state voters' minds remains to be seen. Bill Wischman, a financial manager at a Ford manufacturing facility in Plymouth, Michigan, says Trump has done more to protect U.S. manufacturing than any of his predecessors.\"He has given a whole-hearted effort,\" said Wischman, 51, a Republican who voted for Trump in 2016.Bob Kemper, grievance committee chairman at Great Lakes Works' chapter of the United Steelworkers (USW) Union, put the blame squarely on Trump for the job losses.\"I don't see any policy that helped us,\" said Kemper, who is backing Biden. \"We are losing our damn jobs here.\"The 1.2 million-member United Steelworkers (USW) Union, which represents U.S. manufacturing workers in many industries, supported Clinton in the last election and will again back the Democrat this time. Kemper acknowledged that many of his co-workers voted for Trump in 2016 but says that support has diminished along with the fortunes of Michigan's steel industry.Trump made similar 2016 campaign promises to revive the ailing coal industry by rolling back environmental regulations. But that industry's employment has dropped 9% since 2016, to about 46,000, as 66 coal plants - nearly a fifth of the U.S. total - have closed. The economic losses come despite the administration's moves to ease restrictions including limits on carbon emissions and dumping coal waste into streams.The Republican party in Michigan did not respond to requests for comment. White House Trade and Manufacturing Policy Director Peter Navarro did not answer questions from Reuters on the data showing job losses in steel and manufacturing.When U.S. Steel idled Great Lakes Works, which primarily serves the automotive industry, it cited weak demand, lower steel prices and a new corporate strategy to invest in more cost-efficient technology. In May, Cleveland-Cliffs Inc said it was closing its hot strip steel mill and some other operations in the Detroit area and laying off 343 workers. It cited \"rapidly deteriorating business conditions.\"A Cleveland-Cliffs spokeswoman did not answer questions about the impact of Trump's trade policy on its business.U.S. Steel defends Trump's tariffs. Company spokeswoman Meghan Cox said the policy helps \"ensure the strength of America's steelmaking capacity during this pandemic.\"The firm's shares have plunged about 82% since the beginning of March 2018 - the month Trump announced steel tariffs - compared with a 28% increase in the S&P 500 during the same period. U.S. steel prices are now 33% below their peak in May 2018 but remain 21% higher than the global market price because of tariffs - a gap that hurts the competitiveness of U.S. companies who fashion products from domestic steel.\"No matter what the tariff is, you cannot sell something if there is limited demand,\" said Ned Hill, a professor of economic development at the Ohio State University.'THRIVING' ENTERPRISETrump said at a Pennsylvania rally in August last year - as steel companies were grappling with falling demand and prices - that his tariff has turned a \"dead\" business into a \"thriving\" enterprise.The tariffs did initially benefit companies including U.S. Steel and Nucor by limiting competition and boosting prices. In late 2018, U.S. Steel workers secured a cumulative 14% wage increase over a four-year period.The tariffs also led to investment, said Jeff Ferry, chief economist at the Coalition for a Prosperous America, a bipartisan trade group. Older coal-fired plants such as Great Lakes Works closed because of outdated technology, he said.\"We are not doing this to save individual jobs\" in the short term, Ferry said of the tariffs. \"If you grow the industries, in the long term, headcount will grow.\"That's little comfort to the workers laid off from Great Lakes Works, who have found it harder to get new jobs amid the pandemic, Kemper said. The twin cities of Ecorse and River Rouge - which depended heavily on tax revenue from the plant - are also hurting, the cities' mayors said. Ecorse used to collect up to $6 million in property taxes from the mill - or half its revenue, said Mayor Lamar Indwell, a Democrat.Many Democrats have supported steel tariffs. The Biden campaign did not respond to a request for comment on its steel trade policy. In a statement to USW in May, Biden said steel tariffs would remain until a global solution to limit excess production - largely in China - can be negotiated.USW also supports tariffs but says the Trump administration undermined the policy by granting requests from steel-using U.S. manufacturers to exempt their imports - eliminating the advantage for domestic steel.TARIFF HITS MICHIGAN AUTO FIRMSThe tariffs had a profound impact on steel consumers, industry experts say. All three Detroit automakers - General Motors, Ford and Fiat Chrysler Automobiles NV - have closed a plant in Michigan since January 2018, according to Kristin Dziczek, vice president of industry, labor and economics at the Center for Automotive Research. Both General Motors and Ford reported $1 billion each in increased steel cost in 2018.GM declined to comment on the tariffs' impact. A Ford spokeswoman said the automaker faced higher raw material costs in 2018 because it buys 95% of its steel from domestic suppliers. While raw steel prices have since come down, Ford's manufacturing costs are still elevated because of U.S. tariffs on Chinese-made auto parts, she said. Retaliatory tariffs from China have also cut Ford's vehicle exports to that country.Companies further down the auto supply chain have also felt the impact of Trump's trade policy.Jeff Aznavorian, head of Michigan-based Clips & Clamps Industries, buys steel from U.S. mills to make metal and tool parts for Japanese and Detroit-based automakers. He said his company has lost contracts worth up to $3.6 million in the past two years. Competitors making parts in Canada and Mexico now have an advantage, he said, because steel costs have been lower in those countries.Aznavorian said he may move some of his business overseas.\"I need to be in a place where I can buy raw material at a competitive price,\" he said.(Reporting by Rajesh Kumar Singh; additional reporting by Timothy Gardner; editing by Caroline Stauffer and Brian Thevenot)"}]}