{"article": [{"url": "https://finance.yahoo.com/news/hall-of-fame-village-disneyland-of-football-is-coming-to-ohio-143200514.html", "published": 1597743620.0, "headline": "The ‘Disneyland of football’ is coming to Ohio", "body": "It’s every football fan’s dream.The Hall of Fame Resort and Entertainment Company (HOFV) is launching a 600-acre Hall of Fame Village surrounding the Pro Football Hall of Fame in Canton, Ohio — and it’s being called the “Disneyland of football.”“We’re creating something that will be a great experience for football fans all over the world,” Curtis Martin, Hall of Fame Resort and Entertainment Company board member and Hall of Famer most recently known for being a New York Jets running back, told Yahoo Finance’s On the Move.Renderings provided by the Hall of Fame Resort & Entertainment Company.The half-a-billion-dollar, mixed-use community will offer a football-themed water park, exclusive football content, retail, hotels, dining, apartments and even an assisted-living facility for retired NFL Alumni Association players and coaches.“[It’s] a great destination regionally for guests to come and be immersed in the sport of professional football… I think it’s [football fans] an underserved market,” said Mike Crawford, CEO of the Hall of Fame Resort and Entertainment Company and former Disney executive.Renderings provided by the Hall of Fame Resort & Entertainment Company.But the company, which started trading as a public company on July 2, isn’t completely reliant on traditional professional football, it is also capitalizing on youth sports, fantasy sports and eSports. The company recently acquired a majority interest in a developmental-stage professional fantasy football league, which will allow the Hall of Fame Village resort to offer virtual reality and augmented reality football experiences.“We want to put people in the game,” said Crawford. “We’ve talked a lot about putting our fans in the game and letting them feel what it would really be like to be a part of that huddle.”Renderings provided by the Hall of Fame Resort & Entertainment Company.Amid the coronavirus pandemicOn Monday, the Canadian Football League canceled its season and so far the NFL is scheduled to start its season September 10, but even if the coronavirus upends the NFL’s plan the resort’s stakeholders aren’t likely to get spooked about its future prospects, according to the company.Story continues“The power of professional football, the infrastructure that we have here, and certainly the support from the city and the government, we feel like it's a great recipe for success,” Crawford said.Renderings provided by the Hall of Fame Resort & Entertainment Company.It also helps that travel patterns have shifted this summer, boosting tourism to drive-to tourist destinations, and half of NFL franchises are within an eight-hour drive of the Village. The Hall of Fame Village is now an even more attractive destination for the tens of millions of football fans within a day’s drive of the resort, according to Crawford.“I think that sports is not only important for the players playing it but also for those who are watching it. And so hopefully we can return to some sense of normalcy,” said Martin. “My hope is that there’s something that we can do to get back to playing sports.”Renderings provided by the Hall of Fame Resort & Entertainment Company.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:There’s a record number of vacant rental apartments in ManhattanA mass exodus from American cities? Not quite: pollRent growth hits lowest level in about 6 years"}]}