{"article": [{"url": "https://finance.yahoo.com/news/fed-beige-book-concerning-commentary-about-labor-market-morning-brief-095720768.html", "published": 1599109520.0, "headline": "The Fed's concerning commentary about the labor market: Morning Brief", "body": "Thursday, September 3, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeFurloughs becoming permanent and pay bumps getting rolled back.The crucial August jobs report is just one day away.And ahead of this data, two readings on the labor market released Wednesday pointed to an employment slowdown in the first month since support from the CARES Act expired.And should serve as a troubling backdrop for lawmakers who are still far apart on passing a new aid package for workers and businesses operating at levels well below those that prevailed before the pandemic.Private payroll data from ADP published Wednesday morning showed that 428,000 jobs were added to private sector payrolls in August. This was more than the 212,000 added last month, but fewer than the 1 million jobs Wall Street expected were added last month.Ahu Yildirmaz, vice president and co-head of the ADP Research Institute, said Wednesday that, “The August job postings demonstrate a slow recovery. Job gains are minimal, and businesses across all sizes and sectors have yet to come close to their pre-COVID-19 employment levels.”And on Wednesday afternoon, the Federal Reserve’s latest Beige Book report showed the labor market remains mixed across the Fed’s 12 districts. The Beige Book is closely watched by investors as it forms the basis of the economic discussion that Fed officials will have during their next two-day policy meeting, set for September 15-16.“Employment increased overall among Districts, with gains in manufacturing cited most often,” the Beige Book said. This positive commentary on manufacturing employment that jives with data received out of that sector earlier this week highlighted in the Morning Brief on Wednesday.“However,” the report continued, “some Districts also reported slowing job growth and increased hiring volatility, particularly in service industries, with rising instances of furloughed workers being laid off permanently as demand remained soft.Story continues“Firms continued to experience difficulty finding necessary labor, a matter compounded by day care availability, as well as uncertainty over the coming school year and jobless benefits. Wages were flat to slightly higher in most Districts, with greater pressure cited among lower-paying positions. Some firms also rescinded previous pay cuts. Others, however, have looked to roll back hazard pay for high-exposure jobs, though some have chosen not to do so for staff morale and recruitment purposes.” (Emphasis added.)So, some positive indicators — wage pressures emerging lower-paying roles with pay cuts rescinded — and negative indicators with furloughs becoming permanent and hazard pay getting rolled back.But with the post-lockdown recovery still in its early stages and overall employment in the U.S. economy down by more than 12 million since February, flat-to-mixed outlooks for the labor market are not what policymakers ought to be shooting for.“Continued uncertainty and volatility related to the pandemic, and its negative effect on consumer and business activity, was a theme echoed across the country,” the Beige Book said.So while stocks on Wednesday continued to rally and earnings suggest better days are ahead in Corporate America, the current on-the-ground reality for many workers and consumers is an economic recovery leveling off at depressed levels.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7:30 a.m. ET: Challenger Job Cuts, August Y/Y (576% prior)8:30 a.m. ET: Non-farm Productivity, 2Q final (7.5% expected, 7.3% prior)8:30 a.m. ET: Unit Labor Costs, 2Q final (12.0% expected, 12.2% prior)8:30 a.m. ET: Initial Jobless Claims, week ended August 29 (950,000 expected, 1.006 million prior week)8:30 a.m. ET: Continuing Jobless Claims, week ended August 22 (14.000 million expected; 14.535 million prior week)8:30 a.m. ET: Trade Balance, July (-$58.0 billion expected; -$50.7 billion prior)9:45 a.m. ET: Markit US Services PMI, August Final (54.7 expected, 54.8 prior)9:45 a.m. ET: Markit US Composite PMI, August Final (54.7 prior)10:00 a.m. ET: ISM Services Index, August (57.0 expected, 58.1 prior)EarningsPre-market6:50 a.m. ET: Signet Jewelers (SIG) is expected to report an adjusted loss of $2.20 per share on revenue of $788.25 million7:00 a.m. ET: Campbell Soup Co. (CPB) is expected to report adjusted earnings of 61 cents per share on revenue of $2.06 billion7:00 a.m. ET: Designer Brands (DBI) is expected to report an adjusted loss of 96 cents per share on revenue of $594.57 millionPost-market4:05 p.m. ET: DocuSign (DOCU) is expected to report adjusted earnings of 8 cents per share on revenue of $319.33 million4:15 p.m. ET: Broadcom (AVGO) is expected to report adjusted earnings of $5.22 per share on revenue of $5.77 billion4:15 p.m. ET: Yext Inc (YEXT) is expected to report an adjusted loss of 12 cents per share on revenue of $85.13 millionTop NewsEuropean stocks climb as France unveils €100bn stimulus plan [Yahoo Finance UK]Amazon to create 7,000 new UK jobs by year end [Yahoo Finance UK]CBO sees U.S. federal debt exceeding size of economy in 2021 [Bloomberg]How kids, and the coronavirus, helped Walmart shape its yearly list of hot toys [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSCostco e-commerce sales up 101% in AugustMacy's will probably disappear before you know it: strategistColorado couple sees $200,000 in student debt discharged by judge—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}