{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-covid-weekly-initial-jobless-claims-june-20-195644738.html", "published": 1593070760.0, "headline": "Jobless claims: Another 1.48 million Americans file for unemployment benefits", "body": "More than three months into the COVID-19 crisis in the U.S., countless Americans are still unemployed. According to the U.S. Labor Department, weekly initial jobless claims data showed yet another week of claims exceeding 1 million.Another 1.48 million Americans filed for unemployment benefits in the week ending June 20, exceeding economists’ expectations for 1.32 million. The prior week’s figure was revised higher to 1.54 million from the previously reported 1.51 million claims. While this week’s report marked 12 consecutive weeks of deceleration, more than 47 million Americans have filed for unemployment insurance over the past 14 weeks.“Jobless claims are not falling fast enough,” Renaissance Macro’s Neil Dutta said in an email Thursday. “Everything we have seen in the last week or two between rising case counts/hospitalizations, stalling economic progress in some important states, government job cuts, means one thing: the Phase 4 of fiscal stimulus must be bigger. Things should be better in 3-4 weeks, but the news will get worse before it gets better. Take some chips off the table and reload the chamber for August.”Read more: Coronavirus: How to find a job in a tough economy(Yahoo Finance/David Foster)Continuing claims, which lags initial jobless claims data by one week, totaled 19.52 million in the week ending June 13, down from 20.29 million in the week ending June 6. Consensus expectations were for 20 million continuing claims.“Initial jobless claims continue to moderate only gradually,” Nomura economist Lewis Alexander wrote in a note Wednesday. “While the labor market remains exceptionally weak, signs of gradual improvement suggest another month of NFP gains during June.”In the week ending June 20, California reported the highest number of jobless claims at an estimated 287,000 on an unadjusted basis, up from 241,000 in the previous week. Georgia had 124,000, down from 132,000, Florida reported 93,000, New York had roughly 90,000 and Texas reported 89,000 jobless claims.Story continuesFRANKFORT, KY - JUNE 19: Hundreds of unemployed Kentucky residents wait in long lines outside the Kentucky Career Center for help with their unemployment claims on June 19, 2020 in Frankfort, Kentucky. (Photo by John Sommers II/Getty Images)Additionally, Pandemic Unemployment Assistance (PUA) program claims, which include those who were previously ineligible for unemployment insurance such as self-employed and contracted workers, was also closely monitored in Thursday’s report.PUA claims totaled 728,120 on an unadjusted basis in the week ending June 20, down from the prior week’s 770,920.As states reopen their economies, cases and hospitalization figures are back on the rise. As of Thursday morning, there were more than 9.4 million cases and 483,000 COVID-19 deaths around the world, according to Johns Hopkins University data. The U.S. had 2.3 million cases and 121,000 deaths.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.More from Heidi:White Claw pizza: Here's what Blaze Pizza’s latest creation tastes likeJobless claims: Another 1.51 million Americans file for unemployment benefitsRetail sales jump 17.7% in May amid COVID-19 pandemicFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}