{"article": [{"url": "https://finance.yahoo.com/news/southwest-ceo-increase-in-bookings-have-recently-stalled-because-of-coronavirus-spike-103143025.html", "published": 1595482760.0, "headline": "Southwest CEO: Bookings 'have recently stalled' because of coronavirus spike", "body": "Southwest Airlines (LUV) on Thursday reported a loss of $915 million in the second quarter and Chairman and CEO Gary Kelly warned, “the improving trends in revenue and bookings have recently stalled in July with the rise in COVID-19 cases.”Here are key numbers from the Q2 earnings report, compared to consensus estimates by Bloomberg:Revenue: $1.0 billion down 82% year-over-year vs. $904.19 million expectedDiluted earnings loss per share: $1.63 vs. $2.77 expectedLiquidity at end of 2Q: $15.5 billionDaily cash burn: $16 millionThe airline says July bookings continue to soften. It continues to keep 400 of its aircraft grounded and has decreased its September available seat miles (ASM) due to, “the significant decrease in passenger demand and bookings as a result of the pandemic,” according to the report.No layoffs plannedSouthwest has received a total $3.2 billion from the U.S. Treasury under the Coronavirus Aid, Relief, and Economic Security (CARES) Act. Of that sum, $2.3 billion is a direct payroll support grant and $947 million is an unsecured low interest loan. In return, Southwest agreed not to layoff Employees through September 30.But, Kelly says Southwest does not “intend to pursue furloughs and layoffs, or pay and benefits cuts, through year end.”He warned Southwest’s 60,000 Employees last April, “If things don’t improve dramatically over the June and July time periods, we will have to prepare ourselves for a drastically smaller airline.” It’s a harsh future all of the carriers are trying to avoid.Last week, Delta Air Lines (DAL) reported an adjusted $3.9 billion pre-tax loss in the second quarter and Wednesday United Airlines (UAL) reported a $1.6 billion loss in the quarter. CEOs from both airlines have warned their combined 190,000 employees that they will be smaller after September 30 when the CARES Act guarantees, made with the U.S. government, expire.Delta says 17,400 of its 90,000 employees have accepted an early retirement offer, while United has warned 36,000 employees they may be laid off October 1. American Airlines (AAL) notified 24,000 of its employees layoffs may also be necessary this fall to save the airline.Story continuesKelly says 16,900 Southwest Employees, 27% of its workforce, volunteered for emergency time off or early retirement to help the airline preserve capital.Air travel recovery stallingRaymond James airlines analyst Savanthi Syth told Yahoo Finance’s On the Move the airlines are all focused on survival. “As Delta stated last week it’s going to be a choppy recovery,” Syth said. “With COVID rates rising, with places like California reversing their openings and places like New York applying quarantines there has definitely been an impact on demand,” she added.In her most recent note to clients, Syth noted, “U.S. demand trends are not showing any improvement from those noted in the last few weeks.”She cites data from the TSA, for the week ending July 16, that shows passenger traffic at the nation’s airport was down 74% compared to last year. But Syth says the airlines are counting on leisure travel customers to help them survive the crisis and grow new business.Kelly hopes to win back the confidence of customers worried about traveling during the COVID-19 pandemic with the “Southwest Promise.” It includes keeping middle seats vacant until at least September 30 and an updated requirement that all Southwest customers wear a face covering or mask over their nose and mouth. The new safety measure starts July 27 and Southwest says there will be no exemptions except for children under the age of twoSouthwest is also extending the time limits, on its refund policy, for passengers who cancel up to 10 minutes before their scheduled departure. The new policy will allow customers to use funds from a canceled nonrefundable ticket, to buy a new ticket through 2022.“The imperative is to survive,” Kelly told Southwest Employees when the crisis began. He now says, “We believe that demand for air travel will rebound, and we fully intend to be ready and well-positioned when it does.\"Adam Shapiro is co-anchor of Yahoo Finance’s On the Move.United Airlines is tripling flights despite a spike in coronavirus infectionsDelta posts massive Q2 earnings lossUnited Airlines is tripling flights despite a spike in coronavirus infections'The corporate tax rate — I’m actually OK at 28%': Gary CohnDelta CEO trying to avoid furloughs 'any way we possibly can' as airlines recoverJ&J exec: Our coronavirus vaccine is aiming for a 70% success rate in trialsRisk firm: 'American is most at risk' of coronavirus default among US airlinesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit"}]}