{"article": [{"url": "https://finance.yahoo.com/news/hong-kong-national-security-law-024820265.html", "published": 1593467780.0, "headline": "'It Is a Lot More Severe Than People Expected.' China Passes National Security Law to Quell Protests in Hong Kong", "body": "Beijing passed a new national security law for Hong Kong late Tuesday night, prompting international criticism and fear among pro-democracy figures in the former British colony.The swiftly enacted legislation grants Beijing broad new powers to quell the protest movement that engulfed the city last year and morphed into an open challenge against the Chinese government.Since it was announced in May, the national security law has been shrouded in secrecy. It was only after the law came it effect that the Hong Kong government published the full text and revealed the extent of its powers just before midnight Tuesday.“It is a lot more severe than people expected,” says Willy Lam, an expert in Chinese politics at the Chinese University of Hong Kong.Enacted on the eve of the politically sensitive anniversary of Hong Kong’s handover from the United Kingdom to China 23 years ago, the law prohibits acts of secession, subversion, terrorism and collusion with foreign forces.The crimes carry heavy sentences—violators can face up to a lifetime in jail.The law also enables Beijing to establish a security office and send security agents to work in the city.Even before it came into effect, the law began to have a chilling effect. Some activists deleted social media accounts, while several pro-democracy and pro-independence political groups disbanded or moved their operations overseas. Anticipating a crackdown, some businesses in the city removed posters and artwork supporting the sometimes violent demonstrations that have unfurled across Hong Kong since June 2019.Less than 24 hours after it was enacted, the law was used to arrest a man holding a Hong Kong independence flag, according to the police.Alan Leong, the leader of the pro-democracy Civic Party and former chair of the Hong Kong Bar Association called the new measure “the worst form of authoritarian rule by law.”What does the national security law do?Story continuesThe legislation criminalizes secession, subversion, terrorism and collusion with foreign forces with penalties of up to life imprisonment.The law also states that it applies to actions committed by anyone, both Hong Kong residents and foreigners, even if they are outside the city, according to an English translation of the text posted by local news website Hong Kong Free Press (HKFP).Terrorism charges could apply to actions like a “serious interruption” of the city’s transport networks, which protesters frequently did at the height of the movement last year.Advocating for foreign governments to impose sanctions—as some activists in the city have called on the U.S. and other governments to do—also falls under the scope of the legislation.The city’s police force will set up a new national security department, but the Chinese government will also establish an office in Hong Kong to oversee national security for the territory. Mainland Chinese security agents, who are not subject to Hong Kong’s legal jurisdiction, will be sent to the city.Beijing will have the power to prosecute “complex” cases, and in some instances closed-door trials will be allowed.The law will override Hong Kong legislation if any inconsistencies arise.Leong says these provision fundamentally change Hong Kong’s legal system. It “contains concepts and expressions that are alien to Hong Kong’s legal system.”He says that those accused of breaching the national security law will be dealt with, “beyond any protection that can be afforded… by Hong Kong’s legal system.”Why was it passed now?Beijing announced plans at the end of May to bypass Hong Kong’s lawmaking process and implement the national security law after the semi-autonomous city failed to fulfill its constitutional obligation to enact such provisions.Political analysts suggest Beijing ran out of patience following the protests that paralyzed the city for much of the second half of 2019, and plunged the global financial hub into its first recession in a decade.Under the “One Country, Two Systems” principle, agreed when the United Kingdom retroceded the colony to China, the city of 7.5 million has its own legislature and system of laws and courts. Article 23 of Hong Kong’s Basic Law, the mini-constitution governing the territory, required the Hong Kong government to enact national security laws itself, but local lawmakers could not agree on them.“The rapid rise of unprecedented violence and calls for independence coupled with a dysfunctional [legislative council] left [the] Beijing government with no alternatives but to enact a law,” Ronny Tong, a member of the Executive Council, Hong Kong’s de facto cabinet, tells TIME. “We can only hope that a proper balance will be struck between protecting national safety and integrity on the one hand and preserving the freedoms and core values of the people of Hong Kong on the other.”The Chinese government says that matters of national security are the responsibility of Beijing, and that Hong Kong, like jurisdictions across the world, should have a national security law in place.The Chinese foreign ministry said in June that the Hong Kong protests, which have seen thousands injured and arrested and caused millions of dollars worth of damage, made the national security legislation a matter of “the greatest urgency.”Breaking with precedent, the Standing Committee of the National People’s Congress in Beijing did not publish a draft of the law for public comment before it was passed. Even Hong Kong’s top official, Chief Executive Carrie Lam, acknowledged in a press conference shortly after the passage that she had not seen the complete document.Some say the law was rushed to avoid massive backlash. The streets have been mostly quiet after a temporary lull in demonstrations amid the coronavirus pandemic. “[Chinese authorities] were afraid of the popular reaction,” Jean-Pierre Cabestan, a professor of political science at Hong Kong Baptist University (HKBU), tells TIME. “They want to make sure it’s going to be promulgated as soon as possible before people get organized and start protesting against it.”Others suggest the timing has to do with the upcoming elections for the city’s legislature in September. Lam, at the Chinese University of Hong Kong, says the new measures could trigger a shift in Hong kong’s political landscape if it’s wielded against candidates who do not demonstrate loyalty to Beijing. “This could become a weapon to disqualify pro-democracy potential candidates,” he says.How have the U.S. and other governments responded?Beijing’s increasing hold over Hong Kong has been a point of contention between the U.S. and China.U.S. Secretary of State Mike Pompeo slammed the Chinese government Monday over its imposition of the national security law. The U.S. would not “stand idly” by while Beijing “swallows Hong Kong into its authoritarian maw,” he said in a statement.Following the Communist Party’s decision to roll out national security law for the territory, Pompeo announced that Hong Kong was no longer sufficiently autonomous from mainland China, a decision that puts the city’s special trade and economic relationship with the U.S. at risk.The Senate approved legislation June 25 to impose sanctions on individual and entities deemed to violate the semi-autonomy China promised Hong Kong at the time of its 1997 handover—and against foreign financial firms that knowingly conduct “significant transactions” with those blacklisted.On June 26, Pompeo announced that the State Department would impose visa restrictions on Chinese Communist Party officials that it believes are undermining Hong Kong’s high degree of autonomy, and restricting its human rights.And on Monday, the U.S. announced that it will stop exporting U.S. defense equipment to Hong Kong. “We cannot risk these items falling into the hands of the People’s Liberation Army, whose primary purpose is to uphold the dictatorship of the CCP by any means necessary,” Pompeo said in a statement.The European Parliament has meanwhile passed a non-binding resolution urging European Union member states to adopt “sanctions and asset freezes against Chinese officials responsible for devising and implementing policies that violate human rights.” It also recommended that the EU and its member states file a case before the International Court of Justice once the national security law was passed.The U.K. has said it will amend immigration laws to make it easier for some Hongkongers to move. Taiwan also said it will help Hongkongers who want to move to the self-ruled island.In response to the international criticism, Chinese officials have urged the U.S. and other governments to stop meddling in Hong Kong affairs. In retaliation for visa restrictions announced by the U.S., Beijing said it will impose visa restrictions on some Americans with “egregious conduct relating to Hong Kong.”How have Hong Kong protesters responded?The introduction of the national security legislation has sparked fresh unrest in Hong Kong, albeit on a reduced scale. More than 50 people protesting against the law were arrested Sunday. Despite a police ban on the annual July 1 march, the anniversary of Hong Kong’s handover to China, some activists are planning to demonstrate anyway.But the national security law might further dissuade moderate protesters, many of whom began to shy away from attending demonstrations late last year as the protests became increasingly violent.“Some people might be afraid,” Lam of Chinese University of Hong Kong, tells TIME. “Protests against the law might be construed as subversion of state power.”Ahead of the law’s passage, activist Joshua Wong’s political party Demosistō disintegrated. Initially, several prominent members, including Wong, announced that they would step down. The group later said it would disband.“From now on, #Hongkong enters a new era of reign of terror,” Wong wrote on Twitter.Two pro-independence groups, the Hong Kong National Front and Studentlocalism, also announced that they would close their local chapters and relocate operations elsewhere.HKBU’s Cabestan said demonstrators might be more cautious about what slogans they chant and signs they carry going forward. Protesters have frequently waved American and other foreign flags and asked for foreign governments to come to their aid, and calls for Hong Kong independence had become increasingly popular in recent weeksBut, he says, the implementation of the law may exacerbate tensions between young Hongkongers and the police, and lead to more confrontations. “There’s one thing the law cannot change: the mindset,” he said. “I think if anything the new law is going to consolidate the anti-China mindset among a lot of you[th].”One young protester told TIME that the law won’t stop him from taking to the streets.“Nothing can stop us, we have lost so much already,” said W., a 20-year-old university student who asked to go by his initial for safety reasons. “We know it’s risky but there’s no turning back, the only thing we can do is resist until the end.”"}]}