{"article": [{"url": "https://finance.yahoo.com/news/trump-should-be-worried-about-another-stock-market-meltdown-162158918.html", "published": 1591874960.0, "headline": "Trump should be worried about another stock market meltdown", "body": "Every bubble eventually bursts, a lesson President Trump may be reminded of when it comes to the stock market in the near-term.And in this instance, the pin holder is none other than Trump’s frequent target of Twitter criticism — his hand-picked Federal Reserve chief Jerome Powell. The Dow Jones Industrial Average tanked more than 1,800 points on Thursday following the latest decision from the Fed on interest rates. Bank stocks such as Wells Fargo and Bank of America were being crushed in intraday trading. So were hot stocks of the bubblish moment that has ensued in equites since late March such as new public company Nikola and COVID-19 blasted Carnival Cruise Line.The sharp downward action in markets naturally caught the attention of Trump.“The Federal Reserve is wrong so often. I see the numbers also, and do MUCH better than they do. We will have a very good Third Quarter, a great Fourth Quarter, and one of our best ever years in 2021. We will also soon have a Vaccine & Therapeutics/Cure. That’s my opinion. WATCH!,” Trump tweeted.Trump administration official and confidante Peter Navarro also ripped the Fed.“What I would say is that Jay Powell and his remarks yesterday, I think probably the worst bedside manner of any Fed chairman in history. You think the best strategy for Jay Powell going forward would simply to provide the data and let us know where interest rates are going and keep his mouth shut,” Navarro told Yahoo Finance editor-in-chief Andy Serwer in an interview. “I mean, there’s the old joke I’m an old business professor, and the old joke in the marketing thing is if Jay Powell was going to market sushi, he’d sell it as cold, dead fish.”Burn.So what exactly triggered this latest beatdown of Powell by the Trump administration? The verbal lashings have been few and far between in recent months as the market ripped more than 40% higher off the March 23 lows... in large part because of the Fed’s aggressive actions to drive an economic rebound from a major health scare.Story continuesWhile the Fed continued to reiterate a Trump favorite — low interest rates — it was Powell’s comments on the jobs outlook that spooked the market.Powell said “millions” of people will not return to work for some time because of the aftershocks to businesses from the COVID-19 pandemic. The Fed chief suggested the lack of jobs would be rooted in the reality that companies were unable to survive the pandemic or the role no longer exists in the new world order.WASHINGTON, DC - APRIL 29: In this screengrab taken from the Federal Reserve website, Chair of the Federal Reserve Jerome Powell issues the Federal Open Market Committee statement on April 29, 2020 in Washington, DC. Powell said the Federal Reserve will continue to use its lending powers “forcefully, proactively and aggressively, until we’re confident that we are solidly on the road to recovery” from the economic downturn caused by the coronavirus pandemic. (Photo by Federal Reserve via Getty Images)By extension, that would suggest a certain kind of structural unemployment that may continue to weigh on U.S. growth unless workers get re-trained for new jobs.“We believe perhaps 60% of the jobs lost because of the global coronavirus recession will be regained by the end of the year. But that remaining 40 is a lot of jobs that will still need to be regained over multiple years,” Oxford Economics chief U.S. economist Gregory Daco said on Yahoo Finance’s The First Trade.‘Feeling that you couldn’t lose’And if in fact this will be a painfully slow recovery as the Fed strongly hinted at Wednesday, then indeed the market has rallied too hard too fast off the lows. Numerous pros Yahoo Finance have talked with lately have suggested the market has priced in a V-shaped economic recovery later this year that extends into 2021. That thesis has had investors hardcore buying beat-up cruise lines stocks and airlines like Delta the past month while also pushing up high beta tech plays like Netflix.Even bankrupt companies such as Hertz and J.C. Penney saw hot money flow into their stocks, a very bizarre move considering, well, the companies have filed for bankruptcy.But Powell’s commentary puts that entire risk on at all cost thesis into question. In effect Powell took his mighty pin, stuck it between his two middle fingers to show Trump and then popped the bubble. He in not so many words said the stock market is overvalued at current levels given a sane outlook for the U.S. economic recovery.“I think most likely you will see a 10% correction from here,” BNY Mellon chief investment strategist Alicia told The First Trade. “I wouldn’t say we’re in a bubble. I will say this, and I might date myself a little bit. Last week was the first time in 20 years where I’ve felt like it was the late 1990s. It just had that feeling that you couldn’t lose. When you get that feeling you should be scared. You saw it when the companies filing for bankruptcy were rallying a crazy amount.”Ultimately, Trump should be among the scared. The last thing a president with sinking approval ratings needs is yet another market rout ahead of a re-election bid. Dust off your armored suit, Jay Powell.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Coca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusLevi's reports solid quarterly earnings, CEO says jeans maker will come out of coronavirus strongerRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}