{"article": [{"url": "https://finance.yahoo.com/news/three-reasons-why-things-are-looking-up-for-homebuilder-lennar-163807267.html", "published": 1592480780.0, "headline": "Three reasons why things are looking up for homebuilder Lennar", "body": "Homebuilder Lennar (LEN) is poised to benefit from buyers looking to move to newer homes in less congested areas as a result of the coronavirus pandemic.Lennar’s recent comments from management indicate “the company is seeing an influx of buyers looking to move out of densely populated urban areas, while other buyers feel safer buying a new home rather than an existing home,” Brian Bernard, sector director at Morningstar wrote in a note to investors.Historically low interest rates is also buoying the housing market.“With mortgage rates near record lows, ownership affordability is compelling, and an unprecedented spike in the personal savings rate means that more households may have a large enough nest egg for a down payment,” wrote Bernard.The analyst says the rebound in demand and constrained supply should give Lennar pricing power across many of its markets.“The firm was able to raise prices and reduce incentives in May, and management issued what we viewed as strong profit margin guidance for the rest of the year,” wrote Bernard.“As one of the nation’s largest builders, Lennar enjoys certain benefits from its scale that some smaller builders may find difficult to replicate,” he added.[To read the full report from Morningstar, sign up for Yahoo Finance Premium. Click here to start your free trial and step up your investing.]Lennar recently re-stablished 2020 guidance given the firming demand in the market, which Morningstar said was above its own projections.“Our revised forecast now assumes Lennar's consolidated sales grow at a 5.5% five-year compound annual growth rate compared with about 4.5% previously, and we also expect stronger near-term gross profit margins. These changes caused our fair value estimate to increase about 5% to $79 per share,” wrote Bernard.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the US stock market from the floor of the New York Exchange. Follow her on Twitter at @inesreports.Read more:It would be unprecedented for a bear market to be this short: Wells Fargo StrategistStory continuesRecent rally could be a ‘bear market trap’: Miller Tabak StrategistA view from the trading floor: Algorithms having ‘outsized impact’ amid coronavirus impactFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}