{"article": [{"url": "https://finance.yahoo.com/news/jack-ma-ant-plans-simultaneous-091516173.html", "published": 1595272280.0, "headline": "Jack Ma’s Ant Seeks $200 Billion Value in Landmark Dual IPO", "body": "(Bloomberg) --Billionaire Jack Ma’s Ant Group is seeking a valuation north of $200 billion as it goes public in Hong Kong and Shanghai, people familiar with the matter said, kicking off a much-anticipated market debut for China’s leader in internet finance.The parent of China’s largest mobile payment company will pursue a simultaneous dual-listing in Hong Kong and on the Shanghai stock exchange’s STAR board, the Hangzhou-based firm said, in what promises to be one of the largest debuts in years. Ant is already more richly valued than most Wall Street firms and, if conditions are favorable, it could seek to raise more in its IPOs than Saudi Aramco’s record $29 billion haul, one of the people said, asking not to be identified talking about a private deal.The crown jewel of the sprawling Alibaba empire, Ant has been accelerating its evolution into an online mall for everything from loans and travel services to food delivery, in a bid to claw back shoppers lost to Tencent Holdings Ltd. Ant’s Chief Executive Officer Simon Hu has said that he wants people to think of Alipay as more than just a niche provider of financial services and the payments gateway for the world’s biggest e-commerce platform. Part of that is to grow Ant’s reach in Asia, where it has been working with digital payment providers in India and Thailand as well as peddling its expertise in wealth management and risk controls.Alibaba shares rose 3.1% in New York, near a record high since its 2014 IPO.Ant picked China International Capital Corp., Citigroup Inc., JPMorgan Chase & Co. and Morgan Stanley for its Hong Kong offering, which could raise about $10 billion, people familiar with the matter said.The Alibaba affiliate is the latest major Chinese company to seek a listing closer to home as increased trade tensions make New York’s capital markets less desirable. Semiconductor Manufacturing International Corp. raised $7.5 billion from a Shanghai share sale in July that ranks as the world’s biggest new stock offering this year, according to data compiled by Bloomberg. Some Chinese internet firms including JD.com Inc. and NetEase Inc. have also added second listings in Hong Kong this year.Story continues“Despite abundant capital, it is not sure how investors would view Ant Group since there are a lot of tech stocks in the market,” said Pamela Chung, a Hong Kong-based managing director and head of IPO at consultancy Tricor Group.Dual listings, once the preferred route for China’s largest corporations from banks to oil and gas producers, have since fallen out of favor in part because of the complexities involved in orchestrating share sales across very different capital regimes. Ant’s decision is a triumph for Shanghai’s fledgling STAR board, conceived with the ambition of becoming mainland China’s preferred listing destination for high-growth companies.A dual listing also helps Hong Kong Exchanges & Clearing Ltd., which is seeing a renaissance of tech listings after it relaxed rules in the wake of losing China’s biggest tech firms -- including Alibaba Group Holding Ltd., which owns a third of Ant -- to New York.While Ant has begun working with bankers on the Hong Kong debut, more advisers could be added at a later stage and details of the offering could change as deliberations are ongoing, the people said.Beyond FinanceAnt, valued at $150 billion in its last funding round, generated $2 billion in profit in the fourth quarter, based on calculations made from Alibaba’s filing.Like Alibaba, Ant has hit the brakes on its U.S. expansion as tensions between America and China have escalated. Ma said in 2018 that his promise to create 1 million jobs in the U.S. was impossible to fulfill because of trade tensions between the two super powers.Instead, Ant has focused it offshore ambitions on building its presence in the rest of Asia, where it’s working with nine payment startups including the owners of Paytm in India and GCash in the Philippines.Domestically, it’s expanding into consumer and technology services.Its technology solutions include services in cloud computing, artificial intelligence, blockchain and risk control. Ant aims to assist banks to dole out loans to consumers, and partner with brands like KFC Holding Co. and Marriott International Inc. to attract and manage customers.Fending Off TencentHu is betting that those strategies will help Ant defend its dominance of China’s $29 trillion mobile payments space. Alipay’s share of mobile payments has increased for three consecutive quarters, rising to 55.1% in the fourth quarter, according research consultant iResearch. Tencent has 38.9% of the market.It also diversifies Ant’s business into less-sensitive areas after the firm drew regulatory scrutiny for its blistering expansion in financial services with in-house products.To mark the transformation, Ant changed its registered name to Ant Group Co. from Ant Financial Services Group at the end of May.Ant’s origins are not without controversy. In 2010, Ma hived off the six-year-old Alipay from Alibaba over the objections of shareholders including Yahoo! Inc., citing potential regulations that may curb foreign ownership of financial businesses. Alipay then expanded into loans, wealth management and consumer credit under the entity that’s now known as Ant Group. The dispute was eventually settled via an arrangement that granted Alibaba a proportion of Alipay’s income. Alibaba ended up buying a 33% stake in Ant last year.With an Ant IPO, shareholders could recalibrate the value of the business for Alibaba.“Investors may have to factor in more than $60 billion into Alibaba’s valuation to reflect its 33% equity stake in Ant Group,” Bloomberg Intelligence analysts Vey-Sern Ling and Tiffany Tam wrote.(Updates with Alibaba’s New York shares from fourth paragraph)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}