{"article": [{"url": "https://finance.yahoo.com/news/majority-of-americans-are-not-ready-to-go-to-a-sports-event-even-with-masks-poll-183234137.html", "published": 1595425220.0, "headline": "Majority of Americans are not ready to go to a sports event, even with masks: poll", "body": "After four months of lockdown due to the pandemic, American pro sports leagues are returning to play. But the pandemic isn’t over.NASCAR and UFC returned in May, while Top Rank boxing and PGA Tour golf returned in June—those are individual sports that were well-positioned to return with social distancing. Now the team sports are coming back. Earlier this month, NWSL and MLS soccer returned in bubble formats. This week, Major League Baseball begins its 60-game season with teams playing at their home ballparks. The WNBA, NBA, and Premier Lacrosse League also return this month in bubble formats.Washington Nationals shortstop Wilmer Difo (1) fields a grounder while wearing a face mask because of the COVID-19 coronavirus pandemic during MLB Summer Camp scrimmage between the Baltimore Orioles and Washington Nationals at Nationals Park on July 21, 2020 in Washington, D.C. (Photo by Randy Litzinger/Icon Sportswire via Getty Images)If the biggest question around the return of sports is whether the leagues can keep their COVID-19 cases down, the second-biggest question is when they might be able to have fans in the stands.The NBA, WNBA, and PLL are completing their seasons in a bubble and won’t have fans, period. But MLS (which aims to continue its regular season at home arenas after its Disney World tournament), MLB, college football, and the NFL all hope to eventually have fans at their games.Will fans be ready to attend a game in person later this summer or fall?The answer, based on a survey conducted by Yahoo Finance and Harris Poll, is no.Graphic by David Foster/Yahoo FinanceThe majority of respondents – 70% – feel “not at all comfortable” or “not very comfortable” attending a sports event in person this summer. Only 10% of people say they would feel “very comfortable.”In addition, 72% of respondents say they will not feel comfortable attending a sports event in person until at least next summer.The poll surveyed 1,005 U.S. adults between July 17 and July 20.Even if everyone at the sports event wore masks and followed social distancing rules, half of respondents said they would not feel any more comfortable attending. Only 10% of respondents said masks would make them feel “much more comfortable.” That question is of particular interest to the NFL, which just announced on Wednesday it will require fans at NFL games this season to wear masks.Story continuesOlder respondents showed even less comfort with attending a sports event: 25% of respondents age 65 or older said they will never again feel comfortable attending a live sports event due to the pandemic.These are sentiments that the big leagues will have to watch closely over the next few months—especially those that rely heavily on ticket sales for league revenue, like MLS, MLB and college football programs.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is hitting the sports world:MLS delays launch of expansion teams in Charlotte, Sacramento, and St. Louis due to pandemicCollege football plans to return, but a huge financial question remains: fans in the standsHere's every sports league's current plan to return from coronavirus lockdownMLS Commissioner: Playing in empty stadiums would be particularly bad for usNHL Commissioner Gary Bettman: Money 'is not what's driving' return planCoronavirus could have long-lasting impact on live sports ticket sales"}]}