{"article": [{"url": "https://finance.yahoo.com/news/irs-turns-back-to-tax-enforcement-theres-a-lot-of-money-thats-not-being-paid-192636544.html", "published": 1594823660.0, "headline": "IRS turns back to tax enforcement: ‘There’s a lot of money that’s not being paid’", "body": "In March, the IRS laid out a range of ways it would ease the burden on taxpayers who were financially shaken by the coronavirus and ensuing shutdowns and job losses. One such measure was a move to “generally not start” new audits for a few months.Now that self-imposed restriction is over. July 15 – the delayed tax day – is also the day the agency appears set to restart some tax enforcement measures in earnest.“They have to do it,” says Ian Comisky, an attorney and partner at a Pennsylvania tax litigation firm. The U.S. government faces record deficits for years to come after spending $3 trillion on pandemic aid (with more likely to come).“They have got to do something to collect more money other than just raise taxes,” says Comisky, co-author of the reference book, “Tax Fraud and Evasion: Offenses, Trials, Civil Penalties.”“We lose hundreds of billions of dollars a year to tax evasion,” says William G. Gale, a tax policy researcher and senior fellow at the Brookings Institution. Budget cuts have ”resulted in lower audit rates, especially of the people and organizations where we think there’s a lot of money that’s not being paid.”The IRS recently called back some employees into the office to work on taxpayer correspondence, handling tax documents, taking telephone calls and other actions related to the tax filing season. (Chip Somodevilla/Getty Images)A recent Congressional Budget Office report suggested that a cash infusion for the IRS would pay for itself three times over. \"Increasing the IRS’s funding for examinations and collections by $20 billion over 10 years would boost revenues by $61 billion,\" the report states.The IRS’s budget has been in decline for years. In 2010, the agency’s operating costs (in 2019 dollars) was just under $15 billion. By 2019, that figure had fallen below $12 billion.President Trump continued cutting during his early years in office and has recently sought to return the agency to 2010 funding levels. A House panel recently moved forward on a plan to increase the IRS budget by a smaller amount, roughly $600 million a year.In the meantime, the IRS is making do with less and, in addition to coronavirus, has the yawning “tax gap” to deal with: Hundreds of billions of dollars in taxes is owed the government each year but don’t get paid.Story continues‘High-income nonfilers’ in the crosshairsA recent report from the U.S. Treasury Inspector General for Tax Administration found that many high-income earners are simply not filing taxes and getting away with it. The report identified nearly 880,000 “high-income nonfilers,” with estimated taxes due of $45.7 billion.Treasury Secretary Steven Mnuchin, who oversees the IRS, recently said he would be boosting audits on the wealthy. Douglas O’Donnell, the IRS official set to oversee the audits, added more detail during a conference last month. He reportedly said the audits would begin July 15 and letters would go out through September.Gale says increasing audits is “critical.” If the IRS follows through with word getting out about the increased audit rates, “you would get more voluntary compliance as well, and that effect could swamp the direct effect,” he says.But the process will take years: “It’s not just a scaling up of what they are doing right now, it’s a revamping of what they are doing,” Gale says.Initiatives in data analyticsThere are also efforts to make the IRS work smarter with data analysis. A recent report found that the agency’s criminal investigation office purchased access to a commercial cellphone database to try and follow tax cheats using their phones.“That's part of what they were doing,” Comisky says, adding that are many more avenues the agency could go down. “If they can get onto public websites, people talk,” he says. “You get on Facebook, you get on Twitter, you get on Instagram, and some guy’s bragging about something he purchased: that could give you a starting point.”That level of sophistication at the IRS could be a while off. “They can’t fight a modern battle with stone age tools,” says Gale about the current situation, which he likened to “a very unfair battle between the IRS and the incredibly sophisticated avoidance techniques that are used to shelter income and wealth.”The IRS says it chooses audit targets based on random selection, computer screening, and flagging questionable transactions. The Taxpayer First Act was passed in 2019 in part to help the agency modernize its technology.Internal Revenue Service Commissioner Charles P. Rettig before the Senate Finance Committee in June. (ANNA MONEYMAKER/POOL/AFP via Getty Images)Comisky says he has interacted with the current IRS commissioner, Charles P. Rettig, over the years. “If anybody can start turning the aircraft carrier around, it's him,” he says.‘We need political leaders to give air cover’The new extended deadline to file taxes, July 15, also marks the return of a range of other enforcement measures the IRS had temporarily waived. The IRS can now resume field collection activities as well as liens and levies. Rules that allowed taxpayers to suspend payments are also ending. In recent days, the IRS has extended tax waivers to certain groups and reminded filers that they can file an extension to October. The IRS operations page offers updates and question for people facing actions like liens.The IRS did not respond to questions about what new enforcement actions it has planned for the coming months.As it stands, the agency currently operates amid funding cuts with many Republicans remaining critical of the agency after a 2013 scandal around the alleged targeting of conservative groups.“We need political leaders to be saying things like ‘when people cheat on their taxes, they’re cheating their neighbors,’” says Gale. “We need political leaders to give air cover, if you will.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:The IRS is failing to collect billions in back taxes owed by super rich AmericansTaxpayers who filed paper returns could face ‘extreme delays’ in getting refunds‘There is no precedent’: Record-breaking U.S. deficits are comingRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn,YouTube, and reddit."}]}