{"article": [{"url": "https://finance.yahoo.com/news/trump-announce-13-billion-farm-203737524.html", "published": 1600357520.0, "headline": "In Wisconsin, Trump announces $13 billion in farm aid", "body": "By Steve Holland and P.J. HuffstutterMOSINEE, Wis. (Reuters) - U.S. President Donald Trump announced a new round of pandemic assistance to farmers of about $13 billion at a campaign rally in Wisconsin on Thursday night, delivering aid to an important sector in a crucial battleground state.\"Starting next week my administration is committing an additional ... $13 billion in relief to help farmers recover from the China virus, including Wisconsin's incredible dairy, cranberry and ginseng farmers who got hurt badly,\" Trump said, referring to the novel coronavirus virus.Wisconsin is known for its milk and cheese industries, which have been hard hit by both the White House's trade policies and the COVID-19 pandemic - but the amount of assistance to farmers weeks before the vote was unexpected.Trump beat Democrat Hillary Clinton in Wisconsin in 2016 by less than 1% of the vote - and marked the first time the state had voted for a Republican in a presidential election since 1984.Trump spoke in Mosinee, a rural town in the central part of Wisconsin, as state officials reported 2,034 new coronavirus cases, a record one-day increase.The new aid program – which the agriculture department is expected to release details about on Friday – is tapping into the $14 billion in additional Commodity Credit Corporation funds that Congress agreed to prepay as part of the Coronavirus Aid Relief and Economic Security (CARES) Act, according to four sources familiar with the matter.Farmers are expected to be allowed to start applying for the new program on Monday, the sources said.How much certain crops will receive is not known, but the program is set to make direct payments to producers of meat, dairy, grain, vegetables and other products, the sources said.The payments will be designed similarly to an earlier aid package: calculated based on yields of crops and the impact the coronavirus pandemic had on the price of the commodities.Story continuesTrump in April announced a $19 billion relief program to help U.S. farmers cope with the impact of the virus, including $16 billion in direct payments to producers and mass purchases of meat, dairy, vegetables and other products.That came on the heels of $28 billion in trade aid given to the farm sector over 2018 and 2019. A government watchdog agency said on Monday the 2019 aid favored farmers from the U.S. Southeast, primarily those growing crops like cotton or sorghum, over those in other parts of the country.China's demand for U.S. corn and soybeans has been strong in recent weeks, boosting prices, and it is also importing more meat amid a potential food supply gap.(Reporting by Steve Holland and P.J. Huffstutter; Writing by Andy Sullivan and Eric Beech; Editing by Tom Brown and Aurora Ellis)"}]}