{"article": [{"url": "https://finance.yahoo.com/news/ios-14-update-changes-183623089.html", "published": 1593092660.0, "headline": "How iOS 14 will change your iPhone forever: Tech Support", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's dilemma:“How much will iOS 14 change my iPhone?”Apple unveiled iOS 14 on Monday, and it’s set to bring some of the biggest changes to your iPhone in years. Now I know, change is scary. It’s the reason I’ve been using the same toothbrush for three years. Well, part of the reason. I’m also just very lazy.But the updates to iOS 14 will dramatically improve your iPhone’s functionality. Curious as to what those improvements are? I’ve got you covered.A far better home screenEver since the first iPhone debuted in 2007, the home screen has been a simple grid of apps. But as the app ecosystem has expanded, users’ home screens have become incredibly cluttered.You probably have a few select apps and folders you use on your main and secondary home screens, but beyond that there’s likely a mishmash of apps you either rarely use or have completely forgotten about on your subsequent screens.The App Library in iOS 14 will make locating infrequently used apps far easier. (Image: Apple)To address that, Apple is adding a new home screen called the App Library. Accessible by swiping all the way from right to left, the Apple Library is a new home screen that automatically create folders for all of the apps on your phone.Collections will be organized based on app type, with folders for entertainment apps, Apple Arcade apps, social apps and more. At the top of the screen, you’ll find folders for your recently added apps and suggested apps.And if you only want your main home screen and the App Library page, Apple will finally let you delete all of those extraneous home screens you ignore.In addition to the App Library, Apple is, at long last, bringing true home screen widgets to the iPhone. Like the widgets found in Today View, the widgets for Apple’s home screen will provide you with information like your next appointments, the weather, headlines from Apple News and more.Story continuesApple is finally bringing widgets to the iPhone's home screen, adding a whole new layer of functionality to the smartphone. (Image: Apple)You’ll be able to place these widgets wherever you want and resize them based on your own needs. Android phones have had this option for years, so it’s nice to see Apple finally come around to making the home screen on its devices more functional.Phone calls and picture-in-pictureTwo smaller changes to iOS 14 include a reworked phone call alert view and picture-in-picture video. The new phone call alert will change the current style of alert, which takes up the entire screen even if you’re using an app, in favor of a small notification tab at the top of the screen.This way you’ll be able to ignore work calls, and browse Instagram at the same time.Apple is bringing picture-in-picture functionality to the iPhone for the first time in iOS 14. (Image: Apple)Picture-in-picture video is something you can already take advantage of on the iPad, but bringing it to the iPhone is going to be a major benefit for people who commute or frequently travel—remember that?—and want to get a little work done while still binging their favorite shows and movies.Better yet, you can use picture-in-picture mode while making FaceTime calls, so you can browse the web while talking to friends at the same time.Siri is getting more compact and Messages is getting smarterWith iOS 14, Apple is making Siri a lot more compact, while teaching the voice assistant some slick new tricks.The compact look comes into play when you ask Siri a question while using other apps. Instead of the Siri app taking over your entire display, a small pop-up will appear at the top of your screen with the information you were looking for, whether that’s how old Daniel Craig is, or if he’s single.Apple is also improving the Messages app in iOS 14, specifically when it comes to group messages. Currently, if you have a group message and want to know if anyone has mentioned you, you need to scroll through the entire thread, carefully reading each entry.With iOS 14, Apple is adding the ability to mention someone in a group message, alerting them that they’re either the topic of the conversation or that there’s something they should be paying attention to. What’s more, Apple is adding in-line replies to Messages, so you’ll be able to reply to individual messages within a larger text conversation without confusing everyone else in the thread.Finally, if you’ve got an ongoing Messages conversation with someone important, like your significant other, and are tired of losing the thread among a litany of other less important messages, you’ll be happy to know you can now pin specific chats to the top of the Messages app page.This will make it far easier to keep track of your most important conversations and provide a new, creative way to rank your friends from best to worst.More privacy and securityApple is upping its privacy game in iOS 14, making it mandatory for apps to get users’ permission to track them. App descriptions in the app store will also include information about the kind of data they collect from you when you use them.Apple is adding new privacy features to iOS 14 that will tell you what kind of data apps collect before you download them. (Image: Apple)Still, Apple will also now allow users to give apps their approximate location, rather than their exact location when apps ask to track their whereabouts, which is a solid move.You’ll also now see an indicator icon that tells you whenever an app is using your microphone or camera, a huge security improvement that should give users extra peace of mind.When can you get it?Apple will release iOS 14 later this fall alongside the company’s next-generation iPhone. Whether that happens in September or October depends on how much Apple has been stung by the coronavirus pandemic. We’ll find out in the coming months.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple’s switch from Intel to its own chip is its smartest move in yearsApple to close retail stores in 4 states amid coronavirus outbreaksWhy Microsoft and Amazon are calling on Congress to regulate facial recognition technologyThe PlayStation 5’s most important feature will be its priceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}