{"article": [{"url": "https://finance.yahoo.com/news/new-home-sales-housing-market-rebound-continues-morning-brief-095745866.html", "published": 1592975120.0, "headline": "The housing market rebound continues: Morning Brief", "body": "Wednesday, June 24, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeNew home sales data impress in May.A day after existing home sales data for May disappointed, new home sales data topped expectations.Suggesting the housing market did indeed bottom in March and April as buyers appear eager to step in.In May, new home sales rose some 16.6% to an annualized pace of 676,000 units, according to data published Tuesday. Economists had expected new home sales in May to hit an annualized rate of 640,000.Unlike Monday’s existing home sales data, which only tracks closings on previously signed contracts, new home sales counts signings for home purchases. And so whereas existing home sales data tends to be a lagging indicator of the health of the housing market, new home sales are a leading indicator.Read more: Buying your first home: What you need to knowAnd the data suggest a big recovery in the housing market has taken place over the last several weeks.“[Tuesday’s] new home sales data suggests the cyclical rebound story is credible and deserves to be followed quite closely in the months ahead,” said Steve Ricchiuto, chief U.S. economist at Mizuho Americas. “This was another constructive sign that the economy is poised to begin the recovery process in the third quarter, if it has not already bottomed in May/June.”Later this morning, investors will get the latest weekly report on mortgage applications, the most high frequency piece of housing market data.For weeks now, mortgage applications have suggested the housing market remains in good shape as this data captures those applying for a mortgage on a new home and those looking to use record-low interest rates to refinance.“Looking ahead, the complete recovery — and more — in mortgage applications suggests that both new and existing home sales are set to rise very strongly over the next few months,” said Ian Shepherdson at Pantheon Macro in a note to clients on Tuesday. “The lure of falling mortgage rates appears to have offset the hit from job losses, which appear to have been concentrated among young renters, not potential near-term homebuyers.”Story continuesNew home sales rebounded in May, backing up the surge in mortgage applications as a sign the housing market has strengthened considerably over the last several weeks. (Source: Pantheon Macroeconomics)In a note on Monday, Shepherdson highlighted that the median age of a homebuyer is 47 while the median age of restaurant worker is 29. The highly concentrated nature of the ongoing recession presents many challenges for policymakers and the future of growth in the global economy.But the uneven distribution of this recession’s most negative impacts has also created relative bright spots, with the housing market a clear standout.“The US economy has started gradually to re-open following two months of strict social-distancing measures,” Barclays’ Pooja Sriram said Tuesday. “As economic activity gathers momentum in the coming months, we expect positive spill-over effects to help stabilize the housing sector as well.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7 a.m. ET: MBA Mortgage Applications, week ending June 19 (+8.0% prior)9 a.m. ET: FHFA House Price Index month-on-month, April (+0.3% expected, +0.1% in March)EarningsPost-market4:10 p.m. ET: KB Home (KBH) is expected to report adjusted earnings of 56 cents per share on $1.12 billion in revenueREAD MORETop NewsEuropean stocks sink amid surge in infections [Yahoo Finance UK]Dell considering spinning off VMware stake: WSJ [Reuters]GNC files bankruptcy to manage debt with plan to sell itself [Bloomberg]Retail software maker BigCommerce to seek US IPO [Bloomberg]YAHOO FINANCE HIGHLIGHTS5 stocks to buy with the stock market skyrocketing againBusiness leaders, tech CEOs bash Trump's visa suspension'This is where the future is going:’ Amazon exec on $2 billion Climate Pledge Fund—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}