{"article": [{"url": "https://finance.yahoo.com/news/colleges-students-liability-waivers-112753572.html", "published": 1597214120.0, "headline": "Coronavirus: Some college students returning to campus are being met with liability waivers", "body": "Schools that are choosing to reopen amid the coronavirus pandemic are attempting to protect themselves against possible legal blowback with legal liability waivers.From universities to K-12 districts, some schools are sending forms with titles such as “Assumption of Risk” and “Waiver of Liability” to fend off any lawsuits should students contract coronavirus on campus or in the classroom.“Institutions are basically trying to have it both ways,” Kevin McClure, associate professor of higher education at the University of North Carolina Wilmington, told Yahoo Finance. “They're trying to say: ‘We are opening in the midst of significant risk, and at the same time we want you — as students or faculty or staff — to assume that risk and to not hold us responsible for the decisions that we've made.’”A Penn State Nittany Lions student looks on against the Iowa Hawkeyes on October 27, 2018 at Beaver Stadium in State College, Pennsylvania. (Photo by Justin K. Aller/Getty Images)‘Students’ ability to take responsibility both for themselves and each other’Generally, the waiver forms note two things: That there is a risk of contracting the coronavirus if a student appears on campus and that the decision to come back cannot be held against the school.“I know the challenge these circumstances present, but I also know our students’ ability to take responsibility both for themselves and each other,” Damon Sims, vice president for Student Affairs at Penn State, said in a press release. “If ever there was a time for them to do so, now is that time. We will do all we can to encourage that outcome, and we expect them to do all they can to make it so. We are in this together.”Students returning to Penn State’s University Park campus, which usually houses more that 45,000 undergraduate students, are required to fill out the following “coronavirus compact” prior to their arrival on Penn State’s campus(SCREENSHOT: Penn State)(SCREENSHOT: Penn State)‘This is the reality of the current situation’Saint Anselm College in New Hampshire is another college asking its students to sign a waiver.The liberal arts school is planning to conduct its fall semester primarily in-person, an option 30% of schools have chosen. Classes start for 2,000 students on August 19, university spokesperson Paul Pronovost told Yahoo Finance.Story continuesAside from the usual safety measures — from reducing density in housing, classroom, and common spaces, restricting visitors, implementing distancing — the school is also going to administer two coronavirus tests on students upon their arrival: A rapid test and a fuller test. Saint Anselm is also planning to do surveillance testing throughout the semester.(PHOTO: Saint Anselm College Flickr)Beyond social distancing, testing, and contact tracing, the university wants students and parents to “accept” the unique schooling situation.There’s “simply no way for the College – or any College or institution, for that matter – to guarantee that our campus will not see cases of COVID-19,” Pronovost said in an email. “We believe it is important for students and families to understand and accept that this is the reality of the current situation.”The liability waiver notes that students “forever release and waive my right to bring suit against Saint Anselm College, its Board of Trustees, officers, directors, managers, officials, agents, employees, or other representatives in connection with exposure, infection, and/or spread of COVID-19 related to taking classes, living or participating in activities on the Saint Anselm College Campus.”Colleges fear an avalanche of lawsuits The possibility of lawsuits worried colleges enough to lobby Congress for protections from liability.Nearly 80 education groups sent a letter to congressional leaders back in May, stating that reopening schools involves not just “enormous uncertainty about COVID-19-related standards of care” but also the “corresponding fears of huge transactional costs associated with defending against COVID-19 spread lawsuits.”Rutgers Law Professor Adam Scales argued that we may see an uptick in litigation, at least “until Congress or the courts firmly signal that COVID is not going to be ‘the new asbestos,’” adding that courts will not likely impose severe liability on public entities like schools.“Just because a student can get into court does not mean the student can win,” Michael Duff, a law professor at the University of Wyoming, told Yahoo Finance. “So even if the waiver does not ‘work,’ and the student can get into court, there is no guarantee that a lawyer would take the case because the case may be weak.”(PHOTO: Saint Anselm College Flickr)There is also the issue of proof.“The idea that liability — whether caused by negligence or gross negligence — is easy to prove is a myth,” Duff said. “The student would first have to prove that the college did not act ‘reasonably’ in the COVID-19 context.”Given that the definition of acting “reasonably” would not necessarily involve a college being perfect with its coronavirus mitigation, Duff added, gross negligence would be “a very hard thing to prove.”At the same time, Scales added, a liability waiver could not serve as a “get-out-of-jail-free card” a school taken to court in a coronavirus-related case brought by a student.‘A stark dilemma’At the end of the day, McClure noted, colleges need students to return to campus and pay tuition to survive as institutions of higher education.“I do genuinely believe that many institutions and the people running them want to do what's right and keep people healthy,” McClure said. “On the other hand, there are the financial realities of attempting to keep an organization up and running, and an organization whose revenue is often very much tied to people coming to campus.”Schools are thus faced with “a stark dilemma,” McClure added, of either bringing students and faculty back to campus or “make significant cuts because we are not able to pay our bills.”Students on the Stony Brook University's Long Island campus wearing protective masks on March 11, 2020. (Photo by John Paraskevas Newsday RM vis Getty Images)That said, given that students are paying a lot more today than previous generations in terms of tuition and fees, there is a sentiment that “institutions actually have a greater duty of care to their students.”That idea is being put to the test amid the coronavirus pandemic, McClure said, and the liability waivers — which essentially abandon the “duty of care” that these institutions should take — fly in the face of this “consumerist moment” in higher education.“Anytime that you've got people that are forking over large amounts of money and making a significant investment,” McClure said, “you can expect that they're going to want a certain level of service and are going to be unhappy when a company or an organization isn't delivering their end of the deal.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:'The urgency is real': CDC and Education Department join White House push to open schools amid coronavirus pandemicCoronavirus: 'We cannot' put kids in schools 'if we have a very high level of transmission,' doctor warnsSchools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}