{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-12-2020-221622790.html", "published": 1597245140.0, "headline": "Stock market news live updates: Stocks rally, S&P 500 eclipses February closing high", "body": "Stocks jumped Wednesday, and the S&P 500 briefly rallied above 3,386.15 Wednesday afternoon to eclipse its record closing high from February 19. The blue-chip index has now climbed about 50% from its March low.[Click here to read what’s moving markets heading into Thursday, August 13]Leadership in the S&P 500 flipped back to the technology and health-care sectors, unwinding a rotation into cyclicals that had begun last week. Apple (AAPL) and Microsoft (MSFT) led gains in the Dow, and the Nasdaq outperformed.Shares of Moderna (MRNA) held onto overnight gains, after the company announced a deal to supply the US government with 100 million doses of its Covid-19 vaccine candidate currently in late-stage human trials. Meanwhile, Tesla’s stock (TSLA) rose about 6% after the company announced a five-for-one stock split, with the stock having closed at well over $1,300 per share earlier Tuesday.Stocks’ drop on Tuesday – the first for the S&P 500 and Dow in eight sessions – came as prospects for a near-term virus relief package from Congress dimmed. Primary negotiators including Treasury Secretary Steven Mnuchin, White House Chief of Staff Mark Meadows, Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer have not met since Friday to discuss a new package, with lawmakers still deeply divided on the amount of aid to be unleashed to state and local governments.Other national developments also added to a risk-off mood Tuesday afternoon. The Big Ten Conference and Pac-12 each announced that they would be postponing their fall sports seasons as concerns over the ongoing coronavirus pandemic abounded, following days of speculation over the fate of one of the big revenue drivers for major universities.“Having college football in the fall is a sign of normalcy returning,” Jim Bianco, Bianco Research President and CEO, told Yahoo Finance during “The Final Round” on Tuesday.The season’s postponement “is an indication to everybody in those neighborhoods, or those states, that things have not returned to normal yet,” Bianco said. “The big one in college football is the SEC, from Florida to Arkansas, all the way to South Carolina and Clemson – they haven’t said anything. But I think if they were to delay to the spring as well, that could actually bleed into the election, too. You’d be telling everybody in that important place for voting, it ain’t ready yet. It ain’t right yet.”Story continuesElsewhere, earnings season continues Wednesday with a relatively light slate of companies set to report, including Lyft (LYFT), Tencent (0700.HK) and Cisco (CSCO).—4:03 p.m. ET: Stocks close higher after S&P 500 briefly touches record highHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): +46.64 (+1.40%) to 3,380.33Dow (^DJI): +289.64 (+1.05%) to 27,976.55Nasdaq (^IXIC): +229.42 (+2.13%) to 11,012.24Crude (CL=F): +$0.96 (+2.31%) to $42.57 a barrelGold (GC=F): -$17.60 (-0.90%) to $1,928.70 per ounce10-year Treasury (^TNX): +1.2 bps to yield 0.6700%—3:15 p.m. ET: S&P 500 rallies above February record highThe S&P 500 extended gains with less than an hour left of trading, rising more than 1.5% to above 3,386.15, or the level of its February 19 record closing high.This brought the index’s gain since its March 23 closing low to more than 50%.—2:03 p.m. ET: Tech regains lead in the major indices; Nasdaq advances 2%Each of the three major indices rose, and the Nasdaq outperformed and paced toward its first advance in four sessions. The S&P 500’s more than 1% gain was led by the information technology and health-care sectors Wednesday afternoon, reversing a rotation into financials, energy and industrials that had continued as recently as this morning. Bank stocks lagged.The Dow added more than 200 points, led by shares of Microsoft and Apple.—11:57 a.m. ET: ‘Right now the bond market really isn’t showing me signs that this equity rally cannot continue’: RiverFront Global Fixed Income Co-CIOUS Treasuries have been in a holding pattern, with longer-duration bonds yielding well under 1% for the better part of the year so far. The recent anchor on yields has come in part as negotiations in Washington on further fiscal stimulus and economic support hang in balance, said Kevin Nicholson, RiverFront Investment Group Global Fixed Income Co-CIO.“The bond market has been interesting because we’ve been hovering close to the lows for the year as far as yields are concerned, and that is really because I think that they’re looking for Washington to actually get a deal done,” he said during Yahoo Finance’s “The First Trade” on Wednesday. “And because they’ve been not negotiating well with one another over the last couple of weeks, we’ve seen the kind of risk-off in the bond market, because I think that they’re afraid if we don’t get people back to work, we’re going to see the economy slow down.”That cautiousness, however, hasn’t translated across the bond market as a flashing red signal for equities, which to date have continued to march higher despite lingering economic weakness.“I like to look at high-yield CDS, the high-yield credit default swaps market – what you’re seeing is spreads are coming down,” Nicholson said. “The cost to insure is coming down. So that is actually a risk on indicator for equities. And so right now the bond market really isn’t showing me signs that this equity rally cannot continue.”As for his firm’s own recent trades, Nicholson said: “We’ve been focused on one- to five-year corporate bonds because that’s what the Fed was buying in their program in their bond buying program, but also when we look at the treasury market, we have some long duration there on the long end of the curve as far as treasuries are concerned. Overall we’re still underweight fixed income in the portfolios.”—10:13 a.m. ET: Fed’s Rosengren says unchecked coronavirus pandemic in some states ‘likely to prolong the economic downturn’Federal Reserve Bank of Boston President Eric Rosengren said Wednesday that fiscal and monetary stimulus, while critical to supporting the economy, “cannot fully offset the economic drain caused by the public health crisis.”“Limited or inconsistent efforts by states to control the virus based on public health guidance are not only placing citizens at unnecessary risk of severe illness and possible death – but are also likely to prolong the economic downturn,” Rosengren said in prepared remarks to the South Shore Chamber of Commerce.Rosengren also re-upped his defense of the Fed’s Main Street Lending Program, which has set aside hundreds of billions of dollars for loans to small- and mid-sized businesses hit by the pandemic but seen slow adoption so far among these businesses.“Should the fall bring a resurgence of the virus as many epidemiological models predict, this program may become even more essential,” he said.——9:36 a.m. ET: Stocks open higher, Dow adds 200+ pointsHere were the main moves in markets as of 9:36 a.m. ET:S&P 500 (^GSPC): +32.21 points (+0.97%) to 3,365.90Dow (^DJI): +264.02 points (+0.95%) to 27,950.93Nasdaq (^IXIC): +124.42 points (+1.15%) to 10,908.07Crude (CL=F): +$0.81 (+1.95%) to $42.42 a barrelGold (GC=F): +$5.30 (+0.27%) to $1,951.60 per ounce10-year Treasury (^TNX): +1.3 bps to yield 0.671%——8:30 a.m. ET: Consumer prices rise more than expected in July as energy prices advance; food prices fall for the first time in more than a yearAn index tracking changes in consumer prices jumped more than expected in July, pointing to firming inflationary trends as energy prices extended their march higher.The Bureau of Labor Statistics’ consumer price index (CPI) rose 0.6% in July to match June’s pace of increase. Consensus economists had expected a deceleration to a 0.3% month over month gain, according to Bloomberg data.Excluding more volatile food and energy prices, the CPI increased 0.6% over last month, or three times the 0.2% rise expected. This core measure of underlying consumer price trends rose 1.6% in July over last year, or more than the 1.1% increase expected.The food index in July fell 0.4% after a rise of 0.6% in June for its first decrease since April 2019, led by a 1.1% decline in prices for food at home. The energy index rose 2.5% after an increase of 5.1%.—7:26 a.m. ET Wednesday: Stock futures point higherHere were the main moves in markets, as of 7:26 a.m. ET:S&P 500 futures (ES=F): 3,355.00, up 25 points, or 0.75%Dow futures (YM=F): 27,877.00, up 263 points, or 0.95%Nasdaq futures (NQ=F): 10,975.75, up 97.25 points, or 0.89%Crude (CL=F): +$0.67 (+1.61%) to $42.28 a barrelGold (GC=F): +$2.20 (+0.11%) to $1,948.50 per ounce10-year Treasury (^TNX): +1.2 bps to yield 0.67%—6:03 p.m. ET Tuesday: Stocks open higherHere were the main moves in equity markets, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,339.5, up 9.5 points, or 0.29%Dow futures (YM=F): 27,685.00, up 71 points, or 0.26%Nasdaq futures (NQ=F): 10,935.5, up 57 points, or 0.52%NEW YORK, NEW YORK - MARCH 20: Traders work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}