{"article": [{"url": "https://finance.yahoo.com/news/quibi-cannot-blame-all-of-its-many-problems-on-coronavirus-123313787.html", "published": 1592379680.0, "headline": "Quibi cannot blame all of its many problems on coronavirus", "body": "Two months after launch, things are not going well for Quibi, the well-capitalized, much-hyped new streaming television app named for “quick bite” videos of 10 minutes or less.The app’s entire premise was short, digestible videos that people would watch on the go, and so Quibi launched on April 6 only on mobile phones—amid a global pandemic that kept people in their homes, watching content on their televisions, not their phones. Quibi did not launch with an option to cast Quibi to your TV.Downloads have severely disappointed. Daily downloads of the app have fallen precipitously since launch day, according to research firm Sensor Tower, and Quibi’s current pace is for fewer than 2 million paying subscribers in its first year, compared to Quibi’s own original target of 7.4 million, according to the Wall Street Journal. Quibi costs $4.99 per month with ads, $7.99 without adds.This month, Quibi asked its top executives to take 10% pay cuts. Quibi has also reduced its marketing amid the nationwide social justice reform protests after the killing of George Floyd.Quibi founder and former DreamWorks Animation CEO Jeffrey Katzenberg, in an interview with the New York Times in May, blamed Quibi’s problems on coronavirus: “I attribute everything that has gone wrong to coronavirus. Everything.”But Quibi also faces a patent lawsuit from video startup Eko, bankrolled by hedge fund Elliott Management. (The lawsuit is over Quibi’s feature that rotates the video depending on the orientation of the viewer’s phone; ironically, some reviews of the app complain that the portrait mode still cuts off part of the screen.)And Quibi has been criticized for the huge paydays it gave to stars like Reese Witherspoon ($6 million to narrate a nature program), whose husband, former CAA agent Jim Toth, is Quibi’s head of content acquisitions and talent.On top of all those issues, the Wall Street Journal now reports that Katzenberg and Quibi CEO Meg Whitman are at odds, and that their working relationship “had worsened to the point that it put the company’s future in jeopardy.”Story continuesKatzenberg can’t blame all of that on coronavirus.PARK CITY, UTAH - JANUARY 24: Jeffrey Katzenberg demonstrates Quibi's Turnstyle technology at Sundance 2020 on January 24, 2020 in Park City, Utah. (Photo by Daniel Boczarski/Getty Images for Quibi)But Quibi, which is failing despite its $1.7 billion in venture funding, also demonstrates a truth that has nothing to do with the pandemic. The “streaming wars” have given birth to a massive spending bubble in which content creators, studios, and big tech companies are frantically throwing money at streaming ventures in a race to keep up with Netflix.Apple did it with Apple TV+, which is not yet a proven success despite an initial spend of $6 billion on original shows like “The Morning Show” with Jennifer Aniston, Reese Witherspoon, and Steve Carell, and “See” with Jason Momoa.Disney has done it (spending $28 billion on all original content in 2019) with Disney+, an instant subscriber hit thanks more to Disney’s vast existing content library than to new content (with the exception of “The Mandalorian”), but is now navigating internal disputes because it also bought majority control of Hulu and has tried to integrate the back-end engineering tech with the Disney+ and ESPN+ teams.ViacomCBS spent around $15 billion on original content in 2019, pushing CBS All Access and its anchor original show “Picard.” AT&T-owned WarnerMedia spent $14 billion on non-sports content last year, nearly double its budget from the year prior, and had its own branding problems with the confusing launch of HBO Max last month. Comcast still plans to launch NBC Peacock next month without the Tokyo Olympics, which was set to be the app’s main appeal at launch.Quibi CEO Meg Whitman (R) and Quibi founder Jeffrey Katzenberg speak about their short-form video streaming service Quibi during their keynote address January 8, 2020 at the 2020 Consumer Electronics Show (CES) in Las Vegas, Nevada. (Photo by Robyn Beck / AFP) (Photo by ROBYN BECK/AFP via Getty Images)Even a truncated list of the better-known TV streaming platforms now in the market looks comically crowded: Netflix; Amazon Prime; Hulu; YouTube TV; Disney+; Apple TV+; CBS All Access; HBO Now; ESPN+; DAZN; FloSports; Crackle; Pluto; Fubo; and Philo.These platforms can’t all win.For Quibi, the slow start may also be a more simple lack of must-see content. Even with a long list of shows featuring big stars like Chrissy Tiegen (“Chrissy’s Court”), Jennifer Lopez (“Thanks a Million”), Chance the Rapper (“Punk’d”), Megan Rapinoe (“Prodigy”), none of Quibi’s shows have started any kind of cultural conversation.The current top dogs in streaming all made their names on the shoulders of one or two mega-hit original shows. “House of Cards” and “Orange is the New Black” premiered in 2013 and put the “Netflix Original Series” label on the map. Then Netflix added “The Crown” and “Stranger Things” in 2016. Amazon Prime Video got started with “Bosch” and “Transparent” in 2014, then had its first truly huge hit with “The Marvelous Mrs. Maisel” in 2018. Hulu’s moment came with “The Handmaid’s Tale” in 2017.Each of these exclusive shows are big enough hits that they convinced people to pay for those platforms. Quibi doesn’t have one yet, and there is reasonable doubt over whether any show with 10-minute episodes can become that level of hit.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is affecting the entertainment industry:Coronavirus is forcing Quibi, NBC Peacock to change their plans at launchCoronavirus puts 'extreme pressure' on all three pillars of Disney's business'Trolls World Tour' rental success does not spell death for movie theatersBethenny Frankel predicts coronavirus will level the Hollywood playing fieldDisney+ streaming during coronavirus is boosting Hasbro’s Baby Yoda toy salesMovie theaters seek bailout as coronavirus devastates business"}]}