{"article": [{"url": "https://finance.yahoo.com/news/why-stock-market-so-expensive-morning-brief-100136405.html", "published": 1592802560.0, "headline": "Why the stock market has gotten so expensive: Morning Brief", "body": "Monday, June 22, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeHigh valuations appear justified, but beware the ‘wildcards’As of Friday’s market close, the S&P 500 (^GSPC) was up 41% from its March 23 low.The rally in stock prices along with declines in earnings forecasts have sent the S&P’s forward 12-month P/E ratio to 21.9, according to FactSet. This widely followed valuation metric is now way above its five-year average of 16.9 and its 10-year average of 15.2.While this may seem scary, Wall Street’s top strategists see plenty of explanations for what’s happening. Though they also warn that the risks facing equity investors appear tilted toward the downside.Stock market valuations have spiked as prices surge and earnings expectations tumble. (Factset)Here’s a look at what the pros are chattering about:Recent economic data has been surprisingly strong: Key metrics like retail sales and payrolls grew by far more than any economist could have expected last month. This suggests the economy, at least in the short-term, is in better shape than previously thought. “[E]conomies reopened, and with it, economic activity measures have gone from the fastest pace of measured decline in history to their fastest rate of increase,” Citi Private Bank’s Steve Wieting wrote on Friday.Regarding retail sales, Credit Suisse’s Jonathan Golub noted: “Over the past three months, we’ve all learned that it is difficult to spend a lot of money when you can’t leave home. This is reflected in the $9.0k decline in personal expenditures, on an annual basis. The result is an increase in personal savings from $4.2k to $18.6k. While some portion of this will be banked, previously-quarantined consumers appear ready to reopen their wallets.”Ps lead Es: During the early phase of the market selloff, we warned Morning Brief readers that earnings (E) revisions lag stock prices (P). And so while P/E ratios seemed to be falling at the time, it was for no other reason than ‘E’ not having yet been revised lower as analysts hadn’t yet adjusted to a recessionary economic environment.Story continuesBut the opposite may be happening now. Wall Street strategists are now modeling in revised estimates coming from their colleagues in the economics research department. And so, surging Ps will mean surging P/Es for a short while.“This kind of relative behavior between P/Es and EPS is also typical around cycle bottoms,” UBS’s Francois Trahan wrote on Thursday. “P/Es tend to recover first, and shortly thereafter earnings follow suit—which is usually a signal that the recovery is indeed sustainable and equities have a brighter future ahead.”Valuations rise as stocks lead earnings. (UBS)History suggests E will surge: As my colleague Myles Udland wrote on Thursday, corporate profits have almost always seen V-shaped recoveries. Read more here.Rates are low: As we’ve written multiple times before, low interest rates appear to justify higher stock market valuations.“Stock multiples have increased dramatically over the past year from 16.6x to 21.7x today,” Credit Suisse’s Golub wrote on Friday. “At the same time, 10-year Treasury yields and investment grade corporate bond yields have collapsed from 2.1% to 0.7%, and 4.5% to 3.6%. Not surprisingly, investors are making the case that current, elevated stock valuations are justified given the collapse in rates.”Skewed by big tech: Broad market indices like the S&P 500 have been led higher by the eye-popping surges in massive tech stocks like Apple (AAPL), Amazon (AMZN), Netflix (NFLX), and Microsoft (MSFT) which are up some 20% to 40% year-to-date. The tech-heavy Nasdaq is up (^IXIC) 10% this year, while the S&P and Dow are in the red.“The resilience of the technology sector can be seen in the relative outperformance of the Nasdaq Composite Index (some 40% technology and tech-related stocks) in the year to date,” Oppenheimer’s John Stoltzfus wrote on Friday. Tech stocks generally come with better earnings growth prospects, and so they in turn come with higher P/Es.Beware the wildcards: Anyway you look at it, the market appears to be pricing in a lot of recent good news and the prospect for a real recovery further down the road. And that in turn is its own risk as there continue to be a lot of serious unanswered questions out there.In a note to clients on Friday, JPMorgan’s John Normand identified six “wildcards” that look like “potential spoilers”: a significant second wave of COVID-19 cases; the expiration of temporary fiscal stimulus measures; the end of monetary stimulus measures; U.S. sanctions on China “pre-November to boost Trump’s rating or post-November on Trump’s re-election”; a U.S. election outcome that leads to corporate tax hikes; and a hard Brexit.And so while it’s certainly possible to argue that the stock market isn’t wildly overvalued, the downside risks are considerable.\"This potential valuation problem makes more relevant the role of wildcards,” Normand wrote. “Perhaps because market momentum has been so strong in recent months, the sources of downside risk in H2 seem more abundant than the sources of upside.”Billionaire investor Howard Marks agrees.“[I]t seems to me that the potential for further gains from things turning out better than expected or valuations continuing to expand doesn’t fully compensate for the risk of decline from events disappointing or multiples contracting,” Marks wrote in a memo on Thursday.“In other words, the fundamental outlook may be positive on balance, but with listed security prices where they are, the odds aren’t in investors’ favor.”By Sam Ro, managing editor. Follow him at @SamRoWhat to watch todayEconomy8:30 a.m. ET: Chicago Fed National Activity Index, May (-16.74 in April)10 a.m. ET: Existing Home Sales, May (4.09 million expected, 4.33 million in April); Existing Home Sales month-on-month, May (-5.6% expected, -17.8% in April)READ MORETop NewsHere’s what to expect from Apple’s WWDC [Yahoo Finance]PG&E wins final approval for its bankruptcy reorganization [Bloomberg]Wirecard falls another 40% as it says missing $2.1B doesn't exist [Yahoo Finance UK]American Airlines seeks $3.5 billion in new financing [Reuters]YAHOO FINANCE HIGHLIGHTSHere's what the market is saying about rising coronavirus cases and the economyCoronavirus crisis reveals which startups are 'houses of cards': Fast Company Editor-in-ChiefLL Cool J: Stock market highs are pointless if the US is not 'morally sound'—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}