{"article": [{"url": "https://finance.yahoo.com/news/nouriel-roubini-on-economy-and-stimulus-140350446.html", "published": 1596273080.0, "headline": "Roubini: Trump, Congress are 'playing with fire' by dragging out stimulus talks", "body": "Economist Nouriel Roubini said on Friday that lawmakers in Washington D.C. are “playing with fire” by not reaching an agreement on the next round of fiscal stimulus.Congress and the Trump administration went into the weekend without reaching a deal on new funds to backstop the economy. Although Democrats and Republicans pledged to keep talking, the jobless provision lapsed on Friday — which could spell financial ruin for approximately 30 million Americans drawing an extra $600-a-week unemployment benefit provided by the CARES Act.Roubini, dubbed “Dr. Doom” for his famously dark warnings about the economy and having predicted the 2008 meltdown, told Yahoo Finance in an interview that foot-dragging in Washington could lead to another recession, at a time when concerns about the recovery are already festering.“Unless the government does its own part to save and boost the income of the private sector, there will be a sharp slowdown,” said the chairman and CEO of Roubini Macro Associates, who is also an economics professor at NYU.Referencing the shape of an economic rebound, Roubini said a rapid “V-shaped” recovery from the steep plunge during the first half “could become a ‘U,’ the ‘U’ could become a double-dip recession, and over the medium term, there are even forces could that could lead to a Greater Depression,” he said.“So, we are playing with fire by not reaching an agreement,” the economist added.“The fact there is now this gridlock in Congress, and in Washington, doesn’t bode well at a time when economic activity looks like it’s stalling,” Roubini said — pointing to increasing uncertainty amongst businesses and consumers as coronavirus cases jump, particularly in the Sun Belt.According to Roubini, the U.S. still needs a “significant fiscal stimulus” of “at least $1.5 trillion for the next few months,” or the economy will slow down further.The Federal Reserve and the Paycheck Protection Program (PPP) have bolstered the economy, but Roubini said more is needed.Story continues“The income of people is still constrained by the fact that economic activity is slow, unemployment is very high. The Fed is doing its own share, but more than monetary policy, what matters right now for people is having income in their paychecks,” Roubini said.He added the boost to paychecks could come in the form of unemployment benefits, more PPP loans, aid for state and local governments, food stamps, support for healthcare, etc.“We still need a significant boost from the public sector because the private sector is deleveraging. Households and corporates are spending less, are saving more, doing less capital spending, less investment in residential,” the economist added.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Ackman looks to ‘marry a unicorn’ with record-breaking SPACAckman sees ‘real recovery’ in back half of 2021, remains upbeat of offices and restaurantsPalihapitiya: Skip government bailouts, put ‘more money into the hands of consumers’Gundlach: A wave of layoffs is coming for $100,000/year white-collar jobsGundlach sounds off on prospects of a V-shaped recovery as ‘highly optimistic’Gundlach lashes Fed’s ‘incredible fiscal spending’ during coronavirus collapseGundlach: Why the dollar and tech rally are ‘real risks’ for investorsBillionaire Palihapitiya on the phenomenon of ‘spectacular’ AOC"}]}