{"article": [{"url": "https://finance.yahoo.com/news/teslas-current-valuation-is-mindboggling-bernstein-analyst-190910437.html", "published": 1595945840.0, "headline": "'Tesla's current valuation is mind-boggling': Bernstein analyst", "body": "Tesla (TSLA) valuation is “mind-boggling” — and hard to justify — even in the most “bullish/imaginative scenarios,” say Bernstein analysts.Toni Sacconaghi and his team downgraded the electric vehicle maker’s stock to Underperform, maintaining a price target of $900, well below its current intraday trading level of around $1,500.“Let us be clear: this is a valuation call,” wrote Sacconaghi.“Despite our relatively bullish stance on electric vehicle evolution...we find it difficult to justify Tesla's current valuation even under our most bullish/imaginative scenarios,” he added.Tesla reported a 2nd quarter surprise GAAP profit last week, despite disruptions to its Fremont factory due to the pandemic.Year-to-date Tesla is up more than 260%. It rallied to a new high of almost $1,800 earlier this month following better-than-expected vehicle deliveries for its latest quarter, and increasing speculation that it could be included in the S&P 500 (^GSPC).The analyst writes “we understand the bull case” — including the possibility that margins could improve materially, and the fact that “Tesla is a leader is a huge, underpenetrated market.”“That said, Tesla's current valuation is mind-boggling,” said the note.The analyst highlights Tesla’s enterprise value reached that of Toyota (TM) and Volkswagen (VOW3.DE) combined, making it the 13th largest cap company in the world. That’s “unprecedented for a large cap stock outside of the tech bubble.”“At this point, Tesla even looks expensive vs. large-cap growth tech such as Amazon (AMZN) or Netflix (NFLX),” wrote Sacconaghi.Indianapolis - Circa March 2019: Tesla Service Center. Tesla says new V3 Supercharger stations will reduce recharging times by half IIIn the near term, ‘calling Tesla's stock direction could be a fool's game’Given the high expectations for the company, Bernstein’s analysts worry about “potential Model Y vs. Model 3 cannibalization,” and the impact of forthcoming EV competition to investor sentiment. They also point to whether Tesla can roll out enough new models to sustain 30%+ growth for several more years.Story continues“In the near term, we acknowledge that calling Tesla's stock direction could be a fool's game,” wrote Sacconaghi.He recognizes expectations appear achievable and the upcoming Battery Day event may be noteworthy but adds, “On net, we do believe valuation matters (at some point...).”Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}