{"article": [{"url": "https://finance.yahoo.com/news/ny-fed-covid-forces-first-decline-in-household-debt-since-2014-150031379.html", "published": 1596708500.0, "headline": "NY Fed: COVID forces first decline in household debt since 2014", "body": "The Federal Reserve Bank of New York reported Thursday that the COVID-19 pandemic had led to pay-downs of household debt in the second quarter of 2020, leading to the first quarter-over-quarter decline since 2014.The New York Fed’s Consumer Credit Panel, which uses national data from Equifax, shows that total household debt fell by $34 billion to $14.27 trillion as of June 30.The most notable decline in consumer debt came from credit card spending, where balances fell by $76 billion in the second quarter to $820 billion - the steepest decline in the history of the New York Fed’s data. Auto and student loan balances were roughly flat, at about $1.34 trillion and $1.54 trillion, respectively.The data show signs of caution over consumer spending, although more high-frequency data has suggested a stronger rebound in consumption. In June, consumer spending as reported by the commerce department rose by 5.6%.Lower debt also could have been the result of Economic Impact Payment checks from the Coronavirus Aid, Relief, and Economic Security (CARES) Act passed in March. In a separate study from the Philadelphia Fed, conducted nationally, 45.5% of respondents said they used some of the EIP on debt payments.Mortgage balances, however, continued to rise and added $63 billion during the second quarter to $9.78 trillion.(NY Fed)Delinquency rates on mortgages ticked down though, with 1.08% of mortgage debt classified as “serious delinquency” (90 days or more delinquent) in the second quarter compared to 1.17% in the first quarter. Delinquency rates on student loans, auto loans, and credit card debt also declined quarter-over-quarter.The New York Fed attributed the lower delinquency rates to the uptake of forbearances. The CARES Act provided federally-mandated foreclosure moratoriums on government-backed mortgages have also prevented those who have been unable to meet payments from losing their homes, but that protection will expire at the end of this month.Story continuesThe lower rates in the New York Fed report may be masking the cliff of foreclosures that could come if the moratorium are lifted before households are financially recovered.Congress is still debating the details of a Phase 4 package with further fiscal support.“Protections afforded to American consumers through the CARES Act have prevented large- scale delinquency from appearing on credit reports and damaging future credit access” said Joelle Scally, Administrator of the Center for Microeconomic Data at the New York Fed.Aarthi Swaminathan contributed to this story.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Democrats propose expanding Fed mandate to reducing racial inequalityWhat is a stock split: Yahoo UFed chair says economy faces 'new phase' as coronavirus deaths top 150K, data softenFed: Economic recovery will depend 'significantly on the course of the virus'A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}