{"article": [{"url": "https://finance.yahoo.com/news/bidens-worst-tax-idea-163542800.html", "published": 1602150200.0, "headline": "Biden’s worst tax idea", "body": "Joe Biden’s economic plan is getting solid reviews, with research firms such as Oxford Economics and Moody’s Analytics predicting it would modestly booth growth and employment, if enacted.But there’s one silly and probably unworkable idea in Biden’s plan: an alternative minimum tax on companies that use legal tax deductions to reduce their tax burden.During a recent webinar sponsored by Yahoo Finance and the Bipartisan Policy Center, two prominent economists—Jason Furman of Harvard University and Doug Holtz-Eakin of the American Action Forum—both trashed the idea of an overlapping second tax system for businesses. Furman is a Democrat who was chair of the Council of Economic Advisers. Holtz-Eakin is a Republican who was director of the Congressional Budget Office and chief economic adviser to John McCain during his 2008 presidential campaign.Biden’s alternative business tax would be a new 15% tax on “book income” for companies with more than $100 million in annual income. Book income is the profit or loss public companies report to shareholders, and it’s often higher than the income they report to the IRS. That’s because public book income doesn’t take into account the many complex tax deductions companies often use to lower their tax bill. Amazon, for instance, reportedly paid no tax in 2018, even though it turned a $10 billion profit.Isn’t it reasonable to make profitable companies pay some minimum amount of tax? Not necessarily. “It's a terrible idea, for two reasons,” Holtz-Eakin says. “Number one, you shouldn't have a tax system and an alternative tax system. You should have one tax system that you believe raises revenue in a fair and efficient fashion. The second is, there's a reason there's a difference between taxable income and book income. And a lot of it has to do with the use of legal tax deductions you set up in the first one. It makes no sense whatsoever.”Democratic presidential candidate former Vice President Joe Biden boards his campaign plane at New Castle Airport in New Castle, Del., Thursday, Oct. 8, 2020., en route to Arizona. (AP Photo/Carolyn Kaster)If the Republican economist opposes Biden’t alternative business tax, the Democratic economist must support it, right? Nope. “Alternative minimum taxes are always an admission that your tax system has failed,” Furman says. “I'd always rather fix the tax system as a whole. Better would be, get rid of the loopholes that give rise to the problem in the in the first place.”Story continuesThe most lucrative tax breaks for businesses include depreciation of equipment, tax credits for research and adjustments for income tax paid overseas. Congress established these tax breaks mainly to incentivize things that ought to be good for the economy overall, such as higher spending on equipment and on research that could generate innovation and boost job growth. The 2017 Republican tax cuts enhanced some of these tax breaks, while also cutting the corporate tax rate from 35% to 21%. There are also tax breaks that benefit specific industries, including many for real-estate developers like Donald Trump.Business taxes way downBusiness taxes have plunged as a source of federal revenue. The post-war high was in 1952, when business taxes generated 32.2% of federal revenue. That fell to 12.5% by 1980, and it’s been under 10% every year since 2016. The 2017 tax cuts lowered corporate tax proceeds to just 6.1% of federal revenue in 2018 and 6.6% in 2019.Biden wants to raise the business tax rate from 21% to 28%, which is plausible. But he seems to have adopted the alternative minimum tax idea from Sen. Elizabeth Warren, who proposed it last year during her own presidential campaign. Warren, like Sen. Bernie Sanders, was trying to generate or tap into outrage over flourishing businesses that aren’t necessarily sharing the wealth with workers. Biden has clearly embraced some liberal ideas to expand his support among the party’s left wing.But if you think companies enjoy too many tax breaks, it’s better to pare down or eliminate the tax breaks than to layer another taxation scheme atop the original one, to capture money that’s legally escaping. Tax experts call this “broadening the base,” or maximizing the number of entities that pay tax. A simpler tax code with fewer provisions is almost always better than a complex one with various provisions meant to offset each other, because there are fewer loopholes for high-paid tax experts to exploit.There’s no shortage of ideas for making corporate taxes fairer, simpler and more efficient. The Congressional Budget Office regularly publishes a long list of options for cutting spending and increasing revenue, including several possible reforms to the corporate tax code, such as repealing tax breaks for energy companies, ending a tax break related to low-income housing and changing the deductibility of some business expenses. The Brookings Institution published a 352-page paper earlier this year outlining numerous shelters and tax breaks Congress could eliminate to raise more corporate revenue. If Biden wins in November, he could end up pursuing some of those, and perhaps obviate the need to pursue his shakiest tax idea.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:A business operating like the White House would be in big troubleHow Democrats can save ObamacareTrump’s health care shamTrumpworld is implodingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}