{"article": [{"url": "https://finance.yahoo.com/news/heres-how-joe-biden-says-hell-create-1-million-new-auto-industry-jobs-195917316.html", "published": 1594739240.0, "headline": "Here’s how Joe Biden says he’ll create 1 million new auto industry jobs", "body": "On Tuesday, former Vice President Joe Biden released the second part of his Build Back Better plan. The overall focus was on infrastructure and clean energy but a sizable chunk was devoted to one industry in particular: autos.Biden promises – through government purchases, new tax incentives and other measures – to lift up automakers and the businesses that supply them.\"Together, this will mean 1 million new, well paying jobs in the American automobile industry\" he said on Tuesday.The campaign likes to focus on Biden’s role in the 2009 bailouts of General Motors and Chrysler. As Biden himself has often said, while making the case for his and Barack Obama’s re-election in 2012, “Osama bin Laden is dead, and General Motors is alive” thanks to them.Democratic presidential candidate and former Vice President Joe Biden speaks at a \"Build Back Better\" Clean Energy event on July 14. (OLIVIER DOULIERY/AFP via Getty Images)What he wants to do Biden’s economic agenda is heavily reliant on federal spending and Tuesday’s auto plan is no different. He promises his administration would “use all the levers of the federal government” to help transition the auto industry towards a future dominated by electric vehicles.China is currently both the leader in manufacturing as well as using fully-electric cars. According to 2019 estimates, there were 7.2 million electric vehicles in operation globally: 47% of them were on the road in China and 20% were in the United States. The lion’s share of the electric vehicles in the U.S. are made by Tesla (TSLA).The plan is to accelerate the upgrades of 3 million vehicles that the government regularly purchases anyway – think buses, mail trucks, and police cruisers. “We're going to convert these government fleets to electric vehicles made and sourced right here in the United States of the America,” Biden said.A Biden administration would also try to increase both supply and demand by encouraging consumers to buy more cars and factories to increase their capacity in response to “targeted incentives.” Details were not provided beyond that they would encourage electric cars made by unionized workers.Story continuesThe plan also promises new jobs through the federal government helping to build 500,000 electric vehicle charging stations, and also supporting research focused on battery technology.Will the industry will ‘step up’?In response to the incentives, Biden predicts the auto industry will \"step up.\" But it’s an industry in the middle of a difficult moment.A 2017 report by think tank called RethinkX looked at the auto industry over the coming decade and predicted massive disruption by 2030, no matter who is president.Former Vice President Joe Biden spoke in Wilmington. (Chip Somodevilla/Getty Images)The authors foresee a variety of factors – mostly around autonomous vehicles – converging with “enormous implications across the transportation and oil industries” with car companies being forced to adapt.Biden’s plan says that the 1 million new auto industry jobs would be spread across the industry from manufacturing to supply chains to “auto infrastructure.”The United Auto Workers union, which endorsed Biden in April, offered their support, saying the “ambitious plan is a win-win” for the industry and its workers.The Trump campaign responded to Biden’s plan, saying, “Green New Deal policies make it clear that union jobs related to oil, natural gas, fracking, and energy infrastructure will be on the chopping block” in a Biden administration.The Biden campaign recently released its Unity Task Force recommendations that focus extensively on the climate but don’t directly mention the Green New Deal. On his website, Biden has only partially embraced the proposal, saying it “is a crucial framework for meeting the climate challenges we face.”Watch for the Biden campaign to focus on the auto industry – and the swing states in which most of its workers reside – heavily between now and the November election. On Tuesday, Biden said that the Obama administration had revitalized the auto industry and a Biden administration would do it again but this time “bigger and faster and smarter.”Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Biden’s underwhelming economic planHere's what Joe Biden means for markets, business and AmericaFact or fiction? Assessing Team Trump’s claims about Biden and ChinaRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}