{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-19-2020-221154052.html", "published": 1592580500.0, "headline": "Stock market news live updates: Wall Street ends mixed as coronavirus fears pour cold water on rally", "body": "Stocks ended Friday’s session on a mixed note, as rising coronavirus cases in key U.S. states momentarily outweighed optimism about a quick economic rebound, which doused an early rally.Investors were unsettled by news that Apple (AAPL) would temporarily shutter stores again in U.S. states where COVID-19 cases have been spiking in recent weeks, undercutting the market’s optimism about a rapid recovery. The company confirmed the move to Yahoo Finance via an emailed statement saying that the company is closing its retail stores beginning June 20 out of an abundance of caution.Some states undergoing reopening are now grappling with resurgences in coronavirus cases. The gradual relaxing of stay at home orders have distracted from the still-raging COVID-19 crisis, which is showing up in economic data and putting a cap on the market.New coronavirus cases in Florida rose by a one-day state record on Friday, and hospitalizations in Texas also rose by the greatest amount since the pandemic began. Other states in the Sun Belt also case spikes, as regions struggled to keep infection rates down as public life restarts.Meanwhile, investors also eyed developments around trade and relations with China. Bloomberg reported China was planning to speed up imports of farm purchases including soy, corn and ethanol. The report, citing unnamed people familiar with the matter, noted that the decision came following discussions between U.S. and Chinese negotiators in Hawaii this week.Friday also marked the quarterly occurrence of quadruple witching, date in which expirations for stock index futures and options, along with individual stock futures and options, take place simultaneously. Rebalances for S&P indices and SPDR exchange-traded funds also occurred Friday.Still rising jobless claims reflect a labor market that’s been badly damaged by the outbreak. Unemployment figures are more than double the peak during the Great Recession, and a signal of a slower than expected recovery even with shelter in place orders easing.Story continuesThe “numbers suggest that the reopening story may not be generating as much momentum for job creation as the surprise May payrolls number had suggested,” James Knightley, chief international economist for ING, said in a note.“While recent activity data, particularly surrounding the consumer sector, has been very encouraging we are a long way from returning to ‘normality,’ Knightley added.—4:02 p.m. ET: Stocks end whipsaw session mixedHere’s where the markets settled at the end of regular trading Friday:S&P 500 (^GSPC): 3,097.95, -17.39 points (-0.56%)Dow (^DJI): 25,872.56, -207.54 points (-0.8%)Nasdaq (^IXIC): 9,946.12, +3.07 points (+0.03%)—2:13 p.m. ET: Stocks extend declines, Dow sheds 276 points, or more than 1%Here were the main moves in markets as of 2:14 p.m. ET:S&P 500 (^GSPC): 3,087.68, -27.66 points (-0.89%)Dow (^DJI): 25,803.73, -276.37 points (-1.06%)Nasdaq (^IXIC): 9,888.1, -56.04 points (-0.57%)Crude (CL=F): $39.78, +$0.94 (+2.42%)Gold (GC=F): $1,753.20, +$22.31(+1.28%)10-year Treasury (^TNX): +0.1 bps to yield 0.695%—2:13 p.m. ET: Stocks extend declines, Dow sheds 276 points, or more than 1%Here were the main moves in markets as of 2:14 p.m. ET:S&P 500 (^GSPC): 3,087.68, -27.66 points (-0.89%)Dow (^DJI): 25,803.73, -276.37 points (-1.06%)Nasdaq (^IXIC): 9,888.1, -56.04 points (-0.57%)Crude (CL=F): $39.78, +$0.94 (+2.42%)Gold (GC=F): $1,753.20, +$22.31(+1.28%)10-year Treasury (^TNX): +0.1 bps to yield 0.695%—12:30 p.m. ET: Stocks lose momentum; Apple to close some US stores againNews that Apple is shuttering retail locations in new COVID-19 hotspots in Florida, Arizona and the Carolinas squelched the market’s momentum in afternoon trading, with the Dow giving up triple-digit gains notched at the opening bell. A troubling rise in coronavirus diagnoses in those states have raised fears of a dreaded “second wave” just as the U.S.’s overall count had begun to stabilize.Here were the main moves in markets as of 12:40 p.m. ET:S&P 500 (^GSPC): 3,100.09, -15.25 (-0.49%)Dow (^DJI): 25,923.26, -156.84 (-0.60%)Nasdaq (^IXIC): 9,917.03, -26.02 (-0.26%)Crude (CL=F): $38.72, -0.12 (-0.31%)Gold (GC=F): $1,751.40,+20.30(+1.17%)10-year Treasury (^TNX): +3.3 bps to yield 0.727%—11:09 a.m. ET: Stocks pare some gainsThe three major indices held in positive territory but came off the highs of the session. The health-care and energy sectors led gains in the S&P 500, with crude oil topping $40 per barrel. Walgreens and Dow Inc. led gains in the 30-stock Dow.—9:36 a.m. ET: Stocks open higher, Dow rallies 300+ pointsHere were the main moves in markets as of 9:37 a.m. ET:S&P 500 (^GSPC): +35.81 points (+1.15%) to 3,151.15Dow (^DJI): +327.69 points (+1.26%) to 26,407.79Nasdaq (^IXIC): +84.45 points (+0.85%) to 10,025Crude (CL=F): +$1.41 (+3.63%) to $40.25 a barrelGold (GC=F): +$12.60 (+0.73%) to $1,743.70 per ounce10-year Treasury (^TNX): +3.3 bps to yield 0.727%—7:22 a.m. ET Friday: Stocks point to higher openHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:01 p.m. ET:S&P 500 futures (ES=F): 3,135.00, up 26 points or 0.84%Dow futures (YM=F): 26,246.00, up 222 points, or 0.85%Nasdaq futures (NQ=F): 10,081.25 up 85.5 points, or 0.86%Crude (CL=F): +$0.96 (+2.47%) to $39.80 a barrelGold (GC=F): +$8.40 (+0.49%) to $1,739.50 per ounce10-year Treasury (^TNX): +2.3 bps to yield 0.717%—6:01 p.m. ET Thursday: Stock futures open higherHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:01 p.m. ET:S&P 500 futures (ES=F): 3,113.25, up 4.25 points or 0.14%Dow futures (YM=F): 26,045, up 21 points, or 0.08%Nasdaq futures (NQ=F): 10,007.75, up 12 points, or 0.12%NEW YORK, NEW YORK - MARCH 20: Traders, some in medical masks, work on the floor of the New York Stock Exchange (NYSE) on March 20, 2020 in New York City. Trading on the floor will temporarily become fully electronic starting on Monday to protect employees from spreading the coronavirus. The Dow fell over 500 points on Friday as investors continue to show concerns over COVID-19. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}