{"article": [{"url": "https://finance.yahoo.com/news/amazon-launches-luxury-stores-130243593.html", "published": 1600157420.0, "headline": "Amazon launches new Luxury Stores shopping experience with Oscar de la Renta", "body": "Amazon (AMZN) is entering the world of high fashion. The company announced on Tuesday that it is launching new Luxury Stores on its site that will give users access to shopping experiences from big-name and up-and-coming fashion houses.The service will only be available to U.S. Prime customers invited to try out the new experience.The service will allow the brands to build out their own storefronts on the e-commerce giant’s main site, giving customers the ability to shop for everything from handbags and perfume to jewelry and kids clothes.Amazon is launching a new luxury shopping destination called Amazon Luxury where customers can browse and purchase high-end fashion brands including Oscar de la Renta. (Image: Amazon)Amazon says the first Luxury Stores will come from Oscar de la Renta and include the company’s Pre-Fall and Fall/ Winter 2020 line of goods ranging from ready-to-wear clothes to accessories.“We are excited to offer luxury brands the services and technology to build an inspiring, elevated customer experience,” Amazon Fashion president Christine Beauchamp said in a statement. “It’s still Day One, and we look forward to growing Luxury Stores, innovating on behalf of our customers, and opening a new door for designers all over the world to access existing and new luxury customers.”Luxury Stores will also get access to Amazon’s View in 360, which will give customers the ability to get fully 3D views of products they’re interested in purchasing directly on the site. That’s a big step up from the current single shot photos of goods Amazon offers.Need an invite? Amazon says you can request one at Amazon.com/LuxuryStores. The firm says it will open up the shops to more customers in the future, so it won’t be too exclusive for much longer.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:How to watch the Apple event on Sept. 15, and what to expectNetflix co-CEO on its advantage over Apple and Amazon: We have a ‘single focus’Microsoft Surface Duo review: A two-screen Android phone that could change everythingApple’s Sept. 15 event is all about the Apple WatchFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}