{"article": [{"url": "https://finance.yahoo.com/news/kb-home-reports-2020-third-201000321.html", "published": 1600787900.0, "headline": "KB Home Reports 2020 Third Quarter Results", "body": "Revenues Totaled $1.0 Billion; Diluted Earnings Per Share Grew to $.83Gross Margin Expanded to 19.9%, Up 140 Basis PointsNet Order Value Rose 29%; Backlog Value Increased 12% to $2.6 BillionKB Home (NYSE: KBH) today reported results for its third quarter ended August 31, 2020.\"We produced solid results in our third quarter, moving beyond the disruption associated with the early stages of the COVID-19 pandemic that we experienced in the spring. While our deliveries were lower compared to a year ago, our profitability rose meaningfully, led by a housing gross profit margin of 20.6%, excluding inventory-related charges, driving a 14% increase in our diluted earnings per share,\" said Jeffrey Mezger, Chairman, President and Chief Executive Officer.\"Housing market conditions strengthened during the third quarter, fueled by the combination of historically low mortgage interest rates, a limited supply of resale inventory and consumers’ desire to own a single-family home,\" continued Mezger. \"Reflecting this strength, our net orders expanded 27% year over year, with growth in each of our four regions. We achieved a monthly absorption pace that accelerated to 5.9 orders per community, an increase of 36%, while we also increased prices in most of our communities. We believe that our Built-to-Order model is a key factor driving our sales pace, with this quarter’s results underscoring the robust demand for the choice and personalization we offer to our homebuyers.\"\"As we look ahead to 2021, assuming market conditions remain favorable, we believe we are well positioned to expand our scale, and, with a leaner and more efficient operation, we anticipate accelerating our profitable growth next year, as we remain focused on generating higher returns,\" concluded Mezger.Three Months Ended August 31, 2020 (comparisons on a year-over-year basis)Revenues totaled $999.0 million, down 14% from $1.16 billion, reflecting the impact from the COVID-19 pandemic during the Company’s 2020 second quarter.Homes delivered were 2,545, compared to 3,022.Average selling price was $384,700, up from $381,400.Homebuilding operating income increased to $88.9 million from $85.5 million. The homebuilding operating income margin expanded 150 basis points to 8.9%. Excluding inventory-related charges of $6.9 million in the current quarter and $5.3 million in the year-earlier quarter, this metric improved 180 basis points to 9.6%.The housing gross profit margin expanded 140 basis points to 19.9%. Excluding inventory-related charges, the housing gross profit margin increased 170 basis points to 20.6%.The housing gross profit margin improvement primarily reflected a mix shift of homes delivered, lower amortization of previously capitalized interest, workforce realignment and reductions in the second quarter in response to the significant negative impact from the pandemic on the Company’s business, and a favorable pricing environment during the period.Adjusted housing gross profit margin, a metric that excludes inventory-related charges and the amortization of previously capitalized interest, increased to 23.7% from 22.3%.Selling, general and administrative expenses as a percentage of housing revenues improved slightly to 11.0%, mainly due to the Company’s targeted actions, including the above-mentioned workforce reductions, to reduce overhead costs, partly offset by decreased operating leverage from lower housing revenues.The Company’s financial services operations generated pretax income of $9.7 million, up from $6.6 million, mainly reflecting higher income from its mortgage banking joint venture, KBHS Home Loans, LLC (\"KBHS\").KBHS originated 79% of the residential mortgage loans the Company’s homebuyers obtained to finance their home purchase, compared to 72%.Total pretax income grew 10% to $101.3 million. As a percentage of revenues, pretax income increased 220 basis points to 10.1% from 7.9%.The Company‘s income tax expense and effective tax rate were $22.9 million and approximately 23%, respectively. In the year-earlier quarter, income tax expense was $23.8 million and the effective tax rate was approximately 26%. The lower effective tax rate in the current quarter primarily reflected the favorable impact of federal energy tax credits.Net income grew 15% to $78.4 million, and diluted earnings per share increased 14% to $.83.Nine Months Ended August 31, 2020 (comparisons on a year-over-year basis)Story continuesTotal revenues of $2.99 billion were flat.Homes delivered decreased 2% to 7,796.Average selling price increased to $379,800.Pretax income grew 30% to $238.0 million.Net income increased 31% to $190.2 million and diluted earnings per share rose 30% to $2.02.Backlog and Net Orders (comparisons on a year-over-year basis)Net orders for the quarter grew 27% to 4,214, the Company’s highest third-quarter level since 2005, with net order value increasing by $367.5 million, or 29%, to $1.64 billion. Both net orders and net order value increased in all of the Company’s four regions.The Company’s net order growth accelerated during the quarter, with monthly net orders up 11% in June, 23% in July and 50% in August. The Company’s cancellation rate as a percentage of gross orders for the quarter improved to 17% from 20%.Company-wide, net orders per community averaged 5.9 per month, compared to 4.3.The Company’s ending backlog increased 8% to 6,749 homes. Ending backlog value grew 12% to $2.57 billion. This marked the Company’s highest third-quarter backlog, in terms of both homes and value, since 2007.Average community count for the quarter decreased 7% to 238. Ending community count of 232 was down 9%.Balance Sheet as of August 31, 2020 (comparisons to November 30, 2019)Cash and cash equivalents increased to $722.0 million, compared to $453.8 million.The Company had total liquidity of $1.51 billion, including cash and cash equivalents and $787.6 million of available capacity under its unsecured revolving credit facility. There were no cash borrowings outstanding under the facility. The Company has not borrowed under the facility in 2020.Inventories decreased slightly to $3.67 billion.The Company had 60,278 lots owned or under contract, of which approximately 63% were owned and 37% were under contract.The Company’s 38,110 owned lots represented a supply of approximately 3.3 years, based on homes delivered in the trailing 12 months.Notes payable of $1.75 billion were essentially unchanged.The Company’s debt to capital ratio of 40.5% improved 180 basis points. The Company’s net debt to capital ratio improved 660 basis points to 28.6%.The Company’s next scheduled debt maturity is on December 15, 2021, when $450.0 million in aggregate principal amount of its 7.00% senior notes become due.Company Outlook — COVID-19 ImpactAlthough housing market conditions in the 2020 third quarter improved significantly from the prior quarter, the Company’s deliveries and revenues for the period were tempered primarily by the negative impact that restrictive public health measures to combat the outbreak and spread of COVID-19 had on its second quarter. Since the easing of public health restrictions in its served markets beginning in May 2020, all of Company’s communities have been open to walk-in traffic, following appropriate safety protocols and applicable public health guidelines. The Company also continues to engage with customers using its robust virtual selling capability, including enhanced online tools such as virtual home tours, interactive floor plans, live chats with sales counselors and online consultations with its design studios. Reflecting the shift in operating conditions, the Company’s net orders began to rebound significantly in May following a low point in April, and the upward trajectory continued into the third quarter and accelerated as the quarter progressed.The Company is encouraged by the resilience of the housing market and the significant increase in demand over the past several months. Subsequent to the end of the third quarter, demand remains strong, with the Company’s net orders for the first three weeks of September 2020 up 32% from the corresponding period of 2019, and the cancellation rate for the period improving to 12% from 17%. While the Company limited its land investments during the second quarter and most of the third quarter to preserve cash and liquidity due to the uncertainty surrounding the COVID-19 pandemic, given the sustained strong housing demand, it has resumed land acquisition and development activities to bolster its lot pipeline and support community growth in the future. Although the trajectory and strength of the current recovery remains uncertain, and it could be slowed or reversed by a number of factors, including a possible widespread resurgence in COVID-19 infections combined with the seasonal flu, the Company believes it is well positioned to operate effectively through the present environment.Conference Call The conference call to discuss the Company’s 2020 third quarter earnings will be broadcast live TODAY at 2:00 p.m. Pacific Time, 5:00 p.m. Eastern Time. To listen, please go to the Investor Relations section of the Company’s website at kbhome.com.About KB HomeKB Home (NYSE: KBH) is one of the largest and most recognized homebuilders in the United States and has been building quality homes for over 60 years. Today, KB Home operates in 42 markets across eight states, serving a wide array of buyer groups. What sets us apart is how we give our customers the ability to personalize their homes from homesites and floor plans to cabinets and countertops, at a price that fits their budget. We are the first builder to make every home we build ENERGY STAR® certified. In fact, we go beyond the EPA requirements by ensuring every ENERGY STAR certified KB home has been tested and verified by a third-party inspector to meet the EPA’s strict certification standards, which helps lower the cost of ownership and to make our new homes healthier and more comfortable than new ones without certification. We also work with our customers every step of the way, building strong personal relationships so they have a real partner in the homebuying process, and the experience is as simple and easy as possible. Learn more about how we build homes built on relationships by visiting kbhome.com.Forward-Looking and Cautionary StatementsCertain matters discussed in this press release, including any statements that are predictive in nature or concern future market and economic conditions, business and prospects, our future financial and operational performance, or our future actions and their expected results are \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements are based on current expectations and projections about future events and are not guarantees of future performance. We do not have a specific policy or intent of updating or revising forward-looking statements. Actual events and results may differ materially from those expressed or forecasted in forward-looking statements due to a number of factors. The most important risk factors that could cause our actual performance and future events and actions to differ materially from such forward-looking statements include, but are not limited to the following: general economic, employment and business conditions, generally and during the current recession; population growth, household formations and demographic trends; conditions in the capital, credit and financial markets; our ability to access external financing sources and raise capital through the issuance of common stock, debt or other securities, and/or project financing, on favorable terms; the execution of any share repurchases pursuant to our board of directors’ authorization; material and trade costs and availability, particularly lumber; changes in interest rates; our debt level, including our ratio of debt to capital, and our ability to adjust our debt level and maturity schedule; our compliance with the terms of our revolving credit facility; volatility in the market price of our common stock; weak or declining consumer confidence, either generally or specifically with respect to purchasing homes; competition from other sellers of new and resale homes; weather events, significant natural disasters and other climate and environmental factors; any failure of lawmakers to agree on a budget or appropriation legislation to fund the federal government’s operations, and financial markets’ and businesses’ reactions to that failure; government actions, policies, programs and regulations directed at or affecting the housing market (including the Coronavirus Aid, Relief, and Economic Security Act relief provisions for outstanding mortgage loans, tax benefits associated with purchasing and owning a home, and the standards, fees and size limits applicable to the purchase or insuring of mortgage loans by government-sponsored enterprises and government agencies), the homebuilding industry, or construction activities; changes in existing tax laws or enacted corporate income tax rates, including those resulting from regulatory guidance and interpretations issued with respect thereto; changes in U.S. trade policies, including the imposition of tariffs and duties on homebuilding materials and products, and related trade disputes with and retaliatory measures taken by other countries; the adoption of new or amended financial accounting standards and the guidance and/or interpretations with respect thereto; the availability and cost of land in desirable areas and our ability to timely develop acquired land parcels and open new home communities; our warranty claims experience with respect to homes previously delivered and actual warranty costs incurred; costs and/or charges arising from regulatory compliance requirements or from legal, arbitral or regulatory proceedings, investigations, claims or settlements, including unfavorable outcomes in any such matters resulting in actual or potential monetary damage awards, penalties, fines or other direct or indirect payments, or injunctions, consent decrees or other voluntary or involuntary restrictions or adjustments to our business operations or practices that are beyond our current expectations and/or accruals; our ability to use/realize the net deferred tax assets we have generated; our ability to successfully implement our current and planned strategies and initiatives related to our product, geographic and market positioning, gaining share and scale in our served markets and in entering into new markets; our operational and investment concentration in markets in California; consumer interest in our new home communities and products, particularly from first-time homebuyers and higher-income consumers; our ability to generate orders and convert our backlog of orders to home deliveries and revenues, particularly in key markets in California; our ability to successfully implement our business strategies and achieve any associated financial and operational targets and objectives; income tax expense volatility associated with stock-based compensation; the ability of our homebuyers to obtain residential mortgage loans and mortgage banking services; the performance of mortgage lenders to our homebuyers; the performance of KBHS, our mortgage banking joint venture with Stearns Ventures, LLC; information technology failures and data security breaches; an epidemic or pandemic (such as the outbreak and worldwide spread of COVID-19), and the control response measures that international, federal, state and local governments, agencies, law enforcement and/or health authorities implement to address it, which may (as with COVID-19) precipitate or exacerbate one or more of the above-mentioned and/or other risks, and significantly disrupt or prevent us from operating our business in the ordinary course for an extended period; a continuation of widespread protests and civil unrest related to efforts to institute law enforcement and other social and political reforms, and the impacts of implementing or failing to implement any such reforms; and other events outside of our control. Please see our periodic reports and other filings with the Securities and Exchange Commission for a further discussion of these and other risks and uncertainties applicable to our business.KB HOMECONSOLIDATED STATEMENTS OF OPERATIONSFor the Three Months and Nine Months Ended August 31, 2020 and 2019(In Thousands, Except Per Share Amounts - Unaudited)Three Months Ended August 31,Nine Months Ended August 31,2020201920202019Total revenues$999,013$1,160,786$2,988,918$2,994,072Homebuilding:Revenues$995,148$1,156,855$2,977,810$2,984,314Costs and expenses(906,205)(1,071,380)(2,777,083)(2,815,401)Operating income88,94385,475200,727168,913Interest income7862012,1631,745Equity in income (loss) of unconsolidated joint ventures1,922(384)11,981(1,159)Homebuilding pretax income91,65185,292214,871169,499Financial services:Revenues3,8653,93111,1089,758Expenses(1,056)(1,003)(2,901)(3,067)Equity in income of unconsolidated joint ventures6,8553,71614,8747,018Financial services pretax income9,6646,64423,08113,709Total pretax income 101,31591,936237,952183,208Income tax expense(22,900)(23,800)(47,800)(37,600)Net income$78,415$68,136$190,152$145,608Earnings per share:Basic$.86$.77$2.09$1.65Diluted$.83$.73$2.02$1.55Weighted average shares outstanding:Basic90,53588,26290,29287,630Diluted94,10592,84293,78894,032KB HOMECONSOLIDATED BALANCE SHEETS(In Thousands - Unaudited)August 31,2020November 30,2019AssetsHomebuilding:Cash and cash equivalents$722,033$453,814Receivables269,651249,055Inventories3,671,1293,704,602Investments in unconsolidated joint ventures48,82157,038Property and equipment, net64,61965,043Deferred tax assets, net241,171364,493Other assets125,24283,0415,142,6664,977,086Financial services34,76138,396Total assets$5,177,427$5,015,482Liabilities and stockholders’ equityHomebuilding:Accounts payable$231,821$262,772Accrued expenses and other liabilities630,529618,783Notes payable1,747,7041,748,7472,610,0542,630,302Financial services2,0652,058Stockholders’ equity2,565,3082,383,122Total liabilities and stockholders’ equity$5,177,427$5,015,482KB HOMESUPPLEMENTAL INFORMATIONFor the Three Months and Nine Months Ended August 31, 2020 and 2019(In Thousands, Except Average Selling Price - Unaudited)Three Months Ended August 31,Nine Months Ended August 31,2020201920202019Homebuilding revenues:Housing$979,113$1,152,618$2,960,901$2,968,588Land16,0354,23716,90915,726Total$995,148$1,156,855$2,977,810$2,984,314Homebuilding costs and expenses:Construction and land costsHousing$784,427$939,538$2,414,059$2,443,937Land14,0684,21614,94214,416Subtotal798,495943,7542,429,0012,458,353Selling, general and administrative expenses107,710127,626348,082357,048Total$906,205$1,071,380$2,777,083$2,815,401Interest expense:Interest incurred$31,054$36,024$93,071$107,356Interest capitalized(31,054)(36,024)(93,071)(107,356)Total$—$—$—$—Other information:Amortization of previously capitalized interest$30,628$38,558$93,949$106,859Depreciation and amortization7,7017,94823,44523,325Average selling price:West Coast$605,400$588,800$596,200$588,700Southwest330,700318,400321,700323,700Central310,000297,000300,100290,200Southeast286,500294,000290,500296,400Total$384,700$381,400$379,800$373,800KB HOMESUPPLEMENTAL INFORMATIONFor the Three Months and Nine Months Ended August 31, 2020 and 2019(Dollars in Thousands - Unaudited)Three Months Ended August 31,Nine Months Ended August 31,2020201920202019Homes delivered:West Coast6268382,0052,015Southwest6285661,7831,615Central9581,0982,8812,989Southeast3335201,1271,323Total2,5453,0227,7967,942Net orders:West Coast1,3299572,8632,797Southwest8577061,9272,007Central1,4691,1323,4053,556Southeast5595301,2721,704Total4,2143,3259,46710,064Net order value:West Coast$761,742$570,531$1,685,094$1,655,423Southwest285,917219,930642,601632,498Central438,697331,6351,024,6231,054,203Southeast157,404154,146362,540488,893Total$1,643,760$1,276,242$3,714,858$3,831,017August 31, 2020August 31, 2019HomesValueHomesValueBacklog data:West Coast1,901$1,088,0961,497$883,765Southwest1,382458,6811,318412,391Central2,512750,8312,281674,614Southeast954270,0561,134326,027Total6,749$2,567,6646,230$2,296,797KB HOMERECONCILIATION OF NON-GAAP FINANCIAL MEASURES(In Thousands, Except Percentages - Unaudited)This press release contains, and Company management’s discussion of the results presented in this press release may include, information about the Company’s adjusted housing gross profit margin and ratio of net debt to capital, neither of which is calculated in accordance with generally accepted accounting principles (\"GAAP\"). The Company believes these non-GAAP financial measures are relevant and useful to investors in understanding its operations and the leverage employed in its operations, and may be helpful in comparing the Company with other companies in the homebuilding industry to the extent they provide similar information. However, because they are not calculated in accordance with GAAP, these non-GAAP financial measures may not be completely comparable to other companies in the homebuilding industry and, thus, should not be considered in isolation or as an alternative to operating performance and/or financial measures prescribed by GAAP. Rather, these non-GAAP financial measures should be used to supplement their respective most directly comparable GAAP financial measures in order to provide a greater understanding of the factors and trends affecting the Company’s operations.Adjusted Housing Gross Profit MarginThe following table reconciles the Company’s housing gross profit margin calculated in accordance with GAAP to the non-GAAP financial measure of the Company’s adjusted housing gross profit margin:Three Months Ended August 31,Nine Months Ended August 31,2020201920202019Housing revenues$979,113$1,152,618$2,960,901$2,968,588Housing construction and land costs(784,427)(939,538)(2,414,059)(2,443,937)Housing gross profits194,686213,080546,842524,651Add: Inventory-related charges (a)6,8885,25116,93913,143Housing gross profits excluding inventory-related charges201,574218,331563,781537,794Add: Amortization of previously capitalized interest (b)30,18638,55893,507106,260Adjusted housing gross profits$231,760$256,889$657,288$644,054Housing gross profit margin19.9%18.5%18.5%17.7%Housing gross profit margin excluding inventory-related charges20.6%18.9%19.0%18.1%Adjusted housing gross profit margin23.7%22.3%22.2%21.7%(a) Represents inventory impairment and land option contract abandonment charges associated with housing operations.(b) Represents the amortization of previously capitalized interest associated with housing operations.Adjusted housing gross profit margin is a non-GAAP financial measure, which the Company calculates by dividing housing revenues less housing construction and land costs excluding (1) housing inventory impairment and land option contract abandonment charges (as applicable) recorded during a given period and (2) amortization of previously capitalized interest associated with housing operations, by housing revenues. The most directly comparable GAAP financial measure is housing gross profit margin. The Company believes adjusted housing gross profit margin is a relevant and useful financial measure to investors in evaluating the Company’s performance as it measures the gross profits the Company generated specifically on the homes delivered during a given period. This non-GAAP financial measure isolates the impact that housing inventory impairment and land option contract abandonment charges, and the amortization of previously capitalized interest associated with housing operations, have on housing gross profit margins, and allows investors to make comparisons with the Company’s competitors that adjust housing gross profit margins in a similar manner. The Company also believes investors will find adjusted housing gross profit margin relevant and useful because it represents a profitability measure that may be compared to a prior period without regard to variability of housing inventory impairment and land option contract abandonment charges, and amortization of previously capitalized interest associated with housing operations. This financial measure assists management in making strategic decisions regarding community location and product mix, product pricing and construction pace.Ratio of Net Debt to Capital The following table reconciles the Company’s ratio of debt to capital calculated in accordance with GAAP to the non-GAAP financial measure of the Company’s ratio of net debt to capital:August 31,2020November 30,2019Notes payable$1,747,704$1,748,747Stockholders’ equity2,565,3082,383,122Total capital$4,313,012$4,131,869Ratio of debt to capital40.5%42.3%Notes payable$1,747,704$1,748,747Less: Cash and cash equivalents(722,033)(453,814)Net debt1,025,6711,294,933Stockholders’ equity2,565,3082,383,122Total capital$3,590,979$3,678,055Ratio of net debt to capital28.6%35.2%The ratio of net debt to capital is a non-GAAP financial measure, which the Company calculates by dividing notes payable, net of homebuilding cash and cash equivalents, by capital (notes payable, net of homebuilding cash and cash equivalents, plus stockholders’ equity). The most directly comparable GAAP financial measure is the ratio of debt to capital. The Company believes the ratio of net debt to capital is a relevant and useful financial measure to investors in understanding the leverage employed in the Company’s operations.View source version on businesswire.com: https://www.businesswire.com/news/home/20200922005311/en/ContactsJill Peters, Investor Relations Contact(310) 893-7456 or jpeters@kbhome.comCara Kane, Media Contact(321) 299-6844 or ckane@kbhome.com"}]}