{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-covid19-drives-economy-morning-brief-100241237.html", "published": 1593061820.0, "headline": "The virus drives the economy: Morning Brief", "body": "Thursday, June 25, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThere can’t be an economic recovery without a public health recoveryStocks sold off sharply on Wednesday as all three major averages fell more than 2%.Rising case counts and hospitalizations in Texas, Arizona, and Florida — among other states — continue to make clear there has been no nationwide containment of the coronavirus.The spread of the virus has slowed considerably in the New York City metro area which was hardest hit in the spring, but data from this region now overstates the current state of the pandemic in the country. A record 38,762 positive tests were recorded in the U.S. on Wednesday, the highest since the pandemic began.And while the pandemic has been a deteriorating situation for a few weeks now, Wednesday’s action is a reminder that bad news on the virus is still the biggest negative catalyst for a market that rebounded considerably from lows reached back in March.“The reopening, done smartly, done intelligently, done on the data, is better for the public health... and it's better for the economy,” said New York Governor Andrew Cuomo in a press conference on Wednesday. “It was never a choice between saving lives or re-opening the economy. It was always — you have to do both or you do neither.”And Cuomo’s words echo what we’ve heard time and again from Federal Reserve Chair Jerome Powell.“The extent of the downturn and the pace of recovery remain extraordinarily uncertain and will depend in large part on our success in containing the virus,” Powell said in a press conference on June 10.“We all want to get back to normal, but a full recovery is unlikely to occur until people are confident that it is safe to re-engage in a broad range of activities.”On Wednesday, the governors of New York, New Jersey, and Connecticut announced that visitors from states where COVID-19 case counts are rising rapidly will have to quarantine for 14 days upon entry.Story continuesWith this policy, we’re perhaps seeing the outlines of a new, region-by-region closing of the U.S. economy take shape. All of which serves to remind investors that health comes first and the economic recovery comes second.Data from OpenTable highlighted by Bloomberg’s Joe Weisenthal on Wednesday showed restaurant reservations in Texas, Florida, Arizona, and Georgia are now down more than 50% from a year ago. Over the weekend, reservations in these states were down 20% or less from last year.Restaurant reservations have fallen sharply in states where coronavirus cases are rising, a sign consumers respond promptly to worries over their health and safety. (Source: OpenTable/Yahoo Finance)And while rules and regulations in states may change over time, reports indicate that businesses and consumers will pull back if they no longer feel safe. Restaurants in Texas, for instance, are choosing to close as the outbreak intensifies in that state.“Following a strong first phase of recovery – one in which robust growth data from depressed levels give the false impression of an immediate return to pre-Covid economic dynamism – the economy appears to be entering the slower, second phase of recovery,” said Greg Daco, chief U.S. economist at Oxford Economics in a note published Wednesday.The firm’s proprietary economic activity tracker declined for the first time since April for the week ending June 12. Much of this decline was attributed to tighter financial conditions that followed the stock market’s 6% drop on June 11. But moderating increases in consumer spending, mobility, and the labor market all point to more cautious behavior taking shape as we enter the heart of the summer months.“Looking ahead, we stress that the foundation to this recovery is an improving health outlook,” Daco writes.“If that measure continues to deteriorate, confidence will follow suit. This will lead to reduced mobility, less employment, and eventually slower demand and production growth with significant financial market risks.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Wholesale Inventories month-on-month, May preliminary (+0.4% expected, +0.3% in April)8:30 a.m. ET: Durable Goods Orders, May preliminary (+10.9% expected, -17.7% in April); Durables excluding Transportation, May preliminary (+2.3% expected, -7.7% in April)8:30 a.m. ET: GDP annualized quarter-on-quarter, Q1 third reading (-5.0% expected, -5.0% prior)8:30 a.m. ET: Personal Consumption, Q1 third reading (-6.8% expected, -6.8% prior)8:30 a.m. ET: GDP Price Index, Q1 third reading (+1.4% expected, +1.4% prior)8:30 a.m. ET: Core PCE quarter-on-quarter, Q1 third reading (+1.6% expected, +1.6% prior)8:30 a.m. ET: Initial Jobless Claims, week ending June 20 (1.35 million expected, 1.508 million prior)8:30 a.m. ET: Continuing Claims, week ending June 13 (20.54 million prior)9:45 a.m. ET: Bloomberg Consumer Comfort, week ending June 21 (40.2 prior)EarningsPre-market7 a.m. ET: Darden (DRI) is expected to report a loss per share of $1.78 on $1.25 billion in revenue7 a.m. ET: Rite Aid (RAD) is expected to report a loss per share of 38 cents on $5.6 billion in revenuePost-market4:15 a.m. ET: Nike (NKE) is expected to report earnings of 3 cents per share on $8.35 billion in revenueREAD MORETop NewsChuck E. Cheese parent files for bankruptcy, hit by pandemic [Bloomberg]Disneyland reopening delayed beyond July 17 [LA Times]Wirecard files for insolvency [Reuters]Mark Wahlberg-backed gym chain F45 to go public [Bloomberg]YAHOO FINANCE HIGHLIGHTSHere's a running list of companies boycotting FacebookCoronavirus stimulus checks: Americans are spending payments in 'two big ways''A scary number' of retail companies are facing bankruptcy amid the coronavirus pandemic—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}