{"article": [{"url": "https://finance.yahoo.com/news/underdog-trump-regains-momentum-chips-away-at-bidens-chances-with-rnc-underway-140555799.html", "published": 1598346800.0, "headline": "'Underdog' Trump regains momentum, chips away at Biden's chances with RNC underway", "body": "President Donald Trump is narrowing the advantage of his Democratic challenger in the race for the White House, with Joe Biden’s chances steadily declining since July, according to Smarkets.As the Republican National Convention gets into full swing, predictive market data suggests the former vice president derived little benefit from his own nominating convention last week. Currently, Smarkets estimates Biden has a 56% chance to win the presidency — a commanding lead but down seven points since the end of last month.“Any anticipated post-convention bounce for Biden has failed to materialize in our market, with his lead sliding to 13 percentage points, down from an all-time high of 28 points at the start of August,” said Smarkets Political Analyst Patrick Flynn.\"We do not know whether this is due to the content of the event itself or the fact this scaled-down edition took place virtually in the midst of the ongoing coronavirus pandemic,” Flynn added. “Either way, it has provided something of a window of opportunity to Donald Trump, as he accepts his own party nomination at the [RNC] this week.”Meanwhile, the president seems to be regaining lost ground, with his chances rising by eight points over the same period to 43% — their highest in more than two months.Democratic vice presidential candidate Senator Kamala Harris listens as presidential candidate and former Vice President Joe Biden speaks at a campaign event, their first joint appearance since Biden named Harris as his running mate, at Alexis Dupont High School in Wilmington, Delaware, U.S., August 12, 2020. REUTERS/Carlos BarriaTrump’s rise among Smarkets investors mirrors polling data that show his numbers inching up, albeit from a low base, and raises the possibility of a photo finish in November. The data coincide with an economic recovery that, while having lost momentum, is still continuing to grow since the onset of the COVID-19 pandemic.To be certain, Biden remains the overwhelming favorite in a head-to-head match up against Trump. Political site 538 has shown the former vice president’s odds have remained consistent near 73%, a level identical to Hillary Clinton’s back in 2016 before Trump’s stunning victory.AGF’s Investments’ Greg Valliere told Yahoo Finance on Monday that a Trump victory was “still doable, especially if you look at the battleground states” like Pennsylvania, where Biden’s advantage has narrowed.Story continues“Trump for all of his flaws is a really, really aggressive campaigner.” Battling against Clinton four years ago, the president showed “tremendous energy...and he may again, he may catch the wave. But we can’t delude ourselves, Trump is clearly the underdog.”According to Smarkets, a close election will likely amplify Trump’s accusations that fraud — stemming primarily from mail-in votes — is responsible for his loss. The market’s users estimate there’s a 30% chance that Trump will refuse to concede, something political watchers believe is a growing possibility.Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news"}]}