{"article": [{"url": "https://finance.yahoo.com/news/voters-expect-the-economy-to-get-worse-by-election-day-215048228.html", "published": 1597683500.0, "headline": "Voters expect the economy to get worse by Election Day", "body": "Americans have a gloomy outlook for the rest of the year—an ominous sign for President Trump as the 2020 presidential election enters the home stretch.The latest Yahoo Finance–Harris poll shows Americans expect a broad range of quality-of-life issues to worsen during the next three months, suggesting voters will be in a foul mood as they vote in November. On each of 10 separate issues, most respondents expect conditions to worsen rather than improve.On the economy, 51% expect it to be worse three months from now, while only 30% expect it to be better. The outlook for jobs is also grim, with 40% saying job prospects will be worse in three months, and just 32% expecting them to be better. And 44% expect the coronavirus pandemic to worsen into the fall and winter, with just 31% seeing improvement ahead. Harris conducted the poll from August 7–10, interviewing 1,021 American adults.Graphic by David FosterThe biggest optimism gap is on the national debt, with 62% expecting it to get worse, and only 16% expecting it to get better. Other things respondents say are more likely to get worse than better: public safety, tax levels, education, health care, the environment and social equality. On no issue are there more people saying things are more likely to improve than worsen.Click here for Yahoo Finance's full coverage of the 2020 electionTrump is already slumping on account of the coronavirus pandemic and widespread shutdowns that have put millions out of work. Democratic contender Joe Biden leads Trump by 7.7 percentage points nationally in the Real Clear Politics aggregate of polls. Biden also leads in most of the swing states likely to determine the outcome in November.Americans broadly disapprove of how Trump has handled the coronavirus crisis, in which he has consistently downplayed the seriousness of the problem and shunted the burden for testing and other public health priorities to states and cities. In the latest Gallup survey, 63% disapprove of how Trump has handled the crisis, while 36% approve. Those bad marks for Trump spill into his handling of the economy, where a slight majority now gives him a thumbs down.Story continuesMany Americans are taking a financial beating, which obviously spells trouble for the incumbent president. In the Yahoo Finance-Harris poll, 52% said they’re worse off financially than at the start of the year, with 48% saying they’re better off. Women are struggling a bit more than men, with 56% of women saying they’re worse off now than at the start of the year. For men, it’s 46%. The middle aged are faring worst, with 60% of people between 45 and 54 saying they’re worse off. The young are faring best, with 46% saying they’re worse off.Graphic by David FosterAfter free-falling in March and April, the economy is in a slow recovery but struggling to pick up steam. Businesses have hired back about one-third of the workers who lost their jobs, but the pace of hiring has tapered off as business owners brace for an uncertain future. The Federal Reserve has boosted stock-market values, but a real recovery might not come until a coronavirus vaccine is approved and widely available. Trump obviously hopes that happens by Election Day, but the odds are slim.Trump and his supporters point regularly to 2016, when Trump was an underdog behind by a similar polling margin at the same point in the race. His surprise win challenged the value of polls, and some Trump backers say the polls are wrong this time, too.But there are vast differences between 2016 and 2020. The Yahoo Finance-Harris poll shows that the top issues for voters this year are public safety, health care, the economy, public health, education and the national debt. More than 80% of voters say they’re very or somewhat concerned about each of those issues. In 2016, no issue cracked 80% concern among voters, and only three issues—health care, education and the environment—cracked 70%. Voters are clearly more anxious in 2020, and Trump is not known for a soothing manner that puts people at ease. If voters are morose about the future, maybe Trump should be, too.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Trump is martyring the postal serviceTrump’s “housewife” myth11 ways Trump is out of touch with votersA double-dip recession is formingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}