{"article": [{"url": "https://finance.yahoo.com/news/tesla-bear-says-stock-is-detached-from-reality-predicts-87-price-target-180905935.html", "published": 1598275040.0, "headline": "Tesla bear says stock is 'detached from reality,' predicts $87 price target", "body": "“Tesla (TSLA) is detached from reality,” says one Tesla bear.“In a nutshell, Tesla is essentially a busted growth story. I know that sounds crazy to people looking at the stock,” Gordon Johnson, CEO and founder of GLJ Research, told Yahoo Finance’s the First Trade.Johnson has an $87 price target on the stock by the end of next year. (You read that correctly.)Tesla is “trading at more than double VW’s (VOW3.DE) market cap, yet VW sold 11 million cars last year. Tesla sold just under 370,000 cars last year, looking to sell roughly 500,000 cars this year,” said Johnson.He notes that without the electric vehicle company’s credit revenue sales, it would’ve lost about $300 million in the second quarter of this year.“That’s essentially taxpayer incentives that they’re getting for selling credit revenues to other car companies, “ said Johnson.“The problem is all of those car companies are now selling electric cars, and Tesla is guiding their credit revenue sales to be down 50% in the back half of this year.”“Their core business is loss-making,” he added.Johnson points to domestic sales and U.S. gross margins which “peaked in the fourth quarter of ‘18,” and notes the China growth story touted by some analysts isn’t that impressive.“The reality is in the month of July they sold about 11.4 thousand cars in China. They produced about 12.2 [thousand] so they actually built inventory, and that’s despite a price cuts globally this year, four of which were in China,” said Johnson.“We think reality is much different than what is being pumped out there and we think the stock price is driving analyst opinions which is the buffounding to us, versus reality,” he added.Tesla has made heads spin and sent analysts racing to re-rate over the last several months.Year-to-date the stock is up about 385%. Shares will start trading on a split-adjusted basis on August 31st as announced earlier this month.The stocks valuation in recent weeks has been called “mind-boggling” by one analyst.Story continuesIn July one of Tesla’s biggest bulls saw the stock headed to $2,322.Wedbush’s bull Dan Ives recently raised his price target to $1,900. He told Yahoo Finance Tesla “is a tech company, not an automobile company,” pointing to the upcoming Battery Day next month.But Johnson is sticking to his bearish call, with a just-wait-and-see perspective.“The real data doesn’t match up. We think once that matches up, you’re going to have selling which we think will drive the stock lower,” he added.Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}