{"article": [{"url": "https://finance.yahoo.com/news/reasons-why-the-stock-market-sold-on-thursday-morning-brief-101609099.html", "published": 1591939460.0, "headline": "4 reasons the market sold off on Thursday: Morning Brief", "body": "Friday, June 12, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThe Fed, the virus, the technicals, and the Robinhood traders.Stocks got smoked on Thursday.When the bell rang on Wall Street, all three major indexes were down more than 5%. The Dow fell 6.9%, or 1,861 points, while the S&P 500 fell some 5.9%, or 188 points. By day’s end, all of the S&P 500’s gains in the month of June had been wiped out.The reversal in markets — which followed two mixed, but not terrible sessions for the market — was swift and left many asking the age old question: why?To our minds, four distinct stories converged during Thursday’s trading session, each contributing what became an ugly picture for the stock market.The first pillar of this is what we heard from Federal Reserve Chair Jerome Powell. On Wednesday, Powell’s final comments during his post-FOMC press conference referenced the stock market and asset prices.“We're not looking to achieve a particular level of any asset price,” Powell said in response to a question from Bloomberg’s Michael McKee.“What we want is investors to be pricing in risk, like markets are supposed to do. Borrowers are borrowing, lenders are lending. We want the markets to be working. And again, we're not looking to — to a particular level.”The Fed’s latest interest rate forecasts released Wednesday also indicated that interest rates would remain at 0% through 2022, news that put the banking sector under pressure. And this drop in financial stocks upset one of the market’s hottest trades in recent weeks. On Thursday, the KBW Bank Index (^KBX) fell 9%. Through Monday, the index had gained about 30% since mid-May.Markets have also seen increasingly troubling data on the spread of COVID-19 infections in a number of states, bringing up investor fears over a “second wave” and highlighting that perhaps this first wave isn’t actually over.States including Utah, Arizona, Texas, Florida, California, and the Carolinas have all seen case counts increasing in recent days. On Tuesday, Texas recorded its highest number of COVID-19 hospitalizations since the pandemic began.Story continuesThe market’s rally has also created challenges on a technical basis, with traders who closely watch price levels in the S&P 500 finding little to be excited about as the index surged north of 3,200 in recent days.Stephen Suttmeier at Bank of America Global Research noted Thursday that while initial support for the S&P 500 would be 3,163-3,128 — levels the index blew right through on Thursday — a “much more important level to hold on dips at the rising 200-day moving average (MA) and late May breakout zone in the 3,012 to 2,955-2,930 areas, respectively.”In other words, the market’s technical setup through Wednesday indicated things wouldn’t get really interesting for a few percentage points. On Thursday, the market traded all the way down to this range. Which sets up some interesting dynamics in the days ahead with the S&P 500 sitting right in the middle of a battleground range for technically driven investors.Which brings us to the week’s most interesting story in financial markets — the retail trader.Earlier this week, we saw traders on the free online platform Robinhood making bets on companies that had either filed for bankruptcy or were rumored to be in the process.This came after airlines, cruise stocks, and electric truck maker Nikola (NKLA) had become darlings of this retail investor set in recent weeks. And these trades have all come under serious pressure in recent days.On Thursday, for instance, all four major U.S. airline stocks — Delta (DAL), United (UAL), American (AAL), and Southwest (LUV) — were down more than 11%.The three big cruise line operators, Royal Caribbean (RCL), Norwegian Cruise Lines (NCLH), and Carnival Cruises (CCL), all saw their shares decline by more than 13%.And Nikola shares fell another 6.9% on Thursday to bring the stock’s losses since Tuesday afternoon’s peak to more than 30%.So, while no one of these narratives explains why the market dropped so far, so fast on Thursday, take these themes together and a quick, disorderly reset in the market makes a bit more sense.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Import Price Index month-on-month, May (+0.6% expected, -2.6% in April)10 a.m. ET: University of Michigan Sentiment, June preliminary (75.0 expected, 72.3 in May)READ MORETop NewsFlags of the world mounted on wall, over the World Bank and INTERNATIONAL MONETARY FUND logos on texture, partial graphicEuropean stocks choppy, US futures higher as IMF warns of 'significant scarring' [Yahoo Finance UK]UK economy saw historic 20% crash in April lockdown [Yahoo Finance UK]Palantir to file IPO in weeks for possible fall debut [Bloomberg]U.S. mortgage lender Quicken Loans planning IPO [Reuters]YAHOO FINANCE HIGHLIGHTSThese 5 states are showing early signs of a job market recoveryMichael Dell: ‘Not enough’ progress on diversity in the tech industryNascar's only black driver Bubba Wallace forever changed the sport—and it's having ripple effects beyond racing—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}