{"article": [{"url": "https://finance.yahoo.com/news/lyft-coronavirus-partition-riders-100048616.html", "published": 1594962500.0, "headline": "Lyft to provide 60,000 drivers with free partitions to prevent spread of coronavirus", "body": "Lyft announced on Friday that it will begin distributing plastic partitions to thousands of drivers in an effort to reduce the potential spread of the coronavirus between passengers and drivers. The move comes as the virus continues to surge across a slew of U.S. states, with some, like California and Texas either rolling back or pausing their reopenings.Lyft (LYFT) says it began supplying a number of its frequent drivers, as well as those who use the company's Express Drive rental program, with the partitions earlier this month. The partitions are now being made available to drivers in Boston, Dallas, Los Angeles, New York City, Phoenix, Seattle, and Washington D.C.Taxi driver Nicolae Hent, wearing a protective mask, poses for a photograph before before starting work in New York, Monday, April 6, 2020. A taxi driver's job was already tougher in recent years with the arrival of ride-sharing companies such as Uber and Lyft. The empty streets during the coronavirus pandemic have made things more difficult. (AP Photo/Matt Rourke)The firm says that the ultimate goal is to provide 60,000 partitions to drivers for free in the next few months. Those drivers that don't receive the separators will still be able to purchase them from Lyft. The company says it won't be making a profit on the partitions.Lyft says that it has been working on the partitions, which the company designed in-house, for the past several months. Prior to the availability of the partitions, drivers had taken to installing makeshift barriers in their vehicles using everything from clear shower curtains to large sheets of clear plastic wrap.According to Lyft, the plastic separators will be adjustable for drivers, and can be installed and removed easily.While the partitions will certainly be helpful, they won't completely prevent the spread of the coronavirus. To that end, Lyft is still requiring all drivers and passengers to self-certify that they don't have the virus and continue wearing masks during their rides.Lyft is providing up to 60,000 drivers with free in-vehicle partitions to help stop the spread of coronavirus. (Image: Lyft)In the early months of the coronavirus outbreak, ridership with Lyft, and its larger rival Uber (UBER), cratered, as cities and states shut down. Both companies, however, posted surprise revenue growth in Q1, with Lyft posting 23% year-over-year growth and Uber reporting an 8% year-over-year increase in ridesharing.Story continuesBut Q1 came to a close just as the impact of the coronavirus was beginning to be felt across the country. Q2 is expected to paint a far more dire picture.In April, in anticipation of the fallout from the virus, Lyft laid off 17% of its workforce, or 982 jobs, and furloughed another 288 employees. Uber similarly cut its workforce by 14%, or 3,700 jobs, largely from its customer support and recruiting divisions.We'll find out how much damage the virus did to the firms when the companies announce their Q2 earnings in the coming weeks.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Is TikTok a security threat? It’s complicated‘Ghost of Tsushima’ review: The PS4’s big send-off‘Assassin’s Creed Valhalla preview: Ubisoft looks to perfect its series’ formulaThe best gadgets for the beach and pool: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}