{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-jobless-claims-unemployment-week-ended-july-11-175149759.html", "published": 1594885160.0, "headline": "Jobless claims: Another 1.3 million Americans filed for unemployment benefits last week", "body": "New jobless claims declined by a smaller than expected margin in the Labor Department’s new report Thursday, as a surge in US virus cases threatens the pace of the labor market’s recovery.Here were the main figures from the report, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended July 11: 1.3 million vs. 1.25 million expectedContinuing claims, week ended July 4: 17.338 million vs.17.5 million expectedAt 1.3 million, the level of new claims dropped for a fifteenth straight week, with a steady recovery from the late March peak of 6.867 million new claims still under way. The previous week’s new jobless claims were revised down by 4,000 to 1.31 million.Read more: What to do before you lose your jobOver the past four months, more than 51 million Americans have filed new unemployment claims.Still, the level of new claims remains far above the about 200,000 new unemployment insurance claims filed each week in February before the pandemic hit. And it is still nearly double the 665,000 weekly claims filed at the worst point during the Great Recession in 2009.“The frustrating reality is that new claims have remained above one million since exploding in late March and having dipped below 2 million in late May,” Bankrate senior economist Mark Hamrick said in an email. “Improvement has proved harder to come by in recent weeks.”Moreover, without seasonal adjustments, initial jobless claims rose last week by 108,811 to 1.5 million, marking the first increase in this metric since April.“Key UI [unemployment] claim indicators diverged last week, with the seasonally adjusted data falling, but the non-seasonally adjusted claims increasing for the first time in months,” said Glassdoor senior economist Daniel Zhao. “The rising UI claims add to the evidence that the recovery may be stalling and come at a critical juncture in the crisis as Covid-19 cases rise around the country and expanded unemployment benefits for Americans are set to expire.”Story continues“The risk of a surprise drop in employment in July is rising, pointing to a rollercoaster recovery as the labor market starts to turn down again,” he added.Some of the states in the South and West that have recently reported spikes in coronavirus cases saw increases in new jobless claims for the week ended July 11. California, which has consistently posted the highest level of new jobless claims each week, reported an unadjusted increase of 22,941 claims to 287,732, after reporting a week over week decline in the previous report.Meanwhile, Florida – another state contending with a resurgence in coronavirus cases – saw new claims nearly double last week to 129,408. Arizona also saw a rise of 4,483 unadjusted claims to a total of 30,257 last week. Many states, however, reported declines in new claims versus the previous week.Continuing unemployment claims, which are reported on a one-week lag, fell more than expected for the week ending July 4. Those claims measure the number of individuals still receiving unemployment benefits, and have fallen for each of the past six straight weeks.Continuing unemployment claims for the prior week were revised down to 17.76 million, from the 18.062 million previously reported.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:June jobs report: US economy adds better than expected 4.8 million payrolls, unemployment rate falls to 11.1%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}