{"article": [{"url": "https://finance.yahoo.com/news/delete-tiktok-privacy-security-182800853.html", "published": 1594992980.0, "headline": "Should you delete TikTok?: Tech Support", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's dilemma:‘Should I delete TikTok?’If you’ve used the internet in the past year, then chances are you have some passing understanding of TikTok. And if you’re a teen or tween, you’re probably already shooting a video for the app instead of reading this.But the explosive growth of the hottest social media platform has given rise to a new kind of panic beyond the usual hand wringing over too much screen time.See, because TikTok, which is based in the U.S. and headed by former Disney executive Kevin Mayer, is owned by China’s ByteDance, U.S. officials see it as a potential security threat. President Trump and Secretary of State Mike Pompeo have even raised the prospect of banning the app from the U.S. outright.So should you delete TikTok? Not necessarily.First let’s go over what we know about TikTok.What is TikTok exactly?Previously called Musical.ly, TikTok has been downloaded more than 2 billion times, according to SensorTower. It’s also separate from ByteDance’s Mainland China version of the app called Douyin.But TikTok has also run afoul of U.S. law and security experts before.TikTok is one of the hottest social media apps around.All branches of the U.S. Armed Forces have banned use of the app on government-issued devices, as has the Transportation Safety Administration. And on Monday, Wells Fargo told employees to delete the app from corporate devices.In 2019, the company reached a $5.7 million settlement with the Federal Trade Commission over accusations that it violated the Children’s Online Privacy Protection Act.In March, researchers found that TikTok, as well as a number of other apps including Accuweather and The New York Times, were able to read text copied to users’ Clipboards due to a problem with the software development kits (SDKs) they used. TikTok told The Telegraph at the time that it would fix the issue.Story continuesBut when Apple (AAPL) released its public beta for iOS 14 in July, which alerts users when an app is copying and pasting Clipboard data, it was discovered that TikTok didn’t address the problem. The company has since said that it submitted a new version of its app to the App Store, and that the Clipboard issue was part of an anti-spam effort the social network was operating.The ByteDance logo is seen on a building in Beijing on July 8, 2020. - Video sharing app TikTok, which is owned by Chinese company ByteDance, announced on July 6 it was pulling out of Hong Kong, less than a week after a new national security law went into effect. (Photo by GREG BAKER / AFP) (Photo by GREG BAKER/AFP via Getty Images)Documents obtained by The Guardian in September 2019 also show that TikTok had a policy of silencing speech related to hot button issues in China including the Tiananmen Square Massacre, something the Chinese government goes to great lengths to suppress.According to the documents, the company would make such posts visible only to the person who posted them. TikTok responded to the report by saying those policies were outdated.What does that mean for you?So TikTok doesn’t have a great track record. Does that mean you should get rid of it?Well, there’s no actual evidence that the social media site is using any data it collects to spy on Americans. In fact, multiple security experts told Yahoo Finance that if you’re worried about the information collected by TikTok, then you should be just as concerned about the data vacuumed up by the likes of Facebook.And as NYU Tandon School of Engineering professor Justin Cappos explains, if you remove the country of origin from the conversation and simply compare Facebook’s (FB) long history of security and privacy concerns with TikTok’s relatively short history of security and privacy concerns, TikTok looks like less of a threat to users.Experts say the real fear regarding the app is if Chinese intelligence officials are able to compile enough user data to, in the future, blackmail or otherwise compromise teens currently using the app. Those teens, however, would need to hold positions of power in government or some other sensitive industry.It’s a fair concern, but not likely to be an issue for most users.In reality, if you’re nervous about TikTok stealing user data and using it against you, then you should be equally worried about the other social media companies out there doing the same. Look no further than the recent Twitter hack that saw high-profile user accounts including those of Barack Obama, Joe Biden, Elon Musk, and Bill Gates, as proof that the social networks that have your data are vulnerable to hacks and attacks.Using the app to post silly videos is more than likely fine. But as with anything you post online, remember that it could always come back to haunt you.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Lyft to provide 60,000 partitions to drivers to prevent spread of coronavirusIs TikTok a security threat? It’s complicated‘Ghost of Tsushima’ review: The PS4’s big send-off‘Assassin’s Creed Valhalla preview: Ubisoft looks to perfect its series’ formulaFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}