{"article": [{"url": "https://finance.yahoo.com/news/a-double-dip-recession-is-forming-201828980.html", "published": 1595431580.0, "headline": "A double-dip recession is forming", "body": "President Trump is banking on a quick recovery from the coronavirus pandemic and 15 million jobs lost as businesses shut down nationwide. For a while, it looked like he might get one.But after an encouraging rebound for a couple of months, there are new signs the economy is tipping over again, as the virus surges in the south and west and governors shut down businesses all over again. “We started to see a gradual rebound in confidence starting in April and lasting through May,” economist John Leer of research firm Morning Consult says in the latest episode of the Yahoo Finance Electionomics podcast. “June is where we hit a plateau, and in many states July is where things turned for the worst. So it looks to me like the economy's headed in the wrong direction.”Read more: What is a recession? What you need to knowMorning Consult conducts daily surveys of thousands of consumers in all 50 states, asking a series of questions to track real-time trends in consumer confidence. Confidence nationwide is about 25 points lower than it was on March 1, before the virus caused lockdowns in many states. But there are notable differences among states. In the northeast, where a surge in death and infection rates has abated, confidence has been improving during recent weeks. But in states with rising infection rates, confidence is flat or declining.There's no federal mask mandate. (Graphic: David Foster/Yahoo Finance)The implications for the presidential election should obviously worry President Trump. No president in 100 years has won reelection in the midst or immediate aftermath of a recession. If Trump has a chance, it would depend on a sharp improvement in the economy that Americans feel well before Election Day, plus probably a bit of forgiveness from voters who feel the recession isn’t necessarily Trump’s fault.[Check out other episodes of the Electionomics podcast.]That’s not the way things have been going for Trump. His approval rating on handling the crisis was modestly positive in late March, but it has since plunged, with 58% disapproving and just 38% approving, according to Fivethirtyeight. Trump’s Democratic opponent, former vice president Joe Biden, has an eight-point lead over Trump on average, and a double-digit lead in some polls. Trump recently revived his much-derided afternoon coronavirus news conferences, reportedly to put some positive spin on news that’s been relentlessly negative as daily infections have hit new record highs day after day.Story continuesStatus of swing statesConsumer confidence in six swing states likely to determine the outcome of the November election is uniformly depressed, compared with pre-virus levels. In Pennsylvania, Michigan and Wisconsin, there have been sharp improvements during the last two months, as infection rates have declined. That could modestly benefit Trump, if those trends continue. Confidence is more wobbly in Arizona, Florida and North Carolina, which could hurt Trump. Florida may be particularly concerning to him, since it’s heavily reliant on hard-hit tourism industry, which is unlikely to recover any time soon.Trump won all six of those swing states in 2016, providing his margin of victory over Hillary Clinton. He probably needs to win at least four of them to prevail in 2020. At the moment, Biden leads by mid-single digits in most of those states.A placard is posted on a slot machine to promote social distancing at Hard Rock Casino after it reopened on July 3, 2020 in Atlantic City, New Jersey. Atlantic City reopened eight of its nine casinos for business this week while limiting capacity to 25 percent following a nearly four-month shutdown in business due to the COVID-19 pandemic. (Photo by Mark Makela/Getty Images)The broader danger for Trump is that the job gains and other signs of improvement in May and June don’t last, or reverse themselves, leading to back-to-back double-dip recessions, or a “W-shaped recovery that peters out the first time around. There are a number of signs that is happening. Job openings posted on employment web sites have fallen in recent weeks, suggesting businesses that rehired many laid-off workers in May and June are now hunkering down for a prolonged downturn. Credit card spending is down. Restaurant visits have declined, after a short-lived uptick. Mobility data shows more people are staying home.Morning Consult’s data suggests job losses are spreading from sectors hit directly by shutdowns to other parts of the economy that support them, or are now hurting from the overall shock to demand. “People outside the service sectors are starting to feel this recession,” Leer says. “The restaurant closes, it’s not able to pay its bills, the bank doesn’t hire the lawyer to review its documents, whatever it may be. That’s how you get second- and third-order effects.”The good news seems to be that consumers do respond directly to improvements in containing the virus. “Consumer confidence continues to be highly correlated with the virus,” Leer says. “That might sound weird, but it's actually a good thing. That means that if we get the virus under control, consumer confidence can rebound.”Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Biden threatens Trump’s fortuneHow to waste $1 trillionEdgy voters might reject the 2020 election outcomeElection Night in November could last for daysHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}