{"article": [{"url": "https://finance.yahoo.com/news/just-eat-takeaway-acquire-grubhub-213916546.html", "published": 1591828460.0, "headline": "Just Eat Takeaway to Buy Grubhub for $7.3 Billion to Enter U.S.", "body": "(Bloomberg) -- Europe’s Just Eat Takeaway.com NV agreed to acquire U.S.-based Grubhub Inc. for $7.3 billion, in a deal that creates one of the world’s largest meal-delivery companies as the coronavirus pandemic drives a surge in orders.Amsterdam-based Just Eat Takeaway said it will pay $75.15 per share for Grubhub in an all-stock deal. Grubhub’s share price rose 4% in extended trading to about $62, while the European company fell 13%.The deal sidelines Uber Technologies Inc., which had been in acquisition talks with Grubhub for months. Political pressure raised questions about whether U.S. regulators would approve such a deal. The two companies had nearly aligned on a price but remained at odds over other issues, including terms of a breakup fee for Grubhub if the deal couldn’t be completed, people familiar with the matter said last month.Grubhub will launch Just Eat Takeaway into the U.S. market, broadening its already-global reach that includes Australia, Brazil and Canada, in addition to its home base in Europe. Jitse Groen, the Dutch billionaire who created Takeaway in 2000 in his university dorm room, has been looking to expand aggressively over the last year. Less than two months ago, Takeaway received antitrust clearance from the U.K. for its $8 billion acquisition of Just Eat.Matt Maloney, Grubhub’s chief executive officer, helped start the company in 2004. He first met Groen a few years later. They now describe one another as kindred spirits. “We have the same company on different continents,” Maloney said in an interview Wednesday. “There’s this mutual cosmic alignment.”In 2013, Maloney led a merger of Grubhub and Seamless to create what was then a dominant food delivery website. But the company has fallen far since then. DoorDash Inc., the current leader in the U.S., and Uber have eaten up market share, leaving Grubhub with 23% as of the end of April, according to market research firm Second Measure.Food delivery was one of the few parts of the economy to benefit from the spread of the virus this year, thanks to people spending more time at home. Grubhub’s stock is up 39% since the World Health Organization declared a pandemic in March, though it’s still trading at less than half of its peak in 2018.Story continuesProfit margins are tight or nonexistent in food delivery due to stiff competition to sign the most popular restaurants and add customers. Gross food sales for Grubhub rose 8% to $1.6 billion in the first quarter, and the company reported a net loss of about $33 million. Uber’s gross bookings for food delivery increased 52% to $4.68 billion in the same period, but the division’s loss also rose.Analysts have long said the unprofitable model in food delivery is unsustainable and expected consolidation. Grubhub’s largest shareholder, Caledonia Investments Plc, expressed support for the sale. “This was timed really well with Grubhub at a depressed price,” said Will Vicars, co-chief investment officer at the Sydney-based firm, which also owns shares in the acquirer. “It gives Just Eat Takeaway another important profit pool, and they have showed they can win against Uber in markets like Germany and the Netherlands.”For Uber, losing the deal is a blow to the company’s plan to increase revenue and eventually turn a profit from food delivery. That strategy was especially urgent with the pandemic lifting food delivery while decimating Uber’s main business of ride hailing. The company has cut jobs and side businesses as a result. It was relying on deals to achieve a top position in the markets where it operates.In an emailed statement, a spokesman for Uber said the company believes the industry needs consolidation but that it’s not interested in “doing any deal, at any price, with any player.”Read more from Bloomberg Opinion: Uber’s Dutch Rival for Grubhub Risks IndigestionTalks between Uber and Gruhub started before the pandemic and heated up in April, a person familiar with the matter said. Some financial advisers working on the deal referred to it internally as Project Checkers, said the person, who asked not to be identified because the discussions were private. Grubhub was known as Red, Uber as Black and Just Eat Takeaway later emerged as Jade. Uber and Grubhub had agreed on a ratio valuing Grubhub’s shares at 1.925 to Uber’s on the condition they work out a framework for securing regulatory approval, two people familiar with the matter said.Tensions between management of the two companies were boiling over in recent weeks, people familiar with those discussions said. Among the points of contention: the roles for Maloney and other Grubhub executives at Uber and the plan for a Washington charm offensive that was expected to take a year and a half, one of the people said.Maloney said Groen contacted him after Bloomberg first reported on the talks between Uber and Grubhub last month. The discussions progressed quickly. “They knew the price to beat,” Maloney said. Grubhub’s financial advisers were Evercore Inc. and Centerview Partners, and Just Eat Takeaway was advised by Bank of America Corp. and Goldman Sachs Group Inc.Just Eat Takeaway said Maloney will join the board and run the North America business. “Matt and I are the two remaining food delivery veterans in the sector, having started our respective businesses at the turn of the century, albeit on two different continents,” Groen said in a statement. “Both of us have a firm belief that only businesses with high-quality and profitable growth will sustain in our sector.”(Updates with shareholder comments in the ninth paragraph.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}