{"article": [{"url": "https://finance.yahoo.com/news/macys-will-probably-disappear-before-you-know-it-strategist-180442564.html", "published": 1599055940.0, "headline": "Macy's will probably disappear before you know it: strategist", "body": "Macy’s (M) is giving it the ole’ college try to avoid the same fate as one-time mall rivals Sears, J.C. Penney, Lord & Taylor and Bon-Ton.But with the COVID-19 pandemic fundamentally shifting how humans shop for everything from appliances to underwear, the future for Macy’s remains dim at best, retail experts contend.“Macy’s continues to pivot toward online, but unlike other online players they have the legacy business to contend with. Do I think they will be around in five years? I am not sure they will be around in three years unless they can address the core bricks and mortar business. In the current environment, I don’t see how they can do that,” said retail watcher and Tematica chief investment officer Chris Versace told Yahoo Finance’s The First Trade.To be sure, the storied department store did little on its second quarter earnings release day on Wednesday to stoke the hope and optimism of battered investors.Macy’s second quarter sales plunged by about $2 billion versus a year ago. Execs were quick to tout a 53% increase in digital sales, but when you operate more than 750 physical stores with ongoing weak traffic that is a moot point.The company notched a $142 million adjusted operating loss compared to a $402 million profit last year. Year-to-date, Macy’s has lost an astounding $830 million on an adjusted operating profit basis. Macy’s reduced inventory in a bid to conserve cash, raising the risk this fall of letting shoppers down because of out of stocks.While execs stayed consistent in their rather upbeat message on Wednesday’s earnings call with Wall Street — hyping up a new off-mall concept for high-end concept Bloomingdale’s — several dark clouds hang over the company headed into 2021.First, new Macy’s CFO Felicia Williams told investors at a conference back in June that sales may not normalize until 2021 or even 2022. No update on that shout out was provided by Williams on the call with analysts today. And Macy’s declined to issue any guidance given the uncertainty around back to school and holiday shopping.Story continuesPhoto by: John Nacion/STAR MAX/IPx 2020 7/30/20 A view of Macy's Herald Square as New York City enters Phase 4 of re-opening following restrictions imposed to slow the spread of coronavirus on July 30, 2020 in New York City. The fourth phase allows outdoor arts and entertainment, sporting events without fans and media production.Meanwhile, as sources have suggested to Yahoo Finance Macy’s latest overhaul shared in February — where it will close 125 stores over three years and layoff thousands to cut costs — has led to execution missteps across the organization.And then there is the Macy’s balance sheet.To shore up its finances, Macy’s said a couple months ago it secured $4.5 billion in fresh financing. Exiting the second quarter, Macy’s had $1.4 billion in cash and $3 billion in untapped credit. But the company is now saddled with more than $5.3 billion in short-term and long-term debt. Its shareholder’s equity account only reads $2.3 billion.One doesn’t need to be a CFA to understand that ratio really sucks at a time where your sales have fallen through a trap door and may not come back to some form of normality for three years (if at all).All in all, even the magic of Macy’s may not help it avoid the inevitable very soon.“Macy’s top-line profile remains constrained by declining brick-and-mortar sales across the bulk of its full-line stores, with increased promotions and growing digital sales pressuring gross margin. Larger picture and multi-year, discretionary dollars continue to shift toward convenience (Amazon) and Value (off-price), with lower visibility in the U.S. wholesale environment,” JPMorgan retail analyst Matthew Boss wrote in a note to clients a few months back.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}