{"article": [{"url": "https://finance.yahoo.com/news/covid19-coronvirus-economy-has-entered-new-phase-same-challenge-morning-brief-102228327.html", "published": 1593581420.0, "headline": "The economy has entered a new phase with the same challenge: Morning Brief", "body": "Wednesday, July 1, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeThe economy is bouncing back, but any recovery is ‘inextricably’ linked to virusThe first half of 2020 is over.When the year began, the economy and financial markets seemed poised to build off a strong 2019.But when the coronavirus pandemic took hold in March, all assumptions about the future were scrapped. Analysts, economists, policymakers, and the public continue grappling with this new reality.And on Tuesday, two of the Federal Reserve’s most influential members reiterated what to our mind is the single most important message anyone who wants this recovery to continue must keep in mind for the rest of 2020 and beyond — the recovery will only be as good as efforts to stop the spread of the virus.“As the economy reopens, incoming data are beginning to reflect a resumption of economic activity: Many businesses are opening their doors, hiring is picking up, and spending is increasing,” Fed Chair Jerome Powell said Tuesday before the House Committee on Financial Services.“Employment moved higher, and consumer spending rebounded strongly in May. We have entered an important new phase and have done so sooner than expected. While this bounce back in economic activity is welcome, it also presents new challenges—notably, the need to keep the virus in check.”Speaking at an Institute of International Finance event on Tuesday, New York Fed President John Williams shared a similar, if perhaps slightly more negative, view on the state of the economic recovery in the U.S.“When states started to reopen, signs from both the standard macro data and the high-frequency granular data have been encouraging,” Williams said. “Together, they indicate that we've likely seen the low point of the downturn and that the overall economy has begun to recover.”John Williams President and CEO of the Federal Reserve Bank of New York, and Jerome Powell, Chairman of the Board of Governors of the Federal Reserve System walk together after Powell's speech at the Jackson Hole Economic Policy Symposium on Friday, Aug. 24, 2018 in Jackson Hole, Wyo. (AP Photo/Jonathan Crosby)And indeed, The Conference Board’s latest reading on consumer confidence published Tuesday showed that most Americans think the economy did improve somewhat in June. Data from the housing market has also impressed in recent weeks. The number of passengers moving through TSA checkpoints also continues its steady rise, while consumer spending has risen steadily although slowed in recent days, according to data from JPMorgan.Story continues“Even in New York, the hardest hit state, we have seen initial signs of a turnaround,” Williams said Tuesday. “Surveys of manufacturing and services firms rebounded significantly in June, following record lows in April and May, and revenues of small businesses in New York have gradually picked up as well.”But as we’ve flagged over the last week, where case counts rise, the economy stalls.“In contrast to these positive signs, we are seeing some indications of a slowing in the pace of recovery in states that are currently experiencing large-scale outbreaks,” Williams said.“This is a valuable reminder that the economy's fate is inextricably linked to the path of the virus. A strong economic recovery depends on effective and sustained containment of COVID-19.” (Emphasis ours.)And it is this idea that must serve as the guiding principle for investors, policymakers, and the public as we begin the second half of what has been a strange, challenging, and momentous year.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7 a.m. ET: MBA Mortgage Applications, week ending June 26 (-8.7% prior)8:15 a.m. ET: ADP Employment Change, June (2.95 million expected, -2.76 million in May)9:45 a.m. ET: Markit US Manufacturing PMI, June Final (49.6 expected, 49.6 prior);10 a.m. ET: Construction Spending month-on-month, May (+0.9% expected, -2.9% in April)10 a.m. ET: ISM Manufacturing, June (49.5 expected, 43.1 in May)10 a.m. ET: ISM Prices Paid, June (45.0 expected, 40.8 in May)2 p.m. ET: FOMC minutesWards Total Vehicle Sales, June (13 million expected, 12.21 million in May)EarningsPre-market6:55 a.m. ET: Macy’s (M) is expected to report an adjusted loss per share of $2.53 on $3.69 billion in revenue7 a.m. ET: General Mills (GIS) is expected to report earnings of $1.06 per share on $4.89 billion in revenue7:30 a.m. ET: Constellation Brands (STZ) is expected to report earnings of $2.03 per share on $1.97 billion in revenueREAD MORETop NewsUK manufacturing stabilizes after historic collapse [Yahoo Finance UK]Fed Chair Powell warns of economic fallout from a 'second outbreak' [Yahoo Finance]FedEx shares soar 12% as home delivery boosts results [Reuters]Pizza Hut and Wendy’s operator NPC files for bankruptcy [Bloomberg]YAHOO FINANCE HIGHLIGHTS3 charts reveal why Lululemon just dropped $500 million to buy MirrorGoldman: A national policy on face masks may save lives — and the economyThese 3 states – and Washington, D.C. – are raising their minimum wage—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}