{"article": [{"url": "https://finance.yahoo.com/news/biden-could-stay-in-delaware-through-election-day-160241327.html", "published": 1597835420.0, "headline": "Biden could stay in Delaware through Election Day", "body": "Now that Joe Biden is officially the Democratic nominee for president, it might be time for the former vice president to begin modified campaigning in the 6 or 8 swing states likely to decide the election outcome in November. But campaign advisors are signaling that Biden will remain close to home in Delaware, where he has hunkered down since the coronavirus pandemic erupted in March.Former Virginia Gov. Terry McAuliffe, a top Biden advisor who has overseen several Democratic conventions, told Yahoo Finance recently that the coronavirus makes it too risky to stump in the conventional way. “When a presidential nominee travels, there’s a lot of pieces and a lot of people involved in that,” he says. “You’re asking people to put their lives at risk to come out for a political event.”That calls to mind President Trump’s last campaign rally, in Tulsa on June 20. Trump held the indoor rally despite objections from public health officials who warned it could become a super-spreader event. Coronavirus infections in Tulsa spiked after the rally, and one prominent attendee, former presidential candidate Herman Cain, died from the virus 5 weeks later.It’s not clear whether Cain contracted the virus in Tulsa or whether the rally contributed to the ensuing spike in cases in the Tulsa area. But Trump hasn’t held any of his signature indoor rallies since. He has been traveling to important electoral states such as Iowa, Arizona, Pennsylvania, Minnesota, Wisconsin and Ohio and delivering outdoor addresses to supporters.Click here for Yahoo Finance's full coverage of the 2020 electionPresident Donald Trump attends a campaign rally at The Defense Contractor Complex on August 18, 2020 in Yuma, Arizona. Hundreds waited in line in 104-degree heat to see the president, many without masks or maintaining distance from others, according to published reports. (Photo by Sandy Huffaker/Getty Images)Biden is clearly differentiating himself from Trump, who has downplayed the seriousness of the virus and all but urged businesses and school districts to disregard the virus and get back to business as usual. Unlike Trump, Biden usually wears a mask when he appears in public, and he backs a far stronger federal role in combating the virus than Trump. When Biden holds live events, they’re sparsely attended, with virtually everybody in masks and attendees spaced far apart.Story continuesBiden’s campaign style for the home stretch of the election seems likely to highlight these differences. “He's demonstrated leadership by listening to experts who've said that we need to do real work of social distancing,” Neera Tanden, a Biden campaign advisor and president of the Center for American Progress, told Yahoo Finance on Aug. 17. “The idea that he would ignore public health and go campaign, that would have been a detriment to him. He has a real deep advantage against Donald Trump on handling the coronavirus. Part of that is acting responsibly yourself.”McAuliffe reiterates the same message. “Joe Biden from day one has relied on the science and has done things to keep us safe,” he told Yahoo Finance. “It's about communicating to people and if it's not safe, he shouldn't do it. Early on, if Donald Trump had taken coronavirus seriously, thousands of people would be alive today. He did not do it.”In this July 28, 2020, file photo Democratic presidential candidate former Vice President Joe Biden speaks at a campaign event at the William \"Hicks\" Anderson Community Center in Wilmington, Del. (AP Photo/Andrew Harnik, File)While playing it safe might be the right thing for Biden to do, there are risks to hoping you can reach swing voters in swing states without showing up. In-state appearances generate local media coverage and let the candidate tailor his or her message to local concerns, whether it’s farm exports in Wisconsin or Minnesota, or manufacturing jobs in Michigan or Pennsylvania. Hillary Clinton famously declined to visit Wisconsin in 2016, assuming she had the state in the bag. Trump’s surprise win there was one of 3 swing-state victories that gave him the election (along with Michigan and Pennsylvania).Given the surreal nature of the coronavirus pandemic, voters may forgive Biden for staying home. “Democrats and Vice President Biden are following the science and listening to the health professionals,” Democratic Sen. Tammy Baldwin of Wisconsin told Yahoo Finance on Aug. 17. “They don’t want to put residents of the state of Wisconsin at risk.” She contrasted that with Trump’s scaled-back, in-person events and added, “That is not leadership. I think Wisconsin voters see that.” Biden better hope so.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Why Trump wants to shackle the postal serviceTrump’s “housewife” myth11 ways Trump is out of touch with votersA double-dip recession is formingEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}