{"article": [{"url": "https://finance.yahoo.com/news/callaway-golf-company-announces-second-202000750.html", "published": 1596727700.0, "headline": "Callaway Golf Company Announces Second Quarter 2020 Financial Results; The Company's Business Is Recovering From COVID-19 More Quickly Than Expected", "body": "- Second quarter 2020 net sales of $297 million, a 34% decrease compared to the second quarter of 2019. Sharp recovery in June sales where sales increased by 8% overall, including a 21% increase in the golf equipment business, compared to June 2019.- Second quarter 2020 net loss of $168 million, including a pre-tax non-cash impairment charge of $174 million related to the Jack Wolfskin goodwill and trade name, compared to net income of $29 million for the second quarter of 2019. Non-GAAP net income was $5 million compared to non-GAAP net income of $35 million in the second quarter of 2019.- Second quarter 2020 loss per share of $1.78, including the non-cash impairment charge, compared to fully diluted earnings per share of $0.30 in the second quarter of 2019. Non-GAAP earnings per share was $0.06 for the second quarter of 2020, compared to non-GAAP earnings per share of $0.37 in the second quarter of 2019.- Second quarter 2020 Adjusted EBITDAS of $29 million, compared to $66 million in the second quarter of 2019.- As part of the Company's continuing efforts to manage costs and capital allocation most efficiently during the COVID-19 pandemic, the Company announced the suspension of its $0.01 quarterly dividend.CARLSBAD, Calif., Aug. 6, 2020 /PRNewswire/ -- Callaway Golf Company (the \"Company\") (NYSE:ELY) announced today financial results for the quarter ended June 30, 2020.\"The second quarter began as an extremely challenging operating environment in all of our global markets as we saw the height of worldwide regulatory restrictions related to COVID-19,\" commented Chip Brewer, President and Chief Executive Officer of Callaway Golf Company. \"In the face of these challenges, I am pleased that we were able to achieve positive non-GAAP earnings and Adjusted EBITDAS during the second quarter and am pleased with how strongly our core markets and business picked up as the regulatory restrictions eased. We expect continued improvement but also that the COVID-19 pandemic will continue to negatively impact our business with sales headwinds and gross margin pressure through 2021. We remain encouraged by our golf equipment and soft goods businesses, both of which began the year on track for a record year and both of which have recovered more quickly than expected at the end of the second quarter and into the third quarter.\"Story continuesMr. Brewer continued, \"The golf equipment business is recovering very quickly. Once COVID-19 regulatory restrictions began to ease late in the second quarter, there was a demonstrable pent-up demand to play golf, an increase in new and returning golfers, and an uptick in new orders from both consumers and retailers. The pace of recovery in the apparel business also exceeded our expectations but has been slower than that of golf. As a result of the impact of COVID-19, along with a weaker euro than originally anticipated, during the second quarter we incurred a pre-tax non-cash impairment charge of $174 million related to the Jack Wolfskin goodwill and trade name. Nonetheless, we remain positive on the ability of the Jack Wolfskin business to contribute significantly to our overall apparel business and strategy. Over the long-term, we continue to believe strongly that our scale and global reach in the active lifestyle category, highly regarded brands, and sector expertise will create a compelling revenue growth opportunity with improving profitability, which will generate meaningful value for shareholders.\"\"Looking ahead, the impact of the COVID-19 pandemic on our businesses through 2021 remains unclear,\" Mr. Brewer explained. \"Given the uncertain short-term environment, we remain focused on stringent cost management and prudent capital allocation. In reevaluating our capital allocation strategy, we determined that our dividend is not the most effective use of capital at this time. As a result, we are suspending our $0.01 quarterly dividend. We are confident we will emerge from the pandemic in a position of relative strength. We remain hopeful for an end to the pandemic and thankful that our golf and outdoor lifestyle businesses support an active and healthy way of life that is compatible with a world of social distancing.\"GAAP and Non-GAAP ResultsIn addition to the Company's results prepared in accordance with GAAP, the Company provided information on a non-GAAP basis. The purpose of this non-GAAP presentation is to provide additional information to investors regarding the underlying performance of the Company's business without certain non-cash purchase accounting adjustments and amortization of intangibles related to the Company's acquisitions, non-recurring transaction and transition costs related to acquisitions, and other non-recurring costs, including costs related to the transition to the Company's new North American Distribution Center, implementation of a new IT system for Jack Wolfskin, severance costs related to the Company's cost-reduction initiatives, the $174 million non-cash impairment charge related to the Jack Wolfskin goodwill and trade name, as well as non-cash amortization of the debt discount related to the Company's convertible notes. The Company also provided sales information on a constant currency basis and information regarding its earnings before interest, taxes, depreciation and amortization expense, non-cash stock compensation expense, and the non-recurring and non-cash items previously mentioned (\"Adjusted EBITDAS\"). The manner in which this non-GAAP information is derived is discussed further toward the end of this release, and the Company has provided in the tables to this release a reconciliation of the non-GAAP information to the most directly comparable GAAP information. Summary of Second Quarter 2020 Financial ResultsThe Company announced the following GAAP and non-GAAP financial results for the second quarter of 2020 (in millions, except EPS):GAAP RESULTS NON-GAAP PRESENTATIONQ2 2020 Q2 2019 ChangeQ2 2020 Non-GAAPQ2 2019 Non-GAAPChangeNet Sales$297$447($150)$297$447($150)Gross Profit% of Sales$12241.1%$20746.3%($85)(520) bps$12542.2%$21247.5%($87)(530) bpsOperating Expenses$300$162$138$121$159($38)Pre-Tax Income/(Loss)($176)$36($212)$7$44($37)Income Tax Provision/(Benefit)($8)$7($15)$2$9($7)Net Income/(Loss)($168)$29($197)$5$35($30)Earnings/(Loss) Per Share($1.78)$0.30($2.08)$0.06$0.37($0.31)Q2 2020Q2 2019ChangeAdjusted EBITDAS$29$66($37)For the second quarter of 2020, the Company's net sales decreased $150 million (34%) to $297 million, compared to $447 million for the same period in 2019. This decrease reflects the negative impacts of the COVID-19 pandemic on both the golf equipment and soft goods operating segments globally. In response to the pandemic, government regulatory orders throughout much of the world resulted in the temporary closure of most of the Company's operations and retail doors as well as its customers' businesses for a significant portion of the second quarter. These closures were partially offset by a significant increase in the Company's e-commerce sales compared to the same period in 2019. Changes in foreign currency rates also had a $2 million negative impact on second quarter 2020 net sales.For the second quarter of 2020, the Company's gross margin decreased 520 basis points to 41.1% compared to 46.3% for the second quarter of 2019. Non-GAAP gross margin decreased 530 basis points to 42.2% compared to 47.5% for the second quarter of 2019. The decrease in gross margin is primarily attributable to the decrease in sales related to the COVID-19 pandemic, costs associated with idle facilities during the government mandated shut-down, a decrease in higher margin Company owned retail sales due to temporary store closures, an increase in lower margin sales of packaged sets, entry level golf balls, and pre-owned product in the golf equipment business, as well as increased tariffs on imports from China compared to the second quarter of 2019. This decrease was partially offset by the increase in the Company's e-commerce business.Operating expenses increased $138 million to $300 million in the second quarter of 2020 compared to $162 million for the same period in 2019. The increase is due to a $174 million pre-tax non-cash impairment charge related to the Jack Wolfskin goodwill and trade name. Excluding the impairment charge and other items mentioned above, non-GAAP operating expenses for the second quarter of 2020 were $121 million, a decrease of $38 million compared to the second quarter of 2019. This decrease was driven by the cost reduction efforts the Company began implementing in March 2020 in response to the COVID-19 pandemic, as well as lower variable expenses associated with the reduced sales.Second quarter 2020 loss per share was $1.78, compared to fully diluted earnings per share of $0.30 for the second quarter of 2019. Excluding the impairment charge and the other items mentioned above, the non-GAAP 2020 second quarter earnings per share was $0.06, compared to fully diluted earnings per share of $0.37 for the second quarter of 2019. The earnings for the second quarter of 2020 included foreign currency related gains of approximately $0.11 per share (including approximately $0.09 per share related to the settlement of a cross-currency swap program), compared to approximately $0.01 per share for the comparable period in 2019.Summary of First Half 2020 Financial ResultsThe Company announced the following GAAP and non-GAAP financial results for the first half of 2020 (in millions, except EPS):GAAP RESULTS NON-GAAP PRESENTATION1H 2020 1H 2019 Change1H 2020Non-GAAP1H 2019 Non-GAAPChangeNet Sales$739$963($224)$739$963($224)Gross Profit% of Sales$31843.0%$44546.2%($127)(320) bps$32243.6%$45647.4%($134)(380) bpsOperating Expenses$454$330$124$275$322($47)Pre-Tax Income/(Loss)($138)$94($232)$48$118($70)Income Tax Provision$1$17($16)$12$22($10)Net Income/(Loss)($139)$78($217)$36$96($60)Earnings/(Loss) Per Share($1.47)$0.81($2.28)$0.38$0.99($0.61)Q2 2020Q2 2019ChangeAdjusted EBITDAS$89$159($70)For the first half of 2020, the Company's net sales decreased $224 million (23%) to $739 million, compared to $963 million for the same period in 2019. This decrease reflects the negative impact of the COVID-19 pandemic on both the golf equipment and soft goods operating segments globally. This decrease was partially offset by a significant increase in the Company's e-commerce sales for the first half of 2020 compared to the same period in 2019. Changes in foreign currency rates had a $6 million negative impact on first half 2020 net sales.For the first half of 2020, the Company's gross margin decreased 320 basis points to 43.0% compared to 46.2% for the same period in 2019. Non-GAAP gross margin decreased 380 basis points to 43.6% compared to 47.4% for the first half of 2019. The decrease in gross margin is primarily attributable to the decrease in sales related to the COVID-19 pandemic, costs associated with idle facilities during the government mandated shut-down, a decrease in higher margin Company owned retail sales due to temporary store closures, an increase in lower margin sales of packaged sets, entry level golf balls, and pre-owned product in the golf equipment business, as well as increased tariffs on imports from China compared to the second quarter of 2019. In addition, first half 2019 gross margin was negatively impacted by the inventory step-up related to the Jack Wolfskin acquisition. The decrease in gross margin during the second quarter was partially offset by an increase in the Company's e-commerce business.Operating expenses increased $124 million to $454 million in the first half of 2020 compared to $330 million for the same period in 2019. The increase is primarily due to a pre-tax non-cash impairment charge related to the Jack Wolfskin goodwill and trade name. Excluding the non-cash impairment charge and other items mentioned above, non-GAAP operating expenses were $275 million for the second quarter of 2020, a decrease of $47 million compared to the first half of 2019. This decrease was driven by the cost reduction actions the Company began in March 2020 in response to the COVID-19 pandemic as well as lower variable expenses.First half 2020 loss per share was $1.47, compared to fully diluted earnings per share of $0.81 for the first half of 2019. Excluding the impairment charge and the other items mentioned above, first half 2020 non-GAAP fully diluted earnings per share was $0.38, compared to fully diluted earnings per share of $0.99 for the first half of 2019. The earnings for the first half of 2020 included foreign currency related gains of approximately $0.17 per share (including approximately $0.09 per share related to the settlement of a cross-currency swap program), compared to approximately $0.01 per share of hedging losses for the comparable period in 2019.Conference Call and WebcastThe Company will be holding a conference call at 2:00 p.m. Pacific time today to discuss the Company's financial results, outlook and business. The call will be broadcast live over the Internet and can be accessed at http://ir.callawaygolf.com/. To listen to the call, and to access the Company's presentation materials, please go to the website at least 15 minutes before the call to register and for instructions on how to access the broadcast. A replay of the conference call will be available approximately two hours after the call ends, and will remain available through 9:00 p.m. Pacific time on August 13, 2020. The replay may be accessed through the Internet at http://ir.callawaygolf.com/.Non-GAAP InformationThe GAAP results contained in this press release and the financial statement schedules attached to this press release have been prepared in accordance with accounting principles generally accepted in the United States (\"GAAP\"). To supplement the GAAP results, the Company has provided certain non-GAAP financial information as follows:Constant Currency Basis. The Company provided certain information regarding the Company's financial results or projected financial results on a \"constant currency basis.\" This information estimates the impact of changes in foreign currency rates on the translation of the Company's current or projected future period financial results as compared to the applicable comparable period. This impact is derived by taking the current or projected local currency results and translating them into U.S. dollars based upon the foreign currency exchange rates for the applicable comparable period. It does not include any other effect of changes in foreign currency rates on the Company's results or business.Non-Recurring and Non-cash Adjustments. The Company provided information excluding certain non-cash purchase accounting adjustments and amortization of intangibles related to the Company's acquisitions, non-recurring transaction and transition costs related to acquisitions, and other non-recurring costs, including costs related to the transition to the Company's new North American Distribution Center, implementation of a new IT system for Jack Wolfskin, severance costs related to the Company's cost-reduction initiatives, the $174 million non-cash impairment charge related to the Jack Wolfskin goodwill and trade name, as well as non-cash amortization of the debt discount related to the Company's convertible notes.Adjusted EBITDAS. The Company provides information about its results excluding interest, taxes, depreciation and amortization expenses, non-cash stock compensation expense, and the non-recurring and non-cash items referenced above.In addition, the Company has included in the schedules to this release a reconciliation of certain non-GAAP information to the most directly comparable GAAP information. The non-GAAP information presented in this release and related schedules should not be considered in isolation or as a substitute for any measure derived in accordance with GAAP. The non-GAAP information may also be inconsistent with the manner in which similar measures are derived or used by other companies. Management uses such non-GAAP information for financial and operational decision-making purposes and as a means to evaluate period-over-period comparisons and in forecasting the Company's business going forward. Management believes that the presentation of such non-GAAP information, when considered in conjunction with the most directly comparable GAAP information, provides additional useful comparative information for investors in their assessment of the underlying performance of the Company's business with regard to these items. The Company has provided reconciling information in the attached schedules.Forward-Looking StatementsStatements used in this press release that relate to future plans, events, financial results, performance, prospects, or growth opportunities, including statements relating to the Company's sales, future industry and market conditions, strength of the Company's brands, scale and global reach of the Company's products, expertise in the apparel sector, the continued impact of the COVID-19 pandemic on the Company's business, results of operations and financial condition and the impact of any measures taken to mitigate the effect of the pandemic, the Company's efforts to effectively manage its cost/expense reduction, capital allocation and liquidity, the Company's continued ability to improve and recover from the impact of the COVID-19 pandemic, and the creation of shareholder value are forward-looking statements as defined under the Private Securities Litigation Reform Act of 1995. The words \"believe,\" \"expect,\" \"estimate,\" \"could,\" \"should,\" \"intend,\" \"may,\" \"plan,\" \"seek,\" \"anticipate,\" \"project\" and similar expressions, among others, generally identify forward-looking statements, which speak only as of the date the statements were made and are not guarantees of future performance. These statements are based upon current information and expectations. Accurately estimating the forward-looking statements is based upon various risks and unknowns, including disruptions to business operations from additional regulatory restrictions in response to COVID-19 pandemic (such as travel restrictions, government-mandated shut-down orders or quarantines) or voluntary \"social distancing\" that affects employees, customers and suppliers; production delays, closures of manufacturing facilities, retail locations, warehouses and supply and distribution chains; staffing shortages as a result of remote working requirements or otherwise; uncertainty regarding global economic conditions, particularly the uncertainty related to the duration and impact of the COVID-19 pandemic, and related decreases in customer demand and spending; our level of indebtedness; continued availability of credit facilities and liquidity and ability to comply with applicable debt covenants; effectiveness of capital allocation and cost/expense reduction efforts, including the suspension of the quarterly dividend; continued brand momentum and product success; growth in the direct-to-consumer and e-commerce channels; consumer acceptance of and demand for the Company's and its subsidiaries' products; competitive pressures; any changes in U.S. trade, tax or other policies, including restrictions on imports or an increase in import tariffs; future consumer discretionary purchasing activity, which can be significantly adversely affected by unfavorable economic or market conditions; future retailer purchasing activity, which can be significantly negatively affected by adverse industry conditions and overall retail inventory levels; and future changes in foreign currency exchange rates and the degree of effectiveness of the Company's hedging programs. Actual results may differ materially from those estimated or anticipated as a result of these risks and unknowns or other risks and uncertainties, including the effect of terrorist activity, armed conflict, natural disasters or pandemic diseases, including expanded outbreak of COVID-19, on the economy generally, on the level of demand for the Company's and its subsidiaries' products or on the Company's ability to manage its operations, supply chain and delivery logistics in such an environment; delays, difficulties or increased costs in the supply of components or commodities needed to manufacture the Company's products or in manufacturing the Company's products; and a decrease in participation levels in golf generally, as well as during or as a result of the COVID-19 pandemic. For additional information concerning these and other risks and uncertainties that could affect these statements, the golf industry, and the Company's business, see the Company's Annual Report on Form 10-K for the year ended December 31, 2019 as well as other risks and uncertainties detailed from time to time in the Company's reports on Forms 10-Q and 8-K subsequently filed with the Securities and Exchange Commission. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. The Company undertakes no obligation to republish revised forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.About Callaway Golf CompanyCallaway Golf Company (NYSE: ELY) is a premium golf equipment and active lifestyle company with a portfolio of global brands, including Callaway Golf, Odyssey, OGIO, TravisMathew and Jack Wolfskin. Through an unwavering commitment to innovation, Callaway manufactures and sells premium golf clubs, golf balls, golf and lifestyle bags, golf and lifestyle apparel and other accessories. For more information please visit www.callawaygolf.com, www.odysseygolf.com, www.OGIO.com, www.travismathew.com, and www.jack-wolfskin.com.Contacts: Brian Lynch Patrick Burke(760) 931-1771CALLAWAY GOLF COMPANYCONSOLIDATED CONDENSED BALANCE SHEETS(Unaudited)(In thousands)June 30, 2020December 31, 2019ASSETSCurrent assets:Cash and cash equivalents$164,416$106,666Accounts receivable, net214,004140,455Inventories379,169456,639Other current assets82,97285,590Total current assets840,561789,350Property, plant and equipment, net149,618132,760Operating lease right-of-use assets, net189,381160,098Intangible assets, net521,275697,166Deferred taxes, net48,74673,948Investment in golf-related ventures90,13490,134Other assets19,94117,092Total assets$1,859,656$1,960,548LIABILITIES AND SHAREHOLDERS' EQUITYCurrent liabilities:Accounts payable and accrued expenses$204,980$276,300Accrued employee compensation and benefits29,45546,891Asset-based credit facilities55,551144,580Accrued warranty expense9,7799,636Current operating lease liabilities28,77226,418Long-term debt, current portion8,6537,317Income tax liability6,43012,104Total current liabilities343,620523,246Long-term debt628,851443,259Long-term operating lease liabilities172,093137,696Long-term liabilities90,54488,994Total Callaway Golf Company shareholders' equity624,548767,353Total liabilities and shareholders' equity$1,859,656$1,960,548CALLAWAY GOLF COMPANYCONSOLIDATED CONDENSED STATEMENTS OF OPERATIONS(Unaudited)(In thousands, except per share data)Three Months Ended June 30,20202019Net sales$296,996$446,708Cost of sales174,941239,891Gross profit122,055206,817Operating expenses:Selling80,166113,113General and administrative35,04935,423Research and development10,02013,082Goodwill and trade name impairment174,269—Total operating expenses299,504161,618Income/(loss) from operations(177,449)45,199Other income (expense), net1,834(9,093)Income/(loss) before income taxes(175,615)36,106Income tax provision (benefit)(7,931)7,208Net income/(loss)(167,684)28,898Less: Net loss attributable to non-controlling interest—(33)Net income (loss) attributable to Callaway Golf Company$(167,684)$28,931Earnings (loss) per common share:Basic($1.78)$0.31Diluted($1.78)$0.30Weighted-average common shares outstanding:Basic94,14194,074Diluted94,14195,891Six Months EndedJune 30,20202019Net sales$739,272$962,905Cost of sales421,543517,655Gross profit317,729445,250Operating expenses:Selling191,227232,434General and administrative65,74272,361Research and development23,26025,620Goodwill and trade name impairment174,269—Total operating expenses454,498330,415Income/(loss) from operations(136,769)114,835Other income (expense), net(801)(20,672)Income/(loss) before income taxes(137,570)94,163Income tax provision (benefit)1,22016,764Net Income/(loss)(138,790)77,399Less: Net loss attributable to non-controlling interest—(179)Net Income/(loss) attributable to Callaway Golf Company$(138,790)$77,578Earnings (loss) per common share:Basic($1.47)$0.82Diluted($1.47)$0.81Weighted-average common shares outstanding:Basic94,22594,377Diluted94,22596,153CALLAWAY GOLF COMPANYCONSOLIDATED CONDENSED STATEMENTS OF CASH FLOW(Unaudited)(In thousands)Six Months EndedJune 30,20202019Cash flows from operating activities:Net income (loss)$(138,790)$77,399Adjustments to reconcile net income (loss) to net cash used in operating activities: Depreciation and amortization18,35716,999 Lease amortization expense16,31315,279 Amortization of debt issuance costs1,8231,295 Debt discount amortization1,483— Inventory step-up on acquisition—10,703 Impairment loss174,269— Deferred taxes, net8,68410,514 Non-cash share-based compensation4,7946,964 Loss on disposal of long-lived assets123657 Unrealized net (gains) losses on hedging instruments(14,059)2,677Changes in assets and liabilities(93,318)(193,246)Net cash used in operating activities(20,321)(50,759)Cash flows from investing activities:Capital expenditures(25,097)(23,403)Note receivable, net of discount(5,234)—Acquisitions, net of cash acquired—(463,105)Proceeds from sales of property and equipment—15Net cash used in investing activities(30,331)(486,493)Cash flows from financing activities:Proceeds from issuance of convertible notes258,750—Proceeds from issuance of long-term debt9,766480,000Premium paid for capped call confirmations(31,775)—Debt issuance cost(9,119)(18,971)(Repayments of) proceeds from credit facilities, net(89,029)125,167Repayments of long-term debt(5,504)(2,325)Repayments of financing leases(206)(232)Exercise of stock options130—Dividends paid, net(1,891)(1,893)Acquisition of treasury stock(21,953)(27,394)Net cash provided by financing activities109,169554,352Effect of exchange rate changes on cash and cash equivalents(767)409Net increase in cash and cash equivalents57,75017,509Cash and cash equivalents at beginning of period106,66663,981Cash and cash equivalents at end of period$164,416$81,490CALLAWAY GOLF COMPANYConsolidated Net Sales and Operating Segment Information(Unaudited)(In thousands)Net Sales by Product CategoryNet Sales by Product CategoryThree Months EndedJune 30,DeclineNon-GAAP ConstantCurrencyvs. 2019(1)Six Months EndedJune 30,DeclineNon-GAAP ConstantCurrencyvs. 2019(1)20202019DollarsPercentPercent20202019DollarsPercentPercentNet sales:Golf Clubs$156,040$223,741$(67,701)-30.3%-29.8%$407,264$485,526$(78,262)-16.1%-15.6%Golf Balls53,90368,612(14,709)-21.4%-21.0%94,340130,446(36,106)-27.7%-27.2%Apparel36,30273,195(36,893)-50.4%-49.8%113,592169,441(55,849)-33.0%-32.0%Gear and Other50,75181,160(30,409)-37.5%-36.8%124,076177,492(53,416)-30.1%-29.3%$296,996$446,708$(149,712)-33.5%-33.0%$739,272$962,905$(223,633)-23.2%-22.6%(1) Calculated by applying 2019 exchange rates to 2020 reported sales in regions outside the U.SNet Sales by RegionNet Sales by RegionThree Months EndedJune 30,DeclineNon-GAAP ConstantCurrencyvs. 2019(1)Six Months EndedJune 30,DeclineNon-GAAP ConstantCurrencyvs. 2019(1)20202019DollarsPercentPercent20202019DollarsPercentPercentNet SalesUnited States$171,714$247,419$(75,705)-30.6%-30.6%$389,217$496,420$(107,203)-21.6%-21.6%Europe50,07481,630(31,556)-38.7%-37.5%146,793208,243(61,450)-29.5%-27.8%Japan24,64055,676(31,036)-55.7%-56.8%101,987128,904(26,917)-20.9%-22.0%Rest of World50,56861,983(11,415)-18.4%-15.3%101,275129,338(28,063)-21.7%-18.6%$296,996$446,708$(149,712)-33.5%-33.0%$739,272$962,905$(223,633)-23.2%-22.6%(1) Calculated by applying 2019 exchange rates to 2020 reported sales in regions outside the U.SOperating Segment InformationOperating Segment InformationThree Months EndedJune 30,DeclineNon-GAAP ConstantCurrencyvs. 2019(1)Six Months EndedJune 30,DeclineNon-GAAP ConstantCurrencyvs. 2019(1)20202019DollarsPercentPercent20202019DollarsPercentPercentNet SalesGolf Equipment$209,943$292,353$(82,410)-28.2%-27.7%$501,604$615,972$(114,368)-18.6%-18.1%Apparel, Gear and Other87,053154,355(67,302)-43.6%-43.0%237,668346,933(109,265)-31.5%-30.6%$296,996$446,708$(149,712)-33.5%-33.0%$739,272$962,905$(223,633)-23.2%-22.6%Income (loss) before income taxes:Golf Equipment$29,181$55,665$(26,484)-47.6%$87,801$125,658$(37,857)-30.1%Apparel, Gear and Other(11,711)11,314(23,025)-203.5%(15,510)34,033(49,543)-145.6%Reconciling items(2)(193,085)(30,873)(162,212)525.4%(209,861)(65,528)(144,333)220.3%$(175,615)$36,106$(211,721)-586.4%$(137,570)$94,163$(231,733)-246.1%(1) Calculated by applying 2019 exchange rates to 2020 reported sales in regions outside the U.S(2) Amount includes corporate general and administrative expenses and other income (expense) not utilized by management in determining segment profitability, as well as amortization expense of intangible assets from the acquisitions of OGIO,TravisMathew and Jack Wolfskin. In addition, the reconciling items for 2020 include (i) an impairment charge of $174.3 million related to Jack Wolfskin, (ii) the non-cash amortization of the debt discount on the convertible notes issued in May 2020, and (iii) certain non-recurring costs, including costs associated with the Company's transition to its new North America Distribution Center and the implementation of new IT systems for Jack Wolfskin, as well as $3.7 million of severance related to the Company's cost reduction initiatives. Reconciling items for 2019 represent certain non-recurring and non-cash costs, including costs associated with the acquisition of Jack Wolfskin and the amortization of the inventory step-up related to the Jack Wolfskin acquisitionCALLAWAY GOLF COMPANYSupplemental Financial Information and Non-GAAP Reconciliation(Unaudited)(In thousands)Three Months Ended June 30,20202019GAAPNon-Cash Intangible Amortization and Impairment Charges(1)Non-Cash Amortization of Discount on Convertible Notes(2)Other Non-Recurring Charges(3)Non-GAAPGAAPNon-Cash Acquisition Amortization(1)Acquisition & Other Non-Recurring Expenses(4)Non-GAAPGross profit$122,055$—$—$(3,314)$125,369$206,817$(5,336)$—$212,153Operating expenses, net299,504175,447—2,575121,482161,6181,2081,603158,807Other income (expense), net1,834—(1,499)—3,333(9,093)——(9,093)Income tax provision (benefit)(7,931)(8,195)(345)(1,355)1,9647,208(1,505)(369)9,082Net income (loss) attributable to Callaway Golf Company$(167,684)$(167,252)$(1,154)$(4,534)$5,256$28,931$(5,039)$(1,234)$35,204Diluted earnings (loss) per share:$(1.78)$(1.78)$(0.01)$(0.05)$0.06$0.30$(0.05)$(0.02)$0.37(1) Represents amortization expense of intangible assets from the acquisitions of OGIO, TravisMathew and Jack Wolfskin. In addition, 2020 includes an impairment charge of $174.3 million related to Jack Wolfskin, and 2019 includes the amortization of the inventory step-up related to the Jack Wolfskin acquisition(2) Represents the non-cash amortization of the debt discount on the convertible notes issued in May 2020(3) Represents certain non-recurring costs, including costs associated with the Company's transition to its new North America Distribution Center and the implementation of new IT systems for Jack Wolfskin, as well as $3.7 million of severance related to the Company's cost reduction initiatives(4) Represents certain non-recurring and non-cash costs, including costs associated with the acquisition of Jack WolfskinCALLAWAY GOLF COMPANYSupplemental Financial Information and Non-GAAP Reconciliation(Unaudited)(In thousands)Six Months Ended June 30,20202019GAAPNon-Cash Intangible Amortization and Impairment Charges(1)Non-Cash Amortization of Discount on Convertible Notes(2)Other Non-Recurring Charges(3)Non-GAAPGAAPNon-Cash Acquisition Amortization(1)Acquisition and Other Non-Recurring Expenses(4)Non-GAAPGross profit$317,729$—$—$(4,622)$322,351$445,250$(10,703)$—$455,953Operating expenses454,498176,626—2,816275,056330,4152,4166,326321,673Other income (expense), net(801)—(1,499)—698(20,672)—(3,896)(16,776)Income tax provision (benefit)1,220(8,466)(345)(1,711)11,74216,764(3,017)(2,351)22,132Net income (loss) attributable to Callaway Golf Company$(138,790)$(168,160)$(1,154)$(5,727)$36,251$77,578$(10,102)$(7,871)$95,551Diluted earnings (loss) per share:$(1.47)$(1.78)$(0.01)$(0.06)$0.38$0.81$(0.10)$(0.08)$0.99(1) Represents amortization expense of intangible assets from the acquisitions of OGIO, TravisMathew and Jack Wolfskin. In addition, 2020 includes an impairment charge of $174.3 million related to Jack Wolfskin, and 2019 includes the amortization of the inventory step-up related to the Jack Wolfskin acquisition(2) Represents the non-cash amortization of the debt discount on the convertible notes issued in May 2020(3) Represents certain non-recurring costs, including costs associated with the Company's transition to its new North America Distribution Center and the implementation of new IT systems for Jack Wolfskin, as well as $3.7 million of severance related to the Company's cost reduction initiatives(4) Represents certain non-recurring and non-cash costs, including costs associated with the acquisition of Jack WolfskinCALLAWAY GOLF COMPANYNon-GAAP Reconciliation and Supplemental Financial Information(Unaudited)(In thousands)2020 Trailing Twelve Month Adjusted EBITDAS2019 Trailing Twelve Month Adjusted EBITDASQuarter EndedQuarter EndedSeptember 30,December 31,March 31,June 30,September 30,December 31,March 31,June 30,2019201920202020Total2018201820192019TotalNet income (loss)$31,048$(29,218)$28,894$(167,684)$(136,960)$9,517$(28,499)$48,647$28,931$58,596Interest expense, net9,5459,0499,11512,16339,8721,0567049,63910,26021,659Income tax provision (benefit)2,128(2,352)9,151(7,931)9961,335(9,783)9,5567,2088,316Depreciation and amortization expense8,4729,4808,9979,36036,3094,9965,1867,9779,02227,181JW goodwill and trade name impairment———174,269174,269—————Non-cash stock compensation expense2,5133,4181,8612,94210,7343,5113,5553,4353,53014,031EBITDAS$53,706$(9,623)$58,018$23,119$125,220$20,415$(28,837)$79,254$58,951$129,783Acquisitions & other non-recurring costs, before taxes(1)3,0094,0901,5165,85614,4711,521(2,269)13,9866,93920,177Adjusted EBITDAS$56,715$(5,533)$59,534$28,975$139,691$21,936$(31,106)$93,240$65,890$149,960(1) In 2020, amounts represent certain non-recurring costs, including costs associated with the Company's transition to its new North America Distribution Center and the implementation of new IT systems for Jack Wolfskin, as well as $3.7 million of severance related to the Company's cost reduction initiatives. In 2019, amounts represent certain non-recurring transaction costs, including banker's fees, legal fees, consulting and travel expenses, and transition costs, including consulting, audit fees and valuations services associated with the acquisition of Jack Wolfskin, in addition to other non-recurring advisory fees.Callaway Golf Company Logo. (PRNewsFoto/Callaway Golf Company) (PRNewsfoto/Callaway Golf Company)CisionView original content to download multimedia:http://www.prnewswire.com/news-releases/callaway-golf-company-announces-second-quarter-2020-financial-results-the-companys-business-is-recovering-from-covid-19-more-quickly-than-expected-301108007.htmlSOURCE Callaway Golf Company"}]}