{"article": [{"url": "https://finance.yahoo.com/news/tencent-gains-26-billion-u-023038500.html", "published": 1598241800.0, "headline": "Tencent Gains $37 Billion After U.S. Reassures on WeChat Ban", "body": "(Bloomberg) -- Tencent Holdings Ltd. jumped the most in a month after White House officials are said to have reassured American businesses that a ban on its WeChat app won’t be as broad as feared.The WeChat owner rallied 5.8% at the close in Hong Kong Monday, making it the best performer on the benchmark Hang Seng Index, after people familiar with matter said the Trump administration is privately seeking to reassure U.S. companies including Apple Inc. that they can still do business with Tencent’s WeChat messaging app in China. In recent days, senior administration officials have been reaching out to some companies, realizing that the impact of an all-out ban on the popular app could be devastating for U.S. technology, retail, gaming, telecommunications and other industries, according to the people.Read more: Trump Team Reassures Apple, Others on Using WeChat in ChinaCompany management earlier this month sought to reassure investors that the executive order signed by President Donald Trump on Aug. 6 may apply only to WeChat’s overseas operations. The ban, which came amid efforts by the White House to curtail the rise of Chinese-owned technology giants like Huawei Technologies Co. and TikTok owner ByteDance Ltd., had erased roughly $66 billion from Tencent’s value, though today’s rebound means the stock has recouped all but $9 billion of those losses.What Bloomberg Intelligence SaysIntense lobbying by representatives of U.S. businesses such as Walmart, General Motors, Best Buy and Target reinforces the indispensability of WeChat for reaching consumers in China. The sales impact on Tencent from President Donald Trump’s WeChat ban may be minimal as the administration appears to be narrowing the scope of the order to protect U.S. businesses in China.- Vey-Sern Ling and Tiffany Tam, analystsClick here for the research.Spreads on Tencent’s dollar bond due 2030 tightened 2 basis points, according to credit traders in Hong Kong Monday morning, the most since August 11. Shares of Prosus NV, the Naspers Ltd. unit that holds 31% in Tencent, gained as much as 3.6%, while Naspers climbed 2.9%.Story continuesTrump ignited a furor after signing the order to ban U.S. entities from dealing with WeChat. Confusion reigned as investors grappled with the sweeping language of Trump’s order -- which bars “transactions” with the Chinese company -- that leaves the door open for the administration to extend it well beyond the service in America. Apple’s shares fell on fears the action could hurt sales of iPhones in its largest market after the U.S.Still, risks remain until details of the executive order are finalized. Senior administration officials are deliberating over the scope of the ban ordered by Trump, one of the people said, and the president could ultimately overrule anything they decide.Even if corporations are permitted to do business with WeChat, individuals may still face restrictions on using the app in the U.S. A group of U.S. WeChat users filed a complaint at the federal court in San Francisco Friday in an attempt to block the Trump administration from imposing a ban on the app, saying it would violate their rights.(Updates with Tencent’s closing share price from first paragraph.)For more articles like this, please visit us at bloomberg.comSubscribe now to stay ahead with the most trusted business news source.©2020 Bloomberg L.P."}]}