{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-vaccine-development-no-rush-expert-182357891.html", "published": 1598707880.0, "headline": "Coronavirus vaccine development 'is just like Diana Ross and The Supremes,' expert says", "body": "Some health experts are worried that the race for a coronavirus vaccine could lead to a vaccine becoming publicly available before it’s proven to be safe.“It’s just like Diana Ross and The Supremes,” Dr. Michael Saag, an associate dean for global health at the University of Alabama at Birmingham, said on Yahoo Finance’s The Ticker (video above). “You can’t hurry love and you can’t hurry vaccine development. The reason I say that is that we need the time to see if the vaccine actually works and we need to see if it’s safe.”Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases (NIAID), stressed that rushing a vaccine could do more harm than good.“The one thing that you would not want to see with a vaccine is getting an [emergency use authorization] before you have a signal of efficacy,” he told Reuters. “One of the potential dangers if you prematurely let a vaccine out is that it would make it difficult, if not impossible, for the other vaccines to enroll people in their trial.”President Trump, meanwhile, has tweeted that the FDA should “focus on speed” while telegraphing his desire that a coronavirus vaccine be ready by Election Day, November 3.‘Keep a firewall between science and politics’Experts have repeatedly refuted the idea that a safe, vetted vaccine could be ready as quickly as the president would like.“What we don’t want to do is rush things along so fast for obviously political reasons, as far as I can tell, to get it out there and then discover ‘wait, this vaccine doesn’t work like we thought it was going to work’ or worse, there are safety issues,” Saag said. “So Fauci is exactly right. We need to do this the right way and keep a firewall between science and politics.”President Donald Trump looks on as FDA Commissioner Stephen Hahn addresses the media during a press conference at the White Houseon August 23, 2020 in Washington, DC. (Photo by Pete Marovich/Getty Images)This isn’t the first time that health officials warned about the Trump administration’s influence on public health organizations.Last weekend, the Food and Drug Administration (FDA) granted emergency use authorization (EUA) for convalescent plasma as a means for treating COVID-19 after Trump insinuated that the FDA was slow-walking clinical trials as part of a “deep state” plot to hinder his chances at re-election.Story continuesIn a lengthy Twitter thread, FDA Commissioner Stephen Hahn said that the decision to issue an EUA was based solely on science. A few days later, the CDC created widespread alarm and confusion when the public health agency changed guidelines on coronavirus testing after pressure from administration officials.“We can’t really have politics interfering with what science needs to do,” Saag said. “It’s not going to work well. And it’s going to endanger all of us if we keep letting this bleeding happen from the political space into the science space. So let’s let everyone do their job and try to keep politics out of it.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Doctor casts doubt on COVID plasma treatment: ‘No breakthrough here’'We need to be prepared' for coronavirus surges, doctor warnsHow coronavirus ravaged a nursing home industry that was already 'in crisis'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}