{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-spikes-texas-arizona-florida-143433446.html", "published": 1593078140.0, "headline": "Americans 'are paying the price' for shoddy coronavirus response, doctor says", "body": "The spike in coronavirus cases in parts of the U.S. came as no surprise to many public health experts.Arizona, Texas, and Florida are three states, in particular, that reopened their economies sooner than others and are seeing record numbers of hospitalizations and cases.“We’ve seen a roughly 300% increase in the number of cases statewide, in ICU and hospital usage here in Austin and Houston,” Dr. Pritesh Gandhi, a primary care physician and internal medicine specialist in Austin, Texas, said on Yahoo Finance’s The Ticker (video above). “This is part of that first wave. We just frankly didn’t open in the right way. Didn’t embrace key public health principles and are paying the price for it right now.”Coronavirus cases keep climbing outside the U.S. (Graphic: David Foster/Yahoo Finance)‘An absence of leadership’Houston and Austin are both seeing major surges in hospitalizations, so much so that ICU bed usage is almost at full capacity in Houston.Gandhi, who is also running for the Democratic nomination in Texas’s 10th congressional district, blamed it on “an absence of leadership” at the federal and state level.“When this whole thing started, the governor in Texas turned to local cities and said ‘Hey, y’all make your own choices to do what’s safe for the folks in your city,’” Gandhi said. “And Austin did. They canceled a major event, South by Southwest. Houston canceled major events.”A rider gets thrown in the men's bull riding competition during the first day of competition of the Mesquite Championship Rodeo at Mesquite Rodeo Arena on June 6, 2020 in Mesquite, Texas. (Photo: Omar Vega/Getty Images)But then as things moved along, he added, “the governor wanted to take that control back. As cases worsened, the governor again is letting that go. So in this absence of leadership, folks really don’t know what to do. And whether this comes down to mandating masks statewide or whether it comes to schools not knowing how to open, what to do, what metrics to follow, there is literally no major guideline helping businesses and schools figure out what the basic steps are to open in a way that’s safe for the folks that use those services.”Texas had entered phase three of reopening prior to this uptick in cases, which allowed all businesses to reopen at 50% capacity. Although the state had not been experiencing as many coronavirus cases as other parts of the country at the time, public health experts warned that if they lifted restrictions too soon, it could lead to disaster.Story continues“I think that folks don’t quite understand what’s happening,” Gandhi said. “We are all becoming numb to these numbers and metrics. We have a record number of hospitalizations, record number of ICU beds used in Houston and in Austin. But folks are used to hearing that and therefore not responding in a way that is equivalent.”Coronavirus cases in the U.S. (David Foster/Yahoo Finance)‘Mostly vulnerable’ Americans most at riskGov. Ron DeSantis (R-FL) drew criticism after he implied that the rise in coronavirus cases was attributed to the high number of “overwhelmingly Hispanic” day laborers and agriculture workers.And federal officials are reportedly looking into whether Mexican migrants could be carrying the disease across the border.But Gandhi hit back at that notion, stating that it had more to do with socioeconomic inequalities than anything else.Bodega manager Rafael Perez wears a homemade face protector, fashioned from a water bottle, as he works in the Chinese Hispanic Grocery during the coronavirus disease (COVID-19) outbreak in the Lower East Side neighborhood of Manhattan, New York City, New York, U.S., April 2, 2020. REUTERS/Andrew Kelly“Let’s be upfront about what the president and the people that enable him want to do,” he said. “They want to point to border states, point to the increased cases in the Hispanic population, and tie a direct line to immigration to this country, and therefore pass policies similar to what the president did a couple days ago to limit immigration. ... The reality is this: In places like Austin, the Hispanic diaspora bears a disproportionate burden because when folks have to go back to work — in restaurants, service and hospitality, construction — it is people of color that overwhelmingly work those jobs here and don’t have the luxury to take off time like folks that are White, Asian, or elsewhere.”A report from the Commonwealth Fund found that counties with large black populations have faced higher case counts of coronavirus, higher mortality, and a faster pace of progression compared to counties with low black populations.The South is particularly vulnerable to the coronavirus. (Graphic: David Foster/Yahoo Finance)“It is mostly vulnerable Texans, mostly communities of color, folks who do not have a social safety net that are being pushed back to work, and because we haven’t played the long game here, because we haven’t invested in the social safety net, folks have an impossible choice to make,” Gandhi said. “Go to work sick, or stay at home and not get that paycheck. How do you afford food on the table? How do you get health care?”According to the Economic Policy Institute (EPI), people of color — which includes Blacks, Latinos, and Asians, account for 43% of all essential workers, even though they make up only 39.1% of the population.“These disparities are the same disparities we’re seeing in COVID,” Gandhi said. “It has nothing to do with immigration. It has everything to do with our social, legal, and economic disparities when it comes to health in this country.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:'No one should be shocked' by alarming rise in U.S. coronavirus cases, Obama-era health official saysCoronavirus spread is like 'lighting a campfire,' doctor explainsCoronavirus: Public health experts ranked 36 American activities based on riskRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}