{"article": [{"url": "https://finance.yahoo.com/news/ev-stock-grow-most-2025-124528417.html", "published": 1602230000.0, "headline": "Which EV Stock Will Grow The Most By 2025?", "body": "Every week, Benzinga conducts a sentiment survey to find out what traders are most excited about, interested in or thinking about as they manage and build their personal portfolios.Electric vehicle manufacturers and EV service companies have been in the spotlight for 2020. We recently asked over 800 Benzinga investors and traders which EV stock they believe has the most room to grow between now and 2025.Best EV StocksOver the next five years, which EV stock will have the largest percentage gain?Tesla Inc (NASDAQ: TSLA)Nikola Corporation (NASDAQ: NKLA)Nio (NYSE: NIO)Hyliion (NYSE: HYLN)ElectraMeccanica (NASDAQ: SOLO)Arcimoto (NASDAQ: FUV)Blink Charging (NASDAQ: BLNK)Workhorse Group (NASDAQ: WKHS)Spartan Energy (NYSE: SPAQ)About 44.5% of respondents told us Elon Musk’s Tesla would experience the largest percentage price per share gain by 2025. Our Benzinga EV insights team reported Tesla produced 82,727 vehicles in the second quarter — a decrease of 20% sequentially and 5% year-over-year — and delivered 90,891.Even considering production halts during the ongoing coronavirus pandemic, Tesla told investors it has the capacity to top 500,000 vehicle deliveries in 2020.Meanwhile, Nio received the second most votes of confidence from readers: 17.2% said they’d back the Shanghai-based EV maker to grow the most by 2025. With second-quarter revenue of $526,381,000, higher by 139.54% from the same period last year, Nio continues to garner investor’s attention in the EV space.Where investors and traders told us they are most skeptical: only 2.2% of readers believe ElectraMeccanica will have the largest percentage price per share increase by 2025. Arcimoto drew the least confidence from investors and traders with 1.9% of support.Looking forward, more news from the EV space remains in store for 2020. Notably, Spartan Energy Acquisition Corp and Fisker are set for an Oct. 28 special meeting to approve a merger, potentially creating a new competitor in the EV market. Story continuesAt the time of publication, the EV stock from our study trading at the highest price per share is Tesla at $425 per share. The stock trading at the lowest price per share is Spartan Energy at $14 per share.This study was conducted by Benzinga in August 2020 and included the responses of a diverse population of adults 18 or older. Opting into the survey was completely voluntary, with no incentives offered to potential respondents. The order of survey answers were randomized for each respondent. The study reflects results from over 800 adults.See more from BenzingaOptions Trades For This Crazy Market: Get Benzinga Options to Follow High-Conviction Trade IdeasWhich Social Media Stock Will Grow The Most By 2025?Which Video Game Console Maker's Stock Will Grow The Most By 2025?© 2020 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."}]}