{"article": [{"url": "https://finance.yahoo.com/news/redskins-name-change-push-is-a-reminder-nfl-sponsor-pressure-gets-results-114154762.html", "published": 1594277360.0, "headline": "Redskins name change push is a reminder: NFL sponsor pressure gets results", "body": "There have been calls for the Washington Redskins to change the team name for decades.In 1992, Native American activist Suzan Shown Harjo, who is of Cheyenne and Muscogee ancestry, challenged the team’s trademark in court on the basis that it was disparaging. She won in 1999, but the team then won its appeal. In 2014, the U.S. Patent and Trademark Office cancelled the team’s trademark on the grounds that it disparages Native Americans. The team appealed by filing a brief listing a slew of other vulgar or scandalous trademarks, in an effort to suggest the hypocrisy of revoking the Redskins trademark.Through all of this, Dan Snyder, who has owned the team since 1999, has staunchly refused to consider a name change. In 2013, he famously told USA Today, “We'll never change the name. It’s that simple. NEVER—you can use caps.”Never say never. The Redskins announced on July 3 that it will conduct a “thorough review” of the name.That isn’t happening because the team decided it was finally time to listen to the chorus of critics on social media; it’s happening because NFL corporate sponsors joined the chorus.The first mover was FedEx, naming rights sponsor of the Redskins stadium since 1998 and the “official delivery service sponsor” of the NFL since 2000. FedEx Chairman and CEO Fred Smith is also a minority owner of the team.On July 2, FedEx publicly asked the team to change its name, one week after 87 financial firms and shareholder groups sent letters to FedEx, Nike, and PepsiCo urging them to end their relationship with the Redskins unless the team name changes.This is typical of how change usually gets forced in U.S. professional sports. Only once corporate sponsors take action does it raise alarms for the leagues, because it represents a threat to the business. The NFL, which reaped nearly $16 billion in revenue in 2019, is the biggest cash cow in American pro sports. It is a business first, and Commissioner Roger Goodell’s primary job is to grow the league’s revenue every year for its franchise owners.Story continuesRedskin fans wait in line outside the FedEx Field stadium before the start of a draft day party in Landover, Maryland April 28, 2012. REUTERS/Benjamin MyersOn the day of FedEx’s announcement, Nike, the official apparel sponsor of the NFL, quietly removed all Redskins merchandise from its website.After the team’s July 3 announcement that it will review its name, PepsiCo put out a statement saying that it has been in talks with the NFL and the Redskins for “a few weeks” on the name issue and believes “it is time for a change.”In the days since then, big names in e-commerce have taken action similar to Nike’s: Walmart, Target, and Dick’s Sporting Goods, not official NFL sponsors, all pulled Redskins merchandise from their websites. Now three minority owners of the Redskins, including Smith, have reportedly hired an advisory firm to look into selling their stakes, which amount to 40% ownership; some onlookers see it as a tactic to push the NFL to get Snyder to sell.And on July 8, another big domino fell: Amazon, which in April extended its deal to live-stream Thursday Night Football games, pulled Redskins merchandise from its site.A similar situation developed in 2017, when a slew of NFL players followed Colin Kaepernick’s lead and began kneeling during the playing of the National Anthem to protest police brutality, prompting Twitter tirades from President Trump criticizing the NFL and the protests. The focus quickly shifted to NFL sponsors: Nike, Under Armour, Ford, Hyundai, Anheuser-Busch InBev, and Bose all released statements on the issue.Many of those sponsors equivocated in their statements, but Nike appeared to take a clear side in support of the protests, saying: “Nike supports athletes and their right to freedom of expression on issues that are of great importance to our society.” By the end of the season, the protests faded and Trump moved on, but Nike made its stance more overt at the start of the next NFL season, when it launched a new ad campaign with Kaepernick.As the sports world awaits action from the Redskins and debates new names, the Cleveland Indians indicated in a statement on July 3 that the team is reviewing its name. In the NHL, the Chicago Blackhawks went in a different direction: That team will keep its name, which honors a Native leader, Black Hawk of the Illinois Sac & Fox Nation.Meanwhile, sports betting sites already have odds up on which sports team will be the first to change its name. The Redskins, Kansas City Chiefs, Indians, and Atlanta Braves are all on the list.—Daniel Roberts is an editor-at-large at Yahoo Finance and focuses on sports business. Follow him on Twitter at @readDanwrite.Read more:From Aunt Jemima to Uncle Ben, a reckoning for racist brand names and logosNASCAR exec says Bubba Wallace has thrived 'under intense scrutiny'NASCAR's only black driver Bubba Wallace changed the sport forever in 2 daysReebok ends its CrossFit sponsorship over CrossFit CEO's tweet about George FloydNike is setting the tone for sports brands in its response to the George Floyd protestsDrew Brees on potential return of NFL kneeling protests: 'I will never agree with anybody disrespecting the flag'Every pro sports league’s current plan to return from coronavirus lockdown"}]}