{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-heres-what-has-happened-so-far-to-the-3-trillion-in-pandemic-aid-201149122.html", "published": 1592839160.0, "headline": "Coronavirus stimulus: Here’s what has happened so far to the $3 trillion in pandemic aid", "body": "Much of the debate around another coronavirus stimulus bill, or phase 4, has centered around how the money from the first three phases has been spent.“We have directly appropriated $3 trillion,” Sen. Pat Toomey (R-PA) said in a recent Yahoo Finance interview. With the Federal Reserve’s lending power added in, he said, the U.S. government actually has around $6 trillion in spending power and “most of it isn’t out the door yet.”Toomey is right that much of the Federal Reserve’s impact hasn’t yet been fully felt in the economy. But the money sent to other areas – such as the $1,200 checks sent to Americans and forgivable loans to small business – is long out the door.Over a remarkable few weeks in March, Washington passed a series of bills, including an $8 billion phase 1 deal signed into law on March 6, followed by a slightly larger phase 2 deal a couple weeks later, and then the mammoth $2 trillion phase 3 deal that was made law by March 27.President Donald Trump signs the CARES act, a $2 trillion rescue package to provide economic relief amid the coronavirus outbreak, on March 27. (JIM WATSON/AFP via Getty Images)Another $484 billion went out the door in April in additional funds for small business loans and hospitals.President Trump has pushed for another measure later this summer while Senate Majority Leader Mitch McConnell has taken a wait-and-see approach to actually drafting the bill.Democratic presidential candidate Joe Biden wants action sooner. In a speech last week the former vice president addressed Trump directly, asking him not to “let the support from the CARES Act expire next month while people are still hurting.”The Democratic-led House of Representatives passed a bill in May, the HEROES Act, with a $3 trillion price tag, but the Senate is unlikely to even consider the legislation.Here’s a rundown of what we know about how much of the $3 trillion has already been spent and what is still waiting to go out the door.Coronavirus checks: $267 billionThe Trump administration has often touted how many of their relief programs were up in running in “record time” – and none more so than the so-called economic impact payments of up to $1,200 for nearly every American which are now largely spent.Story continuesThis is how The Economic Impact Payment checks will look like. Photo: U.S. Secret ServiceTreasury Secretary Steven Mnuchin recently announced that 159 million checks, worth more than $267 billion, had been sent out. The money has now gone to every American for whom the IRS has information on file. About 12 million people haven’t gotten their cash and may be at risk of never getting it unless they log in and send their information to the IRS.A range of Democratic figures – including former presidential candidates like Sen. Kamala Harris, Andrew Yang and Rep. Tim Ryan – have all pushed for more checks. One idea is a direct payment as often as every month throughout the pandemic. According to Ryan, a failure to send more checks “could create a cascading effect of serious decline and lock us into a deep recession or into a depression.”Republicans have been skeptical of any such plan. Mnuchin recently promised that “we are going to seriously look at whether we want to do more direct money,\" but added that his focus was on initiatives that are \"more targeted on getting people back to work.\"On Monday, during a Scripps interview, Trump appeared to back another direct payment for Americans.Enhanced unemployment benefits: $268 billionAnother $268 billion was put aside in March for what Senate Minority Leader Chuck Schumer called “unemployment on steroids.”Speaker of the House Nancy Pelosi and Senate Minority Leader Chuck Schumer during a socially distanced press conference in April. (Bill Clark/CQ-Roll Call, Inc via Getty Images)The law expanded eligibility and gave an additional $600 per week in unemployment benefits for those out of work on top of their existing benefits. The provisions are controversial to some who say the government is paying some people more to stay home rather than return to work.The House’s HEROES Act proposes extending the benefit into 2021 but, as it now stands, the benefit is set to expire July 31.The CARES Act also provides additional billions for food stamp programs. Those benefit increases are also temporary but will continue as long as federal and state declarations of emergency or disaster remain in place.The Paycheck Protection Program: $660 billionAs of June 19, the PPP has given out over $514 billion in forgivable loans to small businesses, but demand has slowed, raising questions about whether the remaining funds will ever be spent. Over $120 billion remains untapped by small businesses.Small Business Administrator Jovita Carranza (left) and Treasury Secretary Steven Mnuchin have overseen implementation of programs like the PPP. (REUTERS/Tom Brenner)Businesses like Shake Shack and the L.A. Lakers have returned their PPP money and money flowing into the program (via cancelled loans, duplicate loans, and loans that have been paid off) has been almost equal to new loans given out. On May 16, the program had given out about $513 billion in loans, and a month later the total is only slightly higher.Many businesses that received forgivable loans have likely spent the money. The loans were designed to cover 8 weeks of payroll and operating costs; the lion’s share of them went out over two months ago before the PPP funds were was exhausted.Congress recently passed a bill to allow small businesses more flexibility in using the loans. Lawmakers also want further action including allowing the smallest businesses to apply for a second loan.A range of other help to businesses: Over $500 billionAnother giant chunk of the CARES Act was $454 billion to support new Federal Reserve lending facilities. Toomey, in March, said it was “the biggest thing we'll see from this whole thing,” because the money can be leveraged almost 10 times to give out somewhere around $4 trillion in loans to businesses, states, and cities.Federal Reserve Chair Jerome H. Powell during a speech in March. (Mark Makela/Getty Images)The maneuver, which has been called a Magic Money Machine, is powerful but has taken a relatively long time to get rolling when compared with the other relief programs.The CARES Act also allocated an additional $56 billion for direct aid to the airline industry and another loan program.The Fed opened its much-watched Main Street Lending program – focused on smaller businesses – just last week. It’s also still considering changes like whether or not to include nonprofits like universities and charitable organizations.The Fed has stood up a range of other facilities covering everything from municipalities to big businesses.In April, the Fed announced that it would be injecting $2.3 trillion into the U.S. economy with different methods with more to come.Aid to states, tax cuts, and other provisionsThe CARES Act also established a $150 billion relief fund for states and $153 billion for health related spending.Each state is insured at least $1.25 billion and that money is available but some of the relief has reportedly been held up by gridlock at the state level.On aid for testing, Senators Schumer and Patty Murray (D-WA) sent a letter this week claiming the Trump administration still has billions in funding for coronavirus testing that hasn’t yet been distributed.There’s also over $250 billion in the CARES Act for business and individual tax cuts that will remain in effect until at least the end of the year. Additional provisions, from $10 billion for the postal service to money for educational institutions, is still in various stages of disbursement.Meanwhile, the timeline for another stimulus measure keeps being pushed farther back. The Senate is in session for two more weeks but few in Washington expect movement with other priorities – like policing reform – expected to be center stage between now and the July 4 recess.After that, the Senate is scheduled to be away until July 20. McConnell is reportedly working with the White House on a bill in the $1 trillion range he would likely unveil in late July.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:One key senator argues against more stimulus: No need to ‘load the money cannon' againCory Booker calls on lawmakers to get 'their act together' on new coronavirus stimulusCoronavirus stimulus checks: What would need to happen before a second roundRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}