{"article": [{"url": "https://urldefense.com/v3/__https://finance.yahoo.com/news/amazon-earnings-q2-2020-201101073.html__;!!Op6eflyXZCqGR5I!WBA_ntTka_rSVPthlhCfiuIvnv-8cIc-AHG-xVrGHTL3BYCD2CSk5tYctUkF1bQ$", "published": 1596127760.0, "headline": "Amazon Q2 earnings blow past estimates as coronavirus buying boosts revenue, profit", "body": "Amazon (AMZN) posted second quarter earnings on Thursday that blew away Wall Street estimates, bolstered by consumer trends during the coronavirus pandemic that have catapulted the tech giant into one of the crisis’ biggest beneficiaries.The company’s results are even more impressive given that it acknowledged spending over $4 billion during the quarter on COVID-19 related costs. Here are the results compared to estimates from consensus compiled by Bloomberg:GAAP earnings per share: $10.30 vs. $1.51 expectedRevenue: $88.9 billion vs. $81.24 billion expectedThe quarter’s performance was boosted by operating cash flow that surged 42% to $51.2 billion for the trailing twelve months, compared with $36.0 billion comparable year-ago period. Net sales soared 40% compared with $63.4 billion a year ago, and Amazon’s Web Service (AWS) — the company’s massive cloud operation — saw 29% growth as more companies shifted to working remotely.Patrick Moorhead, president and principal analyst at Moor Insights and Strategy, noted that AWS’s growth during the quarter was “larger than the entire annual revenue of many cloud plays. AWS is well on its way to creating an annualized, $40B revenue company. This makes AWS larger than Salesorce.com and SAP.”Meanwhile, Amazon also said it plowed over $9 billion into capital projects, and saw its grocery delivery capacity skyrocket by more than 160% amid a threefold spike in online grocery sales during the quarter.“We’ve created over 175,000 new jobs since March and are in the process of bringing 125,000 of these employees into regular, full-time positions,” CEO Jeff Bezos said in a statement.“And third-party sales again grew faster this quarter than Amazon’s first-party sales. Lastly, even in this unpredictable time, we injected significant money into the economy this quarter, investing over $9 billion in capital projects, including fulfillment, transportation, and AWS,” he added.A surging stockStory continuesThe stock — which rallied by over 6% in after-hours trading — has been on a tear since the coronavirus pandemic resulted in widespread lockdowns, with home-bound consumers flocking to the website for their needs. Year to date, Amazon has rallied by over 63%, far outpacing the S&P 500 Index.Amazon’s results boosted the net worth of Bezos, the world’s richest person, by almost $10 billion to $189.5 billion, according to Bloomberg’s Billionaires Index data. The billionaire is his company’s single largest individual stockholder, owning over 11% of the shares outstanding.Amazon has notched multiple consecutive record closes — along with the other cohorts within the high-flying “FAANG” tech stocks that include Facebook (FB), Amazon (AMZN), Apple (AAPL), Netflix (NFLX) and Alphabet’s Google (GOOG).According to Q3 guidance provided by the company, net sales for the next quarter are expected to check in between $87 billion and $93 billion, a 24% - 33% gain from the comparable period in 2019. Coronavirus-related spending is seen topping $2 billion in Q3, Amazon said, on operating income that is expected to fall within a $2 billion to $5 billion range.Daniel Salmon, an analyst at BMO Capital Markets who ranks Amazon at No. 4 among a “mega cap pecking order” of top stocks, said this week that the stock’s “long-term opportunity is stronger than ever, and we also continue to see outperformance over the next 12 months.”However, he added that the bank was “cautious” given the recent surge, and the potential for Amazon to ramp up investment spending.Bezos goes to congressThe Q2 report comes on the heels of Bezos testifying before Congress for the first time ever Wednesday afternoon. The billionaire, who is usually able to control the narrative over the technology and retail behemoth, found himself on the defensive after being asked about Amazon’s use of third-party seller data.When asked if customer information is used for Amazon’s benefit, Bezos said the company restricts this, but added: \"I can't guarantee that the policy hasn't been violated” — a response that raised eyeballs among market participants.Yahoo Finance’s The Market Wake-UpJavier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}