{"article": [{"url": "https://finance.yahoo.com/news/this-is-where-the-future-is-going-amazon-executive-on-2-billion-climate-pledge-fund-223437269.html", "published": 1592934140.0, "headline": "'This is where the future is going:’ Amazon exec on $2 billion Climate Pledge Fund", "body": "Amazon (AMZN) launched a $2 billion venture capital fund Tuesday to invest in technologies and services aimed at reducing greenhouse gas emissions. Speaking to Yahoo Finance, Amazon’s Head of Worldwide Sustainability Kara Hurst said the move was yet another step to use the e-commerce giant’s “scale for good” as it sets aggressive targets to become carbon neutral by 2040.“This is where the future is going, this is where our products and services are needed, and the fund is another signal on the investment that we’re willing to make,” said Hurst, on Yahoo Finance’s Ticker.The Climate Pledge Fund will invest in companies across multiple sectors, though its initial focus will be on transportation and logistics; energy generation, storage, and utilization; manufacturing and materials; circular economy; and food and agriculture, Amazon said.The fund is the latest step by the Seattle-based company to reduce its carbon footprint amid explosive growth in its e-commerce and cloud computing business. Last September, the company established the Climate Pledge, aiming to reach its goal of carbon net zero by 2040, a decade ahead of the carbon reduction goals set forth by the Paris Climate Agreement.In a statement Tuesday, Chief Executive Jeff Bezos said the money would from the fund would go to “visionary entrepreneurs and innovators” helping companies reduce their carbon footprints.“Companies from around the world of all sizes and stages will be considered, from pre-product startups to well-established enterprises,” Bezos said. “Each prospective investment will be judged on its potential to accelerate the path to zero carbon and help protect the planet for future generations.”Just last week, Amazon announced Verizon Communications (VZ), the parent company of Yahoo Finance, Infosys (INFY), and Reckitt Benckiser Group (RBGLY) will also be joining the Climate Pledge.Amazon’s latest sustainability report highlights the challenges the company faces, juggling sustainability with global growth. While the company’s carbon intensity, the amount of carbon emitted per unit of energy consumed, dropped 5% in the last year, Amazon still increased its carbon footprint by 15% in 2019. That came on the back of net sales that increased 22%.Story continues“That’s a good early indication. As we’re growing as a business, we’re still decarbonizing while we grow,” Hurst said.Amazon has already announced 91 renewable energy projects around the world, putting the company on path to run on 100% renewable energy by 2025, five years ahead of its 2030 target. It has also set out to slash the carbon footprint for its shipments by 50% in that timeframe. Hurst said the company’s sustainability efforts have eliminated 33% of waste out of Amazon packaging since 2015, through its program Frustration Free Packaging, eliminating the use of 1.5 billion boxes.Rows of Amazon Prime delivery vans are stored in the lots at the Cox Automotive Inc. Manheim Pittsburgh vehicle auctioning location in Cranberry Township, Pa., Wednesday, May 13, 2020. The corporation announced earlier this week it will furlough hundreds of workers here and more at it's other locations around the country due to the COVID-19 pandemic. (AP Photo/Keith Srakocic)“That is a package solution for our customers that minimizes waste, so no twist ties or clam shells, 100% recyclable, no printing on the box. We’ve expanded that and really driven in what we call ship in own container, when we don’t put an Amazon overbox over a product so it might come to you with just a label on it,” Hurst said.Concerns about environmental waste have only grown amid the COVID-19 pandemic and stay-at-home measures that led to a surge in online sales and deliveries. In March alone, the heigh of the pandemic in the U.S., Amazon’s website saw 2.5 billion visitors, a 65% jump from the same period last year, according to online research company Comscore. Revenue in the first-quarter jumped 26%.Amazon has faced increasing pressure from employees to set more aggressive targets on climate. Earlier this year, more than 350 employees, part of Amazon Employees for Climate Justice, violated their communications policy to raise concerns about the company’s business with oil and gas companies.Hurst said the company aims to reach carbon neutral by 2040, in part through carbon offsets.“We don’t see this as an ‘either or situation,’ but a ‘both and,’” Hurst said. “We don’t have a number on exactly what we think we’ll need over the next 20 years, but we’ll focus primarily right now and for the short term on decarbonizing our own company.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaUniversities brace for a permanent wave of school closures as coronavirus pushes schools to brink‘It’s driving up heat density within data centers:’ Why AI and 5G are contributing to climate concernsInsurance industry looks to update risk models as climate risks escalateLarry Summers: Pandemic marks a ‘fairly profound structural change’ in economy"}]}