{"article": [{"url": "https://finance.yahoo.com/news/this-3-billion-online-education-company-is-seeing-a-paradigm-shift-due-to-coronavirus-111622405.html", "published": 1595399060.0, "headline": "This $3 billion online education company is seeing a 'paradigm shift' due to coronavirus", "body": "As more and more colleges weigh their options for adding online education in the fall, one online ed company is reaping the benefits of the shift away from lecture halls.Industry leader 2U (TWOU) helps big name universities like Harvard, Massachusetts Institute of Technology and dozens of others offer educational programs online and as its CEO explained to Yahoo Finance Tuesday, business is booming.“Over the last three months, we’ve spoken to more presidents and provosts than we had in our entire 12-year history,” CEO Chip Paucek told Yahoo Finance’s YFi PM. “So this is definitely a paradigm shift moment for online ed without question.”As Paucek highlights, many colleges had been caught off guard when the coronavirus pandemic first hit back in March. Shifting to online classes for many meant little more than a Zoom video conference with a professor. With 2U’s tech, the company is offering the prospect of offering a learning experience that goes beyond that experience in the spring.“We love Zoom,” Paucek said. “Zoom has been a great partner for 2U, but you have to have a sort of curated path of content for students to flip the classroom and allow students to experience high quality content on their own time in a curated manner from the faculty member so when they come to class it’s really engaging.”NEW YORK, NY - MARCH 13: Employees at 2U make and distribute online courses for a consortium of universities, on March 13, 2013 in New York, New York. This fall, the group will launch a pilot program allowing students at consortium schools to take online courses for credit among the various institutions. The courses are being filmed, created and managed by 2U which works out of this industrial-looking space on Chelsea Piers. (Photo by Melanie Stetson Freeman/The Christian Science Monitor via Getty Images)Adoption of that model has ramped up in recent weeks. Earlier this month, the company recently announced onboarding 40 classes at Amherst College for the upcoming fall semester. If others are to follow, the market opportunity in the more than $2 trillion higher education space is rather large.That said, as a recent market note from Jefferies initiating coverage on 2U with a Buy rating points out, the company has not been able to string together more than two consecutive quarters of EBITDA profitability. In fact, the company reported in the first quarter that costs continue to rise faster than revenue, at 44% versus 56%, respectively, as its cash position dwindled by nearly $32 million down to just $157 million.Story continuesThat said, in their initial estimation Jefferies believes the company is operating from a position of strength as a pure play in the online higher education space. Furthermore, the equity analysts there suggest a price target of $50 a share, given even a more conservative multiple than the education company has garnered in the past. Jefferies says its price target implies a multiple of just 3.9-times revenue in 2021, which would be below the historical average 2U has garnered at 4.9-times sales implying a $61 share price.As the Jefferies note last week summarized, “The three reasons we like this stock are 1) 2U’s strong competitive positioning within the under-penetrated digital higher education space, 2) improving revenue concentration and cash burn that caused the stock to sell-off in 2019, and 3) the accelerating digital transformation in higher education brought about by COVID-19.”The $50 price target might represent another 12% to run for 2U, but the stock has seen muted upside relative to its online counterpart in Zoom. Representing the shift to working remote, Zoom shares have rallied about 290% year-to-date. Granted 2U is not similarly profitable, the stock has only rallied 90% over the same period.For his part, Paucek says the company is being careful about managing profitability amidst the opportunity the pandemic presents.“As we think about growth in the future, we’re really balancing growth with profitability and we’re being careful with how we’re selecting new opportunities to pursue,” Paucek said. “I don’t think we’ve ever been this well positioned ... we do think this is a really large long-term opportunity, it’s a global story it’s not just a U.S. story.”While a large portion of the online programs 2U offers with some of its larger education partners so far remains limited to coding bootcamps and other niche programs, the company is launching an undergraduate degree program with the London School of Economics in October that will represent the company’s first of its kind.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Netflix co-founder brushes off NBC's new Peacock streaming competitorSmall US towns are neglected from coronavirus relief and it's a 'slap in the face': Georgia mayorWhy Costco could see a lasting boost from coronavirus panic buying"}]}