{"article": [{"url": "https://finance.yahoo.com/news/how-wall-street-strategists-make-sense-of-stock-market-selloff-morning-brief-100145915.html", "published": 1599628160.0, "headline": "How strategists are making sense of the market selloff: Morning Brief", "body": "Wednesday, September 9, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeStocks slid again on Tuesday.After dropping hard on Thursday and Friday last week, the U.S. stock market began a holiday-shortened week on Tuesday on a similarly downbeat note.On Tuesday, all three majors fell with the Nasdaq suffering the largest losses. The tech index dropped 4.1% and officially entered correction territory with its total decline from recent highs hitting 10%. And from the S&P 500’s record closing high last Wednesday, the benchmark index is now off just less than 7%.Over the holiday weekend, the Morning Brief’s inbox filled up with commentary from strategists across Wall Street trying to make sense of how the market went from euphoric record highs to a messy correction in just a few days.Many strategists cited reporting from the Financial Times and The Wall Street Journal — among other outlets — who uncovered the role SoftBank played in buying call options on major U.S. tech firms that resulted in their share prices getting rapidly bid up.The short outline of this story is that aggressive bets by SoftBank that the share price of stocks like Amazon (AMZN), Microsoft (MSFT), Alphabet (GOOGL), and Tesla (TSLA) — stocks the firm held positions in according to a filing in August — would rise created forced buyers on the way up and forced sellers on the way down.Though as Mike Wilson, an equity strategist at Morgan Stanley, said in a note Tuesday, the “selloff was technical, the trigger was not.”In other words, while SoftBank may have warped the options market into an offsides situation where forced buyers and forced sellers of stocks created synthetic volatility, the economic backdrop for this decline backs up a case for lower stock prices.“Most are aware of the significant call buying that led to the August rally and last week’s sharp decline in tech stocks,” Wilson writes. “We think the trigger was fundamental in nature as the market began to contemplate higher back end rates as fiscal stimulus passes, the economy continues to reopen, and the election is decided.”Story continuesWilson sees the combination of further progress on a vaccine, the election, stimulus, avoiding additional shutdowns in the U.S. economy, as well as the Fed’s new inflation framework as setting the market up for higher Treasury yields. And coming off a summer in which earnings revisions and a re-rating of the market’s multiple higher boosted stock prices, higher rates could challenge the valuation picture.The quick reversal in the market’s fortune last week also had some investors contemplating a tech bubble-like change in the market, especially with the center of this stress coming from stocks leading the tech sector. But Oliver Jones, a strategist at Capital Economics, is not at all convinced of this thesis.“Even if we see further bouts of volatility in the big tech stocks in the coming weeks, we would not interpret this as a sign that a major dot com-style tech bubble is about to burst and drag the rest of the market down with it, for two key reasons,” Jones writes.“First...a significant chunk of the outperformance of big tech firms has been driven by fundamentals. While options market shenanigans may have contributed a bit lately, the main catalyst for their rally is simply the fact that their businesses have done extremely well, in both absolute and relative terms, during the coronavirus crisis. That has not changed in the past week.“Second, in contrast to the dot com era, investors are fairly downbeat about almost everything outside of big tech,” Jones adds, citing volume in options connected to the broader indices which suggest investors remain focus on protecting themselves should we endure a prolonged market selloff rather than throwing caution to the wind.In short, the only similarity between this last few days’ decline and the tech bubble is that tech stocks are involved.Over at JPMorgan, strategists John Normand and Federico Manicardi note that the importance of big tech in this rally creates a scenario where this selloff gets even more attention that you might otherwise expect investors to pay to a ~7% drop in the S&P.“The past few days’ drop in global equities is the third, mild correction since global markets bottomed in late March,” Normand and Manicardi write, “but it will probably animate more discussions than previous episodes for one reason: the epicenter of Big Tech represents the greatest concentration issue that either Equity or Credit markets have faced in 50 years.”“In constructing a risk scenario for this sector, which would have huge consequences for country and currency allocations in global portfolios, it is easy to envision the elements of the most perfect storm,” they add.“These would include: higher interest rates that harm long-duration assets; a vaccine-driven reversal of the work-from-home fixation; and a regulatory response ranging from the relatively routine (fines) to the more existential (constraints on business practices, break-up). All are possible over a long horizon and under certain Washington regimes, but the trifecta doesn’t seem likely under the policy mix proposed by either a second Trump term or a first Biden.”In these outlines, then, it seems that while most strategists on Wall Street will have their own lens through which to explain the market narrative du jour, how to think about the current moment has a few key through-lines.The concentration of gains and focus on tech made this market more fragile. A backup in Treasury yields might change some key assumptions about equity valuations. But scenarios for sustained downside in the market remain outside consensus frameworks right now.“We remain quite constructive on this new bull market,” Wilson writes. “However, it will likely be harder to make money from here if one is simply long [the S&P 500] or [the Nasdaq].”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy7:00 a.m. ET: MBA Mortgage Applications, week ended September 4 (-2.0% prior week)10:00 a.m. ET: JOLTS job openings, July (6 million expected, 5.889 million in June)EarningsPre-market8:00 a.m. ET: American Eagle Outfitters (AEO) is expected to report an adjusted loss of 16 cents per share on revenue of $829.73 millionPost-market4:05 p.m. ET: Zscaler (ZS) is expected to report adjusted earnings of 3 cents per share on revenue of $118.83 million4:05 p.m. ET: GameStop (GME) is expected to report an adjusted loss of $1.15 per share on revenue of $1.00 billion4:05 p.m. ET: RH (RH) is expected to report adjusted earnings of $3.41 per share on revenue of $700.79 millionTop NewsEuropean stocks gain despite tech rout and vaccine doubts [Yahoo Finance UK]AstraZeneca halts COVID-19 vaccine trial after 'unexplained illness' [Yahoo Finance UK]Warren Buffett's Berkshire Hathaway to buy $250 million worth of Snowflake's shares in private placement [Yahoo Finance]Slack misses expectations on quarterly billings, stock plummets more than 15% [Yahoo Finance]YAHOO FINANCE HIGHLIGHTSCoronavirus stimulus: What’s in Senate Republicans’ pared-down relief billHow GM plans to leapfrog TeslaBe prepared for 1,000-point Dow selloff before the presidential election: strategist—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}