{"article": [{"url": "https://finance.yahoo.com/news/apple-unveils-i-pad-8-for-329-and-i-pad-air-4-for-599-180944001.html", "published": 1600175840.0, "headline": "Apple unveils iPad 8 for $329 and iPad Air 4 for $599", "body": "On Tuesday afternoon at its live product event from Cupertino, California, its first major live event since WWDC in June, Apple unveiled the new generations of iPad and iPad Air.The new iPad 8 has an A12 Bionic chip, which Apple says provides a 40% faster CPU than iPad 7 and twice the graphics capability, and a Neural Engine, the first of the entry-level iPad line to get it. The screen is a 10.2-inch retina display. The iPadOS 14 software works with the Apple Pencil accessory to convert handwriting in any field into typed text in real time.The iPad 8 goes on sale Sept. 18 and the price starts at $329 or $299 for education customers.The new iPad 8 with A12 Bionic chip. Image courtesy of Apple.The new iPad Air 4 has a thinner case and a larger, full-screen 10.9-inch liquid retina display with 3.8 million pixel display. It uses an A14 Bionic chip, 40% faster than the prior iPad Air. Apple brought on representatives from apps like Djay Pro, War Robots, and Pixelmator to talk up the chip’s power.The new iPad Air moves to a USB-C connector, and has a 7-megapixel front-facing camera and the same 12-megapixel rear camera as the iPad Pro.See also: Apple debuts $399 Apple Watch Series 6 and $279 Apple Watch SEBut the biggest surprise for iPad Air devotees might be this: There is no home button, matching the latest iPhones. TouchID is now integrated into the power button at top, which has the “smallest authentication sensor we have ever designed,” according to Apple hardware exec Laura Legros.The iPad Air 4 starts at $599 and goes on sale in October.iPadOS 14 on the new iPad Air 4. Image courtesy of Apple.“This is a big year for iPad,” said Apple CEO Tim Cook, who noted that 2020 marks 10 years since the first iPad shipped. “Now more than ever, iPad has become even more important,” Cook said, “keeping us close to the ones we love” and “providing a critical lifeline for doctors, nurses, and patients.”The prior versions of these iPad models were iPad 7, revealed one year ago, and iPad Air 3, unveiled back in in March 2019 along with the iPad Mini 5. At its WWDC event in March, Apple rolled out its fourth generation iPad Pro.Story continuesApple sold 44 million iPads in 2018, the year it stopped breaking out its unit sales. The tablet market overall declined 1.5% in 2019, but IDC says that Apple remains the market leader.Apple split its stock in August for the fifth time in its history, and shares have been on a strong run in 2020, up 57% through market close on Monday.—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers tech. Follow him on Twitter at @readDanwrite.Tech newsletterRead more:Why Apple has less to fear from antitrust regulators than Facebook, Google, and AmazonTikTok deal doesn’t make sense for Oracle beyond politics, analysts sayAmazon tells employees to delete Tik Tok, then says email was ‘sent in error’Facebook ad boycott is 'more noise than fundamental risk': Jefferies analystWhat you need to know about Ant Financial, potentially the largest IPO in history"}]}