{"article": [{"url": "https://finance.yahoo.com/news/heres-what-happens-to-the-stock-market-after-the-presidential-debate-170257337.html", "published": 1601381420.0, "headline": "Here's what happens to the stock market after the first presidential debate in an election year", "body": "There is still time to sell some of your stocks ahead of the first presidential debate on Tuesday evening.Based on historical data compiled by researchers at LPL Financial, lightening the load right now would be a decent move. Looking at the first presidential debates from 1960 to 2016, the S&P 500’s total return has declined five-days, 10 days and one-month on average after the initial debate. The worst decline comes in the one-month measurement period to the tune of 2% on average.The title for worst post first presidential debate period for the S&P 500 goes to the Sept. 26, 2008 debate between then senators John McCain and Barack Obama. The S&P 500 — already under fire from the Great Recession — dropped 8.8% the next day, according to LPL Financial. One month after that debate, the S&P 500 was some 30% lower.As for the best run for the S&P 500 after the first presidential debate, that award goes to the Oct. 11, 1992 showdown between then sitting president George H. W. Bush and governor Bill Clinton. Stocks rose 1.2% the next day, and went onto climb by 4% over the next month.With Democratic presidential candidate Bill Clinton looking on at left, President George Bush speaks during the first presidential debate in St. Louis, Mo., Oct. 12, 1992. (AP Photo/Bill Waugh)While the debate Tuesday night between President Trump and challenger former vice president Joe Biden will likely be heated — and comes during a pandemic induced recession in the country — Wall Street strategists continue to advise looking beyond one evening of theatrics. To many, getting a COVID-19 vaccine is more important to the markets than the election in the near-term.“The number one risk is absolutely we don’t know what’s going to happen with COVID-19 and there might be a second wave. That’s a force of nature that we just don’t know. The lack of fiscal stimulus, lack of an election outcome those are more manmade if you will — and risks that we can adjust for in our portfolios,” said Franklin Templeton head of equities Stephen Dover on Yahoo Finance’s The First Trade.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Story continuesWhat’s hot this week from Sozzi:Peloton’s biggest rival just raised a ton of money from the likes of Stephen CurryHome Depot co-founder and Atlanta Falcons owner gives his best advice to new NY Mets ownerPeloton founder: here’s one of my biggest 15 year goalsVitamin Shoppe CEO: the pandemic has changed our businessKraft Heinz CEO: Buffett’s team like our $3.2 billion dealKroger CEO: this is how we see the future of food shoppingWatch Yahoo Finance’s live programming on Verizon FIOS channel 604, Apple TV, Amazon Fire TV, Roku, Samsung TV, Pluto TV, and YouTube. Online catch Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, and reddit."}]}