{"article": [{"url": "https://finance.yahoo.com/news/how-the-markets-reacted-to-2-past-contested-elections-135530716.html", "published": 1601975000.0, "headline": "How the markets reacted to 2 past contested elections", "body": "There are many ways the election could go sideways next month from voting irregularities to President Trump refusing to concede defeat.Peter Siris, director of research at Reform Elections Now, has even laid out a nightmare possibility where basically everything that could go wrong does. His worst-case scenario leads to five different people – Donald Trump, Joe Biden, Nancy Pelosi, Mike Pence, and George W. Bush – all with some claim on the presidency on Jan. 20, 2021.And that was before Trump’s positive test for COVID-19.The question for investors is whether a contested election has the potential to change the direction a market is already headed in. The limited evidence suggests not.President Donald Trump and Democratic presidential nominee Joe Biden participate in their first 2020 presidential campaign debate held on the campus of the Cleveland Clinic at Case Western Reserve University in Cleveland, Ohio, September 29, 2020. REUTERS/Jonathan Ernst“We've been very clear: politics have nothing to do with the performance of the stock market,” said Brian Belski, chief investment strategist at BMO Capital Markets. “They can either enhance or detract the current trend.”In an interview with Yahoo Finance, Siris, whose group is pushing for systemic change in how elections are conducted, agreed. The market, he said, \"is not usually influenced by politics.” But some version of his black-swan scenario, he said, is entirely possible and “could be something for the stock market to look at\" given the myriad things that could go wrong.Trump has been priming his supporters to expect a contested election for months. At the debate last week, Trump said, “this is going to be a fraud like you’ve never seen,” misleadingly citing different examples that did not, in fact, show fraud.Two historical precedentsThe two disputed elections most often cited in this vein were in 2000 and in 1876.In his research Siris noted that markets, indeed, dropped during both of those disputes. Stocks fell during Bush v. Gore in 2000, and had an even more dramatic downturn in 1876. The market declined 10% when it was unclear whether Rutherford B. Hayes or Samuel Tilden would be president.Samuel Tilden, the Democratic candidate, received more popular votes in the election of 1876.That election ended with Tilden, the Democrat, winning the popular vote but being denied the presidency. After months of uncertainty, Hayes was declared the winner as part of a deal where Republicans got the presidency in return for an end to Reconstruction.Story continuesA 2007 book, \"Fraud of the Century: Rutherford B. Hayes, Samuel Tilden, and the Stolen Election of 1876,\" calls it “perhaps the most bitterly contested in the nation's history,\" but also notes that the economy had already turned sour.The election took place three years after the panic of 1873, which had the impact of “leaving three million people out of work and causing the failure of eighteen thousand businesses.” The resulting economic depression lasted through the 1876 election.The conclusion of the election of 1876 came on the floor of the U.S. Senate in March 1877 when Rutherford B. Hayes was declared the new President by one electoral vote.Data gathered by Yale Professor Robert Shiller on stock performance at the time underscores the idea that the election chaos simply fit with the trend at the time.Shiller’s data, which tracks monthly stock prices since 1871, shows a decline from November 1876 through March 1877, when the election was decided. But the data also shows that stocks continued to sink for months afterwards and finally hit bottom in July 1877.Bush v. GoreThe 2020 election has some more obvious parallels to Bush v. Gore. In 2000, observers have noted, the stock selloff amid election uncertainty that year was part of a larger economic downturn.The markets dropped over 4% between Election Day 2000 and when it was clear George W. Bush would be the president. But the market had already been falling since March 2000 and had further to go in the years ahead as the dot-com bubble burst.Shiller’s data again showed a decline during this period of turmoil, but Bush’s inauguration didn’t change the trajectory. The bursting of the dot-com bubble and other events – including the attacks of Sept. 11, 2001 – impacted the stock market more in the years ahead.It wasn’t until 2003 that stocks by and large began rising again. Here’s the Yahoo Finance chart of the S&P 500 showing steady declines from mid-2000 until 2003.The 2000 election featured battles over \"hanging chads\" on ballots from Broward County in Florida. (Photo from Reuters)3 states to watchWhat hasn’t been tested yet is how widespread electoral chaos would impact a market that’s heading upward. That – according to Belski – is where things stand currently.“The current trend is recovering,” he said Monday, adding that “we think on a fundamental basis, the markets look good.”Siris said investors should watch three states – Arizona, Florida, and North Carolina – for clues on election night about where things could end up. These states are “canaries in the coal mine” because they begin counting early votes at least two weeks before election day and they won’t accept mail-in ballots that arrive past Election Day.Other states, which won’t count absentee and mail-in ballots until later in November, “are going to have garbage on election night,” Siris said. The states reporting only in-person votes on election night are expected to show a large Trump lead no matter whether or not he ends up the state’s winner.Arizona, Florida, and North Carolina are “going to be basically three to four weeks ahead of anybody else,” Siris said. “If those states break for Biden, Biden wins. If those states break for Trump, Trump probably wins.”“If those states are close, God help us,” he said.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Here’s why the White House is saying the jobs report isn’t as bad as you thinkHere’s who Trump likes to blame when the stock market goes downThe US has lost jobs since Trump took office, but so have many other countriesRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}