{"article": [{"url": "https://finance.yahoo.com/news/lost-health-insurance-coronavirus-pandemic-125934943.html", "published": 1594886840.0, "headline": "Millions of American workers lost health insurance as coronavirus pandemic worsened", "body": "Millions of Americans have lost employer-sponsored health care coverage since the coronavirus pandemic hit the U.S., causing a recession and widespread job losses.Nearly half of all Americans receive their health insurance through their employer. And amid coronavirus layoffs, some states have seen a massive uptick in the number of uninsured adults.Read more: How to file for Medicaid if you lose your jobAccording to a report by Families USA, a non-profit public health organization, nine states and the District of Columbia have more than a 30% increase in the number of uninsured from February to May 2020, compared to 2018. Overall, the percentage increase of uninsured in the U.S. is at 21%, with 5.3 million people losing health care coverage between February and May.The Northeast has been hit particularly hard by health care coverage losses. (Graphic: David Foster/Yahoo Finance)Massachusetts saw a 93% increase in the number of uninsured adults compared to 2018. Next highest was Hawaii at 72%. The state relies heavily on tourism, an industry that’s been devastated by the pandemic due to travel restrictions put in place across the world.Rhode Island and Michigan followed at 55% and 46% respectively. Michigan was among the states that was hit by the virus early on and had to implement stay-at-home orders before most other states because of the high case count. Nevada, at 34%, is another state that relies heavily on tourism and hospitality, mainly because of its major city, Las Vegas.A woman wearing a facemask enters a building where the Employment Development Department has its offices in Los Angeles, California on May 4, 2020. (Photo by FREDERIC J. BROWN/AFP via Getty Images)‘An imperfect safety net’According to a new report from the Urban Institute, more than 10 million Americans are expected to lose employer-sponsored health coverage between April and December 2020.The report stated that 3.3 million of those individuals will regain coverage by being added to a family member’s policy, 2.8 million people will enroll in Medicaid, and 600,000 people “will enroll in the individual market, mainly via the Affordable Care Act’s marketplace.” There will still be 3.5 million people remaining uninsured.Read more: How to get ACA health insurance if you lose your jobStory continues“Helping people keep their insurance through a public health crisis surprisingly has not gotten much attention,” Larry Levitt, executive vice president for health policy at the Kaiser Family Foundation, told The New York Times. “This is the first recession in which the ACA is there as a safety net, but it’s an imperfect safety net.”And with job losses and coronavirus infections continuing to grow, the number of workers losing employer-backed health insurance will also grow.Coronavirus is surging in southern U.S. (Graphic: David Foster/Yahoo Finance)The Kaiser Family Foundation has estimated that at least 27 million Americans so far have lost their employer-sponsored health insurance as a result of layoffs from the coronavirus pandemic.“As people continue to lose their jobs, which we expect that they will do unfortunately, we’re going to see losses in health insurance coverage,” Ben Zipperer, an economist at the Economic Policy Institute (EPI), previously told Yahoo Finance. “That’s because in the United States, we’ve chosen as a country, unfortunately, to tie access to health insurance with employment.”“If we avoided that,” he added, “if we made sure everybody was covered, everybody has access to health insurance regardless of their employment status, we wouldn’t be in this kind of predicament.”People walk along Broadway as the coronavirus keeps financial markets and businesses mostly closed on May 08, 2020 in New York City. (Photo by Spencer Platt/Getty Images)Options for the uninsuredThose who have lost their health care coverage due to layoffs are eligible for a special enrollment period (SEP), which allows them to sign up for health care through the Affordable Care Act (ACA) outside of open enrollment.According to the Centers for Medicare and Medicaid Services (CMS), approximately 487,000 people gained coverage through a special enrollment period from the ACA, which is a 46% increase year over year.“Normally, like your employer insurance plan, you can enroll during the open enrollment period, but then you can’t enroll during other periods of time or change your coverage unless you have a qualifying event, like getting a new job, having a baby, losing a job, getting married,” Dr. Katherine Baicker, dean of the University of Chicago Harris School of Public Policy, told Yahoo Finance.A health department worker checks in a man wearing a mask to be tested for COVID-19 at a drive through testing site at Osceola Heritage Park. (Photo by Paul Hennessy/SOPA Images/LightRocket via Getty Images)Baicker continued: “So if you lost your job because of COVID, you would be able to enroll in a non-group insurance plan because losing your job counts as one of those events that lets you enroll outside of an open enrollment period.”President Trump has the authority to declare an SEP in states that have a federally-run Obamacare marketplace, which is all but 12 states — California, Colorado, Connecticut, D.C., Idaho, Maryland, Massachusetts, Minnesota, Nevada, New York, Rhode Island, Vermont, and Washington — and Washington D.C.A COVID-19 Unemployment Assistance Updates logo is displayed on a smartphone on top of an application for unemployment benefits on May 8, 2020, in Arlington, Virginia. (Photo by OLIVIER DOULIERY/AFP via Getty Images)However, in March, the Trump administration decided against creating a nationwide SEP, instead promising a “cash payment” to hospitals that treated uninsured patients for coronavirus. But this doesn’t extend to individuals who need health care for other issues and don’t have the insurance to cover it.For people in those states that don’t have an SEP, their other options include seeing if they’re eligible for Medicaid (if their income is low enough) or signing up for COBRA, which means the individual continues the same health care coverage they had under their employer-based health insurance.Read more: COBRA insurance: How to file if you lose your jobHowever, COBRA has higher premium payments since there is no longer an employer contribution.Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Coronavirus: Health care experts call for nationwide special enrollment periodA 'flaw' in Obamacare is costing some Americans thousands of dollars per yearPresident Trump doubles down on dismantling Obamacare amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}