{"article": [{"url": "https://finance.yahoo.com/news/deleting-your-phones-stock-trading-app-might-be-good-for-your-portfolio-204919794.html", "published": 1595433440.0, "headline": "Why you should consider deleting your stock trading app", "body": "In vampire mythology, you have to actually invite a vampire in. If you don’t, they’ll stay outside and won’t suck your blood. But if one comes in, they are very difficult to kick out.This metaphor applies to much of our relationship with consumer technology and why it’s so difficult to delete social media apps that may be harmful. You don’t have to download them, but once you do, the user experience is designed to hook us and never let go.Instagram, Facebook and Twitter have hooked billions of users – and over the past few months stock trading app Robinhood has done something similar as more and more people have started to trade stocks, as evidenced by Google Trends and account signups at brokerages.When Robinhood came on the scene in 2013, it stood out from its brokerage competitors as a mobile-first platform, allowing for a far more hands-on experience. Instead of trading on a computer like everyone else, the company, true to its Silicon Valley roots, steered people to trade from anywhere. For anyone in any sort of media, mobile-first means one thing: high engagement. And for retail investors, this may not be a good thing.The bad ‘nudge’Over the past decade, behavioral economists like Nobel laureate Richard Thaler researched the idea of the “nudge” to get people to do what’s best for themselves financially. For example, “nudging” people to save for retirement by defaulting them into a 401(k) plan may have added around $30 billion to people’s retirement portfolios.But “many companies are nudging purely for their own profit and not in customers’ best interests,” Thaler wrote for the New York Times in 2015. “One example is the mortgage industry in the early 2000s. Borrowers were encouraged to take out loans that they could not repay when real estate prices fell. Competition did not eliminate this practice, because it was hard for anyone to make money selling the advice ‘Don’t take that loan.’”The Robinhood vestment app is see on a smartphone in this photo illustration on June 24, 2020 in Washington, DC. (Photo by JIM WATSON/AFP via Getty Images)Writing in his newsletter The Margins, former trader Ranjan Roy pointed out that Robinhood’s design around a traditional Silicon Valley user experience makes it different — with potentially dangerous consequences.Story continues“The product is built to trigger every possible dopamine receptor in a user's brain,” Roy wrote. “In the early years, terms like gamified UX are considered a positive.”Of course, the company’s and user’s best interests often don’t align.The company wants you to tradeBrokers used to make their money largely from commissions, charging a fee to execute a client’s trade – say, $7.95 per trade. So the more trades you made, the more you paid in fees. Of course, they wanted people to trade more, but brokerages found price levels where trades weren’t so pricey as to prevent trading, but also not too cheap to not make them any money.But with the rise of selling order flow — market-making companies like Citadel Securities will pay brokers like Robinhood to handle trade — free trading is everywhere now. Instead of charging clients per trade, Robinhood, which launched in 2013, and others make money off deposits, margin lending, a $5-a-month premium service, and selling order flow.Without a price barrier to trading, it’s easier to get people to trade. But Robinhood has gone farther than that, by designing its platform in ways that get people to trade more. And as the New York Times pointed out, Robinhood has become the master in profiting from trades — netting around 10 times what E*Trade makes off orders and 100 times what Charles Schwab makes.‘Mobile first’ means it’s always with you, which means you’re futzing with itThere have been anecdotes of people turning to the platform to trade stocks in lieu of sports betting amid coronavirus shutdowns, as well as others going too far and losing large portions of their savings.In fact, it’s a documented phenomenon: “Trading competes with other activities for the attention of sensation-seeking investors. Thus, we would expect trading to wane when there are a number of thrilling activities at their disposal,” wrote Brad Barber and Terrance Odean, economics professors at the University California Davis and Berkeley, respectively. (There have been few thrilling activities to do as casinos and other businesses have had to shut down amid the pandemic.)In his essay, Roy argues that the old system, which made it more inconvenient and expensive to trade, was actually better for investors. Losing your password to your brokerage account is actually a pretty good investment strategy for long-term investors. As Barber and Odean found in their research from 2000, the more frequently you trade, the lower your returns will likely be.In this March 16, 2020, file photo, United States flag is reflected in the window of the Nasdaq studio, which displays indices and stocks down, in Times Square, New York. (AP Photo/Seth Wenig, File)This is why it may also be good advice not to install apps that let you trade stocks on your phone.In a commencement address, the polymath Nassim Nicholas Taleb mused that everything pretty much comes from an “ineradicable gambling instinct.” Adding nudges that fuel this behavior and removing speed bumps that prevent it might have serious consequences.Countless studies have found the more you trade, the worse you will probably do — not just from the higher tax costs involved from short-term capital gains, but also because you can fall prey to the hubris of thinking you can time the market. In their paper, Barber and Odean repeatedly cite that excessive trading leads to poor returns.To people like Roy, a former professional trader, the ease and encouragement of trading is worrying.“I remember Fidelity making it a pain in the ass to start trading options and being on the phone with customer service for an hour about some missing form,” he wrote. “There were guardrails and friction in place. No one encouraged any of it and I got to make my own mistakes.”This, he says, is what is most concerning. “Every non-finance friend of mine is sharing screenshots of options trades,” he wrote. “It gives you much more of the casino rush than buying and holding stocks, or even buying and selling stocks.”The data, Roy adds, bears this out. According to the Times, Robinhood customers traded options 88 times more than Schwab customers.Buying an option means buying the right to buy or sell a stock in the future. Selling options means selling someone else the right, but not obligation, to buy or sell from you. Options trading can be especially with big downside potential, like selling a call option; but generally the worry people like Roy have is that they can be tools to enable speculation.This, people like Warren Buffett have said, is especially dangerous, and every time a bubble pops a new wave of investors learns some old lessons.\"Markets have a casino characteristic that has a lot of appeal,\" Buffett has said. \"If they think there's easy money to be made, you get a rush. And for a while, it will be self-fulfilling and create new converts until the day of reckoning comes.\"---Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Coronavirus crisis fuels push to widen social safety netThe 2008 recession was far worse for young people's careers than previously thoughtBlack communities vulnerable to 'debt traps' as key protections against payday loans removedBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey"}]}