{"article": [{"url": "https://finance.yahoo.com/news/u-government-awards-novavax-1-100207270.html", "published": 1594098620.0, "headline": "U.S. government awards Novavax $1.6 billion for coronavirus vaccine", "body": "By Julie SteenhuysenCHICAGO (Reuters) - The U.S. government has awarded Novavax Inc $1.6 billion to cover testing and manufacturing of a potential vaccine for the novel coronavirus in the United States, with the aim of delivering 100 million doses by January.The award announced by the U.S. Department of Health and Human Services is the biggest yet from \"Operation Warp Speed,\" the White House initiative aimed at accelerating access to vaccines and treatments to fight COVID-19, the respiratory disease caused by the coronavirus.Shares in Gaithersburg, Maryland-based Novavax rose 29% to $102 in morning trading.\"What this Warp Speed award does is it pays for production of 100 million doses, which would be delivered starting in the fourth quarter of this year, and may be completed by January or February of next year,\" Novavax Chief Executive Stanley Erck told Reuters.It will also cover the cost of running a large Phase III trial, the final stage of human testing.Erck said Novavax expects results of its Phase I trial testing the vaccine's safety within the next week or so. The company aims to start midstage trials in August or September, with Phase III testing starting in October, Erck added.The HHS announcement follows a $456 million investment in Johnson & Johnson's vaccine candidate in March, a $486 million award to Moderna Inc in April, and up to $1.2 billion in support in May for AstraZeneca PLC's vaccine being developed with Oxford University. The U.S. government also awarded Emergent Biosolutions Inc $628 million to expand domestic manufacturing capacity for a potential coronavirus vaccine and drugs to treat COVID-19.The addition of Novavax's candidate to Operation Warp Speed's portfolio \"increases the odds that we will have at least one safe, effective vaccine as soon as the end of this year,\" HHS Secretary Alex Azar said in a statement.Besides the massive cash infusion for Novavax, the U.S. government inked a $450 million contract with Regeneron Pharmaceuticals Inc to make and supply its antibody cocktail for COVID-19.Story continuesNovavax is somewhat of a dark horse in the race for a coronavirus vaccine. The company was not on the list of vaccine finalists for Warp Speed previously reported by the New York Times that included Moderna, AstraZeneca, Pfizer Inc, J&J and Merck & Co.In May, Novavax received an additional $388 million in funding for COVID-19 vaccine development from the Coalition for Epidemic Preparedness Innovations (CEPI), a private foundation, after a $4 million investment in March. In June, the U.S. Defense Department awarded the company $60 million to support manufacturing of 10 million doses of its vaccine in 2020.'A BIG SCALE UP'The company is in the process of transferring its vaccine technology to an unnamed contract manufacturer that has two large manufacturing facilities, its CEO said. That is in addition to the work being done by Emergent Biosolutions, which is making doses to supply the company's smaller early and midstage clinical trials.By early next year, Novavax expects to be able to make 50 million doses a month in the United States.\"It's a big scale up in a few different manufacturing sites in the United States,\" Erck said. \"What it leaves us with is the capacity of making many more doses in the U.S. in 2021.\"Novavax did not start human safety trials until late May. One reason for the delay is that the vaccine is grown in insect cells, a process that can take 30 days before company scientists can start purifying it and making it in bulk.\"You lose a month or so there, but I don't think we're behind because of our data,\" Erck said, referring to animal data showing a strong immune response and high levels of virus-killing antibodies.Besides Moderna, the company trails two other candidates - one from AstraZeneca and Oxford University and one from Pfizer and BioNTech.Jefferies analyst Jared Holz said the cash infusion \"places Novavax in a very enviable position should its data look compelling later in the year.\"Although Novavax has not yet produced a licensed vaccine, Sanofi SA uses the same basic technology to make flu vaccine, \"so the risk of us not succeeding is pretty low,\" Dr. Gregory Glenn, president of research and development for Novavax, said in a telephone interview.The Novavax vaccine works in conjunction with an adjuvant - a substance that boosts the immune response to help the body build a robust defense against the virus.Currently, Novavax makes its adjuvant in Sweden. The company is building up U.S. manufacturing capacity for its adjuvant \"so that we can make upwards of a billion doses of adjuvant in the United States,\" Erck said.Novavax also has a manufacturing plant in the Czech Republic and hopes to have two other plants in Europe and one in Asia, Erck said. The company is also working with a manufacturer in India. The aim there is to make more than 100 million doses a month, Erck said.(Reporting by Julie Steenhuysen; Editing by Bill Berkrot and Will Dunham)"}]}