{"article": [{"url": "https://finance.yahoo.com/news/david-chang-restaurant-failures-could-have-severe-repercussions-for-other-businesses-133851716.html", "published": 1600159580.0, "headline": "David Chang: Restaurant failures could have ‘severe repercussions' for other businesses", "body": "The novel coronavirus continues to ravage the U.S. restaurant industry, which lost nearly one of every six stores to permanent or long-term closure and $165 billion in revenue over the first six months of the pandemic, according to a study released on Monday by trade group the National Restaurant Association.But celebrity chef David Chang told Yahoo Finance in a recent interview that the economic damage could extend far beyond restaurants themselves, since other businesses depend on them to stay afloat. State and local policies that allow restaurants to operate at partial capacity will not save the industry, Chang added, advocating instead for additional government aid.“Even though we're not technically banks, most cash flow that goes into restaurants goes immediately out,” Chang, the founder of the Momofuku Restaurant Group and host of Netflix’s (NFLX) “Ugly Delicious,” told Yahoo Finance Editor-in-Chief Andy Serwer on Sept. 11 in an episode of the series “Yahoo Finance Presents.”“The only difference is we're not charging interest,” he adds. “So many other businesses are dependent on restaurants, whether it's a florist, purveyors, artisans. So this is going to have severe repercussions.”Chef and restauranteur David Chang appears on \"Yahoo Finance Presents\" with Yahoo Finance Editor-in-Chief Andy Serwer.After the initial struggles of restaurants earlier this year, the Federal Reserve Bank of St. Louis released a report in April that confirmed the secondary economic damage of restaurant failures, positing that spillover from the sector causes employment losses elsewhere in the economy.The restaurant industry was projected to take in nearly $899 billion in sales revenue this year but will miss out on $240 billion in revenue by year’s end, the National Restaurant Association said in its new study.Since the wide spread of the disease became known in March, many states have enacted restrictions or prohibitions on indoor dining — policies that may persist in light of a Centers for Disease Control study released last Friday that linked indoor dining to cases of COVID-19.Story continuesA glimmer of hope emerged for the industry last week when New York Gov. Andrew Cuomo announced that restaurants in New York City will be permitted to offer indoor dining at 25% capacity beginning on Sept. 30. But the move won’t actually accomplish much for restaurant owners, Chang argued.This Oct. 23, 2019 photo shows celebrity chef David Chang during an interview in Los Angeles to promote his Netflix series “Breakfast, Lunch & Dinner”. (AP Photo/Damian Dovarganes)“It doesn't doesn't do anything in fact,” he says. “If restaurants were limited to 90% of capacity, 90% of restaurants would still go out of business.”“Especially in New York City, the model is built on 100% occupancy,” adds Chang, the author of a new book entitled, “Eat a Peach: A Memoir.”Chang advocated for additional government aid, saying that the Payment Protection Program would not allow restaurants to endure a prolonged drop in sales.“PPP was temporary,” he says. “The government needs to intervene a little bit more — not a little bit more, a lot more.”“But I don't know that's going to happen,” he adds. “It's a lot like the 2008 financial crisis, except that it's not too big to fail. It's too small to fail.”Read more:Netflix co-founder on creative culture: We ‘manage on the edge of chaos’Netflix was 'one of my great mistakes,' says billionaire investor Mario GabelliBill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}