{"article": [{"url": "https://finance.yahoo.com/news/trump-says-minimized-coronavirus-didnt-170555969.html", "published": 1599653600.0, "headline": "Trump said he knew virus was deadly but still played down crisis: Woodward book", "body": "WASHINGTON (Reuters) - U.S. President Donald Trump acknowledged to a journalist early in the coronavirus pandemic that he played down the danger of the health crisis despite having evidence to the contrary, according to a new book.\"I wanted to always play it down,\" Trump told author Bob Woodward on March 19, days after he declared a national emergency. \"I still like playing it down, because I don't want to create a panic.\"CNN on Wednesday broadcast interviews Woodward did with Trump for his new book \"Rage.\" The book, to go on sale next Tuesday, just weeks before the Nov. 3 presidential election, comes amid criticism of Trump's efforts to battle COVID-19.The Republican president, assailed by his Democratic rival Joe Biden over the slow U.S. government response to the coronavirus, played down the crisis for months as it took hold and spread across the country.In the March 19 conversation, Trump told Woodward that some \"startling facts\" had emerged showing the extent of those at risk: \"It's not just old, older. Young people too, plenty of young people.\"Trump on Wednesday defended his handling of the virus, which has killed more than 190,000 people in the United States.\"The fact is I'm a cheerleader for this country. I love our country and I don't want people to be frightened,\" Trump said at the White House. \"We've done well from any standard.\"According to the interviews, CNN and The Washington Post reported, Trump knew the virus was dangerous in early February.\"It goes through the air,\" Trump said in a recording of a Feb. 7 interview with Woodward. \"That's always tougher than the touch. You don't have to touch things. Right? But the air, you just breathe the air and that's how it's passed.\"And so that's a very tricky one. That's a very delicate one. It's also more deadly than even your strenuous flus.\"Story continuesA week after that interview, Trump said at a White House briefing that the number of U.S. coronavirus cases \"within a couple days is going to be down close to zero.\"Woodward in an interview with the Associated Press defended himself from online critics who questioned why he kept Trump's comments to himself for months as a pandemic raged.\"He tells me this, and I'm thinking, 'Wow, that's interesting, but is it true?' Trump says things that don’t check out, right?\" the news agency quoted Woodward as saying in a phone interview.Some fellow Republicans defended Trump's coronavirus response on Wednesday.\"His actions of shutting the economy down were the right actions,\" Senator Lindsey Graham said. \"And I think the tone during that time sort of spoke for itself.\"Woodward conducted 18 interviews with Trump for the book. Other revelations include Trump's disparaging remarks about U.S. military leaders. He drew criticism this week following reports that he had denigrated fallen military personnel and veterans.In Woodward's book, an aide to former Defense Secretary Jim Mattis heard Trump say in a meeting, \"my fucking generals are a bunch of pussies\" because they cared more about alliances than trade deals. Mattis asked the aide to document the comment in an email, the Washington Post reported.Regarding the Black Lives Matter movement, Woodward asked Trump his views on the concept of white privilege and whether he felt isolated by that privilege from the plight of Black Americans.\"No. You really drank the Kool-Aid, didn't you? Just listen to you,\" Trump replied, according to media reports on the book. \"Wow. No, I don't feel that at all.\"(Reporting by Doina Chiacu, Andrea Shalal, Joseph Ax, Jan Wolfe, Patricia Zengerle, David Morgan, and Alex Alper; Editing by Dan Grebler and Howard Goller)"}]}