{"article": [{"url": "https://finance.yahoo.com/news/what-the-market-is-telling-us-about-rising-coronavirus-cases-and-a-recovery-130230217.html", "published": 1592640620.0, "headline": "Here's what the market is saying about rising coronavirus cases and the economy", "body": "Florida, once positioned to be an exemplar among states preparing to relax lockdowns, has now become a cautionary tale — joining California, Arizona and Texas in a string of areas experiencing a resurgence in coronavirus cases.Nevertheless, a volatile Wall Street, while still prone to retrenchment, remains firmly entrenched in a bull market bolstered by aggressive stimulus from the U.S. government and the Federal Reserve. The market’s helter-skelter tone is largely reflective of the competing impulses of a nationwide rise in COVID-19 diagnoses, and expectations for an economic revival.For weeks, analysts have lamented the dichotomy between Wall Street and a real economy. Yet Paul Schatz, Heritage Capital’s president, told Yahoo Finance this week that current prices aren’t actually disconnected from economic reality at all.“The market action is discounting economic activity 3-6 months down the road,” he said. “Although short term sentiment is frothy...long term investors...are still hunkered down with cash in their bunkers with bottled water and spam,” Schatz joked.And a closer analysis suggests that investors are less overly-optimistic about a ‘V-shaped’ recovery than they are taking a pragmatic view about political and epidemiological realities as COVID-19 extends its grip on the global economy. At the nexus of new outbreak worries and the market’s head-scratching rally in the face of chaos, markets are betting on two precarious assumptions.They believe that rising coronavirus cases won’t overwhelm hospitals that are now better prepared than during the first wave, and that virtually no political will exists for the return to restrictive lockdowns that characterized March and April.Jan Hatzius, Goldman Sachs’ chief economist, said on Friday that there’s “probably a high hurdle for states to reinstate lockdowns. Hospital capacity, not case growth, is likely the factor that could force state and local officials to pause or reverse reopening plans.”Story continuesHe added: “Although the share of hospital inpatients receiving treatment for COVID-19 remains low, we think these and related data are among the most important to monitor in assessing whether a state might pause, alter, or reverse its reopening plans.”Mark Haefele, the chief investment officer of global wealth management at UBS, wrote in a research note that rising COVID-19 outbreaks “are still small in relation to the capacity of health systems. Meanwhile local, state and federal officials have broadly rejected a return to restrictive lockdowns, he added.Given resilient consumers and progress on the development of a vaccine, the recovery will “gather strength over the coming year,” Haefele added — even if second wave fears ramp up market volatility.Cases are rising outside of New York. (Graphic: David Foster/Yahoo Finance)The ‘jagged swoosh’The downside risks associated with growing COVID-19 fears were laid bare on Friday, when Apple (AAPL) announced it was closing stores in some markets again out of “an abundance of caution” — which sent stocks reeling.The dynamic reflects the market’s “new phase,” according to John Hancock Investment Co-Chief Investment Strategist Matt Miskin. He told Yahoo Finance this week that asset prices were likely to trade like “a biotech stock” whose fortunes rest on a promising drug.“It’s a behavioral finance study. Really what happens is when you’re investing in a pharmaceutical usually they start out by saying there’s a lot of promise around a drug and the stock goes up a ton,” only to reverse when reality undermines the optimism.Meanwhile, it's become clear that the happy medium between a still-raging outbreak and a nascent rebound is what analysts at Eurasia Group recently called a “jagged swoosh” recovery.“The interaction of the pandemic and the public policy decisions…[create] a jagged swoosh recovery more protracted than the ‘U’ or ‘V’-shaped recovery that characterize more benign scenarios, and likely to be stop-start reflecting the differential pace or recovery across states and sectors,” wrote Robert Kahn, the firm’s global strategy and macro director.“Continuing headwinds to demand and supply, and the resultant financial distress, contribute to sustained shortfalls in activity,” he added. “Unemployment remains elevated and it takes 2-3 years for activity to return to pre-pandemic levels.”Addressing the prospect of a new round of shutdowns, Eurasia echoed a growing number of economists who suggest that scenario “will be harder to implement than we thought, because political support for reopening is surprisingly strong, and unlike in the early days of the pandemic the necessity for state-wide shutdowns...is seen as limited if viral outbreaks remain concentrated in small pockets.”That assumption is a gamble for both Wall Street and the economy. Because COVID-19 isn’t going anywhere until a vaccine is found, the outlook will be captive to flare-ups in certain states, and the ability of public officials to contain the disease.Jesse Edgerton, economist at JPMorgan Chase, wrote on Friday that “COVID-19 and its effects on behavior remain the most important factors likely to drive the economy in the remainder of 2020, in our view.”With record hospitalizations and infections now dogging the Sunbelt States and California, even as former epicenters in New York and New Jersey decline, the bank “envisions that a patchwork of policy responses across states will be inadequate to eliminate the virus, leaving the fear of COVID-19 as a significant drag on activity in certain sectors,” Edgerton said, adding that “recent data on the interplay between COVID-19 and activity are consistent with our forecast for only a partial recovery.”"}]}