{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-moderna-targets-thanksgiving-for-vaccine-results-161924717.html", "published": 1601551640.0, "headline": "Coronavirus update: Moderna targets Thanksgiving for vaccine results as pressure mounts on Pfizer", "body": "October is set to mark an important month in the U.S.’s vaccine development timeline, as a regularly scheduled U.S. Food and Drug Administration meeting near the end of the month will help inform the public about how the government will prioritize an authorized vaccine.Frontrunners Pfizer (PFE), with BioNTech (BNTX), and Moderna (MRNA) are all slated to have early indications of their candidate’s effectiveness by the end of the month, at earliest.With President Donald Trump aggressively pushing for a viable candidate before Election Day, Moderna on Wednesday told The Financial Times in an interview that it would take an extra month to observe trial participants — pushing earlier indications to late November.Meanwhile, health experts recently encouraged Pfizer to draw out its observation period, delaying any indications of its candidate into November —rather than the end of October as CEO Albert Bourla has repeatedly indicated. In a letter, medical experts letter asks Bourla to monitor participants for a minimum of two months after the second dose, citing a need for public trust in the vaccine.“We respectfully urge you to abide by this rigorous safety standard. There is too much at stake,” the letter said. Pfizer has yet to respond.Dr. Howard Forman, a Yale professor and public health policy expert, told Yahoo Finance that Pfizer is in a tight spot, and could erode further the public trust.“If Pfizer would try to pull it off, it would look really bad now that Moderna has signaled” by waiting the two months, Forman said.But in a letter to employees Thursday, Pfizer’s Bourla appeared to indicate he would not be swayed either way.“In this hyper-partisan year, there are some who would like us to move more quickly and others who argue for delay. Neither of those options are acceptable to me,” he said.In a statement to Yahoo Finance, Pfizer said the company is actively working on a response to the letter from heath experts.Story continues“Pfizer is very appreciative for the kind words fo the public health experts about our progress,” the statement said.“We are committed to providing sufficient efficacy and safety data to help FDA determine the best regulatory mechanism for making the vaccine available to the public. We look forward to reviewing the new FDA guidelines once they are published.”But all indications from the White House point to the guidelines likely never being published, according to a Wall Street Journal report.There are over 7 million cases in the U.S. (Graphic: David Foster/Yahoo Finance)Forman echoed the concerns of other health experts worried about any movement on or before early November, a benchmark repeatedly touted by Trump. At Tuesday’s first presidential debate, the president floated the idea once more.“I've spoken to the companies and we can have it a lot sooner,” Trump said, bemoaning how the issue has become “very political.”Trump’s aggressiveness contrasts with those from top administration health officials, include U.S. Centers for Disease Control and Prevention (CDC) director Dr. Robert Redfield and National Institute of Allergy and Infectious Diseases (NIAID) director Dr. Anthony Fauci.Both have reiterated over time that a vaccine authorization by Election Day is unlikely. And in an interview with the Financial Times, Moderna CEO Stéphane Bancel echoed Fauci and Redfield, stating that widespread vaccine availability is likely only in 2021, closer to the second quarter.More from Anjalee:Redfield: CDC 'preparing earnestly' for vaccine in November, DecemberIndia's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus eraHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}