{"article": [{"url": "https://finance.yahoo.com/news/temporary-permanent-unemployed-morning-brief-100539897.html", "published": 1598246000.0, "headline": "A key question about the economic recovery remains unanswered: Morning Brief", "body": "Monday, August 24, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeHow many temporary layoffs are really temporary?Even though the initial economic snapback following the intense early days of the coronavirus outbreak has been better than expected, most measures of the economy remain far below pre-pandemic levels. And a full recovery seems unlikely until the world gets a vaccine for COVID-19.The longer the coronavirus remains a risk, the longer the economy will be held back. And that means more of the temporary damage to the economy becomes permanent.One specific question that remains unanswered: How many workers “on temporary layoff” will become “permanent job losers.”When the April jobs report came out, we learned the number of workers on temporary layoff spiked to 18.1 million from 1.8 million in March. Because the situation was characterized as temporary, the stat was considered a glimmer of hope as it suggested many of those laid off would have jobs waiting for them as lockdowns and quarantines were lifted.As of the July jobs report, 9.2 million—56% of unemployed workers—considered themselves as on temporary layoff.“Although the high share of workers on temporary layoffs suggests scope for additional large job gains later this year, the extended unemployment duration for most temporarily laid off workers—60% of who have been unemployed since April—raises questions about how many temporary layoffs are really temporary,” Goldman Sachs economist Joseph Briggs wrote in a note to clients on Friday.Briggs points to a number of flags that raise doubts about how many of these people will return to work. For example, an unusually high 84% of those on “temporary layoff” have been out of work for at least five weeks as of July, down from an even higher 90% in June; this is over 20 percentage points higher than the previous high during the 1981-82 recession.“These patterns raise questions about how many of the current temporary layoffs are really temporary,” Briggs said. Though he notes that studies show that folks on extended periods of temporary unemployment still face better hiring prospects than those who were permanently laid off by their employers.Story continuesThe economist also pointed to a recent AP-NORC poll, which found an increasing number of those on temporary layoff were doubtful that they would actually be called back to their jobs.According to Goldman Sachs analysis, 25% of workers on temporary layoff have doubts they will be recalled.“[O]ur analysis suggests almost a quarter of temporary layoffs will become permanent, implying scope for roughly 2mn (or 1.25% of the labor force) of these individuals to remain unemployed well into next year,” Briggs concluded.It’s all an incredibly complicated situation. In another report exploring the labor force, Wells Fargo economists point to the possibility that people needing work and being offered work may still not be able to return to work. Specifically, they flagged a challenge having a greater impact on women than men.“[W]ith many schools not opening for full-time in-person instruction this fall, we fear participation among this group may be particularly slow to recover,” Wells Fargo economist Jay Bryson wrote. “Women spend about twice as much time per day taking care of others (both children and other adults) than men. At the same time, prime-age women are much more likely to report wanting a job but are not in the labor force due to childcare problems or family responsibilities.“Child and other family care issues therefore could stymie the return to work for prime-age women even as job opportunities become more widespread in coming months,“ he said.Briggs’ and Brysons’ work are not exactly apples-to-apples regarding specific metrics in the labor market data. But the point is there are many issues when it comes to hiring and rehiring, and the risk is they all get worse the longer the economy remains hindered by the presence of the coronavirus.By Sam Ro, managing editor. Follow him at @SamRoWhat to watch todayEconomy8:30 a.m. ET: Chicago Fed National Activity Index, July (3.7 expected; 4.11 in June)Earnings4:15 p.m. ET: Palo Alto Networks (PANW) is expected to report adjusted earnings of $1.39 per share on revenue of $923.76 millionTop NewsEuropean stocks and U.S. futures rally as U.S. approves COVID-19 treatment [Yahoo Finance UK]ByteDance investors seek to use stakes to finance TikTok bid [Reuters]Tencent gains $37B after U.S. reassures on WeChat ban [Blomberg]U.S. recession likely to end late 2020 or 2021, NABE survey says [Bloomberg]YAHOO FINANCE HIGHLIGHTSDoubleLine's Shinoda explains what housing has now that it didn't during the last crisisWith lavish dollars, governments help create 'victory for science' in coronavirus vaccine huntNike celebrates the life and legacy of Kobe Bryant with 'Mamba Week'—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}