{"article": [{"url": "https://finance.yahoo.com/news/social-media-bias-survey-175915487.html", "published": 1598015240.0, "headline": "A majority of Americans think social media sites are politically biased: Report", "body": "Americans increasingly believe social media companies like Facebook (FB) and Twitter (TWTR) are censoring political speech despite a lack of any hard evidence of such bias.According to a recent survey of 4,708 U.S. adults conducted by the Pew Research Center between June 16 and June 22, 73% of respondents say that it is somewhat or very likely that social media sites purposely censor political viewpoints they find objectionable.The survey results come at a fraught time for social networks like Twitter and Facebook as they attempt to clamp down on misinformation and foreign interference ahead of the 2020 elections, and as President Trump continues his attack on the sites via his order to find a way to repeal Section 230 of the Communications Decency Act.Americans of both parties believe there’s biasWhile conservative politicians, including Trump, and pundits have been banging the drum the loudest about supposed bias on social media sites, the survey found that a majority of respondents from both sides of the political spectrum believe there is some form of censorship against political viewpoints.Still, a larger percentage of respondents who identify as Republican or Republican-leaning believe there is a bias, versus Democrat and Democrat-leaning respondents. What’s more, Pew found an increasing percentage of republican and republican leaning Americans surveyed believe social media sites are biased, compared with a reduction in Democrat and Democrat-leading respondents.There has been a steady stream of complaints regarding social media sites and claims of bias for some time now. During a recent hearing before the House Judiciary Committee’s Subcommittee on Antitrust, Commercial, and Administrative Law investigating antitrust violations among Big Tech firms, a number of conservative lawmakers pressured Facebook and Google about perceived bias.But according to Corynne McSherry, legal director of the Electronic Frontier Foundation, a non-profit civil liberties organization dedicated to protecting online speech, there’s been no real evidence of any partisan political bias from social networks.Story continuesTwitter has come under fire for blocking tweets by President Trump that violated the company's terms of service. (AP Photo/Jose Luis Magana, File)“I’m not surprised that many Americans think this, given that there are plenty of political leaders and pundits who are insisting it is true. But as a practical matter, we haven’t seen evidence that social media platforms moderate on a partisan basis,” she told Yahoo Finance.Instead, McSherry says the EFF has found that traditionally marginalized groups are the ones that are silenced in the U.S., as well as in countries where citizens don’t have First Amendment rights like those e Americans enjoy The group is asking online platforms to provide transparency reports covering when content is taken down and why.What’s more, a July study found that there was little evidence of bias against conservative voices on Twitter in particular. Facebook and Google have similarly denied accusations in the past.Facebook, in fact, has gone to such lengths to appease conservative voices who complain of censorship that, according to NBC News, the company ignored its own rules about misinformation when it came to posts by conservative outlets like Breitbart.Increased scrutiny of social media sitesTrump, meanwhile, has called for a repeal of Section 230 of the Communications Decency Act, which provides online platforms that host user-generated content, which is virtually all internet sites, with liability protection. His distaste for the law peaked when Twitter blocked one of his tweets that stated in part, “When the looting starts, the shooting starts,” in reference to early protests that saw rioting following the death of George Floyd.Twitter blocked the tweet saying that it glorified violence. The move came shortly after Twitter labeled a previous tweet by Trump with a fact-check marker after he claimed that mail-in voting would lead to election fraud.Facebook, which has taken heat for its stance on allowing politicians to spread misinformation, also took action against Trump’s campaign for using a symbol associated with Nazism to decry a supposed Antifa uprising, and spreading misinformation about children being immune to COVID-19.But Americans surveyed by Pew say they don’t trust social media sites to accurately label misinformation, with 66% saying they have “not too much” or “no confidence” in the ability of social media sites to label such content.Social media sites certainly haven’t made it easy to trust them either, thanks to a seemingly endless line of issues ranging from data misuse to foreign interference in national politics. And there are times when internet platforms remove content by accident.Until social networks can regain users’ trust, the perception of bias will likely continue to percolate unabated.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.What the heck is happening with Apple, Google, and ‘Fortnite’?: Tech Support Apple faces an App Store reckoning amid gaming and tech uprisingApple is now worth $2 trillionSamsung’s Galaxy Buds Live offer premium earbud features without the priceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}