{"article": [{"url": "https://finance.yahoo.com/news/americans-are-hoarding-trillions-of-dollars-in-cash-before-the-presidential-election-morgan-stanley-164055358.html", "published": 1600775300.0, "headline": "Americans are hoarding trillions of dollars in cash before the presidential election: Morgan Stanley", "body": "American households are socking away large sums of cash amid economic uncertainties later this year such as a new wave of COVID-19 and the post presidential election aftermath.U.S. consumers built up an astounding $12.5 trillion in excess of savings from April through July, according to new research by Morgan Stanley economist Ellen Zentner. This equates to 13.5 months of the $600 a week supplemental unemployment insurance benefit that lapsed on July 31, Zentner estimates.Read more: How to save money for short-, mid-, and long-term goalsCash hoards have been built across the income spectrum, says Zentner. That ultimately runs counter to cash being saved by wealthier households during tough economic times while lower income households are forced to spend more aggressively due to job loss, etc.The trillion dollar question on the minds of consumer companies is if — and when — households will start to spend this money. Absent a new round of fiscal stimulus, most indications suggest consumers are tightening back up on their spending ahead of the holidays after splurging to stock cupboards and buy work-from-home gear at the height of COVID-19 in March.The Commerce Department reported earlier this month that August retail sales rose 0.6%, slightly missing forecasts for 0.7% growth. At 0.6%, the growth rate in retail sales last month cooled from a downwardly revised pace of 0.9% in July (1.2% increase for July previously reported).Meantime, retailers from Target to Walmart to Macy’s have warned of sales slowdowns into September as households spent cautiously around back-to-school products.COCONUT CREEK, FL - APRIL 04: Shoppers stock up as Walmart on Saturday began limiting the number of customers who can be in it's stores at once due to the Coronavirus (COVID-19) pandemic on April 4, 2020 in Coconut Creek, Florida Credit: mpi04/MediaPunch /IPXSome economic experts are already sounding the alarm bell on consumer spending moving forward.“Our worst-case scenario is we have a couple land mines in the economy such as the lost of the $600 unemployment insurance supplement and the lack of aid to state and local governments,” warned Deloitte Insights senior economic forecaster Dr. Daniel Bachman on Yahoo Finance’s The First Trade. “So we do have a negative fourth quarter for GDP. Worst-case scenario is that hits along with clearly no [COVID-19] vaccine and consumer spending just really starts to decline as people begin to be concerned about the longer term.”Story continuesBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.What’s hot this week from Sozzi:Peloton’s biggest rival just raised a ton of money from the likes of Stephen CurryHome Depot co-founder and Atlanta Falcons owner gives his best advice to new NY Mets ownerPeloton founder: here’s one of my biggest 15 year goalsVitamin Shoppe CEO: the pandemic has changed our businessKraft Heinz CEO: Buffett’s team like our $3.2 billion dealKroger CEO: this is how we see the future of food shoppingWatch Yahoo Finance’s live programming on Verizon FIOS channel 604, Apple TV, Amazon Fire TV, Roku, Samsung TV, Pluto TV, and YouTube. Online catch Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, and reddit."}]}