{"article": [{"url": "https://finance.yahoo.com/news/white-house-dems-still-deadlocked-164644316.html", "published": 1597233260.0, "headline": "White House, Dems still deadlocked over coronavirus relief deal with two sides 'miles apart,' Pelosi says", "body": "House Speaker Nancy Pelosi said Wednesday that Democratic leaders and White House officials are still at a stalemate regarding another coronavirus relief deal, leaving billions in aid for American families and workers in the lurch.“We’re miles apart,” Pelosi told MSNBC during an interview on Wednesday. According to Pelosi, the two sides are divided over education funding, eviction protections and additional money for food stamps.\"It's a chasm,\" she said.Negotiators are trying to bridge the divide between a $1 trillion aid package put forward by Senate Republicans at the end of July, and the roughly $3 trillion legislation passed by House Democrats in May. The Trump administration rejected an offer by Pelosi last week to meet in the middle on a $2 trillion price tag.WASHINGTON IMPASSE ON CORONAVIRUS RELIEF THREATENS US ECONOMYTalks between the two sides broke down last Friday, putting at risk potentially trillions of dollars in aid for families, businesses and the U.S. economy, including a fresh round of $1,200 stimulus checks, extra unemployment aid for millions of out-of-work Americans and $100 billion to help reopen schools.There have been no signs of a détente so far, with each party continuing to blame the other for the stalled-out discussions.Earlier in the day, Treasury Secretary Steven Mnuchin, one of the lead negotiators on the Republican side, urged Democrats to compromise on a $1 trillion relief package.MCCONNELL OPENS DOOR TO EXTENDING $600 UNEMPLOYMENT BOOST\"My view on negotiations is you agree on the things that you can agree on, half legislation that's good for the American public, and then come back for another bill,\" Mnuchin told FOX Business' Maria Bartiromo.Facing a deadlocked Congress, President Trump then issued a series of executive actions on Saturday that he said would address the economic fallout from the pandemic. The measures would postpone the collection of payroll taxes for individuals earning less than $104,000 annually through the remainder of the year; partially restore supplemental unemployment benefits at $400 per week (25% of which would come from cash-strapped state's budgets), extend student loan relief and discourage evictions.Story continuesCombined, the four measures would inject about $165 billion of liquidity into the U.S. economy in the short-term and add about $10 billion to the nation's ballooning deficit, according to new projections released by the Center for a Responsible Federal Budget.CALCULATE HOW MUCH MONEY YOU'D RECEIVE FROM THE SECOND STIMULUS CHECK HERETrump has pledged to pursue a permanent cut to the payroll taxes, but without legislation, those payments will still be required by the delayed due date.Some of his proposals are expected to face legal challenges. The Constitution gives Congress the power of federal spending, meaning that Trump does not have the legal authority to issue executive orders allocating how much money should be spent on the pandemic.CLICK HERE TO GET THE FOX NEWS APPRelated ArticlesFmr. Notre Dame Coach Lou Holtz Predictions for Trump vs. MediaTrump May Have Dropped Another Clinton BombshellCarson: Trump Could Destroy Obama's Legacy"}]}