{"article": [{"url": "https://finance.yahoo.com/news/democrats-propose-adding-fed-mandate-reducing-racial-inequality-203038112.html", "published": 1596641900.0, "headline": "Democrats propose expanding Fed mandate to reducing racial inequality", "body": "Democrats on Capitol Hill are rallying around a proposal to require the nation’s central bank to pay more mind to racial inequality in its monetary and regulatory policies.On Wednesday, a group of 20 House and Senate Democrats introduced a bill that would amend the Federal Reserve Act to require the central bank to operate “in a manner that fosters the elimination of disparities across racial and ethnic groups with respect to employment, income, wealth, and access to affordable credit.”Sen. Elizabeth Warren, who co-authored the bill along with House Financial Services Committee Chairwoman Maxine Waters and New York Senator Kirsten Gillibrand, hope to force the Fed’s hand into using powers that they allege it already has.“The Fed can use its existing authorities to reverse the serious racial gaps in our economy, including in our current recovery from the COVID-19 crisis - and our bill will require the Fed to do so,” Warren said in a statement.Critics have alleged that the Fed has enabled a persistent racial income and wealth gap that specifically disadvantages Black communities in the United States. Protests in June following the killing of George Floyd called attention to systemic challenges faced by Black families.Data from the Fed itself shows that the median white family in the U.S. had a net worth of $171,000 as of 2016, compared to the median Black family’s net worth of just $17,600.Policies outside of the Fed’s purview - housing discrimination and access to health care - have contributed to these economic disparities. But the Fed’s monetary policy, which relies on transmission through the banking system, has been a driver of rising asset prices that may be driving inequality further considering the lack of financial assets held by Black families.About 61% of white families have some stock holdings, compared to only 31% of Black families.For the Fed’s part, Chairman Jerome Powell has emphasized that the central bank is paying attention to economic disparities, even acknowledging the protests in the Federal Open Market Committee’s June meeting. Policymakers have specifically championed policies allowing the labor market to “run hot” through accommodative monetary policy, which had pulled minorities and low-income workers into jobs until the COVID-19 crisis hit.Story continues“We have started though in recent years to focus considerable time and attention on disparate levels of unemployment, for example, among different racial groups and demographic groups,” Powell said July 29.Not just monetary policyThe bill would also require the Fed to consider the racial gap in its other functions, such as bank regulatory policy and its operation of national payment systems.Aaron Klein, a fellow of economic studies at the Brookings Institution, says the payments system, not monetary policy, is the best tool to address racial inequality. Although many countries around the world have real-time payments systems, consumers in the U.S. still have to endure a three- to five-day waiting period for payments to clear from one bank to another.Those delays push those living paycheck-to-paycheck, often times low-income and minority Americans, to turn to dangerously high interest payday loans for day-to-day liquidity. The Fed is working on implementing real-time payments, but the central bank is not expected to finish its work until 2023 or 2024.“Fed culture focuses so heavily on monetary policy as the solution and the most important tool that the Fed neglects its regulatory payments functions,” Klein told Yahoo Finance.It is unclear if the Democratic proposal can win support from Senate Republicans and the White House, but the issue could gain steam on the campaign trail. Democratic presidential candidate Joe Biden’s platform on addressing racial inequity includes a plan to amend the Federal Reserve Act along similar lines, also emphasizing the importance of real-time payments.The platform also includes efforts to resolve the lack of diversity at the financial regulators, where a Georgetown University study shows that only 3% of political appointees over the last 106 years have been Black.Among the 95 people who have served on the Federal Reserve Board through its history, there have only been three Black governors: Andrew Brimmer, Emmett John Rice, and Roger Ferguson.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.What is a stock split: Yahoo UFed chair says economy faces 'new phase' as coronavirus deaths top 150K, data softenFed: Economic recovery will depend 'significantly on the course of the virus'FOMC Preview: 'Probably nothing' new as Fed weighs guidance amid coronavirus surgeA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}