{"article": [{"url": "https://finance.yahoo.com/news/3-stocks-under-5-could-144634551.html", "published": 1602237260.0, "headline": "3 Stocks Under $5 That Could Deliver Triple-Digit Wins", "body": "Investing is all about profits and returns – no one puts their money into a stock without an expectation that the investment will make money. The trick, if there is one, is finding the stocks that deliver the best returns.There’s a tendency to want to jump on the bandwagons, to buy into the big names that have grabbed the headlines. And that can bring in profits – there is no doubt that Amazon and Tesla have shown astounding growth in recent months.But there is also profit and potential to be found under the radar, in smaller stocks with lower price. The risk is higher, but the possible upsides can be astounding. For less than $5 per share, investors can find Buy-rated stocks with triple-digit upside potential. That combination of factors: low cost of entry, high return potential, and the thumbs up from Wall Street’s analysts, should bring these stocks to investors’ attention.Using TipRanks’ database, we pinpointed three compelling stocks trading for less than $5 per share. Each has earned a Moderate or Strong Buy consensus rating from the analyst community and brings massive growth prospects to the table.AutoWeb, Inc. (AUTO)First on the list is AutoWeb, the online media and marketing company serving the automotive industry since the 1990s. The company provides branding and marketing support to both manufacturers and dealers, connecting the customers and working with them on email and live calling campaigns. AutoWeb works with dealers in both the new and used car markets.Since the end of July, the company’s shares have shown a sudden spike in growth, coinciding with economic reopening in a number of states. In the second quarter, AutoWeb beat the earnings consensus, showing a loss of 10 cents, while forecast had been for a 23 cents loss. Looking forward, losses are expected to moderate as the automotive sector, and the economy in general, start revving again.Based on recent growth as well as the company's $3.5 share price, Barrington analyst Gary Prestopino thinks that now is the right time to pull the trigger.Story continues“We believe that AUTO’s turnaround has been completed and the foundation has been set for transforming the business to exhibit consistently improved financial metrics. We believe that over a three- to five-year basis the company should be able to attain an adjusted EBITDA margin of close to 10%, which is a level last attained in 2016,” Prestopino opined.Along with those comments, Prestopino rates AUTO an Outperform (i.e. Buy). His $10 price target suggests a robust one-year upside potential of 186% from the current share price of . (To watch Prestopino’s track record, click here)Overall, AutoWeb stands as a 'Strong Buy' name among Wall Street analysts. In the last three months, the stock has won 3 bullish recommendations. With a return potential of 81%, the stock's consensus price target lands at $6.33. (See AUTO stock analysis on TipRanks)Euroseas, Ltd. (ESEA)Our next stock, Athens-based Euroseas, is a shipping company, moving dry cargoes and containers worldwide on a fleet of 15 vessels. Vessels like these – especially the container ships – form the backbone of the shipping industry, and are a vital link in the global trading network.Euroseas operates most of its fleet on time charters, prioritizing predictable cash flows over profit margins. That proved beneficial in 1H20, as the company has reliable income despite the general economic slowdown. In Q1, revenues rose sequentially from $13.3 million to $15.4 million. Q2 saw a sequential decline – but still had revenues come in at $13.5 million, and EPS in the second quarter rose 47% to 25 cents per share.With this in mind, Noble Financial, Poe Fratt sees this stock as a buying opportunity.“While the past few months have been challenging and the container market has been weak, there are some signs that the market is firming and the recent stock price weakness creates a favorable risk/reward profile,” Fratt commented.Fratt sets a $6.25 price target to back up his Outperform (i.e. Buy) rating, implying room for 122% upside potential. (To watch Fratt’s track record, click here)Overall, there are two recent reviews on ESEA, and both are Buys, making the consensus view here a Moderate Buy. The stock is selling for $2.85 and has an average price target of $5.55, giving it an upside potential of 94% for the year ahead. (See ESEA stock analysis on TipRanks)Exterran Corporation (EXTN)Last on the list is an energy company, Exterran. This company solutions for midstream infrastructure in the oil and gas industry, with operations worldwide. The company’s products include oil and gas production equipment, natural gas processing and compression expertise, and transportation and power generation. Exterran offers oil and gas companies engineering expertise to move the product from the wellhead through the pipelines.Like most of the energy industry, the corona economic slowdown hurt Exterran. In Q1 and Q2, revenues fell 22% and 18%, respectively, and both quarters saw EPS loses. In Q2, the loss hit 62 cents per share. Stock price has been depressed, as well, with shares having shown high volatility for the past year, but no distinct trend.Looking ahead, the slow reopening of economies is beginning to take hold, and EXTN sees Q3 projections rising from current lows as new opportunities and contracts open up.James West, analyst Evercore ISI, locks onto that last point as key for Exterran.“As a systems and process business tied to the global infrastructure buildout for oil, gas, water and power, Exterran has the enviable position of providing primarily production-oriented products and services… We believe the company is on the cusp of a new order cycle driven by global infrastructure buildout, which has only been temporarily paused by COVID-19. EXTN booked a record integrated gas processing facility order for the Middle East at the start of the year, and a couple of large project awards are imminent including the company’s first water contract,” West noted.West gives EXTN shares a $10 price target, indicating his confidence in a 110% upside and backing his Outperform rating. (To watch West’s track record, click here)Overall, EXTN has a Moderate Buy analyst consensus rating based on 2 recent Buy reviews. This stock’s shares are selling for $4.65, and its $11 average price target suggests a 131% one-year upside potential. (See EXTN stock analysis on TipRanks)To find good ideas for penny stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment."}]}