{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-october-6-2020-222434352.html", "published": 1601997200.0, "headline": "Stock market news live updates: Stocks fall after Trump says he is 'rejecting' House Democrats' $2.2 trillion stimulus proposal", "body": "Stocks fell Tuesday after President Donald Trump said he opposed House Democrats’ $2.2 trillion virus relief proposal, effectively stamping out hopes that another round of fiscal stimulus to aid the virus-stricken economy would come before the election.[Click here to read what’s moving markets heading into Wednesday, October 7]“We made a very generous offer of $1.6 Trillion Dollars and, as usual, she is not negotiating in good faith,” Trump wrote in a Twitter post Tuesday afternoon. “I am rejecting their.. ... request, and looking to the future of our Country. I have instructed my representatives to stop negotiating until after the election when, immediately after I win, we will pass a major Stimulus Bill that focuses on hardworking Americans and Small Business.”Stocks, which had traded mixed earlier in the day, fell sharply, with the Dow dropping more than 250 points, or about 0.9%. The Nasdaq underperformed, dropping 1%.Treasury Secretary Steven Mnuchin and House Speaker Nancy Pelosi had been slated to hold more discussions around the size of another round of virus-related relief measures on Tuesday, following about a week of regular phone calls over the package. The negotiators had so far remained at an impasse over the dollar sum of the next round of relief, with Mnuchin last offering a deal worth about $1.6 trillion.Other policymakers have called for further fiscal stimulus in the near-term to help support the economy. Federal Reserve Chair Jerome Powell, in virtual remarks during the National Association for Business Economics’ Annual Meeting, re-upped his assertion that further fiscal support would help promote a faster economic recovery when working alongside the Federal Reserve’s own efforts.“The recovery will be stronger and move faster if monetary policy and fiscal policy continue to work side by side to provide support to the economy until it is clearly out of the woods,” Powell said.Meanwhile, investors also continued to eye developments around the election in light of Trump’s recent Covid-19 diagnosis. Trump departed Walter Reed National Military Medical Center on Monday to return to the White House, just days after entering the hospital on Friday to be treated. White House physician Dr. Sean Conley said Trump had “met or exceeded all standard hospital discharge criteria,” while conceding that he “may not be entirely out of the woods yet” in his recovery process.Story continuesIn the days since, Vice President Joe Biden has widened his lead in a number of recent polls capturing the period following the Trump’s positive Covid-19 test. A Reuters/Ipsos poll conducted Oct. 2-3 showed Biden ahead by 10 percentage points, for an increase in his lead since the period after the first presidential debate but before Trump announced his virus test result.Lisa Shalett, Morgan Stanley Wealth Management chief investment officer, told Yahoo Finance on Monday that the widening in the polls – more so than the candidate in the lead himself – helped remove an element of uncertainty that had recently been weighing on stocks.“As the polls widen, the only thing that that’s telling you is that the odds of this being an election that doesn’t get decided for weeks or months perhaps comes off the table,” Shalett said. “And I think that last week and the last week in September was really dominated by that, where people were less concerned about who wins, and this idea that somehow our democracy was going to be so challenged that we weren’t going to know the results of a presidential election unless it went to court.”“I don’t think investors want this to go to court, regardless of whether the winner has a blue shirt or a red shirt at the end of the day,” she added. “And I think that with widening polls that possibility gets taken off the table and so a little bit of risk premium comes out.”Others, however, maintained that investors were more specifically pricing in the rising likelihood of a Biden presidency and potential for a Democratic sweep.“To me, the optimism in the market has to do with an increased conviction that Joe Biden will win [the presidency] and that will bring in a Blue Wave which in turn, will bring a large fiscal stimulus package early next year,” Isaac Boltansky, Compass Point Research director of policy research, told Yahoo Finance’s The First Trade.—4:04 p.m. ET: Dow drops 376 points, or 1.3%, after Trump calls for an end to stimulus talks until after the electionHere were the main moves in markets as of 4:04 p.m. ET:S&P 500 (^GSPC): -47.68 (-1.40%) to 3,360.95Dow (^DJI): -375.88 (-1.34%) to 27,772.76Nasdaq (^IXIC): -177.88 (-1.57%) to 11,154.60Crude (CL=F): +$0.82 (+2.09%) to $40.04 a barrelGold (GC=F): -$27.00 (-1.41%) to $1,893.10 per ounce10-year Treasury (^TNX): -2 bps to yield 0.7420%—2:54 p.m. ET: Trump says he is ‘rejecting’ House Democrats’ $2.4 trillion virus relief packagePresident Donald Trump wrote in a set of Twitter posts Tuesday afternoon that he would be “rejecting” House Democrats’ $2.4 trillion virus relief proposal, which the chamber voted to advance on Thursday.“Nancy Pelosi is asking for $2.4 Trillion Dollars to bailout poorly run, high crime, Democrat States, money that is in no way related to COVID-19,” Trump wrote in the post. “We made a very generous offer of $1.6 Trillion Dollars and, as usual, she is not negotiating in good faith. I am rejecting their.. ... request, and looking to the future of our Country. I have instructed my representatives to stop negotiating until after the election when, immediately after I win, we will pass a major Stimulus Bill that focuses on hardworking Americans and Small Business.”Trump added that he requested that Senate Majority Leader Mitch McConnell “focus full time” on approving his nominee Judge Amy Coney Barrett to the US Supreme Court....request, and looking to the future of our Country. I have instructed my representatives to stop negotiating until after the election when, immediately after I win, we will pass a major Stimulus Bill that focuses on hardworking Americans and Small Business. I have asked...— Donald J. Trump (@realDonaldTrump) October 6, 2020—1:26 p.m. ET: S&P 500, Dow rise intraday while Nasdaq holds slightly negativeThe three major indices were mixed Tuesday afternoon, with both the S&P 500 and Dow higher while the Nasdaq remained slightly in negative territory.Here were the main moves in markets, as of 1:27 p.m. ET:S&P 500 (^GSPC): +7.26 points (+0.22%) to 3,416.01Dow (^DJI): +106.36 points (+0.38%) to 28,255.00Nasdaq (^IXIC): -10.44 points (-0.09%) to 11,322.10Crude (CL=F): +$1.15 (+2.93%) to $40.37 a barrelGold (GC=F): -$10.90 (-0.57%) to $1,909.20 per ounce10-year Treasury (^TNX): +1.8 bps to yield 0.78%—11:14 a.m. ET: Boeing shares fall after company slashes 10-year forecast for new aircraft demand, as pandemic poses ‘significant challenges’ to industryShares of Boeing (BA) dipped in intraday trading after the company said in newly released projections that it expects commercial aircraft demand will total 18,350 in the next decade, for an 11% drop from its previous 2019 forecast.“The 2020 Boeing Market Outlook (BMO) projects that the commercial aviation and services markets will continue to face significant challenges due to the pandemic, while global defense and government services markets remain more stable,” the company said in the report.“Airlines globally have begun to recover from a greater than 90% decline in passenger traffic and revenue early this year, but a full recovery will take years, according to the outlook,” it added.—10:45 a.m. ET: Fed Chair Powell reiterates call for fiscal stimulus to help support the economic recoveryFederal Reserve Chair Jerome Powell, in prepared remarks for the National Association for Business Economics’ Virtual Annual Meeting, doubled down on his assertion that fiscal stimulus out of Congress would help support the virus-stricken economy, given the limits of monetary policy on its own.“I would argue that the risks of policy intervention are still asymmetric. Too little support would lead to a weak recovery, creating unnecessary hardship for households and businesses,” Powell said in the text of the remarks. “The recovery will be stronger and move faster if monetary policy and fiscal policy continue to work side by side to provide support to the economy until it is clearly out of the woods.”—10:00 a.m. ET: Job openings fell for the first time since April in AugustUS job openings declined in August for the first time in four months, reaffirming a slowdown in the labor market with the pandemic still under way.Job openings in the US totaled 6.493 million in August, down from July’s 6.697 million, according to the Bureau of Labor Statistics’ monthly report. Consensus economists were looking for available positions to come in at 6.5 million, according to Bloomberg data.The number of new hires were roughly flat at 5.9 million during the month, and total separations fell to 4.6 million, comprising both those who voluntarily left their jobs as well as those laid off.—9:37 a.m. ET: Stocks open mixedHere were the main moves in markets as of 9:37 a.m. ET:S&P 500 (^GSPC): +1.56 points (+0.05%) to 3,410.19Dow (^DJI): +54.45 points (+0.19%) to 28,203.09Nasdaq (^IXIC): -11.47 points (-0.11%) to 11,320.58Crude (CL=F): +$1.38 (+3.52%) to $40.60 a barrelGold (GC=F): +$3.20 (+0.17%) to $1,923.30 per ounce10-year Treasury (^TNX): +0.8 bps to yield 0.77%—8:30 a.m. ET: US trade deficit widened to $67.1 billion in August, the biggest since 2006The US trade deficit yawned further to $67.1 billion in August from $63.4 billion in July, the Commerce Department said Tuesday. This marked the widest since August 2006, as the coronavirus pandemic weighed heavily on global trade, and as imports recover more quickly than exports in the wake of the outbreak.Imports rose 3.2% month-over-month to $239 billion, according to the report. Exports rose 2.2% to $171.9 billion.For the year-to-date, the US deficit in goods and services jumped by 5.7%, or $22.6 billion, from the same period last year, with exports down 17.6% and imports down 13.1%.—7:20 a.m. ET Tuesday: Stock futures point to a muted open as Wall Street searches for directionHere were the main moves in markets, as of 7:20 a.m. ET:S&P 500 futures (ES=F): 3,385.75, down 7.25 points or 0.21%Dow futures (YM=F): 27,991.00, down 4 points or 0.01%Nasdaq futures (NQ=F): 11,427.50, down 41.75 points or 0.36%Crude (CL=F): +$0.51 (+1.3%) to $39.73 a barrelGold (GC=F): -$1.30 (-0.07%) to $1,918.80 per ounce10-year Treasury (^TNX): +0.8 bps to yield 0.77%—6:10 p.m. ET Monday: Stock futures tick higher to extend earlier gainsHere were the main moves in equity markets, as of 6:10 p.m. ET Thursday:S&P 500 futures (ES=F): 3,394.25, up 1.25 points or 0.04%Dow futures (YM=F): 28,015.00, up 20 points or 0.07%Nasdaq futures (NQ=F): 11,481.00, up 11.75 points or 0.1%People walk by the New York Stock Exchange (NYSE) in lower Manhattan on October 5, 2020 in New York City. - Stock markets bounced back on reports suggesting Donald Trump's health had improved after his positive test for the coronavirus, with traders also cheered by signs that U.S. lawmakers were edging towards agreement on a new stimulus package. (Photo by Angela Weiss / AFP) (Photo by ANGELA WEISS/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}