{"article": [{"url": "https://finance.yahoo.com/news/americans-health-care-coronavirus-pandemic-142730691.html", "published": 1597916120.0, "headline": "43% of working Americans lacked stable health care as coronavirus pandemic spread", "body": "The coronavirus pandemic has highlighted many flaws within the U.S. health care system, particularly how many Americans are still struggling with health care access and affordability.A new survey by The Commonwealth Fund, which included a nationally representative sample of 4,272 U.S. adults ages 19 to 64 and was conducted from January 14 through June 5, found that 43% of working Americans were underinsured, i.e., they lacked stable health care.Inez Willis, a senior citizen, sorts her daily medical prescriptions at her independent living apartment in Silver Spring, Maryland April 11, 2012. REUTERS/Gary Cameron (UNITED STATES - Tags: SOCIETY HEALTH)The Commonwealth Fund defines “underinsured” as someone who’s been insured continuously for the past 12 months and their out-of-pocket costs are equal to 10% or more of household income, if their out-of-pocket costs (not including premiums) for the past 12 months are equal to at least 5% of household income for individuals living under 200% of the federal poverty level, or if they have a deductible that’s 5% or more of household income.And while low-income individuals had underinsured rates twice as high as their higher-income counterparts, it’s those with private health care plans — which includes ACA marketplace plans — that have the highest underinsured rates.13% of people were uninsured at the time of the survey. (Chart: The Commonwealth Fund)Uninsured Americans 'have a disincentive to get the health care'Those with employer-sponsored health care can still be considered underinsured, depending on how much they are paying out-of-pocket, and one out of four adults in employer-sponsored health plans qualify as underinsured.“Because there were an estimated 122 million working-age people in employer plans, compared to just 15 million in the individual market, there were far more underinsured people with employer coverage than with individual market insurance,” the report stated. “The growth in the underinsured since 2010 has been driven by increasingly inadequate coverage in employer health plans.”Employee premiums and deductibles are particularly high in the South. (Graphic: David Foster/Yahoo Finance)Part of this is driven by high premiums and deductibles. Over the past 10 years, the number of adults in private health plans with deductibles of $1,000 or more has doubled. And while deductibles have been rising, household income has not been keeping up.Story continues“People in employer-based plans make wage concessions in order to have benefits,” Sara Collins, vice president at The Commonwealth Fund, told Yahoo Finance. “Your health insurance is part of your overall compensation. So as your health care expenses go up, you’re not going to see the big increases in wages that you would otherwise see if perhaps your insurance wasn’t going up so much, costs were going up so much.”And with insurance costs rising — which could happen even more over the next several years because of the coronavirus — premiums and deductibles are also rising.Deductibles have continued to increase over the past decade. (Chart: The Commonwealth Fund)“What people are exposed to is increasing,” Collins said. “But at the same time, their income isn’t growing as fast. They have a disincentive to get the health care that they need, and so we see that people who are underinsured or who have high deductibles are a lot less likely to get health care because of the cost that they might face.”There is evidence to support this claim: A 2019 Gallup poll found that “a record 25% of Americans say they or a family member put off treatment for a serious medical condition in the past year because of the cost, up from 19% a year ago and the highest in Gallup’s trend.”(Source: Gallup)Similarly, the Commonwealth survey found that 35% of adults reported either not filling a prescription, skipping a recommended test/treatment/visit, not going to the doctor when sick, or not seeking a specialist because of the cost involved. This is more likely to happen with those who have high deductibles of at least $1,000 or more.‘They’re just highly exposed to the financial cost of that care’Medical debt isn’t a new issue to Americans, but it is an increasingly troubling trend.About 37% of adults with medical bills stated they used all of their savings to pay off their debt, according to the Commonwealth survey, while 40% reported seeing a drop in their credit score because of the medical debt.While some Americans put off health care due to cost, others take on the cost burden.And when they do pay for health care, “they’re just highly exposed to the financial cost of that care,” Collins said. “We also find that can have lingering implications financially — people using up all their savings, for example, in order to pay for their bills, or having a reduced credit card rating because of medical debt.”The survey found that 54% of adults paying off medical debt have debts of $2,000 or more. And, 31% incurred credit card debt while 25% were unable to pay other bills, like heat, rent, or groceries.Patient Sharon Dawson Coates has her knee examined by Dr. Narang at University of Chicago Medicine Urgent Care Clinic in Chicago. REUTERS/Jim YoungHalf of adults who were uninsured at any point indicated they had problems paying their medical bills. And even 25% of adults who didn’t meet the “underinsurance” threshold also had trouble paying bills. These issues include damage to credit ratings and depleted savings.There is also a racial component: Black adults at 45% are more likely than White adults at 35% to have problems paying their medical bills.The most vulnerable are those whose incomes are below 133% of the federal poverty level. This is partly due to the Obamacare “glitch” — a coverage gap that has left an estimated 4.8 million people uninsured in the 13 states that have yet to expand Medicaid.Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Supreme Court to hear arguments on Obamacare, now crucial amid coronavirus pandemic, right after electionObamacare 'glitch' magnified as Americans scramble for health care amid coronavirus pandemicMillions of American workers lost health insurance as coronavirus pandemic worsenedRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}