{"article": [{"url": "https://finance.yahoo.com/news/economist-pay-people-1-k-to-take-a-coronavirus-vaccine-instead-of-forcing-them-222034662.html", "published": 1598694620.0, "headline": "Economist: Pay Americans $1,000 each to take a coronavirus vaccine", "body": "Public health experts are increasingly concerned about the possibility that a coronavirus vaccine will be successfully developed but not enough Americans would be willing to receive it.About 70% of a population being vaccinated represents the threshold needed for herd immunity, which dramatically slows the spread of viruses.Given the potential problem, an expert from the Brookings Institution suggests that the government pay Americans $1,000 each to take the vaccine.“If we don’t get herd immunity, we’re not getting our economy back and we’re not getting our society and our lives back,” Robert Litan, an economist who served in the Clinton administration and the Brookings scholar who authored the report, told Yahoo Finance (video above). “If you paid $1,000 a person — so for a family of four you’re talking $4,000. In these hard times, that’s a lot of money and I think a lot of people would take the vaccine for $1,000.”Once the U.S. epicenter, New York's coronavirus cases have decreased dramatically. (Graphic: David Foster/Yahoo Finance)Top infectious disease expert Dr. Anthony Fauci, who said recently he would “settle” for a vaccine that is 70-75% effective, has stated that the U.S. would not reach herd immunity if as many as 25% of the population chose to not get vaccinated.\"That's one of the reasons why we have to make sure we engage the community as we're doing now, to get community people to help us, for people to understand that we are doing everything we can to show that it's safe and that it's effective and that it's for the good of them as individuals and in society to take the vaccine,\" he told CNN in June.Americans who step forward to take the vaccine should receive $200 upfront, according to Litan’s proposal, with the remainder being paid once the country has reached herd immunity.“So now everyone that takes the vaccine has an incentive to go on social media,” Litan said, “talk to their friends, talk to their family, talk to their church colleagues, etc work colleagues, and say, ‘Hey take the vaccine because you and I will both get that extra $800.’”Story continuesCounselor to the President Kellyanne Conway wears a mask before the US president speaks on vaccine development in the Rose Garden of the White House in Washington, DC on May 15, 2020. (Photo: MANDEL NGAN / AFP)‘The alternative is as long as people stay home’Litan added that trying to mandate a vaccine shot on the population could backfire.“If the government tried to force people, you’d have a huge counter reaction,” he said, “much worse than the anti-masking kind of thing we see today.”Paying Americans $1,000 each to reach 80% herd immunity would cost the U.S. roughly $275 billion.“The alternative is as long as people stay home and we have massive unemployment,” Litan said. “We’re losing trillions of dollars annually in lost economic output because our economy is not at full employment. And so to get a shot for $275 billion to get our lives back and our economy back seems to me the best investment you can make and it’s cheap in comparison to the alternative.”Litan’s proposal has its critics, including Milken Institute Chief Economist William Lee.“That’s a lot of money,” Lee exclaimed. “Just to get that number in perspective, that’s half the cost of Medicaid [spending],” he said, which totaled $616 billion in 2019.More from Sibile:Democratic Rep. blasts Trump on USPS woes: ‘No hope’ of waking up knowing who won the electionTrump payroll tax deferment is ‘employee relations disaster’Coronavirus gut check: How small businesses are survivingHow Hollywood content can ‘normalize injustice’Michigan Gov. Whitmer, potential VP pick, has ‘good relationship’ with Biden, says Lt. Gov.Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}