{"article": [{"url": "https://finance.yahoo.com/news/a-really-tough-spot-for-employees-how-companies-are-enforcing-mask-compliance-201825772.html", "published": 1598023580.0, "headline": "'A really tough spot' for employees: How companies are enforcing mask compliance", "body": "As Lowe’s (LOW), Home Depot (HD), Starbucks (SBUX), Walmart (WMT), McDonald’s (MCD) and other businesses implemented mandatory mask orders earlier this summer, workers and customers alike found themselves frustrated by noncompliance.“At Lowe’s,” one frustrated employee wrote to Yahoo Finance, “we are told to not confront customers who will not wear a mask, or wear it properly. How is a policy without enforcement, actually a policy?”Since the beginning of the coronavirus crisis, businesses have both reacted quickly to mask mandates and encountered problems as their usage has been politicized.Six months into the crisis, however, the situation is normalizing and businesses are learning and evolving — as are their customers.‘A really tough spot’ for employeesA few weeks ago, a 17-year-old employee at Sesame Place, a theme park in Pennsylvania, was punched in the face by an aggressive couple who refused to wear masks. The employee had asked the couple to wear them once, without confrontation, and after receiving a second reminder, the guests became violent. Noncompliance of the park's policy, reports said, results in a guest being asked to leave as the safety of customers and staff is paramount during the pandemic.This is the worst-case scenario many companies fear, and many have created their policies to avoid aggressive confrontations like this — even though accounts note that the Sesame Place worker did everything by the book.This is why Lowe’s takes the stance that may frustrate some.“We will not ask our associates to put their safety at risk by confronting customers about wearing masks,” a spokesperson said.The National Retail Federation (NRF) and the National Restaurant Association all have been working to communicate best practices and de-escalation training to help their members deal with these new situations, something that only some people have experience with.“This is totally new territory,” said the NRF’s general counsel and chief administration officer Stephanie Martz.Story continuesA Home Depot employee wears a protective mask while on the job, Saturday, April 11, 2020, in Somerville, Mass. (AP Photo/Michael Dwyer)The pandemic has put employees in a “really tough spot,” a spokesperson from a big retailer who wished to remain anonymous said. They are “trying to do the best they can.”This company instructs employees to follow a script, but if someone really wants to not wear a mask, they’re not stopped. By their calculus, it’s better to have one person a week come in without a mask than a fight.Martz said that some retail employees have experience with loss-prevention and shoplifters, but even in those circumstances, best practices often rely on non-confrontational methods like video and law enforcement involvement, not having an employee actively address or confront customers.And adding to the confusion, Martz said, is that some jurisdictions require stores to enforce — further complicating the system and adding more burden on employees and store managers.How it works right nowThe way most retailers operate now begins by having an employee refer a customer without a mask to signage explaining store policy. If that doesn’t work, they begin a dialogue and try to get them in and out as fast as possible. Many stores will provide masks for customers who don’t have one.“For safety reasons, we have asked our employees to avoid escalated confrontations with customers who decline to comply, and to instead help them complete their purchases as quickly as possible while providing information about other options we have available for their future needs, including free home delivery for prescriptions and our drive-thru window service,” said Mary Owens, a spokesperson for CVS.Some companies like Walmart take things a step further by having “health ambassadors” at the door urging mask adherence.A shopper wears face masks as she leaves a Walmart retail store in Vernon Hills, Ill., Thursday, July 30, 2020. Many retail stores are requiring customers to wear face masks inside all of their stores where local governments do not require it amid the coronavirus pandemic. However, limited enforcement, at Walmart avoids physical confrontations with customers who refuse to wear a mask. (AP Photo/Nam Y. Huh)“If a customer doesn’t want to wear a face covering, our health ambassadors notify a member of management, who will talk to the customer and try to find a solution,” Walmart spokesperson Casey Staheli told Yahoo Finance. “We are also working with customers who are unable to wear a face covering due to medical reasons or religious beliefs.”“It gets difficult when the basis for not wearing a mask becomes ideological,” said Martz. “Some of them are trying to provoke a confrontation.”Home Depot has a non-confrontational policy, but strikes a middle ground. The company told Yahoo Finance that it's too dangerous to forcibly or physically deny entry.“That said, if a customer becomes combative or habitually refuses to comply, we could take further action to prevent them from entering our stores,” a spokesperson said.Since the pandemic, Martz said, there have been encouraging signs in stores as governors in states with lower compliance decided to join the chorus of mask-wearing.“Things normalized and settled down after an initial bump of nastiness,” said Martz. “You can obviously still find on social media new videos of incidents of people not wearing masks but that's anecdotal.”However, she added, it’s not like the problem is immediately going to go away. “We’re concerned about what happens as tensions increase as school goes back and holiday shopping begins,” she said.Hospitality industry has a slightly different approachRestaurants are a different story. A customer comes into a store because they’re in need of something, but in a restaurant setting, it’s more of a want — and that voluntary aspect helps adherence, said Larry Lynch, SVP of certification and operations at the National Restaurant Association.“Confrontations are happening more when someone has to go to shop or do something,” he said. And that’s not the case for restaurants.Things have been getting better, Lynch said, and the organization has issued guidance like signage and encouraged de-escalation training. Every restaurant can set its own policy, of course, but Lynch said that restaurants might still seat people who refuse to wear masks and simply seat them as far away from other patrons as possible.In these circumstances, it’s less of a big deal since seated customers generally do not wear masks since they are eating. But when there is a problem, Lynch noted it’s not always easy or natural to deal with conflict given the nature of the industry.“People aren’t trained to deal with that type of hostility,” Lynch said. “In the early stages of the reopening was a much more confrontational attitude. People would say, ‘these are my rights and I don't have to wear a mask.’ But as time has gone on, people are starting to get it.”McDonald’s, for example, has been especially proactive and transparent about how it’s dealing with these situations.“In those situations where a customer declines to wear a face covering, we’ll put in place additional procedures to take care of them in a friendly, expedited way,” the company says. “Additionally, we will provide training for our restaurant staff to ensure they are prepared to address this new policy in a friendly and positive way. We also will re-share resources for our and our franchisees’ employees who want to revisit de-escalation training.”The most aggressive enforcement is on the tarmac and in the airIn a restaurant, you can seat someone far away from others. But this isn’t typically the case on an airplane.So far, airlines, which have been battered badly by the economic fallout over the coronavirus, have displayed little patience for customers refusing to wear masks and are taking no chances, banning people from flights if necessary.Utah Gov. Gary Herbert, center, looks on as a plane filled with personal protective equipment is unloaded at the Delta Hanger Wednesday, April 15, 2020, at the Salt Lake International Airport. (AP Photo/Rick Bowmer)“Airlines take this very seriously and are strictly enforcing their face-covering policies and determining appropriate consequences for passengers found in noncompliance, including placing travelers who do not comply on a do-not-fly list for the duration of the pandemic,” said Katherine Estep, spokesperson for Airlines for America, the major trade group for U.S. airlines. “The face-covering requirement is a key component in this layered approach to protecting the well-being of our employees and the traveling public.”So far, many airlines have displayed a zero-tolerance policy, which has been both welcome and a source of consternation, as a mother was recently kicked off a JetBlue flight because her 2-year-old child wasn’t wearing a mask.With months and perhaps well over a year until an effective vaccine becomes widely available, this remains an ongoing issue that is subject to change — especially as more data and studies suggest best practices to limit the virus’s spread.-Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Coronavirus has hurt the credit card businessYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteranMost companies plan to give raises and bonuses in 2021: surveyThe key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right now"}]}