{"article": [{"url": "https://finance.yahoo.com/news/most-latinos-still-believe-in-the-american-dream-of-owning-a-home-report-173245502.html", "published": 1601556020.0, "headline": "Most Latinos still believe in the American Dream of owning a home: report", "body": "The coronavirus pandemic drained Latino and Hispanic Americans’ purses more than it did for other groups — but a new report shows that the recession is not deterring Latinos’ aspirations to buy a home.Read more: Buying a house: What you need to know about home ownershipSome 40% of Latino renters still plan to buy a house in the next five years, compared to only 33% of non-Hispanic white renters, according to an August study by the National Association of Hispanic Real Estate Professionals (NAHREP). The report used the terms Latino and Hispanic interchangeably to refer to people of Mexican, Puerto Rican, Cuban, Central American, South American and Dominican descent, and descent from other Spanish-speaking countries.“There is an overwhelming desire for homeownership among the Latino community,” said Noerena Limón, senior vice president of public policy and industry at the NAHREP.In fact, many Latinos moved forward with homebuying plans even as the coronavirus pandemic shut down the real estate market. Compared to the same time in 2019, 2.4% more Latinos applied for a mortgage in April, May and June, compared to only 1% of the rest of the U.S. population, according to the study.Limón attributes continued homeownership plans to the innate hope, resilience, gratitude and entrepreneurship in immigrant-rooted communities. Some 35% of Latino households expect to be better off financially a year from now compared to only 23% of non-Hispanic whites, the study found.“Every survey I have ever seen shows Latinos being more optimistic than other populations,” said Limón.Latinos are 21% more likely to be considered essential workers during the pandemic than non-Hispanic whites, according to the study.High unemployment But Latino employment has taken a hit during the pandemic. Latinos are twice as likely (18% compared to 9%) to report at least one layoff in their household during the pandemic compared to non-Hispanic whites. Experts attribute Latino employment losses to employment concentrations in the leisure and hospitality industries, which were among the hardest-hit during the pandemic.Story continuesAs a result Hispanic homeowners were twice as likely to be behind on mortgage payments, corresponding proportionally to Latino unemployment rates during the pandemic. And one-fifth of Hispanic homeowners said in July they had no or slight confidence that they could pay their mortgage in August, the lowest confidence rate of all groups.But the difficult time is expected to be temporary.“I think overall we’ll see somewhat of a slowdown from unemployment, but I don’t foresee there being a long-term impact in Latino homeownership,” said Vanessa Alvarez, co-founder of Nexme, a Seattle-based real estate startup, citing protective factors such as family contributions to down payments and mortgage payments. Some 17% of Latino households — and 22% of multigenerational Latino households — pooled money to help family pay bills during the pandemic compared to 10% of all households.As Latinos weather unemployment, their savings have dwindled. Some 46% of Latinos have had to dip into savings during the pandemic, compared to 42% of non-Hispanic whites, according to the study.“We saw from the survey that Latinos are not taking on more credit card debt or loans, but they are relying on savings through the pandemic. That’s how they are making up for lost income. But that means that while the pandemic might have a short term impact, long-term, Latinos won’t be in more debt because of the pandemic,” said Limón.By 2030, 56% of all new homebuyers will be Hispanic, according to Freddie Mac.‘Hispanic buying power is increasing’Latinos accounted for 31.4% of U.S. homeownership growth from 2019 to 2020 and 50% of homeownership growth over the past decade.“Hispanic buying power is increasing, and we’re the fastest-growing population in the U.S., so being able to focus services toward the Latino community is important,” said Alvarez. There are 60.6 million Latinos in the U.S., the second largest demographic group representing 18.6% of the population.Some 48.9% of Latinos were homeowners in the first quarter of 2020, up from 45.6% in 2016 — the highest growth rate of any ethnicity, according to the study. In the U.S. economy at large, Latino purchasing power is projected to reach $1.7 trillion this year, a 70% increase since 2010 and nearly twice the growth of purchasing power among non-Hispanic whites.Part of the reason for Latino homebuying strength is that Latinos are entering prime home buying age. The median age of a Latino American is 29.8, nearly nine years younger than the general population and 14 years younger than non-Hispanic whites. One in five first-time homebuyers in the U.S. are Hispanic or Latino, according to the study, and by 2030, 56% of all new homebuyers will be Hispanic, according to Freddie Mac.“The increase in the number of Latinos owning homes today is incredible — and for a long time, it was an effort and a struggle because of the wages that immigrants get when they first come to this country,” said Alvarez, who advocates making real estate services and education more accessible for Spanish speakers.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Here is where Trump and Biden stand on housing issuesHomebuilders are holding back sales amid historic demand‘Lenders don’t have the capacity’ to meet mortgage demand: expert"}]}