{"article": [{"url": "https://finance.yahoo.com/news/world-banks-malpass-china-needs-to-fully-participate-in-debt-relief-194639556.html", "published": 1598280860.0, "headline": "World Bank's Malpass: China needs to 'fully participate' in debt relief", "body": "World Bank President David Malpass said that the Chinese government and its creditors need to participate in coordinated efforts to provide debt relief to the world’s poorest countries.“They need to fully participate, that’s been the challenge,” Malpass told Yahoo Finance in an interview August 24.China has become a major creditor to the developing countries of the world, and researchers estimate that China and its various agencies have lent about $1.5 trillion in direct loans and trade credits to more than 150 countries.Broadly, the World Bank is concerned about the ability of developing economies to pay their creditors. To coordinate some payment plan for debtor countries, the World Bank has worked with its sister organization, the International Monetary Fund, in convening a group of creditor nations known as the Paris Club.But China is not part of that club, raising questions over how to engage one of the world’s largest creditors. Malpass said the World Bank has been taking on a country-by-country approach to ensuring a moratorium on debt repayment, which he hopes will be extended through 2021.Malpass acknowledged that the web of sovereign debt ownership among countries creates “political leverage,” adding that other types of debt arrangements exist outside of government-issued bonds. For example, the Mongolian central bank has a formal currency swap agreement with the People’s Bank of China allowing Mongolia to borrow renminbi - with interest paid to the PBOC.“Transparency is very important in this because then people can look at it and understand what's going on: interest being paid from Mongolia to China on debt that's held by the central banks,” Malpass said.Malpass said he does not worry about political leverage in the relationship between the U.S. and China. Tensions have escalated between the two world powers, as TikTok and WeChat bans now threaten to complicate an already-heated discussion on trade.World Bank President David Malpass speaks during a press conference for the the Fourth 1+6 Roundtable Dialogue at the Diaoyutai State Guesthouse in Beijing, Thursday, Nov. 21, 2019. (AP Photo/Mark Schiefelbein)Although Republicans on Capitol Hill have floated the idea of cancelling U.S. debt due to China, Malpass said the two countries have a “strong” financing relationship and waved off concerns about either side weaponizing sovereign debt holdings.Story continues“That part of the system is very stable,” Malpass said.Reducing the debt stockIn the meantime, Malpass is advocating for debtor nations to reduce their debt stock. Even though low interest rates are making an attractive case for borrowing, Malpass said soaring debt will only repel potential investors.Malpass added that managing the debt stock will be difficult in a COVID-19 crisis relying on fiscal support to keep households and businesses whole.“That's been the trade-off that we've wanted to emphasize to the G20 and to the commercial creditors as well: that if they take payment from the poorest countries, that means less money in the country for food for children,” Malpass said. “It really is that dramatic.”Malpass said the World Bank is still working on efforts to reduce or even wipe off debt among the poorest countries. Part of that effort involves commercial creditors, who played a large role in the Euro Area’s prior debt crises.Malpass said the G20 has engaged banks and other private-sector creditors as part of the debt negotiation process as well.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.World Bank's David Malpass: 'Inequality problem is gigantic'Fed will not cap U.S. Treasury yields for the time beingSenate efforts to slip in lower leverage requirements brushed off by small, large banksFed lowers pricing for emergency loans to state, local governmentsA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}