{"article": [{"url": "https://finance.yahoo.com/news/the-us-economy-needs-sustained-expansion-not-a-sugar-high-former-governor-deval-patrick-164045414.html", "published": 1601380100.0, "headline": "The US economy needs 'sustained expansion' not a 'sugar high': former governor", "body": "Joe Biden’s policy proposal of higher taxes on corporations should he win the Nov. 3 presidential election may not lead to rip-your-face-off economic growth in America, but it’s what needs to be done to restore the country to good stead.And with that good stead, should come steady growth. That’s the word from former Massachusetts two-term governor and Biden supporter Deval Patrick.“If you look historically, we have had greater economic expansion and more sustained economic expansion under Democrats and higher taxes than we have today than we have historically under Republicans. This notion and — and the question about — growth has to do with whether we want a sugar high or sustained expansion. A sustained expansion means you have to invest in the things that enable people that have the economic mobility for which this country is rightly famous for and frankly, which has made a difference in my own life like education from pre-K through higher public education, the kinds of high margin industries where a knowledge-based workforce has an edge and then infrastructure,” Patrick told Yahoo Finance’s The First Trade.Patrick — a former executive at Coca-Cola and Bain — added, “That doesn’t mean any tax is good at any time. I’m one of the few Democrats who will probably tell you that the reduction in the business tax rate [under President Trump] was directionally correct. The work is incomplete because we reduced the rates and kept the loopholes. Closing the loopholes is a big step forward as one example in how we make the tax code simpler and purposeful in trying to make it work for everybody.”As part of Biden’s “Build Back Better” economic revival plan, the former vice president has put forth reversing half of the president’s signature tax cuts, lifting the statutory rate to 28%. Suffice it to say, profit-hungry Wall Street continues to voice concerns on the negative impact to U.S. economic output under Biden’s tax plan.(COMBO) This combination of pictures created on September 28, 2020 shows Democratic presidential candidate and former Vice President Joe Biden(L) speaking at a \"Build Back Better\" Clean Energy event on July 14, 2020 at the Chase Center in Wilmington, Delaware, and US President Donald Trump speaking during a briefing at the White House September 27, 2020, in Washington, DC. - At the September 29, 2020 election debate, millions of Americans will watch as the two antagonists -- who depict each other as existential threats to the country -- step into the ring live on television after months of shadow-boxing. (Photos by Olivier DOULIERY and Brendan Smialowski / AFP) (Photo by OLIVIER DOULIERY,BRENDAN SMIALOWSKI/AFP via Getty Images)The latest outcry arrives from investment bank Goldman Sachs, which has remained steadfast in their warnings on the plan in recent months.Story continues“As proposed, the Biden corporate tax plan would arithmetically reduce S&P 500 earnings by roughly 9%, excluding any potential second-order impact from economic growth, business confidence, or other factors. Of this impact, roughly half is due to the proposed hike in the statutory domestic rate,” wrote Goldman equities strategist David Kostin in a new note out Tuesday. The economic researchers at Goldman believe Biden would end up lifting corporate taxes to 25% in a scheme approved sometime in 2022.Even still, that could dent profits for S&P 500 companies by about 5% in 2022, estimates Kostin.“I’d have to slash my numbers [profit estimates] by 15% for next year, so that would certainly be a wrinkle for the market,” remarked Belpointe Asset Management chief strategist David Nelson on Biden’s tax plan possibly becoming law should he win.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.What’s hot this week from Sozzi:Peloton’s biggest rival just raised a ton of money from the likes of Stephen CurryHome Depot co-founder and Atlanta Falcons owner gives his best advice to new NY Mets ownerPeloton founder: here’s one of my biggest 15 year goalsVitamin Shoppe CEO: the pandemic has changed our businessKraft Heinz CEO: Buffett’s team like our $3.2 billion dealKroger CEO: this is how we see the future of food shoppingWatch Yahoo Finance’s live programming on Verizon FIOS channel 604, Apple TV, Amazon Fire TV, Roku, Samsung TV, Pluto TV, and YouTube. Online catch Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, and reddit."}]}