{"article": [{"url": "https://finance.yahoo.com/news/why-vp-pences-claim-that-hurricanes-arent-a-growing-problem-isnt-right-according-to-noaa-101547765.html", "published": 1602224600.0, "headline": "Why VP Pence’s claim that hurricanes aren’t a growing problem isn't right, according to NOAA", "body": "Vice President Mike Pence downplayed and denied the intensifying barrage of hurricanes pummeling the U.S. on the debate stage Wednesday, citing what he says he heard from the agency responsible for tracking the data to claim that, “there are no more hurricanes today than there were 100 years ago.”But a new report from that same agency, the National Oceanic and Atmospheric Administration (NOAA), shows that hurricanes making landfall in the U.S. are on track to set a new record in 2020, with a notable uptick in intensity and destruction.According to NOAA, not only are we pacing to pass the annual amount of storms set nearly 100 years ago, but the total of climate-related disasters this year causing more than $1 billion in damage is also already tied with the record of 16 events set in 2011 and 2017, despite three months still left to go in 2020. Overall, the U.S. averaged 13.8 billion-dollar climate disasters a year from 2015 to 2019, more than double the trend since 1980.LAKE CHARLES, LOUISIANA - OCTOBER 08: Local volunteers help board up a business ahead of Hurricane Delta on October 8, 2020 in Lake Charles, Louisiana. Residents along the Gulf Coast are bracing for the arrival of Hurricane Delta which is expected to make landfall in Louisiana on October 9. (Photo by Mario Tama/Getty Images)“When Hurricane Delta makes its impact in Louisiana, that will be the 10th hurricane or tropical cyclone to hit the U.S. this year which breaks a record previously set almost 90 years ago,” NOAA climatologist Adam Smith told Yahoo Finance’s YFi PM. “The science looking out anticipates we’ll have higher intensity hurricanes.”Hurricane Delta, which strengthened to a Category 3 storm, marks the 25th named storm this season and brings the potential for destructive winds and flooding back to the Gulf just six weeks after the region was battered by Category 4 Hurricane Laura.In Wednesday’s Vice Presidential Debate, Pence seemingly refuted climate change’s role in intensifying hurricanes with his answer that claimed, “as difficult as they are, there are no more hurricanes today than there were 100 years ago.” According to Smith, that would overlook the direct trend that rising sea temperatures is having on bringing not just more storms, but also more powerful storms.Story continues“Extremes have always happened, but climate change is making some of these extremes certainly more frequent and more intense because there’s just more energy in the atmosphere and the ocean itself,” he said.According to NOAA, 2020 has seen 16 climate disasters cross the $1 billion mark in total damages. With three months left to go in the year, that ties a record. (NOAA)The report shows it’s not just hurricanes contributing to this year’’s $50 billion in direct climate disaster costs. The 16 major events crossing the $1 billion cost threshold included 11 severe storms, three tropical cyclones, one drought, and one major wildfire event.NOAA says the cost of major climate disasters over the past five years exceeds $550 billion — the highest dollar amount for any five-year stretch since NOAA started tracking the data.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Americans are shelling out $30,000 on these pop-up backyard home offices during the pandemicThis $3 billion online education company is seeing a 'paradigm shift' due to coronavirusAnalyst who called rally off March bottom now sees this as the level to watch for stocks"}]}