{"article": [{"url": "https://finance.yahoo.com/news/hollywood-plans-innovative-alternatives-to-cope-with-postcoronavirus-challenges-113302037.html", "published": 1593067280.0, "headline": "Hollywood plans post-coronavirus restart, but normal won't return 'for a long time'", "body": "Hollywood is slowly reopening as the coronavirus pandemic rages, but with strict social distancing guidelines in place.Earlier this month, SAG-AFTRA — in conjunction with other Hollywood unions and guilds — released a detailed report outlining new health and safety procedures. The move followed a three-month industry shutdown that left the majority of workers furloughed or unemployed, and cost the industry billions.“I don’t think we’re going to be returning to normal for a long time,” SAG-AFTRA President Gabrielle Carteris told Yahoo Finance in a recent interview.“People have to remember there is no such thing as entering back into work [completely] ‘safe.’ It will only be ‘safer’, so we’ve worked with epidemiologists, scientists and the medical professionals to really talk about what that means,” added Carteris, an alumna of the hit 90s drama, “Beverly Hills 90210.”The key components of the reopening plan will include:Frequent COVID-19 testingClosed sets with no visitorsA 'zone system' to maintain social distancing measuresSanitation and disinfection practicesHollywood is reopening amid the coronavirus — with strict social distancing guidelines in place.Additionally, sets will have a designated health safety supervisor (and associated department) to take charge of the testing process and coordination.“Testing is paramount for us,” Carteris explained. “We’re looking for the best test available [to give us] that high-percentage of correct results.”Yet, some critics say the plan is not conducive to smaller-budget productions like reality TV and documentaries, which could lack the infrastructure needed for tighter regulation.“I know it’s a challenge [but] they have to be regulated like that,” Carteris said.“Maybe if they are not able to fulfill those interests that are put out by the guidelines, they shouldn’t be opening, but truly, a smaller production is not going to be as challenged because we will be able to work with those,” she added.Carteris went on to explain how larger productions are of greater concern — noting that the number of background performers will most likely be limited due to “potential downsides” and safety risks.Story continuesAnd as for those romantic kissing scenes? Well, they might just become a thing of the past. Carteris told Yahoo Finance that on-screen intimacy won’t be “as graphic” as they’ve been in recent years.“I think we’re going to go back in time a little bit to where people are able to use their imagination more,” Carteris predicted.“We’re going to find innovative ways to tell stories. You’re still going to be gratified by the intimacy that’s going to happen, but it will be shot differently, stories will be told differently,” she continued.“In the end, we’re storytellers — and this is an incredible opportunity to actually find different ways to tell [them],” she added.Alexandra is a Producer & Entertainment Correspondent at Yahoo Finance. Follow her on Twitter @alliecanal8193Read more:AMC on why it reversed course on face masks: 'We did not go far enough'Why Spotify is banking on Kim Kardashian-West as platform binges on podcast dealsFrom 'Gone With the Wind' to 'Bachelor', Hollywood is moving to address claims of racismKylie Jenner still Forbes' highest-paid celeb, despite not being a billionaire anymoreWhy ending coronavirus lockdowns 'won't be enough' to get people back to the movies"}]}