{"article": [{"url": "https://finance.yahoo.com/news/fed-to-expand-purchases-of-corporate-bonds-in-secondary-market-180806282.html", "published": 1592226980.0, "headline": "Fed to expand purchases of corporate bonds in secondary market", "body": "The Federal Reserve said Monday it will expand its efforts to backstop the corporate debt market by purchasing a “broad, diversified market index” of U.S. corporate bonds in the secondary market.The central bank says the purchases of individual corporate bonds will be used to create a “corporate bond portfolio” that meets the Fed’s existing standards on minimum rating, maximum maturity, and other criteria.Through its Secondary Market Corporate Credit Facility, the central bank has already been purchasing exchange-traded funds which include investment-grade and some high-yield corporate debt. As of June 10, the Fed has taken on about $5.5 billion in corporate bond ETFs.The Fed plans on supplementing the secondary market purchases with purchases directly from issuers through a Primary Market Corporate Credit Facility, which is not yet live.Both facilities will be supported by $75 billion of equity from the U.S. Treasury, appropriated by Congress’s Coronavirus Aid, Relief, and Economic Security (CARES) Act. The Fed says the support will allow the central bank to lever up the facility to be as large as $750 billion.The central bank says the tweak will allow the Fed to “support market liquidity and the availability of credit for large employers.”the exterior of the federal reserve building in washington, dcThe Fed had announced both facilities in late March to ensure that companies were still able to tap financing markets through the COVID-19 turbulence.The updated term sheet continues to require at least investment-grade ratings on any corporate debt purchased, with a carveout for “fallen angels” that fell to junk level after March 22. Any debt also must have a maturity of five years or less.-Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Federal Reserve grapples with links between monetary policy and income inequalityPowell: Capping US Treasury yields 'remains an open question'Fed: No rate hikes likely through 2022, projects 6.5% GDP contraction this yearFOMC Preview: Fed to focus on taming the yield curveA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}