{"article": [{"url": "https://finance.yahoo.com/news/apple-sept-15-event-how-to-watch-141123850.html", "published": 1599988760.0, "headline": "How to watch the Apple event on Sept. 15 and what to expect", "body": "Apple is hosting a major product event at 1 p.m. EST on Sept. 15, where the company is expected to debut a host of new devices including a new Apple Watch and iPad, as well as a pair of over-the-ear headphones, a first for the tech giant.It's shaping up to be quite a show, but it won't be the last of the season for Apple (AAPL), a second event later this fall is expected to focus solely on the new iPhone lineup. Apple typically hosts its iPhone event in early September, but due to the coronavirus-related production slowdowns the company has had to hold off on launching its flagship devices.But that doesn't mean you should skip the Sept. 15 show. Quite the opposite, in fact.How to watch the Apple eventNormally, Apple's events take place at its massive Cupertino headquarters inside the Steve Jobs Theater, where executives, stakeholders, celebrities, influencers, and journalists gather to see CEO Tim Cook and Apple's upper ranks show off their latest wares.But in the era of COVID-19, the event, like seemingly every other large gathering, is going virtual. For the average person, however, that's somewhat of a blessing, as it means you'll be able to follow along at home without any restrictions.Normally, Apple requires consumers use its Safari web browser to stream its events from Apple's website. But like with the company's WWDC event, which took place in June, Apple is letting consumers stream the big show from YouTube.To do that, you can use either the app or just go to Youtube.com in your browser, and navigate to Apple's official page. From there, you'll see the thumbnail for the Sept. 15 event and start streaming.What we're expecting to seeThe Sept. 15 event is expected to feature the debut of two new Apple Watches. The company currently offers two versions of its best-selling wearable called the Apple Watch Series 5 and Apple Watch Series 3. The $399 Series 5 is the top-of-the-line model and features Apple's dual-core S5, fall detection, international emergency calling, an ECG app, and more. The Series 5 has two screen sizes 40mm and 44mmStory continuesThe Series 3, meanwhile, has many of the core functions of the Series 5 including fitness tracking, heart rate tracking, water resistance, and cellular capabilities, but lacks the ECG app, compass, and fall detection offered by its more expensive stablemate. It's also got an older S3 chip, meaning it can't handle certain new features such as the upcoming hand-washing detection in the soon-to-be-released watchOS 7, the operating system that underpins the Apple Watch.Apple Watch 5 timepieces on display during the Apple iPhone 11 and Apple Watch 5 launch at the tech giant's flagship store in Regent Street, central London. (Photo by Jonathan Brady/PA Images via Getty Images)The Series 3 is also smaller than the Series 5 and its screen takes up less of its face. But that's also why the Series 3 starts at just $199.So what can we expect from Apple's upcoming releases? According to Bloomberg, Apple will replace the Series 3 with a new low-cost Apple Watch designed to take on devices from the likes of Fitbit, which is in the midst of being acquired by Google.The Series 3 is already a fine competitor to Fitbit's offerings, thanks to its design and capabilities, but it's getting long in the tooth—it was released in 2017—and is in need of a refresh.The Series 5 will be replaced by what will presumably be called the Series 6, and likely include a faster processor. According to 9to5Mac, the watch will also get a blood oxygen sensor to detect the amount of oxygen carried by your red blood cells. Such a feature could prove helpful for individuals with chronic health conditions who need to better understand their blood oxygen level on a daily basis.Apple may also be able to squeeze extra juice out of the Series 6 to better allow for sleep tracking, which is coming in watchOS 7. Currently, the Apple Watch lasts a little more than a day, and will tell you if you need to charge it before going to bed or if it needs a charge when you wake up. But a bigger battery might let you get away with not having to charge as often when using sleep tracking.A smaller HomePod and headphonesOutside of the new Apple Watches, rumors point to Apple announcing a new, smaller HomePod at its Sept. 15 event, alongside the company's own over-the-ear headphones.The HomePod, which launched in 2018, was meant to be a competitor to the likes of Amazon's Echo or Google's Home, but its $350 price tag, it's since been lowered to $299, was far more than other smart speakers. That, coupled with the inability to use apps like Spotify, made the HomePod a hard sell out of the gate, despite its fantastic audio quality.A prototype Apple HomePod is seen during the annual Apple Worldwide Developer Conference (WWDC) in San Jose, California, U.S. June 5, 2017. REUTERS/Stephen LamWith a smaller version, and the announcement that the HomePod team was working on third-party app support, Apple might finally have a mass market-ready smart speaker of its own.As for the headphones, Apple is said to be calling them the AirPods Studio, and, according to Bloomberg, they'll have their own swappable ear and head pads, so you'll be able to style them as you like.Apple's AirPods have been a monster hit for the company, becoming something of a cultural icon, so it only makes sense that the tech firm would seek to enter the over-the-ear headphones market.And if you're not done with Apple yet, we're expecting the company to host a second event later this fall where the company will show off its highly-anticipated iPhone 12 with 5G cellular connectivity. But that's a story for another time.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Netflix co-CEO on its advantage over Apple and Amazon: We have a ‘single focus’Microsoft Surface Duo review: A two-screen Android phone that could change everythingApple’s Sept. 15 event is all about the Apple Watch2 reasons fears of a dot-com style tech bubble are overblownFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}