{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-september-22-2020-222525985.html", "published": 1600787660.0, "headline": "Stock market news live updates: Stocks rise, shaking off earlier losses as tech recovers", "body": "Stocks traded choppily and then rose Tuesday on the heels of another sharply negative day for US equities. The S&P 500 fluctuated between gains and losses but closed higher, after falling for a fourth straight session on Monday for its longest losing streak since February.[Click here to read what’s moving markets heading into Wednesday, September 23] The Nasdaq outperformed, rising more than 1.7% as Apple (AAPL), Amazon (AMZN) and Facebook (FB) increased. Tesla (TSLA) shares dropped 5.6%, giving back some steep recent gains ahead of its highly anticipated inaugural Battery Day event.A blend of uncertainty around the election, a worsening coronavirus situation in Europe and parts of the US, scrutiny over big banks and concerns that further economic stimulus may not come to near-term fruition have combined to weigh heavily on equity investors, sending the S&P 500 now more than 8% below its Sept. 2 closing high. And while many tech stocks shook off earlier losses to close higher on Monday and rose on Tuesday, the group as a whole has been under press the past few weeks following a run-up earlier this summer.“Coming into September, the options market among other things and the figures on public participation showed that there was a lot of froth, particularly in the high-flying Nasdaq-type stocks. And from our point of view, the weakness in September is pretty reliable from a seasonal perspective,” Julian Emanuel, BTIG managing director and chief equity derivatives strategist, told Yahoo Finance.In terms of whether equities may slide further, “We think you have further to go,” Emanuel added. “We’re keying off the 200-day moving average to the S&P 500, currently at about 3,100 versus 3,250 or so where we are, so certainly more there, and likely a bit more than that in the Nasdaq, which really had gotten ahead of itself.”“We have been in an environment where the Vix (^VIX) has hovered in and around 30 essentially since March,” he said, referring to the volatility-tracking index that spiked to as high 82 in March before easing. “And when you back that out, that’s part of why the markets advanced as much as they did. But when you’re thinking about how much the market should correct, you know, a normal sort of 5% to 10% correction in the S&P 500 was appropriate in a Vix environment of, call it 15 to 20. We’re in a higher volatility environment – probably means probably pullback in our view.”Story continuesInvestors also continued to eye updates on fiscal stimulus, though prospects of another package passing through Congress before the November elections have dimmed. Congressional lawmakers directed questions around the pace of the economic recovery, and sought commentary around monetary and fiscal stimulus developments from Federal Reserve Chair Jerome Powell and US Treasury Secretary Steven Mnuchin on Tuesday during a hearing before the House Financial Services Committee.—4:05 p.m. ET: Tech shares rebound, sending S&P 500 1.1% higher to end 4-session losing streakHere were the main moves in markets as of 4:05 p.m. ET:S&P 500 (^GSPC): +34.51 (+1.05%) to 3,315.57Dow (^DJI): +140.48 (+0.52%) to 27,288.18Nasdaq (^IXIC): +184.84 (+1.71%) to 10,963.64Crude (CL=F): +$0.24 (+0.61%) to $39.55 a barrelGold (GC=F): -$3.90 (-0.20%) to $1,906.70 per ounce10-year Treasury (^TNX): -0.7 bps to yield 0.6640%—2:08 p.m. ET: Stocks push higher, shaking off earlier lossesThe three major indices pushed into positive territory Tuesday afternoon, with the Nasdaq leading the way higher with a gain of more than 1.3%. Each of the Big Tech FAANG names, plus Microsoft, rose in afternoon trading.Here were the main moves in markets, as of 2:08 p.m. ET:S&P 500 (^GSPC): +25.16 points (+0.77%) to 3,306.22Dow (^DJI): +95.04 points (+0.35%) to 27,242.74Nasdaq (^IXIC): +134.18 points (+1.26%) to 10,914.54Crude (CL=F): +$0.19 (+0.48%) to $39.50 a barrelGold (GC=F): -$0.70 (-0.04%) to $1,909.90 per ounce10-year Treasury (^TNX): -0.2 bps to yield 0.669%—11:48 a.m. ET: US coronavirus deaths cross 200,000 for the first time: Johns Hopkins dataDeaths related to Covid-19 in the US crossed the grim milestone of 200,000 as of Tuesday morning, according to data from Johns Hopkins University.The US has seen the most Covid-19 cases and deaths in the world, based on data tracked by the university. Brazil has counted the second-highest number of coronavirus-related deaths at 137,000 as of Tuesday.Cases in the US have totaled more than 6.8 million, followed by India with nearly 5.8 million.—11:26 a.m. ET: Mnuchin says next stimulus package should be targeted toward supporting children, jobs in vulnerable industriesTreasury Secretary Steven Mnuchin, in answering a question asked by Rep. Patrick McHenry (R., N.C.), said that the next stimulus package coming out of Congress should more narrowly target helping children and preserving jobs in industries most impacted by the pandemic, including travel, leisure and restaurants. He said he would be in favor of extending the Paycheck Protection Program, and allowing vulnerable businesses to take out second loans under the program.—11:16 a.m. ET: Stocks trade lower, erasing earlier gainsThe three major indices were mixed Tuesday mid-morning as an early advance lost steam. The financials, health-care and energy sectors led declines in the S&P 500, and the index as a whole held near the flat-line shortly after 11:15 a.m. ET.The Dow was lower by nearly 100 points, with UnitedHealth, Goldman Sachs and Dow Inc leading to the downside.—10:02 a.m. ET: Existing home sales rise 2.4% in August, matching expectations, as housing recovery continues to outperform.US existing home sales rose 2.4% month over month to a seasonally adjusted annual rate of 6.00 million in August, the National Association of Realtors said Tuesday. This matched consensus expectations, based on Bloomberg-compiled estimates. Sales were up 10.5% over the same month last year, extending the housing market’s strong recovery off the lows of the pandemic era.While August’s gain marked the third straight monthly rise in sales of previously owned homes, it was a significant slowdown from the more than 20% increases recorded in each of July and June. In July, existing home sales had risen by a 24.7% for the highest monthly gain recorded in data going back to 1968.“Home sales continue to amaze, and there are plenty of buyers in the pipeline ready to enter the market,\" Lawrence Yun, NAR’s chief economist, said in as statement. \"Further gains in sales are likely for the remainder of the year, with mortgage rates hovering around 3% and with continued job recovery.\"—9:35 a.m. ET: Stocks open higher as tech shares regain groundHere were the main moves in markets, as of 9:35 a.m. ET:S&P 500 (^GSPC): +16.01 points (+0.49%) to 3,297.07Dow (^DJI): +63.59 points (+0.23%) to 27,211.29Nasdaq (^IXIC): +53.54 points (+0.49%) to 10,831.33Crude (CL=F): +$0.39 (+0.99%) to $39.70 a barrelGold (GC=F): +9.70 (+0.51%) to $1,920.30 per ounce10-year Treasury (^TNX): -0.5 bps to yield 0.666%—7:50 a.m. ET: UK imposes new restrictions as country hits ‘perilous turning point’ over Covid-19: JohnsonUK Prime Minister Boris Johnson on Tuesday announced new restrictions on business operations in the country as it and others in Europe struggle to contain a resurgence in coronavirus cases. In a speech Tuesday evening in the UK, Johnson said the country had hit a “perilous turning point” over Covid-19, as cases there and in nearby Spain and France continued to rise.The new measures include an early 10 p.m. closure mandate for restaurants and pubs. Johnson also encouraged individuals to work from home as much as possible and imposed a mandatory face covering policy for those traveling in taxis and working in hospitality.—7:19 a.m. ET Tuesday: Stock futures point to a mixed openHere were the main moves in markets, as of 7:19 a.m. ET:S&P 500 futures (ES=F): 3,279.00, up 4 points or 0.12%Dow futures (YM=F): 27,028.00, down 27 points or 0.1%Nasdaq futures (NQ=F): 11,040.25, up 51.25 points, or 0.47%Crude (CL=F): +$0.63 (+1.6%) to $39.94 a barrelGold (GC=F): +$1.50 (+0.08%) to $1,912.10 per ounce10-year Treasury (^TNX): +0.5 bps to yield 0.676%—6:13 p.m. ET Monday: Stock futures slip after volatile sessionHere were the main moves in equity markets, as of 6:14 p.m. ET Monday:S&P 500 futures (ES=F): 3,273.00, down 2 points or 0.06%Dow futures (YM=F): 27,035.00, down 20 points or 0.07%Nasdaq futures (NQ=F): 10,969.75 down 19.25 points, or 0.18%NEW YORK, NEW YORK - SEPTEMBER 17: Bhairavi Desai speaks into a megaphone as taxi cab drivers hold a small rally in front of the New York Stock Exchange on September 17, 2020 in New York City. New York City taxi cab drivers held a day of action calling for debt forgiveness for loss of income amid work shortage due to the coronavirus (COVID-19) pandemic. (Photo by Michael M. Santiago/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}