{"article": [{"url": "https://finance.yahoo.com/news/microsoft-lost-its-best-chance-to-be-the-cool-tech-company-194022352.html", "published": 1600267700.0, "headline": "Microsoft lost its best chance to be the ‘cool‘ tech company", "body": "Wednesday, September 16, 2020This article was first featured in Yahoo Finance Tech, a weekly newsletter highlighting our original content on the industry. Get it sent directly to your inbox every Wednesday by 4 p.m. ET. SubscribeU.S. flags are seen near a TikTok logo in this illustration picture taken July 16, 2020. REUTERS/Florence Lo/IllustrationAfter TikTok rejected its bidThe great TikTok bidding war appears to be sewn up with Oracle coming in as the winner, or, as the company said, the “preferred technology partner,” of the upstart social media app owned by China’s ByteDance. And that leaves Microsoft (MSFT), which was seemingly the only serious contender for the platform, as the loser.Oracle (ORCL) confirmed the proposal, which it and TikTok hope will allay President Trump and security experts’ fears that the app poses a national security risk, though we don’t know what the deal itself will look like just yet.Microsoft’s failure to secure at least a partnership with TikTok is a setback for the company in a number of ways. It means the tech giant won’t reach the millions of teens who use the social network, which allows users to share and view short-form videos, and expand its name recognition among Gen Zers outside of its Office software and Xbox.It also loses out on the data those teens generate, which could help it develop more products and add to advertising business.But there could be a silver lining to Microsoft’s loss in that it won’t have to deal with the potential fallout that may come if the deal doesn’t work in the long run. It also helps Microsoft escape the kind of scrutiny that comes with working alongside a consumer-focused social network.Name recognition and valuable dataMicrosoft initially sought a deal to acquire TikTok, but that fell apart when Chinese government officials put new regulations in place restricting the export of certain artificial intelligence technologies including the algorithm that serves up recommended videos to TikTok users based on their tastes.Microsoft said it would have needed access to the algorithm to ensure the safety and privacy of U.S. users and to combat the spread of disinformation.Story continuesIf Microsoft got access to TikTok via a sale, it would have been the company behind the hottest social network since Snapchat. TikTok’s appeal to teens and tweens allows it to gain insight into what drives and attracts those young users. But putting Microsoft’s name in front of TikTok would also ensure that those same users see the 45-year-old company as almost synonymous with the social network.Teens don’t need to use Windows-powered PCs like they did in the past, and if they do, they certainly don’t spend nearly as much using those PCs as they had to in the past.They don’t have to use Internet Explorer, or the new Edge Browser, because they, like 66% of users, are on Google’s (GOOG, GOOGL) Chrome. They don’t have to use Office, because they, along with 57% of consumers, use Google Docs. They don’t have to use Bing because, well, they have Google. They might still use Windows PCs, but schools are increasingly buying up Google’s Chromebooks.Oracle company signage is seen in front of the US-based technology company's office building in Beijing on September 16, 2020. (Photo by Nicolas Asfouri/AFP via Getty Images)What’s more, chances are they’re spending most of their time on their iPhone (AAPL) or Android phone anyway. Microsoft missed the boat on mobile after its turn as a would-be third smartphone option when its Windows Phone operating system failed to gain traction and was killed off for good in 2019.In fact, the only area where teens might frequently use a Microsoft product is the Xbox, and even that doesn’t have a majority market share in the gaming market, thanks to Sony’s (SNE) PlayStation.But name recognition isn’t all Microsoft missed out on. The company could have gotten access to untold amounts of data produced by TikTok’s users. With that kind of information, Microsoft would have been able to further bolster its advertising business. That alone could have put Microsoft on a path to challenge the likes of Google and Facebook (FB) for domination of the online advertising industry.Avoiding scrutiny of a social networkMicrosoft, however, has been able to avoid the kind of scrutiny the likes of Google and Facebook have drawn from regulators in the U.S. and Europe exactly because it’s largely uninvolved in collecting user data like those services. In fact, Microsoft President Brad Smith has been critical of tech companies and the data they horde.The vast majority of Microsoft’s revenue comes from its enterprise, Windows, productivity, and Xbox businesses. But if the firm ended up jumping into the social media space, it would instantly open itself up to the same criticisms leveled as those other tech giants.It also ensures Microsoft doesn’t have to deal with whatever additional drama a tie-up with TikTok would bring along with it. After all, the social network isn’t just popular with teens. It’s also popular among those in Washington who have turned it into a political football.By missing out on the TikTok deal, which isn’t even the full acquisition Microsoft was seeking, it avoids more pain than a “technology partnership” would have offered. It’s a win through a loss. And while it may mean that Microsoft won’t be the company Gen Z comes to know as the brand behind the hottest social network of the moment, the company, and its more than $1-trillion market cap, will continue to do well on its own.By Daniel Howley, tech editor. Follow him at @DanielHowleyApple eventApple’s Fitness+ service is going after PelotonApple unveils iPad 8 for $329 and iPad Air 4 for $599Apple debuts $399 Apple Watch Series 6 and $279 Apple Watch SEMore Tech NewsAmazon launches new Luxury Stores shopping experience with Oscar de la RentaSome of the world's biggest investors are 'paranoid' about tech stocks getting pounded: surveyARM founder: $40 billion sale of UK chipmaker to Nvidia 'disaster'Nikola releases more detailed rebuttal to short-seller report, addresses 'rolling down hill' videoVerizon buys pre-paid phone provider TracfoneWalmart teams up with Zipline to test limited on-demand drone deliveriesReviewsMicrosoft Surface Duo: A two-screen Android phone that could change everything—Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn,YouTube, and reddit."}]}