{"article": [{"url": "https://finance.yahoo.com/news/pelotons-rival-tonal-raised-110-million-from-atheletes-like-stephen-curry-120041855.html", "published": 1600326500.0, "headline": "Peloton's major rival Tonal just raised $110 million from athletes like Stephen Curry", "body": "With a large swath of the country continuing to workout from home during the pandemic on connected fitness equipment, the wheeling and dealing in the red-hot space is as strong as ever.Tonal — a digitally connected strength machine that is seen by many as Peloton’s main rival — announced Thursday a fresh $110 million capital infusion from a range of investors — both new and old. Some of Tonal’s newest backers are a who’s who of the sports world: Stephen Curry (NBA), Paul George (NBA), Bobby Wagner (NFL) and Michelle Wie (golf).These sports stars join several other prominent sports names invested in Tonal, including Serena Williams (tennis), Klay Thompson (NBA) and Tony Gonzalez. As for more traditional investors, L Catterton (a main player in the digital fitness space and early Peloton backer) and the Amazon Alexa Fund have returned with fresh checks for Tonal.The size of the investments by Curry, L Catterton, etc. were not disclosed. Nor was Tonal’s valuation following its latest capital infusion. The San Francisco-based fitness company has now raised nearly $200 million since it was founded by tech executive and current CEO Aly Orady in 2015.Orady told Yahoo Finance’s The First Trade institutional investors continue to back the company on the view the shift to working out at home is permanent.Tonal says sales are up “12x” in 2020 versus a year ago.The capital raise arrives amid an ambush of bullish news in the space of late.Golden State Warriors guard Stephen Curry invested in Tonal, a digital strength training startup. (AP Photo/Jeff Chiu)Peloton’s stock is hovering near record highs (and a $24 billion market cap about one year post IPO) after a blowout second quarter last week. The connected bike and treadmill seller’s founder John Foley is now laser focused on reaching 100 million users over the next 15 years (currently has 3.1 million).“We call it a BHAG here — a big, hairy, audacious goal — of having 100 million members and a net promoter score of 100. To our knowledge, there's not a company in the world that has 100 net promoter score, and certainly 100 million subscribers gets us in that rarefied air of some of the FAANG [Facebook, Apple, Amazon, Netflix, Google] stocks. We think that Peloton has the opportunity to be one of those special companies, and we have thousands of people at Peloton who are marching in that direction every day and it doesn't look like we're slowing down anytime soon,” Foley told Yahoo Finance.Story continuesFoley is less sure if Peloton will play the role of industry consolidator even as it sits on some $1.8 billion in cash.“The challenge is that there's not that many awesome innovative technology companies in the fitness category or around the fitness category,” Foley added on the M&A topic.But Lululemon (and Tonal) would probably disagree with Foley.In late June, the yoga apparel maker plunked down top dollar — $500 million to be exact — to purchase Mirror. Lululemon plans to soon begin selling Mirror machines in its stores as one way to extract value from its deal.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.What’s hot this week from Sozzi:Home Depot co-founder and Atlanta Falcons owner gives his best advice to new NY Mets ownerPeloton founder: here’s one of my biggest 15 year goalsVitamin Shoppe CEO: the pandemic has changed our businessKraft Heinz CEO: Buffett’s team like our $3.2 billion dealKroger CEO: this is how we see the future of food shoppingWatch Yahoo Finance’s live programming on Verizon FIOS channel 604, Apple TV, Amazon Fire TV, Roku, Samsung TV, Pluto TV, and YouTube. Online catch Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, and reddit."}]}