{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-june-24-2020-221305993.html", "published": 1593184220.0, "headline": "Stock market news live updates: Wall Street ends sharply lower; coronavirus surge outweighs recovery hopes", "body": "Stocks closed out Friday’s session sharply lower, as the weight of soaring U.S. coronavirus cases in at least half of the country became too much for optimistic investors to ignore.Texas and Florida — which ended their lockdowns early — have now become epicenters of America’s outbreak. Both states on Friday took additional measures to reverse steps toward normalizing public life, by closing bars and limiting restaurant capacity following surges in coronavirus cases.Despite optimism that’s allowed markets to resume a new bull run, the news rattled traders — sending each of the three major indices down more than 2%. The jump in volatility pushed the S&P 500 to its lowest level in two weeks.Amid widening fears of a resurgence in COVID-19 infections, “We might have some challenging times ahead,” Sam Stovall, chief investment strategist at CFRA, told Yahoo Finance on Friday. “The COVID concern has not run its course, and we will be contending with it for awhile.”The Dow underperformed against the S&P 500 and Nasdaq, and Nike (NKE) shares slid after reporting a surprise quarterly loss. Dow components Goldman Sachs (GS) and JPMorgan Chase (JPM) traded lower alongside other big banks, after the Federal Reserve said in its stress test results Thursday after market close that it would restrict dividends and share buybacks on financial companies for the third quarter.The move is intended to “ensure large banks remain resilient despite the economic uncertainty from the coronavirus event,” according to the Fed.Meanwhile, further increases in coronavirus cases in some parts of the country stirred up investor jitters, with signs pointing to an increasingly chaotic reopening process. Florida on Friday set a record in new infections, and cases elsewhere in the Sun Belt states continued to climb.Individual companies have also pushed back reopening dates amid the latest jumps in coronavirus cases. Apple (AAPL) added 14 stores in Florida to its growing list of store re-closures, after announcing earlier this week and late last week it would be re-closing seven stores in the Houston, Texas area and nearly a dozen stores across four states late last week. Disney (DIS) said it was indefinitely delaying its California theme parks’ reopenings past their earlier July 17 target.Story continues—4:01 p.m. ET: Stocks end the session at the lowest level in two weeks, as virus fears resurgeHere’s where the three major indices settled by the end of Friday’s session:S&P 500 (^GSPC): -74.74 points (-2.42%) to 3,009.02Dow (^DJI): -730.12 points (-2.84%) to 25,015.48Nasdaq (^IXIC): -259.78 points (-2.59%) to 9,757.22—3:00 p.m. ET: Stocks sink, Dow drops nearly 700 points, or 2.7%Here were the main moves in markets, as of 3:00 p.m. ET:S&P 500 (^GSPC): -68.9 points (-2.23%) to 3,014.93Dow (^DJI): -661.39 points (-2.57%) to 25,084.21Nasdaq (^IXIC): -207.98 points (-2.08%) to 9808.59Crude (CL=F): -$0.34 (-0.88%) to $38.38 a barrelGold (GC=F): +$10.00 (+$0.56) to $1,780.60 per ounce10-year Treasury (^TNX): -3.4 bps to yield 0.64%—1:50 p.m. ET: American Airlines set to fill planes to capacity starting July 1American Airlines (AAL) said Friday it will begin filling its planes entirely beginning July 1, meaning the carrier will make all middle seats available again for passenger purchases. Airlines in mid-April had slashed passenger capacity within flights to accommodate social distancing measures.The company will let companies know whether more open flights are available, and will allow them to switch flights free of charge. It also said it would be asking passengers beginning June 30 to certify that they had been free of Covid-19 symptoms for at least the past 14 days.Shares of American Airlines fell more than 6% in intraday trading, amid a broader pullback in the market and among travel stocks.—11:55 a.m. ET: Florida halts alcohol consumption in barsFlorida’s Department of Business and Professional Regulation said Friday that bars in the state must immediately stop serving alcohol, due to an increase in coronavirus cases in the state. Florida reported a record increase in cases on Friday, with new infections rising 7.8% over the prior day to a total of 122,960.—11:34 a.m. ET: Albertsons shares open at $15.50, falling below IPO priceShares of Albertsons began trading on the New York Stock Exchange Friday morning at $15.50 per share, in a tepid first-day performance after pricing its initial public offering at $16 the night before.The company sold 50 million shares Thursday evening, down from the 65.8 million shares at $18 to $20 each the grocery company expected to offer.—10:02 a.m. ET: Consumer sentiment edged lower in late June as virus infections spreadConsumer sentiment for June was revised lower in the University of Michigan’s final monthly Surveys of Consumers, reflecting concern over rising coronavirus cases in some parts of the country.The index came in at 78.1 in the final June reading, down from the 78.9 reported earlier in the month. Consensus economists expected a reading of 79.2Subindices tracking consumers’ assessments of current conditions and future expectations were also revised lower in the final print.“Consumer sentiment slipped in the last half of June, although it still recorded its second monthly gain over the April low,” Richard Curtin, chief economist for the Surveys of Consumers, said in a statement.“While most consumers believe that economic conditions could hardly worsen from the recent shutdown of the national economy, prospective growth in the economy is more closely tied to progress against the coronavirus,” he added. “The early reopening of the economy has undoubtedly restored jobs and incomes, but it has come at the probable cost of an uptick in the spread of the virus.”—9:33 a.m. ET: Stocks open lowerHere were the main moves in markets, as of 9:33 a.m. ET:S&P 500 (^GSPC): -18.06 points (-0.59%) to 3,065.7Dow (^DJI): -231.98 points (-0.9%) to 25,513.62Nasdaq (^IXIC): -26.94 points (-0.27%) to 9,988.75Crude (CL=F): -$0.16 (-0.41%) to $38.56 a barrelGold (GC=F): -$2.30 (-0.13%) to $1,768.30 per ounce10-year Treasury (^TNX): -1.1 bps to yield 0.663%—9:05 a.m. ET: Gap shares surge after announcing partnership with Kanye West for Yeezy lineGap (GPS) shares surged more than 14% in pre-market trading after announcing a partnership with Kanye West and his apparel brand Yeezy.The new clothing line, Yeezy Gap, is set to be introduced in the first half of 2021.Shares of Gap have fallen more than 42% for the year to date through Thursday’s close, underperforming against the broader market’s 4.5% drop.YEEZY AND GAP FORM PARTNERSHIP #WESTDAYEVER pic.twitter.com/NyxgfYTjJM— ye (@kanyewest) June 26, 2020—8:33 a.m. ET: Core PCE rises a still-muted 1.0% in May, signaling low inflationary pressureCore personal consumption expenditures (PCE) rose 1.0% in May over last year, matching April’s pace of increase. The metric strips out more volatile measures including food and energy and serves as the Federal Reserve’s preferred inflation target.At 1%, core PCE during the pandemic has held well below the Fed’s symmetrical 2% target.The broader measure of PCE, inclusive of all categories, rose 0.1% over last month, following a 0.4% decline in April. PCE rose 0.5% over last year after April’s 0.6% year on year gain.—8:30 a.m. ET: Personal spending rebounds to rise by a record 8.2% in May, after record drop in AprilPersonal spending rose by 8.2% in May, the Bureau of Economic Analysis said Friday, following a revised 12.6% decline the previous month, which had been a record drop. Consensus economists expected spending to rise 9.3% in May.Personal income declined 4.2%, following April’s record 10.8% jump. The previous month’s surge came about in part due to the government’s increased stimulus program, which included new unemployment benefits and stimulus checks to individuals under an income threshold.—7:27 a.m. ET: Stock futures mixedHere were the main moves in markets as of 7:27 a.m. ET:S&P 500 futures (ES=F): 3,075.75, down 5 points or 0.16%Dow futures (YM=F): 25,571.00, down 25 points, or 0.1%Nasdaq futures (NQ=F): 10,110.75, down 22.5 points, or 0.22%Crude (CL=F): +$0.15 (+0.39%) to $38.87 a barrelGold (GC=F): +$4.40 (+0.25%) to $1,775.00 per ounce10-year Treasury (^TNX): -0.2 bps to yield 0.672%—6:01 p.m. ET: Stock futures open little changedHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:01 p.m. ET:S&P 500 futures (ES=F): 3,070.25, down 0.5 points or 0.02%Dow futures (YM=F): 25,527.00, down 69 points, or 0.27%Nasdaq futures (NQ=F): 10,087.00, down 1.25 points, or 0.01%Traders wear masks as they work on the floor of the New York Stock Exchange as the outbreak of the coronavirus disease (COVID-19) continues in the Manhattan borough of New York, U.S., May 27, 2020. REUTERS/Lucas Jackson TPX IMAGES OF THE DAY—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}