{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-us-case-spike-continues-as-who-withdrawal-draws-more-critics-165934542.html", "published": 1594210040.0, "headline": "Coronavirus update: US cases spike above 3M as WHO withdrawal draws more critics", "body": "The U.S. topped 3 million coronavirus cases Wednesday after setting a new record of 60,000 daily cases in the previous day, as critics continued to question the wisdom of the Trump administration’s move to withdraw from the World Health Organization.The new daily record is raising concerns that the daily count could potentially spike as high as 100,000 — a number previously suggested by Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases.The runaway case surge has largely affected California, Arizona, Texas and Florida, all of which have taken varied approaches to the outbreak.In Texas, Houston mayor Sylvester Turner has been pushing to cancel the state’s GOP Convention, which is slated for next week, and is reviewing the contract with the convention to find a way out. Meanwhile at least some Republican leaders are planning to skip the GOP National Convention in August because of the virus, which was moved from Charlotte, N.C. to Jacksonville, Fla.In Florida, Walt Disney World is set to reopen for the upcoming weekend, but experts are concerned about the potential impact in the greater Orlando area. Downstate in Miami-Dade County, officials have taken steps to protect its residents with a new 10 p.m. curfew starting Thursday. Bars remain closed and indoor dining has been halted.However, Florida has not been reporting its COVID-19 hospitalizations figures, a move defended by Gov. Rick DeSantis.Meanwhile, the pandemic rages on globally. Nearly 12 million cases and more than 544,000 dead, with international cases skyrocketing in Russia, Brazil and India. The latter has now overtaken Russia for the third-highest case count globally. Brazil, whose president tested positive Tuesday, is second with more than 1.6 million cases.Coronavirus cases are increasing in the Sun Belt region. (Graphic: David Foster/Yahoo Finance)Despite the global impact of the virus, President Donald Trump initiated the U.S. withdrawal from the World Health Organization Tuesday — a move that has alarmed public health experts and scientists. The U.S. currently contributes more than $400 million to WHO, which accounts for nearly 15% of the organization’s total budget.Story continues“If that money goes away, and the additional money the U.S. would normally donate when there is a public health emergency...the result of this is we could see viruses spread significantly more than they otherwise would have done,” Chris Meekins, Raymond James Healthcare Policy Analyst, told Yahoo Finance Wednesday.A busy July for vaccinesJuly has become a busy month for vaccine companies in the race to produce winning candidates to address the pandemic.Moderna (MRNA), the leading U.S. candidate has just finished enrolling participants for its Phase 2 study, as well as a Phase 1 study for older patients aged 56 and up. The company anticipates entering Phase 3 later this month.Pfizer (PFE), which is producing a candidate with German BioNTech, is also set to enter Phase 3 trials this month. Both Pfizer and Moderna are working on newer technology that has not yet been tested on the market.Novavax (NVAX), which just received a $1.6 billion boost from Operation Warp Speed, began Phase 1 trials in May and expects results later this month. The funding from the federal government will help the company set up and run a Phase 3 trial as well as large-scale manufacturing.Johnson & Johnson (JNJ) is set to begin its first phase this month, after having pushed up the timeline from September. It is unclear when J&J can begin Phase 3, but the company is in talks with the government.Other vaccine giants like Sanofi (SNY) and Merck (MRK) are still in preclinical stages. Sanofi was initially slated to begin in September but that has been delayed.Fauci has repeatedly said there could be an “efficacy signal” as early as September from the frontrunners, but that a vaccine isn’t likely to be widely available to the general public until next year.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}