{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-why-you-wont-see-a-payroll-tax-cut-like-trump-wants-164757275.html", "published": 1595246120.0, "headline": "Coronavirus stimulus: Why you won't see a payroll tax cut like Trump wants", "body": "It just doesn’t make any sense and nobody on the Hill wants to give it a green light.That’s the mood in D.C. right now with respect to President Trump’s proposed payroll tax cut as being essential in securing another round of government stimulus for households battered by the COVID-19 pandemic. As for the main reason why lawmakers are lukewarm at the latest Trump demand, it’s pretty simple — what the heck does a payroll tax cut do for the nearly 30 million unemployed persons in America?Not a darn thing as they aren’t working.Read more: Payroll taxes, explained“This [the payroll tax cut] has been something that the president has had in his teeth for months. There’s no one else in D.C. who wants a [payroll] tax cut. It’s viewed even by Congressional Republicans as being the wrong policy response right now. It doesn’t help the people who need it the most, which are the unemployed. And, the benefits are questionable at this point in the economics,” explained Compass Point director of policy research Isaac Boltansky on Yahoo Finance’s The First Trade.It’s wildly unclear at the moment what shape Trump’s payroll tax cut would take. But, it obviously favors those working — a group that pays a Social Security tax of 6.2% up to $137,700 and a Medicare tax of 1.45%.While Trump views the payroll tax cut as a dealbreaker in any new fiscal stimulus, clearly something needs to be done to avoid a fiscal cliff that may wallop stocks and the U.S. economy. The extra $600 in unemployment insurance as part of the Coronavirus Aid, Relief, and Economic Security (CARES) Act expires on July 31 for close to 30 million people. If it’s not renewed, consumer spending could quickly dry up. Meanwhile, it’s likely that households have blew through their $1,200 stimulus checks (or more if one has children) handed out by Uncle Sam if they remain unemployed. Building a bridge for these struggling households until they find work is critical.House Speaker Nancy Pelosi of Calif., center, flanked by House Majority Leader Steny Hoyer of Md., left, and Rep John Larson, D-Conn., right, speaks during a news conference on Capitol Hill in Washington, Friday, Feb. 13, 2009, after the House passed the stimulus legislation. (AP Photo/Susan Walsh)A decision on stimulus will probably come down to the wire as Democrats and Republicans jockey for position ahead of November’s presidential election.Story continuesDemocrats in the House of Representatives led by Speaker Nancy Pelosi signed off on a $3 trillion COVID-19 relief bill several months ago. It would extend the $600 weekly payments originally passed in the (CARES) Act through January. The bill would also provide for another round of direct payments of up to $1,200 for individuals and $6,000 with families that have children. Senate Majority Leader Mitch McConnell is reportedly eyeing a new $1 trillion stimulus, but it’s unclear right now what unemployment insurance would look like under the scheme.“Policymakers, I think, are committed to spending more money. There aren’t that many deficit hawks left on Capitol Hill to begin with. They are endangered species. Furthermore, I think they recognize now is the time to spend money,” Boltansky points out. “I think they actually extend supplementary unemployment insurance, albeit at a lower level. Somewhere around the $250 to $350 a week level. I think lawmakers pull out the printer again and start sending out checks. I think the amount will be the same [as last time]. But I think they’ll lower that income threshold so the low end of the economic spectrum still gets it.”Just don’t expect a payroll tax cut if you are still working.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}