{"article": [{"url": "https://finance.yahoo.com/news/retail-sales-come-all-the-way-back-in-june-morning-brief-100942410.html", "published": 1594963040.0, "headline": "Retail sales come all the way back in June: Morning Brief", "body": "Friday, July 17, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeRetail sales are the latest evidence that a continued recovery is in Congress’ hands.Retail sales are all the way back.Sales in June jumped 7.5% over the prior month and 1.1% over the prior year, topping expectations for a 5% rise.And as the following chart from Bespoke Investment Group shows, excluding gas retail sales have come all the way back to pre-pandemic trendline growth.Retail sales jumped back to a record high in June and are now basically in-line with trend economic growth seen before the pandemic. (Source: Bespoke Investment Group)And this report serves as more evidence that stimulus through the CARES Act sent to consumers has been enough to keep spending afloat and keep the gears economic growth turning.“The June retail sales figure follows a number of other June reports which indicate that after an epically bad April, activity snapped back in May and June, albeit to levels below those which prevailed prior to the pandemic,” said Michael Feroli, an economist at JPMorgan.“More recently, several high-frequency indicators suggest that May and June were the easy months, and that the resurgence of COVID-19 cases is leading to slower activity gains in July.” JPMorgan estimates that real consumer spending was 7.2% below January’s level in June.As we’ve written in recent weeks, the pending expiration of these benefits is a looming fiscal cliff that could short circuit the still-fragile economic recovery. It is imperative that lawmakers continue offering support to consumers facing a historically weak labor market while small businesses continue to buckle under the pressure of the recessionary environment.Because in addition to Thursday morning’s reading on retail sales, we also got the latest weekly report on initial jobless claims, which showed another 1.3 million workers filed first-time claims for unemployment insurance. Including pandemic unemployment assistance claims, 2.4 million workers filed for unemployment last week.Nancy Vanden Houten, lead economist at Oxford Economics, said Thursday that this data “[underscores] that layoffs remain widespread. And the risk may be for additional layoffs going forward as some states reimpose more restrictive measures to combat surging Covid-19 cases.”Story continuesIn a separate note on Thursday, Oxford’s chief U.S. economist Greg Daco noted that the firm’s real-time activity tracker has flattened out in recent weeks, calling this a sign that we’re witnessing a “premature plateauing of the recovery.”Backwards looks at spending in June, and hiring in May, and the housing market over the last two months, real-time readings on economic data have shown a softening alongside the sharp rise in COVID-19 cases nationwide.“While it would be premature to call for a double-dip recession, this recovery is clearly at risk from a mishandled health situation,” Daco added. “Policymakers across the country have an active role to play in containing the virus and ensuring the nation avoids looming fiscal cliffs from the expiry of unemployment benefits, PPP funds running low, and state and local budgets being cut to the bone.”And so while it may be an inelegant and imperfect short-term solution for the economy, there is more than enough evidence to support a continuation of enhanced unemployment benefits and another round of stimulus checks for households making less than $100,000.Consumer spending accounts for just about 70% of GDP growth. And with such a clear path forward for Congress to help support an economy likely to suffer its largest drop in growth since World War II, there is little to no justification for letting these benefits lapse.The clock is ticking.By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Housing starts, June (1.172 million expected, 974,000 in May)8:30 a.m. ET: Building permits, June (1.29 million expected, 1.216 million in May)10:00 a.m. ET: University of Michigan Sentiment, July preliminary (79.0 expected. 78.1 in June)EarningsPre-market6:00 a.m. ET: BlackRock (BLK) is expected to report adjusted earnings of $6.97 per share on revenue of $3.54 billion6:35 a.m. ET: Citizens Financial Group (CFG) is expected to report adjusted earnings of 9 cents per share on revenue of $1.68 billion8:00 a.m. ET: Kansas City Southern (KSU) is expected to report adjusted earnings of $1.11 per share on revenue of $553.6 million7:30 a.m. ET: Ally Financial (ALLY) is expected to report adjusted earnings of 14 cents per share on revenue of $1.49 billion7:50 a.m. ET: State Street Corporation (STT) is expected to report adjusted earnings of $1.61 per share on revenue of $2.88 billionTop NewsNetflix adds 10 million subscribers, but earnings miss and guidance disappoints [Reuters]Euroepan stocks mixed ahead of EU recovery summit [Yahoo Finance UK]British Airways to retire fleet of iconic Boeing 747 jumbo jets [Yahoo Finance UK]NY Fed's Williams: 'Not the time to think' about rate hikes [Yahoo Finance]Our coverage of Twitter hackBitcoin scams on Twitter are nothing new—and they workDoes the epic Twitter hack mean you should sell all your tech stocks?Twitter attack underscores a fresh threat facing companies and the publicTwitter hack highlights concerns about disinformation, election securityYAHOO FINANCE HIGHLIGHTSJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinThe $600 boost in unemployment benefits expires soon. What comes next? Bill Gates phishing campaign 'nearly identical' to Twitter attack—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}