{"article": [{"url": "https://finance.yahoo.com/news/bernie-sanders-tax-billionaires-pandemic-health-care-204709337.html", "published": 1596729320.0, "headline": "Bernie Sanders wants to tax billionaires' pandemic gains to fund health care", "body": "A new bill introduced by Sens. Bernie Sanders (I-VT), Kirsten Gillibrand (D-NY), and Ed Markey (D-MA) would implement a one-time 60% tax on billionaires to cover the health care costs of every American for a year.The Make Billionaires Pay Act would tax the $731 billion in wealth accumulated by the richest 0.001% of America between March 18 through August 5. This would apply towards 467 individuals.\"The legislation I am introducing today will tax the obscene wealth gains billionaires have made during this extraordinary crisis to guarantee healthcare as a right to all for an entire year,” Sen. Sanders said in a statement. \"At a time of enormous economic pain and suffering, we have a fundamental choice to make. We can continue to allow the very rich to get much richer while everyone else gets poorer and poorer. Or we can tax the winnings a handful of billionaires made during the pandemic to improve the health and well-being of tens of millions of Americans.Democratic presidential candidate Senator Bernie Sanders arrives to speak at a rally at the Drake University Olmsted Center in Des Moines, Iowa, U.S., February 3, 2020. REUTERS/Carlo Allegri TPX IMAGES OF THE DAYThe money generated from this 60% tax would go towards covering out-of-pocket expenses for the uninsured and underinsured for one year.The top five richest Americans — Amazon (AMZN) CEO Jeff Bezos, Microsoft (MSFT) Founder Bill Gates, Facebook (FB) CEO Mark Zuckerberg, Berkshire Hathaway (BRK-A, BRK.B) CEO Warren Buffett, and Oracle (ORCL) Founder Larry Ellison — would pay a combined $87.1 billion under the bill. In total, the tax would generate over $421.6 billion.“In my view,” Sanders added, “it is time for the Senate to act on behalf of the working class who are hurting like they have never hurt before, not the billionaire class who are doing phenomenally well and have never had it so good.\"A health care worker gives a nasal swab to a person to do a self administered test at the new federally funded COVID-19 testing site at the Miami-Dade County Auditorium on July 23, 2020 in Miami. (Photo by Joe Raedle/Getty Images)‘Demanding that billionaires pay their fair share of taxes’The Make Billionaires Pay Act would cover all medical bills, including prescription drugs and coronavirus-related expenses, over the next 12 months with the tax staying in effect until January 1, 2021.“Instead of more tax breaks for the rich while more Americans die because they cannot afford to go to a doctor, let us expand Medicare and save lives by demanding that billionaires pay their fair share of taxes,” Sanders said.Story continuesThe popular senator also lambasted the fact that CEOs like Bezos and Tesla (TSLA) CEO Elon Musk saw their net worth surge during the pandemic — Bezos’ wealth increased by 63% while Musk’s nearly tripled.Jeff Bezos would pay over $42 billion. (Photo by Elif Ozturk/Anadolu Agency via Getty Images)In that same period of time, over 5 million Americans have lost their employer-sponsored health care. And although President Trump pledged to reimburse hospitals for any coronavirus-related expenses for the uninsured, that still leaves non-coronavirus expenditures that could add up.“During this unprecedented economic and public health crisis, millions of Americans are out of work and struggling to put food on the table while billionaires are getting even wealthier,” Gillibrand said in a statement. “Requiring billionaires to pay their fair share will help support workers and families dealing with job losses, food insecurity, housing instability and health care. Not only is this a common-sense proposal, but it’s a moral one and Congress should be doing all we can to assist Americans struggling right now.”This isn’t the first wealth tax that’s been floated through Congress: Both Sanders and Sen. Elizabeth Warren (D-MA) frequently targeted the ultra wealthy throughout their presidential campaigns and each proposed their own kind of wealth tax that would go towards funding Medicare for all.Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Obamacare 'glitch' magnified as Americans scramble for health care amid coronavirus pandemicA 'flaw' in Obamacare is costing some Americans thousands of dollars per yearMillions of American workers lost health insurance as coronavirus pandemic worsenedRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}