{"article": [{"url": "https://finance.yahoo.com/news/us-new-wfh-normal-is-also-a-boon-for-indian-tech-companies-120055208.html", "published": 1596870560.0, "headline": "India's tech giants navigate 'literally spiking' WFH demand, H1-B fears in coronavirus era", "body": "The COVID-19 pandemic resulted in drastic and sudden changes in life for the global labor force, but the shift to remote work has come as a surprise to Indian technology firms that help power many large companies in the United States.Embracing work-from-home caused a sudden spike in demand in some sectors, even as others — like travel and hospitality— were decimated at the onset of the outbreak, according to Dinanath Kholkar, a vice president and global head of analytics and insights at Tata Consultancy Services (TCS).“We were at a decent pace, from a demand perspective. But I can tell you that the demand literally spiked for me. My team has been kept absolutely busy,” Kholkar told Yahoo Finance recently.Discussions about the future of the workforce — mostly structured around commuting to and from offices — have been on the table for some time.However, a pace that was once gradual has now hit the fast lane, as the pandemic prompts more employers to extend generous remote working arrangements. Indian tech executives have found themselves navigating a changed landscape that’s forced a broad rethinking about work visas and technological change.Ravi Kumar S., Infosys’ (INFY) president, told Yahoo Finance’s All Markets Summit last month that many tech firms such as his are among those looking to move to more remote work.“Many CIOs I've spoken to, many tech companies I've spoken to, have told me that maybe 50% of the workforce is never going to come back to work,” Infosys’s Kumar said.Facebook (FB) has already suggested as much — and that salaries could change based on the cost of living where employees choose to live.However, the shift is coming much faster than many anticipated — even with the onset of the pandemic.“What I thought [was] that things would actually slow down and people might actually say, ‘Let’s wait, let’s see how things shape up,’” Tata’s Kholkar said.“But what surprised me was the fact that they actually accelerated. We realized that it was a matter of survival for many of them,” he added.Story continues“The openness from customers to do things remotely has been a big revelation for me, personally. I used to travel almost 20 days a month trying to meet customers on deals or just for discussions. It always used to be effective face-to-face,” the executive said.To respond to the outbreak, TCS didn’t have to hire additional labor. Because some lines of business were down, existing employees were shifted to the projects to support companies racing into remote working.In addition, newly graduated students joining the company helped boost the labor force, Kholkar said.Pushing toward the futureDespite some concerns that productivity would take a hit — and that some industries wouldn’t adapt well to having employees in far-flung places, the new normal merged with trends that were already well under way.Even in the face of growing nationalism worldwide, some economists believe the post-COVID-19 era will be defined by tighter links through technology worldwide. In a virtual discussion on Thursday, Dr. Kaushik Basu, an international studies professor at Cornell University and INET Commission on Global Economic Transformation said that “digital globalization is going to grow” regardless of populist waves sweeping politics.Basu also warned that world’s leaders need to avoid going “the dinosaur route” by rejecting technological trends, even as they manage the growing dominance of bigger players.Kumar S. said last month that companies had already been looking to rely more on technology, and that artificial intelligence (AI) has pivoted to proactive problem hunting, rather than reactive problem solving.Wipro (WIT) chief technology officer K.R. Sanjiv told Yahoo Finance in an interview that the company is plowing more investment into next-generation technologies “that will mature or become mainstream in a two-to-four year time period.”That includes AI, autonomous driving, industrial robotics, 5G technology, and augmented and virtual reality. Those are all areas where the company is spending 60% to 70% of its budget and efforts, Sanjiv said.Wipro and its competitors have also been in a race to file patents and secure intellectual property rights. The company’s employees are compensated per patent filing, and are additionally financially rewarded for any patents which are successful.In the U.S., Wipro is near the top, filing at least 100 patents in 2019, and more than 300 in the past three years, according to the U.S. Patent Office. Sanjiv said the company files at least 400 to 500 patents a year overall.By comparison, TCS has filed nearly 400 in the past three years, and almost 100 in 2019.KENOSHA, WI - APRIL 18: President Donald Trump speaks to workers at the headquarters of tool manufacturer Snap-On on April 18, 2017 in Kenosha, Wisconsin. During the visit, Trump signed an executive order to try to bring jobs back to American workers and revamp the H-1B visa guest worker program. (Photo by Scott Olson/Getty Images)H1-B concernsYet with a workforce that can now be physically located anywhere, concerns have now bubbled up about the future of talent from abroad.Among some Indian companies, H-1B visa fears are once again top-of-mind, even after they increased their onshore operations and labor pool to appease a Trump administration that’s moved to tighten controls on immigration, even for students.“A lot of firms have been building out senior leadership in the U.S. for a decade,” according to Richard Rossow, Wadhwani Chair in U.S.-India Policy Studies at the Center for Strategic and International Studies (CSIS).Kholkar said the recent H-1B executive order halting all new visas is affecting “every company that does business in the U.S.” Still, companies like TCS, Infosys and Wipro have spent the last few years opening up corporate campuses and engaging with colleges and universities to hire more U.S. residents.But it also helps the company push forward on plans it already had to expand into smaller cities in India to ramp up its talent pool, Kholkar said.“We’ve been largely focused on the cities, the main metros. We had started on the Tier 2 journey —Gandhinagar, Indore, Bhuvaneshwar, Nagpur” all of which can accelerate now, he said, adding it will help the company source talent on-demand.“That will potentially change the entire game,” Kholkar said.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}