{"article": [{"url": "https://finance.yahoo.com/news/california-state-insurance-commissioner-urges-action-to-stabilize-insurance-market-after-wildfires-131753315.html", "published": 1601022320.0, "headline": "'The new reality for California' : State Insurance Commissioner urges action to stabilize insurance after wildfires", "body": "The wildfires in California have scorched more than 3 million acres and destroyed or damaged nearly 7,200 structures so far. Now, they’re threatening to leave the most vulnerable homeowners without insurance.Speaking to Yahoo Finance’s “The Ticker” on Wednesday, California Insurance Commissioner Ricardo Lara said the state is scrambling to develop standards to help homeowners reduce the wildfire risks. These homeowners increasingly face the prospects of getting dropped by insurance companies, which are concerned about mounting losses.“This is unfortunately the new reality for California,” Lara said. “We have to get to a point where we’re talking about mitigation, bringing the risk, rebuilding more resilient, and giving incentives to Californians.”Ricardo Lara speaks to Yahoo FInance.The country’s most populous state has struggled to stabilize its insurance market amid rising climate risks, and ballooning costs. In the last three years, California’s witnessed the seven largest wildfires in state history, leading to record destruction and prompting insurance companies to abandon fire-prone areas.‘We cannot do this alone’The problem became so severe last year, Lara stepped in to temporarily ban insurance companies from dropping coverage to 800,000 homeowners in areas prone to fire risk. With that one-year moratorium set to expire later this year, and with no prospect for renewal, Lara is calling on homeowners and insurance companies to come together to help craft more permanent, statewide risk mitigation measures.Next month, he’ll host a public hearing to gather input from residents and insurers to create a template for other states to follow, Lara said.“We cannot do this alone, we need [insurance companies] at the table as we continue to address not only wildfires, but extreme heat sea level rise, a whole host of other issues like hurricanes that we're experiencing throughout the country that are going to eventually impact the overall insurance market across the country,” Lara said.Story continuesA home burns along Cima Mesa Rd. as the Bobcat Fire advances Friday, Sept. 18, 2020, in Juniper Hills, Calif. (AP Photo/Marcio Jose Sanchez)Extreme weather has prompted insurance companies around the world to reassess their risk models. Payouts for natural disasters hit a record $219 billion two-year total for 2017 and 2018.The impact of rising claims has been most acutely felt in California, where wildfires from 2017 and 2018 wiped out 25 years of the industry’s profits. According to the state’s climate change assessment, insurance costs are expected to rise nearly 20% by 2055.Earlier this year, Lara sponsored a state assembly bill that would’ve required insurance companies to write or renew policies of homeowners who met a statewide standard to mitigate fire risks to their homes. That failed to advance, prompting the Insurance Commissioner to lay out new measures to reduce the wildfire risk, including requiring insurance companies to cut premiums to homeowners who meet those risk reduction standards.Lara’s challenges point to the dilemma regulators face as climate risks escalate: protecting consumers from rising premiums, while addressing concerns insurance companies have of piling economic losses. Lara said many insurance companies have continued to deny coverage to homeowners, even after residents invest thousands of dollars to harden their homes.Still, Lara denied reports the state is facing an exodus of insurance companies, which can no longer afford to operate in the state.“I think it’s important to recognize Insurance companies have very diversified holdings. And so, you know they're doing well in these other areas,” Lara said. “The likelihood of us seeing insurance companies pulling out of California, I don't see it in the foreseeable future.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita‘You have to be flexible:’ U.S. startups accelerate hiring abroad in push to distribute workforceCEOS caught in geopolitical fight, as TikTok deadline loomsInfosys commits to hiring 12,000 American workers, expanding U.S. footprint25% of colleges likely to go out of business: Chegg CEO"}]}