{"article": [{"url": "https://finance.yahoo.com/news/atlanta-mayor-keisha-bottoms-issue-034203035.html", "published": 1594248620.0, "headline": "Atlanta Mayor Keisha Bottoms to Issue Face Mask Mandate in the City", "body": "Keisha Bottoms is taking matters into her own hands. The Atlanta mayor announced on Wednesday she would sign an executive order that will require residents to wear face masks in all public spaces. The move is in conflict with Georgia Gov. Brian Kemp's order, which encourages face coverings but does not mandate their use.\"I specifically asked our governor about allowing Atlanta to go forward with mandating masks in our city. He refused,\" Bottoms said during a Wednesday appearance on Morning Joe. \"Other cities have taken the approach that they are going to defy the governor’s executive order, and Savannah has done it, some other cities have done it, and Atlanta is going to do it today.\"It was just a week ago when Savannah became the first Georgia city to require face masks in public; Athens and East Point have since followed suit. The orders were put in place as Georgia experiences a surge in coronavirus cases and virus-related hospitalizations. Bottoms argued that a face mask requirement would help mitigate the spread of the disease and help Georgia return to some sense of normalcy.\"The fact of the matter is that COVID-19 is wreaking havoc on our city, specifically black and brown communities with higher death rates,\" Bottoms continued, \"and we will never be able to reopen our schools and our economy if we don’t take some responsibility for what we can do as leaders to make sure people aren’t exposed to this virus.\"According to the the Atlanta Journal-Constitution, Bottoms has yet to lay out what kind of penalties Atlantans will face if they violate the facemask order.New Jersey Gov. Phil Murphy signed an executive order Wednesday that requires residents and visitors to wear face coverings in public outdoor spaces where social distancing is impossible or impractical.\"Requiring masks outdoors is a step, frankly, that I had hoped we would not have to take. And by and large, New Jerseyans by the millions have been outstanding in their compliance when masking up to go outside as it was our strong recommendation,\" Murphy said, as reported by US News. \"But, unfortunately, we have been seeing a backslide in compliance as the weather has gotten warmer and not surprisingly as a result, our rate of transmission has similarly crept up.\"Story continuesBack in April, during the peak of New Jersey's COVID-19 cases, Murphy signed an order that required face coverings in most indoor spaces.\"Wearing a face covering, I remind you, is not about politics,\" he continued. \"It is about quite simply being sick or being healthy. It's about life and death. It's about showing others that you care about their health.\"Related ArticlesBrand Launches \"Fashionable Facemasks\" To Breathe Purified AirUber Indefinitely Extends Mask Requirement, Launches 'No Mask. No Ride' CampaignNew York Residents Are Now Required to Wear Protective Masks in Public Social Distancing Won't Be Required During Trump's 4th of July Event at Mt. RushmoreMore ComplexThe Complex SHOP: Designer Clothing and BrandsComplex Podcast NetworkSole Collector Mobile App - Your app for the Sneaker WorldSneaker of the Year: The Best Since ’85 Book - Now available for pre-order!Sign up for the Complex Newsletter for breaking news, events, and unique stories.Follow Complex on: Facebook, Twitter, Instagram, YouTube, Snapchat, TikTok"}]}