{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-health-experts-ranked-activities-risk-132702304.html", "published": 1592123720.0, "headline": "Coronavirus: Public health experts ranked 36 American activities based on risk", "body": "As more and more states begin phases of reopening, many Americans are now wondering what is safe to do and what should still be avoided to prevent the spread of coronavirus.“There’s a huge amount of variation from business to business, from area to area, in how much transmission risk there is for resuming economic activity,” Dr. Katherine Baicker, of the University of Chicago Harris School of Public Policy, told Yahoo Finance’s The Ticker.An analysis by MLive chose 36 American activities and asked four public health experts in Michigan to evaluate the risk of coronavirus exposure for each one. The doctors factored in whether the activity is inside or outside, proximity to others, length of potential exposure, likelihood of compliance, and personal risk level.Bars and large music concerts are the riskiest settings right now. (Graphic: David Foster/Yahoo Finance)The experts gave a score to each activity, with 1 being the least risky and 10 being the riskiest, and MLive averaged their scores to come up with a ranking.Bars, large music concerts, and packed sports stadiums are the riskiest places, according to experts, because of large groups of people congregating together with little room to keep at least six feet apart.Dr. Ezekiel Emanuel, former special advisor for health policy under the Obama administration, previously stated that he doesn’t see larger gatherings – like concerts, conferences, and sporting events — returning until “fall 2021 at the earliest.”The Cameron Crazies taunt Leaky Black #1 of the North Carolina Tar Heels during the second half of their game against the Duke Blue Devils at Cameron Indoor Stadium on March 07, 2020 in Durham, North Carolina. (Photo: Grant Halverson/Getty Images)Some sports leagues are attempting to play in 2020 but with major changes, such as no fans in attendance, quarantining players, and testing players frequently. Major League Soccer (MLS) was the first to announce an official resumption of play, beginning on July 8, likely with no fans in attendance. The return of certain sports may be complicated if confirmed coronavirus cases continue to rise across the U.S.‘Not going to be a one-size-fits-all type of answer’Gyms, amusement parks, churches, and food buffets all have a score of 8, making them very risky.Dr. Robyn Gershon, part of NYU School of Public Health, recently told Yahoo Finance’s The Ticker that states currently experiencing spikes in coronavirus cases are places that did early reopening of high risk spots, like gyms, “places where people can congregate and be in very close spaces.”Story continuesFabian Arias (not pictured), a Lutheran pastor with Saint Peter's Church in Manhattan, holds a service on the street in Brooklyn, for a group of immigrants from Guatemala on May 30, 2020 in New York City. (Photo by JOHANNES EISELE/AFP via Getty Images)The closure of churches has sparked controversy and even drawn the ire of President Trump, who has ordered governors to reopen places of worship. However, public health experts agree that churches are very risky because of how close people are seated to each other.A church in Arkansas experienced an outbreak of coronavirus back in March, when at least 92 people tested positive and three people died. Many other outbreaks have taken place at churches across the country.“This is something that’s not going to be a one-size-fits-all type of answer,” Johns Hopkins Center for Health Security Dr. Amesh Adalja said on Yahoo Finance’s On the Move. “It’s really going to depend on the local dynamics and transmission of this virus, what’s going on in that area, what the hospitals look like, and what’s your personal risk tolerance and your risk factors for severe disease.”There are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Schools have ‘a system-level impact’Pick-up basketball games, public pools, and schools are next on the list of risky activities. Schools, in particular, pose a significant challenge as the U.S. heads into the fall, when classes normally resume.Some schools are planning on shifting to an online format, while others are planning shortened semesters in anticipation of a second wave.Dr. Baicker described schools as “a great example of something that has a system-level impact.” This is because it’s not only children and teachers factored into decision making but also to parents, siblings, and anyone else who might live with the children.Educator Scott Slivken works on his lesson plan as prepares to hold virtual office hours with his sixth grade students at the KIPP DC's Northeast Academy from his apartment on April 7, 2020 in Washington, DC. (Photo by ALEX EDELMAN/AFP via Getty Images)“I think it’s pretty clear kids themselves have a very low risk of adverse health outcomes from the disease,” she said on Yahoo Finance’s The Ticker. “What’s a little less clear to me is the degree in which the kids spread the coronavirus risk to their parents, grandparents, [and] other people in their community.”But at the same time, Baicker noted, the reopening of schools and daycares can provide health experts with an idea of “how much of a disease vector those locations provide.”Middle of the packCasinos, indoor-seating restaurants, and playgrounds had a score of 6 from MLive.While Las Vegas finally opened its casino doors with dealers and other employees wearing masks, recent photos and videos have indicated that the people visiting aren’t abiding by those guidelines.Guests play roulette at Excalibur Hotel & Casino after the Las Vegas Strip property opened for the first time since being closed in mid-March because of the coronavirus (COVID-19) pandemic on June 11. (Photo by Ethan Miller/Getty Images)Playgrounds, meanwhile, are a risk because children are likely to touch their hands and not maintain social distancing, along with the fact that it’s harder to constantly keep playgrounds clean.As for indoor dining at restaurants, the shared ventilation poses a risk for patrons, along with the fact that patrons aren’t wearing masks since they’re eating.Hair salons/barber shops, pontoon boat rides, and movie theaters also received an average score of 6.All of the activities in this range pose social distancing challenges for participants.Beautician Bella Baba applies highlights to a woman's hair as she wears a protective face mask as phase two reopening continues during the outbreak of the coronavirus at Joseph Hair Salon in Port Washington, N.Y. REUTERS/Shannon StapletonDinner parties at a friend’s house and backyard barbecues, can be risky if people aren’t careful, received a 5 from MLive’s analysis. Experts note that the key for participants is to stay at least six feet apart from people who aren’t part of your household and avoid sharing food with each other.Malls and bowling alleys (both with a score of 5) are both contained places where the virus can spread if it gets crowded and proper sanitization measures aren’t in place. Beaches, although they share the same score as malls and bowling alleys, can be lower risk as long as they aren’t crowded.Airplanes also had an average risk score of 5. The most important thing, according to the experts MLive spoke with, is that passengers wear their masks properly. The rest is up to the airlines themselves — this includes leaving the middle seat empty, properly cleaning the plane after each flight, and making sure the air is filtered correctly.Passengers board an American Airlines flight to Charlotte, North Carolina at San Diego International Airport on May 20, 2020 in San Diego, California. (Photo by Sandy Huffaker/Getty Images)The ‘safer’ activitiesDentist’s offices, walking in a busy downtown, offices, doctor’s office waiting rooms, and outdoor dining all had average scores of 4. The best thing to do is to wear a mask when necessary and continue keeping your distance from others.Grocery shopping and camping are lower down on the list. As long as everyone in a supermarket is wearing masks, the risk of transmission is low. As for camping, it’s lower risk as long as it’s not a big group of people.Hotels, libraries and museums, and golfing each had an average score of 3. These are places where it’s easy for people to keep their distance from each other.People wearing protective face masks walk at path at Domino Park in the Williamsburg neighborhood of Brooklyn on May 31, 2020 in New York City. (Photo by Rob Kim/Getty Images)Towards the bottom of the list are getting fuel and going for a walk, run, or bike ride with others. As long as you don’t come into contact with many people, it’s not likely you’ll be exposed, as long as you’re wearing a mask.The safest activities according to MLive’s experts? Getting takeout from a restaurant and playing tennis — which is one of the safest, lowest risk sports at this time.“Takeout or curbside pickup — lots of businesses are thinking about creative ways to continue to provide goods and services to the public and employment opportunities for their workers, while keeping everyone safe,” Baicker said. “And I think understanding how people move through businesses not only tells us what’s high risk but tells us how to make other things lower risk.Check out MLive’s analysis ->Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Coronavirus: Alarming rise in confirmed cases in U.S. states spared from first outbreaksCoronavirus: 'Children will probably be an important vector for transmission'WHO director warns: Masks can 'create a false sense of security'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}