{"article": [{"url": "https://finance.yahoo.com/news/the-stock-market-just-retaught-investors-a-crucial-lesson-171916124.html", "published": 1597753640.0, "headline": "The stock market just re-taught investors a crucial lesson", "body": "As the memes rightly state, 2020 is a disaster in many ways: more than 170,000 deaths from coronavirus, over 10% unemployment, and lines at the food bank. At the same time, the S&P 500 index (^GSPC) is at an all-time high, and it just had the best 100 days of all time.What does this teach us?If one classic rookie mistake for investors is to think there are “rules” Congress and the Fed adhere to regarding what they can and can’t do to help the economy, another mistake would be to think there’s any logical connection between the market’s strength and the economy overall.On the one hand, a lot of investors jumped into the market in the spring as the S&P 500 took a 30% hit, falling to below 2,300 on March 23 from its February high. These investors have been the big beneficiaries of the run-up since the index is back to an all-time high.But others stayed out of the market, seeing risk because they rightly judged that times were uncertain with a global pandemic raging and unemployment ready to balloon.The times have been uncertain, but those who were stayed on the sidelines missed the best 100 days ever.Up until recently, the best 100-day run was a 45.9% increase, beginning in July of 2009 after the Financial Crisis. That run and this current one are a head above the rest: According to analysis from LPL Financial, just four of the 17 best runs of all time have been gains of over 30%.A huge comeback, faster than ever. (Yahoo Finance)The fact that the best 100 days of all time came amid one of the worst years for the economy in recent history underscores the key lesson advisers have continuously harped on: you, a regular person, are probably very bad at timing the market.As JPMorgan's Annual Retirement guide and almost every other financial pro has pointed out over the years, missing the best 10 days in the market absolutely crushes portfolio returns over the long term. Missing the best 10 from 1999 to 2018 would lower annualized returns from 5.68% to 2.01%. Missing the best 20 would drop that down to -0.33%. Missing the best 60? -7.41%. They didn't calculate the best 100, but there's no way it's good.Story continuesThe point here echoes what Liz Ann Sonders, chief investment strategist at Charles Schwab, told Yahoo Finance on Monday: investing in the stock market is not about finding the right moment to get in and get out, but rather finding things to hitch your wagon to in order to grow your portfolio over the long haul.People walk along Broadway as they pass the Wall Street Charging Bull statue on July 23, 2020 in New York City. On July 22, the market had its best day in 6 weeks. (Photo by Michael M. Santiago/Getty Images)Instead of getting out, Sonders said, change the level of your exposure as your positions grow — which is why you might want to check your 401(k) plan right now. One-hundred days of gains totalling over 50%? That’s definitely enough to knock your target allocations off kilter.And if you think that because the market is at an all-time high means we’re due for a reckoning, maybe! Or maybe not. According to LPL, the year after the 16 of the best 17 100-day runs, stocks were up.“Previous big rallies usually saw continued strength, so don’t bet against this bull market just yet,” LPL Financial Chief Market Strategist Ryan Detrick wrote.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.5 rookie mistakes investors make: hedge fund veteranMost companies plan to give raises and bonuses in 2021: surveyThe key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right nowRetail investors have seen huge gains as S&P 500 nears pre-pandemic highCompany matches are mostly surviving the coronavirusThere are two types of stocks on RobinhoodWhy you should consider deleting your stock trading app"}]}