{"article": [{"url": "https://finance.yahoo.com/news/holidayshortened-week-peloton-and-slack-earnings-what-to-know-in-the-week-ahead-213002546.html", "published": 1599410300.0, "headline": "Holiday-shortened week, Peloton and Slack earnings: What to know in the week ahead", "body": "Equity trading this week will be shortened in the U.S. this week as investors take Monday off to observe the Labor Day holiday.But later in the week, market participants will receive a set of corporate earnings results from “stay-at-home” trade darlings including Slack and Peloton, along with a bevy of economic data including weekly jobless claims, and inflationary data for producers and consumers.Investors are also set to continue assessing the state of play in the markets following back-to-back sessions of steep declines last week, which dragged the Nasdaq to its worst weekly performance since March. Tech stocks led the rout as investors began to turn away from the clear equity leaders from the past several months.Attention will also turn back to Washington, D.C., this week as the Senate returns to session starting Tuesday. Votes in the House of Representative are scheduled to pick back up the following week. Congressional lawmakers broke for August recess last month without convening on terms of another fiscal stimulus package to support individuals and businesses still affected by fallout from the coronavirus pandemic. Lawmakers are also working to avoid a government shutdown at the end of the month, with reports late last week suggesting officials had agreed to work on a proposal for a short-term spending bill separate from ongoing coronavirus relief measures.Slack, Peloton earningsOnly a handful of major companies are set to report quarterly results this week, but a couple will be closely watched.Newly public companies Slack (WORK) and Peloton (PTON) are both set to post their quarterly reports this week, with each company having been viewed as a “winner” during the pandemic since their products have been used more widely as customers work and go to school from home.In its fiscal first quarter, Slack added a record 12,000 net new paid customers and 90,000 net new organizations, as more remote working catalyzed a surge in adoption of the software messaging platform. While the company still faces competition from Microsoft’s (MSFT) Teams service, Slack has so far held up strongly, posting a 132% net dollar retention rate.Story continuesStill, some analysts noted that the strong trends Slack enjoyed earlier this year could have pulled new adoption forward and away from the rest of the year, leaving some downside risk to second-quarter results.“On the one hand, we sense that 1) the bulk of WFH market behavior is still more tactical vs. strategic oriented, which could limit larger strategic engagement across a broader set of customers, a similar dynamic to what [Microsoft Teams] has been experiencing; and 2) the amount of marketing MSFT has done around Teams over the last few months has created more noise in the market,” Cowen analyst J. Derrick Wood wrote in a note Friday. He added that about 10% of Slack’s float is still being shorted by investors, in a testament to the uncertainty still surrounding the stock.Later in the week, Peloton will also report quarterly results, following a 180% run-up in shares so far for the year to date. Wall Street has largely been constructive on the connected fitness company’s long-term prospects, in an era when gyms nationwide are mostly still closed or opened with limited capacity. Among analysts, 23 rated the stock as a Buy, 2 as Hold and 1 as Sell, based on Bloomberg data Friday.“Peloton is on our US Analyst Focus List and is one of our top picks along with AMZN, FB, and SNAP,” JPMorgan analyst Doug Anmuth said in a note last week. “We continue to like shares into earnings and believe there is significant upside potential to consensus estimates both near- and long-term.”“Peloton’s biggest near-term challenge in our view is keeping up with elevated demand, with bike order-to-delivery times of ~6-7 weeks on average across the top 20 US DMAs [designated market areas] as of our checks on 9/1,” he added. “We note this is despite Peloton doubling its manufacturing pace since March, and management’s prior expectation of more normalized delivery times by July/August. While the delay is not optimal, we believe it bodes well for ongoing demand and sustained top-line strength and could also cap marketing spend longer than we previously expected.”Peloton is expected to swing to an adjusted profit of 12 cents per share on revenue of $576.5 million, growing sales over last year and last quarter.A Peloton exercise bike is seen after the ringing of the opening bell for the company's IPO at the Nasdaq Market site in New York City, New York, U.S., September 26, 2019. REUTERS/Shannon StapletonInflation dataThe economic data calendar will also be relatively light during the shortened week. Investors are still set to receive the Bureau of Labor Statistics’ monthly report on producer and consumer price trends, offering an updated look at the impacts of the pandemic on inflation in the U.S.To this end, the consumer price index will be closely watched. Consensus economists expect to see that consumer prices rose 0.3% month-on-month in August, moderating after a spike in autos and apparel prices drove a quick 0.6% increase in July. Last month’s core measure of consumer prices, which excludes food and fuel costs, also rose 0.6% month-over-month for its biggest jump in nearly 30 years.Core consumer price inflation rose 1.6% year-over-year in July to a four-month high, and is expected to match that pace in August.“We expect strong gains in a range of goods prices to push core CPI up markedly again in August, reversing more of the pandemic-related collapse in inflation,” Michael Pearce, senior US economist for Capital Economics said Friday. “The rapid rebound in goods consumption, which is now well above pre-pandemic levels, together with the only tepid recovery in production means inventory levels now look very lean. The worst affected categories, including motor vehicles, look set to post further strong price gains in August.”“Prices of many goods and services that plunged during the pandemic are now rebounding too, including clothing prices, air fares and motor insurance,” Pearce added.Earnings calendarMonday: N/ATuesday: Coupa Software (COUP), Lululemon (LULU), Slack (WORK) after market closeWednesday: American Eagle Outfitters (AEO) before market open; Zscaler (ZS), GameStop (GME), RH (RH) after market closeThursday: Peloton (PTON), Chewy (CHWY), Dave and Buster’s (PLAY), Oracle (ORCL) after market closeFriday: Kroger (KR) before market openEconomic calendarMonday: N/ATuesday: NFIB Small Business Optimism, August (99.0 expected, 98.8 in July); Consumer credit, July ($12.9 billion expected, $8.94 billion in June)Wednesday: MBA Mortgage Applications, week ended September 4 (-2.0% prior week); JOLTS job openings, July (6 million expected, 5.889 million in June)Thursday: PPI final demand, August month on month (0.2% expected, 0.6% in July); PPI excluding food and energy, August month on month (0.2% expected, 0.5% in July); PPI final demand, August year on year (-0.4% expected, -0.4% in July); PPI excluding food and energy, August year on year (0.3% expected, 0.3% in July); Initial jobless claims, week ended September 5 (830,000 expected, 881,000 prior week); Continuing claims, week ended August 29 (1.3255 million prior week); Wholesale inventories, July final month on month (-0.1% expected, 0.1% in June)Friday: CPI, August month on month (0.3% expected, 0.6% in July); CPI excluding food and energy, August month on month (0.2% expected, 0.6% in July); CPI, August year on year (1.2% expected, 1.0% in July); CPI excluding food and energy, August year on year (1.6% expected, 1.6% in July); Real average hourly earnings, August year on year (3.7% in July); Real average weekly earnings, August year on year (4.2% in July); Monthly budget statement, August (-$63.0 billion in July)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:August jobs report: US economy adds 1.371 million payrolls, unemployment rate dips to 8.4%E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEONike swings to a quarterly loss as coronavirus store closures dent resultsSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Disney earnings fall as coronavirus ‘significantly’ impacts parks, but ESPN, Disney+ shineFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}