{"article": [{"url": "https://finance.yahoo.com/news/if-voters-top-concern-is-health-care-biden-will-win-134942296.html", "published": 1600937840.0, "headline": "If voters’ top concern is health care, Biden will win", "body": "Health care is typically one of the top three voter concerns. In the 2018 midterm elections—one year after Republicans tried and failed to repeal the Affordable Care Act—health care ranked as the single most important issue for voters, helping Democrats regain control of the House.If health care is as important to voters in 2020, it could easily put Democrat Joe Biden into the White House in 2021. New polling by the nonprofit Commonwealth Fund finds that voters in 10 swing states likely to determine the outcome of the presidential race strongly favor Biden over Trump on three health care issues they identify as most important.Researchers asked voters in Arizona, Florida, Georgia, Michigan, Minnesota, North Carolina, Ohio, Pennsylvania, Texas and Wisconsin which candidate they thought would most effectively handle the COVID-19 pandemic, protect patients with pre-existing conditions and lower health care costs. They also did a national survey on the same questions. In the battleground states, 4,220 likely voters responded, while 1,435 likely voters responded in the national survey.On handling COVID-19, respondents in 9 of 10 swing states favor Biden, by margins ranging from 51%-44% in Texas, to 60%-35% in Georgia. Only in Ohio did respondents favor Trump over Biden, by 48%-45%. (In each state some respondents said they weren’t sure, ranging from 4% to 10%).Source: Commonwealth FundLikely voters in every swing state think Biden would be more effective at protecting people with pre-existing conditions. The lowest marks for Biden come in Texas, where respondents still go with Biden by 51%-41%. Biden’s biggest margin is in Georgia, where likely voters trust him over Trump by 63%-30%.Source: Commonwealth FundOn lowering health care costs, Biden dominates again, gaining the edge in all 10 swing states. His smallest margin is in Wisconsin, where he beats Trump 50%-38%. His largest margin, once again, is in Georgia, where he leads Trump 59%-35%.Source: Commonwealth FundThe Supreme Court factorThese findings and others ought to worry the Trump campaign. The Commonwealth survey was almost fully completed before the Sept. 18 death of Supreme Court Justice Ruth Bader Ginsburg, which has direct implications for the Affordable Care Act. The court will hear a case on Nov. 10 arguing that the entire ACA is unconstitutional and should be struck down. Ginsburg was one of four justices considered a reliable vote in defense of the ACA. A new Trump appointee could flip the court against the ACA and endanger the whole law. The court is likely to rule on the new case by next June.Story continuesBiden has already begun campaigning on his defense of the ACA, and Trump’s hostility toward it. The Trump administration is a party in the Supreme Court case, siding with the plaintiffs trying to kill the law. The ACA banned the old practice of insurance companies charging more for people with preexisting conditions, or denying them coverage altogether. That would once again be allowed if the court kills the ACA. Trump says he’ll protect people with preexisting conditions some other way, but he hasn’t yet said how, even though he’s been promising a health care plan for much of 2020. Biden could gain further traction if he convinces voters Trump’s third Supreme Court justice could jeopardize their own health care.Cars wait in line at a CVS pharmacy offering drive-thru COVID-19 nasal swab tests in Dallas, Friday, Sept. 18, 2020. (AP Photo/LM Otero)The Trump campaign should also be concerned about Biden’s large lead on health care in Texas and Georgia, which are normally reliable red states. Trump could still win those states, but a recent Atlanta Journal-Constitution poll found the candidates tied at 47%-47% in Georgia. Trump won Georgia by nearly 6 points in 2016. A reversal in 2020 could mean a Biden landslide. Polls in Texas are mixed, but they clearly suggest a much tighter race than in 2016, when Trump won the state by 9 points.Voter concerns on health care are somewhat different in 2020 than in 2018. Back then, the economy was solid and voters mostly cared about the cost of health care. Today, their biggest concerns are the pandemic and the risks to people with preexisting conditions, followed by health care costs.If there’s any good news for Trump, it’s that the economy is a bigger concern than health care for voters this fall. Voters tend to give Trump an edge over Biden on the economy, but that advantage has been narrowing as the pandemic recession drags on with no end in sight. COVID caseloads are rising, meanwhile, making health care an issue voters can’t ignore.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Democrats can save ObamacareHow Biden would undo the Trump tax cuts5 campaign promises Trump has given up onWhy Trump wants to shackle the postal serviceEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}