{"article": [{"url": "https://finance.yahoo.com/news/nearly-2-out-of-3-americans-are-more-concerned-about-access-to-health-care-since-the-start-of-coronavirus-poll-174549286.html", "published": 1600952000.0, "headline": "Nearly 2 out of 3 Americans are more concerned about access to health care since the start of coronavirus: poll", "body": "Americans are increasingly worried about access to health care, and the upcoming presidential election isn’t doing much to quell those concerns.According to a new Yahoo Finance/Harris Poll of 1,028 respondents conducted on Sept. 18, 65% of Americans — nearly 2 out of 3 — are more concerned about having access to affordable health insurance since the onset of the coronavirus pandemic.Read more: Paying for healthcare: What you need to knowAmericans are concerned about affordable health care. (Graphic: David Foster/Yahoo Finance)In the U.S., the coronavirus has killed over 200,000 people and counting, making the country the worldwide leader in the death toll. As a result of the high number of cases, many states implemented stay-at-home orders in March, which took a drastic toll on the economy. Nearly 7 million jobs were lost, and not all have since been recovered. With the loss of jobs came, in many cases, a loss of employer-sponsored health care. Although many workers were able to obtain health care coverage through a special enrollment period — a key part of Obamacare — this hasn’t been the case for everyone.With job losses continuing for many Americans, Dr. Katherine Baicker, dean of the Harris School of Public Policy at the University of Chicago, expects more health care coverage loss as well.“I certainly expect substantial changes as people lose jobs,” Baicker told Yahoo Finance. “One of the challenges of our employment-based private insurance system is that when you lose your job, you're at risk of losing your insurance as well. So I think more people will go without insurance. And among the people who were insured, there will be a lot of movement across plans and types of plans.”Emergency Medical Technicians (EMT) leave with a patient at Hialeah Hospital where the coronavirus disease (COVID-19) patients are treated, in Hialeah, Florida, U.S., July 29, 2020. REUTERS/Marco BelloBaicker continued: “Some people who lose their employer-sponsored insurance end up uninsured, some end up on Medicaid, some end up on a spouse's plan, some end up on privately-purchased exchange plan. I think we're going to see a lot more movement across this land, so a lot less stable coverage and more people falling into the ranks of the uninsured.”Story continues‘Over 20 million people who would lose their coverage’Adding to these concerns is the possibility that the Affordable Care Act (ACA), otherwise known as Obamacare, could be overturned by the Supreme Court, a prospect made more apparent with the recent death of Supreme Court Justice Ruth Bader Ginsburg, which has left an opening for President Trump to appoint a nominee. Trump has made it clear his priority is repealing Obamacare, even though he hasn’t made public a replacement yet.“There’s over 20 million people who would lose their coverage, and the health care system would be thrown into utter chaos because the implications of the ACA extend far beyond just the individual market,” Cynthia Cox, vice president at the Kaiser Family Foundation, told Yahoo Finance. “Obviously, there’s so much more to this law that affects virtually every American. So the implications stretch far and wide in our health care system.”People walk past an \"Express Care\" sign at Mount Sinai Hospital in Manhattan, which has treated hundreds of COVID-19 patients since March, on September 22, 2020. (Photo by Spencer Platt/Getty Images)A new survey from the Commonwealth Fund showed similar concerns about access and accessibility concerns. Likely voters stated that their main health issues when it came to choosing a candidate in the upcoming presidential election were the candidate’s ability to address public health needs and economic costs of COVID-19 (40%), likelihood to protect health insurance coverage for people with pre-existing conditions (39%), and likelihood to lower the cost of one’s health care (20%).Protecting pre-existing conditions has been a major point of concern, particularly for Democrats worried that the repeal of Obamacare would remove these protections. Trump has stated that he would use an executive order to ensure these conditions remained protected, and Vice President Mike Pence has echoed the sentiment. But experts are still concerned.“Striking down the Affordable Care Act... and taking away financing that has enabled states to provide health insurance to millions of people and enabled people with pre-existing conditions to access clinical coverage, that is going to take things away from people and return them to what the markets looked like prior to the Affordable Care Act,” Christen Linke Young, a fellow with the USC-Brookings Schaeffer Initiative for Health Policy at the Brookings Institution, told Yahoo Finance. Before the ACA was enacted in 2010, Young said, “if you didn’t get insurance from your job, you were pretty much out of luck. Even if you did get insurance from your job, that came with fewer protections than it does today.”Speaker of the House Nancy Pelosi speaks during the House Democrats news conference to unveil the \"Patient Protection and Affordable Care Enhancement Act,\" on June 24, 2020. (Photo By Bill Clark/CQ-Roll Call, Inc via Getty Images)‘The election could play an even bigger role’The Commonwealth Fund survey indicated that voters see former Vice President Joe Biden as more likely to address their health care concerns than Trump: 58% of likely voters said Biden had a stronger likelihood of protecting pre-existing conditions, versus 36% who said Trump; 56% said Biden was more likely to address COVID-related concerns, versus 39% who said Trump; and 53% said Biden was more likely to lower health care costs versus 37% who said Trump.Health care spending has increased exponentially since 1970. According to data from the Centers for Medicare and Medicaid Services (CMS), national health expenditures are projected to grow at an average rate of 5.5% a year between 2018 and 2027 and reach nearly $6 trillion by 2027.The Yahoo Finance-Harris Poll survey found that 30% of respondents are paying more for their health care now than they did in 2017.Health care costs have increased exponentially. (Graphic: David Foster/Yahoo Finance)But the poll also found that Americans are divided on whether the results of the presidential election will play a role in their health care costs: 32% said it would have no impact, 36% said a slight impact, and 32% said a major impact.The two candidates have different approaches to health care and lowering costs. Although Trump’s health care plan still isn’t clear yet, he has stated he wants to repeal Obamacare and increase price transparency, among other goals. Biden, meanwhile, wants to build upon the ACA.“It means the election could play an ever bigger role in the state of the ACA because if the Court decides that the individual mandate is unconstitutional and it’s not separable from the ACA … then I think protections for pre-existing conditions and a number of other aspects of the ACA, if not the entire law, could be thrown out,” Cox said.Adriana Belmonte is a reporter and editor covering politics and health care policy for Yahoo Finance. You can follow her on Twitter @adrianambells.READ MORE:How the Supreme Court could reshape Obamacare after RBG's deathSupreme Court to hear arguments on Obamacare, now crucial amid coronavirus pandemic, right after electionThe Supreme Court will consider Obamacare's constitutionality — and the outcome could bring 'total chaos'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}