{"article": [{"url": "https://finance.yahoo.com/news/universities-brace-for-a-permanent-wave-of-closures-as-coronavirus-pushes-schools-to-brink-153123471.html", "published": 1591871960.0, "headline": "Universities brace for a permanent wave of closures as coronavirus pushes schools to brink", "body": "When the coronavirus forced California State University (CSU), the largest four-year public university system in the nation, to transition all 23 campuses to virtual learning in March, Chancellor Timothy P. White had just 10% of courses available online.Three months later, he’s successfully moved roughly 80,000 courses to the digital space, but he faces a slew of new challenges: a potential hit to enrollment, depleting state funds, and rising costs associated with increased COVID-19 testing and contact tracing to ensure a safe environment.“We’re anticipating a $400 million a year, permanent reduction, which translates to 10% of what state appropriation typically is,” White said. “We put in a hiring freeze, so positions that are not absolutely vital will not be filled ... We stopped traveling. We are looking at projects that are costing money that can delay their start on hold for a while when the economy gets better. We also worked hard to build a reserve for a rainy-day fund. Well guess what, it’s raining now.”CSU’s financial challenges mirror those universities across the country face, as students reconsider enrolling in fall courses, uncertain about what those classes will look like.While White announced plans to conduct classes almost exclusively online for the upcoming semester, most universities remain undecided, prompting students to reexamine their fall plans.‘I could learn most of it from YouTube’Audrey Labovitz graduated from Rye High School in New York to pursue a mechanical engineering degree at Carnegie Mellon University. Now she’s questioning the value of a $75,000 annual tuition, if classes are limited to remote learning.“The value of college is often more about meeting people than learning things. Because with the internet now, I can learn anything without any help,” Labovitz said. “It would be helpful if I had professors, but if I really wanted to, I could learn most of it from YouTube.”That hesitation and the financial stress brought on by COVID-19 closures threatens to unleash a wave of school closures for an industry that was already struggling from demographic shifts, high tuition costs, and reduced funding.Story continuesThe large absence of international students, who pay full tuition, have complicated the economic picture. Many are unable to return to the U.S. because of visa and travel restrictions, adding to declining revenue.More than half a dozen colleges have announced closures since March.“What we have is thousands and thousands of individual institutions. The economic model for many of which is sort of a 19th century economic model, and it's not going to do very well going forward,” said Dr. Michael Crow, president of Arizona State University (ASU). “If you're running a small college in central Kansas, and your tuition keeps going up and up and up, and you're unable to adjust or to adapt to the speed of change around in the rest of the world. That's going to be a very difficult model.”TEMPE, AZ/USA - APRIL 10, 2019: Unidentified individuals on the campus of Arizona State University.‘We’re seeing a lot of hesitation’ASU is preparing for a hybrid semester, rotating between remote classes conducted on Zoom (ZM) and in-person lectures with reduced capacity. Crow said the university has invested significantly to ensure testing for every student, widespread contact tracing, and developed an app to help students track their health status.The university expects record enrollment for the fall, but Crow admits the real test will come in August.“We’re not seeing any diminishment in demand,” Crow said. “We’re seeing a lot of hesitation as to how best to execute. But as soon as we articulate how best to operate a healthy and safe campus, I think a lot of families will take comfort in that.”Colleges eager to attract students, have countered potential enrollment declines with incentives. The University of Nebraska is waiving tuition and fees for in-state students who are eligible for Pell Grants and come from families making less than $60,000 a year. The College of William & Mary rolled back a planned 3% tuition hike, while Thomas University in Georgia is offering a 30% discount to students who have lost jobs to the pandemic.Dec 27, 2019 Mountain View / CA / USA - Coursera headquarters in Silicon Valley; Coursera is an American online learning platform that offers massive open online courses, specializations, and degreesFewer college campuses ‘by a wide margin’Coursera CEO Jeff Maggioncalda says the disruption brought on by COVID-19 marks a tipping point for higher education and the business models most institutions have come to rely on. The online learning platform has worked closely with universities around the world to accelerate their digital transitions, while also opening its entire course catalogue to college students for free this summer. Nearly a million university students have signed up for the platform since March.“I think people are starting to realize that even if the pandemic magically went away and we have a vaccine, it’s not clear that the old model for higher education was the best way to do it,” Maggioncalda said. “Online learning has a lot of really valuable and cost effective contributions it can make and I think the future of on campus learning will include online learning.”Maggioncalda says that is likely to transform the four-year college degree into a more fragmented experience. Students may increasingly opt for online community college courses to fulfill general education requirements, while smaller liberal arts universities may look to share resources in the face of tight budgets.“The education system and credentials will almost all ubiquitously be available online, and certain universities, far fewer than today will add into that residential experience,” Maggioncalda said. “I think there will be fewer college campuses in the United States that people go to, maybe by a wide margin.Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaWeWork executive: Greater demand for co-working, enterprise to grow to 75%Small businesses operate in limbo as economies begin to reopenLarry Summers: Pandemic marks a ‘fairly profound structural change’ in economy"}]}