{"article": [{"url": "https://finance.yahoo.com/news/new-york-city-school-coronavirus-pandemic-135945370.html", "published": 1600420040.0, "headline": "New York City, the nation’s largest school system, is ‘in an impossible situation’ amid the coronavirus pandemic", "body": "This post has been updated with information from a New York City Department of Education employee.It’s been a rough week for the millions of children, parents, educators, and city officials involved in the reopening of New York City schools.After grappling with a shortage of teachers and buildings that are not ventilated well enough to deter transmission of coronavirus, the nation’s largest school district again delayed the start of in-person learning.“The [New York City] Department of Education has put P.S. 125 and many other schools in the city in an impossible situation,” Tamara Tucker, president of the parents association at P.S. 125 in Morningside Heights, which serves students from pre-kindergarten through fifth grade, told Yahoo Finance. “And I don't want to penalize the schools for being hamstrung like that.”The city provided parents with three main options for students starting the fall school year: in-person, fully virtual, or a combination of the two (known as blended). About 42% of public school students opted for fully remote learning, according to the latest Education Department (ED) data, and the other 58% opted for the blended instruction.Students return for their first day of in-class schooling following the pandemic at New York City's Preschool of the Arts, having their temperatures checked before proceeding into the school, Tuesday, 15 September 2020. (PHOTO: B.A. Van Sise/NurPhoto via Getty Images)Virtual learning started on Wednesday. But in-person and blended schooling, which was originally scheduled to start on September 10 and then delayed until September 21, will now be staggered and begin on October 1 for middle and high school students.The demands placed on schools to staff these classes are heavy: Principals said they simply didn’t have enough teachers or the resources to hire additional teachers for these three models of learning.“It was clear to me from the day they announced this whole system in June that there wouldn't be enough teachers to do what they were asking us to do,” a Brooklyn-based principal, who asked not to be named to avoid professional retaliation, told Yahoo Finance. “So many of us principals have been saying for months that there are not enough teachers to run it the way that they're talking about running it. … we all knew that they couldn't deliver.”Story continuesOn Tuesday night, New York City officials announced that parents who chose the “blended” option — meaning students would spend part of the week in school and the other part online with virtual classes — would not actually be guaranteed any virtual instruction when they’re not in school given staffing issues.New York City Mayor Bill de Blasio in New York City, New York, U.S., June 23, 2020. (PHOTO: REUTERS/Caitlin Ochs)“The most upsetting part is the lack of transparency from the mayor and the chancellor,” a Brooklyn-based high school English teacher, who asked not to be named, told Yahoo Finance. “Since we initially went remote in March, I have found out about most of these important changes via Twitter, which is ridiculous. … I don't even take these updates seriously anymore because I know they'll likely be a new contradictory one a few days from now, so why bother?”New York City Mayor Bill de Blasio said that the city would hire 2,500 additional teachers. But in the race to hire, an underlying structural issue surfaced: There just aren’t enough teachers around.“What other industry would be allowed to operate this way and make decisions this way?” Tucker said. “It just seems mind boggling. … I don't know how to hold anybody accountable. I don't understand, there's just no repercussions for this like completely backwards decision making.”A New York City ED employee told Yahoo Finance that the city is actually looking to “redeploy” ED staff who were previously teachers to help with the teacher shortage the city. According to the ED, the redeployment period would be temporary and end on Dec. 31, 2020 — unless both the ED and the United Federation of Teachers labor union agree to an extension.(Source: New York Department of Education)‘Lack of leadership’ led to ‘impossible situation’On Thursday, more chaos ensued as parents across the city learned that they wouldn’t be sending their children to school next week.The entire fiasco is “due to the lack of leadership,” Daniel Friedrich‬, an associate professor at Columbia University’s Teachers College and a parent of children in the New York City school system, told Yahoo Finance. “We shouldn't be in this business to begin with — there was a lack of action from the administration in general, to address the epidemic … [and on top of that] the chancellor and the mayor here in many ways failed to act throughout summer.”‪Randi Weingarten, president of the American Teachers Federation, the second-largest teachers union in the country, stressed that the lack of mandates or federal guidance and lack of funding for school complicated the situation once the fall came around.“I'm sorry that I sound so angry about all of this stuff, but all of this was foreseeable to anyone who is a schools person,” Weingarten told Yahoo Finance’s First Trade (video above). “This is part of the reason why we started fighting for how to reopen schools and the resources back in April.”Cases are up significantly in Wyoming, Wisconsin, Connecticut, and Puerto Rico. (Graphic: David Foster/Yahoo Finance)Weingarten asserted that Education Secretary Betsy DeVos could have “created all sorts of other mandates or guidance for planning and for resources,” but simply didn’t.“Look what is happening in terms of resources in schools, and you tell me that kids are priorities,” Weingarten said. “They're not priorities to this administration. And I'm sorry I'm angry about it, but how can we rush to help a cruise industry, bars and restaurants, which I think are really important, but not rush to get the resources for kids? Why is it that ventilation and soap, which should have been important forever, are now only important? … they are trying to actually undermine public education.”New York City’s experience is being closely watched since it’s not only the biggest school district in the country, but also one of the few to resume in-person instruction amid the pandemic. Los Angeles County, the second biggest district, opted for remote learning until November but is making exceptions for small classes for some children with special needs,Virtual learning is also the primary option for students across Chicago, Miami, Houston, and others, according to a tracker compiled by Education Week. DeVos continues to push for in-person schooling. During a recent press conference on Monday at a school in Grand Rapids, Mich., she called the lack of in-person learning a “real tragedy” for children.U.S. Education Secretary Betsy DeVos attends a coronavirus disease (COVID-19) pandemic response event about reopening schools hosted by U.S. President Donald Trump at the White House in Washington, U.S., August 12, 2020. REUTERS/Kevin Lamarque‘They’re heroes and they’re underpaid and overworked’The pressure on teachers, meanwhile, is relentless.“We get a lot of crap from other people saying, ‘Oh, well you guys are lazy. You don’t want to go to work,’” a second grade teacher in Brooklyn, who asked not to be named to avoid retaliation, told Yahoo Finance. “We did more — we went above and beyond because we care and love our students and we don’t get the support that we should get financially.”The city’s leadership is “not in tune with what’s happening in schools,” she added. “And they’re not in tune with what the rest of the city looks like.”A teacher conducts a lesson with students during an outdoor learning demonstration for New York City schools in front of the Patrick F. Daly public school (P.S. 15) on September 2, 2020 in the Brooklyn borough of New York City. (Photo by ANGELA WEISS/AFP via Getty Images)Seventh grade English teacher Kelly Walker, who teaches at a school in Long Island City in Queens, is one of the relatively lucky teachers in the city right now.“I’m really in a good position, to be honest,” she said in an interview. “I work for a really great admin, so they’ve been really on top of their game.”She added that “I have friends teaching all over this city [and] it’s been absurd that on a day to day basis… It makes it kind of impossible for principals and administrators to be able to plan sufficiently.”A teacher works outside a school building for safety reasons, as preparations begin for the delayed start of the school year, following the outbreak of the coronavirus disease (COVID-19) in the Brooklyn borough of New York City, U.S., September 14, 2020. (PHOTO: REUTERS/Brendan McDermid)Lawrence Mishel, a labor market economist at the Economic Policy Institute, noted that “10 years ago, teachers were being vilified — they were put on the cover of magazines as being lazy.” Now, as teachers serve on the front lines of the pandemic, “there is a better appreciation that teachers. They’re heroes. And they’re underpaid and overworked, and they face tremendous challenges and none more than during the pandemic.”Friedrich, the Columbia University Teachers College professor and parent, stressed that society has to make sure to not put too much pressure on the people instructing children.“Teachers are not priests,” he said. “They're not there to save the world and sacrifice themselves, right? This is not a religious colony. Teaching is a job and you shouldn't have to give up your life for, or your job.”—Aarthi Swaminathan and Reggie Wade are reporters for Yahoo Finance. Janna Herron contributed to this story.Aarthi can be reached at aarthi@yahoofinance.com and rwade@verizonmedia.com. Follow them on Twitter at @aarthiswami and @ReggieWade.Read more: ‘I was misled’: Public school teacher tells Congress about student debt nightmareU.S. teachers increasingly struggle to find affordable housing: StudyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}