{"article": [{"url": "https://finance.yahoo.com/news/powell-fed-trying-not-to-run-through-the-bond-market-like-an-elephant-163421802.html", "published": 1592307740.0, "headline": "Powell: Fed trying not to 'run through the bond market like an elephant'", "body": "Federal Reserve Chairman Jerome Powell pushed back on concerns over the Fed’s intervention in the corporate bond market, telling Congress on Tuesday that the central bank is prioritizing proper market functioning with its purchases.“I don’t see us as wanting to run through the bond market like an elephant doing things and snuffing out price signals or anything,” Powell told the Senate Banking Committee. “We want to be there if things turn bad in the economy.”Since the second week of May, the Fed has been purchasing corporate bond ETFs with “broad exposure” to U.S. investment-grade debt and some high-yield debt from companies that fell below investment-grade after March 22.On Monday, the Fed announced it would expand the scope of its purchases by creating a “broad, diversified market index” and purchasing individual corporate bonds in the secondary market. Although the Fed had already previously committed to individual corporate bond purchases, the Fed’s intention to create its own index suggests that the central bank will pick the bonds to buy as opposed to wait for sellers to offer them.Bank of America’s global research team noted Tuesday that the Fed’s move is “bullish” for spreads, which tightened in response to Monday’s announcement.Pennsylvania Republican Pat Toomey on Tuesday pressed Powell on the need for the corporate debt purchases, arguing that the Fed may “diminish price signals” in the market.Powell insisted that Monday’s announcement is not for the purposes of increasing the dollar volume of the corporate debt facility but for “shifting away” from bond ETFs in favor of its own index of bonds. Powell added that the Fed had committed to backstopping the corporate debt markets as early as late March.“We feel that we need to follow through and do what we said we were going to do,” Powell said.Close up of the Federal Reserve building with the eagle statue.The Fed’s corporate bond purchases are currently being done through its Secondary Market Corporate Credit Facility, which began operations on May 12 with plans to continue through September 30. The facility is backed by $25 billion of equity from the U.S. Treasury, appropriated through the Coronavirus Aid, Relief, and Economic Security (CARES) Act passed in March.Story continuesA separate facility, the Primary Market Corporate Credit Facility, plans on purchasing corporate debt directly from the issuers themselves. The facility, which is backed by $50 billion of equity, has yet to go live.Powell, who said he originally expected heavy demand in the primary market, says he now sees no demand.Combined, the two facilities can be levered up to support as much as $750 billion in purchases. As of June 10, the secondary facility had only $5.5 billion of purchases, all in bond ETFs.Powell said market functioning has improved “substantially” since setting up its operations.“If things go in a negative direction, we want to make sure that we’re there,” Powell told Congress.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed proposes expanding Main Street loan program to nonprofitsFed to expand purchases of corporate bonds in secondary marketFederal Reserve grapples with links between monetary policy and income inequalityPowell: Capping US Treasury yields 'remains an open question'A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}