{"article": [{"url": "https://finance.yahoo.com/news/curbside-pickup-is-exceptionally-sticky-and-will-continue-postpandemic-mc-kinsey-retail-expert-183712446.html", "published": 1598881520.0, "headline": "Curbside pickup is 'exceptionally sticky' and will continue post-pandemic: McKinsey retail expert", "body": "Back in mid-March, at the outset of the COVID-19 pandemic, Dick’s Sporting Goods launched a curbside pickup option at most of its U.S. stores: order an item online or from your phone, pick it up outside your nearest Dick’s store. (Across retail, the curbside option is also being called BOPIS: Buy online and pick up in store.)Curbside was hugely popular and helped drive Dick’s to a record Q2. Consider this stat: 75% of Dick’s online orders in Q2 were fulfilled by stores (either shipped to a customer from their nearest store or picked up curbside, rather than shipped from a warehouse). Now, even after Dick’s reopened its stores to in-store shoppers (masks on) in June, curbside continues to thrive. “We anticipated originally that we would see a large drop-off when the stores reopened,” Dick’s president Lauren Hobart said on the earnings call, “but that is not the case.” Dick’s CEO Ed Stack declared: “It started off as a safety piece. People wanted it because they didn't want to come in contact with anyone else. It's now becoming a convenience piece.”Dick’s (DKS) isn’t the only one. Best Buy (BBY) moved to a curbside-only model at all its stores in late March, and its online sales rose an eye-popping 242% in the second quarter. The electronics chain reopened its stores to shoppers in June, but CEO Corie Barry said on the earnings call that it will not only continue to offer curbside, but will enhance it by “adding functionality that will display information about high and low traffic times and provide digital updates for customers when they are in the parking lot waiting for their curbside orders.”An employee of Best Buy delivers products to a shopper, as customers pick up goods from retailers offering curbside pick up as the coronavirus disease (COVID-19) restrictions ease in Syracuse, New York, U.S., May 15, 2020. REUTERS/Zachary KrahmerCurbside pickup is thriving outside the U.S., too, in countries like China and Italy. That’s why McKinsey senior partner Sajal Kohli thinks the option is here to stay, even beyond the pandemic.“We think curbside is going to be exceptionally sticky,” Kohli tells Yahoo Finance. “The fundamental question for most retailers is, if you think about the retail box and the physical footprint, what’s the strategic intent of the box in the world of omni-channel post-COVID? Some categories are still going to be incredibly conducive to in-store interaction, but for several categories, I think consumers discovered this newfound convenience and they will actually stick to curbside, which has massive implications, as you can imagine, for retail.”Story continuesThe implications start with a company’s supply chain: the growth of curbside is a “massive pivot,” Kohli says, that will shift many chains to “small-drop economics” rather than giant trailer-loads of goods being brought to every store.A man wearing a mask walks past restaurant advertising curbside pickup during the outbreak of coronavirus disease (COVID-19) in Washington, U.S. April 10, 2020. REUTERS/Joshua RobertsAnd it isn’t just retail purchases: curbside pickup for food has soared amid the pandemic.Walmart (WMT) had a huge Q2 in which its online sales rose 97%, and the company highlighted the growth of its grocery business and curbside grocery pickup in the quarter.That was already starting before the pandemic. Walmart U.S. president Greg Foran told Yahoo Finance a year ago that online grocery was creating a “halo effect” on the rest of Walmart’s business.Of course, food chains like Chipotle, Starbucks, and Dunkin’ Donuts have already made huge gains in mobile ordering and quick pickup before the pandemic, and were well-suited to beef up that option while stores were closed for months. (Domino’s calls its version “carside pickup.”) They save on delivery costs, and customers get instant satisfaction.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Why Dick’s sporting goods is wildly outperforming amid the pandemicWalmart and Target huge e-commerce gains are a blaring siren to brick-and-mortar retailAmid pandemic, Walmart says it’s seeing increased sales of tops—but not bottomsCompanies like Nike and Dick’s are ‘finding their woke values’Etsy CEO on huge Q2: Etsy is 'becoming much more mainstream'Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’Facebook ad boycott is ‘more noise than fundamental risk’"}]}