{"article": [{"url": "https://finance.yahoo.com/news/serial-tech-entrepreneur-launches-prisma-ambitious-alternative-to-school-its-a-very-progressive-approach-to-education-135052169.html", "published": 1597481900.0, "headline": "Serial tech entrepreneur launches ambitious alternative to school: 'It's a very progressive approach to education'", "body": "Victoria Ransom and her husband homeschool their three young children, but started worrying about the lack of a robust program as they grew older. So they began to brainstorm what a creative but effective alternative to traditional school could look like.After selling their social media marketing company Wildfire to Google for $450 million in 2012 — and staying with the tech giant for three years — Ransom and Alain Chuard started scratching their insatiable entrepreneurial itch once again.Over the last two years, they self-funded and developed an edtech startup called Prisma, which goes live on September 8 for 40 U.S. students divided into two cohorts. While conceived prior to the coronavirus pandemic, the interest and urgency have increased as virtual learning has gone entirely mainstream and school districts struggle to execute safe and effective hybrid models for the fall.“In a nutshell, we solve the two biggest issues with home-based learning (i.e. lack of a consistent social experience and the heavy involvement of parents) while keeping all the good stuff - flexibility, self-paced and experiential learning, curriculum focused on the interests of the child,” Ransom told Yahoo Finance.For the first semester, Prisma is focusing on fourth to eighth graders, who come from across the socioeconomic, racial and geographic spectrum. The standard pricing is $7,900 per year, but there’s a sliding scale based on family income.Each Prisma cohort will be assigned a coach who “supports learners by sparking conversations, helping them set and achieve goals, providing academic support as needed, communicating with parents, and, most importantly, becoming a trusted role model in the lives of the learners.”‘A new approach to education’While Ransom bills Prisma as a complete alternative to school, the startup is not an accredited institution and currently does not have plans to become certified. Individual parents would have to register their children as homeschoolers.Story continues“It's a very progressive approach to education and we are selecting [parents] on their willingness to help us build the model. It is a new approach to education, we think it will be really amazing for kids but we want a lot of feedback. Part of our belief here is we should listen to what the kids want and really react and adapt our model quickly,” Ransom said in an interview on Yahoo Finance’s On the Move.These alternative models to school have proliferated the marketplace for all ages. While many are successful for smaller cohorts, it’s a hard model to scale.Ranging from various leadership-focused schools like Dida Academy to the failed Mark Zuckerberg-backed AltSchool, educators and entrepreneurs alike have tried to come up with novel solutions to energize students who don’t thrive in a traditional classroom.Young student doing homework at home with school books newspaper, digital pad helped by his mother. Mum control, help and teaching his son. Education, family, lifestyle and homeschooling concept.The startup Mission U was founded by philanthropist Adam Braun in 2016 as a robust alternative to a four-year college degree, focused on hard skills and job placement. The one-year program also had a revolutionary payment plan — students didn’t have to pay tuition upfront and instead signed an income share agreement, pledging to pay 15% of their salary for three years after completing the program — but only if they earned $50,000 or more annually.Before Mission U’s efficacy could even be measured, it was shut down. After accepting a cohort of 25 students who took classes in data science and product management, the company was acquired mid-year by WeWork for $4 million. Upon acquisition, the program was terminated and folded into WeGrow, the now beleaguered co-working company’s $42,000-a-year school. The deal was effectively an acquihire, with Braun becoming the COO of the venture.Prisma has a lot to prove, but also finds a willing audience as families have been forced to throw the blueprint of normalcy out the window.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:The 'modest, unorthodox' newsroom? An experiment marks a new era for digital mediaAmazon CEO Jeff Bezos will 'try to win over hearts and minds’: What to expect at the antitrust tech hearingWNBA Commissioner: 'There is nothing political about Black Lives Matter'The US saw the highest rate of new women CEOs so far this yearDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperity"}]}