{"article": [{"url": "https://finance.yahoo.com/news/just-3-of-top-financial-regulators-in-last-106-years-were-black-201953652.html", "published": 1595950040.0, "headline": "Just 3% of top financial regulators in last 106 years were Black", "body": "In 1913, President Woodrow Wilson signed the Federal Reserve Act into law and, in the process, moved the U.S. toward our modern financial system. The initial appointments to the Fed’s board were – not surprisingly for the time – lacking in diversity.But a detailed new study of the financial regulatory elite finds that things haven’t changed much since then, raising concerns that the financial services industry is getting away with oversight that doesn’t represent many Americans.The study from Georgetown University law professor Chris Brummer looked at 327 individuals who have been confirmed by the Senate to different financial agencies in the last 106 years and found that just 10 of them have been Black.“The representation has been pathetic,” Brummer said during an appearance on Yahoo Finance’s The Ticker.Brummer’s study included the Federal Reserve Board, the Securities and Exchange Commission (SEC), the Federal Deposit Insurance Corporation (FDIC), and others.Brummer says the consequence of his findings is that entire groups don’t have representation “to paraphrase [Alexander] Hamilton, who are in the room when it happens when it comes to devising policies” that directly impact their community. The first Black nominee found in the study was Andrew Brimmer, who joined the Federal Reserve Board of Governors in 1966.Members of the Board of Governors of the Federal Reserve System - including Andrew Brimmer - in the early 1970s.There have been efforts to change it. The Dodd–Frank Wall Street reforms of 2010 mandated that offices of \"Minority and Women Inclusion\" be sprinkled across the regulatory agencies, but these offices have clearly had limited success: there is currently just one identifiable Black political appointee serving at or near the top of a U.S. financial regulatory agency: Rodney Hood, the chairman of the National Credit Union Administration.‘The statistics are disappointing’Sen. Sherrod Brown is the ranking Democrat on the committee that handles many of these nominees. In a statement to Yahoo Finance, a spokesperson acknowledged that \"while the statistics are disappointing, Sen. Brown has and will continue to encourage and support nominees of color,\" adding \"everyone needs to do more to increase diversity.\"Story continuesAnother member of the committee, Sen. Catherine Cortez Masto (D-NV) – has made diversity part of her mandate since coming to office in 2017 as the first Latina ever to serve in the U.S. Senate.“We should be mandating diversity,\" Cortez Masto told Politico about diversity among Senate staffers. “Those individuals can go on to run for statewide office or a federal office at some point in time.”The Senate Banking, Housing and Urban Affairs Committee is where many financial regulators - including Jerome Powell - are vetted before being confirmed to their positions. (Alex Wong/Getty Images)An aide to Cortez Masto noted a challenging environment for diversity on all fronts, including just getting the full picture of the problem. “Just disclosure, just flat out disclosure [of names] has been a fight and been partisan,\" the aide said. \"It's something we struggle with all the time.”Democratic presidential candidate Joe Biden acknowledged the problem this week, saying that the leadership of Washington’s many federal agencies “do not reflect the diversity of our country.” In his newly released platform addressing economic equity, Biden specifically committed to promoting “diverse leadership in the financial regulatory agencies.” Brummer says this a significant new statement for a campaign to make that “this just isn’t right.”The current landscapeBrummer’s study also took a look one level down at current senior staff at federal agencies, a top strata but one not subject to Senate confirmation. He found diversity was lacking there too: just 5 of 120 staffers he followed (4.17%) are African-American.The study didn’t focus on other measures of diversity like gender or Latino or Asian nominees. The current board of the Federal Reserve includes 3 men and 2 women. Two nominees, one man and one woman, are currently awaiting a full confirmation vote in the Senate.The Federal Reserve Board building. (DANIEL SLIM/AFP via Getty Images)Brummer lays the blame for the dismal statistics at the feet of both parties, calling it a “bipartisan failure.” The Senate pipeline for financial regulatory roles has produced overwhelmingly white nominees no matter which party is making the push, he said.Lack of representation among the nation’s top financial regulators will make it more difficult to address the financial inequities faced by Black communities, issues that have been highlighted amid Black Lives Matter protests across the country. FDIC data shows that Black communities lack financial inclusion, as Black households were more likely to be unbanked than Hispanic, Asian, or white households. Without regulated banks to turn to, Black communities rely on payday lenders, where they are more vulnerable to falling prey to debt traps, based on data from Pew Research.The COVID-19 crisis has also specifically exposed financial weaknesses in Black communities. JPMorgan Chase data reports that Black-owned small businesses saw deeper cash crunches in this crisis than the comparable average business did.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. Ben Werschkul is a producer for Yahoo Finance in Washington, DC.FOMC Preview: 'Probably nothing' new as Fed weighs guidance amid coronavirus surgeSenate panel advances Trump nominees Shelton, Waller for spots at FedA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}