{"article": [{"url": "https://finance.yahoo.com/news/hyatt-ceo-says-china-offers-195545612.html", "published": 1596553400.0, "headline": "Hyatt CEO Says China Offers Proof Hotels Don’t Need a Vaccine to Recover From Coronavirus", "body": "Hyatt CEO Says China Offers Proof Hotels Don’t Need a Vaccine to Recover From CoronavirusA coronavirus vaccine isn’t necessarily a must-have ingredient to revive the struggling hotel industry, according to Hyatt CEO Mark Hoplamazian.Hotel analysts and executives spent the last several months saying the industry would not recover from the coronavirus-induced cratering in travel demand until a vaccine or treatment was in widespread distribution. But China’s tough crackdown on movement and social interaction during the early months of the pandemic paid off. The country now leads the world in hotel performance, and Hyatt is even hosting group business events at its properties in Greater China.“China serves as a great example that travel recovery is possible even without pharmaceutical treatments or a vaccine as long as proper, well-coordinated actions are taken to significantly reduce the spread of the virus,” Hoplamazian said Tuesday during an investor call.Join Us For Our Skift Global Forum Online Conference September 21-23 Hyatt’s Greater China — which includes Hong Kong, Macau, and Taiwan — average occupancy rate at full-service hotels was 55 percent in preliminary July numbers. Average full-service hotel occupancy hit 64 percent in Mainland China.The numbers are a steep rebound from the 7 percent industry low seen in early February and show China is even beginning to see business travel return on top of the leisure and drive-to bookings leading most world markets into a travel recovery. Business transient travel accounted for more than a quarter of Hyatt’s July hotel demand, according to the preliminary figures.Northern China, which had a brief setback in June with a second wave outbreak in Beijing, is lagging the rest of the country. But occupancy levels in eastern, southern, and western China at the end of July were at 2019 levels, Hoplamazian said.“You can’t get to those occupancy levels without having mid-week business,” he later added.Marriott CEO Arne Sorenson similarly lauded China’s strong, centralized response to the pandemic earlier this summer.Story continuesU.S. analysts continue to warn of a hotel recovery plateau due to most convention and group business planners shying away from booking a large-scale event until a vaccine is readily available. But Hyatt even saw a return of group business at its Chinese hotels in July by hosting product launches for BMW, Volvo, and Gucci.“We’re encouraged by this across the board,” Hoplamazian said. “The transient activity we’ve seen, especially the leisure transient, was driven by some extraordinary action by our local teams.”Carrying the Weight of the PandemicAs the coronavirus pandemic devastated the world economy in the second quarter, it also ravaged Hyatt’s profit margins.Hyatt reported a $236 million second quarter loss this week, which was a 376 percent drop in income since the same time last year. Revenue per available room, the hotel industry’s key performance metric, was down nearly 90 percent.With roughly $3 billion in liquidity, the company is able to operate at second quarter low-demand levels for three years, according to Hyatt Chief Financial Officer Joan Bottarini.But the company’s leaders stressed Tuesday it would be highly unlikely to see the second quarter become Hyatt’s new operational norm.“The second quarter was challenging but in line with what we were expecting,” Hoplamazian said. “We do believe the worst is behind us, and we’re seeing positive signs developing around the world with clear pockets of strength.”China’s tough crackdown in combatting the spread of the virus earlier this year may have made a quick recovery possible without a vaccine, but Hoplamazian recognized other parts of the world like the U.S. continue to struggle in containing the virus. That will hinder Hyatt’s own recovery, as Greater China only accounts for 10 percent of Hyatt’s franchise fees and 5 percent of earnings.“The recovery, especially as it relates to business travel here in the U.S., will continue to be challenging,” Hoplamazian said. “But we are confident the pent-up demand for travel will lead to meaningful recovery as Covid-19 cases come under control and as effective treatments and/or vaccines are widely available.”Beyond the CrisisDespite the brutal quarter, the Hyatt team remains in growth mode for years beyond the pandemic.The company expects to expand its global room count by more than 4 percent in 2020, down from original projections of as much as 7 percent. However, the updated forecast doesn’t include growth from independent hotel operators or even those from a competing brand taking on a Hyatt flag, which Hoplamazian and other hotel CEOs have cited as a key growth opportunity coming out of the pandemic.This so-called conversion growth could also help offset new-build project delays, as financing for U.S. select service properties is particularly tough at the moment.“[Conversions] will be at least as productive, if not more so, than [they were] last year,” Hoplamazian said. “The timeline is unknown because every one of these has their own profile.”Several conversion deals are still expected to close by the end of the year, he added.In the meantime, hotel operators and sales teams are learning to do more with less. Hyatt laid off 1,300 employees in May as a result of the pandemic. The company has made other moves to cut costs at hotels in the low-demand environment, including reduced staffing levels and limited meal options at hotel dining venues.The cost-savings initiatives have enabled properties like the Hyatt Regency Lost Pines Resort and Spa outside Austin to operate at financial breakeven points significantly lower than in normal travel years, Bottarini said.In the meantime, Hyatt plans to build out of the pandemic through a hyper-local strategy in marketing to nearby travelers and capture as much demand as possible, especially at its drive-to resorts.“A local focus and having strong teams on the ground in those hotels is critical,” Hoplamazian said. “A lot of this is based on trust, on relationships — very much an exercise in old-school hotelier practices, and it’s working.”Register Now For Skift Global Forum, Happening Online September 21-23 Subscribe to Skift newsletters for essential news about the business of travel."}]}