{"article": [{"url": "https://finance.yahoo.com/news/jobs-report-education-sector-is-shedding-teachers-amid-state-and-local-budget-pain-140852985.html", "published": 1601716580.0, "headline": "America's education sector is facing job losses 'you do not want to see'", "body": "The education sector is shedding jobs, and analysts worry that that they may never come back.“You’re seeing state and local governments cutting back on teachers, you’re seeing seeing even in the private sector, the number of education workers cut back,” Greg Daco, chief U.S. economist at Oxford Economics, told Yahoo Finance’s First Trade (video above). “That’s a function of state and local budgets… state and local government budgets are really being strained and that is going to hurt teachers, health workers, safety workers.”The monthly jobs report announced a “weaker than expected” rise in payrolls and noted a “drop in government education employment.” The education industry is officially looking at a loss of around 355,000 jobs since February, the BLS report stated.(GRAPHIC: David Foster)Employment in local government education fell by 231,000, and state government education fell by 49,000. Those affected can range from school teachers, teaching aides college professors, administrators, janitors, and more. Even private education was hit with a 69,000 loss in jobs, despite gaining in August, the report noted. These jobs include teachers and professors and staff at private schools and colleges.“That is the type of job loss you do not want to see,” Daco noted, “because it’s likely to last for quite some time and hurt us all.”‘It’s devastating’Signs of America’s worsening teacher shortage are evident: New York City has been struggling with reopening the country’s largest school district amid a lack of teachers.Yahoo Finance previously reported that employees at the city’s Department of Education are being “redeployed” to plug the gap.“It’s devastating,” Elise Gould, the think tank’s senior economist, told Yahoo Finance. “Schools are struggling to open with the pandemic — it seems like they may need more resources, not fewer resources in these challenging times and to see their resources fall is particularly distressing.”Cassie Buzze, a site director with the YMCA and teacher, helps Tristan Wild with an exercise at the Anza Elementary School campus in Torrance on September 17, 2020. (Genaro Molina / Los Angeles Times via Getty Images)Gould’s research previously noted that austerity after the Great Recession is one of the factors causing this shortfall in the K-12 school system in particular, one that we have yet to recover from.Story continuesThe House recently passed a $2.2 trillion stimulus package that included $436 billion for state and local governments, as well as $282 billion for education and childcare, but the legislation will not be taken up by the Senate unless the White House and Democrats can make a deal.\"These heart wrenching numbers show the necessity of state and local aid, but Senate Republicans and the President have fiddled while the country burns,” Randi Weingarten, president of the American Federation of Teachers, told Yahoo Finance. “​The blame lies squarely at the feet of those who’ve refused since May to pass the HEROES Act or negotiate a new COVID stimulus bill to address the economic pain this crisis has inflicted. ... It’s malpractice—and without urgent action it’s only going to get worse.”—Aarthi Swaminathan is a reporter for Yahoo Finance, covering education. She can be reached at aarthi@yahoofinance.com. Follow her on Twitter at @aarthiswami.Read more: New York City, the nation’s largest school system, is ‘in an impossible situation’ amid the coronavirus pandemic‘I was misled’: Public school teacher tells Congress about student debt nightmareU.S. teachers increasingly struggle to find affordable housing: StudyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}