{"article": [{"url": "https://finance.yahoo.com/news/nio-china-receives-first-two-134201435.html", "published": 1593507020.0, "headline": "NIO China Receives First Two Installments of Cash Infusion", "body": "NIO Inc. NIO recently announced that its strategic investors, including Hefei City Construction and Investing Holding, CMD-SDIC Capital and Anhui Provincial Emerging Industry Investment, have completed cash injections for NIO Anhui, a legal entity of NIO China wholly owned by the company, for the first two installments of funding commitments.NIO Anhui's minority investors include Jianheng New Energy Fund, Advanced Manufacturing Industry Investment Fund, Anhui Provincial Sanzhong Yichuang Industry Development Fund Co. and New Energy Automobile Fund.The investor group has pledged a cumulative contribution of 7 billion yuan in five installments, with 3.5 billion yuan to be paid in the first installment, 1.5 billion yuan to be paid in the second installment on or before Jun 30, 2020, 1 billion yuan to be paid in the third installment on or before Sep 30, 2020, 500 million yuan to be paid in the fourth installment on or before Dec 31, 2020, and 500 million yuan to be paid in the fifth installment on or before Mar 31, 2021.NIO will invest its core businesses and assets into NIO Anhui in China, including vehicle research and development, the supply chain, sales and services and NIO Power, or jointly as Asset Consideration. Further, the company would pump 4.26 billion yuan of cash into NIO Anhui. After conclusion of the transaction, NIO will own 75.9% of NIO China's controlling equity shares and the remaining 24.1% will be owned by the strategic investors jointly.For the first two installments, NIO Anhui has already received 4.8 billion yuan, totaling 5 billion yuan in cash funding. It will earn the remaining 200 million yuan before Sep 30, 2020. Of the cash portion, the company has injected 1.278 billion yuan for the first installment and another 1.278 billion yuan for the second installment into NIO Anhui.Strategic investments in NIO China will provide ample funds to support NIO's ongoing efforts to lead the premium smart electric vehicle (EV) technology and product development, and provide the best user experience and services. The company is aiming to focus on improving its production capacity in the near term and expanding network coverage to further boost growth.Story continuesIncreasing demand for NIO’s ES6 and ES8 models is likely to drive its sales and earnings. Despite a slowdown in global auto sales — especially in the EV market — in first-half 2020 amid the coronavirus crisis, NIO managed to achieve record-high monthly deliveries in May 2020. Notably, NIO registered monthly deliveries of 3,434 units in May. Sales skyrocketed 215.5% year over year on solid demand for ES6 and ES8 models.However, the company has been bearing the brunt of operational inefficiency for the past several quarters. While rising deliveries are expected to have aided NIO’s revenues, escalating R&D and SG&A costs might have dented operating margins.Zacks Rank and Stocks to ConsiderNIO currently carries a Zacks Rank #3 (Hold). Shares of the company have appreciated 79.9%, year to date, as against the industry’s decline of 13.7%.Some better-ranked stocks are Niu Technologies NIU, Tesla TSLA and AngloGold Ashanti Limited AU, each carrying a Zack Rank of 2 (Buy) at present. You can see the complete list of today’s Zacks #1 (Strong Buy) Rank stocks here.Shares of Niu have surged 82% year to date, as against the industry’s decline of 15.5%.Shares of Tesla have soared 141.3%, year to date, compared with industry’s rise of 32.4%.Shares of AngloGold have rallied 29.9%, year to date, compared with the industry’s gain of 23.9%.Biggest Tech Breakthrough in a Generation Be among the early investors in the new type of device that experts say could impact society as much as the discovery of electricity. Current technology will soon be outdated and replaced by these new devices. In the process, it’s expected to create 22 million jobs and generate $12.3 trillion in activity.A select few stocks could skyrocket the most as rollout accelerates for this new tech. Early investors could see gains similar to buying Microsoft in the 1990s. Zacks’ just-released special report reveals 8 stocks to watch. The report is only available for a limited time.See 8 breakthrough stocks now>>Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Tesla, Inc. (TSLA) : Free Stock Analysis Report AngloGold Ashanti Limited (AU) : Free Stock Analysis Report NIO Inc. (NIO) : Free Stock Analysis Report NIU TECHADR (NIU) : Free Stock Analysis Report To read this article on Zacks.com click here."}]}