{"article": [{"url": "https://finance.yahoo.com/news/digital-media-former-deadspin-employees-create-defector-media-120626628.html", "published": 1596870860.0, "headline": "The 'modest, unorthodox' newsroom? An experiment marks a new era for digital media", "body": "There are multiple devastating forces at play for the world of digital media. Prior to the pandemic, the advertising-reliant business models of upstarts-turned-legacy brands like BuzzFeed and Vice have raised red flags. Those concerns have merely been exacerbated by slashed budgets and uncertain outlooks.Overall, newsrooms have announced 11,027 job cuts in 2020, up 169.8% from the 4,087 cuts announced in the first half of 2019, according to new data from outplacement and executive coaching firm Challenger, Gray & Christmas. Through June, newsroom cuts are at their highest level since Challenger began tracking them in 2003.As thousands of editorial jobs are being lost, a group of journalists have come together to form their own venture. Co-founded by 18 former Deadspin employees, along with former Bain consultant Jasper Wang, Defector Media is a forthcoming sports and media blog that’s eschewing the advertising model and going straight for a paywalled approach. Rather than touting ambitious plans to upend the industry, the company is erring on the side of caution and pragmatism, attributes that haven’t been part of the vernacular of the digital media landscape.“We are going to be, by definition, by design, a modest business with relatively modest goals. The goal here is for these guys to just be able to write, do what they love best with no other interference for as long as we can,” Wang told Yahoo Finance in an interview last week. The model is similar to individual authors who launched their own Substack newsletters.Defector, which announced its launch on July 28, and has the tagline ‘all of our bullshit, none of theirs,’ saw 10,000 people sign up for a site that isn’t launching until September. A monthly subscription costs $8 per month and the pre-launch annual plan is $69. Wang himself gave a personal loan to kickstart the company, and each of the 19 employees has equal ownership in the company (about 5% each). Writers own the intellectual property for any derivative work that stems from their pieces on the website.Story continuesdefector“Employee rights actually matter more than shareholders’. So if you leave the company, you still have your equity stake, but you don't have any voting rights anymore. Your equity doesn’t come with profit distribution. The economic interest is if the company ever gets sold. The operating agreement is extensive, it is unorthodox. Thankfully, our lawyers found it to be an interesting intellectual exercise to work us through,” said Wang.‘Freeing mind shift’In addition to each of the founding employees being equal shareholders of the company, critical decisions like hiring and firing will be made democratically, a strategy that could potentially nip systemic issues from the get-go. Wang, as the business leader, or Tom Ley, as the editor-in-chief, can be fired by a two-thirds majority staff vote.This as the publishing world faces a reckoning, with continued revelations that employees of color are sorely overworked and underpaid. This week, three Black, Indigenous and People of Color (BIPOC) video editors left Bon Appétit, two months after Adam Rapoport resigned as editor-in-chief after a photo of him in brownface recirculated online, spurring conversations about the systemic racism at the magazine.Since the pandemic began, digital outlets have been forced to cut positions and slash pay as advertising revenue has dried up. G/O Media, the owner of The Onion and Deadspin, laid off 15 video staffers on Friday. BuzzFeed had to lay off or furlough dozens of employees and canceled its AM to DM morning news show. Quartz let 80 staffers go, Vice laid off 55 U.S. employees and 100 internationally and The Skimm laid off 20% of its staff. The Athletic laid off 8% of its staff and Vox Media laid off 72 employees after initially furloughing 100. And those who are left in the newsroom — or rather, their work from home setups — have had to take pay cuts across the board. Meanwhile, niche culture publication The Outline is essentially shutting down after laying off its entire staff.Publications like The New York Times (NYT) capture the bifurcated business model — advertising was hit hard for both print and digital in the second quarter, but the newspaper had the best quarter of subscription growth ever, adding 668,000 net new digital subscribers.For Wang and his team at Defector, they’d much rather go deep with a small group of readers than cast a wide net, which is antithetical to the scalable questions venture capitalists often ask.“[Our staff are] no longer worried about ‘How do we get a million people to read this?’ It’s ‘How do I get 500 people to read this and love it so much that they’ll pull out their credit card and just give us the money for that?’ And I think it’s a really freeing mind shift for everybody,” he said.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Amazon CEO Jeff Bezos will 'try to win over hearts and minds’: What to expect at the antitrust tech hearingWNBA Commissioner: 'There is nothing political about Black Lives Matter'The US saw the highest rate of new women CEOs so far this yearDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperity"}]}