{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-whats-in-senate-republicans-pareddown-relief-bill-211317844.html", "published": 1599582080.0, "headline": "Coronavirus stimulus: What’s in Senate Republicans’ pared-down relief bill", "body": "Senate Republicans unveiled a pared-down coronavirus relief on Tuesday, as they returned to Washington after the August recess. Negotiations over the next round of aid have been stalled for weeks on Capitol Hill and there is still little evidence of bipartisan progress.On the Senate floor Tuesday, Senate Majority Leader Mitch McConnell said the Senate would consider the bill this week.Republicans aim to put pressure on Democrats with their so-called “skinny” relief bill, but the bill is not expected to advance through the Senate. It’s not clear if McConnell has 51 votes for the latest bill, let alone the 60 needed to overcome a filibuster. Republicans hold 53 seats in the Senate.The legislation is expected to cost roughly $500 billion, around half of what the GOP proposed in the HEALS Act earlier this summer. McConnell has struggled to unite his party and many of his own members rejected the first Republican proposal.In an attempt to keep costs down and satisfy Republicans who don’t want to spend additional money, the slimmed-down bill would repurpose hundreds of billions of dollars in unspent CARES Act funding.Senate Majority Leader Mitch McConnell of Ky., center, walks to his office from the Senate floor, Tuesday, Sept. 8, 2020, on Capitol Hill in Washington. (AP Photo/Jacquelyn Martin)“We want to agree where bipartisan agreement is possible, get more help out the door, and then keep arguing over the rest later,” said McConnell on the Senate floor. “That’s how you legislate. That’s how you make law. You find agreement where agreement is possible and keep arguing over the rest later.”In a joint statement, House Speaker Nancy Pelosi (D-CA) and Senate Minority Leader trashed the bill, saying it is “laden with poison pills Republicans know Democrats would never support” and “headed nowhere.”Small business aidThe legislation would extend the Paycheck Protection Program to allow certain small businesses to receive a second, forgivable loan. About $130 billion remains in the program, but the administration stopped accepting applications when Congress let the program expire on Aug. 8.To qualify for a second loan, businesses must have fewer than 300 employees and would have to show a 35% revenue loss in a 2020 quarter compared to the same quarter in 2019. There is bipartisan support for additional small business aid, but without a broader stimulus package, small business relief remains caught in the gridlock.Story continuesEnhanced unemployment insuranceRepublicans are proposing $300 per week in enhanced unemployment benefits, half of the weekly boost included in the CARES Act. The boosted benefits would continue through Dec. 27.After Congress failed to act when the $600 weekly benefit expired at the end of July, President Trump took executive action to create a $300 weekly boost — but that funding is expected to run out and critics say some unemployed workers could be falling through the cracks.A barber shop remains closed because of the coronavirus outbreak Tuesday, May 19, 2020, in Seattle. Washington state Gov. Jay Inslee on Tuesday announced $10 million in grants to small businesses in industries particularly hard-hit by the COVID-19 outbreak. They include restaurants, hair salons, fitness studios and theaters. (AP Photo/Elaine Thompson)Money for schools, childcare, testing & vaccinesThe new Republican bill includes $105 billion for schools, an additional $16 billion for coronavirus testing and contact tracing and $31 billion for vaccine development and distribution. It provides an additional $20 billion for farmers, $10 billion to forgive a United States Postal Service loan and $10 billion toward child care.Republicans have also included some liability protections from coronavirus lawsuits in the bill, an issue Republicans have made a top priority throughout the stimulus talks.“It does not contain every idea our party likes. I am confident Democrats will feel the same. Yet Republicans believe the many serious differences between our two parties should not stand in the way of agreeing where we can agree and making law that helps our nation,” said McConnell in a statement.No stimulus checks, state & local aidMissing from the latest bill is another round of direct payments to Americans — something the White House and Democrats have said they support. The relief package does not include funding for state and local governments either, which has long been a sticking point throughout the stimulus negotiations.With the election exactly eight weeks away, lawmakers are running out of time before they’re set to leave Washington to campaign in their home districts and states. Both sides are accusing each other of playing politics with COVID-19 relief, before voters head to the polls.U.S. Speaker of the House Rep. Nancy Pelosi (D-CA) and Senate Minority Leader Sen. Chuck Schumer (D-NY) come out to speak to members of the press after a meeting with Treasury Secretary Steven Mnuchin and White House Chief of Staff Mark Meadows at the U.S. Capitol August 7, 2020. (Photo by Alex Wong/Getty Images)Pelosi and Schumer said the Republican bill is “intended to help vulnerable Republican Senators by giving them a ‘check the box’ vote to maintain the appearance that they’re not held hostage by their extreme right-wing that doesn’t want to spend a nickel to help people.”McConnell slammed Pelosi for rejecting a piece-by-piece approach to stimulus, while taking up a bill solely focused on the U.S. Postal Service last month. He accused Democrats of holding up another round of relief in an effort to hurt President Trump ahead of the November election.“They do not want American families to see any more bipartisan aid before the polls close on President Trump’s re-election. They have taken Americans’ health, jobs, and schools hostage for perceived partisan gain,” said McConnell.It’s not clear when the two sides may restart bipartisan negotiations.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:House report finds billions of dollars in questionable PPP loansCoronavirus stimulus: Here’s how Americans are using their checksRepublican National Convention: Trump fights for re-election amid coronavirus, economic crises'He will cheat': DNC organizes to combat Trump's 'suppression efforts'Trump is trying to 'undermine confidence' in democracy: Democratic rep.What to expect from the 2020 conventions: 'As good a TV show as they can have'"}]}