{"article": [{"url": "https://finance.yahoo.com/news/apple-watch-sleep-tracking-181657797.html", "published": 1592832260.0, "headline": "Apple Watch finally gets sleep tracking, plus hand-washing feature", "body": "Apple is bringing one of the most asked for features to the Apple Watch: Sleep tracking.Yes, after years of fans begging for the ability to track their sleep using the company’s smart watch, Apple (APPL) has finally caved. The feature will be able to tell you how long you’ve slept each night, and how restful your sleep was.When tracking your sleep, your watches display will turn off, and if you want to check it, it will only provide you with the time. This is likely meant to save battery life throughout the night.Apple says the Apple Watch will be able to follow your sleep using its accelerometer to keep track of your movement throughout the night. When you wake up, Apple says watchOS 7 will display important information from your sleep, as well as how much battery your watch has left.Apple says it will also add a Wind Down notification to your iPhone’s home screen. The idea is to let you know when you should start getting ready for bed, and provide users with apps they want use before hitting the sack. So if you use a meditation app before going to sleep, Wind Down will provide you with quick access to your app. You’ll also be able to access specific scenes in the Home app, so you can dim the lights, lock the doors, and more via your phone, so you can get to bed without having to walk around your house first.Importantly, this is all meant to work on current models of the Apple Watch, so how much this will impact the watch’s battery could make or break the feature for many users. I, like most people, charge my watch at night. If I continue wearing it during the night, though, I’ll need to find some other time to charge up my watch before running out the door in the morning. How much that matters to you could be the difference between using sleep tracking and not.Apple Watch sleep featureNew faces, workouts, and washing upApple’s watchOS 7 is also finally giving users the ability to fully customize their watch faces and even snag them from third-party websites for share them with friends. If you see a watch face that you like on a website, for instance, you’ll be able to press the “Add Apple Watch Face” button.Story continuesThe face will then appear in your Watch app and then on your Watch. Developers can offer preconfigured watch faces, and users will be able to share watch faces across social media platforms.Apple is also updating the Workout app in watchOS 7 by adding a Dance setting , so you can track dance workouts. The app will be able to determine if you’re dancing with just your arms, your legs, or both at the same time. Other new workouts include Functional Strength Training and Cool Downs.Additionally, Apple is renaming the Activity app in watchOS 7 and iOS to Fitness, since Apple says the app is adding a lot more to track your workouts.Finally, the Apple Watch will be able to detect when you’re washing your hands, and let you know if you’ve done so long enough. The watch will detect when you start washing using its built-in accelerometer and listening for the sound of running water and splashing.The watch will tell you how long you’ve washed your hands, and when you finish, after 20 seconds, you’ll get a quick notification telling you you’re all set.WatchOS 7 will be available later this year.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple to close retail stores in 4 states amid coronavirus outbreaksWhy Microsoft and Amazon are calling on Congress to regulate facial recognition technologyThe PlayStation 5’s most important feature will be its price5 Father’s Day tech gifts: Tech SupportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}