{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-31-2020-221601060.html", "published": 1596208220.0, "headline": "Stock market news live updates: Stocks post fourth straight monthly gain as tech shares surge", "body": "Stocks closed out Friday’s trading session and July on a high note, with the Nasdaq outperforming after a slew of better than expected corporate earnings results from major tech firms like Facebook and Apple, which both posted record closing highs.Friday’s session marked the last of July, with each of the three major indices closing out a fourth straight month of gains. The S&P 500 rose about 5%, the Dow increased 2% and the Nasdaq outperformed, rising more than 6.5% on the month.Tech titans Facebook (FB), Amazon (AMZN), Apple (AAPL), and Alphabet (GOOG, GOOGL), each reported quarterly results that blew past estimates Thursday evening, affirming their pandemic-era dominance that’s helped feed a steep run-up in tech stocks over the past couple months.Facebook grew its revenue 11% over last year as its advertising business remained resilient despite the pandemic-related slowdown across the broader ad industry. The platform’s daily active users jumped 13% to 1.79 billion and monthly active users rose 12% to 2.7% billion as the pandemic drove online engagement. Yet the company warned that these metrics would likely be flat to down slightly in most regions during the current quarter as trends moderate.Separately, Alphabet’s ad business was hit more prominently by the drop-off in ad spending, with Google ad revenue falling 8% over last year —though Alphabet’s overall top- and bottom-line results still topped estimates.Amazon stood in a league of its own, reporting net income that doubled over last year to $5.2 billion, and net sales that grew 40% during the quarter, with pandemic-related spending on e-commerce platforms strongly benefiting Seattle-based company.Apple, meanwhile, brought in revenue of $59.7 billion in the second quarter to top estimates by $7 billion, as both hardware product and services revenue surged over last year. CFO Luca Maestri said the roll-out of its next iPhone model may be “a few weeks later” than usual, as had been speculated due to pandemic-related supply chain disruptions. Apple also announced a four-for-one stock split of its stock, in a move that would make shares more accessible to retail investors.Story continuesThe flood of estimates-topping results from Big Tech companies stood in stark contrast to US economic data earlier Thursday, which affirmed the worst quarterly drop in US economic activity on record during the second quarter and showed a second straight increase in weekly unemployment insurance claims. The reports suggest that the recovery from the coronavirus pandemic will likely be drawn out and choppy, according to many economists.“The 32.9% annualized decline in GDP in the second quarter, more than three times larger than the previous record quarterly contraction, underscores the unprecedented hit to the economy from the pandemic,” Andrew Hunter, senior US economist for Capital Economics, wrote in a note. “We expect it will take years for that damage to be fully reversed.”—4:03 p.m. ET: Stocks end the session and month higherHere’s where the three major indices settled at the end of trading Friday:S&P 500 (^GSPC): +24.92 points (+0.77%) to 3,271.14Dow (^DJI): +114.67 points (+0.44%) to 26,428.32Nasdaq (^IXIC): +157.46 points (+1.49%) to 10,745.27—12:08 p.m. ET: S&P 500, Dow sink as oil majors decline; Nasdaq holds higherThe S&P 500 and Dow were lower in intraday trading Friday afternoon, as shares of major energy companies sold off following weak quarterly results from oil majors Exxon Mobil (XOM) and Chevron (CVX). Exxon Mobil posted a second-quarter loss of $1.1 billion second-quarter, its worst on record. Chevron’s quarterly adjusted loss was $3 billion, even excluding impairment charges, and was twice as wide as expected, based on Bloomberg-compiled estimates.—10:00 a.m. ET: Consumer sentiment sank further in July as coronavirus resurgence drives worriesThe University of Michigan’s closely watched consumer sentiment index dropped further at the end of July, “due to the continued resurgence of the coronavirus,” according to a statement.The index of consumer sentiment ticked down to 72.5 in the final July print, down from the 72.9 reported earlier this month. The index had clocked in at 78.1 in June, and is down significantly from the level of more than 130 recorded prior to the pandemic.Indices tracking consumers’ assessment of current conditions sank to 82.8, down from the 84.2 previously reported. A subindex looking at consumers’ assessment of future expectations fell to 65.9 from 66.2, tying with the six-year low from May.“While the 3rd quarter GDP is likely to improve over the record setting 2nd quarter plunge, it is unlikely that consumers will conclude that the recession is anywhere near over,” Richard Curtin, Surveys of Consumers chief economist, said in a statement. “The federal relief programs have prevented more substantial declines in consumer finances, partially shielding consumers from the unprecedented surge in job losses, reduced work hours, and salary cuts.”“The lapse of the special jobless benefits will directly hurt the most vulnerable and spread even further by missed rent, mortgage, and other debt payments,” he added. “Easing off the added jobless benefit will naturally result with job growth as well as provide for a delayed and gradual reduction in added benefits so that its eventual absence is much less disruptive.”—9:49 a.m. ET: Under Armour, Caterpillar, Colgate-Palmolive report better than expected quarterly resultsEarnings season continued Friday morning with a host of companies across industries reporting results, many of which came in better than expected.Under Amour (UAA) reported an adjusted loss of 31 cents per share on net revenue of $708 million, with both metrics better than the 42 cents loss per share on revenue of $539 million expected. The company said it experienced “significant e-commerce growth” globally during the quarter, helping stem declines in its direct to consumer segment. As of today, most of Under Armour’s doors have reopened, though traffic trends continue to be “considerably lower than the prior year period, however, the overall rate of conversion is higher. The company expects traffic trends to remain lower for the remainder of 2020,” the company said.Caterpillar (CAT) posted adjusted earnings of $1.03 on revenue of $10 billion, topping estimates for 65 cents a share on revenue of $8.6 billion. The company noted, however, that in the first half of this year, dealers reduced inventories by about $1.2 billion, cutting into sales volume for Caterpillar and leading to its 31% drop in sales over last year. The company sees dealers cutting inventory levels yet again in the third quarter, and expects a full-year reduction of $2 billion in dealer inventories.Colgate Palmolive (CL), in keeping with the strong trend of consumer staples companies, reported estimates-topping net sales and profit, and global unit volume growth of 3.5% was better than the 1.9% increase expected. CEO Noel Wallace said in a statement, “We continue to see elevated demand across our geographies in certain categories such as liquid hand soap, dish liquid, bar soap and cleaners. In other categories, we are starting to see the impact of consumers working down their pantry inventories, particularly in Europe.”—9:36 a.m. ET: Stocks open higher as strong earnings buoy indicesHere were the main moves in markets, as of 9:36 a.m. ET:S&P 500 (^GSPC): +9.15 points (+0.28%) to 3,255.37Dow (^DJI): +27.88 points (+0.11%) to 26,341.53Nasdaq (^IXIC): +89.05 points (+0.85%) to 10,678.15Crude (CL=F): +$0.48 (+1.2%) to $40.40 a barrelGold (GC=F): +$17.30 (+0.89%) to $1,959.60 per ounce10-year Treasury (^TNX): +2.2 bps to yield 0.563%—8:30 a.m. ET: US personal income drops more than expected in June, while spending reboundsUS personal income and spending seesawed again in June, with income falling more than expected and spending rising by a greater than expected margin, as impacts from the coronavirus pandemic and stimulus packages lingered.Personal income fell 1.1% in June after a 4.4% drop in May, the Bureau of Economic Analysis said Friday. This was greater than the 0.6% drop expected, according to Bloomberg data.Personal spending, on the other hand, increased 5.6% after a record 8.5% jump in May. Consensus economists were looking for a 5.2% rise.“The decrease in personal income in June was more than accounted for by a decrease in government social benefits to persons as payments made to individuals from federal economic recovery programs in response to the COVID-19 pandemic continued, but at a lower level than in May,” the BEA said in a statement.“Partially offsetting the decrease in other government social benefits were increases in compensation of employees and proprietors’ income as portions of the economy continued to reopen in June,” it added. “Unemployment insurance benefits, based primarily on unemployment claims data from the Department of Labor’s Employment and Training Administration, also increased in June.”—7:21 a.m. ET: Sanofi, GlaxoSmithKline receive pledge for funding of up to $2.1 billion from US government for Covid-19 vaccineEuropean vaccine partners Sanofi and GlaxoSmithKline said in a statement Friday that the US government is set to provide the companies as much as $2.1 billion to fast-track the development of their Covid-19 vaccine candidate.The funds were part of the US Operation Warp Speed, which has backed a number of drugmakers to try and speedily create an inoculation against the coronavirus.“The U.S. government will provide up to $2.1 billion, more than half of which is to support further development of the vaccine, including clinical trials, with the remainder used for manufacturing scale-up and delivery of an initial 100 million doses of the vaccine,” according to the statement. “Sanofi will receive the majority of the U.S. government funding. The U.S. government has a further option for the supply of an additional 500 million doses longer term.”—7:17 a.m. ET Friday: Stock futures point higher, Nasdaq futures advance 1%Here were the main moves in markets, as of 7:17 a.m. ET:S&P 500 futures (ES=F): 3,254.75, up 6 points or 0.18%Dow futures (YM=F): 26,268.00, up 50 points, or 0.19%Nasdaq futures (NQ=F): 10,902.5, up 108.5 points, or 1.01%Crude (CL=F): +$0.22 (+0.55%) to $40.14 a barrelGold (GC=F): +$26.40 (+1.34%) to $1,993.20 per ounce10-year Treasury (^TNX): -0.4 bps to yield 0.538%—6:03 p.m. ET Thursday: Stock futures rise after Big Tech blows past expectationsHere were the main moves in equity markets, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,270.5, up 21.75 points or 0.67%Dow futures (YM=F): 26,426.00, up 208 points, or 0.79%Nasdaq futures (NQ=F): 10,919.25, up 125.25 points, or 1.16%NEW YORK, NY - JULY 30: People walk by the Nasdaq MarketSite in Times Square on July 30, 2018 in New York City. As technology stocks continued their slide on Monday, the Nasdaq Composite dropped 1.1 percent in afternoon trading with shares of Facebook, Netflix, Amazon and Google-parent Alphabet all declining. (Photo by Spencer Platt/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}