{"article": [{"url": "https://finance.yahoo.com/news/a-record-number-of-hotels-are-defaulting-on-their-loans-report-162800156.html", "published": 1598355380.0, "headline": "Coronavirus causes a record number of hotels to default on their loans: report", "body": "Almost a quarter of hotels were delinquent on their mortgage payments in July, the highest rate on record, according to a new report.Some 23.4% of commercial mortgage-backed security (CMBS) loans, which finance many hotels, were more than 30 days late in July, totaling $20.6 billion. Only 1.34% of hotel CMBS loans were in default in July 2019, according to Trepp, a New York City-based data, analytics and technology company.“If hotels don't get more help, we will start to see a lot more defaults,” said Brian Mahany, a Texas-based attorney specializing in CMBS loans. “Hospitality won’t get back to where it was for a couple of years, so unless there is some relief, a lot will go under.”The hotel industry has been hard-hit during the coronavirus pandemic, losing over $46 billion in revenue per room since mid-February. The industry has been hit harder than the retail industry, where only 16.1% of CMBS loans were more than 30 days late in July. Hilton’s (HLT) revenue per room dropped 81% in the second quarter, Marriott’s (MAR) dropped 84% and Hyatt (H) dropped 89%.Previously, hotels’ highest delinquency rate was during the Great Recession at about half the rate seen this year, with only $13.5 billion in delinquent loans, according to Trepp.“If hotels don't get more help, we will start to see a lot more defaults,” said Brian Mahany.“The industry is in a lot of trouble. When you look at the delinquency numbers, it’s the highest to date in history, outpacing 2008,” said Michael Buono, principal and CEO of New York Renaissance Group and Mulberry Development, which develops well known hotels in New York City such as the NoMad Hotel. “And it’s just the beginning. We’ll see things fully start to manifest” — meaning that hotels will go under or pull through — by the first and second quarter of 2021,” he said.The largest chunk of delinquencies come from the New York City metro area, with a 38.72% delinquency rate for a total of $1.475 billion in late loans. The Chicago metro area was the next hardest hit, with 53.84% delinquency and a balance of $976.3 million. Houston and Los Angeles also each owed more than $500 million in delinquent loans, according to Trepp.Story continuesNew York is “a city dependent on a huge influx of travel, which you don’t see now,” said Buono. Plus, “it’s incredibly expensive to own in New York. So we come up with all these creative ways to make these deals work through long-term land leases and buying air rights. Now, hotels are suddenly not allowed to have people in this incredibly valuable space.”These CMBS loans are particularly tricky when they go into default because most are packaged with hundreds of other loans and underwritten into a trust, said Mahany.“If you’re in default on a CMBS loan, hotel owners are starting to realize, there is no one you can deal with. There is no office, no employees — the business exists on paper only,” said Mahany. “The decision maker is a special servicer who has an incentive to keep you under water for the longest possible” because they only get paid for their administrative, decision-making services when a loan is in default, he said.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:The best cities in the US to buy a vacation home you plan to rent: studyThere’s a record number of vacant rental apartments in ManhattanNetflix’s ‘Million Dollar Beach House’ star: Hamptons one of the only markets that’s ‘really robust’"}]}