{"article": [{"url": "https://finance.yahoo.com/news/the-days-of-100-oil-are-over-bubba-trading-founder-194136204.html", "published": 1593528560.0, "headline": "'The days of $100 oil are over': Bubba Trading founder", "body": "“The days of $100 oil are over,” says Bubba Trading founder and CEO Todd Horwitz.“There's going to be a lot less usage and a lot less demand because we can’t get the economy open in full. So how are we going to start to continue to use oil?,” Horwitz told Yahoo Finance’s On The Move.Partially-open state economies along with a spike in coronavirus cases in some areas has put a dent on oil demand.On Tuesday, Royal Dutch Shell (RDS-A) announced it would write down between $15 billion and $22 billion in assets in the second quarter.“Companies like to make the biggest write-downs, when there is already so much bad news that it doesn’t matter,” said Horwitz.“I think these companies have been beaten up so much anyways, why not just write everything off now,” he added.Shell predicts Brent crude (BZ=F) will average about $35/barrel in 2020, $40 in 2021, and $50 in 2022.[Read More:] Stock market news live updates: Stocks steady in final session of June]Horwitz highlights that other energy alternatives have been making headway, gaining both support and attention.“We've now started to see some other developments that may eventually help us replace oil,” he added.Earlier this month electric vehicle maker Tesla (TSLA) told employees, “It’s time to go all out and bring the Tesla Semi to volume production.” His email came after a spike in shares Nikola Motors (NKLA), the electric and fuel cell truck startup which debuted publicly on June 4th.Horwitz says the transition to other energy alternatives will take time as big oil companies, which donate to lawmakers, position themselves appropriately in a greener economy.“Until they get their footing — very much like big tobacco years ago because they’re such big contributors, they're going to let them get themselves set up and get involved in this other stuff before they really started cutting the up, turning the pumps off,” said Horwitz.In its note on Tuesday, Shell made note of the company’s “strategy to reshape and focus its refining portfolio to support the decarbonization of its energy product mix.”Story continuesJust this week BP (BP) announced it was selling its petrochemicals business to INEOS for $5 billion, meeting its $15 billion target for agreed divestments a full year ahead of schedule. Earlier this year, BP said its goal is to be net carbon neutral by 2050.Oil slid on Tuesday as some states reported an increase of COVID-19 cases and reports that Libya may resume production. West Texas Intermediate for August delivery contracts (CL=F) closed down more than 1% to settle at $39.27 per barrel. The September contract for Brent slipped 0.3% to settle at $41.70/barrel.Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreCrude supply 'dwarfed' by cuts in demand: oil watcherThere's a risk of a lost decade here:' former IMF adviserDon't expect shale to rise like a 'phoenix from the ashes': Oil expertThree reasons why things are looking up for homebuilder LennarFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}