{"article": [{"url": "https://finance.yahoo.com/news/tesla-raised-close-to-20-billion-nikola-will-have-to-raise-money-but-not-as-much-founder-162344226.html", "published": 1597059080.0, "headline": "Tesla has raised close to $20 billion, Nikola founder says it won't have to raise as much money", "body": "Nikola (NKLA) founder Trevor Milton pulls no punches on an eventual capital raise to help finance the company’s zero emission truck plans.“So right now, we have about over $900 million of cash in our account today. So we’re very solid financially. I know a billion dollars doesn’t sound like a lot of money in today’s world, but it’s a lot of money. It’s a billion dollars in our account. We will eventually go out to the market for more capital. It will require one or two more [rounds],” Milton told Yahoo Finance’s The First Trade.As they say in the world of venture capitalism, Nikola is “pre-revenue.” What that essentially means is the company is taking orders today for its products in anticipation of future revenue and profits. In its first earnings release as a public company on August 4, Nikola revealed it had incurred a $119 million net loss through the first six months of 2020 — in large part because it has no revenues yet. The company obviously has never been profitable.But a cash raise sometime within the next 24 months appears likely given Nikola’s incoming order flow and need to quickly satisfy those orders.NikolaOn Monday, Nikola announced a deal with waste management giant Republic Services for 2,500 electric, zero emission garbage trucks. A dollar amount for the contract wasn’t disclosed. The deal is expandable up to 5,000 trucks. Full production deliveries are expected to begin in 2023 — road testing is set to commence in late 2021 and early 2022.Nikola shares rose 12% Monday morning on the news.Model ‘based on profitability, not necessarily on speculation’Meanwhile, Milton has told Yahoo Finance orders for its semi truck far exceeds 14,000 units valued at $10 billion in potential revenue. These trucks are slated to begin production sometime in 2021. The company has also taken an undisclosed number of deposits for its Badger electric pickup truck. Milton says Nikola is nearing the announcement of a production partner for the truck.Story continuesMilton says more capital raises shouldn’t come as a surprise. After all, Tesla has raised billions of dollars in capital through debt raises and common stock offerings.“Tesla I think they raised between $10 billion and $20 billion to get where they are at. It’s understandable that we are going out [to raise capital]. But we also have a better business model. The model is based on profitability, not necessarily on speculation,” Milton added. “I don’t think we need to raise the amount of money they had to raise because our actual business model is very, very profitable. We make almost a quarter of a million dollars on every truck we sell. That’s a huge amount of money. So we are just a totally different company than Tesla.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}