{"article": [{"url": "https://finance.yahoo.com/news/stocks-are-not-the-economy-retail-sectors-chart-morning-brief-095448875.html", "published": 1597899740.0, "headline": "Sometimes, the stock market makes a lot of sense: Morning Brief", "body": "Thursday, August 20, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeCompanies doing well are seeing their stocks outperformWith the stock market setting new record highs for the first time since before the pandemic, it’s easy to get caught up in exaggerated statements about how prices are totally disconnected from reality especially with many economic metrics stalling at dismal levels.But that would be a mistake. Investors making decisions based on company fundamentals and prospects are being rewarded in an arguably rational way.\"‘The stock market is not the economy.’ I've seen some version of this argument in the 15 years I have been doing this,” Renaissance Macro’s Neil Dutta said in an email. “We've seen a lot of this lately since the economy remains depressed in a pandemic. But, the market isn't exactly whistling by the graveyard.”To illustrate how stocks do indeed have a direct relationship with the economy, Dutta shared this timely chart. It plots the five-month sales performance against the five-month stock price performance of various retail subsectors.“The sectors doing well in the equity market are doing well in the economic data too and vice versa,” Dutta observed.(Renaissance Macro)As you can see non-store retailers are doing great in sales and stock prices. And it’s not just Amazon (AMZN). This week we learned Walmart (WMT) and Target (TGT) smashed Q2 expectations as online sales at the retailers surged 97% and 195%, respectively. Both stocks surged after their results were released.Home improvement is another notable sector that appears in the upper right quadrant of Dutta’s chart. This comes as Home Depot (HD) and Lowe’s (LOW) see sales go gangbusters as people focus on renovating their homes, which is where people are spending a lot more time amid the COVID-19 pandemic.“[Consumers] are spending less on travel and entertainment and restaurants and are spending more on where they’re spending most of their time — which is the home,” Home Depot CFO Richard McPhail said.Story continuesTo be clear, investing is riddled with risks. And more often than not, it could take years for a good investment thesis to pan out as no stock is impervious to short-term bouts of volatility.That said, sometimes investing in stocks can be pretty straightforward. Earnings are the most important drivers of stock prices and so when earnings go up, so do stocks. And the companies with the better earnings growth prospects will often see their stock prices outperform.By Sam Ro, managing editor. Follow him at @SamRoWhat to watch todayEconomy8:30 a.m. ET: Philadelphia Fed Business Outlook index, August (20.5 expected, 24.1 in July)8:30 a.m. ET: Initial jobless claims, week ended Aug. 15 (920,000 expected, 963,000 prior week)8:30 a.m. ET: Continuing jobless claims, week ended Aug. 8 (15 million expected, 15.486 million prior week)10:00 a.m. ET: Leading Index, July (1.0% expected, 2.0% in June)EarningsPre-market6:45 a.m. ET: BJs Wholesale Club Holdings (BJ) is expected to report adjusted earnings of 59 cents per share on revenue of $3.74 billion6:45 a.m. ET: Estée Lauder (EL) is expected to report an adjusted loss of 20 cents per share on revenue of $2.44 billion7:10 a.m. ET: Alibaba (BABA) is expected to report adjusted earnings of 13.79 yuan per share on revenue of 148.06 billion yuanPost-market4:00 p.m. ET: Ross Stores (ROST) is expected to report an adjusted loss of 26 cents per share on revenue of $2.44 billionTop NewsAirbnb confidentially files for U.S. IPO [Reuters]Fed will not cap U.S. Treasury yields for the time being [Yahoo Finance]Nvidia beats estimates but data center performance leaves shares flat [Reuters]Online thrift shop ThredUp plans IPO early next year [Bloomberg]YAHOO FINANCE HIGHLIGHTSTrump ‘is flailing away and attacking Americans’ by boycotting Goodyear: former U.S. ambassadorYoung investors have a huge stomach for risk right now, data suggestsWhy Krispy Kreme is opening a colossal doughnut-making store in nearly empty Times Square—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}