{"article": [{"url": "https://finance.yahoo.com/news/chinese-firms-not-meet-u-230103585.html", "published": 1597082960.0, "headline": "Chinese firms that fail U.S. accounting standards to be delisted as of 2022: Mnuchin", "body": "WASHINGTON (Reuters) - U.S. Treasury Secretary Steven Mnuchin on Monday said companies from China and other countries that do not comply with accounting standards will be delisted from U.S. stock exchanges as of the end of 2021.Mnuchin and other officials recommended the move to the U.S. Securities and Exchange Commission last week to ensure that Chinese firms are held to the same standards as U.S. companies, prompting China to call for frank dialogue.Mnuchin told a White House briefing the SEC was expected to adopt the recommendations. \"As of the end of next year ... they all have to comply with the same exact accounting, or they will be delisted on the exchanges,\" he said.The recommendation is part of a push by the Trump administration to correct what it calls major imbalances in ties between the world's two largest economies. Tensions between the two countries have flared in past months over China's handling of the coronavirus outbreak, Hong Kong and human rights.U.S. President Donald Trump said China was also failing to meet its commitments to buy more U.S. goods under a Phase 1 trade deal signed in January, although he said purchases should increase next year.\"We did a Phase 1 deal and it was a wonderful deal, and all of a sudden it means very little in the overall import of things,\" Trump told reporters.He said increased purchases of U.S. goods required under the trade deal would \"never pay for the loss of life in our country and all over the world.\"Trump also repeated his calls for the World Trade Organization to stop treating China as a developing country, arguing that doing so gave Beijing unfair advantages over the United States and other countries.China argues the classification is justified since many of its regions are still developing.(Reporting by Jeff Mason, Andrea Shalal and Alexandra Alper; Editing by Chris Reese and Sam Holmes)"}]}