{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-birx-in-trumps-crosshairs-for-new-phase-as-who-warns-on-vaccine-hopes-200120083.html", "published": 1596467360.0, "headline": "Coronavirus update: Birx in Trump's crosshairs for 'new phase' as WHO warns on vaccine hopes", "body": "Dr. Deborah Birx’s bleak assessment of the coronavirus outbreak entering “a new phase” in the U.S. put her in President Donald Trump’s crosshairs on Monday, exposing new divisions among top officials as the disease continues to spread unchecked.Over the weekend, Birx re-emerged after an extended hiatus from the public, telling CNN in an interview that COVID-19 is now “extraordinarily widespread” in both rural and urban areas, which is different from March and April when it was concentrated in the Northeast. She added that the disease was entering a “new phase,” which echoed remarks made last week by Dr. Anthony Fauci.Even as reports emerged that House Speaker Nancy Pelosi had blasted Birx for “enabling” some of the president’s remarks about the virus — and Birx taking fire for her staunch defense of the president — Trump hit out at the White House coronavirus task force coordinator for a “pathetic” response.So Crazy Nancy Pelosi said horrible things about Dr. Deborah Birx, going after her because she was too positive on the very good job we are doing on combatting the China Virus, including Vaccines & Therapeutics. In order to counter Nancy, Deborah took the bait & hit us. Pathetic!— Donald J. Trump (@realDonaldTrump) August 3, 2020The spat comes as COVID-19 diagnoses continue to rise, with California leading the Sun Belt surge over the weekend with 500,000 confirmed cases. However, on Monday the Golden State’s seven-day average of new cases tumbled 21% from last week, prompting Gov. Gavin Newsom to suggest the decline was encouraging.Still, New Jersey — a former epicenter — announced plans to restrict indoor crowds, and plans to have students wear masks when school eventually returns. Meanwhile, the debate over back-to-school raged on, with little resolution about whether schools will be able to reopen to students in the fall.Story continuesDr. Dara Kass, Yahoo Finance Medical contributor, told Yahoo Finance on Monday that “unfortunately, it’s not a new phase of disease. We’ve never seen the decrease in number of cases to truly think that we have taken care of this virus.”The state of play put new pressure on Trump who continues to face criticism from health experts over an inconsistent national strategy, and for politicizing mask-wearing.In an interview with Yahoo Finance on Monday, Dr. James Hildreth, Meharry Medical College CEO & President, said he was “deeply concerned how deeply political some aspects of the fight against the virus have become. Politics got in the way of a comprehensive federal response, he added.Meanwhile, the World Health Organization announced it was starting an investigation in China into the origins of the virus, which was previously credited to a wet market in Wuhan, in Hubei Province.Amid growing hopes for a successful vaccine, WHO director general Tedros Adhanom Ghebreyesus said that despite hundreds of candidates currently being researched and tested, “there is no silver bullet at the moment, and there might never be.”New Jersey, Connecticut, Rhode Island, West Virginia, and Oklahoma are seeing a surge in cases. (Graphic: David Foster/Yahoo Finance)Fauci sees promise in antibodiesAs the vaccine race continues on, with Russia announcing it will have a vaccine ready for its population by October, a parallel focus on monoclonal antibodies is taking shape.Experts see this type of treatment as a potential holdover until a vaccine is available, because it can be used both as a defensive and offensive treatment.Dr. Anthony Fauci, the nation’s top infectious disease expert, said as much in an interview Monday with the Journal of the American Medical Association (JAMA). He highlighted two trials set to begin this week to study the effects both in an inpatient as well as outpatient setting.Monoclonal antibodies can be used both as a preventive and defensive treatment, according to Fauci. “The thing that we need very much is those early interventions,” he said.Yet he also cautioned that questions about antibodies still exist— including if antibody treatments will have an effect, and how long antibodies last and what they block against.Eli Lilly (LLY) announced its Phase 3 trial of its monoclonal antibody treatment in nursing homes starting Monday.Meanwhile, some experts have also been looking at convalescent plasma — another option with many unknowns.“It’s still a little bit of an open question,” Fauci said, adding that more work is left to be done to find a truly effective treatment.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}