{"article": [{"url": "https://finance.yahoo.com/news/3-strong-buy-dividend-stocks-164943786.html", "published": 1602244640.0, "headline": "3 “Strong Buy” Dividend Stocks Yielding Over 9%", "body": "If the stock market’s ups and downs this year have taught us any enduring lesson, it’s a repeat of an old stand-by: the importance of setting up a steady income stream, to keep the portfolio profitable no matter how the individual shares move. Dividends are a key part of any investment income strategy, giving investors a reliable income when it’s needed most.All dividends are not created equal, however. Investors should seek out companies with one of two advantage – or preferably both: a commitment to maintaining the dividend, and a high yield. The second is not hard to find, considering the Federal Reserve’s policy of keeping interest rates near zero, while the first attribute may take some research.With all of that in mind, we’ve opened up the Stock Screener tool from TipRanks, a company that tracks and measures the performance of analysts, to find stocks with high dividend yields. Setting the screener filters to show stocks with \"strong buy\" consensus rating and a high dividend yields exceeding 9% gave us a manageable list of stocks. We’ve picked three to focus on.New Mountain Finance Corporation (NMFC)The first stock on the list is New Mountain Finance, in the business development niche. New Mountain invests in debt securities, including first and second lien notes and mezzanine securities. The Company's portfolio includes public and private equity and credit funds with a total worth well north of $28 billion.The company reported 30 cents per share in net investment income for the second quarter, down 4 cents sequentially. At the top line, revenues came in at $76 million, a healthy turnaround from the first quarter revenue loss of $174 million. As far as the data can show, New Mountain has turned around from the coronavirus losses incurred early in the year.New Mountain kept its dividend payment stable in the second quarter, at 30 cents per common share. At the current level, the $1.20 annualized payout gives a high yield of 11.5%.Story continuesWells Fargo analyst Finian O’Shea is comfortable with NMFC’s dividend policy, writing, “Having reduced its $0.34 dividend to $0.30 last quarter, coverage appears solid after the BDC has sustained its impact from nonaccruals, de-leveraging and LIBOR…”O’Shea believes NMFC shares have room to rise, noting: \"NMFC trades at 0.82x, about in-line with the WFBDC Index despite its history of top-quartile returns, improved leverage profile and portfolio level performance so far through today’s recessionary environment.\"To this end, O’Shea rates NMFC an Overweight (i.e. Buy), and his $11.25 price target suggests it has a nearly 14% upside potential for the coming year. (To watch O’Shea’s track record, click here)Overall, the Wall Street consensus on NMFC is a Strong Buy, based on 4 reviews including 3 Buys and 1 Hold. The shares are selling for $9.88, and the average price target of $10.92 implies a one-year upside of 11% for the stock. (See NMFC stock analysis on TipRanks)Plains GP Holdings (PAGP)Next on our list, Plains GP, is a holding company in the oil and gas midstream sector. Plains’ assets move oil and gas products from the well heads to the storage facilities, refineries, and transport hubs. The company’s operations move more than 6 million barrels of oil equivalent daily, in a network extending to the Texas oil patch and the Gulf Coast. Plains also has assets in California and the Appalachian natural gas fields.The crisis in the first half of this year put heavy pressure on Plains’ revenue and earnings. By Q2, revenue was down by two-thirds, to $3.2 billion, and EPS had fallen to just 9 cents.As part of its response, Plains slashed its dividend by half – from 36 cents per common share to 18 cents. The cut was made to keep the dividend within the distributable cash flow, affordable for the company – and kept up for shareholders. Looking at numbers, PAGP's dividend payment offers investors a yield of 11.7%, almost 6x higher than the average yield among S&P 500-listed companies.Tristan Richardson, covering the stock for Truist, sees Plains in a good spot at present. Noting the difficulties faced earlier in the year, he writes, “Despite cautious notes on recovery and general industry commentary that reflects the tepid growth environment, Plains remains among best positioned, in our view, amongst volumetrically sensitive business as a dominant Permian operator… We believe the units/shares should find some support over the near term on … the inflection to positive free cash flow and gradual de-levering.”Richardson gives this stock a Buy rating and $12 price target, indicating an impressive potential upside of 80% for the next 12 months. (To watch Richardson’s track record, click here)The Strong Buy analyst consensus rating on PAGP is unanimous, based on 5 recent reviews, all Buys. The stock has an average price target of $11, implying an upside of 65% from the current share price of $6.82. (See PAGP stock analysis on TipRanks)Sixth Street Specialty Lending (TSLX)The last company on our list recently underwent a name change; in June, it dropped its old name TPG in favor of Sixth Street. The ticker and stock history remain the same, however, so the difference for investors is in the letterhead. Sixth Street continues the core business of providing credit and capital for mid-market companies, helping to fund America’s small and medium enterprise niche.The economic difficulties of the corona crisis were easily visible in this company’s top line. Revenue was negative in Q1, due to a curtailment in loan collections and reduction in interest income, although earnings remained positive. In Q2, EPS rose to 59 cents per share, meeting the forecast, and revenues returned to positive numbers, at $103 million.Sixth Street adjusted its dividend during the crisis, but that move did not raise any eyebrows. The company has a long history of dividend payment adjustments, regularly making changes to the common stock dividend in order to keep it in line with earnings, and giving supplemental dividends when possible. The current regular payment is set at 41 cents, annualizing to $1.64, and giving a strong yield of 9.45%.JMP analyst Christopher York believes that Sixth Street has as solid position in its niche, noting, “…we think the company has historically proven, and subsequently earned investor trust and credibility to underwrite and structure complex and special situation investments to achieve attractive risk-adjusted returns.”Regarding the dividend, York is optimistic about the future, writing, “[The] supplemental dividend is likely to return following two quarters of no distributions as a result of the mechanics of the supplemental dividend framework…”In line with his positive outlook for the company, York rates the stock as Outperform (i.e. Buy), and his $20 price target indicates confidence in a 15% upside potential. (To watch York’s track record, click here)This stock has another unanimous Strong Buy consensus rating, with 5 recent Buy reviews. The stock’s current share price is $17.33 and the average price target of $19.30 suggests it has room for 11% share price growth ahead of it. (See TSLX stock analysis on TipRanks)To find good ideas for dividend stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment."}]}