{"article": [{"url": "https://finance.yahoo.com/news/hilton-vs-marriott-hotel-stock-121602850.html", "published": 1597735460.0, "headline": "Hilton vs Marriott: Which Hotel Stock Is Best Poised For Recovery?", "body": "Travel restrictions due to the COVID-19 pandemic have hit airlines, hotel and other related sectors hard. As per a report released by the US Bureau of Labor Statistics in early August, the leisure and hospitality industry has lost 4.3 million jobs since February. The industry has been pushing for more government relief to address its plight.The American Hotel & Lodging Association estimates that hotels have lost over $46 billion in room revenue since the deadly virus started escalating in mid-February in the US.Using the TipRanks’ Stock Comparison tool, we placed Hilton and Marriott alongside each other to see which stock is poised to recover better when the COVID-19 pandemic fades.Hilton Worldwide Holdings (HLT)The rapid outbreak of coronavirus caused a halt in leisure and business travel and severely impacted Hilton and peers. Hilton’s second-quarter RevPAR or revenue per available room, a key metric of the hotel industry, fell 81% Y/Y in the second quarter.Total revenue was down 77.3% to $564 million. Lack of business led to an adjusted loss per share of $0.61 in the second quarter compared to adjusted EPS of $1.06 in the second quarter of 2019. The company’s adjusted EBITDA of $51 million was still in the positive zone despite a highly challenging quarter.Looking at the brighter side, the company said that all major regions have seen a month-over-month rise in occupancy and RevPAR since April. Recoveries have been notable in the US and the Asia Pacific region. Currently, about 80% of Hilton’s hotels that were temporarily closed have reopened, including all hotels in China and the majority in the US.The system-wide occupancy rate has now improved to 45% compared to a low of about 13% in April. The occupancy in China is over 60% while demand for limited-service hotels and leisure has driven over 45% occupancy in the Americas. Meanwhile, occupancy is around 30% in Europe, Middle East and Africa.The company feels that it will take two to three years for the demand to get back to pre-COVID levels. (See HLT stock analysis on TipRanks).Story continuesOn August 14, Jefferies analyst Cassandra Lee upgraded both Hilton and Marriott to Buy from Hold and stated that “Both are anchored by proven management teams and business models which we have confidence will recover,” Lee raised the price target for Hilton stock to $101 from $72.With 4 Buys, 6 Holds and 1 Sell, Wall Street has a Moderate Buy consensus for Hilton stock. An average price target of $84.20 suggests a 0.92% downside in the stock in the coming 12-months.Marriott International (MAR)The pandemic caused a worse-than-anticipated impact on Marriott International’s second-quarter performance. The hotel giant’s RevPAR or revenue per available room plunged 84.4% worldwide, with an 83.6% decline in North America.A 72.4% drop in overall revenue to $1.46 billion pushed Marriott into an adjusted loss per share of $0.64 from an adjusted EPS of $1.56 in the prior’s second quarter.However, management’s comments about a recovering business were reassuring to some extent. CEO Arne M. Sorenson stated that the company is seeing a steady return in demand. Its worldwide occupancy rates recovered to about 34% in the week ended August 1 compared to 11% in the week ended April 11. Currently, 91% of Marriott’s hotels are open worldwide while 96% are open in North America.The CEO also highlighted the improvement in Greater China, where all the hotels opened in early May. Occupancy levels in the region touched 60% which looks impressive compared to the 70% recorded in the same time last year pre-COVID.Last year, domestic travelers accounted for 95% of the company’s North American room nights. This aspect works in favor of the company’s US business as it doesn’t rely so much on inbound travel from the rest of the world.While hopeful of some improvement, the company cautioned in its quarterly SEC filing that pre-COVID levels of business “will not return until at least after 2021.”On August 17, Barclays analyst Anthony Powell increased his price target for Marriott stock to $108 from $105 and reaffirmed his Buy rating. Powell finds the company’s update on China RevPAR growth and hotel development “encouraging”.Based on the sequential demand improvement in North America, Powell also sees the prospect of a more meaningful recovery once the current situation improves. (See MAR stock analysis on TipRanks)Not everybody on the Street shares Powell’s optimism. Marriott has a Hold consensus based on 4 Buys, 8 Holds and one Sell. An average price target of $100.45 reflects a possible upside of 4.9%.The COVID-19 pandemic has crushed hotel and travel companies and it will take a long-time for them to bounce back. There has to be a considerable improvement in the occupancy rates of hotels to meet expenses and service their debts. Hilton stock has declined 23.4% year-to-date while Marriott stock has fallen 37%.Both Hilton and Marriott have asset-light business models as they generate fees for franchising and managing properties rather than owning them. However, based on higher EBITDA margins and the Street consensus, Hilton looks more poised for a better recovery post the pandemic.To find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.Disclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investmentMore recent articles from Smarter Analyst: American Express To Acquire Online Lender Kabbage Susquehanna Lifts Nvidia’s PT To ‘Street High’ Ahead of Tomorrow's 2Q Results Home Depot Sales Exceed Estimates As Shoppers Pile On DIY Products Walmart Delivers Earnings Triumph; E-Commerce Sales Double"}]}