{"article": [{"url": "https://finance.yahoo.com/news/the-social-dilemma-screen-time-addiction-former-facebook-pinterest-exec-175002137.html", "published": 1601038700.0, "headline": "Ex-Facebook and Pinterest exec explains how tech addiction made him rethink his life's work", "body": "The public’s concerns around screen time addiction have been pushed aside amid the coronavirus pandemic, as companies like Slack (WORK), Zoom (ZM), and Peloton (PTON) have become lifelines to teachers, colleagues, friends, and fitness trainers.But one tech executive finds it even more urgent to rethink our obsession with our devices now that so many people are confined to their homes. Tim Kendall, a former executive at Facebook (FB) and then Pinterest (PINS), told Yahoo Finance in a new interview that his own tech addiction was the catalyst to get him to rethink his life’s work.“Most people think they spend two hours a day on their phone. When we look at the data...it's four and a half — it just shows there's a disconnect between reality and your awareness,” said Kendall, now the CEO of Moment, an app that tries to incentivize users to reduce their screen time.“The thing that I have found that has moved the needle the most for me and actually allowed me to [be] a much better parent and much better partner is setting some limits on when I use my phone.”‘Turn off your notifications. Turn them all off’Kendall was previously the head of monetization at pre-IPO Facebook, where he developed products to generate more revenue for the startup. After leaving Facebook in 2010, he joined Pinterest as head of product, eventually becoming president of the company, though departing to focus on building a healthcare startup in 2018.As the chief executive of Moment, Kendall works to help users focus on meaningful conversations with close friends and family. Kendall was well known for resisting screen addiction even when he was part of the big tech ecosystem, maintaining a “no phones” policy during meetings. In essence, Moment’s whole purpose is to unravel the work he did at Pinterest and Facebook for a decade. The app currently has 8 million users.Kendall, who is heavily featured in the new Netflix documentary “The Social Dilemma,” shared told Yahoo Finance that he had to set limit on his own phone use after finding himself scrolling Pinterest at home when he was supposed to be spending time with his family.Story continuesMoment CEO Tim Kendall speaks to Yahoo Finance.“Don't use it at night, don't use it between 6 and 8 p.m., and be really clear about what rooms you don't use your phone in. So where you sleep is a really good room to just say phones aren't allowed in here. Those are basic, simple things. Easier said than done, but they can make a really big difference in terms of I think people's mental well-being, and if you're in a family, just your ability to be present with one another. “Kendall also advised: “Turn off your notifications. Turn them all off. They aren't critical, they aren’t mission critical.” (There’s a rich irony here — upon downloading the Moment app, the user is encouraged to enable notifications.)A revolution driven by tech insidersThe last few years have been colored by this prevailing idea that more and more screen time is inevitable, though it has been met with some resistance. In 2018, activist investor Jana Partners and California State Teachers’ Retirement System (CalSTRS) sent a letter to Apple, flagging that overuse of iPhones by children and teens has a correlation with depression, sleep deprivation, lack of attention in the classroom, trouble empathizing with others, and a higher risk of suicide. Silicon Valley insiders are some of the most strict and scrupulous when it comes to limiting their children’s screen time, acutely aware of its dangers.Perhaps the most interestingly, most of those featured in the documentary are former insiders, who helped build the very tech titans they are now criticizing. Along with Kendall, Justin Rosenstein, the co-creator of Facebook's iconic “Like” button, and Tristan Harris, a former design ethicist at Google (GOOG, GOOGL) who now heads the Center for Humane Technology, talk about defecting from the toxic companies they helped build. Kendall himself acknowledges his role in crafting the addictive nature of two of Silicon Valley’s most successful tech companies.Tristan Harris, Executive Director of Center for Humane Technology, arrives at the \"Tech for Good\" Summit in Paris, France May 15, 2019. REUTERS/Charles Platiau“I think [screen addition] is going to be probably more like the sugar industry as it related to diabetes. Like in the ‘80s, we weren't really clued into that at all and now we're waking up and 100 million people have pre-diabetes or diabetes and they are going to get sick and a lot of them are going to die, and we’re going to pay the bills. I think you will see something similar,” said Kendall.When it comes to his former bosses and current mega cap tech CEOs, some of the richest men in the world, there’s a wide spectrum in awareness, according to Kendall.“I think when it comes to Silicon Valley, the spectrum is wide in terms of the degree of awareness among executives. I think that particularly in the businesses where the business model is predicated on advertising, which is predicated on getting me to spend more and more time, it's pretty tough. I think for them to be candid and have that reckoning moment without having sort of a segue plan...and, look, I have sympathy for the pressure that will continue to grow for them to figure out an alternative business that doesn’t require addicting the end user.”Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Instagram bug made users vulnerable to hackers, cybersecurity firm claimsParis Hilton explains why TikTok is her favorite appGolf sees huge upswing with women and young adults: ‘You can take your bag full of White Claws’Netflix's Reed Hastings: ‘Thank God’ Blockbuster didn’t want to buy usWhat Silicon Valley still doesn't understand about its diversity problem"}]}