{"article": [{"url": "https://finance.yahoo.com/news/apple-use-our-stuff-over-googles-if-you-care-about-privacy-205628637.html", "published": 1592841860.0, "headline": "Apple: Use our stuff over Google's if you care about privacy", "body": "Apple (AAPL) has been trying to get users to switch from Google Maps for years, but Google (GOOG, GOOGL) has retained the strong upper hand.Back in 2012 when Apple Maps launched, it had inaccuracies, and the iOS giant seemed to have blown its chance to potentially build a relationship with its users.A lot has changed since then, and Apple’s new iteration of the app offers some compelling features like special bike routes, giving users options to avoid hills and busy roads. The new app, announced Monday at Apple’s annual WWDC event, has special features that integrate with electric cars, making sure routes have enough charging stations to limit range worries.But above all, Apple is putting newfound privacy concerns first and foremost.Speaking at the WWDC event, held virtually due to the coronavirus crisis, Apple software engineering SVP Craig Federighi called it the “best way to explore the world,” adding “all while protecting your privacy.”The obvious shot at Google’s legendary powers of data collection — though one can opt out of much of it — was followed by Apple quoting a Fast Company article trumpeting it as a great app with a better privacy policy than Google.The revamp might get people who have tried Apple’s Maps before to break their Google habit and try again. But Apple knows it will take features and integration with other aspects of Apple’s iOS environment — like Siri and CarPlay — for many who don’t see privacy issues.A new framework for privacyApple has leaned into its privacy policy over the past few years, looking to differentiate itself from Google and Facebook — and avoid bad press in the process.In many aspects of the new iOS and macOS, privacy is a bit more forward than it used to be. In Safari, a feature gives transparency about how websites track users — something that Apple hopes will convince people to stop using Google’s Chrome. (They also said it was 50% faster than Chrome, because that is a factor that may sway more people.)Story continuesApple debuted new features for its Maps app at WWDC on June 22nd. (Apple)For apps asking for permissions, Apple is launching a nutritional facts-esque feature that shows what information the apps use. Permissions can also be given for a day, when in use, or forever, allowing for more control.Governing all this is Apple’s message that privacy is a “fundamental human right,” as Federighi said. The company is using a few key principles as it considers how to use data: Not collecting any more data than is necessary, keeping it on-device and off the cloud, making security protections foundational, and keeping data usage and privacy transparent and controllable by users.Beyond its own apps, the company is expanding its privacy endeavors to other apps and services via its user accounts. Many companies use a “sign in with” framework to make it easier to use new apps and services without creating new user accounts. Though Google, Amazon, and Facebook all have similar sign-ins, Apple’s privacy-forward messaging may give Apple’s version an advantage — as well as the fact that Apple Pay means the payments can also be integrated seamlessly.At WWDC, the company announced that the sign-in has been a major success, but that they would help people convert regular accounts to Apple sign-ins. For example, instead of logging into Kayak.com with your email and password, you can just log in with Apple, even if you already have an account with the travel agency.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Apple is ditching Intel to build its own processors for its MacBook and iMac systemsApple Watch finally gets sleep tracking, plus hand-washing featureApple debuts iOS 14, hitting iPhones later this yearFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"}]}