{"article": [{"url": "https://finance.yahoo.com/news/wnba-commissioner-cathy-engelbert-on-black-lives-matter-kelly-loeffler-214130552.html", "published": 1595609360.0, "headline": "WNBA Commissioner: 'There is nothing political about Black Lives Matter'", "body": "The WNBA’s 24th season finally tips off Saturday afternoon amid a global coronavirus pandemic and a renewed fight for racial justice.Earlier this month, Senator Kelly Loeffler (R-GA) wrote a letter to WNBA Commissioner Cathy Engelbert taking issue with the league’s plans to have players wear warm-up jerseys with the phrases \"Black Lives Matter\" and \"Say Her Name\" — in remembrance of Breonna Taylor — on them. Black players make up 80% of the WNBA.\"The truth is, we need less — not more politics in sports...In a time when polarizing politics is as divisive as ever, sports has the power to be a unifying antidote,” Loeffler wrote. She suggested that an American flag be printed on all jerseys and apparel instead.In an interview with Yahoo Finance Friday, Engelbert said, “Obviously we live in a divisive society right now in this country. I'll share that I was very surprised to receive the letter from Kelly Loeffler.”She gave the caveat: “[Loeffler] has been very supportive of women's issues, women's empowerment, very interested in our players and what they stand for. From what I understand having played basketball herself, she wanted to grow and support the league. One of the things that's interesting here is the WNBA well before I got here has always been at the forefront of social movements. This is not something they're doing now because someone else is doing it,” said Engelbert, who was the chief executive of Deloitte for three decades prior to becoming WNBA commissioner one year ago.“So as commissioner, I'm committed to making sure this season is dedicated to the players' platform and they want to vigorously advocate for social justice, they want to talk about #SayHerName and actually female victims of police brutality and racial injustice. Quite frankly, we're proud of our players for wanting to dedicate this season to that. And that's why we're supporting them on that. We're a very player-first league. We actually think we can include more voices in these critically important conversations and that the WNBA players' voices can be amplified,” she said.Story continuesWNBA Commissioner Cathy Engelbert speaks at a press conference where Washington Mystics forward Elena Delle Donne was named the 2019 WNBA most valuable player, Thursday, Sept. 19, 2019, in Washington. (AP Photo/Nick Wass)Separately, the WNBA responded with a statement that claims Loeffler is \"no longer involved in the day-to-day business\" of the Dream and that she “has not served as a Governor of the Atlanta Dream\" since she became a U.S. senator in October 2019. Loeffler remains a co-owner of the Dream and individual players, fans and even the WNBA union itself are demanding that she be removed.Tensions have only ratcheted as Loeffler doubled down on her disagreement with the league’s decision to support BLM. In an interview with Fox News this week, she said the movement is “divisive\" and \"based on Marxist principles.” I had to speak out for those [who] disagree with this movement because our country's too important.\"When asked if she would revisit the possibility of finding a new buyer for the Dream, Engelbert did not provide a clear response.“We’re aware there’s interested parties that want to purchase the team, but at this time our players and we are very focused on getting back to basketball and their social justice platforms… we’ve counseled with the players, we’ve communicated with the players — there’s nothing political in our view about saying Black Lives Matter — it’s a statement of values, it’s brought awareness to issues that have long been ignored and I think again, our players know the more they talk about these critically important conversations and not get involved in politics, the better,” she added.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:The US saw the highest rate of new women CEOs so far this yearSocial network of 9,000 Black professionals will be much more than 'just a Black talent pool': CEO'People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talentDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperityIf Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and more"}]}