{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-stimulus-white-house-backs-15-trillion-package-as-gop-silent-on-any-deal-173645778.html", "published": 1600346660.0, "headline": "Coronavirus stimulus: White House backs $1.5 trillion package as GOP leaders silent on any deal", "body": "The White House continues to express support for coronavirus stimulus legislation with a higher price tag than the one the GOP put forth last week, while top Republican leaders remain silent on whether the party is willing to spend more on a new bill.“I agree with a lot of it,” the president said in a press conference Wednesday when asked about a $1.5 trillion stimulus proposal unveiled by a bipartisan group of House members this week. “I think the things I don’t agree, we can probably negotiate. But I think we’ve made some progress over the last week.” (Earlier on Wednesday, the president urged the Republican Party to “go for the much higher numbers.”)On Thursday morning, White House Chief of Staff Mark Meadows told Fox News that President Trump was “certainly willing to embrace the 1.5 trillion-dollar number that was put out in the last day or so.” At another point, Meadows added: “At least let's use this $1.5 trillion new recommendation as a foundation for new negotiations.”White House Chief of Staff Mark Meadows (L) disembarks from Air Force One with U.S. President Donald Trump at Miami International Airport on July 10, 2020 in Miami, Florida. (Photo: Johnny Louis/Getty Images)Senate Majority Leader Mitch McConnell (R-KY) hasn’t yet commented on the middle-ground proposal after declining to discuss it when asked by reporters on Wednesday. House Minority Leader Kevin McCarthy (R-CA) — who was asked by reporters on Thursday about the president’s push for higher numbers — didn’t say whether he’d support it.The push from the White House, however, may not actually be enough to move negotiations forward.“Despite President Trump’s comments yesterday, Senate Republicans are still not on board with an aid package anywhere near the size of the Problem Solvers’ proposal,” Sarah Binder, a professor of political science at George Washington University and senior fellow at the Brookings Institute, told Yahoo Money. “President Trump and the White House would have to get their own party on board to have any realistic chance of pressuring Democratic leaders to further slim down the House-passed HEROES Act.”Senate Majority Leader Mitch McConnell, R-Ky., departs from the Senate Floor after a vote on Wednesday, Sept. 16, 2020. (Photo by Caroline Brehman/CQ-Roll Call, Inc via Getty Images)The $1.5 trillion proposal introduced by a group of 25 Democrats and 25 Republicans, dubbed the Problem Solvers Caucus, includes provisions such as aid to small businesses and schools, a second round of stimulus checks, an extension of extra unemployment benefits, and election aid.Story continues‘A major stumbling block’Speaker Nancy Pelosi (D-CA) and Senate Minority Leader Charles Schumer (D-NY) are leading the Democratic side of the negotiations while Meadows and Treasury Secretary Steven Mnuchin have been leading the Republican side after McConnell ceded the GOP side of negotiations to the White House in August.Pelosi — who previously said that the $1.5 trillion proposal is insufficient — applauded the president’s remarks on increasing the price tag of the next aid package but hasn’t since commented on whether she’ll support the middle-ground proposal.Read more: Here’s what you need to know about unemployment benefits eligibilitySpeaker of the House Nancy Pelosi, D-Calif., is seen in the Capitols Statuary Hall after a news conference to call for covid-19 testing and tracing funds that are included in the Heroes Act on Thursday, September 17, 2020. (Photo By Tom Williams/CQ-Roll Call, Inc via Getty Images)The Democratic plan passed in May — the HEROES Act — was initially worth over $3 trillion but was later cut down to $2.2 trillion. The initial proposal Republicans introduced was worth $1 trillion but their more recent proposal — which was rejected in the Senate — was worth just $300 billion.Some of the issues with the $1.5 trillion middle-ground proposal may be the $500 billion it suggests allocating to state and local aid — a provision on which the two parties have previously disagreed on.“When we look at state and local aid, that has been a major stumbling block,” Meadows told CNBC on Wednesday. “Hopefully, that number is closer to the $250-$300 billion range. Still, at $500 billion, I would say that that is more than what we're seeing in terms of lost revenue.”Meadows added the higher price tag of the middle ground proposal is not a “show-stopper” and also called for $25 billion in a separate package to help airlines struggling amid the pandemic and resulting recession.Yahoo Money sister site Cashay has a weekly newsletter.Denitsa is a writer for Yahoo Finance and Cashay, a new personal finance website. Follow her on Twitter @denitsa_tsekova.Read more:New unemployment requirements make it tougher for workers to qualifyEven as GDP tanked, personal income grew thanks to government supportRead more personal finance information, news, and tips on CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and Reddit."}]}