{"article": [{"url": "https://finance.yahoo.com/news/heres-why-the-surgeon-general-says-the-us-has-a-health-disadvantage-201606499.html", "published": 1595517860.0, "headline": "Surgeon General: US has a racial 'health disadvantage' — even without coronavirus", "body": "U.S. Surgeon General Jerome Adams has been one of the federal government’s most vocal advocates in favor of addressing health disparities in the U.S., which have come under harsh scrutiny in the wake of the global coronavirus outbreak.The COVID-19 crisis, which on Thursday saw the number of diagnoses top 4 million, has taken a hefty domestic toll on communities of color — a disturbing trend that’s being addressed with increasing regularity by public officials. That includes Adams, who has spoken out about the link between coronavirus mortality rates and health issues affecting people of color.“We should be shocked by the statistics,” Adams told Yahoo Finance during an interview for the All Markets Summit Extra: Road to Recovery Tuesday.“We know that a disproportionate number of the 140,000 people who died of COVID-19 in this country had been people of color. That should shock us, but it shouldn't surprise us,” he said, referencing underlying health conditions like cancer, heart disease and diabetes.“And really what COVID-19 has done is shown us those health disparities exist in communities of color,” he added.But the implications of addressing this inequity reaches far beyond just the health sector — it affects how business is run in the U.S. as well. That is why Adams has been focused on producing a report with key goals and initiatives to address disparities.“We know that the U.S. spends more money on health care than any other developed nation...and gets actually some pretty poor results for their investments. This is what we call the U.S. health disadvantage,” Adams said.He delineated ways in which the health gap is damaging communities of color and the U.S. economy, primarily through higher costs and the impact on talent recruitment.“We know that that poor health also impacts, whether or not people show up to work and how productive they are while they're at work...it impacts the ability to recruit a healthy workforce,” he said.Story continues“We know that in many places that were hard-hit by the opioid epidemic, they can't staff factories, because they can't find enough people who can pass a drug test. This is the U.S. health disadvantage,” Adams added.A multifaceted problemThere's no federal mask mandate. (Graphic: David Foster/Yahoo Finance)The U.S. Health and Human Services Department has already taken initial steps to address the problem, with $40 million in funding to create a more coordinated response platform and digitized data to help track the outbreak’s impact on communities of color with more accuracy.In addition, the U.S. Centers for Disease Control and Prevention (CDC) is now requiring more data, including age, sex and ethnicity, be collected on individuals to help address inequities.But it’s not just a problem being faced in the U.S., especially when talking about the indigenous peoples. Native Americans have been handling the pandemic on their own, with little attention being paid to the outbreaks in tribal nations.Recently, the World Health Organization said indigenous people across The Americas are at greater risk, but have fewer resources. WHO Director General Dr. Tedros Adhanom Ghebreyesus said this week that the organization is “deeply concerned about the impact of the virus” on that demographic.Vaccine trialsBut how the governments ensure equitable distribution of resources, as well as how treatment and vaccine trials are incorporating the new attention on diversity, remains to be seen. According to Adams, it is important to focus on both age and ethnicity when conducting trials.“We're working with communities to make sure they are participating in vaccine trials. Because we want everyone to understand that vaccines are safe and effective, and we want people to feel confident that they're safe and effective in all communities, so that we don't actually worsen disparities,” he said.Still, there hasn’t been a federal mandate placed on the companies conducting vaccine trials to ensure diversity. To-date, for the vaccine trials where data is available — including Moderna (MRNA), Pfizer (PFE) and Oxford University — the demographic information is scarce.Adams said there are guidelines from HHS, but “at the end of the day, you can’t compel someone to participate in a clinical trial. We can only be aware of it and have outreach.”One large challenge to enrolling diverse candidates is a simple matter of where an academic research center is located, one industry participant told Yahoo Finance recently.TrialSpark CEO Ben Liu said that clinical trial locations mean that “a lot of the patient populations from diverse backgrounds, if they’re not born near a trial center ...might not have access to some of these treatment options.What that means is “if they’re not represented in the trial, oftentimes you’ll find that the efficacy, after the drug’s been approved, has different levels of efficacy,” he added.In a recent interview with Yahoo Finance, Johnson & Johnson (JNJ) CFO Joseph Wolk said the company is committed to ensuring diversity in clinical trials. The company is set to begin the first phase of trials this month.Among the African-American population, which is disproportionately impacted by the virus, there is a huge mistrust factor that the government has to overcome, something Adams acknowledged needed “meaningful action” to address.“It's important for folks to remember this disease is still in its infancy. It's barely over six months that we even knew that it existed,” the physician said.All things considered, however, “we've come a long way in a short amount of time and we have to continue to keep our foot on the gas because, still, far too many people are getting infected, far too many people are dying from this disease,” Adams said — adding that the focus was on hard-hit communities.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}