{"article": [{"url": "https://finance.yahoo.com/news/twitter-accounts-musk-gates-apparently-210439617.html", "published": 1594829540.0, "headline": "Twitter silences some top accounts after internal systems hacked", "body": "By Joseph Menn, Raphael Satter and Katie PaulSAN FRANCISCO (Reuters) - Twitter <TWTR.N> said hackers accessed its internal systems to hijack some of the platform's top voices including U.S. presidential candidate Joe Biden, reality TV star Kim Kardashian, former U.S. President Barack Obama and billionaire Elon Musk and used them to solicit digital currency.Twitter said employees with access to its internal systems had been successfully targeted by hackers who \"used this access to take control of many highly-visible (including verified) accounts and Tweet on their behalf.\"\"We’re looking into what other malicious activity they may have conducted or information they may have accessed and will share more here as we have it,\" the company said.Twitter temporarily took the extraordinary step of preventing for several hours at least some verified accounts from publishing messages altogether. It said it would restore access only when it was certain it could do so securely.Publicly available blockchain records show the apparent scammers received more than $100,000 worth of cryptocurrency.Chief Executive Jack Dorsey earlier said the company was diagnosing the problem and pledged to share \"everything we can when we have a more complete understanding of exactly what happened.\"\"Tough day for us at Twitter. We all feel terrible this happened,\" he said in a tweet.SECURITY BREACHShares in the social media company tumbled almost 5% in trading after the market close before paring their losses.In the hours after the initial breach, some of the platform's biggest users appeared to be struggling to re-establish control of their accounts. In the case of billionaire Tesla <TSLA.O> Chief Executive Elon Musk, for example, one tweet soliciting cryptocurrency was removed and, sometime later, another one appeared, and then a third.Among other high profile accounts affected: rapper Kanye West, Amazon <AMZN.O> founder Jeff Bezos, investor Warren Buffett, Microsoft <MSFT.O> co-founder Bill Gates, and the corporate accounts for Uber <UBER.N> and Apple <AAPL.O>. Several accounts of cryptocurrency-focused organizations were also hijacked.Story continuesAltogether, the affected accounts had tens of millions of users.Biden's campaign was \"in touch\" with Twitter, according to a person familiar with the matter. The person said the company had locked down the Democrat's account \"immediately following the breach and removed the related tweet.\" Tesla and other affected companies were not immediately available for comment.Several experts said the incident raised questions about Twitter's cybersecurity.\"It's clear the company is not doing enough to protect itself,\" said Oren Falkowitz, former CEO of Area 1 Security.Alperovitch, who now chairs the Silverado Policy Accelerator, said that, in a way, the public had dodged a bullet so far.\"We are lucky that given the power of sending out tweets from the accounts of many famous people, the only thing that the hackers have done is scammed about $110,000 in bitcoins from about 300 people,\" he said.(Reporting by Joseph Menn, Raphael Satter, and Katie Paul; Additional reporting by Elizabeth Culliford in San Francisco; Christopher Bing, David Shepardson and Chris Sanders in Washington; Trevor Hunnicutt in New York; and Fanny Potkin in Singapore. Editing by Aurora Ellis and Lincoln Feast.)"}]}