{"article": [{"url": "https://finance.yahoo.com/news/warren-buffett-berkshire-hathaway-snowflake-private-placement-194954363.html", "published": 1599577040.0, "headline": "Warren Buffett's Berkshire Hathaway to buy $250 million worth of Snowflake's shares in private placement", "body": "Snowflake, Inc., the cloud-based data platform company, revealed in its amended S-1 filing on Tuesday ahead of its initial public offering that Warren Buffett’s Berkshire Hathaway agreed to take a stake in its class A shares in a private placement.The company said Salesforce Ventures and Berkshire Hathaway would each purchase $250 million worth of its Class A common shares in a private placement at a price per share equal to the initial public offering price.Snowflake, which is taking the route of a traditional IPO, expects to list its shares at a price range between $75 and $85.“Based on an assumed initial public offering price of $80.00 per share, which is the midpoint of the price range set forth on the cover page of this prospectus, each of Salesforce Ventures and Berkshire Hathaway would purchase 3,125,000 shares of our class A common stock,” the filing said.Berkshire Hathaway CEO Warren Buffett bites into an ice cream during a trade show at the company's annual meeting in Omaha, Nebraska May 3, 2014. Warren Buffett's Berkshire Hathaway Inc on Friday said quarterly profit declined 4 percent, falling short of analyst forecasts, as earnings from insurance underwriting declined and bad weather disrupted shipping at its BNSF Railway unit. REUTERS/Rick Wilking (UNITED STATES - Tags: BUSINESS TPX IMAGES OF THE DAY)“The sale of these shares to Salesforce Ventures LLC and Berkshire Hathaway Inc. will not be registered in this offering and will be subject to market standoff agreements with us for a period of up to 365 days after the date of this prospectus and lock-up agreements with the underwriters,” the filing said.The company added that Berkshire Hathaway has also agreed to purchase 4,042,043 shares of its class A shares from one of the company’s stockholders in a secondary transaction at a price equal to the initial public offering price.If both purchases go through, Berkshire is expected to own just over 7.14 million shares.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Warren Buffett has a history of trashing gold"}]}