{"article": [{"url": "https://finance.yahoo.com/news/schools-open-coronavirus-pandemic-doctor-163621256.html", "published": 1597837460.0, "headline": "‘It’s going to be really hard to keep schools open' amid coronavirus pandemic, doctor warns", "body": "As K-12 schools across the country begin welcoming back students for in-person classes, one public health expert warned that a decision to bring students back in person will be hard to stick to.“The most important thing is that we need control in our communities,” Dr. Craig Spencer, emergency medicine physician and director of Global Health and Emergency Medicine at Columbia University, told Yahoo Finance’s The Ticker (video above). “Anywhere where there's virus circulating, where you have test positivity above 3% or 5%, as we're seeing in a lot of places in this country, it's going to be really hard to keep schools open.”Epidemiologists generally agree that community spread of coronavirus cannot be controlled if the positivity rate of those tested is above 5%. As of August 18, twenty of the 25 largest school districts decided to do remote learning. The U.S. positivity rate is currently 6.5%, with variations by state and county.There are over 5.1 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)New York City, which has a positivity rate of 0.71%, opted for a hybrid plan while big districts like Los Angeles and Chicago have decided to stay put as positivity rate remain high.For some districts — New York aside — if they choose to open, “after a week or two, you're going to get a bunch of cases,” Dr. Spencer said.And even in the Big Apple, there’s trepidation: The number of families opting for remote learning has reportedly jumped by 40,000 in the past week.Earlier this month, a Georgia school district said it was closing three high schools after multiple students tested positive for coronavirus. Other schools have planned to reopen but had to quickly reverse their strategy after staff members tested positive for the virus.A student is sitting in a classroom. (Photo: Andreas Arnold/picture alliance via Getty Images)‘Political play’ to reopen schoolsDr. Spencer noted that the reopening headache is partly due to the “patchwork response” from the federal level.“What we need, I think, and what this highlights is that we need more national guidance from the Centers for Disease Control and Prevention,” he explained. “We need to know that these recommendations that are coming out for helping us open schools are built and rely on public health and not necessarily any political play that may be at hand here.”Story continuesThe Trump administration, in the meantime, has pushed hard to reopen.US President Donald Trump attends the \"Getting America's Children Safely Back to School\" event in the State Room of the white House in Washington, DC, on August 12, 2020. (PHOTO: NICHOLAS KAMM/AFP via Getty Images)“They got to go to school. We got to open up,” Trump said last week during a White House briefing. “We got to open up our schools and open up our businesses. And a lot of it has been open, but we can do better.”The CDC has issued some guidance on how schools can reopen. But at the same time, the CDC released new guidance on Friday that noted a surge in coronavirus cases in children.“The number and rate of cases in children in the United States have been steadily increasing from March to July 2020,” CDC stated. However, the “true incidence of SARS-CoV-2 infection in children is not known due to lack of widespread testing and the prioritization of testing for adults and those with severe illness.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:'Impossible to stay quiet': Doctor sounds alarm on messy school reopenings amid the coronavirus pandemic'Just trying to get through the year': K-12 students discuss returning to school amid the coronavirus pandemic'The urgency is real': CDC and Education Department join White House push to open schools amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}