{"article": [{"url": "https://finance.yahoo.com/news/uber-buy-postmates-2-65-120755105.html", "published": 1594019720.0, "headline": "Uber scoops up Postmates for $2.65 billion in 'everyday' delivery push", "body": "By Subrat Patnaik and Tina Bellon(Reuters) - Uber Technologies Inc on Monday said it would acquire Postmates Inc for $2.65 billion to expand its food delivery market share and significantly increase the business of supplying everyday goods at a time when the coronavirus has pummeled its core ride-hailing service.The all-stock deal, still subject to regulatory approval, would give Uber a roughly 30% share of the U.S. food delivery market, trailing only rival DoorDash, which commands some 45%, according to analytics firm Second Measure.Uber said both companies' boards have approved the deal, for which Uber currently expects to issue some 84 million shares of common stock. Uber offered a premium of about 10% on Postmates' last valuation of $2.4 billion. Its shares were up 5% at $32.24.Uber Chief Executive Dara Khosrowshahi on Monday told analysts the tie-up would allow Uber Eats to distinguish itself by delivering not only restaurant food, but everything from groceries to personal care and fashion items.Uber has launched an option to send packages via its U.S. ride-hail drivers during the pandemic and teamed up with grocery stores in several countries. The acquisition allows it to expand into Postmates' existing network in 4,200 U.S. cities.\"The vision for us is to become an everyday service,\" the Uber CEO said.Khosrowshahi said he expects the deal to create profitability for the Uber's Eats unit, as well as some $200 million in cost saving synergies in about two years and additional efficiency gains through Uber's smarter routing technology.The tie-up comes after a month of frenzied merger talks in the industry as millions of Americans were marooned at home by the coronavirus crisis. Companies have traditionally tried to gain market share with costly promotions and driver incentives.Uber's original plan to acquire U.S. food delivery rival GrubHub, which commands a 23% market share, faltered over regulatory and other concerns. GrubHub was snatched up by Takeaway.com NV on June 11.Story continuesWhen Uber presented its offer in June, Postmates was gearing up for an initial public offering for July.Postmates board, however, was concerned that being a smaller player in food delivery and the economic recession could cast a shadow over the new stock's long-term performance, according to a source familiar with the matter. The board instead decided to opt for certainty by agreeing to a tie-up with the well-capitalized Uber.Even with a pandemic-induced increase in demand, Uber Eats recorded a $313 million adjusted EBITDA loss in the first quarter. Uber on Monday said Eats bookings have more than doubled in the second quarter, but the company declined to provide additional financial details, including on Postmates.Khosrowshahi said some 30% of Postmates' orders come from subscribers, a reliable customer segment Uber aims to expand with its own subscription service.(Reporting by Subrat Patnaik, Akanksha Rana in Bengaluru and Tina Bellon in New York; Additional reporting by Krystal Hu in New York; Editing by Bernard Orr, Maju Samuel and Bill Berkrot)"}]}