{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-health-care-experts-call-for-nationwide-special-enrollment-period-130825512.html", "published": 1593591380.0, "headline": "Coronavirus: Health care experts call for nationwide special enrollment period", "body": "Health care experts are pushing for the government to create a nationwide special enrollment period (SEP) amid the ongoing coronavirus pandemic.An SEP would allow uninsured Americans — of which there were roughly 28.5 million as of 2018 — to immediately sign up for health care coverage through the Affordable Care Act (ACA) marketplace.“There are a lot of changes happening really quickly for so many people who are losing their employment, and obviously we’re in the middle of a pandemic,” Cynthia Cox, vice president of the Program for the Affordable Care Act at the Kaiser Family Foundation, told Yahoo Finance. “And so people might not have acted as quickly as they might’ve needed to in order to enroll in coverage during that special enrollment period that existed specifically for their move or their job loss or whatever other qualifying event took place.”A patient waits in the hallway for a room to open up in the emergency room at Ben Taub General Hospital in Houston, Texas. (USA-HEALTHCARE/TEXAS REUTERS/Jessica Rinaldi)The Kaiser Family Foundation has estimated that at least 27 million Americans so far have lost their employer-sponsored health insurance as a result of layoffs from the coronavirus pandemic.Under the ACA, also known as Obamacare, certain people can enroll in health care coverage after major life events, such as losing a job and therefore losing employer-sponsored health insurance. The enrollment period typically lasts for 60 days after a “qualifying event.” An nationwide SEP would open that to all Americans.“With the knowledge that people had in November or December when open enrollment was taking place, they might have said, ‘Well, I’m healthy. I’m not at risk. I can’t afford insurance anyway,’” Cox said. “So their decision was to go without health insurance then, but obviously a couple of months later, the world changed around them very quickly.”Coronavirus cases are increasing in the Sun Belt region. (Graphic: David Foster/Yahoo Finance)‘Millions of individuals are at risk of not being able to afford health care’In an open letter to Congress on June 17, several CEOs and health care experts such as Andy Slavitt, the former acting administrator of the Centers for Medicare and Medicaid Services (CMS), and Dr. Ezekiel Emanuel, a former health care adviser under the Obama administration, called on Congress to open a one-time nationwide SEP.Story continues“We are calling on you to use this existing system to support millions of Americans who need it now,” they wrote. “Unfortunately, current requirements to qualify for existing SEPs create friction that gets in the way of Americans enrolling in new coverage or coverage for the first time — you have the power to remove it.”President Trump has the authority to declare an SEP in states that have a federally-run Obamacare marketplace, which is all but 12 states — California, Colorado, Connecticut, D.C., Idaho, Maryland, Massachusetts, Minnesota, Nevada, New York, Rhode Island, Vermont, and Washington — and Washington D.C.U.S. President Donald Trump participates in a coronavirus briefing with health insurers in the Roosevelt Room of the White House in Washington, U.S., March 10, 2020. REUTERS/Leah Millis TPX IMAGES OF THE DAYIn March, the Trump administration decided against creating a nationwide SEP, instead promising a “cash payment” to hospitals that treated uninsured patients for coronavirus. But this doesn’t extend to individuals who need health care for other issues and don’t have the insurance to cover it.“With over 40 million Americans now likely unemployed and nearly 30 million Americans already uninsured headed into this pandemic,” the letter stated, “millions of individuals are at risk of not being able to afford health care in the time they need it most.”The case for and against an SEPBoth Cox and the group who wrote the letter to Congress argued that the 60 days — the length of special enrollment periods for individuals with qualifying events — isn’t enough time to sign up.“Having a broader special enrollment period that just anyone who wants to come in and qualifies can come in would make it so that there’s less paperwork and fewer hurdles to go through in order to get coverage,” Cox said. “Some of those hurdles can be paperwork. If you’re going through one of the more traditional special enrollment opportunities, you would have to demonstrate your job loss or demonstrate your coverage loss or demonstrate your move, which might be difficult for people who are going through a lot of changes in such a chaotic time right now.”Justin Huang helps a client sign up for a health insurance program under the Affordable Care Act (ACA) in the Chinatown neighborhood in Chicago, Illinois. (Photo by Scott Olson/Getty Images)The open letter asked Congress to ensure that there be an SEP that lasts at least eight weeks, “if not through the end of the calendar year,” remove qualifying event documentation so that Americans can easily and quickly apply, and use existing Obamacare technology so that they don’t have to wait to get their coverage.Critics of a nationwide SEP noted that enrollment periods are limited to specific times of the year in order to disincentivize people from waiting until they get sick to sign up for coverage.Cox argued that an SEP is also “for the people who aren’t losing their jobs, who made a decision not to get health insurance before, that they should be able to reconsider that decision now.”A man looks over the Affordable Care Act (commonly known as Obamacare) signup page on the HealthCare.gov website in New York. (REUTERS/Mike Segar)The letter to Congress noted that no one can enroll in coverage until the next open enrollment period, which is in November 2020, and the coverage wouldn’t go into effect until January 2021. A nationwide SEP would make insurance available as the coronavirus pandemic worsens in the U.S.“We urge the White House and Congress to use existing government systems and simply open up enrollment to any American who needs coverage now,” they wrote. “There is only upside for our country, its citizens, and the health of our nation.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:Americans 'are paying the price' for shoddy coronavirus response, doctor saysCoronavirus spread is like 'lighting a campfire,' doctor explainsPrimary care doctor: 'We should all be very worried' about plunging patient visits amid pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}