{"article": [{"url": "https://finance.yahoo.com/news/master-p-on-aunt-jemima-uncle-bens-those-are-not-real-people-214731857.html", "published": 1592499320.0, "headline": "Master P on Aunt Jemima, Uncle Ben's: 'Those are not real people'", "body": "Black ownership of the products African Americans consume would go a long way in fighting injustice, says music mogul and entrepreneur Master P.“When you look at Aunt Jemima, and you look at Uncle Ben, we don’t own those products, we never did,” Master P said in an interview with Yahoo Finance. “We need to understand that we’re not going to be able to put money back in our [black] community because we don’t own those brands. Our grandparents [have] been having us buy those products because they think it’s people that look like us.”The Aunt Jemima syrup and pancake mix brand has been around since 1889, but the portrayal of Aunt Jemima over the years was “based on a racial stereotype,” according to parent company Quaker Oats, which is owned by PepsiCo (PEP). It was the image of former slave Nancy Green that was used to create the fictional Aunt Jemima character. Quaker Oats purchased the brand in the 1930’s.Boxes of Aunt Jemima pancake batter are displayed on Wednesday, June 17, 2020, in Long Beach, Calif. Quaker Oats is retiring the 131-year-old Aunt Jemima brand, saying the company recognizes the character's origins are \"based on a racial stereotype.\" (AP Photo/Ashley Landis)“What we fighting for right now, we got to do it on a financial level, and start fighting for those rights on the financial side and start showing people that we have people that are thinking outside the box, coming up with great ideas,” said Master P.Master P made his name in the music business as a rapper and founder of No Limit Records. He currently owns numerous businesses including Rap Snacks and MoneYatti streetwear and shoe collection.Quaker Oats’ decision this week to retire a brand that connotes racist stereotypes has highlighted the role companies can play in exacerbating racial bias. The Uncle Ben’s brand, which launched in the 1940’s, has also faced criticism for the use of “uncle”, which similar to “boy,” was a derogatory term used for black men instead of their names during the Jim Crow era.“If you have Aunt Jemima pancakes or Uncle Ben rice, you know, those are not real people. [There are] other guys out there and girls that have products, bringing it to life,” he said.This week Master P announced his own rice brand, Uncle P’s rice – playing off the Uncle Ben’s rice name change – which he hopes to get on the shelves of major retailers. He said it’s a way to “put money back into our community.”Story continuesCream of Wheat packaging, are photographed Thursday, June 18, 2020 in Jackson, Miss. The owner of the Uncle Ben's brand of rice says the brand will \"evolve\" in response to concerns about racial stereotyping. (AP Photo/Rogelio V. Solis)In a recent Instagram post about his Uncle P’s rice brand he wrote, “We taking over the game! White rice, brown rice, and Red beans & rice. They never gonna see us coming, but we are here. If they can do it, we can do it. Start small and build.”The parent company of Uncle Ben’s, Mars Inc., said that the brand is currently under review in a statement to Yahoo Finance. \"As we listen to the voices of consumers, especially in the Black community, and to the voices of our Associates worldwide, we recognize that now is the right time to evolve the Uncle Ben’s brand, including its visual brand identity, which we will do. We don’t yet know what the exact changes or timing will be, but we are evaluating all possibilities.\"Conagra (CAG) and B&G Foods (BGS), the parent companies of Mrs. Butterworth’s and Cream of Wheat brands, have also announced reviews of the packaging of those brands in an effort to eliminate racist imagery.“I tell people all the time, start your own business. I think this is a great time, what we’re going into right now because not only us protesting, it’s whites, blacks, the unity that you’re seeing out there,” says Master P. “I think other races are starting to recognize that we are being victimized as African Americans.”More from Sibile:How JPMorgan Chase is making banking ‘cool’ for black teenagersKareem Abdul-Jabbar on how Bruce Lee beat the system, fought racismKareem Abdul-Jabbar on George Floyd protests: Black Americans have been playing catch-up economically since the Civil WarKareem Abdul-Jabbar: ‘The NFL got on the right side of history’Historic jobs report signals fragile recovery. ‘I didn’t hire a single person back,’ says NYC restaurant ownerFind live stock market quotes and the latest business and finance news"}]}