{"article": [{"url": "https://finance.yahoo.com/news/how-office-leasing-fared-during-the-pandemic-exclusive-data-120027637.html", "published": 1594883300.0, "headline": "How office leasing fared during the coronavirus pandemic: exclusive data", "body": "Companies signed leases for 53.4% less office space (or 24 million square feet) in the second quarter, according to JLL.Offices have sat mostly empty during the coronavirus pandemic, as 54% of Americans work from home. A new study quantifies the damage on the U.S. office market.Almost 15% of U.S. office space is now tenantless. There was 14.2 million more square feet of unleased office space than there was in the first quarter — the biggest stall since the Great Recession in 2009, according to a new report released Thursday morning by Jones Lang LaSalle, a Chicago-based commercial real estate services company.“In any cyclical downturn, you see a drop in leasing volume [new leases signed]. But this is a very big drop — you don’t usually see drops that large that fast,” said John Gates, chief executive officer, markets, U.S. and Canada for Jones Lang LaSalle.Companies signed leases for 53.4% less office space (or 24 million square feet) in the second quarter, compared to the first quarter, the study found. Companies have delayed making commitments during the pandemic until uncertainty abates, said Gates.The largest losses were in New York City, San Francisco, Houston and New Jersey. High rates of infection plus an already-shifting trend away from cities dampened these large office markets.“Leasing fell more precipitously in those markets… There was already a slowdown in leasing activity in transportation [commuter] markets,” said Gates.Tenants are also taking longer to negotiate favorable terms with landlords, said Gates. Asking prices for rent only fell 0.2% in the second quarter, but it is a tenant’s market — and real rent agreements (after negotiations) have fallen closer to 10%-15%, said Gates. Rent prices are expected to continue to fall until a treatment or vaccine alleviates the U.S.’s economic downturn.“Historically rent continues to fall until a period of economic recovery and job creation,” said Gates.Office leasing dropped more than 50% in the second quarter. Data and graphic by JLL Research.The end of the office? Experts like Warren Buffett warned that if the pandemic triggers a permanent shift to work-from-home jobs, the office real estate market could be in trouble.Story continuesIn fact, the largest deal of the quarter was a downsize — the Pacific Gas and Electric company (PG&E) consolidated their 2 million square feet of office space in the San Francisco area into a still-impressive 910,000 square feet in Oakland, California.Microsoft and Walmart Labs each signed leases for over 100,000 square feet in northern Virginia, but the lack of enthusiasm from other firms was so great that Northern Virginia still had more vacancy than in the first quarter.And TikTok added 232,000 square feet in Times Square to its New York City offices, but New York City was still hit hard by new vacancies, with an additional 1.1 million square feet of unclaimed office real estate compared to the first quarter.Still, Gates said he expects the office market to fully recover after the pandemic, as companies lease space and redesign offices for social distancing. Only 6% of CFOs plan to have half or more of their workers stay remote after the pandemic, and the market already showed some signs of a rebound in June, according to the report.“Before the pandemic, we were moving to densification — more people in less space. We could see a leveling off of that trend as a result of the pandemic, and we may even turn back the other way,” he said.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:The office apocalypse is not here, yetCommercial real estate won’t be a distressed asset: Marcus & Millichap CEOHow the coronavirus will change office spaces"}]}