{"article": [{"url": "https://finance.yahoo.com/news/multiple-vaccines-necessary-to-defeat-coronavirus-top-harvard-scientist-131716061.html", "published": 1597998320.0, "headline": "Will need 'multiple' types of coronavirus vaccines to succeed against pandemic: Top Harvard scientist", "body": "Researchers will need to develop multiple types of coronavirus vaccines to address the immense scale of the outbreak, Harvard University vaccine researcher Dr. Dan Barouch told Yahoo Finance in a recent interview.He expressed optimism about the many vaccines in development but warned that even vaccines that prove effective could have weak points or side effects, requiring other versions to make up for their shortcomings.“We have over 300 million people in this country and over 7 billion people in the world,” he said. “No single vaccine developer is going to be able to provide a vaccine for the global market.”“So I actually think that we not only want, but we actually need multiple vaccines to be successful,” said Barouch, who directs the Center for Virology and Vaccine Research and has collaborated with pharmaceutical company Johnson & Johnson (JNJ) on the development of a vaccine.There are well over 100 vaccines in development and 32 currently undergoing human trials, including eight candidates that have entered phase three trials involving thousands of test subjects, the New York Times reports.Developers achieve different vaccines in part from the use of varied techniques, Barouch said. Last month, pharmaceutical companies Moderna (MRNA) and Pfizer (PFE) announced that each had begun phase three trials on candidates developed through the use of synthetic genetic material, while other vaccines in late-stage trials use a common cold virus modified with a gene from SARS-CoV-2.Next month, Johnson & Johnson will begin the largest late-stage coronavirus vaccine trial yet, involving 60,000 people in the U.S. and other countries, the company confirmed on Thursday.The first vaccine may be ready by the end of the year, but will not become widely available until 2021, Barouch said, echoing a similar prediction made last month by top U.S. infectious disease official Dr. Anthony Fauci.But an initial success will not end the worldwide effort currently underway to develop vaccines, since each version will have strengths and weaknesses, Barouch said.Story continues“It's very possible that there might be multiple vaccines that prove safe and effective, at least that would be my hope,” Barouch says. “The more vaccines that become available, the better.”“Because each vaccine might have some pros and cons: Some might be more effective, some might have different side effects. profiles might be particularly good in the elderly or the young populations, some might have different costs associated with them,” he said.Barouch spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.The U.S. government and Johnson & Johnson have invested a combined $1 billion in a vaccine candidate co-developed by Beth Israel Deaconess Medical Center, where Barouch runs the Center for Virology and Vaccine Research. The vaccine is currently undergoing phase one and two trials but aims to begin phase three trials next month, Barouch said.Harvard University vaccine researcher Dr. Dan Barouch appears on \"Influencers with Andy Serwer.\"The Trump administration has provided financial backing for vaccines through Operation Warp Speed, which has set a goal of 300 million doses by the end of 2021. Multiple vaccines are in development in China and Australia, while England and Germany have produced vaccines currently undergoing human trials.“The worldwide vaccine effort does span the current cutting edge technologies in multiple arenas. So in that sense, I think that we will see which ones are the safest are the most effective, or the most durable and ultimately are the most deployable for this pandemic,” he adds.Read more:Economy may undergo ‘sawtooth’ recovery from coronavirus: Former Fed Vice ChairBill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}