{"article": [{"url": "https://finance.yahoo.com/news/google-pixel-4a-review-181332600.html", "published": 1598880080.0, "headline": "Google’s Pixel 4a is just $349 and packs one of the best smartphone cameras around", "body": "Google’s Pixel 4a is a $349 stunner. And with the low-cost smartphone market exploding with new, powerful offerings, that’s saying a lot.Sporting a 5.8-inch display and a sleek, understated package, the Android-powered Pixel 4a strips out all of the extras you might expect from a modern smartphone, providing what is essentially a utilitarian device that gets the basics done extremely well.The Pixel 4a is a fantastic smartphone at a ridiculously low price, but don't expect the same features of a top-of-the-line device. (Image: Google)The one area that the 4a truly excels though is, unsurprisingly, its camera. Rocking Google’s (GOOG, GOOGL) fantastic camera software and spectacular low-light mode, the Pixel 4a’s camera could easily give even the top-of-the-line smartphones on the market a run for their money.But the Pixel 4a does have one or two shortcomings that might give some potential buyers pause.Getting the basics rightGoogle, unlike most smartphone makers, doesn’t take many risks when it comes to design. You get one color, black, and you won’t find cascading display edges or elaborate camera bump designs. Still, the Pixel 4a, despite its relatively basic design, is a better looking product than both the Pixel 4 and Pixel 4 XL, both of which Google has discontinued.Unlike the 4 and 4 XL, which both had large bezels, the Pixel 4a has a more modern near-edgeless display, as well as a small cutout for its front-facing camera.The Pixel 4a also uses a plastic body rather than the soft-touch glass found on the pricier Pixel 4, which sounds like a letdown, but I actually prefer the 4a’s styling, which is understated and functional. It reminds me, surprisingly, of an ‘01 Honda Civic. It’s not the flashiest option on the market, but it does exactly what it needs to.Google's Pixel 4a includes a rear fingerprint reader, which proves incredibly helpful while wearing a face mask. (Image: Google)The display, for instance, uses the same OLED technology as the Pixel 4, but lacks that device’s “Smooth Display” feature, which increases the panel’s refresh rate to make for a, well, smoother scrolling experience. But it’s not as though scrolling on the 4a is a stuttering mess. It feels fine, actually.At this price point, you’re not going to get an in-display fingerprint reader or facial recognition technology, but the Pixel 4a does include a rear-mounted fingerprint reader that’s accurate and easy to reach. And in an era where we find ourselves wearing face masks whenever we leave the house, not having a face scanner isn’t all that much of a letdown.Story continuesThe closest competing option, Apple’s (AAPL) $399 iPhone SE, also sports a fingerprint reader rather than facial recognition technology. Apple’s option, however, offers a smaller 4.7-inch display.There are two things that I wish the Pixel 4a had to offer: wireless charging and better water resistance. While Apple’s iPhone SE offers wireless charging and can be dunked in up to 3 feet of water for 30 minutes; you can’t don’t get either of those features with the Pixel 4a.I also wish the 4a came with the same Qualcomm (QCOM) Snapdragon 855 chip found in the Pixel 4 rather than its Snapdragon 730G chip. Apple offers its latest A13 Bionic chip in the SE, the same processor found in the iPhone 11 Pro, ensuring that you’ll be able to hold on to the SE for years to come. And while the 730G processor didn’t show signs of slowdown in my testing, it would be nice to know that I’ll get the same level of performance in two or three years.As for battery life, the Pixel 4a gets a 3,140-mAh battery, which isn’t exactly mind blowing, but should get you through most of your day. And if it doesn’t, the 4a gets fast-charging technology, so you’ll be able to top off when needed in a flash.Oh man, that cameraOkay, so you’re not getting the latest processor or wireless charging. Bummer, sure. But where the Pixel 4a makes up for it is with its camera. Google has done some incredible work on its camera software in recent years, and the Pixel 4a is the latest smartphone to benefit.The Pixel 4a has a fantastic camera that easily rivals those found on top tier phones like Apple's iPhone 11 Pro or Samsung's Galaxy S20. (Image: Howley)Shots I took with the phone looked as good as anything taken with a pricier smartphone. Colors pop, objects are sharp and focused, and lighting is fabulous. But the real standout is, of course, Night Sight. Google’s low-light camera mode, Night Sight, is the kind of feature you’d expect to find on a flagship phone, not an entry-level device.And yet, thanks to Google’s software expertise, Night Sight is able to capture low-light shots that look well-lighted even without a nearby light source.Apple's low-light photo mode is one of the better offerings out there, capturing fine details despite the lack of lighting. (Image: Howley)The caveat there, as with any smartphone using a low-light mode, is that you and your subject have to remain more or less still while taking a photo. But the results speak for themselves.The closest phone I’ve tested with the kind of low-light capabilities offered by the Pixel 4a is Apple’s iPhone 11, and that starts at $699. The iPhone SE? Doesn’t have it.While Apple's low-light mode is solid, the Pixel 4a is able to outshine it by a hair. (Image: Howley)What you won’t get out of the Pixel 4a’s camera, though, is a second lens. So you won’t be taking ultra-wide angle or telephoto shots. What’s more, video shot using the selfie camera looked oddly dim. But the rear camera more than makes up for it.Should you get itThe Pixel 4a is a reliable entry-level smartphone with a heck of a secret weapon in its camera. This Android-powered handset is not only inexpensive, but offers many of the features, including a big screen, that you’d get out of phones with higher price tags.Sure it’s missing a few bells and whistles, namely wireless charging and the ability to go for a swim without dying, but it’s certainly worth picking up if you’re in the market for a quality device with an excellent camera at a low price.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple’s stock split: How shares are performingSamsung’s Galaxy Note20 Ultra is absurdly large and expensive, but worth it for the power and stylusMicrosoft adds transcription to Microsoft 365 productivity suiteFitbit launches new Sense smartwatch to help track and reduce your endless stressFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}