{"article": [{"url": "https://finance.yahoo.com/news/confused-tax-talk-veep-debate-173900107.html", "published": 1602247640.0, "headline": "Confused by the tax talk in the veep debate? Here's the lowdown", "body": "Confused by the tax talk in the veep debate? Here's the lowdownThe running mate debate on Wednesday was a lot easier to follow than the previous week’s interruption-filled slugfest between Donald Trump and Joe Biden.However, when it came to the issue of taxes, you’d be forgiven for being a bit confused by the back and forth between Vice President Mike Pence and Senator Kamala Harris.The veep and his challenger presented conflicting information on how their running mates’ tax plans will affect everyday voters.“They’re going to raise taxes on every American,” Pence said, referring to the Democratic ticket.“Joe Biden has been very clear, he will not raise taxes on anybody who makes less than $400,000 a year,” Harris shot back.To cut through the clashing claims, we thought it might be helpful to provide a quick breakdown of the candidates’ respective tax plans — and the potential impacts on low- and middle-income American taxpayers. You might want to be ready to consult with a tax pro, no matter who wins.Donald Trump’s planShutterstockAlthough the president has not yet issued an official term tax plan — which he has often referred to as Tax Cuts 2.0 — he has stated that he intends to preserve and expand upon the overhaul of the tax code he signed into law in 2017.Here’s where he stands on some of the biggest tax issues that affect regular Americans:Individual tax rates. The 2017 tax overhaul shrank the top tax rate from 39.6% to 37%, and President Trump hasn’t said anything about a further reduction. His administration has suggested a new plan could include a 10% tax cut for middle-income Americans. The president’s 2017 revisions to the tax code provided minimal changes for taxpayers with more modest incomes.Tax credits. So far the president has not proposed any significant changes to the child tax credit or the child and dependent care credit, which helps families recoup some of their child care expenses. The maximum child tax credit is currently $2,000 per child, and the maximum child and dependent care credit is $1,050 per child under the age of 13 or $2,100 for two or more children aged 13 or younger.Story continuesRetirement. Trump has floated the idea of combining and simplifying IRAs and 401(k)s into a single Universal Savings Account; contributions into the account would be taxed, but earnings would grow tax-free. Whether he’ll pursue this change is still unclear.Education. The president has temporarily suspended federal student loan payments, with interest rates frozen at 0%. Payments are currently set to resume on Jan. 1, 2021, leaving some borrowers scrambling to refinance their student loans or pay them down before they find themselves on the hook again.Payroll taxes. In August the president issued an executive order allowing employers to stop collecting Social Security taxes from workers from Sept. 1 through the end of the year. (But employees are required to make up the taxes in early 2021.) For 2020 the payroll tax is 6.2% each from an employee and employer on wages up to $137,700, and 12.4% on the net income of self-employed individuals. Mr. Trump has suggested that if he is elected, the pause on payroll taxes could become permanent.Corporate tax rates. The 2017 tax law replaced the graduated corporate tax structure with a flat rate of 21% and eliminated the corporate alternative minimum tax (AMT), which had limited certain credits and deductions so corporations would pay a minimum amount of tax. There’s no indication that the president wants to change the corporate tax rate from 21% or reinstate the corporate AMT.Joe Biden’s planMICHAEL REYNOLDS / ShutterstockWhile the details of Trump’s official tax program are still cloudy, former Vice President Biden has laid out a plan that stands in stark contrast to the changes enacted in 2017.Individual tax rates. Biden has pledged to restore the top tax rate to its previous level of 39.6% but prevent anyone earning less than $400,000 a year from seeing a tax increase. The former vice president’s plan also would require taxpayers whose incomes exceed $1 million to pay the same rate on their investment income that they do on their wages. If you're concerned about your taxes potentially going up under a Biden administration, you'll want to sign up with a financial planning service. These days, you can find them operating online.Tax credits. Under Biden’s proposal, the child tax credit would increase from $2,000 to $3,000 per child, or $3,600 for children under six. The child credit also would be made fully “refundable,” which means if the credit reduces a household’s tax below zero, you receive the negative amount in cash. Currently, households must earn at least $2,500 a year for the credit to be refundable.Retirement. The Biden plan would attempt to equalize the tax benefits for contributions to 401(k)s and other retirement plans across the income scale, which could have a significant impact on high-income taxpayers. The details of this change have yet to be announced.Education. The former vice president’s tax plan would provide additional tax relief on student loan debt and add more leniency to the current debt forgiveness and payment-deferral rules. Biden has pledged to forgive $10,000 in student loan debt for all borrowers, and forgive all undergraduate federal student loan debt from public colleges for anyone earning less than $125,000 a year. He also intends to forgive the balance of an outstanding student loan debt after 20 years without imposing any tax liability.Payroll taxes. Biden’s plan would impose Social Security taxes on all earned income over $400,000; currently, the tax is applied only to wages up to $137,700. Incomes between $137,700 and $400,000 would remain untouched by the tax under the former vice president’s plan.Corporate tax rates. Mr. Biden’s tax plan would raise the flat rate on corporate taxes from 21% to 28% and reinstate the corporate alternative minimum tax on any profits exceeding $100 million. It also would require all corporations to pay a 15% minimum tax on their book income, and double the amount of tax on foreign income earned by U.S. companies’ overseas operations.The big pictureLarry Marano / ShutterstockWhen you step back and examine each of the candidates’ tax plans — or at least, what we currently know about them — the fundamental difference is in who stands to benefit the most.Under President Trump’s plan, high-income taxpayers and corporations would see the largest tax reductions and benefits, though there is a promise of a 10% tax cut for middle-income earners.With former Vice President Biden’s plan, the highest-earning individuals and companies would see tax increases, while low- and middle-income tax rates would remain roughly the same. However, those taxpayers would be entitled to additional tax credits and expanded deductions.Got questions? Again, a tax professional or certified financial planner can help you get answers."}]}