{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-14-2020-221802899.html", "published": 1594739540.0, "headline": "Stock market news live updates: Dow extends gains, Nasdaq lags as tech rally falters", "body": "Stocks extended gains Tuesday afternoon as investors digested an early batch of corporate earnings results. JPMorgan Chase kicked off earnings season on a high note, though Wells Fargo and Delta reported quarterly results that missed consensus expectations. The Nasdaq trailed the S&P 500 and Dow as a tech-led rally from the past couple weeks lost steam.[Click here to read what’s moving markets heading into Wednesday, July 15]In earnings results Tuesday morning, each of JPMorgan, Citigroup and Wells Fargo reported adding billions to their credit loss reserves during the fiscal second quarter, as the companies braced for the coronavirus pandemic to threaten their consumer and corporate customers’ abilities to repay loans. This undercut the banks’ profit during the quarter, even as trading-related revenue surged strongly for both JPMorgan and Citigroup amid the market rally since the mid-March lows.Still, bank executives issued words of caution in their quarterly earnings releases, with JPMorgan CEO Jamie Dimon warning that the bank still “face[s] much uncertainty regarding the future path of the economy.”“However, we are prepared for all eventualities as our fortress balance sheet allows us to remain a port in the storm,” he added.Wells Fargo CEO Charlie Scharf, for his part, said the bank’s “view of the length and severity of the economy downturn has deteriorated considerably from the assumptions used last quarter,” as the bank slashed its quarterly dividend and swung to its first loss in more than a decade.Disappointing results from Delta Air Lines also underscored the misery for companies in the hardest-hit industries during the pandemic. The company’s staggering 94% drop in passenger revenues came as the company slashed capacity by 85%. Its average daily cash burn was $43 million as of June, which while an improvement from March, came only after the company parked more than 700 aircraft to adjust to the drop in demand. Other airline and cruise stocks fell Tuesday in sympathy.Story continuesInvestors also continued to eye more roll-backs of state-level reopening plans. California Governor Gavin Newsom on Monday ordered that all counties across the state re-close indoor operations at businesses including restaurants, bars, movie theaters and museums. And earlier, the state’s two largest public school districts announced all instruction would be remote-only in the fall.Coronavirus cases marched higher elsewhere in the South and West as well. Arizona’s Covid-19 case increase of 4,237 as of Tuesday was the highest in 11 days. Virus-related deaths in Florida rose by a record 132, bringing the state’s total death toll to 4,409. The one-day case growth in Florida of 3.3% was less than the average increase over the previous seven days, however.—4:02 p.m. ET: Dow climbs 557 points, or 2.1%, to highest close in a month, with Q2 earnings under wayHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +42.39 (+1.34%) to 3,197.61Dow (^DJI): +557.72 (+2.14%) to 26,643.52Nasdaq (^IXIC): +97.73 (+0.94%) to 10,488.58Crude (CL=F): +$0.19 (+0.47%) to $40.29 a barrelGold (GC=F): -$2.50 (-0.14%) to $1,811.60 per ounce10-year Treasury (^TNX): -2.5 bps to yield 0.6150%—2:07 p.m. ET: Fed’s Brainard calls for monetary policy to shift ‘from stabilization to accommodation’ as pandemic progressesFederal Reserve Governor Lael Brainard said Tuesday that the central bank should begin to pivot to offering an accommodative policy framework as a fresh rise in coronavirus cases threatens the speed of the US economic recovery.“The recovery is likely to face headwinds even if the downside risks do not materialize, and a second wave would magnify that challenge,” she said in prepared remarks for a webcast hosted by the National Association for Business Economics. “Fiscal support will remain vital.”“Looking ahead, it will be important for monetary policy to pivot from stabilization to accommodation by supporting a full recovery in employment and returning inflation to its 2% objective on a sustained basis,” she added. “As we move to the next phase of monetary policy, we will be guided not only by the exigencies of the COVID crisis, but also by our evolving understanding of the key longer-run features of the economy, so as to avoid the premature withdrawal of necessary support.”She added that implementing yield-curve targets could eventually be a tool central bankers use to “reinforce the credibility of forward guidance and lessen the burden on the balance sheet.” However, “such an approach would likely come into focus only after additional analysis and discussion, she added.”—11:24 a.m. ET: S&P 500, Dow climb while Nasdaq holds in the redThe S&P 500 and Dow each rose Tuesday mid-morning, while the Nasdaq Composite held lower as a tech-led rally in recent weeks faded.The energy sector led gains in the S&P 500, and crude oil prices rose more than half a percent to over $40 per barrel. Chevron, Caterpillar and Exxon Mobil outperformed in the Dow.Within big tech, each of Facebook, Amazon, Apple, Alphabet, Microsoft and Netflix declined.—9:37 a.m. ET: Stocks open lower after mixed bag of earningsHere were the main moves in markets, as of 9:37 a.m. ET:S&P 500 (^GSPC): -10.49 points (-0.33%) to 3,144.73Dow (^DJI): -73.51 points (-0.28%) to 26,012.29Nasdaq (^IXIC): -4.54 points (-0.04%) to 10,382.07Crude (CL=F): -$0.81 (-2.02%) to $39.29 a barrelGold (GC=F): -$14.90 (-0.82%) to $1,799.20 per ounce10-year Treasury (^TNX): -3.6 bps to yield 0.604%—9:16 a.m. ET: Wells Fargo posts first quarterly loss in 12 years, slashes quarterly dividend to 10 cents a shareWells Fargo swung to a loss in the second quarter for the first time since 2008, with record loan-loss provisions weighing heavily on the consumer-focused bank. Its second-quarter net loss of $2.4 billion compared with net income of $6.2 billion last year.“We are extremely disappointed in both our second quarter results and our intent to reduce our dividend,” CEO Charlie Scharf said in a statement. “Our view of the length and severity of the economic downturn has deteriorated considerably from the assumptions used last quarter, which drove the $8.4 billion addition to our credit loss reserve in the second quarter.”Wells Fargo said it expects to cut its quarterly dividend to 10 cents per share, from the 51 cents a share previously. The bank previously announced its intent to cut its dividend after the results of the Federal Reserve’s stress test at the end of June, which included restrictions on the amount of capital that banks could return to shareholders. Other major banks like Goldman Sachs and Morgan Stanley, in contrast, had signaled they were going to maintain their dividends at previous levels.—9:11 a.m. ET: Citigroup results beat expectation on strong fixed-income revenue, but high credit costs weigh on profitCitigroup posted better than expected results on the top and bottom line during the fiscal second quarter, even as the company’s credit reserve build grew more than expected due to the pandemic. Citigroup’s second-quarter total cost of credit was $7.9 billion, versus the about $7.7 billion anticipated.Second-quarter revenue of $19.8 billion grew 5% over last year, with fixed income markets revenue jumping 68%. Net income fell 73% over last year.“While credit costs weighed down our net income, our overall business performance was strong during the quarter, and we have been able to navigate the COVID-19 pandemic reasonably well,” CEO Michael Corbat said in as statement. “The Institutional Clients Group had an exceptional quarter, marked by an increase in Fixed Income of 68%. Global Consumer Banking revenues were down as spending slowed significantly due to the pandemic.”—8:31 a.m. ET: Consumer Price Index jumps by the most in 8 years as gasoline prices riseAn index tracking consumer changes rose by the most in June on a month over month basis since 2012 as gasoline costs rebounded strongly from earlier this year.The Labor Department’s Consumer Price Index (CPI) rose 0.6% over last month for its first increase in four months, rising faster than the 0.5% expected. Gas prices were up 12.3% to comprise more than half the gain in the headline index, and energy prices as a whole rose 5.1%.The core CPI, which excludes food and energy costs, rose 0.2% in June over last month following a 0.1% decline in May.—7:50 a.m. ET: Delta shares fall after delivering a wider than expected Q2 loss as pandemic hammers travel demandDelta Air Lines (DAL) posted a 91% slide in adjusted revenue to $1.2 billion during the fiscal second-quarter and an adjusted pre-tax loss of $3.9 billion, with both metrics missing consensus expectations. The weak quarter “illustrates the truly staggering impact of the COVID-19 pandemic on our business,” CEO Ed Bastian said in a statement Tuesday morning.The company’s passenger revenue sank 94% as Delta slashed capacity by 85% during the quarter. Passenger revenue per available seat mile – a closely watched metric for airlines – sank 60%, or more steeply than the 47% drop anticipated.Still, Delta brought down its average daily cash burn to $27 million in June from more than $100 million in late March, helped in part after the company parked more than 700 aircraft during the quarter.—7:15 a.m. ET: JPMorgan shares rise after reporting better than expected Q2 results, but Dimon warns of ‘much uncertainty’JPMorgan Chase (JPM), the largest U.S. bank by assets, kicked off the second-quarter earnings season for big banks on Tuesday with better than expected top- and bottom-line results.Adjusted earnings per share of $1.38 on adjusted revenue of revenue of $33.83 billion was better than the $1.05 per share on $30.4 billion in revenue anticipated. Markets revenue hit a record after surging 79% during the quarter, and this combined with corporate and investment banking activity “more than offset interest rate headwinds and reduced consumer activity,” the bank said in a statement.Still, the second-quarter results reflected a 51% decline in net income during the quarter, driven by high credit costs as the bank steeled for the fallout from the coronavirus pandemic. Second-quarter credit costs of $10.5 billion grew by more than $9 billion over the same period last year, and included reserve builds of $8.9 billion largely due to Covid-19.“Despite some recent positive macroeconomic data and significant, decisive government action, we still face much uncertainty regarding the future path of the economy. However, we are prepared for all eventualities as our fortress balance sheet allows us to remain a port in the storm,” CEO Jamie Dimon said in a statement.—7:07 a.m. ET Tuesday: Stock futures extend overnight gainsHere were the main moves in markets, as of 7:07 a.m. ET:S&P 500 futures (ES=F): 3,159.75, up 11.5 points or 0.37%Dow futures (YM=F): 26,103.00, up 135 points, or 0.52%Nasdaq futures (NQ=F): 10,610.25, up 10.25 points, or 0.1%Crude (CL=F): -$0.35 (-0.87%) to $39.75 a barrelGold (GC=F): -$18.70 (-1.03%) to $1,795.40 per ounce10-year Treasury (^TNX): -0.1 bps to yield 0.63%—6:30 p.m. ET: Bank earnings, CPI – What to know in markets TuesdaySecond-quarter earnings results for a slew of financial companies will be in focus Tuesday morning, with JPMorgan Chase (JPM), Citigroup (C), and Wells Fargo (WFC) set to report before market open.The financials sector (XLF) has lagged in the S&P 500 for the year to date, slumping about 23.5% versus the broader market’s 2.3% decline through Monday’s close. Banks are expected to see their results impacted by the current low-rate environment, with the benchmark interest rate near 0%. And banks are also likely to have sustained further hits to their bottom-line results as credit costs increased, due to measures taken to grapple with the economic impact from the coronavirus pandemic. Many analysts believe loan-loss provisions will have climbed further after the first quarter.Here’s what Wall Street expects some of the firms to report:JPMorgan Chase & Co. (JPM) is expected to report adjusted earnings of $1.11 per share on revenue of $30.57 billionWells Fargo (WFC) is expected to report an adjusted loss of 1 cent per share on revenue of $18.5 billionCitigroup (C) is expected to report adjusted earnings of 38 cents per share on revenue of $19.16 billionLater in the morning, market participants will also receive the Labor Department’s June Consumer Price Index (CPI) which is expected to show still-muted inflationary pressures amid the pandemic. Consensus economists expected headline CPI will have risen 0.5% following May’s 0.1% decline, with core CPI excluding volatile food and energy categories up an even more sanguine 0.1%.“We have no argument with the FOMC's [Federal Open Market Committee’s] view that the Covid crisis is a disinflationary event, but the run of three straight outright month-to-month declines in the core CPI likely came to an end in June,” Ian Shepherdson, Pantheon Macroeconomics chief economist, said in a note. “A meaningful rebound is not in prospect, though; we expect [Tuesday’s] report to show that the core index was unchanged last month.”“Prices likely were flat or even up in the three key components responsible for the declines in March, April and May,” he said, adding that apparel, airline fare and lodging prices have already slowed considerably.—6:05 p.m. ET Monday: Stock futures open slightly higherHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:05 p.m. ET:S&P 500 futures (ES=F): 3,157.25, up 9 points or 0.29%Dow futures (YM=F): 26,059.00, up 91 points, or 0.35%Nasdaq futures (NQ=F): 10,634.75, up 34.75 points, or 0.33%NEW YORK, NEW YORK - JULY 12: Family members wear face masks in Times Square as New York City moves into Phase 3 of re-opening following restrictions imposed to curb the coronavirus pandemic on July 12, 2020. Phase 3 permits the reopening of nail and tanning salons, tattoo parlors, spas and massages, dog runs and numerous other outdoor activities. Phase 3 is the third of four-phased stages designated by the state. (Photo by Noam Galai/Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}