{"article": [{"url": "https://finance.yahoo.com/news/apple-stock-split-performance-134814204.html", "published": 1598864180.0, "headline": "Apple shares up more than 3% on day of stock spilt", "body": "Apple’s (AAPL) stock began trading this morning at its new split-adjusted price of $124.81, and immediately began trading higher following the opening bell.The stock ended the day at $129.04, an increase of 3.39%.Apple announced the 4 for 1 stock split as part of its Q3 2020 earnings report, saying that the move would “make the stock more accessible to a broader base of investors.” Investors who held the stock at the close of markets on Aug. 24 received an additional 3 shares of Apple at the new price.Apple’s stock has been on a tear this year, with the company’s market cap hitting $2 trillion on Aug. 19. Apple’s historic run has been all the more impressive given the fact that it only passed the $1 trillion mark two years earlier in 2018, and reached $1.5 trillion just two months ago.Apple CEO Tim Cook arrives to the global premiere for Apple's \"The Morning Show\" at the Lincoln Center in the Manhattan borough of New York City, U.S., October 28, 2019. REUTERS/Eduardo MunozApple’s new pricing reduces its overall impact on the price-weighted Dow, moving it down from the most influential spot when it was trading at about $500 to the middle of the pack. That makes UnitedHealth Group the new most influential stock on the Dow followed by Home Depot, and pushing Apple below the likes of Microsoft and McDonald’s.But as Yahoo Finance’s Brian Cheung explained in his recent edition of “Yahoo U,” that doesn’t mean anything for Apple’s own market value. That’s because while the price of a single share is lower, the split created more individual shares.Calculate the company’s market cap based on the new price and number of shares, and you’d get the same amount you’d have gotten if the stock didn’t split and shares stayed at their higher price.Analysts agree Apple’s future is brightWedbush analyst Dan Ives points to even greater potential growth in Apple’s future, specifically in the next 12 to 18 months. That growth, Ives said in a recent research note, will come from as many as 350 million of Apple’s 950 million global iPhone users who are ready to upgrade to Apple’s upcoming iPhone 12.That device, which is widely expected to be Apple’s first 5G-capable smartphone, could play especially well in China, Ives said, with the region potentially making up as much as 20% of iPhone 12 sales.Story continuesAll of this depends on consumer sentiment during Apple’s launch period. And with unemployment numbers still high, and stimulus talks in Congress stalled, it could be difficult for many consumers to justify spending hundreds of dollars on a new smartphone at this time.Still, Apple has spent much of its time in the past few years ensuring that it isn’t as dependent on iPhone sales as it once was. To that end, the firm has dramatically increased revenue from its Services division, adding subscription options including Apple Music, Apple TV+, and Apple Arcade.In its most recent quarter, that business saw revenue of $13.12 billion compared to iPhone revenue of $26.4 billion. Revenue for Apple’s other businesses, which include iPad, Mac, and Accessories range from $7 billion to $6.4 billion.With the new stock split, Apple could see a raft of new investors, hoping to get in just before it launches its next line of products in September.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Samsung’s Galaxy Note20 Ultra is absurdly large and expensive, but worth it for the power and stylusMicrosoft adds transcription to Microsoft 365 productivity suiteFitbit launches new Sense smartwatch to help track and reduce your endless stressA majority of Americans think social media sites are politically bias: ReportFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}