{"article": [{"url": "https://finance.yahoo.com/news/biden-unveil-caregiving-proposal-aimed-093000052.html", "published": 1595306300.0, "headline": "Biden to unveil caregiving proposal aimed at boosting U.S. economy", "body": "By James OliphantWASHINGTON, July 21 (Reuters) - As part of his program to revive the coronavirus-battered U.S. economy, Democratic presidential candidate Joe Biden will unveil a sweeping child- and eldercare plan on Tuesday designed to help struggling Americans re-enter the workforce.The plan, which Biden will detail at a campaign event in New Castle, Delaware, seeks to make childcare more affordable and accessible for families and to make it easier for aging relatives and loved ones with disabilities to receive home or community-based care.Biden faces President Donald Trump, a Republican, in the Nov. 3 election. The former vice president leads in national opinion polls.His plan would cost $775 billion over a decade and be paid for by rolling back tax breaks for real estate investors and tightening enforcement of the existing U.S. tax code.As a first step, the plan would send federal aid to state and local governments to keep childcare programs and other public services operating.Ultimately, the plan would seek to create 3 million jobs in the healthcare and education sectors, while bolstering the workforce overall by 5 million by allowing people who were taking care of children or relatives to rejoin the labor force.As part of the proposal, Biden pledges to provide all 3-year-old and 4-year-old children access to free preschool, which the campaign says would save parents thousands of dollars a year in childcare costs.“This is fundamentally an economic plan,” said a campaign aide who requested anonymity in order to discuss details of the proposal. “This is a core pillar of Joe Biden’s jobs and economic recovery agenda.”Biden previously released proposals aimed at boosting U.S. manufacturing and building clean-energy infrastructure projects as the country continues to reel from a pandemic that has killed more than 140,000 in the United States and resulted in a net loss of almost 15 million jobs.(Reporting by James Oliphant; Editing by Peter Cooney)"}]}