{"article": [{"url": "https://finance.yahoo.com/news/trump-contracting-covid-19-very-much-to-be-determined-161345457.html", "published": 1601637680.0, "headline": "Implications of President Trump contracting COVID-19 'very much to be determined'", "body": "President Trump and First Lady Melania Trump tested positive for COVID-19, the disease caused by the coronavirus, according to an announcement early Friday morning.The news left many wondering how serious the president’s condition could become. According to reports, he has only shown mild symptoms so far.“It is just hours into him knowing he’s positive, and he was tested based on contact tracing, which meant that he was tested frequently and early,” Dr. Dara Kass, an emergency medicine physician at Columbia University, said on Yahoo Finance’s The First Trade (video above). “But the fact is it’s very early in his course, and whether or not he’s going to develop... serious symptoms is still very much to be determined.”President Donald Trump speaks during a campaign rally at the Duluth International Airport on September 30, 2020 in Duluth, Minnesota. (Photo by Stephen Maturen/Getty Images)The news about Trump’s diagnosis came only hours after it was revealed that his close adviser, Hope Hicks, had also tested positive for the virus. Hicks had been part of his campaign team that traveled with the president, largely unmasked and not adhering to social distancing.It’s unclear if anyone else in the president’s envoy has also tested positive. Barron Trump, the president’s son, Vice President Mike Pence, and Second Lady Karen Pence tested negative.‘An unpredictable course’While the president has reportedly only displayed cold-like symptoms so far, there are many factors that could contribute to him becoming sicker.Kass noted that the 74-year-old Trump is considered elderly, which is a high-risk demographic that’s been particularly hit hard by the virus. The president is also male and medically obese, which puts him at a higher risk for acute and long-term complications.White House Deputy Chief of Staff Dan Scavino and counselor to the president Hope Hicks celebrate after U.S. President Donald Trump delivered his acceptance speech at the Republican National Convention, August 27, 2020. REUTERS/Kevin Lamarque“Over 7 million Americans have had this virus and many of them have what we call long-hauler symptoms — continued symptoms of shortness of breath, of maybe blood clots or kidney damage or other foggy thinking,” Kass said. “There’s a lot of neurological complications of this virus, so we don’t know what’s going to happen in the acute phase, the phase that he’s infected and isolated, or what the recovery would look like. And that’s true for the First Lady, it’s true for Hope Hicks. This virus has an unpredictable course.”Story continuesAnd according to a CDC report, 35% of symptomatic patients had not returned to their normal state of health after 2-3 weeks from getting the virus. For those between the ages of 18 to 34 with no chronic conditions, 20% hadn’t returned to their usual health.‘Could be hundreds of people’ exposed to infected President TrumpTrump has been publicly skeptical about the efficacy of masks and social distancing while prioritizing the reopening state economies over stay-at-home orders.He has also continued to hold rallies attracting mass crowds while rarely wearing a mask in public. Even after Hicks tested positive, Trump and his team flew to New Jersey for a campaign fundraiser where he was in contact with dozens of people at a roundtable event.Supporters, many not wearing masks, gather for an indoor rally with U.S. President Donald Trump in Henderson, Nevada, U.S. September 13, 2020. REUTERS/Jonathan Ernst TPX IMAGES OF THE DAYThis means that it’s unclear how many people could have been exposed to the president while he was carrying the virus.“We don’t know that it’s only dozens of people,” Kass said. “It could be hundreds of people because of the entire entourage that travels with the president, if they were within six of the president, unmasked for over 15 minutes, they are at risk and need to be quarantined for 14 days regardless of negative tests.”This includes figures like members of the Cabinet, senators, and even Supreme Court nominee Amy Coney Barrett (although she tested negative according to reports).“We just don’t know how many people were in contact with the president or any other positive patients at this point,” Kass said, adding: “It reminds us even if you are negative or until you find out you’re positive, what you do in that interim period of time is what determines how many people in your life are affected by your positive diagnosis.”Eric Trump, Ivanka Trump, Melania Trump, Tiffany Trump and Donald Trump Jr. are seen ahead of the first presidential debate at the Case Western Reserve University and Cleveland Clinic in Cleveland, Ohio on September 29, 2020. (Photo by JIM WATSON/AFP via Getty Images)It’s unclear whether or not anyone was exposed during the presidential debate earlier this week between President Trump and former Vice President Joe Biden. According to reports, the Trump family and his team declined to wear masks after they were approached and asked to wear one. Hicks was among those individuals and may have been positive with the virus at the time.Kass said “it is possible” the debate could be a super-spreader event as a result of this, potentially exposing Biden, his team, and even debate moderator Chris Wallace.And once the president recovers, Kass hopes he goes back into the regular world following proper protocol.“With a mask on, staying distant, remembering that he has to keep protecting other people from him and himself from other people,” she said. “And unfortunately, that’s not how he was behaving before this.”Adriana Belmonte is a reporter and editor covering politics and health care policy for Yahoo Finance. You can follow her on Twitter @adrianambells.READ MORE:Coronavirus keeps spreading across the U.S. ‘because there’s no mask mandate,’ doctor saysCoronavirus vaccine doesn't depend on President Trump's rhetoric, doctor explainsNearly 2 out of 3 Americans are more concerned about access to health care since the start of coronavirus: pollRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}