{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-july-9-2020-221547568.html", "published": 1594307540.0, "headline": "Stock market news live updates: Stocks mostly lower after Nasdaq sets record high", "body": "Stocks abruptly turned negative Thursday as fears over the economic outlook following an increase in coronavirus cases resurged. The Dow and S&P 500 wiped out its week to date gains, while the Nasdaq held higher and hit a record.[Click here to read what’s moving markets heading into Friday, July 10]The Dow sank more than 300 points, led by a decline in shares of Walgreens Boots Alliance after the company swung to a quarterly net loss and announced additional job cuts overseas. Wells Fargo (WFC) shares slid about 2% after Bloomberg Law reported the bank was preparing to cut thousands of jobs later this year, amid broad-based weakness in the financials sector.The coronavirus situation worsened further in some parts of the US based on new data Thursday. Florida reported a record 120 deaths among residents over a one-day period. In the US, confirmed cases topped three million to comprise more than 25% of the global total. California reported its largest one-day jump in new virus deaths as of Thursday at 149.Still, a new report from the Labor Department Thursday morning showed both new and continuing unemployment insurance claims fell in the most recently reported weeks, at least temporarily alleviating fears that an increase in domestic coronavirus cases would spill over into deeper labor market weakness.After market close Wednesday, Bed Bath & Beyond (BBBY) shares slumped after announcing a wider than expected first-quarter loss, and the company’s plans to close 20% of its stores in the next two years as a cost-cutting measure during the pandemic.—4:03 p.m. ET: Nasdaq closes at fresh record high while Dow drops to lowest in 6 daysHere were the main moves in markets as of 4:03 p.m. ET:S&P 500 (^GSPC): -17.85 (-0.56%) to 3,152.09Dow (^DJI): -361.12 (-1.39%) to 25,706.16Nasdaq (^IXIC): +55.25 (+0.53%) to 10,547.75Crude (CL=F): -$1.38 (-3.37%) to $39.52 a barrelGold (GC=F): -$11.60 (-0.64%) to $1,809.00 per ounce10-year Treasury (^TNX): -4.8 bps to yield 0.6050%—Story continues2:40 p.m. ET: West Texas intermediate crude oil prices drop by the most in two weeksUS West Texas intermediate crude oil futures sank 3.1% to $39.62 per barrel on Thursday, marking the commodity’s biggest drop in two weeks. It was the first time US crude settled below $40 a barrel since July 1.Brent crude, the international standard, also settled lower by about 2% to $42.35 a barrel.—1:07 p.m. ET: Nasdaq pushes back into positive territory, S&P 500 and Dow hold lowerThe Nasdaq Composite popped back into the green Thursday afternoon as shares of Amazon rose more than 1% to a fresh record high.Walgreens Boots Alliance and Raytheon lagged in the Dow, dropping nearly 9% and 4%, respectively. The financials and energy sector underperformed in the S&P 500, with August futures for West Texas intermediate crude oil prices dipping more than 2.5% to below $40 per barrel.—11:09 a.m. ET: Dow drops 400+ points as stocks’ week to date gains dissipateHere were the main moves in markets, as of 11:09 a.m. ET:S&P 500 (^GSPC): -42.91 points (-1.35%) to 3,127.03Dow (^DJI): -447.06 points (-1.72%) to 25,620.22Nasdaq (^IXIC): -78.67 points (-0.75%) to 10,416.39Crude (CL=F): -$1.32 (-3.23%) to $39.58 a barrelGold (GC=F): -$7.90, or 0.43%, $1,812.70 per ounce10-year Treasury (^TNX): -2.8 bps to yield 0.625%—10:02 a.m. ET: 30-Year mortgage rate sinks to fresh all-time low: Freddie MacThe 30-year fixed mortgage rate for the week ending Thursday sank to an average of 3.03%, or the lowest rate in survey history back to 1971, according to Freddie Mac.A year ago at this time, the 30-year fixed mortgage rate averaged 3.75%.The 15-year fixed-rate mortgage averaged 2.51% with an average 0.8 point for the week ending today, falling from last week’s 2.56% and last year’s 3.22%.“The summer is heating up as record low mortgage rates continue to spur homebuyer demand,” Sam Khater, Freddie Mac’s chief economist, said in a statement. “However, it remains to be seen whether the demand will continue if COVID cases rise to the point that it hinders economic growth.”—9:33 a.m. ET: Stocks open slightly higher as tech outperforms againHere were the main moves in markets, as of 9:33 a.m. ET:S&P 500 (^GSPC): +9.66 points (+0.3%) to 3,179.60Dow (^DJI): +21.94 points (+0.08%) to 26,089.22Nasdaq (^IXIC): +80.25 points (+0.76%) to 10,574.65Crude (CL=F): -$0.42 (-1.03%) to $40.48 a barrelGold (GC=F): Flat at $1,820.60 per ounce10-year Treasury (^TNX): Unchanged to yield 0.653%—8:30 a.m. ET: Initial jobless claims, continuing claims come in better than expected for week ended July 4New weekly unemployment claims totaled 1.314 million for the week ended July 4, the Labor Department said Thursday. This was better than consensus expectations, which anticipated another 1.375 million individuals filed new jobless claims last week.The prior week’s new jobless claims were downwardly revised to 1.413 million.Continuing unemployment claims fell to 18.062 million for the week ended June 27. This was better than the 18.8 million expected, and fell from the previous week’s downwardly revised level of 18.76 million.—7:44 a.m. ET: Walgreens Boots Alliance stock falls after swinging to a loss, announcing job cutsWalgreens Boots Alliance (WBA), a Dow component, fell about 3% in early trading after the company announced weaker than expected fiscal third-quarter results, with performance “significantly impacted by Covid-19,” the company said.The pharmacy giant swung to a net loss of $1.7 billion, compared with net income of $1 billion in the same quarter last year. The company said this reflected $2 billion in non-cash impairment charges related to its Boots UK business, “reflecting deteriorating business conditions including the adverse impact of COVID-19 and resulting future uncertainty.” Walgreens announced it would cut an additional 4,000 positions in the UK, or about 7% of the workforce, and close 48 Boots Optician stores.Third-quarter net sales were roughly flat over last year at $34.63 billion. The company estimated the Covid-19 impact on sales to be as much as $750 million during the quarter.—7:19 a.m. ET Thursday: Stocks mixed, Nasdaq holds higherHere were the main moves in markets, as of 7:19 a.m. ET:S&P 500 futures (ES=F): 3,167.75, up 4.25 points or 0.13%Dow futures (YM=F): 26,014.00, up 45 points, or 0.17%Nasdaq futures (NQ=F): 10,682.5, up 20.25 points, or 0.19%Crude (CL=F): +$0.22 (+0.54%) to $40.84 a barrelGold (GC=F): +$8.30 (+0.46%) to $1,818.20 per ounce10-year Treasury (^TNX): +0.3 bps to yield 0.6530%—6:03 p.m. ET Wednesday: Stocks extend gains in late tradingHere were the main moves at the start of the overnight session for U.S. equity futures, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,167.75, up 4.25 points or 0.13%Dow futures (YM=F): 26,014.00, up 45 points, or 0.17%Nasdaq futures (NQ=F): 10,682.5, up 20.25 points, or 0.19%A trader walks in front of the New York Stock Exchange (NYSE) on May 26, 2020 at Wall Street in New York City. - Wall Street stocks surged early May 26, 2020 on optimism about coronavirus vaccines as the New York Stock Exchange resumed physical floor trading for the first time since late March. About five minutes into trading, the Dow Jones Industrial Average was up 2.3 percent at 25,023.76. The broad-based S&P 500 gained 2.0 percent to 3,013.04, while the tech-rich Nasdaq Composite Index advanced 1.6 percent to 9,468.96.The gains came after a ceremony presided over by New York Governor Andrew Cuomo, who wore a mask as he rung the opening bell to signal the start of the day for traders, also clad in masks and separated by plexiglas. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}