{"article": [{"url": "https://finance.yahoo.com/news/this-senator-wants-to-bring-back-banking-at-the-post-office-162339306.html", "published": 1596108680.0, "headline": "This senator wants to bring back banking at the Post Office", "body": "The U.S. Postal Service is in a tough spot. It’s running out of money and the White House sees the agency aligned with two things it doesn’t like very much: voting-by-mail and Amazon.com (AMZN).President Trump recently appointed an ally as the new Postmaster General and on Wednesday, the Treasury Department announced an agreement on the conditions of a loan to provide up to $10 billion to the USPS under the CARES Act. But even with the loan, more action will likely be needed as the agency faces budget shortfalls and an increased demand ahead of November’s election.Many policymakers just want to keep the Post Office afloat but one is pushing the idea of adding a big new responsibility to its plate that she says “solves two problems.”Sen. Kirsten Gillibrand (D-NY) has been advocating for postal banking since 2018. The idea is that your local Post Office branch would be allowed to offer services like checking and savings accounts, ATMs, and low-interest loans alongside letter service.New York Senator Kirsten Gillibrand at the U.S. Capitol in March. (Tom Williams/CQ-Roll Call, Inc via Getty Images)The idea has historical precedent: Congress created the Postal Savings System in 1910, which operated until 1966 offering savings accounts to customers.Gillibrand said Wednesday in a Yahoo Finance Presents interview with Rick Newman that her plan will help fill in the Post Office’s financial hole by generating $9 billion a year and, in addition, “it addresses the fact that 30% of Americans are unbanked or under-banked,” she says.‘It's so foolish that they lobby against it’Few – Gillibrand included – expect the idea to gain traction this year. Her frustration was evident with the stalled effort during the interview when Gillibrand called out big banks specifically for their opposition to her plan. “It's so foolish that they lobby against it because these are customers they don't offer services to anyway and don't ever plan to,” she says, adding that the opposition shows how “out of touch they are.”A branch of the U.S. Post Office in New York during the city's 'Phase 4' of re-opening following restrictions imposed to slow the spread of coronavirus. (Noam Galai/Getty Images)President Trump has repeatedly criticized the agency: “The Postal Service is a joke,” he said in April blasting them for the rates it gives to shippers like Amazon. The president has also offered nearly daily claims which have been repeatedly fact-checked and found false against the efforts to allow more Americans to vote by mail.Story continuesOn Thursday, he even floated the idea of delaying the election – which he doesn’t have the power to do – because of the issues he claims with mail-in-voting.With Universal Mail-In Voting (not Absentee Voting, which is good), 2020 will be the most INACCURATE & FRAUDULENT Election in history. It will be a great embarrassment to the USA. Delay the Election until people can properly, securely and safely vote???— Donald J. Trump (@realDonaldTrump) July 30, 2020Some members of the House want a pilot program on postal banking activities. The Consumer Banking Association, a group representing the banking industry, has stood against those efforts, saying private banks “have the expertise and capacity to serve customers’ needs in a way the Post Office would find difficult.” They argue instead for measures to expand consumer access to banking services at private institutions.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.Read more:Postal union chief responds to President Trump's ‘joke’ remarksTrump could wreck the Postal Service, but he can’t beat AmazonHow coronavirus could be the ‘final straw’ for the U.S Postal ServiceRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}