{"article": [{"url": "https://finance.yahoo.com/news/stock-market-factoring-in-smooth-ride-to-economic-recovery-edward-jones-exec-133826821.html", "published": 1598517980.0, "headline": "Stock market factoring in ‘smooth ride’ to economic recovery: Edward Jones exec", "body": "The S&P 500 (^GSPC) and Nasdaq (^IXIC) hit all-time highs on Wednesday — even as the U.S. economy reels from double-digit unemployment and its worst single-quarter contraction on record.The bullish market arises, in part, from expectations that the overall economy will recover with ease, Edward Jones Managing Partner Penny Pennington told Yahoo Finance in a recent interview. But she cautioned that the rebound could prove more difficult than some investors anticipate, even amid apparent progress in the development of a coronavirus vaccine.“The stock market is factoring in a fairly smooth ride to that recovery,” says Pennington, who leads the financial advisory firm Edward Jones, which serves seven million clients in the U.S. and Canada with $1.3 trillion in assets. “We don't think it's going to be quite that smooth.”“We're asking investors and our clients to buckle up a little bit,” she adds. “Be ready for a bit of a bumpy ride.”Optimism about the recovery softened last week when more than one million Americans filed for unemployment benefits, an uptick from the week before and a threshold that analysts expect claims to reach again when figures are released on Thursday.The recovery slowed last month after a record-setting jobs surge in May and June. The unemployment rate fell to 10.2% in July but remained well above the low single-digit marks seen before the pandemic. Meanwhile, Q2 U.S. GDP fell by a staggering 32.9% quarter over quarter, annualized.But Pennington said the strong pre-coronavirus economic performance at the outset of the year gives investors confidence that the U.S. can return to such levels of production soon.“The stock market looks backwards just a little bit and says, ‘The economy was pretty strong,’” she says. “The stock market is now looking forward — the stock market is always forward looking — to a recovery of the economy.”The recovery will take hold later this year but won’t ramp up until next year, she said.Story continues“Probably beginning in the fourth quarter, a little bit of it is already begun,” she adds. “Then really picking up speed and 2021.”Edward Jones Managing Partner Penny Pennington appears on \"Influencers with Andy Serwer.\"Pennington spoke to Yahoo Finance Editor-in-Chief Andy Serwer in an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Some economic observers have noted that a return to pre-coronavirus levels of production may not be possible until the discovery and distribution of a coronavirus vaccine.There are 32 vaccines currently undergoing human trials, including eight candidates that have entered phase three trials involving thousands of test subjects, the New York Times reports. Last month, pharmaceutical companies Moderna (MRNA) and Pfizer (PFE) announced that each had begun phase three trials on a respective vaccine candidate.In addition to the market’s expectations of an eventual economic recovery, the optimism may spring from apparent progress on coronavirus therapeutics and vaccines, Pennington said.“You might hypothesize that the stock market is also looking for treatments to COVID, maybe a vaccine,” she says. “I'm hoping that that's not pure hopeful conjecture — that it actually is on the way.”Read more:Coronavirus vaccine 'possible' by winter: Top Harvard scientistBill Gates: We should be able to ‘manufacture a lot of vaccines’ next yearJump into stock market expecting rise 'a fool's errand': Billionaire investor David RubensteinMichael Dell: ‘Not enough’ progress on diversity in the tech industryRead the latest financial and business news from Yahoo Finance"}]}