{"article": [{"url": "https://finance.yahoo.com/news/companies-sidestep-traditional-ip-os-by-choosing-spa-cs-direct-listings-144947876.html", "published": 1595757440.0, "headline": "Companies sidestep traditional IPOs by choosing SPACs, direct listings", "body": "“The IPO market is a bit broken,” says Duncan Davidson, co-founder of Bullpen Capital, a Silicon Valley investment firm.He says that’s part of the reason why special purpose acquisition companies, or SPACs, are going public at a record pace.SPACs, often referred to as “shell” or “blank check” companies, raise capital for the purpose of acquiring another company. Nikola (NKLA), DraftKings (DKNG), Virgin Galactic (SPCE) all went public via SPAC mergers.“We’re going to see a lot more of these,” said Davidson. “These are alternative ways to get companies public.”This backdoor phenomena may be ripe for the times.“When you have companies staying private for as long as you currently have, the expectation is at some point, you need to recapitalize the shareholder base, and enable those who have created that value to benefit from it,” says Jose Cobos, CRO for Forge Global, an online trading platform for pre-IPO companies.“The reason I think SPACs have really done well is they are significantly faster to complete an IPO ... than a traditional IPO,” said Cobos.Investors are often betting on the star executives behind the SPAC and their ability to identify profitable targets.This past week billionaire Bill Ackman’s Pershing Square Tontine Holdings (PSTH.U) went public, raising a record $4 billion. Ackman says the blank check company aims to “marry a unicorn.”“It's a much more efficient process, a much less risky process for the private company,” Ackman told Yahoo Finance.SPACs can side-step market volatility, and the SPAC and target company avoid the intense scrutiny of traditional IPOs.IPO - Initial Public Offering - moment when company has debut on stock exchange market. US Dollar texture. 3D illustration.‘Who's got the bigger cost of capital? It’s the traditional IPO approach’Venture capitalist Bill Gurley recently tweeted that “massive underpricing” of traditional IPO’s have created a “huge SPAC window.”In the past SPACs were considered costly because sponsors would often end up with 20% of the equity. Nowadays, that may be a cheaper option.“Recently almost every one of these IPOs has had an 80% or 100% first day pop,” says Davidson.Story continuesEarlier this month financial software company NCINO (NCNO) and insurance platform Lemonade (LMND) both soared more than 130% on their first day of trading.“If you compare what used to be an expensive SPAC, 20%, with a 100% under pricing of a public stock, who's got the bigger cost of capital? It’s the traditional IPO approach,” he added.‘A clever hack’Another alternative to IPOs are direct listings, in which existing shareholders can sell their shares. Spotify (SPOT) and Slack (WORK) went public this way.[Read more: Don’t say ‘IPO’: What to know about Slack’s direct listing]The New York Stock Exchange is now pushing for the Securities and Exchange Commission (SEC) to allow companies to raise new capital during a direct listing. The SEC is expected to decide on the proposal this year.Even if the change isn’t approved, Davidson points to “a clever hack from Silicon Valley” that also makes direct listings a more attractive alternative than IPOs.“The hack is a hybrid direct listing. Go raise a big private round, and then do the direct listing. That way you just separate raising money in the IPO from raising money separately, and you get the best of both worlds,” he said.Its expected that data analytics firm Palantir and workplace toolmaker Asana will go public this year via direct listings.‘I would ask a really big question: Why did we screw up the IPO market?’In the past, deals with blank check companies were seen as risky, raised eyebrows, and in some cases drew regulatory scrutiny.When asked if the SEC should start scrutinizing the rise of SPACs, Davidson replied: “If I were the SEC, I wouldn’t worry about SPACs. I would ask a really big question. ‘Why did we screw up the IPO market?’”Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}