{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-gut-check-how-small-businesses-are-surviving-205917890.html", "published": 1597766840.0, "headline": "Coronavirus gut check: How small businesses are surviving", "body": "It’s been a trial by fire for small-business owners trying to survive the coronavirus pandemic.“We walked into 2020 with a plan that we made in 2019 and then Covid gut-checked us. Surprise!” Black upStart CEO Kezia Williams said in the latest episode of #Next20, a new Verizon series about the issues that will define the next 20 years.Keeping to that 2019 plan amid the economic upheaval in 2020 is the biggest mistake a small-business owner can make.Entrepreneurs on shoestring budgets who have managed to keep their businesses open during the pandemic have had to rip up their business plans, lay off workers, pivot, renegotiate leases, reduce traffic at their shops for safety reasons, try to rehire fewer employees, and develop new products to sell – all while maintaining cash flow in an environment where many consumers are cash-strapped and unemployed.Entrepreneurs wishfully thinking about what could have been without the coronavirus, risk botching the pivot to the mask-wearing, socially distanced new normal needed to survive.“Think of erasing your white board and starting over. No matter how awesome your business plan was prior to Covid-19, you have to relook at it, rebuild it,” said Elizabeth Gore, co-founder of Hello Alice, which has partnered with Verizon to help small businesses navigate the pandemic. “The world has changed, customer behavior has changed, cash flow has changed.”Businesses store fronts, often covered with graffiti, throughout Manhattan continue to shutter their doors as they are unable to operate during the Coronavirus pandemic. (Photo by: STRF/STAR MAX)‘Entrepreneurial spirit is what makes small business owners great’Cash flow headaches abound during the pandemic as hundreds of thousands of businesses around the U.S. have been forced to shut down permanently.“Being an entrepreneur and an owner is incredibly hard,” said Gore. “That entrepreneurial spirit is what makes small-business owners great. I actually think we will see some incredibly innovative businesses come out of this pandemic.”As the fastest growing segment of entrepreneurs in the U.S. economy prior to the pandemic, women have been small business trailblazers, generating $1.9 trillion in annual revenue. The business pivot required during the pandemic has put women at an advantage in dealing with the wreckage, Gore said.Story continues“I think you are going to see women elevate even higher,” she said. “We are working from home, we are with our children, we do not have to fight for our seat at the table as much because we are digital.”Many small-business owners who relied on brick and mortar models prior to the pandemic have expanded their digital footprint to adapt to changing consumer needs.Business owners able to identify new needs and gaps are the ones best-positioned to succeed in the coronavirus era, according to Gore.President Donald Trump and Ivanka Trump listens as Treasury Secretary Steven Mnuchin speaks during an event about the Paycheck Protection Program used to support small businesses during the coronavirus outbreak, in the East Room of the White House, April 28, 2020, in Washington. (AP Photo/Evan Vucci)“Fortune 500’s are having to shift and pivot right now. Small businesses and entrepreneurs can shift faster, so if you can jump in there and plug a hole for enterprise companies and make money that way right now, because we tend to be able to move faster and be more nimble, that is a massive opportunity,” she said.Capitalizing on Black buying power is the key to helping Black-owned small businesses thrive, said Williams, whose company, Black upStart, holds boot camps for Black entrepreneurs.“Black women lose over $840,000 over their working careers, and not because they are not twice as smart, not because they do not work twice as hard, and not because they are not twice as good, but simply because they are Black and they are women and they are trying to overcome the pay gap,” she said. Black women get paid 75 cents for every dollar a white man earns, according to PayScale.The Paycheck Protection Program was enacted to help all small businesses survive the pandemic, yet only 12% of Black and Latinx small-business owners received loans.In this June 25, 2020 file photo, a price sign is displayed at a retail store as a store employee wears a mask while working in Niles, Ill. (AP Photo/Nam Y. Huh, File)“Instead of relying on the government, which has just, quite frankly, failed Black and brown entrepreneurs, we lean on Black consumers who spend $1.3 trillion annually on products and services and ask them to channel their resources, their cash flow back to entrepreneurs that need it most,” Williams said.Williams launched the #MyBlackReceipt campaign in June to encourage consumers to spend at Black-owned businesses. Consumers spent more than a half a million dollars in the first three days of the campaign.“What we wanted to do was not just ask people to put their receipt which they obtained from a Black-owned business where their protest was, but to make buying Black more than just a hashtag, more than just a one-day activation, more than just a public call to action, but an actual, physical manifestation of you putting your dollars in a Black-owned business materialized in the document, which was a receipt,” said Williams.More from Sibile:How Hollywood content can ‘normalize injustice’Michigan Gov. Whitmer, potential VP pick, has ‘good relationship’ with Biden, says Lt. Gov.Biden’s plan to fight criminal justice injusticeMedia mogul Byron Allen: ‘I think President Trump is totally wrong’Ben Carson on second coronavirus economic shutdown: ‘You do that again, and you completely destroy the financial infrastructure’Find live stock market quotes and the latest business and finance news"}]}