{"article": [{"url": "https://finance.yahoo.com/news/how-republicans-are-losing-young-voters-194848420.html", "published": 1602255380.0, "headline": "How Republicans are losing young voters", "body": "The Republican party under President Trump faces many challenges: It’s losing female voters, seniors and suburbanites, to name a few.To those, add another cohort peeling away from the GOP: Young people for whom climate change is a key issue. “Young people see the Republican party as the anti-climate party,” Benji Backer, founder of the American Conservation Coalition, tells Yahoo Finance in our latest Electionomics podcast. “That is not good news for the Republican party now, but it's most importantly not good news for the Republican party in the future. And even worse, it’s really bad for the environment because we actually need both sides of the table to get things done.”Backer is a 22-year-old recent graduate of the University of Washington who says he grew up as a conservative political activist, starting in 2008 when he knocked on doors for Republican presidential candidate John McCain at the age of 10. He founded the coalition to promote free-market approaches toward addressing climate change and give a voice to young voters who will have to deal with the consequences of a warming planet longer than their parents and grandparents will.But Backer isn’t sure if he’ll vote for Trump, or for his Democratic rival Joe Biden. Trump withdrew the United States from the Paris Climate Accord and has promoted fossil fuels, while mocking renewable sources of energy, such as wind. Trump’s list of priorities for a second term includes no mention of climate or the environment.Rep. Alexandria Ocasio-Cortez, D-N.Y., addresses the Road to the Green New Deal Tour final event at Howard University in Washington, Monday, May 13, 2019. (AP Photo/Cliff Owen)Biden has an elaborate climate plan with key goals such as eliminating carbon pollution from the power sector by 2035 and emitting no carbon nationwide, after accounting for carbon capture, by 2050. Those are aggressive targets that please many climate activists. But Biden would rely heavily government on spending, new laws and regulatory enforcement. Some conservatives want a lighter approach in which government creates incentives for the private sector to innovate solutions to the problem. Dozens of prominent economists, including four former chairs of the Federal Reserve and 27 Nobel laureates, have called for a carbon tax as the most efficient and effective way to begin addressing global warming.Story continuesTwo-thirds of Americans say the government isn’t doing enough to address climate change, according to the Pew Research Center. Democrats are more concerned than Republicans, but a slim majority of Republicans support new efforts to address the problem, such as tougher restrictions on power plan emissions.Young Americans, not surprisingly, feel more strongly about climate change, with 51% of 18-to-34 year olds telling Gallup they think it will cause serious problems in their lifetime. Just 29% of those 55 and older feel that’s the case. Some young Americans identify with progressive Democrats such as Rep. Alexandria Ocasio-Cortez of New York, one of the co-sponsors of the Green New Deal, a set of legislative proposals that’s considerably more aggressive than Biden’s climate plan but lacks support among centrists concerned about its massive costs.2020/09/25: A 'Reduce Reuse Recycle' placard seen on the ground during the protest outside City Hall in Kiev. Climate activists all over the globe united for the first global climate strike action of 2020 held worldwide amid the COVID-19 coronavirus pandemic. (Photo by Pavlo Gonchar/SOPA Images/LightRocket via Getty Images)Most young people aren’t Democrats, however. Pew data shows that only 31% of Millennials aged between 24 and 39 say they’re a Democrat, compared with 23% who identify as Republican. The largest bloc, 42%, say they’re Independent. Voters get slightly more conservative as they get older. “Conservatives care about conservation,” Backer says. “They're the sportsmen, they're the farmers, they’re the fishermen often times, and they need to have a voice because we need middle America and conservatives to be a part of this conversation.But he acknowledges national Republicans in Washington need to step up. “There's no way we can move forward without the Republican party taking a larger stance and a more proactive stance on climate and environmental issues.” Maybe next year?Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Biden’s worst tax ideaA business operating like the White House would be in big troubleHow Democrats can save ObamacareTrump’s health care shamTrumpworld is implodingGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}