{"article": [{"url": "https://finance.yahoo.com/news/new-york-new-jersey-and-connecticut-expand-coronavirus-travel-restrictions-191457253.html", "published": 1594131740.0, "headline": "New York, New Jersey, and Connecticut expand coronavirus travel restrictions", "body": "Connecticut, New Jersey, and New York are bent on keeping their residents healthy — even at the exclusion of nearly half of the country.On Tuesday, the tristate area expanded its mandatory 14-day self-quarantine orders to out-of-state visitors from Delaware, Kansas, and Oklahoma, bringing the total number of states affected by the travel advisory to 19.They join Alabama, Arkansas, Arizona, California, Florida, Georgia, Iowa, Idaho, Louisiana, Mississippi, North Carolina, Nevada, South Carolina, Tennessee, Texas, and Utah. Visitors from those states also must self-quarantine for 14 days if they visit Connecticut, New Jersey, or New York.People visit the beach of Sandy Hook in front of the Manhattan skyline on June 26, 2020, in Sandy Hook, New Jersey. (Photo: Kena Betancur/VIEWpress/Corbis via Getty Images)“As states around the country experience increasing community spread, New York is taking action to ensure the continued safety of our phased reopening,\" Gov. Andrew Cuomo (D-NY) said on Tuesday.On June 24, Govs. Ned Lamont (D-CT), Phil Murphy (D-NJ), and Cuomo first announced that visitors from nine states with rising COVID-19 cases were mandated to self-quarantine for 14 days upon entering the area as a way to keep the tristate’s new COVID-19 cases from rising.Three more states have been added to our travel advisory: Delaware, Kansas, OklahomaIf you're traveling to CT from the following states you need to self-quarantine for 14 days: AL, AR, AZ, CA, DE, FL, GA, IA, ID, KS, LA, MS, NC, NV, OK, SC, TN, TX, UThttps://t.co/gZjVfum7Wt— Governor Ned Lamont (@GovNedLamont) July 7, 2020Last week, another seven states were added to the travel advisory.Visitors must self-quarantine if their state has “a positive test rate higher than 10 per 100,000 residents over a 7-day rolling average” or “a 10% or higher positivity rate over a 7-day rolling average,” according to Cuomo.In other words, the travel restrictions are designed to keep visitors who are fleeing hot spots from spreading the virus where cases are falling.Story continuesIf you're traveling to New York from the following states you must self-quarantine for 14 days.The states are: AL, AR, AZ, CA, DE, FL, GA, IA, ID, KS, LA, MS, NC, NV, OK, SC, TN, TX, UT.— Andrew Cuomo (@NYGovCuomo) July 7, 2020As the summer travel season gets underway, the tristate’s natural attractions like beaches, mountains, and lakes are a draw for tourists looking to vacation and road trip. Visitors are still welcome, but only after a 14-day self-quarantine to ensure they don’t present COVID-19 symptoms.“New Yorkers did the impossible. We went from the worst infection rate in the United States to one of the best,” Gov. Cuomo said. “And the last thing we need is to see another spike of COVID-19.\"Yahoo Money sister site Cashay has a weekly newsletter.Stephanie is a reporter for Yahoo Money and Cashay, a new personal finance website. Follow her on Twitter @SJAsymkos.Read more:Coronavirus puppy scams 'seemed legit,' ensnared dog lovers amid pandemic: Illegal Tender podcastCoronavirus stimulus: Arizona Senator's $4,000 travel credit is 'one of the wackiest' ideasIllegal Tender podcast: How 'MLM' schemes turn regular lives upside downClick here for more personal finance tips, guides and newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}