{"article": [{"url": "https://finance.yahoo.com/news/the-stock-market-may-have-lost-its-mind-170959091.html", "published": 1595333840.0, "headline": "Has the stock market lost its mind?", "body": "A contentious presidential election right around the bend. A major health pandemic continuing to roil the globe and keep economic growth under severe pressure. Major companies telling investors this earnings season that things are far from great — or getting better at all.And yet in the face of all this negativity and brutal reality, the good ole stock market has galloped like a one-year-old stud back to pre-COVID-19 pandemic highs this week. It begs the question — has the stock market truly lost its darn mind? I mean sure, we have helicopter money from the Federal Reserve that encourages aggressive risk-taking by investors, but is Tesla really worth $300 billion even in such a care-free trading environment?Not many strategists on Wall Street will come right out and say “yes” in response to that aforementioned question for fear of losing business or credibility in the media. But in reading between the lines of RBC’s head of U.S. strategy Lori Calvasina’s new note to clients out Tuesday — she thinks she comes the closest to calling BS on this rip-your-face-off-rally that has shocked most folks.“Valuations are frightening, with one of our models now above tech bubble highs,” Calvasina writes.Calvasina’s valuation work underscores her take (which is a quasi market top call).As of mid-July, the S&P 500 is trading on a lofty 26 times price-to-earnings multiple (P/E) on estimated 2020 earnings. The P/E multiple on projected earnings for the S&P 500 is no less rich at 22 times. Both valuation levels — spurred in large part by hopes that extraordinary stimulus from lawmakers and the Fed unleash a V-shaped economic recovery from the pandemic — are worryingly above long-term averages, notes Calvasina.“The thing that concerns us the most on the valuation front, however, is that our bottom up combo model is now also 1.9 standard deviations above its LT average, above the 1.5 reading seen at the end of 2019, a little above it’s tech bubble high and in a range consistent with modest single digit declines in the S&P 500 over the next 12 months. U.S. equities admittedly look attractive vs. bonds, but this model is currently well below it’s post Financial Crisis average and points to limited upside from here,” Calvasina says.Story continuesAnd what are investors getting for continuing to gobble up stocks hand over fist? Well-paid executive teams at public companies saying the second half of 2020 will almost be as challenging as the first half. They are also getting very lackluster second quarter earnings.IBM and Coca-cola earningsLong struggling tech giant IBM (IBM) stepped up to the plate on Monday evening to deliver another dud of an earnings report. While investors cheered some gross margin improvement in a few segments amid a more watchful eye on costs, red flags were littered about the quarter and conference call due to the pandemic’s impact on orders. Second quarter sales fell 5.4% from the prior year. GAAP earnings from continuing operations tanked 46%.“Clients really continue to focus on mission-critical operational stability, cash preservation as any company as we were in the midst of the worst pandemic we’ve seen in quite a period of time,” IBM CFO James Cavanaugh told investors on the call.That doesn’t exactly sound like a business gaining momentum into 2021.The tune was similar at Coca-Cola (KO).Coca-Cola said Tuesday that second quarter organic revenues fell 28% from a year ago. Operating income dropped 34%. Global unit case volume is down by a mid-single digit percentage, improved from a 25% drop in April. At least Coke’s business has improved unlike IBM — but volumes being down for a consumer staples company is far from the norm. Coke seems to know as much, sending a strong signal to investors it would be looking to cut costs in the quarters ahead.Once more, that doesn’t sound like a business that plays into the bullish thesis permeating the broader stock market.“Valuations are definitely stretched,” said FBB Capital Partners president Michael Mussio on Yahoo Finance’s The First Trade.In a normal world, all these factors — from lackluster earnings to an ongoing health crisis — would warrant profit taking in stocks at the moment. Or, stocks not being at current valuations levels to begin with. Sooner or later this imbalance will correct itself...our bet is sooner, as stock prices can’t stay crazy forever.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}