{"article": [{"url": "https://finance.yahoo.com/news/tesla-launches-five-one-stock-211113121.html", "published": 1597162760.0, "headline": "Tesla sets 5-1 stock split and its high-flying stock soars again", "body": "By Noel Randewich and Munsif Vengattil(Reuters) - Tesla Inc on Tuesday announced a five-for-one stock split, sending the electric carmaker's recently high-flying shares up 7% in extended trade.Tesla's stock, which traded at $1,475 after the announcement, is among the highest priced on Wall Street, and the Palo Alto, California-based company said in a press release it was looking to make its shares more accessible to employees and investors.Tesla's stock has surged over 200% this year, while shares of General Motors and Ford Motor declined on fallout from the coronavirus pandemic.Stock splits are a way for companies to make shares more accessible to retail investors, potentially attracting individual investors who make small trades. However, brokerages increasingly let customers buy parts of shares, making the benefit of share splits less clear than in the past.Tesla said stock holders of record on Aug. 21 would receive four additional shares after the close of trading on Aug. 28, with the stock trading on a split-adjusted basis beginning Aug. 31.Tesla's stock split follows a four-for-one split announced by Apple Inc in late July, the iPhone maker's first stock split since 2014.Stock splits have become rare on Wall Street in recent years, with just three S&P 500 components announcing splits in 2020, compared with an average of 10 a year over the past decade, according to S&P Dow Jones Indices.Tesla in July posted a second-quarter profit as cost cuts and strong deliveries helped offset coronavirus-related factory shutdowns, clearing a hurdle that could lead to the carmaker's inclusion in the S&P 500 index.While many institutional investors have avoided Tesla's stock in recent years due to a lack of consistent profitability, the company has a strong following among individual investors.Over the past 30 days, Tesla was second only to Apple as the most popular stock on the Robinhood trading app, according to Robintrack, a website that tracks Robinhood holdings.Story continuesTesla's stock split should not affect S&P Dow Jones Indices' potential decision to add the company to the S&P 500, which is weighted by companies' overall stock market values.The share split will not make Tesla any less expensive in terms of actual earnings it delivers to investors. The stock currently trades at 112 times expected earnings over the next 12 months, according to Refinitiv. By comparison, GM is valued at eight times expected earnings, and Ford at 45 times expected earnings.(This story has been refiled to fix typo in headline)(Reporting by Munsif Vengattil in Bengaluru and Noel Randewich in Oakland; Editing by Leslie Adler)"}]}