{"article": [{"url": "https://finance.yahoo.com/news/netflix-reed-hastings-streaming-wars-blockbuster-120914436.html", "published": 1599895040.0, "headline": "Netflix's Reed Hastings: ‘Thank God’ Blockbuster didn’t want to buy us", "body": "It’s hard to remember a time when Netflix (NFLX) didn’t dominate the streaming industry, or the entertainment world at large for that matter. But for co-CEO Reed Hastings, who co-founded Netflix in 1997, the early years are a reminder of how much tenacity it took to survive.Hastings recounts one particularly memorable — and now memorialized — anecdote in his new book, written with leadership and culture writer Erin Meyer, “No Rules Rules: Netflix and the Culture of Reinvention.”In 2000, Hastings tried to sell Netflix to Blockbuster for $50 million and was turned away by then-CEO John Antioco.In the early-aughts, Blockbuster was widely regarded as the visionary leader in home entertainment. The behemoth popularized the video rental model on a large scale. At its peak, Blockbuster had over 9,000 stores globally. Netflix had just stepped into the scene, focusing on the DVD-by-mail space, eventually building out its streaming technology platform.When asked about getting rebuffed, Hastings said, “Well, now I say thank God that they didn't want to go ahead [with the deal]. But you know, at the time, they were so formidable and even later, when we went public, we were $50 million in revenue, and they were $5 billion, so a hundred times larger than us.”“So for our first decade, [Blockbuster] was such a big gorilla over our future. And back to the role of luck. It was a number of things that made it possible for us to thrive, and eventually then have the chance to move into streaming,” Hastings told Yahoo Finance during an episode of “Influencers with Andy Serwer,” a weekly interview series with leaders in business, politics, and entertainment.Reed Hastings, co-founder and CEO of Netflix attends the inauguration of Netflix new offices in Paris, France, January 17, 2020. REUTERS/Gonzalo Fuentes“In 1997, it was clear that the internet was growing and getting faster, and would someday be able to do television. And that’s what made me differentially confident that you could do DVD by mail for a couple years and then evolve into streaming,” added Hastings.Today, Netflix has a market cap of $223.5 billion, with 193 million paid subscribers devouring its content across 190 countries. While Hastings has cited competition from its counterparts like Apple+ (AAPL), HBO Max (T), Hulu and Disney+ (DIS), along with unconventional players like TikTok and sleep, the iconic brand remains the shiny gem in the streaming arena. Over the last few years Netflix has clinched exclusive deals with the likes of Shonda Rhimes, the Obamas, and most recently, Prince Harry and Meghan Markle.Story continuesMeanwhile, Blockbuster has dwindled into a nostalgic relic of the past. Today, the world’s last remaining Blockbuster in Bend, Ore., has been turned into a gimmick on Airbnb. Deschutes County residents who find it “impossible to forget the feeling, smells, and sounds of a Blockbuster store’s possibility-filled aisles,” can pay four dollars to have a slumber party in the store. The three individual, one-night reservations available on September 18, 19 and 20 have been booked.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Slack misses expectations on quarterly billings, stock plummets‘Mulan’ producer on boycott threats: ‘I feel badly...the conversation turns to this’What Silicon Valley still doesn't understand about its diversity problemSerial tech entrepreneur launches ambitious alternative to school: 'It's a very progressive approach to education''People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talent"}]}