{"article": [{"url": "https://finance.yahoo.com/news/harvard-and-mit-sue-ice-over-new-visa-guidelines-for-international-students-144218326.html", "published": 1594201820.0, "headline": "Harvard and MIT sue ICE over new visa guidelines for international students", "body": "Harvard and the Massachusetts Institute of Technology have filed a lawsuit against the Trump administration over a new visa policy announced on Monday.The lawsuit seeks to get a temporary restraining order, and a preliminary and permanent injunctive relief, that would prevent the Department of Homeland Security and U.S. Immigration and Customs Enforcement (ICE) from removing foreign students if their universities are not holding in-person classes this fall. The lawsuit was filed in the U.S. District Court for Massachusetts. Cornell, Dartmouth and Princeton have also announced that they are supporting Harvard and MIT’s lawsuit.“The effect—and perhaps even the goal—is to create as much chaos for universities and international students as possible,” the lawsuit stated.New federal guidelines presented a difficult choice to universities across America: Either they reopen their schools and do not teach entirely remotely, or have their international students be deported.The new rule by the administration blindsided universities, already reeling financially and logistically from the COVID-19 pandemic that has yet to end.A person wears a mask while walking though MIT's campus in Cambridge, MA on March 10, 2020. (PHOTO: Erin Clark for The Boston Globe via Getty Images)ICE on July 6 announced that it was making changes to how it treated international students with F-1 and M-1 visas. Even though the coronavirus pandemic has shuttered schools, if a student is taking an entirely online course, they cannot remain in the U.S., unless they transfer to a school with in-person instruction “to remain in lawful status.”If they fail to do so, “they may face immigration consequences including, but not limited to, the initiation of removal proceedings,” ICE said.But if the school is offering a hybrid model — both in-person and online education — they’ll be allowed to take more than one class online, but the school needs to certify their status to the government.Only 8% of colleges have thus far planned for a completely online fall semester — and 2.1% are “waiting to decide,” according to data compiled by the Chronicle of Higher Education.Story continuesA student wearing a mask walks through the Yard at Harvard University, on March 10, 2020. (PHOTO: REUTERS/Brian Snyder)‘Cruelty surpassed only by its recklessness’The rule was announced by ICE only a few hours after Harvard released its new guidance on going fully remote.“The order came down without notice—its cruelty surpassed only by its recklessness,” Harvard University President Lawrence S. Bacow said. “We believe that the ICE order is bad public policy, and we believe that it is illegal.”Massachusetts Attorney General Maura Healey also announced her intent to sue over the guidelines on Tuesday night. (A request for an update on Wednesday has not been responded to.)Harvard and MIT stated in the lawsuit: “ICE’s action proceeded without any indication of having considered the health of students, faculty, university staff, or communities; the reliance of both students and universities on ICE’s statements that the preexisting exemptions would be ‘in effect for the duration of the emergency’ posed by the COVID-19 pandemic, which continues to this day; or the absence of other options for universities to provide their curricula to many of their international students.”The schools also alluded to the fact that the federal government was forcing schools to reopen, even though they were worried about the public health and safety risk given the pandemic was still ongoing.“By all appearances, ICE’s decision reflects an effort by the federal government to force universities to reopen in-person classes, which would require housing students in densely packed residential halls, notwithstanding the universities’ judgment that it is neither safe nor educationally advisable to do so, and to force such a reopening when neither the students nor the universities have sufficient time to react to or address the additional risks to the health and safety of their communities,” the lawsuit stated.ICE told Yahoo Finance that it’s “unable to provide further comment due to pending litigation.”Ken Cuccinelli, acting deputy secretary of DHS, defended the new rules as giving schools more “flexibility” on CNN on Tuesday.Acting Deputy DHS Secretary Ken Cuccinelli defends forcing international students to leave US if classes go online: “This is now setting the rules for one semester, which we'll finalize later this month that will, again, encourage schools to reopen” https://t.co/fiSJbj2xuO pic.twitter.com/tj5I7Fldts— CNN Politics (@CNNPolitics) July 7, 2020‘They do not want us’Meanwhile, students waiting to start their college experience in American universities wait in limbo as visa processing delays push back their leave date.One international student waiting for her visa in the UK said she had about a week to secure the visa to study in the U.S. Unless exemptions were made, she would not be able to come to the U.S. on an F1.“I know others are offering flights back to the country or making the visa more flexible,” said the student, who wanted to remain anonymous. “The U.S. government is making it clear that they do not want us.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:‘Higher ed is getting hit from all sides right now’: Colleges reel from new immigration announcement'We've really had to tighten our belt': Cornell pushes ahead with reopening planSchools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}