{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-college-classess-campus-211709998.html", "published": 1597767920.0, "headline": "Coronavirus: Universities begin U-turns as campus life brings outbreaks", "body": "Some notable universities that spent time and resources planning to reopen campuses amid the coronavirus pandemic are now backtracking as COVID-19 cases surge among students.On Tuesday, Notre Dame announced that “in-person classes for the university’s nearly 12,000 students are suspended, effective Wednesday, replaced by remote instruction only for the next two weeks because positive rates for the coronavirus continue to climb.” The school saw a spike in COVID-19 cases despite testing students before resuming in-campus instruction.Also on Tuesday, Michigan St. pivoted to online-only classes days before students were set to return and the University of Pennsylvania shut down its dorms to most students and moved classes to online amid coronavirus concerns.“Who is to blame? The primary fault here lies in the POTUS and Congress for not handling the pandemic properly,” Sara Goldrick-Rab, professor of sociology and medicine and founding director at the Hope Center for College, Community, and Justice at Temple University, told Yahoo Finance. “With a real lockdown in spring, we wouldn’t be here right now.”Freshman students at the University of North Carolina at Chapel Hill discuss their frustrations with housing on August 18, 2020 in Chapel Hill, North Carolina. (Photo: Melissa Sue Gerrits/Getty Images)The University of North Carolina at Chapel Hill started classes for just a week before it made the decision to shut down on Monday after a “significant rise” in COVID-19 infections among its students.“We all saw this coming,” student newspaper The Daily Tar Heel’s editorial board wrote in an opinion piece.Many colleges initially planned to open campuses for in-person classes, betting on the fact that the coronavirus wouldn’t massively disrupt campus safety. But by the beginning of August, that number had dwindled considerably — though hundreds of schools pushed forward with campus re-openings.Goldrick-Rab stressed that students should not be blamed for any outbreaks.“People are people — they congregate,” she said, adding: “It’s the job of government and public health experts to structure the situation so they can’t or aren’t at risk when doing so.\"Story continuesAs of July 30, more than 690 college planned for bringing students back to campus for fall classes. (David Foster/Yahoo Finance)‘The university seems to practically want people to get sick’Fraternity and sorority activities, as well as parties unrelated to Greek life, seem to be potential hotspots.At Oklahoma State University, 23 members of a sorority house tested positive for coronavirus. At the University of Washington, 15 out of 25 frat houses contained the virus, affecting 165 students at least.At Ball State University in Indiana, one student who lives beside a frat house said that she’s noticed four parties since she moved in next to them two weeks ago.“The main reason it bothers me is because my college … has a horrible plan in terms of COVID prevention, and most responsibility has been placed on students,” she told Yahoo Finance. \"I recognize that we’re all adults and are all old enough to be responsible, but the university seems to practically want people to get sick.”A student studies in an open-air seating area on the campus of the University of North Carolina at Chapel Hill on August 18, 2020 in Chapel Hill, North Carolina.(PHOTO: Melissa Sue Gerrits/Getty Images)The junior journalism-graphics major, who chose to be anonymous for fear of retribution from the frat house, added the the largest party involved around 30 to 40 people gathering. The university did not respond to request for comment.On the UNC Greensboro campus, 19-year-old political science major Laura Comino said that parties, recruiting events, and other events involving potentially close contact are still a reality.\"I live in an apartment building that's owned by the university, and the first thing I saw moving in was a billboard that says coronavirus is real with a poop emoji,” Comino said (photo below). “And it makes me feel [like]: Well, if you feel that you have to put up those billboards and ... if my professors have to wear masks while they lecture, is it really safe for us to be on campus?”(PHOTO: Laura Camino)Comino considered moving off campus, but decided against signing a lease after considering the uncertainty of whether the school would be open for long.“I feel like I'm an intruder and I really shouldn't be here,” she added.At the University of North Georgia, a video circulated on social media revealing hundreds of people at an off-campus party. At the same time, 18-year-old University of Georgia students Maggie Mitchell and Zainub Ali are trying to figure out how they would avoid losing more than $3,000 if they move out of their apartments.“Classes start on the 20th … and I honestly am not positive if some of my classes are going to be in-person because a lot of my professors still haven't reached out,” Mitchell said, adding that the entire situation has been “very stressful.”Students wear protective masks as they wait in line at a testing site for the coronavirus disease (COVID-19) set up for returning students, faculty and staff on the main New York University (NYU) campus in Manhattan, New York City, New York, U.S., August 18, 2020. REUTERS/Mike Segar‘We have enough information about what this is and how it spreads’There are colleges that haven’t bungled the fall semester.Goldrick-Rab cited Michael Sorrell, president of Paul Quinn College, a historically Black university in Texas, as an example of reopening done right while some college leaders “put money over safety of their students, staff, and faculty.”Sorrell, who made the call to skip in-person classes in July, told Inside Higher Ed that preventing the spread of coronavirus on campus was too onerous a task.\"We have enough information about what this is and how it spreads,” he said of the decision. “On top of that, I think it’s fascinating people acted as if they didn’t know their own student populations. How does anyone purport to police the social engagements of 18- to 25-year-olds?”Dear Higher Ed:There is absolutely no way to consistently control, regulate, police - or whatever term you choose - the social engagement of 18-25 year olds on most college campuses. You have to know that. That is a big reason why in-person learning cannot work right now.— Michael Sorrell (@michaelsorrell) August 18, 2020A lack of funding for public education, Goldrick-Rab noted, forced colleges to choose between public safety and avoiding bankruptcy since schools make a significant portion of their incomes through housing and food.“They are leaning on those areas to balance their budgets — at the publics that’s because of state defunding,” she said, adding that schools without sizable endowments “are deciding to close only after realizing they have no choice.”—Aarthi Swaminathan is a reporter for Yahoo Finance covering education. If you have a story idea, or would like to share how your college or school is preparing to reopen, reach out to her at aarthi@yahoofinance.comRead more:Coronavirus: Some college students returning to campus are being met with liability waiversSchools buy miles of plexiglass ahead of potential reopenings amid coronavirus pandemicThe American teacher crisis is getting rapidly worse amid coronavirus pandemicRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn,YouTube, and reddit."}]}