{"article": [{"url": "https://finance.yahoo.com/news/apple-store-closing-coronavirus-164843581.html", "published": 1592567780.0, "headline": "Apple to close retail stores in 4 states amid coronavirus spikes", "body": "Apple (AAPL) is temporarily shuttering stores again in U.S. states where COVID-19 cases have been spiking in recent weeks. The company confirmed the move to Yahoo Finance via an emailed statement saying that the company is closing its retail stores beginning June 20 out of an abundance of caution.The stores to be closed are in Arizona, Florida, North Carolina, and South Carolina, four states that are seeing the highest seven-day average of new coronavirus infections since the pandemic took root in the U.S.“Due to current COVID-19 conditions in some of the communities we serve, we are temporarily closing stores in these areas,” Apple said in a statement provided to Yahoo Finance.An employee wearing a protective face covering, right, monitors the flow of customers at an Apple retail store along Lincoln Road Mall during the new coronavirus pandemic, Wednesday, June 17, 2020, in Miami Beach, Fla. (AP Photo/Lynne Sladky)“We take this step with an abundance of caution as we closely monitor the situation and we look forward to having our teams and customers back as soon as possible.”Apple shut all of its stores across the world during the coronavirus pandemic, initially focusing on China, where the virus first appeared. By the time the outbreaks began to subside there and Apple was opening its stores in the country, the virus had spread to other regions, forcing Apple to shutter all stores outside of mainland China.Apple has been one of the first movers in closing its stores, allowing it to serve as a kind of indicator of conditions in regions impacted by the virus. There’s no word yet as to how long the stores will be closed or when they’ll be reopened.Here’s a list of the stores that Apple is closing:Florida- Waterside Shops- Coconut PointNorth Carolina- Southpark- Northlake MallSouth Carolina- Haywood MallArizona- Chandler Fashion Center- Scottsdale Fashion Square- Arrowhead- SanTan Village- Scottsdale Quarter- La EncantadaThere are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Why Microsoft and Amazon are calling on Congress to regulate facial recognition technologyThe PlayStation 5’s most important feature will be its price5 Father’s Day tech gifts: Tech SupportApple could still go higher after hitting $1.5 trillion: AnalystFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}