{"article": [{"url": "https://finance.yahoo.com/news/robust-pipeline-of-companies-set-to-come-to-markets-nyse-official-125655655.html", "published": 1593158660.0, "headline": "'Robust pipeline' of companies set to come to markets: NYSE official", "body": "The IPO market is starting to broaden as more companies from different industries throw their hats into the ring to go public in 2020.“There’s a strong pipeline of companies from ... a broader group of sectors set to come to market,” John Tuttle, vice chairman and chief commercial officer of the New York Stock Exchange, told Yahoo Finance’s The First Trade.On Friday grocery giant Albertsons will go public on the NYSE under the ticker symbol “ACI.” Albertsons, which includes chain names like Vons, Safeway and Acme, is debuting when demand for grocery products in the U.S. is high, as consumers cook more at home during the pandemic.Albertsons store in Ridgecrest, California. It is a US grocery store company with 2,205 locations, owned by Cerberus Capital Management.Kickstarting the IPO marketCompanies have so far received a warm welcome as they entered the public markets this year, following a sharp rebound in equities from the market meltdown in March.“We started seeing the IPO market really come back in late April when SPACs, or special purpose acquisition companies, came to market. For those it's pretty simple for investors to value them. They have a two year or so horizon to go out and make an acquisition. That's what really kickstarted the IPO market,” said Tuttle.He continued, “We saw healthcare companies and other sectors start to come to market as well. And now we have a robust pipeline of companies that are set to come to market between now and the end of summer.”Investors will be watching the debut of Dun & Bradstreet, a provider of commercial data analytics, among the companies expected to go public as soon as next week. The company plans to offer close to 65.8 million shares at a price range of $19 to $21 each.Lemonade, a Softbank-backed platform for renters and homeowner insurance, is also expected to go public offering 11 million shares at a range of $23-26 dollars per share.Tuttle says companies going public will likely avoid the fall due to the possibility of volatility surrounding the U.S. presidential election.“Part of going public, whether it's through an IPO, a direct listing or a SPAC combination, or any other way is you want to de-risk as much as possible — and that's market risk, that's pricing risk, but that's also political risk and uncertainty. So we do have a strong pipeline of companies through the end of the year. They're obviously going to move either ahead or behind that election period, “ added Tuttle.Story continuesInes covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreCrude supply 'dwarfed' by cuts in demand: oil watcherThere's a risk of a lost decade here:' former IMF adviserDon't expect shale to rise like a 'phoenix from the ashes': Oil expertThree reasons why things are looking up for homebuilder LennarFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}