{"article": [{"url": "https://finance.yahoo.com/news/trump-biden-presidential-debate-adds-new-political-hurdle-worse-than-average-time-for-stock-market-115812373.html", "published": 1601449580.0, "headline": "Trump-Biden debate adds 'new political hurdle' and could mean more volatility for stocks", "body": "A political dumpster fire during the first presidential debate night paves the way for a rougher than normal patch for the stock market in the lead-up to the election.After a raucous, backyard brawl of a shouting match Tuesday night between President Donald Trump and challenger and former Vice President Joe Biden, stock futures fell sharply across the board on Wednesday. Dow Jones Industrial Average futures (YM=F) dropped more than 200 points at one point, while selling pressure extended to the S&P 500 (ES=F) and Nasdaq Composite (NQ=F).Up and down Wall Street the mood is that the debate calls into question the timing of when the election may be decided, the polarized nature in the country right now and whether a new fiscal relief plan could get passed amid such a debacle of an evening.In other words, here comes a new spate of market volatility.“Futures are lower amid rising concerns that the outcome of the presidential election may be contested following last night’s debate while there has been little to no progress on fiscal stimulus (at home or abroad) in the face of quickly rising new COVID-19 cases,” remarked Sevens Report Research founder Tom Essaye in an early morning note to clients.Said Raymond James Washington policy analyst Ed Mills, “There have been glimmers of optimism this week on a next fiscal relief package, following the release of a $2.2 package by House Democrats and conversations between Speaker Pelosi and Treasury Secretary Mnuchin. It is a positive sign that these conversations continue, but this debate will add a new political hurdle.”Volatility in markets after the first presidential debate is nothing new.U.S. President Donald Trump and Democratic presidential nominee Joe Biden participate in their first 2020 presidential campaign debate held on the campus of the Cleveland Clinic at Case Western Reserve University in Cleveland, Ohio, U.S., September 29, 2020. REUTERS/Jonathan ErnstLooking at the first presidential debates from 1960 to 2016, data from LPL Financial shows the S&P 500’s total return has declined five-days, 10 days and one-month on average after the initial debate. The worst decline comes in the one-month measurement period to the tune of 2% on average.Story continuesThe title for worst post first presidential debate period for the S&P 500 goes to the Sept. 26, 2008 debate between then-Senators John McCain and Barack Obama. The S&P 500 — already under fire from the Great Recession — dropped 8.8% the next day, according to LPL Financial. One month after that debate, the S&P 500 was some 30% lower.As for the best run for the S&P 500 after the first presidential debate, that award goes to the Oct. 11, 1992 showdown between then-sitting President George H. W. Bush and then-Governor Bill Clinton. Stocks rose 1.2% the next day, and went onto climb by 4% over the next month.At this moment, it’s looking like a watered down version of the McCain/Obama debate circa 2008 for the markets. The savings grace this time around: there is no financial crisis playing out.Warns Essaye, “Bottom line, investors will remain focused on two main factors today: 1) Will speaker Pelosi and Treasury Secretary Mnuchin pull off a last minute stimulus deal before the election (not expected)? And 2) what are the chances the presidential election is contested (the higher the chances the more negative for markets)?”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.What’s hot this week from Sozzi:Peloton’s biggest rival just raised a ton of money from the likes of Stephen CurryHome Depot co-founder and Atlanta Falcons owner gives his best advice to new NY Mets ownerPeloton founder: here’s one of my biggest 15 year goalsVitamin Shoppe CEO: the pandemic has changed our businessKraft Heinz CEO: Buffett’s team like our $3.2 billion dealKroger CEO: this is how we see the future of food shoppingWatch Yahoo Finance’s live programming on Verizon FIOS channel 604, Apple TV, Amazon Fire TV, Roku, Samsung TV, Pluto TV, and YouTube. Online catch Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, and reddit."}]}