{"article": [{"url": "https://finance.yahoo.com/news/amc-theatres-now-begin-reopening-180500628.html", "published": 1593436400.0, "headline": "AMC Theatres Now to Begin Its Reopening of U.S. Theatres on Thursday, July 30", "body": "AMC will resume theatre operations at approximately 450 U.S. locations on Thursday, July 30, and at approximately 150 remaining locations the following week in time for a theatrical slate commencing in August that appeals to audiences of every segmentSlight pushback by two weeks of the U.S. dates takes into account the newly scheduled release dates of Disney’s MULAN and Warner Bros.’ TENETAMC currently expects that at least some theatres in all the 14 countries in which AMC operates outside the U.S. will have opened by July 30 as well, with a full global opening of theatres completed by early AugustAMC Theatres (NYSE:AMC, \"AMC\" or the \"Company\"), the largest theatrical exhibition company in the United States, in Europe & the Middle East, and the world, today announced a new U.S. reopening date of July 30, when it will resume operations of 450 U.S. theatres as part of a phased plan that is expected to bring the 600-plus U.S. theatre circuit essentially to full operation by early August.The new reopening date aligns with updated release timing for major theatrical blockbusters Warner Bros’ TENET (August 12) and Disney’s MULAN (August 21). AMC is also excited to offer movie-goers a broad selection of other new releases in July and August, including Solstice’s action thriller UNHINGED (July 31), Sony’s romantic comedy THE BROKEN HEARTS GALLERY (August 7), A24’s psychological horror film SAINT MAUD, Disney/Marvel’s action fantasy film NEW MUTANTS (August 28), Picturehouse’s inspirational drama FATIMA (August 28), Orion’s comedy BILL AND TED FACE THE MUSIC (August 28), and others. Additionally, Warner Bros. will celebrate the 10th anniversary of Christopher Nolan’s INCEPTION with a re-release on July 31st. Once the U.S. reopening commences, AMC will have theatres open in all 15 countries in which AMC operates. Theatres in all 14 countries AMC serves in Europe and the Middle East either opened in June or are planned to open in July as well. Barring further complications from the coronavirus outbreak, AMC expects to be open at essentially its full complement of approximately 1,000 theatres globally by early August.Story continuesAdam Aron, CEO & President, AMC Theatres said, \"We continue to devote extraordinary resources into our plan to operate our theatres with a hyper commitment to the safety and health of our guests and associates, notably in the United States through our new AMC Safe & Clean initiative. Our theatre general managers across the U.S. started working full time again today and are back in their theatres gearing up to get their buildings fully ready just a few weeks from now for moviegoers. That happy day, when we can welcome guests back into most of our U.S. theatres, will be Thursday, July 30.\"About AMC Entertainment Holdings, Inc.AMC is the largest movie exhibition company in the United States, the largest in Europe and the largest throughout the world with approximately 1,000 theatres and 11,000 screens across the globe. AMC has propelled innovation in the exhibition industry by: deploying its Signature power-recliner seats; delivering enhanced food and beverage choices; generating greater guest engagement through its loyalty and subscription programs, web site and mobile apps; offering premium large format experiences and playing a wide variety of content including the latest Hollywood releases and independent programming. AMC operates among the most productive theatres in the United States' top markets, having the #1 or #2 market share positions in 21 of the 25 largest metropolitan areas of the United States. AMC is also #1 or #2 in market share in 9 of the 15 countries it serves in North America, Europe and the Middle East. For more information, visit www.amctheatres.com.View source version on businesswire.com: https://www.businesswire.com/news/home/20200629005730/en/ContactsMEDIA CONTACT Ryan Noonan, (913) 213-2183rnoonan@amctheatres.com"}]}