{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-25-2020-223407425.html", "published": 1598368280.0, "headline": "Stock market news live updates: S&P 500, Nasdaq eke out record closing highs", "body": "Stocks closed at record levels Tuesday after each of the S&P 500 and Nasdaq touched yet another record intraday high earlier in the session. A closely watched index tracking US consumer confidence unexpectedly deteriorated in August to a fresh pandemic-era low, cooling hopes for an extended rebound in consumer spending trends.[Click here to read what’s moving markets heading into Wednesday, August 26] Earlier in the day, investor optimism had been stoked by signs that terms of an early-phase US-China trade deal would remain intact despite rising tensions elsewhere between the two countries.Officials from both Washington and Beijing “see progress and are committed to taking the steps necessary to ensure the success” of the Phase One trade agreement signed between the two nations in January this year, according to a statement from the Office of the US Trade Representative Monday night. This came after U.S. Trade Representative Robert Lighthizer, Treasury Secretary Steven Mnuchin and Chinese Vice Premier Liu He met via videoconference for a formal review of the multi-part agreement, which had helped bring a two-year trade war between the two nations to a ceasefire.Contracts on the three major indices initially rallied following the news. The Dow’s regular-session declines came as shares of current components including Exxon Mobil, Pfizer and Raytheon Technologies each sank following news that each would be replaced in the 30-stock index next week.After market close on Monday, S&P Dow Jones Indices announced that three new companies would be joining the Dow Jones Industrial Average, effective before market open on Monday, Aug. 31. Salesforce.com (CRM) is set to replace Exxon Mobil (XOM), with the oil major having been an index component for nearly a century. Honeywell International (HON) will replace Raytheon Technologies (RTX) and Amgen (AMGN) will replace Pfizer (PFE). Each of the companies joining the index added about 4% in late trading, while those exiting the index declined.Story continuesMeanwhile, a handful of software companies filed to go public on Monday, as investor appetite for risk assets – and tech stocks with high-growth potential especially – remained elevated. Among the companies filing was Snowflake, a cloud data platform expected previously speculated to go public this year, following a funding round that valued it at $12.4 billion in February. The company, while unprofitable, posted revenue growth that more than doubled over last year. Other software companies that filed their go-public prospectus on Monday included Unity Software, Sumo Logic and JFrog.Looking ahead to Tuesday, earnings season will continue with publicly traded software names Autodesk (ADSK), Salesforce (CRM) and Intuit (INTU) poised to report quarterly results after market close.—4:02 p.m. ET: S&P 500, Nasdaq eke out record closes as tech shares gain; Amazon hits highest-ever levelHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): +12.39 (+0.36%) to 3,443.67Dow (^DJI): -59.78 (-0.21%) to 28,248.68Nasdaq (^IXIC): +86.75 (+0.76%) to 11,466.47Crude (CL=F): +$0.71 (+1.67%) to $43.33 a barrelGold (GC=F): -$5.10 (-0.26%) to $1,934.10 per ounce10-year Treasury (^TNX): +3.6 bps to yield 0.6820%—12:12 p.m. ET: American Airlines set to cut 19,000 jobs after US federal aid expiresAmerican Airlines (AAL) is set to slash 19,000 workers after federal payroll aid expires for the company and other US airlines on Oct. 1, according to a securities filing Tuesday.Of the jobs expected to be cut, approximately 17,500 employees are set to be furloughed and could be called back once industry conditions improve. The remaining 1,500 will comprise cuts to management. Air passenger throughout remains down by about 70% over last year, according to TSA data.Shares of American Airlines fell 4% in intraday trading, and peers including United Airlines and Delta Air Lines also sank.—10:00 a.m. ET: Consumer Confidence unexpectedly falls for a second straight month in August, hitting lowest level in six yearsThe three major indices turned lower Tuesday morning after The Conference Board’s Consumer Confidence Index for August unexpectedly declined to a fresh pandemic-era low, taking out the previous low from April.The headline index came in at 84.8 in August, down from a revised 91.7 in July, according to the report. That marked the lowest reading since 2014. Consensus economists expected the confidence index to rise to 93.0 in August. A subindex tracking consumer expectations fell 3.7 points to 85.2, and another tracking sentiment around current conditions slid 11.7 points to 84.2.The percentage of consumers expecting business conditions will improve over the next six months declined to 29.9% from from 31.6%. Those expecting business conditions would worsen ticked up slightly to 20.5%.“Consumers’ optimism about the short-term outlook, and their financial prospects, also declined and continues on a downward path,” Lynn Franco, senior director of economic indicators at the Conference Board, said in a statement. “Consumer spending has rebounded in recent months but increasing concerns amongst consumers about the economic outlook and their financial well-being will likely cause spending to cool in the months ahead.”—9:55 a.m. ET: Best Buy, Hormel, JM Smucker report estimates-topping quarterly resultsBest Buy (BBY), Hormel (HRL) and JM Smucker (SJM) added to a hefty batch of companies reporting quarterly results that beat consensus expectations this earnings season.Best Buy posted adjusted earnings of $1.71 per share on revenue of $9.91 billion, with each of these better than the $1.05 per share in adjusted earnings on sales of $9.78 billion expected. CEO Corie Barry said in a statement, “products that help people work, learn connect and cook at home, like computing appliances and tablets, were the largest drivers of our sales growth for the quarter.” Barry added that that enterprise sales growth was about 16% in the last seven weeks of the second quarter after the company opened our stores. Growth accelerated into August, with sales up approximately 20% for the first three weeks of the third quarter.Hormel’s fiscal third-quarter net sales of $2.38 billion represented a quarterly record, as ongoing strength in its retail business was supplemented by a pick-up in its foodservice business as restaurants and other businesses reopened. Looking ahead, CEO Jim Snee said in a statement this morning he expects the fourth quarter will mirror the trends seen in the fourth quarter in terms of the strength of the retail and grocery business and recovery in foodservice. He added, however, that “the magnitude of additional recovery in the foodservice industry, the performance of the entire food supply chain and the state of the broader economy remain highly uncertain.\"JM Smucker posted top- and bottom-line results that also topped expectations, with adjusted earnigs of $2.37 per share well above the $1.68 expected. The company got a boost from increased at-home consumption, said that the coffee and consumer foods portfolios were especially strong during the quarter, with consumer foods’ profit up 62%. JM Smucker raised its guidance and now sees net sales increasing by as much as 1% for the full year, versus a previous outlook for a decline of between 1% and 2%—9:50 a.m. ET: Stocks drift near record levelsHere’s where the three major indices traded shortly after market open Tuesday:S&P 500 (^GSPC): +3.71 points (+0.11%) to 3,434.99Dow (^DJI): -21.62 points (-0.08%) to 28,286.84Nasdaq (^IXIC): +6.05 points (+0.05%) to 11,385.77—7:25 a.m. ET Tuesday: Stock futures jump as trade optimism buoys marketsHere were the main moves in markets, as of 7:25 a.m. ET:S&P 500 futures (ES=F): 3,442.5, up 15.25 points or 0.44%Dow futures (YM=F): 28,439.00, up 200 points, or 0.71%Nasdaq futures (NQ=F): 11,639.5, up 3.25 points, or 0.03%Crude (CL=F): +$0.11 (+0.26%) to $42.73 a barrelGold (GC=F): -$4.90 (-0.25%) to $1,934.30 per ounce10-year Treasury (^TNX): +4.1 bps to yield 0.687%—6:21 p.m. ET Monday: Stock futures drift sidewaysHere were the main moves in equity markets, as of 6:21 p.m. ET:S&P 500 futures (ES=F): 3,427.75, up 0.25 points or 0.01%Dow futures (YM=F): 28,230.00, down 9 points, or 0.03%Nasdaq futures (NQ=F): 11,639.25, up 3 points, or 0.03%A trader works on the floor at the New York Stock Exchange (NYSE) in New York City, U.S., November 30, 2018. REUTERS/Brendan McDermid—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}