{"article": [{"url": "https://finance.yahoo.com/news/why-apple-has-less-to-fear-from-antitrust-regulators-than-facebook-google-and-amazon-152744932.html", "published": 1596450920.0, "headline": "Why Apple has less to fear from antitrust regulators than Facebook, Google, and Amazon", "body": "Last week, the CEOs of Facebook, Amazon, Apple, and Alphabet spent a day in front of their computer cameras getting grilled by members of Congress on their use of data, their privacy policies, and their competitive practices—all in the name of antitrust concerns.The next day, all four companies reported their Q2 earnings, all four smashed Wall Street expectations, and their stocks soared. Apple and Facebook hit 52-week highs, and by the end of the week Apple surpassed Saudi Aramco as the world’s most valuable company by market cap.In other words, despite lingering complaints over their size, their privacy policies, and their use of customer data, and despite a global pandemic, the Big Four in tech surge ahead, unbothered.And Apple (AAPL), in particular, has reason to be the most unbothered of the four when it comes to lawmakers threatening antitrust action.“Apple is probably the least obvious for antitrust [violations], because the primary asset of Apple, one could argue, is its brand, and then it becomes a question of which company has domain over the brand,” says NYU marketing professor Scott Galloway, author of the 2017 book “The Four,” about Amazon, Apple, Facebook, and Google.Galloway points out that when it comes to three of the Big Four, and Facebook (FB) in particular, it’s easy to point to major acquisitions or huge business that lawmakers could force the company to sell off.Facebook has Instagram (acquired for $1 billion in 2012) and WhatsApp (acquired for $19 billion in 2014). Google has YouTube (bought for $1.65 billion in 2006), Fitbit (bought for $2.1 billion last year) and Google Cloud. Amazon has Amazon Web Services (the profit engine of the company) and Fulfillment by Amazon (FBA, quietly becoming a logistics juggernaut). “So there’s nine companies from three,” Galloway says.”In Apple’s case, there aren’t readily obvious parts that look competitively unfair and could exist as big businesses separately from Apple. The company’s biggest acquisition was Beats By Dre, for $3 billion in 2014, a hardware division that rarely gets called out as any unfair advantage for Apple.Story continuesApple CEO Tim Cook speaks via video conference during the House Judiciary Subcommittee on Antitrust, Commercial and Administrative Law hearing on Online Platforms and Market Power in the Rayburn House office Building, July 29, 2020 on Capitol Hill in Washington, DC. (Photo by Graeme Jennings-Pool/Getty Images)Of course, none of that is to say Apple doesn’t raise regulatory alarms for lawmakers in other ways.Apple CEO Tim Cook got grilled by Congress on a separate regulatory issue: Apple’s App Store and recent furor over the fees it charges other companies to list their apps there (30% in an app’s first year, 15% after that). Earlier in July, leading up to the hearings, Microsoft reportedly lodged complaints in Washington with Apple’s App Store practices. Many other small tech companies, most recently the new email app Hey, have aired their grievances with Apple’s fees. (There’s also “Batterygate,” a class action lawsuit accusing Apple of designing its iPhone batteries to drain on older models to push people to upgrade.)“I would argue that Apple is more about regulation than it is about antitrust,” says Galloway, “specifically around the App Store, when you have a duopoly that controls the rails and they can tax any company they want 30% in this app economy.”Cook defended the App Store in response to a question from Rep. Hank Johnson (D-GA) on Wednesday, making the case that the App Store has helped third-party apps by giving them a platform they never had before. “Apple’s commissions are comparable or lower than commissions charged by the majority of our competitors,” he said. “And they are vastly lower than the 50 to 70% that software developers paid to distribute their work before we launched the App Store.”Even though Apple may not represent obvious antitrust issues to the extent that Facebook or Alphabet does, Galloway believes regulation is coming. (Many others are far more skeptical.)“After watching the hearings, I thought again, this is the beginning of the end of big tech as we know it,” he says. “I think America has a proud legacy of antitrust when any one company gets so powerful that it begins to cut off the oxygen to a sector and the rest of the economy. We go in and we oxygenate the economy by breaking that firm up.”—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers tech. Follow him on Twitter at @readDanwrite.Read more:Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’Facebook ad boycott is 'more noise than fundamental risk': Jefferies analystGoya Foods faces consumer boycotts after CEO praises TrumpWarner Bros’ indefinite delay of ‘Tenet’ is major blow to movie theatersCoronavirus is forcing Quibi, NBC Peacock to change their plans at launchCoronavirus puts 'extreme pressure' on all three pillars of Disney's businessMovie theaters seek bailout as coronavirus devastates business"}]}