{"article": [{"url": "https://finance.yahoo.com/news/the-best-gadgets-for-the-beach-and-pool-tech-support-163738047.html", "published": 1594381520.0, "headline": "The best gadgets for the beach and pool: Tech Support", "body": "Welcome to Tech Support, a segment where I, Dan Howley, serve as your intrepid guide through the sometimes confusing, often frustrating, world of personal technology.Here, I answer all of your most pressing questions about the various gizmos, gadgets, and services you use in your everyday life.Have a question of your own? Reach me on Twitter at @danielhowley or email me at dhowley@yahoofinance.com.Now, on to your questions. This week's dilemma:“What’s the best tech to take to the beach or pool?”It’s summertime, and if you’re able to get to the beach, or just want to hangout at your backyard pool, there are plenty of gadgets that you’ll likely want to bring along with you. But water and sand don’t really mix very well with our favorite tech toys.Thankfully, there are still a number of speakers, headphones, and e-readers out there that can handle taking a dip, and more, and keep on ticking. These are some of the top gadgets you can take on your trip to the beach or the pool.Waterproof speaker — UE Wonderboom 2The UE Wonderboom 2 is a waterproof speaker than can float and withstand drops of up to 5 feet. (Image: UE)Ultimate Ears’ (LOGI) Wonderboom 2 speaker costs you $99 and promises up to 13 hours of battery life from its compact design, though The Wirecutter says it’s more like 8 hours. Waterproof and dust proof, the circular speaker is buoyant enough to float in your pool, so you don’t have to worry about taking a dive to grab it if it slips in.UE says the Wonderboom 2 can survive drops as high as 5 feet, meaning even if it takes a tumble, it’ll keep rocking.If you’re looking for something more powerful, and expensive, you can also opt for the Sonos Move. Starting at $399, the Move can handle dust and mists of water, but you can’t submerge it like the Wonderboom 2. But if you want impressive audio, and have the money to burn, the Move is a solid option.Water resistant earbuds — AirPods ProApple's AirPods Pros are both sweat and water resistant, making them great for listening while laying out in the sun. (Image: Apple)If you just want to relax at the pool, or on the sand, and, like me, don’t want everyone around you to hear your awful taste in music, you’ll want to get a pair of water resistant headphones. And for my money, the best pair around are Apple’s (AAPL) AirPods Pro. At $249, they’re a bit pricey, but the performance and sound quality are fantastic.Story continuesAnd if you’re tired of listening to the couple 6 feet away chatting it up, you can use the Pros’ noise-cancelling technology to drown them out.It’s worth keeping in mind that the AirPods Pros are sweat and water resistant and not waterproof. So they’ll handle your sweat from working out or hanging out in the sun, but don’t douse them in water or take them swimming.E-reader — Kindle PaperwhiteThe Kindle Paperwhite can with withstand being dropped in up to 6 feet of water for an hour, and keep ticking. That's way better than your old paperback. (Image: Amazon)Want to relax with a good book while catching some rays, but don’t want to lug around a heavy hardcover with the rest of your beach gear? Amazon’s (AMZN) Kindle Paperwhite is what you’re looking for. Starting at $129 with 8GB of storage or $159 with 32GB of space, the Paperwhite can be used in direct sunlight thanks to its adjustable display, and it is surprisingly waterproof.Amazon says the e-reader can last up to an hour in 6.5 feet of fresh water without calling it quits but doesn’t say anything about salt water, so try to keep it on your beach blanket and out of the ocean.Phone case — LifeProof FRĒThe LifeProof Fre can take water, snow, and serious falls. (Image: LifeProof)Most of today’s smartphones are already waterproof, but that doesn’t necessarily make them capable of surviving a drop in the sand or a dip in salt water. If you’re the more adventurous type and want to use your phone in the ocean to capture underwater snaps or simply don’t want to deal with sand getting into your device, you can always opt for a case like the LifeProof FRĒ.Available for $74.99, the FRĒ can help your phone survive in up to 6 feet of water for an hour, withstand drops, dirt, and more. I’ve used a FRĒ case to take underwater shots in a pool, and it worked incredibly well. Taking my phone into the ocean, though, is too much of a risk for me.Fitness tracker — Apple Watch or Fitbit Versa 2The Apple Watch can function in water as deep as 150 feet, even in the ocean. (Image: Apple)If you’re the kind of person who likes to exercise at the pool or beach, we probably wouldn’t be friends. But that doesn’t mean you shouldn’t be able to track your exercises with a waterproof smart watch. Both the Apple Watch and Fitbit’s (FIT) Versa 2 are waterproof and can be used to track your swim in a pool or the ocean.The Apple Watch Series 3 starts at $199, while the Series 5 starts at $399. The Versa 2 starts at $199. The decision comes down to your personal preference for styling and functionality. Either way, you’ll still be able to record your aquatic workouts, while I lie out in the sun sipping my piña colada from a red Solo cup so the lifeguards don’t notice.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:What is Palantir, and can it really predict crime?How to delete your Facebook, Instagram, and WhatsApp accountsApple is closing stores in these 11 states amid new coronavirus outbreaksDespite growing ad boycott, Facebook is too big for many advertisers to ignoreFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit"}]}