{"article": [{"url": "https://finance.yahoo.com/news/fed-lowers-pricing-for-emergency-loans-to-state-local-governments-210014547.html", "published": 1597162100.0, "headline": "Fed lowers pricing for emergency loans to state, local governments", "body": "The Federal Reserve on Tuesday lowered the pricing of its emergency loans made available to U.S. states and cities, in an effort to increase its support to municipalities struggling to meet financing needs during the pandemic.The Fed says it will lower the pricing of Municipal Liquidity Facility loans by 50 basis points.“Today’s changes will ensure the MLF continues to provide an effective backstop to assist U.S. states and local governments as they weather the pandemic,” the central bank said in a statement.The pricing change is a response to criticism that the facility’s loans were too expensive for municipalities that need to plug budget shortfalls but worry of being saddled with more debt. The Fed stood up the facility on May 26 and has pledged up to $500 billion in loans, but as of August 5 the facility had extended only one loan: $1.2 billion to the state of Illinois.Municipalities wanting to access a loan sell tax-exempt eligible notes (of less than 3-year maturity) to the Fed’s facility, which in turn provides a loan priced at the overnight index swap rate plus a spread based on the issuer’s credit rating. Previously, the pricing ranged from 150 (for a AAA/Aaa-rated issuer) to 590 basis points (for a below investment grade issuer).The change today changes that range to 100 - 540 basis points.The facility prices taxable notes with adjustments, which the Fed also changed today to lower the interest rate paid by borrowers.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.NY Fed: COVID forces first decline in household debt since 2014Democrats propose expanding Fed mandate to reducing racial inequalityWhat is a stock split: Yahoo UFed chair says economy faces 'new phase' as coronavirus deaths top 150K, data softenA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}