{"article": [{"url": "https://finance.yahoo.com/news/heres-what-the-most-sophisticated-investors-are-doing-with-their-cash-during-the-market-rally-174720736.html", "published": 1593435320.0, "headline": "Here's what the most sophisticated investors are doing with their cash during the market rally", "body": "Day traders are having a moment as they sit home without sports and trade a stock market surprisingly melting up during a major global health crisis.But this group of rebels ginned up on recent gains in the equity market may want to phone a few pros in the financial services sector. Because the most sophisticated investors around are starting to get a bit worried if the markets have gotten overextended for a host of reasons, suggests the father of online trading.“On the professional side, what we see from our investors is most of them have accumulated cash, selling into this rally. As a matter of fact, today they’re sitting on something like $72 billion in customer cash. Basically, there are two lines of thought here,” said Interactive Brokers founder and chairman Thomas Peterffy on Yahoo Finance’s The First Trade. “One is that if you don’t get into this market, you will never see these prices again because the Fed keeps pumping money into the market and inflation is going to catch up with us very soon and stocks are a safe-haven. And the other thing is that it doesn’t matter how much money is in the market, companies will have difficulty earning a profit. So that’s where we are.”WASHINGTON, DC - DECEMBER 8: Thomas Peterffy, CEO of Interactive Brokers, speaks during a joint hearing of the Senate Banking, Housing and Urban Affairs Committee Securities, Insurance, and Investment Subcommittee and Senate Homeland Security and Governmental Affairs Committee Investigations Subcommittee on Capitol Hill December 8, 2010 in Washington, DC. The committee called Securities and Exchange Commission Chairman Mary Schapiro and others to testify about the integrity and US Capital Markets. (Photo by Brendan Smialowski/Getty Images)The Hungarian-born Peterffy founded Interactive Brokers some 43 years ago. Since then he has been a champion of online trading as a means to lower transaction prices and bring more people into the investing fold.Today, Interactive Brokers has more than 760,000 client accounts spanning the U.S., Asia and Europe. The average account size is $230,000, reflecting a platform that is geared more toward professional investors with access to some of the best information on markets around.In the process, Peterffy has amassed a net worth of about $14.5 billion.So, when Peterffy says clients on his platform are raising cash — while the broader market is still rallying —it should set off a few caution signals to the bulls.Adds Peterffy, “They believe that the market is overvalued, right, because the economy is basically suffering and we don’t see a quick turnaround on the horizon.”Story continuesBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}