{"article": [{"url": "https://finance.yahoo.com/news/american-united-face-crunch-time-as-clock-ticks-toward-deadline-pressuring-white-house-congress-213155021.html", "published": 1598546360.0, "headline": "Crunch time for United, American and Delta as clock ticks toward deadline, pressuring DC's warring parties", "body": "Major airlines are ringing the alarm bell on potential layoffs, hoping to jolt the White House and Congress into finding a way to rescue them before thousands of employees are forced out of their jobs.As a condition of accepting the $50 billion government bailout enacted through the CARES Act legislation in March, airlines are banned from implementing layoffs through September 30. However, the clock is ticking on that deadline with the coronavirus outbreak still a drag on economic activity.On Thursday, United Airlines (UAL) warned it will need to cut nearly 3,000 pilot jobs between Oct. 1 and Nov. 30 if the government doesn’t bail them out again -- just days after American Airlines (AAL) CEO Doug Parker told employees that 19,000 workers would be laid off on October 1 if additional financial relief failed to materialize by then.“It was assumed that by Sept. 30, the virus would be under control and demand for air travel would have returned. That is obviously not the case,” Parker wrote in a letter to workers.“Based on current demand levels, we at American now plan to fly less than 50% of our airline in the fourth quarter, with long-haul international particularly reduced to only 25% of 2019 levels,” he added.According to the Airlines For America trade association, U.S. airlines are collectively burning more than $5 billion in cash every month as passenger volumes have dropped 70% from their pre-pandemic levels.The dire state of the industry has prompted a pledge from the Trump administration to take executive action, as talks with Congressional Democrats over another round of economic stimulus have stalled.“If Congress is not going to work, this president is going to get to work and solve some problems,” said White House Chief of staff Mark Meadows in an interview with Politico on Wednesday.For their part, airlines have toed the line between Washington’s warring Democratic and Republican factions. American was careful to praise Trump for weighing executive action, but also welcomed Congress’ help too.Story continues“We have been in touch with the administration and we greatly appreciate their concern for our team members and their support for the aviation industry. We will continue to work with the administration and our bipartisan supporters in Congress and hope to come to a resolution in a timely fashion,” American Airlines told Yahoo Finance in a statement.Meanwhile, both Delta Air Lines (DAL) and United advocated for more bailout funds from Congress.Delta pointed to CEO Ed Bastian’s recent push for a six month extension of relief funds, while United Airlines advocated for a bipartisan extension of funds with the help of Congress.“The CARES Act has been critical to our employees and their families, as Congress and the Administration acted swiftly to help the aviation industry and the hundreds of thousands of jobs it supports,” United said in a statement to Yahoo Finance.“Along with our union partners, we continue to advocate for an extension of the payroll support program for employees from the federal government as we know it will undoubtedly protect hard-working Americans' jobs,” it added.Still, it’s not clear where the Trump administration would find the additional funds to extend the federal government’s bailout of the airline industry without Congress’ permission. The previous executive order providing additional $300 in weekly unemployment benefits to jobless workers is being funded by the federal government’s disaster relief fund."}]}