{"article": [{"url": "https://finance.yahoo.com/news/reasons-why-the-housing-market-has-recovered-from-covid-19-113103086.html", "published": 1595399960.0, "headline": "5 reasons why the housing market has recovered from COVID-19: BofA", "body": "The housing market has been a “shining star” in the economy as the country emerges from its initial coronavirus pandemic lockdowns.While activity basically stopped along with the rest of the economy in March and April, when COVID-19 slammed the U.S., home sales and homebuilding rebounded in May and June. Pending home sales, a leading housing indicator, rose 44.3% in May, the highest monthly gain since the National Association of Realtors (NAR) started tracking the data in January 2001, and new homes sales was up 16.6% in May from a month ago. Meanwhile, housing starts in June rose 17.3% — the most in almost fours years.BofA Global Research gives five reasons why the housing market “was able to bounce back so quickly” and believes ”there is likely still more upside for housing activity into the fall.”It’s been an uneven recessionSince the last week of March, more than 20 million jobs have been wiped out and more than 51 million Americans have filed for new unemployment claims. It’s no secret that COVID-19 has hit lower income households more so than others.For those households earning under $35,000 a year, more than 55% have experienced a loss of employment income and for those households making between $35,00 to $75,000, a little over half have lost employment income, BofA wrote.But homebuyers tend to be higher earners, who have been less impacted by the economic shutdown. According to the NAR, the median household income of homebuyers is $93,200 a year. Historical low interest ratesBofA expects low rates to continue with the Federal Reserve “likely to keep policy accommodative with rates exceptionally low well into the recovery.” The average 30-year fixed mortgage rate fell under 3% this month — the lowest level in the almost 50 years that Freddie Mac has been record-keeping.Low rates have been leading to a spike in mortgage applications, which is a measure of future home buying activity.In June, the Mortgage Bankers Association’s purchasing index hit the highest level since January 2009. For the week ending July 17, purchase activity was up 19% from the same time last year, the ninth straight week of year-over-year increases, according to the MBA’s associate vice president of economic and industry forecasting Joel Kan, in a press statement. “There continues to be strong homebuyer demand this summer, as home shoppers have returned to the market in many states,” he said.Story continues“[There are] giveaway prices in the mortgage market where money is so cheap it’s almost like you’re embarrassed to say you don’t have a mortgage anymore. There’s so much incentive there,” Barbara Corcoran, founder of residential brokerage The Corcoran Group, recently told Yahoo Finance.Historically low inventoryMark Fleming, First American chief economist, explained it simply when he told Yahoo Finance: “You can’t buy what’s not for sale.”The U.S. was facing a housing shortage long before the arrival of COVID-19. The National Association of Home Builders CEO Jerry Howard told Yahoo Finance earlier this month that the U.S. was about 1 million housing units short entering this year.The U.S. had been facing a housing shortage well before COVID-19 disrupted the market. Credit: Getty“What the numbers show is that we are now building... exactly what we should be doing,” Howard said, referring to the latest housing start data. “And if we can build at this pace, we'll have the exact number of equilibrium that we want for the marketplace going forward. Very exciting news for us.”“The housing market was lean heading into this crisis, which is in sharp contrast to the 2008-9 recession where the excesses in the housing market drove the downturn,” wrote BofA, underscoring that homeowner vacancy rate stands at 1.1%.Fiscal and monetary policyThe Fed has done its part to keep interest rates low.Meanwhile, the Coronavirus Aid, Relief, and Economic Security (CARES) Act has allowed homeowners with federal-backed mortgages to go into forbearance for 12 months without penalty. Private lenders have also offered some type of mortgage relief. As of July 12, 3.9 million homeowners were in forbearance, which represents 7.8% of all mortgages.The CARES Act also gave households a little boost with a direct payment of up to $1,200 for individuals and $6,000 for families with children. Additionally, the unemployed were allowed to claim an extra $600 each week in unemployment benefits, “providing a further boost and helping to augment incomes for those who became unemployed-many were laid off temporarily and therefore able to remain homeowners,” BofA wrote.More people are relocatingA Pew Research Center survey in early June found that 3% of adults moved permanently or temporarily due to COVID-19. According to brokerage Redfin, 27% of its users searched for homes outside of their metro area in April and May, a new high. Interest in areas with a population of less than 50,000 spiked to 87% in May from the same time a year ago, while populated areas of 1 million-plus were up 22%.“The pandemic and the work-from-home opportunities that come with it is accelerating migration patterns that were already in place toward relatively affordable parts of the country,” said Redfin economist Taylor Marr in a press release. “But for many people, the lure of large homes in wide open spaces will be a passing dream fueled by coronavirus-induced isolation.\"Similarly, the NAR Market Recovery Survey of Realtors released earlier this month, found that 92% of respondents stated that a portion of their buyers have either returned to or never left the market. Forty-seven percent stated that their buyers prefer to purchase in the suburbs, 39% cited rural areas, and 25% cited smaller town markets.BofA and other economists expect housing starts and sales to fully recover to pre-COVID 19 levels in the coming months. NAHB’s Howard is also optimistic based on the latest housing data but warns: “We're still in these uncharted waters. But the underlying demand for housing is there. Family formation is still high. And that will generate, we think, the appropriate amount of demand, barring another economic shutdown or barring some other geopolitical event that no one can foresee or control.”Amanda Fung is an editor at Yahoo Finance.Read more:Luxury real estate may be back as the housing market recovers but bewareHome price growth accelerated at the start of 2020 before coronavirus slammed the USEconomist on housing: 'You can't buy what's not for sale'The hottest housing market of 2019Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}