{"article": [{"url": "https://finance.yahoo.com/news/trump-is-martyring-the-postal-service-180651766.html", "published": 1597324460.0, "headline": "Trump is martyring the postal service", "body": "President Trump has shown his hand. Now we know.Trump told Fox Business on Aug. 13 that he opposes emergency funding for the US Post Office because it would help the service deliver more mail-in ballots in November. “They need that money in order to make the post office work, so it can take all of these millions and millions of ballots,” Trump said. “But if they don’t get those two items, that means you can’t have universal mail-in voting, because they’re not equipped to have it.”This, we can now see, is a major reason Congress can’t pass another stimulus bill to help businesses and workers reeling from the coronavirus recession. The “two items” Trump referred to are additional funding streams Democrats want as part of the next stimulus bill: $25 billion to plug ongoing financial holes at the postal service, and $3.6 billion to help states fund a surge of mail-in voting. Republicans who control the Senate oppose that funding, and Trump has now indicated why.Trump thinks mail-in voting will help Democrats more than Republicans. In March, Trump told Fox News that with expanded mail-in voting, “you’d never have a Republican elected in this country again.” There’s no evidence that’s true. Many states have liberal mail-in voting rules that cause no apparent problems, including Republican-controlled states such as Iowa, Montana, Ohio and Utah. Yet Trump seems convinced, without proof.In this Wednesday, May 6, 2020, photo, United States Postal Service carrier Henrietta Dixon gets into her truck to deliver mail in Philadelphia. (AP Photo/Matt Rourke)The $28.5 billion Democrats want for postal-related funding is a blip in a bill that could easily total $1.5 trillion in spending, or more. So Republican objections based on the dollar amount alone don’t really make sense. If Trump thinks that additional postal funding endangers his hold on power, however, it would explain why Republicans would be willing to hold up a crucial bill for a relatively small provision.Still, it’s probably counterproductive for Trump to starve the postal service and spell out his plan. Democrats led by House Speaker Nancy Pelosi and presidential hopeful Joe Biden can now accuse Trump of standing in the way of vital aid for struggling workers and businesses because he’s trying to rig the mail to aid his reelection odds. Seventy percent of Americans support voting by mail, including 87% of Democrats and 49% of Republicans, according to Pew Research. Trump needs the votes of moderate Republicans and many Independents to win in November, and he’s not helping himself by attacking postal voting.Story continuesDemocrats can’t back down nowTrump’s revelation also seems certain to stiffen support for the new postal funding among Democrats. In March, when Congress passed the first large stimulus bill, Democrats caved on the $25 billion in postal funding they wanted, in order to ink a fast deal with Republicans. But now they can’t cave, without giving Trump an obvious win. Trump’s open hostility to the postal service now gives Democrats a cause they can’t back down from, like a martyr who infuses an army with a rallying cry.There may be darker doings underway at the postal service. The new Postmaster General, Louis DeJoy, is a Trump megadonor who may be laying the groundwork for a postal fumble in the upcoming elections, when late-arriving ballots could play a decisive role if the presidential race is close. After taking the job in June, DeJoy canceled overtime and made other changes that have reportedly led to slower mail delivery. There’s also controversy over new plans to raise the cost of mailing ballots to voters. DeJoy has said he’s imposing painful changes because they’re necessary to save an outfit that perennially loses money, but critics suspect he’s appeasing Trump by creating a construct for invalidating thousands of ballots in November.A post office worker loads his truck at the United States Post Office annex on August 11, 2020 in Boston, Massachusetts. (Staff Photo By Matt Stone/ MediaNews Group/Boston Herald)DeJoy also faces charges of ethics violations. He made millions running a logistics company bought in 2014 by a firm called XPO Logistics, which is a contractor to the USPS and other government agencies. DeJoy retains a stake in XPO worth at least $30 million. So he’s now running a quasi-government agency whose decisions could directly affect a private-sector firm he owns part of. Republicans and Democrats alike have expressed concern, and a number of Democratic legislators have asked the postal service’s inspector general to investigate recent changes.Trump has bashed the postal service for most of his presidency, calling it a “joke” and claiming without evidence that it gives Amazon sweetheart deals on confidential delivery fees. Trump’s beef with Amazon relates to its CEO, Jeff Bezos, who owns the Washington Post, a frequent Trump critic. So in reality, Trump seems to hate the postal service because one of its big customers is an implicit critic and because it might deliver some of the votes that drive him from office in November. But his overt assault on the USPS might generate a lot more resistance than he anticipates.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Trump’s tricky tax ploy11 ways Trump is out of touch with votersA double-dip recession is formingEdgy voters might reject the 2020 election outcomeHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}