{"article": [{"url": "https://finance.yahoo.com/news/us-budget-deficit-hits-time-180134170.html", "published": 1594645760.0, "headline": "US budget deficit hits all-time high of $864 billion in June", "body": "WASHINGTON (AP) — The federal government incurred the biggest monthly budget deficit in history in June as spending on programs to combat the coronavirus recession exploded while millions of job losses cut into tax revenues.The Treasury Department reported Monday that the deficit hit $864 billion last month, an amount of red ink that surpasses most annual deficits in the nation's history and is above the previous monthly deficit record of $738 billion in April. That amount was also tied to the trillions of dollars Congress has provided to cushion the impact of the widespread shutdowns that occurred in an effort to limit the spread of the viral pandemic.For the first nine months of this budget year, which began Oct. 1, the deficit totals $2.74 trillion, also a record for that period. That puts the country well on the way to hitting the $3.7 trillion deficit for the whole year that has been forecast by the Congressional Budget Office.That total would surpass the previous annual record of $1.4 trillion set in 2009 when the government was spending heavily to lift the country out of the recession caused by the 2008 financial crisis.The June deficit was driven higher by spending on various government relief programs such as an extra $600 per week in expanded unemployment benefits and a Paycheck Protection Program that provided support to businesses to keep workers on their payrolls.The report showed that the cost of the Paycheck Protection Program in June was $511 billion. That reflected a charge to the government for all the bank loans made under the program even though the government will not actually have to pay out funds until the banks determine whether the businesses met the criteria for having the loans forgiven. Those requirements include spending at least 60% of the loan amount on worker pay with the other 40% going to overhead costs such as rent and utilities.Another reason for the surge in the June deficit was the government’s decision to delay tax payments this year until July 15. That decision mean that quarterly payments made by individual taxpayers and corporations will not be due until July 15 this year rather than June.Story continuesSo far this budget year, revenues total $2.26 trillion, down 13.4% from the same period last year, while spending totals $5 trillion, up 49.1% from a year ago.The CBO estimate of a $3.7 trillion deficit for this year could go higher depending on the course of the economy. The country fell into a deep recession in February, ending a record long expansion of nearly 11 years. The Trump administration is predicting that the economy will come roaring back in second half of this year but many private forecasters are concerned that a resurgence of virus cases could make consumers too fearful to resume spending, which drives 70% of the economy.Congress which has already approved more than $3 trillion in a series of rescue packages, is scheduled to debate another support effort when it returns from recess on June 20. Democrats are pushing for an extension of the expanded unemployment benefits which will soon run out.Nancy Vanden Houten, senior economist at Oxford Economics, said she was expecting that lawmakers would end up compromising on a new economic support package that would fall somewhere between a $3.5 trillion measure passed by the House but not taken up by the Senate and what is shaping up to be an opening offer by Senate Republicans for a package of about $1.5 trillion.“The risk is that the deficit will be larger due to additional stimulus but, given the congressional timetable, the impact of the next package will likely be skewed to fiscal 2021, which starts Oct. 1,” she said."}]}