{"article": [{"url": "https://finance.yahoo.com/news/bitcoin-scams-on-twitter-are-nothing-newand-they-work-185935185.html", "published": 1594908440.0, "headline": "Bitcoin scams on Twitter are nothing new—and they work", "body": "Twitter fell victim to a coordinated hack on Wednesday that targeted the accounts of prominent users with big followings, including Barack Obama, Joe Biden, Bill Gates, Elon Musk, and Kanye West, and sent out tweets from their accounts asking for bitcoin. One sample tweet, sent from Biden’s account, promised: “All bitcoin sent to the below address will be sent back doubled!”Twitter (TWTR) will have to answer for the hack, and the FBI is now investigating as well. According to Vice, the hack was carried out by an employee inside Twitter, who was paid to help the hackers by using an internal tool that changed the email address associated with the compromised accounts. Twitter on Wednesday night said the hack was a “coordinated social engineering attack by people who successfully targeted some of our employees with access to internal systems and tools.”But cryptocurrency scams on Twitter are nothing new, and they have targeted prominent accounts in the past.Jack Dorsey, CEO of Twitter (Photo by Burhaan Kinu/Hindustan Times via Getty Images)The problem became rampant on Twitter in late 2017, when bitcoin was on a wild price ride.Bots promoting cryptocurrency “giveaways” would reply in droves to legitimate tweets from major tech figures like Apple CEO Tim Cook, Tesla CEO Elon Musk, or Ethereum founder Vitalik Buterin. The bot accounts would have the same photo and display name as the real person; the only way to tell it was fake was from checking the handle. These tweets would promise free bitcoin (BTC) or ether (ETH) if users would send crypto to a wallet address. (“As a thank you to my followers, I’m giving away 500 ETH! Click here! Just send 20 BTC to this address and we will immediately send back 40 BTC.”)Elon Musk, in particular, was targeted incessantly, and tweeted in July 2018 that he wanted to know who was responsible for the scams, though he misspelled Ethereum.I want to know who is running the Etherium scambots! Mad skillz …— Elon Musk (@elonmusk) July 8, 2018Crypto scams on Twitter became so pervasive for a time that many crypto influencers on Twitter added “not giving away ETH” to their Twitter display names.Story continuesIn August 2018, the spam bots even targeted President Trump, replying to his tweets so that the spam tweets would nest below his real tweets. During the same period, spammers also hacked the accounts of real people with big followings, including the band Bad Religion and NBA player Monte Morris, and turned their accounts into fake Trump accounts.A hacked Twitter account, belonging to British rugby star Joe Joyce and taken over to look like President Trump's account, promotes a crypto scam on Aug. 1, 2018.You might think the spam tweets look so clearly fake that no one would fall for them, but people do.This latest crypto scam on Wednesday resulted in at least 12.5 bitcoin being sent to the wallet address shared in the spam tweets. That comes out to about $114,500 at the current bitcoin price, which isn’t a lot considering that the compromised Twitter accounts had a collective 346 million followers, but it isn’t nothing.Twitter, in the past, has said on the issue, “We are aware of this form of manipulation and are proactively implementing a number of signals to prevent these types of accounts from engaging with others in a deceptive manner” but has been criticized for not weeding out the problem effectively enough.This time, after a much more sinister example in which important accounts were compromised, Twitter will face far more public pressure to put a stop to such scams. The hack will also bring more scrutiny on CEO Jack Dorsey, a big bitcoin believer himself, who may not be able to pull double duty as CEO of both Twitter and Square for much longer.—Daniel Roberts is an editor-at-large at Yahoo Finance and closely covers tech and media. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is affecting the entertainment industry:Twitter crypto scammers target Trump’s accountHow long can Jack Dorsey stay on as CEO of both Twitter and Square?Reddit cofounder Alexis Ohanian: We are entering a 'crypto spring'Amazon tells employees to delete TikTok, then says email was 'sent in error'Quibi cannot blame all its problems on the pandemicSpotify, Amazon, Apple and Barstool Sports are all betting big on podcasts"}]}