{"article": [{"url": "https://finance.yahoo.com/news/american-teachers-pandemic-165816140.html", "published": 1596283280.0, "headline": "American teachers are facing 'a perfect storm' of crises amid the coronavirus pandemic", "body": "The compounding stresses of the coronavirus pandemic, the sudden transition to remote learning, and the politicization of schools reopening are burning out teachers.“It's like a perfect storm happening right now because the federal government hasn't passed any legislation to give states any money,” Tish Jennings, an associate professor at the University of Virginia who studies how stress affects teachers, told Yahoo Finance. “And so when they don't have enough money in the state, what suffers is the quality of education — the teachers don't get raises, teachers get laid off, the class sizes grow.”According to a survey by Horace Mann of 2,490 educators in the U.S. in June, 34% of them are considering leaving the profession due to the financial stress they’re feeling.“I was on the verge of leaving,” an art teacher from Connecticut, who teaches kindergarten through fifth grade but did not want to be identified out of fear of professional retaliation, told Yahoo Finance. “The reason why I stayed truthfully was because of my loan payments.”A teacher from Yung Wing School P.S. 124 who wished not be identified remote teaches on her laptop from her roof on March 24, 2020 in New York City. (Photo by Michael Loccisano/Getty Images)In the wake of the 2008 Financial Crisis, nearly 300,000 jobs were shed from the public education sector, according to one estimate. In the first two months of the coronavirus-induced economic crisis of 2020, around 750,000 public school teachers and other school employees in local areas have been laid off, according to one estimate by the American Federation of Teachers.“I’m pretty sure this was unprecedented,” Michael Madowitz, an economist at the Center for American Progress, told Yahoo Finance in June. “We’re already past the total state and local job losses of the last recession.”(GRAPHIC: EPI)The Education industry bounced back a bit in June as private education added 93,000 jobs and government education added 70,000. The question over the following months and years is how many teachers are hired back and how many choose to leave the profession.“It’s honestly very tough,” said Rosanna Deserto, a second grade teacher from Brooklyn, who is considering leaving the profession after 15 years of teaching.Story continues“I actually said to my husband the other day I wanted to do my side business full time,” Deserto added, referring to a multi-level marketing company that she works with. “I could make it work. However, the no benefits may hurt us financially.”A Boston Public School teacher teaches her kindergarten class via video-conference from her apartment in Boston, Massachusetts, in April 2020. (PHOTO: REUTERS/Brian Snyder)Remote learning makes things ‘really, really tough’For many teachers, the first few instances of not having face-to-face contact with their students was jarring.“My content specifically, being very, I guess, hands-on type of area,” the Connecticut art teacher said, “it was especially hard to sort of jump right into digital learning when my whole sort of career is based on using materials with children.”For others, the challenge of going online was a monumental task in itself.“We received training, literally — it was like, here's a YouTube video,” recounted one teacher in New York City who didn’t want to share their name due to fear of any adverse impact to their employment. “The week that we still had to go into work, that was our training, watch this YouTube video on how to use Google classroom, and the rest of the days we were just in our classrooms, just contacting parents, getting their email addresses, just trying to set up remote learning.”An elementary school teacher, meets with her first-grade students on Google Meet from her home in Brookline, MA on March 27, 2020. (PHOTO: David L. Ryan/The Boston Globe via Getty Images)Jennings said she’s heard stories about students not showing up to remote classes or being unable to attend because of spotty internet connection of lack of computer access.“There are places where I heard — and this was in Louisville, Kentucky where I'm doing some work — there are hubs, like internet hubs, around school,” she explained. “So parents are taking their kids in a car to a place where they can get WiFi near the school to do their work, like to do school. But how many parents have the ability to do that? Right?”All things consider, teaching through the pandemic “has really taken an Herculean effort to get these schools to shift this way,” Jennings added. “We haven't done a good enough job of preparing for another shutdown or continued shutdown. And at the same time we haven't done a good enough job managing the coronavirus.”New Jersey, Connecticut, Rhode Island, West Virginia, and Oklahoma are seeing a surge in cases. (Graphic: David Foster/Yahoo Finance)‘Reckless and unsafe reopening of public school campuses’President Donald Trump and Education Secretary Betsy DeVos are pressuring schools to reopen, with Trump tweeting things like how distance learning is “TERRIBLE” compared to in-person classes and DeVos asserting on CNN that “kids need to be back in school and school leaders across the country need to be making plans to do just that.”But safely reopening schools amid a pandemic is easier said than done.First, implementing safety measures like social distancing and buying enough items like plexiglass and cleaning supplies and COVID-19 test kits is difficult when schools can’t afford the extra measures.The American Federation of Teachers (AFT), the second largest union in the country, recently released a study detailing how unless preK-12 schools receive more funding, they would be unable to equip schools with safety measures and the risk of job losses would increase.U.S. President Donald Trump addresses the daily coronavirus response briefing as Education Secretary Betsy DeVos looks on at the White House in Washington, U.S., March 27, 2020. (PHOTO: REUTERS/Jonathan Ernst)“Absent a federal lifeline, the growing state and local education budget gap would result in a total of 1,356,000 job losses—1 million in preK-12 and 400,000 in higher education, about 432,000 more than have been lost to date,” the report stated.The AFT on Monday also sued Florida Governor Ron DeSantis, Commissioner Richard Corcoran, the Florida Department of Education, the Florida State Board of Education and the Miami-Dade County Mayor Carlos Gimenez to “stop the reckless and unsafe reopening of public school campuses as coronavirus infections surge statewide.” Florida is a worsening coronavirus hotspot.“It's crazy that the pandemic was the reason we finally had no school shootings for a year,” Kelly Walker, a seventh grade english and language arts teacher in Queens, told Yahoo Finance. At the same time, listening to the news about schools reopening even as the coronavirus continues to spread, Walker added: “I've had thoughts of, ‘Wow, am I going to die because I'm a teacher?’”Middle school teacher Brittany Myers, (C) stands in protest in front of the Hillsborough County Schools District Office on July 16, 2020 in Tampa, Florida. Teachers and administrators from Hillsborough County Schools rallied against the reopening of schools due to health and safety concerns amid the COVID-19 pandemic. (Photo by Octavio Jones/Getty Images)‘Exposing the cracks in a lot of our systems’For Jennings, who has a forthcoming book coming out on teachers and burnout, this pandemic could also be the opportunity to institute transformational change in the school systems across the country.“The whole system has been oppressing teachers from the very beginning,” she said. “So the intention of my book is to help teachers see how the system was created and why it operates the way it does and why it's so archaic.”After working as a teacher since 1979, Jennings found that one of the main reasons why this current system is so stressful on teachers is that the U.S. education system is an outdated by-product of the industrial revolution.“What's happening in so many ways is this pandemic is exposing the cracks in a lot of our systems,” she said. “Teachers were already stressed out to the max before this happened… You can barely pay off your student loans when you get out with the salary you make as a teacher. So the number of people going into education has been declining, and there's a growing teacher shortage.”—Aarthi Swaminathan and Reggie Wade are reporters for Yahoo Finance.Aarthi can be reached at aarthi@yahoofinance.com and rwade@verizonmedia.com. Follow them on Twitter at @aarthiswami and @ReggieWade.Read more: 'Designed to fail’: Two public servants describe the government's troubled student loan forgiveness program‘I was misled’: Public school teacher tells Congress about student debt nightmareU.S. teachers increasingly struggle to find affordable housing: StudyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}