{"article": [{"url": "https://finance.yahoo.com/news/amc-theatres-listens-guests-scientific-170200762.html", "published": 1592568620.0, "headline": "AMC Theatres Listens to Its Guests and Scientific Advisors, and Immediately Reverses Course: AMC Will Require Its Guests to Wear Masks at AMC Theatres Nationwide, Beginning With the July 15 Reopening of AMC’s Movie Theatres Across the United States", "body": "AMC Theatres (NYSE: AMC) CEO and President Adam Aron issued the following statement today:\"At AMC, we have been consulting with top scientists and health experts to create a broad, sweeping, far-reaching health and safety effort to make AMC Theatres safe for our guests and associates when our theatres reopen in July. Among many elements of that comprehensive plan was a requirement for our associates all to wear masks nationwide, as well as a requirement for our guests all to wear masks in the many parts of the country that will require it. In those areas of the country where masks will not be required, we nonetheless planned to strongly encourage mask usage by guests, and fully expected that the vast majority would do so. That policy on guest mask usage, which is directly comparable with our major competitors and many other highly regarded retailers, was announced yesterday afternoon.This announcement prompted an intense and immediate outcry from our customers, and it is clear from this response that we did not go far enough on the usage of masks. At AMC Theatres, we think it is absolutely crucial that we listen to our guests. Accordingly, and with the full support of our scientific advisors, we are reversing course and are changing our guest mask policy. As we reopen theatres, we now will require that all AMC guests nationwide wear masks as they enter and enjoy movies at our theatres. The speed with which AMC moved to revise our mask policies is a reflection of our commitment to the safety and health of our guests.We will constantly monitor the scientific community’s latest thinking as to the efficacy of mask usage. We also will be looking at the varying health conditions in specific localities around our theatres all across the country. This will help us to determine what our mask policy will be as we go forward, as well as to make any other needed changes to this policy.Guests coming to our theatres may bring their own masks of course, but for those who do not have one, masks will be available at our theatre box offices at a nominal $1.00 price. Those who are unwilling to wear a mask will not be admitted or allowed to stay.Story continuesWe also want to take this opportunity to express our great appreciation to our many guests who took the time to communicate their views. We will continue to listen and continue to monitor the changing nature of the coronavirus, adapting and adjusting our policies accordingly.\"About AMC Entertainment Holdings, Inc.AMC is the largest movie exhibition company in the United States, the largest in Europe and the largest throughout the world with approximately 1,000 theatres and 11,000 screens across the globe. AMC has propelled innovation in the exhibition industry by: deploying its Signature power-recliner seats; delivering enhanced food and beverage choices; generating greater guest engagement through its loyalty and subscription programs, web site and mobile apps; offering premium large format experiences and playing a wide variety of content including the latest Hollywood releases and independent programming. AMC operates among the most productive theatres in the United States' top markets, having the #1 or #2 market share positions in 21 of the 25 largest metropolitan areas of the United States. AMC is also #1 or #2 in market share in 9 of the 15 countries it serves in North America, Europe and the Middle East. For more information, visit www.amctheatres.com.View source version on businesswire.com: https://www.businesswire.com/news/home/20200619005417/en/ContactsRyan Noonan, (913) 213-2183rnoonan@amctheatres.com"}]}