{"article": [{"url": "https://finance.yahoo.com/news/boeing-737-max-certification-flight-040443935.html", "published": 1593299540.0, "headline": "Exclusive: Boeing 737 MAX certification flight tests to begin on Monday - sources", "body": "By Eric M. Johnson and David ShepardsonSEATTLE/WASHINGTON (Reuters) - Pilots and test crew members from the U.S. Federal Aviation Administration and Boeing Co <BA.N> are slated to begin a three-day certification test campaign for the 737 MAX on Monday, people familiar with the matter told Reuters.The test is a pivotal moment in Boeing's worst-ever corporate crisis, long since compounded by the novel coronavirus pandemic that has slashed air travel and jet demand.The grounding of the fast-selling 737 MAX in March 2019 after two crashes in five months killed 346 people in Ethiopia and Indonesia triggered lawsuits, investigations by Congress and the Department of Justice and cut off a key source of Boeing's cash.The FAA confirmed to U.S. lawmakers on Sunday that an agency board had completed a review of Boeing's safety system assessment for the 737 MAX \"clearing the way for flight certification testing to begin. Flights with FAA test pilots could begin as early as tomorrow, evaluating Boeing’s proposed changes to the automated flight control system on the 737 MAX.\"After a preflight briefing over several hours, the crew will board a 737 MAX 7 outfitted with test equipment at Boeing Field near Seattle, one of the people said.The crew will run methodically scripted mid-air scenarios such as steep-banking turns, progressing to more extreme maneuvers on a route primarily over Washington state. The plan over at least three days could include touch-and-go landings at the eastern Washington airport in Moses Lake, and a path over the Pacific Ocean coastline, adjusting the flight plan and timing as needed for weather and other factors, one of the people said.Pilots will also intentionally trigger the reprogrammed stall-prevention software known as MCAS faulted in both crashes, and aerodynamic stall conditions, the people said.Boeing declined to comment.The FAA email said the testing will last several days and \"will include a wide array of flight maneuvers and emergency procedures to enable the agency to assess whether the changes meet FAA certification standards.\"Story continuesIt added the \"FAA has not made a decision on return to service\" and has a number of additional steps before it can clear the plane to do so.The rigors of the test campaign go beyond previous Boeing test flights, completed in a matter of hours on a single day, industry sources say.The tests are meant to ensure new protections Boeing added to MCAS are robust enough to prevent the scenario pilots encountered before both crashes, when they were unable to counteract MCAS and grappled with \"stick shaker\" column vibrations and other warnings, one of the people said.Boeing's preparation has included hundreds of hours inside a 737 MAX flight simulator at its Longacres facility in Renton, Washington, and hundreds of hours in the air on the same 737 MAX 7 test airplane without FAA officials on board.At least one of those practice flights included the same testing parameters expected on Monday, one of the people said.After the flights, FAA officials in Washington and the Seattle-area will analyze reams of digital and paperwork flight test data to assess the jet's airworthiness.Likely weeks later, after the data is analyzed and training protocols are firmed up, FAA Administrator Steve Dickson, a former F-15 fighter pilot who has promised the 737 MAX will not be approved until he has personally signed off on it, will board the same plane to make his assessments, two of the people said.If all goes well, the FAA would then need to approve new pilot training procedures, among other reviews, and would not likely approve the plane's ungrounding until September, the people said.That means the jet is on a path to resume U.S. service before year-end, though the process has been plagued by delays for more than a year.\"Based on how many problems have been uncovered, I would be stunned if the flight tests are 'one and done,'\" said another person with knowledge of the flight plans.Regulators in Europe and Canada, while working closely with the FAA, will also conduct their own assessments and have pinpointed concerns that go beyond the FAA. They may require additional changes after the 737 MAX is cleared to return to service.\"This is new territory,\" said one industry source with knowledge of prior Boeing tests. \"There's a lot more play between regulators, and certainly a lot more pressure and public attention.\"(Reporting by Eric M. Johnson in Seattle and David Shepardson in Washington; Editing by Christopher Cushing and Grant McCool)"}]}