{"article": [{"url": "https://finance.yahoo.com/news/sales-homes-surgeed-4-8-141006305.html", "published": 1600939100.0, "headline": "Sales of new homes surge 4.8% in August", "body": "NEW YORK (AP) — Demand for new homes continues to surge despite an ongoing pandemic and lingering anxiety about the U.S. economy. The pace of sales have now reached levels last seen before the Great Recession in 2006.Sales new homes in August rose by a very strong 4.8% to a seasonally-adjusted annual rate of 1.01 million units, the U.S. Department of Commerce reported Thursday. The jump followed a new home sales spike in July of 13.9%.The rapid spread of COVID-19 infections in the U.S. this spring quashed sales, but not demand. The pace picked back up in the summer, driving home prices in many places to record highs.In addition to pent up demand, record low mortgage rates appear to be driving sales far more strongly than most economists had anticipated.“The August figure is the first reading above 1 million since 2006, so both new and existing home sales registered their best results since 2006 in August,” wrote Stephen Stanley, chief economist at Amherst Pierpont. “The level beat expectations by over 100K.”Many, however, do not see the gains over the past several months as sustainable. The last time the pace of sales was this strong marked a peak in the market and preceded the worst economic calamity in the U.S. since the Great Depression.“While strong demand and lower mortgage rates are supportive of further growth in sales, the slow recovery and weak labor market pose downside risks that we expect will weigh on home sales in the months ahead,” said Nancy Vanden Houten, lead U.S. economist for Oxford Economics.New home sales are now up 43.2% from this point last year.The median price of a new home sold was $312,800, according to the Commerce Department.During a broad sell-off this week across all major U.S. stock markets, shares of almost every one of the nation’s largest home builders rose Thursday."}]}