{"article": [{"url": "https://finance.yahoo.com/news/burger-kings-plant-based-impossible-croissanwich-goes-national-and-we-tasted-it-190916673.html", "published": 1592230640.0, "headline": "Burger King's Impossible Croissan'wich goes national — and we tasted it", "body": "The breakfast battle is heating up.After a successful test in select U.S. cities, Burger King launched its new plant-based breakfast sandwich nationwide Monday. The Impossible Croissan’wich features the same ingredients as the original version such as a toasted croissant, egg, and cheese, but will include the Impossible Foods plant-based sausage patty.(Courtesy of Burger King)Impossible Croissan’wich comes after the blowout nationwide release of the Impossible Whopper on Aug. 8, 2019. Burger King parent company Restaurant Brands International (QSR) reported nearly 5% same-store sales growth at Burger King stores following the rollout.Read more: Burger King’s Impossible Whopper: Here’s what eaters are sayingRival Wendy’s (WEN) joined in on the fun when it launched it own breakfast menu in early March. Despite the challenging environment as a result of the COVID-19 pandemic, Wendy’s said that breakfast sales have been strong. In a recent SEC filing, Wendy’s noted that breakfast in the U.S. continued to perform very strongly in the fiscal month of May and accounted for approximately 8% of U.S. systemwide sales.In addition, Burger King’s new Impossible Croissan’wich faces tough competition from Dunkin’ Brands (DNKN). Dunkin’ rolled out its Beyond Meat breakfast sandwich nationwide in early November, and the company said at the time that it was one of the top-selling sandwiches. The release was Beyond Meat’s first nationwide fast-food launch.Even as COVID-19 put unforeseen pressure on the restaurant industry, fast-food chains have weathered the storm better than others. Sales have seen meaningful improvements over recent weeks.Restaurant Brands announced at the end of May that Burger King U.S. same-store sales were trending in negative mid-single digits, after being in the negative low-thirties in the second half of March.Shares of Restaurant Brands were down more than 12% this year.—Heidi Chung is a reporter at Yahoo Finance. Follow her on Twitter: @heidi_chung.Story continuesMore from Heidi:Jobless claims: Another 1.54 million Americans file for unemployment benefitsA theory for why the 'startling' jobs numbers conflict with the other gloomy dataPopeyes US sales are making a massive comebackFind live stock market quotes and the latest business and finance newsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}