{"article": [{"url": "https://finance.yahoo.com/news/chegg-ceo-25-of-colleges-likely-to-go-out-of-business-123404760.html", "published": 1597995740.0, "headline": "25% of colleges likely to go out of business: Chegg CEO", "body": "Demographic shifts and high tuition costs weighed on U.S. universities even before the pandemic began.Ensuing campus closures and the shift to remote learning may mark the end of higher learning institutions as we know them, according to Dan Rosensweig, CEO of education platform Chegg (CHGG).Speaking to Yahoo Finance’s “The Ticker,” Rosensweig said the coronavirus pandemic is likely to eliminate 25% of all universities in the U.S., as cash-strapped colleges struggle to adapt to a changing education environment.“Seventy-eight percent of all students say they go to college for the sole purpose of getting a better job. If the schools don't make it cheaper, don't go online, and don't expand their curriculum to be, in addition to what they have, skills related, and they don't make it more convenient for the student base, they will go out of business,” he said.A protester holds a sign opposing in-person classes Monday, August 17, 2020, at a \"die-in\" at Georgia Tech in Atlanta. More of the state's public universities are opening for the fall term, trying to balance concern about COVID-19 infections against a mandate for on-campus classes citing financial needs and student desires (AP Photo/Jeff Amy)Rosensweig says economics and the need to “stay alive another year” have driven the push to resume in-person classes for universities across the country. Institutions are still reeling from the billions of dollars associated with moving to an all remote learning environment. Another semester of online courses and reduced enrollment could have devastating effects, especially on small liberal arts universities that don’t have big endowments.The dramatic drop in international students who largely pay full tuition, steep discounts universities have offered to attract students, and a drop in state funding, have only accelerated the decline in revenue.“Colleges are going to have to for the first time, lower their price, not just freeze it, but lower it,” Rosensweig said. “They’re going to get less funding from states than they’ve ever gotten before.”More than half a dozen universities and colleges have announced closures since the pandemic began.Chegg, which sells and rents textbooks in addition to study materials and services, has seen its growth accelerate as schools across the country transition to remote learning. Revenue in its second quarter jumped 63%, year on year, to $153 million. The number of subscribers grew 67%. The company now expects its full-year revenue to grow 47% from last year.Story continuesEarlier this month, it launched College Collective, an online directory of community colleges, to help students navigate online certificate or associate degree programs at two-year colleges across the country.Community colleges are likely to see a boost in enrollment long term, as students re-consider the cost of a four-year degree, with courses taught largely remotely.Rosensweig says two-year colleges offer more flexibility for students who can’t afford high tuition costs at elite universities. He adds that 40% of students work at least 30 hours a week, with the average age being 25 years old.“Folks want to graduate with the moniker of the famous school, but they can't afford to pay the costs. So if you can take a class for $600 a credit as opposed to a $4,000, and it can transfer and get the degree from the other school, why wouldn't you; it's actually changing the face of education,” he said.Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaLabor market at ‘inflection point’ shifting from ‘degrees to skills’ : Infosys President‘China’s goal is to replace you’: Barr warns leaders of America’s biggest businesses‘An unprecedented case”: What a U.S. TikTok ban would look like"}]}