{"article": [{"url": "https://finance.yahoo.com/news/bearish-tesla-analyst-explains-why-shares-could-surge-to-2070-172016966.html", "published": 1594124900.0, "headline": "Bearish Tesla analyst explains why shares could surge to $2,070", "body": "In a bull case, Tesla (TSLA) shares could surge as high as $2,070, says Morgan Stanley’s Adam Jonas — though his official call is still bearish with a target of $740.Tesla’s stock has soared to new highs, past $1,400 after smashing delivery expectations for the second quarter last week, raising the expectations of a profit for the last three months.“Tesla was already seen as the undisputed leader in EVs and Auto 2.0. But a resilient 2Q (demand and, likely, profit) is now making the company appear less risky/stronger financially,” wrote Jonas in a note to investors.His previous bull case price target was $1,200.“Our revised bull case of $2,070 is based on 6 million units of volume by 2030..as well as an EBITDA margin of 20%,” wrote Jonas. The scenario “would place the company among the very best luxury car manufacturers to give them greater credit for mix and/or greater volumes of high margin software revenue.”Analysts have rushed to revise their calls as the stock blows past price targets. Tesla shares have risen 45% in the past six sessions. Jonas is maintaining his Underweight rating on the stock, while raising his price target from $650 to $740.In this Sunday, June 28, 2020, photograph, a long line of unsold 2020 Model Y sports-utility vehicles sits at a Tesla dealership in Littleton, Colo. (AP Photo/David Zalubowski)“The re-rating of the shares is happening with extraordinary speed, even by Tesla’s own historic standards,” writes Jonas. “Over the past week, the company is adding to its valuation an amount roughly equal to Ford’s (F) entire market cap on a daily basis. We’re struggling to play catch-up here with the valuation.”In June, Jonas downgraded Tesla to Underweight and warned that investors were treating it too much like a tech company as shares surpassed $1000.In his latest note Jonas reiterates his long terms concerns which likely won’t stop the rally near term.“Our concerns around sustainability of profit in China, poor auto industry fundamentals, and what we believe to be inevitable competition in EVs and AVs from a host of well-capitalized tech firms (AMZN, AAPL, GOOGL, etc.) are just not seen by the market as a big enough part of the narrative for the remainder of 2020,” he wrote.Story continuesGet the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreCrude supply 'dwarfed' by cuts in demand: oil watcherThere's a risk of a lost decade here:' former IMF adviserDon't expect shale to rise like a 'phoenix from the ashes': Oil expertThree reasons why things are looking up for homebuilder LennarFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}