{"article": [{"url": "https://finance.yahoo.com/news/nio-share-price-reflects-over-optimism-goldman-234212978.html", "published": 1595011820.0, "headline": "NIO share price reflects 'over-optimism': Goldman", "body": "NIO’s (NIO) stock price reflects “over-optimism”, says Goldman Sachs analyst Fei Fang.The Chinese electric vehicle maker’s American depository shares tumbled 14% on Friday following the analyst’s downgrade.“Post the 89% share price rally in the past month, we downgrade NIO to Sell on valuation, as we believe the current share price reflects over-optimism given no substantial changes to volume/profit expectations,” wrote Fang in a note to investors.The analyst reiterated his $7 price target on the stock which represents a 46% downside from Thursday’s closing price.NIO shares have been on fire lately, along with competitor Tesla (TSLA)— which analysts have been scrambling to keep up with.In early June, Fang had upgraded NIO to Buy ahead of the company’s vehicle deliveries, which smashed expectations. The analyst later downgraded the stock to Neutral.Earlier this month NIO surged 22% in one session after reporting a whopping 179% for its June sales.Since the pandemic, the EV manufacturer has secured funding and received cash infusions which “have largely removed any liquidity risk for the company between now and our expected break-even in 2022E,” wrote Fang.He noted potential changes which could lead his team to become more positive on the stock.“Successful deployment of these resources could lead to faster product launches, which could expand demand and accelerate break-even,” he added.Fang highlights NIO as being China’s first home-grown high-end passenger vehicle brand, which could benefit the company long term.“The Nio brand’s positioning provides the premium pricing power that we expect the company to leverage across model cycles and powertrain technologies,” he added.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070The days of $100 oil are over': Bubba Trading founderProposed direct listing change would 'encourage more companies to go public': IPO expert'There's a risk of a lost decade here:' former IMF adviserFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}