{"article": [{"url": "https://finance.yahoo.com/news/cost-of-confederate-symbols-comes-out-of-black-workers-paychecks-193859722.html", "published": 1594219580.0, "headline": "Cost of Confederate symbols comes out of Black workers’ paychecks: EPI", "body": "The protests against racism following the death of George Floyd have led to the removal of Confederate statues across the country. The bronze monument of Confederate General J.E.B. Stuart was taken down in Richmond, Va., on Tuesday, while dozens of others have been removed, toppled or vandalized over the past several weeks.Nascar has banned the Confederate flag at its sporting events and Mississippi recently became the latest state to remove the Confederate design from its flag. According to the Southern Poverty Law Center, there are currently numerous active public symbols of the Confederacy, particularly in the South.While activists and government officials have advocated for the removal of these monuments as symbols of racial oppression, there’s also a financial cost to Confederate symbols. And it comes right out of Black workers’ paychecks, according to the Economic Policy Institute.“Areas that actually chose to honor [Confederate generals] are racist,” EPI economist Jhacova Williams told Yahoo Finance. “Blacks are less likely to be employed in these areas. They’re more likely to be employed in low-status occupations, and they have lower wages compared to their white counterparts.”Streets named after Confederate generalsThe economic cost of symbols of historical oppression is reflected in the wages of Black Americans living in areas with streets named after Confederate generals, according to an EPI analysis of American Community Survey data.Crews attach straps to the statue Confederate General J.E.B. Stuart on Monument Avenue Tuesday July 7, 2020, in Richmond, Va. The statue is one of several that will be removed by the city as part of the Black Lives Matter reaction. (AP Photo/Steve Helber)When controlling for age, gender, marital status, education level, and state of residence, Black workers on average earn 21.3% less than their white counterparts. Black Americans residing in areas with streets named after Confederate generals face an additional 3.1% wage penalty.Williams acknowledged that renaming streets or monuments and removing the name of Confederate generals won’t fix the racial wealth gap.Rather, improving the election system and making it easier for all Americans to vote is the key to fighting discrimination in the labor market, Williams said. The election of politicians who implement policies that affect Americans is too important not to find ways to seriously consider ways to facilitate voting, including developing a safe means of voting online as an option, she explained.Story continues“I want us to actually expand our voting methods. We have an archaic voting system,” said Williams. “In Louisiana, where I’m from, you actually have to go to the polling station. I actually think that you should have vote by mail.”While President Trump has expressed his opposition to mail-in voting, stating that it increases the likelihood of fraud, several states have sent absentee ballot applications to voters.Given the fact that the number of coronavirus cases hit a new single day record of 60,000 infections this week, going to the polls continues to be a health risk.“I think that requiring that people actually come out to vote during a pandemic is voter suppression. You have to think about the history of lynchings. They were asking people to risk their lives to vote. And what our country right now is doing is the exact same thing,” said Williams. “Something is not right with that system.”More from Sibile:The upside of Trump’s Fourth of July fireworksThe case for higher wages during coronavirus recessionMaster P on Aunt Jemima, Uncle Ben’s: ‘Those are not real people’How JPMorgan Chase is making banking ‘cool’ for black teenagersKareem Abdul-Jabbar on how Bruce Lee beat the system, fought racismFind live stock market quotes and the latest business and finance news"}]}