{"article": [{"url": "https://finance.yahoo.com/news/microsoft-bethesda-deal-plan-to-crush-sony-192035782.html", "published": 1600698500.0, "headline": "Microsoft’s Bethesda deal is a $7.5 billion part of its plan to crush Sony", "body": "Microsoft (MSFT) on Monday announced plans to acquire video game giant Bethesda’s parent company ZeniMax Media, one of the world’s most important gaming firms, for a whopping $7.5 billion. The publisher of franchises ranging from “The Elder Scrolls” and “Doom” to “Wolfenstein” and “Fallout,” ZeniMax’s titles are some of the most storied in the industry.To say that Microsoft’s latest acquisition is a coup for the gaming powerhouse is an understatement. It not only adds 8 new studios to the company’s empire, bringing the total to 23, but, more importantly, ensures that ZeniMax’s titles will appear on Microsoft’s Xbox Game Pass subscription service the same day they hit the market. Titles from third-party developers often don’t make it to Game Pass until months after their initial release.“As a proven game developer and publisher, Bethesda has seen success across every category of games, and together, we will further our ambition to empower the more than three billion gamers worldwide,” Microsoft CEO Satya Nadella said in a statement following the announcement.Microsoft's $7.5 billion acquisition of Bethesda parent company ZeniMax is an opportunity for it to crush Sony in the coming console war. (Image: Microsoft)It’s a huge win for Microsoft, which is set to launch its Xbox Series S and Series X consoles in November, and proves the company is determined to steal the next-generation of the console wars from rival Sony (SNE) and its PlayStation 5.“With over 15 million subscribers currently on its Game Pass MSFT is doubling down on its consumer endeavors with this acquisition, a smart and strategic move in our opinion heading into its highly anticipated new console release,” Wedbush’s Dan Ives wrote in an analyst note following the announcement.ZeniMax’s library is beloved by gamersZeniMax’s 8 game studios provide Microsoft with the ability to push out titles for every form of gaming, whether that’s on consoles, PCs, or mobile. That includes Bethesda, the developer of “The Elder Scrolls V: Skyrim,” a game that’s been ported to so many different platforms it’s become a running joke about how many times the company can get gamers to buy the same title.Story continuesSubscribe to the Yahoo Finance Tech newsletter.It’s not just Bethesda, either. ZeniMax also owns Id Software, the developer of the “Doom” franchise; Arkane Studios, the developer of “Dishonored” and “Prey;” and Machine Games, the developer of the “Wolfenstein” franchise.These are games that sell millions of units over their lifetimes, and heavily influence the direction of the industry.Importantly, Microsoft says it will keep ZeniMax’s 2,300 employees and leadership structure in place. That gives hope that Microsoft will allow ZeniMax’s development studios and publishing houses to continue to operate as they have in the past, ensuring they are able to create and push out the kind of content that has won over so many gamers in the firm’s roughly 34-year history.Bethesda's \"The Elder Scrolls V: Skyrim\" is one of the most popular games ever produced by ZeniMax. (Image: Bethesda)The question as to whether Microsoft will make all of ZeniMax’s games exclusive to the Xbox and PC remains up in the air, but doing so would not only attract an unimaginable amount of criticism from gamers — it would also likely cut off a larger amount of revenue from gamers buying ZeniMax titles on other platforms like the PlayStation and Nintendo Switch.Microsoft already offers titles from its first-party studios on rival systems, so it seems likely that it will make the most popular ZeniMax games available on its competitors’ platforms, as well.Microsoft is maneuvering to crush Sony in the coming console warsIt’s important to note that Microsoft lost to Sony in the current console generation. It sold fewer units of its Xbox One than Sony sold of its PlayStation 4, roughly 50 million to 110 million, despite the prior generation’s Xbox 360 and PlayStation 3 nearly matching each other in sales.And with gaming continuing to explode in popularity—Microsoft estimates the industry will generate more than $200 billion in 2021—the tech giant is keenly aware that it needs its upcoming consoles to be major hits.The Xbox Series X will cost $499 when it launches in November. (Image: Microsoft)It’s already drawn first blood in earnest by offering its entry-level Xbox Series S for $299 compared to Sony’s entry-level PlayStation 5 Digital Edition, which will go for $399. Both companies are selling their high-end units, the Xbox Series X and PlayStation 5 standard edition, for $499.Microsoft isn’t banking on its consoles being its only money makers, though. The company is also offering its Xbox Game Pass service for $9.99 per month on PC or consoles and $15.99 for Game Pass Ultimate, which works on both PC and consoles and gives users access to the company’s xCloud game streaming service.Game Pass is easily the best deal in gaming, giving subscribers access to more than 100 games that can be downloaded, or streamed via your Android smartphone or tablet or console. But importantly, Microsoft makes games from its developers and publishers available via Game Pass the same day they go on sale in stores and online, something Microsoft made sure to point out about ZeniMax’s upcoming titles.Microsoft is clearly positioning itself to become an even greater player in the gaming industry than it already is, and with the ZeniMax acquisition under its belt, a low-priced Xbox on the way, and Game Pass’s incredible value, Sony should be watching its back.Correction: An earlier version of this article incorrectly stated that high-end consoles were $599. In fact, they're $499. The error has been corrected.Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Paying too much for cable? Here’s how to save.Apple debuts $399 Apple Watch Series 6 and $279 Apple Watch SEOracle’s TikTok win gives it a chance to prove it can take on Amazon and MicrosoftHow to watch the Apple event on Sept. 15, and what to expectFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}