{"article": [{"url": "https://finance.yahoo.com/news/wells-fargo-mary-mack-we-have-more-to-do-on-rebuilding-reputation-225536068.html", "published": 1595354600.0, "headline": "Wells Fargo's Mary Mack: 'We have more to do' on rebuilding reputation", "body": "A top Wells Fargo executive says the company is committed to using customer and employee feedback as part of its efforts to repair its reputation following its 2016 fake account scandal.Mary Mack, the bank’s CEO of consumer and small business banking, told Yahoo Finance Tuesday that Wells Fargo (WFC) has been measuring customer satisfaction “much more robustly” and committed the company to making changes based on the feedback received.“We have more work to do but we’re delighted with the progress we’re making,” Mack said.In September 2016, the company was found to have fraudulently opened millions of credit card and deposit accounts without customers’ permissions. Pressure on employees appeared to be the root cause of the issue, leading to fines from several regulators and a Federal Reserve-imposed asset cap that broadly restricts the company from growing any further.The company, the third-largest in the United States, launched efforts to “re-establish” its brand and launched efforts to overhaul the employee incentive structure that had previously pushed fraudulent cross-selling.Mack told Yahoo Finance that the company has made strides in changing its internal culture to clarify employee expectations and improve the incentive structure.“And that has translated through to the customer experience,” Mack said.Challenges aheadBut the company may face further challenges as the COVID-19 crisis imposes heavy financial strains on banks like Wells Fargo. Lenders have had to dramatically increase their provisions to absorb loan losses and consumers and businesses struggle to make loan payments.Mack said the company has revised down its expectations for how the U.S. economy may look in the third quarter of this year, given the difficulty in some parts of the country to contain the virus.“It’ll be a better quarter but probably not as much of a recovery as we might have expected even just a few weeks ago,” Mack said, although she expressed some optimism over trends in credit card and debit card spend.Story continuesWells Fargo reported earnings last week, which showed a net loss in the second quarter. The San Francisco-based bank slashed its dividend to preserve capital. Wells Fargo CEO Charlie Scharf also said he was planning on cutting about $10 billion in expenses to improve its bottom line, which could include layoffs.Mack did not provide more details on where it might make those cuts, but she committed the company to offering “transparency and visibility” as it addresses expenses.“We’ll involve employees and customer feedback in the programs that we establish and the changes that we make,” Mack said.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Senate panel advances Trump nominees Shelton, Waller for spots at FedYahoo U: What are SPACs?Fed expands Main Street loan program to nonprofitsEXCLUSIVE: NY Fed's Williams: 'Not the time to think' about rate hikesA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}