{"article": [{"url": "https://finance.yahoo.com/news/republican-national-convention-trump-fights-for-reelection-amid-health-economic-crises-150948187.html", "published": 1598264240.0, "headline": "Republican National Convention: Trump fights for re-election amid coronavirus, economic crises", "body": "President Donald Trump will make his case for re-election this week during the Republican National Convention.He will formally accept the Republican nomination from the White House under much different circumstances than in 2016, when he made his acceptance speech in front of a massive crowd.At the start of this election cycle, it seemed almost certain Trump would be campaigning on a strong U.S. economy. Then the COVID-19 pandemic changed everything.In the beginning of 2020, Trump frequently touted the United States’ economic strength — pointing to the unemployment rate below 4% and a stock market setting records. “America is now the hottest economy anywhere in the world,” he said in January.Throughout his first term, Trump has taken full credit for the U.S. economy, ignoring the economic growth of the President Obama years.In 2017, with a Republican U.S. House of Representatives and Senate, Trump signed his signature tax cuts into law.“I consider this very much a bill for the middle class and a bill for jobs,” he said as he signed the Tax Cuts and Jobs Act. “Jobs are produced through companies and corporations and you see that happening. Corporations are literally going wild over this.While in office, Trump has publicly clashed with CEOs and businesses whose policies he doesn’t like. He’s gone after Amazon, Twitter, GM and many others. Most recently, he called for the boycott of Ohio-based tire manufacturer Goodyear. He repeatedly attacked Federal Reserve Chairman Jerome Powell and pressured the Fed to cut interest rates.Trump declared himself “a tariff man” and used the tariffs as a negotiating tactic, often despite opposition from many within his own party and the business community. “I love properly-put-on tariffs,” he said earlier this month in Ohio.....I am a Tariff Man. When people or countries come in to raid the great wealth of our Nation, I want them to pay for the privilege of doing so. It will always be the best way to max out our economic power. We are right now taking in $billions in Tariffs. MAKE AMERICA RICH AGAIN— Donald J. Trump (@realDonaldTrump) December 4, 2018Trump made good on a 2016 campaign promise to negotiate the North American Free Trade Agreement. The newly branded United States Mexico Canada Agreement (or USMCA) earned the support of labor groups and Corporate America alike.Story continuesIn January, he also signed the Phase 1 trade deal with China, but only after a trade war that resulted in tariffs on hundreds of billions of dollars in goods that hurt U.S. businesses and farmers.FILE - In this Wednesday, Jan. 15, 2020, file photo, U.S. President Donald Trump, right, signs a trade agreement with Chinese Vice Premier Liu He, in the East Room of the White House, in Washington. China’s government welcomed an interim trade deal with Washington and said Thursday the two sides need to address each other’s “core concerns.” (AP Photo/Evan Vucci, File)Roughly seven months later, the United States’ relationship with China is as rocky as ever. Trump frequently blasts the Chinese government over its handling of the coronavirus.“I don't want to deal with them now. With what they did to this country and to the world, I don't want to talk to China right now,” said Trump earlier this month.As the coronavirus continues to plague the United States, voters will judge Trump on his handling of the virus he downplayed for months. More than 170,000 Americans are dead, the unemployment rate is at 10.2% as millions remain out of work, and small businesses are going under as the wealthiest nation in the world continues to be battered by the virus.Boosted by trillions of dollars in stimulus, U.S. stocks have bounced back from their March lows. Trump insists his administration is handling the virus well, often using the stock market as a measure of success.The president is making the case that he is the only candidate who can bring the economy back, but Democrats argue the United States can’t afford four more years of Donald Trump.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:'He will cheat': DNC organizes to combat Trump's 'suppression efforts'Trump is trying to 'undermine confidence' in democracy: Democratic rep.What to expect from the 2020 conventions: 'As good a TV show as they can have'Coronavirus response: Breaking down the debate over liability protectionsCoronavirus stimulus: What’s next for small business?White House, Senate GOP continue to debate stimulus plan as jobless claims rise"}]}