{"article": [{"url": "https://finance.yahoo.com/news/blk-capital-management-a-pipeline-for-black-men-and-women-in-finance-133844573.html", "published": 1593333980.0, "headline": "A Harvard student's brainchild creates a pipeline for Black finance hopefuls", "body": "According to a recent study by recruitment firm Vettery, less than 10% of Wall Street is Black or Hispanic. It’s a statistic that Angel Onuoha is trying to change through his fund BLK Capital Management.The rising Harvard senior started the non-profit fund to help other students like himself break into the world of investing and finance.College students apply to join BLK, which provides education and financial literacy to members. Through the fund, students are able to gain real hands-on experience with investing. Instead of taking a profit, Onuoha said all gains made by the fund are placed back into the pool to allow for continued investing.Since starting the fund after his freshman year at Harvard, Onuoha has gone on to partner with big banks like JP Morgan Chase, Goldman Sachs, and Bank of America, which provided roughly $100,000 in seed money for the fund.“One of the big reasons we partnered with a lot of these firms is because they are really looking to make big changes on the aspect of diversity,” Onuoha told Yahoo Finance.“And so we’re able to provide them not only the opportunity to get students to hire for the firms, but also then the opportunity to see the importance of how diversity can make a difference, in terms of the business aspect of it,” he added.‘Kind of intimidating’A graduate poses for a selfie during Harvard's 368th commencement ceremony at Harvard University in Cambridge, Massachusetts, on May 30, 2019. (Photo by Allison Dinner / AFP) (Photo credit should read ALLISON DINNER/AFP via Getty Images)Onuoha says he started BLK after joining finance groups on his college campus, and noticing he didn’t see many students of color in the room.“It’s kind of intimidating coming into that scenario,” he explained. “So that was basically the whole impetus behind BLK. Can we create a space and an organization where you can come in with zero knowledge and teach them everything you need to know about finance?”Over the course of the last several years, BLK has grown to 65 schools, with 175 members. More he says are being added each year. But Onuoha insists the fund isn’t just an “internship opportunity,” but “really a development into a longstanding relationship.”Story continuesHe added that “the relationships that we build through BLK Capital Management through the conferences and networking opportunities last with you throughout your entire career.”Onuoha suggested that the finance world can be small and insular. Through BLK students can develop relationships with people from around the country that can be potential business partners in the future.And the pipeline created by BLK can be a win for both banks and students — especially as firms look for talent to bolster diversity.“We’re providing the students the opportunity to go into the industry and make a change from within,” he said.“A lot of them do. A lot of them decide to go into a bunch of different opportunities in finance. We have a lot of students going to the big firms, but then a lot of them also go to a lot of the smaller companies and partner with us as well,” Onuoha said.“We’ve seen amazing returns from a lot of the companies that we partner with.”Kristin Myers is a reporter at Yahoo Finance. Follow her on Twitter.Read more:Increasing number of Republican states projected to see a spike in coronavirus deathsCompanies ‘haven’t done the work’ around diversity and inclusion: Bozoma Saint JohnBiden outraises Trump for month of May amid coronavirus, George Floyd protests‘We need more funding for police’: Missouri AG SchmittWhy Black wealth has stayed 'relatively flat' since Tulsa massacreRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}