{"article": [{"url": "https://finance.yahoo.com/news/impossible-foods-gets-200-million-of-funding-190024706.html", "published": 1597327700.0, "headline": "Impossible Foods gets $200 million of fresh funds", "body": "Investors salivating at the prospect of buying some Impossible Foods stock on the public market will have to wait a little longer.The fast-growing plant-based meat startup said Thursday it secured a fresh $200 million in funding, led by new investor Coatue. Impossible has now raised $1.5 billion since its founding in 2011. It’s last funding round of $500 million came back in mid-March.Coatue — which has traditionally focused on the tech space — is no stranger to cutting big checks for buzzy startups. The company had stakes in Uber, Lyft, Grab and Snap. It reportedly has more than $25 billion in assets under management.Existing investors in Impossible, Mirae Asset Global Investments and Temasek, also contributed to the Series G round alongside other new name XN.Impossible plans to use the funds to expand its R&D capabilities, accelerate manufacturing production, and support a wider retail store rollout.\"Impossible Foods\" burgers made from plant-based substitutes for meat products sit on a shelf for sale on November 15, 2019 in New York City. - Vegetarian alternatives to burgers and sausages, revived by start-ups like Beyond Meat and Impossible Burger, are enjoying a certain enthusiasm that meat giants also want to enjoy. Since this summer, the world leader in the JBS sector has been marketing a soy burger in Brazil that includes beetroot, garlic and onions, with a look similar to a rare minced steak. In the US, the largest meat producer Tyson Foods launched a new line of products in June based on plants or mixing meat and vegetables. Its competitors Hormel Foods, Perdue Farms or Smithfield, have similar initiatives. (Photo by Angela Weiss / AFP) (Photo by ANGELA WEISS/AFP via Getty Images)“The use of animals to make food is the most destructive technology on Earth, a leading driver of climate change and the primary cause of a catastrophic global collapse of wildlife populations and biodiversity,” said Dr. Patrick O. Brown, M.D., Ph.D., CEO and founder of Impossible Foods, in a statement.Brown added, “Impossible Foods’ mission is to replace that archaic system by making the most delicious, nutritious and sustainable meats in the world, directly from plants. To do that, Impossible Foods needs to sustain our exponential growth in production and sales, and invest significantly in R&D. Our investors believe in our mission to transform the global food system — and they recognize an extraordinary economic opportunity.”Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}