{"article": [{"url": "https://finance.yahoo.com/news/why-retail-stocks-deserve-to-be-battered-181649083.html", "published": 1597757060.0, "headline": "Why retail stocks deserve to be battered", "body": "The magic carpet ride that most retail stocks have been on lately probably needs to return back to the reality that is planet Earth.And very soon.Shares of retail heavyweights such as Nordstrom, Macy’s, Kohl’s, and Simon Property Group were battered on Tuesday. At first blush, the reason for several of the double-digit percentage selloffs isn’t so readily apparent. Walmart blew it out of the water with its second-quarter earnings release this morning. Consumers took their big, fat stimulus checks from Uncle Sam and splurged a bit on non-essential home goods and perhaps a few extra bags of frozen food.Meanwhile, Home Depot’s earnings release Tuesday morning was no slouch either. Armed with rock bottom interest rates (thank you, Federal Reserve chief Jerome Powell) and a ton of time on their hands, home remodelers sent Home Depot’s U.S. same-store sales up 25%. A Home Depot spokesperson told Yahoo Finance the sales increase was its best showing since 2000.All in all, at least on paper not a bad way to kick off retailer earnings season this month. But the feel good news stops right there as both Kohl’s and Walmart issued a dose of dark commentary on the current health of retail.Kohl’s CEO Michelle Gass left it all on the field on her earnings call, saying there is a lot of “destruction” in retail at the moment. Gass is right — the retail bankruptcies continue to pile up, pressuring those not close to going out of business. Even though investors know this retail death narrative, hearing a prominent CEO in Gass utter the word destruction — following a quarter where sales plunged 22.9% — is akin to yelling fire in a crowded theater.“There are literally thousands of stores that unfortunately are facing dire consequences and facing closures,” Gass told analysts, vowing to go after that market share.Investors aren’t so sure on that one — Kohl’s shares were rocked by 16% on trading session.Over at Walmart, executives warned sales have weakened considerably after its impressive quarter as COVID-19 stimulus checks ran out.Story continues“Q2 sales started strong, both in-store and online, particularly in general merchandise, helped by government stimulus spending. Grocery sales had another strong quarter. As stimulus funds tapered off, sales started to normalize, but July comps still grew more than 4%,” Walmart pointed out in a presentation detailing its latest earnings report. The company was referencing the trends in its bread and butter U.S. business.Walmart shares were slightly in the red after popping by about 6% in pre-market trading.COCONUT CREEK, FL - JULY 17: A general view of people shopping at Walmart as U.S. corporations implement mandatory masks to be worn in their stores upon entering to control the spread of COVID-19 as Florida's Department of Health on Friday confirmed 11,000 new cases of COVID-19 in a single day on July 17, 2020 in Coconut Creek, Florida. Credit: mpi04/MediaPunch /IPXGiven this fresh round of gloom — and more probably on the way as retailers continue to report earnings this month — one has to wonder if the rally in retail stocks is as cooked as a piece of fried chicken.The VanEck Vectors Retail ETF is up 22% in the past three months amid solid retail sales data, which now appears to be well in the rearview mirror absent another stimulus plan for struggling U.S. households. The Consumer Discretionary Select Sector SPDR Fund has rocketed 27% in the past three months. Indeed, that move higher looks overdone, too, if consumer spending is about to fall off a cliff — no thanks to bumbling politicians.“Back to school [shopping] is a huge question mark. And it does raise the question now that people have paid their taxes three months later and perhaps the extra unemployment insurance of $600 is done, consumers are pulling back. That’s what investors are asking about right now,” said SW Retail Advisors founder Stacey Widlitz on Yahoo Finance’s The First Trade.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}