{"article": [{"url": "https://finance.yahoo.com/news/kroger-ceo-covid-19-pandemic-has-changed-how-we-shop-for-food-160447841.html", "published": 1600081940.0, "headline": "Kroger CEO: COVID-19 pandemic has changed how we shop for food", "body": "The days of driving to a supermarket for a package of hot dogs and a case of soda may be a thing of the past in the post-pandemic world.In fact, it’s becoming a thing of the past right now at supermarket giant Kroger (KR). The company posted an impressive 127% second quarter surge in its digital sales as shoppers ordered online and either had groceries delivered straight to their homes or drove to a store and had packages put directly in their trunks. Triple-digit growth in digital food ordering was also seen at the likes of Target and Walmart in the second quarter, underscoring consumers growing more comfortable with online grocery shopping.“There is no doubt people are shopping differently. People aren’t going to the stores as frequently. One of the things that, as part of our Restock Kroger initiative, we had made significant investments on our digital and technology platforms. When COVID started, our [online] business doubled overnight and everything was able to support that because of the investments we made,” Kroger Chairman and CEO Rodney McMullen told Yahoo Finance’s The First Trade.McMullen added, “We hired over 40,000 associates to take care of that over 100% growth in demand. Our customers tell us they appreciate it, they find it helpful and allows them not to physically be in a store if they don’t want to be. That’s what we are trying to do, take care of the customer any way they want to be taken care of.”Kroger’s strong digital sales were a key ingredient in its better-than-expected quarter and full-year outlook.Kroger chairman and CEO Rodney McMullen has reason to smile after a big second quarter. REUTERS/Lisa BaertleinThe company’s closely watched identical sales — excluding fuel price fluctuations — rose 14.6% in the quarter. Adjusted earnings gained 66% year-over-year to 73 cents a share.For the full year, Kroger outlined 13% growth in identical sales and earnings per share growth in the 45% to 50% range. The company also revealed a new $1 billion stock repurchase plan, which could do its part in helping to get Kroger’s stock multiple to trade more in line with competing retailers.Story continuesDespite the big second quarter sales and earnings gains, a lot of analysts on the Street have remained measured on the stock’s near-term direction. While they appreciate the progress on digital, concern does persist on digital profitability, a sales slowdown next year as the pandemic subsides and margin pressure from an effort to offer sharper prices.McMullen appreciates the sell-side’s take, but isn’t letting it get him down.“We respect all the analysts that follow us. We are focused on taking care of our customers. One thing we shared with our investors is that if you look at 2021, we would expect the year to be higher than what 2021 would have been without the pandemic. And we thought it was really important to give that insight. The other thing is that customers are telling us they enjoy cooking at home and enjoy eating as a family, and it’s starting to become a habit versus something that’s just temporary. And all of those things give us incredible confidence and expectation for the future,” McMullen added.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meMagic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}