{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-10-2020-222333493.html", "published": 1597080980.0, "headline": "Stock market news live updates: Stocks trade mixed as investors eye earnings, Trump's virus orders", "body": "Stocks traded mixed, as market participants considered more earnings results and the potential for more virus-related stimulus measures. The S&P 500 came within 0.8% of its record closing high from February 19.[Click here to read what’s moving markets heading into Tuesday, August 11]Investors digested a new slate of executive orders from President Donald Trump, who sidestepped Congress in moving ahead on Saturday with actions to provide support for the virus-hit economy. The executive orders drew the ire of Democratic lawmakers, with House Speaker Nancy Pelosi calling the actions “absurdly unconstitutional” during a CNN interview. Administration officials defended the orders, however, with Treasury Secretary Steven Mnuchin saying on Fox News that the orders were cleared by the Office of Legal Counsel.The executive actions implement $400 weekly federal enhanced unemployment insurance benefit, relief for student borrowers, and temporary payroll tax suspension starting Sept. 1, and direct the Secretary of Health and Human Services and Director of the CDC to limit residential evictions and foreclosures. The move to quickly roll out these actions came after two weeks of talks in Congress failed to convene lawmakers around terms of a new relief bill.“President Trump issued executive orders in the four policy areas that had been expected. The extra $400 unemployment payment is likely to last only a month, however. The payroll tax deferment would last through year-end, but consumers might be hesitant to spend extra income without a change in tax law,” Goldman Sachs economists Alec Phillips and Blake Taylor wrote in a note Sunday.The new executive orders could, however, add pressure on Congress to come together to roll out a more comprehensive fiscal package, they added. Already late last week, Democratic lawmakers pared back the size of their proposal to and offered a plan totaling about $2 trillion, from the about $3.5 trillion they had called for earlier this year, and in doing so narrowed the fissure between their and Republican lawmakers’ $1 trillion proposal. The Trump administration struck down the offer, however, and no firm timeline for further stimulus talks among lawmakers has been set.Story continues“We continue to expect a package worth around $1.5 trillion to become law in August,” the Goldman Sachs economists said. “The new executive orders create two deadlines around the end of the month, which could provide a new incentive for Congress to act.”Other economists, however, took the opposite stance, and suggested the roll-out of the orders could disincentivize further progress from Congress.“The executive orders could reduce the urgency for Congress and the White House to get a more comprehensive deal done. If this is all we get for fiscal policy for the rest of the year it would represent a significant downside risk to our growth outlook,” JPMorgan economists led by Michael Feroli said in a note Monday afternoon. “These executive orders likely will provide stimulus of less than $100 billion, while we have been expecting Congress to add at least $1.0-1.5 trillion of spending once an agreement is reached. We continue to believe that Congress will get a deal done, but we see the path toward that deal complicated by the weekend’s developments.”Elsewhere, earnings season continues later on Monday, with Novavax (NVAX), IAC/InteractiveCorp (IAC), Occidental Petroleum (OXY), J2Global (JCOM) and ZoomInfo Technologies (ZI) set to report quarterly results after market close.—4:02 p.m. ET: Stocks close mixed as tech shares decline, S&P 500 rises for seventh straight sessionHere were the main moves in markets as of 4:02 p.m. ET:S&P 500 (^GSPC): 3,351.28 to Previous CloseDow (^DJI): +359.40 (+1.31%) to 27,792.88Nasdaq (^IXIC): -42.63 (-0.39%) to 10,968.36Crude (CL=F): +$0.78 (+1.89%) to $42.00 a barrelGold (GC=F): +$6.80 (+0.34%) to $2,034.80 per ounce10-year Treasury (^TNX): +1.2 bps to yield 0.5740%—1:58 p.m. ET: Q2 earnings are coming in much better than feared – and now analysts are raising estimates for FY2020With second-quarter earnings results beginning to wind down, analysts have turned their attention to the current quarter and unleashed a sweep of upward revisions. This came as second-quarter results mostly cleared a low bar of expectations: According to FactSet, 83% of S&P 500 companies that had reported results as of last Friday beat expectations, or the highest proportion since FactSet began keeping records of these metrics in 2008.“Bottom-up consensus forecasts currently call for $129 and $165 of EPS [earnings per share] in 2020-21, up from June 30 estimates of $124 and $162, an improvement of 4.3% and 1.6%, respectively,” Credit Suisse analyst Jonathan Golub wrote in a note Monday. “3Q-4Q estimates have risen by 2.6% and 0.1%.”Estimates for fiscal 2020 have improved the most for companies in the discretionary and health-care sectors, Golub added, and the last for industrials, utilities and REITs.Moreover, DataTrek co-founder Nicholas Colas pointed out in a note Monday morning that 2020 EPS estimates have room for still-further upward revisions, with analysts having applied the bulk of upward revisions to the third-quarter this year.“Wall Street analysts dramatically underestimated earnings leverage in Q2 and are being very cautious in revising their estimates for the rest of 2020, all of which points to further upside revisions to come,” Colas said.—11:36 a.m. ET: S&P 500, Nasdaq turn negative as tech shares fall; Dow holds higherThe S&P 500 and Nasdaq each turned negative late Monday morning as declines in tech shares weighed on the indices. Facebook, Amazon, Netflix, Microsoft, and Alphabet were lower.The Dow still held higher by 0.84%, or 230 points. Boeing and Nike led advances, with each stock rising more than 4% intraday.—10:09 a.m. ET: Job openings unexpectedly increase in JuneJob openings in the US rose by 518,000 to 5.889 million in June, from the 5.371 million in May, the Bureau of Labor Statistics said Monday in its Job Openings and Labor Turnover Summary (JOLTS).Consensus economists had expected job openings to decline to 5.3 million.The percentage of layoffs and discharges in June held steady at 1.4% to match May’s rate. Meanwhile, the quits rate rose to 1.9% in June, rising further from the April low of 1.3%, but coming in well below the recent high of 2.9% in August 2018. A higher quits rate typically corresponds to greater confidence in regaining another job in the labor market.——9:31 a.m. ET: Stocks open higher, shaking off overnight declinesHere were the main moves in markets, as of 9:31 a.m. ET:S&P 500 (^GSPC): +6.89 points (+0.21%) to 3,358.17Dow (^DJI): +115.67 points (+0.42%) to 27,549.15Nasdaq (^IXIC): +21.15 points (+0.19%) to 11,032.90Crude (CL=F): +$0.69 (+1.67%) to $41.91 a barrelGold (GC=F): +$15.80 (+0.78%) to $2,043.80 per ounce10-year Treasury (^TNX): -1.3 bp to yield 0.549%—8:15 a.m. ET: Royal Caribbean revenue sinks 94% after cruise operations halted during Q2Royal Caribbean (RCL) posted a 94% slide in revenue to $175.6 million, but still beat consensus analyst expectations for a drop to $129.2 million. Its second quarter adjusted loss per share of $6.13, however, was wider than the $4.88 per share expected.The results came after Royal Caribbean’s business was effectively frozen for all of the second quarter, with the company having suspended its global cruise operations starting March 13. In terms of future bookings, Royal Caribbean said its booked position for 2021 is “trending well and is within historical ranges.As of June 30, the Company had $1.8 billion in customer deposits, with $300 million of these for sailings during the fourth quarter this year. Just under half of the guests booked on canceled sailings had requested cash refunds.—7:34 a.m. ET: Marriott International reports swings to a bigger than expected loss, with business ‘profoundly impacted’ by pandemicLodging company Marriott International (MAR) reported a worse than expected 72% slide in second-quarter revenue and swung to a bigger than expected loss, as the coronavirus pandemic decimated travel demand earlier this year.The company delivered a second quarter adjusted loss per share of 64 cents, or wider than the 42 cents expected. Revenue of $1.46 billion missed expectations for $1.63 billion.Worldwide revenue per available room (RevPAR) fell 84.4%, comprising a drop of 83.6% in North America and 86.7% outside North America.However, the company has begun to see signs of a recovery in travel demand, led by Greater China.\"While our business continues to be profoundly impacted by COVID-19, we are seeing steady signs of demand returning. Worldwide RevPAR has climbed steadily since its low point of down 90% for the month of April, to a decline of 70% for the month of July,” CEO Arne Sorenson said in a statement. “Worldwide occupancy rates, which bottomed at 11% for the week ended April 11, have improved each week, reaching nearly 34% for the week ended August 1. Currently, 91% of our worldwide hotels are now open compared to 74% in April, and 96% are open today in North America.—7:25 a.m. ET Monday: Stock futures struggle for direction ahead of the opening bellHere were the main moves in markets, as of 7:25 a.m. ET:S&P 500 futures (ES=F): 3,346.5, up 1.75 points, or 0.05%Dow futures (YM=F): 27,409.00, up 76 points, or 0.28%Nasdaq futures (NQ=F): 11,116.00, down 6.75 points, or 0.06%Crude (CL=F): +$0.58 (+1.41%) to $41.80 a barrelGold (GC=F): +$9.90 (+0.49%) to $2,037.90 per ounce10-year Treasury (^TNX): -0.9 bp to yield 0.553%—6:11 p.m. ET Sunday: Stock futures open mixedHere were the main moves in equity markets, as of 6:11 p.m. ET:S&P 500 futures (ES=F): 3,343.5, down 1.25 points, or 0.04%Dow futures (YM=F): 27,318.00, down 15 points, or 0.05%Nasdaq futures (NQ=F): 11,131.00, up 8.25 points, or 0.07%Traders work during the opening bell at the New York Stock Exchange (NYSE) on March 16, 2020 at Wall Street in New York City. (Photo by Johannes EISELE / AFP) (Photo by JOHANNES EISELE/AFP via Getty Images)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}