{"article": [{"url": "https://finance.yahoo.com/news/the-us-saw-the-highest-rate-of-new-female-ce-os-so-far-this-year-new-analysis-155119470.html", "published": 1594983560.0, "headline": "The US saw the highest rate of new women CEOs so far this year", "body": "U.S. businesses saw the highest rate of new women chief executives on record. This comes as a diverse and inclusive Corporate America has become an urgent demand, not just a nice to have.Of the 591 replacement CEOs recorded in the first half of 2020, 138, or 23.4% were women, according to outplacement and executive coaching firm Challenger, Gray & Christmas. This is the highest rate recorded since Challenger began tracking gender metrics in 2010.This increase is up from 21.6% of female CEO replacements in the first half of 2019 and up 18.6% from the first half of 2018.Women are taking the top posts in many government and nonprofit jobs, making up 58.5% of all incoming CEOs in that sector. Of the six incoming CEOs in the apparel industry, three are women. In the tech sector, there were 79 total replacements. Women took up eight of those roles — or 10.1%, which is an increase from the 6.7% for the first half of 2019.Meanwhile, there were year-over-year declines in female representation at the top of health care and retail companies. Thirty percent of new hospital CEOs are women this year, down from 36% the same period last year. Retailers have announced two new women CEOs out of 14, or 14%, down from 22% in 2019.Some notable turnovers include former Old Navy chief Sonia Syngal getting promoted to chief executive of Gap (GPS), Jan Singer replacing Jim Brett at the beleaguered J.Crew, Shar Dubey stepping up to the top job at Match Group (MTCH) and Frances Allen replacing Rick Silva at Checkers and Rally’s.CEO of Gap Inc. Sonia Syngal speaks during a roundtable discussion with industry executives and US President Donald Trump on reopening the country, in the State Dining Room of the White House in Washington, DC on May 29, 2020. (Photo by MANDEL NGAN / AFP) (Photo by MANDEL NGAN/AFP via Getty Images)\"Gender diversity, along with other visible and unseen diversity, is crucial to creating an environment that finds and develops the best talent for the role. In the wake of nationwide protests for racial equity, many companies have made public statements that they will strive for more diversity. It remains to be seen how this will translate to meaningful change,\" Andrew Challenger, vice president of Challenger, Gray & Christmas, said in a statement.Story continuesStill disproportionately whiteThough it’s welcome progress, men still account for the overwhelming number of CEO appointments, accounting for 76.6% of the replacements recorded so far this year. In 54 of those instances, men were named as replacements for women. So far in 2020, women have replaced male CEOs 92 times, up from 81 times during the first half of 2019.Female leadership is an invaluable asset, particularly during times of tumult, according to theBoardlist CEO Shannon Gordon.“The empathy that it requires is often a female leadership trait and desperately needed in the boardroom right now,” she said in an April interview with Yahoo Finance.While Challenger’s report does provide a comprehensive data set, including U.S.-based companies that have been in business for at least two years with a minimum of 10 employees, it does not provide a breakdown by racial or ethnic background, though a spokesperson suggested that metric will be integrated in upcoming reports.Female leadership in the highest-ranking roles is pointing in the right direction, but the list is disproportionately comprised of white women. In June, Stacy Philpot-Brown, a leading figure in paving the way for more representation in tech, announced she would be departing TaskRabbit. She first joined the company in 2013 and became the CEO in 2016, leading the company’s sale to Ikea in 2017. Her replacement has not yet been named. To date, Ursula Burns has been the only Black woman to lead a Fortune 500 company but she stepped down as the CEO of Xerox in 2016.Melody Hahm is Yahoo Finance’s West Coast correspondent, covering entrepreneurship, technology and culture. Follow her on Twitter @melodyhahm.Read more:Social network of 9,000 Black professionals will be much more than 'just a Black talent pool': CEO'People can't apply to jobs they don't know exist': 2 simple ways employers can find Black talentDefeat by Tweet: New Super PAC uses Trump’s go-to tool against himCEO on Trump’s visa ban: ‘Cutting off others’ will not lead US to prosperityIf Target, Whole Foods join 15 Percent Pledge it could lead to $15 billion investment in Black communities: campaign founderAllegations of systemic workplace racism took down execs at Bon Appétit, CrossFit and more"}]}