{"article": [{"url": "https://finance.yahoo.com/news/these-3-states-and-washington-dc-are-raising-their-minimum-wage-133648248.html", "published": 1593506660.0, "headline": "These 3 states – and Washington, D.C. – are raising their minimum wage", "body": "Twenty-one states had minimum wage increases or cost of living adjustments at the beginning of 2020.And now, halfway into 2020, more are set to continue pushing the nation’s average minimum wage upwards even as the federal minimum wage remains at $7.25.On July 1, Illinois is set to increase its rate to $10 an hour. Oregon’s standard minimum wage will move to $12 ($11.50 for non-urban counties) and Nevada’s rate becomes $9 for employees without health care ($8 if you have that perk).And Washington, D.C. will institute a $15 an hour minimum wage on Wednesday, a long-time goal of the Fight for $15 movement influential in the recent Democratic primary. A number of states, including California and Massachusetts, are scheduled to reach $15 in the coming years.In some cities that have leeway to set higher rates, low-wage workers earn even more. Berkeley, Calif.’s minimum wage, for example, is set to become $16.07 an hour this week.Workers in 19 states still earn the federal minimum of $7.25. Two additional states — Wyoming and Georgia — have a state minimum wage below the federal level but workers there are entitled to the federal minimum wage unless their employer is not covered by the federal Fair Labor Standards Act.\"We are just working our way up to what's truly a fair wage in our country,\" says Kelly Vlahakis-Hanks, president and CEO ECOS, who also works with Business for a Fair Minimum Wage, a group that advocates for higher rates.The United States of Minimum WageECOS, which manufactures environmentally friendly cleaning products, has a factory in Addison, Ill., one of the states set to see a wage increase this week. ECOS already starts employees at $17 an hour and argues it’s in the interest of other businesses to embrace the wage increase.\"There's so many costs that hit the bottom lines of businesses that experience high turnover and people that are paying low wages have a lot of high turnover,” Vlahakis-Hanks says, noting that the costs can hit in places from recruiting to productivity to low morale.Story continuesThe minimum wage during the pandemicMany of the states currently seeing a surge in coronavirus cases are in regions of the country – like the Southeast – where wage rates are likely to be at or near the federal minimum.Texas, for example, has seen record cases and recently paused its economic reopening. Its minimum wage is at the federal level. Another hard-hit state, mandates at least $8.46 per hour. Washington State’s minimum wage of $13.50 an hour is the most generous in the U.S.“Boosting the minimum wage will help businesses and communities in dealing with the pandemic and moving toward shared recovery,” says Holly Sklar of Business for a Fair Minimum Wage.But low-wage workers have been hit so hard by the ongoing pandemic that the effect of wage increases is likely to pale next to the ongoing job losses and cut hours. In Illinois, the Chicago Sun-Times talked to low-wage workers ahead of the wage increase and found stories of income plummeting because of deep cuts in number of working hours. Nearly one in five of all adults either lost their jobs or had their hours reduced at work in March, according to a report by the Federal Reserve. The job cuts were most severe for lower-income workers, with 39% of people with a household income of less than $40,000 reporting a job loss in March.An 11-year long debateThe last time that the federal minimum wage was raised was July 24, 2009.It is a record length of time with no increase since the first minimum wage in 1938 ($0.25 an hour) was signed into law. Some conservative groups have successfully argued against raises, saying a higher minimum wage would hurt the people it’s trying to help. The National Restaurant Association has called the idea of raising the federal rate “a job killer.”Demonstrators in Chicago march for a $15-per-hour minimum wage in April 2019. (Scott Olson/Getty Images)A 2013 study by the left-leaning Center for Economic and Policy Research came to a different conclusion: “The weight of that evidence points to little or no employment response to modest increases in the minimum wage.” In a 2019 report the Congressional Budget Office found that gradually raising the federal minimum wage to $15 by 2025 would increase wages for 17 million workers, but another 1.3 million workers would lose their jobs.Democrats passed a bill last year in the House of Representatives to raise the federal minimum wage, but as expected, the bill was ignored by the Senate. Former Vice President Joe Biden has proposed raising the federal minimum wage to $15 “across the country” and then adding regular cost of living adjustments in subsequent years.President Trump has largely been silent on a minimum wage but he championed ideas in the past that would help the lowest wage earners. On the 2016 campaign trail, Trump proposed an expansion of the Earned Income Tax Credit, which would effectively bump the wages of the lowest-wage workers but the president has not pursued the idea in office.Ben Werschkul is a producer for Yahoo Finance in Washington, DC.These 21 states are raising their minimum wage for 2020Minimum wage hasn't been raised for the longest time in historyThe Democratic case (to business) for raising the minimum wageRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit."}]}