{"article": [{"url": "https://finance.yahoo.com/news/mutual-funds-facebook-amazon-apple-microsoft-google-problem-185739448.html", "published": 1598450720.0, "headline": "Mutual funds have a FAAMG problem", "body": "The S&P 500 (^GSPC) has been trading near all-time highs. But the index is the most concentrated it has ever been, which presents a big problem for some mutual funds.An enormous 23% of the index’s value comes from five enormous mega-cap stocks that have exploded away from the greater market: Facebook (FB), Amazon (AMZN), Apple (AAPL), Microsoft (MSFT), and Alphabet (GOOG, GOOGL) — otherwise known as “FAAMG.” The middle three each account for over 5% of the index.As a recent note from Goldman Sachs pointed out, many funds have limits that restrict concentrations of individual stocks to 5% and industries to 25% maximum. So, many funds may not be able to track their benchmark indices, which in turn means they may be missing out on these massive gains.FAAMG stocks have helped buoy the S&P 500 — and now they make up over 23% of the index's value. (Yahoo Finance)If the S&P 500 sounds concentrated, this concentration is even more wild in the Russell 1000 Growth index. These stocks make up around 37% of the index. Even though there are 495 other stocks in the S&P 500 and 995 others in the Russell 1000 Growth, it’s the percentage that is key.“Tech represents the largest sector underweight across large-cap mutual funds for the first time since at last 2012,” Goldman pointed out.As a result, large-cap mutual funds have been relatively underexposed to the biggest winners thus far this year and haven't benefited from much of the gains, the analysts wrote.Over 25% concentration means more risk — in the eyes of the SECSEC rules require mutual funds that consider themselves diversified “to disclose in its prospectus any policy to concentrate its investments.\" And the threshold of a concentrated investment is 25% for an industry.This is because “a fund that concentrates its investments will be subject to greater risks than funds that do not follow the policy,” the Commission writes. General funds that aren’t supposed to be concentrated wouldn’t have these disclosures, forcing them to stay within the realms of their limits. Though, temporary excess may be allowed for defensive purposes with disclosure.Story continuesIf a mutual fund somehow goes above these limits, it can become subject to lawsuits. Though the fund might be vindicated if the reason was simply a bull market. A federal district court recently rejected a shareholder lawsuit that alleged a mutual fund broke the rules by allowing a concentrated position because it grew due to a “passive increase in share value,” and not through the buying of new shares. But even with that judgement, funds take these limits seriously.What mutual funds can doSo, what happens if a mutual fund comes up against its cap?From the fact that mutual funds’ holdings of these big stocks are underweight, according to Goldman, most don’t seem to be finding solutions yet.But some index funds have figured out how to deal with the rules.“Vanguard closely monitors our funds’ underlying portfolio holdings and disclosures, and occasionally pursues modifications to a fund’s diversification status to avoid violating the Diversification Rule,” the company said.If necessary, it added, it would consider other options like seeking alternative investment exposures, pursuing a change in the target benchmark or closing the fund to new investments.The logos of Amazon, Apple, Facebook and Google are seen in a combination photo from Reuters files. REUTERS/File PhotosIn 2019 for example, the company said, it changed its S&P 500 Growth Index (VOOG) from a diversified fund to a non-diversified fund, allowing it to skirt the caps, which are 10% of a single stock or when 25% of a portfolio is concentrated with stock holdings exceeding 5% each, according to the Investment Company Act of 1940.The fact that index funds are charged with a simple objective — to track the index — seems to give the funds more leeway than mutual funds. In the Vanguard S&P 500 Index Funds’s prospectus, it says that it can’t hold more than 5% in a security. But it also says that it can concentrate in a sector when “necessary to approximate the composition of its target index.”Currently Vanguard's most famous product, its 500 Index Fund, is 6.40% Apple and 5.70% Microsoft, with Amazon knocking 5% threshold at 4.90%.“With our index funds, we follow a full replication strategy (i.e., owning all stocks in the benchmark) to provide investment results that track the performance of the index as closely as possible,” the company said.-Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.NYU professor: Make sure young investors 'don't become addicted' to online stock tradingHow a stock gets added to the Dow Jones Industrial Average'A really tough spot' for employees: How companies are enforcing mask complianceCoronavirus has hurt the credit card businessYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteranMost companies plan to give raises and bonuses in 2021: surveyThe key to not running out of money if you retire into a bad marketCheck this one thing in your portfolio right now"}]}