{"article": [{"url": "https://finance.yahoo.com/news/house-flipping-hits-a-record-before-the-coronavirus-pandemic-swept-the-us-study-200108565.html", "published": 1591974560.0, "headline": "House flipping hits a record before the coronavirus pandemic swept the US: study", "body": "There was a frenzy of house flipping in America before the coronavirus pandemic, a new study shows.In the first three months of 2020, flippers rehabbed homes at the highest rate in 14 years — but profit margins fell to the lowest levels since 2011, according to ATTOM Data Solutions, a California-based property data company.“Home flipping has gradually taken up a larger portion of the housing market over the last couple of years. But profits [were] down and [were] lower than they’ve been since the dark days following the Great Recession,” said Todd Teta, chief product officer at ATTOM Data Solutions, warning that the pandemic will impact data for the second quarter.The increase is partially due to the growth of large flipping firms and iBuyers, which purchase homes online and sometimes invest in homes before reselling.House flippers renovated over 53,000 single-family homes and condos in the first quarter, representing 7.5% of all homes sold — the highest proportion since 2006, up from 6.3% the previous quarter.The increase is partially due to the growth of large flipping firms and iBuyers, which purchase homes online and sometimes invest in homes before reselling.“Some of these large institutional flippers, some of which are iBuyers, are doing more volume because more capital has been coming into the space over the past two years,” said Teta, adding that more amateurs also got into the market last year because of the thriving pre-pandemic economy.“The economy is what enables [flipping]. It’s foundational. You wouldn’t have amateurs coming in otherwise,” said Teta, noting that training, commercials and online platforms have popularized house flipping for part-time flippers doing one to two houses per year.Strangely, the housee flipping frenzy comes at a time when profits fell to the lowest levels in almost a decade. Profit margins declined to 36.7% on average in the first quarter of 2020, compared to 39.5% in the fourth quarter of 2019 and 40.9% a year earlier. The last time profit margins were this low was the third quarter of 2011, when they hit 35.9%.“Some of the profit decline is due to price flattening in the last year or two. Also, flippers are not able to buy at such a discount as they were in 2015 and 2016 because prices are going up more,” said Teta. Flipped houses sold for a median $232,000, with $62,300 in gross profits in the first quarter of 2020.Story continuesPopular in the South, lucrative on the coastHouse flipping was most popular in southern cities, led by Memphis, Tenn., where 14.5% of all home sales were flipped houses, followed by Durham N.C., Phoenix, Raleigh and Atlanta, where more than 12% of the sales market were house flips.“Even though flippers don’t make a ton of money in the South because home prices are so low, there is a lot of opportunity to find assets at low price points,” said Teta.Profits were highest in the West and Northeast, though. In San Francisco, house flippers made an average of $171,000 per house, and the average was upwards of $140,000 in San Jose, Los Angeles, New York City and Honolulu.“In coastal states, the average flip value is higher, but there are not as many opportunities [distressed homes on the market],” said Teta.Coronavirus could change everythingFor the second quarter, house flipping activity is expected to slow down along with the rest of the housing market. Teta also expects prices to decline in the second half of this year, bringing down profits.“There are going to be some flippers who have failed, meaning they can’t sell it for what they put into it,” said Teta, projecting losses in the third and fourth quarters this year.But for savvy investors, the end of 2020 could yield opportunities for future projects.“Opportunities for buying potential flips will get better as a result of this. There will be more distress in the market” because of high unemployment, said Teta.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:‘Summer is going to be a good period for the housing market’: economistThe next hot building amenity is clean airAirbnb hosts on their way to recovery as coronavirus lockdowns lift"}]}