{"article": [{"url": "https://finance.yahoo.com/news/save-on-internet-tech-support-164604489.html", "published": 1599220460.0, "headline": "Your internet bill might be too high — here's how to save money", "body": "Whether you’re working from home, taking online classes, or streaming movies, everyone needs access to the internet. Heck, the U.N. considers it a human right.But getting fast internet access can be expensive, especially when you’ve got a lot of people using the same connection. That’s because the more people using your connection, the slower it’ll be for each person.That doesn’t mean you have to pay through the nose to get your Netflix (NFLX) fix, though.In fact, there are a number of ways you can cut down on your monthly internet bill. For one thing, you should make sure you’re not overpaying for higher speeds than you need — and you should also check to make sure you’re actually getting the speeds you’re paying for. You may also want to buy your own modem and router so you’re not paying unnecessary monthly fees.Get the right internet planIf you’re a single person or couple, chances are you don’t need an incredibly fast internet connection. If you’re simply watching Disney+, checking email, and scrolling through social media, you can likely get by with a subscription for 100 megabits per second.Your internet bill is probably expensive. Here's how you can save. (Image: Dan Howley)That will let you do everything you want without any slowdown.Got a fuller household with people streaming, playing online games, and video chatting? You’ll likely need a faster connection in the area of 200 Mbps.In my area, Queens, New York, Charter Spectrum (CHTR) offers 400 Mbps for $44.99 per month for 24 months or 940 Mbps for $104.99 per month. Unless you’re a glutton, there’s no reason for your average family to go for the 940 Mbps option. That kind of speed is best for small businesses, especially when you take the price difference into account.Over on Xfinity (CMCSA), you can get a 100-Mbps plan for $39.99 per month, a 200-Mbps plan for $54.99, a 300-Mbps plan for $59.99, or a 1-gigabit-per-second plan for $79.99.Again, most speeds above 200 Mbps are unnecessary for the majority of people. I lived with three other roommates using a 150-Mbps plan and we were all able to stream shows, play online multiplayer games, and stream music without issue.Story continuesI suggest 200 Mbps specifically because it gives you a bit more overhead, especially now, when you might have multiple people in your house working from home or taking classes online.Buying your own modem and routerThis is probably the best, and easiest, way to save money on your internet bill. While it’s convenient to use the modem and router provided by your internet service provider, doing so often comes with monthly fees as high as $14.99.Internet providers will often tout the benefits of their modems and routers, and some do in fact give you access to certain features you won’t get if you use your own units such as built-in parental controls. But that doesn’t mean you can’t buy your own setup with similar features.The most important thing to do before going out to purchase a modem and router is to make sure you’re actually paying for one. Spectrum, for example, doesn’t charge for a modem, but Xfinity does.You're better off buying your own modem and router than paying to rent one from your internet provider. Image: GettyOnce you know whether you’re paying, it’s time to find out what router you need. You can find that information on your service provider’s website, though it’s often buried. You can, for instance, find Xfinity’s site here, and CentryLink’s (CTL) site here. The folks at Tom’s Guide and WireCutter have also done a solid job of ranking some of the best cable modems out there. Check those out and make sure they’re compatible with your service.In addition to a modem, you may need to buy your own router. And while this might seem like an annoyance, third-party routers are often more powerful than the base modem/ router combo box you get from your internet service provider.You’ll want to take into account how large your home is and what areas you want to cover with WiFi before making your purchase. But if you’ve got a large space or a good deal of dead spots, I recommend getting a mesh router setup like Google’s (GOOG, GOOGL) Nest WiFi or Amazon’s (AMZN) Eero mesh router. There are plenty of other mesh options out there, though, so be sure to find the one that fits your price range.At this point you might be looking at as much as $300 or more for your new setup. And while that’s certainly a hard pill to swallow all at once, it begins paying for itself in less than two years if you’re already paying $14.99 per month for a modem/router combo.How to check your internet speedNot sure how what kind of internet plan you currently have, or unsure if you’re actually getting what you pay for? Your best bet is to check your home connection.To do that, I suggest using Ookla’s Speedtest. You can access it by downloading the Speedtest app through the Apple App Store or Google Play Store, or visiting Speedtest.net.If you’re using your smartphone to test your internet speed, you’ll want to make sure the app is measuring your Wi-Fi connection and not your cellular connection. To do that you can simply turn off your cellular data connection while performing the test, then flip it back on when you’re finished.All together, these steps should save you plenty of cash on your monthly internet bill. And isn’t saving cash what we really want?Got a tip? Email Daniel Howley at dhowley@yahoofinance.com over via encrypted mail at danielphowley@protonmail.com, and follow him on Twitter at @DanielHowley.More from Dan:Apple fires shot at Google in new privacy adNvidia debuts latest RTX 3000 series graphics cards, including high-powered RTX 3090Samsung’s Galaxy Z Fold2 5G could be the first foldable phone you want, if you can afford itApple’s stock split: How shares are performingFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}