{"article": [{"url": "https://finance.yahoo.com/news/why-trump-going-postal-over-usps-mail-in-ballots-in-his-head-that-hes-going-to-lose-103018369.html", "published": 1597901900.0, "headline": "Why Trump is going postal over USPS, mail-in ballots: ‘It’s in his head he’s going to lose’", "body": "The political furor surrounding mail-in ballots that’s engulfed the U.S. Postal Service is perceived by some as a carefully orchestrated effort by President Donald Trump to challenge the results of a general election that polls currently suggest he’s poised to lose.Over the last several weeks, festering tensions between the president and a perpetually cash-strapped, moribund postal system have spilled into open view as the coronavirus pandemic raises the prospect of mass voting via mail.Trump, who has repeatedly linked mail-in balloting to voter fraud, has shown open disdain for a universal system that relies on a USPS. The service has been hampered by operational changes, and officials have voiced fears about a surge in voting ballots that they’re ill-equipped to manage.AGF Investments veteran Washington analyst Greg Valliere told Yahoo Finance that lawmakers are already “getting an earful” from constituents on postal flap as mail delays mount. Ahead of a closely-watched appearance in Congress, Postmaster General Louis DeJoy suspended planned changes to USPS’s infrastructure until after the election, citing the “sacred duty” of delivering the mail on time.Still, Valliere said “it’s not just the election, it's people who rely on the postal service for medication...and people who just want to get their mail. I think this makes it a more serious crisis for the president.” He added that it raises the likelihood that Congress will pass emergency funding as soon as this weekend.Yet the integrity of the U.S. electoral process is at stake, and a growing number of people believe the president’s salvos at both the USPS and the voting system could lead to a legal stalemate in November that ends up in the Supreme Court. On Wednesday, White House Press Secretary Kayleigh McEnany said that Trump would determine the general election’s fairness after the vote.“You could make a case that Trump is trying to establish a narrative [with mailed votes] that he didn’t really lose,” Valliere said.Story continuesIn the event of a tight race between Trump and Democratic nominee Joe Biden, “Trump can then say after November 3 that ‘the reason I lost ...is because of mail in ballots in 4 or 5 states that were razor thin. So I think he’s working on a narrative that could be the basis for litigation once the election is over, that could wind up in the Supreme Court,” Valliere added.‘It’s in [his] head that he’s going to lose’The postal service’s long standing financial and operational difficulties have converged with a hotly contested election in which the incumbent is struggling to navigate mushrooming political challenges.In an interview with Yahoo Finance this week, Ohio’s Democratic Senator Sherrod Brown blasted Trump’s “phony populism,” as he argued that some Trump voters were “having second thoughts” about sending him back to the White House.“People are more determined to vote than ever before [and] it’s in President Trump’s head that he’s going to lose,” Brown told “On the Move.” He lashed out at what he called the president’s attempts to “undermine the effectiveness and efficiency of the Post Office. It will all backfire,” he warned.At the heart of Trump’s demand that voters cast their ballots in person is the stark reality that individual states and localities — and not Washington — make the rules that govern voting.Democratic presidential candidate and former Vice President Joe Biden and vice presidential candidate Senator Kamala Harris are seen at the stage during a campaign event, their first joint appearance since Biden named Harris as his running mate, at Alexis Dupont High School in Wilmington, Delaware, U.S., August 12, 2020. REUTERS/Carlos Barria“The president has suggested that exclusive reliance on mailed ballots will inevitably lead to a) more voter fraud and b) a delay in the reporting of results,” wrote Thomas McLoughlin at UBS Global Wealth Management, in an analysis this week.“There is scant evidence to support his first allegation, but the second will occur,” he added.On Wednesday, the Trump campaign sued New Jersey, in the wake of the Democratic governor’s decision to facilitate both in-person voting and mail-in ballots. It served as a reminder that the president appears poised to launch a blizzard of legal challenges against a process that may favor Democratic voters, depending on the state.“President Trump’s razor-thin margins of victory in three Midwestern states in 2016 offers a cautionary note for the upcoming election,” UBS’s McLaughlin said. He harked back to the photo finish of the 2000 election that pitted former president George W. Bush against his Democratic challenger, Al Gore.With an estimated 75% of Americans eligible to vote by mail, “this year’s election is likely to be the most litigated in history,” McLaughlin wrote. “By one count, plaintiffs have already filed 192 lawsuits in at least 41 states across the nation arising from changes to voting procedures in the wake of the pandemic.”And should the results in battleground states, which are already showing signs of tightening, end up close, “is reasonable to presume that some states will be counting absentee ballots well into the evening and the following day,” McLaughlin added.“The next critical test will come after Labor Day in the US when the two candidates face off in three separate debates. To the extent that President Trump makes up ground and the election is close, the prospects for a delay in an announcement of the winner becomes a real possibility,” he wrote — with already volatile markets likely to suffer during the near-term uncertainty.Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}