{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-new-case-spikes-whipsaw-market-fauci-warns-us-may-not-be-ready-for-football-162728006.html", "published": 1592480120.0, "headline": "Coronavirus update: New case spikes whipsaw market; Fauci warns US may not be ready for football", "body": "A resurgence of coronavirus cases in key U.S. regions is nudging nationwide numbers higher, and casting doubt on state efforts to relax lockdowns even as former epicenters in New York and New Jersey take the next steps in their recovery.The economic impact of the COVID-19 crisis continues to be felt, with data on Thursday showing another 1.5 million Americans filed initial unemployment claims. While markets have been on a bull run based on rising optimism over a recovery, the rising case counts in western and southern states have doused the rally.Declining hospitalizations and deaths have New York City poised to enter the next phase of its reawakening as early as next week, which will allow outdoor dining in restaurants. However, spikes in Arizona, Texas and Florida — whose 7-day average rose to nearly 4% from 3% Thursday, and its positivity rate is the highest since April — have officials and investors increasingly nervous.Dr. Shira Doran, an epidemiologist at Tufts Medial Center, told Yahoo Finance in an interview that “to some extent ...we are more prepared for another surge than we were for the first,” given greater stocks of medical equipment, and the hospital system’s ability to cope with high volumes of patients.“But to some extent, there are only so many beds [and] ventilators, there’s only going to be so much space, and at a given point a surge will overwhelm the health system,” she warned.There are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)Arizona has more than 3,800 hospitalized patients and nearly 41,000 cases, while Texas is nearing 100,000 cases, and nearly 3,000 hospitalized patients. While those states had previously lax enforcement of mask-wearing in public, several cities and counties in both areas are now becoming more stringent.The widening fears of a second wave in the fall is already impacting one of America’s favorite sports — which carries the potential to cancel the entire football season, Dr. Anthony Fauci said on Thursday. With college games already being shut down, the country’s leading infectious disease expert told CNN football may not happen this year at all.Story continuesThe ongoing surge continues to pressure the pharmaceutical industry to find breakthrough treatments or a vaccine this year. While the vaccine race is still on, globally, more information on possible treatments has been pouring in.Johnson & Johnson (JNJ) said on Thursday that it was working with multiple governments and global organizations to rapidly scale up its COVID-19 vaccine candidate. Meanwhile, Roche (RHHBY) suffered a setback after its rheumatoid arthritis drug was shown to be ineffective for Covid-19 patients, according to interim results in an Italian study Thursday.There are over 8 million coronavirus cases worldwide. (Graphic: David Foster/Yahoo Finance)Clinical trials for COVID-19As clinical trials conducted globally see results start to pour in, and the subsequent peer-reviewed publications are eagerly awaited on, some concerns linger about the ways trials are being conducted in a condensed period of time.The gold standard for trials is a large, diverse participant pool with a control placebo group to compare results against. Yet many simple studies with no control arm are taking place, and questions are being raised about the ethnic and gender composition of the participant pool.TrialSpark CEO Ben Liu, whose startup is focused on diversifying clinical trials, told Yahoo Finance Wednesday that this could affect a drug’s use in diverse populations.“If they’re not born near a trial center, like NYU or [University of California], they might not have access to some of these treatment options,” Liu said, adding that the impact of that can be seen after the drug is approved.“This disparity in access is compounded by not understanding if drugs work as well in different ethnic groups and in different genders,” he added.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}