{"article": [{"url": "https://finance.yahoo.com/news/warren-buffett-is-still-being-sent-cheeseballs-from-utz-ceo-heres-why-160604598.html", "published": 1598872460.0, "headline": "Warren Buffett is still being sent cheeseballs from Utz CEO — Here's why", "body": "Clearly long-time Utz CEO Dylan Lissette has tried to stay friendly with investing legend — and buyer of family-owned businesses — Warren Buffett after a 2015 Fortune report of the “Oracle of Omaha” expressing interest in eating up the family-led snacks maker.“I have been sending samples and snacks to Mr. Buffett’s office now for years and have developed a nice relationship with his assistant. So he loves to get our snacks every once in a while,” Lissette told Yahoo Finance’s The First Trade.Perhaps Buffett should return the favor and send Lissette a box of See’s Candies to commemorate a big moment in the nearly 100-year-old snacks giant: Utz is the latest company to orchestrate a SPAC (special purpose acquisition vehicle), merging with Collier Creek Holdings on Monday. The fourth largest U.S. salty snacks maker debuted on the New York Stock Exchange (^DJI) under the ticker symbol UTZ.Shares of Utz rose 8% in afternoon trading.A banner for Utz Brands, which is listed at the New York Stock Exchange, hangs on the exterior of the building, Monday, Aug. 31, 2020, in New York. The Hanover, Pa. based company is known for its potato chips and snack foods. (AP Photo/Mark Lennihan)After the debut, the Utz family — which Lissette married into — will control 50.2% of the company. Collier Creek will put several food veterans from frozen food company (now part of Conagra) on the Utz board.Since Utz obviously didn’t sell to noted food industry investor Buffett, Lissette will look to supercharge the company’s sales and margins as a public entity.Utz is aiming to at least double its business with retailer Walmart (WMT) (only 10% of sales), expand more into tortilla chips and ready-to-eat popcorn (only 5% of sales) and trim $50 million in costs over the next three years. It’s likely the company will stay aggressive on the acquisition front, too, in order to enter new categories. Lissette has orchestrated 11 acquisitions over the past ten years.Thus far, Utz has a solid story to pitch Wall Street. Second-quarter sales and adjusted operating profits rose 11% and 15%, respectively, from the prior year. For the year, Utz expects 8% growth to $932 million in sales.And hey, if sales and profits cool a bit — there is always that phone call the Utz family and Lissette could make to Buffett to maximize shareholder value.Story continuesBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.LL Cool J: what Juneteenth means to meLevi’s CEO: jeans aren’t deadNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisCarnival CEO: cruising will returnFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}