{"article": [{"url": "https://finance.yahoo.com/news/mls-delays-launch-of-expansion-teams-in-charlotte-sacramento-and-st-louis-due-to-pandemic-121749353.html", "published": 1595057120.0, "headline": "MLS delays launch of expansion teams in Charlotte, Sacramento, and St. Louis due to pandemic", "body": "Major League Soccer returned from lockdown on July 8 for its “MLS is Back Tournament” at Disney World in Florida, and has gotten through a handful of games in the group stage and successfully got down to zero new COVID-19 cases on Wednesday.But playing in empty arenas with no fans is a losing scenario for the league financially, and on Friday MLS announced that “in light of the impact of the COVID-19 pandemic” it will push back the debuts of three planned expansion teams by one year each: Charlotte, planned for 2021, will debut in 2022, and Sacramento and St. Louis, both planned for 2022, will debut in 2023.The new club in Austin, Texas will debut in 2021 as planned.The franchise in Charlotte plans to reveal its official name and brand image next week. The team owner is David Tepper, the Carolina Panthers owner and founder of hedge fund Appaloosa Management. In a statement released by MLS, Tepper said, “The party’s still on. We are just delaying it a bit to ensure we have the best experience for our fans when we do start playing.”Speaking to Yahoo Finance in May, MLS Commissioner Don Garber was honest about the revenue hit the league would take by returning in empty arenas with no fans. “It’s not ideal for any sport whatsoever to [play in front of] no fans, I don’t care whether it’s college sports, Olympic sports, or the major league sports,” Garber said. “Unfortunately for our league, the vast vast vast majority of our income does come from game day revenues, so it has a different economic impact on us.”Last month, on a media conference call, Garber got more specific, sharing that MLS expects a $1 billion revenue hit this year due to the pandemic.As for whether the pandemic would force the league to change its expansion plans, Garber was noncommittal in May, telling Yahoo Finance, “That’s something we’re working on now. There’s no doubt that we’re contemplating: Will there be any effect of the Covid crisis on expansion? Right now it’s not really affecting that, but it’s something that we’re going to have to think about.”Story continuesClearly the pandemic has hurt finances enough that the league needs to pump the brakes.NASHVILLE, TN - FEBRUARY 29: Nashville SC fans cheer before the game against Atlanta United at Nissan Stadium on February 29, 2020 in Nashville, Tennessee. (Photo by Brett Carlsen/Getty Images)MLS has expanded at a breakneck pace over the past decade.This year, new teams debuted in Miami and Nashville, though they each only played two games before MLS, along with all the other major sports leagues, halted play in March. “It’s a hole in the heart of every fan and every club when you’re not able to play games, in particular in Miami and Nashville, where we had our two new teams coming in,” Garber said in May. “They got two games in, and in Miami’s case not even a home game. In Nashville’s case, their home game was amazing: sold-out Nissan Stadium with tens of thousands of people and all sorts of excitement.”The league will have doubled in size over 20 years, going from 10 franchises in 2003 to 30 by 2023 when Sacramento and St. Louis, the 29th and 30th clubs, debut. New franchise owners now cough up a $200 million expansion fee to join.Garber has at times been criticized for the pace of that expansion, but the growth has brought the league new fans, a $700 million jersey sponsorship from Adidas, and an investment stake in licensed sports apparel unicorn company Fanatics. In 2017, Yahoo Finance named MLS our Sports Business of the Year for its business achievements.2020, which is the 25th season of MLS, will not be as kind to the league and its franchise owners.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how coronavirus is hitting the sports world:Here's every sports league's current plan to return from coronavirus lockdownCollege football plans to return, but a huge financial question remains: fans in the standsMLS Commissioner: Playing in empty stadiums would be particularly bad for usNHL Commissioner Gary Bettman: Money 'is not what's driving' return planCoronavirus could have long-lasting impact on live sports ticket sales"}]}