{"article": [{"url": "https://finance.yahoo.com/news/apple-2-trillion-market-cap-145028046.html", "published": 1597831340.0, "headline": "Apple now worth $2 trillion", "body": "Apple (AAPL) has officially become the first U.S. company worth a staggering $2 trillion. The iPhone maker hit the mark after its stock price touched $467.77 on Wednesday, pushing its market cap higher than any other U.S. company in history.Apple’s rise to the $2 trillion milestone comes after hitting $1.5 trillion in June, and two years after topping $1 trillion for the first time. Since then both Amazon (AMZN) and Microsoft (MSFT), two other high-flying tech stocks, have crossed the $1 trillion mark and are now valued at more than $1.5 trillion.CEO Tim Cook and company have been riding a hot hand for years on the strength of Apple’s iPhone sales. The handset, which launched in 2007 under then-CEO Steve Jobs, was transformational for the company, putting it at the forefront of the still nascent smartphone industry and never looked back.More recently, Apple, seeing a slow decline in smartphone sales growth along with the rest of the industry, has been pushing other sectors of its business including its Services and Wearables arms.The consumer tech giant doubled down on offerings in both areas, launching Apple Music and Apple TV+, as well as introducing the Apple Watch and the now iconic AirPods. Apple is now among the top wearables makers in the world on the strength of those two devices.Apple’s future growthBut analysts still see more room for growth.“Look, I think this is a monumental achievement for Apple, especially as many of the doubters thought the growth story at Cupertino was over years ago,” Wedbush analyst Dan Ives told Yahoo Finance.“I think it all comes down to the install base. The company has an unmatched install base, which now further monetization of that through services has been the key to success.”Apple is also set to launch its new flagship smartphone, the iPhone 12, later this fall. And while the device will be delayed beyond its normal launch window of late September due to the coronavirus pandemic, it, according to Wedbush analyst Dan Ives, is expected to spark what’s known as a sales “supercycle,” or a massive uptick in the number of people buying new iPhones.Story continuesThe iPhone 12 is widely expected to be the company’s first device to include 5G cellular capabilities, which offer superior download and upload speeds compared to existing 4G LTE data connections. The switch is likely to entice iPhone owners who have been holding on to their devices for several years thanks to the promise of improved video streaming and downloading, and the wide breadth of potential the faster connection will offer.But Apple is also making structural changes to its products to ensure that it is able to grab even more margin from its products. The firm is currently in the process of building out its own processors for its Mac line of products, leaving behind the Intel processors it has relied on for years.The move will not only unlock additional margin for the business, which won’t have to pay fees to Intel any longer, but could push Apple’s laptops and desktops even further ahead in terms of raw performance power.Apple, however, is also in the midst of several queries into its business practices. The firm is facing investigations by a coalition of state attorneys general, the Department of Justice, and the House Judiciary Committee’s Subcommittee on Antitrust, Commercial, and Administrative Law into whether current App Store policies create an illegal monopoly for Apple.More recently it’s gotten into a brawl with “Fortnite” maker Epic Games over Apple’s 30% App Store commissions.The outcome of those investigations is unclear, but experts believe there’s little chance they will end with a breakup of the iPhone maker.For now, Apple looks like it’s set to continue to grow. For how long is anyone’s guess.Samsung’s Galaxy Buds Live offer premium earbud features without the priceMicrosoft’s Surface Duo dual-screen smartphone coming Sept. 10 for $1,399Free time and ‘Fortnite’: How coronavirus changed video game industry foreverFacebook and Microsoft, smelling blood in the water, clash with Apple amid antitrust probesFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}