{"article": [{"url": "https://finance.yahoo.com/news/rent-is-getting-cheaper-in-big-cities-105433362.html", "published": 1592978540.0, "headline": "Rent is getting cheaper in big cities", "body": "Rent prices tend to balloon in spring and summer months — but as the summer of 2020 begins, rent prices are staying flat across the country.As landlords faced fears of mass nonpayment in April due to the novel coronavirus pandemic, they opted not to raise rent during a time when rents are traditionally higher. Nationally, one- and two-bedroom apartments were 0.5% less expensive than last year in June, following about 0% growth in May and minimal price gains in April, according to Zumper, a California-based rental listing website.“Late spring and summer months are the busy season for apartment hunting, so usually some of the fastest rent growth is this time of year. But compared to last year… rent growth is certainly lower than what we’ve seen at this time of year,” said Chris Salviati, a housing economist at Apartment List, a San Francisco-based rental platform.Rent dropped the most in major metropolitan areas where rent is typically the highest like San Francisco, New York City, Boston and San Jose.Now that lockdowns are lifting, pent-up demand is expected to temporarily bump prices back up. But unemployment across the country will temper demand after an initial burst, as potential renters delay plans to move to more expensive apartments, say economists.“Now, folks can move, if that’s something they still want to do, but they are facing unprecedented financial hardship. So that is disincentivizing moving or downgrading moves [to less expensive apartments],” said Salviati.Rent dropped the most in major metropolitan areas where rent is typically the highest like San Francisco, New York City, Boston and San Jose. These cities recorded steep layoffs during the pandemic.“The largest declines are in areas with the most increased unemployment. Now, landlords can’t get the same rent prices they were getting before,” said Selma Hepp, chief economist of CoreLogic, a California-based financial services company.The discounts in big cities are stark: San Francisco one-bedroom median rent dropped 9.2% to $3,360 in June, bringing San Francisco rent to its lowest level since March 2017, according to Zumper. Even in New York City, there are reports that rent is falling. Brad Dillman, chief economist at Cortland, an Atlanta-based real estate investment, development and management company, told Yahoo Finance that he knows someone in Manhattan who was recently offered a 15% rent reduction.Story continuesMeanwhile, rent prices jumped 3% to 5% in June in smaller cities like Providence R.I., Baltimore, Spokane, Wa., Tampa and Arlington, according to Zumper.“The pandemic is shifting the demand away from the most expensive markets, as the majority of rents in these top cities were on a downward trajectory,” said Anthemos Georgiades, CEO of Zumper.Affordable apartments won’t be discountedBefore the pandemic, affordable apartments, or those that cost less than one-third of median local income, were in high demand, driving up rent prices. Now, even more Americans are looking for affordable apartments. A third of renters who plan to move in response to the coronavirus say they are looking for cheaper housing, according to an Apartment List study released Tuesday.Affordable housing could get even scarcer. As competition for cheap apartments increase, low-end apartments could actually get slightly more expensive. High-end luxury apartments are most likely to see price discounts since they are less popular during a recession, said Salviati.“Right now, the financial factor is the biggest thing at play [when deciding whether to move]. So for the rental market, the price effects of the pandemic will vary by segment of the market [low- or high-end],” said Salviati.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Houses for sale will be ‘gobbled up’: Barbara CorcoranWe are headed to a V-shaped housing recovery: expertHouse flipping hits a record before the coronavirus pandemic swept the US: study"}]}