{"article": [{"url": "https://finance.yahoo.com/news/the-key-to-not-running-out-of-money-if-you-retire-into-a-bear-market-164959295.html", "published": 1597406240.0, "headline": "The key to not running out of money if you retire into a bear market", "body": "Vanguard's research team has new data and analysis on what to do if you retire into a horrible market. (Getty Creative)The first rule of investing can be impossible for people who retire. Buying low and selling high only works if you have control of your timeline.For people who retire and must live off their invested savings, new data and analysis from Vanguard shows how harmful bad timing can really be.Read more: Retirement planning: Everything you need to knowThe investment management company examined the six major bear markets since 1926 and found and found that retiring in a bear market resulted in: investors being 31% more likely to run out of money (Vanguard calls this \"outliving wealth,\" which seems like a good thing); 11% lower income streams; and 37% smaller estates for heirs.The crux of the issue here is called sequence-of-return risk, or the risk that the timing of withdrawals from a retirement account will damage the investor’s overall return.Timing is everythingOver the long run, an investor might see something like a 7% average rate of return. Some years will be good and some will be bad, but because generally people add to their portfolios when they’re working and spend money when they’re retiring, the timing of the good years is critical — you ideally want a higher-performing market when your portfolio is the biggest. This is why retiring into a bear market is so harmful: Your portfolio takes a hit instead of a boost when it’s at its biggest.Take this chart from JPMorgan Chase. Olivia always has a consistent 7% return every year, Jacob gets bad returns early, and Madison gets bad luck later. All three people have an average rate of return of 7%, but see three very different outcomes. Winning when you have the money is critical. In retirement, Madison fares best.All three portfolios average 7% returns per year. The results vary widely depending on when the good years come. (JPMChase)It’s complicated for many people nearing or beginning retirement now, since the market just tanked and then recovered its gains in a mind-bogglingly rapid fashion. For people who got out of the market or cut losses and moved to cash, they can’t enjoy the near-record high in the S&P 500, which is positive on the year despite a 30% crash in March.Story continuesFor someone close to retirement, experts often suggest 50/50 stocks to bonds — this is what Vanguard’s target-date funds provide — and a portfolio that looks like that is still very exposed to the market’s ups and downs.But as Vanguard writes, “every withdrawal turns a negative return, which is temporary in nature, into a permanent impairment of the balance.” This is what happens when someone’s circumstances force them to sell low – and for retirees living off their assets and not contributing new capital, this can happen.Vanguard points out that people often talk about “generational luck,” contrasting large gaps in age. But stark differences emerge on a much smaller scale. The study takes two people with $500,000 in savings, half invested in stocks and half in bonds, who retire in 1973 and 1974.(Vanguard)Both want to withdraw $25,000 a year in retirement. Both portfolios have 34 years of the market in common — only one was different — and this made their average returns 5.23% and 5.1%, respectively. But, Vanguard notes, the 1973 retiree would have run out of money 23 years into retirement because of the cumulative effects of one bad year — 1973.\"The 1974 retiree's portfolio, by contrast, would have maintained a balance of $300,000 for most of the 35 years of retirement, finishing with a bequest equal to about a quarter of the preretirement amount,” Vanguard wrote.Just one year can be a big deal since these withdrawals do the greatest damage to a portfolio by removing the “magic” of compounding, as Vanguard puts it.Vanguard has a solution that goes against a traditional ruleSo what are you supposed to do, even if you’re positioned with a diversified portfolio? Vanguard’s study tested a newer method of calculating how much to withdraw that isn’t a fixed percentage of the portfolio (the standard 4% rule). Dynamic withdrawals mean that if the market isn’t strong, you adjust by taking out less if you can, minimizing the effects of a sluggish market on the long-term health of the portfolio.\"The key to managing poor returns early in retirement using a dynamic spending approach is to reduce portfolio withdrawals,” Vanguard’s study says. \"When markets recover, withdrawals can be ratcheted higher.\"Vanguard found that this strategy eliminates the risk of running out of money for all bear market retirees — \"even those who retired into the Great Depression.\"“A dynamic spending approach, Vanguard says, \"can reduce much of the difference in bequests between the unlucky cohort that retires in the worst years of a bear market and its generational peers.\" Though it requires a \"modest reduction\" in income in the short run, Vanguard noted there was \"effectively no change\" over a 35-year retirement compared with withdrawing a fixed amount.—Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Check this one thing in your portfolio right nowRetail investors have seen huge gains as S&P 500 nears pre-pandemic highCompany matches are mostly surviving the coronavirusThere are two types of stocks on RobinhoodWhy you should consider deleting your stock trading appThe 2008 recession was far worse for young people's careers than previously thoughtBlack-owned small businesses continue to face harsh cash crunchWomen far less bullish about their investment goals than men: Survey"}]}