{"article": [{"url": "https://finance.yahoo.com/news/u-postal-chief-warns-dire-141759097.html", "published": 1596792320.0, "headline": "USPS in 'dire' financial position, says Postmaster General", "body": "By David ShepardsonWASHINGTON (Reuters) - The head of the U.S. Postal Service (USPS) on Friday said the agency faces a \"dire\" financial position even as it posted a slightly narrower third-quarter loss amid soaring package demand during the coronavirus pandemic.Postmaster General Louis DeJoy said USPS has a \"broken business model\" and is in need of organizational changes. \"Without dramatic change, there is no end in sight and we face an impending liquidity crisis,\" DeJoy said.USPS said quarterly revenue rose to $17.6 billion, up $547 million. The quarterly net loss shrank to $2.2 billion from $2.3 billion in the same quarter last year.First-class mail volume declined by 1.1 billion pieces, or 8.4%. Shipping and packages revenue increased by $2.9 billion, or 53.6%, on a volume increase of 708 million pieces, up 49.9%.Democrats Thursday called on DeJoy to reverse changes that they say are resulting in delayed mail.\"We believe these changes, made during the middle of a once-in-a-century pandemic, now threaten the timely delivery of mail—including medicines for seniors, paychecks for workers, and absentee ballots for voters—that is essential to millions of Americans,\" wrote House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer.Voting by mail is expected to increase dramatically this fall amid the coronavirus pandemic. Trump has claimed without evidence that absentee voting leads to rampant fraud.\"We are not slowing down election mail or any other mail,\" DeJoy, a Trump supporter, said Friday.The Postal Service has faced financial woes with the rise of email and social media, and a measure passed in 2006 requiring it to prefund 75 years of retiree health benefits over the span of 10 years at a cost of more than $100 billion.DeJoy said the Postal Service is eliminating inefficiencies, including \"unnecessary overtime.\" The Postal Service has lost $80 billion since 2007.(Reporting by David Shepardson; Editing by Nick Zieminski)"}]}