{"article": [{"url": "https://finance.yahoo.com/news/heres-where-vp-pick-kamala-harris-stands-on-big-tech-taxes-marijuana-135002195.html", "published": 1597222700.0, "headline": "Here's where VP pick Kamala Harris stands on Big Tech, taxes, marijuana", "body": "Sen. Kamala Harris (D-CA) became the first woman of color to be put on a presidential ticket Tuesday, after Joe Biden announced her as his Democratic vice presidential running mate.During her time as California’s top prosecutor, Harris, the first African American to serve as California’s Attorney General, was criticized for being soft on technology giants and white-collar crime. Politico reported that Harris is a relief for Wall Street in that Biden chose her over Sen. Elizabeth Warren, who has long set her sights on reining in financial sector profits that outpace growth of American wages.Under Harris’ watch, Facebook (FB) made pivotal acquisitions of Instagram and WhatsApp, now at the heart of Congressional and federal agency investigations into suspected anticompetitive conduct. Along with Google (GOOG) and Apple (AAPL), both headquartered in California, and Amazon (AMZN), the companies have come under increasing scrutiny for wielding what some believe is too much power over new market entrants.“As attorney general of California, she possessed sweeping powers to restrain the growing power of those tech platforms,” HuffPost wrote in July.U.S. Senator Kamala Harris launches her campaign for President of the United States at a rally at Frank H. Ogawa Plaza in her hometown of Oakland, California, U.S., January 27, 2019. REUTERS/Elijah Nouvelage TPX IMAGES OF THE DAYCalifornia’s current attorney general, Xavier Becerra, said in November – months after other state attorneys general had already launched probes into antitrust concerns – that his office was conducting an investigation of Facebook. In July, reports surfaced that Becerra’s office had opened an inquiry into Google too.Big TechHarris told The New York Times in 2019 during her presidential campaign that her priority with respect to Big Tech was for companies to protect their users’ privacy and personal information, rather than to focus on their size. That priority was evident in 2013, when Harris successfully curbed cyber exploitation by prevailing in a case against a revenge porn website and its operator.Harris has more recently been willing to scrutinize Big Tech’s market dominance and handling of political and hate speech, as well as misinformation online. In an interview with CNN last May, in response to whether Big Tech needs to be broken up she said, “We have to seriously take a look at that,” and characterized the companies’ services as “utility that has gone unregulated.”Story continuesSen. Elizabeth Warren (D-MA), who also ran for the Democratic nomination, attacked Harris during a debate as too aligned with Big Tech to effectively regulate the industry.Among top donors to political career contributors were Google parent Alphabet ($79,126), Apple ($56,982), Microsoft ($37,133), Cisco ($57,528) and WarnerMedia now AT&T ($40,197).Wall StreetA self-described champion for middle-class Californians, Harris has touted her efforts standing up to Wall Street banks. She has frequently referenced a $20 billion settlement she negotiated on behalf of homeowners who faced foreclosure during the Great Recession. Some say Harris let big banks off the hook too easily by failing to prosecute executives responsible for crafting predatory mortgage practices.Democratic presidential candidate Sen. Bernie Sanders, I-Vt., speaks as former Vice President Joe Biden and Sen. Kamala Harris, D-Calif., listen during a Democratic presidential primary debate, Wednesday, Nov. 20, 2019, in Atlanta. (AP Photo/John Bazemore)Consumer advocates both praised and criticized the effort, on one hand calling it a win for around 150,000 families that reportedly accessed relief through the agreement, and on the other, a loss for disabled, widowed, minority homeowners who had less success obtaining relief through the settlement.Minimum wage, paid leave, health careAs a U.S. senator, Harris has supported legislation for middle-class tax cuts, and a $15-per-hour federal minimum wage. According to her website, Harris supports measures that would allow Americans to access tuition-free higher education. In addition, she proposes raising teachers’ pay by increasing the estate tax.In 2019, Harris introduced a bill proposing that families with less than $100,000 in annual income receive an income tax credit of $6,000. Single filers making less than $50,000 under the bill would receive a $3,000 credit. She introduced separate legislation that would extend tax credits, with market rate caps, to renters whose rent costs exceed 30% of their income. Another proposed bill sought to create a $100 billion fund from which people, mostly minorities, living in red-lined districts, and therefore faced with challenges in obtaining financing, could get down payment and closing cost assistance.Harris is a supporter of the Affordable Care Act, as well as an expansion of the program that would include Medicare for All. In 2019, she proposed funding such a measure by taxing offshore and domestic profits at equal rates. During a Democratic primary debate, Harris raised her hand along with Sen. Bernie Sanders (I-VT) when asked if her healthcare plan would abolish private healthcare insurance to be replaced by a government-run plan. She later retracted the position, saying she misinterpreted the moderator’s question.Legalizing marijuanaUnlike her running mate, Harris has been an advocate for removing marijuana from the Controlled Substances Act (CSA). As the lead Senate sponsor of the Marijuana Opportunity, Reinvestment, and Expungement (MORE Act), which was advanced in the House in November, Harris supported its goal to both end the federal prohibition of marijuana and incentivize states to expunge criminal records of defendants with marijuana-related convictions.Sen. Kamala Harris, D-Calif., arrives as the Senate Homeland Security and Governmental Affairs committee meets on Capitol Hill in Washington, Wednesday, May 20, 2020, to issue a subpoena to Blue Star Strategies. (AP Photo/Andrew Harnik)During her presidential campaign, Harris introduced a plan that would give all American workers 6 months of paid leave to care for children, as well as personal and family medical leave. Under the plan, Harris envisioned full wage replacement for workers who earn less than $75,000 annually, with phased out benefits for workers exceeding the cap.Among the personal donors to Harris’ presidential run were Hollywood and Silicon Valley billionaires, including Gordon and Ann Getty, George Lucas, Dean Metropoulos, and Laurene Powell Jobs.Asked by the Times whether anyone deserves to have a billion dollars, Harris said, “If they earn it and work hard for it, sure.” Adding a caveat to the position, Harris said that most people in the country do not start at a level that allows them access to such economic success. That disadvantage, she said, needs to be addressed.Biden and Harris are expected to appear together Wednesday in Delaware.Alexis Keenan is a legal reporter for Yahoo Finance. Follow on Twitter @alexiskweed.Read more:Why experts doubt Trump's demand for a TikTok 'side payment' will hold waterMark Zuckerberg on why Facebook is actually 'behind' its competition despite monopoly critiqueHere's why being 'free' may not let Google and Facebook off the regulatory hookFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}