{"article": [{"url": "https://finance.yahoo.com/news/company-401-k-matches-are-mostly-surviving-the-coronavirus-182659987.html", "published": 1597140440.0, "headline": "Company 401(k) matches are (mostly) surviving the coronavirus", "body": "Most companies have elected to keep their 401(k) matches for employees, according to Fidelity. Exxon, however is one of many high-profile companies that is not. REUTERS/Jason ReedMost companies are have chosen to keep their 401(k) matches despite the economic downturn brought on by the coronavirus, according to new data from Fidelity, which reported that \"company matches are not going away.”Fidelity surveyed 293 of its 22,000 companies and found that 11% have reduced or eliminated their match. Of those employers who have done so, a third (32%) say they're planning on reinstating it in the next year, and almost half (48%) say that they'll do so when they are financially able.Employees have to contribute to their 401(k) plans for their employers to provide a matching amount, and Fidelity noted that despite the economic turmoil, 76% of workers on the Fidelity platform received their matches and 88% continued their contributions.“The company match can help drive participation in a workplace savings plan while providing employees with a savings goal to aim for, so we are encouraged to see that the majority of our clients continued to provide this important retirement savings benefit,” Kevin Barry, president of Workplace Investing at Fidelity, wrote in a statement.[Cashay: Here's what to do if your employer cuts your 401k match]Many studies have shown that the 401(k) match is a key driver of retirement savings. Money matched 1:1 by the company is effectively a 100% return.Piggy bank with 401k nest eggDuring the 2008-2009 downturn, around 20% of private sector employers suspended or reduced their 401(k) matches, according to Profit Sharing/401(k) Council of America. The Social Security Administration noted that during that time, the reduction of the match may have lowered their own contribution amounts.The Center for Retirement Research at Boston College released a list of other companies that have also paused their matches — and some prominent names are on the list, despite Fidelity’s overall good news for savers.Atrak, Arconic, Best Buy, LabCorp and Quest (which both process Covid tests), Lands' End, La-Z-Boy, Norweigian Cruise Line, Re/Max (despite hot home sales. This has affected around 667,790 401(k) participants so far, the center noted.Story continuesAnd last week Exxon Mobil (XOM) said it’s suspending its 401(k) match as of Oct. 1. “ExxonMobil is suspending company match contributions to U.S. employee savings plans, effective Oct. 1, 2020,” the company told Yahoo Finance. “Currently, the company matches a 6 percent minimum employee contribution with 7 percent of the participant’s pay.”The move came as the company reported its first back-to-back quarterly loss in 36 years. Exxon said the suspension of the match was a result of the impact of the coronavirus on its business.At the same time, a survey from Willis Towers Watson found that a majority of U.S. companies are making it easier for employees to access their 401(k) plan assets, making adjustments to plans to allow people to defer loan payments if they have to borrow from their accounts. And while the company said that 12% of employers have suspended (which lines up with Fidelity), 23% are considering or planning on doing so later this year.-Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.There are two types of stocks on RobinhoodWhy you should consider deleting your stock trading appCoronavirus crisis fuels push to widen social safety netThe 2008 recession was far worse for young people's careers than previously thoughtBlack-owned small businesses continue to face harsh cash crunchWorkers on re-openings: 'I would like to never go back to the office'Women far less bullish about their investment goals than men: Survey"}]}