{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-cases-threaten-recovery-for-americas-restaurants-220704186.html", "published": 1594055720.0, "headline": "Rising coronavirus cases threaten the already shaky recovery for America's restaurants", "body": "Just as many restaurant owners may have thought the worst might be over, things appear to be heading in the wrong direction.After states reversed coronavirus lockdowns, data from restaurant reservations platform OpenTable showed a slow but steady recovery in seated dining at a sample of restaurants open for reservations across the country. But as reported cases continue to rise in Florida, Arizona, California and Texas, the data shows a worrying reversal of seated diner totals that’s beginning to roll over.Texas, for example, which last week reduced its cap on indoor seating capacity from 75% to 50%, had seen the number of seated dining recover last week to an average loss of about 60% of last year’s business, only to reverse lower to a 75% fall compared to last year by July 4.States that have been more cautious with reopening plans, such as New York, have not seen a breakdown of their more modest seated dining recoveries. Notably, New York City still has not reopened indoor dining and has delayed plans out of an abundance of caution to avoid risking a reversal of its falling coronavirus case count.The recovery in seated dining has started to roll over, according to OpenTable reservation data.Nationally, the breakdown of the recovery in restaurant dining hasn’t been as drastic thought the recovery has certainly stalled, according to OpenTable data. Last month, OpenTable CEO Steve Hafner warned Yahoo Finance that prolonged pain for restaurant owners already struggling with slim margins could lead to one in four restaurants permanently closing.As Florida, Texas, Arizona and California continue to post worrying rises in cases, it could cause other states to weigh the risks of reopening and especially returning to crowded restaurants, too quickly. As JPMorgan Chase recently pointed out in a new research note using credit card transaction data, a resurgence in in-person purchases was positively correlated to a lagged rise in per-capita coronavirus cases.According to JPMorgan analysts, the data showed, “a positive correlation between levels of activity three weeks ago and the spread of COVID-19 since then, suggesting that economic reopening has indeed coincided with renewed spread of the virus.”Story continuesTo be fair, correlation does not prove causation, and the data shows that only about 32% of the variability in rising cases would seem to be explained by the resurgence in in-person restaurant spend. That spending category, however, did show the strongest correlation relative to other spending categories and would seem to align with researchers stressing the additional contraction risks with prolonged visits in crowded, indoor spaces.Given the delay that it took in states like Texas and Florida to see renewed business activity to convert into worrying case counts, JPMorgan also estimated that a spike in card-present transactions might spell problems ahead for states in the Midwest.“These factors would suggest that states like Kansas, Kentucky, Indiana, and Missouri are at greatest risk of the next acceleration in cases,” they wrote.Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Most 2020 grads are desperate and applying for jobs that aren't the right fit: MonsterMayor of city famed for defunding police says abolishing police is not the solutionAnalyst who predicted market's 40% rally says these stocks will lead to all-time highsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}