{"article": [{"url": "https://finance.yahoo.com/news/nio-drives-higher-upbeat-june-083215219.html", "published": 1594093220.0, "headline": "NIO Drives Higher On Upbeat June Sales", "body": "NIO Inc. (NIO) shares charged 22.71% higher Monday after the Chinese electric vehicle maker reported June sales jumped 179% from a year earlier despite challenges from the pandemic. The better-than-expected figure comes on the back of U.S. rival Tesla, Inc. (TSLA) smashing Wall Street quarterly delivery projections.NIO delivered 3,740 vehicles last month, taking its second-quarter tally to 10,331 vehicles. It marks the first times the Shanghai-based carmaker has exceeded 10,000 quarterly shipments – an impressive feat amid slipping global auto sales.As well as topping its delivery expectations, the company’s chief operating officer Steven Feng remains confident of meeting operational efficiency targets. ‘We are pleased to deliver solid results driven by our competitive products, superior services, and expanding sales network. Our deliveries in the second quarter of 2020 exceeded the high end of our earlier projection, and we are confident that our goals on gross margin and operational efficiency will be achieved.’ Feng said, per CleanTechnica.Investors may have already factored in most of the upside, given the company’s American Depositary Receipt (ADR) listed on the New York Stock Exchange has risen a staggering 366% over the past three months as of July 7.Wall Street ViewGoldman Sachs analyst Fei Fang upgraded the stock from ‘Neutral’ to ‘Buy’ in early June but revised his rating back to ‘Neutral’ by the end of the month and slashed his 12-month price target from $7 to $6.4.Although the analyst still likes the company’s underlying fundamentals, he has grown more concerned about its lofty valuation. Since Fang’s initial upgrade on June 3, NIO shares trade over 100% higher, despite the firm posting an unaudited first-quarter net loss of $243.3 million.Most other analysts have also taken the ‘wait and see’ approach, with the stock receiving 9 ‘Hold’ ratings. Currently, the consensus price target among analysts sits at $39.01, according to Yahoo! Finance – amazingly representing another 239% upside from Monday’s $11.51 close.Story continuesTechnical OutlookSince bottoming out just above $2 in mid-March, Nio shares have trended steadily higher with price accelerating on heavy volume in the past two trading sessions. Investors should be mindful of chasing recent gains as the relative strength index sits deep in overbought territory, increasing the probability of a retracement. Instead, those who wish to buy should look for an entry point near $5, where the stock finds a confluence of support from a horizontal trendline and the 50-day simple moving average.This article was originally posted on FX EmpireMore From FXEMPIRE: Google And Deutsche Bank Announce Strategic Partnership U.S. Stocks Set To Open Lower As Traders Take Profits After The Recent Upside Move Theres a Bull in a China’s Shop Buyers Will Have to Defend the Recent Gains BTC Aims At Further Growth EUR/USD Daily Forecast – Euro Turns Lower As EU Commission Slashes Forecasts"}]}