{"article": [{"url": "https://finance.yahoo.com/news/epic-games-sues-apple-over-195608794.html", "published": 1597331060.0, "headline": "Epic Games Sues Apple Over ‘Fortnite’ App Removal, Alleging Anticompetitive Conduct", "body": "It turns out that Epic Games’ announcement that it was doing an end-around with “Fortnite” to bypass Apple’s App Store 30% “tax” was a gambit to precipitate legal action.Earlier Thursday, Epic announced a 20% discount for “Fortnite” players who purchase the game’s virtual currency directly from the company, instead of from Apple or Google. After Apple blocked access to “Fortnite” on iOS devices, Epic Games announced that it had filed a lawsuit against the tech giant, accusing Apple of anticompetitive restrictions on mobile device marketplaces.“Rather than tolerate this healthy competition and compete on the merits of its offering, Apple responded by removing ‘Fortnite’ from sale on the App Store, which means that new users cannot download the app, and users who have already downloaded prior versions of the app from the App Store cannot update it to the latest version,” Epic said in the lawsuit.The games developer also said in the complaint that Apple’s removal of Fortnite “is yet another example of Apple flexing its enormous power in order to impose unreasonable restraints and unlawfully maintain its 100% monopoly over the iOS In-App Payment Processing Market.”Asked for comment on Epic’s lawsuit, an Apple rep provided the same statement it gave when it pulled “Fortnite” from the App Store.In that statement, Apple claimed that its App Store guidelines “are applied equally to every developer and designed to keep the store safe for our users.”Apple’s statement continued, “Epic has had apps on the App Store for a decade, and have benefited from the App Store ecosystem — including its tools, testing, and distribution that Apple provides to all developers. Epic agreed to the App Store terms and guidelines freely and we’re glad they’ve built such a successful business on the App Store. The fact that their business interests now lead them to push for a special arrangement does not change the fact that these guidelines create a level playing field for all developers and make the store safe for all users. We will make every effort to work with Epic to resolve these violations so they can return ‘Fortnite’ to the App Store.”Story continuesSpotify issued a statement of support for Epic’s lawsuit. The music streamer also has clashed with Apple over App Store rules, and filed a formal complaint with the European Union last year that prompted an EU antitrust probe into Apple. “We applaud Epic Games’ decision to take a stand against Apple and shed further light on Apple’s abuse of its dominant position,” a Spotify rep said. “Apple’s unfair practices have disadvantaged competitors and deprived consumers for far too long. The stakes for consumers and app developers large and small couldn’t be higher and ensuring that the iOS platform operates competitively and fairly is an urgent task with far-reaching implications.”Epic Games posted a copy of the lawsuit against Apple, which it filed in the U.S. District Court for the Northern District of California, at this link.The Epic lawsuit seeks an injunction “prohibiting Apple’s anticompetitive conduct and mandating that Apple take all necessary steps to cease unlawful conduct and to restore competition,” as well as a “declaration that the contractual and policy restraints complained of herein are unlawful and unenforceable.” Epic Games’ suit also is asking for “any other equitable relief necessary to prevent and remedy Apple’s anti-competitive conduct” and “such other and further relief as the Court deems just and proper.”Tim Sweeney, CEO of Epic Games, has been one of the most outspoken critics of the 30% revenue cuts levied by Google and Apple. “Apple has no right to take any percent of any company’s revenue just because they made the phone people use to access the stuff,” Sweeney tweeted last month.Epic Games noted that with the removal of the iOS version from the App Store, “Fortnite” remains available on Google Play, PlayStation 4, Xbox One, Nintendo Switch, PC, Mac, GeForce Now, and the Epic Games app on Android. In May, the company said “Fortnite” had topped 350 million registered players for the battle royale title.Players who already have downloaded the “Fortnite” iOS app via the App Store should have no issues continuing to play Chapter 2 – Season 3’s 13.40 update, according to Epic. However, they will not be able to access new content once Chapter 2 – Season 4 begins.Epic also released a parody of Apple’s Ridley Scott-directed “1984” commercial from that year’s Super Bowl. Epic’s “Nineteen Eighty-Fortnite” likens Apple to Big Brother:"}]}