{"article": [{"url": "https://finance.yahoo.com/news/why-john-bolton-book-revelations-about-trump-presidency-hasnt-shaken-the-confidence-of-this-senator-155349724.html", "published": 1592478080.0, "headline": "Why John Bolton book revelations about Trump presidency hasn't shaken the confidence of this senator", "body": "Don’t expect shocking new revelations on the Trump presidency in an upcoming book by former Trump national security advisor John Bolton to cause Republicans to flee in supporting the president or voice their lack of confidence in the commander-in-chief to handle key trade deals.That is if fresh comments from the Republican Senator out of Pennsylvania Pat Toomey offers insight into early thinking inside the party, as details of Bolton’s book are leaked to the press and as Bolton himself slams Trump in interviews.“I wouldn’t base my confidence on the president’s negotiations on one account from one person, which has already been categorically refuted by another person in the room. As you may be aware, Bob Lighthizer the U.S. trade representative, was testifying before Senate Finance Committee yesterday. I am on that committee, and he was asked were you in the room at the time that this conversation supposedly took place, and Bob Lighthizer very adamantly insisted that he was in the room and no such conversation took place,” Toomey said on Yahoo Finance’s The First Trade.A copy of \"The Room Where It Happened,\" by former national security adviser John Bolton, is photographed at the White House, Thursday, June 18, 2020, in Washington. (AP Photo/Alex Brandon)Toomey was responding to a question by Yahoo Finance on if he had lost confidence in the ability of the president to properly handle international trade negotiations. Bolton alleges in his 577-page book ‘The Room Where it Happened’ that Trump asked China president Xi to buy agricultural products in an effort to help his re-election. Farmers have long been Trump supporters. But, the two countries have been locked in a trade war going on two-plus years, so Bolton’s comments have surprised many folks.Bolton also alleges improper handling by Trump of military aid to Ukraine.President Trump promptly took to Twitter on Thursday to refute Bolton’s allegations.“Bolton’s book, which is getting terrible reviews, is a compilation of lies and made up stories, all intended to make me look bad. Many of the ridiculous statements he attributes to me were never made, pure fiction. Just trying to get even for firing him like the sick puppy he is!,” Trump tweeted. The president flat out told The Wall Street Journal on Bolton: “he’s a liar.”Story continues“I think it would be a mistake to jump to a conclusion about one allegation, especially when it’s being specifically refuted,” Toomey added.Brian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn.Magic Johnson: this is my biggest investing regretNBA great Dwyane Wade: here is some of my best parenting adviceCoca-Cola CEO: here’s what our business looks like right nowDropbox co-founder: the future of work will be all about thisHilton CEO: the hotel industry will recover from the coronavirus pandemicHome Depot co-founder: states should decide when to reopen after worst of coronavirusFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}