{"article": [{"url": "https://finance.yahoo.com/news/trump-calls-for-goodyear-boycott-on-report-company-labels-maga-propolice-messages-unaccepable-155140892.html", "published": 1597841300.0, "headline": "Trump calls for Goodyear boycott as company moves to clarify policy on political messages in the workplace", "body": "President Donald Trump on Wednesday engaged in a war of words against Goodyear (GT), calling for a boycott in reaction to a social media post that suggested the company was playing favorites with employee-approved political speech.Trump appeared to react to suggestion the company was sanctioning the use of his trademark “Make America Great Again” slogan as unacceptable on the job, even as it permitted the use of other culturally sensitive messages.According to a social media post that was widely circulated and picked up by an NBC affiliate in Madison, Wisconsin, a Goodyear presentation slide entitled “Zero Tolerance” approved of pro-Black, Lesbian, Gay, Bisexual and Transgender messaging. Yet the slide also grouped pro-Trump and pro-police vernacular into a category listed as “unacceptable,” along with other “politically affiliated slogans or materials.”On Wednesday, the president — locked in a fierce reelection battle against former Vice President and Democratic Nominee Joe Biden — lashed out at the tire maker, urging his followers to boycott its products, adding that “two can play the same game, and we have to start playing it now!”Don’t buy GOODYEAR TIRES - They announced a BAN ON MAGA HATS. Get better tires for far less! (This is what the Radical Left Democrats do. Two can play the same game, and we have to start playing it now!).— Donald J. Trump (@realDonaldTrump) August 19, 2020In response, Goodyear issued a statement saying the slide in question was “not created or distributed by Goodyear corporate,” and was not part of its core diversity training. The company insisted the backlash was part of “misconceptions about our policies,” and that it backs equality and law enforcement.Yesterday, Goodyear became the focus of a conversation that created some misconceptions about our policies and our company. Goodyear has always wholeheartedly supported both equality and law enforcement and will continue to do so. pic.twitter.com/oO6jUg2rTR— Goodyear (@goodyear) August 19, 2020The stock, traded on the New York Stock Exchange, briefly dropped by more than 2% before recovering lost ground after Goodyear issued its rebuttal.Story continuesTrump is no stranger to high-profile fights with public companies, and has been wont to lash out at corporations that adopt policies unfavorable to his political or policy objectives. With his poll numbers lagging, he’s made explicit appeals to his political base in hopes of bolstering his support — which usually involves the use of highly-charged cultural issues.Most recently, the president has moved to block the viral video app TikTok in the U.S., citing national security concerns, and has pushed for the sale of its domestic operations to an American entity.In 2018, the president waded into a war of words with Harley Davidson (HOG), backing a boycott in response to the company relocating some operations to Europe. And in the early stages of the coronavirus crisis, he publicly lambased General Motors (GM) for not ramping up production of needed ventilator equipment, before ordering them to do so under the Defense Production Act (DPA).Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFind live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}