{"article": [{"url": "https://finance.yahoo.com/news/oecd-adds-risk-of-covid-19-doublehit-in-bleak-economic-forecasts-090007130.html", "published": 1594094900.0, "headline": "OECD adds risk of COVID-19 'double-hit' in bleak economic forecasts", "body": "The Organisation for Economic Co-operation and Development factored in the risk of a second wave of COVID-19 in its bleak economic forecasts, adding that countries need to move quick to extend unemployment benefits.In a new report, the OECD said the unemployment rate among its 37 member countries ticked down to 8.4% in May 2020, down from a decade-high 8.5% in April. The picture is bleaker in the United States, where the unemployment rate sits at 11.1% as of June.The OECD, which counts the U.S. as one of its member countries, expects the U.S. unemployment rate to remain high at 10.4% in the fourth quarter of 2020.“As prospects of quickly finding new work will remain poor for many, some countries should extend unemployment benefit durations to prevent jobseekers from sliding too quickly into much less generous minimum income benefits,” the OECD report reads.The report, describing the jobs crisis as “far worse than the 2008,” comes as lawmakers in Washington continue to scramble for a “phase 4” package of further fiscal relief. In focus: whether or not Congress should extend the extra $600-per-week unemployment insurance set to expire at the end of this month.Federal Reserve Chairman Jerome Powell has argued that the bonus unemployment insurance should be extended if the viral spread will make it unsafe for people to go back to work. But some within the administration, such as Labor Secretary Eugene Scalia, have reportedly expressed disinterest in extending the benefits.Organization for Economic Cooperation and Development (OECD) Secretary-General Angel Gurria speaks during a press conference for the the Fourth 1+6 Roundtable Dialogue at the Diaoyutai State Guesthouse in Beijing, Thursday, Nov. 21, 2019. (AP Photo/Mark Schiefelbein)‘Double-hit’But the OECD warns that failure to provide support would ultimately result in longer-term challenges in pulling workers back into jobs even after the COVID-19 crisis subsides. OECD Secretary-General Angel Gurría said the deep unemployment, which has disproportionately affected women, young people, and low-income workers, is at risk of evolving into a “full-blown social crisis.”“Macroeconomic policies must remain supportive through the crisis to minimize the risk of a prolonged slump and a lost generation of young people whose labor market prospects are durably harmed,” Gurría said.Story continuesThe OECD report acknowledges the risks of a second wave and included a “double-hit” scenario in its economic forecasts. Under a single wave, the OECD forecasts U.S. real GDP growth of -7.3% in 2020 with a 4.1% rebound in 2021. But in a second wave, the OECD predicts U.S. real GDP growth of -8.5% in 2020 with a muted bounce-back of only 1.9% in 2021.For all OECD countries, the OECD expects a 7.5% contraction in real GDP for 2020 under a single-hit scenario but a 9.3% contraction for 2020 under a second wave.The OECD report said policymakers should target support “where it is most needed” and, in other cases, encouraging a return to work where possible. Getting it right could help countries minimize the damage, the OECD said.“Get them wrong, and the consequences will be felt by many people for a long time,” the report reads.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Fed Chair Powell warns of economic fallout from a 'second outbreak'Former CFPB head: SCOTUS decision allows consumer watchdog to 'go forward'A primer on the Fed's corporate bond-buying programFed to cap bank dividend payments after completing stress test, COVID analysisA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}