{"article": [{"url": "https://finance.yahoo.com/news/democratic-rep-moore-blasts-trump-on-post-office-delays-urges-party-to-get-out-the-vote-125921789.html", "published": 1598170040.0, "headline": "Democratic Rep. blasts Trump on USPS woes: 'No hope' of waking up knowing who won the election", "body": "President Donald Trump has said that his main concern with mail-in voting is that it could lead to fraud — but Democrats view his fight over mail-in ballots as an attempt to enact voter suppression, Wisconsin Democratic Rep. Gwen Moore told Yahoo Finance in a recent interview.Washington’s increasingly acrimonious battle over the U.S. Postal Service is poised to get even more polarizing, now that the Democratic-led Congress has passed a $25 billion rescue package that Trump immediately dismissed as a “hoax.”Plagued by slow service and deficit spending for years, the USPS is now caught in the mother of all political battles ahead of the general election. The fight has been amplified by the coronavirus pandemic, which has prompted many states to weigh mail-in ballots to spur voting without having to gather in large groups.Moore charged that Trump is “trying to undermine the Post Office. He’s suing states that are looking for ways to expand the opportunities to get ballots to voters,” she told Yahoo Finance on Friday.“I have absolutely no hope that I’m going to wake up on the morning of November 4 and know what the results of the election are,” she added.Postmaster General Louis DeJoy sought to reassure lawmakers on Friday that mail-in ballots sent close to Election Day would be delivered. However, Moore blasted Trump for suggesting that not all of those votes would count, something she labeled “criminal.”Meanwhile, Democrats are training volunteers to help make every vote count.“We have trained 100,000 people [virtually], more than we could have in person, to sort of meet the challenges that we face. You know, we understand that when we get the vote out, we win,” said Moore.Biden has ‘no power to do anything right now’Democratic presidential candidate former Vice President Joe Biden speaks during the fourth day of the Democratic National Convention, Thursday, Aug. 20, 2020, at the Chase Center in Wilmington, Del. (AP Photo/Andrew Harnik)For the tens of millions of Americans currently collecting unemployment benefits during the pandemic, economic relief is still mired in political gridlock as Congress and the White House struggle to find consensus.Story continues“I have to admit, we are in a bind. And [Democratic presidential nominee] Joe Biden is in a bind too. He has no power to do anything right now,” the Milwaukee Democrat told Yahoo Finance.During the Democratic National Convention last week, House Speaker Nancy Pelosi blamed Republicans for the deadlocked negotiations.Recognizing that electing Biden won’t put an end to the political standoff, Democrats are pinning their hopes on flipping seats in the Senate. That includes in Kentucky, where Democratic candidate Amy McGrath is challenging Senate Majority Leader Mitch McConnell on Nov. 3.“I’m not convinced that Mitch McConnell will be reelected, nor am I convinced that...he’ll be able to maintain his majority in the United States Senate. None of us had really realistically hoped that we would flip the Senate, until recently,” said Moore.Democrats are speculating that voters in red states, dismayed by Trump’s attack on the postal service, may sour further on him.“I think that there are many voters in red states who are puzzled by for example the president’s desire to destroy the Post Office,” said Moore — adding that rising COVID-19 casualties in the Sun Belt region is also a factor.More from Sibile:Trump payroll tax deferment is ‘employee relations disaster’Coronavirus gut check: How small businesses are survivingHow Hollywood content can ‘normalize injustice’Michigan Gov. Whitmer, potential VP pick, has ‘good relationship’ with Biden, says Lt. Gov.Biden’s plan to fight criminal justice injusticeFind live stock market quotes and the latest business and finance news"}]}