{"article": [{"url": "https://finance.yahoo.com/news/ghosting-is-not-just-for-lovers-these-job-applicants-say-cruel-and-selfish-employers-do-it-too-194351837.html", "published": 1598878280.0, "headline": "‘Ghosting’ is not just for lovers. These job applicants say 'cruel' and 'selfish' employers do it too.", "body": "The search for new employment has been brutal for millions of Americans faced with a 10.2% unemployment rate.With more than 58 million Americans losing their jobs since the start of the coronavirus shutdowns in mid-March, competition for the few slots available has been fierce.Job seekers of all ages are being forced to contend with a phenomenon often more familiar to the dating scene – ghosting. For the romantically uninitiated, that’s when your crush dumps you but never takes the time to pick up the phone to let you know that they’ve moved on.Job seekers are feeling that same sense of rejection, though this time it’s hurting their wallets rather than their hearts.According to a recent LinkedIn poll, 93% of job applicants reported being “ghosted” by an employer after an initial in-person interview or after responding to a request for additional information. (The poll surveyed 2,564 LinkedIn voters from Aug. 14-17.)LinkedIn News Editor Andrew Seaman says he was surprised to see that ghosting is “so pervasive.” The poll results he posted hit a nerve, prompting close to a thousand comments from job seekers, recruiters, and workers.‘Take ‘ghosting’ as a gift and keep moving!’Some workers expressed sympathy for job seekers who got ghosted.Not surprisingly recruiters chimed in too, mostly to defend their colleagues.However, not all recruiters were willing to justify it.Seaman encourages ghosted job seekers to follow up with recruiters and hiring managers up to three times, but to keep searching.“Even though people may feel pretty angry and sad that they deserve a response, you want to leave a door open so that a month or two down the road, that recruiter, that hiring manager can say, ‘hey I’m really sorry about the delay and I think we’re ready to move forward with this position. Are you still interested?’” said Seaman. “You never want to sort of burn that bridge before you know you’re never gonna go across it.”Seaman said that unless a job seeker has received a firm rejection from an employer, the door is technically still open.Story continues“It’s obviously difficult when you’re navigating in a job search. There’s a lot of emotions that come with it, but if you email saying you know, I deserve an answer, I demand an answer...it doesn’t bode well,” he said.Overall, hiring has been improving month-over-month, jumping by more than 50% from June to July, according to LinkedIn data. The networking platform reports that the most in-demand jobs in August include financial adviser, software engineer, and salesperson.More from Sibile:Crunch time for United, American and Delta as clock ticks toward deadline, pressuring DC’s warring partiesTrump’s $300 per week unemployment boost ‘too little, too late’ to help August spending: GoldmanEconomist: Pay people $1K to take a coronavirus vaccine instead of forcing themDemocratic Rep. blasts Trump on USPS woes: ‘No hope’ of waking up knowing who won the electionTrump payroll tax deferment is ‘employee relations disaster’Find live stock market quotes and the latest business and finance news"}]}