{"article": [{"url": "https://finance.yahoo.com/news/amc-reverses-course-will-require-face-masks-be-worn-upon-reopening-we-did-not-go-far-enough-233006047.html", "published": 1592591900.0, "headline": "AMC on why it reversed course on face masks: 'We did not go far enough'", "body": "AMC (AMC) on Friday reversed course on its controversial face mask policy, following mounting pressure from health officials and patrons as the entertainment industry reels from the coronavirus outbreak.On Thursday, president and CEO Adam Aron told Variety that the theater chain would not require facial coverings, citing them as a “political controversy” that the company did not “want to be drawn into.”“We thought it might be counterproductive if we forced mask-wearing on those people who believe strongly that it is not necessary,” he said.The announcement was quickly met with intense backlash that forced the theater chain to retract its policy.“It is clear from this response that we did not go far enough on the usage of masks,” the company said in a statement on Friday afternoon. “As we reopen theaters, we now will require that all AMC guests nationwide wear masks as they enter and enjoy movies at our theaters.”An industry at a standstillWriter-director Bong Joon-ho, winner of the Best Picture, Director, Original Screenplay, and International Feature Film awards for \"Parasite,\" poses in the press room during the 92nd Annual Academy Awards at Hollywood and Highland on February 09, 2020 in Hollywood, California.Fears over a potential second wave have escalated in recent weeks with new coronavirus cases spiking in Texas, Arizona and Florida. With the industry at a standstill that’s costing Tinseltown billions, theaters and other entertainment venues are desperate to lure in as many paying patrons as possible — especially with lockdowns being relaxed.However, the crisis’ toll continues to mount. On Monday, the Oscars was officially postponed from February 28, 2021 to April 25, 2021, due to COVID-19 disruptions. The Academy also extended its eligibility window through Feb. 28, 2021, as studios continue to remain conservative on releasing big-budget films.“For over a century, movies have played an important role in comforting, inspiring, and entertaining us during the darkest of times. They certainly have this year,” Academy president David Rubin and CEO Dawn Hudson said in a joint statement.“Our hope, in extending the eligibility period and our awards date, is to provide the flexibility filmmakers need to finish and release their films without being penalized for something beyond anyone’s control,” the duo added.Story continuesStill, with many blockbusters skipping the summer season entirely, two major tentpoles — Disney’s live-action “Mulan” and Christopher Nolan’s “Tenet” — are still holding out hope for July releases.“Tenet”, which was originally scheduled to debut July 17th, pushed back its release date to July 31st as questions loom over nationwide reopenings and the status of movie theater attendance at large.Historically, this will be the fourth time the Oscars has been postponed. The award show was first delayed in 1938 following massive flooding in Los Angeles. A second delay occurred in 1968 after the assassination of Dr. Martin Luther King, Jr., and then again in 1981 following an assassination attempt on President Ronald Reagan.Alexandra is a Producer & Entertainment Correspondent at Yahoo Finance. Follow her on Twitter @alliecanal8193Read more:From 'Gone With the Wind' to 'Bachelor', Hollywood is moving to address claims of racismNetflix, Disney join other big brands in support of George Floyd protests on 'Blackout Tuesday'Kylie Jenner still Forbes' highest-paid celeb, despite not being a billionaire anymoreWhy ending coronavirus lockdowns 'won't be enough' to get people back to the moviesHow coronavirus could accelerate the demise of cable TV"}]}