{"article": [{"url": "https://finance.yahoo.com/news/the-jobs-recovery-is-nearing-the-point-of-exhaustion-150725543.html", "published": 1599214520.0, "headline": "The jobs recovery is 'nearing the point of exhaustion'", "body": "The August employment report made a strong showing, with the U.S. economy adding a greater than expected number of payrolls, but labor market observers say most of the recovery in the current climate has already been done and that further gains will be very difficult.“This was an impressive report,” LPL Financial Chief Market Strategist Ryan Detrick wrote in a note. “But 8% unemployment is still 8% unemployment, so let’s not get too excited.”The U.S. added 1.37 million payrolls last month, beating expectations of 1.35 million, and the unemployment rate fell to 8.4% — far below the 9.8% expected — and the first time since the pandemic where the unemployment rate hit single-digits.“Today’s report is another sign that the recovery in the labor market is nearing the point of exhaustion,” wrote Charlie Ripley, senior investment strategist for Allianz Investment Management.Jamie Cox, managing partner for Harris Financial Group, called the jobs numbers “solid’ in a release, but noted that “the next 2-3% of employment gains are going to be very tough because there is no total re-opening in sight.”A help wanted sign is displayed at a Home Depot store in Indianapolis, Wednesday, Sept. 2, 2020. (AP Photo/Michael Conroy)Pantheon Macro’s Ian Shepherdson wrote in a note that the drop in unemployment is a “distraction,” from more bad news. “The loss of momentum is consistent with other near-real-time indicators, and we see little chance of a quick re-acceleration,” he said.There are myriad reasons why the next leg could be so difficult.“PPP funds are running dry and the impasse in Congress to reauthorize another round for struggling small businesses most affected by the pandemic are recipes for a wave of small business closures, particularly among restaurants and small retailers,” wrote Cox.And for those restaurants, colder weather is coming, which will disrupt outdoor seating plans many adopted in order to reopen.Ripley said the details in the jobs report “should signal to lawmakers that another round of fiscal stimulus will be needed to keep the economic recovery on track.” But Congress remains divided over additional coronavirus relief.Story continuesThe devil in the detailsWhile the headline employment numbers were strong, the details painted a starker picture of the economy.“238,000 of those job additions were only temporary government jobs and the overall pace of hiring seems to be slowing,” Ripley wrote. These workers were hired by the government to perform the Census, something that only happens every 10 years.Ripley and others have also pointed out that the number of people who have lost jobs permanently — as opposed to temporary job loss because of coronavirus — have ticked up significantly by 534,000 to 3.4 million, after holding relatively steady.More \"temporary layoffs\" are proving to be not-so temporary https://t.co/Qn8SxBYuqJ pic.twitter.com/Y9wSZc5ypw— Sam Ro 📈 (@SamRo) September 4, 2020While restaurant and hospitality workers saw “strong gains,” Ripley said, “it’s a drop in the bucket compared to the job losses that occurred back in April.”Matt Luzzetti, chief economist at Deutsche Bank, stressed to Yahoo Finance that more stimulus is needed to keep the labor market healthy. Only 50% of jobs have come back, he said, and there’s no reason for the government to “take its foot off the gas.”Luzzetti warned that the fall may turn ugly again when it comes to layoffs.“The concern going forward is, do we see a spread of these layoffs to other areas,” he said. “There's some evidence that could happen into October — you don't want to extrapolate these better-than-expected gains into future months.”And when the vaccines hit the market, it may provide far more instant juice to the stock market than the labor market, whose response Luzzetti expects to lag.“We don’t see output levels getting back to pre-pandemic levels until 2022,” he said.--Ethan Wolff-Mann is a writer at Yahoo Finance focusing on consumer issues, personal finance, retail, airlines, and more. Follow him on Twitter @ewolffmann.Why the 2020 rally doesn’t feel like a bubble: hedge fund veteranStock split behavior confuses billionaire and analystsMutual funds have a FAAMG problemNYU professor: Make sure young investors 'don't become addicted' to online stock tradingYoung investors have a huge stomach for risk right now, data suggestsThe stock market just re-taught investors a crucial lesson5 rookie mistakes investors make: hedge fund veteran"}]}