{"article": [{"url": "https://finance.yahoo.com/news/former-cfpb-head-scotus-decision-allows-consumer-watchdog-to-go-forward-152133778.html", "published": 1593512960.0, "headline": "Former CFPB head: SCOTUS decision allows consumer watchdog to 'go forward'", "body": "The former head of the Consumer Finance Protection Bureau says he is encouraged by the Supreme Court’s decision to leave the consumer watchdog intact, despite the court’s ruling that its single director structure was unconstitutional.“There certainly could have been worse outcomes, there could have been better outcomes,” Obama-era CFPB Director Richard Cordray told Yahoo Finance. “This was the outcome I expected.”The agency, the brainchild of Sen. Elizabeth Warren, was created in the aftermath of the financial crisis and was centered around a single director that could only be removed by the president “for cause.” Chief Justice John Roberts, in an opinion of the court delivered Monday, wrote that a lone director protected from removal “is enough to render the agency’s structure unconstitutional.”In a 5-4 vote, the Supreme Court severed the “for cause” provision in the Dodd-Frank law that created the agency, meaning that the president will now be able to fire the head of the CFPB at will.Cordray was the first director in the agency’s short history and said the decision otherwise has little impact on the financial services industry that the CFPB regulates. He argues that the decision may actually bust the backlog of pending lawsuits from companies that have disputed CFPB actions on the basis of unconstitutionality.The former director, who joined the agency via a controversial recess appointment in 2012, said the decision allows the CFPB to “go forward, free of the impediment of further constitutional challenges.”The CFPB is novel in its power to regulate and supervise non-bank lenders that otherwise would not be covered by banking regulators like the Federal Reserve, Federal Deposit Insurance Corp., or the Comptroller of the Currency.Democratic gubernatorial candidate Richard Cordray speaks at the Columbus Chamber of Commerce Government Day, Tuesday, Oct. 16, 2018, in Cincinnati, Ohio. (AP Photo/John Minchillo)During Cordray’s time as CFPB director, the agency passed rules on limiting payday loans and expanding lender due diligence by requiring an assessment of borrowers’ ability-to-repay. His tenure at the CFPB included frequent spats with Republicans on Capitol Hill, who accused Cordray of pursuing industry-harming rulemaking beyond the CFPB’s statutory authority.Story continuesIn the case of the CFPB’s 2013 efforts to discourage discriminatory auto loan practices, Congress and the White House were able to repeal the CFPB’s guidance.Throughout its history to date, the CFPB was embroiled in the constitutionality question. The statutory puzzle reached a boiling point in 2017 when Cordray stepped down as director to pursue an ultimately failed bid for Ohio governor, leaving behind confusion over whether Cordray or President Trump had the authority to appoint an acting director.Trump’s appointee, Mick Mulvaney, ultimately won the legal battle to assume the acting role. The White House later installed former Department of Homeland Security official Kathy Kraninger to the position in 2018.What’s next for the CFPB?Analysts in DC note that the Seila Law LLC v. Consumer Financial Protection Bureau ruling exposes CFPB actions to more political risk, since the director will now be at risk of getting fired at any moment by the president.Ed Mills at Raymond James wrote that the immediate implication is that if Democrat Joe Biden wins the election later this year, being able to fire Kraninger would allow Biden to “more significantly influence financial policy earlier in his term.”Cordray told Yahoo Finance that he is in touch with the Biden campaign on consumer finance-related issues and “undoubtedly” expects that Kraninger would be out if the Democrats win the White House. Cordray said he would “possibly” consider returning to the agency if asked.In the meantime, questions remain about how the decision could affect rulemaking and therefore the financial services industry.Compass Point analyst Isaac Boltansky wrote Monday that a Democrat-led CFPB would be negative for payday lenders, student loan servicers, credit reporting agencies, and auto lenders. But with a Republican currently at the head of the agency, Boltansky says the SCOTUS decision may fuel more rulemaking and enforcement from state-level regulators in progressive states.“Ultimately, we believe that policy volatility at the federal level and a more forceful approach at the state level could weigh on multiples in the consumer finance space,” Boltansky said.CFPB Director Kraninger said Monday that in the mean time, the agency will “continue with our important mission of protection consumers with no question that we are fully accountable to the president.”— Aarthi Swaminathan contributed to this article.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.A primer on the Fed's corporate bond-buying programFed to cap bank dividend payments after completing stress test, COVID analysisIMF projects 4.9% economic contraction as concerns mount over second waveBoston Fed's Rosengren: Second half of 2020 will be 'more difficult' than anticipatedA glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}