{"article": [{"url": "https://finance.yahoo.com/news/benefits-cliff-threatens-stimulus-supported-recovery-morning-brief-095835359.html", "published": 1597381580.0, "headline": "Why a ‘benefits cliff’ threatens the economic recovery: Morning Brief", "body": "Friday, August 14, 2020Get the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. SubscribeRetail sales will offer a final look back at a stimulus-supported recovery.In just a few hours, investors will get the July reading on retail sales.Wall Street expects the report will show sales increased 2.1% last month, a more modest increase after a 7.5% jump in June.June’s retail sales data brought this measure of consumer spending back above levels that prevailed before the pandemic.And in doing so affirmed the strength of the economic comeback in the early part of the summer and the effectiveness of enhanced unemployment benefits and stimulus checks sent out as part of the CARES Act.But over the last few weeks, the economic situation has changed considerably.Oren Klachkin, lead U.S. economist at Oxford Economics, noted Thursday that the firm’s recovery tracker running through the week of July 31 fell for the fifth time in eight weeks.“The sugar rush from re-openings has clearly faded,” Klachkin writes.Since July came to a close, workers have been sent off what Deutsche Bank economists call the “benefits cliff” with no clear path in sight to offering more aid in the months ahead. And with a surge in the virus during July, the labor market stalled and real-time measures of economic activity flatlined.“Last month we argued that rapid and robust fiscal stimulus was a critical driver of the initial V-shaped recovery in consumer spending and therefore that several benefits cliffs could endanger this momentum if government support was removed prematurely,” said Matt Luzzetti, chief U.S. economist at Deutsche Bank.“The evaporation of these benefits highlights near-term downside risks to consumer spending, particularly for lower income households, which have been a critical engine of the recovery despite being disproportionately more likely to lose a job during the pandemic — a testament to the effectiveness of the income supplement.”Story continuesLuzzetti adds that while the White House announced it would take executive action last week to reallocate unused dollars from the CARES Act to supplement existing unemployment programs, there remain challenges — both legal and practical — to getting this aid into the hands of consumers.And as the following chart from Deutsche Bank shows, monies disbursed through unemployment programs have fallen sharply in August.Since the expiration of enhanced unemployment benefits through the CARES Act, assistance to workers has dropped sharply, posing a downside risk to consumer spending in the months ahead. (Source: Deutsche Bank)In addition to being harmed by this “benefits cliff” July’s retail sales data should also show the economic recovery entered a softer environment as case counts surged and tailwinds from pent-up demand following April’s lockdown abated.“We expect key July data next week to highlight a slower phase of the recovery,” said Lewis Alexander, an economist at Nomura. “Core retail sales growth will likely slow materially to a 2.0% m-o-m increase, down from 5.6% in June and 10.1% in May, reflecting softening high-frequency data on consumer debit and credit card spending.”And absent any material change in the current discussion about additional stimulus coming from lawmakers in Washington, Friday’s look back at July retail sales data could reflect the best data we get on the health of consumers for some time.“Executive orders issued by President Trump earlier this week fall short of providing meaningful support to the economy,” Klachkin writes.“The lack of funding for small businesses, state and local governments, and necessary health measures will minimize chances of a sustained rebound in our tracker. Without a substantial fiscal package, the virus will continue to depress economic activity, and significant downside risks will persist.”By Myles Udland, reporter and co-anchor of The Final Round. Follow him at @MylesUdlandWhat to watch todayEconomy8:30 a.m. ET: Retail sales advance, July MoM (2.0% expected, 7.5% in June)8:30 a.m. ET: Retail sales excluding autos, July MoM (1.3% expected, 7.3% in June)8:30 a.m. ET: Retail sales excluding auto and gas, July MoM (1.0% expected, 6.7% in June)8:30 a.m. ET: Business inventories, June (-1.1% expected, -2.3% in May)9:15 a.m. ET: Industrial production, July MoM (3.0% expected, 5.4% in June)9:15 a.m. ET: Capacity utilization, July (70.3% expected, 68.6% in June)10:0 a.m. ET: University of Michigan sentiment, August preliminary (71.9 expected, 72.5 in July)Earnings7:00 a.m. ET: DraftKings (DKNG) is expected to report an adjusted loss of 19 cents per share on revenue of $66.4 millionTop NewsFortnite maker sues Apple, Google after removal of game from app stores [Reuters]UK agrees to buy millions more COVID-19 vaccine doses [Yahoo Finance UK]China's economic recovery underwhelms as consumer comeback stays elusive [Reuters]Amazon considers relocating some employees out of Seattle [Bloomberg]YAHOO FINANCE HIGHLIGHTSTrump is martyring the postal serviceImpossible Foods gets $200 million of fresh fundsBiden's tax policy puts 16 consumer company stocks at risk: Goldman—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}