{"article": [{"url": "https://finance.yahoo.com/news/nyc-business-leaders-write-letter-urging-immediate-action-from-de-blasio-to-fix-big-apple-224737121.html", "published": 1599761840.0, "headline": "NYC business leaders urge 'immediate action' from de Blasio to fix Big Apple's rot", "body": "The leaders of some of Corporate America’s biggest names urged Mayor Bill de Blasio to take “immediate action” to address New York City’s deteriorating quality-of-life issues, warning that an exodus that began with the coronavirus pandemic would continue in the wake of “widespread anxiety” about the future.In a terse yet poignant letter released on Thursday, the Partnership for New York City — comprised of over 100 business and financial leaders based in the Big Apple — called on the mayor to move quickly to address a number of issues exposed by the coronavirus pandemic, including soaring violent crime.The signatories include the chief executives of Citigroup (C), Morgan Stanley (MS), Goldman Sachs (GS), Cushman & Wakefield (CWK), Macy’s (M) and JetBlue (JBLU), among others.New York City Mayor and Democratic Presidential candidate Bill de Blasio arrives at Liberty Island with his wife Chirlane McCray to attend the dedication of the new Statue of Liberty Museum in New York Harbor, U.S., May 16, 2019. REUTERS/Mike Segar TPX IMAGES OF THE DAYIn recent days, homelessness and crime have soared, and a number of wealthier residents have fled the city for other locations, particularly as continuing stiff restrictions take a heavy toll on public life.Governor Andrew Cuomo announced on Wednesday that the city would reopen indoor dining at partial capacity, a number of gymnasiums — which just reopened last week — are filing suit to allow group classes to resume. It underscored tensions between business owners being deprived of their livelihoods, and public officials moving to prevent more spreading.“Despite New York’s success in containing the coronavirus, unprecedented numbers of New Yorkers are unemployed, facing homelessness, or otherwise at risk,” the letter said.“There is widespread anxiety over public safety, cleanliness and other quality of life issues that are contributing to deteriorating conditions in commercial districts and neighborhoods across the five boroughs,” it added.In a post on Twitter, de Blasio said his goal was a partnership to “rebuild a fairer, better city” — but put the onus partly on the federal government. On Thursday, a measure to pass a stripped down stimulus bill, which would have included aid to states and localities, faltered in the U.S. Senate. Efforts to forge a consensus have become mired in election year politics and partisan squabbling.Story continues“Let’s be clear: To restore city services and save jobs, we need long term borrowing and a federal stimulus — we need these leaders to join the fight to move the City forward,” the mayor tweeted.Since the COVID-19 crisis first slammed into the city back in March, and forced widespread business closures, New York has slowly recovered from being a global epicenter of the outbreak.Still, grim headlines about residents fleeing New York have amplified growing concerns about the city’s tax base and finances, while raucous protests in the Big Apple’s formerly bustling streets stoke new fears about its fraying social fabric.Meanwhile, New York City may be forced to lay off tens of thousands of city workers, a microcosm of the nationwide jobless crisis that’s thrown millions out of work. In April, de Blasio warned the city was facing a tax revenue deficit of over $7 billion in the wake of the outbreak.The Partnership’s business leaders called for a “a strong, consistent message that our employees, customers, clients and visitors will be coming back to a safe and healthy work environment. People will be slow to return unless their concerns about security and the livability of our communities are addressed quickly and with respect and fairness for our city’s diverse populations.”Javier David is an editor for Yahoo Finance. Follow him on Twitter: @TeflonGeekFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance news"}]}