{"article": [{"url": "https://finance.yahoo.com/news/apple-2-trillion-by-year-end-wedbush-analyst-daniel-ives-181311959.html", "published": 1594819280.0, "headline": "Apple could be worth $2 trillion by year end: analyst", "body": "Apple’s (AAPL) market valuation could balloon to $2 trillion by the end of the year, says Wedbush analyst Dan Ives.“When the ball drops on Times Square, to me, you could be looking at a $2 trillion dollar market cap,” Ives told Yahoo Finance’s The First Trade. The iPhone maker currently boasts a market cap of $1.7 trillion.“This is two phases: first phase, you’re seeing in terms of Covid-19 holding up the services business, worth $600-650 billion,” said Ives.“Now, it’s the drumroll to the iPhone 12 super-cycle which will get launched in September,” Ives added. “350 million of 950 million users world-wide have not upgraded their phone in three and a half years of apple users. That’s the key.”In a bull case, Ives says Apple shares could hit $525.“Its a re-rating story in process at Apple,” said Ives.This Tuesday, Oct. 8, 2019, photo shows the Apple Pay app on an iPhone in New York. Experts warn that digital wallet services like Apple Cash and Venmo are prime targets for scammers. (AP Photo/Jenny Kane)Apple shares rallied to all-time intraday highs earlier this week, pennies shy of $400/share.On Wednesday, BofA analysts increased their price target on the stock to $410, saying investors are viewing Apple as “a liquid investment to weather an uncertain environment.”A BofA survey also shows users have strong brand loyalty for the iPhone maker.“Our ongoing global survey of smartphone users in the US, UK, China and India suggest that iPhone remains the ‘stickiest’ smart phone brand,” BofA analysts wrote.Get the advanced data and expert fundamental analysis you can trust with Yahoo Finance Premium. Start your free trial today.*Ines covers the U.S. stock market from the floor of the New York Exchange. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070Nasdaq is 'moving faster than any train we've ever seen before': veteran strategist'There's a risk of a lost decade here:' former IMF adviserFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}