{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-august-22-2020-181644541.html", "published": 1598513960.0, "headline": "Jobless claims: Another 1.006 million Americans filed new unemployment claims last week", "body": "Another 1 million Americans filed for first-time unemployment insurance benefits last week, as the impacts of the coronavirus pandemic continue to reverberate across the economy.The Labor Department released its report on weekly unemployment insurance claims Thursday at 8:30 a.m. ET. Here were the main metrics from the report, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended Aug. 22: 1.006 million vs. 1.000 million expected and vs. 1.104 million during the prior weekContinuing claims, week ended Aug. 15: 14.535 million vs. 14.44 million expected and vs. 14.758 million during the prior weekThe report showed back-to-back weeks that jobless claims topped the 1 million mark, following a brief break below that level earlier in August. While an improvement from the pandemic-era high of nearly 6.9 million weekly new jobless claims at the end of March, the weekly new jobless claims sum of 1 million remained far above the 665,000 new claims filed at the pre-pandemic high in March 2009.Since the week ended March 20 this year, more than 58 million Americans have so far filed new unemployment insurance claims.The majority of US states reported decreases in unadjusted new claims in this week’s print, reversing the trend seen during the prior week. California reported the greatest number of new claims at more than 209,000, for a rise of 19,000 versus last week. On the other hand, Florida saw the greatest numerical decrease in new unadjusted claims, with these falling by 27,000 to a total of 45,700.New claims for Pandemic Unemployment Assistance (PUA), or the federal program created to support individuals including the self-employed who are not typically eligible for state jobless claims, rose to 607,806 last week, up from 525,000 in the prior week.58.4 million jobless claims have been filed so far amid coronavirus outbreak since mid-March (David Foster/Yahoo Finance)The latest jobless claims report also comes as a number of states received approval to distribute an extra $300 per week in federal enhanced unemployment benefits authorized by President Donald Trump earlier this month. Some economists noted that the benefit may provide an incentive for workers who recently were laid off to file jobless claims after the lapse of the previous $600 per week in augmented benefits that ended late last month. However, only a couple states have begun actually paying out the funds to date.Story continues“The president’s new plan for $300 weekly unemployment checks is getting off the ground very slowly, with many states confused about the need to reprogram their computers when there is only a limited amount of diverted FEMA [Federal Emergency Management Agency] disaster funds to pay out to jobless workers,” said Chris Rupkey, chief financial economist for MUFG Union Bank.Meanwhile, continuing jobless claims, reported on a one-week lag, improved to a new pandemic-era low for the week ended August 15, taking out the previous low from the week ended August 8.Continuing claims have declined in seven of the last eight weeks’ worth of reports, as the number of individuals still receiving unemployment insurance benefits retreated. Last week’s insured unemployment rate improved to 9.9% from 10.2%.Still, at more than 14 million, the expected number of continuing claims held well above the fewer than 1.8 million continuing claims filed weekly in the months preceding the pandemic.This post is breaking. Check back for updates.—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}