{"article": [{"url": "https://finance.yahoo.com/news/why-trump-stopped-talking-about-obamacare-161917704.html", "published": 1599564440.0, "headline": "Why Trump stopped talking about Obamacare", "body": "In 2016, presidential candidate Donald Trump promised voters he would “repeal and replace” the Affordable Care Act.President Trump failed to do that. And as he runs for reelection in 2020, Trump has nothing to say about the ACA anymore. But Trump is still trying to kill the ACA, without saying so explicitly.The 2010 law, also known as Obamacare, was controversial from the moment Congress passed it and President Obama signed it. One lawsuit trying to kill the law made it to the Supreme Court in 2012, with the court upholding the law by a thin 5-4 vote. Republicans vowed to kill the law if they ever took control of Congress and the White House, as they did in the 2016 elections. But a 2017 vote to kill the ACA failed, with three Senate Republicans voting against the repeal bill.The Republican policy platform in 2016 called for repealing the ACA. The party doesn’t have a platform for 2020. The Trump campaign has published a list of goals for a second Trump term, but killing the ACA isn’t among the 7 bullet points on health care. Over the summer, Trump said he’d reveal a health care plan to replace Obamacare by the end of August. But he didn’t.“We have really seen a movement away from repealing and replacing the Affordable Care Act,” Georgetown University law professor Katie Keith, who tracks health policy for the journal “Health Affairs,” says on the latest Yahoo Finance Electionomics podcast. “Back in 2016, not only President Trump, but every Republican presidential candidate, had run on repealing and replacing the ACA. It’s a whole different world now.”President Donald Trump speaks during a news conference in the James Brady Press Briefing Room at the White House, Friday, Sept. 4, 2020, in Washington. (AP Photo/Evan Vucci)The ACA was unpopular in its early years, but that has gradually changed, with 51% of Americans now approving of the law and just 35% disapproving. The law prevents insurance companies from denying coverage or charging more for people with preexisting conditions, a provision Americans broadly support. Congress has also ended some contentious parts of the law, such as penalty fees for people who don’t buy insurance and a tax on high-value insurance plans like those some union members enjoy.Story continuesBut there’s still one major threat to the ACA: a lawsuit filed by several Republican-led states in 2018, with backing from the White House. The suit claims the entire ACA is invalid because Congress changed part of it in 2017, by eliminating the penalty fee for those without coverage. The plaintiffs say the whole law should be invalidated, and the Trump administration has filed a brief in the case agreeing with the plaintiffs. So Trump is, in fact, still trying to kill Obamacare, even though he no longer claims that to be a political goal.The Supreme Court will hear the new case against the ACA on Nov. 10—one week after the 2020 election—and probably render a decision in June of 2021. If the plaintiffs win and the high court finally strikes down the ACA, 20 million Americans who get health insurance under the law would lose it. And insurers would once again be able to discriminate against the 54 million Americans with preexisting conditions.This gets to Trump’s list of health care priorities for a second term, which is short enough to insert here:Source: Trump campaignThe fifth bullet point says Trump would “cover all pre-existing conditions.” That seems redundant and pointless, since the ACA already does what Trump claims he wants to do in the future. But this campaign promise presumes the Supreme Court strikes down the ACA, eliminating the law’s protections for patients with pre-existing conditions. If that happens, Trump would restore those protections in some other way.How? Trump hasn’t said. But when Congressional Republicans were trying to kill the ACA in 2017, they developed alternate bills on pre-existing conditions that might form the basis for a Trump policy, if he ever needed it. And those bills were not as airtight as the ACA.“Every one of their alternative proposals would either leave folks with preexisting conditions unprotected, paying more, facing benefit gaps, or it would result in significant coverage losses,” says Keith. “I'm just somewhat skeptical when I hear the president or Republicans in Congress say we're going to absolutely protect people with preexisting conditions. There's no evidence that we've seen that shows that they have a proposal that would do that.”So Trump’s health care plan is still repeal and replace Obamacare, even if he doesn’t describe it that way anymore. Joe Biden, Trump’s Democratic opponent, would do the opposite, not surprisingly. His health care plan involves strengthening the ACA, by broadening subsidies and plugging coverage gaps. Biden also favors a lower qualifying age for Medicare and a new government health plan for those who can’t get affordable coverage through the ACA or a private plan. Trump calls Biden a “radical,” but voters care deeply about health care and may decide Biden’s effort to expand coverage is less extreme than Trump’s effort to restrict it.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:How Biden would undo the Trump tax cuts5 campaign promises Trump has given up onBiden’s top economic priority isn’t what you thinkWhy Trump wants to shackle the postal serviceEdgy voters might reject the 2020 election outcomeGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}