{"article": [{"url": "https://finance.yahoo.com/news/real-estate-is-no-longer-americas-favorite-longterm-investment-bankrate-survey-180537634.html", "published": 1595942000.0, "headline": "Real estate is no longer Americans' favorite long-term investment: survey", "body": "Robinhood logo illustration by Igor Golovniov/SOPA Images/LightRocket via Getty Images. 2020/05/02.Stocks have replaced real estate as America’s favorite long-term investment.Stocks are now 28% of Americans’ investment of choice, dethroning real estate as the most popular long-term investment (26%) in 2020, according to a survey of more than 1,000 Americans from June 29 to July 5 by Bankrate, a New York-based consumer financial services company.Read more: How to start real estate investing“The way the stock market is viewed by individual investors can be very fickle,” said Greg McBride, senior vice president and chief financial analyst at Bankrate. He said the shift is “a function of renewed sentiment for the stock market, rather than a souring on real estate.”In 2019, 31% of Americans preferred real estate and only 20% chose stocks as their favorite long-term investment. During the coronavirus, the S&P 500 regained 20% of its value in the second quarter (after dropping 35% in March) and in the process caught investors’ eye.“The timing of [2020’s] polling came on the heels of a very strong market run,” said McBride.The poll’s finding parallels the rise of Robinhood and other investing apps, which have attracted millions of new investors during the coronavirus pandemic. E*Trade Financial Corp. gained 260,500 retail accounts in March, according to reports, while Robinhood gained 3 million new accounts in the first quarter.“We see some demographic overlap [with new trading apps] for sure. Millennials had a notable shift away from real estate and toward stocks,” said McBride. Older millennials (ages 31-39) were more likely to favor the stock market, with 33% choosing it as their favorite long-term investment. Only the silent generation (age 75+) had a stronger affinity for stocks (43%).But while some are more bullish on stocks, the coronavirus has had polarizing effects. A quarter of respondents said they would invest in stocks less aggressively. More than half of those who did not select the stock market as their top investment choice pointed to volatility during the pandemic as a reason why they stayed away, according to the survey.Story continues“There continues to be evidence of rattled nerves from the sharp swoon earlier in the year… More said they were going to invest less aggressively because of the pandemic. It’s love it or leave it — there’s not a whole lot of middle ground, it seems,” said McBride.But as the market moderates, real estate is expected to regain its spot as America’s favorite way to build wealth, said McBride.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Now average Americans can invest in real estate through this new partnershipFormer MGM CEO Jim Murren lists desert mansion for $10.5 million22 million Americans delayed buying a home during the coronavirus: Bankrate"}]}