{"article": [{"url": "https://finance.yahoo.com/news/bank-americas-8-best-stocks-200020734.html", "published": 1602169700.0, "headline": "Bank of America's 8 Best Stocks to Buy in Q4", "body": "Analysts say these are the best stocks to buy in the fourth quarter.After a brutal first quarter of 2020, the S&P 500 heated up in the second and third quarters. Investors shrugged off abysmal earnings numbers and drove the stock market to all-time highs in the third quarter on hopes that the economic recovery will gain momentum. The fourth quarter will be filled with uncertainty related to the election, the health crisis and the economy. However, Bank of America recently released its list of the top eight stocks to buy in the fourth quarter. These eight stocks are high-conviction ideas that have market-moving catalysts coming before the end of the year.Extra Space Storage (EXR)Analyst Jeffrey Spector says self-storage real estate investment trust Extra Space Storage is well-positioned to outperform in the closing months of 2020. Spector says self-storage is a defensive business during periods of economic uncertainty. A rise in the number of Americans moving because of changing work environments will continue to be a bullish catalyst for Extra Space. In addition, Spector says operations have mostly returned to normal following the early 2020 downturn. Finally, Extra Space pays a 3.2% dividend. Bank of America has a \"buy\" rating and $129 price target for EXR stock.Freeport-McMoRan (FCX)Freeport-McMoRan is the world's largest public copper and molybdenum producer and owns the world's largest gold mine in Grasberg, Indonesia. Gold prices are up more than 22% in 2020 in part because of inflation concerns stemming from the Federal Reserve's massive stimulus programs. Analyst Timna Tanners says she is bullish on both copper and gold prices, which could drive earnings upside for Freeport when the company reports third-quarter earnings in late October. Unfortunately, management has said it will not reinstate its suspended dividend until 2021. Bank of America has a \"buy\" rating and $19 price target for FCX stock.Story continuesAlphabet (GOOGL, GOOG)Google parent company Alphabet has been the worst-performing FAANG stock of 2020. In fact, in the second quarter, Alphabet reported the first negative revenue growth in its history. Analyst Justin Post says search advertising will likely recover faster than investors expect, and Google's subscription services, cloud business and Waymo self-driving vehicle segment all benefit in the long term from the health crisis. Post says there is risk of a Department of Justice antitrust suit against Google, but any clarity on the situation could actually boost the stock. Bank of America has a \"buy\" rating and $1,850 price target for GOOGL stock.Jazz Pharmaceuticals (JAZZ)Analyst Jason Gerberry says specialty drugmaker Jazz Pharmaceuticals has multiple pipeline-stage growth drivers that will help the company diversify from its legacy core drug, sodium oxybate. Because Jazz faces generic sodium oxybate competition in 2023, its ability to diversify will be key to expanding the stock's earnings multiple, Gerberry says. In the fourth quarter, Jazz will report phase 3 Xywav data for patients with idiopathic hypersomnia, a market that Gerberry estimates could be worth up to $650 million in peak revenue for Jazz. Bank of America has a \"buy\" rating and $166 price target for JAZZ stock.Eli Lilly & Co. (LLY)Analyst Geoff Meacham says drug company Eli Lilly has a better growth profile than its peers, including a projected 8% compound annual revenue growth and mid-teens earnings per share growth over the next five years. Meacham says Eli Lilly is one of the highest-quality stocks he covers, given its diversified growth drivers, including oncology and diabetes. In the fourth quarter, Eli Lilly is expected to release phase 3 data on diabetes drug tirzepatide. Meacham says near-term drug pricing risk is already priced into the stock. Bank of America has a \"buy\" rating and $180 price target for LLY stock.Medtronic (MDT)Medtronic is a medical device company. Analyst Bob Hopkins says Medtronic is reasonably valued and well-positioned to beat Wall Street expectations in the near term. Hopkins says the company's analyst day on Oct. 14 should help eliminate investor skepticism after the company has failed to live up to expectations over the last five years. Medtronic has a new CEO who is already addressing past issues by aggressively changing the company's operating structure. Following analyst day, Medtronic will report quarterly earnings in November. Bank of America has a \"buy\" rating and $130 price target for MDT stock.Parker-Hannifin Corp. (PH)Parker-Hannifin is a supplier of industrial hydraulics and motion and fluid control systems and components. Analyst Andrew Obin says investors don't fully appreciate the company's operational improvements. Parker-Hannifin's earnings have been less cyclical than other high-quality industrial stocks during the 2020 downturn. Parker-Hannifin is reporting earnings in early November, and Obin is forecasting a significant earnings beat on better-than-expected margins. In addition, Obin says any economic data suggesting a recovery in industrial activity should be a bullish catalyst for the stock. Bank of America has a \"buy\" rating and $265 price target for PH stock.Walmart (WMT)While other retailers have struggled in 2020, Walmart has gained market share, ramped up growth numbers and outperformed the S&P 500 by a wide margin. Analyst Robert Ohmes says the health crisis has accelerated Walmart's omnichannel strategy and its share gains from brick-and-mortar competitors. Ohmes says subscription service Walmart+ should help the company better monetize its rapidly growing digital traffic and 160 million weekly customers. Near-term catalysts include third-quarter earnings in mid-November and its proposal to acquire a minority stake in social media platform TikTok. Bank of America has a \"buy\" rating and $175 price target for WMT stock.Bank of America's recommended stocks:-- Extra Space Storage (EXR)-- Freeport-McMoRan (FCX)-- Alphabet (GOOGL, GOOG)-- Jazz Pharmaceuticals (JAZZ)-- Eli Lilly & Co. (LLY)-- Medtronic (MDT)-- Parker-Hannifin Corp. (PH)-- Walmart (WMT)"}]}