{"article": [{"url": "https://finance.yahoo.com/news/zillow-economist-theres-a-staggering-shortage-of-homes-on-the-market-182341131.html", "published": 1599658280.0, "headline": "There's a 'staggering shortage of homes on the market': economist", "body": "Despite an economic downturn this summer, a homebuying frenzy boosted home prices by almost 9% and drove available housing inventory down 30% in August compared to the same time last year, according to Zillow.A foreclosure moratorium on federally-backed mortgages (now extended through December 31), which was designed to keep people in their homes during the coronavirus pandemic, has inflated the housing market, according to economists.“That is a whole bunch of inventory [homes in forbearance], which would normally actually be selling at fire sale prices. Where instead — and I mean this is great news for those folks, that they can hunker down [and] they can stay put — but it is actually kind of locking up a lot of home inventory,” Jeff Tucker, economist at Zillow, told Yahoo Finance’s The Final Round.In the Great Recession of 2008, banks foreclosed on almost 2% of houses in the U.S., unleashing a glut of houses onto the market and causing home prices to plummet. But today the Coronavirus Aid, Relief, and Economic Security (CARES) Act instituted protections to keep people in their homes during the coronavirus pandemic, offering foreclosure moratoriums and mortgage forbearance options for homes with federally-backed mortgages.“I think that's probably one of the biggest things stopping home sales right now,” said Tucker.Some 7% of mortgages are still in forbearance, according to the Mortgage Bankers Association. Credit: GettyAs the economy recovers, some 7% of mortgages are still in forbearance, according to the Mortgage Bankers Association, a Washington, D.C.-based professional organization. But forbearance and foreclosure protections won’t last forever, and for many homeowners, mortgage payments are stacking up — which could spell uncertainty for the housing market next year.Mortgage forbearance is “going to expire for a lot — millions — of homeowners in March, April, May of next year. It's a really big open question. How many of those folks are back in work by then? How many of them are able to get back on track with their mortgage payments?” said Tucker.Story continuesBut these protections aren’t the only reason housing supply is so low. The U.S. has had an affordable housing shortage for more than a decade, and now 5 million millennials (age 26 to 35) are reaching the age where they want to buy, fueling demand.Plus, demand skyrocketed this summer beyond what was predicted: pending sales in the last week of August were up 19% from the same time last year. Shutdowns this spring created pent-up demand that pushed peak homebuying season into late summer and early fall. And lifestyle changes during the pandemic have prompted many city dwellers to move to the suburbs.“A lot of the sales that would have happened in March and April are getting pushed back later into summer. And especially since a lot of people have kids just at home doing remote school, they're more willing to continue shopping and make that big move in September or October at this point,” said Tucker.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Coronavirus ‘pandemic clauses’ in retail leases are a must-have, but landlords are at-risk‘New York and California are the land of the flee, and Texas is the land of the free’: real estate investorUnemployment insurance doesn’t cover rent in most cities, study shows"}]}