{"article": [{"url": "https://finance.yahoo.com/news/another-stimulus-bill-wont-jump-start-the-economy-154751033.html", "published": 1596106520.0, "headline": "Another stimulus bill won’t jump-start the economy", "body": "Congress is poised to pass another stimulus bill that could inject $1.5 trillion or more into the economy. It won’t be enough to trigger a recovery.“Almost nothing the federal government can do from an economic standpoint is going to make it feel like we’re progressing into a recovery,” Shai Akabas, director of economic policy at the Bipartisan Policy Center, says on the latest episode of the Yahoo Finance Electionomics podcast. “At best, unemployment is going to stay in the high single-digits, if not the double-digits, through November.”Most economists think another stimulus bill is necessary, to keep the unemployed above water, maintain a lifeline to struggling businesses, and help states and cities running way short on tax revenue. The problem is that no amount of stimulus spending will fully reopen businesses and coax consumers out of their homes as long as the coronavirus is rampant.The picture looked brighter in early June, when virus hotspots like Washington state and the Northeast were getting the virus under control, and it hadn’t yet spread throughout the south and west. But a surge of cases in Florida, Texas, Arizona, California and other states has driven the coronavirus death toll over 1,000 per day and forced some areas to reimpose lockdowns. Consumers are reluctant to go out and it’s becoming increasingly apparent there may not be an economic recovery until there’s a vaccine for the virus.[Check out other episodes of the Electionomics podcast.]Treasury Secretary Steven Mnuchin, center, and President Donald Trump's Chief of Staff Mark Meadows, right, walks into the office of House Speaker Nancy Pelosi of Calif., on Capitol Hill in Washington, Wednesday, July 29, 2020, for a meeting with Pelosi and Senate Minority Leader Sen. Chuck Schumer of N.Y. (AP Photo/Andrew Harnik)Democrats and Republicans are negotiating now over how much aid business, workers, states and cities should get. The CARES Act, passed in March, provided $600 per week in supplemental unemployment insurance to every worker able to claim benefits through their state. That expires this week. Democrats want to reinstate the $600 weekly benefit through next January. Republicans say that’s too high, because it’s more than many workers were earning at their jobs in the first place and it could be an incentive to collect benefits instead going back to work. They favor a $200 weekly stipend for a shorter period of time.Story continuesAkabas thinks Republicans are right about the disincentive to work. “About 20% of people are getting paid twice as much through unemployment as they were through their jobs,” he says. “Two-thirds are getting paid more than prior wages. That’s going to make a difference in terms of people returning to the labor force.” In its own research, the Bipartisan Policy Center finds that a $400 weekly supplement is the optimal amount, while recommending that it be extended only through September and then reevaluated based on the situation at the time.Congress also seems likely to approve another $1,200 direct payment to most Americans, since Republicans and Democrats agree on that. There are still major disagreements on how much aid should go to states, cities and health-care systems, and whether Congress should shield businesses from liability if they reopen and workers or customers contract the virus.New York City, Chicago, Florida, and southern California were major hotspots. (Graphic: David Foster/Yahoo Finance)All of this extraordinary spending is pushing the national debt to astronomical levels. The gap between spending and revenue in June alone was $864 billion—nearly as large as the deficit for all of 2019. The Congressional Budget Office projects the 2020 deficit to be $3.7 trillion, and that’s without the current stimulus bill Congress is negotiating now. That national debt—the total amount Uncle Sam owes—is now $26.5 trillion, which is larger than the size of the entire U.S. economy.The national debt is “unfathomably large,” Akabas says. “When we get to the other side, there’s going to be a very large problem waiting for us.” The other side hasn’t come into view, however, as coronavirus darkens the outlook. For now, the best Congress can do is nurse the damaged economy until the virus relents or humanity defeat it.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:11 ways Trump is out of touch with votersA double-dip recession is formingHow Biden threatens Trump’s fortuneHow to waste $1 trillionEdgy voters might reject the 2020 election outcomeHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}