{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-update-russia-approves-worlds-first-vaccine-amid-skepticism-trump-weighs-travel-ban-on-americans-161917719.html", "published": 1597145240.0, "headline": "Coronavirus update: Russia approves world's first vaccine amid skepticism, Trump weighs travel ban on Americans", "body": "U.S. cases could be on the decline, with the daily cases falling below 50,000 for the second day in a row Tuesday, just one month after surpassing the grim milestone.Some reports attribute the decline to reduced testing, while others show areas without mask mandates continue to see steep increases in hospitalizations.Cases globally have now surpassed 20 million, with more than 737,000 deaths reported. In the U.S. more than 5 million have been affected, with 163,000 dead.Russia, the fourth-most affected country with nearly 900,000 cases, surprised the world Tuesday with an approval of a coronavirus vaccine candidate by the country’s Health Ministry, making it the first and fastest to be developed globally, as the pandemic continues its unbridled growth.President Vladmir Putin said the vaccine developed by Moscow-based Gamaleya Institute, showed a stable immune response, even though late-stage clinical trials have yet to begin. Putin said his daughter had taken the vaccine and other than a fever felt no significant side effects. Fevers, headaches and fatigue are common side effects of vaccines, as well as pain at the point of the injection.Russian President Vladimir Putin attends a cabinet meeting at the Novo-Ogaryovo residence outside Moscow, Russia, Tuesday, Aug. 11, 2020. Putin says that a coronavirus vaccine developed in the country has been registered for use and one of his daughters has already been inoculated. Speaking at a government meeting Tuesday, Putin said that the vaccine has proven efficient during tests, offering a lasting immunity from the coronavirus. (Alexei Nikolsky, Sputnik, Kremlin Pool Photo via AP)Dr. Paul Offit, director of the vaccine education center at the Children’s Hospital of Philadelphia (CHOP), said the Russian’s claim is misleading, and their vaccine is in fact behind both the U.S. and World Health Organization efforts.“They don't have the world's first coronavirus vaccine. I can only imagine that Putin's announcement was to bait the rest of the world into thinking they have something that they don't,” Offit told Yahoo Finance.Russia had previously expressed a commitment to an Aug. 10 or thereafter approval, and is providing the vaccine on a voluntary basis to its residents, with hopes of a full public rollout by January. Meanwhile, teachers and first responders will be given priority access.The rushed approval in Russia highlights concerns of political pressures in the scientific community, a key concern as the U.S. continues its efforts in the space.Story continuesTo-date, Moderna (MRNA), AstraZeneca (AZN) with Oxford University, and Pfizer (PFE) with BioNTech (BNTX) are the vaccine frontrunners in the U.S. and the U.K. China also has three candidates in clinical trials, and is similarly rushing distribution with reports of diplomats and the military already receiving doses.Health experts have warned repeatedly against an ‘October Surprise’ in the U.S., with fears of political pressure to approve a vaccine before the election mounting. U.S. Food and Drug Administration (FDA) Commissioner Stephen Hahn has repeatedly said there will be no approval of any vaccine unless it is proven to be effective.Meanwhile, President Donald Trump has said he is optimistic a vaccine will be ready by Election Day.Pfizer and BioNTech said they will likely have results of their two-shot vaccine candidate’s late-stage trial by September. Health officials expect some indication of a working vaccine by this fall. Meanwhile, Johnson & Johnson (JNJ) is expecting to produce 1 billion doses of its single-shot vaccine candidate by early next year if all goes well.The FDA set a bar of 50% effectiveness for a vaccine — which is more than the flu vaccine but less than the measles vaccine — which is lower than what experts like Dr. Anthony Fauci, the director of the National Institute of Allergies and Infectious Diseases, expect. Fauci has said anywhere above 60% effectiveness is likely.Production of at-risk vaccines is already underway, with hopes of distribution in early 2021.COVID-19 comebackNew Zealand reported its first COVID-19 case in more than 100 days, after previously successfully reopening with zero new cases.The island nation has been touted as an example of properly curbing the transmission of the virus and taking strict measures to do so.The source of the new cases, a family of four in Auckland, is unknown and contact tracing is under way to prevent more spread. Prime Minister Jacinda Ardern remains confident the country can repeat its success in wiping out the virus.Trump is looking at the potential of the federal government blocking entry to American citizens traveling abroad who attempt to return to the U.S. after potentially being exposed to the virus.The proposal, reported by the New York Times, relies on a rule within the purview of the Centers for Disease Control and Prevention (CDC) that would allow the country to bar someone exposed to an infectious disease.Anjalee Khemlani is a reporter at Yahoo Finance. Follow her on Twitter: @AnjKhemMore from Anjalee:Fauci: WHO 'imperfect but important' as coronavirus controversies batter agencyFL teacher explains why she retired because of coronavirus, doubts safe return to schoolsHow protests spurred Corporate America into action on race, inequalityRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube."}]}