{"article": [{"url": "https://finance.yahoo.com/news/virus-talks-brink-collapse-sides-041959259.html", "published": 1596756440.0, "headline": "Last-ditch virus aid talks collapse; no help for jobless now", "body": "WASHINGTON (AP) — A last-ditch effort by Democrats to revive Capitol Hill talks on vital COVID-19 rescue money collapsed in disappointment Friday, making it increasingly likely that Washington gridlock will mean more hardship for millions of people who are losing enhanced jobless benefits and further damage for an economy pummeled by the still-raging coronavirus.President Donald Trump said Friday night he was likely to issue more limited executive orders related to COVID, perhaps in the next day or so, if he can't reach a broad agreement with Congress.The day's negotiations at the Capitol added up to only \"a disappointing meeting,” declared top Senate Democrat Chuck Schumer, saying the White House had rejected an offer by House Speaker Nancy Pelosi to curb Democratic demands by about $1 trillion. He urged the White House to “negotiate with Democrats and meet us in the middle. Don’t say it’s your way or no way.”Treasury Secretary Steven Mnuchin said, \"Unfortunately we did not make any progress today.” Republicans said Pelosi was relying on budget maneuvers to curb costs and contended she has overplayed her hand.Often an impasse in Washington is of little consequence for the public — not so this time. It means longer and perhaps permanent expiration of a $600 per-week bonus pandemic jobless benefit that’s kept millions of people from falling into poverty. It denies more than $100 billion to help schools reopen this fall. It blocks additional funding for virus testing as cases are surging this summer. And it denies billions of dollars to state and local governments considering furloughs as their revenue craters.Ahead is uncertainty. Both the House and Senate have left Washington, with members sent home on instructions to be ready to return for a vote on an agreement. With no deal in sight, their absence raises the possibility of a prolonged stalemate that stretches well into August and even September.Speaking from his New Jersey golf club Friday evening, Trump said “if Democrats continue to hold this critical relief hostage I will act under my authority as president to get Americans the relief they need.”Story continuesTrump said he may issue executive orders on home evictions, student loan debt and allowing states to repurpose COVID relief funding into their unemployment insurance programs. He also said he'll likely issue an executive order to defer collection of Social Security payroll taxes, an idea that has less support among his Republican allies.White House Chief of Staff Mark Meadows said, “This is not a perfect answer — we’ll be the first ones to say that — but it is all that we can do, and all the president can do within the confines of his executive power.”Friday's Capitol Hill session followed a combative meeting Thursday evening that for the first time cast real doubt on the ability of the Trump administration and Democrats to come together on a fifth COVID-19 response bill. Pelosi summoned Mnuchin and Meadows in hopes of breathing life into the negotiations, which have been characterized by frustration and intransigence on both sides — particularly on top issues such as extending the bonus jobless benefit that expired last week.Pelosi declared the talks all but dead until Meadows and Mnuchin give ground.“I’ve told them 'come back when you are ready to give us a higher number,’” she said.The breakdown in the negotiations is particularly distressing for schools, which have been counting on billions of dollars from Washington to help with the costs of reopening. But other priorities are also languishing, including a fresh round of $1,200 direct payments to most people, a cash infusion for the struggling Postal Service and money to help states hold elections in November.In a news conference on Friday Pelosi said she offered a major concession to Republicans.“We'll go down $1 trillion, you go up $1 trillion,” Pelosi said. The figures are approximate, but a Pelosi spokesman said the speaker is in general terms seeking a “top line” of perhaps $2.4 trillion since the House-passed HEROES Act is scored at $3.45 trillion. Republicans say their starting offer was about $1 trillion but have offered some concessions on jobless benefits and aid to states, among others, that have brought the White House offer higher.Mnuchin said renewal of a $600 per-week pandemic jobless boost and huge demands by Democrats for aid to state and local governments are the key areas where they are stuck.“There’s a lot of areas of compromise,\" he said after Friday's meeting. \"I think if we can reach an agreement on state and local and unemployment, we will reach an overall deal. And if we can’t we can’t.”Democrats have offered to reduce her almost $1 trillion demand for state and local governments considerably, but some of Pelosi's proposed cost savings would accrue chiefly because she would shorten the timeframe for benefits like food stamps.Pelosi and Schumer continue to insist on a huge aid package to address a surge in cases and deaths, double-digit joblessness and the threat of poverty for millions of the newly unemployed.On Friday, they pointed to the new July jobs report to try to bolster their proposals. The report showed that the U.S. added 1.8 million jobs last month, a much lower increase than in May and June.“It’s clear the economy is losing steam,\" Schumer said. “That means we need big, bold investments in America to help average folks.”Senate Republicans have been split, with roughly half of Majority Leader Mitch McConnell's rank and file opposed to another rescue bill at all. Four prior coronavirus response bills totaling almost $3 trillion have won approval on bipartisan votes despite intense wrangling, but conservatives have recoiled at the prospect of another Pelosi-brokered agreement with a whopping deficit-financed cost.McConnell has kept his distance from the negotiations while coordinating with Mnuchin and Meadows.In addition to restoring the lapsed $600-per-week bonus jobless benefit, Pelosi and Schumer have staked out a firm position to extend demanded generous child care assistance and reiterated their insistence on additional funding for food stamps and assistance to renters and homeowners facing eviction or foreclosure.“This virus is like a freight train coming so fast and they are responding like a convoy going as slow as the slowest ship. It just doesn’t work,\" Pelosi said Friday."}]}