{"article": [{"url": "https://finance.yahoo.com/news/warner-bros-indefinite-delay-of-tenet-is-major-blow-to-movie-theaters-121042516.html", "published": 1595315900.0, "headline": "Warner Bros.' indefinite delay of 'Tenet' is major blow to movie theaters", "body": "Warner Bros. delivered bad news for the U.S. movie theater industry on Monday: the studio has delayed the U.S. theatrical release of Christopher Nolan’s secretive action thriller “Tenet” indefinitely, with no new date given.That news comes after Warner Bros. had already pushed the film from July 17 to July 31, and then to Aug. 12. Warner Bros. said in a press statement that the studio “will share a new 2020 release date imminently.” But the move is a blow to movie theater chains, many of which had planned to begin cautious reopening in order to show “Tenet” and “Mulan,” Disney’s next big live-action remake which has been pushed from March 27 to July 24 to Aug. 21, and now, given the Warner Bros. move, could certainly get pushed again. (Disney had no comment.)“Tenet” and “Mulan” were set to be the first two blockbusters post-lockdown, and theaters had hung their hopes on the films. Both movies had budgets of over $200 million.Disney (DIS) CEO Bob Chapek even said on an earnings call in May that Disney expected to “get a pretty good idea” of whether Americans were ready to go back to the movies “because there's a competitive movie that opens one week before our film,” a reference to “Tenet.”But then in June, Warner Bros., which is owned by AT&T (T) pushed “Tenet” to July 31, leaving “Mulan” up first. That salvo prompted an apparent game of chicken between the studios not to be the first to put out a big release amid the pandemic—especially considering the optics of doing so at a time when COVID-19 cases are hitting a new peak in the U.S.Hollywood filmmaker Christopher Nolan spotted shooting his next film 'Tenet' near Taj Hotel, Colaba, on Sept. 17, 2019 in Mumbai, India. (Photo by Kunal Patil/Hindustan Times via Getty Images)AMC Entertainment (AMC) in June announced it would reopen 450 of its 600 U.S. theaters on July 15, giving it a week to prepare for the July 24 release of “Mulan.” (AMC had to reverse course after it initially said it would not require masks at the reopened theaters.) On June 26, Disney delayed “Mulan” to Aug. 21. Three days later, AMC pushed its planned reopening to July 30 to match the August release dates of “Tenet” and “Mulan.”Story continuesNow “Tenet” won’t come out in August, and if “Mulan” gets pushed past August, AMC likely won’t open on July 30. Disney’s “The Personal History of David Copperfield,” an indie from Searchlight (formerly Fox Searchlight before the Disney-Fox deal) starring Dev Patel in the title role, is currently set for an Aug. 14 theatrical release, but could plausibly end up going straight to Disney+.AMC can’t weather lockdown much longer: the chain in July got an infusion of $300 million in debt financing from Silver Lake Partners to narrowly avoid bankruptcy—for now.Indoor movie theaters will soon have to decide whether to re-open some locations in states with fewer cases of the virus—before they have any new blockbusters to lure moviegoers. (Drive-in theaters across the country helped “Star Wars: The Empire Strikes Back” become the No. 1 movie at the box office last week.)Meanwhile, fans wonder whether Warner Bros. could just release “Tenet” for digital streaming, skipping theaters altogether. Rich Greenfield, media analyst with LightShed Partners, suggests in a research note this week that WarnerMedia could put the movie on HBO Max as the “battering ram WarnerMedia needs vs. Amazon and Roku.” But Christopher Nolan is unlikely to allow that. His movies are made to be seen on big screens, and “Tenet,” like “Dunkirk,” was shot in IMAX format.Instead, Variety reports that Warner Bros. may release “Tenet” overseas before the U.S. Studio chief Toby Emmerich says the film will not be treated “like a traditional global day-and-date release.” Doing so would carry two risks: Nolan’s film has been marketed with great secrecy, and releasing it in other markets first would likely result in a flood of spoilers online; it would also make the film a symbol of America’s failure to contain the virus.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more on how the pandemic is affecting the entertainment industry:Disney's 'Mulan' date decision affects the entire movie theater industry‘Hamilton’ delivers 64% download bump for Disney+ amid the pandemicDisney's 'Mulan' will look to Christopher Nolan's 'Tenet' as a movie theater health testCoronavirus puts 'extreme pressure' on all three pillars of Disney's businessCoronavirus is forcing Quibi, NBC Peacock to change their plans at launch'Trolls World Tour' rental success does not spell death for movie theatersMovie theaters seek bailout as coronavirus devastates business"}]}