{"article": [{"url": "https://finance.yahoo.com/news/trumps-worst-nightmare-may-be-happening-160945945.html", "published": 1593515840.0, "headline": "Trump’s worst nightmare may be happening", "body": "President Trump still has a chance at reelection, but it’s contingent on a quick economic recovery and the containment of the coronavirus. Both may be slipping away.Florida, Texas and California have reversed reopening measures in recent days, as Covid-19 infection rates and hospitalizations rise. New Jersey’s governor indefinitely canceled a plan to begin indoor dining on July 2 after seeing footage of crowded bars and restaurants. And more than a dozen other states have paused reopenings as people venture out more and infections tick up.This is precisely how a double-dip recession could occur, according to forecasting firm IHS Markit. Until recently, IHS thought the economy had bottomed out in April, with a robust recovery likely this summer and fall—provided coronavirus cases declined and stayed in check.That’s not happening. The daily count of new coronavirus cases in the country has recently exceeded the high from early April, when the disease was ravaging the northeast and a few other areas. In at least 7 states, including Arizona, Florida and Texas, the average number of daily cases is more than double the count from two weeks earlier. Broader testing explains part of the rise in cases, but hospitalizations have started rising again, after falling from late April to mid-June. More people going to the hospital means more people are getting dangerously sick from the virus, regardless of testing. Some governors are reimposing lockdowns to ease stress on hospitals that are filling with Covid patients.Texas Gov. Greg Abbott responds to a question as Dr. Deborah Birx, White House coronavirus response coordinator, looks on during a news conference after Vice President Mike Pence met with Abbott and members of his healthcare team regarding COVID-19 at the University of Texas Southwestern Medical Center West Campus in Dallas, Sunday, June 28, 2020. (AP Photo/Tony Gutierrez)Reimposing closuresAs Covid rises, the economy sinks. Governors have no choice but to close more businesses as infections spread, if for no other reason than to spare hospitals and their workers. Even if governors didn’t force closures, many consumers would know there’s a problem and lock themselves down at home until it seemed safer to go out. Others are simply foolish, gathering in crowds without masks or other protections, as if invulnerable to a microscopic assailant they can’t see.Story continuesIf the reimposed lockdowns persist, there could be another downturn in spending and overall economic output, rather than a sustained recovery. “In this scenario,” IHS writes in a recent analysis, “this combination of factors continues to fuel the increasing pace of new cases and deaths into the fall, when the turn to cooler temperatures exacerbates the spread of COVID-19. The resulting direct decline in consumer spending and knock-on effects is sufficiently sharp to push the economy back into recession beginning in the fourth quarter.”If that unfolds, the timing would obviously be terrible for Trump. Voters would be reeling from mounting unemployment and renewed public health fears just as they head to the polls on Nov. 3. No president in modern times has won reelection in the midst or immediate aftermath of a recession, and there’s no reason to think Trump would be an exception. His famous base is loyal, but not large enough, and Trump’s approval ratings are already dangerously low at barely 40%, according to data site fivethirtheight.com.A sign on the door of the West Alabama Icehouse reads \"Closed by the Governor\", June 29, 2020, in Houston. Texas Gov. Greg Abbott shut down bars again and scaled back restaurant dining on Friday as cases climbed to record levels after the state embarked on one of America's fastest reopening. (AP Photo/David J. Phillip)Trump has gotten relatively high marks for his handling of the economy, perhaps the one persistent edge he has over his Democratic rival, Joe Biden. But that is fading, as well. In Gallup polls, Trump’s approval rating on the economy has fallen from 63% in early January to 47% in early June. He still leads Biden on this measure, but many Americans are hoping the coronavirus recession is short-lived, and layoffs temporary. Controlling the virus is a necessary condition for a healthy recovery, however, and the virus isn’t going easily.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Why you’re not hearing about Biden’s economic planTrump is sabotaging his own reelectionElection Night in November could last for daysSome nightmare scenarios for the November electionsHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}