{"article": [{"url": "https://finance.yahoo.com/news/stock-market-news-live-august-14-2020-222013541.html", "published": 1597417760.0, "headline": "Stock market news live updates: Stocks end mixed, S&P 500 hovers just below record", "body": "Stocks ended little changed on Friday as investors considered mixed new economic data and dimming prospects of further fiscal stimulus in the near-term.Shares of Apple (AAPL) edged lower after rising to a record high on Thursday. Bloomberg reported that the iPhone-maker was preparing to release a new subscription bundle, which would include a package of its services offerings like Apple Music and Apple TV+ in a bid to unlock a new recurring revenue stream. Meanwhile, Epic Games sued Apple after its “Fortnite” game was removed from the App Store, after the developer created an in-app payment system to bypass the App Store and avoid having Apple collect its usual 30% commission on app purchases.Elsewhere, market participants continued to digest Thursday’s estimates-topping weekly jobless claims report, which showed the first dip below 1 million in new weekly unemployment insurance claims since the start of the pandemic. The reading, while reflecting an improvement relative to the worst points of the pandemic period, might also take some pressure off lawmakers to speedily pass a new round of stimulus legislation, some analyst warned.The US Senate adjourned for August recess on Thursday without passing a new Covid relief bill, as a stalemate between key negotiators showed no signs of abating. Senators and members of the US House of Representative are not scheduled to return to Washington until after Labor Day, though Senate Majority Leader Mitch McConnell said Senators would receive at least 24 hours notice to return if negotiators convened on a deal and scheduled a vote in the interim.Elsewhere in markets, investors also digested a report Friday morning on July retail sales that missed consensus estimates, with sales at retailers having risen 1.2% over June versus a 2.1% gain expected. While most categories saw gains in July, a drop in auto supply dealers weighed on the headline results. Still, retail sales have now risen 2.7% versus the same period last year, holding onto year-over-year growth even after a historic decline in spending just several months before.Story continues“Overall, the retail sales figures are encouraging because they suggest the recovery has continued to grind on even in the face of the resurgence in virus cases,” Michael Pearce, senior US economist for Capital Economics, said in a note. “Admittedly, the expiry of additional Federal unemployment benefits at the end of July poses a downside risk to spending in the near term, but with virus infection numbers falling again the high-frequency indicators have continued to edge higher in early August. The upshot is that we are still comfortable with our view that consumption growth will recover gradually from here.” —4:01 p.m. ET: Stocks end mixed after a choppy sessionHere’s where the three major indices settled at the end of trading Friday:S&P 500 (^GSPC): -0.54 points (-0.02%) to 3,372.89Dow (^DJI): +34.78 points (+0.12%) to 27,931.5Nasdaq (^IXIC): -23.2 points (-0.21%) to 11,019.3—1:01 p.m. ET: S&P 500, Dow turn slightly positive as Nasdaq edges lowerThe S&P 500 and Dow popped into modestly positive territory Friday afternoon. The real estate, energy and industrials sectors overtook their tech-heavy counterparts to lead the S&P 500 higher. Boeing and Walgreens Boots Alliance each rose more than 1% to outperform in the Dow, while Cisco and Procter & Gamble lagged.—12:30 p.m. ET: The catalyst for a higher market is ‘liquidity, No. 1’: Sanders Morris Harris CEOThe S&P 500’s range-bound trading so far this summer has come as traders await an “exogenous event” to catalyze a move higher or lower, George Ball, CEO of Sanders Morris Harris, told Yahoo Finance.“What’s happening is people are waiting for an external event, an exogenous event, to take the market out of this trading range,” Ball said. “We’ve got the rare bull market with the Vix over 20, 22 I think right now, and the really smart investor or trader should be taking action now to get ready for what’s going to happen after Labor Day. It’s very hard to put sails up on a boat when you’re in the middle of a hurricane, I’m told anyhow.”In absence of more fiscal stimulus, for the S&P 500, “fair value is probably 2,500-2,800,” Ball added. “So if you’re an investor, clearly the logic of a 3,300 S&P becoming 4,000 before it becomes 2,500 is difficult. Right now the market is awash in liquidity. That’s the reason for the current strength in the market, it’s liquidity, liquidity, liquidity. And when that runs out, when that can has been kicked as far down the road as it can be kicked, it needs to be kicked, then prices will probably adjust more closely to what you’re calling fair value.”“The catalyst for a higher market, a 3,600 market, is liquidity No. 1, and then perhaps a belief that the post-Covid recovery will be more complete than most of the prognosticators are saying,” Ball added. “We’ll have a vaccine by the first quarter of next year. It’ll be widely available by mid-year next year, but is people’s behavior going to return to the pre-covid type of consumption, investment patterns? That’s doubtful.”—10:21 a.m. ET: Fundstrat raises 2020 S&P 500 price target to 3,525, with stocks hardest hit by the pandemic likely to carry index to fresh highsThe S&P 500 is poised to rise another 4.5%, or 150 points, this year to 3,525, as stocks hardest hit by the pandemic start to participate in the rally and raise the overall index, said Tom Lee, FundStrat head of research. Previously, Lee had maintained a 3,450 price target on the S&P 500.In justifying his upwardly revised price target, Lee cited the improving economic conditions off April’s bottom, setting investors up to take advantage of long positions in equities. He also noted that both bond proxies and big tech stocks remain cheap relative to investment grade bonds.Lee also addressed investors’ concerns that the Feb. 19 all-time high of 3,393.52 would be a ceiling for equities. He highlighted a bevy of current conditions that contradict fears of an impending top: The Federal Reserve has remained “easy” in its monetary policy stance, the economy bottomed and is expanding, and investors have kept some $4.5 trillion in cash on the sidelines.“Seriously, look at this cash on the sidelines. Could markets really be \"topping\" with ~$5 trillion on the sidelines?” Lee wrote in his note. “I don't know if this ever happened in history, of the World. In fact, coupled with a Fed remaining dovish, how can one argue stocks are done?”—10:00 a.m. ET: Consumer sentiment ticks up in August, but ‘overall confidence in economic policies fell to the lowest level since Trump first entered office’: U. MichiganConsumer sentiment unexpectedly ticked up in August, according to the University of Michigan’s preliminary Surveys of Consumers released Friday.The headline sentiment index rose to 72.8 in early August from 72.5 in July, versus a print of 72.0 expected, according to Bloomberg-compiled data. Still, the print was just 1 point above the April low, as an ongoing pandemic and uncertainty over the status of further fiscal stimulus from Washington weighed.“The overall confidence in economic policies fell to the lowest level since Trump first entered office. The policy gridlock has acted to increase uncertainty and heightened the need for precautionary funds to offset lapses in economic relief programs and to hedge against fears about the persistence and spread of the coronavirus as the school year gets underway,” Richard Curtin, chief economist for the Surveys of Consumers, said in a statement.“Bad economic times are anticipated to persist not only during the year ahead, but the majority of consumers expect no return to a period of uninterrupted growth over the next five years,” he added. Consumers anticipate declines in the national unemployment rate to significantly slow and expect a rising rate of inflation during the year ahead. While a positive growth rate in consumption is anticipated in the 2nd half of 2020, it will hardly herald the end of the coronavirus recession.”—9:31 a.m. ET: Stocks open mostly lowerHere were the main moves in markets shortly after the opening bell:S&P 500 (^GSPC): -7.38 points (-0.22%) to 3,366.05Dow (^DJI): -94.52 points (-0.34%) to 27,802.20Nasdaq (^IXIC): +2.21 points (+0.02%) to 11,048.73Crude (CL=F): -$0.14 (-0.33%) to $42.10 a barrelGold (GC=F): -$11.30 (-0.57%) to $1,959.10 per ounce10-year Treasury (^TNX): -1.3 bps to yield 0.703%—9:18 a.m. ET: Industrial production rises 3.0% in July, matching expectationsIndustrial production rose 3.0% in July over June to come in-line with consensus expectations, according to data from the Federal Reserve Friday. The result was a slowdown from the 5.7% jump in production in June, as factory reopenings following virus-related shutdowns led to a surge in manufacturing.However, even with the past three months’ increases, industrial production remains 8.4% below its pre-pandemic level from February.—8:30 a.m. ET: Retail sales rise 1.2% month over month; 2.1% expectedUS retail sales increased less than expected in July as a rebound in consumer spending over the past several months lost steam.Headline retail sales rose 1.2% in July over June, the Commerce Department said Friday, missing consensus estimates for a 2.1% jump. In June, retail sales rose by an upwardly revised 8.4%, following a record 18.2% monthly surge in May.By category, sporting goods and hobby store sales dropped 5% in July for the biggest decrease of any category. This was followed by a 2.9% drop in sales at building material and supply dealers, and a 1.2% drop in motor vehicle and parts dealers.Excluding more volatile auto and gas sales, however, retail sales rose a better than expected 1.5%, versus the 1.0% increase expected. This followed a 7.7% gain in June in this metric, which was upwardly revised by a full percentage point. Control group sales, which also excludes building materials, rose 1.4%, or better than the 0.8% increase expected.—7:06 a.m. ET: Stock futures mixed; Nasdaq tracks toward third straight day of gainsHere were the main moves in markets, as of 7:06 a.m. ET:S&P 500 futures (ES=F): 3,359.25, down 8.5 points, or 0.25%Dow futures (YM=F): 27,692.00, down 131 points, or 0.47%Nasdaq futures (NQ=F): 11,184.5, up 9.25 points, or 0.08%Crude (CL=F): -$0.18 (-0.43%) to $42.06 a barrelGold (GC=F): -$15.20 (-0.77%) to $1,955.20 per ounce10-year Treasury (^TNX): -1.6 bps to yield 0.7%—6:03 p.m. ET Thursday: Stock futures trade slightly higherHere were the main moves in equity markets, as of 6:03 p.m. ET:S&P 500 futures (ES=F): 3,371.00, up 3.25 points, or 0.1%Dow futures (YM=F): 27,842.00, up 19 points, or 0.07%Nasdaq futures (NQ=F): 11,187.5, up 12.25 points, or 0.11%A worker sweeps the floor of the New York Stock Exchange - Tags: BUSINESS IMAGES OF THE DAY)—Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit.Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out Cashay"}]}