{"article": [{"url": "https://finance.yahoo.com/news/obamacare-repeal-push-by-trump-administration-very-concerning-amid-pandemic-experts-say-170903067.html", "published": 1593260240.0, "headline": "President Trump doubles down on dismantling Obamacare amid coronavirus pandemic", "body": "The Trump administration is continuing efforts to eliminate the Affordable Care Act (ACA), otherwise known as Obamacare, amid the coronavirus pandemic.This week, the administration filed a legal briefing urging the Supreme Court to overturn the ACA. This would include removing coverage for those with pre-existing conditions.“A global pandemic does not change what Americans know — Obamacare has been an unlawful failure,” White House spokesman Judd Deere said in a statement, adding that it “forces Americans to purchase unaffordable plans.”President Trump claims that the aim is to replace Obamacare with a more efficient alternative, although his administration has not presented a serious alternative since failing on “Trumpcare” in 2017.Now that the very expensive, unpopular and unfair Individual Mandate provision has been terminated by us, many States & the U.S. are asking the Supreme Court that Obamacare itself be terminated so that it can be replaced with a FAR BETTER AND MUCH LESS EXPENSIVE ALTERNATIVE.....— Donald J. Trump (@realDonaldTrump) June 27, 2020If the ACA were to be overturned or dismantled, at least 20 million people would lose health care coverage, according to the Urban Institute. And that estimation didn’t factor in those who were hit by layoffs as a result of the coronavirus pandemic. A Kaiser Family Foundation report estimated that at least 27 million Americans have lost employer-sponsored health coverage during the pandemic, meaning that many of them could have also signed up for the ACA.“A significant portion of the U.S. population relies on this as their primary means of health care coverage,” Johns Hopkins Medicine Assistant Professor Lauren Sauer said on Yahoo Finance’s The Ticker (video above). “As we’re also hearing the administration talk about reducing the support for things like COVID testing and then these things happening in tandem … it’s really concerning, political or not, to think about reducing people’s ability to access health care coverage in the midst of it.”Story continuesColorado Governor Jared Polis (C) wears a face mask as U.S. President Donald Trump makes remarks during a meeting in the Cabinet Room of the White House, May 13, 2020 in Washington, DC. (Photo: Doug Mills-Pool/Getty Images)‘Dramatically more people would be uninsured’The Supreme Court agreed to hear an appeal case regarding the ACA, and its expected Spring 2021 decision could potentially invalidate the health care legislation.This came after a Texas judge ruled that Obamacare’s individual mandate was unconstitutional during a Dec. 15, 2018, hearing. Judge Reed O’Connor agreed with the plaintiffs who argued that the lack of a penalty invalidated the “individual mandate” provision of the law, and if that part of the law was now invalid, then the whole law was.Following that ruling, Democratic states and the House of Representatives filed an appeal, which made its way to the Supreme Court in a case titled California v. Texas. Although no oral arguments have been scheduled yet, a decision is expected to be made by spring 2021.“The bottom line is if they overturn it, and they overturn it in a way to say the next day basically it’s over … the reality is dramatically more people would be uninsured,” Chris Meekins, Raymond James health care policy analyst, said on Yahoo Finance’s The First Trade, “unless Congress takes action to pass something new to replace it.”Isabel Diaz Tinoco (L) and Jose Luis Tinoco look at a computer as Otto Hernandez shows them the different insurance plans available under the Affordable Care Act. (Photo by Joe Raedle/Getty Images)‘It’s cruel, it’s heartless, it’s callous’President Trump originally tried to pass his own version of a health care bill upon taking office, titled the American Health Care Act of 2017 (dubbed Trumpcare). Many versions of the bill were proposed until a major vote was finally called for the Health Care Freedom Act, which many described as “a skinny repeal” of Obamacare. It failed to pass the Senate, however, after the late Sen. John McCain voted against it, proving to be the decisive vote.“Republicans are assuming that if the Affordable Care Act is struck down by the Supreme Court, that would bring Republicans and Democrats together because no one wants to see 20 million-plus-more people uninsured,” Meekins said. “I think that is an ambitious goal. We saw that really both parties are not working together on health care.”According to the Centers for Medicare and Medicaid Services (CMS), approximately 487,000 people gained coverage through a special enrollment period from the ACA, which is a 46% increase year over year.U.S. President Barack Obama (R) and Vice President Joe Biden walk back to the Oval Office after speaking about the Supreme Court ruling to uphold the nationwide availability of tax subsidies that are crucial to the implementation of the ACA. (REUTERS/Jonathan Ernst TPX IMAGES OF THE DAY)And if the Democrats sweep in the 2020 election, including Joe Biden beating Trump, “we could see health care reform 2.0, which could go even further than the Affordable Care Act,” Meekins said.“I think it’s cruel, it’s heartless, it’s callous, and it’s all because, in my view, he can’t abide the thought of letting stand one of President Obama’s greatest achievements, the Affordable Care Act,” Biden said about Trump’s move in a campaign speech on Thursday. “I cannot comprehend the cruelty that’s driving him to inflict this pain on the very people he’s supposed to serve.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:The Supreme Court will consider Obamacare's constitutionality — and the outcome could bring 'total chaos'Obamacare: Study highlights key benefit of Affordable Care Act ahead of Supreme Court argumentsA key benefit of Obamacare is stalling — here's whyRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}