{"article": [{"url": "https://finance.yahoo.com/news/22-million-americans-delayed-buying-a-home-during-the-coronavirusbankrate-101649039.html", "published": 1594790660.0, "headline": "22 million Americans delayed buying a home during the coronavirus: Bankrate", "body": "Home sales paused during the novel coronavirus pandemic — and a new study shows just how much.Economic uncertainty and lockdown measures prompted 22 million Americans, or 9% of the U.S. population, to delay buying a home during the coronavirus pandemic, according to a new study by Bankrate, a New York-based consumer financial services company.Read more: Buying a house: What you need to know about home ownership“If there’s one thing we have an abundance of right now, it’s uncertainty. And economic uncertainty is at the top of that list. So buying a home might be an issue to consider later,” said Mark Hamrick, Washington bureau chief and senior economic analyst at Bankrate.Of those who put off a home purchase, 62% said they would delay more than six months, including 20% who were delaying indefinitely, according to the survey of 2,451 adults.“Mortgage forbearance continues to be prevalent, which is highlighting that there is some risk associated with buying a home — although not to the extent we saw in the financial crisis,” said Hamrick. Although the share of loans in forbearance has been declining for a month, some 4.2 million homeowners were still in forbearance on their mortgage loans for the week ending July 10, according to the Mortgage Bankers Association.Home For Sale Real Estate Sign in Front of Beautiful New House.During the pandemic, Americans delayed home purchases more often than they delayed pursuing education (7% of Americans), getting married, having children or retiring (5% each). Buying or leasing a car was the only category of purchases that was delayed more often, with 12% of those surveyed delaying a purchase, according to the study.Americans are delaying car purchases more often because “buying a car is something that more people do,” and thus, have been more frequently delayed, said Hamrick. “Americans tend to own a car before owning a home …and most of us will own more cars than homes in our lifetimes.”Young people had more setbacks than the rest of the U.S. population. Generation Z and millennials, ages 18 to 39, were almost three times as likely as Americans over 40 to delay a home purchase during the pandemic, according to the study.Story continues“Younger individuals don’t tend to have the same flexibility of having less debt and more savings. So when something as seismic as the recent experience occurs, it takes a toll more quickly on young people,” said Hamrick.Despite economic uncertainty and delayed home purchases, the homebuying market is starting to recover. With all-time low mortgage rates and a renewed emphasis on suburban living, moving to a single-family home is more attractive now than ever.“There is a desire to get out of densely populated neighborhoods,” said Hamrick.Sarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynterRead the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.More from Sarah:Almost 12 million children live in a household that missed rent or mortgage payments during COVID-19: surveyA surprising group of homeowners have paid off their mortgagesThese states had the most housing hardship during the coronavirus pandemic"}]}