{"article": [{"url": "https://finance.yahoo.com/news/united-airlines-offering-rapid-covid-200737509.html", "published": 1600960520.0, "headline": "United Airlines offering rapid COVID-19 tests to passengers", "body": "United Airlines announced Thursday it will offer passengers on certain flights a rapid COVID-19 test prior to their flight.Starting Oct. 15, customers traveling on United from San Francisco International Airport (SFO) to Hawaii will be able to take a rapid test directly at the airport. They will also have the option to do a self-collected, mail-in test ahead of their trip, the carrier announced Thursday.HERE ARE SOME TOP CORONAVIRUS RISKS WHEN FLYINGThe initiative is part of the airline's COVID-19 pilot testing program, which United says will help travelers \"manage quarantine requirements and entry conditions of popular destinations around the world.\"The rapid Abbott ID NOW COVID-19 test will be administered by GoHealth Urgent Care as well as their partner Dignity Health. United says the test will be able to deliver results within 15 minutes, meaning passengers will be able to see their results on the same day as their flight.CORONAVIRUS PANDEMIC RESHAPING AIR TRAVEL AS CARRIERS STRUGGLEFor the mail-in version, passengers are encouraged to take the test at least 10 days prior to their trip and provide their sample within 72 hours of their departure. Passengers can return their test via overnight mail or to a drop box at SFO, United said. The main-in tests are being administered by Color.United says it has been working closely with Hawaii officials to ensure that passengers who test negative on either test would not be subjected to the state's current 14-day quarantine requirement, regardless if they are a visitor or Hawaiin resident.GET FOX BUSINESS ON THE GO BY CLICKING HEREFollowing its initial pilot program, the airline will \"quickly expand customer testing to other destinations and U.S. airports\" later this year, according to United Chief Customer Officer Toby Enqvist.United, which already offers daily service between San Francisco and Honolulu, Maui and Kona, plans to increase service to Hawaii on Oct. 15.Story continuesThis increase will include the resumption of service between San Francisco and Lihue as well as additional flights between San Francisco and Maui and Kona.CLICK HERE TO READ MORE ON FOX BUSINESSRelated ArticlesWhite House has money to ‘repurpose’ for additional coronavirus stimulus, Kudlow saysParty City to open 25 pop-up stores nationwide, hire 20,000 temporary employees5 Royal Caribbean cruise ships in Europe and the Caribbean will be rerouted for summer 2021"}]}