{"article": [{"url": "https://finance.yahoo.com/news/etsy-ceo-on-huge-q-2-etsy-is-becoming-much-more-mainstream-181632322.html", "published": 1597065860.0, "headline": "Etsy CEO on huge Q2: Etsy is 'becoming much more mainstream'", "body": "Etsy, the online marketplace for homemade items, reported a blowout second quarter last week, not despite the ongoing pandemic but largely thanks to it. The company smashed Wall Street expectations for revenue ($428.7 million, up 137% from Q2 2019), and profit of 75 cents per share.Most notably, Etsy (ETSY) sold $346 million worth of masks on its platform, as shoppers have come to realize that they’ll be wearing masks for a while yet and are seeking aesthetically appealing masks. Etsy says 14% of all sales in Q2 were mask purchases, and 7% of its shoppers in the second quarter, or 4 million people, came to the site just to buy masks.But Etsy is also eager to stress that its huge quarter was about more than masks, and thus more than the pandemic. Sales for five of its top six categories rose by 50% or more, and none of that includes masks: sales of craft supplies rose 138%; homewares and home furnishings rose 128%; apparel rose 59%; jewelry and accessories rose 50%.Etsy CEO Josh Silverman argues that the image of Etsy is evolving. What was once seen as an anti-Amazon for quirky crafts and handmade goods is “becoming more top-of-mind as a place you can go to buy almost anything,” he told Yahoo Finance.“I think that Etsy is becoming much more mainstream,” says Silverman. “Now, I want to be careful about the word mainstream, because almost anything you can find on Amazon or Target, you can find on Etsy. But the difference is it’s made just for you, and you’re interacting with the person who actually made it. So the product is more personal, and the purchasing process feels a lot more personal.”That quote says a lot—Silverman wants Etsy to be seen as more mainstream, but he also recognizes that the very term might alienate some of Etsy’s strongest devotees, who love it specifically because it isn’t mainstream.An Etsy sign outside the Nasdaq market site in Times Square following Etsy's IPO on the Nasdaq on April 16, 2015. REUTERS/Mike Segar/File PhotoNonetheless, Etsy is embracing the image shift, and applying marketing dollars to push it further. New sellers on Etsy rose 100% in Q2, and active buyers rose 41%.Story continues“I think that people are realizing now that there’s a different way to shop, and we’re really leaning into that,” Silverman says. “So we have been investing very significantly in marketing, and particularly television right now, to really build top-of-mind awareness so that we can really rise to the opportunity that this moment presents.”Of course, going more mainstream means competing with giants like Amazon, Walmart, and Target. The first two of those names have seen the same big gains as Etsy during the pandemic, as consumers move all of their dollars online, hastening the decline of brick-and-mortar chains that was in full force well before the pandemic.Amazon’s Q2 earnings shattered Wall Street expectations, with net sales up 40% and online grocery sales up threefold. Walmart and Target report their Q2 earnings later this month. Of those names, Target is likely the best comparison to Etsy, especially amid Target’s ongoing focus on in-house labels and designs that appeal to millennials.But Etsy’s stock is on more of a tear than those competitors. In 2020 so far, Target stock is up 5%, Walmart 11%, Amazon 70%, and Etsy stock, buoyed by that huge Q2 earnings report, is up 202%.—Daniel Roberts is an editor-at-large at Yahoo Finance. Follow him on Twitter at @readDanwrite.Read more:Facebook ad boycott is ‘more noise than fundamental risk’Amazon tells employees to delete Tik Tok, then says email was ‘sent in error’Goya Foods faces consumer boycotts after CEO praises TrumpAmazon extends its deal to stream NFL games, even with next NFL season in doubt"}]}