{"article": [{"url": "https://finance.yahoo.com/news/imf-projects-economic-contraction-for-all-regions-of-the-world-130000281.html", "published": 1592986100.0, "headline": "IMF projects 4.9% economic contraction as concerns mount over second wave", "body": "The International Monetary Fund further downgraded expectations for the global economy in 2020 and 2021, projecting negative growth for all regions of the world for the first time in the history of its forecasts.The IMF on Wednesday released an update of its World Economic Outlook, in which it projected the global economy contracting by 4.9% in 2020, a downward revision from its April forecast of a 3% contraction. A -4.9% print on global output is now the worst in the WEO’s history.IMF Chief Economist Gita Gopinath said Wednesday that while the economy could see better news on vaccine development or further fiscal policy support, her primary concern is not being able to contain the virus.“Among the risks going forward, the big one would be if there is a second wave,” Gopinath told Yahoo Finance.The IMF’s downgrades were spurred by below-expectations drops in global consumption and services dropped beyond expectations. The report also described the hit to the global labor market as “catastrophic.”The report forecasts US growth of -8.0% in 2020, a notable downgrade from its April forecast of -5.9%. But the IMF noted that positive economic data, such as the surprising jobs gains in May, points to the possibility of activity having “troughed” in April.The IMF expects the U.S. economy to rebound by 4.5% in 2021, a tick down from its April projection of 4.7%.The IMF projects a global rebound of 5.4% in 2021, which assumes persistent social distancing and “scarring” from lower productivity (due to a shifting of resources toward workplace safety and hygiene).“It’s going to be hard to precisely say when the numbers come up but this is going to be a gradual recovery,” Gopinath said.The report warned that its forecasts face a number of uncertainties concerning the spread of the virus itself, urging countries to prioritize ample resources for the health system and then economic support through “sizeable, well-targeted” fiscal policies.Story continuesBroadly, the IMF applauded central banks like the Federal Reserve for its “swift” actions to ensure liquidity in the financial markets and keeping borrowing costs low. However, Gopinath warned that tightening financial conditions and geopolitical tensions could threaten the economic recovery.International Monetary Fund Chief Economist and Director of the Research Department Gita Gopinath leads a presentation of the IMF World Economic Outlook Update, in Santiago, Chile, Tuesday, July 23, 2019. (AP Photo/Esteban Felix)Downgrades in Asia, Latin America The IMF had previously projected positive growth in Asia, led by output growth in India and China. But the worsening situation with COVID-19 cases in India led the IMF to dramatically lower its forecast for India to -4.5%, pulling down expectations for the emerging and developing Asia region to -0.8% for 2020.The revision means that the IMF now expects every region of the world to contract this year, although individual countries may still see growth.The IMF expects China to grow by 1.0% in 2020, a tick down from its April forecast of 1.2%. As the first country impacted by the virus, China reportedly saw a “stronger than anticipated” recovery in investment and services, supporting the IMF’s projection of a sharp rebound in GDP of 8.2% in 2021.In Latin America, on the other hand, the IMF said most countries are “still struggling to contain infections” and issued a massive downgrade as cases pick up in Brazil. The IMF now expects the Brazilian economy to pull back by 9.1% in 2020, compared to its April projection of a 5.3% contraction. Mexico is expected to see a 10.5% contraction in 2020.In the Euro Area, the IMF acknowledged European fiscal support measures like short-term work schemes but lowered its 2020 projection for output to -10.2%, a markdown from its April projection of -7.5%. The United Kingdom similarly saw a downgrade and is also projected to see an economic contraction of 10.2% this year.Gopinath listed several risks to its overall outlook, such as escalating trade tensions between the United States and China.“If that does return, given that the world economy has already been hit so hard and productivity is being affected, the repercussions will be quite severe,” Gopinath said.The IMF also listed volatile oil prices and social unrest around the world as other risks.Brian Cheung is a reporter covering the Fed, economics, and banking for Yahoo Finance. You can follow him on Twitter @bcheungz.Boston Fed's Rosengren: Second half of 2020 will be 'more difficult' than anticipatedSen. Toomey: Fed gets ‘good marks’ on crisis responsePowell urges Congressional help for unemployed, municipalities as economy recovers from coronavirusPowell: Fed trying not to 'run through the bond market like an elephant'A glossary of the Federal Reserve's full arsenal of 'bazookas'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}