{"article": [{"url": "https://finance.yahoo.com/news/recipe-disaster-u-health-official-144121150.html", "published": 1593424160.0, "headline": "'A recipe for disaster,' U.S. health official says of Americans ignoring coronavirus advice", "body": "By Susan Heavey and Doina ChiacuWASHINGTON, June 29 Reuters) - A spike in U.S. coronavirus infections is fueled in large part by people ignoring public health guidelines to keep their distance and wear masks, the government's top infectious disease official said.A daily surge in confirmed cases has been most pronounced in southern and western states that did not follow health officials' recommendations to wait for a steady decline in infections for two weeks before reopening their economies.\"That's a recipe for disaster,\" Anthony Fauci, who directs the National Institute of Allergy and Infectious Diseases, told CNN in an interview broadcast on Monday.\"Now we're seeing the consequences of community spread, which is even more difficult to contain than spread in a well-known physical location like a prison or nursing home or meatpacking place,\" Fauci told the cable channel in the interview, which was recorded on Friday.More than 2.5 million people have tested positive for the coronavirus in the United States and more than 125,000 have died of COVID-19, the respiratory illness it causes, according to a Reuters tally. The U.S. tally is the highest in the world while the global death toll https://www.reuters.com/article/us-health-coronavirus-deaths/global-coronavirus-deaths-top-half-a-million-idUSKBN23Z0UQ in the pandemic surpassed half a million people on Sunday.California ordered some bars to close on Sunday, the first major rollback of efforts to reopen the economy in the most populous U.S. state, following Texas and Florida ordering the closure of all their bars on Friday. Arizona and Georgia are among 15 states that had record increases in cases last week.U.S. Vice President Mike Pence on Sunday pressed Americans to adopt face masks during a trip to Texas and wore one himself, a sharp turnaround for the administration. Republican President Donald Trump has refused to cover his face in public.Pence and other top health officials were expected to visit Arizona and Florida later this week.Story continuesIn places where cases are soaring, U.S. health officials are also considering \"completely blanketing these communities with tests,\" Fauci said, to try to get a better sense of an outbreak.They would either test groups, or \"pools,\" of people or have community groups do contact tracing in person rather than by phone. Contact tracing involves identifying people who are infected and monitoring people who may have been exposed and asking them to voluntarily go into quarantine.Fauci said that he was optimistic that a vaccine could be available by year's end but that it was unclear how effective it would prove to be, adding that no vaccine would be 100% effective and citing challenges to achieve so-called herd immunity.The top Republican in the U.S. House of Representatives, Kevin McCarthy, on Monday stressed individual actions to stop the spread of the virus, deflecting criticism from Democrats and some health experts that Trump botched the prevention effort.\"You can't say the federal government should do everything, and then say the federal government can't tell the states what to do,\" McCarthy told CNBC. \"The governors have a big responsibility here but every American has a responsibility. They should wear a mask.\"(Reporting by Susan Heavey and Doina Chiacu in Washington; Writing by Grant McCool; Editing by Howard Goller)"}]}