{"article": [{"url": "https://finance.yahoo.com/news/doubleline-portfolio-manager-ken-shinoda-on-housing-market-resilience-during-covid-19-142019197.html", "published": 1598174900.0, "headline": "DoubleLine's Shinoda explains what housing has now that it didn't during the last crisis", "body": "A housing market bolstered by low interest rates, government support and strong demand has stayed afloat despite expectations, even with the economy under siege from the coronavirus pandemic.In fact, real estate owners entered the COVID-19 outbreak better prepared than during the 2008 global financial crisis, according to DoubleLine Capital portfolio manager Ken Shinoda, thanks to mortgage services and policymakers being proactive about relief for homeowners.Shinoda told Yahoo Finance on Friday that a safety net for consumers from the Federal Housing Finance Agency (FHFA) — which governs mortgage giants Fannie Mae and Freddie Mac — has been “aggressive” in allowing homeowners to use forebearance.\"So, if you're a borrower and you're having some trouble with your job because of COVID, you can call your mortgage servicer you can tell them, 'Hey, I'm having issues paying my mortgage,'“ he said.“You can now miss up to 12 payments, and your FICO score doesn't get hit, and the servicer can actually — if you're a Fannie/Freddie loan — can move those missed payments to the back of your loan, non-interest-bearing as a balloon,\" said Shinoda, who oversees a team at DoubleLine that invests in non-agency mortgage-backed securities.The portfolio manager said that this relief for impacted homeowners is the equivalent of a year’s grace to allow the economy to heal, and give breathing room for those borrowers to find another job.\"[This] is something we didn't have during the [2008] global financial crisis. There was forbearance, but not the large scale that we put into place with the help of the Fannie, Freddie, Ginnie Mae [GNMA],\" Shinoda added.Woman Handing Over the House Keys To A New Home Inside Empty Room.The millennial effectThroughout COVID-19 and its economic crisis, the housing market has not only been resilient, but it's remained one of the areas of strength. On Friday, data showed that existing home sales skyrocketed by a record 24.7%, helped by rock-bottom interest rates.According to Shinoda, among the factors driving the housing market are the favorable supply/demand technicals, with a low inventory of homes already available for sale supported by demographics. Millennials, the second largest generation behind the baby boomers, are starting to buy homes as they get deeper into their 30s.Story continuesThe age cohor has “ been saving up some money. They're starting to have kids. They're going to want to be in a house,” Shinoda explained.“Being in a one-bedroom apartment in Manhattan doesn't sound so good when you've got two little kids. So, that migration had already started,\" he added.Another reason housing fundamentals have remained sound is the improved affordability.\"Affordability is driven by two things really — it's income, which had been rising, and then interest rates, which drive mortgage rates. Those are at historic lows. So, going into COVID, things have looked pretty good,\" he stated.To be sure, concerns were surrounding the spike in unemployment during the pandemic and its impact on the housing market, especially among hourly wage workers. However the portfolio manager said that white collar employees with higher paying jobs are haven’t been hit as hard “thus far.”While the bulk of these job losses hit lower-income households the hardest, DoubleLine Capital's CEO Jeffrey Gundlach recently made a case that \"another wave\" of layoffs loom for white-collar workers. Back in July, he told Yahoo Finance that people in the $100,000 to $150,000 bracket \"might be at risk also in another wave of layoffs because those people don't really have any savings by and large.\"Shinoda agreed that professional job losses could come if there's continued economic malaise, but the forbearance could resolve those hardships on repaying mortgages.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach predicts that Trump will win re-electionGundlach predicts gold prices will go much higher in the long-term"}]}