{"article": [{"url": "https://finance.yahoo.com/news/scott-galloway-on-dow-jones-industrial-average-190713058.html", "published": 1598364920.0, "headline": "NYU's Galloway on why the Dow is 'one of the most dangerous numbers ever manufactured'", "body": "Scott Galloway, professor of marketing at NYU Stern School of Business argues the Dow Jones Industrial Average (^DJI) is \"one of the most dangerous numbers ever manufactured.\"On Monday, the index announced it was booting three iconic players: Exxon Mobil (XOM), Raytheon (RTX), and Pfizer (PFE), replacing them with Salesforce (CRM), Amgen (AMGN), and Honeywell (HON), as of August 31 — the biggest change to the market bellwether since Walgreens Boots Alliance (WBA) kicked out General Electric (GE) in 2018.In a wide-ranging interview with Yahoo Finance on Tuesday, Galloway slammed the closely-followed stock market index.Given that Wall Street has surged, even in the face of mounting human and economic losses stemming from COVID-19, Galloway lashed out at the Dow for creating “this delusion of prosperity and that all is fine.\"He argued: \"If you were to say the 'How's the health of the commonwealth, the health of our populous, the health of the economy?' You wouldn't guess that the Dow is [near] an all-time high.”Since the March 23 low, the Dow has rallied more than 44% even as the coronavirus pandemic has disrupted the economy and businesses, causing tens of millions to file for unemployment. Still, despite the gloomiest predictions, major benchmarks have entered a new bull phase.According to Galloway, “this index has gone from something that represents America, which it does not, and people will portray it as, as something that's a proxy on the economic well-being of the top 10%,” he said. “But, it is totally disarticulated from the underlying economy or the health of our nation.\"On Monday after the market close, the index announced plans to retool its portfolio. In the press release, S&P Dow Jones said the changes \"help diversify the index by removing overlap between companies of similar scope and adding new types of businesses that better reflect the American economy.\"The shift was prompted by Apple's (AAPL) recent decision to split its stock by four-for-one Currently, the iPhone maker makes up 12% of the Dow, but the new stocks will help counterbalance Apple’s move, which will cut the index’s tech weighting.Story continuesBut Galloway said the Dow’s move was “more spectacle than historic.” He noted that the changes only have an impact on specific companies, because certain funds buy and sell names based on inclusion in the Dow or other indices.\"Long term, I don't think it's much of an impact on the companies themselves or the markets,\" he added.Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. Gundlach predicts that Trump will win re-electionGundlach predicts gold prices will go much higher in the long-term"}]}