{"article": [{"url": "https://finance.yahoo.com/news/you-have-to-be-very-flexible-us-tech-startups-accelerate-hiring-abroad-in-push-to-distribute-workforce-130714495.html", "published": 1599380120.0, "headline": "'You have to be very flexible:' US tech startups accelerate hiring abroad in push to distribute workforce", "body": "The push to work-from-home may have accelerated the exit out of Silicon Valley for now, but tech startups that remain are turning to a different type of workforce: remote workers overseas.As more and more companies adjust to a distributed reality, executives say they are increasingly looking outside of the United States to tap into a global talent pool, largely untapped by big tech.“It’s incredibly hard to hire world class engineers [in the Bay Area] because they have so many options and you can always get more money at Google (GOOG) and Facebook (FB) and Apple (AAPL) so it's really hard for a startup to compete for talent, so you have to be very flexible,” said Chris Kelly, founder and CEO of brand intelligence platform Survata. “You have to find world class talent and that doesn’t have to be in the Bay Area.”Nearly 90% of Survata’s 50 employees were based near San Francisco just a few years ago. Today, that number has been slashed in half. Kelly said the company invested significantly in Zoom (ZM) software, along with cameras and additional screens 18 months ago, when he hired his first software engineer in Australia. The experience went so smoothly, he immediately turned to additional hires outside of the U.S. when the pandemic hit.“Once we realized, ‘Hey we made that work,’ we were able to hire great talent that was not in San Francisco, then it became well why not Montreal, why not Uruguay,” Kelly said, singling out markets where his most recent hires have come from.Cost savings for employersTech companies like Amazon (AMZN) have been hiring remote workers internationally for years, but like so many digital trends, the shift has been accelerated by the pandemic. The move has been especially prevalent among early-stage startups, squeezed by the cost of talent in Silicon Valley, where top software engineers can command salaries topping $150,000.Nisan Gabay, who helps recruit tech workers for companies globally, says firms can hire the same jobs for a near 50% discount in Montreal, where he’s based.Story continues“To be clear, no one is going to rival the overall amount and depth of talent in Silicon Valley. The question is, how accessible is that talent to you, if you're a startup ... Everybody wants those engineers, and the compensation as a result has gone up and housing is gone up,” said Gabay, a partner at AC780. “If I'm going to get a B engineer in the Valley versus an A engineer in Montreal, which is better? In many cases, the A engineer in Montreal is better than the B engineer in San Francisco.”While the shift to hire internationally has been most pronounced in IT-related jobs, the move isn’t limited to tech startups, according to remote jobs listing site FlexJobs. Career Development Manager Brie Reynolds says the site has seen a 12% to 15% increase in overall listings every month since the pandemic began, with Canada and Mexico topping international listings. The cost savings for employers are significant, with companies saving as much as $22,000 annually for each fully remote worker, Reynolds said.“Before [the pandemic] in the U.S., about 5% of the total workforce worked remotely full time. During the pandemic, we saw that shift to about 63% of the workforce in the U.S. working from home,” Reynolds said. “That’s a massive shift over a very short amount of time. For a remote work experiment like this, to have succeeded as well as it has in the worst circumstances, it really says something about remote work potential.”Illustrative picture showing application for United States of America work visa H1B with penImmigration barriers accelerate remote trendThat trend has given rise to companies like Oyster, which helps firms build out their distributed workforce. The startup, founded in December, develops software that streamlines the hiring process, including setting up payroll and ensuring compliance with local labor and tax laws. While the process traditionally amounted to tens of thousands of dollars in lawyer and accountant bills, Oyster charges a monthly fee of $200 per employee, simplifying the hiring procedure for companies unfamiliar with international markets.Co-founder and CEO Tony Jamous says his business has spiked 25% to 30% during the pandemic. And while the ease to work remotely has accelerated the push to hire outside of the U.S., the crackdown on H-1B worker visas have also been a significant factor in the shift. Earlier this year, President Trump blocked U.S. entry of foreign workers on H-1B and H-2B seasonal worker visas, saying the move was aimed at “getting Americans back to work as quickly as possible.” At the time, administration officials estimated the move would open up 525,000 jobs for U.S. workers.“The U.S. used to import a lot of great talent from around the world, especially in technology, to come and build the next generation of software companies,” Jamous said. “Now you have increasing immigration barriers that are being put in the U.S., that actually is making it much harder to bring in 100,000 developers from India every year to the U.S., and it's not going to get better.”Kelly says cost hasn’t driven his company’s decision to look internationally.He has largely focused Survata’s new hires in countries that share similar time zones to allow for a smoother work experience. He recently hired three software engineers in Uruguay and another in Montreal to build on the “cluster” of employees in their geographic regions. He’s also made a number of operational changes to ensure remote hires feel included in the company’s culture. Survata shifted the company’s “stand-up” meetings from 5 p.m. San Francisco time to Friday mornings to accommodate the time difference. Group meetings are all conducted on individual computers instead of conference rooms, so remote workers don’t feel excluded from the conversation because of their location. Kelly is now re-thinking how to conduct team-building excursions outside of the office, like a painting class, to make sure those outside of the Bay Area can take part, post-COVID-19.“We still believe in the value of in-person, micro interactions. You can get things answered faster without a meeting and it’s good for social bonding and learning,” Kelly said. “We just think it’s good for [diversity and inclusion] efforts to be open to hiring people from other parts of the world and other people from different backgrounds who can’t afford San Francisco.”Akiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujitaCEOS caught in geopolitical fight, as TikTok deadline loomsInfosys commits to hiring 12,000 American workers, expanding U.S. footprint25% of colleges likely to go out of business: Chegg CEO‘China’s goal is to replace you’: Barr warns leaders of America’s biggest businesses‘An unprecedented case”: What a U.S. TikTok ban would look like"}]}