{"article": [{"url": "https://finance.yahoo.com/news/coronavirus-cases-second-wave-us-191009665.html", "published": 1591971500.0, "headline": "Coronavirus: Alarming rise in confirmed cases in U.S. states spared from first outbreaks", "body": "While coronavirus cases in the former epicenter of New York have been steadily decreasing over the past few weeks, new cases are popping up in other areas of the U.S.States like Texas, California, Arizona, Arkansas, Mississippi, Utah, North Carolina, and South Carolina are seeing increased rates of positive COVID-19 tests. Many of these are being attributed to Memorial Day weekend activities, in which many crowds assembled throughout that weekend, potentially exposing themselves.Coronavirus cases are declining in New York but remaining steadfast in the rest of the U.S. (Graphic: David Foster/Yahoo Finance)“In many parts of the country, there was minimal exposure,” Dr. David Katz, a specialist in preventative medicine and president of Public Health and True Health Initiative, said on Yahoo Finance’s The Ticker. “People followed the rules, sheltered in place, socially distanced. And now there’s sort of a haphazard return to the world without a lot of care, without reliable use in some places of masks and personal protective equipment.”‘We closed the barn door after the horses were out’When the coronavirus pandemic first hit the U.S., states such as New York, New Jersey, California, Illinois, and Michigan experienced an overwhelming number of cases, and pushed many hospitals to their brink.New York City became the U.S. epicenter of the virus, with more than 385,000 cases and over 30,000 deaths as of June 12. Over the last several weeks, however, cases have been declining and the city, along with other regions of the state, are entering phases of reopening.There are over 2 million coronavirus cases in the U.S. (Graphic: David Foster/Yahoo Finance)“Clearly, New York City was hit by a wave, and it washed over New York,” Katz said. “Frankly, I think in New York, we closed the barn door after the horses were out. So there was wide level exposure, particularly in the city with people riding the subway. It may be that most people vulnerable to getting the infection in New York City got it.”Slow responses are now leading to infections elsewhere, according to Dr. Michael Saag, associate dean for global health at University of Alabama at Birmingham.Story continuesVolunteer Elizabeth Castro asks people in line to stand 6ft apart along Greenwich Street in Reading, PA on April 25, 2020. (Photo: Ben Hasty/MediaNews Group/Reading Eagle via Getty Images)“We were a little bit late to the game, in terms of getting people to stay at home,” Saag said on Yahoo Finance’s The Ticker. “Other countries were much more assertive, aggressive about that. New Zealand has had zero cases for the last month. It’s a small country, but still. Australia — nine cases a day. Germany has less cases a day for the entire country than we have in the state of Alabama, with only 4 million people in the population.”Alabama has over 22,000 coronavirus cases so far, with 755 deaths, and is seeing a noticeable spike in new cases over the past week. The state, like many others seeing a rise, reopened its economy much sooner than others.“If they’re not careful about protecting the vulnerable, those spikes in cases could lead to spikes in mortality, overburdening the medical system,” Katz said. “That shouldn’t happen. We’ve learned enough to prevent that. But it really depends on state policies.”There are over 7.5 million coronavirus cases worldwide. (Graphic: David Foster/Yahoo Finance)Not-so-socially distant protestsAdding to the growing list of concerns of a spike of coronavirus cases are the recent protests that have taken place over the last week in response to the killing of George Floyd and police brutality against black Americans.While some protesters have made efforts to wear masks and try to socially distance, many have opted out of wearing one and gathered together in big crowds. That raises the potential of the virus spreading.“Even if peaceful, if you’re in a big crowd, if you’re shouting, if you’re getting worked up, if you’re sweating, if you’re jostling, there’s physical contact,” Katz said. “There’s a high probability of droplets being transmitted through the air. It’s basically a worst case scenario to avoid super spreader events.”“If anybody in that crowd is infected with COVID-19 and can transmit, certainly close proximity, passions flaring, droplets flying, really bad scenario,” he continued. “All we can do, I think under the circumstances, is encourage people who are participating in protests to be as careful as possible about personal protection.”Mark Henry Jr. of Black Lives Matter addresses a crowd in an area being called the Capitol Hill Autonomous Zone (CHAZ) located on streets that reopened to pedestrian traffic in Seattle, Washington on June 11, 2020. (Photo by JASON REDMOND/AFP via Getty Images)Katz noted that if everyone wears a mask in that situation, it would definitely make a difference.“You definitely wouldn’t want the end of the greatest infectious disease crisis in living memory to conclude with ‘hey, let’s transition immediately with nothing in between to mass public protests and basically sparring with police,’” he said. “Because everything about that has ‘super spreader’ written all over it.”The key thing to watch, according to Saag, is not only the cases per day but also the hospitalizations. He is expecting to see a bump by July 1 as a result of the protests.“Remember back to the beginning when we were worried about Manhattan overwhelming its health care system,” he said. “I’m very concerned that a lot of the rural hospitals, smaller cities, are going to become overwhelmed, overrun with cases. And that’s going to hurt health care in general for a lot of the people in the country.”Compton Early College High School graduating student Chelsea Donis adjust her mortar after picking up her diploma in a parking lot during a drive-thru graduating ceremony in Compton, California. REUTERS/Mario Anzuoni‘The virus is spreading’The other worry is the timing of new cases popping up: As the fall season approaches, so does the flu season.“The virus is spreading,” Saag said. “Come August, we’re going back to school. And we’re going back to colleges. And we’re doing everything we can to mitigate. But I’m really worried about going into the fall, that we’re going to see a continuing rise.”Some schools, such as Harvard University, are keeping most classes online in order to prevent an outbreak on campus.“Will it, in fact, come back and infect vulnerable people in the fall?” Katz said. “That remains to be seen. Nobody really knows. Past pandemics have done that. But we can’t know because this is a different scenario.”And if a company is actually able to find, develop, and safely test a coronavirus vaccine, that doesn’t guarantee that everyone will actually get one.Workers are seen waiting for the bus in New York City, US. (Photo by John Lamparski/NurPhoto via Getty Images)“We have several issues to contend with,” Katz said. “The first is we have difficulty getting people to make use of vaccines that are time honored, reliable, safe, effective. And this is going to be a new one on a fast track timeline. It’s only going to be effective if it works, if it’s very safe, if it’s mass produced, if it’s universally distributed, and if people accept it. And we’ve got this strong anti-vax sentiment in the country.”He added that “we may be banking too much on a vaccine, thinking that it’s a panacea when, in fact, there are many impediments to that being the ultimate public health solution, the public response to a vaccine among them.”Adriana is a reporter and editor covering politics and health care policy for Yahoo Finance. Follow her on Twitter @adrianambells.READ MORE:ER doctor: 12-18 month coronavirus vaccine timeline 'is extremely optimistic'Coronavirus: 'Children will probably be an important vector for transmission'WHO director warns: Masks can 'create a false sense of security'Read the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}