{"article": [{"url": "https://finance.yahoo.com/news/new-bill-would-allow-small-businesses-to-get-second-ppp-loan-174344949.html", "published": 1592484680.0, "headline": "New bill would allow small businesses to get second PPP loan", "body": "Certain small-business owners may be able to apply for a second Paycheck Protection Program loan if a new bill introduced on June 18 becomes law.The legislation, called the Prioritized Paycheck Protection Program (P4) Act, would allow businesses with fewer than 100 employees to apply for a second loan if they have used up (or are on pace to exhaust) their first PPP loan and can show a 50% loss in revenue due to the COVID-19 pandemic. Business owners also must show they need the money for payroll and eligible non-payroll costs.“Many small businesses will continue to struggle in the weeks and months to come,” Sen. Ben Cardin (D-MD) said. “Congress must once again act urgently to support our most vulnerable small businesses through this crisis, so our economy can recover as quickly as possible after the pandemic. Every business we prevent from failing now, is a business that will be in a position to create jobs during the recovery.”Small Business Committee Ranking Member Cardin, Sen. Chris Coons (D-DE) and Sen. Jeanne Shaheen introduced the Senate version of the bill. Rep. Angie Craig (D-MN) and Rep. Antonio Delgado (D-NY) introduced the companion bill in the House.Application form. Paycheck Protection Program Borrower Application FormThe senators argue some small businesses are still struggling because the shutdown has lasted longer than originally anticipated when Congress put together the program.“In conversations with small businesses up and down the state of Delaware, it’s become clear that many employers in vital sectors need more federal aid through the Paycheck Protection Program. Even as closures are ending, countless Delaware businesses are struggling to survive this crisis,” said Coons in a statement.The senators announced their plan to introduce the bill last week — and questioned Treasury Secretary Steven Mnuchin about it during a Small Business Committee hearing focused on the CARES Act implementation. Mnuchin did not say whether he supported the bill, but said he was “open-minded.”Story continues“We absolutely believe small business — and, by the way, many big businesses in certain industries — are absolutely going to need more help,” Mnuchin told Shaheen.U.S. Senator Ben Cardin (D-MD) attends the Senate Small Business and Entrepreneurship Hearings to examine implementation of Title I of the CARES Act on Capitol Hill on June 10, 2020 in Washington, DC. (Photo by Kevin Dietsch - Pool/Getty Images)Yahoo Finance reached out to the Treasury Department for a statement on the now-released legislation, but did not immediately receive a response.The senators behind the bill said to make sure the businesses struggling most get “P4 loans,” publicly traded companies are not eligible and hospitality and lodging businesses with multiple locations are limited to an aggregate loan amount of $2 million. The bill would set aside the the lesser of $25 billion or 20% of PPP funds for employers with fewer than 10 employees and businesses in underserved and rural communities — a “core priority” for Coons.“They struggled they most to initially connect with lending banks and the SBA in the first round and, frankly, they’re also the ones who are closest to going under as our economy is not reopening as quickly as many of us thought months ago when we passed the CARES Act,” said Coons in an interview with Yahoo Finance.The bill also directs SBA to issue guidance to give priority to the smallest businesses and request demographic information of P4 and PPP loan recipients.“The economic fallout from COVID-19 has been an existential threat to our nation’s small businesses and Congress cannot letup in its efforts to get them get through this crisis,” said Shaheen in a statement. ”This legislation prioritizes smaller businesses, particularly those in the restaurant and hospitality industries, which have been hit especially hard in recent months.”The SBA has approved more than $513 billion in PPP loans, meaning more than $100 billion in funding is still available.The National Federation of Independent Businesses told Yahoo Finance that many of its members anticipate needing additional financial help, and it’s open to proposals that would allow for more PPP loans.Treasury Secretary Steven Mnuchin waits to testify before a Senate Small Business and Entrepreneurship hearing to examine implementation of Title I of the CARES Act, Wednesday, June 10, 2020 on Capitol Hill in Washington. (Kevin Dietsch/Pool via AP)Kevin Kuhlman, the NFIB’s vice president of federal government relations, said the 50% revenue loss requirement in the P4 bill may be problematic.“Even if a business has had 25% or 30% revenue loss and they have high fixed costs or accounts payable, then they’re going to be struggling as well,” said Kuhlman.Coons said some changes could be on the table as he works to build support for the legislation.“There’s a number of slight tweaks that we may end up making,” said Coons. “I think it’s important that we find ways to work together in a bipartisan way to deliver additional resources quickly to the companies most affected.”The bill would also extend the application deadline for PPP loans from June 30 to Dec. 30. And the deadline for a second loan would be Oct. 1. The SBA Administrator would have the discretion to extend the deadline if needed.In an interview with Yahoo Finance’s “On the Move,” Rep. French Hill (R-AK) said he would be open to extending the PPP application deadline beyond June 30 — though he did not comment on the specific legislation.“Not necessarily appropriate more money, but make that existing appropriation available to new small businesses who did okay —maybe in April and May — but might need access to the funds, actually, in July and August as they try to get open at a faster rate,” said Hill.Yahoo Finance reached out to Sen. Marco Rubio (R-FL), the chairman of the Small Business Committee, but his office did not respond.Coons said he is working to on a Republican cosponsor for the bill and “it may be possible” for the Senate to eventually pass the legislation by unanimous consent.This story was updated on June 24 with comments from Sen. Coons.Jessica Smith is a reporter for Yahoo Finance based in Washington, D.C. Follow her on Twitter at @JessicaASmith8.Read more:ACLU sues to stop SBA from denying PPP loans to people with criminal recordsCoronavirus oversight panel Democrats ask banks for info, docs on PPP loansSen. Menendez: May jobs report surprise ‘isn't solace' to unemployed workersFed, Treasury have failed to protect jobs so far: oversight panel memberLawmakers try to change Paycheck Protection Program to give businesses flexibility"}]}