{"article": [{"url": "https://finance.yahoo.com/news/mayor-of-city-famed-for-defunding-police-says-abolishing-police-is-not-the-solution-105937543.html", "published": 1591855640.0, "headline": "Mayor of city famed for defunding police says abolishing police is not the solution", "body": "In the latest signal of reform to come from Minneapolis following the killing of George Floyd, the city’s police chief announced Wednesday that he would be withdrawing from negotiations with its police union.Minneapolis Mayor Jacob Frey quickly applauded the move saying the city doesn’t just need tweaks to a new policing contract, but needs “to go farther than we ever have in making sweeping structural reform.”Earlier this week, a majority of Minneapolis city council members announced unity to dismantle their police force but have yet to put forth a plan on what that would look like or what changes would come from the reforms.As Yahoo Finance recently highlighted, there may be a living example of how to properly disband and reform a police force in Camden, New Jersey — a city that saw a 42% reduction in violent crime and 95% drop in use of force complaints eight years after replacing its unionized city police force with a county community force.But even Camden Mayor Frank Moran cautioned Minneapolis and other towns weighing calls to completely do away with their police forces as being too radical of an approach to take.“I don't think the solution, to be quite honest with you, is to completely abolish [the police,]” he said, caveating that Camden brought its new county force online as it simultaneously wound down its outgoing force. “Who is going to respond to the 911 call?”Read more: What the city where defunding police worked really tells us about itMoran, however, did support the power in starting over with a completely new department. In the case of Camden, which now boasts one of the most progressive policing policies in the country, Moran says getting officers to buy in to the doctrine would not have been possible without getting rid of its old unionized force. By hiring back half those officers and bringing on new recruits at about a 50% reduction in cost per officer, the town nearly doubled the size of its force with a new focus on acting as “guardians” of the community rather than “warriors.”Story continuesThe town of Camden, which was once a large industrial town but watched it's population dwindle as manufacturing left, has seen improvement to societal problems including high unemployment, crime, murder and heavy drug trafficking dating back years. (Photo by Andrew Burton/Getty Images)“There was no way we could’ve accomplished what we accomplished,” he said. “This was a lot of commitment, a lot of will, and today our officers — some people think it's cheesy — our officers will open up a grill and cook hot dogs with the kids. It's about building rapport and trust with the community.”While Camden has achieved a marked reduction in violent crime and was able to avoid destructive clashes with protesters, costs have risen since the creation of its new police force. As one internal state report noted, Camden now allocates about a third of its budget towards its county police force, which has since unionized. The internal analysis notes Camden’s $68.45 million in annual police spending “compels the contraction of other vital city departments and services.”But Moran says those costs are worth it, and much preferred to the alternative, an expensive police force that fails to protect the community, or worse yet, actively harms its citizens without recourse.“Today, the investment continues to grow,” he said. “But the return is what I'm looking at, the return is the reduction in crime, the confidence in our police... it’s well worth it, that's what I can tell you at this point. I don't know if this will work for Minneapolis or any other city, but one thing I can tell you is it has worked for Camden, New Jersey.”Zack Guzman is the host of YFi PM as well as a senior writer and on-air reporter covering entrepreneurship, cannabis, startups, and breaking news at Yahoo Finance. Follow him on Twitter @zGuz.Read the latest financial and business news from Yahoo FinanceRead more:Most 2020 grads are desperate and applying for jobs that aren't the right fit: MonsterWhy Trump’s plan to curtail immigration will slow the coronavirus recoveryAnalyst who predicted market's 40% rally says these stocks will lead to all-time highsFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}