{"article": [{"url": "https://finance.yahoo.com/news/jobless-claims-coronavirus-unemployment-week-ended-september-5-2020-165121299.html", "published": 1599723740.0, "headline": "Jobless claims: Another 884,000 Americans filed new unemployment claims last week", "body": "Another 884,000 Americans filed for first-time unemployment insurance benefits last week, matching the previous week’s level.The U.S. Department of Labor (DOL) released its weekly jobless claims report at 8:30 a.m. ET Thursday. Here were the main metrics from the report, compared to consensus estimates compiled by Bloomberg:Initial jobless claims, week ended Sept. 5: 884,000 vs. 850,000 expected and 884,000 during the prior weekContinuing claims, week ended Aug. 29: 13.385 million vs. 12.904 million expected and 13.292 million during the prior weekLast week’s new jobless claims were upwardly revised slightly to 884,000, from the 881,000 previously reported. This marked the first time since March that jobless claims came in below 1 million for back-to-back weeks, as claims remained stubbornly elevated but off their peak from the worst point of the pandemic.The past couple weeks of jobless claims appeared to improve considerably from the more than 1 million new weekly claims reported in mid-August. However, this was due to a technical change in the way the Labor Department made its seasonal adjustments, which applied for the first time to claims counted during the week ended August 28. Previous weeks’ claims were not revised to reflect the new counting method.The change was made to account for the fact that the pandemic generated a far greater level of new claims per week than would typically occur over the course of a year, throwing off the Labor Department’s usual system of making adjustments for seasonal hiring trends.Most economists agreed that the new methodology would produce a more accurate dataset on jobless claims during the pandemic period. It also produced a lower reported number of seasonally adjusted jobless claims than would have been generated under the previous method. Under the old method of seasonally adjusting claims, new jobless claims for the week ended August 29 would have risen to 1.02 million, according to an analysis by Ian Shepherdson, chief economist for Pantheon Macroeconomics.Story continues“Interpreting the seasonally adjusted figures is complicated by a recent change in methodology, but in both an SA [seasonally adjusted] sense and an NSA [non-seasonally adjusted] sense, it looks like the trends for both initial and continuing claims filings have flattened out lately after a period with more notable declines,” JPMorgan economist Daniel Silver said in a note Thursday. “This flattening out has been evident in the initial claims data for a few months and in the continuing claims data for a few weeks and it is broadly consistent with the idea that the labor market recovery has lost momentum lately.”Unadjusted claims have shown a clearer picture of the stalling recovery in the labor market. Last week, unadjusted new weekly jobless claims totaled 857,148, for an increase of 20,140 over the prior week. This was the fourth straight week of increases in unadjusted new claims.Other economic indicators offered a more upbeat picture of the U.S. labor market. The Labor Department’s monthly jobs report released last Friday showed the U.S. economy added a greater-than-expected 1.371 million payrolls in August, and that the unemployment rate dipped more than anticipated to 8.4%. Wednesday morning, the JOLTS jobs report showed employers had more than 6.6 million job openings in July, topping expectations by over 600,000.Initial jobless claims peaked in late March before trending lower during the pandemic. (David Foster/Yahoo Finance)—Emily McCormick is a reporter for Yahoo Finance. Follow her on Twitter: @emily_mcckRead more from Emily:E-commerce startup Verishop aims to become the ‘largest online shopping mall in the Western world’: CEOSome wellness products growing ‘over 1,000%’ during pandemic: Ro CEOWhat we can learn from the 17 stock market crashes since 1870Find live stock market quotes and the latest business and finance newsFor tutorials and information on investing and trading stocks, check out CashayFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}