{"article": [{"url": "https://finance.yahoo.com/news/walmart-diversity-and-inclusion-report-153010081.html", "published": 1599647900.0, "headline": "Walmart shares 'real-time' picture of diversity, inclusion in the workplace", "body": "Walmart (WMT), the nation's largest private employer, will start sharing its internal diversity stats twice a year instead of annually, in the midst of a searing national debate over equality.In its first-ever mid-year diversity and inclusion (D&I) report covering fiscal years 2019 through 2021 year-to-date, the company has seen a 7.42% increase in management-to-management promotions for people of color. That cohort of employees now accounts for 44.6% of those promotions this year, according to Walmart data.Elsewhere, the company also posted a 2.97% increase in officers of color, with 24.89% of those officer roles held by people of color. The company also saw a 2.2% increase in U.S. people of color new hires, now comprising 55.03% of new hires.The objective is to provide a more “real-time” picture of the retailer's progress, Walmart's chief people officer Donna Morris told Yahoo Finance in a telephone interview.The company’s move takes place against a backdrop of roiling social change sparked by the death of George Floyd at the hands of Minnesota police earlier this year, something Morris mentioned as partly motivating Walmart’s need to “really increase our transparency” and to bolster corporate accountability.As the country’s biggest employer, “we felt we needed to do our part in a number of ways. One was to make sure we continued making progress on representation,\" Morris told Yahoo Finance.\"We want to make sure that in these reports we highlight progress and also highlight areas where we are going to continue to focus on improvement,\" Morris added.‘Growth throughout our pipeline’Walmart employees pledge at a Walmart U.S. associates meeting in Fayetteville, Arkansas June 4, 2014. The meeting was part of Walmart's annual shareholder meeting. REUTERS/Rick Wilking (UNITED STATES - Tags: BUSINESS)Of the company's total U.S. workforce, 54.92% are women, with 25.69% being women of color. Of the U.S.-based hourly associates, 55.66% are women, while 26.38% are women of color.Women account for 45.71% of management roles in the U.S., while women of color hold 17.1% of those positions. The company's officer positions are held by 30.9% women, yet women of color have only 7.31% of those roles, the report shows.Story continues\"What we really want to see progress is growth throughout our pipeline,” Morris said, underscoring a desire to promote more Black, African American and Hispanic associates.“We also have continued work to do on women and making sure that whether I speak of people of color or women, that we are really growing them within Walmart and that we are retaining them,\" Morris added.One of the company's recent initiatives is a recently-implemented hiring protocol where Walmart posts all open positions at or below the vice president level internally.\"In the past, we didn't necessarily post all of our positions. We've made a very deliberate change. We are now posting all of our positions, making sure people see all of our opportunities,\" the executive said.She added that the company now requires diverse interview teams and diverse candidate slates for open positions, a protocol in place for office roles in recent years.\"We are not moving forward unless we have diverse interview teams and diverse slates,\" Morris added.She explained that when the company implemented that diversity protocol for hiring officers, Walmart \"started to see a great improvement in terms of representation at the officer level, both in terms of women but also in terms of people of color.\"In doing so, Morris cited the company getting “traction in top leadership positions” that would lead to broad-based improvement.“It's too early for us to say if it's moving the needle because we just stood up those broadband practices over the last few months,” she said, “but directionally, if we take what we have seen at the officer level, we firmly believe that's going to help move the needle for us.\"According to Morris, one of the drivers to creating more diversity in leadership starts at the entry-level. More than 75% of store management and management began at the company as hourly associates, a highly diverse segment of its workforce in which Walmart invests heavily.\"We actually see if we can take that hourly workforce, our hourly associates, and we can truly focus on retention and development, then Walmart will absolutely be a place for opportunity for everyone, and we'll be more diverse in the future than we are today,” she added.Elsewhere, the company now requires top leadership to participate in two-day racial equity training workshops through the Racial Equity Institutes. The company is also offering all employees broad-based, self-paced, race and inclusion training. Julia La Roche is a Correspondent for Yahoo Finance. Follow her on Twitter. How kids and the coronavirus helped Walmart shape its yearly list of hot toysWalmart unveils ‘ultimate life hack,’ a $98 membership with access to groceries, gas, and delivery"}]}