{"article": [{"url": "https://finance.yahoo.com/news/texas-putting-reopening-pause-virus-152223879.html", "published": 1593081020.0, "headline": "Texas putting reopening on 'pause' as virus cases soar", "body": "AUSTIN, Texas (AP) — Faced with surging coronavirus cases and hospitalizations that have made Texas one of the nation's virus hotspots, Gov. Greg Abbott on Thursday halted elective surgeries in the state's biggest counties and said he would “pause” it's aggressive economic reopening statewide.The suspension of elective surgeries is designed to protect hospital space in the Dallas, Houston, Austin and San Antonio areas. Statewide, the number of COVID-19 patients has more than doubled in two weeks.Texas has reported more than 17,000 new cases in the last three days with a record high 5,996 on Thursday. The day's tally of 4,739 hospitalizations was also a record. The state's rolling infection rate hit nearly 12%, a level not seen since the state was in a broad lockdown in mid-April.Abbott has said the exploding numbers show a “massive outbreak” sweeping through Texas.But those rising numbers, and a doubling of the infection rate to more than 10% — a mark Abbott said in May would be a “red flag\" in his reopening plans— still haven't convinced the Republican to roll back his previous orders that pushed Texas into an aggressive relaunch of one of the world's largest economies.And its not clear what impact such a pause will have.Thursday's slowdown imposes no new restrictions and doesn't repeal current rules that allowed most businesses to reopen. It would appear to delay any plans to expand occupancy levels at places like bars, restaurants and amusement parks and other venues, although Abbott had not indicated when that would even happen.Texas has no capacity limits on houses of worship, child care or youth camps and sports leagues, and professional sports leagues are allowed to hold outdoor events at 50% fan capacity.“We are focused on strategies that slow the spread of this virus while also allowing Texans to continue earning a paycheck to support their families,” Abbott said in a statement. “The last thing we want to do as a state is go backwards and close down businesses. This temporary pause will help our state corral the spread until we can safely enter the next phase of opening our state for business.”Story continuesTexas restaurants are struggling under the current rules of 75% capacity and were glad Abbott didn’t roll the state back to previous restrictions, said Anna Tauzin, chief revenue and innovation officer of the Texas Restaurant Association.“We are grateful for that, but unless the public dramatically improves their behavior, what other choice is he going to have? That’s the last thing we want to see,” Tauzin said.By reimposing a ban on elective surgeries, Abbott is returning to one of his first actions when the virus first emerged in Texas in March. He later rescinded the order during an aggressive reopening of the state in May that lifted lockdown orders ahead of most of the U.S.The leaders of several Houston hospitals said their facilities are capable of handling a surge in new patients.They also sought to tamp down alarm about data from the Texas Medical Center, an umbrella group of the city's major hospitals, that 97% of intensive-care beds are in use. The center’s current models suggest its hospitals could reach “unsustainable surge capacity” by mid-July.Doug Lawson, CEO of CHI St. Luke’s Health, said facilities can open or close beds as needed and said St. Luke’s would almost double its critical care capacity over the next several weeks.“Our hospitals are OK and ready to manage this surge appropriately and effectively,” he said.Abbott this week has taken a newly urgent tone about the worsening trends and is now telling the public they should stay home. He also has urged Texans to wear masks in public.The governor hasn't issued a statewide mask order, but the state's cities and counties has imposed new rules on businesses to require customers and workers to wear face coverings."}]}