{"article": [{"url": "https://finance.yahoo.com/news/costco-ecommerce-sales-up-101-in-august-210759233.html", "published": 1599063320.0, "headline": "Costco e-commerce sales up 101% in August", "body": "Costco’s (COST) net sales for the month of August rose 15% to $13.56 billion, compared to the same month last year.Total comparable sales (excluding the impacts from change in gasoline prices and foreign exchange) increased 14.5%, beating analyst expectations. US comparable sales grew 14.3% compared to the same month last year.A standout was e-commerce sales, which grew 101.6% in August compared to the same month last year.The company said its August sales were negatively impacted by the shift of Labor Day.The stock was relatively flat in extended trading after touching new intraday highs on Wednesday and closing up 2%, at $358.86.Costco received a price target raise to $410 from $370 by analysts at Cowen ahead of the August sales print.Earlier this week Gordon Haskett analyst Chuck Grom raised his price target to $380 while maintaining a Buy rating on the stock. He forecasted same-store sales would rise 13.5% last month.Guggenheim analyst John Heinbockel expected comparable sales to rise anywhere between 12-13% last month driven by consumables. He has a Neutral rating on the stock.“We expect sequential moderation from the recent peak as a result of restaurant re-openings, a depletion in fiscal stimulus, and less back to school spending in areas like apparel,” wrote Heinkbockel in a note to investors.He went on to write, “we expect consumables spending to be stronger, with high teen comps versus low double digits in the discretionary categories.”Analyst have been watching to see if same stores sales growth is slowing down. Walmart (WMT) indicated after its blow-out quarter of 9.7% same store sales growth that July comparable sales grew 4%, partly because of a tapering off of fiscal stimulus.A customer's cart filled with the supplies they're purchasing in response to news about coronavirus disease (COVID-19) at Costco Wholesale on Still Creek Drive in Burnaby, British Columbia, Canada March 15, 2020. Picture taken March 15, 2020.REUTERS/Alec Jacobson.Costco’s prior two months have been impressive.Last month net sales which ended on August 2nd reached $13.04 billion, an increase of 14.1% from $11.43 billion last year. Comparable sales (excluding the impacts from change in gasoline prices and foreign exchange) grew 15.7% in the US. Total company same store sales rose 15.8%, with e-commerce rising 76.1%.Story continuesFor the month of June which included 5 weeks ending July 5th, net sales rose 11.1 % year over year, reaching $16.18 billion. Comparable sales excluding the impacts from change in gasoline prices and foreign exchange grew 13.6% in the US, and 14.4% globally with e-commerce ballooning 86.7%.Costco’s May same store sales climbed 9.7%, while e-commerce grew a whopping 108.1%.Big box retailers have been seen as COVID-19 pandemic stocks. During the lockdowns when most businesses were shut down, essential retailers like Costco remained open as people stocked up on items.In July Morningstar analyst Zain Akbari Research said the company is well positioned amid the economic upheaval of COVID-19 because of a key cost saving strategy.“Costco concentrates its buying power on a small number of items,” said Akbari. “This creates outsize purchasing leverage that we believe is a key ingredient in delivering the values Costco offers, augmented by a robust private-label offering.”Year-to-date the stock is up about 22%.Ines covers the U.S. stock market. Follow her on Twitter at @ines_ferreBearish Tesla analyst explains why shares could surge to $2,070NIO share price reflects 'over-optimism': GoldmanWhy Nikola shares 'look attractive' long-term: JPMorgan analystTesla’s most bullish analyst sets a Street-high price target of $2,322Follow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and reddit."}]}