{"article": [{"url": "https://finance.yahoo.com/news/this-week-in-trumponomics-coronavirus-backsliding-begins-194418987.html", "published": 1592578340.0, "headline": "This week in Trumponomics: Coronavirus backsliding begins", "body": "President Trump insists “we won’t be closing the country again,” no matter how aggressively the coronavirus reasserts itself. But the country might close itself, without him.Apple said June 19 it’s re-closing 11 stores in Arizona, Florida, North Carolina and South Carolina because of rising coronavirus infection levels. Apple is just one retailer among many, and others may not follow suit. But the surprise announcement was enough to flip stocks from positive to negative, for a net loss of about one percentage point on the news.Markets are jittery about the pace of reopenings, which are underway in most states as governors and mayors try to get back to business. More than 20 states have rising infection levels, according to an NPR tracking map, with the biggest increases in South Carolina, Oregon, Oklahoma, Florida and Arizona. Among those, Arizona has the highest per capita infection rate, with some hospitals in the state worried about running short of beds and equipment.Officials in New York, Houston and a few other cities have warned of new lockdowns if caseloads mount anew, but most areas seem likely to continue reopening and simply fight ad hoc battles with the virus. The wild card is how consumers will react. Go out and shop, virus be damned? Or head back in and wait it out?Robust retail sales numbers for May show the penchant to spend is there. But a record one-month increase in sales still left economic activity far below pre-virus levels. Meanwhile, Trump and his allies continue to downplay the severity of the virus, and they now claim an increase in testing is the cause of the increasing caseload. The proof against that is the rising hospitalization rate in most of the places where case counts are going up: People wouldn’t be checking into the hospital if their only symptom was a positive test for the virus.This week’s Trump-o-meter reads WEAK, the third-lowest rating, because there are some signs of an economic recovery, but other signs of looming trouble.Story continuesSource: Yahoo FinanceTrump’s campaign rally in Tulsa on June 20 will be a microcosm of reopening tension. Oklahoma has low per capita infection rates, but infection rates in Tulsa have been rising to new highs. The director of the city’s health department said recently that such a large gathering is “a huge risk factor, today in Tulsa.” He called on Trump to postpone the rally.A month from now, the Tulsa rally could have turned out to be a super-spreader event that sent Tulsa infection rates to even higher or levels, bringing condemnation on Trump. Or, there could be no notable increase in cases from the rally, vindicating Trump’s urge to hold it. Trump plans to hold other rallies, in addition to a packed Republican convention in Jacksonville, Fla., in late August. Tulsa will set the stage.The course of the virus during the next four months, leading to Election Day in November, will most likely be unpredictable and confounding. Oxford Economics sees a two-phase recovery unfolding. We’re in the first phase now, with a strong rebound forming as consumption, business spending and perhaps employment recover from dramatic declines. But the second phase will be more of a slog, as mounting bankruptcies take a devastating toll and many families struggle to get back to where they were before the virus hit.Trump will find victories to celebrate, as some data suggests the kind of “rocket ship” recovery’s he’s hoping for. But it will be like ongoing reopening of the country: sporadic, incomplete and maddeningly slow, with occasional reversals. Just when you think things are open again, they may not be.Rick Newman is the author of four books, including “Rebounders: How Winners Pivot from Setback to Success.” Follow him on Twitter: @rickjnewman. Confidential tip line: rickjnewman@yahoo.com. Encrypted communication available. Click here to get Rick’s stories by email.Read more:Election Night in November could last for daysBiden’s age might work in his favorSome nightmare scenarios for the November electionsThe risk to Biden if he picks a black running mateHow Biden wallops TrumpGet the latest financial and business news from Yahoo FinanceFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit."}]}