{"article": [{"url": "https://www.marketwatch.com/story/thanks-but-no-small-businesses-shun-payroll-tax-deferral-2020-09-05", "published": 1599305120.0, "headline": "Thanks, but no: Small businesses shun payroll tax deferral", "body": "As employees of small businesses get their first September paychecks, they’re probably receiving their usual amount — company owners are still withholding money for Social Security despite a presidential order allowing the tax to be deferred. The order President Donald Trump signed Aug. 8 allows employers to stop withholding the 6.2% payroll tax from Sept. 1 through Dec. 31. Employees must make under $4,000 every two weeks to qualify. Trump said the order was aimed at putting more money into Americans’ pockets during the coronavirus outbreak. Small business owners are wary about the plan. The tax must still be paid between Jan. 1 and April 30 of next year, which means employees could take an unwanted financial hit or companies might ultimately have to pay the government if staffers leave. Attorney John Strohmeyer is having the payroll for his Houston firm processed as per usual. “It doesn’t make much sense. I’m not getting a tax break as an employee or employer. The money is still due by April 30 of next year,” Strohmeyer says. Jay Starkman says the businesses calling his human resources consulting firm for advice about tax deferral ask whether it’s a good benefit for employees. But they’re not inclined to implement the plan. “If the employee doesn’t pay the money back, you’re on the hook for it. Till that changes, it just doesn’t make sense to give somebody a few more months of money,” says Starkman, CEO of Engage PEO, based in Hollywood, Florida. Owners also have questions about the payment process that aren’t answered in the guidelines the IRS issued last week. The three-page document is silent on how the money is to be collected after Jan. 1, leaving owners wondering if they would have to deduct it paycheck by paycheck or whether staffers would need to come up with a lump sum. Owners also don’t know if they’d have to poll staffers individually to see who wants or doesn’t want their taxes deferred. While many companies use payroll processors or human resources consultants to handle staffers’ pay, implementing a temporary tax deferral is still another layer of work for owners who are focused on running their companies during a pandemic. Strohmeyer says business owners would prefer to focus on changes that affect the long-term running of their companies. “This is a four-month delay. Why would you upset your business?” Owners already see the possibility of a bureaucratic headache in tax deferral, says Karen Kerrigan, president of the advocacy group Small Business & Entrepreneurship Council. “The vast majority of small businesses will likely opt out due to complexity, and the fact that it puts owners or managers in an awkward position of collecting funds or deducting funds from employees’ paychecks in the future, and these could be substantial amounts,” she says. Owners are finding that employees aren’t eager to defer their taxes. Attorney Arash Hashemi’s sole staffer is looking down the road to paying the tax in 2021 and “she’s afraid that will hurt her pocket more than it will help,” he says. Hashemi, whose practice is in Los Angeles, is also saying “no, thanks.” “I already have so many obligations to the government, not only federal but state and local. I don’t want to make one more burden for the business,” he says. Michael Kipness has surveyed his five staffers and found that “they’re very concerned about having to pay this back later.” His financial advisers tell him that the IRS guidance about the tax deferral is confusing. “We will continue to withhold it, as there’s too much uncertainly right now,” says Kipness, CEO of Wizard Race and Sports, a company that gives sports gamblers analyses of races and games. Payroll processor ADP is ready to adjust its computer systems to stop withholding the tax if companies request it, says Pete Isberg, the company’s vice president for government affairs. But so far, there’s little interest, Isberg says. “A lot of businesses are looking at this and saying, ‘I don’t think so,’” Isberg says."}]}