{"article": [{"url": "https://www.marketwatch.com/story/pelosi-mnuchin-agree-to-keep-talking-on-covid-19-aid-as-democrats-unveil-own-2-2-trillion-bill-11601339124", "published": 1601325200.0, "headline": "Pelosi, Mnuchin agree to keep talking on COVID-19 aid as Democrats unveil own $2.2 trillion bill", "body": "Treasury Secretary Steven Mnuchin leaves a Republican policy lunch on Capitol Hill in July. (AFP via Getty Images) Treasury Secretary Steven Mnuchin and House Speaker Nancy Pelosi agreed to keep talking on pandemic-related aid for the economy Monday, even as House Democrats readied their own bill for a possible vote later in the week. “The two agreed to speak again tomorrow morning,” Pelosi spokesman Drew Hammill tweeted after a the pair had a brief phone call early Monday evening. With House and Senate lawmakers slated to leave Washington after this week to hit the campaign trail, the coming days are likely make-or-break for efforts to negotiate a sequel to the $1.7 trillion CARES Act passed in March. Earlier in the day, Pelosi had said she was “hopeful” that House Democrats and the White House could come to a deal, even after the talks sputtered in early August. But she warned in an interview on MSNBC that Mnuchin would need to up his offer to come to an agreement. “When he’s ready to come back to the table, we’re ready to have that conversation, but he has to come back with much more money to get the job done,” she said. House Democrats unveiled a new bill to help the economy continue to recover from the jolt given to it by the COVID-19 lockdown, a measure estimated to cost $2.2 trillion if enacted in to law. The bill includes $436 billion in aid to state, local and tribal governments, a revival of the $600-a-week federal add-on to state unemployment benefits, a second round of $1,200 payments to households, a renewed Paycheck Protection Program with easier terms for small businesses, and $225 billion for schools and colleges to deal with the pandemic. The bill also includes money for two things Pelosi has cited as high priorities in recent weeks: Aid for airlines threatening mass layoffs and for restaurants still having trouble making ends meet, with fewer customers. The bill includes $28.3 billion for passenger airlines, their contractors and cargo airlines to retain their employees, with the lion’s share, $25 billion, for passenger carriers. The restaurant provision would provide $120 billion in grants to restaurants, bars and food trucks to make up the difference in revenues between 2019 and 2020, by individual quarter. The funds would need to be used by June 30, 2021, and unused or extra funds could be converted into low-interest 10-year loans, The bill would give moderate House Democrats, who have been uncomfortable with Pelosi’s hardline negotiating stance, something to vote for, even if it is dead on arrival in the Senate, ahead of the final leg of the fall campaign season."}]}