{"article": [{"url": "https://www.marketwatch.com/story/why-these-strategists-say-at-least-500-billion-more-is-needed-to-fuel-consumer-spending-during-the-pandemic-11600214200", "published": 1600256120.0, "headline": "Why these strategists say at least $500 billion more is needed to fuel consumer spending during the pandemic", "body": "The Hudson Yards mall in New York City has reopened to the public amid the pandemic. Getty Images As Congress remains in a deadlock over an additional pandemic aid package, both sides of the Republican and Democratic political divide might want to consider what it’ll take to keep U.S. consumers spending and the economy on a path to recovery. A new report from BCA Research makes the case for the government supplying at least $500 billion worth of additional income support to U.S. households to achieve a modest consumer spending growth rate of 2% over a 12-month span. That would be the minimum amount of support needed to achieve the lower end of the 2% to 6% spending growth rate seen in the aftermath of the 2007-’08 global financial crisis, per BCA’s report. The crux of their findings is that another stimulus package doesn’t need to match the $2 trillion Cares Act fiscal stimulus passed by Congress in March, unless the U.S. sinks into a more dire economic crisis. But it does urge Congress to supply at least 25% of the Cares Act’s monthly income supplement to keep consumers spending and the economy recovering from its steepest recession since World War II. Here’s a chart mapping out how much government income support is needed to push consumer spending higher: Aid to spend BCA Research “Even to achieve 0% spending growth over the next 12 months will require another $249 billion from the government, and that outcome would almost certainly disappoint markets,” warned a team led by Ryan Swift, U.S. bond strategist at BCA, in a note Tuesday. U.S. stocks closed modestly higher Tuesday, with the S&P 500 SPX, +0.87% advancing 0.5%, the Dow Jones Industrial Average DJIA, +0.56% flat and the Nasdaq Composite Index COMP, +1.39% up 1.2%, but only 7.2% off its record close on Sept. 2, after slipping slightly more than 10% into correction territory last week. Swift’s team also shows how a more ambitious $1.1 trillion worth of additional government income support, or 51% of the monthly Cares Act aid, would translate to a more robust 6% spending growth rate over the next 12 months. Here’s why. Consumers long have been a key driver of the U.S. economy, recently accounting for about 70% of economic activity. That figure has fluctuated in past decades and during recessions, but generally more income has led to increased spending habits. Or that was the case until the coronavirus pandemic turned nearly every aspect of daily life in America on its head. After years of many households surviving paycheck-to-paycheck with little savings, April saw the personal savings rate temporarily soar to a historic high of 33.7%, in part as households took up federal emergency relief that hit pause on mortgages, student loans and some consumer debt payments. Consumer spending also plunged to negative-12.9% in April during nationwide lockdowns imposed to slow the pandemic’s spread in the U.S., before rebounding to 8.6% in May as Cares Act fiscal stimulus hit. More recent economic data showed the recovery losing steam as consumer spending tapered back to 1.9% in July, according to the Bureau of Economic Analysis. July’s slower spending pace came amid a turning point for many households, namely as the extra $600 worth of weekly unemployment benefits under the initial aid package expired without any certainty on when more aid might flow. Related: Congress risks creating a ‘recipe for disaster,’ if more pandemic aid isn’t delivered quickly to consumers, warn bond investors Congress and the White House have been locked in a stalemate for weeks over the size and scope of additional fiscal aid that might needed to get the nation through the crisis. House Speaker Nancy Pelosi, who wants to see a multi-trillion dollar aid package achieved that helps schools, local governments and the unemployed, threatened on Tuesday to keep the House in session until a fiscal stimulus deal is done. Republicans have called for a much smaller additional pandemic aid package. However, the focus now in Washington has shifted to passing a temporary spending bill to keep the government operating past Sept. 30, dimming the odds for another major stimulus package to be passed before the Nov. 3 presidential election. “It’s impossible to overstate the importance of fiscal stimulus in ensuring a strong recovery and avoiding a double-dip scenario,” Gregory Daco, chief U.S. economist at Oxford Economics, wrote in briefing Monday. “Without fiscal assistance the economy will remain susceptible to risks from the health situation, political uncertainty around the elections, and financial stress.”"}]}