{"article": [{"url": "https://www.marketwatch.com/story/tech-backed-group-blasts-trumps-order-on-work-visas-as-full-frontal-attack-on-american-innovation-and-our-nations-ability-to-benefit-from-attracting-talent-2020-06-23", "published": 1592909960.0, "headline": "Tech-backed group blasts Trump's order on work visas as 'full-frontal attack on American innovation and our nation's ability to benefit from attracting talent'", "body": "“ 'Massive restrictions to legal immigration - including restricting immigrants who contribute to medicine, science, and research in the United States, and who are working as we speak to develop treatments for coronavirus and other deadly diseases - will not only hinder efforts to save lives, but will prevent job creation and hurt our economy as our country struggles to recover. ... This is a full-frontal attack on American innovation and our nation's ability to benefit from attracting talent from around the world.' ” - Todd Schulte, president of FWD.us That's the reaction to the Trump administration's order restricting work visas on Monday from Todd Schulte, president of FWD.us, a pro-immigration lobbying group that was founded by Facebook's FB, +0.26%  Mark Zuckerberg and other technology industry leaders. President Trump's order blocks visa issuance until the end of the year for a range of foreign workers, affecting the H-1B visas that are widely used by Silicon Valley companies. Other business groups have also criticized the administration's move as well, such as the U.S. Chamber of Commerce. \"Putting up a 'not welcome' sign for engineers, executives, IT experts, doctors, nurses and other workers won't help our country, it will hold us back,\" said the chamber's CEO, Thomas J. Donohue. But the Center for Immigration Studies, which lobbies for reducing immigration, praised the order. \"It will help US workers, as long as it is sustained for a long enough. Potentially creates nearly half a million job openings,\" tweeted the center's director of policy studies, Jessica Vaughan. Nearly 600 organizations disclosed lobbying in Washington, D.C., on immigration issues last year, including Facebook, Microsoft MSFT, +2.48%, Intel INTC, -1.03%  and Google parent Alphabet GOOG, +1.97%  GOOGL, +1.82%, according to an OpenSecrets.org analysis of disclosures."}]}