{"article": [{"url": "https://www.marketwatch.com/story/walmart-says-government-stimulus-money-bolstered-q2s-blowout-results-and-analysts-are-concerned-now-that-its-been-spent-2020-08-18", "published": 1597828280.0, "headline": "Walmart says government stimulus money bolstered Q2â\u0080\u0099s blowout results and analysts are concerned now that itâ\u0080\u0099s been spent", "body": "Walmart Inc. gave some of the credit for its stellar fiscal second-quarter earnings to government financial aid that landed in shoppersâ\u0080\u0099 pockets during the coronavirus pandemic, but the lack of progress in Congress on another economic package is forcing analysts to forecast a pullback in coming months in consumer demand. Walmart WMT, +1.00% Â reported adjusted earnings per share of $1.56 on Tuesday, far exceeding the FactSet consensus forecast for $1.25. Revenue of $137.74 billion was up from $130.38 billion last year and ahead of the FactSet consensus for $135.57 billion. U.S. same-store sales rose 9.3% with general merchandise and food leading the way. â\u0080\u009c[M]y sense is that theâ\u0080¦ order of tailwinds that impacted the business were: one, stimulus; two, eating at home; three, being at home and all the things that you wanted to do to have the indoors and outdoors be more pleasurable,â\u0080\u009d Doug McMillon, Walmartâ\u0080\u0099s chief executive, said on the earnings call early Tuesday according to FactSet. He noted the shift in spending as customers moved their dollars away from things like travel, which the COVID-19 pandemic largely prevented. Gross profit margin, which was up 63 basis points, also got a bump from government stimulus funds and lower markdowns, among other factors. Walmart stock fell 0.7% in Tuesday trading despite the blockbuster results. For the year to date, shares are up 13.4% while the Dow Jones Industrial Average DJIA, +0.56% Â is down 2.7% for the period. However, the future of government fiscal stimulus remains unresolved with Republicans and Democrats in Congress deadlocked on another package, which brings added uncertainty to Walmarts results in future quarters. Walmart executives note that as stimulus funds ran out, the retailer already saw sales beginning to normalize, though the company says itâ\u0080\u0099s in a solid position thanks to its omni-channel offerings. iframe.twitter-tweet { width: 100% !important; } Across platforms, Walmart offers purchasing options, delivery, pickup and other ways for customers to shop. E-commerce sales nearly doubled during the quarter, soaring 97%. Walmart currently sells about 25% of all groceries bought in the U.S. While thereâ\u0080\u0099s been a lot of talk about Walmart+, a membership program that will rival Amazon.com Inc.â\u0080\u0099s AMZN, +3.01% Â Prime program, McMillon gave no update. â\u0080\u009cWe think that assortment breadth and other ability to deliver with speed nationally combined with a few other benefits for customers will result in a compelling proposition,â\u0080\u009d he said. â\u0080\u009cSo weâ\u0080\u0099ve been moving towards a new membership launch. Weâ\u0080\u0099ll share more about that membership and timing when itâ\u0080\u0099s appropriate.â\u0080\u009d Read:Amazon Prime Day delay, back-to-school uncertainty is changing the shopping calendar Neil Saunders, managing director at GlobalData Retail, gives Walmart credit for its digital investments and other steps taken amid the pandemic, but he also expressed concern about what the future will look like. â\u0080\u009cAs robust as these results are, they are more a consequence of external factors than a function of things Walmart has done to engineer growth,â\u0080\u009d he wrote. â\u0080\u009cThis means that as the impact of enhanced unemployment benefits and stimulus checks fades, Walmart is likely to see performance drop back. Our data already show a modest slowdown in non-food which could accelerate as more core customers feel a squeeze on their household finances.â\u0080\u009d Other analysts are far more focused on the digital sales result. â\u0080\u009cWalmartâ\u0080\u0099s Q2 performance, with an almost doubling of online sales, among a litany of expectations-exceeding results, continues to raise the bar for multi-channel retail as the company continues to leverage its massive store base to support its e-commerce initiatives,â\u0080\u009d said Moodyâ\u0080\u0099s vice president Charlie Oâ\u0080\u0099Shea. â\u0080\u009cThe fact that margins actually expanded despite this massive increase in volume and significant COVID-19 costs provides validation that online-oriented operating costs are beginning to be rationalized, as well as an indication that there was some favorable mix shift away from lower-margin consumables and toward higher-margin general merchandise categories.â\u0080\u009d Watch:Work from home is here to stay. Hereâ\u0080\u0099s what it means for retail Moreover, Oâ\u0080\u0099Shea thinks Walmart will hang on to new customers, in part thanks to the increase in Samâ\u0080\u0099s Club memberships. The warehouse retailer saw membership income rise 7.8% during the quarter, and new member count was up 60%. â\u0080\u009cIncreased e-commerce adoption gives Walmart a chance to grow,â\u0080\u009d wrote MKM Partnersâ\u0080\u0099 Bill Kirk in a note. â\u0080\u009cThe biggest complaints (via Yelp!) are in-store service levels and experience. E-commerce adoption largely commoditizes those issues. The more commoditized food retail becomes, the more advantageous Walmartâ\u0080\u0099s supply chain leadership and e-commerce availability are.â\u0080\u009d MKM rates Walmart stock neutral with a $147 price target. With no end in sight to the coronavirus pandemic at the moment, Walmart stands to gain market share from its chief competitor, thanks to its online ammunition. Donâ\u0080\u0099t miss:What did people do with their $1,200 stimulus checks? Finally an answer â\u0080\u009cAs the pandemic lingers on, Walmart is well positioned to grab even more of a market share, especially with small retailers struggling and closing down,â\u0080\u009d said Haris Anwar, senior analyst at Investing.com. â\u0080\u009cMore importantly, if they can continue to sustain levels of 97% growth in e-commerce sales, theyâ\u0080\u0099ll also be taking market share away from bigger competitors such as Amazon too.â\u0080\u009d"}]}