{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-jump-as-inventories-fall-hurricane-curtails-production-2020-09-16", "published": 1600268600.0, "headline": "Oil prices rally as U.S. crude supplies post a weekly decline and Hurricane Sally curtails production", "body": "Oil futures rallied on Wednesday, with U.S. prices ending above $40 a barrel after U.S. government data that showed an unexpectedly large weekly drop in U.S. crude inventories, while production curtailments in the Gulf of Mexico caused by Hurricane Sally worsened. U.S. crude inventories fell by 4.4 million barrels for the week ended Sept. 11, according to the Energy Information Administration on Wednesday. That was larger than the average forecast from analysts polled by S&P Global Platts for a decline of 1.8 million barrels, but on Tuesday the American Petroleum Institute, a trade group, had reported a drop of 9.5 million barrels. The EIA also reported that crude stocks at the Cushing, Okla., storage hub edged down by about 100,000 barrels for the week. Total oil production, however, climbed by 900,000 barrels to 10.9 million barrels per day last week. Traders took in the latest data that “reflect the state of affairs as of last Friday, while there are now [production] shut-ins due to Hurricane Sally,” said Marshall Steeves, energy markets analyst at IHS Markit. “So this is a fast changing market.” Even taking into account the crude stock draw, the “impact of Sally is likely more significant at the moment and that is the reason prices are rising,” he told MarketWatch. “That could be short-lived if we start to see offshore [output] resumptions soon.” West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 rose $1.88, or 4.9%, to settle at $40.16 a barrel on the New York Mercantile Exchange, with front-month contract prices at their highest since Sept. 3. November Brent BRN.1, -0.07% UK:BRNX20, the global benchmark, added $1.69, or 4.2%, to $42.22 a barrel on ICE Futures Europe. Hurricane Sally hit the Alabama coast early Wednesday as a Category 2 storm, carrying maximum sustained winds of 105 miles an hour. It has since been downgraded to a tropical storm, but “catastrophic and life-threatening flooding” is happening along portions of Florida Panhandle and southern Alabama, the National Hurricane Center said Wednesday afternoon. The Interior Department’s Bureau of Safety and Environmental Enforcement on Wednesday estimated 27.48% of current oil production in the Gulf of Mexico had been shut in because of the storm, along with approximately 29.7% of natural-gas production. “This has been the most active hurricane season since 2005 so we may see the Greek alphabet soon,” said Steeves. Each year, Atlantic storms have set names based on the alphabet, but once those have been exhausted, they are named based on the Greek alphabet. “There could be further Gulf impacts yet,” Steeves said. Petroleum product prices Wednesday also moved higher. Gasoline supply fell by 400,000 barrels, while distillate stockpiles rose by 3.5 million barrels, according to Wednesday’s EIA report. The S&P Global Platts survey had shown expectations for a supply drop of 7 million barrels for gasoline, while distillates were expected to rise by 500,000 barrels. On Nymex, October gasoline US:RBV20 rose 4.5% to $1.1889 a gallon, while October heating oil US:HOV20 added nearly 1.6% at $1.1163 a gallon. October natural gas US:NGV20 lost 4% at $2.267 per million British thermal units, easing back after Tuesday’s climb of more than 2%. The EIA’s weekly update on supplies of the fuel is due Thursday. On average, it’s expected to show a weekly supply increase of 77 billion cubic feet, according to an S&P Global Platts survey. Meanwhile, contributing to concerns about the potential for weaker energy demand, the Organization for Economic Cooperation and Development on Wednesday forecast global domestic product will contract 4.5% this year, and rise 5% next year. That compares with a more dire picture pained by the OECD in June, when it projected a 6% contraction this year, followed by 5.2% growth in 2021. In separate reports this week, the Organization of the Petroleum Exporting Countries and International Energy Agency reduced their forecasts for 2020 oil demand from a month earlier. OPEC and its allies, a group known as OPEC+, aren’t expected to make any changes when members of a joint committee meet Thursday to discuss an existing program of output cuts."}]}