{"article": [{"url": "https://www.marketwatch.com/story/a-traditional-401k-is-better-than-a-roth-401k-except-in-this-surprising-situation-2020-06-23", "published": 1593247640.0, "headline": "A traditional 401(k) is better than a Roth 401(k) â\u0080\u0094 except in this surprising situation", "body": "One of the most-asked questions in personal finance is whether to sign up for a 401(k) or a Roth 401(k) retirement plan through your employer. For those with less familiarity, a â\u0080\u009ctraditionalâ\u0080\u009c 401(k) is funded with pretax money while a Roth 401(k) is funded with post-tax money. The only difference between these account types is when you decide to pay your taxes. Before I explain why I think the traditional 401(k) is usually the better option for most people, letâ\u0080\u0099s do a simple walkthrough of how each of these accounts work. Traditional 401(k) vs. Roth 401(k) walkthrough Traditional 401(k): Kate earns $100 which she contributes directly into her traditional 401(k) without paying any income taxes. Over the next 30 years letâ\u0080\u0099s assume that the $100 triples to $300. In retirement, Kate withdraws the $300 but has to pay 30% of it in income taxes. The final (post-tax) money that she can spend in retirement is $210 (or 70% of $300). $210 = ($100x3)x70% Roth 401(k): Kevin earns $100 and pays a 30% tax rate on it to have $70 after-tax. He contributes the $70 directly into his Roth 401(k) where, over the next 30 years, it triples to become $210. In retirement, Kevin is able to spend all $210 without having to pay any additional income taxes. $210 = ($100x70%)x3 Both Kate and Kevin end up with $210 in retirement spending because they had the same contributions, the same investment growth, and paid the same tax rates over time. Mathematically this makes sense because when multiplying a bunch of numbers together, the ordering of the numbers doesnâ\u0080\u0099t matter. 3x2x1 = 1x2x3 Or in Kate and Kevinâ\u0080\u0099s case: (100x3)x70% = (100x70%)x3 The only difference between the two of them was when they paid their taxes, with Kate paying her taxes at the end while Kevin paid his at the beginning. This is why the traditional 401(k) vs. Roth 401(k) decision is irrelevant if your income-tax rate is the the same in your working years and in retirement. Let me repeat that. If you donâ\u0080\u0099t expect any material change in your income tax rate between your working years and retirement, it (generally) wonâ\u0080\u0099t make a difference whether you choose a traditional 401(k) or Roth 401(k). However, if you do expect some variation in your income tax rate, then we can simplify the decision. Read more on the difference begween a 401(k) and a Roth 401(k)Simplifying the traditional vs. Roth decision Given that the timing of taxes is the most important thing when deciding between a traditional 401(k) and a Roth 401(k), we can reduce this problem down to answering a single question: Will your income tax rate be higher now (while working) or later (in retirement)? All else equal, if you think your income taxes will be higher now, then contribute to a traditional 401(k); otherwise contribute to a Roth 401(k). Yes, this answer is simple, but it ainâ\u0080\u0099t easy. Itâ\u0080\u0099s simple because the goal when making retirement contributions is to avoid paying taxes when your tax rate is at its highest. However, this isnâ\u0080\u0099t an easy question to answer because you have to consider how your federal, state and local income taxes might change over time.How to think about future tax rates Given that future tax rates are whatâ\u0080\u0099s important when choosing between a traditional 401(k) and a Roth 401(k), your next question might be, â\u0080\u009cSo Nick, what will future tax rates be?â\u0080\u009d Unfortunately, I have no idea! But neither does anyone else. You can try to use historical trends to think about whether federal or state tax rates will be higher or lower over the next few decades, but this is harder than it seems. For example, in 2012, I was under the impression that U.S. federal income tax rates were likely to increase in the future to be somewhat closer to that of their European counterparts. But then, to my surprise, the Tax Cuts and Jobs Act of 2017 passed and lowered U.S. federal income tax rates. Predicting the future is hard. Though I am not expecting you to forecast the future path of income tax rates in the U.S., I do think that spending time to think about your retirement situation can help clarify the traditional vs. Roth decision. For example, letâ\u0080\u0099s assume that you expect your federal effective tax rate to increase from 20% while working to 23% during retirement. All else equal, this implies that the Roth 401(k) would be the better option, as you would pay a lower tax rate now (20%) than you would expect to pay in retirement (23%). But, what if all else isnâ\u0080\u0099t equal? What if you are working in a state with high income taxes now (i.e. California) and you plan on retiring in a state with low income taxes later (i.e. Florida)? In that case, using a traditional 401(k) would be preferred as the expected savings in state income tax today are likely to exceed the expected increase in federal income taxes in the future. However, this will vary from state to state. For example, New York State residents who are at least 59Â½ are entitled to a state income-tax deduction of up to $20,000 if that money comes from a qualified retirement plan and meets some other criteria. I understand this complicates the calculus surrounding your retirement contributions, but it is worth noting. Though we cannot predict future tax rates, what we can do is estimate how much income we will need in retirement and where we plan on taking that retirement. Having these two pieces of information can do a lot to clarify whether you should be contributing to a traditional 401(k) or a Roth 401(k).When the traditional 401(k) is better Though there are a few scenarios where a Roth 401(k) would be preferred to a traditional 401(k) [see below], I generally recommend contributing to a traditional 401(k) because it has one thing that a Roth doesnâ\u0080\u0099t haveâ\u0080\u0094optionality. With a traditional 401(k) you have far more control over when and where you pay your taxes. If you couple this with the ability to convert a traditional 401(k) into a Roth IRA, you can play some really interesting tax games. For example, if you experience a year of lower income, you can use this time to convert your traditional 401(k) into a Roth IRA at a lower tax rate. I have friends who used this tactic while they were in business school because they knew they would be temporarily earning next to nothing. The taxes they paid on their conversions were far lower than what they would have paid had they made Roth 401(k) contributions from the outset. But you donâ\u0080\u0099t have to go to business school to use this strategy either. Any prolonged period of low income (such as spending time to raise your children, going on sabbatical, etc.) can be utilized for greater tax efficiency. Note that this assumes that your 401(k) balance is not greater than a year of your income. If it is, then you will be paying the same (or higher tax rates) when converting. Keep this in mind before converting your traditional 401(k) to Roth IRA. Besides timing decisions, you can also change where you retire in order to avoid those cities/states that impose larger income taxes. This is why it probably doesnâ\u0080\u0099t make sense to contribute to a Roth 401(k) while living in New York City unless you know that you are going to retire in an area with a similarly high taxes. Though I donâ\u0080\u0099t know which of these tax tactics will be most useful to you in the future, I do know that none of these options are available with a Roth 401(k). The added flexibility associated with a traditional 401(k) is what makes it my go-to choice when it comes to employer-sponsored retirement vehicles. When the Roth 401(k) is better Despite the lack of optionality in a Roth 401(k), there are a few special cases where a Roth might be the way to go. One of these cases is for people who are high savers. Why is this true? Because maxing out a Roth 401(k) places more total dollars into a tax-deferred account than maxing out a traditional 401(k). A little math will demonstrate this. Imagine Sally and Sam max out their 401(k)s one year by each contributing $19,500. While Sally places her $19,500 contribution into a Roth 401(k), Sam places his $19,500 into a traditional 401(k). After 30 years, letâ\u0080\u0099s assume both of their accounts have tripled in value to $58,500. Unfortunately, Sam still has to pay income taxes. Assuming that pays 30% in taxes, he will be left with only $40,950 to spend in retirement. How did Sally end up with more in retirement than Sam? Sally placed more total dollars into the tax-deferred account to begin with. For Sam to have $58,500 after taxes in retirement using his traditional 401(k), he would have had to contribute $27,857 into his account initially. However, since the maximum yearly contribution amount into a traditional 401(k) is $19,500, Sam is out of luck. This simple example demonstrates that the Roth 401(k) is probably the better choice for high savers, as you get more total tax-deferred benefits. In addition, high savers may find that some of the optionality in a traditional 401(k) is closed off to them. For example, if you try to convert a traditional 401(k) with a high account balance to a Roth IRA, you may end up in a higher tax bracket than you initially planned for. With these kinds of benefits off the table for high savers, the Roth 401(k) becomes a more appealing choice.What About both? Though so far I have pitted the traditional 401(k) and Roth 401(k) against each other, there is nothing stopping you from relying on both of these account types in retirement. In fact, this may be a more prudent decision and could allow for even more optionality than using either account by themselves. For example, I spoke with an advisor at my firm who typically recommends utilizing a Roth 401(k) early in your career (assuming you earn less) and then switching to a traditional 401(k) later as your earnings increase. This strategy is great because it avoids the highest tax brackets in your highest-earning years and also provides additional flexibility when making retirement withdrawals. And, as I mentioned previously, because the tax treatment of retirement withdrawals varies by state, a dual strategy might be the best solution to effectively navigate such a complex landscape. But, you know whatâ\u0080\u0099s even better than a dual strategy?The only right answer Despite all the back and forth on which 401(k) account is right for you, the only right answer is to talk to a tax advisor. Though I can generalize my advice as much as possible, every personâ\u0080\u0099s financial situation is different. There are differences in state tax treatment, differences in income and differences in retirement expectations that all affect what the â\u0080\u009crightâ\u0080\u009d choice is. This is why some of the tactics Iâ\u0080\u0099ve discussed here could be helpful for you and some could be disastrous. But the only way to find out is to get expert help. Spend the time and money to get this right and it can pay you back for decades to come. Trust me on this. Nick Maggiulli is the author of the blog â\u0080\u009cOf Dollars and Data,â\u0080\u009d where this was first published as â\u0080\u009cRoth 401(k) vs. 401(k): Which is the Better Option?â\u0080\u009d. Follow him on Twitter @DollarsAndData."}]}