{"article": [{"url": "https://www.marketwatch.com/story/michelle-obama-blasts-president-trump-urges-americans-to-vote-joe-biden-like-your-lives-depend-on-it-11601992489", "published": 1601988140.0, "headline": "Michelle Obama blasts President Trump, urges Americans to vote for Joe Biden â\u0080\u0098like your lives depend on itâ\u0080\u0099", "body": "Michelle Obama Getty Images “ â\u0080\u0098Because this is a difficult, a confusing time â\u0080¦ and when people hear these lies and crazy conspiracies repeated over and over and over again, they donâ\u0080\u0099t know what to think. With everything going on in their lives, they donâ\u0080\u0099t have time to fact-check falsehoods being spread throughout the internet. And even reasonable people might get scared. And the one thing this president is really, really good at is using fear and confusion and spreading lies to win.â\u0080\u0099 ” Thatâ\u0080\u0099s former first ladyÂ Michelle ObamaÂ delivering a scathing attack on President Trump in a 24-minute video posted on YouTube GOOG, +1.97% GOOGL, +1.82% on Tuesday morning in which she urged her fellow Americans to vote for Joe Biden â\u0080\u009clike your lives depend on it.â\u0080\u009d Obama called out Trump for â\u0080\u009cfailureâ\u0080\u009d on the pandemic as well as for racist fearmongering. She accused him of seeking to â\u0080\u009cgaslight the American people by acting like this pandemic is not a real threat,â\u0080\u009d even as she didnâ\u0080\u0099t directly point to the presidentâ\u0080\u0099s COVID-19 diagnosis. â\u0080\u009cIf youâ\u0080\u0099re a parent like me, youâ\u0080\u0099re feeling the consequences of this presidentâ\u0080\u0099s failure to take this pandemic seriously â\u0080¦ from his constant downplaying of the importance of masks and social distancing â\u0080¦ to his relentless pressure on schools to open without offering a clear plan or meaningful support to keep students and teachers safe,â\u0080\u009d she said. The first lady also went after Trump for devoting his life to â\u0080\u009cenriching himself, his family, and other wealthy peopleâ\u0080\u009d in contrast to Biden. â\u0080\u009cHe boasts about gains in the stock market SPX, +0.87%, but when you look at the lives of regular folks â\u0080¦ thereâ\u0080\u0099s nothing much to brag about,â\u0080\u009d she said. Amid all the Trump bashing, Obama praised Biden for having â\u0080\u009clived his life guided by values and principles that mirror ones that most Americans can recognize. I know Joe,â\u0080\u009d she said. â\u0080\u009cHeâ\u0080\u0099s a good man who understands the struggles of everyday folks.â\u0080\u009d Watch the full video: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } |"}]}