{"article": [{"url": "https://www.marketwatch.com/story/house-democrats-add-25-billion-in-support-for-post-office-to-their-stand-alone-bill-11597695533", "published": 1597736840.0, "headline": "House Democrats add $25 billion in support for post office to their stand-alone bill", "body": "Mail boxes sit in the parking lot of a post office in the Bronx, on Monday. AFP via Getty Images House Democrats on Monday added $25 billion in emergency funding for the U.S. Postal Service to the stand-alone measure they are expected to consider at the end of the week. Speaker Nancy Pelosi has called the House back into session over the post-office issue. Democrats and much of the public are concerned that President Donald Trump and his new, handpicked postmaster general are attempting to hollow out the service and make it unable to process mail-in ballots this November. At first, House Democrats said they would only vote to block recent policy changes at the Postal Service favored by the White House. But the final plans announced Monday added the $25 billion in funding. The $25 billion price tag matches the level of funding that was included in the House’s $3.5 trillion coronavirus relief plan that has stalled since May in the Senate due to Republican opposition. Efforts to reach a compromise on a relief package have failed. Trump muddied the waters by announcing some executive actions that he said would help the economy and unemployed workers. Economists have concluded the executive action and several memos he inked at his New Jersey golf club two weekends ago are paltry half-measures. For instance, economists at J.P. Morgan Chase estimate the Trump actions would add only $150 billion to the economy rather than the minimum of $1 trillion that Wall Street had been expecting and that many Republicans ultimately signaled reluctant assent to. White House officials have of late said they are open to funding the post office but only if the measure includes parts of the stimulus relief package they like. This offer would not include funding for state and local governments. That White House offer has been a nonstarter for Democrats since last month, and so they are moving forward with their stand-alone Postal Service bill. Essentially, Democrats are daring Republicans to oppose the measure."}]}