{"article": [{"url": "https://www.marketwatch.com/story/samsung-predicts-highest-op-profit-in-2-years-2020-10-08", "published": 1602120440.0, "headline": "Samsung predicts highest op. profit in 2 years", "body": "SEOUL -- Samsung Electronics Co. said it expects around 12.3 trillion won ($10.6 billion) in operating profits for the third quarter, rising on the same period a year earlier and driven by stronger smartphone and consumer electronics sales, as companies adapt to the pandemic's effects long-term. Samsung said Thursday it estimated an operating profit of 12.2 trillion to 12.4 trillion South Korean won, compared with 7.78 trillion won in the same period a year earlier. The electronics giant also said it expects to report around 65 to 67 trillion won in revenue compared with 62 trillion won for the prior year's quarter. As economies reopen, the company has seen sales bouncing back in its smartphones and consumer electronics divisions from earlier this year as well as additional sales from Huawei Technologies Co. for its memory chips before a ban on the Shenzhen-based company went into effect. The company's outlook for the previous quarter was also buoyed by news last month that it had signed a $6.65 billion deal with Verizon Communications Inc. to provide network equipment over the next five years. Samsung has aggressively prioritized capturing more 5G marketshare, as carriers establish the next-generation standard, particularly in the U.S. and Europe. The company, which often acts as a bellwether for the wider global technology industry, still has to navigate the long tail of the pandemic, as countries await a vaccine that could help restore economic stability. Major markets like the United States are still struggling to establish control over their virus response, casting doubt on how stable the return of consumer demand will be. Analysts had already anticipated good news from the company, forecasting about 10.1 trillion won in operating profit, according to estimates gathered by S&P Global Market Intelligence. The company's estimated operating profit would be the highest since 2018's fourth-quarter operating profit of 10.8 trillion won, when the company was still enjoying the benefits of booming semiconductor sales. Analysts' forecasts had also projected 63.5 trillion won in revenue. The company's full earnings report is expected near the end of the month. Samsung's announcement is an early hint, now half a year in, for how tech companies may fare, as they grasp how the pandemic will affect them in the long-run. After the first few months scrambled earnings projections and upended the global economy, consumer demand shriveled and smartphone sales dived. But Samsung and other semiconductor companies benefited from a short-term boom for memory chips from data centers ramping up capacity and consumers buying more devices to shift to working from home. Now, with economies reopening in spurts and starts, some analysts suggested the global technology market is emerging from the worst squalls of the storm. Daniel Kim, a Seoul-based analyst at Macquarie Group attributed much of the rise in sales to pent-up demand catching up from earlier quarters and suggested that demand could carry the company into the next year. The company's expenses are also still lowered because of limitations on business travel, he noted. \"Because all the travel expenses and offline marketing activity have stopped, there are unintended effortless cost savings, so those contribute to a significant market expansion,\" he said. Write to Elizabeth Koh at Elizabeth.Koh@wsj.com"}]}