{"article": [{"url": "https://www.marketwatch.com/story/trump-told-woodward-nothing-more-could-have-been-done-on-coronavirus-response-2020-09-13", "published": 1600032440.0, "headline": "Trump told Woodward: â\u0080\u0098Nothing more could have been doneâ\u0080\u0099 on coronavirus response", "body": "“ â\u0080\u009cNothing more could have been done. Nothing more could have been done.â\u0080\u009d ” Thatâ\u0080\u0099s what President Donald Trump told journalist Bob Woodward in August of the U.S. governmentâ\u0080\u0099s response to the coronavirus pandemic, Woodward revealed on CBSâ\u0080\u0099s â\u0080\u009c60 Minutesâ\u0080\u009d on Sunday night. By that time, more than 167,000 Americans had died from COVID-19, and the Trump administration had been heavily criticized for not doing nearly enough to prevent the spread of coronavirus. iframe.twitter-tweet { width: 100% !important; } Trumpâ\u0080\u0099s comments were recorded in an Aug. 14 phone interview with Woodward. Last week, excerpts from Woodwardâ\u0080\u0099s upcoming book revealed that Trump knew the coronavirus was â\u0080\u009cdeadly stuffâ\u0080\u009d early in the pandemic, but continued to play down its severity so as not to panic the American people. â\u0080\u009câ\u0080\u0098Nothing more could have been done.â\u0080\u0099 Does he remember what he told me, back in February, about, itâ\u0080\u0099s more deadly than the flu?â\u0080\u009d Woodward told CBS News reporter Scott Pelley, according to a transcript. â\u0080\u009cI mean, it almost took my breath away, that there was such certainty, when he was absolutely wrong about the issue that defines the position of this country right now.â\u0080\u009d â\u0080\u009cI think he did not understand the American public,â\u0080\u009d Woodward told â\u0080\u009c60 Minutes.â\u0080\u009d â\u0080\u009cAnd he said, â\u0080\u0098Well, I donâ\u0080\u0099t wanna create a panic.â\u0080\u0099 We know, from history, when the public is told the truth, they organize. â\u0080\u0098We have a problem. Weâ\u0080\u0099re going to step up.â\u0080\u0099 And Trump thought, â\u0080\u0098Oh, well, theyâ\u0080\u0099ll panic.â\u0080\u0099 When thereâ\u0080\u0099s a crisis, when the president, particularly, knows something, itâ\u0080\u0099s time to tell the public in some form. He failed.â\u0080\u009d Woodward came to that same conclusion at the end of his book, saying Trump â\u0080\u009cis the wrong man for the job.â\u0080\u009d â\u0080\u009cItâ\u0080\u0099s a conclusion based on evidence, overwhelming evidence, that he could not rise to the occasion with the virus and tell the truth,â\u0080\u009d Woodward told â\u0080\u009c60 Minutes.â\u0080\u009d â\u0080\u009cAnd one of the things that President Trump told me, â\u0080\u0098In the presidency, thereâ\u0080\u0099s always dynamite behind the door.â\u0080\u0099 The real dynamite is President Trump. He is the dynamite.â\u0080\u009d Pelley did not ask Woodward about his controversial decision to not publicize Trumpâ\u0080\u0099s comments back during the pandemicâ\u0080\u0099s early days."}]}