{"article": [{"url": "https://www.marketwatch.com/story/us-jobless-claims-fall-to-six-month-low-of-837000-but-theres-a-california-catch-2020-10-01", "published": 1601562980.0, "headline": "U.S. jobless claims fall to six-month low of 837,000 â\u0080\u0094 but thereâ\u0080\u0099s a California catch", "body": "The numbers: The number of Americans who applied for jobless benefits fell slightly in mid-September to the lowest level since the start of the coronavirus pandemic, but the threat of fraud and other problems in California made it hard to get a good read on how much the labor market is improving. Initial jobless claims filed through state programs dropped to 837,000 in the week ended Sept. 26 from a revised 873,000 in the prior week, the Labor Department said Thursday. Economists polled by MarketWatch had forecast new claims to fall to 840,000. An estimated 650,120 people also filed new claims under the Pandemic Unemployment Assistance Act, the federal law that temporarily made self-employed workers eligible for benefits for the first time ever. That put the number of actual or unadjusted new claims at 1.44 million â\u0080\u0094 basically unchanged from the prior week. A big complicating factor is California. The state is not accepting new applications until early October while it processes a large backlog and investigates reports of widespread fraud. That could be exaggerating how many people are actually applying for or receiving benefits since California is the nationâ\u0080\u0099s largest state. As a result, the U.S. Labor Department is using the most recent California numbers before the pause as part of its national total. Read:Consumer confidence surges to highest level since start of coronavirus pandemic What happened: New jobless claims rose the most in the states of New York, Texas and Georgia. Continuing jobless claims declined by 980,000 to a seasonally adjusted 11.8 million in the seven days ended Sept. 19. Thatâ\u0080\u0099s also the lowest level since late March, when the virus was shutting shut most of the U.S. economy. Altogether, the number of people getting benefits through eight state and federal programs rose by 484,856 to an unadjusted 26.5 million as of Sept. 12, the latest data available. Yet some economists say the data canâ\u0080\u0099t be trusted given the situation in California and widespread disparity in unemployment shown between jobless claims and the more comprehensive monthly U.S. employment report. The jobs report showed a far fewer 13.6 million people were unemployed in August. Big picture: The economy is adding more jobs than itâ\u0080\u0099s losing and more people are going back to work, but a slower decline in jobless claims suggests the labor market is not improving as rapidly as it was just a few months ago. Whatâ\u0080\u0099s more worrisome is that a slew of companies in travel and entertainment, the most latest being Disney DIS, +1.53%, have said they will cut thousands of jobs permanently unless the government provides aid. Limits on customers and fear of contagion have kept most Americans from flying, staying in hotels, visiting theme parks, going shopping or eating out. So far Congress has failed to break a deadlock over another financial relief package, though talks might be heating up after a long cold spell. What they are saying? â\u0080\u009cEven as jobs are being recovered job losses are mounting, indicative of continuing strains in the labor market,â\u0080\u009d said Rubeela Farooqi, chief U.S. economist of High Frequency Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Thursday trades."}]}