{"article": [{"url": "https://www.marketwatch.com/story/feds-clarida-says-new-inflation-fighting-strategy-has-roots-in-failure-of-old-approach-2020-08-31", "published": 1598879960.0, "headline": "Fed's Clarida says new inflation-fighting strategy has roots in failure of old approach", "body": "A top Federal Reserve official on Monday said a groundbreaking shift in how the central bank sets U.S. interest rates stems from the persistent failure of longstanding models to accurately predict the path of inflation. Richard Clarida, vice chairman of the Fed, laid out the reasons why the bank broke with decades of tradition last week to adopt an inflation-averaging strategy that could result in interest rates staying low for longer periods. No longer will a rising or falling unemployment rate, he said, largely dictate what the Fed does. Nor will the Fed raise rates simply because inflation rises to 2% or higher. Instead the bank will seek to ensure inflation averages 2% over an extended period. \"Times change, as has the economic landscape, and our framework and strategy need to change as well,\" Clarida said. Clarida noted the long-term link between prices and the unemployment rate, known to economists as the Phillips curve, began to lose its predictive power more than a decade ago amid a broad shift in the global economy that ushered in an era of hyper-competition and low inflation. Even as unemployment declined to modern lows, he noted, inflation barely budged and remained surprisingly tame. Yet bound in part by the dictates of its traditional approach, the central bank from 2015 to 2019 lifted the fed-funds rate to as high as 2.5% from the near-zero level that long prevailed in the aftermath of the 2007-09 Great Recession. The cost of many business and consumer loans are tied to the fed-funds rate. The steady increase in interest rates coincided with a decline in U.S. unemployment to 3.5% from 5%, a rate historically associated with higher inflation. Inflation during that period remained remarkably low, however, only briefly breaking above bank's 2% target in 2018, based on the Fed's preferred PCE price index. The Fed probably wouldn't have raised rates as quickly or as sharply as it did had its new strategy been in place, Clarida implied. \"Economic models of maximum employment, while essential inputs to monetary policy, can be and have been wrong,\" he said in a virtual speech to the Peterson Institute in Washington, D.C. By law the Fed is tasked with maintaining stable inflation and maximum employment. The Fed's new inflation-averaging strategy, he said, will give the central bank more flexibility to achieve those goals without tying its hands, especially during times of economic crisis like the one facing the U.S. now. The U.S. fell in a deep recession after the coronavirus pandemic struck in March, putting millions of people out of work and pushing the official unemployment rate to a post-World War II high 14.7%. The Fed responded by slashing a key interest rate to near zero, buying trillions in assets and making loans available to endangered businesses. What the Fed wants to avoid in the future is raising rates too early in a recovery or raising them too high, Clarida said, choking off economic growth even when inflation poses little threat. Even before the Fed adopted its new strategy last week, the bank under current Chairman Jerome Powell and his immediate predecessors has shown more flexibility and a tolerance for somewhat higher inflation. The central bank has also signaling for months that it would change course. Read:Here are the major changes to Fed's strategy to foster jobs and stable inflation While the change might seem minor, it could have far-reaching consequences. The Fed won't necessarily raise interest rates, for instance, simply because inflation rises to 2% or higher as investors have long been led to believe. If inflation had averaged less than 2% for a long period, the Fed would be willing to let inflation rise above 2% for a while. What Clarida left unanswered is how the Fed would make such a determination or how long it would let inflation run above its average 2% target. He said central bankers would rely on \"a wide range\" of economic indicators to inform its decisions. \"The Fed wants to overshoot their inflation target to make up for past shortfalls. For how long or by how much is an open question,\" said Neil Dutta, head of economics at Renaissance Macroresearch. Some critics said the new approach is too vague, making it harder to figure out the direction of interest rates. Many Wall Street DJIA, +0.56%  investors, businesses and consumers use such information to decide when to invest or borrow money. iframe.twitter-tweet { width: 100% !important; } One tool the Fed is unlikely to use, Clarida said, is negative interest rates. Fed officials see little benefit to such a controversial change that would result in banks or investors paying others to store their money. Clarida said the use of caps or targets on interest rates \"were not warranted in the current environment,\" but he said they would remain an option \"if circumstances changed markedly.\" For now, Clarida said forward guidance and large purchases of assets such as Treasurys would be enough to support economic growth when the central bank's benchmark short-term fed-funds rate is near 0%, as it is now. Forward guidance involves Fed officials publicly forecasting the level of interest rates and inflation a few years out to signal to investors the central bank's intent. If the Fed signaled that inflation is likely to remain low for the next few years, for instance, investors, businesses and consumers could take it to mean that interest rates will also stay low."}]}