{"article": [{"url": "https://www.marketwatch.com/story/the-best-trump-interview-yet-fox-news-host-chris-wallace-cheered-blasted-for-his-grilling-of-the-president-2020-07-19", "published": 1595168120.0, "headline": "The â\u0080\u0098bestâ\u0080\u0099 Trump interview yet? Fox News host Chris Wallace cheered â\u0080\u0094 and also blasted â\u0080\u0094 for his grilling of the president", "body": "President Trump is no fan of Fox News host Chris Wallace, having called him a â\u0080\u009cwannabeâ\u0080\u009d who is â\u0080\u009cnasty and obnoxiousâ\u0080\u009d and â\u0080\u009cwill never be his father,â\u0080\u009d the legendary Mike Wallace of CBS News. This latest interview isnâ\u0080\u0099t helping. The two faced off on â\u0080\u009cFox News Sundayâ\u0080\u009d over the recent surge in coronavirus cases, mask wearing, tearing down statues and, of course, Joe Biden. Read: War of words between Trump and Fauci heats up In one particularly odd moment, they tangled over the presidentâ\u0080\u0099s cognitive test. Trump recently boasted that he â\u0080\u009cacedâ\u0080\u009d such a test. â\u0080\u009cThey said, â\u0080\u0098Thatâ\u0080\u0099s an unbelievable thing. Rarely does anybody do what you just did,â\u0080\u0099 â\u0080\u009d Trump told Fox News last week. â\u0080\u009cBut [Biden] should take that same test.â\u0080\u009d Wallace, making the point that â\u0080\u009citâ\u0080\u0099s not the hardest test,â\u0080\u009d highlighted one of the questions, which asks the test taker to identify a picture of an elephant. Key Words (February 2020):Dr. Ronny Jackson concedes he failed to get Trump to abide by his exercise prescription but was making diet inroads Then, when Wallace showed Trump a Fox News poll that found more Americans feel Biden is the more mentally fit of the two candidates, Trump issued a challenge. â\u0080\u009cLetâ\u0080\u0099s take a test right now,â\u0080\u009d he said. â\u0080\u009cLetâ\u0080\u0099s go down, Joe and I will take a test. Let him take the same test that I took.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } In another testy exchange, Wallace challenged Trump over his claims that Biden has called for defunding the police. The president asked a White House staffer to bring him proof, but, after flipping through a document that was brought to him, Trump, Wallace said, had been unable to show a Biden call for police-department defunding. Hereâ\u0080\u0099s a roundup of highlights from the interview: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } While Wallaceâ\u0080\u0099s conduct of the interview received plenty of admiration on Twitter TWTR, -0.23%, the president was not without defenders: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } According to those likelier to have â\u0080\u009cMAGAâ\u0080\u009d hashtags on their accounts than blue checkmarks, Wallace was the villain: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } |"}]}