{"article": [{"url": "https://www.marketwatch.com/story/covid-19-has-dashed-the-retirement-dreams-of-these-people-2020-09-09", "published": 1599738440.0, "headline": "COVID-19 has dashed the retirement dreams of these people", "body": "The pandemic has affected nearly everyone in some way or another — people have lost their jobs, seen a reduction in wages, gotten sick or, at the least, likely had to skip a planned vacation. But some Americans say this pandemic has the potential to spoil their retirement plans, and they’re not confident they’ll be living comfortably in their old age in the future, according to a recent survey by Kiplinger’s Personal Finance magazine and the Alliance for Lifetime Income. More than half of women (56%), 54% of people in their 50s and 54% of investors with a net worth of less than $500,000 are confident about their retirement security now, compared with their male, older and wealthier counterparts, respectively. 80% of older Americans can't afford to retire - COVID-19 isn't helping More than half (54%) of respondents who are not fully retired are also less confident, versus slightly more than a third of full retirees, the poll found. The pandemic has the potential to dramatically upend workers’ future plans. Entrepreneurs risk losing their businesses, as some cities still suffer from delayed or limited openings. New York City’s booming restaurant industry can only operate outdoors for the foreseeable future, for example. Many corporations are juggling how to retain their employees but stay profitable. The unemployment rate hit record highs in recent months, and some who didn’t lose their jobs still saw a reduction in wages. Not all Americans were prepared for their retirements before the pandemic. Another survey from Allianz Life Insurance, published earlier this year, found a third of people said an unanticipated job loss pushed them into retirement too soon, and a quarter said health issues did. About 4 million older workers will be forced into retirement by October, a report from the New School’s Schwartz Center for Economic Policy Analysis. The New School also said workers will see a lower replacement ratio, meaning they will have less income in retirement than they need to maintain their standard of living. Two-thirds of respondents in the Kiplinger and Alliance for Lifetime Income survey said they have seen their retirement investments eroded as a result of the pandemic, and nearly all (91%) said they believe it is important to protect their retirement savings from volatility. Allianz said more than half of survey takers said they’d like to do so with guaranteed income, such as an annuity. (The Alliance for Lifetime Income is a member organization of financial services companies that focus on monthly guaranteed income). Still, it may be easier to get annuities in retirement plans. The Secure Act, sweeping retirement legislation passed in December, makes it easier for companies to allow annuities as part of their 401(k) offerings. Americans can also purchase annuities separately, which allows them to guarantee some amount of income in their retirements — depending on age, amount of time and other personal factors. There are a variety of annuities, as well as rules associated with them, so it’s important individuals do their research and ask a financial planner for assistance before locking themselves into a product."}]}