{"article": [{"url": "https://www.marketwatch.com/story/trump-administration-moves-to-shrink-h1-b-visa-program-for-highly-skilled-workers-2020-10-06", "published": 1602064280.0, "headline": "Trump administration moves to shrink H1-B visa program for highly skilled workers", "body": "WASHINGTON (AP) — The Trump administration announced plans Tuesday to sharply limit visas for skilled workers from overseas, a move officials said was a priority amid job losses caused by the coronavirus pandemic. Department of Homeland Security and Department of Labor officials said new rules for what’s known as the H1-B program will restrict who can obtain a work visa and will impose additional salary requirements on companies seeking to hire foreign workers. “ The H-1B program was created under President George H.W. Bush to help companies fill specialized jobs as the tech sector began to boom and it was harder to find qualified workers. Many companies insist they still need the program to fill critical positions. ” Acting Deputy DHS Secretary Ken Cuccinelli said about one-third of the people who have applied for H1-B visas in recent years would be denied under the new rules, which also will include limits on the number of specialty occupations available under the program. See:Homeland Security Department’s top two officials were put there illegally by Trump, concludes Government Accountability Office Ken Cuccinelli, then acting director of the U.S. Citizenship and Immigration Services and now the acting deputy secretary of homeland security, was in attendance at a 2019 naturalization ceremony at the National September 11 Memorial Museum in New York. Getty Images President Donald Trump in June issued an order temporarily suspending the H-1B program until the end of the year. The new rules reflect a broader effort by his administration to curb both legal and illegal immigration, an issue important to Trump’s base even if it’s less prominent in his campaign this year than in 2016. A new requirement that employers pay higher prevailing wages to foreign workers will take effect in the coming days, reflecting the need to help the job market recover from the coronavirus shutdown, said Deputy Secretary of Labor Patrick Pizzella. “With millions of Americans looking for work, as the economy continues its recovery, immediate action is needed to guard against the risk lower-cost foreign labor can pose to the well-being of U.S. workers,” Pizzella said. The H-1B program was created under President George H.W. Bush to help companies fill specialized jobs as the tech sector began to boom and it was harder to find qualified workers. Many companies insist they still need the program to fill critical positions. Critics include labor advocates as well as people who seek limits on legal immigration. But supporters argue that H-1B holders fill critical needs and don’t necessarily take jobs from Americans, but rather help expand the economy and create more opportunity. Increasing the required wages will especially hurt startups and smaller enterprises that may be unable to meet the increased requirements, said Cornell University Law School professor Steve Yale-Loehr, an expert in immigration law. “Companies may decide to offshore jobs overseas, hurting U.S. workers,” said Yale-Loehr. Cuccinelli and Pizzella said the program has been abused to allow companies to displace American workers with less expensive employees from overseas. “U.S. workers are being ousted from good paying, middle-class jobs and replaced with non-U.S. workers,” Pizzella said. “It has also caused U.S. wages in some instances to stagnate. That is wrong.” Among the new rules are significant limits on “offsite” firms that bring in large numbers of H-1B visa holders and then provide those workers under contract to other companies for a fee, a loophole that has been the subject of fraud and other abuse. There would also be increased workplace inspections and additional oversight of the H-1B program, Cuccinelli said. The U.S. can issue up to 85,000 H-1B visas per year in technology, life sciences, health care and other sectors. They are typically issued for an initial period of three years and can be renewed. People from India and China make up the majority of the estimated 500,000 H-1B visa holders in the U.S. Officials said the Department of Labor rules would take effect immediately after publication in the federal register later this week while those that fall under the Department of Homeland Security would be adopted after a public comment period. Read on:Homeland Security whistle-blower says he was pressured to alter intelligence on Russia and white supremacists to match Trump preferences"}]}