{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-climb-and-head-for-35-weekly-climb-amid-public-health-worries-2020-06-12", "published": 1591971800.0, "headline": "Gold prices end lower, but tally a 3% weekly gain amid public-health worries", "body": "Gold futures finished with a modest loss on Friday, pressured by a rebound in U.S. stocks to start the session, and strength in the dollar and bond yields. But worries about the economic impact of a resurgence in COVID-19 cases still helped the precious metal tally a weekly climb. Prices for the precious metal posted a gain of 1.1% Thursday, finding support as the Dow Jones Industrial Average DJIA, +0.56% settled the session with a loss of 7% amid a resurgence of COVID-19 cases and concerns about the economic outlook. The Dow traded modestly higher as gold futures settled Friday, but the Nasdaq Composite COMP, +1.39% was lower. The benchmark ICE U.S. Dollar index DXY, -0.58%, however, was up 0.7%, while the 10-year Treasury yield TMUBMUSD10Y, 0.777% added nearly 4 basis points to 0.69%. Strength in the dollar and bond yields tends to dull gold’s appeal as a haven investment. August gold US:GCQ20 edged down by $2.50, or 0.1%, to settle at $1,737.30 an ounce on Comex, after surging 1.1% on Thursday to mark the highest settlement for a most-active contract since June 1, according to FactSet data. The yellow metal saw a weekly gain of 3.2% based on last Friday’s settlement of the most-active contract. Prices were trading closer to the session’s high of $1,753, but where pared after some upbeat U.S. economic data were released Friday. U.S. consumer sentiment climbed to 78.9 in early June from 72.3 in May. Providing support for haven gold this week, the Federal Reserve on Wednesday “basically ruled out any rate hikes for the next couple of years, while simultaneously boosted expectations that [quantitative easing] will be in operation for the foreseeable future,” said Fawad Razaqzada, market analyst at ThinkMarkets. Safe-haven gold also may continue to “find additional support from some of the bearish factors weighing on stocks, including concerns over a second wave of infections, and raised geopolitical uncertainty,” he said in market commentary. However, bullion investors caution that gold, which has been buoyed by government and central bank stimulus measures across the globe, may require a fresh spark to bust out of a trading range around $1,700 an ounce. “Gold is well supported by monetary policy, but likely needs further catalysts to break higher in the very near term,” wrote UBS strategist Joni Teves, in a research report dated Thursday. “We think market participants are likely to remain cautious about adding or building positions at this stage,” the UBS analyst wrote. Bullion’s action on Thursday was prompted partly by evidence that the number of U.S. coronavirus infections were rising, with recent reports indicating that Arizona and Texas are showing increased cases. Among other metals Wednesday, July silver US:SIN20 shed 41 cents, or 2.3%, at $17.482 an ounce, with the metal almost unchanged from last Friday’s $17.479 finish. July copper US:HGN20 tacked on 0.5% to $2.60 a pound, ending around 1.7% higher for the week. July platinum US:PLN20 fell 0.6% to $819 an ounce, for a weekly loss of 1.4%, while September palladium US:PAU20 added 1.5% to $1,938.50 an ounce, with prices down about 0.7% for the week."}]}