{"article": [{"url": "https://www.marketwatch.com/story/day-trading-stocks-is-a-guaranteed-slaughter-so-why-do-it-2020-06-30", "published": 1594025780.0, "headline": "Day trading stocks is a guaranteed slaughter. So why do it?", "body": "Every so many years, it seems, the stock market is flooded with mindless cash, an influx of inexperienced traders looking for a quick buck and a thrill. It’s happening again. Consider the weird saga of Hertz, the long-respected car rental brand. Undone by debt, it’s not clear the company will survive. They’re dumping cars online at steep discounts. After trading close to $70 five years ago the stock’s most recent low was just 40 cents a share. The firm filed for bankruptcy on May 22. Hertz has warned investors that the stock could soon be “worthless.” As Burt Malkiel, Princeton professor and a member of the investment committee of my firm, notes, day trading a stock like Hertz is beyond senseless. “I have no argument with those who like to gamble. I have bet on horse races in my lifetime, and I have sat at blackjack tables in Las Vegas and Atlantic City,” Malkiel writes. “I attribute my losses to the cost of entertainment. But I don’t confuse day traders with serious investors.” Read: There is a ‘right thing’ to do when the market tanks Now, I totally get why some people do this with their money. Some are out of work. Many are bored. The ubiquity of commission-free trading means the temptation is as near as the cellphone in your hand. Yet, as Malkiel explains, there’s nothing in the data to suggest a positive outcome for the overwhelming majority who dabble in short-term stock trading. In fact, Malkiel argues, owning the market while doing nothing is more profitable. Read: Investing legend Burt Malkiel on day-trading millennials, the end of the 60-40 portfolio and more “It turned out that less than 1% of day traders were able to beat the market returns available from a low-cost ETF. Moreover, over 80% of them actually lost money,” Malkiel says, citing a Taiwanese study. In a similar study in Brazil, “only 3% of day traders made money, and less than 1% made more than the Brazilian minimum wage.” Every day trader reading this probably thinks “But not me!” Yet they are no different from a gambler mindlessly feeding a one-armed bandit in Atlantic City or furiously scratching off lottery tickets at an LA gas station. Everyone thinks they can win. The slightly more thoughtful stock gambler believes they have a strategy, a “trick” that allows them to pick only winners and avoid holding losers. Most traders not wiped out immediately eventually develop a “system” that kind of works — until it fails spectacularly. Serious stock investors are in it for the long haul. They buy shares on the expectation of owning them for years — even decades. They buy regardless of the market’s overall direction, the near-term fortunes of the companies they hold or the political atmosphere of the day. You can’t control anything about the stock market. Nobody can. The managers of the underlying companies can’t. Nothing they do can make the stock go up or down day to day, week to week. What you can do is control is your cost of investing by using a low-cost fund, as Malkiel suggests. You can control your level of risk by owning a broad portfolio of stocks and bonds. You can control your emotional responses by diversifying, that is, by holding hundreds of stocks in an index fund instead of just a handful. And you can enjoy the fruits of your patience without the needless stress of day trading. Invest for your future and go find another hobby. Adopt a dog, take up a sport, anything but stock trading."}]}