{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-tops-170000-as-more-states-see-new-cases-rise-2020-08-17", "published": 1597682000.0, "headline": "Coronavirus update: U.S. death toll tops 170,000 as more states see new cases rise", "body": "The number of new daily cases in the U.S. of the coronavirus that causes COVID-19 declined, but total cases climbed to 5.4 million and the death toll topped 170,000, as the number of states in which the situations worsened over the past week has increased. The continued climb in new cases, which averaged more than 51,500 a day last week, according to a New York Times count, comes at a time when states are grappling with what to do about schools. Some, including President Donald Trump’s son-in-law Jared Kushner, are pushing for a full reopening, while others have pushed for keeping them closed. NBC reported Monday that Newark, N.J., schools have decided to remain remote until at least the end of the first marking period in November, less than two weeks after saying school will reopen on Sept. 8. Don’t miss: Wealthier parents are more likely to send their kids back to physical classrooms -- here’s why. Also read: Fauci urges schools to hold classes outdoors as much as possible. There was growing concern over a spike in new cases in several countries in Europe, which was hit hard with the outbreak before the U.S. Spain imposed new restrictions over the weekend to battle the spread of COVID-19, including closing nightclubs. But that didn’t stop Germany from imposing a two-week quarantine on people returning from Spain. On a bright note, Yale University was granted an emergency use authorization by the U.S. Food and Drug Administration for a product called SalivaDirect, which uses saliva instead of swabs to test for the COVID-19 virus, which FDA commissioner Stephen Hahn called “groundbreaking” in its efficiency, according to a report in The Wall Street Journal.Latest tallies The global tally for new cases is at 21.8 million on Monday, with the death toll rising to 776,586, according to data provided by Johns Hopkins University. The U.S. remains way in front in cases and deaths, with 5.42 million new cases and 170,277 deaths. There were 42,303 new cases reported on Sunday and at least 516 new deaths, according to the New York Times, with a one-week average of 51,523 cases a day. In the U.S., 17 states saw cases increase in the past week, up from 10 states seeing cases increase a week ago, according to JHU data. On a daily basis, there were 13 states that had more than 1,000 cases, led by Texas with 6,879 and Florida with 6,352. Johns Hopkins University In Georgia, where there were 3,273 new cases in a day, Gov. Brian Kemp, who had previously opposed face-mask mandates, relented by saying over the weekend that local governments would be allowed to enact mask requirements. In New York, where there were 734 new cases in a day, Gov. Andrew Cuomo said gyms and fitness studios can reopen across the state as early as Aug. 24, if they pass safety inspections and follow strict health guidelines, including limiting capacity to 33% and requiring all guests to wear face masks. Brazil remained second to the U.S. in both cases and deaths, with 3.34 million new cases and 107,852 deaths, the JHU data shows. India is third in cases with 2.65 million and Mexico is third in deaths at 56,757. Rounding out the top 5, Russia reached 925,558 cases and South Africa rose to 587,345 cases, while India’s death toll was 50,921 and the U.K.’s death tally was 46,791. China, where the illness was first reported late last year, is 32nd in the world with 89,421 cases, and 27th in deaths with 4,703 fatalities.Trump touts another unproven coronavirus therapy CNN reported that Trump met with MyPillow creator Mike Lindell in July about using oleandrin as a potential therapeutic for coronavirus. Oleandrin is an extract from the Nerium oleander plant, which is toxic in the raw form. Lindell then told CNN that Trump was “enthusiastic” about the extract, and wanted the FDA to do its course. Trump has also touted antimalarial drug hydroxychloroquine as a COVID-19 treatment, although many health experts, including those in his administration, have said the drug is not effective as a treatment."}]}