{"article": [{"url": "https://www.marketwatch.com/story/after-6-years-this-nurse-practitioner-was-told-her-public-service-job-did-not-qualify-for-student-debt-forgiveness-she-fought-that-decision-but-many-others-are-left-in-limbo-11597244034", "published": 1597734080.0, "headline": "After 6 years, this nurse practitioner was told her public-service job did not qualify for student-debt forgiveness", "body": "Public servants, like nurses and doctors, are facing challenges determining whether their work qualifies them for a student-loan forgiveness program for public servants. Photographer: Go Nakamura/Bloomberg Go Nakamura/Bloomberg News For about six years, Olivia Straw was making payments on her student loans, assuming they’d eventually be forgiven. There was no reason for her to question the assumption that she’d qualify for Public Service Loan Forgiveness, a program that allows public servants to have their federal student loans forgiven after 120 monthly payments. Straw is a nurse practitioner specializing in oncology. She’d been told by her student loan servicer, FedLoan Servicing, in September 2014 that Winchester Physician Associates, a nonprofit organization employing doctors and nurse practitioners who work at a community hospital and outpatient practices north of Boston, was a qualifying employer under the program. But in 2019, when Straw, 39, went to re-certify her employment with her servicer, she got a different answer. After several months of waiting, calling FedLoan and filing complaints with her attorney general’s office and the Consumer Financial Protection Bureau in order to receive a response, she was told by FedLoan in February that her work at WPA didn’t qualify. She asked for a second review of her case and got the same answer in March, as the coronavirus pandemic was ramping up. Though by then, Straw was at a new employer, she was doing similar work to what she’d been doing at WPA, seeing patients with cancer, including those who had COVID-19. Olivia Straw is a nurse practitioner specializing in oncology “To read that and to hear that the work you’re doing, they’re saying it’s not public health services,” Straw said of the response she received from FedLoan in March. “It’s not even about the money more, it just sort of hits at why you go to work every day and they’re discrediting that.” In August, only after her former employer submitted a letter reiterating that they provide public health services, was Straw’s six years of payments approved. In the meantime she was contemplating how she would cope if those six years wound up not counting towards forgiveness. By then she’d paid roughly $40,000 on her student loans, but because she was using a plan that based monthly payments on her income — only these types of plans are both eligible for PSLF and provide borrowers with a benefit at the end of 10 years — payments were only hitting the interest; her six figure balance continued to grow. “That was a long battle,” she said of the experience. There are “huge financial consequences to somebody telling you your employer qualifies and reneging on that decision.” Borrowers are receiving conflicting or inaccurate information about whether their employer qualifies A new report suggests that Straw is not alone in her experience. Since 2012, the Department of Education has told borrowers more than 50,000 times that their employer is ineligible for PSLF, according to a report released Wednesday by the Student Borrower Protection Center, a borrower advocacy group, and the American Federation of Teachers, one of the nation’s largest teachers unions. And for public servants, getting a clear answer as to whether their employer qualifies them for the program can be challenging, the report found. Having accurate information about whether their work is eligible for PSLF can be crucial for a borrower’s financial future. Borrowers pay down their debt for ten years before being able to access forgiveness and any wrong guidance provided by the government or servicers could derail their progress towards that goal. “What we found through the investigation was pretty shocking,” said Seth Frotman, the executive director of SBPC, “which was just the total haphazard, ill-conceived and poorly executed manner by both which the Department of Education and the student-loan industry were making these critical decisions.” The findings come amid years of concern over management of the PSLF program. In the first year that borrowers were eligible to have their debt forgiven under the initiative, a cohort of tens of thousands of borrowers submitted applications — the Department of Education rejected 99% of them. After seeing that rejection rate, what started to become obvious to officials at AFT was that borrowers were facing a course “full of obstacles,” said Randi Weingarten, the union’s president. “Any of them would stop you from getting relief under Public Service Loan Forgiveness and worse — many of them had you starting from square one.” SPBC and AFT launched an investigation into these issues in 2018. Wednesday’s report is the first in a series on their findings. There’s reason to believe that a growing share of borrowers will have their applications approved in the coming years. For one, when the government first launched the program in 2007, there was little publicity or clarity around it. In addition, many of the repayment programs that borrowers can use to qualify for PSLF weren’t yet available. The number of borrowers who knew of all the program’s requirements in 2007 and followed them for ten years is likely much smaller than the number who learned about the initiative and its requirements a few years after it launched. Still, advocates warned years before the first cohort of borrowers became eligible for forgiveness in fall 2017 that the complicated mix of requirements for PSLF would make it difficult to access. What’s more, they say, student loan servicers have provided borrowers eager to stay on track for forgiveness with too little or the wrong information, throwing off years of careful financial planning. Making sure that borrowers have accurate information on which to base their financial future is particularly important during this time, Frotman said. Given the tumultuous labor market, it’s likely that more borrowers than typical may be switching employers over the next several years — that raises the stakes for borrowers on getting a correct determination on whether their job qualifies them for PSLF. “What was a critical protection before, in the age of the worst economic situation that most of us have ever felt, is just even more vital,” he said. Qualifying requires checking many boxes To qualify for PSLF, borrowers must have the right type of federal student loan, a Direct Loan; they need to be in the right type of repayment plan; they need to make 120 on-time, monthly payments; and they need to work for a qualifying employer. The report released Wednesday focuses on the fourth requirement. To determine whether borrowers work for a qualifying employer, they can submit an employment certification form to the Department or FedLoan. Wednesday’s report finds that even when borrowers took that step — essentially crossing their T’s and dotting their I’s — they couldn’t get accurate information about their progress towards forgiveness. In some cases, like Straw’s, a borrower’s employment was certified as eligible and then later rejected, according to the report. In others, borrowers working for the same organization received different determinations from the government as to whether their job qualified. The report also revealed the level of subjectivity used when making these determinations. In one case uncovered by the report, a FedLoan employee wrote in an email that a nonprofit organization focused on care for Holocaust victims wasn’t providing a public service because, “I don’t see their efforts as being for the public.” In another case, an employee referenced Wikipedia when trying to make a determination as to whether a borrower’s employer qualified them for the program, while acknowledging that Wikipedia “is not the most reliable source of information.” Advocates urge the government to provide more transparency surrounding rejections SPBC and AFT are urging the government to provide more transparency to borrowers about how their determinations are made and create a clearer appeals process for borrowers whose applications are rejected. In addition, they’d like to see the agency publish a comprehensive registry of qualifying employers. The Department of Education didn’t provide a comment on the report’s findings by press time. Keith New, a spokesman for the Pennsylvania Higher Education Assistance Agency, which runs FedLoan, wrote in an email that as part of renewing the organization’s contract with the Department, its Office of Federal Student Aid agreed to a establish a task force with PHEAA “to meet at least weekly to review and implement improvements to the PSLF program, including such issues regarding employer certification.” Last month, the Office of Federal Student Aid updated its website with a searchable employer database borrowers can use to see if their employer qualifies for PSLF. Frotman called this a “baby step,” noting that it requires borrowers to log in, in order to look up information about their employer. Instead, SPBC and AFT would like to see a completely public database of employers who have ever been approved for PSLF to provide a transparent guide to borrowers and clear standards for employees to follow when making an eligibility determination. The goal of these recommendations is to hold the Department of Education and the student loan industry accountable, Weingarten said, and to make sure PSLF is being implemented as it was envisioned. “That intent is if you go into the public service — whether it’s teaching, or nursing, or other public-service careers — that you’re not going to have your debt saddle you, particularly because public service is moderately paid,” she said. “It shouldn’t have been so hard to make this work and any Department of Education should have wanted to make it work when they saw problems.” Though Straw is relieved her situation is resolved, she doesn’t think it should take the effort she put into the process — including regularly spending two to three hours drafting letters and making phone calls on her days off — to stay on track towards forgiveness. “This is not appropriate, they created this program to try to help people who do public service work and yet people almost quit from fatigue because it’s so difficult to access,” she said."}]}