{"article": [{"url": "https://www.marketwatch.com/story/seoul-north-korea-blew-up-liaison-office-as-tensions-rise-2020-06-16", "published": 1592296520.0, "headline": "Seoul says North Korea blew up liaison office near demilitarized zone as tensions rise", "body": "SEOUL, South Korea (AP) — North Korea blew up an inter-Korean liaison office building just inside its border in an act Tuesday that sharply raises tensions on the Korean Peninsula amid deadlocked nuclear diplomacy with the United States. Seoul’s Unification Ministry said the building in the North Korean border town of Kaesong was destroyed at 2:49 p.m. It gave no further details. See:Two years after Trump-Kim summit, North Korea reiterates vow to pursue military-force buildup Also:Bolton book to say Trump made no foreign-policy moves not primarily intended to improve re-election odds Photos from Yonhap News Agency showed smoke rising from what appeared to be a complex of buildings. The agency said the area was part of a now-shuttered industrial park where the liaison office was located. iframe.twitter-tweet { width: 100% !important; } North Korea had earlier threatened to demolish the office as it stepped up its fiery rhetoric over Seoul’s failure to stop activists from flying propaganda leaflets across the border. Some experts say North Korea is expressing its frustration because Seoul is unable to resume joint economic projects due to U.S.-led sanctions. On Saturday night, Kim Yo Jong, the influential sister of North Korea’s leader, warned that Seoul will soon witness “a tragic scene of the useless North-South liaison office (in North Korea) being completely collapsed.” She also said she would leave to North Korea’s military the right to take the next step of retaliation against South Korea. In 2018 the Korean peninsular rivals opened their first liaison office at Kaesong to facilitate better communication and exchanges since their division at the end of the World War II in 1945. When the office opened, relations between the Koreas flourished after North Korea entered talks on its nuclear weapons program. Earlier Tuesday, North Korea’s military threatened to move back into zones that were demilitarized under inter-Korean peace agreements. The General Staff of the Korean People’s Army said it’s reviewing a ruling party recommendation to advance into unspecified border areas that had been demilitarized under agreements with the South, which would “turn the front line into a fortress.” While it wasn’t immediately clear what actions North Korea’s military might take against the South, the North has threatened to abandon a bilateral military agreement reached in 2018 to reduce tensions across the border. Inter-Korean relations began strained since the breakdown of a second summit between North Korean leader Kim Jong Un and President Donald Trump in Vietnam in early 2019. That summit fell apart because of disputes over how much sanctions should be lifted in return for Kim’s dismantling his main nuclear complex. Kim later vowed to expand his nuclear arsenal, introduce a new strategic weapon and overcome the U.S.-led sanctions that he said “stifles” his country’s economy."}]}