{"article": [{"url": "https://www.marketwatch.com/story/oil-bounces-after-lockdown-fears-spark-selloff-2020-09-22", "published": 1600787900.0, "headline": "Oil scores partial rebound as traders bet on a second weekly decline in U.S. crude supplies", "body": "Oil settled higher on Tuesday, finding support from expectations for a second weekly decline in U.S. crude supplies. Prices scored a partial rebound from the sharp decline in oil seen a day earlier, when the rise of COVID-19 cases and potential for renewed activity restrictions in Europe fed a global equity selloff. Tuesday’s oil-price rise was modest. Energy traders struggled “to assess the uncertainty with U.S. production as we approach the last two months of hurricane season [and] how bad the demand outlook will get following the winter wave of the coronavirus,” as Libyan oil production slowly bounces back, said Edward Moya, senior market analyst at Oanda. West Texas Intermediate crude for October delivery US:CLV20 CL.1, -1.62% on the New York Mercantile Exchange edged up by 29 cents, or 0.7%, to settle at $39.60 a barrel after a decline of 4.3% on Monday. The contract expired at the day’s settlement. The November WTI contract CLX20, -1.62%, which is now the front month, settled at $39.80, up 26 cents, or 0.7%. Global benchmark November Brent crude BRN.1, -0.07% UK:BRNX20, meanwhile, rose 28 cents, or 0.7%, at $41.72 a barrel on ICE Futures Europe. Michael Lynch, president of Strategic Energy & Economic Research, told MarketWatch that it’s possible that the latest update on crude-oil inventories will show a decline, “mostly due to Gulf Coast weather.” Oil production in the Gulf took a hit from Hurricane Laura, which made landfall in late August, and then from Hurricane Sally last week. As of Tuesday, 7.12% of Gulf oil output was shut in, according to the Bureau of Safety and Environmental Enforcement. Tropical Storm Beta made landfall along the Texas coast late Monday. The Energy Information Administration will release its weekly U.S. petroleum supply report Wednesday morning. The American Petroleum Institute, a trade group, will issue its own figures late Tuesday. On average, analysts polled by S&P Global Platts expect the EIA to report a decline of 4 million barrels in domestic crude supplies for the week ended Sept. 18, along with a fall of 1.9 million barrels gasoline inventories and a climb of 1.2 million barrels in distillate stockpiles. While the bounce Tuesday was welcome for oil bulls, analysts said uncertainty around the outlook for both demand and supply was likely to keep a lid on the market in the near term. The measures “put in place to curb the corona pandemic have a direct and comparatively marked impact on oil demand,” said Barbara Lambrecht, analyst at Commerzbank, in a note. British pubs will be required to close early and people who violate rules will face stiff fines under new lockdown restrictions put in place to halt a surge in new COVID-19 cases. Other European countries have taken limited steps to squelch a pickup in new infections. Supply concerns also remain, with Libya expected to boost output nearly threefold to 300,000 barrels a day, the analyst said, as a military commander who controls the eastern portion of the country ends a blockade of ports. “The return of Libyan oil exports will force OPEC+ to take action to offset this additional supply by making corresponding cuts elsewhere,” Lambrecht wrote. “After all, its objective of rebalancing the market risks being jeopardized by the cooling of oil demand that is feared. So far, the oil market appears convinced that the production cartel is willing and able to act.” So far this month, WTI oil prices have lost 7%, while Brent has declined by nearly 8%. “As it is often the case every year during the shoulder season, the period that separates summer from winter, crude oil prices pulled back in the past few weeks,” Francisco Blanch, commodity and derivative strategist at BofA, wrote in a recent note. “The drop occurred as leisure summer driving came to an end, with the “aggravating factor this year,” being that “work-from-home trends have curbed commutes and business travel, providing little support to fuel demand in September.” “The oil selloff has likely put OPEC+ on guard,” and the Saudis pushed hard last week to “increase compliance with agreed production quotas across the group,” he said. Back on Nymex, October gasoline US:RBV20 shed 1.1% to $1.1643 a gallon, while October heating oil US:HOV20 settled at $1.0961 a gallon, down 1%. October natural gas US:NGV20 ended nearly unchanged at $1.834 per million British thermal units, down 0.05%."}]}