{"article": [{"url": "https://www.marketwatch.com/story/trumps-meeting-with-pharma-execs-called-off-as-analysts-say-his-moves-on-drug-prices-lack-bite-2020-07-28", "published": 1595938100.0, "headline": "Trump's meeting with pharma execs called off, as analysts say his moves on drug prices lack bite", "body": "Analysts are dismissing President Donald Trump's recent executive orders aiming to lower drug prices, as his meeting with major drug company executives was no longer set to happen on Tuesday as planned. \"Trump's executive orders on drug pricing are largely campaign fodder as each contains limitations or caveats, and is subject to further action,\" said Kim Monk, a Capital Alpha Partners analyst, in a note. Other analysts offered similar takes. \"The EOs are likely aimed at bolstering the president's support among voters on health-care policy and come without the necessary force to meaningfully change prices in the U.S.,\" wrote Hunter Hammond, a Height Capital Markets analyst. He also described the orders as \"largely toothless.\" The president's move with the orders \"yet again shows Trump is all bark, no bite on drug pricing. A louder bark doesn't make the bite any harder,\" said Chris Meekins, a Raymond James analyst, in a note. In unveiling the orders on Friday, the president said pharmaceutical industry execs \"will be at the White House on Tuesday, and they have some ideas how to significantly reduce drug prices.\" \"If these talks are successful, we may not need to implement the fourth executive order, which is a very tough order for them,\" added Trump, who is currently trailing Democratic challenger Joe Biden by 9 points in a RealClearPolitics average of national polls focused on November's presidential election. But the meeting was no longer scheduled to take place on Tuesday, and the pharmaceutical industry's main trade group has been criticizing Trump. \"An executive order to implement price controls from health systems abroad is a reckless & dangerous distraction from beating #COVID19,\" said a tweet on Monday from the Pharmaceutical Research and Manufacturers of America, also known as PhRMA. \"Our focus needs to be on fighting #COVID19, not policies that jeopardize innovation and threaten the hope of progress toward a vaccine.\" From the archives:Drugmakers' lobbying spending at 10-year high as Washington targets soaring prices And read:Pelosi's drug-pricing bill passes House, but pharma stocks are up as it's unlikely to become law Pharma stocks, as tracked by the Invesco Dynamic Pharmaceuticals ETF PJP, +0.30%, are higher by 1.6% so far this week after falling by 1.6% on Friday. They have gained 2% this year, while the broad S&P 500 index SPX, +0.87%  is up just 0.2% in 2020."}]}