{"article": [{"url": "https://www.marketwatch.com/story/my-mother-in-law-is-narcissistic-my-father-in-law-is-selfish-my-brother-in-law-is-amoral-how-do-we-protect-our-inheritance-2020-10-05", "published": 1602165080.0, "headline": "My mom gave $250K to my aunt to buy a home. My aunt has a mild intellectual disability and I'm afraid someone will take advantage of her", "body": "Dear Moneyist, My mom is divorced from my dad and received a substantial lump sum as a settlement. My dad was always the breadwinner and managed the majority of their finances, so my mom is not nearly as money-savvy. Three years ago, my mom helped her sister, who is single, purchase a home. The home was $350,000, and another $50,000 was spent on renovations. I was aware that my aunt contributed $100,000 to this purchase from the sale of her condo. My mom was covering the rest. The house was paid in full. What I did not know was that my mom put the entire house in my aunt's name. My aunt does have a will stating that upon her death the house will go to my mom (or her estate), and my mom is her power of attorney. My concern is that there is no guarantee that the house returns to my mom. That is, my aunt could easily change her will. Though I do not see my aunt doing this, she does have a mild intellectual disability, and I worry that someone could take advantage of her. My second concern is that this is a very large \"gift\" and my mom never paid taxes on it, further leaving her vulnerable. The Moneyist:My wife had a baby in June. She has $160,000 in student loans - and just asked for my 'blessing' to work part time I believe my mom should pay my aunt back her $100,000, plus interest/appreciation, and put the home in her own name. My mom can then put in her will that my aunt can live in this house until her death. I think this will provide a win-win situation for both, where my mom has the security that this home will go to her children as intended and my aunt has the security of liquid cash. My aunt will continue to pay the monthly HOA fee. Do you agree with this? Who should pay the yearly property taxes? I want what's fair and protects both my mom and her sister. Is this process as easy as filing a quitclaim deed to change ownership of the house? Will this also reverse the gift tax implications since she is taking the house back? Any and all advice you can provide is greatly appreciated! Concerned Daughter in Seattle The Moneyist: 'We bet on the wrong horse': I co-signed my nephew's $55K student loan: He has no degree and no job. What should we do? Dear Daughter in Seattle, You are a caring daughter and a compassionate niece. I agree that this could have been handled differently. Your mother could have maintained ownership of the house, and given your aunt a life estate or the legal right to live there for the rest of her life. But she too is a good sister. She chose to use some of the money she was awarded in the divorce and give your aunt full ownership. The Moneyist: My wife had a baby in June. She has $160,000 in student loans - and just asked for my 'blessing' to work part time There are, of course, alternative ways of handling this situation. Scott Haislet, a certified public accountant in Lafayette, Calif., suggests that your mother could give your aunt $100,000 or get a loan of $100,000 in order to redeem your aunt's interest in the property in return for your aunt conveying the property to your mom by deed. Yes, you could use a quitclaim. Your aunt and mother could make a contract as to what happens to the property (upon sale, death, etc.), trying to foresee all possible contingencies to avoid future controversies. Or: Your aunt adopts a binding trust arrangement (i.e., irrevocable trust) to accommodate your mother's interest or otherwise safeguard your mom's interest to avoid unintended consequences. “ 'Home ownership will, I suspect, make a great difference to your aunt's quality of life and, critically, how she feels about her own place in the world.' ” - The Moneyist State laws regarding property transfers are different all over the U.S. and, as such, gifting laws vary by each state, according to John Schultz, a CPA in Ontario, Calif. There may be property-tax ramifications. \"Here in the state of California, this transfer would/could cause a reassessment to the current market value, which could increase annual maintenance/ownership costs,\" he said. And the gift tax? \"The gift tax is the most misunderstood of all taxes,\" said Scott Hoppe, founder of Why Blu, a San Francisco accounting firm. \"Think of a gift as an early payment from your estate and in 2020 you're able to leave $11.58 million tax-free, so very few people are subject to the gift/estate tax. If you gift more than $15,000 you do have to file Form 709 with the IRS (double if married).\" The Moneyist:My mother-in-law is narcissistic. My father-in-law is selfish. My brother-in-law is amoral. How do we protect our inheritance? Homeownership will, I suspect, make a great difference to your aunt's quality of life and, critically, how she feels about her own place in the world. It makes a big difference to live in your own home instead of somebody else's. Ultimately, this is a good-news letter. Two people, you and your mom, are trying to do the right thing and support your family financially and emotionally. Brava to both of you. You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}