{"article": [{"url": "https://www.marketwatch.com/story/three-of-the-most-buzzworthy-moments-from-that-trump-laura-ingraham-interview-2020-09-01", "published": 1598967680.0, "headline": "Three of the most buzzworthy moments from that Trump-Laura Ingraham interview", "body": "This interview was a talker. President Donald Trump sat down with Fox News host Laura Ingraham in the White House on Monday night, and the hour-long Q&A took some unexpected turns that went viral on social media overnight. Among the moments drawing the most debate on Tuesday morning: The president compared police shooting unarmed Black suspects, such as a Kenosha, Wis. officer shooting Jacob Blake in the back seven times last week, to a golfer choking under pressure. Trump agreed that firing seven bullets into Blake in front of his children was extreme. “I mean, couldn’t you have done something different? Couldn’t you have wrestled him?” he asked. Yet he outraged many viewers by adding, “But they choke, just like in a golf tournament, they miss a 3-foot putt.” Ingraham cut him off, anticipating the blowback to the sound bite. “You’re not comparing it to golf, because that’s what the media would say,” she said. The president’s response? “No, I’m saying people choke, and people are bad people,” he said. “[Police officers] can do 10,000 great acts, which is what they do, and one bad apple — or a choker, you know, a choker, they choke — shooting the guy in the back many times.” Indeed, this drew a lot of backlash on Twitter TWTR, -0.23%, including from Senate Minority Leader Chuck Schumer, who noted, “You know things are bad when Laura Ingraham has to save President Trump from saying stupid things.” iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The president alleged that people in the “dark shadows” are controlling his Democratic rival Joe Biden. Ingraham asked Trump, “Who is pulling Biden’s strings?” He responded with, “People that you’ve never heard of, people that are in the dark shadows” are controlling his presidential opponent. “There are people that are on the streets, there are people that are controlling the streets,” he continued, but wouldn’t elaborate, because he said the situation is under investigation. “We had somebody get on a plane from a certain city this weekend. And in the plane, it was almost completely loaded with thugs, wearing these dark uniforms, black uniforms, with gear and this and that,” he continued. “A lot of the people were on the plane to do big damage.” Even Ingraham noted that “sounds like a conspiracy theory.” Indeed, NBC News reported that the claim about the flight matches a viral Facebook FB, +0.26% post from June 1 that falsely claimed, “At least a dozen males got off the plane in Boise from Seattle, dressed head to toe in black.” MSNBC political analyst Howard Fineman called these claims “truly nuts.” And CNN’s Daniel Dale said the “dark shadows” accusation was “almost too stupid fact-check.” iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Biden’s campaign responded in a statement posted to Twitter early Tuesday morning that read: “The President of the United States is bizarrely highlighting the unrest and division he has stoked, refusing to condemn violence committed by his own supporters. Donald Trump’s incomprehensible case for doing even more damage in a second term makes less and less sense every single day.” The president said the suburbs are in danger from Biden — and Black Democratic Sen. Cory Booker — expanding low-income housing. Ingraham also asked Trump how he plans to win over women voters who might view him as too aggressive, which led him to segue into explaining how he plans to make women feel safe again by pushing for law and order. That includes keeping the suburbs “safe” by blocking the expansion of low-income housing there. “They were trying to destroy the suburbs,” he said of the Democrats. “They want low-income housing, and with that comes a lot of other problems, including crime.” Ingraham cut him off once again, interjecting with, “You’re not saying poor people are criminals though.” The president responded, “No, I’m not saying that at all, but there is a level of violence that you don’t see.” He pointed to how he recently rescinded the Obama-era Affirmatively Furthering Fair Housing (AFFH) rule, which housing advocates have said was necessary to fight racial segregation and discrimination in housing, but which Trump claimed has raised crime and hurt housing prices in those neighborhoods. Critics have called out the racist overtones of equating low-income housing with crime and neighborhood decline. And some accused Trump of racism again on Tuesday, especially after he called out Booker — a Black senator — for supporting the low-income housing expansion. Trump said Monday that Democrats are trying to build “low-income housing projects right in the middle of your neighborhood,” and argued that if Biden gets elected president, “it’s gonna go at a much higher rate than ever before, and you know who’s gonna be in charge of it? Cory Booker.” iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Trump also called the Black Lives Matter movement a “Marxist organization,” and once again claimed to have done more for America’s Black community than any president in history, “except for maybe Abraham Lincoln.” Catch the full interview here."}]}