{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-covid-19-cases-climb-to-136-million-after-record-one-day-tally-of-230400-new-infections-2020-07-16", "published": 1594966700.0, "headline": "Coronavirus update: Global COVID-19 cases climb to 13.6 million after record one-day tally of 230,400 new infections", "body": "The number of confirmed cases of the coronavirus illness COVID-19 world-wide rose to 13.6 million on Thursday, after a record of about 230,400 new infections were counted on Wednesday, according to data aggregated by Johns Hopkins University. That was higher than the previous one-day record of roughly 229,000 counted last Friday, the data show. The U.S. recorded another 66,300 cases on Wednesday, just below the record of more than 67,000 cases reported on Tuesday. A full 43 states and territories have seen case numbers rise in the past 14 days, according to a New York Times tracker, showing Florida is the new hot spot in the U.S. Hospitals in parts of the South and West are straining to handle the case load. The cities of Houston, Miami and Phoenix are reporting dire shortages of intensive-care unit beds and staff. Public health experts and academics are astounded at the White House move to order hospitals to report COVID-19 data to the Department of Health and Human Services, instead of the Centers for Disease Control and Prevention, the nation’s premier public health agency. The decision is expected to make the data less transparent to the public and to researchers. See also:Trump’s pandemic response was hindered by missed opportunities, ignored warnings “‘... HHS and the White House broke a system that was working to put in a no-bid contract — contractor, inexperienced — to try to do something that is mission-critical to solve the pandemic,” said Tom Frieden, a former head of the CDC and now a senior fellow for global health at the Council on Foreign Relations. “Just when you think can’t get less organized or less functional, it does, in this country.” iframe.twitter-tweet { width: 100% !important; } There was further outrage about Georgia’s Gov. Brian Kemp ban on Georgia’s cities and counties from ordering people to wear masks in public places. Kemp voided orders on Wednesday that at least 15 local governments across the state had adopted, as the Associated Press reported. Georgia has lost 3,091 people to the pandemic so far, the Johns Hopkins data show. The ban comes as other states are moving in the opposite direction, ordering residents to cover their faces, including Alabama on Wednesday. Public health experts agree that wearing a face mask, washing hands frequently and socially distancing are vital measures to contain the spread. Retailers Walmart Inc. WMT, +1.00% and Kroger Co. KR, +0.46% have both said face masks are mandatory for shoppers in their stores. The National Retail Federation is recommending that all retailers follow their example. Savannah Mayor Van Johnson was the first local official to defy Kemp and order masks, and had said police would start writing $500 citations to businesses that didn’t enforce the law. Johnson called Kemp out by name on Twitter. iframe.twitter-tweet { width: 100% !important; } The Harvard Global Health Institute (HGHI) shot down a suggestion by CDC Director Robert Redfield earlier this week that COVID-19 cases in the South were being caused by people from the North vacationing there after Memorial Day weekend. Redfield said there was a pop in cases around June 12 to June 16 caused by vacationers driving down south. “This is not what the data say,” the HGHI said in a report. Infections in states including Nevada and Florida actually stared rising on June 1. “Remember that there is always a lag between when infections occur and when they begin to be diagnosed,” said the report. “This means that the increase in confirmed cases around June 1 comes from infections occurring around May 24, right around the Memorial Day weekend (and well before mid-June, as Dr. Redfield suggests.) So the data show that these outbreaks started before Northern vacationers supposedly traveled South.” The more likely explanation is that infections are spiking because states reopened far too early. “Virginia, on the other hand, remaine d in phase 1 of its reopening through the end of May and has fared significantly better than its neighbors,” said the report. The HGHI’s tracking tool is currently showing 11 states flashing red, led by Florida, which now has a seven-day average rate of 51.8 cases per 100,000 people. Harvard researchers say those states — the other 10 are Arizona, Louisiana, South Carolina, Alabama, Texas, Georgia, Nevada, Tennessee, Mississippi and Idaho —need to reimpose stay-at-home orders. How Coronavirus Spread Across the U.S. Latest tallies The number of confirmed deaths from COVID-19 climbed to 584,990, while the number of people who have recovered climbed to 7.6 million. The U.S. leads the world with 3.49 million cases and 137,420 deaths. Brazil is second to the U.S. with 1.97 million cases and 75,366 deaths. India is third measured by cases at 968,876 followed by Russia with 751,612 and Peru with 337,751. The U.K. has 45,138 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 85,247 cases and 4,644 fatalities. Read also: Russia accused by U.S., Britain, Canada of hacking coronavirus vaccine trialsWhat’s the latest medical news? Johnson & Johnson CFO Joseph Wolk told CNBC that the company expects the Phase 1 trial for its COVID-19 vaccine candidate to begin next week. Wolk said the Phase 1 trial is expected to enroll more than 1,000 participants, primarily between the ages of 18 and 55 years old, although the company also plans to include a group of people who are 65 years old or older in the early-stage trial. He also said that J&J is in talks with the National Institutes of Health to move up the timeline for the anticipated Phase 3 trial to late September. “The science still has to play out,” Wolk said. Dynavax Technologies Corp. DVAX, -3.68% announced that it will work with the Icahn School of Medicine at the Mount Sinai Hospital system in New York on a universal influenza vaccine. Mount Sinai has received funding from the National Institute of Allergy and Infectious Diseases to develop a vaccine and aims to use Dynavax’s adjuvant technology to support that process. A universal flu vaccine would get rid of the need for annual flu vaccination, the organizations said in a news release. See also: This new study shows how well a coronavirus vaccine must work before we can stop social distancingWhat’s the economy saying? The number of Americans applying for jobless benefits fell slightly in the second week of July to a post-pandemic low of 1.30 million, but the grudgingly small decline points to ongoing stress in the labor market as the economy struggles to cope with the latest coronavirus outbreak, MarketWatch’s Jeffry Bartash and Greg Robb reported. New applications for unemployment compensation, a rough gauge of layoffs, fell 10,000 in the seven days ended July 11 to 1.30 million from a revised 1.31 million in the prior week, the Labor Department said Thursday. The figures are seasonally adjusted. Economists polled by MarketWatch had forecast 1.24 million new claims. These figures reflect applications filed the traditional way through state unemployment offices. An unadjusted 928,488 people also applied for benefits through a temporary federal-relief program. Initial jobless benefit claims have stalled since mid-June when they hit 1.57 million. An economic rebound in May and June has lost momentum in July amid a fresh wave of coronavirus cases that has forced many states to either reimpose partial lockdowns or pause reopening plans. The latest setback is expected to put more people out of work again and delay the return of others to their jobs, making it harder for the economy to recover. Economists say Washington has to extend emergency unemployment benefits and increase other aid to prevent the situation from getting worse. “The trend in initial jobless claims has now just about stopped falling; next week could easily see an increase, for the first time since March, in the wake of the continued gradual reimposition of restrictions across the South and parts of the West,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics. Separately, sales at U.S. retailers posted a big increase in June for the second month in a row, but that trend too may be sapped by the rise in new cases. Retail sales climbed 7.5% last month following a record 18.2% increase in May, the government said Thursday. Economists polled by MarketWatch had forecast a 5.4% increase. “Retail sales may have had a strong showing for June, but that’s old news given how quickly the coronavirus resurgence is beating up the economy,” said Robert Frick, corporate economist at Navy Federal Credit Union.What are companies saying? Morgan Stanley and Bank of America were the latest big banks to post earnings and they showed the same trend as other banks of strong trading and investment banking fees, offset by the need to set aside huge provisions for potential loan losses. Banks are warnings that they may be facing a wave of defaults as companies struggle in the pandemic. There was more upbeat news from Domino’s Pizza, which has been thriving during lockdown periods and as consumer eat at home more. Johnson & Johnson beat profit and sales estimates for its latest quarter, amid strong demand for drugs. Cowen downgraded Walt Disney Co.’s DIS, +1.53% stock on concerns that its parks and film business will be disrupted for longer than investors anticipate, and Citi reiterated a sell rating on Tesla Inc. TSLA, +1.89%, after its massive year-to-date rally, which has come even as its main plant in Fremont, California was shut down for much of the last quarter. “What hasn’t changed, in our view, is the lack of evidence to support the recent narrative in the stock-namely that Tesla is already experiencing seemingly ‘unlimited’ demand that’s decoupled from autos, that traditional & emerging competitors stand little chance, that FSD/AV [fully self-driving technology] is industry leading and that Tesla should be valued vs. large Tech names,” analyst Itay Michaeli wrote in a note to clients. “It is tough to fight the momentum, but it’s even tougher to construct a fundamental risk/reward framework that makes sense here (particularly with COVID-19 risks), even if one is constructive on Tesla the company.” Elsewhere, companies offered updated guidance and outlined ways they are managing liquidity in the pandemic, among other issues. MMM, +0.94% Here’s the latest news about companies and COVID-19: • 3M Co. MMM, +0.94% , the maker of Post-it Notes and industrial products, has filed 18 lawsuits and shut down thousands of deceptive websites and social media posts as it moves to prevent COVID-19 fraud and profiteering. The company is working with law enforcement agencies to help protect the public against those parties who are exploiting the strong demand for its products, which include N95 masks and other equipment. “The schemes we shut down were not only unlawful, they also endangered lives and wasted precious time and resources by diverting buyers from legitimate sources of much-needed respirators,” Denise Rutherford, senior vice president of corporate affairs said in a statement. 3M has created hotlines and websites for consumers to report suspected fraud and has published pricing information for N95 masks to help them avoid inflated prices. The company has won 6 temporary restraining orders and 4 preliminary injunction orders from courts that halted unlawful actions, said the statement. • Abbott Laboratories ABT, +1.02% reported second-quarter profit and revenue that beat expectations and provided an upbeat full-year outlook. For 2020, the company expects adjusted EPS of “at least” $3.25, above the FactSet consensus of $2.90. “We’re a leader in the global COVID-19 testing efforts, we’ve continued to advance our pipeline and, importantly, we saw significant improvements in growth trends throughout the quarter in the business areas that were initially most impacted by the pandemic,” said Chief Executive Robert Ford. • Alcoa Corp. AA, -1.65% reported a narrower second-quarter loss and sales were slightly ahead of expectations. The company made progress on its continuing asset review in preparation for potential sales and cost-cutting goals related to the pandemic. It increased its liquidity after completing the sale of $750 million worth of bonds on Monday, at a 5.5% coupon rate that was lower than any of its previous debt issuance. “Despite challenging market conditions, our team has lowered production costs, increased output, maintained stable shipments, and improved our balance sheet,” Chief Executive Roy Harvey said in a statement. “We continued to make progress in executing our strategic actions and 2020 programs, and we finished the quarter with a cash balance of nearly one billion dollars.” • American Airlines Group Inc. AAL, +0.34% sent notices to 25,000 workers -- about one-fifth of its workforce -- about potential furloughs as the airline copes with what it calls slackening demand for air travel during the pandemic. American, which is prohibited from slashing jobs or pay rates through Sept. 30 under terms of $25 billion in federal payroll support, also urged employees to take buyout and early retirement packages before being forced to cut their jobs. The airline, which reported an 80% plunge in June revenue, says it will be overstaffed by 20,000 when federal aid expires Oct. 1. • Separately, American Airlines Group Inc. and JetBlue Airways Corp. JBLU, -0.07% announced a partnership aimed at creating more options for travelers in the Northeast U.S., to give the more choices across the airlines’ domestic and international routes. The partnership includes an agreement that proposes code-share and loyalty benefits for flight offerings in New York and Boston. The partnership will allow American to launch service from New York’s JFK airport to Tel Aviv and to Athens, and the JFK to Rio de Janeiro flight will return as a daily route in winter 2021, and will allow JetBlue to add flights in New York’s LaGuardia Airport and New Jersey’s Newark airport and grow its presence at JFK. • Bank of America Corp. BAC, +0.47% posted net income of $3.5 billion, or 37 cents a share, in the second quarter, down from $7.3 billion, or 74 cents a share, in the year-earlier period. The number was weighed down by a $4 billion build in loan loss provisions during the coronavirus pandemic. Revenue fell to $22.3 billion from $23.1 billion. The FactSet consensus was for EPS of 28 cents and revenue of $21.8 billion. “Strong capital markets results provided an important counterbalance to the COVID-19-related impacts on our consumer business,” Chief Executive Brian Moynihan said in a statement. Net interest income fell 11% to $10.8 billion, driven by lower interest rates. Noninterest income rose 5% to $11.5 billion, buoyed by strong capital markets results. Sales and trading revenue rose 28% to $4.2 billion, as FICC (fixed income, currencies and commodities) revenue climbed 50% to $4.2 billion and equities revenue rose 7% to $1.2 billion. Investment banking fees rose 57% to a record $2.2 billion, amid record capital raising by companies seeking to bolster liquidity during the pandemic. • Charles Schwab Corp. SCHW, +1.29% reported a second-quarter profit that topped expectations but revenue that fell why, as the pandemic created a “myriad challenges” for its clients. Total client assets as of the end of June were $4.11 trillion, up 11% from a year ago. “We grappled with the ongoing health crisis, a contracting U.S. economy, and sustained pressures on interest rates, yet there were some encouraging signs as the quarter progressed, including domestic equity markets recovering to pre-pandemic levels,” said Chief Executive Walt Bettinger. • Domino’s Pizza Inc. DPZ, -2.50% reported second-quarter earnings and revenue that far exceeded expectations during the pandemic. U.S. same-store sales grew 16.1%, and international same-store sales rose 1.3%. The FactSet consensus was for domestic growth of 11.9% and a global rise of 0.7%. As of June 14, Domino’s had $248 million in cash and equivalents and $4.17 billion in total debt. The company borrowed $158 million under its variable funding notes during the quarter “as a precautionary measure.” • Bankrupt department store retailer J.C. Penney Co. Inc. JCPNQ, -3.42% announced a company restructuring that includes 152 store closures and a head count reduction of 1,000 workers across corporate roles, management and internationally. J.C. Penney filed for bankruptcy protection in May after which Cowen analysts forecast the company would have to shutter 25% of its locations. J.C. Penney has 90,000 employees, according to FactSet and, as of February 2020, had 850 locations in the U.S. and Puerto Rico. • J.Jill Inc. JILL, +6.45% reached an agreement with lenders to extend a forbearance period to July 23 to give the company more time to complete negotiations. “We are making progress with the negotiations and expect a resolution soon,” Interim Chief Executive Jim Scully said in a statement. The Quincy, Mass.-based women’s clothing retailer entered the forbearance agreements in June after falling out of compliance with certain covenants on its asset-based lending facility and term loans during pandemic. “The uncertainty created by recent events generate scenarios that raise substantial doubt about our ability to continue as a going concern within one year after the date the financial statements are issued,” the company said in its 10k filing published in June. • Johnson & Johnson JNJ, +1.39% reported second-quarter profit and sales that beat expectations, and raised its full-year outlook. Consumer health sales fell 7.0% to miss expectations, while pharmaceutical sales grew 2.1% to slightly top expectations and medical device sales dropped 33.9% but was above expectations. “Our second quarter results reflect the impact of COVID-19 and the enduring strength of our pharmaceutical business, where we saw continued growth even in this environment,” said Chief Executive Alex Gorsky. The company raised its 2020 guidance ranges for adjusted EPS to $7.75 to $7.95 from $7.50 to $7.90 and for sales to $79.9 billion to $81.4 billion from $77.5 billion to $80.5 billion • Morgan Stanley MS, -0.34% reported a second-quarter profit that rose above expectations, amid strength in the trading and investment banking businesses. Net income increased to $3.20 billion, or $1.96 a share, from $2.20 billion, or $1.23 a share, in the year-ago period. The FactSet consensus for earnings per share was $1.12. Revenue 30.9% to $13.41 billion. Noninterest revenue grew 28% to $11.81 billion, to beat the FactSet consensus of $9.36 billion and net interest income rose 31% to $1.60 billion to top expectations of $985.2 million. Within noninterest revenue, trading revenue soared 71% to $4.68 billion and investment banking revenue jumped 35% to $2.14 billion. “The second quarter tested the model and we performed exceedingly well, delivering record results,” said Chief Executive James Gorman. “This builds on the momentum of a very strong first quarter, while more than 90% of our employees continue to work from home, demonstrating the ongoing operational resilience of our platform.” • Norwegian Cruise Line Holdings Ltd. NCLH, +2.91% is offering $250 million of stock in a syndicated deal. J.P. Morgan, Citigroup, Goldman Sachs, Barclays, Mizuho Securities and UBS are joint book-runners on the deal. Proceeds will be used for general corporate purposes. Cruise operators have been hit hard by the coronavirus pandemic, which has halted all sailings due to the high risk of passengers becoming infected in close quarters. • Penske Automotive Group Inc. PAG, -0.37% preannounced expectations of a surprise second-quarter profit, citing a “significant improvement” in operations during June. Based on the performance of its U.S. and U.K. retail automotive dealerships and its used vehicle supercenter, Penske expects to report EPS of 52 cents to 57 cents, which compares with the FactSet consensus for a loss of 16 cents a share. All of its U.S. retail automotive dealerships are open after closing during the pandemic. Strong sales of used units in June led to combined U.S. and U.K. operations generating a profit that was more than double that of the period last year. “Our performance in June is the result of a strong operational focus to control costs, manage vehicle inventory, and maximize gross profit,” said Chief Executive Rob Penske. • Sleep Number Corp. SNBR, +2.41% reported a steep drop in second-quarter revenue caused in large part by the pandemic. The mattress company’s revenue tumbled 20% to $284.9 million from $356 million a year ago. Analysts surveyed by FactSet had expected sales of $251 million. Additional reporting by Tim Rostan and Jaimy Lee"}]}