{"article": [{"url": "https://www.marketwatch.com/story/republicans-and-democrats-both-want-another-round-of-stimulus-checks-but-heres-where-they-disagree-2020-07-27", "published": 1596519380.0, "headline": "Republicans and Democrats both want another round of stimulus checks â\u0080\u0094 hereâ\u0080\u0099s where they disagree", "body": "Stimulus checks 2.0 mean two different things under the approximately $1 trillion Republican bill and Democratsâ\u0080\u0099 $3 trillion bill, underscoring the divides on what each party thinks the country needs â\u0080\u0094 and what it supposedly can afford to pay â\u0080\u0094 as the coronavirus pandemic continues. “ This round of checks provides â\u0080\u0098even more support for families who care for vulnerable adult dependents.â\u0080\u0099 ” â\u0080\u0094 Senate Majority Leader Mitch McConnell This time around, Republicans are proposing the same check amounts and using the same income-eligibility rules as the CARES Act. They also want to broaden who counts as a dependent resulting in a $500 payout: This round of checks would provide â\u0080\u009ceven more support for families who care for vulnerable adult dependents,â\u0080\u009d Senate Majority Leader Mitch McConnell, a Kentucky Republican, said last week on the Senate floor. Democrats also want to apply the same income ranges as before, but have called for an even more generous $1,200 payout for dependents. They also want to relax the eligibility rules in order to send stimulus checks to non-citizens with an IRS-issued taxpayer number. The GOP proposal released Monday also called for slimmer 70% wage replacement in supplemental unemployment benefits and legal liability shields, among other things. The legislation is titled the HEALS Act, which stands for the Health, Economic Assistance, Liability Protection and Schools Act. “ The income-eligibility range rules are the same in both the GOP and Democratic bills. ” Democrats are rallying behind the HEROES Act, which passed the Democrat-controlled House of Representatives in May and calls for direct checks and a continuation of $600 supplemental unemployment benefits through next January. The initial $2.2 trillion stimulus bill in March earmarked $290 billion for direct checks, sending $1,200 checks to adults and $500 to households for each dependent under age 17. A person making under $75,000 received the full $1,200 economic impact payment under the CARES Act, while a married couple filing jointly that made $150,000 or less received $2,400. Payment amounts gradually declined and expired for individuals with adjusted gross income above $99,000 and couples making above $198,000. The same income ceilings apply in both the Republican and Democratic bills. The Internal Revenue Service has distributed roughly 160 million payments, totaling approximately $270 billion, Charles Rettig, the agencyâ\u0080\u0099s commissioner, said last month.The two plans pay different amounts for dependents The newly unveiled Republican plan pays $500 for dependents of any age, according to Sen. Chuck Grassleyâ\u0080\u0099s office. The broadened dependent definition brings in â\u0080\u009csome people we didnâ\u0080\u0099t intend to leave out last time, but we did,â\u0080\u009d Grassley, a Republican from Iowa, said. â\u0080\u009cSo, regardless of age, some of these dependents will now be helped.â\u0080\u009d The HEROES Act seeks a $1,200 payment per dependent. Direct checks under the bill would pay for a maximum of three dependents. That means a household could receive up to $6,000: a married couple ($2,400) plus three dependents ($3,600). Like the HEALS Act, the HEROES Act widens the scope of who counts as a dependent. A full-time student up to age 24 counts as a dependent under the bill, as does an adult dependent. The average stimulus-check size was $1,729 under the CARES Act and could be $2,170 under the HEROES Act, according to projections from Kyle Pomerleau, a resident fellow at the American Enterprise Institute, a right-leaning think tank. He didnâ\u0080\u0099t have immediate projections on the HEALS Act, but predicted it wouldnâ\u0080\u0099t bump up the average stimulus-check amount all that much. In both the Republican and Democratic bills, the IRS would look at 2019 income-tax returns to determine income eligibility, or 2018 returns if 2019 returns arenâ\u0080\u0099t available. â\u0080\u009cTo me, it makes a lot of sense to go with a framework there that already exists,â\u0080\u009d Pomerleau said. Donâ\u0080\u0099t miss:This is how fast Americans are spending their stimulus checks â\u0080\u0094 and hereâ\u0080\u0099s a breakdown of what theyâ\u0080\u0099re buying The HEROES Act forbids debt collectors from garnishing the payment and blocks the IRS from offsetting a stimulus check to pay down past-due child support. The HEALS Act also protects stimulus checks from garnishment, but doesnâ\u0080\u0099t block offsets for owed child support. The HEALS Act contains specific language stating that anyone who died before Jan. 1, 2020 wonâ\u0080\u0099t be getting a stimulus check, nor will anyone who is in prison at the time the IRS processes payment. During the first payment round, the government sent 1.1 million stimulus checks to dead people, totaling more than $1 billion, according to one watchdog report. Differing approaches immigration status and stimulus check eligibility The March stimulus act didnâ\u0080\u0099t allow checks for people with IRS-issued individual taxpayer identification numbers (ITINs). Undocumented immigrants and certain people who are lawfully present in the country can obtain ITINs in order to pay taxes, according to the American Immigration Council, an immigration advocacy group. The CARES act also barred people with Social Security numbers from collecting stimulus checks if they married and filed jointly with an ITIN holder. Several pending lawsuits are challenging that rule. An estimated 4.3 million people pay taxes using an ITIN, according to one of those cases. ITIN holders would receive a stimulus check under the HEROES act. The HEALS act wouldnâ\u0080\u0099t send stimulus checks to ITIN holders, according to Allen Orr, president-elect of the American Immigration Lawyers Association. The GOP proposal also didnâ\u0080\u0099t address stimulus check scenarios when someone with a Social Security number married an ITIN holder, Orr said. Green Card holders, in addition to citizens, can have Social Security numbers, he noted. â\u0080\u009cThere was no additional relief given to those people who are excludedâ\u0080\u009d in the CARES act, Orr said. So when could the next round of stimulus checks arrive? The second round of economic impact payments could start rolling out in August if lawmakers quickly pass another relief package, Treasury Secretary Steven Mnuchin said. The HEALS Act, at least when it comes to stimulus checks, is â\u0080\u009cabout as close as you could get [to an agreement] and shows that the one area of bipartisan support is another round of checks to support the economy,â\u0080\u009d said Ed Mills, a Washington policy analyst at Raymond James. The GOPâ\u0080\u0099s expanded definition of a dependent could make stimulus checks alone cost the government $300 billion, he said. â\u0080\u009cTo have $1,200 being proposed by Senate Republicans, matching the $1,200 given out under the CARES Act, is a significant increase over what Mitch McConnell was speaking about as recently as a week ago,â\u0080\u009d he said. Mills said lawmakers could reach a deal by the first week of August, but consumers shouldnâ\u0080\u0099t be banking yet on $1,200. There could be a scenario in which stimulus-check amounts decrease and unemployment payments increase, he said. â\u0080\u009cThat, I think, is not yet set in stone,â\u0080\u009d Mills said."}]}