{"article": [{"url": "https://www.marketwatch.com/story/self-employed-and-considering-a-ppp-loan-theres-good-news-for-you-2020-06-19", "published": 1594641440.0, "headline": "Self-employed and considering a PPP loan? Thereâ\u0080\u0099s good news for you", "body": "The rules for SBA-supervised Paycheck Protection Program (PPP) loans authorized by the Coronavirus Aid, Relief, and Economic Security Act (CARES Act) have been a moving target. If you took out a PPP loan for your small business, or if your employer has tasked you with keeping up with PPP loan developments, you know what I mean. As this was written, the target was still moving. Fortunately, it was moving in the right direction, in Tax Guyâ\u0080\u0099s opinion. Here I cover some key PPP loan facts that were known to be true during the microseconds it took to write this. Things could be completely different by the time you read this. Just kidding. Sort of. Anyway, onward. New law eases PPP loan forgiveness rules The Paycheck Protection Program Flexibility Act of 2020 (PPPFA) became law on June 5, which seems like a long time ago. The new law makes it much easier for many PPP borrowers to do what it takes to have all or part of their loans forgiven. The PPPFA also allows borrowers to take advantage of the CARES Act payroll tax deferral privilege (see the sidebar below for more info), even if their loans are forgiven. Good. According to the original CARES Act rules for PPP loans, no forgiveness was allowed unless the borrower spent at least 75% of loan proceeds on payroll expenses. The PPPFA lowers the threshold to 60%. The PPPFA also gives borrowers up to 24 weeks to use PPP loan proceeds for purposes that will result in loan forgiveness, versus only eight weeks under the original CARES Act rules. However, if you received your loan before the June 5 enactment date of the PPPFA, you can choose to follow the old eight-week rule and apply for loan forgiveness after only eight weeks. Regardless of when you receive your loan, you can now choose to follow the new 24-month rule. The PPPFA also extends the employee rehiring deadline from 6/30/20 to 12/31/20. Businesses were unhappy with the CARES Act rule that employees had to be rehired by 6/30/20 for their salaries to count towards PPP loan forgiveness. The PPPFA favorably addresses that concern. Under a new exception granted by the PPPFA, an employer can still qualify for PPP loan forgiveness, based on otherwise-insufficient payroll expenditures, if the employer can demonstrate that: (1) suitably-qualified replacement employees could not be hired by 12/31/20 or (2) the employer was unable to return to the pre-2/15/20 level of business activity. Finally, thanks to the PPPFA, borrowers now have up to five years to repay PPP loans that are not forgiven, versus only 24 months under the original CARES Act rules. This favorable change automatically applies to loans made on or after 6/5/20. For earlier loans, borrowers and lenders can modify the loan terms to allow the five-year repayment deal. Key Point: The latest SBA guidance says borrowers can qualify for partial loan forgiveness even if they spend less than 60% of their loan proceeds to cover payroll expenses. Previously, we were given to understand that you had to spend at least 60% on payroll expenses to qualify for any forgiveness at all. So, this is very good news.SBA issues new forms to apply for loan forgiveness The SBA just released a new-and-improved loan forgiveness application form (SBA Form 3508) that reflects the favorable PPPFA changes explained above. See here. The earlier pre-PPPFA version of the form was widely criticized. Figuring out how to make the necessary calculations and properly fill out the old version would have challenged the skills of the nationâ\u0080\u0099s best CPAs and attorneys. So, we are making progress. More progress: eligible borrowers can now use a simplified form to apply for loan forgiveness (SBA Form 3508EZ). See here.Clarity for self-employed borrowers After much confusion, itâ\u0080\u0099s now clear that self-employed individuals who have no employees, and therefore no actual payroll expenses, can qualify for PPP loan forgiveness by simply paying themselves so-called owner compensation replacement. The amount that can be forgiven is based on your 2019 net self-employment income and can be up to 100% of the loan amount. However, the maximum loan amount for a self-employed person with no employees is $20,833. Advice: It will be much easier to prove that you paid yourself owner compensation replacement if you maintain a separate business checking account to gather your business income and disburse it to your personal checking account. If you only have one account thatâ\u0080\u0099s used for both business and personal transactions, things are not so clear. Since the SBA has so far struggled to execute its task of supervising PPP loans, and since the SBA must approve all loan forgiveness applications, you are well-advised to make things very easy for the SBA to understand. That will make it easier for the SBA to approve your righteous application for loan forgiveness. Fingers crossed.IRS says no deductions for expenses paid with proceeds from forgiven PPP loans (but stay tuned) Moving right along, the IRS has opined that you cannot deduct expenses paid with proceeds from a PPP loan thatâ\u0080\u0099s forgiven. This conclusion relies on Internal Revenue Code Section 265, which states that federal income tax deductions are not allowed for expenses relating to tax-exempt income. Because forgiveness of a PPP loan is a federal-income-tax-free event, the IRS has taken the highly debatable position that Section 265 applies. Therefore, no deductions are allowed, according to the IRS. Reportedly, more than a few members of Congress are very unhappy with that position, because they feel itâ\u0080\u0099s contrary to what they intended when they authorized the PPP. Prediction: Future legislation will allow you to claim federal income tax deductions for expenses covered with proceeds from your forgiven PPP loan. Stay tuned. Should you be afraid to take out a PPP loan? Valid question, but I think not. Youâ\u0080\u0099ve probably seen reports about business owners who have either already paid back PPP loans or been afraid to take them out in the first place. Why? Because the rules are constantly changing and hopelessly confusing. Borrowers are rightfully concerned that they may have committed a foot fault somewhere in the loan application process and will be caught, forced to pay back their loans, and maybe penalized to boot. Potential borrowers have the same fear. I say fear not. When all is said and done, PPP borrowers wonâ\u0080\u0099t be taken to the gallows for committing foot faults. Sooner or later, the SBA bureaucrats and rules writers will get that message â\u0080\u0094 after whatever gentle persuasion is required from Congress, the Treasury Department and the White House to make it so. Bet me if you think Iâ\u0080\u0099m wrong. Iâ\u0080\u0099ll take that bet. How much are you willing to lose? Key Point: All that said, I think applications to forgive PPP loans of $2 million or more will face lots more scrutiny. If your loan is that big, be ready for some resistance. Sidebar: Employers can defer some federal payroll taxes Thanks to a CARES Act provision, an employer can defer the employerâ\u0080\u0099s 6.2% share of the Social Security tax component of FICA tax owed on the first $137,700 of an employeeâ\u0080\u0099s 2020 wages. The deferral privilege applies to payroll tax deposits and payments that would otherwise be due during the deferral period. The deferral period began on the 3/27/20 and will end on 12/31/20. This payroll tax deferral privilege is available to all employers (small and large) for eligible payroll taxes on wages paid to all employees. Thereâ\u0080\u0099s no requirement to show that your business has been adversely affected by the COVID-19 crisis. Your business must then pay in the deferred payroll tax amount in two installments. * 50% by 12/31/21. Wow. That date is not a misprint. * The remaining 50% by 12/31/22. Nice.That date is also not a misprint.Self-employed individuals can defer some self-employment tax Sole proprietors, owners of single-member LLCs who are treated as sole proprietors for tax purposes, partners, and LLC members who are treated as partners for tax purposes are generally classified as self-employed individuals. As such, you can defer half of your liability for the 12.4% Social Security tax component of the self-employment (SE) tax for the deferral period, which began on 3/27/20 and will end on 12/31/20. The Social Security component of the SE tax hits the first $137,700 of your 2020 net SE income. You must pay in the deferred SE tax amount in two installments. * 50% by 12/31/21. * The remaining 50% by 12/31/22. Bottom line: Whatâ\u0080\u0099s not to like about these tax deferral deals? Nothing. Please take advantage!"}]}