{"article": [{"url": "https://www.marketwatch.com/story/why-your-first-five-years-of-retirement-are-critical-2020-06-22", "published": 1593876620.0, "headline": "Why your first five years of retirement are critical", "body": "If you’re a glass half full person, here’s some good news: About half of retirees are able to maintain their spending levels—in other words, their lifestyles—during their first five years of retirement. On the other hand, half aren’t. That’s according to a study by the federal government’s Consumer Financial Protection Bureau (CFPB), which looked at retiree spending habits over a 22-year period ending in 2014. Obviously, retirees are like snowflakes: no two are alike. Yet the study says most tend to have one important thing in common: They usually spend more in their first five years of retirement than at other times, and then it begins to decline. For example, if you’ve dreamed of traveling the world, checking things off from your bucket list and so forth, you’re more likely to do so in the early stages of your golden years than the latter ones, when you may be slowing down. And it’s not just splurging in Italy or taking the grandchildren to Disney World. The CFPB cites an external study by the Employee Benefit Research Institute, which notes that retirees also tend to buy fewer clothes, fewer home furnishings and other things as time goes by. Read: I want to retire to a rural location with four seasons that gets me out of New York state — so where should I go? But there’s something else you need to know about why spending declines after a few years, and it’s important. More on that below. Naturally, being able to maintain spending is easier for some than others. The CFPB report says that 27% of retirees were able to spend based solely on income from pensions, Social Security, annuities and other sources of income. Another 24% wear able to so by dipping into savings and selling off investments, in addition to the above things. But remember: if you dip too deeply into these things—your principal—it raises the chances of you running out of money later on. There’s a common rule of thumb that you should never take more than 4% of your principal a year, but this is something you should discuss with a trusted financial adviser. So the first five years are telling, and can reveal how the rest of your life, financially, is likely to go. Perhaps you’ve heard that a sound retirement is best compared with a three-legged stool: One leg is a pension, one is Social Security, and the third is personal savings. But the stool has gotten wobblier over the years. Fewer companies have defined pension plans than ever before, shifting responsibility to employees to save through 401(k), IRA and other plans. But tens of millions of Americans, for a variety of reasons, haven’t saved much, if anything: Nearly 70% have less than $1,000 stashed away, according to a 2019 survey by GOBanking rates. Countless other studies say pretty much the same. Read: My retirement income is $95,000 a year, and I want a walkable, affordable beach town to spend the winter. Where should I retire? This leaves Social Security, which was never meant to be a primary source of income, yet for millions, that’s exactly what it is. According to the Social Security Administration, “50% of married couples and 70% of unmarried persons receive 50% or more of their income from Social Security.” Even worse: “21% of married couples and about 45% of unmarried persons rely on Social Security for 90% or more of their income.” If you’re already in retirement, you know where you stand. If you only have one or one-and-a-half of those legs of the stool, chances are you’re still working (or trying to in this economy), and chances are you’ve downgraded your standard of living. It very well could be that Social Security is just about all you’ve got. However, for younger workers, perhaps 10 to 15 years away from retiring, the CFPB study offers data that could help strengthen your finances as your career winds down. It showed that homeowners (59%) are more likely to be able to maintain spending in retirement than renters (30%). And not surprisingly, homeowners who paid off their mortgages before retiring were in even better shape. Think about that: No monthly payment to anyone. If this isn’t you, you might want to consider the cost advantages of downsizing. If you’re still working and can’t relocate, can you at least find something smaller and/or cheaper? I recognize that this may be difficult, and perhaps painful, but if it helps you get a better grip of your finances, it may be worth considering. And here’s a no-brainer: Stay out of nonmortgage debt. It’s awfully hard to live well in retirement if you’re saddled with car loans, credit card or even student loans—yes, some retirees still have student loans. Get this stuff off your books as fast as you reasonably can. Focus on paying off whatever has the highest interest rate first. Finally, remember how I said there’s something else you need to know about why spending declines after a few years? Many people, forced into a corner financially, have no other choice. The CFPB found that retirees who couldn’t maintain their standard of living wound up slashing spending by 28% over their first five years in retirement. Of that number, 17% cut spending by more than half. This is sobering data. Nobody wants to cut their spending—their lifestyle—by half. But if retirement is still on the horizon for you, consider taking steps now to bolster your situation—before you’re forced to later. Now my question (s) of the month: If you are eyeing retirement what are you doing now to strengthen your finances? And if you are already in retirement, have you been forced to make any changes? Tell me your stories. Write to me—Paul Brandus—at RetireBetterMarketWatch@gmail.com. Thanks and I hope you’re staying safe this summer."}]}