{"article": [{"url": "https://www.marketwatch.com/story/gold-surges-anew-heading-back-towards-2000-an-ounce-2020-07-31", "published": 1596208580.0, "headline": "Gold reclaims perch at record, notches best monthly gain in 8 years", "body": "Gold prices settled sharply higher Friday, shaking off its first losing day in 10 sessions on Thursday as investors, wary of growing economic troubles around the globe, sought exposure to the perceived safe-haven asset. December gold GCZ20, +2.17% GC00, +2.17%, which is now the most-active contract, climbed $19.10, or 1%, to close at $1,985.90 an ounce. For the week, bullion climbed 4.7%, while the 10.3% gain in July marked the best monthly rise since February of 2016, according to FactSet data. August gold US:GCQ20 climbed by $19.10, or 1%, to $1,985.90 an ounce, after dropping $11.10 to settle at $1,942.30 an ounce on Thursday. Gold settled at a record on Wednesday, marking its ninth-straight advance, which was its longest win streak since a 10-session climb ended in January. September silver US:SIU20 rose 85.4 cents, or 3.7%, at $24.216 an ounce, following a nearly 4% drop on Thursday. Prices for silver settled on Monday at the highest since 2013. For the week, silver declined 1.2%, with a monthly return of nearly 30% based on the most-active settlements. Those gains came even as U.S. stocks have seen mixed action on Friday but a mostly higher gain for stocks over the week and month. Friday’s moves for equities also followed late-Thursday quarterly reports from Apple AAPL, +1.74% and Amazon AMZN, +3.01% beat analysts’ expectations, while Facebook FB, +0.26% and Google parent Alphabet GOOGL, +1.82% posted solid, if less jaw-dropping, results. “Clearly investors aren’t feeling completely comfortable…as evidenced by gold’s latest shunt higher. The safe haven commodity is now achingly close to hitting $2000 per ounce for the first time, reflecting the market’s underlying anxiety despite Friday’s surface level green hue,” said Connor Campbell, financial analyst at Spreadex. Read:Gold has ‘no role’ in portfolio of wealthy clients, says Goldman manager Even though gold didn’t gain on it, troubling U.S. data released on Thursday showed persistently high worker layoffs and a record-breaking 32.9% drop in gross domestic product in the second quarter. Spain, Italy and France suffered double-digit percentage gross domestic product drops in for the second quarter, data showed on Friday. Some analysts believe gold prices could be entering a period of consolidation after a historic surge prompted at least in part by the public-health crisis, alongside a recent bout of weakness in the U.S. dollar, and the low yields being offered by government debt. Analysts said gold also has been buoyed by a slump in the dollar, with the ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against six major rivals, dropping to a more-than-two-year low this week and tumbling more than 4% in July, on track for its biggest monthly decline since September 2010, according to FactSet. The index caught a modest bounce Friday, rising 0.3%. A weaker dollar can support commodities priced in the unit, making them cheaper to users of other currencies. Elsewhere on Comex, September copper US:HGU20 fell by 4.6 cents, or 1.6%, to $2.868 a pound, with a weekly declined of 1% and a monthly advance of 5.1%. October platinum PLV20, +3.99% picked up 0.7% to settle at $918.90 an ounce and September palladium US:PAU20 shed 0.5% to end Friday trade at $2,145.30 an ounce. For the week, platinum dropped 4.3% with a monthly rise of 8%; while palladium declined 9% for the week and notched a monthly gain of 9.1%. — Myra P. Saefong contributed to this article"}]}