{"article": [{"url": "https://www.marketwatch.com/story/an-autoimmune-like-antibody-response-is-linked-with-severe-covid-19-11602186332", "published": 1602172400.0, "headline": "An autoimmune-like antibody response is linked with severe COVID-19", "body": "AFP via Getty Images In the earliest days of the pandemic, many immunologists, including me, assumed that patients who produced high quantities of antibodies early in infection would be free from disease. We were wrong. Several months into studying COVID-19, like other scientists, I’ve come to realize the picture is far more complicated. A recent research study published by my colleagues and me adds more evidence to the idea that in some patients, preventing dysregulated immune system responses may be as important as treating the virus itself. I am an immunologist at Emory University working under the direction of Dr. Ignacio Sanz, Emory’s chief of rheumatology. Immune dysregulation is our specialty.Inflammation in COVID-19 A harrowing turn in the COVID-19 pandemic occurred with the realization that the immune system’s power in fighting infection was sometimes pyrrhic. In patients with severe COVID-19 infections, evidence emerged that the inflammatory process used to fight the SARS-CoV-2 virus were, in addition to fighting the virus, potentially responsible for harming the patient. Clinical studies described so-called cytokine storms in which the immune system produced an overwhelming quantity of inflammatory molecules, antibodies triggering dangerous blood clots and inflammation of multiple organ systems, including blood vessels, in COVID-recovered children. All these were warning signs that in some patients, immune responses to the SARS-CoV-2 virus, which causes COVID-19, may have tipped from healing to destructive. Quick thinking and courageous decisions made by physicians on the front lines led to the use of steroids, medicines that dampen the immune response, early on in the course of infection of hospitalized patients. This approach has saved lives. But it’s not yet clear what parts of the immune system physicians are dampening that is having the effect. Understanding the nature of immune dysregulation in COVID-19 could help identify patients in whom these treatments are most effective. It may even justify more targeted and powerful approaches for modulating the immune system currently reserved for autoimmune diseases.The right antibodies take time Antibodies are powerful weapons. Produced by white blood cells called B cells, they latch onto infectious agents like viruses and bacteria and prevent them from infecting your healthy cells. These antibody-virus aggregates unleash powerful inflammatory reactions and serve as homing beacons that allow the rest of your immune system to target the pathogens efficiently. In some circumstances, they can even kill. Antibodies are so powerful that cases of mistaken identity — when a B cell produces antibodies that attack a person’s own cells — can lead to widespread organ damage and establish a perpetual cycle of immune self-targeting. We refer to this state of self-destruction as an autoimmune disease. To avoid autoimmune disaster, and to ensure effective response against the invading pathogen, B cells undergo a training process. Those that respond to the virus refine their antibodies and mature, ensuring potent antibodies capable of disabling the invader. B cells that target your own tissue are destroyed. But that maturation process takes time. Two weeks of B cell “training” during a severe infection can mean the difference between life and death. Faster antibody responses are needed. To bridge that gap, the immune system has an alternative form of B cell activation — called extrafollicular activation — that generates fast-acting antibodies that seem to bypass many of the known safety checks that accompany a more precise response. Extrafollicular responses develop quickly, are short-lived by design and die back when the more targeted responses emerge onto the scene. Except when they don’t.Autoimmune-like responses in COVID-19 Between 2015 and 2018, our lab found that these extrafollicular immune system responses were a common characteristic of people who suffered from autoimmune diseases, such as lupus. Patients suffering from this disease show chronically active extrafollicular responses that led to high levels of self-targeted antibodies and destruction of organs such as the lungs, heart and kidneys. The presence of specific kinds of B cells generated by extrafollicular responses in the blood can be an important indicator of disease severity in lupus, and now also COVID-19. In a recently published paper, my colleagues and I have identified extrafollicular B cell signatures in cases of severe COVID-19 similar to those we saw in active lupus. We showed that early on in the response to infection, patients with severe disease undergo a rapid activation of this fast-track pathway for antibody production. These patients produce high levels of viral-specific antibodies, some which are capable of neutralizing the virus. However, in addition to those protective antibodies, some that we saw look suspiciously like the ones found in autoimmune disorders such lupus. In the end, patients with these autoimmune-like B cell responses fare poorly, with high incidences of systemic organ failure and death.Tempering immune responses in COVID-19 Let me be clear here: COVID-19 is not an autoimmune disorder. The autoimmune-like inflammatory responses my team discovered could simply reflect a “normal” response to a viral infection already out of hand. However, even if this kind of response is “normal,” it doesn’t mean that it’s not dangerous. These prolonged extrafollicular responses have been shown to contribute to autoimmune disease severity both through the production of self-targeted antibodies and through inflammation that can damage tissue like the lung and kidney. This suggests that these early immune responses to a viral infection like COVID-19 are in tension with the later-targeted antibody response; in other words, the body’s rapid antibody production to nab the virus runs the risk of targeting not the virus, but the patient’s own organs and tissues. Immunologists like me need to learn more. Why are only some patients turning on such strong extrafollicular B cell responses? Are the antibodies that result from this response particularly prone to attacking and destroying the host’s organs? Would an ongoing autoreactive response help explain instances of “lingering” COVID-19 even after the viral infection has cleared? Despite these uncertainties, the medical community needs to recognize that, in the appropriate patients, dampening immune responses through steroid treatment (or perhaps even more powerful autoimmune-focused therapies) is a critical weapon in combating COVID-19. Physicians and scientists must continue to build our arsenal of therapeutics around the idea that in some cases of COVID-19, controlling your response to the virus might be as important as controlling the virus itself. Matthew Woodruff is an instructor in the Lowance Center for Human Immunology at Emory University in Atlanta. This was first published by The Conversation. .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}