{"article": [{"url": "https://www.marketwatch.com/story/micron-earnings-shows-spike-in-memory-sales-forecast-suggests-more-of-the-same-as-stock-pushes-higher-2020-06-29", "published": 1593498260.0, "headline": "Micron earnings show spike in memory sales, forecast suggests more of the same", "body": "Micron Technology Inc. shares jumped in after-hours trading Monday after the memory-chip maker said sales surged in the third quarter and are expected to remain strong in the final period of its fiscal year amid the COVID-19 pandemic. Micron MU, -0.02% forecast adjusted fiscal fourth-quarter earnings of 95 cents to $1.15 a share on revenue of $5.75 billion to $6.25 billion, which would be a big gain from a year ago when the company reported earnings of 56 cents a share on revenue of $4.87 billion. Analysts surveyed by FactSet, on average, were predicting fourth-quarter earnings of 79 cents a share on sales of $5.46 billion, according to FactSet. Shares gained more than 5% in after-hours trading, following a 1.4% gain in the regular session to close at $49.15. “As we look ahead at the second half, of course, you know, given the total COVID environment and uncertainties around COVID around the globe, we basically have limited visibility,” said Sanjay Mehrotra, Micron’s chief executive, on a conference call. “Yet, we do believe that cloud demand in the second half of the calendar year will continue to be healthy for us,” Mehrotra said. Micron specializes in DRAM and NAND memory chips. DRAM, or dynamic random access memory, is the type of memory commonly used in PCs and servers, while NAND chips are the flash memory chips used in USB drives and smaller devices, such as digital cameras. While the COVID-19 pandemic has been cited as fueling a boost in memory-chip sales, many analysts suspect that may have oversupplied the market, which could bode poorly for the second half of the year — but not according to Micron’s forecast. The company reported fiscal third-quarter net income of $803 million, or 71 cents a share, compared with $840 million, or 74 cents a share, in the year-ago period. Adjusted earnings were 82 cents a share, compared with $1.05 a share in the year-ago period. Revenue rose to $5.44 billion from $4.79 billion in the year-ago quarter. Analysts had forecast adjusted earnings of 75 cents a share on revenue of $5.27 billion. Micron had already informed investors that it would outperform its original expectations. In late May, Micron forecast adjusted earnings of 75 cents to 80 cents a share and revenue of $5.2 billion to $5.4 billion, up from its forecast of 40 cents to 70 cents a share on revenue of $4.6 billion to $5.2 billion back in March. For the year, Micron shares are off about 10%, while the PHLX Semiconductor Index SOX, +1.77% SOX, +1.77% is up 4%. Meanwhile, the S&P 500 index SPX, +0.87% is down 6%, and the tech-heavy Nasdaq Composite Index COMP, +1.39% is up 9%."}]}