{"article": [{"url": "https://www.marketwatch.com/story/mortgage-applications-for-suburban-homes-are-surging-as-buyers-try-to-escape-the-coronavirus-pandemic-2020-07-31", "published": 1596901460.0, "headline": "Mortgage applications for suburban homes are surging as buyers try to escape the coronavirus pandemic", "body": "“ ‘Sell city, buy country.’ ” The spreading coronavirus pandemic is having a considerable impact on the U.S. housing market by shaping consumer sentiment and behavior. The public health crisis has made many consumers reassess their priorities regarding what they’re looking for when buying a home. Home buyers increasingly are looking to less densely populated areas like the suburbs, according to loan consultants at Caliber Home Loans, the mortgage-lending firm I lead. Here are three reasons why: 1. Health concerns: Home buyers are asking whether their communities have access to testing sites, hospitals, grocery stories, and other amenities that make life easier. Urban areas such as New York City have a high density of people, which can result in a contagious disease spreading quickly, as happened this past spring. Indeed, there was an exodus of those living in New York to New Jersey and Connecticut, according to moving services. There are 11 counties around New York City and a few around Baltimore that are the most at-risk housing markets, in which home values may decline materially over the coming months. In May, there was a 13% increase in the number of searches for homes in suburban ZIP codes, and this trend is continuing. Our firm is processing thousands of applications from potential home buyers who want to move to the suburbs. In the Chicago and Washington D.C. metro areas, for example, suburban or rural mortgage applications are up 40% versus pre-pandemic averages. We’re also seeing a flight to suburbs in the metro areas of Houston, Los Angeles, and Denver, among other places, as shown in the chart below. 2. Working from home: Millions of Americans are now working from home, interacting with clients and colleagues online. Commercial leasing activity dropped more than 20% in the first quarter of 2020. Our homes have become our offices, and this may be a lasting trend even when the world finally returns to some normalcy. After all, those who work from home were 13% more efficient than their counterparts who didn’t, according to a 2014 study. People may save between $2,000 and $6,500 by not spending on day care, clothes, gasoline or parking. Workers may even be happier at home, as one recent survey found. Accordingly, home buyers are realizing that the place they live should be optimized for remote working. A recent survey of real estate agents revealed that the most sought after home upgrade was having a functioning home office (even more so than a big outdoor space). 3. More space: “Borrowers can acquire more square footage, have a yard for pets and kids alike, while maintaining a sense of social distancing for health reasons as well,” said Josip Capelj, a loan consultant in Caliber’s Detroit office. Housing starts surged 17.3% in June, the highest percentage increase since 2016, based on demand for single-family houses in small metro areas and the suburbs. If you’re going to be quarantined, you may as well do so in a house that has more space and amenities to enjoy. Riding out a public health crisis in a small apartment isn’t optimal, so many homeowners have instead decided to relocate to suburbs. As one noted venture capitalist put it, “Sell city, buy country.” Sanjiv Das is CEO of Caliber Home Loans. Previously, he was the CEO of CitiMortgage during and after the great financial crisis Read:Pending home sales continued to rebound across the country in June (for now) Plus: The feared jumbo mortgage debacle is here — thanks to the coronavirus — and ready to pound the housing market"}]}