{"article": [{"url": "https://www.marketwatch.com/story/gold-pulls-back-on-friday-but-heads-for-weekly-gain-amid-rocky-stock-market-2020-09-11", "published": 1599833540.0, "headline": "Gold falls for the session, but edges up for the week", "body": "Gold futures fell on Friday, but edged higher for the week on the heels of a turbulent patch of trading for global equities. “The precious metal remains supported by low-to-negative government bond yields, rising coronavirus cases in the United States and a tired U.S. dollar,” said Lukman Otunuga, senior research analyst at FXTM. “On top of this, the Federal Reserve’s policy shift to let inflation rip may provide gold with a tailwind as interest rates remain lower for an extended period.” Rising inflationary pressures may also “erode the dollar’s purchasing power, meaning gold holds its value while the greenback depreciates” he told MarketWatch. On Friday, December gold GCZ20, +2.17% GC00, +2.17% declined by $16.40, or 0.8%, to settle at $1,947.90 an ounce, following a rise of 0.5% Thursday. December silver SIZ20, +5.96% SI00, +5.96%, meanwhile, gave up 43 cents, or 1.6%, at $26.857 an ounce. For the week, gold tallied a 0.7% gain, while silver climbed by 0.5%, based on the most-active contract settlements last Friday, FactSet data show. Read:Volatility in oil and gold may offer more opportunity than risk Also see:Lumber futures climb to a record and more than double for the year, as pandemic boosts demand Worries about inflated valuations, particularly in the technology-related sectors, drove the Nasdaq Composite Index COMP, +1.39% into correction territory on Tuesday, after weeks of gains, and stocks have struggled to claw back those losses thus far. U.S. benchmark stock indexes were lower for the week. Bullion, which has ascended in price amid the global viral outbreak, has benefited recently from newfound volatility in the stock market after the precious metal’s coronavirus-fueled advance stalled out over the past few weeks. Gold investors, meanwhile, make the case that uncertainty around the U.S. presidential elections on Nov. 3, with incumbent President Donald Trump trailing former Vice President Joe Biden in national polls, and concerns about the virus and geopolitical tensions, provide a host of possible catalysts for gold to rise. Looking at the technical picture, Otunuga said a breakout or breakdown “opportunity is in play” with support level of $1,910 and resistance level of $1,985 “acting as key levels of interest. Weakness below $1,910 may trigger a drop towards $1,890 and $1,865, respectively.” In other metals trading Friday, December copper HGZ20, +1.38% tacked on 1.4% to $3.0395 a pound, ending around 0.7% for the week. October platinum PLV20, +3.99% shed nearly 0.2% to $939.60 an ounce, with prices up about 4.6% for the week. December palladium PAZ20, +2.31% fell by a dime to $2,330.80 an ounce, losing 0.5% for the week."}]}