{"article": [{"url": "https://www.marketwatch.com/story/the-united-states-of-despair-is-gripped-by-two-simultaneous-pandemics-that-expose-a-widening-inequality-gap-2020-06-15", "published": 1592382680.0, "headline": "The United States of Despair is gripped by two simultaneous pandemics that expose a widening inequality gap", "body": "PRINCETON, N.J. (Project Syndicate) — Well before COVID-19 struck, there was another epidemic running rampant in the United States, killing more Americans in 2018 than the coronavirus has killed so far. What we call “deaths of despair” — deaths by suicide, alcohol-related liver disease, and drug overdose — have risen rapidly since the mid-1990s, increasing from about 65,000 per year in 1995 to 158,000 in 2018. The increase in deaths from this other epidemic is almost entirely confined to Americans without a four-year college degree. While overall mortality rates have fallen for those with a four-year degree, they have risen for less-educated Americans. Life expectancy at birth for all Americans fell between 2014 and 2017. That was the first three-year drop in life expectancy since the Spanish flu pandemic of 1918-19; with two epidemics now raging at once, life expectancy is set to fall again. “ America finds itself in the grips of two epidemics, each of which has exposed deep inequalities across races and levels of educational attainment. Between rising “deaths of despair” among working-class whites and higher COVID-19 mortality rates among African-Americans, the stunning secular decline in US life expectancy will continue. ” Behind these mortality figures are equally gloomy economic data. Also read: Americans haven’t been this unhappy in 50 years: poll As we document in our book, real (inflation-adjusted) wages for U.S. men without a college degree have fallen for 50 years. At the same time, college graduates’ earnings premium over those without a degree has risen to an astonishing 80%. With less-educated Americans becoming increasingly less likely to have jobs, the share of prime-age men in the labor force has trended downward for decades, as has the labor-force participation rate for women since 2000. Educated Americans are pulling away from the less-educated majority not only in terms of income, but also in health outcomes. Pain, loneliness, and disability have become more common among those without a degree. Such was the U.S. on the eve of the COVID-19 pandemic. Now, the virus has newly exposed the pre-existing inequalities. Historically, pandemics have arguably brought greater equality. Most famously, the Black Death killed so many people in 14th-century Europe that it created a labor scarcity, which improved workers’ bargaining position. Later, in the 19th century, cholera epidemics inspired the germ theory of disease, setting the stage for the modern increase in longevity, first in the rich countries, and then, after World War II, in the rest of the world. A great divergence in lifespans across the world gave way to a great convergence. But the U.S. has been experiencing a great divergence at home for two generations, and COVID-19 promises to widen the country’s already vast inequalities in health and income. The effects of the virus are stratified by educational attainment, because those with more education are likelier to be able to continue working and earning from home. Unless they are among the highly educated workers in health care and other front-line sectors, they can sit back and watch the stock market propel the value of their retirement funds ever higher. By contrast, the two-thirds of workers who lack a four-year college degree are either nonessential, and thus risk losing their earnings, or essential, and thus at risk of infection. Whereas college graduates have largely been able to safeguard both their health and their wealth, less-educated workers must risk one or the other. For this reason, the income and longevity gaps that the trend in deaths of despair has revealed are now widening further. But while less-educated whites have borne the brunt of the first epidemic, African-Americans and Hispanics have been disproportionately killed by COVID-19. As a result, the previous convergence of white and black mortality rates has been derailed. There are many reasons for these racial disparities, including residential segregation, crowded living conditions, and commuting patterns. While these factors have been especially important in New York City, they have played less of a role in other places. In New Jersey, for example, neither African-Americans nor Hispanics have disproportionately higher COVID-19 mortality rates. America’s costly health-care system will continue to compound the pandemic’s effects. Many among the tens of millions of Americans who lost their jobs this spring also lost their employer-provided health insurance, and many will not be able to secure alternative coverage. While no one presenting with COVID-19 symptoms has been denied treatment, some of the uninsured may not have sought it. As of publication, the virus’s death toll in the U.S. is at least 115,000, and more than 200,000 have been hospitalized, incurring potentially unpayable medical bills (even for many with insurance) that will ruin their credit for life. The federal government has given pharmaceutical companies billions of public dollars to develop a vaccine and, thanks to lobbyists, did not attach conditions on pricing or impose public claims on patents. In addition, the pandemic is fueling further industry consolidation by favoring already dominant e-commerce giants at the expense of struggling brick-and-mortar firms. Labor’s share of GDP — long thought to have been an immutable constant — has fallen in recent years, and market power in both product and labor markets may be one reason. If the unemployment rate remains high in the coming years, the terms of trade between labor and capital will be pushed even further toward the latter, inverting the Black Death analogy and justifying the stock market’s optimism SPX, +0.87% in the face of catastrophe. That said, we do not believe that the post-COVID economy will provoke a spike in deaths of despair. The fundamental cause of that epidemic, our analysis suggests, was not economic fluctuations, but rather the long-term loss of a way of life among white working-class Americans. Notably, deaths of despair were rising before the 2008 financial crisis and Great Recession, when unemployment rose from 4.5% to 10%, and they continued to rise as unemployment gradually fell to 3.5% in the days before the pandemic. If there once was a relationship between suicide and unemployment, it is no longer apparent in the U.S. Nonetheless, past episodes suggest that those entering the labor market in 2020 will have a lower earnings path throughout their working lives, possibly creating the despair that brings death from suicide, alcohol, or drug overdoses. In other words, the most likely post-COVID America will be the same as pre-COVID America, only with even more inequality and dysfunction. True, public anger over police violence or outrageously expensive health care could create a structural break. If that happens, we might see a better society. Or, we might not. It is not always a phoenix that rises from the ashes. Anne Case is professor emeritus of economics and public affairs at Princeton University. Angus Deaton, the 2015 Nobel laureate in economics, is professor emeritus of economics and international affairs at Princeton’s Woodrow Wilson School of Public and International Affairs and presidential professor of economics at the University of Southern California. Case and Deaton are co-authors of “Deaths of Despair and the Future of Capitalism” (Princeton University Press, 2020). This article was published with permission of Project Syndicate — United States of Despair"}]}