{"article": [{"url": "https://www.marketwatch.com/story/the-facebook-ad-boycott-could-pay-off-for-companies-more-than-advertising-on-facebook-2020-07-01", "published": 1593860900.0, "headline": "The Facebook ad boycott could pay off for companies more than advertising on Facebook", "body": "Advertisers who were already looking to shave millions in spending due to the COVID-19 pandemic may have received a gift in the current boycott of Facebook Inc.: A better boost for their brands than an ad may provide, without paying anything. Hundreds of advertisers have publicly announced they are ceasing advertising purchases from Facebook FB, +0.26% in a protest labeled #StopHateForProfit, which launched Wednesday and focuses on the company’s inability to properly rein in racist and violent content as well as misinformation. Advertising experts say those decisions are not so wrenching, though — boycotting Facebook is obviously more cost-effective than paying for ads, they receive free media publicity and appeal to socially-conscious consumers. “By pulling ads, they save money and make a low-risk statement that results in positive publicity and marketing for their brands among constituents,” said Gerard Francis Corbett, a communications strategy consultant based in Silicon Valley. “The Facebook boycott is a lower-risk way for CEOs to make a [political] statement.” Societal and economic stars aligned for companies to take stands after years of uneasiness about content on Facebook, Instagram, Twitter Inc. TWTR, -0.23%, and other social-media platforms, Corbett and others say. Facebook has inflamed marketers, Facebook users and employees, and anti-hate groups for years, but advertisers largely stuck with the platform. The confluence of a once-in-a-century pandemic, rampant unemployment, and social unrest not seen since 1968 have upturned movements against corporations in ways unimaginable only a few years ago, say branding experts. “There is a perfect storm of corporate responsibility during coronavirus and Black Lives Matter, and a need to contain costs during a recession,” John Marcinuk, head of marketing at Blue Fountain Media, told MarketWatch in a phone interview Monday. “Whether you’re spending a dime or $20 million on a platform, if you have a stand to take, now is the time to do it.” See also: After years of talk, tech companies appear to be getting serious about diversity efforts Facebook has worked feverishly behind the scenes. Company executives held at least two meetings with advertisers Tuesday, according to a Reuters report that cited three people who participated in the calls, and Chief Executive Mark Zuckerberg planned another call with boycott organizers Tuesday. “We regularly engage with, listen to and learn from civil rights leaders and organizations. Last week, we reached out to the NAACP, ADL and Color of Change and offered a meeting with our COO and CPO because they’ve made product-specific requests,” a Facebook spokesperson said in an email. “They asked about having Mark at the meeting, and we’ve since confirmed that Mark is able to join. We’re waiting to hear back and look forward to the opportunity to continue the dialogue.” The meeting could be combustible: Zuckerberg has told Facebook employees he expects members of a month-long advertising boycott to “be back on the platform soon enough,” according to news site The Information late Wednesday. In a lengthy Facebook post Friday, Zuckerberg responded by committing to remove content that “incites violence” or suppresses voting, “no matter where it comes from” — including from politicians like President Donald Trump. On Monday, Facebook officially banned some groups linked to the radical “boogaloo” movement after a member was accused of using the Facebook platform to organize the May shooting death of a federal officer in Oakland, Calif. And late Tuesday, Zuckerberg agreed to meet with boycott organizers, a company spokesperson confirmed to MarketWatch. “We may never be able to prevent hate from appearing on Facebook entirely, but we are getting better at stopping it all the time,” Nick Clegg, Facebook’s vice president of global affairs/communications, tweeted on Wednesday. For more: Facebook reverses policies as ad boycott sends stock down Those moves haven’t slowed the flow of advertisers publicly proclaiming they will pull spending from Facebook and its properties. In all, roughly 400 companies worldwide had joined the ban as of Tuesday morning, and nearly a third of advertisers are considering joining a month-long boycott of Facebook and other social media platforms, according to a survey by the World Federation of Advertisers of 58 corporate members whose cumulative annual ad spending is $92 billion. Microsoft Corp. MSFT, +2.48%, PepsiCo Inc. PEP, +0.42%, Ford Motor Co. F, -1.36%, Starbucks Corp. SBUX, +0.53%, Coca-Cola Co. KO, +0.69%, Verizon Communications Inc. VZ, +0.23%, SAP SAP, +0.65%, and Unilever UL, +1.44% are among the high-profile names to hit pause on advertising on Facebook. See also: Here are the major brands that have pulled ads from Facebook Many companies had publicly disclosed in earnings reports and calls that they expected to dial back advertising spending during the grip of the COVID-19 pandemic. Ad spending nationwide is expected to drop 13% to $207.9 billion, excluding political ads, according to GroupM, a unit of WPP. As recently as December, WPP was forecasting a 4% jump in 2020. Consider Coca-Cola. Before the boycott, the soft drink maker reported a 25% slump in first-quarter sales volumes, and CEO James Quincey warned advertising vendors on an April earnings call that “from April and until further notice we’re putting commercial advertising for Coca-Cola and all our brands on hold.” Quincey proclaimed Monday that Coca-Cola would stop all social-media postings along with any advertising for at least 30 days as of July 1. “We will take this time to reassess our advertising standards and policies to determine whether revisions are needed internally, and what more we should expect of our social media partners to rid the platforms of hate, violence and inappropriate content. We will let them know we expect greater accountability, action and transparency from them,” Quincey said in a post on the soft-drink company’s website. Coca-Cola did not respond to an email message seeking comment. Unilever spent more than $11.8 million in the U.S. this year on Facebook, according to marketing analytics company Pathmatics, but Unilever CEO Alan Jope halted any new major ad productions that were in the works, according to the company’s first-quarter earnings call in early March. Jope said he was reviewing ad spending to take advantage of cheaper ad rates, and “dialing up areas with strong ROI.” The maker of Dove soap joined the boycott Friday, stating that given “the polarized atmosphere in the U.S., we have decided that starting now through at least the end of the [calendar] year, we will not run brand advertising in social media newsfeed platforms Facebook, Instagram and Twitter in the U.S.” “This isn’t as big a deal for these companies [boycotters] to make this decision as before. We should give them accidental credit,” Tara Hunt, CEO of DIY marketing platform Phlywheel, told MarketWatch. “Companies are jumping on causes around COVID-19 and Black Lives Matter. Here is another bandwagon to jump on and say how much we care.” Some $1 billion to $1.5 billion in commitments for third-quarter ad spending could be canceled, ad buyers estimate. PepsiCo, General Motors Co. GM, -0.15% and General Mills Inc. GIS, +0.78%, among others, have indicated they would consider stepping back ad spending in the calendar third quarter, according to a report in the Wall Street Journal. Read: Silicon Valley economy remains strong 100 days into shelter-in-place order That stand may not last long, though. Most companies have not said it is a permanent ban on purchasing Facebook ads, and some have only committed to time frames such as a month. “Marketing leaders are taking an economic risk: They believe they’re gaining brand equity by aligning themselves on the right side of history with short-term impact,” Julia Stead, chief marketing officer at Allocadia, a budget management and strategic planning platform, told MarketWatch. What will be telling, she added, is whether the brands stick with their boycott more than a month. Tech platforms have seen advertisers return after similar issue-based boycotts. Three years ago, major brands including Verizon, AT&T Inc. T, -1.01%, Pepsi, and Johnson & Johnson JNJ, +1.39% pulled millions of dollars in advertising from YouTube amid rows over extremist content on Alphabet Inc.’s GOOGL, +1.82% GOOG, +1.97% video-sharing platform. YouTube collected $8.2 billion in ad revenue in 2017 despite the protests, a total that grew more than 35% in both 2018 and 2019. See also: Zuckerberg was reportedly talked out of making moves against Trump More than two years ago, when Facebook found itself enmeshed in embarrassing disclosures about Cambrige Analytica — a political consultancy that harvested millions of Facebook users’ personal data without their consent to be predominantly used for political advertising — threats of a boycott among marketers largely fizzled. Unilever and Procter & Gamble Co. PG, +0.89% voiced objections but stuck with Facebook. Mozilla Corp. did not. The maker of the Firefox web browser was the first consumer product company to pull all advertising from Facebook 18 months ago, and hasn’t returned since. “We stopped then because we believed their response to the Cambridge Analytica scandal was insufficient, and that the policies and practices that led to the scandal demonstrated that Facebook was not taking adequate care to safeguard people’s personal data on their platform,” Mozilla Interim CMO, Mary Ellen Muckerman said in a statement to MarketWatch. “As a result, we not only stopped our advertising spend, but we stopped using Facebook to promote Mozilla or Firefox. Like other companies now, we find what Facebook is doing in this moment to be problematic as well. Barring any significant changes in their actions, we have no plans to resume our advertising on Facebook.” “I sincerely hope that they [Facebook ad boycotters] think when they consider a return to Facebook whether it should be as dominant in their plans as before,” Hunt said."}]}