{"article": [{"url": "https://www.marketwatch.com/story/goldman-raises-12-month-gold-forecast-by-11-to-2000-an-ounce-2020-06-19", "published": 1592580200.0, "headline": "Goldman raises 12-month gold forecast by 11% to $2,000 an ounce", "body": "Gold prices are likely to reach $2,000 an ounce in 12 months on the back of low real interest rates and concerns over currency debasement, even as developed markets emerge from COVID-19 lockdowns, lifting risk-on sentiment, according to a note Friday from Goldman Sachs. The investment bank raised its 12-month forecast on gold to $2,000 an ounce, from $1,800. It also lifted its three-month view to $1,800 from $1,600 and its six-month forecast to $1,900 from $1,650. “Gold investment demand tends to grow into the early stage of the economic recovery, driven by continued debasement concerns and lower real rates,” wrote analysts at Goldman Sachs. “Simultaneously, we see a material comeback from [emerging market] consumer demand boosted by easing of lockdowns and a weaker dollar.” The analysts estimated that “fear” driven investment demand lifted gold by 18% this year, but the negative shock to “wealth” produced an 8% “drag.” They pegged the net effect at 10%, which coincides with gold’s year to date rise of 13%. The most-active August gold contract US:GCQ20 settled at $1,753 an ounce, up $21.90, or 1.3%, on Friday and was nearly 14% higher for the year so far. The Goldman analysts expect strength in development market investment demand to “persist even as economies recover, supported by fears of debasement and the higher level of economic uncertainty of the crisis.” Still, for gold prices to go materially above $2,000, inflation will need to move above the Federal Reserve’s 2% target and this move would need to be met with a muted policy response, they said. The analysts also raised their 12-month silver forecast by nearly 47% to $22 an ounce, from a previous forecast of $15. They said “coordinated global stimulus” will help generate global industrial production growth and economic activity. “As the economy recover and ‘fear’ based demand for gold moderates, we expect silver industrial demand to increase, giving up prices,” they said. In Friday dealings, July silver US:SIN20 rose 34 cents, or 1.9%, to $17.847 an ounce, though the contract was still down by more than 1% for the year so far."}]}