{"article": [{"url": "https://www.marketwatch.com/story/dhs-official-claims-he-was-pressured-to-alter-intel-on-russia-white-supremacists-11599680431", "published": 1599743840.0, "headline": "Homeland Security whistle-blower says he was pressured to alter intelligence on Russia and white supremacists to match Trump preferences", "body": "Acting U.S. Secretary of Homeland Security Chad Wolf testifies during a hearing before Senate Homeland Security and Governmental Affairs Committee. Alex Wong/Getty Images WASHINGTON (AP) — An official at the Department of Homeland Security said in a whistle-blower complaint released Wednesday that he was pressured by agency leaders to suppress details in his intelligence reports that President Donald Trump might find objectionable, including intelligence on Russian interference in the election and the threat posed by white supremacists. Brian Murphy says in a whistle-blower complaint filed with the agency’s inspector general that he was demoted for refusing to alter his intelligence reports in an “illegal and improper” manner. The former FBI agent and Marine Corps veteran had served as principal deputy under secretary in the Office of Intelligence and Analysis. In August, he was demoted to assistant to the deputy under secretary for DHS Management. “Mr. Murphy is, put simply, a dedicated public servant who has had a laudable career prior to the recent events that have led to the submission of this package to the OIG,” his complaint states. “Prior to his current circumstances, he had never had so much as a negative fitness report in his professional career with the U.S. Government.” In his complaint, he alleges that former DHS Secretary Kirstjen Nielsen; the current acting secretary Chad Wolf; and his deputy, Ken Cuccinelli, repeatedly pressed him to change intelligence assessments in ways that would support administration policies or avoid offending the president. Also read: Trump’s acting homeland secretary defends force deployment to Portland and places civil unrest among top threats to U.S. In one example, he said Nielsen and her deputies pressed him to exaggerate the number of migrants with links to terrorism who have been detained at the southwest border. Murphy said she falsely used a higher figure in testimony to Congress. The complaint says Wolf, who has only recently been nominated to be secretary by Trump, directed Murphy to cease providing intelligence assessments on the threat of Russian interference to the U.S. because it “made the President look bad.” Murphy said he declined because it would be a violation of his duties not to do it. He said Cuccinelli directed him to modify a section of a report on white supremacy to make the threat appear less severe, and to include information on left-wing groups to echo administration talking points around civil unrest following the protests over the killing of George Floyd. A copy of the complaint was released Wednesday by Rep. Adam Schiff of the House Intelligence Committee. Schiff says he has asked Murphy to testify to Congress. DHS did not immediately respond to a request for comment by The Associated Press."}]}