{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-rise-diverging-from-u-s-tech-fears-11599465241", "published": 1599480080.0, "headline": "European stocks rally, diverging from U.S. tech slump", "body": "A worker assembles VW ID.3 electric cars at the Volkswagen factory on July 31, 2020 in Zwickau, Germany. Jens Schlueter/Getty Images European stocks rallied on Monday, diverging from the U.S. after a rough week for markets. Down 1.9% last week, the Stoxx Europe 600 SXXP, +0.55% rose 1.7%. Software giant SAP SAP, +0.54%, pharmaceutical AstraZeneca AZN, +0.63% and chemicals company Linde LIN, +0.14% paced a broad-based advance. That was the best one-day gain since Aug. 11. The German DAX DAX, +0.06%, French CAC 40 PX1, +0.71% and U.K. FTSE 100 UKX, +0.64% each registered strong gains. Last week the tech-dominated Nasdaq Composite COMP, +1.39% lost 3.2%, its worst decline since the period ending March 20, and first drop after five consecutive gains. SoftBank Group 9984, -1.24% shares dropped over 7% in Tokyo on Monday, after The Wall Street Journal reported the Japanese investment group bought $4 billion worth of options tied to around $50 billion worth of individual tech stocks. “There was no specific trigger to the selloff but after extreme bullishness driven by monetary and fiscal policies, stock prices reached levels that could no longer be justified by fundamentals,” said Hussein Sayed, chief market strategist at FXTM. “Liquidity and low interest rates alone cannot be the solution to everything, so it’s essential to see continued improvement in economic data and an end to the pandemic for sustainable upside in risk assets.” Germany reported a 1.2% rise in industrial production for July, which was a slower than forecast rise. The pound GBPUSD, +0.83% weakened after the Financial Times reported the U.K. was working on legislation to override parts of the Brexit withdrawal agreement. The Sunday Express separately reported a dossier is being considered by Downing Street that would seek to limit access for European Union companies seeking to raise money in London. Talks on a post-Brexit U.K.-European Union trade deal are due to restart on Tuesday. “It seems odd, to say the least, that the U.K. could be about to undermine its commitments to Ireland with upcoming legislation after the U.K. had recently taken steps in recent months to prepare Northern Ireland’s border for exit day. It suggests the U.K. is trying to increase the pressure to get a deal more to its liking rather than going for a hard exit,” said Kallum Pickering, senior economist at Berenberg. Associated British Foods ABF, +0.68% rose 3%, after saying trading in the fourth quarter ending Sept. 12 in both its food businesses and retailer Primark exceeded expectations."}]}