{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-death-toll-tops-900000-us-toll-above-190000-and-experts-slam-trump-for-playing-down-virus-2020-09-10", "published": 1599748280.0, "headline": "Coronavirus update: Global death toll tops 905,000, U.S. toll above 191,000 and experts slam Trump for playing down virus", "body": "The number of global fatalities from the coronavirus that causes COVID-19 climbed above 905,000 on Thursday and the U.S. death toll rose above 191,000, amid widespread criticism of President Donald Trump’s handling of the crisis, after journalist Bob Woodward revealed that Trump admitted to him that he deliberately downplayed the virus in the early part of the outbreak. Trump told Woodward in interviews for the storied journalist’s new book, “Rage,” that the coronavirus was “deadly stuff,” even as he minimized the health threat publicly by telling Americans that COVID-19 was “under control” and “going to disappear.” CNN and the Washington Post published accounts of the comments from advance copies of the book, and released copies of the audio tapes. “I wanted to always play it down,” Trump told Woodward on March 19, days after he had declared COVID-19 a national emergency. “I still like playing it down, because I don’t want to create a panic.” Trump acknowledged the tapes were authentic on Fox News Wednesday night. Trump’s Democratic rival for the November presidential race Joe Biden immediately condemned the president for failing to do his job and protect the American people. “He had the information. He knew how dangerous it was. And while this deadly disease ripped through our nation, he failed to do his job on purpose,” said Biden. “It was a life-and-death betrayal of the American people,” Biden added, speaking at a campaign event in Warren, Michigan. “It’s beyond despicable. It’s a dereliction of duty. It’s a disgrace.” Read:Trump himself asks why Woodward didn’t immediately report the president’s comments about playing down the coronavirus Health experts said the failure to fully inform the public of the threat posed by the virus meant the U.S. lost valuable time. “Clearly, he admits that this was airborne, a respiratory illness,” said Kavita Patel, a primary care physician and health policy expert who served in the Obama White House in an interview with MSNBC. “I think about how much we fumbled, even myself in the beginning, with recommending that people not wear masks. First we thought, no, we don’t want to take away masks from medical personnel. Now we have studies that show that if we’d had widespread mask-wearing mandates, we could have reduced deaths by as much as 20% to even 50%. “Some of the modeling coming out of the University of Washington reinforces that mask wearing and being outdoors can make that much of a difference,” she said. A more strenuous effort early on in the pandemic would not just have saved lives, she said, but also helped the millions of people who are suffering longer term effects that doctors know little about, said Patel. “We do have the science, it did take us time and the president, he called this thing a hoax, but now we know better,” she said. In case you missed it:To defeat COVID-19, ‘we need a unified national strategy,’ says public health expert Dr. Howard Koh Dr. Jeremy Faust, an emergency physician at Brigham and Women’s Hospital and an instructor at Harvard Medical School, said he was shocked by Trump’s comments. “As a physician, it just doesn’t ring true to have that moment even occur. When we have a patient who has a problem we tell them the truth about it. We say here is the situation, here is the prognosis, here are your options, whether its good new or bad news. We have to trust people with the information so they can make a choice that’s good for them.” Atlanta Mayor Keisha Lance Bottoms tweeted that her husband Derek Bottoms, a vice president of employment practices and associate relations at Home Depot, continues to suffer the side effects of his bout with COVID-19: iframe.twitter-tweet { width: 100% !important; } The U.S. counted another 33,201 new cases of the virus on Wednesday, according to a New York Times tracker, and at least 1,176 new fatalities. The U.S. leads the world by cases, at 6.36 million, according to data compiled by Johns Hopkins University. On a per capita basis, the U.S. has 54.72 deaths per 100,000 people, one of the highest in the world, after Peru, Spain and Brazil, the data shows. In other news: • The World Health Organization said the number of cases in the Middle East from Morocco to Pakistan has climbed above two million, and has more than doubled since July 1. Iran has the most cases at more than 393,000 cases, followed by Saudi Arabia with more than 320,000, Pakistan with 299,855 and Iraq with 273,821. • The French government is gearing up to announce new COVID-19 measures on Friday, the Guardian reported. France recorded its second highest number of new cases on Wednesday at more than 8,557, with the country’s scientific committee created to manage the crisis warning that the government ““will be forced to take a certain number of difficult decisions … in the next 8-10 days at most,” the paper reported. The head of the committee Jean-Francois Delfraissy said France is now at a “worrying level,” and is “not far behind Spain with a lag of maybe two weeks, and much more severe than Italy.” • India had another record day for new cases at 95,735, according to its health ministry, as Reuters reported. The country of 1.4 billion people counted 1,172 fatalities, the news agency reported, the highest single-day mortality rate in more than a month. Infections are climbing faster in India than anywhere else and the country is second to the U.S. by case numbers, the Johns Hopkins data shows. • There was some good news for New York City, one of the hardest-hit areas of the U.S. by COVID-19. Gov. Andrew Cuomo said indoor dining can resume at the end of the month, albeit at greatly reduced capacity and with safeguards in place. Restaurants will be allowed to serve guests indoors at 25% of their usual capacity, the governor said. Diners will be required to wear face coverings when not seated; at least one member of each party must provide information for contact tracing; temperature checks will be given at the door; no bar seating will be permitted; and restaurants will close at midnight. Businesses will also be required to operate with enhanced air filtration systems, a requirement similar to one of the stipulations used for gym reopenings. Read also:I went to the Met, and here’s what I saw • The Chinese city of Wuhan, where the coronavirus was first reported late last year, will resume international flights on Sept. 16, the New York Times reported. The first flight will take passenger to South Korean capital Seoul, according to Chinese state-run media on Thursday. A number of airlines are applying to restart direct flights to Wuhan and cities such as Bangkok, Kuala Lumpur, Hanoi and Singapore, the paper reported.Latest tallies There are now 27.9 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show. At least 905,470 people have died and at least 18.8 million people have recovered. Brazil has the second highest death toll after the U.S. at 128,539. Mexico is fourth with 69,049 deaths and 647,321 cases. The U.K. has 41 697 deaths, the highest in Europe and fifth highest in the world, and 360,533 cases. China has 90,112 confirmed cases and 4,733 deaths, according to its official numbers. What’s the economy saying? The number of Americans who applied for unemployment benefits through state and federal programs rose in early September for the third week in a row, signaling that a gradual improvement in the labor market during the summer has stalled, MarketWatch’s Jeffry Bartash reported. Initial jobless claims filed traditionally through state employment offices were unchanged at a seasonally adjusted 884,000 in the week of Aug. 30 to Sept. 5, the Labor Department said Thursday. Economists polled by MarketWatch had forecast new claims to fall to 840,000. Yet new claims rose when including self-employed workers who applied for benefits under a separate federal program. Some 838,916 people filed under the Pandemic Unemployment Assistance Act. That put the number of actual or unadjusted new claims at 1.69 million, compared to 1.59 million in the prior week. Federal filings have risen four weeks in a row. Read also: There are seven coronavirus vaccine candidates being tested in the U.S. — here’s where they stand The increase could be due to the end of federal assistance for small businesses. It could also reflect a fresh wave of layoffs in hard-hit businesses such as airlines and hotels. Major companies such as American Airlines Group Inc. AAL, +0.34% and MGM Resorts International MGM, -2.59% said earlier this month they would cut more jobs permanently because demand is still in a slump and federal aid has dried up. Read: Did the expired $600 federal jobless benefit keep people from going back to work? Sudden drop in claims adds fuel to debate “It is especially concerning that the pace of layoffs has not slowed more materially even though the economy has reopened more fully, and more and more businesses have come back online,’ said chief economist Rubeela Farooqi of High Frequency Economics. Don’t miss:The COVID recession has decimated some states, but barely touched othersWhat are companies saying? • Century 21, the off-price retailer with 13 stores in New York, New Jersey, Pennsylvania and Florida, will shut down operations due to the impact of COVID-19. The company says its insurers have failed to pay on policies that protect against business interruption. The payments total about $175 million. “While insurance money helped us to rebuild after suffering the devastating impact of 9/11, we now have no viable alternative but to begin the closure of our beloved family business because our insurers, to whom we have paid significant premiums every year for protection against unforeseen circumstances like we are experiencing today, have turned their backs on us at this most critical time,” said Century 21 co-Chief Executive Raymond Gindi in a statement. Century 21 has been in business for 60 years. Going out of business sales will take place at store locations and online. See also:U.S. bankruptcies on track for 10-year high with more than 100 consumer companies already filing • GameStop Corp. GME, -10.89% reported fiscal second-quarter results that missed Wall Street estimates, with revenue plunging during the pandemic. GameStop reported a loss of $111.3 million, or $1.17 a share, compared with a loss of $415.3 million, or $4.15 a share, in the year-ago quarter. The adjusted loss of $91.2 million, or $1.40 per share, was significantly higher than the $32 million shortfall, or 32 cents per share, a year ago. Revenue fell 27% to $942 million from $1.29 billion a year ago. Analysts surveyed by FactSet had expected an adjusted loss of $1.13 a share on revenue of $1.019 billion. • JetBlue Airways Corp. JBLU, -0.07% will launch 24 new routes later this year, aimed at “immediately generating cash” and capturing traffic amid an expected increase in demand for leisure travel. The airline will introduce new nonstop flights from four “focus cities,” including Newark, Los Angeles, Fort Lauderdale and San Juan. Separately, JetBlue said it extend its initiative in which change fees are waived for new booking made through Feb. 28, 2021. The extension comes after a number of airlines, starting with United Airlines Holdings Inc. UAL, +0.32% , that they will permanently waive change fees, as they work to get people to travel again following a steep decline in air travel during the pandemic. • Philip Morris International Inc. PM, +0.70% revised its net full-year profit outlook higher, citing better-than-expected industry volume trends and pricing during the pandemic. The company revised its net earnings-per-share guidance range to $4.92 to $4.99 from $4.84 to $4.99. Excluding non-recurring items, such as asset impairment costs and fair value adjustments for equity security investments, the adjusted EPS outlook if $5.00 to $5.07, compared with the FactSet consensus of $5.08. Excluding the negative impact of currency translation, the company said its adjusted EPS outlook would be $5.31 to $5.38. . • Quest Diagnostics Inc. DGX, +0.33% raised its full-year outlook for profit and revenue, citing a faster-than-anticipated recovery in testing volumes from the pandemic through the end of August. The company now expects net 2020 earnings per share of $7.42 to $8.92, up from previous expectations of $5.66 to $7.66, while the adjusted EPS guidance range was raised to $7.50 to $9.00 from $6.60 to $8.60. The FactSet consensus is $8.28. The company raised its 2020 guidance range for revenue to $8.4 billion to $8.8 billion from $8.0 billion to $8.6 billion, compared with the FactSet consensus of $8.69 billion. Quest said it now expects cash provided by operations to be at least $1.45 billion, up from previous expectations of at least $1.25 billion. • Red Robin Gourmet Burgers Inc.’s RRGB, +2.75% latest business update showed improved comp sales at company-owned locations. For the week ending September 6, comparable-store sales at Red Robin’s company-owned restaurants were down 21.9%, up from the week prior when comp sales were down 22.1%. Comparable-store sales were down more than 30% each of the weeks ending in August. Average net sales per restaurant dipped slightly to $39,593 in the most recent week due to the Labor Day holiday, which the company said hurt comparable revenue by 3% to 5%. Paul Murphy III, Red Robin’s chief executive officer, said the improvement coincides with the addition of seating, primarily outside. “Looking ahead, we expect to build further momentum from the implementation and related seating expansion of all-weather tents and booth partitions by early in the fourth quarter along with indoor dining rooms beginning to re-open in California,” he said in a statement. As of September 6, Red Robin had $104 million in cash and equivalents and its credit facility."}]}