{"article": [{"url": "https://www.marketwatch.com/story/fauci-calls-out-fox-news-but-says-real-bad-guy-is-coronavirus-not-those-with-opposing-views-2020-09-28", "published": 1601327060.0, "headline": "Fauci calls out Fox News, but says real â\u0080\u0098bad guyâ\u0080\u0099 is coronavirus, not those with opposing views", "body": "Dr. Anthony Fauci criticized Fox News and attempted to downplay differences with White House coronavirus task force colleague Dr. Scott Atlas on Monday, saying the real enemy remains COVID-19. “ â\u0080\u009cThe bad guy is the virus. The bad guy is not the person on the other side of your opinion.â\u0080\u009d ” â\u0080\u0094 Dr. Anthony Fauci Speaking Monday night during an interview on CNN, the nationâ\u0080\u0099s foremost expert on infectious diseases said the spread of misinformation is detrimental to the nationâ\u0080\u0099s public health effort. â\u0080\u009cSome of the media that I deal with really kind of â\u0080\u0094 I wouldnâ\u0080\u0099t say distort things, but certainly give opposing perspectives on what seems to be a pretty obvious fact,â\u0080\u009d Fauci said, calling out one network in particular. â\u0080\u009cIf you listen to Fox News, with all due respect to the fact that they do have some good reporters, some of the things that they report there are outlandish, to be honest with you. â\u0080\u009cThere is so much misinformation during this very divisive time that weâ\u0080\u0099re in, and the public really needs to know the facts,â\u0080\u009d he said. Earlier Monday, Fauci told ABCâ\u0080\u0099s â\u0080\u009cGood Morning Americaâ\u0080\u009d that America is â\u0080\u009cnot in a good placeâ\u0080\u009d as it heads into the fall, as coronavirus cases have been spiking nationwide since Labor Day. â\u0080\u009cThere are states that are starting to show uptick in cases . . . And, I hope not, but we very well might start seeing increases in deaths.â\u0080\u009d He also criticized Floridaâ\u0080\u0099s move to lift restrictions on bars and restaurants. iframe.twitter-tweet { width: 100% !important; } Also Monday, Centers for Disease Control and Prevention Director Robert Redfield reportedly criticized Atlas, saying â\u0080\u009cEverything he says is falseâ\u0080\u009d on a phone conversation overheard by an NBC News reporter. Atlas has downplayed the use of face masks, opposed lockdowns to slow the spread of coronavirus, and has supported the development of herd immunity â\u0080\u0094 which could kill millions of Americans. A number of Stanford medical faculty â\u0080\u0094 where he previously worked â\u0080\u0094 recently signed an open letter condemning Atlas, saying his comments run counter to scientific evidence and undermine public health efforts. When asked by CNN about Atlas, a radiologist who lacks infectious-disease experience, Fauci attempted to downplay their differences. â\u0080\u009cIâ\u0080\u0099m concerned that sometimes things are said that are really taken either out of context or are actually incorrect,â\u0080\u009d he said. â\u0080\u009cMost [of the task force] are working together. I think, you know, what the outlier is,â\u0080\u009d Fauci said. â\u0080\u009cMy differences with Dr. Atlas, Iâ\u0080\u0099m always willing to sit down and talk with him and see if we could resolves those differences.â\u0080\u009d"}]}