{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-retreat-ahead-of-friday-jobs-report-and-as-trumps-executive-order-highlights-flare-up-in-china-us-tensions-2020-08-07", "published": 1596823040.0, "headline": "Dow, S&P 500 finish higher even as pandemic aid talks break down in DC without a deal", "body": "Major U.S. stock indexes closed mostly higher Friday, capping off another week of sharp gains, despite Washington’s failure to produce a last-minute coronavirus aid package before Congress takes a summer recess, leaving America’s economic recovery hanging in the balance. Rising tensions between Beijing and Washington also were in focus, after the Trump administration ordered a ban on transactions with a pair of China-based technology companies. How did equity benchmarks trade? The Dow Jones Industrial Average DJIA, +0.56% closed 46.50 points, or 0.2%, higher at 27,433.48, after flipping positive in the final hour of trade. The S&P 500 index SPX, +0.87% eked out a gain of 2.12 points, or 0.1%, to close at 3,351.28. The Nasdaq Composite Index COMP, +1.39% retreated 97.09 points, or 0.9%, ending at 11,010.98, after trading down more than 1.5%. The Russell 2000 Index RUT, +0.55% of small-capitalization stocks outperformed, adding 24.56 points, or 1.6%, ending at 1,569.18. For the week, the Dow gained 3.8%, its biggest percent gain since June 5. The S&P 500 rose 2.5% for its biggest weekly percent climb since July 2; while the Nasdaq climbed 2.5%. What drove the market U.S. stocks rallied in the last minutes of trade Friday, despite Washington’s failure to come up with a deal on a fiscal stimulus package before Congress breaks for summer recess. While investors remain hopeful that America’s economy eventually will receive another shot in the arm in the form of government spending, they also worry that last month’s job gains, reported by the Labor Department on Friday, might cause Congress to drag its feet. The U.S. added 1.76 million jobs in July — just one-third of the unexpected 4.8 million gain last month — with the unemployment rate falling to 10.2% from 11.1% in June. Consensus estimates from economists polled by MarketWatch had been for an increase of 1.7 million jobs on the month. “The biggest impact of the July employment numbers are political,” Steven Blitz, chief U.S. economist at TS Lombard, wrote following Friday’s employment report. “As a sense of emergency diminishes, so too the rush to push the package across the finish line.” While the jobs report was better than expected, many U.S. states remain in a battle with rising coronavirus infection rates, while millions of workers still rely on unemployment benefits to stay afloat in a crippled economy. “The economy is still on life support,” James Knightley, ING’s chief international economist told MarketWatch. “If this drags on,” he said of pandemic aid talks, “I think we’re in a more challenging period for economic growth.” Read: Next coronavirus aid package probably won’t become reality this month after better-than-expected July jobs report, analyst says House Speaker Nancy Pelosi and Democratic leaders met Friday afternoon with White House negotiators for more than a hour in a last-ditch effort to produce an estimated trillion dollar-plus coronavirus aid package before talks collapsed. As of Friday, the global tally for confirmed cases of COVID-19 climbed above 19 million, according to data aggregated by Johns Hopkins University, and the death toll rose to 715,163. The U.S. case tally climbed to 4.9 million and the death toll rose above 160,000, after the U.S. added another 1,000 deaths overnight and counted another 57,000 new cases. Out-of-work Americans already saw an extra $600 a week unemployment relief benefit expire last month, a development that when combined with recent, worrisome economic data could stymie a quick economic recovery that Wall Street has been betting on. “The stock market is counting on a deal,” said Kevin Barry, chief investment officer at Captrust, in an interview. “And every once in a while when it doesn’t get what it wants, it throws a tired, toddler tantrum, bringing down the market 3%-10%,” he warned. But Barry also thinks that for elected officials, “the stock market is not the priority. The election is the priority,” he said. “One thing that could prompt a deal, could be a poll change,” he said. “Both sides want to cushion the consumer to increase their election chances.” On Thursday, President Donald Trump told reporters that he could sign an executive order to provide fresh aid to the jobless, but presidential powers may be limited as to what if any action can be taken to provide fresh funds without Congressional approval. However, Trump did sign an executive order late Thursday that bars transactions with the parent companies of Chinese social media companies TikTok and Tencent TCEHY, +1.98%, as the president attempts to force an acquisition of TikTok’s U.S. arm in the coming 45 days. In response, TikTok, which is owned by China-based ByteDance, has threatened to sue the president, reflecting rising Sino-American tensions. “Frankly, the big story is the election,” Barry said. “Why we are doing a China app announcement now, instead of 90 days ago, is because we are in the teeth of the election.” See: Trump’s TikTok and WeChat ban hurts Chinese internet stocks — here’s why his executive order also puts pressure on MicrosoftWhich stocks were in focus? Papa John’s PZZA, -1.18% shares rose 0.6%. The pizza chain reported second-quarter revenue on Thursday that reached a record $460.6 million and North American same-store sales soared 28%. Boeing Co. BA, -0.39% shares fell 1.3% after a report that a 737 craft operated by Air India crash landed in Southern India before breaking in two. Uber Technologies UBER, -0.18% posted another quarterly loss of more than $1 billion Thursday as the COVID-19 crisis took a toll on its core ride-hailing business, which was actually surpassed by Uber’s food-delivery business. Shares fell 5.2%. Shares of Rocket Cos. RKT, +1.01%, the parent of major mortgage lender Quicken Loans, were in focus after they gained over 20% after initially falling flat following its initial public offering on Thursday. Shares ended 15.8% higher Friday. Shares of Biogen BIIB, -0.13% soared 10.1% after the company said the Food and Drug Administration had accepted the application for the company’s investigational, and somewhat controversial, Alzheimer’s disease treatment. Shares of Pfizer Inc. PFE, -0.27% gained 0.5% on Friday after it announced that it will help manufacture Gilead Sciences Inc.’s COVID-19 treatment remdesivir as part of a multiyear agreement. Dish Network Corp. shares DISH, -0.90% fell 0.4% Friday, after the satellite TV company beat second-quarter earnings estimates. T-Mobile US TMUS, +1.50% shares gained 6.5% after, briefly hitting a record high of $116 a share, after the company’s newly merged wireless company with Sprint reported 1.1 million new monthly subscribers in the second quarter, much better than Wall Street’s estimates. How did other markets trade? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 2.7 basis points to 0.562%, ending the week with a 2.6 basis point gain. Bond prices move inversely to yields. The greenback was 0.7% higher, with the ICE U.S. Dollar index DXY, -0.58% at 93.41. In Europe, the Stoxx Europe 600 index SXXP, +0.55% closed up 0.3%, booking a 2% gain for the week, and the FTSE 100 UKX, +0.64% rose 0.1%, ending the week 2.3% higher. In Asia, China’s CSI 300 index 000300, +2.04% ended trade off 1.2%, while Japan’s benchmark Nikkei NIK, -0.11% closed 0.4% lower. Hong Kong’s Hang Seng Index HSI, -0.30% closed off 1.6%. U.S. benchmark CL.1, -1.62% oil finished 1.7% lower at $41.22 a barrel on the New York Mercantile Exchange. Gold futures for December GCZ20, +2.17% lost $41.40, or 2%, settling at $2,028 an ounce."}]}