{"article": [{"url": "https://www.marketwatch.com/story/how-to-spot-whether-a-stimulus-deal-will-bring-a-short-lived-stock-market-bounce-or-a-sustained-rally-strategist-says-11601897339", "published": 1601981060.0, "headline": "Here's how to spot whether a stimulus deal will bring a 'short-lived' stock market bounce or a sustained rally, strategist says", "body": "The stock market bounce following any new stimulus deal is likely to be 'short-lived', Mill Tabak & Co warned. Matthias Hangst/Getty Images Any near-term bounce from a new fiscal plan is likely to be \"short-lived,\" according to Miller Tabak & Co's lead strategist Matt Maley. Maley said Trump's positive COVID-19 test improved the chances of a new stimulus boost, as it gave both sides the opportunity to concede ground without losing face. However, he warned multiple factors meant any pop fueled by a deal would be brief. Read: Trump's coronavirus recovery, stimulus hope, election clarity: What's really driving the market? \"We believe an agreement on a new fiscal plan is likely, but we're not so sure it will help the stock market rally in a sustainable way. The market is still quite overvalued and the combination of the weakening employment picture plus a second wave of the virus does not bode well for any improvement for the 'E' part [earnings] of the P/E ratio going forward,\" Maley said. \"More importantly, history shows us that stimulus programs play a much bigger role as a catalyst for a strong/sustained rally when the stock market is flat on its backâ\u0080¦not after a strong six-month rally,\" he said, noting that the S&P 500 SPX, +0.87% was still more than 50% above its March lows,\" he said. He added that another \"down-leg\" to the September correction will come in October before we see a sustainable rally in stocks. But the strategist said Miller Tabak & Co one important indicator - chip stocks - would signal whether they were wrong. \"The chip stocks have been a very important leadership group for the broad stock market, so it's action over the coming days and weeks should be vitally important.\" He said if the SMH semiconductor ETF SMH, +1.71% can break above its September closing highs of $183.55 it was \"very, very bullish on several different levels.\" \"If that happens, we'll have to change our tune rather quickly.\""}]}