{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-case-tally-tops-24-million-us-tally-above-58-million-and-experts-say-testing-and-tracing-is-crucial-2020-08-27", "published": 1598542220.0, "headline": "Coronavirus update: Global case tally tops 24 million as U.S. tally tops 5.8 million, and CDC head walks back testing change amid outcry", "body": "The number of confirmed cases of the coronavirus illness COVID-19 worldwide climbed above 24 million on Thursday, and the U.S. tally topped 5.8 million, as the head of the Centers for Disease Control and Prevention walked back a change in guidelines on testing following a storm of criticism from doctors and scientists. Just days after the agency quietly revised its guidance on testing to exclude asymptomatic patients, CDC head Robert Redfield said “testing may be considered for all close contacts of confirmed or probable COVID-19 patients,” according to media reports. It was a sudden about-turn that came after leading public health experts, including the Harvard Global Health Institute, said the change would lead to more cases and more deaths. The new guidance represented “a major departure from the evidence-based policy on tracing and testing contacts of positive cases that has played a key role in the success of states such as New York and Massachusetts and countries such as Germany and South Korea to contain the virus,” the HGHI said in a statement. Until Monday, the CDC was recommending that people who had spent more than 15 minutes with an individual who had tested positive for the virus should also get tested, regardless of the presentation of symptoms. One reason the virus has spread so far and so fast is because it is spread by patients with no symptoms, who account for an estimated 40% of confirmed cases, according to one research letter published in May in JAMA Network. Other estimates suggest up to 50% of infected patients are asymptomatic. That’s why health experts are urging all Americans to wear face masks, wash their hands frequently and socially distance from others who may have the virus without knowing it. The CDC’s guidance shift on testing had been championed by White House officials, according to a New York Times report. President Donald Trump has repeatedly said the U.S.’s world-leading case tally is due to its conducting more tests, an argument that has been dispelled by scientists and doctors — and one that has aggravated concerns that government agencies are being politicized in the Trump era. See:U.S. death toll tops 177,000 as FDA head acknowledges he misspoke on convalescent plasma The reversal marks the second embarrassment this week for a major U.S. public health agency. On Monday, the head of the U.S. Food and Drug Administration, Stephen Hahn, acknowledged in a tweet that he misspoke at a Sunday briefing. Standing beside Trump at the White House, with Trump having promised a major announcement, Hahn told reporters that a study had shown convalescent plasma achieving a 35% improvement in survival in a COVID-19 trial. “What that means is — and if the data continue to pan out — 100 people who are sick with COVID-19, 35 would have been saved because of the administration of plasma,” Hahn said. At that Sunday press conference Hahn announced an emergency-use authorization for convalescent plasma as a treatment for hospitalized patients. The briefing was held on the eve of the Republican National Convention. Trump hailed the EUA as a “breakthrough.” A day earlier, Trump had criticized the FDA for being slow to approve therapies and treatments for COVID-19 and suggested staffers were holding off until after the November presidential election. “I have been criticized for remarks I made Sunday night about the benefits of convalescent plasma. The criticism is entirely justified,” Hahn subsequently wrote on Twitter. “What I should have said better is that the data show a relative risk reduction not an absolute risk reduction.” In the letter describing the EUA, which is not equivalent to a full FDA approval, the chief scientist for the FDA, Denise Hinton, said: “COVID-19 convalescent plasma should not be considered a new standard of care for the treatment of patients with COVID-19. Additional data will be forthcoming from other analyses and ongoing, well-controlled clinical trials in the coming months.” New York Gov. Andrew Cuomo, California Gov. Gavin Newsom and Washington state Gov. Jay Inslee had all criticized the CDC testing-guidance change and said they would not comply. Cuomo dismissed it as yet another political move by Trump, and not one based on science. iframe.twitter-tweet { width: 100% !important; } In other news: • France is gearing up to mandate that all residents of Paris wear face masks in public, following a surge in new infections in recent weeks. Prime Minister Jean Castex said the country could lose control of the outbreak if more isn’t done. “The virus is spreading all over the country,” Castex told reporters at a briefing. “ The spread of the epidemic could become exponential if we do not react quickly. The French reproductive rate, or “R” number, has risen to 1.4, said Castex, meaning that every 10 infected people are infecting another 14. Experts say an “R” number above 1 is risky. France is eager to avoid another lockdown that would hurt its economy, but the virus is spreading fast among young people. • The World Health Organization said young people have become a core group being infected and infecting others across Europe, which has seen a worrying spike in cases in recent weeks, including in countries like Spain, Italy and Germany that seemed to have succeeded in containing the spread. Dr. Hans Henri P. Kluge, WHO regional director for Europe, said young people need to be aware that “no one is invincible” and the pandemic is a “tornado with a long tail,” the Guardian reported. • The North Carolina State University is closing residence halls and ordering students to leave campus by Sept. 6, as it moves to contain a cluster of new cases, some of which are believed to steam from college parties, the Washington Post reported. “We hoped and strived to keep residence halls open and safe to best serve our students,” Chancellor Randy Woodson wrote in a memo to students. “However, the rapid spread and increasing rate of positive cases have made our current situation untenable.” The university has reported 24 clusters in residence halls, off-campus apartment blocks and Greek housing since it resumed classes earlier in August, according to the Raleigh News and Observer. • South Korea counted 441 new COVID-19 cases on Wednesday, its highest tally since early March, according to the Korea Centers for Disease Control and Prevention. The country now has 18,706 cases and 313 deaths. Latest tallies There are now 24.3 million confirmed cases of COVID-19 worldwide, according to data aggregated by Johns Hopkins University, and at least 827,670 people have died. About 15.8 million people are confirmed to have tested positive and recovered. The U.S. has the highest case tally in the world and the highest death toll at 180,249. On a per capita basis, the U.S. is fourth in the world at 54.93 deaths per 100,000 people, behind Peru, Chile and Brazil, the data show. Brazil is second to the U.S. by cases with 3.7 million and 117,665 deaths. India is third measured by cases at 3.3 million, followed by Russia with 972,972 and South Africa with 615,701. Mexico has 573,888 cases and 62,076 deaths, the third highest in the world. India now has 60,472 deaths, putting it ahead of The U.K. That country has 332,491 cases and 41,564 fatalities, the highest in Europe and fifth highest in the world. China, where the illness was first reported late last year, has 89,805 cases, and 4,715 fatalities Cities After Covid: More Tech, Health and Open Spaces What’s the latest medical news? A meeting of a CDC Advisory Committee on Wednesday revealed some of the challenges facing potential COVID-19 vaccine candidates, including the storage and distribution challenges facing mRNA vaccines which have strict temperature requirements, as Leerink analysts discussed in a Thursday note. A traditional vaccine uses small doses of a disease-causing organism, or the protein it produces, to get the immune system to respond. An mRNA vaccine seeks to trick the body into producing viral proteins. No mRNA vaccine has yet been approved for any indication. Both Moderna Inc. MRNA, +0.09%, which presented more clinical data from its vaccine trial showing it triggered antibodies in elderly patients, and Pfizer Inc. PFE, -0.27% and BioNTech SE BNTX, +1.23%, which promised a pre-print from their trial will be available in the next week or so, are developing mRNA vaccines. The Moderna one must be kept at minus 20 degrees Celsius, while the Pfizer/BioNtech one must be kept at minus 70, said Leerink analysts. The advisory committee expressed concerns about that requirement, “and view this as significantly limiting vaccine distribution, storage and administration,” the analysts wrote. “We share the same concern as the ACIP, and believe these storage conditions would make traditional office or pharmacy administration very difficult.” For more, see:Moderna and Pfizer’s COVID-19 vaccine candidates require ultra-low temperatures, raising questions about storage, distribution Overall, the meeting sought to assuage the general public that the CDC is monitoring vaccine safety, even as scientists work to rapidly develop one that is effective in treating COVID-19, they wrote. See also: This Seattle man volunteered to be injected with an experimental COVID-19 vaccine: ‘It was kind of my duty as a healthy individual to step up’ Elsewhere, Abbott shares ABT, +1.02% jumped 7% Thursday, after the company won emergency use authorization in the U.S. for a rapid COVID-19 test that costs just $5, does not require instrumentation, and can produce a result in 15 minutes. The test is of particular interest given that there are wait times of days or sometimes weeks to receive a COVID-19 test result. Abbott said the test must be performed by a health care professional in a point-of-care setting; however, people who receive the test can download a new free mobile app that will provide a verifiable test result that includes the date the test was performed. The display of results will be similar to a digital boarding pass used by airlines. “Just as interest in COVID-19 testing seemed to be waning, Abbott once again answers, the bell” Raymond James’ Jayson Bedford told investors on Thursday. “The timing of this [emergency use authorization] is a positive surprise, as is the price, accuracy, and capacity.” The diagnostics maker has developed and launched six COVID-19 diagnostic and antibody tests during the pandemic. What’s the economy saying? The historic plunge in gross domestic product in the second quarter was revised down slightly to show a 31.7% annual decline, underscoring the devastation to the economy spawned by the coronavirus pandemic, MarketWatch’s Jeffry Bartash reported. Economists polled by MarketWatch had forecast GDP to slow a 32.5% drop. The government last month initially put the decline at a record 32.9%. GDP is the official scorecard of the U.S. economy, measuring consumer spending, business investment, government outlays and other contributors to growth. The U.S. is on track for a sizable rebound in the third quarter despite a summer surge in the coronavirus. Growth began to recover in May and it’s continued through August, though at a slower pace. See also:The New York City office may be in limbo, but dead? Fuhgeddaboudit GDP is forecast to expand at a 20% annual clip in the third quarter, according to the latest MarketWatch forecast. “While the economy has already made some headway toward recovery, the [GDP] figure is an important testament to the sharp economic pain inflicted by the coronavirus pandemic and should motivate policymakers to get their act together to preserve the nascent recovery, wrote senior economist Lydia Boussour of Oxford Economics in a note to clients. See:‘A massive welfare economy’ - huge federal aid prevents an even steeper GDP collapse Separately, new applications for jobless benefits fell again in late August to just above 1 million and resumed a downward trend, perhaps signaling the resumption of a gradual if painfully slow recovery in the U.S. labor market. Initial jobless claims, a rough gauge of layoffs, declined by 98,000 to 1 million in the seven days ended Aug. 22, the Labor Department said Thursday. Economists polled by MarketWatch had forecast 1 million new claims. These seasonally adjusted figures reflect applications filed the traditional way through state unemployment offices. New claims rose sharply last week after briefly falling below the 1 million mark for the first time since the coronavirus epidemic began in March, but most economists suspect problems with the seasonal adjustments or other temporary factors. The actual number of new claims suggests that might have been the case. They fell again to 821,591 and remained below 1 million for the fourth week in a row. MarketWatch is reporting select jobless claims data using actual (unadjusted) figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have become distorted by the pandemic and appear to overstate new claims at times. The number of people receiving traditional jobless benefits through the states, meanwhile, dropped by a seasonally adjusted 223,000 to another pandemic low of 14.54 million. It was the fourth straight decline. Read also:Fed adopts ‘average inflation target’ of 2% as new policy These so-called continuing claims are reported with a one-week lag and cover the seven days ended Aug 15. The actual total was somewhat lower at just under 14 million. “The risk of permanent damage to the labor market remains high, which will slow the pace of recovery. The return to pre-pandemic levels of prosperity is set to be an uncertain and prolonged process,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics.What are companies saying? • Burlington Stores Inc. BURL, +0.22% reported a smaller-than-expected loss for the second quarter, but sales tumbled 39% to fall short of estimates as stores were shuttered during the pandemic. Sales in re-opened stores fell 14% from the date of reopening to end of the quarter. “The second quarter had some highs and some lows,” Chief Executive Michael O’Sullivan said in a statement. “The pace of our re-opening sales significantly exceeded our expectations, and we turned our aged spring merchandise very rapidly.” The company is expecting business to pick up as soon as it replenishes its inventory, but expects continued risk in the third quarter. It is not offering profit and sales guidance because of the uncertainty created by the pandemic. “We have plenty of liquidity and we will use this to support opportunistic buys of fall merchandise and of pack and hold inventory that we will flow to stores next year,” said O’Sullivan. The company had $1.197 billion in liquidity at quarter-end. • Coty Inc. COTY, -5.08% posted far weaker-than-expected earnings for its fiscal fourth quarter as the coronavirus pandemic crushed sales. “Coty’s fourth quarter was marked by external shocks, as the COVID-19 pandemic triggered a crisis in the real economy and supply,” Chief Executive Peter Harf said in a statement. “The severe sales contraction for total Coty, with revenues down $1.2 billion year-over-year, led to significant operating deleverage in the quarter, even as the company focused all its efforts on protecting free cash flow which came in line with our expectations.” The company is expecting a “significant improvement” in the first quarter of fiscal 2021. The divestiture of Wella is on track to close in 2020 and the company is aiming to cut $200 million in costs in fiscal 2021. •Dollar General Corp. DG, +0.95% reported second-quarter profit and sales that beat expectations, spurred by demand during the pandemic. Same-store sales were up 18.8%, ahead of the FactSet consensus for a 14.9% rise. Dollar General resumed its share buyback program during the quarter, repurchasing $602 million in common stock, leaving a total of $481 million remaining. The company authorized an additional $2.0 billion on August 26. On August 25, the company declared a dividend of 36 cents per share payable on or before October 20 to shareholders of record as of October 6. The company continues to experience heightened demand due to COVID-19, with same-store sales rising 15% from August 1 to August 25. • Dollar Tree Inc. shares DLTR, +2.30%, the operator of Family Dollar and Dollar Tree stores, posted better-than-expected second-quarter earnings but said customer visits are declining during the pandemic. Total same-store sales rose 7.2%, above the FactSet consensus of up 6.2%. Family Dollar same-store sales rose 11.6%, while Dollar Tree same-store sales were up 3.1%. The company is not providing guidance, given the uncertainty created by the pandemic, but it noted some changes. “Consumer shopping patterns are evolving,” Chief Executive Mike Witynski said in a statement. “Customers are shopping with a purpose, while looking to minimize risk and exposure. As a result, we are seeing material increases in average ticket, while seeing a decline in average visits.” The company is still expecting to open 500 new stores by year-end. It ended the quarter with $1.75 billion in cash. • Otis Worldwide Corp. OTIS, +0.98% has commissioned a study examining elevator airflow and how it affects the risk of transmitting COVID-19 among passengers. The study will be led by Dr. Qingyan (Yan) Chen, the James G. Dwyer Professor of Mechanical Engineering at Purdue, an infectious disease expert. Otis is seeking to understand how to mitigate transmission risk in elevators with safety protocols. The elevator company was spun out of the former United Technologies in April. • Sanderson Farms Inc. SAFM, -3.07% topped earnings and revenue expectations for its fiscal third quarter despite disruptions to the chicken producer’s business from restaurant closures amid the pandemic. “Our financial results for the third quarter of fiscal 2020 reflect extreme market volatility for products sold to food service customers, continued strong demand for products sold to retail grocery store customers, reduced volumes due to planned egg set reductions implemented during the early stages of the pandemic, and lower costs of feed grains,” Sanderson Farms said in its earnings release. The company’s food-service business has been hurt by restrictions on restaurants due to the COVID-19 crisis. • Vital Farms Inc. VITL, +1.74% is getting a boost from the increased at-home meal preparation that COVID-19 has spurred. Vital Farms, an “ethical food company” that began trading on July 31, has rallied 14% for the month to date. “COVID-related demand has benefited the egg and dairy categories and Vital Farms as well resulting in a surge in sales over the past five months,” wrote Stifel analysts. They initiated coverage of Vital Farms with a buy stock rating and $43 price target. “We believe this elevated rate of at-home food demand will continue at least through year-end supporting even stronger growth for the business.” BMO Capital Markets initiated Vital Markets at market perform with a $40 price target. “Vital Farms should benefit from a first-mover advantage in pasture-raised eggs as it has created the necessary scale at a national level across its farmer network, egg production, distribution, and market share (76%) for a differentiated, ethical business model.” Among the items in the Vital Farms lineup are pasture-raised eggs, butter and ghee. • Williams-Sonoma Inc. WSM, +1.34% reported a second-quarter adjusted profit that beat expectations and sales that met forecasts, highlighting its online sales during the pandemic. Revenue rose 9% to $1.49 billion, the company said, thanks to “a significant acceleration in e-commerce revenue growth to approximately 46%.” E-commerce penetration reached an all-time high of almost 76% of total company revenues, Williams-Sonoma said. “Longer term, we believe the behavioral changes and industry shifts that have emerged from the pandemic will persist and continue to favor our business,” Chief Executive Laura Alber said in a statement. “We are investing in the next phase of our growth and the opportunities that position us for accelerated market share gain.”"}]}