{"article": [{"url": "https://www.marketwatch.com/story/watch-rand-paul-boils-dr-faucis-coronavirus-response-down-to-we-cant-do-this-we-cant-do-that-2020-06-30", "published": 1593529280.0, "headline": "WATCH: Rand Paul boils Dr. Fauci's coronavirus response down to 'we can't do this, we can't do that'", "body": "A Senate hearing over the nation's coronavirus response got pretty heated on Tuesday, with Sen. Rand Paul questioning whether the country's top infectious disease experts have been doing more harm than good during the pandemic. \"It is a fatal conceit to believe any one person or small group of people has the knowledge necessary to direct an economy or dictate public health behavior,\" the Republican and libertarian from Kentucky said during the Senate Health, Education, Labor and Pensions Committee hearing. \"We shouldn't presume that a group of experts somehow knows what's best for everyone.\" His argument was that health experts and government \"planners\" are weighing in on subjects and expressing opinions that affect everyday public life before getting all of their facts straight. \"It's important to realize that if society meekly submits to an expert and that expert is wrong, a great deal of harm may occur when we allow one man's policy or one group of small men and women to be foisted on an entire nation,\" he said. And Paul, who tested positive for the coronavirus in March, when he drew flak for not quarantining while he was awaiting his test results, directed some of his sharpest rebukes toward Anthony Fauci on Tuesday. \"Dr. Fauci, every day, virtually every day, we seem to hear from you things we can't do,\" he said. \"But when you're asked, 'Can we go back to school?' I don't hear much certitude at all. 'Well, maybe. It depends.'\" “ \"All I hear, Dr. Fauci, is, 'We can't do this, we can't do that. We can't play baseball.' Well, even that's not based on the science.\" ” - Sen. Rand Paul \"We just need more optimism,\" Paul said. Fauci, the director of the National Institute of Allergy and Infectious Diseases, responded by noting he agrees with a lot of what Paul said, particularly with regards to people sharing opinions not backed by scientific data. He also said that \"we need to do whatever we can to get the children back in school.\" But, Fauci continued, \"Sometimes you have to make extrapolations because you're in a position where you need to give some sort of recommendation.\" And he noted that his recommendations are often interpreted in ways that he did not intend. “ \"The only thing that I can do is, to the best of my ability, give you the facts.\" ” - Dr. Anthony Fauci \"I never said we can't play a certain sport,\" he said. (Although it should be noted that he did recently warn that \"football may not happen this year\" on CNN.) \"I agree with you. I am completely unqualified to tell you whether you can play a sport or not,\" he continued. \"The only thing that I can do is, to the best of my ability, give you the facts and the evidence associated with what I know about this outbreak. Thank you.\" Watch some of that exchange here iframe.twitter-tweet { width: 100% !important; } The back-and-forth had Paul's name trending on Twitter TWTR, -0.23%  on Tuesday afternoon, as the debate illustrated the split opinions Americans have had to the widespread closures and social distancing guidelines across the country since the pandemic began. And that drew plenty of heated reactions online. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } More than 2.5 million Americans have been infected with COVID-19, and 129,545 and counting have died as of Tuesday afternoon. And as cases continue to climb across many parts of the country, Fauci also warned on Tuesday that the number of confirmed coronavirus infections could go up to 100,000 a day. Related:Fauci makes dire warning for America in the ongoing fight against coronavirus Read more of MarketWatch's coronavirus coverage here."}]}