{"article": [{"url": "https://www.marketwatch.com/story/netflix-is-making-a-huge-international-expansion-after-successes-with-sex-education-and-the-crown-11602242714", "published": 1602235460.0, "headline": "Netflix is pushing for huge international expansion after successes with 'Sex Education' and 'The Crown'", "body": "The U.K. has been home to a number of high-profile streaming successes for Netflix in recent years. Alastair Pike/Agence France-Presse/Getty Images Netflix is set to triple its office space in the U.K., in a long-term investment that follows a string of high-profile successes in the country. The streaming giant will move into the Copyright Building in London's West End, increasing the company's office footprint to around 100,000 square feet and adding to its existing presence in the city from a 20,000-square-foot office near Oxford Circus. The U.K. has been home to a number of high-profile streaming successes for Netflix NFLX, +1.43% in recent years, with British-made shows like \"Sex Education\" and \"The Crown\" capturing audiences globally. Also read: Netflix pulled off a showstopper early in the pandemic, but will the sequel deserve the price? \"As part of our ongoing commitment to the U.K., we are excited to expand our operations in London through the lease of additional office space,\" Netflix said. \"It will ensure that we can better serve our members and the local creative community, including investing in stories like 'The Crown,' 'Sex Education,' 'Rebecca' and 'Too Hot To Handle,' that are made in the U.K. and watched by the world.\" \"The Crown\" has won critical acclaim for its portrayal of Queen Elizabeth II and the royal family, taking home three Golden Globe Awards and three Emmy awards since 2017, as well as scooping up dozens of other nominations and prizes. \"The U.K. is a relatively efficient market for Netflix to scale in because audience preferences around content are more similar to the company's North American audience,\" said Daniel Thomas, an analyst at Third Bridge. \"Meaning original content spend can be amortized over a larger base of subscribers in theory. \" The Silicon Valley company employs 269 people in the U.K., where it made over 50 productions last year. This expansion marks a long-term investment in the British creative economy, and is expected to create jobs both in front of and behind the camera. Thomas noted that \"if Netflix starts spending large amounts on original content for its U.K. audience this could make it harder for traditional broadcasters to acquire talent, scriptwriters and stage space for its own programming. \" Plus: Netflix stock gains after Pivotal Research boosts target to new Street high of $650 Netflix will take over the lease of the 87,000-square-foot office from the outsourcing company Capita CPI, +2.92%. It is the latest U.S. tech company to make a big expansion in the U.K. with office space in London. Facebook FB, +0.26% and Amazon AMZN, +3.01% have signed big real-estate deals in the city in recent years, while Google parent Alphabet GOOGL, +1.82% and Apple AAPL, +1.74% are set to move into huge new London headquarters next year. Shares of Netflix have jumped 64% since the beginning of the year. Even as production of new shows and movies was stalled by lockdowns, the streaming company has emerged as one of the business success stories of the coronavirus pandemic era. With millions of people housebound by lockdowns, signups surged. The company reported that almost 16 million people created accounts in the first three months of 2020."}]}