{"article": [{"url": "https://www.marketwatch.com/story/should-i-still-use-the-6040-investing-rule-for-retirement-2020-07-24", "published": 1597507760.0, "headline": "Should I still use the 60/40 investing rule for retirement?", "body": "The 60/40 rule is a classic investing strategy, but whether it’s useful is up for debate. Not all financial advisers and investment professionals say it’s the best choice when saving for retirement. Vanguard Group defended the strategy in a recent note to its clients, saying the asset allocation allows investors and their portfolios to combat volatility — such as during the current global pandemic. The 60/40 rule dictates 60% of the portfolio is invested in stocks and 40% in bonds or other “safe” classes. Read:Vanguard comes to the defense of the 60/40 portfolio Comparatively, some financial services firms, such as Bank of America BAC, have said the 60/40 rule is essentially dead. In a research note published last year called “The End of 60/40,” Bank of America portfolio strategists said “there are good reasons to reconsider the role of bonds in your portfolio.” Instead, investors should focus more of their attention on equities. See:Retirees should consider today’s most unpopular investment — here’s why Reconsidering the 60/40 construction can be a good idea for some investors. “It is a good core portfolio that has stood the test of time, but considering the current interest rate environment, the use of a much more highly diversified portfolio makes more sense to mitigate risk and create more consistent expected returns for investors,” said Thomas Rindahl, a financial adviser at Truwest Wealth Management Services. 80% of older Americans can't afford to retire - COVID-19 isn't helping The investments within equities and bonds are also crucial to determining just how effective it is in protecting investors from steep declines while still growing. Bond exposure alone isn’t enough to hedge against major volatility, said Matthew McKay, an investment analyst at Briaud Financial Advisors. Treasury Bonds would be beneficial, but corporate bonds or asset-backed securities are typically included in selloffs in a panic. There’s also no inflation protection, or no holdings in commodities. The strategy is also generic, and doesn’t take into account personal needs and factors, including age, spending, amount already saved, and other expected retirement income, such as Social Security or pensions, said Larry Luxenberg, a principal at Lexington Avenue Capital Management. “Everyone should think about asset allocation but where they end up is an individual matter,” he said. Instead of restricting a portfolio to just two asset classes — stocks and bonds — investors should look at those as well as other asset classes. “I argue that investing based on age or expected retirement, while only considering two types of assets (stocks and bonds) is a bit thoughtless,” McKay said. The bucket approach may be better, which divides portfolios into “buckets” for various goals that are invested differently to achieve those aspirations, said Marguerita Cheng, chief executive officer of Blue Ocean Global Wealth. “Sixty-forty isn’t necessarily dead per se, but cookie cutter or template models may not work because not everyone’s situation is the same,” she said. Also see: It took decades for me to retire ‘wealthy’ — should I feel guilty? Still, it’s a good starting point. The 60/40 rule is also known as the “Goldilocks Portfolio,” said Mackenzie Richards, a financial planner at SK Wealth Management. “Not too risky, but not overly safe,” he said. “Something that will allow a retiree to keep pace with the increasing cost of living.” During volatility, having the presence of bonds in a portfolio still prevents such steep declines from blows to equities, said Herschel Clanton, president of Chancellor Wealth Management. “The 60/40 portfolio still has value,” he said. Some experts may be saying the portfolio strategy is dead because the bull market is over, which weakens the 60% portion of the allocation, and interest rates are low, which hinders the steady income from the 40% side, Richards added. But that’s a nearsighted perspective, he said. “These market prophets tend to focus on the short-term situation, failing to think about the different market cycles that a retiree is going to experience over the rest of their lifetime,” he said. “With these cycles, as we have seen over the past 100 years, there is going to be fluctuation in stock prices as well as interest rates.”"}]}