{"article": [{"url": "https://www.marketwatch.com/story/a-tale-told-by-an-idiot-cnbcs-jim-cramer-urges-investors-not-to-be-fooled-by-new-highs-in-the-stock-market-2020-08-19", "published": 1598084540.0, "headline": "â\u0080\u0098A tale told by an idiotâ\u0080\u0099 â\u0080\u0094 CNBCâ\u0080\u0099s Jim Cramer urges investors not to be fooled by new highs in the stock market", "body": "“ â\u0080\u0098The S&Pâ\u0080\u0099s new highs are a tale told by an idiot, full of sound and fury, signifying nothing about the hardship of millions of people on food stamps, or the millions about to be fired from service jobs, or the homeless, or the people who are just huddled at home waiting for the vaccine, which currently feels a lot like waiting for Godot.â\u0080\u0099 ” Thatâ\u0080\u0099s CNBCâ\u0080\u0099s Jim Cramer summoning his inner Samuel Beckett to talk about the disconnect between equities and the harsh reality of whatâ\u0080\u0099s going on in the U.S. economy. â\u0080\u009cWeâ\u0080\u0099ve had a magnificent V-shaped recovery in the stock market, but the stock marketâ\u0080\u0099s not a great reflection of the broader economy anymore,â\u0080\u009d Cramer said. The S&P 500 SPX, +0.87% just banged out another record high, as did the Nasdaq Composite COMP, +1.39% Â . The Dow Jones Industrial Average DJIA, +0.56% Â still has a ways to go. â\u0080\u009cYou donâ\u0080\u0099t need to be a rocket scientist to figure this out,â\u0080\u009d Cramer said. â\u0080\u009cJust look the stocks that have brought us to these levels â\u0080\u0094 theyâ\u0080\u0099re not the recovery plays. In fact, they are the opposite. They are stocks that tend to do well, because of what we call secular considerations.â\u0080\u009d Heâ\u0080\u0099s talking about digitization, short hand for â\u0080\u009ccut out the fat,â\u0080\u009d as Cramer sees it. Itâ\u0080\u0099s not â\u0080\u009cclassic recovery stocksâ\u0080\u009d â\u0080\u0094 industrials or retail or banks â\u0080\u0094 pushing indexes to new highs. Rather, itâ\u0080\u0099s the likes of Apple AAPL, +1.74% Â , Amazon AMZ, +1.47% and Microsoft MSFT, +2.48% Â . â\u0080\u009cThe winners in this market are the companies that are most divorced from the underlying economy,â\u0080\u009d Cramer said on his â\u0080\u009cMad Moneyâ\u0080\u009d show on Tuesday. â\u0080\u009cThe actual economy is in precarious shape, especially now that the governmentâ\u0080\u0099s stimulus package has run out and Congress went home for the summer rather than trying to come up with a replacement.â\u0080\u009d Watch the full segment: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } The disconnect continued on Wednesday, with all major averages moving higher."}]}