{"article": [{"url": "https://www.marketwatch.com/story/trump-wants-perfect-hair-from-stronger-water-pressure-in-the-shower-his-energy-department-delivers-2020-08-12", "published": 1597306700.0, "headline": "Trump wants â\u0080\u0098perfectâ\u0080\u0099 hair from stronger water flow in the shower â\u0080\u0094 his Energy Department delivers", "body": "The Department of Energy on Wednesday took the next step in delivering on President Donald Trumpâ\u0080\u0099s January pledge to get â\u0080\u009crid of the restrictorsâ\u0080\u009d on water flow from showerheads, which the president has notoriously said keep him from having perfect hair. â\u0080\u009cSo showerheads â\u0080\u0094 you take a shower, the water doesnâ\u0080\u0099t come out. You want to wash your hands, the water doesnâ\u0080\u0099t come out. So what do you do? You just stand there longer or you take a shower longer? Because my hair â\u0080\u0094 I donâ\u0080\u0099t know about you, but it has to be perfect. Perfect,â\u0080\u009d Trump said from the White House grounds in July. Showers are just one part of a series of proposed rollbacks on regulations limiting household water use, including for washing machines and dishwashers. Last year, the Competitive Enterprise Institute and other groups circulated a petition arguing that efficiency rules gobbled up too much time because formerly one-hour dishwasher cycles had turned into 2 1/2-hour jobs because of less-powerful water flow. Since 1992, federal law has dictated that new showerheads shouldnâ\u0080\u0099t pour more than 2.5 gallons of water per minute as the country moved to more efficiency and cost savings. As popularity for multiple nozzles inside a single shower became trendy, the Obama administration defined the showerhead restrictions to apply to what comes out in total. So if there are four nozzles, no more than 2.5 gallons total should flow between all four. The new proposal Wednesday would allow each nozzle to spray as much as 2.5 gallons per minute, not just the overall shower system. The Department of Energyâ\u0080\u0099s own database of 12,499 showerheads from a range of manufacturers showed 74% of them use two gallons or less of water per minute, which is 20% less than the federal standard. â\u0080\u009cThe new plan is a gimmick in search of a problem. Complaints about inadequate showerheads were frequent decades ago, immortalized in a 1996 â\u0080\u0098Seinfeldâ\u0080\u0099 episode,â\u0080\u009d said Andrew deLaski, executive director of the energy conservation group Appliance Standards Awareness Project. â\u0080\u009cBut for many years now, weâ\u0080\u0099ve had a fix for poorly performing models, one that requires no action by the Trump administration.â\u0080\u009d The proposed regulatory rollback is part of a much broader push by the administration to lighten what it argues are prohibitive regulations on business, and apparently, on households. Several Environmental Protection Agency rules, many in place for decades, have been stripped, some, the administration says, because they are unduly confusing or multilayered. In fact, a group of past EPA bosses from both political parties have called for an EPA reset after the November election. Read:Trump signs plan to spend $3 billion a year on national parks and public land during a 2020 crammed with EPA rollbacks Energy Department spokeswoman Shaylyn Hynes told the Associated Press that the 2013 Obama administration definition of â\u0080\u009cshowerheadâ\u0080\u009d clashes with what Congress intended, as well as the standards of the American Society of Mechanical Engineers. Initially, federal law prohibited states from setting stricter requirements, but this state preemption expired when the DOE failed to update the national standards. Six states, comprising about one-fourth of the U.S. population, have their own showerhead standards that save at least 20% compared to the national levels. Wednesdayâ\u0080\u0099s proposed rule change also applies to washers and dryers, rolling back their efficiency standards. The changes could be challenged in court. The current efficiency standards for washing machines, which were set in 2012, save a typical consumer $365 over the life of an appliance, when factoring both utility bills and purchase costs, said the Appliance Standards Awareness project, which is opposed to the administrationâ\u0080\u0099s changes. The group also pointed out current severe drought conditions in the western United States as just one major reason that lighter water restrictions could come at a dangerous time. The federal-level change calls for creating a separate â\u0080\u009cproduct classâ\u0080\u009d specifically for washing machines that have a short cycle as their â\u0080\u009cnormalâ\u0080\u009d cycle. Such machines would have no energy efficiency or water-use standard, at least until one was developed, which may take years. Most new washing machines already have a short cycle as an option. Ultimately, the administrationâ\u0080\u0099s plan would raise greenhouse gas emissions when more fuel is burned in homes with gas water heaters and at the power plants that supply power to homes with electric water heaters, opponents have said. Plumbers say shower-flow issues have little to do with available water, but rather are specific to a homeâ\u0080\u0099s own system. Or, a slow shower may simply require an inexpensive showerhead swap. The Associated Press contributed to this report."}]}