{"article": [{"url": "https://www.marketwatch.com/story/3-things-to-know-about-apples-stock-split-2020-08-28", "published": 1598860100.0, "headline": "Three things you need to know about Appleâ\u0080\u0099s stock split", "body": "Apple Inc.â\u0080\u0099s stock price appears quite a bit lower Monday morning, but investors shouldnâ\u0080\u0099t fret. The iPhone and Mac giantâ\u0080\u0099s four-for-one stock split officially took place after the close of trading Friday, and Apple AAPL, +1.74% Â anticipates that the move will make its shares â\u0080\u009cmore accessible to a broader base of investors.â\u0080\u009d As a result of the split, Apple shareholders will own four shares for every one they held prior. Itâ\u0080\u0099s a notable day as well for Tesla Inc. TSLA, +1.89%, which is conducting a five-for-one split after Fridayâ\u0080\u0099s closing bell and will see its stock also begin trading on this new basis Monday morning. Here are three things to know about Appleâ\u0080\u0099s stock split. How it works After Fridayâ\u0080\u0099s closing bell, Apple shareholders are due the split shares for each existing share of the company that they own. This is applicable for those who were shareholders of record by Aug. 24, though Apple said that those who bought shares between the record date and the time of Fridayâ\u0080\u0099s split would also be issued split shares. Apple shares officially start trading at the new split-adjusted price at the opening bell of Mondayâ\u0080\u0099s Nasdaq session. Apple announced its plan for the split on July 30 with its most recent earnings report. Expect Appleâ\u0080\u0099s stock price to be about 75% lower when trading begins Monday morning as a result of the split â\u0080\u0094 shares closed Friday at $499.23, suggesting that they will open around $124.81, though the tenor of premarket trading could affect that. While some systems may appear to register that Appleâ\u0080\u0099s stock has actually declined by 75%, the historical records will eventually be adjusted so that Appleâ\u0080\u0099s past stock prices are also reflected on a split-adjusted basis. Historical precedent This marks Appleâ\u0080\u0099s fifth stock split in its time as a public company. It went public in December 1980. Apple conducted a seven-for-one split on June 9, 2014, and two-for-one splits on June 16, 1987, June 21, 2000, and Feb. 28, 2005. Had Apple never split its stock, shares would currently be changing hands for roughly $28,000 apiece. With the historical adjustments, previous events and prices will be changed. For instance, Apple priced shares in its 1980 initial public offering at $22 a shares. After its first four stock splits, though, that price fell to 39 cents a shares in the historical register, and it will fall again â\u0080\u0094 to about a dime â\u0080\u0094 after this split.Shaking up the Dow Accessibility aside, Appleâ\u0080\u0099s stock split also helps bring its stock price more in line with peers in the Dow Jones Industrial Average DJIA, +0.56%, which is weighted by price. Trading just shy of $500 before the split, Apple was the biggest component in the blue-chip index, but it will fall to the middle of the pack after the split as UnitedHealth Group Inc. UNH, +1.68% Â reclaims the top spot, which it occupied for part of the spring. Apple will have the 18th largest weight among the 30 index members based on Fridayâ\u0080\u0099s closing price, according to Dow Jones Market Data. Just seven Dow Jones Industrial Average components, including Apple, had share prices higher than $200 prior to the split. Appleâ\u0080\u0099s split also prompted S&P Dow Jones Indices to make some changes to the rest of the index, booting out some lower-priced stocks. Pfizer Inc. PFE, -0.27%, Exxon Mobil Corp. XOM, -1.47% and Raytheon Technologies Corp. RTX, -1.46% Â will exit the index before trading begins Monday, with Salesforce.com Inc. CRM, +2.21%, Amgen Inc. AMGN, -1.41% and Honeywell International Inc. HON, +0.34% Â taking their places. Read: Why Dowâ\u0080\u0099s shake-up is bad for stocks added to it â\u0080\u0094 and less bad for those booted Itâ\u0080\u0099s the second time in the past decade that the S&P Dow Jones Indices committee will be swapping out three components at a time, and the third time this millennium."}]}