{"article": [{"url": "https://www.marketwatch.com/story/fedex-ups-stocks-surge-to-power-dow-transports-to-9th-straight-gain-2020-08-10", "published": 1597076960.0, "headline": "FedEx, UPS stocks surge to power Dow transports to 9th-straight gain", "body": "Shares of FedEx Corp. and United Parcel Service Inc. surged Monday, to provide a more-than 120-point boost to the Dow Jones Transportation Average, amid bullish analyst comments on the package delivery giants given signs of increasing e-commerce volumes and improved pricing. FedEx’s stock FDX, +0.18% shot up 9.0% to $199.98, the highest close since Dec. 7, 2018. The stock has now run up 18.8% amid a 6-day win streak. UPS’s stock UPS, +0.27% rose 1.7% to a record close of $159.59, and has climbed 12.2% amid a 5th-straight gain. FedEx’s stock price gain of $16.45 added about 100 points to the Dow transports’ price, while UPS’s $2.69 price gain was about 16 points. Meanwhile, the Dow transports DJT, +0.84% shot up 289 points, or 2.7%, to the highest close since Feb. 21, and to outperform the Dow Jones Industrial Average DJIA, +0.56%, which hiked up 358 points, or 1.3%. The Dow transports has soared 12.0% amid a 9-day win streak, which would be the longest such streak since the 9-day stretch ending Jan. 12, 2018. One of the key tenets of the Dow Theory of market analysis, which has maintained its relevance among chart watchers for more than a century, is that both the Dow transports and Dow industrials had to confirm each others’ trends to validate an important bull- or bear-market signal. Read more about how the Dow Theory beats the broader market. Also read: Don’t dis the Dow Theory just because it’s over 100 years old. One of the basic ideas behind the Dow Theory is that transports take what the industrials make, so unless people are buying and taking delivery on products that are being made, the economy can’t be in sync. “It is a positive to see transports, the area of the economy which connects products to the demand of the consumer, breaking higher,” JC O’Hara, chief market technician at MKM Partners, wrote in a note to clients. “When speaking to the transport sector, we need to highlight the recent price action of [FedEx] and UPS. This gives us insight into the consumer.” Both the transports and industrials were now trading above their June recovery highs. That helped confirm another Dow Theory tenet, which states that uptrends are defined by patterns of higher highs and higher lows. FactSet, MarketWatch FedEx’s stock (FDX) was spiking higher Monday after Bernstein analyst David Vernon turned bullish, saying “the global recovery absolutely, positively needs FDX.” He raised his rating to outperform, after being at market perform since Oct. 19, 2019, while boosting his price target to $225 from $176. He based his upgrade on better pricing for residential deliveries, continued strength in FDX’s Express and air cargo rates and an inflection in margins for the ground business. “E-commerce parcel pricing is expected to remain strong as the pull forward of e-commerce penetration has strained delivery capacity,” Vernon wrote in a research note. “With UPS looking to get ‘better, not bigger,’ FDX emphasizing returns and the [U.S. Postal Service] curtailing capacity, the rate environment at present is outstanding.” FactSet, MarketWatch UPS said Friday that it planned to impose fees on large shippers during the holiday season of as much as $3 per package for ground shipments and up to $4 a package for air shipments to residences, to make up for the added costs to prepare for a surge in online orders. That news comes about a week after UPS reported a big second-quarter earnings beat. Don’t miss: UPS stock rockets to best day ever as surprisingly strong consumer demand produces big earnings beat. BofA Securities analyst Ken Hoexter raised his price target on UPS’s stock to $176 from $151, while reiterating his buy rating, saying the surcharges highlight management’s new focus on pricing, margins and returns. Hoexter said the gist of a call he hosted on Friday with UPS Chief Financial Officer Brian Newman was that the changes UPS were making was to become “better, not bigger.” That was a shift from UPS’s previous strategy, in which margins were hurt as the company frequently made concessions to large shippers for the sake of gaining e-commerce volume. “Given that UPS provides both a critical and difficult-to-replace service for many of its customers, we believe this strategy shift could drive a multi-year tailwind for financial results,” Hoexter wrote."}]}