{"article": [{"url": "https://www.marketwatch.com/story/trump-to-visit-california-for-wildfire-briefing-2020-09-14", "published": 1600104260.0, "headline": "Trump spars with California official on wildfires and climate change: â\u0080\u0098Itâ\u0080\u0099ll start getting coolerâ\u0080\u0099", "body": "President Donald Trump on Monday argued with one California official about climate changeâ\u0080\u0099s role in the wildfires raging in the West as he visited the Sacramento area, though Trump and the stateâ\u0080\u0099s Democratic governor also talked up their working relationship. Wade Crowfoot, Californiaâ\u0080\u0099s secretary for natural resources, told the president during a briefing on the fires that state officials â\u0080\u009cwant to work with you to really recognize the changing climate and what it means to our forests,â\u0080\u009d spurring Trump to say: â\u0080\u009cItâ\u0080\u0099ll start getting cooler. You just watch.â\u0080\u009d Crowfoot said he wished science agreed with that view, and Trump then said he doesnâ\u0080\u0099t think â\u0080\u009cscience knows actually.â\u0080\u009d The fires were key parts of both Trumpâ\u0080\u0099s and Democratic presidential nominee Joe Bidenâ\u0080\u0099s days, with Biden delivering a speech in Delaware on the wildfires in which he attacked Trump, saying four more years of his â\u0080\u009cclimate denialâ\u0080\u009d could mean more burned suburbs. Related:The West burns, coastlines are threatened, and Trump and Biden are too quiet on climate change, say analysts At least 33 people had been declared dead as of late Sunday as nearly 100 wildfires blazed in the West over the weekend, the Wall Street Journal reported. More than 3.3 million acres have burned in California so far this year, and, since mid-August, 4,000 structures have been destroyed, the Journal reported, citing Cal Fire. Opinion:7 ways youâ\u0080\u0099re already paying for climate change The Democratic governors of California, Oregon and Washington say the fires are a consequence of climate change, while the Trump administration has blamed poor forest management for the flames that have raced through the region and made the air in places like Portland, Oregon, Seattle and San Francisco some of the worst in the world. Trump on Monday said he and California Gov. Gavin Newsom â\u0080\u009ccome from different sides of the planet, but we actually have a good relationship.â\u0080\u009d The president also took part in a ceremony honoring seven helicopter crew members from the California Army National Guard who rescued campers trapped by a massive fire, saying they â\u0080\u009csaved the lives of an astounding 242 people.â\u0080\u009d Oregon Gov. Kate Brown said Sunday that more than 40,000 residents of her state had evacuated as dozens of fires have burned more than 1 million acres. â\u0080\u009cThis is truly the bellwether for climate change on the West Coast, and this is a wake-up call for all of us,â\u0080\u009d she said on CBSâ\u0080\u0099s â\u0080\u009cFace the Nation.â\u0080\u009d Trump later Monday was due to take part in a campaign event in the swing state of Arizona before flying back to Washington, D.C. With 50 days to go before the Nov. 3 election, Biden has an edge of 3.7 percentage points over the Republican incumbent in a RealClearPolitics moving average of polls focused on top swing states that are likely to decide the White House race. Betting markets are giving the former vice president a 52.7% chance of winning vs. Trumpâ\u0080\u0099s 46.5%. U.S. stocks SPX, +0.87% Â DJIA, +0.56% Â closed higher Monday, taking back a chunk of last weekâ\u0080\u0099s losses, with credit going in part to fresh hopes for a coronavirus vaccine. The Associated Press contributed to this article. Sign up for Trump Today and more MarketWatch newsletters"}]}