{"article": [{"url": "https://www.marketwatch.com/story/6-things-you-should-add-to-your-pandemic-travel-kit-2020-10-07", "published": 1602237320.0, "headline": "6 things you should add to your pandemic travel kit", "body": "This article is reprinted by permission from NerdWallet. You don’t need a travel writer to tell you that the way you travel has dramatically changed due to the coronavirus pandemic. The items on your packing list may also need to change. Of course, there are the obvious things you should add, like masks — they’re mandatory on most airlines and at pretty much every major hotel chain, as well as places you’ll visit from Walmart WMT, +1.00% to Walt Disney World DIS, +1.53% . And there are other cleaning items you may have already added to your everyday routine: Disinfecting wipes. Gloves. Hand sanitizer. But there are several less obvious items you may want to bring that you likely have not prioritized before. Here are six additions to your packing list for travel in the COVID era:1. A contactless credit card Contactless credit cards have been considered a safer way to pay to prevent fraud, but they could also be a safer way to prevent infection. No more swiping your plastic through the same machine that everyone else has touched or having to hand your card to another person. Credit cards are increasingly being designed with “tap-to-pay,” which means your card is equipped with a technology called near-field communication. Just hold your card (or mobile wallet-enabled device, like a phone or smartwatch) close to the card reader to complete your transaction. See: Hawaiian Airlines to offer travelers drive-through COVID-19 testing in LA, San Francisco Certain restaurants — even some that had historically been cash-only — are now encouraging customers to make contactless payments. Some restaurants will no longer accept cash at all. Not sure if your credit card is equipped with tap-to-pay tech? Look for the contactless logo on your card (four graduating arcs, like a sideways Wi-Fi symbol).2. A portable power bank for your phone You may find that your travels take you somewhere where you can’t use your physical credit card to pay at all, even if it’s a tap-to-pay card. For many attractions, like theme parks and national parks, you may need to reserve tickets ahead of time. Some restaurants, such as the San Francisco-based bubble tea shop Boba Guys, will serve you only if you’ve ordered ahead online. While you can certainly stand on the curb and place your order, that means having a charged phone right now is more important than ever. A simple portable charger or power bank can get you out of a low-battery jam when finding a physical outlet may be more difficult than it once was. Otherwise, no boba for you.3. Toilet paper (and other DIY-restroom supplies) Stopping to use the bathroom in gas stations, public parks and restaurants is no longer a sure bet as some businesses temporarily close their facilities to the public. Even if the bathroom is open, there is some concern about the aerosols produced by flushing toilets, potentially increasing the spread of coronavirus. If you’re in a remote area, you might find yourself taking a wee in the woods. Choose a spot away from bodies of water or areas where other people are present. You’ll want to ensure you have your own toilet paper and bring a bag to dispose of it while always practicing Leave No Trace principles. Depending on the nature of your trip, it might make sense to go all-out and bring a travel toilet, which is essentially just a bucket with a seat mounted on top that’s designed to fit a waste bag.4. A pen If you like those notepads and pens that typically come with hotel rooms, you’re out of luck. Some hotels, including Hilton HLT, -1.26% , have adjusted their health policies and removed a number of amenities including pens, notepads and guest directories from rooms. While such moves are commendable (Hilton lands among the highest in our ranking of hotels that have handled the coronavirus best), it still requires some planning and packing. For example, Hilton says products like pens are available upon request — but do you really want to call the concierge just for a pen, when you can easily pack your own? Read next: Here are the best destinations in every state to keep your social distance As far as scenarios where you might need a pen (such as signing receipts), some cash registers have separate piles for clean and dirty pens. Still, the Centers for Disease Control and Prevention suggests that pens are difficult to clean or disinfect, and sharing them should be discouraged. Bring your own to avoid using one that someone else has touched.5. A water bottle While the CDC has stated that there is no evidence showing anyone has gotten COVID-19 through drinking water, some public drinking fountains have been turned off. Even if they’re still on, you might be disinclined to use a public water fountain; after all, the surfaces around the fountain including the button you touch to turn on the spigot may pose a risk for transmission. Also see: This is how COVID-19 could affect homes of the future Instead, bring a large, reusable water bottle that you can fill from a faucet you know has been cleaned. Or, go for boxed water or a plastic water bottle (though that also comes with its own downfall: contributing to waste).6. A selfie stick Cue eyerolls. The haters came for selfie sticks in the mid-2010s, and the “narcisstick” moniker certainly didn’t help. Why use a selfie stick when you can simply ask someone else to take your family photo? In 2020, the answer is easy: You don’t want a stranger touching your phone or camera, and they don’t want to touch yours, either. And no, your arm isn’t long enough to really get a great photo, despite your selfie skills. So to get everyone (and everything) in the frame, it’s time to revert to self-sufficient photography.The bottom line Pack hygiene and sanitation supplies for your level of comfort. Traveling during a pandemic introduces new urgency to pack items you might not normally use at home, so ignore the selfie stick haters, get a contactless form of payment and leave room in your suitcase for a roll of toilet paper. Travel has changed this year, so your packing list should too.More from NerdWallet: 6 National Parks to Visit This Fall, and Where to Stay on Points How to Find Travel Insurance That Offers COVID Coverage Why You Shouldn’t Book Airfare in Advance Right Now Sally French is a writer at NerdWallet. Email: sfrench@nerdwallet.com. Twitter: @SAFmedia."}]}