{"article": [{"url": "https://www.marketwatch.com/story/amd-launches-new-chips-for-pcs-11602178224", "published": 1602164300.0, "headline": "AMD launches new chips for PCs", "body": "AMD unveiled its next generation of PC chips Thursday. Paul Sakuma Photography Advanced Micro Devices Inc. announced new desktop processors Thursday that the company said will deliver improvements in gaming performance. AMD AMD announced in a news release that the new PC chips in its Ryzen 5000 series offer a performance boost over prior-generation models, while the flagship Ryzen 9 5950X chip delivers what the company described as the “highest single-thread performance of any desktop gaming processor.” AMD’s new “Zen 3” core architecture brings about a 19% “generational increase” in the number of instructions per cycle, AMD said, which marks the largest increase since the company introduced its Zen processors back in 2017. “Zen 3 increases our lead in overall performance, it increases our lead in power efficiency, and also now, it delivers the best single-threaded performance, and gaming performance as well,” Chief Executive Lisa Su said in an event announcing the new chips that was broadcast on YouTube. The new CPUs are expected to be available Nov. 5. The Ryzen 9 5950X offers 16 cores, 32 threads, and 72MB of cache space, and it will sell for $799. The Ryzen 9 5900 has 12 cores, 24 threads, and 70MB of cache, for a price of $549. That model offers a 26% speed boost on average over the Risen 9 3900XT, based on tests done across 11 popular gaming titles. AMD is also rolling out the Ryzen 7 5800X, with 8 cores, 16 threads, and 36MB of cache, as well as the Ryzen 6 5600X, with 6 cores, 12 threads, and 35MB of cache. Those will cost $499 and $299, respectively. Opinion: Nvidia’s deal for Arm could mean a real challenge to Intel and AMD, but is likely to face opposition AMD shares were near flat in Thursday’s session, down from earlier gains. They’ve gained 62% in the past three months as the S&P 500 SPX, +0.87% has risen 8.5%."}]}