{"article": [{"url": "https://www.marketwatch.com/story/us-wont-join-who-linked-global-effort-to-find-covid-19-vaccine-2020-09-01", "published": 1598991500.0, "headline": "U.S. wonâ\u0080\u0099t join WHO-linked global effort to find COVID-19 vaccine", "body": "WASHINGTON â\u0080\u0094 The Trump administration said Tuesday that it will not work with an international cooperative effort to develop and distribute a COVID-19 vaccine because it does not want to be constrained by multilateral groups like the World Health Organization. The decision to go it alone, first reported by The Washington Post, follows the White Houseâ\u0080\u0099s decision in early July to pull the United States out of the WHO. Trump claims the WHO is in need of reform and is heavily influenced by China. Some nations have worked directly to secure supplies of vaccine, but others are pooling efforts to ensure success against a disease that has no geographical boundaries. More than 150 countries are setting up the COVID-19 Vaccines Global Access Facility, or COVAX. That cooperative effort, linked with the WHO, would allow nations to take advantage of a portfolio of potential vaccines to ensure their citizens are quickly covered by whichever ones are deemed effective. The WHO says even governments making deals with individual vaccine makers would benefit from joining COVAX because it would provide backup vaccines in case the ones being made through bilateral deals with manufacturers arenâ\u0080\u0099t successful. â\u0080\u009cThe United States will continue to engage our international partners to ensure we defeat this virus, but we will not be constrained by multilateral organizations influenced by the corrupt World Health Organization and China,â\u0080\u009d said White House spokesman Judd Deere. â\u0080\u009cThis president will spare no expense to ensure that any new vaccine maintains our own Food and Drug Administrationâ\u0080\u0099s gold standard for safety and efficacy, is thoroughly tested and saves lives.â\u0080\u009d Rep. Ami Bera, D-Calif., said the administrationâ\u0080\u0099s decision was shortsighted and will hamper the battle to end the pandemic. â\u0080\u009cJoining COVAX is a simple measure to guarantee U.S. access to a vaccine â\u0080\u0094 no matter who develops it first,â\u0080\u009d tweeted Bera, a medical doctor. â\u0080\u009cThis go-it-alone approach leaves America at risk of not getting a vaccine.â\u0080\u009d The administrationâ\u0080\u0099s decision, paired with the U.S. withdrawal from the WHO, means the U.S. is abdicating Americaâ\u0080\u0099s global leadership in fighting pandemics, according to Tom Hart, North America director at The ONE Campaign, an advocacy organization co-founded by Bono of the rock band U2. â\u0080\u009cNot only does this move put the lives of millions around the world at risk, it could completely isolate Americans from an effective vaccine against COVID-19,â\u0080\u009d Hart said. A handful of the dozens of experimental COVID-19 vaccines in human testing have reached the last and biggest hurdle â\u0080\u0094 looking for the needed proof that they really work. AstraZeneca AZN, +1.16% Â announced Monday its vaccine candidate has entered the final testing stage in the U.S. The Cambridge, England-based company said the study will involve up to 30,000 adults from various racial, ethnic and geographic groups. Two other vaccine candidates began final testing this summer in tens of thousands of people in the U.S. One was created by the National Institutes of Health and manufactured by Moderna Inc. MRNA, +0.09% Â , and the other developed by Pfizer Inc. PFE, -0.27% Â and Germanyâ\u0080\u0099s BioNTech BNTX, +1.23% Â ."}]}