{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-rise-for-second-straight-week-as-economic-activity-slows-down-2020-07-30", "published": 1596103640.0, "headline": "Jobless claims rise for second straight week as U.S. economic activity slows down", "body": "The numbers: The number of Americans applying for jobless benefits rose for the second straight week, a sign economic growth could be stalling in late July. Claims had been on a steady decline after peaking in late March. Initial jobless claims rose by 12,000 to 1.434 million in the week ended July 25, the Labor Department said Thursday. Economists surveyed by MarketWatch had been looking for 1.51 million new claims. A new federal relief program for so-called “gig” workers like Uber drivers, totaled 829,607 last week. The number of people already collecting economic benefits, known as continuing claims rose by 867,000 to 17.06 million. These claims are reported with a one-week lag. This is a sign that workers are staying longer on unemployment rolls and rehiring has slowed. It is the first increase in continuing claims since late May. iframe.twitter-tweet { width: 100% !important; } What happened: Seasonal adjustment factors are playing havoc with the data this month. Claims in July take account of annual summer shutdowns of automakers, but auto plants are staying open after their forced shutdown in April. Still, claims are staying stubbornly high. Big picture: Layoffs are rising as the virus spreads across the South and West and bars and restaurants are forced to scale back operations, economists said. Strong job gains in May and June had raised optimism about the labor market, but economists are now worried nonfarm payroll gains could be weaker in July. The economy added 4.8 million jobs in June. The government will report the July employment data on Aug. 7. On Wednesday, Federal Reserve Chairman Jerome Powell said the labor market “has a long way to go to recover.” What are they saying? “The risk of temporary job losses becoming permanent is high from repeated closures of businesses. That could result in an even slower pace of recovery,” Rubeela Farooqi, chief U.S. economist at High Frequency Economics. Market reaction: Stocks opened sharply lower after jobless claims and an historic decline in second quarter gross domestic product. The Dow Jones Industrial Average DJIA, +0.56% was down 400 points in morning trading."}]}