{"article": [{"url": "https://www.marketwatch.com/story/armenia-azerbaijan-conflict-draws-in-fighters-from-lebanon-and-syria-01602257452", "published": 1602243500.0, "headline": "Armenia-Azerbaijan conflict draws in fighters from Lebanon and Syria", "body": "People take refuge in a bomb shelter on Tuesday in Stepanakert, the self-proclaimed Republic of Nagorno-Karabakh, Azerbaijan. Hundreds of fighters from around the Middle East are heading to Nagorno-Karabakh in Azerbaijan to join rival countries fighting over the region. AP Photo/Dmitri Lovetsky BEIRUT (AP) — For the past two weeks, Raffi Ghazarian has been glued to the TV at home and at work watching news about the fighting between Armenian and Azerbaijani forces. If it goes on, the 50-year-old Lebanese of Armenian descent says he’s ready to leave everything and volunteer to defend his ancestral land. Some from Lebanon’s large ethnic Armenian population have already traveled to join the fight, according to members of the community, although they say the numbers are small. The new eruption of violence in the Caucasus region strikes close to home for Lebanon’s Armenians. Red, blue and orange Armenian flags are flown on balconies, windows and roofs of buildings in Bourj Hammoud, Beirut’s main Armenian district, which also features anti-Turkish graffiti in English and Armenian. People walk past anti-Turkish graffiti on a wall in the main Armenian district of the northern Beirut suburb of Bourj Hammoud, Lebanon. AP Photo/Hassan Ammar Fighting has raged since Sept. 27 in the separatist region of Nagorno-Karabakh, leaving several hundred dead. The enclave lies within Azerbaijan but has been under the control of ethnic Armenian forces backed by neighboring Armenia since 1994, when a truce ended a years-long war that killed an estimated 30,000 people. On the other side of the latest fighting, Turkey has sent hundreds of Syrian opposition fighters to back its ally, Azerbaijan, according to a Syrian war monitor and three Syria-based opposition activists. Lebanese-Armenians have been sending money and aid, and have been campaigning in the media in support of ethnic Armenians in the enclave, which they refer to as Artsakh. The support they can give is limited — Lebanon is passing through a severe economic crisis, and banks have imposed tight capital controls. Lebanon is home to one of the largest Armenian communities in the world, most of them descendants of survivors of the 1915 genocide by Ottoman Turks. An estimated 1.5 million died in massacres, deportations and forced marches that began in 1915 as Ottoman officials worried that the Christian Armenians would side with Russia, its enemy in World War I. The event is widely viewed by historians as genocide. Turkey denies the deaths constituted genocide, saying the toll has been inflated and that those killed were victims of civil war and unrest. “We will not allow what happened in 1915 to happen again. We will fight until the last Armenian soldier,” said Ghazarian, standing next to a coffee stand decorated with Lebanese and Armenian flags. The Lebanese flag, center, the Armenian national flag, left, and the Armenian Revolutionary Federation flag fly in the main Armenian district of the northern Beirut suburb of Bourj Hammoud, Lebanon. AP Photo/Hassan Ammar “This is not a war between Muslims and Christians. This is a war for the existence of the Armenian entity and we are ready,” said Ghazarian, who owns a clothes shop. Lebanese legislator Hagop Pakradounian, who heads the Armenian Revolutionary Federation, the largest and most powerful Armenian party in Lebanon, said volunteers going from Lebanon to Armenia act on their own, and there is no decision by any organization or the community itself to send them. “We cannot tell them not to go. They are free,” Pakradounian told The Associated Press in his office in Bourj Hammoud. “We consider it a war against all the Armenian people and a continuation of the genocide project since the Ottoman Empire.” Meanwhile, Turkey has sent more than 1,200 Syrian fighters — most of them members of Turkish-backed opposition groups — to fight alongside Azerbaijani forces, according to the Britain-based Syrian Observatory for Human rights, an opposition war monitor that tracks Syria’s nine-year conflict. The Observatory’s chief, Rami Abdurrahman, said 72 Syrian fighters have been killed so far. Three opposition activists in Syria corroborated the report. They said Turkish security companies recruit the men ostensibly to work as guards at oil facilities in return for about $1,200 a month, but most end up on front lines. One of the activists sent AP photos of young men allegedly killed in Azerbaijan. A citizen journalist based in northern Syria said he knows some of the fighters who joined the battle, adding that warnings they sent about the intensity of the fighting and the dangers made others who were planning to go change their minds. The deployment is similar to what happened in Libya, where battle-hardened Syrian fighters helped tip the balance of power in favor of the U.N.-supported government of Prime Minister Fayez Sarraj, an ally of Turkey. Armenia has repeatedly said over the past week that Turkey sent Syrian fighters to back the Azerbaijanis, a claim that Ankara and Azerbaijan deny. Syrian President Bashar Assad told Russia’s RIA Novosti news agency that Turkey is bringing “terrorists” from Syria and Libya to fight in Azerbaijan, accusing Turkish President Recep Tayyip Erdogan of being “behind the escalation in Nagorno-Karabakh.” French President Emmanuel Macron spoke with Russia’s Vladimir Putin about the conflict last week. Macron later told reporters he had information “that we’re confident in” confirming Turkey’s deployment of Syrian mercenaries in the fighting. “It’s a very serious new development that also changes the balance of things,” he said. Russia’s Foreign Ministry expressed concern over reports about “militants from illegal armed groups” from Syria and Libya being sent to the conflict zone. Hikmet Hajiyev, a foreign policy aide to the Azerbaijani president, said this week that “we completely reject” the claim, calling on those who make the accusations to give evidence. Maj. Youssef al-Hammoud, an official with the so-called Syrian National Army, an umbrella for Turkish-backed armed opposition groups in Syria, strongly denied in a telephone call with the AP that any fighters were being sent from Syria to Azerbaijan. “This is an Armenian media campaign,” al-Hammoud said. Lebanon’s Armenians are doing what they can to help. Yeghia Tashjian, a freelance researcher, said he was writing articles to raise awareness about what Armenians are being subjected to. “For us, this is existential war that it is important to win not just for emotional or nationalist issues but because it is our homeland and we should fight for it,” Tashjian said. In Bourj Hammoud, Tro Mandalian, who works in a perfume distribution business, said Armenians’ opponents always had bigger armies but still Armenians survived. “We have strong hearts,” he said. “Let them try us,” he said. “We don’t surrender and we only kneel to God.”"}]}