{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-rise-as-global-markets-attempt-to-recover-from-sharp-selloff-2020-06-12", "published": 1591981280.0, "headline": "Treasury yields rise as global markets attempt to recover from sharp selloff", "body": "Treasury yields rose Friday, after four straight daily declines, as U.S. equity markets partially recouped their biggest one day plunge since March on Thursday, amid worries that the pace of the coronavirus spread was picking up.What are Treasurys doing? The 10-year Treasury yield TMUBMUSD10Y, 0.777% rose 4.7 basis points to 0.698%, trimming its weekly drop to 20.5 basis points, its largest such move since March 6. The 2-year note rate TMUBMUSD02Y, 0.156% edged 1.4 basis points higher to 0.191%, leaving it down 2.3 basis points for the week. The 30-year bond yield TMUBMUSD30Y, 1.576% rose 4.6 basis points to 1.448%. What’s driving Treasurys? The bond-market took its cues from its equity counterparts, after the S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% booked modest gains on Friday, following their biggest daily tumble since March as markets were roiled by concerns that the COVID-19 pandemic was spreading again across the U.S. Recent data show that U.S. states that had been spared in the early days of the pandemic like Florida, Texas and Arizona were now seeing record increase in case counts as the nation loosens restrictions on business and household activity. In U.S. data, the University of Michigan’s consumer sentiment index rose to rose to 78.9 in the two weeks ended June 10, from 72.3 in the previous month. As for the Federal Reserve, Richmond Fed President Thomas Barkin suggested the pace of the recovery might be slow.What did market participants say? “The largest risk now, is that a second wave of infections may plague the U.S. and other countries as they open their economies. We still favor a U-shaped recovery which should underpin interest rates to the lower end of the range,” wrote Tom di Galoma, managing director of Treasurys trading at Seaport Global Securities."}]}