{"article": [{"url": "https://www.marketwatch.com/story/gold-pushes-back-above-1-900-an-ounce-turns-positive-for-the-week-11602248010", "published": 1602256520.0, "headline": "Gold ends at a 3-week high, up 1% for the week", "body": "Gold futures settled Friday at their highest in three weeks, up roughly 1% from a week ago as the U.S. dollar lost ground and investors tracked ongoing fiscal stimulus talks in Washington. Traders were bullish on gold on the back of hopes for another reflationary U.S. fiscal stimulus package passing Congress eventually and there’s likely to be more upside for prices, said Naeem Aslam, chief market analyst at AvaTrade. Read: Pelosi says talking to Mnuchin again Friday about big fiscal stimulus “In the coming week, we may see the price skyrocket the $1,950 price level as long as the price stays above the $1,900 mark,” Aslam told MarketWatch. December gold GOLD, +2.86% GCZ20, +2.17% rose $31.10, or 1.6%, to settle at $1,926.20 an ounce, with prices for the most-active contract ending about 1% higher for the week, according to FactSet data. Read: Why gold may not climb to a fresh record before the year ends December silver SIZ20, +5.96% advanced $1.23, or 5.2%, to $25.108 an ounce, for a weekly rise of 4.5%. “Over the past few days, it has been the same old story for the metal as prices remain rangebound despite drama and confusion over the fourth U.S. stimulus package,” said Lukman Otunuga, senior research analyst at FXTM. “If the dollar continues to weaken on stimulus hopes, gold is likely to shine despite the improving market mood.” A weaker dollar can benefit gold and other commodities priced in it, as it makes them less expensive to users of other currencies. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against a basket of six major rivals, was down 0.6% Friday and headed for a 0.8% weekly decline. Year to date, gold-backed exchange-traded funds and similar products have seen net inflows of 1,003 metric tons, up a 10th month in a row in September, according to a report Thursday from the World Gold Council. Net inflows surpassed the previous record of 646 metric tons in 2009. Total gold ETF holdings rose to a fresh all-time high of 3,880 metric tons. Year to date inflows were “significantly more than in any previous entire year. Two thirds of all inflows were attributable to ETFs in North America, first and foremost the SPDR Gold Trust GLD, +1.81%, ” said Daniel Briesemann, analyst at Commerzbank, in a note. On Friday, the SPDR Gold Trust GLD, +1.81% was up 1.5%, headed for a weekly rise of 1.1%. Among other metals, December copper HGZ20, +1.38% rose 1.3% to $3.0825 a pound, for a weekly rise of 3.5%. “Labor tensions continue to rise in top-producer Chile, with several mines facing wage negotiations over the next month,” analysts at Zaner Metals, said in a Friday note. “Workers at the Candelaria mine have started a strike, and workers at the Escondida are voting on a wage deal.” “This lends support to the market as it increases the chances of supply disruptions,” they said. Read: Silver, copper provide hints for the global economic outlook Also on Comex, January platinum PLF21, +3.84% added 3.5% to $894.30 an ounce, with prices up around 0.3% for the week, and December palladium PAZ20, +2.31% rose 2.5% to $2,463.20 an ounce, settling up 5.9% on the week."}]}