{"article": [{"url": "https://www.marketwatch.com/story/heres-why-carbon-emissions-at-utilities-can-fall-even-during-a-powerful-economy-2020-07-08", "published": 1594251620.0, "headline": "Hereâ\u0080\u0099s why carbon emissions at utilities can fall even during a powerful economy", "body": "Carbon emissions from the U.S. power sector fell 8% last year even with the economy growing, as utilities increasingly dropped coal for cheaper natural gas and renewables. The analysis, in a report called Benchmarking Air Emissions of the 100 Largest Electric Power Producers in the United States, examines and compares key air pollutant emissions of nitrogen oxides (NOx), sulfur dioxide (SO2), carbon dioxide (CO2) and mercury from the 100 largest U.S. power producers. The report, issued by sustainable-investing advocates Ceres and other partners, including power industry participants, found that power sector CO2 emissions decreased 8% between 2018 and 2019, while SO2 and NOx emissions decreased 23% and 14%, respectively. During that time, U.S. GDP rose 2.3%, meaning that an expanding economy pushed utilities to churn out more power yet because of the energy mix, emissions were down. Widening the snapshot, from 2000 to 2019, CO2 emissions decreased 28% while GDP grew 45%. â\u0080\u009cWhile experts expect an even more dramatic plunge [in emissions] in 2020 due, in part, to the COVID-19 pandemic, it will be critical to ensure we continue the momentum in decarbonizing the power sector,â\u0080\u009d said Dan Bakal, senior director of electric power at Ceres. â\u0080\u009cUtilities should deploy zero-carbon resources and electrify other sectors in order to accelerate the pace of decarbonization as the economy recovers and energy demand increases.â\u0080\u009d Cutting emissions is a key focus of public-health advocates and those working on policy and private-sector shifts to slow the effects of man-made climate change. In 2019, renewables and other zero-carbon resources, led by nuclear power, generated more than 35.7% of U.S. electricity. Natural gas NG00, +5.17% Â , a fossil fuel that emits about half the carbon as coal but has its own detractors, was the most used source at 38.4%. Coal provided 23.4% of the nationâ\u0080\u0099s electricity, down from about 50% a decade ago. Last year, zero-carbon resources, including nuclear, renewables and hydro, generated 36% of U.S. electricity, making it the second-leading source of power generation after natural gas. Non-hydro renewable generation, which includes wind, solar, geothermal, and biomass, has more than doubled since 2000. Renewables provided more power than coal for the first time last year, according to the Energy Information Administration. Natural gas is often still criticized by industries pushing for more solar, wind and other zero-carbon renewable sources. Utilities maintain that they need to keep using natural gas because the wind and the sun are too unreliable and because utilities are slow to invest in energy storage. A report in June by the University of California, Berkeley, said that by 2035, the U.S. electric grid could get 90% of its power without greenhouse gas emissions while lowering electricity rates. To do that, the country would have to increase its use of renewables, energy storage and transmission lines while closing all coal plants and cutting natural gas use by 70%. The benchmarking utility analysis is the 16th edition of the report since 1997. The analysis is a collaborative effort between Ceres; Bank of America; power producers Entergy ETR, -1.26% Â , Exelon EXC, -0.30% Â , and independent energy company Tenaska; as well as the Natural Resources Defense Council (NRDC). It is authored by M. J. Bradley & Associates. Increased ambition from power sector companies is critical to decarbonization, and to succeed in tackling the broader issues relating to the climate crisis, say Ceres and other advocates. Some of the highest emitting power companies have recently made voluntary commitments to reduce their emissions to net-zero by 2050. Over the past two years Southern Company SO, +0.05% Â , Xcel XEL, +0.27% Â , Duke DUK, +0.16% Â , Dominion Energy D, -0.34% Â , NRG Energy NRG, -0.24% Â , CMS Energy CMS, +0.73% Â , DTE Energy DTE, -1.29% Â , and Arizona utility APS have all committed to achieving net-zero emissions by 2050. â\u0080\u009cWe are on track to meeting our 2030 climate commitment by transforming our generation portfolio to cleaner resources and investing in our utility-owned nuclear facilities,â\u0080\u009d said Mike Twomey, Entergyâ\u0080\u0099s senior vice president of federal policy, regulatory and government affairs."}]}