{"article": [{"url": "https://www.marketwatch.com/story/im-63-a-widow-and-lost-my-job-because-of-covid-i-dont-have-much-in-savings-and-feel-lost-what-can-i-do-2020-07-28", "published": 1597491260.0, "headline": "Iâ\u0080\u0099m 63, a widow and lost my job because of COVID. I donâ\u0080\u0099t have much in savings and feel lost. What can I do?", "body": "Dear MarketWatch, Iâ\u0080\u0099m a 63-year-old widow laid off from my restaurant job of 34 years. Iâ\u0080\u0099ll never be able to make the money I was making before COVID. I was going to work for a few more years to pay off some bills. I was thinking about getting survivorâ\u0080\u0099s benefits from Social Security and letting my benefits build for a few more years, then work part time. I donâ\u0080\u0099t have a lot of savings as I worked paycheck to paycheck, I have about $40,000 in my 401(k). I owe $100,000 on my house. Iâ\u0080\u0099m kind of lost right now, no job and afraid to go back because Iâ\u0080\u0099m in the high-risk category. Advice would be appreciated. Thank you. See: I have a seven-figure nest egg â\u0080\u0094 am I saving too much for retirement? Dear reader, Iâ\u0080\u0099m so sorry youâ\u0080\u0099re going through this. You are not alone â\u0080\u0094 millions of Americans have been laid off because of the current pandemic, and not everyone knows what their next steps will be in this type of environment. First, stay strong â\u0080\u0094 there are numerous strategies you can consider that may help you get over this hurdle. You mentioned the first one: Social Security survivor benefits. There are myriad ways to claim Social Security benefits. You will likely need to call the Social Security Administration first to figure out what your actual numbers are, so that you make the best decision possible for your current and future situations . Youâ\u0080\u0099d see a lower benefit now than if you waited because you have not yet reached your Full Retirement Age. Still, when you speak to a representative at the SSA, ask what your own benefits would be now, at Full Retirement Age and at 70 (the latest you could begin claiming). Then ask what survivor benefits are available to you. After you have those figures ready, you can choose the best course. If your retirement benefits now are less than your survivor benefits, you could take the survivor benefits and let your own benefits continue to grow until age 70 (as you had mentioned). â\u0080\u009cThe longer you can push off, the more you will get,â\u0080\u009d said Charles Sachs, director of financial planning and chief compliance officer at Kaufman Rossin Wealth. â\u0080\u009cTry to lock in the largest benefit.â\u0080\u009d Social Security retirement benefits and survivor benefits are considered independent of one another, so choosing one over the other would not affect either amount, said Lindsey Cannata, a financial adviser at J.P. Cannata & Associates. Social Security benefits are not impacted by unemployment insurance, which means you can file for unemployment and still receive a monthly check from Social Security. States previously had rules in place to reduce benefits if an individual claimed unemployment and Social Security, but those laws have been repealed across the country, according to the National Employment Law Project. Still, it never hurts to double check when you speak to someone at the SSA. Benefits taken before Full Retirement Age are affected by employment, however, Cannata said. There is an earnings limit of $18,240 in 2020, and individuals lose $1 in benefits for every $2 earned above that threshold. There are no limits after you hit your Full Retirement Age, so think carefully about how you will claim benefits and earn money. Hereâ\u0080\u0099s more information on that from the Social Security Administration. Upon Full Retirement Age, the agency will recalculate the benefit amount to give the individual credit for the time he received reduced benefits, it said. Donâ\u0080\u0099t miss: Are you facing early retirement? Hereâ\u0080\u0099s how to prepare Watch the news for the latest on unemployment insurance. The federal governmentâ\u0080\u0099s $600-a-week benefit to individuals impacted by the coronavirus crisis is set to expire at the end of this week, and Congress is still figuring out what to do about that portion of the bill. Democrats pushed for the benefit to extend until January, while Republicans are weighing alternatives. Still, receiving unemployment right now could buy you the time you need to figure out your next move for work. Speaking of work, this is a great time to take a moment to decide what youâ\u0080\u0099d like to do with your time. Ask yourself questions, such as how your skills can be used in various types of jobs and if youâ\u0080\u0099d be interested in finding a job where you could work from home. Many industries are embracing remote work these days, and others are a natural fit for those who want to (or must) stay home, such as corporate service center representatives. Take this time to also dig into your finances, and know the particulars of your budget. Use your credit card and bank statements to see exactly what you spend on, and what categories you need to continue to spend on, and where you can cut back during this time of uncertainty. The big ones of course are housing, food and medicine, and there may be assistance programs in your area to help pay for those necessities while you are in between jobs and low on savings, said Dana Menard, the founder and chief executive officer of Twin Cities Wealth Strategies. Contact your mortgage lender as soon as you can to inform them of your situation â\u0080\u0094 they may also have a few suggestions, or an assistance program, to help your situation right now. â\u0080\u009cNumber one is spending,â\u0080\u009d said Nadine Burns, president and chief executive officer of A New Path Financial. Look for extraneous expenses, such as services you pay for but barely use or excessive food purchases (even if we arenâ\u0080\u0099t all dining out as much as we perhaps used to do pre-pandemic). Try to curb your spending wherever possible by planning your meals and filling your refrigerator and pantries with exactly what you intend to cook and eat, she said. â\u0080\u009cMore and more people come in and when I ask â\u0080\u0098how much do you need per month?â\u0080\u0099 they donâ\u0080\u0099t know,â\u0080\u009d Burns said. â\u0080\u009cUnderstanding what you spend is the key to everything.â\u0080\u009d With the ease of swiping a credit card or pushing a few buttons on the computer, not all consumers are actively aware of how much they could save per month. You are older than the minimum age requirement of 59 Â½ years old to withdraw from 401(k) plans without any penalties, but for readers who are in this scenario and not yet 59 Â½, it is important to note that the federal government, under the CARES Act, expanded eligibility requirements for people who may need to withdraw or borrow from their 401(k) plans. The rule allows people to distribute or borrow the lesser of $100,000 or 100% of their account balance without any penalties. Financial advisers typically warn people not to withdraw from their retirement plans unless absolutely necessary, so before you tap into your retirement savings you should understand your cash flow needs and your spending and see if it is at all possible to delay or significantly limit how much you withdraw from your 401(k). Also see: This is the age group most affected by the COVID crisis Finances may be tight right now, but working with a financial planner for a quick check-up could be immeasurably beneficial for you, Sachs said. To find a financial planner of your own, you can search Letâ\u0080\u0099s Make a Plan, a tool the CFP Board offers â\u0080\u0094 it lets you search for a financial planner in your area. If thatâ\u0080\u0099s outside of the budget right now, you may be able to find an adviser who does pro bono work. Either way, discussing your situation with a financial professional could help you make sense of your options and get on the right track. They may have even more resources to suggest, based on your personal situation. And it may be a relief to have someone help you figure this out. This is a scary time â\u0080\u0094 for so many Americans â\u0080\u0094 and it is totally understandable that you feel lost. Perhaps this time can be used as a hiatus, Burns said. Use unemployment and other benefits to pay your bills and make ends meet, and dedicate the next few months to finding job opportunities you would enjoy."}]}