{"article": [{"url": "https://www.marketwatch.com/story/heres-how-much-ford-stock-has-lost-under-outgoing-ceo-jim-hackett-2020-08-04", "published": 1596555500.0, "headline": "Here's how much Ford stock has lost under outgoing CEO Jim Hackett", "body": "Ford Motor Co. executive-suite drama reached a pinnacle on Tuesday with the surprise departure of Chief Executive Jim Hackett. Ford F, -1.36% shares rose on the news, and Ford stock on Tuesday topped a popularity chart among Robinhood app users. Ford stock has been among the most popular on Robinhood since the end of 2019. “Hackett was an unorthodox CEO pick to begin with, as an external candidate with no prior auto industry experience, and his tenure was marred by a deteriorating bottom line, as F’s adjusted EPS fell from $1.78 in 2017 to $1.19 in 2019,\" said analyst Garrett Nelson with CFRA. “While Ford’s new vehicle lineup has shown some promise with the Mustang Mach-E and Bronco, we think Farley will have his work cut out to ‘right the ship’, as Ford remains in the middle of a multi-year restructuring.” Under Hacket, who took the reins in May 2017, the stock has lost nearly 40%. Here’s how it compares to the S&P 500 index in the same period: Hackett will be replaced by current COO Jim Farley. See:Ford CEO Jim Hackett to retire, to be succeeded by COO Jim Farley Hackett was hailed as a “visionary” as he took over from Mark Fields. When at office-furniture company Steelcase Inc. SCS, +0.35%, Hackett was credited with correctly predicting the shift toward “shared” spaces and open-space layouts away from cubicles and offices. Read:Welcome back, cubicles? Longtime Silicon Valley CEO says coronavirus could kill the open office Ford under Hackett did a tad worse than Ford under Fields in terms of share performance and market valuation. The company’s shares lost about 36% under Fields’s leadership from 2014 to 2017. To be sure, the last few years were challenging for legacy U.S. auto companies, which faced increased competition from Silicon Valley on driverless cars and ride-sharing as well as a generational shift toward less driving and car ownership. Tesla Inc. TSLA, +1.89% is now the world’s most valued car maker, having surpassed Ford’s and General Motors Co.’s GM, -0.15% valuation months ago. In Hackett’s case, he also dealt with difficult sales comparisons as previous years had seen U.S. car sales soaring to records on pent-up demand following the Great Recession and wider availability of credit as the crisis abated. Hackett’s surprise retirement is just one part of the management churn over the recent past. He leaves six months after the departure of Chief Operating Officer Joe Hinrichs, who retired in early February after nearly 20 years at Ford. Now-CEO Farley was named COO with the Hinrichs departure. Long-time Chief Financial Officer Bob Shanks retired in mid-2019. “Between Hinrichs’s unceremonious departure in February to Hackett’s unexpected early retirement, the upper echelon of Ford leadership has struggled to find stable footing for some time,” said Jessica Caldwell, an analyst with Edmunds. “Wall Street has shown its lack of confidence as the stock has languished for years under Hackett’s leadership.” Ford last week reported a narrower-than-expected adjusted loss in the second quarter, with sales halved in comparison with a year ago but in line with Wall Street forecasts. On the call with analysts post the second-quarter results, Hackett, who gave no inkling of his impending retirement, said he felt “better and better” about the company’s decision to focus on SUVs and pickup trucks. Under Hackett, Ford took one of the biggest bets in its history when less than a year into Hackett’s tenure, the company announced it was all but bailing out on sedans in the North American market, dropping such cars as the Fiesta and the Taurus, to focus almost exclusive on SUVs, pickup trucks, and iconic cars such as the Mustang. Ford also made a push toward electric vehicles. It was a controversial move at the time but it has paid off, he said, revealing that reservations for the revamped Ford Bronco had surpassed the company’s wildest expectations and stood at 150,000. Ford shares have lost 27% this year compared with losses of around 6% for the Dow Jones Industrial Average DJIA, +0.56% and contrasting with gains around 2% for the S&P 500 index. SPX, +0.87%"}]}