{"article": [{"url": "https://www.marketwatch.com/story/scrapping-payroll-tax-without-replacement-would-hit-social-security-benefits-by-2021-actuary-says-11598371897", "published": 1598524820.0, "headline": "Trump plan to scrap payroll tax would reduce benefits by 2021, top Social Security actuary says", "body": "In this May 8, 2008 file photo, blank U.S. Treasury checks are seen on a roll at the Philadelphia Financial Center, which disburses payments on behalf of federal agencies, in Philadelphia. (AP Photo/Matt Rourke, File) Repealing the payroll tax as proposed by President Donald Trump without putting in place a new source of funding for Social Security would mean disability payments would end in mid-2021 and payments to the elderly would stop in 2023, according to the program’s chief actuary. Capitol Hill Democrats touted the letter on Monday as proof that Trump’s recent talk of getting rid of the payroll tax permanently would endanger the politically popular pension program, and presidential son Donald Trump Jr. lauded that night in his Republican convention address the executive order on the suspension of payroll-tax collection. The White House has argued that Trump only wanted a temporary holiday, not a permanent payroll-tax repeal, despite Trump’s own words: He has suggested that, if re-elected, the tax’s suspension would become permanent. Federal payroll taxes are imposed on employers and employees, ordinarily consisting of a tax of 6.2% of wages paid by employees and another contribution of 6.2% paid by employers, up to a salary limit. Chief Actuary Stephen Goss, in a letter to four Democratic senators, analyzed a hypothetical proposal where the payroll tax was eliminated on Jan. 1, 2021, without a replacement. That would leave the two Social Security trust funds — the one for Disability Insurance and the other for Old Age and Survivors Insurance — reliant on existing cash, interest paid on government bonds and taxes paid on Social Security benefits for income. “If this hypothetical legislation were enacted, with no alternative source of revenue to replace the elimination of payroll taxes on earned income paid on January 1, 2021 and thereafter, we estimate that DI Trust Fund asset reserves would become permanently depleted in about the middle of calendar year 2021, with no ability to pay DI benefits thereafter. We estimate that OASI Trust Fund reserves would become permanently depleted by the middle of calendar year 2023, with no ability to pay OASI benefits thereafter,” Goss wrote. “This analysis makes clear — this is another thinly veiled attempt to gut Social Security and go after the American people’s hard-earned benefits. We can’t let Trump get away with this and will do everything in our power to prevent this disastrous policy from ever going into effect,” said Sen. Chris Van Hollen, a Maryland Democrat and one of the senators who requested the analysis. In announcing his plans Aug. 8 to allow employers to defer workers’ payroll taxes temporarily, Trump said, “If I’m victorious on Nov. 3, I plan to forgive these taxes and make permanent cuts to the payroll tax. So I’m going to make them all permanent.” Trump added, “But if I win, I may extend and terminate. In other words, I’ll extend it beyond the end of the year and terminate the tax.” But on Aug. 13, White House spokeswoman Kayleigh McEnany walked Trump’s remarks back, saying, “The president is very clear on this matter that he wants a permanent forgiveness of the deferral. That’s as far as he’s gone, and he’s gone even further to say he’s going to make sure that Social Security is fully funded.” In his letter, Goss said he was not aware of any existing legislation to repeal the payroll tax and his analysis was based on parameters set by the senators in their request. Goss also said if Social Security were protected from losing money by having cash directed its way from government general fund monies, as happened with temporary payroll-tax holidays in 2010, 2011 and 2012, “the projected depletion date of the trust fund reserves would be essentially unaffected by the legislation.” Because the government borrows more than it takes in, any transfer from general fund monies to offset the lost payroll-tax revenue would also increase the national debt by increasing annual borrowing. The “depletion” dates in Goss’s estimates are different than the annual trust fund exhaustion projections put out by a board of Social Security trustees that project when the programs will be unable to pay full benefits because of the financial stress caused by the retirement of the baby boom generation. In April, the trustees said the combined Old Age and Disability trust funds would be unable to pay out full benefits starting in 2035, when they would only be able to pay 79% of what was promised. The exhaustion date was unchanged from the 2019 projections."}]}