{"article": [{"url": "https://www.marketwatch.com/story/pence-drops-plan-to-attend-trump-campaign-fundraiser-hosted-by-qanon-backers-2020-09-13", "published": 1600077860.0, "headline": "Pence drops plan to attend Trump campaign fundraiser hosted by QAnon backers", "body": "BILLINGS, Mont. (AP) — Vice President Mike Pence has canceled plans to attend a Trump campaign fundraiser in Montana following revelations that the event’s hosts had expressed support for the QAnon conspiracy theory. President Donald Trump’s re-election campaign told the Associated Press on Saturday that Pence’s schedule had been changed, but the campaign did not provide a reason or say whether the fundraiser might be held at a later time. The change comes after the AP reported Wednesday that hosts Cayrn and Michael Borland in Bozeman, Mont., had shared QAnon memes and retweeted posts from QAnon accounts. The baseless conspiracy theory alleges Trump is battling an entrenched bureaucracy and sex trafficking ring run by pedophiles. See: QAnon conspiracy theory is on the ballot in some states this November Three Republicans seeking election in Montana also had been scheduled to attend the fundraiser: U.S. Sen. Steve Daines, who faces a November challenge from Democratic Gov. Steve Bullock; U.S. Rep. Greg Gianforte, a Republican running for governor; and state auditor Matt Rosendale, a candidate for the U.S. House. Pence, Daines and the other Republican candidates are still scheduled to hold a campaign rally Monday afternoon in Belgrade, near Bozeman. Pence will host a rally earlier in the day in Wisconsin, an event that was added as a substitute for the fundraiser, the Trump campaign said. Daines campaign spokesperson Julia Doyle said the first-term senator does not know the Borlands nor “does he know what QAnon even is.” Mike Pence speaks during a campaign rally. Getty She referred questions on whether the event would be rescheduled to the Trump campaign. Gianforte, who faces Democratic Gov. Lt. Gov. Mike Cooney in November, also does not know the Borlands or what QAnon is, spokesman Travis Hall said. A Rosendale spokesman said he was unaware of QAnon. Rosendale “isn’t focused on false conspiracy theories and the attempts of liberal extremists to smear the President,” spokesman Andy Westberry said in an email. He declined to say if Rosendale knows the Borlands. “ President Donald Trump has refused to condemn QAnon, recently telling reporters that the conspiracy theory is ‘gaining in popularity’ and enthusing that its supporters ‘like me very much.’ ” The Borlands have donated over $220,000 to Trump’s re-election bid, the bulk of which was made in Caryn Borland’s name, and they were guests at the national GOP convention last month. The QAnon narrative has grown to include other long-standing conspiracy theories, gaining traction among some extreme Trump supporters. The movement is often likened to a right-wing cult. Some followers have run for office, primarily in the Republican Party, though some have been independent or run as third-party candidates. The president has refused to condemn QAnon, recently telling reporters that the conspiracy theory is “gaining in popularity” and that its supporters “like me very much.” Pence has said it’s a conspiracy theory and last month told CBS, “I don’t know anything about QAnon, and I dismiss it out of hand.” The Borlands have shared multiple QAnon social media posts, as well as other discredited conspiracies. Michael Borland prominently featured several QAnon “Q” logos on his Facebook FB, +0.26% page. Caryn Borland has retweeted or engaged with QAnon Twitter TWTR, -0.23% accounts. In April, she responded to a pro-Trump Tweet from a QAnon account by replying “Always” with a praying-hands emoji. The Borlands did not return telephone messages Saturday seeking comment."}]}