{"article": [{"url": "https://www.marketwatch.com/story/why-chrissy-teigen-and-john-legends-miscarriage-hits-close-to-home-for-many-families-2020-10-01", "published": 1601712080.0, "headline": "Why Chrissy Teigen and John Legendâ\u0080\u0099s miscarriage hits close to home for many families", "body": "Thereâ\u0080\u0099s a reason why Chrissy Teigen and John Legend have received an outpouring of support on social media after revealing that they lost their third child following pregnancy complications. And no, itâ\u0080\u0099s not simply because theyâ\u0080\u0099re famous. Sadly, itâ\u0080\u0099s because 10% to 20% of known pregnancies end in miscarriage, so many people have shared the celebrity coupleâ\u0080\u0099s pain. Teigen, a cookbook author, model and social-media influencer, shared a series of black-and-white photos to Instagram FB, +0.26% Â and Twitter TWTR, -0.23% late Wednesday. One showed her tearfully clasping her hands together while sitting in a hospital bed. Another revealed her cradling her son with her husband. â\u0080\u009cWe are shocked and in the kind of deep pain you only hear about, the kind of pain weâ\u0080\u0099ve never felt before,â\u0080\u009d Teigen wrote in the accompanying caption, revealing that she and Legend had started calling the baby Jack. It was not clear how far along Teigen was in her pregnancy, as she had only let slip that she was expecting last month. â\u0080\u009cTo our Jack â\u0080\u0094 Iâ\u0080\u0099m so sorry that the first few moments of your life were met with so many complications, that we couldnâ\u0080\u0099t give you the home you needed to survive,â\u0080\u009d she wrote in her heartfelt post. â\u0080\u009cWe will always love you.â\u0080\u009d “ â\u0080\u009cDriving home from the hospital with no baby. How can this be real.â\u0080\u009d ” â\u0080\u0094 Chrissy Teigen Celebrities, politicians and pundits shared their condolences beneath the coupleâ\u0080\u0099s social media posts, which went viral, coincidentally, on the first day of Pregnancy and Infant Loss Awareness Month.Â They included Hillary Clinton, Sen. Kamala Harris, Ellen DeGeneres, Viola Davis, Dwayne Johnson, Mandy Moore, Monica Lewinsky, Sarah Silverman, Bradley Whitford and Chris Hayes. But there was also a flood of support from parents who arenâ\u0080\u0099t household names. Many shared their own miscarriage experiences. One woman revealed that she lost a daughter at 20 weeks. And while she tends to â\u0080\u009cnever ever post on this stupid twitter thing,â\u0080\u009d she felt compelled to let Teigen know that, â\u0080\u009cI feel your pain, from many miles away.â\u0080\u009d Another disclosed that the birthday of her daughter Maya, who was stillborn at 21 weeks, will be this upcoming Monday. â\u0080\u009cOh, momma. It hurts,â\u0080\u009d she wrote under Teiganâ\u0080\u0099s Instagram post. Up to 20% of known pregnancies end in miscarriage, which is the spontaneous loss of a pregnancy before the 20th week. That number could actually be higher, however, because many miscarriages occur early in a pregnancy, before a woman even knows that she is pregnant. The Mayo Clinic has more information about miscarriages and complications here â\u0080\u0094 where it also busts myths, such as claims that exercise, sex or working (provided one isnâ\u0080\u0099t exposed to toxic chemicals or radiation) cause miscarriages. But even though, statistically, up to one in five pregnancies end in miscarriage, itâ\u0080\u0099s still largely not talked about. Jamie Kreiter, a Chicago-based therapist, recently told HuffPost that â\u0080\u009cI do think that one of the reasons why we donâ\u0080\u0099t talk about this is that we donâ\u0080\u0099t want to scare other women.â\u0080\u009d Rayna Markin, a psychologist and associate professor at Villanova University, told the media outlet that women also receive â\u0080\u009cstrong messages from society that [miscarriage] details are too disgusting to talk about and should be silenced.â\u0080\u009d Because the physical and emotional side effects of a miscarriage can be severe. Some women have to have surgery to remove the fetal tissue. And a study published in the American Journal of Obstetrics and Gynaecology in January found that one in six women who miscarry suffer long-term post-traumatic stress. The U.K. study of 650 women reported 29% of them showed symptoms of post-traumatic stress one month after their pregnancy loss; 24% exhibited anxiety, and 11% had signs of depression. Nine months later, 18% were still showing PTSD symptoms. So while some readers questioned why Teigen and Legend would make such a personal loss public, others appreciated that they are shedding light on a traumatic experience that doesnâ\u0080\u0099t get enough attention. â\u0080\u009cFor too long families â\u0080\u0094 especially women â\u0080\u0094 went through this kind of thing in secret, making more and more people feel alone and sometimes ashamed,â\u0080\u009d wrote one, adding that â\u0080\u009cyou are so appreciated.â\u0080\u009d â\u0080\u009cSo many mothers and families struggle with miscarriages and losing a child. They feel alone,â\u0080\u009d wrote a male Twitter follower. â\u0080\u009cSpeaking about it at least letâ\u0080\u0099s them know that they are not by themselves.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Former first lady Michelle Obama wrote in her 2018 memoir â\u0080\u009cBecomingâ\u0080\u009d that she had suffered a miscarriage, writing, â\u0080\u009cWhat nobody tells you is that miscarriage happens all the time, to more women than youâ\u0080\u0099d ever guess, given the relative silence around it. I learned this only after I mentioned that Iâ\u0080\u0099d miscarried to a couple of friends, who responded by heaping me with love and support and also their own miscarriage stories.â\u0080\u009d Beyonce also revealed in Elleâ\u0080\u0099s January 2020 cover story that she had multiple miscarriages before giving birth to daughter Blue Ivy in 2012. Miscarriages can take an enormous financial toll on a family, as well, with the medical bills causing parents to confront the trauma of the lost pregnancy over and over again. The costs for a procedure called a dilation and curettage (D&C) â\u0080\u0094 which surgically clears the uterine lining after a first trimester miscarriage â\u0080\u0094 runs from $2,400 to upwards of $7,500, according to the Healthcare Bluebook medical-cost site. But while insurance usually covers the cost of a miscarriage, Parents.com warns that there are often large co-pays, or expenses associated with an emergency room visit or an anesthesiologist, that can hit women with surprise medical bills. And keep in mind that some 44 million Americans are uninsured. Whatâ\u0080\u0099s more, parents may have to take time off from work to recover from the miscarriage, and roughly 33.6 million Americans, or 24% of U.S. civilian workers, donâ\u0080\u0099t have access to paid sick leave. One North Carolina woman told Parents that she got stuck with $10,000 in medical bills for her second miscarriage. â\u0080\u009cWe both have good jobs, work full time, and have a normal amount of debt for homeowners, but having roughly $10,000 in medical bills was devastating â\u0080\u0094 especially having to spend so much money and not getting to bring home your child,â\u0080\u009d she said. Parents.com has some tips on dealing with the financial fallout of a miscarriage, such as asking doctors about all treatment and procedure options, voicing concerns about the cost of procedures, and finding out whether the anesthesiologists are covered by your insurance. Read more here. For more resources on miscarriage, Share Pregnancy & Infant Loss Support is a national organization with more than 75 chapters in 29 states. The Seleni Institute also offers counseling for anxiety and depression centered around pregnancy, including miscarriage and stillborn loss. This Seleni article outlines how to get support after pregnancy loss. The March of Dimes offers guidance to miscarriage and stillbirths, as well. It includes resources on dealing with grief, physical and emotional recovery, and how to work through feelings about getting pregnant again or not."}]}