{"article": [{"url": "https://www.marketwatch.com/story/we-have-190000-in-retirement-savings-and-want-to-use-the-covid-related-distribution-rules-to-pay-off-40000-in-debt-should-we-2020-06-22", "published": 1594479860.0, "headline": "We have $190,000 in retirement savings and want to use the COVID-related distribution rules to pay off $40,000 in debt â\u0080\u0094 should we?", "body": "Dear MarketWatch, Iâ\u0080\u0099ve been contemplating taking the penalty-free COVID withdrawal from my Thrift Savings Plan retirement account. My wife and I earn roughly $180,000 a year combined and have about $190,000 in our retirement plans â\u0080\u0094 $110,000 in my plan and $79,000 in her 403(b). We each contribute 15% and get our respective employer matches at 5%. We are both in our mid-40s. My wife, who works in health care, is working 32 hours a week instead of 36. While it doesnâ\u0080\u0099t seem like a ton, at $40/hour, it adds up every month. We have one auto loan where we owe $12,000 at 2.1% APR with two years left, and another car with an auto loan where we owe $13,000 at 1.9% APR. We also owe $17,000 on credit cards at a 0% interest rate until the summer of 2021, which were used for home renovations (since completed). We owe $298,000 on our house. We also have a repayment plan in place for our federal student loans, which are on COVID holiday until October and our payments are around $1,400 a month. We each have three years left to pay them off. We also have two children, 11 and 9, but zero socked away for their college. “ Need some help with your own retirement planning? Email us at HelpMeRetire@marketwatch.com ” My question is this: provided I qualify to make the COVID-related withdrawal, would it be foolish to withdraw $40,000 from my Thrift Savings Plan (not as a loan but as a withdrawal) and spread the income tax out over three years to be debt free (aside from my house and student loans)? We are very disciplined with paying bills and contributing to retirement. Weâ\u0080\u0099ve always paid credit card balances in full every month (aside from the bills we racked up from the renovation). Thankfully, I have superb credit. We will drive these cars until they die and the house is where we want it so we plan to stay forever. I want to do this because I worry about time â\u0080\u0094 time left to invest in other things, to escape the rat race and have financial freedom. I figure if we just keep making the payments it will take me at least 2-3 years to pay all of this stuff off. I will be close to 50 then and my kids will be closer to college. Otherwise, I can take the $40,000 out in one shot and start again fresh so we have some more capital to invest. Respectfully, The public servant family See: I want to retire to a rural location with four seasons that gets me out of New York state â\u0080\u0094 so where should I go? Dear Public Servant Family, As you know, the CARES Act increased the amount of money Americans can withdraw from their retirement plans if they were financially impacted by the crisis, such as falling ill, losing a job or seeing a reduction in wages. The Internal Revenue Service even expanded the eligibility requirements last week to include people who had a job offer rescinded, a delayed start date or are in the same household as another person affected by the crisis. There are no minimum amounts of money lost or hours reduced to qualify, so you are technically able to withdraw money from your plans if you wanted because of her reduction in hours (and the fact that it affects you). Hereâ\u0080\u0099s more from the IRS on the rules and eligibility requirements, as well as information from the governmentâ\u0080\u0099s Thrift Savings Plan site. The law eliminated the penalty fee for these distributions, which makes it a tempting offer for people who want to dip into their retirement savings but previously couldnâ\u0080\u0099t do so without incurring extra fees. Financial advisers, however, suggest you donâ\u0080\u0099t quickly jump on this opportunity. Hereâ\u0080\u0099s why: Distributions or loans from retirement plans should be considered as a last resort, because when you take money out of these accounts you are stunting the potential growth of those assets for your future. With a lower balance, compound interest wonâ\u0080\u0099t accumulate as quickly. Situations can also become complicated. A loan has to be repaid, but that timeline could be rushed if the borrower loses their job, and a distribution â\u0080\u0094 as you asked about â\u0080\u0094 still incurs tax penalties, which can become a hefty bill. In your particular situation, the taxes owed would be at higher rates than the current interest rates of your debt, said Salim Boutagy, a financial adviser at Congress Wealth Management. Retirement plan distributions are taxed as ordinary income. Based on the information you shared, if youâ\u0080\u0099re filing married jointly, youâ\u0080\u0099re somewhere around the 22% to 24% tax bracket. A $40,000 distribution would equate to a roughly $9,000 tax bill, which could be broken up over three years. â\u0080\u009cYouâ\u0080\u0099re trading one debt for another, essentially,â\u0080\u009d said Tom Zgainer, founder and president of sales for Americaâ\u0080\u0099s Best 401(k), a retirement plan provider. I know you said you have the intention to spread out and pay off those taxes, but youâ\u0080\u0099d be better off creating a written budget inclusive of your current debt and assets, and focusing more heavily on saving, said Scott Bishop, a partner and executive vice president of financial planning at STA Wealth Management â\u0080\u009cI would have him look at his budget and see if there is any fat at all to get rid of some discretionary spending,â\u0080\u009d he said. â\u0080\u009cIf they are doing that to have more to spend now so that they can be â\u0080\u0098better saversâ\u0080\u0099 â\u0080\u0094 the logic is flawed.â\u0080\u009d Ask yourself: â\u0080\u009cJust because I can take this money out, should I?â\u0080\u009d There are alternatives to a distribution, said Ed Jastrem, director of financial planning at Heritage Financial. For example, lowering retirement plan contributions â\u0080\u0094 just enough to still get the full employer match â\u0080\u0094 would give you more money in each paycheck to pay down your debts within the next few years, just as you would if you were paying off the taxes from your distribution, he said. If going that route, the key is to pay down the debts with the higher interest rates, which are still pretty low for you, Bishop said. Youâ\u0080\u0099re already doing something other advisers would suggest: using 0% interest cards. Thereâ\u0080\u0099s still time to make your decision. The COVID-related distribution rules are available between Jan. 1 and Dec. 31, 2020 â\u0080\u0094 only after that would you lose your ability to spread out the tax liability over three years and incur a 10% penalty on the distribution. The dollar limit, which increased from $50,000 to $100,000 for COVID-related distributions and loans, is available until Sept. 22, though you said you only want to withdraw $40,000. Still not sure? Iâ\u0080\u0099ll leave you with this: remember why thereâ\u0080\u0099s money in those retirement plans. Itâ\u0080\u0099s for your financial security in the future. A $40,000 distribution is more than 20% of your combined retirement assets â\u0080\u0094 more than 36% of your individual Thrift Savings Plan balance alone. â\u0080\u009cWith retirement planning, you either have enough money or you donâ\u0080\u0099t and it is often very hard to make it up later,â\u0080\u009d Boutagy said. College costs are a concern for many parents, but there are more options available to fund college, including choosing an affordable school, using loans responsibly, taking advantage of any tax credits available at the time and working with the kids to pay off those expenses as quickly as possible. â\u0080\u009cAs tempting as it is, and as broad of the qualifications, donâ\u0080\u0099t do it,â\u0080\u009d Boutagy said. â\u0080\u009cIf your back is against the wall then I would say do it, but if youâ\u0080\u0099re in a situation like this where he doesnâ\u0080\u0099t need it but heâ\u0080\u0099d like it, Iâ\u0080\u0099d say no.â\u0080\u009d Letters are edited for length and style. Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com."}]}