{"article": [{"url": "https://www.marketwatch.com/story/cdc-warns-that-people-are-going-blind-and-dying-from-drinking-hand-sanitizer-2020-08-06", "published": 1599575000.0, "headline": "People are going blind and dying from drinking hand sanitizer: CDC", "body": "Don’t drink hand sanitizer — even if it comes in a beer can. While using the alcohol-based gels and liquids has become an integral part of hand hygiene during the coronavirus pandemic, the Centers for Disease Control and Prevention (CDC) recently released a worrisome report showing some adults are suffering seizures, losing their vision and even dying from consuming hand sanitizer laced with methanol. What’s more, the Food and Drug Administration’s (FDA) has had to issue an alert to consumers over hand sanitizers that are flavored and packaged in food and drink containers, including beer cans, children’s food pouches, juice boxes, water bottles and vodka bottles that further blurs the line on how these hygiene products should be used. “These products could confuse consumers into accidentally ingesting a potentially deadly product,” the FDA commissioner said in a statement. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The FDA also has an expanding list of recalled hand sanitizer products that it says contain methanol, which is a toxic substance that could cause death if too much is absorbed into the skin or it is consumed. Alcohol-based hand sanitizer should only contain ethanol (ethyl alcohol) or isopropanol (isopropyl alcohol), which are safe to use. But some products imported into the U.S. have been found to contain methanol -— despite claiming to have ethanol. Now the FDA’s “do not touch” list of toxic hand sanitizer brands has spilled over to 75 products, including brands such as Blumen and Hello Kitty by Sanrio. Read more:The FDA’s list of toxic sanitizers is surging—now at 75. Here’s why The CDC was notified on June 30 about cases of methanol poisoning in Arizona and New Mexico. After reviewing 62 calls to poison centers in those states between May 1 and June 30, it found 15 cases of methanol poisoning by ingestion in adults ages 21 to 65. Thirteen of them were male, and all of them had a history of swallowing alcohol-based hand sanitizer products. Four people died. The CDC report doesn’t reveal why these individuals drank the hand sanitizer, but it notes that children will sometimes swallow the substance accidentally, or teens and adults with a history of alcohol abuse may drink it as an alcohol substitute. iframe.twitter-tweet { width: 100% !important; } But what it does describe are the consequences. Methanol poisoning can cause serious side effects and death if left untreated. Six of the 15 people admitted to the hospital suffered seizures, and they still had visual impairments when they were discharged. The report details one case study, in particular: a 44-year-old man who was hospitalized for six days with acute methanol poisoning. His treatment was complicated by seizures, and he went home with near-total vision loss. “ “Persons should never ingest alcohol-based hand sanitizer, avoid use of specific imported products found to contain methanol, and continue to monitor FDA guidance.” ” — CDC “This investigation highlights the serious adverse health events, including death, that can occur after ingesting alcohol-based hand sanitizer products containing methanol,” the CDC report states. “Safety messaging to avoid ingestion of any alcohol-based hand sanitizer product should continue. Persons should never ingest alcohol-based hand sanitizer, avoid use of specific imported products found to contain methanol, and continue to monitor FDA guidance.” It also cautions that kids using hand sanitizer should be supervised, and that these products should be kept out of reach of children when not in use. The CDC notes that this report just looked at two states, so cases of methanol poisoning from drinking hand sanitizer could be higher. “Health departments in all states should coordinate with poison centers to identify cases of methanol poisoning,” it writes. This isn’t the first warning about hand sanitizer products doing more harm than good. Earlier in the pandemic, health officials and liquor brands like Everclear grain alcohol and Tito’s Handmade Vodka warned consumers not to use booze to concoct homemade hand sanitizer while such disinfectant products were hard to come by during the first wave of pandemic panic shopping. Read more:Why you shouldn’t use Tito’s Vodka to make hand sanitizer — or attempt to make your own hand sanitizer period The CDC has recommended using alcohol-based hand sanitizer products that contain at least 60% ethyl alcohol or 70% isopropyl alcohol in community settings during the pandemic to help prevent the spread of COVID-19. Other approved ingredients may include sterile distilled water, hydrogen peroxide and glycerin, according to the FDA. But as noted above, the FDA has also flagged 75 hand sanitizer products contaminated with toxic methanol. Check out the complete list of recalled sanitizer products here. If you have any in your home, stop using them, and dispose of them in hazardous waste containers. Do not flush them down the toilet or dump them down the drain. Read more:Things to look for when buying hand sanitizer Or you can avoid the risk by avoiding sanitizer altogether — Both the WHO and the CDC agree that scrubbing your hands with soap and water for 20 seconds is a much more effective way to reduce the risk of infection. The CDC clearly states in its guidelines that “soap and water are more effective than hand sanitizer at removing certain kinds of germs.” Stay up to date with MarketWatch’s coronavirus coverage here. This article was originally published on Aut. 6, 2020, and has been updated with the FDA’s list of recommended hand sanitizer ingredients, and the consumer warning about hand sanitizer sold in food and drink packaging."}]}