{"article": [{"url": "https://www.marketwatch.com/story/everybody-is-struggling-how-olympic-athletes-are-coping-with-tokyo-2020-being-postponed-a-year-11602088852", "published": 1602076880.0, "headline": "â\u0080\u0098Everybody is strugglingâ\u0080\u0099 â\u0080\u0094 how Olympic athletes are coping with Tokyo 2020 being postponed a year", "body": "Winners US Jennifer Valente, Chloe Dygert, Emma White and Lily Williams pose on the podium after the Women's Team Pursuit Finals at the UCI track cycling World Championship at the velodrome in Berlin on February 27, 2020. (Photo by Odd ANDERSEN / AFP) (Photo by ODD ANDERSEN/AFP via Getty Images) odd andersen/Agence France-Presse/Getty Images Emma White, a 22-year old professional racing cyclist, was set to compete in her first Olympics this Summer in Tokyo. Then the coronavirus pandemic happened. Itâ\u0080\u0099s been six months since the COVID-19 pandemic forced the International Olympic Committee to postpone the Tokyo 2020 Olympics until 2021, leaving thousands of athletes wondering what will happen next. â\u0080\u009cItâ\u0080\u0099s exhausting. You eat, sleep and breathe thinking about the Olympics. Every decision in your life on and off the bike is for this one goal. To push that back a year, itâ\u0080\u0099s a big mental challenge.â\u0080\u009d White, who is on the U.S. Womenâ\u0080\u0099s Team Pursuit, said her training regimen had to be completely reset with the postponement. But to White, itâ\u0080\u0099s more about the mental hurdles than the physical ones. â\u0080\u009cItâ\u0080\u0099s tough to stay motivated and positive through all this,â\u0080\u009d White told MarketWatch. â\u0080\u009cItâ\u0080\u0099s gonna be a big mental battle.â\u0080\u009d While this Summerâ\u0080\u0099s Olympics were technically postponed, not canceled, this is only the fourth time since 1896 that the Olympics did not happen as scheduled. The other occasions were during World Wars in 1916, 1940 and 1944. The postponement of the Tokyo Games, along with outright cancelations of other competitions this year, is a major letdown for athletes, but it also comes with serious financial ramifications. White claims that she recently had to get some roommates to help save money. â\u0080\u009cI had an apartment in Schenectady (New York), and just moved back in with my parents,â\u0080\u009d White told MarketWatch with a laugh. â\u0080\u009cEverything the Giving Games is doing is really important I think because everybody is struggling.â\u0080\u009d The Giving Games is a fundraising effort to allow fans to assist athletes in their journey to the Tokyo Olympics, now taking place in 2021. Fans can donate money to the Olympians and learn about U.S.Â athletes and feel a part of the team. Unlike other countries, the U.S. government does not directly give money to athletes to train and participate in the Olympics, according to several athletes interviewed for this piece. So if an Olympic athlete is not in a professional sports league like the NBA, it can be difficult for them financially to train properly. â\u0080\u009cA lot of people assume that athletes get paid a lot of money, which is so not true,â\u0080\u009d Kaitlyn Verfuerth, a three-time Paralympian who was set to compete in Tokyo, told MarketWatch. â\u0080\u009cIn fact some of us are the poorest people in the world.â\u0080\u009d Training for competition and paying bills can be difficult. MarketWatch has chronicled Olympians in the past who have taken part-time jobs at places like Dickâ\u0080\u0099s Sporting Goods to help with rent. Kaitlyn Verfuerth of the U.S.A. competes in the Wheelchair Tennis match during day two of the 2008 Paralympic Games in Beijing, China. Getty Images And the postponement of the Tokyo Games has interrupted the long-term financial planning for many Olympic athletes. Athletes know they cannot compete forever, and many will have to transition to more traditional jobs when their athletic careers are over.Â Verfuerth warns that athletes, especially older ones, who were about to begin a non-athletic career have had their plans upended. â\u0080\u009cTheir whole life has been set back a year,â\u0080\u009d Verfuerth told MarketWatch. â\u0080\u009cMaybe they were going to start focusing on their career or another aspect of their life.â\u0080\u009d One potential life raft? The U.S. Olympic & Paralympic Committee Headquarters in Colorado Springs.Â The Colorado facility is a place where athletes can have a residence and live for part of the year to train with their teams. It is open to athletes for varying amounts of time â\u0080\u0094 space is somewhat limited however, and only certain athletes can qualify for residence based on past competition finishes. There is some room for optimism that the Tokyo Olympics will happen as planned in July 2021. Multiple major sports leagues including the NBA and MLB have found ways to compete during the pandemic. Some leagues have been more successful than others at containing the virus during their seasons. Members of the Olympic committee, including IOC President Thomas Bach, have repeatedly stated that a coronavirus vaccine is not needed for the Tokyo Olympics to proceed. Are the Olympic athletes convinced next yearâ\u0080\u0099s games will happen? Kaitlyn Verfuerth is not so sure. â\u0080\u009cThe way the U.S. is handling things, I feel very unsure about it happening in 2021. I just donâ\u0080\u0099t see how we can all be together.â\u0080\u009d"}]}