{"article": [{"url": "https://www.marketwatch.com/story/the-american-tragedy-a-lousy-economy-and-lots-of-covid-19-infections-11595525239", "published": 1595924360.0, "headline": "The American tragedy: A lousy economy and lots of COVID-19 infections", "body": "A woman walks by a bankrupt business on July 21 in Brooklyn, Spencer Platt/Getty Images WASHINGTON (Project Syndicate)—The future of the world economy is becoming clearer. At the outset of the pandemic, there were lively disagreements over whether the lockdown and other measures were warranted, or whether the economic costs were too high. Now, it is increasingly evident that economic activity will resume fully only after lockdown restrictions have been given time to work. Otherwise, COVID-19 will continue to spread, making a sustained and rapid economic recovery all but impossible until the arrival of effective, widely available vaccines. When the coronavirus first began to spread beyond China, triggering an immediate, sharp reduction in the level of economic activity and employment where lockdowns were imposed, epidemiologists tried to educate the public (and the authorities, in many cases) about what would come next. Follow the latest on the coronavirus pandemic on MarketWatch. They warned that the virus would not be sufficiently contained until its R number—the average number of people infected by a sick person—is less than one. At exactly one, each sick person infects one other, and the number of COVID-19 cases remains constant over time. An R number below one, scientists explained, could be achieved much faster with tighter restrictions and effective testing and contact tracing to isolate positive cases. “ The tragedy is that if the lockdowns had been effective and enforced everywhere, a quick V-shaped recovery would have been entirely possible. ” In locations where shelter-in-place orders and other measures have been all-encompassing, outbreaks have been stabilized, and the R number has dropped within just two or three weeks. In some places, COVID-19 cases surged exponentially early on, leading to self-quarantine being more common. And because a high percentage of people in hot spots complied with the lockdown recommendations and tracing and testing (likely out of fear), the epidemic curve was quickly dampened. By contrast, in locations where lockdown restrictions were initially mild or nonexistent, fewer people took steps to avoid contact or prevent transmission of the virus, or were more casual about such precautions, and cases duly increased. To be sure, additional location-specific factors have influenced the spread of COVID-19. Lockdowns work But the clear takeaway from around the world is that the scope of lockdown restrictions, and the degree to which they are followed, is the single-most important factor in weathering and then recovering from the pandemic. Unfortunately, in the United States, in particular, popular resistance to restrictions mounted just when continued public compliance was needed. Some politicians and commentators insisted that the economic costs of saving a life were too high relative to the costs inflicted on those suffering a loss of income or medical care for other conditions. This burst of public pressure won the day. Despite epidemiologists’ warnings, the initial lockdown restrictions were relaxed too soon in many U.S. states. Read more provocative commentary on MarketWatch. Worse, as soon as these reopenings began, many people returned immediately to their old habits, ignoring recommendations for social distancing, avoiding crowds (especially indoors), wearing a mask, hand washing, and other preventive measures. Factories reopened, and many retail establishments and other services resumed operations, albeit at reduced capacity. For a short time, output and consumer spending rose significantly, and the unemployment rate started falling (though it remained high). But in most cases, these reopenings started with an R number close to or above one, which guaranteed that as soon as people started relaxing precautionary measures, the number of infections would begin to rise again.Lose-lose situation The result is a lose-lose scenario. Current conditions are conducive to neither a sustained improvement in economic activity nor a sustained reduction in COVID-19 cases. If health workers, medical equipment, and testing capacity had been available and properly allocated, public-health authorities might have been able to undertake contact tracing and quarantining on a level sufficient to curb the spread of the virus. That is what happened in countries such as Germany, New Zealand, and South Korea, as well as in cities like New York, which has gone from being the hardest-hit place in the U.S. to achieving an R number of around 0.4-0.5. For testing to be effective, results must be provided quickly, to alert carriers of the virus who might otherwise come into contact with others. The problem is that testing materials and equipment have been in short supply, especially in hot spots. Now that the R number is rising at an alarming rate, some hospitals are already overwhelmed, and, with their workers falling ill, some reopened factories have had to close again. The authorities in highly affected Southern and Southwestern states are already reversing their earlier relaxation of restrictions and imposing additional ones. But even in places where people have adhered to precautionary measures and the R number has not risen significantly, the growth rate of consumption has started to decline. Consumers simply cannot be confident that any reopening will be sustained, and businesses see too much uncertainty to commit to longer-term investments. The tragedy is that if the lockdowns had been effective and enforced everywhere, a quick V-shaped recovery would have been entirely possible. But that didn’t happen, and now the recent upswing appears to be faltering.Epidemiologists were right The best hope for the global economy is that everyone will recognize that the epidemiologists were right all along. The premature relaxation has inflicted unnecessary additional costs, both in terms of health and economic well-being. Public adherence to restrictions on a scale sufficient to bring R number below one would be the best form of economic stimulus imaginable. An R number well below one would mean that when restrictions were removed, consumers and businesses could have confidence that the resulting economic (and health) upturn would continue. A return to normal economic and social activity would happen quite rapidly. The twin goals of defeating the virus and reviving the economy are not contradictory but rather one and the same. The virus will dictate the pace at which we can safely resume economic activity. And it is the public’s adherence to preventive measures that will determine the pace at which the virus is defeated. Anne O. Krueger, a former World Bank chief economist and former first deputy managing director of the International Monetary Fund, is senior research professor at the Johns Hopkins University School of Advanced International Studies and senior fellow at the Center for International Development at Stanford University. This article was published with permission of Project Syndicate—The Open Secret to Reopening the Economy.Further reading: How you can channel your outrage into practical activism to help create a better world The coronavirus-led economic recession may be over, but the depression has barely begun We deserve an economy that provides jobs, public health and a sustainable environment"}]}