{"article": [{"url": "https://www.marketwatch.com/story/government-tax-watchdog-irs-should-not-waste-time-pursuing-1-billion-in-stimulus-checks-sent-to-dead-people-2020-06-29", "published": 1594286240.0, "headline": "Government tax watchdog: IRS should not waste time pursuing $1 billion in stimulus checks sent to dead people", "body": "Less than a week after the Government Accountability Office said the Internal Revenue Service cut stimulus checks to 1.1 million dead people, a report Monday from Erin Collins, the National Taxpayer Advocate said the federal tax collector also sent approximately 74,000 checks to people who have been locked up by law enforcement. The National Taxpayer Advocate is an office that is independent of the Internal Revenue Service, although the two agencies frequently collaborate. “ ‘The National Taxpayer Advocate recommends the IRS not spend its resources pursuing enforcement actions against a decedent’s estate or a family member who received an EIP for a decedent.’ ” Like the Government Accountability Office (GAO) report, Collins noted how dead people received stimulus checks. (The new report said the IRS issued 965,000 checks, compared the 1.1 million checks counted by the GAO.) It’s “unclear what the IRS will do” if taxpayers don’t return stimulus payments, Collins said in a footnote. “However, if the IRS made the payment despite having information in its possession that the individual was in fact deceased, the National Taxpayer Advocate recommends the IRS not spend its resources pursuing enforcement actions against a decedent’s estate or a family member who received an [economic impact payment] for a decedent,” she added. The GAO report last week said the IRS had access to Social Security Administration death records, but didn’t use them when distributing the first three batches of stimulus checks. Incarcerated Americans are also receiving stimulus money Though the IRS says incarcerated individuals need to return the money — just like the relatives of dead people who receive checks — the watchdog office says the tax collector ought to be more specific about which people need to return the money. “A situation could arise where a taxpayer was incarcerated at the beginning of 2020, but was released in the midst of the pandemic — especially since a number of incarcerated individuals were released to mitigate the spread of COVID-19 in the country’s prison system,” Collins noted. Nearly 96,000 people have been released from prisons and jails in the wake of the outbreak, according to a University of California, Los Angles law school database. Some state agencies have been intercepting the stimulus checks. For example, the Kansas Department of Corrections has seized $200,000 in stimulus checks and returned them to the IRS, according to a corrections department spokesman. The open questions on return rules for incarcerated individuals are one example of the wrinkles when the IRS distributed approximately 160 million direct stimulus payments under the Coronavirus Aid, Relief, and Economic Security (CARES) Act. “While the IRS did an impressive job implementing the provisions of the [CARES Act] — particularly under these unprecedented circumstances — there have been several issues in implementing the CARES Act’s most significant provisions,” the report said. The IRS may have to learn from any missteps quickly and gear up for a second round of direct checks soon. Lawmakers are considering another stimulus bill and Treasury Secretary Steven Mnuchin has said a relief package could materialize next month. Benefits information didn’t reflect if certain Social Security and veterans’ benefits recipients had dependents who could qualify for the $500, the report said. The IRS gave a May 5 deadline for these people to add information about children and get the extra money. Though Collins said “these financially-strapped individuals” could always claim the dependents in their 2020 tax returns, that’s a long way from now. IRS should continue to let them update their information and get the stimulus money for dependents, she said. The GAO report also noted the issue about missed money for dependents. Approximately 450,000 stimulus-check recipients didn’t get extra money for dependents in their stimulus payments, the report said. The IRS is finding the accounts and adding the extra payments by the end of next month, the GAO report said. The IRS said it welcomed the report from Collins, who started her role earlier this year. “In response to COVID-19, the IRS delivered stimulus payments in record time,” the IRS said. Millions of Americans started getting stimulus money within two weeks of after the CARES Act’s passage in late March. “By comparison, for the last stimulus payments in 2008, the first 800,000 payments did not start reaching taxpayers for 75 days. Our extraordinary efforts to timely implement relief in the wake of COVID-19 have taken place in the middle of an unprecedented extended filing season.” The National Taxpayer Advocate report offered other insights on the scale of the stimulus-check distribution. Approximately 23 million people submitted direct deposit information to get their checks quicker while 3.7 million people used the IRS’s “non-filer” tool. The online portal gave the IRS information it needed to send stimulus payments to people who didn’t have an income tax filing requirement. COVID-19, the disease caused by the virus SARS-CoV-2, had infected nearly 11.6 million people globally and 2.9 million in the U.S. as of Monday evening, according to official figures collated by Johns Hopkins University’s Center for Systems Science and Engineering. The disease had claimed at least 538,933 lives worldwide and 130,312 in the U.S. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% opened lower Tuesday; it ended higher Monday after better-than-expected unemployment numbers last week amid a surge of coronavirus in states that have loosened restrictions."}]}