{"article": [{"url": "https://www.marketwatch.com/story/mnuchin-virus-aid-package-soon-1200-checks-by-august-2020-07-25", "published": 1595708900.0, "headline": "Mnuchin: Virus aid package soon, $1,200 checks by August", "body": "U.S. Treasury Secretary Steven Mnuchin said Saturday that Republicans were set to roll out the next COVID-19 aid package Monday and assured there was backing from the White House after he and President Donald Trump’s top aide met to fine-tune the $1 trillion proposal that had floundered just days before. Mnuchin told reporters at the Capitol that extending an expiring unemployment benefit — but reducing it substantially — was a top priority for Trump. The secretary called the $600 weekly aid “ridiculous” and a disincentive for people to go back to work. He also promised a fresh round of $1,200 stimulus checks would be coming in August. “We’re prepared to move quickly,” Mnuchin said after he and Mark Meadows, the president’s acting chief of staff, spent several hours with GOP staff at the Capitol. He said the president would “absolutely” support the emerging Republican package. Mnuchin’s optimistic assessment came before Democrats weighed in publicly on the updated proposal, which remained only a starting point in negotiations with House and Senate leaders in the other party. He said he recently called House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer ahead of shuttle negotiations next week on the broader deal. The White House and Senate Republicans were racing to regroup after plans to introduce a $1 trillion virus rescue bill collapsed Thursday amid GOP infighting over its size, scope and details. It was expected to bring $105 billion to help schools reopen, new money for virus testing and benefits for businesses, including a fresh round of loans, tax breaks and a sweeping liability shield from COVID-related lawsuits. As Republicans struggled, the White House team downplayed the differences with the GOP senators as overblown and said Trump was focused on providing relief. “The president has been very clear. He wants to make sure that the American people have what they need during this unprecedented time,” Meadows said, “to make sure not only the money is there but the programs.” The expiration of the $600 weekly jobless benefits boost had been propelling the Republicans to act. Democrats already approved their sweeping $3 trillion plan from Pelosi two months ago. But with millions of Americans about to be suddenly cut off from the aid starting next Saturday, they were bracing to prevent social and economic fallout. The White House floated plans to cut the additional aid back to $100 a week, while Senate Republicans preferred $200, with general agreement about phasing out the flat boost in favor of one that ensures no more than 70% of an employee’s previous pay. Mnuchin also said the $1,200 direct payments would be based on the same formula from the earlier aid bill. Individuals making $75,000 or less, for example, received the full amount and those making more than $75,000 received less than $1,200 depending on their income. Individuals earning above $100,000 did not qualify for the payment. “We’ll get the majority of them out in August and those will help people,” Mnuchin said. The administration officials said the overall package remained at $1 trillion, apparently on par with Senate Majority Leader Mitch McConnell’s original draft. That strategy enabled McConnell, who did not have full support from his GOP majority, to avoid having to force a vote and endure a failed outcome. But it also gave Democrats some leverage in insisting on their priorities as part of any final deal. The path ahead remained uncertain, but both sides were scrambling to reach a deal by the end of the month."}]}