{"article": [{"url": "https://www.marketwatch.com/story/white-house-democrats-agree-to-try-to-reach-coronavirus-aid-deal-by-weeks-end-11596583067", "published": 1596569120.0, "headline": "White House, Democrats agree to try to reach coronavirus-aid deal by weekâ\u0080\u0099s end", "body": "Treasury Secretary Steven Mnuchin speaks to the media as White House chief of staff Mark Meadows listens Tuesday at the U.S. Capitol. Getty Images After more than a week of almost daily face-to-face meetings, Trump administration officials and congressional Democratic leaders have agreed to try to reach a coronavirus-aid bill deal by the weekâ\u0080\u0099s end. Treasury Secretary Steven Mnuchin told reporters on Capitol Hill of the new timeline late Tuesday. â\u0080\u009cWe are pleased to report that although we still have a lot of open issues â\u0080\u0094 I just want to be very clear, weâ\u0080\u0099re not at the point of being close to a deal â\u0080\u0094 but we did try to agree to set a timeline that weâ\u0080\u0099re going to try to reach an overall agreement, if we can get one, by the end of this week, so that the legislation could be then passed next week,â\u0080\u009d Mnuchin said. A Democratic aide confirmed that party leaders were in agreement on the timeline. Mnuchin, accompanied by White House chief of staff Mark Meadows, has been meeting with House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer regularly since July 27, but the quartet has publicly reported only sporadic â\u0080\u0094 and usually unspecified â\u0080\u0094 progress. Tuesdayâ\u0080\u0099s announcement marks the most significant advance yet in the talks for a new stimulus bill, even though it, too, lacked detail. â\u0080\u009cWeâ\u0080\u0099re going to work around the clock the next few days to see if we can bridge the issues. Some issues weâ\u0080\u0099ve been able to agree on, some significant issues are still open,â\u0080\u009d Mnuchin said, adding the pair will be back on Capitol Hill on Wednesday. Earlier in the day, after meeting with Mnuchin and Meadows, Pelosi had also signaled a thaw in the talks. â\u0080\u009cWe agree that we want to have an agreement. AndÂ in that case, we then say, thatâ\u0080\u0099s our goal â\u0080\u0094 lets engineer back from there as to what we have to do to get that done,â\u0080\u009d Pelosi told reporters. The gulf between the two sides, though, was large at the beginning of talks and it is unclear how much, if any, it has shrunk since talks began. The bill that passed the Democratic House in May would cost $3.4 trillion between 2020 and 2030, while the passel of bills introduced by Senate Republicans but yet to be voted on has been estimated to have a $1.1 trillion 10-year cost by the bipartisan Committee for a Responsible Federal Budget. Aside from cost, the two sides have also been at odds on some major issues, like how to revive a now-lapsed federal add-on to state jobless benefits that had totaled $600 weekly, as well as how much legal protection to give businesses, schools and religious institutions from coronavirus-related lawsuits. But other issues appeared easier to bridge. The sides are not far apart on extending the Paycheck Protection Program again, according to Sen. Marco Rubio, a Florida Republican. And both Democrats and Republicans want to send out another round of $1,200 payments to support households. â\u0080\u009cIts hard. And in some cases weâ\u0080\u0099re inching along. In others weâ\u0080\u0099re making more progress, but it takes time and weâ\u0080\u0099ll take more time tomorrow,â\u0080\u009d Pelosi said."}]}