{"article": [{"url": "https://www.marketwatch.com/story/i-want-to-close-my-roth-ira-when-can-i-do-that-2020-10-01", "published": 1601721380.0, "headline": "I want to close my Roth IRA â\u0080\u0094 when can I do that?", "body": "Q: I opened and funded a Roth IRA in 2017, at 62 years old. When can I withdraw and closeout this Roth? Initially, I invested $100,000. Will there be any fees or penalties upon withdrawal at five years or after? A.:The taxes due on a Roth IRA distribution are determined by the source of the money in the Roth IRA, the age of the account owner, and two different five-year rules. Due to annual contribution limits, you couldnâ\u0080\u0099t just put $100,000 in a Roth. I hope the Roth was funded by a rollover from another Roth IRA, a Roth account in a retirement plan like a 401(k) or was the result of a conversion. If you simply wrote a check for 100,000 when you opened the Roth, you made an excess contribution. The maximum allowable contribution in 2017 was $6,500 for anyone over the age of 50, so your excess contribution would be $93,500. You should work with your adviser to unwind that as soon as possible. The penalty tax on the excess contribution is $5,610 (6% of the excess) for each and every year the excess remains until it is removed. Any earnings attributable to the excess contribution must also be removed and taxed. If the 100,000 came from a conversion, the first 100,000 you distribute is immediately available without tax because you would have paid tax when you converted. There is a five-year rule that applies to conversions but because you are over 59Â½, it does not apply. Once you have distributed $100,000 and any other contributions or conversions made in any Roth IRA in your name, the next dollars paid out are deemed earnings and maybe taxable under a different five-year rule. If the $100,000 was a rollover from another Roth IRA account, the new Roth IRA retains the characteristics of the old account. If it has been more than five years since you opened you very first Roth IRA, there will be no taxes on any distribution because you are over 59Â½. If your first Roth IRA was opened less than five years ago, you can first distribute everything but earnings tax free but distributions of earnings would be taxable if distributed before January 1 of the fifth year after you opened that first Roth IRA. If the $100,000 was a rollover from another Roth account in a retirement plan like a 401(k), you can get your contributions to the Roth 401(k) or any conversions made while a participant in the original Roth 401(k) account tax free immediately. The plan sponsor should have a record of the contributions and in-plan conversions. Once the Roth 401(k) money has moved to the Roth IRA, earnings on those contributions will be only be tax free if you opened your first Roth IRA more than five years ago. Otherwise, since this would be your first Roth IRA account, the earnings will be not be available tax free until Jan. 1, 2022. The taxes on earnings in a Roth IRA less than five years old apply regardless of your age or how long you participated in the Roth account in the 401(k). This can trip up some retirees that rollover Roth 401(k) accounts to their first Roth IRA or convert funds into their first Roth IRA. To avoid the issues with the five-year rule for earnings, it is often a good idea to open and fund a Roth IRA before you reach retirement age just to start the five-year clock. The five-year rule for conversions only applies to conversions made before age 59Â½ and each pre-59Â½ conversion has its own five-year clock to consider. However, you only need to satisfy the five-year rule on earnings once during your lifetime. If you have a question for Dan, please email him with â\u0080\u0098MarketWatch Q&Aâ\u0080\u0099 on the subject line. Dan Moisand is a financial planner with Moisand Fitzgerald Tamayo. His comments are for informational purposes only and are not a substitute for personalized advice. Consult your adviser about what is best for you. Some questions are edited for brevity."}]}