{"article": [{"url": "https://www.marketwatch.com/story/is-cell-based-meat-the-next-big-thing-here-are-5-companies-leading-the-revolution-2020-10-06", "published": 1602142280.0, "headline": "Is cell-based meat the next big thing? Here are 5 companies leading the revolution", "body": "From lab to plate? Cell-based meat might not get the taste buds salivating, but it has certainly whet the appetite of investors. The race to move meat grown in laboratories onto supermarket shelves and onto dinner plates is heating up, as companies work in labs to cultivate cell-based meat and seafood — also known as “clean” or “cultured.” Unlike plant-based meats, which have grown in popularity in the U.S. and around the world, cultured meat is a lab-grown meat alternative produced from animal cells. However, cultured meat faces serious challenges with cost reduction, scale-up and regulatory approval, and no lab-grown meat product has yet reached the market, according to a new report by market research company IDTechEx. Even if it does overcome these obstacles, getting consumers to bite is another hurdle. A recent study from the University of Sydney and Curtin University found that 72% of Generation Z — defined by the study as individuals born between 1995 and 2002 — wouldn’t be keen on eating lab-grown meat, despite the fact that it eliminates the need to slaughter animals. Meanwhile, plant-based meat products are growing in popularity. Sales of alternative products have skyrocketed during the past few years and investments into the industry are surging. Just three months after going public last year, shares in Beyond Meat BYND, +0.80% had increased by 500%. Beyond Meat’s and rival Impossible Foods’ products are now available in fast-food restaurants across the U.S. In a recent KFC trial release in Atlanta, Ga., Beyond Meat’s fried chicken analogues sold out in less than 5 hours. Read:Nestlé loses ‘Incredible’ battle with Impossible Foods over burger name Here are five companies identified by IDTechEX to be leading the cultured meat revolution. Mosa Meat Mosa Meat was founded in 2013 by Dr. Mark Post of Maastricht University, who that same year cooked and tasted the world’s first cell-cultured hamburger in London. The first hamburger, which was produced from bovine muscle cells grown in the lab and was funded by Google GOOG, +1.97% co-founder Sergey Brin, cost €250,000 to make. Mosa Meat now projects that it can grow a “beef” patty for around €9 ($10.62). In September, the startup announced the first closing of $55 million as part of a larger Series B funding round, led by Luxembourg-based food technology fund Blue Horizon Ventures. It joins existing investors Switzerland’s Bell Food Group, and M Ventures, the venture capital arm of German drugmaker Merck KGaA MKKGY, +0.75%. The company is focused on scaling up the production process, and getting its first products on the market in the next three to four years. Memphis Meats This Berkeley, Calif.-based startup was founded by cardiologist Dr. Uma Valeti and cell biologist Dr. Nicholas Genovese in 2015. Like Mosa Meat, Memphis Meats uses myosatellite cells to grow meat products, and has produced cultured chicken nuggets and beef meatballs, as well as duck tissue. In January, Memphis Meat raised $161 million in a Series B fundraising in the largest funding round ever completed by a cultured meat company, attracting high-profile investors including Bill Gates and Richard Branson. It also counts meat industry giants Cargill and Tyson Foods TSN, -1.71% among its backers. Memphis meat will use the funds to set up a pilot production facility. However, Chief Executive Valeti has cautioned the industry around releasing a product too soon, stressing the need to make it right, or risk tarnishing the image of the industry for years. Aleph Farms Israeli-start up Aleph Farms creates cultured steaks using proprietary 3-D technology. The process involves using a specially designed scaffold to coculture muscle, fat, and connective tissue, alongside vasculature to produce a fully formed steak within three to four weeks. Aleph Farms claims its technologies allow several types of cells to grow together into a complex shape — which has historically been a major hurdle to developing structured meat products. Read:Cargill invests in company that grows meat using 3-D engineering It is aiming to reach the market with a limited launch within three to four years. Steaks will be grown in “bio-farms,” large facilities with tanks similar to those seen in dairy factories or breweries. BlueNalu Based in San Diego, Calif., BlueNalu is developing seafood products directly from fish cells using cellular aquaculture, whereby living cells are isolated from fish tissue, placed into culture media for proliferation, and then assembled into fresh and frozen seafood products. The company plans to produce a broad array of marine species, but is initially focusing on finfish including mahi-mahi, red snapper, tuna, and yellowtail. It recently demonstrated that its yellowtail product had the same culinary characteristics as conventional yellowtail, with the ability to be prepared in the raw or cooked form, including seared, grilled, and fried. In February, BlueNalu closed a $20 million Series A fundraising, which included KBW Ventures, led by Saudi entrepreneur Prince Khaled bin Alwaleed bin Talal. Strategic investors included Dutch animal nutrition company Nutreco and food industry product development company Griffith Foods. The company said in June that it is developing a new facility in San Diego that is more than 38,000 sq. feet and intends to launch its products during the second half of 2021. Finless Foods California startup Finless Foods is currently attempting to develop cultured bluefin tuna. Bluefin tuna is an expensive and endangered animal that cannot be farmed using aquaculture — creating a pressing need to develop an alternative. Rather than simply replicating meat, and delivering an inferior copy, Finless Foods wants to deliver new experiences for consumers, such as culturing cells from species that Western consumers have never had before."}]}