{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-jump-on-expectations-for-drawdown-in-us-crude-supplies-as-investors-keep-eye-on-opec-2020-07-15", "published": 1594825700.0, "headline": "Oil prices at 4-month high as U.S. crude supply posts biggest decline of the year and OPEC+ tapers output cuts", "body": "Oil futures climbed on Wednesday to mark their highest settlement in more than four months, buoyed by the biggest weekly decline in U.S. crude supplies so far this year, even as an OPEC+ committee reached an agreement to taper record production cuts starting next month. “Any move OPEC+ made to ease the production cuts would be of some concern, but...improving market conditions, plus the pledge that some members would compensate for earlier overproduction, [have] helped to ease market fears,” Michael Lynch, president of Strategic Energy & Economic Research, told MarketWatch. At the Joint Ministerial Monitoring Committee meeting Wednesday, the Organization of the Petroleum Exporting Countries and allied producers, collectively known as OPEC+, said they will ease record production cuts of 9.7 million barrels per day to 7.7 million barrels per day starting in August through the end of the year amid signs of improvement in the oil market. Participants in the deal who were unable to fully comply with the reductions in May and June, which include Iraq, will compensate for the added output. Including that compensation, Saudi Energy Minister Prince Abdulaziz bin Salman said actual cuts will be at roughly 8.1 million to as much as 8.34 million barrels per day. An OPEC+ document seen by S&P Global Platts, however, showed that 13 countries pumped above their quotas in the first two months of the deal by a combined 840,000 barrels per day. Read:OPEC+ move to taper output cuts may ‘keep a floor’ under prices Although “laggards are set to deepen cuts” August and September to make up for “falling short their past target, we find unlikely that they will be able to achieve 100% of compliance,” said Paola Rodriguez-Masiu, senior oil markets analyst at Rystad Energy, in a market update. “In the case of Iraq, we believe that the target set to compensate the alliance is overambitious given Iraq’s dire economic need for oil revenues right now.” West Texas Intermediate crude for August delivery CL.1, -1.62% on the New York Mercantile Exchange rose 91 cents, or 2.3%, to settle at $41.20 a barrel. September Brent crude BRN.1, -0.07%, the global benchmark, ended 89 cents, or 2.2%, higher at $43.79 a barrel on ICE Futures Europe. Both WTI and Brent crude marked the highest front-month contract settlements since March 6, according to Dow Jones Market Data. In the U.S. Wednesday, the Energy Information Administration reported that domestic crude inventories fell by 7.5 million barrels for the week ended July 10. That compared with a forecast by analysts polled by S&P Global Platts for an average decline of 2.1 million barrels. The American Petroleum Institute on Tuesday reported a drop of 8.3 million barrels. “A huge drop in imports has yielded the biggest draw to oil inventories since the last week of last year,” said Matt Smith, director of commodity research at ClipperData. “Imports into the U.S. Gulf dropped by more than half versus the week prior, as the flotilla of Saudi crude has finally been discharged,” he told MarketWatch. “According to our records, Saudi crude imports into the U.S. Gulf dropped to a 9-week low last week, a near 80% drop on the week prior. Accordingly, US Gulf Coast crude stocks drew by 7.9 million barrels.” Although the decline in crude inventories implies a rise in consumption, Lukman Otunugua, senior research analyst at FXTM, warned “rising coronavirus cases in the United States, along with some cities in major economies reimposing shutdowns, may hit demand.” The EIA data also showed crude stocks at the Cushing, Okla., storage hub edged up by about 900,000 barrels for the week. Gasoline supply declined by 3.1 million barrels, while distillate stockpiles fell by 453,000 barrels. The S&P Global Platts survey had shown expectations for a supply decline of 2 million barrels for gasoline and an inventory climb of 1.1 million barrels for distillates. On Nymex Wednesday, August gasoline US:RBQ20 tacked on 1.4% to $1.2645 a gallon, while August heating oil US:HOQ20 added 2% to $1.2448 a gallon. August natural gas US:NGQ20 settled at $1.778 per million British thermal units, up 1.8%, ahead of the EIA’s weekly update on supplies of the fuel, due out Thursday."}]}