{"article": [{"url": "https://www.marketwatch.com/story/the-economy-still-has-a-mountain-to-climb-but-its-digging-itself-out-faster-than-expected-2020-09-05", "published": 1599329060.0, "headline": "The economy still has a mountain to climb, but itâ\u0080\u0099s digging itself out faster than expected", "body": "Is the economy half-full or half-empty? Thatâ\u0080\u0099s the burning question after a surprisingly upbeat U.S. jobs report for August. Read: U.S. regains 1.4 million jobs in August and unemployment drops to 8.4% The expiration of federal aid for the unemployed at the end of the July and the still-spreading coronvirus were supposed to put a big dent in the economy last month. But so far the evidence is thin. To be sure, the pace of the recovery has decelerated. The U.S. is regaining jobs at a slower pace several months after the economy reopened, consumer spending has softened and businesses are still hesitant to invest. Read: Economy softened in August, Fed says, as some temporary layoffs turn permanent Yet the economy is still expanding and looks likely to continue to do so. More people are going out to eat, states such as New York are easing coronavirus restrictions, schools around the country are trying to start back up and businesses are getting creative in making their premises safer for customers and employees alike. â\u0080\u009cThe big picture is that even in the face of a summer flare-up in virus cases, the U.S. economy managed to soldier on reasonably well,â\u0080\u0099 said Douglas Porter, chief economist of BMO Capital Markets. Read: Initial jobless claims fall to new pandemic low of 881,000 â\u0080\u0094 but thereâ\u0080\u0099s a big catch Big hurdles still remain, of course. The coronavirus hasnâ\u0080\u0099t gone away and thereâ\u0080\u0099s still no cure, leaving many businesses in the lurch. Restaurants canâ\u0080\u0099t fully reopen, brick-and-mortar retailers are bereft of traffic, airports are mostly empty, hotel rooms are largely unoccupied and the major sports leagues are either playing in bubbles or sharply limiting attendance. Life is far from normal. â\u0080\u009cClearly some industries remain flat on their back, and a full labor market recovery for the U.S. economy is not yet in sight,â\u0080\u009d said chief economist Scott Anderson of Bank of the West. Where does the economy goes from here? Most Wall Street DJIA, +0.56% Â economists predict a slow and gradual recovery, punctuated by occasional setbacks. Many are still worried the end of federal aid will eventually take the air out of the recovery unless Democrats and Republicans break a deadlock in Washington and come to the rescue again. So far neither side has budged just a few months before what could turn out to be one of the most contentious presidential elections in American history in November. The surprisingly upbeat August employment report, ironically, could make a deal on more fiscal stimulus harder by undercutting the argument that more aid is needed. Republicans might decide the economy doesnâ\u0080\u0099t need any more help after several trillion dollars in government stimulus and the Federal Reserve cutting interest rates to a record low. Donâ\u0080\u0099t expect the case in favor of more aid to get much support anytime soon, either. The next few weeks are largely barren of major economic indicators that will reveal any big change in the economy."}]}