{"article": [{"url": "https://www.marketwatch.com/story/square-to-offer-early-access-to-earned-wages-for-employees-of-its-merchants-11600184721", "published": 1600170800.0, "headline": "Square to offer early access to earned wages for employees of its merchants", "body": "Square is rolling out an option that will let sellers shorten the time between when they send out money for payroll and when employees receive their wages. The company is also allowing workers to obtain on-demand access to up to $200 of earned wages each pay period. (Photo courtesy of Square) Square Inc. is bringing its merchant- and consumer-facing businesses closer together by letting employees of Square merchants obtain part of their paychecks more quickly via the Cash App. The company announced Tuesday that eligible employees of Square SQ, +2.06% sellers can opt to transfer $200 of earned wages to the Cash App for free each pay period, even if it isn’t yet payday. Shares of Square are up more than 8% in morning trading. The option is free to those who choose to receive these wages via the Cash App, and it will be available when workers clock out at the end of their shifts. Square will also give some employees the ability to move this on-demand pay over to a linked debit card for a 1% fee per transfer. Employees’ expenses often don’t line up with their paydays, according to Caroline Hollis, the general manager of Square Payroll, and workers in the food-service industry in particular may have extra interest in smoothing out the time between pay periods now that the pandemic has changed the ways people pay for things. “Cash tips have been an historically important form of income and something people receive every day, but with COVID, a lot of those cash tips dried up.” Among Square sellers, the share of contactless transactions declined to 33% by August from 37% in February. The portion of Square food and drink sellers that accepted at least 95% of payments via cashless methods increased to 13.2% in August from 4.8% in February. Early access to wages is a hot trend in financial technology, with services like Even and Chime already among those offering some workers early access to earned wages. TikTok saved my business: Candy retailer finds internet fame as COVID-19 forces a pivot Square is also adding an option to its payroll product that will let employers fund their payroll with money from their Square balances. Sellers can opt to keep some of the money they get from processing card payments within Square’s ecosystem and can use this balance to then pay employees, bypassing the need to rely on ACH bank rails for sending out employee wages. Hollis said that this option allows sellers to hold onto their money for longer because it can take up to four business days for funds to move between the business and its employees using the ACH rails. When Square pulls the funds from a seller’s Square balance, Hollis said it will be able to send the money “pretty much instantly” to a Cash App account and deliver the funds by the next business day to external bank accounts. The ideas of allowing employees to obtain access to their wages more quickly and letting businesses hold onto funds for longer “can seem at odds with each other,” Hollis said. She argued that Square’s ability to roll out products addressing both of these issues demonstrates the power of Square’s ecosystem and the fact that it touches both business and consumer services. Mobile wallets like Square’s Cash App and PayPal Holdings Inc.’s PYPL, +2.18% Venmo have seen exploding usage during the pandemic from consumers looking to digitally send money to friends and receive funds more quickly, including when the government was distributing stimulus payments. Some analysts have been upbeat about the potential for greater integration between Square’s Cash App and its merchant business. Square shares have rallied some 150% so far this year as the S&P 500 SPX, +0.87% has added about 6%."}]}