{"article": [{"url": "https://www.marketwatch.com/story/amid-bluster-trump-requests-mail-in-ballot-for-himself-in-florida-11597370560", "published": 1597356620.0, "headline": "Amid bluster, Trump requests mail-in ballot for himself in Florida", "body": "President Donald Trump speaks at a White House briefing in July . Getty Images PALM BEACH, Fla. — President Donald Trump has requested a mail-in ballot for Florida’s Tuesday primary election, despite weeks of criticizing the practice. Ballots were mailed on Wednesday to both the president and First lady Melania Trump at the Mar-a-Lago resort, which Trump lists as his legal address, according to online Palm Beach County elections records. Both previously voted by mail for the presidential preference primary in March, according to records. Following multiple claims that mail-in voting was unsafe and vulnerable to fraud, Trump changed his mind about the practice last week, at least in Florida. “Whether you call it Vote by Mail or Absentee Voting, in Florida the election system is Safe and Secure, Tried and True,” Trump tweeted last Tuesday. “Florida’s Voting system has been cleaned up (we defeated Democrats attempts at change), so in Florida I encourage all to request a Ballot & Vote by Mail!” Meanwhile, Trump’s campaign and the GOP are suing Nevada over its new vote-by-mail law. Nevada officials joined several states that plan on automatically sending voters mail ballots. Two states, California and Vermont, moved earlier this summer to adopt automatic mail ballot policies. Five other states have relied on mail-in ballots since even before the coronavirus pandemic raised concerns about voting in person, but there is no evidence to support Trump’s assertion that voting by mail leads to widespread fraud. Florida voters must request a mail-in ballot in order to receive one. Statewide in-person early voting began Saturday in Florida while the state continues to grapple with a high number of coronavirus cases, highlighted by more than 8,800 fatalities and at least 550,000 known virus cases since the pandemic began. Voters are mainly choosing party nominees for Congress and the state Legislature. While both parties have pushed voters to cast ballots by mail in recent elections, this year there’s been a stronger push during the pandemic. More than 4.2 million Florida voters have requested a vote-by-mail ballot, and nearly 1.5 million had been returned by Saturday morning, according to a Department of State website. That compares to nearly 1.3 million cast in the entire 2016 primary election."}]}