{"article": [{"url": "https://www.marketwatch.com/story/heres-everything-coming-to-netflix-in-july-2020-and-whats-leaving-2020-06-24", "published": 1593873740.0, "headline": "Here's everything coming to Netflix in July 2020 - and what's leaving", "body": "Netflix Inc. is opening the content floodgates in July, with a little something for everyone, from teen romance to action-packed adventure. Highlights include a new series adapted from the popular teen book franchise, \"The Baby-Sitters Club\" (July 3), starring Sophie Grace, with Alicia Silverstone as her mom; a reboot of the '80s hit docuseries \"Unsolved Mysteries\" (July 1); new seasons of the Finnish crime drama \"Deadwind\" (July 1) and the superhero series \"The Umbrella Academy\" (July 31); and \"Cursed\" (July 17), a take on the Lady of the Lake from Arthurian legend, starring Katherine Langford (\"13 Reasons Why\") and based on the acclaimed graphic novel from Frank Miller and Tom Wheeler. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Netflix NFLX, +1.43%  also has a bunch of new movies, such as \"The Kissing Booth 2\" (July 24), the sequel to the 2018 hit teen rom-com; \"The Old Guard\" (July 10), starring Charlize Theron as an unkillable mercenary protecting the mortal world, based on the popular graphic novel; and \"Fatal Affair\" (July 15), a domestic thriller starring Nia Long and Omar Epps. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Read more: What's streaming in July on Amazon Prime | Hulu | HBO Max | Disney+ July will also be your last chance to watch some movie classics such as the \"Back to the Future\" trilogy, \"E.T.\" and \"Charlie and the Chocolate Factory.\"What's coming in July 2020 July 1 AnneFrank: Parallel Stories A Bridge Too Far A Thousand Words A Touch of Green: Season 1 A Walk to Remember Abby Hatcher: Season 1 Airplane! Ali Batman: Mask of the Phantasm Charlotte's Web Clash of the Titans (1981) Cleo & Cuquin: Season 2 Cloud Atlas David Foster: Off the Record Definitely, Maybe Delta Farce Donnie Brasco Double Jeopardy Fiddler on the Roof Frida I Now Pronounce You Chuck and Larry Killing Hasselhoff Kingdom: Season 1-3 Lemony Snicket's A Series of Unfortunate Events Mean Streets Million Dollar Baby Paranormal Activity Red Riding Hood (2011) Schindler's List Sleepless in Seattle Sleepy Hollow Spaceballs Splice Stand and Deliver Stardust Starsky & Hutch Sucker Punch Swordfish The Art of War The Devil's Advocate The F--k-It List The Firm The Karate Kid The Karate Kid Part II The Karate Kid Part III The Naked Gun: From the Files of Police Squad! The Town The Witches This Christmas Total Recall (1990) Trotro Winchester Chico Bon Bon: Monkey with a Tool Belt: Season 2 - Netflix Family Deadwind: Season 2 - Netflix Original div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Say I Do - Netflix Original Under the Riccione Sun - Netflix Film Unsolved Mysteries - Netflix Documentary div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } July 2 Warrior Nun - Netflix Original div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Thiago Ventura: Pokas - Netflix Comedy Special July 3 The Baby-Sitters Club: Season 1 - Netflix Original Cable Girls: Final Season Part 2 - Netflix Original Desperados - Netflix Film JU-ON: Origins - Netflix Original Southern Survival - Netflix Original July 5 ONLY July 6 A Kid From Coney Island July 7 Dr. Seuss' The Lorax July 8 The Long Dumb Road Mucho Mucho Amor: The Legend of Walter Mercado - Netflix Documentary Stateless: Season 1 - Netflix Original What Is Love? - Netflix Original Yu-Gi-Oh!: Season 1 July 9 Japan Sinks: 2020 - Netflix Anime The Protector: Season 4 - Netflix Original July 10 The Claudia Kishi Club - Netflix Documentary Down to Earth with Zac Efron - Netflix Original The Epic Tales of Captain Underpants in Space - Netflix Family Dating Around: Brazil - Netflix Original The Old Guard - Netflix Film The Twelve - Netflix Original July 14 The Business of Drugs - Netflix Documentary On est ensemble (We Are One) - Netflix Documentary Urzila Carlson: Overqualified Loser - Netflix Comedy Special July 15 Dark Desire - Netflix Original Gli Infedeli (The Players) - Netflix Film Skin Decisions: Before and After - Netflix Original Sunny Bunnies: Season 1-2 July 16 Fatal Affair - Netflix Film Indian Matchmaking - Netflix Original MILF - Netflix Film Pride and Prejudice (2005) July 17 Boca a Boca (Kissing Game) - Netflix Original Cursed - Netflix Original div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Funan July 18 Gigantosaurus: Season 1 The Notebook July 19 The Last Dance July 20 Ashley Garcia: Genius in Love - Netflix Family How to Sell Drugs Online (Fast): Season 2 - Netflix Original Ip Man 4: The Finale Jack Whitehall: I'm Only Joking - Netflix Comedy Special Street Food: Latin America - Netflix Documentary July 22 61 Fear City: New York vs The Mafia - Netflix Documentary Love on the Spectrum - Netflix Documentary Norsemen: Season 3 - Netflix Original The Remix: Hip Hop X Fashion Signs - Netflix Original Spotlight July 23 The Larva Island Movie - Netflix Family July 24 A Cantar (Sing On! Spain) - Netflix Original Animal Crackers - Netflix Film Dragons: Rescue Riders: Secrets of the Songwing - Netflix Family In the Dark: Season 2 The Kissing Booth 2 - Netflix Film div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Ofrenda a la tormenta - Netflix Film July 26 Banana Split Shameless: Season 10 July 28 Jeopardy!: Collection 6 Last Chance U: Laney - Netflix Documentary iframe.twitter-tweet { width: 100% !important; } July 29 The Hater - Netflix Film Inside the World's Toughest Prisons: Season 4 - Netflix Original July 30 Pirates Who Don't Do Anything: A VeggieTales Movie Transformers: War for Cybertron Trilogy - Netflix Anime July 31 Get Even - Netflix Original Latte and the Magic Waterstone - Netflix Family Seriously Single - Netflix Film The Speed Cubers - Netflix Documentary Sugar Rush: Extra Sweet - Netflix Original The Umbrella Academy: Season 2 - Netflix Original Vis a Vis: El Oasis (Locked Up) - Netflix OriginalWhat's leaving in July July 4 Blue Valentine July 5 The Fosters: Season 1-5 The Iron Lady July 8 Solo: A Star Wars Story July 9 47 Meters Down July 11 A Glimpse Inside the Mind of Charles Swan III The Adderall Diaries Enemy Ginger & Rosa Locke The Spectacular Now Under the Skin July 12 Kevin Hart: Let Me Explain July 15 Forks Over Knives July 18 A Most Violent Year Laggies Life After Beth Obvious Child Room Tusk July 21 Bolt Inglourious Basterds July 25 Dark Places Ex Machina Mississippi Grind July 26 Country Strong July 28 Ant-Man and the Wasp Her July 29 The Incredibles 2 July 31 Back to the Future Back to the Future Part II Back to the Future Part III Can't Hardly Wait Casper Charlie and the Chocolate Factory Chernobyl Diaries E.T. the Extra-Terrestrial Freedom Writers Godzilla Guess Who Hancock Hitch Jarhead Jarhead 2: Field of Fire Jarhead 3: The Siege Open Season QB1: Beyond the Lights: Season 1 Resident Evil: Extinction Romeo Must Die Salt Scary Movie 2 Searching for Sugar Man Sex and the City 2 Stuart Little The Edge of Seventeen The Interview The Pianist The Pursuit of Happyness Twister Willy Wonka & the Chocolate Factory"}]}