{"article": [{"url": "https://www.marketwatch.com/story/teslas-q2-covid-impacted-sales-will-be-a-catalyst-for-the-stock-next-week-2020-06-26", "published": 1593522020.0, "headline": "Tesla's Q2 sales, impacted by COVID, is catalyst for the stock this week", "body": "Tesla Inc. is slated to report its April-June sales in the coming days, with Wall Street hoping to take a measure of just how much the closure of the Silicon Valley car-maker's sole U.S. car-making factory has affected 2020 sales goals. Tesla TSLA, +1.89%  reports quarterly deliveries, which are its proxy for sales, and production numbers within a few days of the end of a quarter. The Tesla factory in Fremont, Calif., was closed roughly half the quarter under regional shutdown orders designed to slow the spread of the coronavirus. Analysts polled by FactSet consensus expect deliveries of 72,000 vehicles, of which 61,000 would be Model 3 mass-market sedans and the remainder roughly split between sales of the Model S luxury sedan and the Model X SUV. Those are heightened expectations from last week's. Tesla shares surged more than 7% on Tuesday and are poised for another all-time closing record. Don't miss:Elon Musk vs. Bay Area officials: These emails show what happened behind the scenes in the Tesla factory fight Investors are hoping that Tesla's Shanghai factory, which came on line earlier this year, picked up some of the slack. Tesla's inventory from the first quarter also could help with sales in the April-June period. Wall Street also would welcome sales numbers for the Model Y, the compact SUV that is Tesla's newest vehicle in the lineup. Tesla has not exactly backed off its goal to sell more than 500,000 vehicles this year, but it has changed its tune somewhat, telling investors in late April it had the \"capacity installed\" to deliver more than half a million vehicles in 2020 \"despite announced production interruptions.\" The electric-car maker said in early April it delivered 88,400 vehicles in the first quarter, a performance the company called its \"best ever\" first quarter and a number only a tad below Wall Street expectations. Analysts at Evercore ISI pegged their second-quarter sales expectations at between 80,000 and 84,000 units, with sales in China offsetting a predicted sales decline in North America and a \"steep decline\" in sales in Europe. Tesla had between 14,000 and 20,000 vehicles in inventory from the first quarter, the Evercore ISI analysts said. Read:Michigan-assembled Ford Ranger named 'most American-made car' in annual list that includes Tesla for first time Analysts at Deutsche Bank expect deliveries of 76,000 units, of which 60,000 would be Model 3 sedans. \"We estimate Tesla was able to produce 34,000 Model 3 units out of the Shanghai (factory) and about 21,000 in Fremont,\" they said. \"But we do not believe Tesla was able to reach full Model Y production levels.\" They estimated Model Y production between 10,000 and 13,000 units in the second quarter, or roughly 300 a day. Tesla reopened the Fremont factory amid a standoff with local health authorities that included Chief Executive Elon Musk calling the shutdown \"fascist\" and suing the county where the factory is located. The lawsuit was eventually dropped. Shares of Tesla have gained 131% this year, and recently cracked $1,000. The gains contrast with losses of 6% and 12% for the S&P 500 index SPX, +0.87%  and the Dow Jones Industrial Average DJIA, +0.56%  , respectively."}]}