{"article": [{"url": "https://www.marketwatch.com/story/holiday-sales-forecast-to-grow-1-to-2-6-during-new-october-to-december-shopping-season-alixpartners-11600697796", "published": 1600683860.0, "headline": "Holiday sales forecast to grow 1% to 2.6% during new October-to-December shopping season: AlixPartners", "body": "Holiday shoppers will head online and to stores earlier due to coronavirus pandemic, experts say Getty Images AlixPartners forecasts a 1%-to-2.6% rise in holiday season retail sales spanning the period between October and December, with consultants proposing that the shopping season will permanently begin a month earlier going forward. Last year, sales totaled $1.132 trillion for the same three-month period. Deloitte LLP forecasts a 1% to 1.5% rise for the period between November 2020 and January 2021. “The traditional November-December holiday-season definition is meaningless this year—and, I would argue, for the future as well. For years now, holiday sales have been pulled forward earlier and earlier, thanks mostly to the explosion in online shopping,” said Joel Bines, global co-leader of the retail practice at AlixPartners. “The pandemic has accelerated what was well on its way to happening anyway.” Berkeley Research Group forecasts that October 10, or 10/10/2020, will be the official start of the holiday shopping season this year, thanks to the marketing possibilities as well as the possibility that Amazon.com Inc. AMZN, +3.01% will host its delayed Prime Day sales event on that day. See: The holiday shopping season could start on 10/10/2020 with retailers hopeful that consumers will turn out early Coresight Research along with Shopkick and Fashwire have announced the launch of the 10.10 Shopping Festival this year that will span October 9 through October 11. The event will take place online as well as in stores. Shopkick offers rewards for both online and offline shopping, and Fashwire is an online marketplace. AlixPartners data shows that 49% consumers plan to start their holiday shopping this year by Halloween or earlier. The AlixPartners poll also found that 45% of shoppers will make the majority of their purchases online this year, and 23% expect to spend less this year versus last year. “In addition to online sales likely breaking records this holiday season, so too will curbside and in-store pickups,” said Sonia Lapinsky, a managing director in the retail practice at AlixPartners, in a statement. The SPDR S&P Retail ETF XRT, +0.05% is up 6.5% for 2020 so far. The Amplify Online Retail ETF IBUY, +1.39% has gained 65.5%. And the S&P 500 index SPX, +0.87% is up 1.1% for the period."}]}