{"article": [{"url": "https://www.marketwatch.com/story/health-care-will-cost-this-much-in-retirement-but-probably-even-more-2020-08-04", "published": 1596899480.0, "headline": "Health care will cost this much in retirement â\u0080\u0094 but probably even more", "body": "A 65-year-old couple retiring this year should expect to spend about $295,000 on health care costs alone in retirement â\u0080\u0094 but quite frankly, that estimate is conservative. The figure, calculated by Fidelity Investments as part of its annual Health Care Cost Estimate, includes Medicare Part A, Part B and Part D premiums and deductibles, but it does not include over-the-counter medications, vitamin supplements and glasses. Long-term care insurance is also not included, which on its own could be an additional thousands of dollars a month. (Fidelity also didnâ\u0080\u0099t take COVID-19 or related costs into account when modeling its health care cost estimates.) 80% of older Americans can't afford to retire - COVID-19 isn't helping Long-term care insurance covers the expenses the elderly may face when theyâ\u0080\u0099re no longer able to conduct certain regular activities (such as bathing or feeding) or when they need to live in a nursing home or assisted living facility. The expense was not included in Fidelityâ\u0080\u0099s calculation because of the sheer fluctuation in prices and variables necessary to determine the proper coverage plan, said Hope Manion, chief health and welfare actuary and senior vice president of Fidelity Workplace Consulting. â\u0080\u009cTo try to predict what long-term care expenses you may need is tricky and depends on the individual,â\u0080\u009d she said. See: Living in retirement during COVID-19? How to keep your cool Some people may want to enroll in long-term care insurance, especially if they have a family history of dementia or other debilitating illnesses. The cost for coverage rises the closer someone is to retirement age, which is why Manion said people in their 40s and early 50s may want to look into plans now. The average cost of living in a semiprivate room in a nursing home in the U.S. was $6,844 a month in 2016, or $7,698 a month for a private room, according to the U.S. Department of Health and Human Services. A one-bedroom unit in an assisted living facility was $3,628 a month. The cost for a health aide was $20.50 an hour. Read: Choosing an HSA can save you money now, and make you even more later Even without long-term care expenses, however, health-care costs are constantly increasing â\u0080\u0094 and future retirees will need to take that rise into account when saving and planning for their futures. The 2020 estimate of $295,000 is a 3.5% increase from last year alone, and an 18% increase from 2010. A single woman retiring at 65 in 2020 can expect to pay around $155,000 for health care during her retirement while a man at the same age may pay $140,000. This is separate from the money theyâ\u0080\u0099ll need to pay for housing, groceries, any travel or leisure or potential inheritances they leave their loved ones (if they can or decide to do so). Read: 5 things to know about health care in retirement â\u0080\u009cIf youâ\u0080\u0099re thinking about your portfolio and saving strategy, you want to make sure you can take $300,000 of that â\u0080\u0094 depending on who you are and if youâ\u0080\u0099re single, half that â\u0080\u0094 and then look at whether or not you can live on what you saved aside from that,â\u0080\u009d Manion said. Also see: This is how much you need for retirement â\u0080\u0094 and how COVID-19 will change that Along with savings strategies, Americans fortunate to have health benefits through an employer should review their offerings during open enrollment later this year. A fourth of companies said they changed employee health benefits during the COVID-19 pandemic, but 79% of employees said they donâ\u0080\u0099t intend to spend any extra time sorting through their options. â\u0080\u009cItâ\u0080\u0099s a great time for employees to be digging in,â\u0080\u009d Manion said. During open enrollment, employees can see if they have a Health Savings Account available to them, which offers triple-tax benefits but can be unaffordable to some participants because of its high deductibles. They should also review deductibles, out-of-pocket maximums and what might be the impact of a major life event that occurred in 2020, such as a new baby or marriage. There may also be benefits employees did not know existed or did not have much use for before, such as telemedicine, meditation services and wellness programs. With such a stressful and volatile year, some people and their workplaces are becoming more open to talking about mental health."}]}