{"article": [{"url": "https://www.marketwatch.com/story/cuomo-to-trump-put-a-mask-on-it-2020-06-29", "published": 1593455000.0, "headline": "Cuomo to Trump: â\u0080\u0098Put a mask on itâ\u0080\u0099", "body": "New York Gov. Andrew Cuomo told Donald Trump Monday to â\u0080\u009cput a mask on it,â\u0080\u009d as daily U.S. COVID-19 cases hit record highs in recent days.Â â\u0080\u009cLet the president lead by example,â\u0080\u009d Cuomo said at a briefing on Monday. â\u0080\u009cWe know it works. Weâ\u0080\u0099ve proven that it works in the state of New York,â\u0080\u009d He also called for Trump to issue an executive order that would require people to wear face coverings in public. Daily virus cases hit an all-time high in the U.S. on Friday, with more than 45,000 diagnoses.Â â\u0080\u009cIf weâ\u0080\u0099re going to turn this around in this nation, itâ\u0080\u0099s going to take the White House,â\u0080\u009d said Cuomo, who in recent briefings has become increasingly direct in his criticism of Trump and the way his administration has handled the crisis. â\u0080\u009cTo the president, I say today, if you want to help stop COVID-19, then they should start by telling the people of this country the truth.â\u0080\u009d Cuomoâ\u0080\u0099s comments came a day after the Centers for Disease Control and Prevention expanded its mask guidance to say Americans should wear them in all â\u0080\u009cpublic settings when around people outside of their household.â\u0080\u009d It had previously recommended wearing a mask when at places like grocery stores and pharmacies, when social distancing is difficult to maintain.Â Trumpâ\u0080\u0099s press secretary Kaleigh McEnany reiterated at her own briefing on Monday that itâ\u0080\u0099s the presidentâ\u0080\u0099s personal choice not to wear a mask.Â â\u0080\u009cHe encourages people to make whatever decision is best for their safety,â\u0080\u009d McEnany said, adding that Trump told her before the briefing that he â\u0080\u009chas no problem with masksâ\u0080\u009d and that people should â\u0080\u009cdo whatever your local jurisdiction requests of you.â\u0080\u009d The president may have to follow his own advice in August, when heâ\u0080\u0099s expected to attend the Republican National Convention in Jacksonville, Florida, where masks are now required as of Monday evening.Â Meanwhile, New York state continues to make progress on containing the virus. Deaths hit an all-time low of eight on Sunday on a three-day rolling average, down from a peak of 800 in early April. Saturday saw the lowest single-day death toll of only five. Total hospitalizations sank to 853, down from their peak of nearly 19,000 statewide. Of the 46,000 tests administered on Sunday, 0.8% came back positive, compared with 50% in April.Â Read: Even with reopening, New York still faces a future that looks very different Still, malls, gyms and indoor dining all present potential vulnerabilities for cases to escalate again, particularly in New York City, where some people have grown lax about social distancing, Cuomo said on Monday.Â â\u0080\u009cYou can see the crowds in front of bars. You can see the crowds on street corners. It is undeniable,â\u0080\u009d said Cuomo. Indoor dining was expected to begin as part of Phase 3 of reopening next Monday, but both Cuomo and Mayor Bill de Blasio, speaking at his own briefing on Monday, said the dining component might be postponed.Â Also see: Is it safe to go back to the gym if youâ\u0080\u0099re over 50? The state will make a decision on Wednesday, after convening with experts and industry stakeholders, Cuomo said. New Jersey Gov. Phil Murphy called off plans to reopen indoor-dining ahead of the July 4 weekend after images surfaced of packed, unmasked crowds at bars and restaurants.Other New York developments: Broadway shows will be suspended until 2021, trade organization The Broadway League announced on Monday. The decision deals a major blow to an industry that is a bedrock of New York City. Broadway shows grossed nearly $2 billion in the 2018-19 season.Â"}]}