{"article": [{"url": "https://www.marketwatch.com/story/hertzs-stock-gives-back-more-than-half-of-the-postbankruptcy-surge-after-nyse-delisting-notice-2020-06-10", "published": 1591805660.0, "headline": "Hertz's stock gives back more than half of the postbankruptcy surge after NYSE delisting notice", "body": "Shares of Hertz Global Holdings Inc. lost more than one-third of their value Wednesday, after the bankrupt car-rental company disclosed that it received a delisting notice from the New York Stock Exchange. The NYSE had determined that Hertz's shares are \"no longer suitable\" for listing on the exchange, after the company filed for bankruptcy after the May 22 closing bell. Hertz said in an 8-K filing with the Securities and Exchange Commission that it has appealed the delisting \"in a timely manner,\" and has requested a hearing with the NYSE. \"At this time, the common stock of the company will continue to be listed and trade on the NYSE pending resolution of such appeal,\" Hertz stated in the 8-K. \"There can be no assurance that the NYSE will grant the company's request for continued listing at the hearing and whether there will be equity value in the company's common stock.\" The stock HTZ, -1.78%  plummeted 39.7%, to pace all of the NYSE decliners, to close at $2.52. Trading volume reached 215.3 million shares, enough to make the stock the most actively traded on major U.S. exchanges, according to FactSet. The stock's selloff comes after it tumbled 24.4% on Tuesday, to snap a 3-day streak of gains in which the stock skyrocketed 574% to close at $5.53 on Monday. That closing price was 888% above the record low close of 56 cents on May 26 following the bankruptcy announcement. Don't miss: Hertz's stock doubles to erase all postbankruptcy losses. At current prices, the stock has retraced 60.6% of that postbankruptcy rally through Monday. What also might be contributing to investor unease on Wednesday, Hertz said in the 8-K that on June 5, Chief Marketing Officer Jodi Allen was \"terminated without cause.\" Allen had been in that position since October 2017. The company didn't provide any other reason for the termination. Hertz said on June 9, Laura Smith was named executive vice president global marketing and customer experience officer. In November, Allen had presented Smith, who was senior vice president, global customer experience, with the \"Rising Female Leader Award.\" The stock has plunged 69.9% over the past three months, while rival Avis Budget Group Inc. shares CAR, +1.28%  have soared 22.5% and the S&P 500 index SPX, +0.87%  has climbed 10.7%."}]}