{"article": [{"url": "https://www.marketwatch.com/story/virus-fears-weaken-europe-stocks-as-wirecard-shares-plunge-further-2020-06-22", "published": 1592803760.0, "headline": "European stocks wobble amid virus concerns and as Wirecard shares plunge", "body": "Stocks in Europe moved between gains and losses on Monday, on worries the spread of coronavirus will force countries to limit or reverse their lockdown-easing measures. Up 3.2% last week, the Stoxx Europe 600 SXXP, +0.55% traded 0.2% higher. The German DAX DAX, +0.06%, the French CAC 40 PX1, +0.71% and the U.K. FTSE 100 UKX, +0.64% also moved higher after opening losses. After the 208-point fall for the Dow industrials DJIA, +0.56% on Friday, U.S. stock futures YM00, +0.82% were stronger on Monday morning. U.S. stocks on Friday were impacted by Apple’s decision to close stores because of the virus spread. The news on the coronavirus front hasn’t gotten better since then. The World Health Organization reported its largest single-day surge in coronavirus cases yet, while the Robert Koch Institute said Germany’s reproduction rate surged to 2.03 after a big outbreak at a North Rhine-Westphalia abbatoir. iframe.twitter-tweet { width: 100% !important; } “Emotions are the name of the game, and those can swing wildly and quickly. In a few short weeks we’ve gone from caution, to panic, to skepticism, to greed, to euphoria, and now we seem to have come back to the caution stage,” said Marios Hadjikyriacos, investment analyst at XM, who said there wasn’t any positive news catalyst behind the slight advance in European equities. The main corporate news story continues to be Wirecard WDI, +0.14%, which plunged 35% after saying a missing €1.9 billion of cash probably doesn’t exist. Wirecard said it is having “constructive discussions” with its lenders about its credit lines, is considering cost cuts and the disposal of business units and product segments. Another mover was Deutsche Lufthansa LHA, -1.71%, down 6% as its top shareholder, Heinz Hermann Thiele, fights a bailout package. Without Thiele’s support, it is unlikely the rescue package will be approved by Lufthansa’s shareholders."}]}