{"article": [{"url": "https://www.marketwatch.com/story/france-launches-100-billion-stimulus-plan-to-avoid-economic-collapse-it-may-also-help-macron-get-re-elected-2020-09-03", "published": 1599213620.0, "headline": "France splashes out â\u0082¬100 billion propping up economy and jobs, totaling a massive 4% of its GDP", "body": "The French government on Thursday announced a new stimulus plan for a total of â\u0082¬100 billion ($120 billion) designed to take the economy out of the COVID-19 doldrums and limit the massive rise of unemployment, which officials admitted would top 10% of the population next year. - The measures amount to more than 4% of the country's gross domestic product, which will bring the total amount of fiscal stimulus this year to nearly 10% of GDP. About â\u0082¬40 billion of the plan's funding will come from the new European Union joint recovery fund, the government said. - The plan is based on tax cuts and incentives for businesses (â\u0082¬30 billion), a massive public investment in the green transition and areas such as transport, clean energies and construction (â\u0082¬35 billion), and \"social cohesion\" measures (â\u0082¬35 billion) such as support for part-time work programs, training for young workers and health care. The government shied away from significant measures to boost consumer spending, such as a cut in the value added tax, because of their cost, and a desire to focus on the supply side of the economy and job creation. It is designed to try to \"avoid an economic collapse,\" French Prime Minister Jean Castex said on Thursday. - The French stock market PX1, +0.71%  rose 2% in early trading Thursday after the plan was detailed, twice as fast as the average of European indexes measured by the Stoxx 600 SXXP, +0.55%. - According to the French government, the plan will help the economy make up for the coronavirus-related loss of GDP by the end of 2022, and help create 160,000 new jobs next year. According to the French central bank, the economy could shed up to 1 million jobs by the end of 2020. The French economy shrank 13.8% in the second quarter of the year, the steepest fall in Europe behind the U.K. and Spain. According to government estimates, the country's GDP will shrink by more than 10% this year. Opinion:France throws â\u0082¬15 billion at aerospace sector. It better be money well spent The outlook: With French public debt expected to reach 120% of GDP this year, French President Emmanuel Macron hopes that his plan, by boosting growth, will help stabilize the burden at that level until 2025. He also hopes it will stabilize his rating, and put him in a better position to run for a new term when the campaign for the April 2022 presidential election starts in earnest at the end of 2021. That can only happen if he manages to prove that his policies can create jobs. The substance of the plan is in line with Macron's bid to focus on structural reforms. But it may take more time to produce visible results than a classical demand boost would have taken. Read: German parliament launches inquiry into fraud scandal at Wirecard, with government in crosshairs"}]}