{"article": [{"url": "https://www.marketwatch.com/story/this-universitys-closely-watched-covid-19-protocol-brought-positivity-rates-down-after-a-spike-but-will-it-last-11601054113", "published": 1601544500.0, "headline": "How COVID-19 protocol at University of Illinois reduced infections after a recent spike", "body": "The University of Illinois developed an innovative COVID-19 protocol. Then it was put to the test. UI Public Affairs: Fred Zwicky In late summer, as evidence began trickling out about what an in-person semester at college might look like amid a pandemic — hundreds of positive cases of COVID-19, school officials threatening suspension for partying, and in some cases, sending an entire campus home — headlines (including in this outlet), wondered aloud whether one school had figured out how to bring students back safely. At the University of Illinois, students and faculty were required to take a rapid COVID-19 test developed by the school twice a week. To access any campus building, except the dorm in which they lived, students would need to show a negative test result delivered to an app, also developed by technologists at the school. The experts involved in designing the system said they’d know within a few weeks, or by around Sept. 25, whether they were successful at minimizing the spread of COVID on campus. Sept. 25 passed Friday and the seven-day positivity rate at the school currently stands at 0.35%. It’s still early, but that figure suggests the school is doing something right. Nationally, the COVID-19 positivity rate for the entire U.S. is about 4.8%, according to Johns Hopkins University. But the school didn’t get there exactly how officials had planned. The scientists anticipated an initial spike in positive cases after students returned to campus, said Rebecca Lee Smith, an associate professor of pathobiology at U of I who is part of the team that developed the school’s testing and other protocols. But the school’s seven-day positivity rate average, which peaked at 1.2% and is single day positivity rate, which peaked at 2.86% on Aug. 30, about a week after classes started, was much higher than they had forecast. Though the school’s scientists had built into their model the idea that students would not follow the school’s guidelines 100% of the time — they would probably socialize without masks or go to crowded bars — “we did not expect people to know that they were positive and still go to parties,” Smith said. “That didn’t seem to us like something that would happen.” But it did, according to university officials, causing an outbreak they might not have caught so quickly without the school’s robust testing. In response, officials blamed “the irresponsible actions of a small number of students” for the outbreak, tactics for which other schools had been criticized. Officials suspended a small number of students for violating COVID-related guidelines and threatened a return to remote instruction. First though, they implemented a two-week cool down period, asking students to limit their activity outside of their homes to attending class, grocery shopping, their twice weekly COVID-19 test and outdoor activity only with the people they live with. “It definitely had a good effect,” Smith said of the lock down. But it’s still too early to tell whether it pushed case numbers down for good, she said.‘I felt terrible for them’ During the lockdown period, which ended on Sept. 16, Hallie Workman, a PhD candidate in communications at the school, said she didn’t see an uptick in positive cases among the small sample of undergraduates enrolled in her public speaking course. But the share of her students exposed to COVID-19 did go up. Some of Workman’s students had to go into quarantine or isolation. “I felt terrible for them,” she said. Reports of inconsistent food deliveries to quarantine and isolation housing pushed her to offer grocery deliveries to her students. “I was checking in with them about every other day just making sure they were getting what they needed,” Workman said. During the period when case positivity rates were relatively high, Workman said she also changed or completely cut out activities where she would ask students to move around the classroom. “It made me think a lot about how my students are moving within the space of my classroom and being really cautious when that rate was high,” Workman said. She still feels safe teaching in person, Workman said, because her classroom is an environment she can control. “I’ve met with a lot of students who are saying this is my only in-person class and I need that in-person experience,” Workman said, which has kept her motivated to keep teaching in person. A lockdown filled with walks and improving productivity For Owen Stephenson, the university’s threat to send students home if case rates remained high was enough to convince him to follow the lockdown rules closely. As a freshman, he was eager to remain on campus in person. At first, he found the experience to be “monotonous” and “dreary.” With only one in-person class, he rarely left his dorm, except to pick up food. But then Stephenson said, he started to find ways to cope. He signed up for online courses on fashion and productivity, even buying a journal and planner to implement what he’d learned; he expanded his music tastes, working with his roommate on playlists; he took hour or more long walks, exploring campus and the surrounding areas. The fact that the positivity rate has gone down, “really reaffirmed my faith that we’ll have a safe semester,” he said. “It made those nights where we stayed in and ate dinner on TV trays rather than out on the quad a lot more meaningful because it resulted in something.” Still, the first few weeks on campus were “rockier” than he expected and the lockdown period posed challenges for making new friends — a daunting task for freshmen during any fall semester. “There’s definitely a concern of if I don’t make friends right now or if I don’t establish myself as a member of a community right way then I’m not going to be anywhere near social,” Stephenson said. “It was hard to remember that I have to wait,” to make more typical college memories, he said. Wistful for a typical college semester During the lockdown, Ian Katsnelson, a junior, avoided not only the activities he’d grown used to in his first two years of college, but also the ones he’d grown accustomed to during the first few weeks of school, like seeing friends other than his roommates from a social distance outside. “It was an interesting time on campus because you even had to be careful going outside with your roommates,” he said of the lockdown period. “For me having that higher amount of university scrutiny meant that potentially if it worked out I’d be able to stay for the entire semester safely.” Though Zackary Landers said he’s confident in the university’s approach to the pandemic, he’s wistful for a college experience not plagued by COVID-19. Landers, 25, attended the University of Illinois for a semester in 2013, then left to join the Navy for five and a half years. He decided to return in August 2019 and he and his fiancé bought a house near the school. “Once this all happened, it was just this slow walk towards, ‘This is going to be maybe more than an entire year of my Illinois experience,’” he said. So far, Landers said, he’s become friendly with some people through a student organization or classes. “I’ve been able to hit it off with one guy in my discussion session and we text, but he’s in the suburbs,” he said. “Usually we’d be hanging out and studying or playing frisbee in the quad, now it’s just texting.” Early hiccups in the testing regimen have dissipated Workman said her students appear to have adjusted to the pandemic college reality and some of the early hiccups of the testing regimen — like difficulty gaining building access — appear to have been resolved. “The students have realized that they need to be responsible,” Workman said. “I’m a little less happy with how the university has dealt,” with the situation, she said, citing concerns about the treatment of students in isolation and quarantine as well as building workers. High-risk students are now tested three times a week In the weeks since the initial spike, the team that came up with the university’s COVID-19 protocol has expanded to include a group that contacts students via text within 30 minutes of a positive test result to help them understand next steps, including that they’ll be contacted by the local public health authority, Smith said. In addition, they’ve hired student employees who arrange check-in calls and Zoom social activities for students in quarantine and isolation. Perhaps most critically, they’ve adjusted their testing. Students at high risk of exposure are being tested three times a week, while graduate students and faculty are only being tested once a week, Smith said. ‘We’ll continue to watch University of Illinois’ Still, University of Illinois’ experience highlights the challenges of reopening a college in person even with thorough planning. Recent research linked colleges that opened for in-person classes to 3,000 new cases of COVID-19 per day. “It’s very difficult to ask people to quarantine or isolate for 10 to 14 days and that’s certainly been the observation on college campuses,” said Joshua Salomon, the director of the Prevention Policy Modeling Lab at Stanford University. Models make the best assumptions that they can based on the information they have and good ones adjust to the information they observe, he said. He was pleased to see the University of Illinois respond to the data they observed. The spike at the school helped to “expose a weak link” in the school’s and other campuses’ reopening strategy, he said. “I would expect that models moving forward would be allowing for imperfect quarantine and isolation adherence,” he said. “We’ll continue to watch University of Illinois and see how the transmission trends unfold and see how the administration responds to that. There’s still no guarantee that the rest of the semester is going to conclude without big outbreaks or that they’re not going to have to shift their strategy again.”"}]}