{"article": [{"url": "https://www.marketwatch.com/story/this-years-stock-market-run-has-an-uncanny-resemblance-to-2009-analyst-says-with-big-upside-for-stocks-ahead-2020-06-16", "published": 1592657000.0, "headline": "This year's stock-market run looks a lot like 2009, analyst says, with big upside for stocks ahead", "body": "If the topsy-turvy financial markets of 2020 have you scratching your head, you're not alone. But you may be overthinking it, according to one longtime market watcher. \"2020 is just like 2009,\" wrote Nicholas Colas, co-founder of DataTrek Research, in a note out Tuesday. Colas has been tracking the 2009-2020 analogy ever since the March mayhem, and the similarities have been uncanny. If the comparison holds, he writes, we should expect a period of stagnation, and then a late-year rally. But first, here's a recap of where we've been since March. As of 58 days after the low of March 23, 2020, the S&P 500 SPX, +0.87%  is 37.1% higher. In 2009, the low came on March 9, and 58 days later, the index was 39.4% higher. Oddly, Colas notes, in 2020, stocks have twice tried to break away to the upside from the 2009 experience, but failed both times. The first was on April 14, when the 2020 rally got ahead of 2009 by 11 points (+27.2% from the lows vs. 16.4% in 2009). Stocks then gave up all those gains in the next 5 days. \"The second was just last Monday, when the index was 13 points ahead of the 2009 rally, and you know what happened next: Thursday's 6% drop and other declines have closed the gap again,\" Colas writes. The parallels between the two periods are all the more striking because of how different the stock market has become, he noted. Among other things, valuations are higher: the S&P 500 currently trades 19.6x recent peak earnings of $155 a share, compared with 10.4x peak earnings, in 2009. That's in part because technology makes up a much greater share of the index now: 32%, compared with 18.4% in 2009. Energy also represents a much smaller share of the overall market: 3% versus 12.4% a decade ago. (Here's an earlier piece about DataTrek research on what the prevalence of tech means for valuations.) And while financials rocketed higher in 2009 - \"2009's rally was primarily a sigh of relief regarding the survival of the US financial system,\" Colas says - the 2020 rebound, like the fears that brought the stock market to its knees in March, have been much broader-based. See: Coronavirus was the perfect storm for tech innovation, and this fund manager made out What next? It's possible, as Colas puts it, to imagine 2020 as a \"turbocharged\" version of 2009, since both fiscal and monetary stimulus have been far more robust. But it's equally possible that the problems are much more severe. \"The COVID Crisis is much more far reaching than the Financial Crisis,\" he writes. \"In 2009 we wondered if bank ATMs would have cash. Now we wonder if touching an ATM is safe.\" Ultimately, though, Colas thinks investors may be overthinking things. This time may in fact not be all that different, especially since the 2009 roadmap has worked so well so far. If so, Colas writes, \"the S&P 500 is set for a breather.\" From Day 58 of 2009's rally, the index \"didn't go anywhere for 34 trading days (seven weeks.)\" The rest of 2009 made up for it, however, \"with a 17% rally from late July through year end. If history repeats itself that would put the S&P at 3,588 on December 31st, for an 11.1% price gain on the year.\" And the dominance of technology in 2020 helps offset some of the bigger unknowns, he argues. Read next:Expect 'violently flat' markets, but be ready to buy the dip, analyst says"}]}