{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-attempt-a-recovery-after-wall-street-led-selloff-2020-09-04", "published": 1599215240.0, "headline": "Merger talk drives up Spanish banks - a bright spot on a tough day for European equities", "body": "Merger talk for two Spanish banks drove up Europe's financial sector on Friday, proving a bright spot in a tough session as investors remained stymied on the heels of a selloff driven by losses for high-flying technology stocks. A day after tumbling 1.4% in a late-day slide, the Stoxx Europe 600 index SXXP, +0.55%  was flat at 366.37, vacillating between gains and losses, and headed for a loss of just over 0.5%. The French CAC 40 PX1, +0.71%  rose 0.4% and the FTSE 100 PX1, +0.71%  gained 0.4%, but the German DAX DAX, +0.06%  eased 0.1%. An outperformer among regional indexes, Spain's IBEX 30 IBEX, -0.59%  climbed 0.7%, as shares of CaixaBank CABK, -2.15%  surged 11% and Bankia BKIA, -2.99%  jumped 23% after the Spanish banks said late on Thursday that they are in talks over a possible merger, potentially the biggest tie-up in the country's banking sector in years. That filtered through to gains for the rest of the sector, with shares of Sabadell SAB, -3.18%  rising 11% and Bankinter BKT, -3.43%  up 5%. Banco Santander SAN, -1.48%  SAN, -1.28%  rose 3% and Banco Bilbao Vizcaya Argentaria BBVA, -1.40%  BBVA, -1.84%  rose over 4% each. \"While Spanish banking consolidation has seen a number of false starts, we believe consolidation is fast becoming much more of an imperative given [1] COVID fallout; [2] low rates; and [3] relaxation of merger requirements by the ECB/SSM (European Central Bank/Single Supervisory Mechanism),\" said Citi analysts Stefan Nedialkov and Anand Demble, in a note to clients. Citi has a buy rating on Bankia and neutral on CaixaBank. Investors remained focused on U.S. markets after the Dow industrials DJIA, +0.56% tumbled by more than 800 points on Thursday, driven by a tech-led selloff that wiped 5% off the Nasdaq Composite COMP, +1.39%. Along with the S&P 500 SPX, +0.87%, all three indexes marked the worst one-day drop since June 11. Stocks remained in the red for Friday. August U.S. payrolls gains data came in with a better-than-expected gain of 1.4 million, versus the 1.2 million gain expected. The unemployment rate fell to 8.4% from 10.2%, the government said on Friday. In Europe, data showed German manufacturing orders losing steam in July, though they rose for the third-straight month. One notable element of Thursday's trade was that this year's standout advancers were among the worst performers. Some of that selling continued on Friday, with communications company Sinch SINCH, +3.90%  dropping 3% after falling nearly 10% on Thursday. Elsewhere, shares of Ryanair Holdings RYA, -2.60%  rose 2.5%. The cut-rate airline said it raised â\u0082¬400 million ($474.1 million) via a slightly discounted share placing late on Thursday. The airline is seeking to preserve cash and boost its financial position in an industry heavily damaged by the global pandemic. Shares of rival easyJet EZJ, -4.22%  climbed 2.3%. Virgin Atlantic announced on Friday that it had completed a a £1.2 billion ($1.6 billion) rescue plan, but would still need to cut 1,150 jobs. The airline is controlled by holding company Virgin Atlantic Limited, which is 51% owned by the Virgin Group and 49% by Delta Air Lines DAL, +0.39%. Shares of Just Eat Takeaway.com TKWY, +1.00%  slipped 0.8%. Rival GrubHub GRUB, +0.83%  said on Friday the acquisition by the Netherlands-based food delivery service is proceeding as expected, but disclosed an amendment to the merger agreement in which the \"end date\" is extended to Dec. 31, 2021 from June 10, 2021."}]}