{"article": [{"url": "https://www.marketwatch.com/story/my-daughter-wont-speak-to-me-her-therapist-said-were-a-toxic-family-should-i-stop-paying-her-college-tuition-to-force-her-into-family-counseling-2020-09-30", "published": 1601917880.0, "headline": "â\u0080\u0098I feel very bitterâ\u0080\u0099: My late father gave my sister power of attorney. She kept $100K of his savings. Should I pursue legal action?", "body": "Dear Moneyist, I am a 52-year-old unemployed homemaker with various health issues that have prevented me from working over the past 10 years. (I do not receive disability). My husband works full time. I have a sister who is retired, and she and her husband net approximately $15,000 per month from pensions and Social Security. Their home is paid for, and they have zero debt, placing them in a secure financial position, for which I am grateful. Eleven months ago our father passed away, leaving my sister and me with a trust to divide evenly. However, he had a separate savings account with approximately $100,000 not included in the trust. Our father put my sisterâ\u0080\u0099s name on this account and gave her power of attorney as he, at 94 years old, needed assistance with paying his bills. My father told us that all of his money (including the savings account) was to be split evenly between us. Both my sister and I understood his wishes. The Moneyist: â\u0080\u0098We bet on the wrong horseâ\u0080\u0099: I co-signed my nephewâ\u0080\u0099s $55K student loan: He has no degree and no job. What should we do? In the past, my father generously assisted me financially when necessary due to my inability to work. He has also helped my sister, but not equally as she rarely needed any help financially. Also, I have children and she does not. He did pay for her graduate-degree program amongst other things. My sister recently informed me that she is keeping the money in the bank account she was overseeing, and has decided not to share any of it with me. I was shocked! She justifies her decision by claiming that dad spent more money on me and my family than he did on her. Do I have a legal right to any of that money? Should I pursue legal action or just accept that, while extremely unfair, that money is gone. I feel very bitter, and it hasnâ\u0080\u0099t helped my health issues at all. I do not want to hold on to these negative feelings. I am grateful for any advice. Betrayed Sister Dear Betrayed, There is a common theme in many of the inheritance-related letters I receive. When a parent dies, particularly the last parent, the children are left without the elder in their family who oversees not only the family fortunes, but also moral boundaries and decorum among the children. If a family was a country, the death of the final parent sometimes creates a lawless one. Think â\u0080\u009cLord of the Fliesâ\u0080\u009d for grown-ups. Whatâ\u0080\u0099s more, the combination of the three â\u0080\u009cGsâ\u0080\u009d â\u0080\u0094 grief, gripes and greed â\u0080\u0094 can mean long-simmering sibling rivalries boil over. People do things that they may not otherwise do if their parents were around to witness it. As for your own letter, contact the bank and your familyâ\u0080\u0099s estate lawyer to find out what kind of account status your sister and father shared. Another feature of dodgy dealings in the aftermath of a death: one party sometimes banks on the otherâ\u0080\u0099s lack of legal and financial knowledge. The Moneyist: My wife had a baby in June. She has $160,000 in student loans â\u0080\u0094 and just asked for my â\u0080\u0098blessingâ\u0080\u0099 to work part time Was your sister a co-owner of this account or a co-signer? If it was the former, your sister is a joint owner and, unfortunately, can spend the money as she wishes. She would also be liable for any debts on that account after your fatherâ\u0080\u0099s death. If it was the latter, however, your sister only has the right to sign checks on your fatherâ\u0080\u0099s behalf. If she overspent, the co-signer would be responsible for those debts. But when the owner of the account dies, it should be declared and go through probate. Many people donâ\u0080\u0099t understand the difference between being a co-signer and a co-owner on a bank account. The co-owner gets to own the money, but the co-signer only gets to manage it. There are so many cases of siblings listed as co-owners (rather than authorized signers) on those accounts who have emptied their parentâ\u0080\u0099s bank account before and after they died. The Moneyist:â\u0080\u0098He paid for all our first-class travelâ\u0080\u0099: I gave up everything for my boyfriend, 76 â\u0080\u0094 then he dumped me. Am I entitled to anything? If you sister was, indeed, a co-owner, you have another option. A power of attorney has a fiduciary duty to act in your fatherâ\u0080\u0099s best interests. Part of that responsibility involves keeping receipts and being completely transparent, informing family members of transactions. In such cases where a person did not act responsibly and funds were misappropriated, the banks in question have been held liable. But these cases are complex. If your father was 94 and losing his cognitive abilities, you may also have a case for elder abuse and/or abuse of power. Whether you succeed or not in your quest to split the $100,000 or even decide itâ\u0080\u0099s worth pursuing, you have another task ahead of you, one that in some ways is far more costly. Time, not money, is the most valuable commodity we have during our lifetime. How do you choose to spend yours? The Moneyist:My daughter wonâ\u0080\u0099t speak to me. Her therapist said weâ\u0080\u0099re a toxic family. Should I stop paying her college tuition to force her into family counseling? If you decide to torment yourself by raging against your sister and feeling bitter, you will ultimately pay a much higher price that will cost you your happiness. Give yourself a month or so to process it and then make a conscious choice to move on. Be grateful that you are not a scoundrel. Your sister may be indulging in skulduggery, but she must also be in pain and suffer from not a small amount of anger. This $100,000 wonâ\u0080\u0099t cure that. That is her first mistake. Thank your lucky stars that you came out of this personally, if not financially, unscathed. Wish your sister well. Your father would have wanted to leave you peace of mind most of all. You can email The Moneyist with any financial and ethical questions at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}