{"article": [{"url": "https://www.marketwatch.com/story/whats-a-snowbird-to-do-the-pandemic-has-upended-plans-to-head-south-for-the-winter-2020-09-28", "published": 1601373560.0, "headline": "What's a snowbird to do? The pandemic has upended plans to head south for the winter", "body": "This article is reprinted by permission from NextAvenue.org. A year ago (was it only just a year ago?) I wrote these promising words in a Next Avenue article: In the next few months, thousands of northerners - so-called \"snowbirds\" - will escape their snowy, cold climates to spend the winter in warm, sunny spots in the southern or western part of the U.S. Thousands of northerners did, indeed escape to warmer climes for winter 2019-20. Then came 2020 and the pandemic. Due to the coronavirus, snowbirds are now rethinking, businesses are worrying, rental agencies are discounting, transportation services are marketing, and Chambers of Commerce are scrambling to find a path to recovery and normalcy. Snowbirds David and Debby Englander have spent their winters near Sarasota, on the west coast of Florida, for the last several years since David retired from his law firm in New York City. Debby, an editor, writer and avid runner, has had a very positive motivation for going. \"I can do my work and also go outside to exercise, as opposed to the New York winters,\" she says.The pros and possible cons of being a snowbird in Florida this year To some extent, that motivation has only grown due to the pandemic. In New York, Debby says, she'd either be \"stuck inside or around so many people on buses and subways,\" she says. \"In Florida, there's less interaction with people, so there's less of a risk [of COVID-19].\" Before they left Florida to return home last May, the Englanders put down a deposit for this winter. Now, they're keeping their options open. \"If we go, it will be to avoid the cold here in New York,\" David said. \"But we won't make our decision until November. It all depends on the [coronavirus] numbers. So, if Florida is a hot spot and shuts down again or we'll have to quarantine, we'll cancel. And the worst thing is that we'd lose our deposit.\" Early projections for Sunbelt vacation rentals and the businesses that cater to snowbirds are down significantly. Also on MarketWatch: If Donald Trump has a plan to save Social Security, he should tell voters what it is Amtrak's Auto Train - which takes passengers and their cars nonstop and overnight to the Orlando, Fla, area - is normally almost fully booked for the early winter by now. But these trains are showing less than half full. Amtrak is even offering discounted rates of as much as 45% for some dates to shore up bookings.What Airbnb listings show A review of homes on Airbnb and VRBO/HomeAway, the largest online rental organizations offering long term rentals in the Sunbelt, reveal that snowbirds have many more options this year than in the past. In addition, many homes that traditionally required three-month minimum rentals in high-demand places like South Florida and the Gulf Coast are being offered for just one month this winter. Homeowners are trying to accommodate renters who are unsure about the conditions they may face. Diane Nelson, a Realtor with Paradise Real Estate in Palm Beach County, Fla., has a different take on why rentals are down. \"You have a lot of people who decided to buy this year instead of continuing to rent every year,\" Nelson said. \"I spoke to a man yesterday who said he was a seasonal renter for the last 30 years and decided to buy this year mainly because the interest rates are so low.\"Coronavirus and the northern border Barb and David Peltz from Toronto have been visiting South Florida for several years and bought a home there last year. When COVID hit in the spring, they scrambled to drive back to Toronto, fearing that the border would close - which it did. Now, they're not permitted to drive back to Florida. \"We're holding out til January,\" Barb said. \"We have the same concerns that everyone else does. That is: Florida has got to do better with its numbers than it has. But there are two other things we Canadians need in order to go: One, the border has to be open for us to drive and two, we have to be able to get supplemental health insurance that covers us if we get COVID.\" So, for now, the Peltzes are taking a wait-and-see approach.Recruiting telecommuters and other northerners Many rental agencies and landlords are hoping to recruit telecommuting snowbirds this winter, according to Karen Harrell, publisher of Snowbirds Gulf Coast magazine. They're hoping to attract those who may ultimately want to permanently move to the warmer climates. Don't miss: We want to leave colder Midwest states for 'warmer and drier climes' and good, affordable health care on $44,000 a year - so where should we retire? She adds that many northerners are telling her that despite the pandemic, they need to get away from the seasonal depression that can set in with constant gray and bitter cold winters. \"They don't have to be stuck inside all winter here on the Gulf Coast of Alabama and the panhandle of Florida,\" Harrell says. \"Now, they can work from home and also go outdoors, dine out, go biking or walking while still staying safe.\" Airbnb is helping get the word out that sunny locations are eager for visitors who'll stay a few weeks or months this winter. \"We are working with Visit North Carolina and Visit Florida - as part of our larger work with governments and tourism agencies worldwide to support local travel and economic growth - as destinations around the world seek to recover from the impacts of the COVID-19 pandemic,\" an Airbnb spokesperson said.A wariness for some snowbirds this winter But many people who come down to the Gulf Coast from Midwest states like Michigan, Iowa and Minnesota each winter are still somewhat wary about doing it this year. Some are waiting to see what happens with coronavirus outbreaks. \"Down here, we have a lot of snowbird clubs, made up of hundreds of people from one state who winter in our area,\" said Harrell. \"Many of the members of those clubs are holding off about committing to going south.\" What happens during the 2020-2021 snowbird season will be determined by what turns the virus takes. Also see: Making these small spending and saving changes can buy you a better retirement As Harrell says: \"Whether snowbirds come down to the Sun Belt will depend on the status of their health.\" But as many snowbirds say, it'll also depend on the coronavirus conditions on the ground. Bart Astor, an expert in life transitions and elder care, is the author of \"AARP Roadmap for the Rest of Your Life: Smart Choices About Money, Health, Work, Lifestyle and Pursuing Your Dreams\" and \"Baby Boomer's Guide to Caring for Aging Parents.\" His website is BartAstor.com and he can be reached at Bart@BartAstor.com. @bartastor This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}