{"article": [{"url": "https://www.marketwatch.com/story/us-treasury-yields-slide-as-hectic-auction-week-gets-underway-2020-09-08", "published": 1599581180.0, "headline": "U.S. Treasury yields slide as stocks renew selloff to begin holiday-shortened week", "body": "U.S. Treasury yields fell Tuesday as U.S. equities extended their torrid selloff of last week, bolstering demand for haven assets. The bond-market rally showed no signs of flagging throughout the session even after a sizable sale of short-term debt. The bond market was closed in observance of the Labor Day holiday on Monday.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 3.8 basis points to 0.683%, marking its biggest daily drop since Aug. 4, while the two-year note rate TMUBMUSD02Y, 0.156% edged 0.8 basis point down to 0.141%. The 30-year bond yield TMUBMUSD30Y, 1.576% declined 4.7 basis points to 1.421%. Bond prices move in the opposite direction of yields. What’s driving Treasurys? Equities remained on the back foot on Tuesday, with the Nasdaq Composite COMP, +1.39% recording a steep drop. Technology stocks have given up a chunk of gains since last week after an impressive run-up since its March lows, during which they led the broader market higher. The Treasury Department drew tepid appetite for $50 billion of three-year notes as part of $98 billion of coupon-bearing debt auctions this week. But the bid for safe-haven assets helped to limit the bearish impact of a sloppy auction, which can sometimes weigh on bond prices and lift yields. No major U.S. economic data was due Tuesday, with most of the key data including consumer price numbers for August set for release at the end of the week. The NFIB Small Business Optimism Index came in at 100.2 in August, rising slightly from July’s 98.8 reading. What did market participants say? “In many ways, we have turned a corner on the U.S. economic recovery, but the yield curve continues to tell you that we have not cleared all of the hurdles,” said Kevin Giddis, chief fixed-income strategist at Raymond James."}]}