{"article": [{"url": "https://www.marketwatch.com/story/gops-mcconnell-says-covid-19-package-ready-ball-is-in-democrats-court-11595885496", "published": 1595871560.0, "headline": "Democrats, White House officials finally sit down to talk turkey after GOP unveils coronavirus package", "body": "Senate Majority Leader Mitch McConnell speaks on Capitol Hill on July 21. AFP via Getty Images After weeks of back-and-forth public posturing and jockeying, Democrats and Trump administration officials finally sat down to negotiate a second large coronavirus aid bill Monday. The result? Only an agreement to talk again. “We’re going to keep talking, we’re going to roll up our sleeves,” Senate Democratic leader Chuck Schumer, flanked by House Speaker Nancy Pelosi, told reporters after a roughly hour-and-a-half closed-door meeting that included Steven Mnuchin and Mark Meadows, the Treasury Secretary and the White House chief of staff, respectively. Leaving for the night, Mnuchin only said it was a good meeting and the pair would return to Capitol Hill on Tuesday. Thus ended the day, after Senate Republicans, with the White House’s blessing, put their priorities down on paper, in the form of a series of bills Senate Majority Leader Mitch McConnell called the HEALS Act, for health, economic assistance, liability and schools. “Just like in March with the CARES Act, Senate Republicans have authored another bold framework to help our nation,” McConnell, a Kentucky Republican, said on the Senate floor. The approximately $1 trillion package consists of a group of bills, in contrast to the House Democrats’ single $3.4 trillion bill passed in May. The GOP package includes $306 billion in appropriations put together by Sen. Richard Shelby, an Alabama Republican, and Sen. Roy Blunt, a Missouri Republican. That part includes $105 billion to help schools and colleges reopen, $20 billion for vaccine and therapeutic treatment development and $29.4 billion for defense-related spending. The package’s unemployment insurance bill, written by Sen. Chuck Grassley, an Iowa Republican, would replace the $600-a-week add-on paid for by the federal government in addition to an unemployed worker’s regular state jobless payment, with a smaller $200-a-week payment through September. In October, that would be replaced by a combination of a federal add-on up to $500 and a state benefit that would replace 70% of the worker’s previous salary. A second round of direct checks to individuals of up to $1,200 each would also be sent out, with most of the same parameters as the first payments sent in the spring. Unlike the first round of checks, though, a dependent of any age, not just those under 17, would count for claiming an extra $500 dependent payment. Read: Republicans and Democrats both want another round of stimulus checks — but here’s where they disagree The Paycheck Protection Program would be extended beyond its scheduled early August expiration date. And a bill authored by Sen. John Cornyn of Texas would provide a higher legal bar for suing for exposure to coronavirus. Under his legislation, businesses, schools, colleges, non-profits and churches that made reasonable efforts to comply with public health guidance and did not show willful misconduct or gross negligence would enjoy protection. The shield would apply for exposures between Dec. 1, 2019, and Oct. 1, 2024. But it was some smaller provisions in the package that drew Democratic leaders’ ire. The appropriations portion includes $1.75 billion for construction of new FBI building that Pelosi criticized. McConnell said Democrats should work with Republicans on the package. “I know our Democratic colleagues know this crisis is still urgent. I know they know American families need more help,” he said. Pelosi said the nature of the proposal, “piecemeal” as she described it, showed Republicans were in disarray. “I don’t know if they have 51 votes, much less 60 votes, to do any of that,” she said."}]}