{"article": [{"url": "https://www.marketwatch.com/story/all-the-ways-isolating-at-home-is-bad-for-your-healthand-a-couple-of-simple-solutions-2020-08-06", "published": 1596711380.0, "headline": "All the ways isolating at home is bad for your health-and a couple of simple solutions", "body": "This article is reprinted by permission from NextAvenue.org. As our country braces against the ebb and flow of mandates to stay-at-home, we should give serious consideration to the repercussions of self-quarantine or isolation on the mental and physical well-being of those most vulnerable to COVID-19. As a health psychologist and expert in human immunodeficiency, I know the lessons learned from the field of behavioral medicine can help us better understand how isolating at home may have paradoxical effects on immune health, particularly among our oldest. The immune system can be described as a regimented system of defense against pathogenic threats to the body, both foreign and domestic. Helper T-cells are considered generals in this army, coordinating a systematic and efficient defense against the pathogen. When T-cells ratios become skewed or depleted, so does our resilience to opportunistic infections such as COVID-19. Across the globe, older adults, particularly those residing in long-term care facilities, have suffered the greatest burden of COVID-19 related mortality. As with other opportunistic infections, risk for mortality due to COVID-19 is increased in the oldest people due to the shared burden of chronic underlying health issues and age-related exhaustion of the immune system.T-cells and the coronavirus As studies of this pandemic continue to emerge, it is apparent that immune suppression hampers the ability of the most compromised COVID-19 patients to regulate the inflammatory immune response that prevents against tissue damage, septic shock and organ failure. T-cell ratios are shown to be the best predictors of mortality among nursing home residents suffering respiratory viral infections. Moreover, T-cells predict mortality in patients admitted to ICU with novel coronavirus infection.What types of behavior hamper T-cell function? Well, it appears that our immune system benefits greatly from social support. But while many Americans benefited from additional time spent with family and loved ones during quarantine, for the majority of older adults, stay-at-home orders have translated to social isolation. How might limited access to social networks translate into immune compromise?Social isolation and immune resilience Behavioral research widely supports the observation that socially isolated older adults have lower T-cells counts and higher levels of inflammation than their socially integrated counterparts. More frequent engagement in meaningful social interactions enhances immune function by lowering the suppressive effect of stress on immune resilience. Also on MarketWatch: COVID-19 may be why your Social Security benefits drop There is also a well-documented effect for fitness interventions, ranging from strength training/aerobic exercise to Yoga and Tai-Chi, on enhanced T-cell function and reduced inflammation in adults with and without pre-existing conditions. Although many of us managed to adapt our stay-at-home lifestyle to maintain physical fitness through makeshift home gyms and on-demand fitness apps, older adults again have found themselves more dependent on instructive/support services, large group formats and dedicated space for exercise, recreation and physical therapy. There are specific recommendations for older adults to maintain physical activity during the COVID-19 pandemic as a therapy against the mental and physical consequences of self-isolation. Another point of consideration is the paradoxical effect of stay-at-home orders on shut-in behavior.How getting out makes you healthier While fresh air and adequate sunlight are intuitively sources of health and well-being, the beneficial effects on the function of our immune system are well-documented. For example, in Japan there has been immense study of the effects of forest bathing \"Shinrin-yoku\" on bolstering immune resistance. Not only do these walks through heavily forested or vegetated areas lower levels of stress, but they also lower levels of inflammation in addition to increasing T-cell function in older adults with pulmonary disease. Exposure to sunlight may also offer beneficial effects for our immune system as a catalyst for Vitamin D3 production. Why is vitamin D important? Once effector T-cells are presented with a virus, they seek out vitamin D stores in the body to help in the metabolic process. While some vitamin D comes from our diet, ultraviolet B from the sun stimulates cholesterol in our skin to manufacture the unique Vitamin D3. Also on MarketWatch: I'm 63, a widow and lost my job because of COVID. I don't have much in savings and feel lost. What can I do? While this synthesis of Vitamin D3 from ultraviolet sunlight varies based on race and ethnicity, and should be considered in the context of overexposure, recent studies suggest vitamin deficiency predicts worse prognoses in older adults infected with COVID-19. For example, a recent publication in Lancet suggests higher levels of vitamin D may enhance immune response to infection, including production of antimicrobial peptides in lung tissue, thus making infection with the virus and development of severe COVID-19 symptoms less likely.Social isolation and post-traumatic stress symptoms A final point to consider is the psychological toll of social isolation and downstream effects on immune function. A recent review published in Lancet examining self-quarantined populations throughout the globe suggests social isolation during an epidemic has negative psychosocial consequences, including post-traumatic stress symptoms, confusion and anger. This study noted that the primary predictors of these symptoms were longer quarantine duration, infection fears, frustration, boredom, inadequate supplies, inadequate information and financial loss. While we all can attest to experiencing some degree of these stressors, these feelings are exacerbated by a low sense of personal control which is often undermined in the frail or resource-depleted populations. You might like: How to protect your money - at every age Exactly how do we combat these psychosocial pressures when access to social clubs, houses of worship and society's other release valves is restricted? Interestingly, the Lancet article cited altruistic behaviors, such as giving back to the community, as an adequate means to buffer the stress of self-quarantine.What can help: personal interactions One possible solution to stem the psychosocial distress associated with isolation in the oldest adults is to enhance meaningful communication. Facilitating interactions between families and residents of long-term care facilities is a special challenge that can be met by harnessing technology like FaceTime and Zoom calls for virtual visitation when in-person visits are not allowed. These same applications can be used to provide fitness and life coaching for the isolated, as well as facilitating telemedicine to ensure patients maintain some standard of care. However, this will require society to re-evaluate the ageism that often precludes engaging older adults with technology. While adherence of guidelines to isolate at home are intended to preserve health, we should consider how these mandates impact primary and secondary prevention measures that are essential for maintaining cardiovascular, immune and mental health. Within this challenge lies the opportunity to develop new infrastructure and enhance services for older adults to ensure their engagement in healthy lifestyle. Roger McIntosh is an assistant professor of health psychology at the University of Miami and Public Voices fellow of the OpEd Project. His current research interests include the psychosocial determinants of immunosuppression and cardiovascular disease in older adults. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}