{"article": [{"url": "https://www.marketwatch.com/story/the-biggest-problem-in-the-stock-market-bullishness-is-clouding-investors-thinking-2020-08-27", "published": 1598691860.0, "headline": "Caution flag comes out as U.S. stock market reaches new records", "body": "Attention, investors: It’s time for caution in the stock market. Five big challenges have cropped up in the past two weeks. They’re telling us the market will struggle to move higher, and it may even drop sharply in the seasonally volatile months of September and October. Below, I’ll give you an easy five-point plan for positioning your stock portfolio to help you navigate this new market environment, and get prepared mentally. But first, here are five ominous challenges stocks face. Market challenge No. 1: Investor sentiment is getting rich From a contrarian perspective, this is troubling. Whenever a lot of people are bullish, it’s a sign that most of the good news is already priced in. And there are fewer people with money on hand to push your stocks higher. I track a dozen sentiment indicators, and currently six are bearish, one is bullish and the rest are neutral. This isn’t “kiss of death” bullishness, but it is a warning sign, especially combined with the four challenges below. A great example of the current bullishness gripping the market: The demand for put options relative to calls is the lowest it’s been in more than a decade, according to the Chicago Board Options Exchange data. Put options are a bet stocks will decline, and investors buy calls when they think stocks will go up. Next, the percentage of bullish stock letter writers jumped to 59.5% last week, according to Investors Intelligence, the highest level since January 2020 (59.4%). I also track the Investors Intelligence Bull/Bear ratio. This has risen to 3.60, which puts it near the warning path. In my system of reading this indicator, anything above 4 is a clear sign that sentiment is getting too rich. (In contrast, below 1 signals that stocks are a strong buy. This ratio was at 0.72 in the last week of March during the Covid-19 market meltdown.) It’s also notable that the number of investors short-selling stocks, a bet they will fall, is declining. Market challenge No. 2: Insiders are on vacation, and not because it’s August The ratio of stock purchases to sales by in-the-know executives and directors tell us market insiders don’t care much for their own stocks. This ratio is slightly bearish, according to Vickers Insider Weekly. A more nuanced analysis of insider activity I regularly do for my stock letter shows a somewhat darker view. Not only has insider buying dried up, but it has all but vanished in cyclical names including industrials, materials and banks. This tells us insiders no longer think cyclical stocks are cheap, relative to their prospects. Because insiders regularly see real-time economic updates via internal performance numbers, their buying patterns tell us how stocks are priced relative to the economic outlook. Today, cyclicals are not priced attractively, say insiders. Market challenge No. 3: Stock valuations are stretched To be clear, insiders aren’t necessarily predicting sharp economic weakness. I’m not, either. The Atlanta Fed’s GDPNow tracker recently put annualized third-quarter GDP growth at an amazing 25.6%. The Citigroup Economic Surprise Index is at or near record-high territory. The housing market is strong, and it has a big impact on the entire economy. It’s just that all this potential growth seems priced in. And insiders are telling us they know it — by taking a break from buying their own stock. The forward price-to-earnings ratio on the S&P 500 Index SPX, +0.87% hit 22.3 on Aug. 21, up from 12.9 on March 23, points out Ed Yardeni, of Yardeni Research. That’s the highest it has been in the past 15 years. And it is well above the 15-19 range where it traded in the past five years. Yardeni predicts the V-shaped recovery in the U.S. will continue through September, and then slow to more of a Nike swoosh. Market challenge No. 4: Participation in the rally is dwindling As the S&P 500 and the Nasdaq COMP, +1.39% hit new record highs last week, fewer and fewer stocks participated in the strength. This is often a sign the strength will not continue. Inside the S&P 500 on Aug. 21, around 200 stocks were up, and almost 300 were down. On the New York Stock Exchange, twice as many stocks were down than up. Driving the indices higher were the usual suspects: Facebook FB, +0.26%, Apple AAPL, +1.74%, Amazon.com AMZN, +3.01% and Alphabet GOOG, +1.97% GOOGL, +1.82%. To put this another way, if a lot of stocks are performing poorly underneath the narrower indices tracked by the media, it’s a way of saying a “stealth” correction has already begun. But it just hasn’t been picked up by the market “bugs” in the corner of the CNBC screen, which can keep enthusiasm afloat among the crowd and superficial thinkers at the margin. We see the same thing in sector performance. Earlier this month there was a rotation into cyclicals and small-cap stocks, a bullish trend for stocks. But over the past 10 days, that rotation has stopped. In a healthy market, the majority of stocks and sectors should be rising along with the indices, says Baird chief investment strategist Bruce Bittles. He’s cautious on the market now, in part because we no longer see this. Market challenge No. 5: We are moving into two problem months Historically, market lows for the year happen in the first half of October. September is also notoriously volatile. One theory here is that investors naturally get into a harvest and hunker-down mood as the weather turns crisp in autumn. Another factor is the Oct. 31 deadline for tax-loss selling at mutual funds. This can have fund managers selling heavily during October to book tax losses. What to do now: Your five-point plan All of this does not mean you should sell everything and move to cash. This is not a firm prediction that the market will sell off sharply. It’s more a signal that stocks will struggle to move higher from here. So why chase them? However, this constellation of challenges is a signal that a selloff is more likely now. Remember that market corrections of 10% are normal, and they can happen at any time. Given these increasing risks, I suggest you do the following. 1. Avoid borrowing money to buy stocks, meaning cut margin buying to zero. 2. Have some cash on hand to take advantage of weakness in your favorite stocks. 3. Avoid getting sucked in to the bullishness. Market exuberance is highly contagious. When you hear how much your friend just made in Tesla TSLA, +1.89%, it might blur your judgment and make you hop in. 4. Get out of dubious trades, or positions that have been bugging you because they have been weak and you can’t see the bull case. 5. Do not sell out of long-term positions, because a prolonged recession is probably not at hand. Yardeni, at Yardeni Research, expects the economy will recover all of the GDP lost to the Covid-19 crisis by the second half of 2022. Market timing seems easy on paper. But the reality is, it’s tricky. Once you sell, it is hard to get the timing right on a reentry, especially as emotions heat up in selloffs. Michael Brush is a columnist for MarketWatch. At the time of publication, he had no positions in any stocks mentioned in this column. Brush has suggested FB, AMZN, NFLX, GOOGL and TSLA in his stock newsletter, Brush Up on Stocks. Follow him on Twitter @mbrushstocks."}]}