{"article": [{"url": "https://www.marketwatch.com/story/how-covid-19-could-spread-on-college-campuses-will-students-be-safe-2020-06-29", "published": 1593590300.0, "headline": "How COVID-19 could spread on college campuses. Will students be safe?", "body": "New models are exploring the ways COVID-19 could spread on a college campus. MarketWatch photo illustration/iStockphoto Millions of college students will soon find out whether they’re expected to return to campus this fall. The decision about whether their campuses will open — and how — is up to administrators who are balancing the challenges of bringing students to classrooms, dorms and dining halls safely during a pandemic without losing out on key sources of revenue. Colleges that have already announced they’ll hold classes in-person have offered detailed plans featuring plexiglass, masks, staggered schedules and space for social distancing. “ ‘You can wear masks and do social distancing and that can reduce you chances of becoming infected, but there’s really no substitute for not coming into contact with people.’ ” — Philip Gressman, a professor of mathematics at the University of Pennsylvania But simulations trickling out of professors’ computers across the country are raising questions as to whether these measures will be enough to keep students safe. They come amid concern over rising instances of the virus in young people and evidence that colleges who have already brought athletes back to campus for practice have struggled to protect them from the virus. “The model is saying something fairly straightforward,” said Philip Gressman, a professor of Mathematics at the University of Pennsylvania said of the simulation he created with Jennifer Peck, an economics professor at Swarthmore College. “There are some things that we can do. You can wear masks and do social distancing and that can reduce your chances of becoming infected, but there’s really no substitute for not coming into contact with people.”Most student pairs are connected through one other student Universities are closely connected environments, with a lot of social contact. That is the basic conclusion of an analysis of transcript data from students at Cornell University conducted by Kim Weeden and Benjamin Cornwell, two sociology professors at the school. The average Cornell student shares a class with 2.4% of other students, the sociologists found. By the time an undergraduate or graduate student has run through their schedule at least once they’ve had the potential to share a classroom with 529 students. The average student can also reach those they don’t share a class with relatively easily. Nearly 60% of student pairs can reach each other through just one other student, 92% can reach each other through two other students and 96.6% of students can reach each other through three other students. “ Nearly 90% of pairs of undergrads are connected by just one student and 99.8% are connected through two students ” — an analysis of data by sociologists Kim Weeden and Benjamin Cornwell Undergraduate students are even more tightly connected. Nearly 90% of pairs of undergraduates are connected by just one student and 99.8% are connected through two students. “We were a little bit surprised that virtually every student can be reached indirectly,” Weeden said. A hypothetical example of how this might work, according to Weeden: A law student enrolls in a course that’s also open to upper-level undergraduates. A junior philosophy major attends that class and then later in the day has a Spanish course with a junior math major. The law student and the math major are connected through just one other student. “You get these connections just by virtue of these shared interests,” Weeden said, as well as general education requirements, which bring students from different subject areas together. With no intervention, more than 2,000 people would be infected in 30 days All of these connections could provide opportunity for the virus to roam throughout campus. If a university did nothing to prevent the virus from spreading or to intervene when it became apparent (a very unlikely scenario), the number of people initially infected would double every 2.2 days, according to Peck and Gressman’s model. Put another way, more than 2,000 people would be infected within 30 days of the first infection and about 90% of the population would end up infected halfway through the semester. Their model also looks at the impact of various steps universities could take to mitigate a virus outbreak. Assuming that a university pursues what the researchers describe as the “standard intervention” — daily randomized testing of 3% of the university population, quarantining and contact tracing infected individuals, requiring everyone to wear masks and moving classes of 30 people or more online — fewer than 66 people out of 22,500 get infected in 95% of simulations run by the pair. One intervention appears to make a much bigger difference than others in limiting the spread of the virus, Peck and Gressman found — keeping large classes online. Assuming a university takes all the other precautions in the standard scenario, allowing classes with more than 30 students to meet in person increases the number of infections in the median run of their simulation from 43 to 538. Breaking those larger classes up into smaller meetings doesn’t have much of an impact; though that would change the number of people students come into contact with, it wouldn’t be nearly as drastic as if the class were moved online. If the school doesn’t require masks, infections rise to 131. Keeping small classes in small classrooms, instead of moving them to larger spaces to allow for social distancing, increases the median infection to 48.5. “ ‘Giving any opportunity for a large group to gather really as a significant impact on the spread of the disease.’ ” — Philip Gressman, a professor of mathematics at the University of Pennsylvania “Giving any opportunity for a large group to gather really has a significant impact on the spread of the disease,” Gressman said. “It’s not okay to have some big classes, because some big classes is already enough for the problem to really take off.” Their simulation is focused on the role the academic environment plays in the spread of the virus. The best case numbers offered in these scenarios rely on students interacting very minimally outside of class, Peck said. Any of these predictions could go up by a factor of 10 or more, depending on how much socializing students participate in. “After all the academic and other precautions are taken, the reaction of students will be a big factor in determining what happens on campus,” Peck wrote in an email.Students will face small choices that could impact their exposure to coronavirus Even if students are trying their best to follow guidelines and stay safe, they’ll likely be faced with a flood of small decisions that could impact their exposure to the virus. Do they hold the elevator doors open for a hall mate, even though it’s a crowded space? Do they go back to their room to get their hand sanitizer if they’ve forgotten it on the way to class? Do they remind their friends to wear masks if they forget or don’t want to? These decisions and their consequences could make an especially big impact on students who are immunocompromised or feel marginalized on their campus under typical circumstances. Cait Kirby, a Ph.D candidate in the biology department at Vanderbilt University, created an interactive game to help administrators, faculty, students and families understand the stakes of returning to college for this type of student. Her game follows a black, trans student in a wheelchair through a day of classes in September and presents them with various choices. Though Kirby chose to focus on this one scenario to highlight the particular challenges this student might face navigating a college campus in a pandemic, students of all types will likely be impacted by some of these choices. The game asks players to consider decisions like choosing between waking up with their alarm or missing their allotted bathroom slot, and presents them with scenarios such as being forced to look at their neighbor’s laptop screen because their computer dies and they’re without a charger. “If we just stack and layer all of these things, what happens when all of these dominos fall at once,” Kirby said. “Given the stressful circumstances, the likelihood that all of these dominoes are going to fall at once is higher.” Kirby developed the game by thinking back to her own college experience and also discussing concerns about returning to campus with colleagues and friends. People who play the game more than once will find that the choices students make don’t really matter — they’re put at risk of catching the virus regardless. “The only way to win this game is not to play, which is the approach that I think campus administrators should be taking in the fall,” Kirby said."}]}