{"article": [{"url": "https://www.marketwatch.com/story/like-warren-buffett-half-a-century-ago-quant-firm-admits-to-being-out-of-step-with-todays-bubbly-conditions-2020-08-03", "published": 1596537920.0, "headline": "The â\u0080\u0098death of valuationâ\u0080\u0099 and what it could mean for investors going forward", "body": "In 1967, Warren Buffett told investors that he was â\u0080\u009cout of step with present conditions,â\u0080\u009d an admission that he couldnâ\u0080\u0099t wrap his head around the market climate at the time. â\u0080\u009cI will not abandon a previous approach whose logic I understand (although I find it difficult to apply),â\u0080\u009d Buffett explained, â\u0080\u009ceven though it may mean foregoing large, and apparently easy, profits to embrace an approach which I donâ\u0080\u0099t fully understand, have not practiced successfully, and which possibly could lead to substantial permanent loss of capital.â\u0080\u009d Kailish Concepts, a quant analysis firm, used those very words from the Berkshire Hathaway BRK.B, +0.24% Â boss in a note taking a deep dive into the â\u0080\u009cdeath of valuationâ\u0080\u009d in todayâ\u0080\u0099s market, which can be seen by this telling chart showing the dominance of growth stocks: â\u0080\u009cKailash believes the idea that things are different this time to be a very old and very flawed story,â\u0080\u009d the analysts wrote, adding that they believe that â\u0080\u009cmuch of Nasdaqâ\u0080\u0099s manic run is simply a wall of money chasing what was already racing higher.â\u0080\u009d Joining the likes of high-profile Wall Street names like Jeremy Grantham, David Tepper, Stanley Druckenmiller, Cliff Asness and Howard Marks, to name a few, Kailish explained that, as the chart suggests, the stock market is clearly in bubble territory. And weâ\u0080\u0099ve seen this play out before. â\u0080\u009cThe most expensive firms in the market today, like in August of 2000, generate no FCF, are loss-making and carry the associated negative ROEs and ROAs, and are diluting shareholders to fund operations,â\u0080\u009d Kailish wrote. â\u0080\u009cWith spreads between value and growth at record levels and an explosion of speculative listings through IPOs and SPACs underway, todayâ\u0080\u0099s market environment shares numerous features with prior peaks in 2000 and 2007.â\u0080\u009d No sign of a popping bubble as stocks got a bit more expensive to start the week and held gains on Tuesday. At last check, the Dow Jones Industrial Average DJIA, +0.56% Â , Nasdaq Composite COMP, +1.39% and S&P 500 SPX, +0.87% were all hovering around breakeven."}]}