{"article": [{"url": "https://www.marketwatch.com/story/trump-himself-asks-why-woodward-didnt-immediately-report-the-presidents-comments-about-playing-down-the-coronavirus-2020-09-10", "published": 1599737240.0, "headline": "Trump himself asks why Woodward didnâ\u0080\u0099t immediately report the presidentâ\u0080\u0099s comments about playing down the coronavirus", "body": "The reactions keep coming after excerpts from famed journalist Bob Woodwardâ\u0080\u0099s new book said that President Donald Trump knew early on that the coronavirus was â\u0080\u009cdeadly stuffâ\u0080\u009d but wanted to â\u0080\u009cplay it down.â\u0080\u009d Woodward himself has drawn considerable criticism for not reporting Trumpâ\u0080\u0099s comments sooner â\u0080\u0094 and the president has seized on the #BobWoodwardKnew issue. Trump said the following in a tweet on Thursday morning: “ â\u0080\u0098Bob Woodward had my quotes for many months. If he thought they were so bad or dangerous, why didnâ\u0080\u0099t he immediately report them in an effort to save lives? Didnâ\u0080\u0099t he have an obligation to do so? No, because he knew they were good and proper answers. Calm, no panic!â\u0080\u0099 ” â\u0080\u0094 President Donald Trump Woodward, for his part, told the Associated Press on Wednesday that he needed time to be sure that Trumpâ\u0080\u0099s private comments from a half-year ago were accurate. â\u0080\u009cHe tells me this, and Iâ\u0080\u0099m thinking, â\u0080\u0098Wow, thatâ\u0080\u0099s interesting, but is it true?â\u0080\u0099 Trump says things that donâ\u0080\u0099t check out, right?â\u0080\u009d Woodward said in an interview with the AP. Using a phrase from the Watergate era, the reporter and bestselling author added that his mission was to determine â\u0080\u009cWhat did he know and when did he know it?â\u0080\u009d Related:Trump responds to Woodward book saying he played down coronavirus: â\u0080\u0098We had to show calmâ\u0080\u0099 And see:Trump knew the coronavirus was â\u0080\u0098deadly stuffâ\u0080\u0099 but wanted to â\u0080\u0098play it down,â\u0080\u0099 according to Woodward book But Woodwardâ\u0080\u0099s critics accused him of being mostly interested in sales of his new book, titled â\u0080\u009cRage.â\u0080\u009d â\u0080\u009cBob Woodwardâ\u0080\u0099s nonfeasance in the face of this disaster should stand with Walter Durantyâ\u0080\u0099s covering for Stalin in the matter of the Ukrainian famine as eternal embarrassments to journalism and to simple humanity,â\u0080\u009d wrote Charles P. Pierce in an Esquire column. Pierce is among the commentators suggesting that Woodwardâ\u0080\u0099s behavior has been as bad as Trumpâ\u0080\u0099s, while many others have said Trump deserves more blame."}]}