{"article": [{"url": "https://www.marketwatch.com/story/big-tech-is-turning-on-one-another-amid-antitrust-probes-and-litigation-2020-09-11", "published": 1599899240.0, "headline": "Big Tech is turning on one another amid antitrust probes and litigation", "body": "“Battle royale” evokes images of professional wrestlers engaged in a free-for-all brawl in which combatants eventually turn on one another until there is an eventual winner. With apologies to Hulk Hogan and Andre the Giant, Big Tech is taking on the same trappings as companies turn on one another amid multiple antitrust investigations and issues. As the Justice Department, Federal Trade Commission, Congress and state attorneys general dig deeper into their probes, and as Apple Inc. AAPL, +1.74% and Epic Games Inc. duke it out in court, some of the companies targeted are taking a page out of the squared circle and turning on one another. A quick recap: Facebook Inc. FB, +0.26% is targeting Apple amid its fight with Epic over 30% fees on the App Store. In TV commercials and brand messaging, Apple repeatedly takes swipes at the privacy policies of Facebook in its pursuit of targeted advertising. High-profile names in tech, meanwhile, question business systems at Google and Amazon ahead of charges against those companies that are expected soon. All the while, Big Tech employees and executives increasingly are grumbling about Microsoft Corp. MSFT, +2.48% seemingly getting a free pass from the Trump administration. In a closed-door meeting with Facebook employees in late August, Chief Executive Mark Zuckerberg said Apple “charge[d] monopoly rents” which “blocks innovation, blocks competition.” He further upped the ante Tuesday, suggesting in an interview with Axios that the government should investigate the App Store. “I think some of the behavior certainly raises questions,” he said. “And I do think it’s something that deserves scrutiny.” Not to be excluded, Microsoft claimed Apple’s threat to revoke Epic’s developer account would have far-reaching effects harmful to the videogame industry. “If Unreal Engine cannot support games for iOS or macOS, Microsoft would be required to choose between abandoning its customers and potential customers on the iOS and macOS platforms or choosing a different game engine when preparing to develop new games,” Kevin Gammill, Microsoft’s general manager for Gaming Developer Experiences, said in a statement. “Apple’s discontinuation of Epic’s ability to develop and support Unreal Engine for iOS or macOS will harm game creators and gamers.” Read more: Microsoft says Apple’s threat against ‘Fortnite’ maker would hurt entire videogame industry Complicating matters, Apple on Friday imposed changes to its App Store that could severely hamper game-streaming services from Google Stadia and Microsoft’s xCloud. Among the revisions to iOS 14, the latest version of the iPhone operating system expected later this month, one would require games offered in the service to be downloaded directly from App Store — not from an all-in-one app like Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% and Microsoft are offering. In another wrinkle to the Apple-Facebook standoff, Instagram CEO Adam Mosseri on Friday told CNBC that the company strongly objects to a planned change to iOS that would impact how it and other mobile advertisers track users. On Thursday, Apple said it will delay until early next year changes to its privacy policy that Facebook and others claim will eviscerate advertising sales targeting users on iPhones and iPads. Read more: Apple delays privacy policy change, much to the relief of Facebook, mobile ad sellers Even those who helped create some of tech’s most important properties are aghast at what they have become. In August, YouTube co-founder Chad Hurley asked via Twitter if “YouTube become the Amazon of video? If so, where is the Shopify of video?” “What if I told you the obnoxiously high 30% App Store fee was a deal? This is the story of a video site that uses it’s size and power to take nearly double that,” he wrote. A long list of former Facebook employees and advisers — among them, co-founder Chris Hughes, ex-Chief Security Officer Alex Stamos and venture capitalist Roger McNamee — have commented with distress about the company’s impact on society. Hughes went so far last year as to advocate breaking up the company. A circular firing squad The finger-pointing and name-calling belies long-simmering competition between four companies — Apple, Google parent Alphabet, Amazon.com Inc. AMZN, +3.01% , and Facebook — that are under scrutiny from a phalanx of investigative bodies over their business practices and vast influence in multiple markets. Antitrust experts jokingly refer to those under investigation as GAFA. More important, the circular firing squad could portend a slew of forthcoming actions on the antitrust front: The Justice Department is expected to bring charges against Google as early as this month, a person familiar with the investigation told MarketWatch. The House Judiciary Committee’s antitrust subcommittee, meanwhile, could issue a report this month on its recommendations following its July 29 hearing on Big Tech, two people close to the situation told MarketWatch. Fueling the acrimony is genuine concern from the far-right to the far-left. “Big Tech is big oil. It is a bipartisan issue,” Anurag Chandra, a partner at venture-capital firm Fort Ross Ventures, told MarketWatch. “These guys have gotten massive. We have to get involved with public policy over privacy and use of personal data.” “Google and Amazon would seem to be first in line for actions,” he added. “They create and operate forums, and then compete in them. By putting their thumbs on the scale, that sounds like grounds for antitrust actions.” Fueling the accelerated timetable is the increasing willingness among smaller companies to speak up against the Big Four. “You will also see non-GAFA companies air their grievances more publicly because they aren’t in danger of being punished with so much attention on their business practices,” said Joel Mitnick, a former FTC trial lawyer who specializes in antitrust and global litigation. “It is out in the ether now. What is more important is the entire regulatory machinery around the world is gearing up against the Big Four. The infighting is background noise.” A possible timeline Google is likely to face charges as early as this month under the aggressive directive of U.S. Attorney General William Barr, according to a person familiar with the investigation and at least two recent reports. The Justice Department and a group of state attorneys general may file antitrust lawsuits focusing broadly on how Google leverages its dominant search business to stifle competition, according to a Wall Street Journal report. At the same time, the Justice Department and state attorneys general are also investigating the pricing and operations of Google’s Network division, a business that sells services that handle almost every step a digital ad takes, said a Bloomberg report. Of course, the political calculus of such moves during a presidential election year could complicate matters, says V.C. Chandra. “I’m growing skeptical that we will see anything definitive regarding an antitrust action before the election,” he said. “The administration, despite its feelings about monopolization, needs a strong economy. A concrete action against Big Tech could drive down their stock and blunt market momentum that has been aided by tech companies.” Facebook is even more immune to imminent government activity between now and Nov. 3 because it is a “political hot potato” for both a get-out-the-vote push on its properties at the same time conservative groups and pages thrive on Facebook’s digital platform, Chandra said. (In the same interview with Axios, Zuckerberg refuted a narrative that Facebook is an echo chamber for right-wing views.) Despite the relatively civil relationship between Zuckerberg and President Donald Trump, it might only take a mild disciplinary action by Facebook over Trump’s profile feed to raise his ire and prompt regulatory punishment, Chandra added. Last week, the company said it would ban new political ads in the week preceding Nov. 3. Gaming the system An already epic battle brewing in antitrust against Big Tech became downright Epic when the eponymous videogame maker sued Apple and Google in August. This has led to a pile-on of Apple by companies like Microsoft, Spotify Technology Inc. SPOT, +0.08% and Facebook over its App Store policies. Last week, Epic filed a preliminary injunction against Apple in its latest attempt to bring “Fortnite” back to Apple devices. “Many companies have huge components of their business reliant on mobile apps and the supporting toolsets,” Adam Landis, CEO of mobile-analytics company AdLibertas Inc., told MarketWatch. “Apple trying to block a major toolset should set anyone reliant on mobile apps on edge. Imagine waking up to find business operations halted — or your apps no longer functional. I wouldn’t be surprised if Facebook intends to lob a lawsuit of their own against Apple.” Apple countersued Epic on Tuesday, seeking punitive damages. The case’s next hearing is Sept. 28. Google, too, has been a lightning rod of criticism from longtime rivals. Days after the congressional hearing in late July, Tripadvisor Inc. TRIP, +0.74% CEO Steve Kaufer called for further investigation into Google’s search-ranking practices to rein in its “deceptive efforts to [keep] users on Google’s sites even if Google doesn’t have the most relevant information.” Luther Lowe, senior vice president of public policy at Yelp Inc. YELP, -1.66% , told MarketWatch he was “pleasantly surprised” to see House members grill Google for allegedly stealing content from developers, such as restaurant reviews from Yelp. Read more: ‘Fortnite’s’ impact could be Epic on antitrust investigations of Big Tech Why not Microsoft? Through all the infighting and accusatory claims, Microsoft has been notably excluded from antitrust talk — which is surprising given its long and tortured history with federal antitrust investigations. During the Microsoft investigation more than 20 years ago, the government dropped the effort to break up the tech giant before eventually settling the case with a consent decree. For more: Big Tech was built by the same type of antitrust actions that could now tear it down By the time the government reached a settlement with Microsoft, however, many years had passed and the tech market had seen the emergence of new markets for mobile and cloud, as well as the transformation of Microsoft into a cloud and gaming behemoth. Ultimately, federal authorities were successful in changing Microsoft’s behavior toward competitors, prompting it to soften its ruthless ways and indirectly fomenting competition in the emerging fields of search, social media and e-commerce. The man leading the push acknowledged that historical record in a speech in June 2019. “The government’s successful antitrust case against Microsoft arguably paved the way for companies like Google, Yahoo, and Apple to enter the market with their own desktop and mobile products,” said Makan Delrahim, the Justice Department’s antitrust chief, told MarketWatch in an interview late last year. Which brings us to today, and Microsoft’s unique standing. The company last week was awarded a 10-year, $10 billion cloud-computing contract by the Defense Department over Amazon, and it is a favorite to acquire video-sharing service TikTok. Those developments have left many in tech wondering if Microsoft, as well as Facebook and Oracle Corp. ORCL, +0.42% , have been favored by the Trump White House while Amazon and Google are punished for political reasons. (Amazon CEO Jeff Bezos owns the Washington Post, a fierce critic of the president, while Google has largely ignored entreaties from lawmakers to testify until recently.) Antitrust lawyer Paul Swanson points out Microsoft does not run “big-time marketplaces for apps (like Apple and Google, for example) or for advertising (such as Google, Facebook, and Amazon) or for goods (like Amazon).” What makes the Big Four so interesting, he says, is they don’t just have market power in the markets where they compete — they created and control the forum for competition, and then (at least for Amazon and Google) they compete within those competitive spaces that they operate and control. “It’s a little like Microsoft in the ‘90s, which controlled the forum (Windows) for competition among third-party software developers (Novell, Netscape) and used its control over the forum to favor itself in competition with those developers (WordPerfect, Explorer v. Navigator),” Swanson said. “After taking on a lot of water in antitrust litigation back then, Microsoft seems to have charted a more careful course,” he said. A lone voice of dissent toward Microsoft, aside from Amazon over the government contract, is Slack Technologies Inc. WORK, +3.36% It filed a competition complaint in Europe in July."}]}