{"article": [{"url": "https://www.marketwatch.com/story/arizona-reverses-course-orders-bars-pools-to-shut-again-amid-outbreak-2020-06-29", "published": 1593460520.0, "headline": "Arizona reverses course, orders bars, pools to shut again amid outbreak", "body": "PHOENIX — Arizona’s governor ordered bars, nightclubs and water parks to close again for at least a month starting Monday night — a dramatic about-face as coronavirus cases surge in the Sunbelt. Republican Gov. Doug Ducey also ordered public schools to delay the start of the classes at least until Aug. 17. Many districts planned to start the school year in late July or early August. Both orders can be extended. Arizona emerged from stay-at-home order in mid-May, but infections have since begun spiking. On Sunday, it reported 3,858 more confirmed coronavirus cases, the most in a single day for state and the seventh time in recent days that the daily toll surpassed the 3,000 mark. While Ducey has urged Arizonans to keep their distance from one another in public, he refused to issue a statewide order to wear masks and until recently resisted calls by some cities to allow them to require masks. Most Arizona bars and nightclubs reopened when the stay-at-home order lifted, and scenes of packed clubs and bars were common. Pools at hotels and motels and municipal pools are also being shuttered, as are gyms, movie theaters and a popular tubing location on the Salt River east of metro Phoenix. Arizona’s move comes as many states in the South and West are seeing a new surge of infections as businesses reopen and warmer weather draws people together. Places such as Texas, Florida and California are also backtracking, closing beaches and bars in some cases. It also comes less than a week after President Trump visited the Arizona-Mexico border and held a rally in Phoenix in which few people wore masks. Since Arizona began seeing a rise in cases, hospitals around the state have begun activating surge plans to increase their capacity to treat coronavirus patients. If the closure order isn’t extended and the businesses are allowed to reopen at the end of July, local health officials and law enforcement will be able to enforce strict social distancing and limit how many people can enter. Private pools at apartment complexes can remain open, but they must limit gatherings to no more than 10 people. The governor is also reestablishing a ban on gatherings of more than 50 people, and the state liquor department is ending the issuance of special-use alcohol permits."}]}