{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-edge-higher-as-investors-watch-for-further-clues-from-ecb-2020-09-10", "published": 1599746840.0, "headline": "Gold marks third straight gain as euro strength pressures U.S. dollar", "body": "Gold futures climbed on Thursday, poised to score a third straight session gain, as strength in the euro in the wake of the European Central Bank’s decision to leave its policy unchanged pressured the U.S. dollar. The European Central Bank left its policy unchanged at minus 0.5% and its refinancing rate at 0%, while reaffirming it plans to leave rates at present or lower levels until inflation rises to converge with its target at 2%. In a news conference, ECB President Christine Lagarde said the Governing Council “extensively” discussed the recent strength of the shared currency, but reiterated that the bank doesn’t target the exchange rate. A Bloomberg report, meanwhile, said that members of the council had agreed to not overreact to euro strength. “The ECB has confirmed that there is no further need for additional help,” said Naeem Aslam, chief market analyst at AvaTrade, in a market update. “For traders, the ECB’s confidence in the Eurozone’s economy is a good thing and this is the reason that we have seen the EUR/USD moving higher.” In Thursday trading, the euro EURUSD, +0.60% traded at up 0.5% at $1.1861, helping to pull the ICE U.S. Dollar Index DXY, -0.58% down by 0.2% to 93.118. A weaker dollar can provide support for assets priced in greenback, making them less expensive to overseas buyers. December gold GCZ20, +2.17% GC00, +2.17% rose $9.40, or 0.5%, to settle at $1,964.30 an ounce, following gains in each of the last two sessions. “There is no way to predict short-term movements, but gold investors should keep some powder dry for when a buying opportunity comes along in the weeks ahead, ideally around the $1,830 level,” Michael Armbruster, managing partner at Altavest, told MarketWatch. Read:Volatility in oil and gold may offer more opportunity than risk December silver SIZ20, +5.96% SI00, +5.96%, meanwhile, settled 21 cents, or 0.8%, higher at $27.291 an ounce after climbing 0.3% in the previous session. In U.S. economic news Thursday, the number of Americans who applied for unemployment benefits through state and federal programs in the week ended Sept. 5 was unchanged at a seasonally adjusted 884,000, the Labor Department said. Still, continuing jobless claims, the number of people already receiving benefits rose by 93,000 to a seasonally adjusted 13.39 million in the seven days ended Aug. 29. “The mixed bag of economic data confirms that there is gradual recovery for the U.S. economy,” said Aslam. “However, things are not improving and this is the reason that we are seeing improvement in the gold price. It is likely that the bottom is in for the gold price and it is likely to continue to move higher.” Other metals traded on Comex also finish higher Thursday, with the exception of copper. December copper HGZ20, +1.38% ended at $2.9985 a pound, down 1.7%. October platinum PLV20, +3.99% added 1.7% to $941 an ounce and December palladium PAZ20, +2.31% climbed 0.6% to $2,330.90 an ounce."}]}