{"article": [{"url": "https://www.marketwatch.com/story/historian-who-has-accurately-called-every-election-since-1984-says-biden-will-beat-trump-in-2020-presidential-race-11596651351", "published": 1601418620.0, "headline": "Historian who has accurately called every election since 1984 says Biden will beat Trump in 2020 race", "body": "The historian who is known affectionately as the granddaddy of presidential prediction models says that Democratic presumptive nominee Joe Biden is a shoo-in to win the 2020 presidential race. The American University historian Allan Lichtman’s predictions are worth paying attention to because he has accurately forecast every election since 1984, including President Donald Trump’s stunning victory in 2016 over Democratic rival Hillary Clinton. In an op-ed video in the New York Times published on Wednesday, Lichtman’s model, per usual, outlines his 13 keys to the White House that now lead him to believe that Biden is on track to secure a victory on Nov. 3. This time around, Lichtman’s prognostication should come as little surprise given national polls indicate that Biden commands a substantial lead over the incumbent. Biden, polling at 49.1%, holds a 6.4 percentage-point lead over Trump at 42.7%, according to a national poll average compiled by Real Clear Politics. Lichtman says Biden leads Trump on seven of the 13 true-or-false criteria he looks at to assess the winner of a race to the White House, which includes factors such as the economy, foreign policy, scandals, social unrest and even the charisma of the candidate. To be sure, the model is not scientific but Lichtman’s results deserve attention, if only for the novelty of seeing how his forecast plays out. It is worth noting, however, that Lichtman’s prediction that Al Gore would win the presidency in the 2000 election wasn’t accurate because although the former vice president to Bill Clinton won the popular vote, he lost the disputed election to George W. Bush , after the Supreme Court intervened to end a recount of Florida ballots. Lichtman still considers that 20-year-old prediction accurate. Recently, Trump via Twitter has been pushing his economic and market prowess as factors that he hopes can lead him to a victory in November. On Monday, he claimed that a record high for the Nasdaq Composite Index COMP, +1.39%, achieved in the wake of the carnage wrought by the pandemic, would all “come crashing down” if Biden wins the election. The Nasdaq has soared nearly 60% since hitting a March 23 low and has booked 30 record highs so far in 2020, while the S&P 500 index SPX, +0.87% has climbed 48% and the Dow Jones Industrial Average DJIA, +0.56% has risen by about 46% over the same period. Still, the success of the stock market isn’t likely to be enough to secure a win for Trump. Strategists at JPMorgan Chase & Co. have made the case that a win for the former vice president would be a “neutral to slight positive” for stocks."}]}