{"article": [{"url": "https://www.marketwatch.com/story/we-worry-the-fda-is-under-extreme-pressure-to-rush-approvals-for-covid-19-treatments-11598552588", "published": 1598539760.0, "headline": "We worry the FDA is under extreme pressure to rush approvals for COVID-19 treatments", "body": "A health worker checks on a donation of convalescent plasma. Getty Images On the eve of the Republican National Convention, Food and Drug Administration Commissioner Dr. Stephen Hahn announced that the FDA had issued emergency use authorization for investigational convalescent plasma as a treatment for COVID-19. Plasma is the liquid part of blood. Sometimes, for treatment purposes, it is taken from people who have been infected with but recovered from a disease, because it contains antibodies that fought the disease. Doctors then inject this so-called convalescent plasma into patients who currently have a disease in hopes that the antibodies in the plasma can help current patients. Hahn and several members of the administration hailed the authorization as an extraordinary public health achievement. The announcement, however, has drawn extensive criticism. Many scientists have said that both the FDA and the administration greatly overstated and even mischaracterized data on the efficacy of convalescent plasma. Two days later, Hahn publicly apologized for misrepresenting the benefits of convalescent plasma in connection with COVID-19, but he maintained that the decision to authorize the treatment for emergency use was based upon sound science and data. iframe.twitter-tweet { width: 100% !important; } Commentators and other researchers have questioned whether the decision also reflected extreme political pressure to rush approvals of treatments for COVID-19. We are law professors and have examined the regulatory posture of the FDA since the beginning of the outbreak. We have studied how the FDA’s decisions have varied with the external pressures that it has faced, comparing it to past emergency decision making by the agency. We believe that this episode is symptomatic of a larger problem, and we worry that FDA’s repeated departure from evidence-based standards and long-tested and proved procedures will soon translate into a poorly considered authorization of COVID-19 vaccines.The convalescent plasma decision in context Traditional FDA approval takes several years and relies on extensive data. During public health crises, however, the lawgives FDA the ability to authorize the use of unapproved products on an emergency basis. The agency does so by issuing an emergency authorization, or EUA. The EUA pathway gives FDA the flexibility to act faster and green-light worthy products that have otherwise not been sufficiently vetted. An EUA is based on much less data than an approval. A properly issued EUA is balanced by legal and scientific checks. The law directs the FDA to assess whether a specific product considered for an EUA “may be effective” in light of the “totality of scientific evidence available.” The agency must also determine whether the product’s potential benefits “outweigh the known and potential risks” and that “there is no adequate, approved, and available alternative.” In the case of convalescent COVID-19 plasma, the FDA justified the EUA by stating that the treatment would save 35 out of every 100 patients. iframe.twitter-tweet { width: 100% !important; } President Trump called the EUA “a very historic breakthrough.” However, experts like former FDA Commissioner Robert Califf, were quick to note that the statement of 35 lives saved was not supported by available data. iframe.twitter-tweet { width: 100% !important; } Moreover, the EUA for convalescent plasma was based on data generated over the course of just a few tests since April. Scientists ––including one involved in the Mayo Clinic study used by the FDA to support the EUA — noted that the FDA had improperly framed the data to make unsupported efficacy claims. In his apology, Hahn said the criticism was “entirely justified.”Science yields to political pressure This is not the first time in the COVID-19 pandemic that the FDA made a controversial decision involving an EUA. In March, under pressure from the Trump Administration, the agency issued an EUA for hydroxychloroquine and chloroquine. Randomized trials, however, failed to show any benefit associated with these drugs. Three months later, in the face of continued lack of evidence to meet even the lower threshold of an EUA, the FDA revoked the EUA. Yet the Trump administration attempted to control the framing of the revocation. It portrayed it as the removal of a barrier to the use of these drugs, when in fact the revocation did exactly the opposite. Recent events like these provide unsettling clues of a deterioration of standards at the FDA. The flexibility that is required to deal with emergency responses creates opportunities for nimbleness. However, it also poses the danger that standards will be displaced. For an agency already overtly yielding to political pressure and short-termism, we are concerned that things are unlikely to improve as the COVID-19 vaccine race accelerates.Concerns with emerging COVID-19 vaccines There should be absolutely no link between the coming election and the vaccine regulatory process. Yet, there are growing concerns — voiced by experts like Dr. Anthony Fauci — that there might be a push for a rushed authorization of a COVID-19 vaccine in the U.S. President Trump needs a boost in the polls, and the nation is desperate for a vaccine. The EUA of convalescent plasma, and in particular the misrepresentation of data at FDA level, have fueled these concerns. Hahn published an op-ed on Aug. 5 saying that he and his agency will not approve a vaccine that is not safe and effective, though previously he had stated that the FDA would consider issuing an EUA for a COVID-19 vaccine. President Trump has hinted at the possibility of a COVID-19 vaccine being available before the election. Several reports suggest that the administration is currently considering fast-tracking a COVID-19 vaccine being developed in the U.K., potentially through an EUA issued by the FDA. Yet vaccine EUAs can be especially problematic. Because the threshold for an EUA is lower than for full regulatory approval, the FDA must make a risk-benefit assessment based on limited data whenever it uses the EUA pathway. Because of the nature of vaccines, many experts have argued that this pathway is too risky for vaccines. One reason that vaccine EUAs would be especially risky is that, unlike treatments for diseases, vaccines are normally administered to healthy people. This makes it much harder to demonstrate their efficacy. When a person is sick and takes a drug, investigators can tell within a fairly short time if the drug works. That is not the case with a preventative like a vaccine. Therefore, to make an informed decision about whether a vaccine is safe and effective, FDA regulators are likely to need significantly more data than an EUA would give them. Moreover, one of the leading COVID-19 vaccine candidates in the U.S. is an mRNA vaccine, a type of vaccine never before approved anywhere in the world. Using the EUA pathway on such previously untested and unproved technology would be risky. This is even more concerning in light of the FDA’s recent track record of issuing EUAs with little or no data and recasting test results as wholesome without proper support.Adhering to its standards FDA’s departure from frameworks, scientific parameters and expertise care is contrary to the public interest and breeds distrust that could last for years. Regulatory history shows that the FDA can be flexible in times of crisis without compromising its credibility and its mission to protect the public health. We believe its departures from its standards under political pressure justifiably raises red flags. To be true to its mission, the FDA must stick to its regulatory guns. Right now, that means resisting pressure to further depart from its standards in the approval of COVID-19 vaccines. Ana Santos Rutschman is an assistant law professor at Saint Louis University. Lisa Vertinsky is a law professor at Emory University in Atlanta. Yaniv Heled is an associate professor of law at Georgia State University in Atlanta. .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}