{"article": [{"url": "https://www.marketwatch.com/story/trump-seriously-considers-capital-gains-tax-cut-heres-how-he-could-do-it-2020-08-11", "published": 1597241000.0, "headline": "Trump 'seriously' considers a capital-gains tax cut - and here's how he could do it", "body": "Analysts pinned the stock market's gains early Tuesday in part on President Donald Trump saying at Monday night's news conference that his administration might reduce taxes on capital gains. How could that be done? \"An actual cut of the rate (currently 20%) would require the support of Congress, although an executive order allowing the indexing of capital gains to inflation might be a realizable objective,\" said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets, in a note. White House economic adviser Larry Kudlow has long been an advocate for the indexing of capital gains. That approach would have the Internal Revenue Service redefine capital gains to include only returns from the sale of assets in excess of inflation, according to a 2018 analysis from the left-leaning Urban-Brookings Tax Policy Center. The center's co-founder, Len Burman, argued that there are \"a host of problems with applying inflation indexing only to capital gains,\" including that it could be very complex, create opportunities for tax sheltering, add to the national debt and represent \"an extremely regressive tax cut.\" \"Past proposals to index capital gains for inflation would multiply the basis (or cost) of capital assets by a factor that represents the increase in the overall price level since purchase,\" Burman wrote. \"Capital gain would be defined as the difference between the sale price and the indexed basis. This exercise quickly gets complex with additions to basis through, for example, reinvested dividends or new investments in a business.\" CNBC host Jim Cramer was among those criticizing the possible cut late Monday, tweeting that \"it may be the time for rancor if we go for a capital-gains tax cut,\" because the rich \"do not need help,\" while the unemployed and small-business owners do need relief during the coronavirus crisis. \"We are looking very seriously at a capital-gains tax cut, and also an income tax cut for middle-income families,\" Trump said at Monday's news conference, claiming that a reduced taxation of capital gains would \"create a lot more jobs.\" \"We are looking at expanding the cuts that we have already done, but specifically for middle -income families, and you will be hearing about that in the upcoming few weeks,\" the president added. Related:Trump says his executive actions led to stock market's gain, as briefing gets interrupted by shooting Top Trump administration officials on Wednesday suggested Trump wouldn't rely on an executive order that would require the Treasury Department to index capital gains for inflation. That's after the president used an executive order and memorandums on Saturday after negotiations broke down over the next stage of legislated coronavirus relief. \"The president would like to do capital-gains tax cuts, and we do need legislation to do what we want on that front,\" Treasury Secretary Steven Mnuchin said in a Fox Business Network interview. \"I stand with the secretary on that,\" Kudlow said later Wednesday, when asked about Mnuchin's comment. \"We'd like to take it back to 15%, where it was for quite a long time because it helps jobs, investment, productivity and wages - plus-plus. But not through executive order,\" Kudlow told reporters. \"The structural changes to tax rates - I'm not a lawyer, but I will say I've been in this game a long time - likely require congressional legislation. I get that. So the president is looking at middle-class tax-rate reductions at the margin - that's incentive-minded tax policy, growth. The same for capital gains.\" The S&P 500 SPX, +0.87%  and Dow Jones Industrial Average DJIA, +0.56% on Tuesday gave up their morning gains to finish with losses, but they were trading higher on Wednesday."}]}