{"article": [{"url": "https://www.marketwatch.com/story/making-sense-of-the-new-july-15-deadline-for-filing-and-paying-your-taxes-2020-06-24", "published": 1594728920.0, "headline": "Making sense of the new July 15 deadline for filing - and paying  - your taxes", "body": "As a COVID-19 federal tax relief measure, the IRS postponed to July 15 many of the usual tax filing and payment deadlines and the deadlines for taking certain other tax-related actions. While this deadline relief is welcome, it has created confusion. We aim to dispel that confusion. Here goes. July 15 deadline for individual tax actions Assuming you use the calendar year for tax purposes (as almost all individual taxpayers do), July 15 is the revised deadline for the following actions. 1. Filing your 2019 personal federal income tax return (Form 1040). 2. Paying what you owe Uncle Sam with that return. If you don't pay up by July 15, the government will start charging interest on the shortfall at a current annual rate of 3% (the rate can change every quarter). You will also be charged a failure-to-pay penalty of 0.5% per month on the shortfall (up to a cumulative 25% of the shortfall). The interest charge and penalty go away as soon as you pay up. 3. Paying your first and second quarterly estimated federal income tax installments for the 2020 tax year. If you don't pay up by July 15, the government will start charging interest on the shortfall at a current annual rate of 3% (the rate can change every quarter). The interest charge goes away as soon as you pay up. 4. Making a traditional IRA or Roth IRA contribution for your 2019 tax year. 5. Making a Health Savings Account (HSA) contribution for your 2019 tax year. Reason: The revised July 15 deadline applies to federal income tax return filing deadlines (including any extensions), federal income tax payment deadlines, and IRA and HSA contribution deadlines that would otherwise fall on or after April 1 and before July 15. Therefore, the July 15 deadline applies to all of the aforementioned actions if you use the calendar year for federal income tax purposes, as do virtually all individual taxpayers. If you don't use the calendar year, ask your tax adviser if any COVID-19 deadline relief is available to you. July 15 deadline for individuals who own pass-through entities The revised July 15 deadline for federal income tax return filings and federal income tax payments that would otherwise be due on or after April 1 and before July 15 also greatly helps individuals who use the calendar year for federal income tax purposes and also own interests in pass-through entities. By that we mean sole proprietorships, single-member LLCs treated as sole proprietorships for tax purposes, partnerships, multi-member LLCs treated as partnerships for tax purposes, and S corporations. Example 1: Pass-through business owner Like almost all individuals with ownership stakes in pass-though business entities, you use the calendar year for tax purposes. The normal 4/15/20 deadline for filing your 2019 personal federal income tax return (Form 1040) is postponed to July 15. You can also defer paying any federal income tax (including any self-employment tax) that is still owed for your 2019 tax year until July 15. The normal payment deadline is 4/15. Finally, you can defer your first and second quarterly estimated federal income tax installments for the 2020 tax year until July 15. The normal deadlines for those payments are 4/15 and 6/15. All this relief is automatic. You don't need to submit anything to the IRS to take advantage, and you won't owe any interest or penalty if you do. Key point: If you are among the few individuals who do not use the calendar year for federal income tax purposes, consult your tax adviser for COVID-19 deadline relief that might be available to you. July 15 deadline for business entities July 15 is also the revised deadline for business entity federal income tax return filings that would otherwise be due on or after April 1 and before July 15 (including any extensions) and federal income tax payments that would otherwise be due on or after 4/1/20 and before 7/15/20. By business entity, we mean a C corporation, an S corporation, a partnership, or an LLC. Some business entities use non-calendar tax years that don't end on December 31 (fiscal years). The revised July 15 deadline can potentially apply to them too, for federal income tax return filings and federal income tax payments that would otherwise be due on or after 4/1/20 and before 7/15/20. Example 2: Calendar-year C corporation Your C corporation uses the calendar year for tax purposes. The normal deadline for filing your corporation's 2019 federal income tax return (Form 1120) is 4/15/20. That deadline is postponed to 7/15/20. The normal 4/15/20 deadline for paying any federal income tax that is owed for the corporation's 2019 tax year is also postponed to 7/15. Finally, the normal deadlines for making your corporation's first and second quarterly estimated federal income tax installments for the 2020 tax year are 4/15 and 6/15. Both deadlines are postponed to 7/15. All this relief is automatic. You don't need to submit anything to the IRS to take advantage, and your corporation won't owe any interest or penalty if you do. Example 3: Fiscal-year C corporation Your C corporation uses an 8/31 tax yearend, because its business is seasonal. The original due date for the corporation's federal income tax return (Form 1120) for the tax year that ended on 8/31/19 was 12/15/19, but you extended the due date to 5/15/20. Since that date is on or after 4/1 and before 7/15, the filing deadline for your corporation's federal income tax return is postponed to 7/15. This relief is automatic. You don't need to submit anything to the IRS to take advantage, and your corporation won't owe any penalty if you do. Extending federal income tax returns past July 15 As this was written, the normal procedures must be followed to extend federal income tax return filing deadlines past July 15. For example, your 2019 Form 1040 can be extended to October 15 by filing Form 4868 with the IRS by July 15. Federal income tax returns of business entities can be extended past July 15, if a further extension is allowed, by filing Form 7004 with the IRS by July 15. Warning: Extending a return past July 15 does not extend the due date for paying any tax that will be shown as due with that return, when it is eventually filed. Same July 15 deadline for many other federal tax filings and payments The IRS has granted the same July 15 deadline relief for many other federal tax return filings and payments that would otherwise be due on or after 4/1/20 and before 7/15/20. For example, the July 15 deadline potentially applies to the following. * Federal income tax returns for trusts and estates (Form 1041) and federal income tax payments owed by trusts and estates. * Federal estate tax returns (Form 706) and federal estate tax payments owed by estates. * Federal gift tax returns (Form 709) and federal gift tax payments owed by gift givers. * Quarterly estimated federal income tax payments due with various IRS forms. This relief is automatic. You don't need to submit anything with the IRS to take advantage, and there is no penalty if you do. Key Point: The preceding is not even close to the complete list of federal tax filings and federal tax payments that can be postponed to July 15. Your tax adviser can provide full details. The last word Will there be additional deadline relief? It's possible, but right now I would bet not. If I'm wrong, we will get back to you. Stay tuned."}]}