{"article": [{"url": "https://www.marketwatch.com/story/spanish-government-orders-a-heavily-infected-madrid-to-shut-down-11601567355", "published": 1601554400.0, "headline": "Spanish government orders a heavily infected Madrid to shut down", "body": "Pedestrians walk across a mostly empty Sol Plaza in the center of the Spanish capital of Madrid on September 30, 2020. MarketWatch/Kollmeyer Spain’s central government ran out of patience with heavily coronavirus-infected regions such as Madrid on Thursday, ordering fresh lockdowns to bring soaring coronavirus cases under control. After weeks of bickering between the central and regional governments, the Madrid region has been given 48 hours to comply with new restrictions. That is as Madrid premier Isabel Díaz Ayuso signaled that she will fight the central government, arguing that extended confinements will further heavily damage the economy, and aren’t legal. “Madrid believes in the law, complies with the law and will always comply with the law. For that reason we will head to the courts,” said Ayuso on Thursday in the parliament. iframe.twitter-tweet { width: 100% !important; } In a desperate bid to bring down cases and ease the growing strain on hospitals, Madrid’s regional government imposed selective restrictions on around 45 districts for two weeks, where cases reached 1,000 per 100,000 inhabitants over 14 days. Those were mostly working-class neighborhoods surrounding the capital city’s center, and the move triggered protests and outrage as the wealthier had no such restrictions. Protests have broken out in the capital city, where critics have accused the government of punishing its poorer residents, who are crammed together in smaller spaces, mostly can’t work from home, and are forced to use crowded public transportation. The restrictions have even divided some working-class neighborhoods at times, with one side of the street restricted and the other open for business as usual. Read: European governments grapple with lockdown fatigue and rising protests against new coronavirus restrictions The new rules will now require lockdowns in areas that have 500 cases per 100,000 inhabitants in the last 14 days, in any district of Spain. The rules prohibit movement between districts except for work and school purposes, and gatherings of more than six people indoors or outdoors. All commercial establishments must close by 11 p.m., with bars and restaurants allowed to operate at 50% capacity. As of Sept. 30, the Madrid region had a 14-day COVID-19 infection rate of 735 per 100,000 residents, far higher than any other region in the country, with over 48,000 new cases diagnosed in the last 14 days, according to Health Department data. The capital city of Madrid would theoretically fall under this new rule. In a statement released on Thursday, the Spanish health ministry reported that COVID-19 cases in the country over the last week exceeded 250 per 100,000 inhabitants generally. While infections vary between regions – between 107 and 784 cases per 100,000 – they remain above what the European Union deems risky. Brussels advises restricted movement between countries when cases rise above 50 per 100,000. It took Spain’s central government months to bring a deadly first wave of the pandemic under control, and it resorted to a state of emergency and a one of the strictest lockdowns in the world. That outbreak, also with an epicenter in Madrid, left nearly 30,000 dead (the current death toll stands at 31,171 according to Johns Hopkins University), and Spain has one of the highest death tolls in Europe, behind the U.K., Italy and France. Critics inside and outside the country say the central government eased up on restrictions too soon, passing control to unprepared regional authorities , such as in Madrid. In Parliament on Thursday, Pablo Gómez Perpinyà, a lawmaker in the central-left Mas Madrid party, accused Ayusa of ignoring the advice from scientists and health-care officials for stronger actions. Rattling off the government’s mistakes, he invoked the 1986 nuclear disaster in Ukraine, mentioning the massive Sol Plaza that sits at the heart of the city of Madrid’s busy shopping district. “Puerta del Sol is the Chernobyl of Europe,” said Perpinyà. Read: Boris Johnson rails against calls to let the virus ‘take its course,’ warning the U.K. is at a ‘critical moment’"}]}