{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-plunged-to-its-lowest-in-234-years-says-deutsche-bank-11596214464", "published": 1596283640.0, "headline": "10-year Treasury yield plunged to its lowest in 234 years, says Deutsche Bank", "body": "Photo by RADEK MICA/AFP via Getty Images The slide in the U.S. bond market’s benchmark yield is one for the history books. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell as low as 0.520% in overnight trading on early Friday, matching levels last seen in March 9 when the benchmark maturity rate to an all-time low after worries about the COVID-19 pandemic sent investors scurrying into safe haven assets. According to Deutsche Bank, this record low stretches farther back than most might expect. They calculated the current nadir in the 10-year yield went back 234 years, based on data spliced together from the various times the U.S. government has borrowed money in the past. “The U.S. has been through depressions, deflations, wars, restrictive gold standard regimes, market crashes and many other major events and never before have we seen yields so low back to when the Founding Fathers formed the country,” said Jim Reid, Deutsche Bank’s chief credit strategist, in a Friday note. The relentless slide in the 10-year note reflects how the bond market’s bull run has defied prognostications by pundits that interest rates and yields would eventually rise, as the economy grew before the pandemic or on potential inflation caused by the Federal Reserve’s money printing this year. But years of steady economic growth and low inflation have pushed the Federal Reserve’s benchmark fed funds interest rate progressively lower, leaving less room for the central bank to ease monetary policy further. As the Fed’s policy interest rate fell after economic downturns in 2008 and in 2020, the central bank has been forced to adopt other unconventional monetary policy tools such as outright bond purchases to support economic growth. Ultra-low bond yields point to trepidation over the U.S. economy’s health as the tally of coronavirus infections marches higher in many American states. By contrast Wall Street stocks have shrugged off the economic devastation and pinned their hopes on a free-spending government and an accommodative central bank. Read: Dr. Osterholm: Americans will be living with the coronavirus for decades Reid noted the S&P 500 index SPX, +0.87% was trading up more than 18% since March 9, while the yield compensation offered for sub-investment grade corporate bonds HYG, +0.22% had also narrowed 150 basis points over the same stretch, reflecting the sharp recovery in prices of so-called risky assets."}]}