{"article": [{"url": "https://www.marketwatch.com/story/this-man-earns-21-000-a-year-and-owes-24-000-in-student-debt-and-after-his-for-profit-college-closed-why-was-no-one-held-accountable-11601987085", "published": 1602147140.0, "headline": "This man earns $21,000 a year and owes $24,000 in student debt after his college closed. Why wasn't anyone held accountable?", "body": "RJ Infusino is still paying down the student debt he took on to attend a college that collapsed. When RJ Infusino enrolled at the Illinois Institute of Art's Schaumburg campus in 2015 after graduating high school, he thought he was starting on the path to a career in audio production.  Even when his experience wasn't quite what he expected - the campus consisted of a few floors in an office park, instructors would sometimes show up extremely late to class - Infusino pressed on, thinking he could at least use the experience and equipment to learn skills that would help him land a job. And the school was promising to help set him up for a career. Then one day in 2017, with less than a year left to graduate, officials announced that the school had been sold to an organization Infusino had never heard of. \"At the time, I'm crazy stressed, trying to look at jobs, trying to look at things going forward,\" Infusino, 24, recalled. What he didn't know was that the sale of the for-profit Art Institute's campus to the Dream Center Foundation, a Los Angeles-based religious nonprofit with no experience in higher education, had cost the school its accreditation. That meant that any credits Infusino earned during the period the accreditation was in limbo would be difficult to transfer. Six months after the school lost accreditation, all students, including Infusino, learned for the first time that the school was not accredited and that it would close, according to court documents. To Infusino, who needed just three more quarters of classes to earn his degree, the school's shutdown was abrupt. But court documents allege that the school's executives knew for months that it was in financial trouble and would likely need to close. Infusino continued his education at one of the few institutions where his credits would transfer, another for-profit college based in Florida, where he studied online. But the Art Institute's shutdown set him back nearly a year in pursuit of his bachelor's degree, spitting him out into the job market just as COVID-19-related shutdown orders were taking effect. He still owes roughly $24,000 in student loans and is working as a gymnastics coach, a job he held while he was in school. \"I only make roughly $21,000 a year,\" he said. \"How am I supposed to pay all that off and pay all my other bills on top of that? It's insane.\" Meanwhile, the executives who allegedly knew of the school's accreditation challenges haven't faced any financial consequences, even though the U.S. Department of Education has the authority to hold them accountable, a new report from the Student Legal Defense Network argues. In addition, Congressional Democrats have alleged that officials at the Department of Education took \"extraordinary measures\" that allowed Dream Center to continue to receive federal financial-aid funds during the period when its accreditation was in limbo. Now, Dream Center Educational Holdings, the organization Dream Center formed to buy Art Institutes and other colleges is in receivership, a status similar to bankruptcy. \"It's just absolute garbage how easily they can take advantage of someone like me who genuinely wants to work hard at developing a career in the industry that he's interested in,\" Infusino said.  Attorneys for Dream Center Educational Holdings didn't immediately respond to a request for comment. The Department of Education didn't immediately provide a comment.The feds have had the authority to hold executives accountable since 1992, a new report argues Attorneys from the National Student Legal Defense Network, an organization representing students in lawsuits surrounding the collapse of Dream Center Education Holdings' schools, argue the government has the tools to hold such executives accountable. In a report released Monday , the attorneys write that the Department of Education has had this authority since 1992, but the agency, under presidents of both parties, hasn't used it successfully. The paper is part of a set of proposals from Student Defense that the organization says a new Department of Education could tackle in its first 100 days. When schools collapse amid wrongdoing, it can be costly to the government. For one, federal student-loan borrowers are entitled to be made whole in these cases. In addition, students who are attending the school at or near the time of closure have the right to have their federal student loans discharged. In the report, the attorneys argue that the owners and executives of these schools can be held personally liable for those lost funds. When \"you look at what the extent of the liabilities are that taxpayers have the burden of now,\" related to for-profit college closures, \"billions of dollars have gone out the door and those dollars are not recovered,\" said Dan Zibel, one of the authors of the paper and the vice president and chief counsel at Student Defense. \"Congress, in the early 1990s was very clear in adding these personal liability provisions for this exact reason that when schools close or otherwise fail to meet that responsibility to students, the owners are left to profit and taxpayers and students are left to pay the bill,\" he said. The idea laid out in the National Student Legal Defense Network's report appears to have bipartisan support among voters. When asked as part of a poll commissioned by Student Defense whether the Department of Education should hold executives personally liable for wrongdoing, 78% of 3,199 of likely voters in swing states said they agreed or strongly agreed with the proposal. The idea also has backing from a prominent lawmaker. In a statement released with the paper, Senator Elizabeth Warren, a Massachusetts Democrat, criticized the role of \"predatory for-profit colleges\" whose executives and owners \"got filthy rich off of taxpayer dollars with zero accountability,\" in the nation's more than $1.5 trillion student loan problem. \"We need a Department of Education that will end this boondoggle, protect students, cancel fraudulent student debt, and, as Student Defense's report shows, use every tool available to hold college executives and owners who defraud students personally accountable,\" Warren wrote in the statement. 'History clearly repeats itself' The report notes that as part of the reauthorization of the Higher Education Act in 1992, Congress granted the Department of Education the authority to recover financial losses from individuals who \"exercise substantial control over [an] institution.\" The provision came in the wake of an investigation and hearings, led by then-Georgia Senator Sam Nunn, a Democrat, on fraud and abuses in federal financial aid. The investigation uncovered evidence of colleges with robust recruiting operations and little educational infrastructure in some cases targeting homeless shelters to lure prospective students - echoes of some of the accusations leveled against for-profit colleges today. \"History clearly repeats itself,\" Zibel said.  Over the past several years, multiple large for-profit college chains have collapsed, including most prominently Corinthian Colleges and ITT Technical Institutes, costing taxpayers at least hundreds of millions of dollars, but the Department of Education hasn't held their executives liable. Zibel admits that when he was at the agency, working as the deputy assistant general counsel for postsecondary education, they didn't take that step. \"We've seen the liabilities grow as student debt has grown and as costs have grown,\" Zibel said. \"It seems like the Department needs to take a new look at this.\" The agency has used its authority to try to collect from schools themselves in cases of abrupt closure amid fraud. But if a school disappears before the feds get their money, the liability still exists. Holding executives personally responsible for those losses could be a way to recover those funds, the report argues. (The agency does have the authority to hold executives and owners responsible even when the school they operated still exists, the paper argues). The Department of Justice has the ability to take the owners to court. In addition, the government, through the Treasury Department, uses extraordinary collection powers, including garnishing Social Security benefits, tax refunds and wages, to collect when a borrower defaults on a student loan. \"These same tools could be equally at play,\" in the case of former college owners or executives, Zibel said. Other federal agencies have settled with college executives over alleged harm to investors Other government agencies have taken steps to hold for-profit college executives accountable. The leaders of Corinthian and ITT settled with the Securities and Exchange Commission over accusations they misled investors. “ 'Those are for harms that they caused to investors. There's not a clear connection to protecting students and students are suffering here.' ” - Dan Zibel, vice president and chief counsel at Student Defense. \"Those are for harms that they caused to investors,\" Zibel said. \"There's not a clear connection to protecting students and students are suffering here. They've caused harm to students.\" Infusino said he hates thinking about the way he was targeted and taken advantage of by his former school, but continues to share his experience - whether as part of lawsuits, in front of lawmakers or in the media - in hopes that he can help prevent similar situations from happening in the future. \"I coach kids, I don't want them to grow up in a world where this can happen to them,\" he said. \"I want them to go to school and not think about whether or not they're being swindled.\""}]}