{"article": [{"url": "https://www.marketwatch.com/story/salesforce-stock-surges-more-than-25-for-best-day-ever-on-blow-out-quarter-2020-08-26", "published": 1598461160.0, "headline": "Salesforce stock closes up more than 25% for best day ever after 'blow-out' quarter", "body": "Salesforce.com Inc. stock on Wednesday logged its best one-day performance ever after the cloud-based customer relationship-management company celebrated several firsts and records, against the backdrop of the worst global pandemic in a century. Salesforce CRM, +2.21% CRM, +2.21% shares closed up 26% at a record $272.32 Wednesday, following an intraday record of $277.97, after the San Francisco-based company blew away Wall Street estimates on both quarterly results and its outlook as more businesses seek to hold onto their customers through digital means. That topped the stock's previous best one-day performance on Nov. 24, 2008, when shares gained 19% to close at $6.65. At last check, more than 62 million shares traded hands, compared with the stock's 52-week daily average of 5.9 million shares. Of the 42 analysts who cover Salesforce, 38 have buy or overweight ratings, three have hold ratings, and one has a sell rating. Of those, 27 analysts hiked their price targets for an average $259.63, up from an average target price of $212.81 before earnings, according to FactSet data. Prior to that, at least nine analysts had hiked their price targets on the stock ahead of earnings. On Tuesday's conference call, Chief Executive Marc Benioff said it was \"humbling\" and \"bittersweet\" that the company produced record results, topping $5 billion in quarterly sales for the first time, amid the difficulties and tragedies created by the COVID-19 pandemic as businesses need to adapt and connect digitally with their customers. \"We all want to get back to how things were, but the reality is that's never going to happen,\" said Benioff on Tuesday's call. \"We're in a new world. We're in an all-digital world, with the work digitally, we're living digitally, we're educating digitally.\" Read:After Dow inclusion news, Salesforce stock soars on reveal of first $5 billion quarter While that world is providing some sort of connection that would have never been possible 20 years ago, Benioff even admitted that the isolation of the pandemic was taking its toll, with a third of Salesforce's 54,000 now-work-at-home employees reporting some sort of mental-health issue. Cowen analyst J. Derrick Wood, who has an outperform rating and raised his price target to $270, called the second quarter a \"blow-out.\" Wood said management \"seemed to carry a new level of confidence w/ a sizable bump in guidance, commentary that new business growth is normalizing & discussion on how CRM is being nimble to adapt to conditions.\" On Tuesday, Salesforce raised its annual earnings guidance to $3.72 to $3.74 a share, up from a previous range of $2.93 to $2.95 a share, and to a range of $20.7 billion to $20.8 billion, up from a previous $20 billion, for revenue. Analysts, which had expected earnings of $2.97 a share on revenue of $20.01 billion, responded and raised their targets to an average $3.58 a share on revenue of $20.7 billion. Wedbush analyst Dan Ives, who has an outperform rating and hiked his price target to $300, called the quarter a \"masterpiece.\" Ives said Salesforce's \"better-than-expected results across the board signall[ed] a key pivot in enterprise spending, which should have broader implications across the software sector.\" Other investors thought so too, as many cloud-computing stocks joined in on the Salesforce rally, as the First Trust Cloud Computing ETF SKYY, +1.78%  gained 3.4% and the iShares Expanded Tech-Software Sector ETF IGV, +1.85%  rallied 5.1%. Standouts included Adobe Inc. ADBE, +2.30%  up 9.1%, ServiceNow Inc. NOW, +2.43%  up 6.5%, WorkDay Inc. WDAY, +0.75%  up 10.1%, Atlassian Corp. TEAM, +5.33%  up 6%, Twilio Inc. TWLO, +2.38%  up 6.2%, Splunk Inc. SPLK, +1.61%  up 6.4%, ZenDesk Inc. ZEN, +2.81%  up 6%, Coupa Software Inc. COUP, +4.45%  up 10% and Okta Inc. OKTA, -0.47%  up 7%. \"Taking a step back, CRM has been one of the most successful technology vendors in the world over the past decade, but it appears the company is finding a new gear of growth as we believe flawless execution and a cloud accelerated COVID backdrop is putting further tailwinds in its deal momentum,\" Wedbush's Ives said. Jefferies analyst Brent Thill, who has a buy rating and hiked his price target to $285, called Salesforce's Tuesday report a \"monster beat and raise.\" Thill said Salesforce's accelerating billings growth showed that the company's product pipelines were actually improving amid the pandemic. Thill said \"we believe based on our calls with experts in the field that cloud adoption will accelerate coming out of COVID-19, which should act as a LT tailwind boosting growth for CRM.\" Analysts also were struck by Salesforce's record improvement on operating margin, to 20% for the quarter. Salesforce's stock was already gaining momentum before its earnings report. Less than 24 hours before the report, S&P Dow Jones Indices said the stock would replace Exxon Mobil Corp. XOM, -1.47%  on the Dow Jones Industrial Average DJIA, +0.56%  at the end of the month. Read:Salesforce's nearly 30% stock rally this week is a possible 'nightmare' scenario for the Dow committee Salesforce shares are up 67% for the year, while the SKYY index is up 36% and the IGV index is up 39%. That's compared with a 7.7% rise in the S&P 500 index SPX, +0.87%, and a 30% gain by the tech-heavy Nasdaq Composite Index COMP, +1.39%. For the year, the Dow is still down 0.7%."}]}