{"article": [{"url": "https://www.marketwatch.com/story/ge-post-2-billion-loss-as-jet-engine-orders-sink-2020-07-29", "published": 1596015980.0, "headline": "GE post $2 billion loss as jet engine orders sink", "body": "General Electric Co. posted a roughly $2 billion quarterly loss as revenue tumbled 24%, hurt by a steep decline in a jet-engine business that has been hobbled by the coronavirus pandemic. The aviation business, once a profit engine for GE, swung to a loss in the June quarter as both revenue and orders plunged. The unit produces engines for Boeing Co. and Airbus SE planes but has had to cut production and jobs as airlines delay orders. On Wednesday, Boeing said it would cut further production of commercial jets. GE reported it burned through less cash in the June quarter than it had previously warned. The company reported adjusted negative cash flow from industrial operations of $2.1 billion, compared with its projection of negative $3.5 billion to $4.5 billion in May. Analysts were expecting negative cash flow of $3.29 billion, according to FactSet. \"We're working through a still-difficult Covid-19 environment,\" said CEO Larry Culp, adding that he still expected a prolonged recovery for the commercial-aviation business. \"Still, based on what we see today and the actions we've taken, sequential improvement in earnings and cash in the second half of the year is achievable.\" GE also said it expects a return to positive cash flow in 2021. The measure is closely watched by investors after troubles in generating cash forced the company to slash its dividend and sell off business units. In May, it sold off its century-old GE Lighting unit, its last link to consumers. In an interview, Mr. Culp said there was improvement over the months of the quarter, citing an upturn in airplane departures and increased use of GE's health-care scanning equipment. He said the company's manufacturing facilities and service groups have returned to \"nearly full capacity\" since early in the quarter. But uncertainty about the broader economy and the pandemic remains. \"Covid, in terms of the data, trends and how governments and the public will react as we get into the fall is the wild card for most every company out there,\" he said. The conglomerate has been revamping itself under Mr. Culp with a focus on cutting debt and generating more cash but has been hit hard by the coronavirus crisis, leading it to pull its full-year financial outlook in April. GE is on track to cut more than $2 billion in costs in 2020, and Mr. Culp wouldn't rule out additional job losses. \"We want to be realistic that this is an incredibly challenging environment,\" he said. \"That was true in the second quarter and it will be true as we move forward, so we are going to continue to look for opportunities to reduce costs and preserve cash.\" On Wednesday, GE said it planned to sell its remaining stake in oil-and-gas company Baker Hughes over three years. GE said it has cut its debt by $9.1 billion this year and had $41 billion in cash at the end of June. Profits and sales declined from a year ago across GE's main operating units. Revenue fell 44% at the aviation unit, 3% in renewable energy and 11% in its power segment, which makes turbines for power plants. All three posted operating losses. Revenue fell 21% in its health-care unit, which makes hospital equipment and was the only industrial unit to generate an operating profit. Overall, GE posted a net loss attributable to common shareholders of $2.18 billion, compared with a loss of $61 million a year ago. Revenue was $17.75 billion. The year-ago results include GE's biopharma business, which it sold earlier this year, and its former controlling stake in Baker Hughes. GE booked more than $2.3 billion in charges in the latest quarter, writing down the value of several assets, including its industrial 3-D printing business, its GE Capital jet-leasing business and some long-term service contracts. The charges were partly offset by investment gains on its Baker Hughes stake. Excluding items, GE reported an adjusted loss of 15 cents a share, compared with Wall Street's estimate of a 10-cent-a-share loss. The aviation business was GE's biggest and most profitable in recent years as it benefited from a booming aerospace market and investments, including the launch of GE's most advanced engine to power Boeing Co.'s MAX jet. But with the MAX grounded and airlines canceling flights, GE said quarterly orders for new equipment fell 41% and for services fell 67% from a year ago. American Airlines Group Inc. and Southwest Airlines Co. this month said they were tempering expectations for an air-travel recovery, as the pandemic surges in parts of the U.S. GE, which started the year with about 205,000 workers, has already announced plans to cut a quarter of its aviation unit, which had 52,000 employees. The company said it cut 5,400 aviation workers in the quarter. GE shares were little changed in premarket trading Wednesday, up 11 cents to $7.01. Since the start of the year, the shares had fallen about 40%. The stock tumbled in 2017 and 2018 after GE disclosed deep problems in its power unit and capital arm that forced it to slash its dividend and sell off business. GE hired Mr. Culp as CEO in October 2018 and he had made progress in streamlining operations before the pandemic hit. Write to Thomas Gryta at thomas.gryta@wsj.com"}]}