{"article": [{"url": "https://www.marketwatch.com/story/global-gold-demand-posts-decline-in-first-half-of-2020-even-as-etf-inflows-hit-a-record-2020-07-30", "published": 1596067700.0, "headline": "Global gold demand posts decline in first half of 2020, even as ETF inflows hit a record", "body": "Global gold demand declined in the second quarter and first half of this year overall, but demand for gold as an investment climbed to a record as exchange-traded-fund holdings reached an all-time high by the end of June, according to a report from the World Gold Council published Thursday. Total global gold demand, which includes the metal for use in investment, jewelry, technology and in central-bank purchases, fell 11% year-on-year in the second quarter, at 1,015.7 metric tons, pulling demand for the first half of the year down by 6% to 2,076 metric tons. The COVID-19 pandemic was the main influence on the gold market in the second quarter, “severely curtailing consumer demand, while providing support for investment,” the report said. In the first six months of this year, total investment demand for gold, which includes gold-backed ETFs and bars and coins, reached an all-time high of 1,130.7 metric tons, with record value of $60 billion. “The global response to the pandemic by central banks and governments, in the form of rate cuts and massive liquidity injections,” fueled record flows of 734 metric tons into gold-backed ETFs for the first half of the year to a new record high of 3,621 metric tons, the report said. The inflow helped lift gold prices by 17% in U.S. dollar terms for the period. In contrast, however, bar and coin investment in the first six months of the year fell to the lowest in 11 years, down by 17% year-on-year at 396.7 metric tons. “Many countries remained under lockdown restrictions in Q2,” the World Gold Council said. “This took its toll on bar and coin demand, even as the gold price rallied, reaching successive eight-year highs in U.S. dollar terms and breaking new records in many other currencies.” Gold futures on Wednesday settled at $1,953.40 an ounce, the highest finish for a most-active contract on record. The report noted a divergence in investor behavior between the East and the West, with a “profit-taking motive” dominating sentiment in the East, particularly in Asia and the Middle East, but “safe-haven buying and momentum investment” taking center stage in Western markets, such as Europe and North America, where bar and coin demand saw “substantial growth.” Demand for jewelry in the second quarter, however, fell 53% year-on-year to a record quarterly low of 251 metric tons, pulling first-half demand down by 46% to 572 metric tons. China’s jewelry demand in the first half fell 52% year-on-year to 152.2 metric tons, with the World Gold Council citing COVID-19’s “lasting impact on consumer wallets.” “Consumers across the globe felt the impact of market lockdown and the resultant economic slowdown,” the report said. China, which was the earliest market to emerge from the lockdown, was the only one to see a recovery from “extreme Q1 weakness.” Also for the first half of 2020, gold used in technology dropped 13% to 139.9 metric tons. Meanwhile, net purchases by central banks totaled 233 metric tons, down 39% year-on-year for the six-month period. Meanwhile, total global gold supply fell 6% the first half of this year to 2,192 metric tons, because of the “strict coronavirus lockdowns in key mining nations,” the World Gold Council said."}]}