{"article": [{"url": "https://www.marketwatch.com/story/netflix-in-the-age-of-covid-19-streaming-pioneer-may-have-new-edge-on-competition-2020-04-07", "published": 1594884740.0, "headline": "Netflix pulled off a showstopper early in the pandemic, but will the sequel deserve the price?", "body": "This article is part of a series tracking the effects of the COVID-19 pandemic on major companies, and will be updated. It was originally published April 7. If the coronavirus pandemic has proved anything, it is Americans’ insatiable appetite for Netflix Inc. Viewership of the streaming service has soared since shelter-in-place orders swept the country in March. In April, Netflix NFLX, +1.43% reported the addition of a record 15.77 million paid subscribers globally in the first quarter — double the new subscribers it expected — propelling its stock price more than 65% higher. Read more: Netflix has biggest quarter with nearly 16 million new subscribers signing on The seismic shift to streaming from viewers who had held on to cable bundles empathetically validated the yearslong prophesy of Netflix Chief Executive Reed Hastings. To add an exclamation to his point, Walt Disney Co. DIS, +1.53% later reported that Disney+ attracted 54.5 million paid subscribers in just six months, and may have headed much higher after the triumphant debut of “Hamilton” on that service July 3. The runaway success of streaming services during the pandemic leads to the invariable entertainment-tinged question: What does Netflix do for a sequel? How about more record closing stock prices and yet another blockbuster quarter of new subscribers when the company reports second-quarter results on July 16? The stock, currently trading at record prices of almost $550 a share, could soar to $670 based on a blowout quarter, according to Goldman Sachs analysts, whose previous target price was $540. They also expect Netflix to report 12.5 million net subscriber additions in the second quarter. At least one other analyst expects a smashing repeat of the first quarter. Stifel Nicolaus analyst Scott Devitt, one of Netflix’s more bullish analysts on Wall Street, predicts the addition of 10.1 million new paid subscribers in the quarter; analysts polled by FactSet, by comparison, predict 8.22 million — although that number has climbed in recent days. On Thursday, J.P. Morgan analyst Doug Anmuth lifted his projection to 8.5 million from 7.4 million. Netflix predicted 7.5 million when it reported first-quarter earnings in April. Netflix’s enduring strength is a reflection not just of its popularity and broad slate of programming – it recently announced a dramatic series on Colin Kaepernick’s high school years and a reboot of the 1980s hit docuseries “Unsolved Mysteries” among a flood of original programming in July – but the residue of COVID-19, which has accelerated many pre-existing secular trends, including the shift away from linear TV toward on-demand viewing, say analysts. Read more: Here’s everything coming to Netflix in July 2020 — and what’s leaving Netflix leads a pack of media heavyweights that include Disney, Apple Inc.’s AAPL, +1.74% Apple TV+, Amazon.com Inc.’s AMZN, +3.01% Prime Video, AT&T Inc.’s T, -1.01% HBO Max, and Comcast Corp.’s CMCSA, -0.99% Peacock. One advantage it enjoys is fierce loyalty among customers, according to a poll cited by Cowen. Those who said they are willing to pay more for Netflix rose from 47% in December to 55% in May. Of those who watch Netflix more than seven hours a week, 60% said they were willing to pay more in May, compared with 52% in December. Netflix also was the first to begin mass-producing original content specifically for streaming, and had a massive pipeline of content it had already filmed when the pandemic shut down production. “Our 2020 slate of series and films are largely shot,” Ted Sarandos, Netflix’s chief content officer, told analysts during the company’s first-quarter earnings call. “[We] are in postproduction stages in locations all over the world. And we’re actually pretty deep into our 2021 slate. We don’t anticipate moving the schedule around much, and certainly not in 2020.” That gives the company quite a head start on its younger rivals in streaming, with other advantages that were already built in. “Its 2020 content release schedule won’t be significantly impacted, it isn’t reliant on sports, live events or advertising. It also doesn’t have to play a delicate balancing act between selling content to legacy partners or putting content on a new streaming service,” eMarketer analyst Eric Haggstrom said. “Netflix will weather this crisis better than almost everyone else in the media industry.”The financial effects Revenue: Analysts on average expect Netflix to report $6.08 billion in second-quarter revenue, according to FactSet, up slightly from $5.96 billion expected at the end of 2019. Paid net additions of subscribers, a key indicator of Netflix’s sales, are projected at 8.22 million, roughly double what was expected earlier this year and ahead of the company’s own projection of 7.5 million. Earnings. Average analyst expectations from FactSet are for earnings of $1.82 a share, up from $1.48 a share at the beginning of the year. Stock movement. Through Wednesday, shares are up 62% in 2020, with most of the gains coming since mid-March and the cancellation of nearly all live-entertainment events because of COVID-19. At a market value of $226.5 billion, Netflix passed Verizon Communications Inc. VZ, +0.23% on Thursday, and AT&T for the first time on July 1. Netflix’s value is more than that of Disney and Comcast. What the company is saying June 30: Citing “centurieslong financial gap between Black and white families” in the U.S., Netflix said it plans to put 2% of its cash holdings, or up to $100 million initially, toward financial institutions and other groups “that directly support Black communities in the U.S.” See also: Netflix launches $100 million commitment to help close ‘centurieslong financial gap between Black and white families’ April 21: Netflix wowed Wall Street with its biggest quarter and a record number of new paid subscribers, nearly 16 million. Revenue grew to $5.77 billion from $4.52 billion in the year-ago period. The news sent Netflix shares soaring 9% in extended trading. In a video interview following the first-quarter results, Hastings referred to the quarter as a “pull-forward” for the rest of the fiscal year before paid net paid subscriptions cool the next few quarters. The company’s chief product officer, Greg Peters, quickly ruled out price increases in the foreseeable future.What analysts are saying • A survey of 1,500 Netflix customers shows their engagement has increased “significantly” since the COVID-19 outbreak. The percentage of subscribers in the U.S. viewing the service for more than 10 hours a week has soared to 38% from 16% pre-COVID-19. — Jefferies analyst Alex Giaimo, maintaining a buy rating and price target of $520, on July 10. • Stifel raised its paid net paid subscription additions for the second quarter to 10.1 million, based on continued momentum. But it continues to struggle with the risk/reward profile in the second half of the year amid pull-forward concern. — Stifel Nicolaus analyst Scott Devitt, on maintaining a hold rating, and raising Netflix’s price target to $500 from $460, on July 8. • “NFLX shares are up ~35% YTD alongside a pandemic surge, following a monster 1Q in which the company added more than twice their guide in paid net adds. With many consumers continuing to stay home and limiting outdoor social activities amid uneven reopenings, Netflix engagement has likely remained high. We view engagement, as well as positive 2Q20 survey data from our proprietary internet tracker, as positive for net adds. — Cowen analyst John Blackledge, on maintaining an outperform rating, and raising Netflix’s price target to $535 from $485, on June 30. • “We believe that Netflix has achieved a level of sustainable scale, growth, and profitability that isn’t currently reflected in its stock price… This conclusion is based on our assessment of Netflix’s 60+ million U.S. Subscriber and 100+ million International Subscriber bases, which makes Netflix one of the largest global Entertainment subscription businesses. We also view Netflix as one of the best derivatives off the strong growth in online video viewing and in internetconnected devices.” — RBC Capital Markets analyst Mark Mahaney, maintaining an outperform rating, and price target of $500, on June 8."}]}