{"article": [{"url": "https://www.marketwatch.com/story/the-fed-is-fighting-the-last-battle-and-here-are-the-risks-to-its-new-strategy-11600252450", "published": 1600246100.0, "headline": "The Fed is â\u0080\u0098fighting the last battle,â\u0080\u0099 and here are the risks to its new strategy", "body": "Federal Reserve Chairman Jerome Powell is reflected in the sneeze guard set up between himself and members of the House Committee as he appears before the House Financial Services Committee hearing on Capitol Hill on June 30, 2020, in Washington, D.C. POOL/AFP via Getty Images The Federal Reserve is announcing its latest interest-rate decision on Wednesday, and expectations arenâ\u0080\u0099t for a big shift at this meeting. More on that later. Still the big issue in the world of central banking is last monthâ\u0080\u0099s official pivot to average inflation targeting. That is, the Fed is saying inflation will be allowed to run over 2% if â\u0080\u0094 as it has â\u0080\u0094 price growth has been under that target for a significant period. Now the Fed didnâ\u0080\u0099t really explain how it would implement this new strategy in practice. Tim Duy, the University of Oregon professor who writes the Fed Watch blog, says the benefit of that new shift comes when the economy is running faster than expected. â\u0080\u009cItâ\u0080\u0099s particularly important in the context of a recovery that appears more rapid than anticipated. Along with the more rapid recovery is a faster pace of inflation,â\u0080\u009d he says. Already, the price level is looking to be returning to its pre-COVID trend. But the market, thanks to the Fedâ\u0080\u0099s new guidance, isnâ\u0080\u0099t shifting its expectations on interest rates. â\u0080\u009cNow we are thinking that there is nothing in the data to prompt a more hawkish reaction from the Fed,â\u0080\u009d says Duy. â\u0080\u009cThe Fed is content to allow real interest rates to continue to drop and presumably content to allow them to fall even a notch further than the last cycle.â\u0080\u009d There is a risk in this strategy. â\u0080\u009cThe Fed is committed to fighting the last battle, the long, slow recovery experienced in the wake of the Great Recession [2007-09 recession]. The Fed is absolutely unprepared for any outcomes on the right-hand side of the distribution. That opens up the risk that the Fed finds itself pivoting in 12 months or sooner,â\u0080\u009d says Duy. Another risk is the increased importance put on financial stability in the strategy change. Like the average inflation targeting, the Fed didnâ\u0080\u0099t say how it would put that emphasis into practice. â\u0080\u009cYou kind of have to wonder what happens if the Fedâ\u0080\u0099s commitment to maintaining deeply negative interest rates keeps the heat up under risk assets as you might expect it to,â\u0080\u009d says Duy. The buzz The Federal Reserve decision is due at 2 p.m. Eastern, followed by Chairman Jerome Powellâ\u0080\u0099s press conference at 2:30 p.m. Traders will be focusing on the Fedâ\u0080\u0099s new forecasts on interest rates, economic growth and unemployment, as well as Powellâ\u0080\u0099s comments on the outlook, and the central bankâ\u0080\u0099s Main Street lending program that so far has been barely used. Read: Fed to signal interest-rate hikes wonâ\u0080\u0099t be an issue until 2024 â\u0080\u009cJerome Powell will use the press conference to reinforce the message that the Fed has no interest in raising interest rates anytime in the next couple of years, which should help to anchor the short-end of the yield curve even more sturdily,â\u0080\u009d said James Knightley, chief international economist at ING. Retail sales rose a slower-than-forecast 0.6% in August. The so-called control group measure of retail sales, which closely tracks how retail sales is measured in GDP reports, fell a tenth, in the first month since the $600 federal unemployment benefits expired. Facebook FB, +0.26%, the social media giant, slipped 1.5% in premarket trade after The Wall Street Journal reported the Federal Trade Commission is planning a lawsuit against it by the end of the year. Snowflake SNOW, -0.91%, the cloud software company backed by Warren Buffettâ\u0080\u0099s Berkshire Hathaway BRK.B, +0.24%, goes public in a hotly demanded initial public offering. Snowflake priced its IPO at $120, after initially seeking as little as $75 per share. Also on the IPO front, Israeli software company JFrog priced its initial public offering at $44, above its $39 to $41 price range.Â Read: Snowflake IPO: 5 things to know about the Berkshire-backed company as it heads for record software offering Delivery company FedEx FDX, +0.18% jumped 9% in premarket trade after it reported fiscal first-quarter profit and sales well ahead of analyst estimates. Ray Dalio, the founder of hedge-fund giant Bridgewater Associates, told Bloomberg News the dollarâ\u0080\u0099s status as a reserve currency is at risk from its spending and monetary stimulus after COVID-19. The market After another strong showing for the Nasdaq Composite COMP, +1.39% on Tuesday, U.S. stock futures ES00, +1.13% NQ00, +1.63% were stronger ahead of the Fed meeting. The dollar DXY, -0.58% was weaker against most rivals, and gold futures GCZ20, +2.17% rose. The chart The Organization for Economic Cooperation and Development put together this nifty chart on Google searches to show what types of spending has growth during the coronavirus pandemic, versus what has fallen. As the chart shows, services spending remains restrained even though goods spending has recovered, and in some cases, improved. The OECD on Wednesday boosted its global economic outlook while warning policy makers not too tighten fiscal policy too quickly. Random reads A bear from the Ice Age was found preserved in the Russian Arctic. The most expensive toilet seat at auction was sold, by Rolling Stones bassist Bill Wyman. The Chuck E. Cheese restaurant chain has asked a bankruptcy court for permission to destroy seven billion paper prize tickets. Need to Know starts early and is updated until the opening bell, butÂ sign up hereÂ to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}