{"article": [{"url": "https://www.marketwatch.com/story/there-is-more-to-picking-a-place-to-retire-than-low-taxes-avoid-these-5-expensive-mistakes-2020-07-07", "published": 1597505060.0, "headline": "There is more to picking a place to retire than low taxes - avoid these 5 expensive mistakes", "body": "At one stage in your life you had some constraints when planning where to live: a short commute, good schools or the most house value for a growing family. As you plan your retirement, your living options are wide open. How do you decide? 80% of older Americans can't afford to retire - COVID-19 isn't helping The major factor many pre-retirees consider are taxes. Some think income taxes, other estate taxes. They want the most money to enjoy their retirement. Or they are aiming to leave the most money to their heirs. There is more to retirement than taxes: weather, amenities and proximity to friends. You need to consider your whole life before you buy your retirement home. Learn these five things from experienced retirees: 1. The hidden cost of moving Moving to a new home involves a large amount of time and energy. Just when you think you are going to slow down in retirement, you need to think moving truck, packing, and travelling. No matter how far you move, your transition will cost money. The average moving company's bill of $ 4,300 for a 1,200-mile move is only the beginning. Add to that the hotel and other travel costs, the bill for shipping a car if you choose to do that. Then there are the costs of getting settled: new paint, appropriate furniture, small touches to turn the house into a home. In addition, you will pay the Realtor a fee for selling your home. If you are changing residency to your new state, add in the cost of new car registrations and legal fees for an updated estate plan. A couple I worked with moved to a nearby state. They found the perfect condo for them. But they found it two months after their home sold. In the meantime, they had locked into three months of long-term apartment fees on furnished rental and the costs of storing their furniture. Plus, along with the movers again, they paid for painting the walls and new furniture for the place. The cost of temporary housing alone was $6,000. They spent over $22,000 more than they planned in the first year of retirement. 2. A new home isn't a quick decision Do not jump the gun when it comes to moving. Just because you like to vacation somewhere doesn't mean it is the ideal retirement home location. I have seen too many people move twice because they thought they knew what they wanted. Or they made an impulse purchase. The way to avoid that is test before you buy. Spending money on a long-term rental may be the best investment to prevent a costly mistake. “ The key to finding a great place to settle is to know who you are and what lifestyle you aspire to for the best years of your life. ” One client downsized from their decades-long home up north the same year that they moved to Florida. A real estate agent had encouraged them to sell their home and downsize because condo prices were going up in their home area. As soon as their home sale went through and their belongings moved to their condo, they went to Florida and bought a second condo in an area they spent their annual vacation. They thought they were saving money by moving fast. Then they discovered they bought in a rental area, not a residential area, so making friends was difficult. The wife hit a wall of depression as it was too much change all at once - retirement, new lifestyle, letting go of their long-time home. \"I feel like I don't live anywhere,\" she lamented. 3. Space and location don't match your lifestyle Some people want visitors in their new home, and others are not interested in entertaining. Pick your new home accordingly. If seeing your family or friends will mean they travel to you, then being near transportation is key. Whether it is an airport, train station or just a day's drive away from those you love, that aspect of transportation will be one less expense or thing to worry about. A client downsized and bought a small condo in Florida. Reveling in the small space and no lawn work was a delight at first. Then realizing they were both healthy and that he actually liked lawn work and being outside, they got claustrophobic. They decided to make a change because the biggest factor was they did not have enough space for the grandchildren to visit. They moved to a home less than two years later. After nine years they downsized again, when the grandchildren were older. That's a lot of moving costs.4. Your new home is for the long haul If you are healthy now, terrific. But you are settling for a retirement that can last 20 or 30 years. Medical costs are one of the highest expenses in retirement, along with housing. Understand how far you would have to travel for excellent medical care. The travel costs and other out-of-pocket expenses can add up. One couple I know moved to rural Tennessee, loving the low costs and new three floor modern-designed home \"in the middle of nowhere.\" After she was diagnosed with Parkinson's early in their retirement, they wanted to be closer to the medical center for her regular appointments. They took on this added stress of finding a single-level home just as they were understanding her diagnosis. Find a home with an understanding of long-term needs. Thinking ahead may save you money and aggravation later. 5. Read the small print on state tax laws Be sure you have than one or two reasons to change your state residency. This impacts many aspects of your life, including needing a new will and other legal documents. State taxes are important but change. Vermont is known for higher income taxes, but the law changed recently and Social Security is no longer taxable. Tennessee has no income tax on earned income and is phasing out its investment income tax, but real-estate taxes in some towns are increasing to meet their budgets. Or consider this woman who sold her home in Massachusetts and was moving part-time to Florida. She intended to declare residency in New Hampshire at her second home on a lake. She went to her investment professional to invest her home sale funds. He was not licensed in New Hampshire but was in Florida to handle investments. Rather than review her situation with a CFP or accountant, she agreed on the spot to be a resident of Florida, where there is no income tax. Three years later, as planned, she sold the New Hampshire home - which had increased in value well over $500,000. She had a hefty federal capital-gains tax bill. Declaring New Hampshire as her residence for two years would have saved on taxes. Emotional and personal reasons for moving or not moving matter as much as taxes. Take the time to figure the best one out for you. If you have a partner you want to move with, their preferences and needs may mean compromise for you both. Before you decide where to move, ask yourself more questions. The key to finding a great place to settle when there are so many choices is to know who you are and what lifestyle you aspire to for the best years of your life. CD Moriarty, CFP is a Vermont-based financial speaker, writer and coach who wants to create financial peace of mind for others. She can be reached through her website."}]}