{"article": [{"url": "https://www.marketwatch.com/story/mcdonalds-september-sales-get-a-boost-from-rapper-travis-scott-11600188906", "published": 1600245380.0, "headline": "McDonald's September sales get a boost from rapper Travis Scott", "body": "The Travis Scott Meal has been a popular choice since launching on September 8, analysts say McDonald's Analysts are upbeat about McDonald's Corp.'s September same-store sales thanks to the popularity of the newly-launched Travis Scott Meal, a combo created through a partnership between the fast-food giant and the Grammy-nominated rapper. Travis Scott, who is also known as Cactus Jack and is the founder of the label Cactus Jack Records, has a partnership with McDonald's MCD, -0.43% that includes the $6 combo. The Travis Scott Meal comes with a Quarter Pounder with cheese, bacon and lettuce; medium French fries with barbecue sauce; and a Sprite beverage. The meal launched on September 8 and will be available until October 4. iframe.twitter-tweet { width: 100% !important; } There's also Cactus Jack + McDonald's merchandise and apparel, with McDonald's promising more to come. The last time a celebrity's name was on the McDonald's menu was 1992 with Michael Jordan, according to the company. UBS conducted U.S. franchisee checks, finding that there was a \"significant boost last week\" from The Travis Scott Meal, raising same-store sales that were already up as much as double digits. \"We believe initial success of the promo could also drive greater trial of the fresh beef Quarter Pounder and attract younger customers to the brand,\" wrote analysts led by Dennis Geiger. Read: Starbucks' Pumpkin Spice Latte still drives traffic and could be a source of holiday season inspiration for retailers UBS rates McDonald's shares neutral and raised its price target to $230 from $215. Mark Kalinowski of Kalinowski Equity Research also thinks the promotion \"seems to have gotten off to a great start\" and has raised his forecast for third-quarter same-store sales. Kalinowski rates McDonald's stock buy with a $243 price target. The FactSet consensus for McDonald's third-quarter same-store sales is a 5.3% decline. McDonald's is scheduled to report third-quarter earnings on October 27, according to FactSet. McDonald's will also get a bump from the launch of Spicy Chicken McNuggets, coming September 16. UBS anticipates \"strong trial and buzz\" based on a few factors, including the reception of the item in the U.K. in January. \"We believe McDonald's maintains among the best U.S. momentum in the sector, is defensive and well-positioned for a tighter consumer spending environment,\" UBS said. See: Instant Pot has launched a coffee/espresso maker, the Instant Pod, available exclusively at Walmart Even with all of the qualities working in McDonald's favor, Kalinowski notes there are risks, including the ongoing coronavirus pandemic and growing competition, particularly from Wendy's Co. WEN, +2.20% and its new breakfast menu and Chick-fil-A, perhaps McDonald's biggest threat. McDonald's stock is up 12.5% for the year to date while the Dow Jones Industrial Average DJIA, +0.56% has fallen 1.9% for the period."}]}