{"article": [{"url": "https://www.marketwatch.com/story/new-york-teachers-union-prepared-to-strike-or-go-to-court-if-school-reopening-deemed-unsafe-2020-08-19", "published": 1597855820.0, "headline": "New York teachers union prepared to strike or go to court if school reopening deemed unsafe", "body": "New York City’s powerful teachers union said Wednesday it was prepared to strike or go to court to stop the city from reopening schools that have yet to meet the union’s COVID-19 safety demands. “If we feel that a school is not safe, we are prepared to go to court,” said Michael Mulgrew, president of the United Federation of Teachers, at a public briefing. “We are prepared to stand and fight.” The union chief, joined by health and medical experts and community leaders, including City Council Speaker Corey Johnson, laid out a set of criteria each of the city’s thousands of schools must meet in order to reopen — protocols he said would keep students, teachers and their communities safer and provide more clarity than the city’s current plan. Besides things like personal protective equipment, signage and social distancing, all of which the city says will be in place by Sept. 10, the union is calling for every single student, educator and staff member to have a positive antibody test result or receive a diagnostic test at least 10 days before a school opens for classes. “No New York City school should open unless it meets all the criteria that we will present for you here today,” Mulgrew said. “What happened in March cannot happen again in this city.” Inevitably, classes would have to be delayed from their Sept. 10 start date in order to meet the union’s demands, Mulgrew acknowledged. But rather than a uniform first day, he proposed a gradual reopening as individual schools became ready. That would mean a delay of several weeks, until late September or early October, for schools if stakeholders, including City Hall and the Department of Education, worked quickly, he said. The union’s ultimatum comes amid growing calls for New York City to delay the start of in-person classes. Don’t miss: The new coronavirus is mutating, but that ‘may be a good thing,’ says top expert Last week, the leader of a union representing the city’s principals sent a letter to Mayor Bill de Blasio and schools Chancellor Richard Carranza, urging more time to train teachers and to make necessary building updates. A union representing nearly 23,000 lunch workers and crossing guards sent a similar letter last week, asking for a delay to the school year. But the teachers union has been working closely with Mayor Bill de Blasio and the Department of Education to come up with the city’s current school plan, and throughout negotiations had not asked for required testing for teachers and students. See: Is it safe yet to work and go back to school in New York? “This is fear mongering,” said Miranda Barbot, spokeswoman for the city’s Department of Education, in a statement. “We spend hours a day, literally, talking to the UFT about policies and procedures and have delivered on a robust and practical testing protocol, a nurse in every building and a 30-day supply of PPE for every school.” Ms. Barbot called the city’s back-to-school plan the most rigorous in the country. “It seems like they just don’t want to say the quiet part out loud: They don’t want to open schools at all for students and families.” Mulgrew said he presented the union’s additional criteria to the mayor last week, and now he’s waiting to hear back. De Blasio has said there’s enough time to get everything ready in time for the September start date. But among the biggest challenges Mulgrew raised is adequate testing. A safe reopening would require monthly screening of all teachers and random student testing each month, with higher rates of testing in neighborhoods with known outbreaks, said Mark P. Jarrett, deputy chief medical officer at Northwell Health who advised the union’s report. Also on MarketWatch: Why the COVID-19 ‘baby bust’ could impact stock prices for the next 30 years Mulgrew also raised concerns about contact tracing, which he said would need to be carried out school-wide within 24-hours of a positive test result. A union-led team of around 100 inspectors were also going around to every school to check on the status of ventilation system upgrades and other building preparations, he added. New York City is the only major school district in the country attempting any form of in-person learning this fall. Districts from Los Angeles to Chicago will start the school year completely remote. Under the current hybrid-learning plan, students will return to classrooms a couple days a week and learn remotely on the other weekdays, while mandatory mask-wearing, social distancing and cohorting students to limit exposure will take place in school buildings. Also read: New York gyms can reopen on Aug. 24 at 33% capacity with mandatory masks Mulgrew and the community leaders at Wednesday’s briefing, including Johnson, Hazel N. Dukes, president of the NAACP in New York, and Randi Weingarten, president of national teachers union the American Federation of Teachers, threw their support behind opening New York City schools this fall. “No one is looking to throw up obstacles,” said Johnson at the union’s news briefing. On the contrary, he said, he wants New York City to “be the model.”"}]}