{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-edge-lower-after-trump-tests-positive-for-coronavirus-11601641142", "published": 1601655320.0, "headline": "U.S. Treasury yields reverse higher on revived stimulus hopes", "body": "U.S. Treasury yields rose Friday amid expectations that Congress could still strike a deal on another fiscal stimulus bill, following President Donald Trump’s diagnosis of COVID-19. Investors also parsed a weaker than expected September employment report from the U.S. Labor Department. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was up 1.7 basis points to 0.694%, extending a 3.5 basis point weekly increase, its largest such move since the week of Aug. 28. While the 2-year note rate TMUBMUSD02Y, 0.156% was unchanged at 0.131%, and virtually flat for the week. The 30-year bond yield TMUBMUSD30Y, 1.576% rose 2.6 basis points to 1.480%, contributing to a weekly rise of 7.5 basis points. Bond prices move inversely to yields.What’s driving Treasurys? President Donald Trump said he tested positive for the coronavirus after his aide Hope Hicks had also tested positive for the disease. Trump will now enter quarantine, creating fresh uncertainty over the race for the White House in November against Democratic candidate Joe Biden. Bond yields rose in the session after some progress on a new fiscal stimulus bill came into view. House Speaker Nancy Pelosi said she anticipated reaching a deal, adding that Trump’s diagnosis “changed the dynamic” of negotiations. The development shifted some focus away from economic data that was expected to command market participants’ attention. The U.S. Labor Department said the economy created 661,000 new jobs in September and the unemployment rate fell again to 7.9% to the lowest level during the pandemic. Economists had forecast 800,000 job gains down from August’s increase of 1.371 million. In other data, the University of Michigan’s consumer sentiment index for last month came in at a reading of 80.4.What did market participants’ say? “Yields want to run higher before the election. That’s evident in today’s reaction to surprising news and good economic reports. Investors think the November vote will confirm Biden’s current lead, producing a new government that will add stimulus and address lingering pandemic woes,” said Jim Vogel, an interest-rate strategist at FHN Financial. Trump’s positive test for COVID-19 is “not going to have a drastic direction on interest-rate markets. Even though it’s directionally going risk-off, the reaction has been very muted. There’s not a lot of people who want to go long or short Treasurys,” said Patrick Leary, chief market strategist at Incapital, in an interview."}]}