{"article": [{"url": "https://www.marketwatch.com/story/trump-tests-positive-for-coronavirus-why-hes-at-higher-risk-of-more-severe-illness-from-covid-19-2020-10-02", "published": 1601830760.0, "headline": "Why Trump is at higher risk of more severe illness from unpredictable COVID-19", "body": "President Donald Trump was moved from the White House to Walter Reed medical center late Friday, the same day that he and first lady Melania Trump had tested positive for coronavirus. Trump’s medical regimen highlighted how the president is in a high-risk group for more serious illness from COVID-19, the disease caused by SARS-CoV-2, observers say. He was given a dose of Regeneron Pharmaceuticals Inc.’s REGN, +0.36% experimental neutralizing antibody cocktail, in addition to Gilead Sciences Inc.’s GILD, +0.82% remdesivir. The president also received supplemental oxygen at least once, and dexamethasone, according to Dr. Sean Conley, Trump’s physician. Six months into the pandemic, there are precious few treatments available for patients with COVID-19, and if a vaccine becomes available, it’s unlikely to be readily ready until 2021. During a news conference on Sunday, Conley confirmed for the first time that the president had received oxygen support, at least once. His diagnosis came hours after the White House announced that senior aide Hope Hicks tested positive after traveling with the president several times over the last week. Trump, 74, is at a higher statistical risk of serious complications from the virus that has killed more than 200,000 people in the U.S., analysis of hospitalization data in several countries has shown over the last six months. Being obese is another potential complication a virus Trump has described as “horrible” and “deadly.” Also see:‘I wasn’t feeling so well. I feel much better now.’ Trump tweets video address from Walter Reed medical center Both of those factors increase the risk for people diagnosed with the disease. According to the Centers of Disease Control and Prevention: Having obesity increases the risk of severe illness from COVID-19, and may triple the risk of hospitalization. The path of the unpredictable virus is related to immune function, and reduces lung capacity and reserve and can make ventilation more difficult. As the body-mass index increases, risk of fatality from COVID-19 increases, it added. “People in their 60s or 70s are, in general, at higher risk for severe illness than people in their 50s,” the federal agency said. However, the president isn’t in the highest-risk age group: “The greatest risk for severe illness from COVID-19 is among those aged 85 or older. There are also other factors that can increase your risk for severe illness, such as having underlying medical conditions,” the CDC said. “As you get older, your risk of being hospitalized for COVID-19 increases.”What is the president’s level of obesity? The president is in the lowest-risk category in terms of obesity, according to the latest data on his weight and publicly available information on his height. Trump has a BMI of 30.1 based on a height of 6 foot, 3 inches, and a weight of 243 pounds, as written in a memo from his Conley last year. That gives him a BMI of 30.1 and puts him into the lowest of three stages of obesity, according to the CDC’s official definition. BMI calculates weight, muscle, fat and bone in relation to height and gender. A BMI of 25 to 29.9 is considered overweight and those with a BMI of 30 or more are considered obese; morbidly obese people have a BMI of 44.9 or more. “Patients who received invasive mechanical ventilation were more likely to be male, to have obesity,” according to this study in the New England Journal of Medicine. “ Research on COVID-related fatalities shows most of those people are over 70. Genes in the body that appear to be a major factor giving the virus access to heart cells become more active with age. ” Age is another risk factor. Research on COVID-related fatalities shows the majority of those people are over 70. Genes in the body that appear to be a major factor giving SARS-CoV-2, the virus that causes COVID-19, access to the heart cells become more active with age, according to research published in August in the Journal of Molecular and Cellular Cardiology. The coronavirus spike protein binds to certain enzymes and proteins in the heart that are more common as we age. Inflammation in older people can be more intense, causing organ damage, according to Johns Hopkins University. “Lung tissue becomes less elastic over time, making respiratory diseases like COVID-19 a particular concern for older people. The CDC added, “Eight out of 10 COVID-19-related deaths reported in the United States have been among adults aged 65 years and older.” However, the risk of dying from COVID-19 increases more for those who are 85 and older. It takes significantly longer to recover from the disease for older people, studies show, but the virus can be pernicious in how it impacts people, and what symptoms — if any — continue to linger. For instance, the U.K.’s Prince Charles, 71, made a full recovery from the virus. Most people recover within a few weeks, Mayo Clinic researchers recently wrote, “but some people — even those who had mild versions of the disease — continue to experience symptoms after their initial recovery.”Why are older people more at risk? Adult patients can respond to coronavirus infection with an over-vigorous adaptive immune response that may promote the inflammation associated with acute respiratory distress syndrome,” a type of serious lung damage now associated with severe COVID-19 cases, health professionals say.For instance, doctors and members of the public were spooked by how otherwise strong, healthy people fell victim to the 1918 influenza. Doctors today attribute that phenomenon to the “cytokine storm” or hypercytokinemia, a process where the immune system in healthy people reacts so strongly as to hurt the body.A hallmark of some viruses: A surge of immune cells and their activating compounds (cytokines) effectively turned the body against itself and led to an inflammation of the lungs and severe respiratory distress, leaving the body vulnerable to secondary bacterial pneumonia. A study released last month in Science Translational Medicine, an online journal that publishes research at the intersection of science, engineering and medicine, offered a theory on why older patients’ immune systems fare worse. It suggested adult patients respond to coronavirus infection with an over-vigorous, but less effective “adaptive” immune response, whereas children respond with a more effective “innate” immune system.Coronavirus update The Dow Jones Industrial Index DJIA, +0.56%, the S&P 500 SPX, +0.87% and the Nasdaq Composite COMP, +1.39% all closed lower Friday in the wake of the president’s diagnosis; the Nasdaq was down 2.2% at day’s end. Doubts about traction for further fiscal stimulus from Washington may be another factor discouraging investors who have been betting on Republicans and Democrats striking a deal to offer additional relief. As of Sunday, COVID-19 has now killed at least 1,034,865 people worldwide, and 209,749 in the U.S., according to data aggregated by Johns Hopkins University. The U.S. still has the world’s highest number of COVID-19 cases (7,412,911), just ahead of India (6,549,373) and Brazil (4,906,833). Worldwide, there has been at least 35,011,322 confirmed cases, which mostly does not account for asymptomatic cases. Several companies in the U.S. and overseas are working on a vaccine. AstraZeneca AZN, +1.16% , in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% ; Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those working to get a vaccine through trials, in the hope one will be read in and/or by 2021."}]}