{"article": [{"url": "https://www.marketwatch.com/story/silicon-valley-economy-remains-strong-100-days-into-coronavirus-compared-to-other-industries-2020-06-26", "published": 1593263660.0, "headline": "Silicon Valley economy remains strong 100 days into coronavirus, compared to other industries", "body": "What crippled economy? While virtually every aspect of the U.S. economy has been hit hard during the coronavirus pandemic, the technology industry and its hub in Santa Clara County continue to fare better than other large regions across California and the nation, based on three studies published this week. While Silicon Valley is thriving, non-tech industries are suffering, further widening the wealth gap with other sectors just 100 days into the pandemic. California’s unemployment rate remained “stubbornly high” from April to May, at 16.3%, while figures in Silicon Valley improved slightly, according to data from the Public Policy Institute of California (PPIC) late Thursday. The unemployment rate in the San Jose-Sunnyvale-Santa Clara metro area, the epicenter of Silicon Valley, improved 0.8% in May, to 11.2%. In San Francisco-Redwood City-South San Francisco, it improved 0.2% to 11.9%. In many Bay Area metro areas, where relatively large shares of jobs can be done remotely, unemployment rates are holding steady and continue to be among the lowest in the state, Sarah Bohn, vice president of research at PPIC, told MarketWatch. She cautions, however, that unemployment improvement may mask the fact that some people have stopped looking for work. Last week, another study said much the same. Silicon Valley unemployment was down slightly in May, to 11% from 11.6% in April, according to Joint Venture Silicon Valley’s Institute for Regional Studies. Tech’s resilience has extended to recent market capitalization with record highs seen for the stocks of Apple Inc. AAPL, +1.74% , Facebook Inc. FB, +0.26% , and Netflix Inc. NFLX, +1.43% . Since most tech stocks bottomed out on March 23, they have generally out-performed publicly traded non-tech companies, according to an analysis by Rachel Solomon Massaro, Joint Venture’s director of research, for MarketWatch. Through Thursday, shares of Zoom Video Communications Inc. ZM, +2.89% (up 63%), Apple (62%), Facebook (59%), Google parent Alphabet Inc. (37%), and Netflix (30%) had exceeded Gap Inc. GPS, -0.10% (62%), Visa Inc. V, +1.80% (43%), and Levi Strauss & Co. LEVI, -2.24% (25%), and PG&E Corp. PCG, +1.79% (20%), which are also based in the San Francisco Bay Area. The buoyancy of tech companies has been underscored by a return to the office by some employees at Apple, VMware Inc. VMW, +0.81% , and Juniper Networks Inc. JNP, -0.16% though a vast majority of their employees continue to work from home. One major caveat is a spike in coronavirus cases in California and elsewhere, which has prompted Apple to temporarily shut down 32 Apple Stores in the U.S., and could lead to lockdowns in several states. The technology sectors good fortune is also reflected in venture capital funding, where Silicon Valley far outpaces the rest of California and the nation, based on data from PitchBook exclusively for MarketWatch. Valley-based companies collected $7.9 billion in May, up 108% from $3.8 billion in April. In California, the total of $9.1 billion in May improved 82% from $5 billion in April. Nationally, the total of $13.9 billion in May was up 54% from $9 billion in April. Among the big winners in venture funding in Silicon Valley in the past 100 days are Alphabet’s driverless subsidiary Waymo LLC ($750 million on May 12), Stripe Inc. ($631 million on April 30), and Impossible Foods ($500 million on March 20), according to Thomson One. Then there’s everyone else. While non-tech industries like retail continue to struggle in California, another 1.48 million people nationwide applied for unemployment for the first time last week, the 14th straight week more than 1 million workers have filed for jobless claims since the start of the coronavirus pandemic. The national unemployment rate is 13.3% to 16.3%, based on interpretation of recent data from the U.S. Bureau of Labor Statistics. See also: Jobless claims dip to 1.48 million, but slow decline signals choppy economic recovery Retail and service industries continue to be hammered nationwide, and in California. Before the pandemic, more than 2.2 million Californians, accounting for 11.7% of total state employment, were self-employed. Their numbers plunged by nearly a million between late April and mid May and then rebounded by about half in the last week of May, according to the Census Bureau’s weekly survey. The 1.6 million Californians who rely on independent contracting, freelancing, or gig-economy work as their main source of income account for about two-thirds of all self-employment; the remainder are business owners, says the PPIC. Thousands of workers at Uber Technologies Inc. UBER, -0.18% and Lyft Inc. LYFT, +2.16% — many of them contract workers outside the valley — have been laid off in recent weeks as part of cost-cutting campaigns that have led to stock surges for both companies. Shares of Uber have doubled since March 18; Lyft’s stock is up 73% since March 17. Service workers are feeling the pinch as spending lags for high-income households, based on a study of zip codes in the U.S. by Opportunity Insights. Declines in the most affluent zip codes in California, such as San Francisco (-27%), San Mateo (-22%), and Santa Clara (-21%), from January through June 17 led to significant employment losses among low-income individuals working in those areas."}]}