{"article": [{"url": "https://www.marketwatch.com/story/investors-face-a-lost-decade-in-the-stock-market-according-to-this-warning-from-the-worlds-biggest-hedge-fund-2020-06-18", "published": 1592644700.0, "headline": "Investors could be looking at a 'lost decade' in the stock market, the world's biggest hedge fund warns", "body": "“ 'Even if overall profits recover, some companies will die or their shares will devalue along the way. Left with lower levels of profits and cash shortfalls, companies are likely to come out on the other side of the coronavirus more indebted.' ” That's part of the reason why Bridgewater Associates, the world's biggest hedge fund, issued a warning to clients this week that equity investors could be facing a \"lost decade\" in terms of returns. \"Globalization, perhaps the largest driver of developed world profitability over the past few decades, has already peaked,\" Bridgewater said in a note obtained by Bloomberg News. \"Now the U.S.-China conflict and global pandemic are further accelerating moves by multinationals to reshore and duplicate supply chains, with a focus on reliability as opposed to just cost optimization.\" Intel Corp. INTC, -1.03% and Taiwan Semiconductor Manufacturing TSM, +1.11% were cited in the note as two examples of high-profile technology companies that plan to build their production facilities in the U.S., despite the higher costs that will pinch margins. It's been a rough stretch for Ray Dalio's Bridgewater, which has earned an estimated $58.5 billion for clients since its launch in 1975. The fund took a 15% hit in assets under management during March and April, dropping to $138 billion from $163 billion at the end of February. Here's Dalio's infamous \"cash is trash\" call that preceded the market's big drop earlier this year: iframe.twitter-tweet { width: 100% !important; } Of course, it didn't take long for those words to come back to haunt him, considering that just one month later the global economy would essentially shut down and the U.S. stock market would get rocked by its biggest retreat since the financial crisis. The Dow Jones Industrial Average DJIA, +0.56% closed slightly lower on Thursday, while both the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% ended in the green."}]}