{"article": [{"url": "https://www.marketwatch.com/story/the-biden-sanders-climate-change-policy-pact-8-key-features-2020-07-10", "published": 1594470620.0, "headline": "The Biden-Sanders climate-change policy pact: 8 key features", "body": "Presidential candidate Joe Biden has advanced environmental policy recommendations that most analysts find more ambitious than his stance in favor of curbing man-made climate change earlier in his campaign. The climate goals — including a call to eliminate carbon emissions from power plants by 2035 and modernizing the electric grid to help achieve this — were part of the presumptive Democratic nominee’s collaboration with former contender Sen. Bernie Sanders and his more progressive platform. Biden is now running on the recommendations advanced as part of the Biden-Sanders Unity Task Force, which were submitted by six policy areas covering climate change, health care, criminal justice, education and more. The recommendations will be submitted to the Democratic National Committee’s party committee as a “starting point” for their consideration. Former Secretary of State John Kerry and Rep. Alexandria Ocasio-Cortez, the Democrat of New York and the co-author last year of a Green New Deal that did not advance in a divided Congress, were co-chairs of the climate-change task force, a key initiative of the campaign in trying to win over younger voters. Last month, Speaker Nancy Pelosi and Democrats on the House Special Committee on Climate released their plan to push Congress to set a national goal of net-zero emissions by at least 2050 and to more aggressively shift to renewable energy over fossil fuels. It was a proposal that frustrated most Republicans on the select committee, who thought joint work was progressing and who are in favor of carbon capture, nuclear and other initiatives toward a climate-change fix. Here are some of the key aspects of the proposal. Eliminate carbon pollution from power plants by 2035. Carbon emissions from the U.S. power sector fell 8% last year even with the economy growing, as utilities increasingly dropped coal for cheaper natural gas and renewables. But the Biden-Sanders plan calls for more steps toward keeping that number falling. They call for installing 500 million solar panels, including eight million solar roofs and community solar energy systems, and 60,000 made-in-America wind turbines. Greener buildings. the task sets out a national goal of achieving net-zero greenhouse gas emissions for all new buildings by 2030, on the pathway to creating a 100 percent clean building sector. Within five years, tens of billions of dollars in private-sector investment will be incentivized to retrofit four million buildings. This also entails making energy-saving upgrades to up to two million low-income households and affordable and public housing units within five years. Read:Here’s why carbon emissions at utilities can fall even during a powerful economy Among the other goals: Back California’s statutory authority under the Clean Air Act to set its own emissions standards for cars and trucks. Read:California approves first-of-its-kind rules forcing auto makers to sell more electric trucks Support private adoption of affordable low-pollution and zero-emission vehicles with the goal of installing at least 500,000 public charging stations across the nation. Investment in a cleaner, equitable and globally competitive manufacturing sector. Work with farmers to make the American agriculture sector the first in the world to achieve net-zero emissions. Support the advancement of technologies that help industries decarbonize including carbon capture and advanced nuclear — areas that are often featured in Republican-penned climate-change initiatives. Recommit the U.S. to the voluntary Paris Climate Agreement as well as create and strengthen other international commitments on climate and pollution. President Trump has pulled the U.S. from the Paris climate pact in which 200 countries volunteered to reduce greenhouse gas emissions and keep global temperatures from rising no more than 2 degrees Celsius above preindustrial levels. Trump has linked his withdrawal to claims of noncompliance by developing nations."}]}