{"article": [{"url": "https://www.marketwatch.com/story/five-regions-across-new-york-state-cleared-for-phase-3-reopening-2020-06-11", "published": 1591898720.0, "headline": "Five regions across New York state cleared for Phase 3 reopening", "body": "Coronavirus restrictions are further loosening across New York, as five upstate regions were given the green light to enter Phase 3 of reopening, and pools and playgrounds statewide are now permitted to open at the discretion of local authorities, Gov. Andrew Cuomo announced Thursday. Residents in Central New York, the Finger Lakes, the Mohawk Valley, the North Country and the Southern Tier will be able to dine inside restaurants and visit personal care businesses, such as spas, nail salons and tattoo studios, starting Friday. Mandatory restrictions, including rules on maximum capacity — capped at 50%, social distancing, hygiene and personal protective equipment are in place for both industries, alongside suggested best practices. “I know businesses are anxious to open. Everybody’s anxious to get the economy going,” Cuomo said. “Please follow the guidelines and do what is permissible to do.” “Short-term gain isn’t worth long-term pain,” he said, and businesses not complying with the state’s guidelines could lose their licenses or right to operate. As of Thursday, local governments statewide now have the authority to decide whether their swimming pools and playgrounds can reopen but should exercise caution when making the decision, according to Cuomo. “They have to use their judgment here,” Cuomo said. “They have the test data, they should be studying the test data. They should be looking at those positives and seeing where those positives are coming from.” In New York City, Mayor Bill de Blasio — who had previously said public pools would be closed throughout this summer — will be reassessing his decision, given the progress made against the virus. “Now we can start a conversation around pools,” he said Tuesday, before the governor’s announcement. “I don’t know if we’ll get there, but at least we can at least begin that conversation now for the first time.” On reopening playgrounds, “the day is coming, it’s not here yet,” the mayor said on Thursday. New York City is just four days into its first phase of reopening. See: New Yorkers aren’t fazed by phased reopening Despite the so-far steady return to something approximating normal in some parts of the state, Cuomo stressed that aggressive diligence in the fight against the virus remains critical to avoiding the infection resurgence that has been seen in other states since reopening. Also on MarketWatch: Coronavirus Economic Recovery Tracker “The numbers are good. Everything we’ve done has been exactly right up until now, but that’s up until now,” Cuomo said. “You can make a mistake today that wipes out everything we’ve done, so we have to stay smart. This Covid has not gone away.” Though still present, metrics show that currently, the spread and impact of the pandemic has undoubtedly improved. “It’s overall great news again,” Cuomo said, pointing toward declines in the number of people being hospitalized for coronavirus and a close-to-record low in the daily number of deaths. On Wednesday, 36 New Yorkers died as a result of coronavirus. That figure peaked in April, when the state recorded 799 fatalities in a single day. “When you get this low on the number of deaths, I don’t know what it is really telling us anymore,” Cuomo said, adding that many of the people could have had comorbidities. Also see: Virtual NYC Pride March stays in step with protest and solidarity An increased focus is now being placed on daily infection rates, crucial in tracking the virus and allowing for the early identification of possible spikes. The state conducts roughly 50,000 tests a day, the governor said. On Wednesday, infection rates were highest in New York City at 1.7%, and lowest in the North Country at 0.3%. “Watch those daily numbers,” Cuomo said. “You want to watch. You want to notice any trend line. You want to notice any bounce, and then you want to find out why.” Additional New York Developments Thursday: Restaurants: Mayor Bill de Blasio and first lady Chirlane McCray have announced a Restaurant Revitalization Program in New York City. The $3 million fund will give financial assistance to 100 restaurants in the neighborhoods hardest hit by the coronavirus."}]}