{"article": [{"url": "https://www.marketwatch.com/story/locals-reclaim-madrid-as-their-city-while-waiting-for-the-tourists-to-return-2020-06-10", "published": 1591837220.0, "headline": "Locals reclaim Madrid as their city while waiting for the tourists to return", "body": "MADRID — Crammed with visitors from all over the world just a few months ago, Madrid is now a bittersweet paradise. Devoid of the extra foot traffic, residents are reveling in new post-lockdown freedoms and reclaiming the once heavily trafficked plazas, the picturesque streets and the parks. The Royal Palace grounds fill with children on bikes and skateboards every afternoon. Chirping birds, church bells, soft conversations and traditional music from balconies provide the city’s new soundtrack, giving off village vibes rather than those of a tourist hot spot and major world capital. “There are so many words to describe it. It is a tense calm, it is a return to the past,” says Carmen Cristino Orejana, a 50-year-old, fifth-generation Madrileña, who says the post-coronavirus period is the strangest yet in a city that has lived through so much, including a civil war and the Franco dictatorship. The exterior of the famed Prado Museum, as seen on Sunday in Madrid. Barbara Kollmeyer/MarketWatch Of course, for those who have lost jobs due to the pandemic, to call it a paradise is probably off the mark. Spain’s unemployment exploded by more than 500,000 during the March-April lockdown, though job losses slowed to just over 26,000 in May. And more than 3 million are temporarily laid off and hoping that status won’t become permanent. Orejana is among the nearly three million people in Spain whose job depends on tourism. Her Viajes con Carmen tours specialize in flamenco history, old Madrid and food tours. Before the pandemic, she would take small groups around Madrid, Córdoba and elsewhere. Now she relies on €500 to €600 ($567 to $681) in monthly assistance from the government. The 1778 Puerta de Alcalá in Madrid’s Plaza de la Independencia. Barbara Kollmeyer/MarketWatch The tourism sector accounts for more than 12% of gross domestic product, and the Bank of Spain has warned of a worst-case 15.5% drop in economic growth next year. The left-leaning coalition government, which has been the subject of protests over its imposition of one of the strictest lockdowns in Europe, has said the country will lift its required 14-day quarantine for foreign tourists on July 1. It is clear that Spain needs its visitors, though how and when are questions on everyone’s minds here. And some want to see changes. “The one good thing the pandemic has brought to residents in the center is the ability to have a good rest,” Esther, the vice president of the Association of Neighbors for Opera and the Austrias, told MarketWatch. She asked that her last name not be used. “We are able to now enjoy the silence, walk relaxed in the streets.” The statue of the city-mascot bear and his strawberry tree at Puerta del Sol, Madrid. Barbara Kollmeyer/MarketWatch In the city center, where we live, the goal before the pandemic was always to escape on weekends, as the short-term rental apartments in our building can turn nightmarish after dark. One pre-pandemic night last year, a group of American girls, locked out of their lodgings in the building, chucked rocks at the windows at 1 a.m. to wake a sleeping roommate. At least one vacation rental apartment is for sale in our building now, and many across the city are expected to follow suit. The streets around us were often clogged with electric bikes, Segways, walking tours of 30 to 40 people led by a megaphone-wielding guide, tuk-tuk cars, antique-styled Jeep chassis cars, and smaller SEATs or the dreaded yellow electric sidecars, complete with loudspeakers, or the beer bike tours with their blaring music. El Retiro Park, Madrid. Barbara Kollmeyer/MarketWatch Then there were the stag- and hen-night revelers over on cheap flights — bumping into two or more such groups on any given night was common. They are one reason the city had developed, some say, a reputation as a weekend borrachero — a place to go and get drunk. Spain is the second-biggest tourist destination in the world, with over 80 million visitors in 2019, breaking records for the seventh-straight year. Madrid saw roughly 7 million visitors in 2019, from around 4 million in 2001. Barcelona saw over a million in 1990 and nearly 9 million last year — and 2017 marked a year of exploding tensions over the heavy tourism influx in that city and in other popular European ones. The number of tourist apartments exploded in Madrid’s city center in recent years, and we knew of more than one family pushed out to the suburbs, with exasperated neighbors putting up yellow placards reading, “SOS Madrid.” And people like Esther worry that things will be worse than before, as the city tries to bring back tourists and allows terrace bars, for example, to stretch further across sidewalks and plazas. A small plaza in Madrid’s center as photographed last Friday. Barbara Kollmeyer/MarketWatch Orejana, meanwhile, is trying to revive her business by taking locals on tours of sights that might have been difficult to see before, when she had to compete with more tour parties. It is a strategy she felt compelled to try out. “I don’t see [Europeans] coming back before November or Christmas. From the U.S. and Australia, we’re probably looking more at 2021,” she says. Spaniards will welcome back the tourists who loved our city, but it’s ironic they can’t be here now for a unique experience - real Madrilenos just living their lives."}]}