{"article": [{"url": "https://www.marketwatch.com/story/i-want-year-round-outdoor-living-dry-summers-and-no-snow-on-4-000-a-month-where-should-i-retire-11594813308", "published": 1600074740.0, "headline": "I want year-round outdoor living - dry summers and no snow - on $4,000 a month. Where should I retire?", "body": "A woman kayaks at Whiskeytown National Recreation Area 10 miles from Redding, Calif. Redding Convention & Visitors Bureau Dear MarketWatch, I'm a single 54-year-old female looking to retire in the next 10 years, but looking to move to my future retirement spot during the next two years. I love dry summer weather, hiking, biking, water sports, year-round outdoor living. I don't like cold, snowy winters, unless I'm driving there to ski! I like to be close enough (within a couple of hours) to art and culture, but on a daily basis I'd like close access to trails and lakes. I don't want to be too secluded but also don't want to be packed into a subdivision. My monthly retirement budget will be around $3,500-$4,000. I'll also have money from the sale of my house. Any recommendations? Thanks, Alice Dear Alice, Moving to your retirement spot well in advance of actually retiring sounds like a dream, especially if, as I hope, you'll be able to telecommute to your current job. No snow, no summer rains - or even much humidity? That pretty much rules out the eastern half of the U.S., though you might want to look in western North Carolina (here's one option) and eastern Tennessee (no state income taxes) if you're willing to compromise a bit. Otherwise, let's head out west.. You'll find some of our most awe-inspiring national parks there and so much public land to play in. You don't want to be fenced in, so push beyond city limits in the suggestions below. Equally, given the range of neighborhoods you'll find, don't assume that a more urban setting means you'll be packed into a subdivision. (One reader calls Albuquerque a \"delightful, quirky hidden gem.\") Don't worry about finding trails wherever you move. The National Trails System tops 193,000 (primarily hiking) miles, and the nonprofit organization Rails to Trails says America has more than 24,000 miles of rail-trails that appeal to cyclists as well as walkers. Here are three options to get you started. As always, make sure the retirement budget is realistic and spend some time getting to know an area during all seasons before you commit. A bad move is an expensive mistake. Read: There is more to picking a place to retire than low taxes - avoid these 5 expensive mistakes Also: 4 questions to answer before you make any big changes to your life in retirement Elephant Arch in Red Cliffs National Conservation Area Wilderness, part of Red Cliffs Desert Reserve outside St. George, Utah. iStockphoto St. George, Utah This fast-growing city of nearly 90,000 people in the southwestern corner of the state puts you on the edge of the  60,000-acre Red Cliffs Desert Reserve and an hour from Zion National Park. Go a half-hour east to Hurricane if you're looking for a town less than a quarter its size. Head southwest for just over 2 hours and you'll be in Las Vegas. It's 2½ hours to the north rim of the Grand Canyon. You know there's great hiking in this area. But you'll find lakes (well, reservoirs) nearby, and the 14-mile Virgin River Trail cuts through the city for an easy bike ride. You can hit the slopes in 90 minutes at Brian Head Resort.The climate is Vegas-like hot, with average summer highs topping 100, but you won't have rain or snow. If you do cross the state line into Nevada, you won't be paying state income taxes. Talk to a tax professional if state taxes are a concern. Much-smaller Moab, Utah, was another tempting choice, given that it's just outside Arches National Park and not far from Canyonlands National Park. Housing costs are similar to St. George but there's a bit more snow. Grand Junction, Colo., would be your big city. You can see what homes are on the market now in both St. George and Moab, using Realtor.com, which like MarketWatch is owned by News Corp. .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 600px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 420px; } Redding, California This is where California's Central Valley transitions into the Cascade foothills and is home to 92,000 people. (A similar number live elsewhere in Shasta County.) It's essentially surrounded by national forests - so plenty of outdoor living - except for due south, where I-5 will take you to Sacramento in about 2½ hours. Shasta Lake, the state's largest reservoir, is your water playground, 10 miles to the north. The city boasts of 225 miles of trails within a 15-mile radius. Orbitz has called Redding \"California's best-kept secret.\" There's no rain in the summer (and essentially no snow in the winter), but this area does get plenty of rain in the winter. Skiing, though, is nearby, including within Lassen Volcanic National Park. A pair cross-country ski at Lassen Volcanic National Park. Courtesy Redding Convention & Visitors Bureau. Average highs in July are 101 degrees; average winter lows remain above freezing. You can get a sense of what your money will buy you in terms of housing here. While California has a reputation for high taxes, note that it doesn't tax Social Security income. Outside Mt. Vernon, Wash., are fields of yellow daffodils. iStockphoto Mount Vernon, Washington If that all sounds too hot for all the outdoor living you want to do in the summer, continue up I-5 to Mount Vernon, the county seat of Skagit County and home to 36,000 people. You'll be at the edge of the Cascade Mountains, less than 30 minutes from Anacortes and a ferry to the San Juan Islands, an hour from Seattle and 90 minutes from Vancouver, B.C. The Northern Cascades National Park is to the east. You can reach Mount Baker Ski Area in less than two hours. For the cyclist in you, you'd be just minutes away from Adventure Cycling's cross-country Northern Tier and Washington Parks routes and not far from its Pacific Coast route. Drive (or bike) 10 miles to Sedro-Woolley, and you can jump onto the 22.5-mile Cascade Trail. A lone cyclist pedals along the Washington Parks route. Alex Strickland/Adventure Cycling Because it's northwest Washington, average summer highs will only reach the mid-70s. You'll get a little over an inch of rain in July. Winters get close to freezing. While you'll get maybe an inch of snow a month, you will get rain (though less than in Redding.) Mount Vernon is a more affordable housing market than Anacortes, and there are other towns in Skagit County or even Whatcom County to the north to check out. Here's what's for sale now in Mount Vernon. An added bonus: no state income tax here. Readers, where do you think Alice should retire? Also read: I've got a budget of $3,300 a month and want to be near some 'wild' areas - where should I retire? Plus: We're looking for a place that's not too hot, not too cold - where should we retire? And: We'll retire at 60 with about $2.5 million and want to ditch high-tax California - but still want great year-round weather. Where should we retire?"}]}