{"article": [{"url": "https://www.marketwatch.com/story/white-houses-meadows-says-senate-aiming-to-unveil-new-coronavirus-bill-next-week-11598972061", "published": 1598973800.0, "headline": "White House's Meadows says Senate aiming to unveil new coronavirus bill next week", "body": "White House chief of staff Mark Meadows leaves a Republican policy luncheon on Capitol Hill in Washington July 21, 2020. (Photo by Olivier DOULIERY / AFP) (Photo by OLIVIER DOULIERY/AFP via Getty Images) Senate Republicans are aiming to unveil a new \"targeted\" coronavirus aid bill next week once lawmakers return from a break, a senior White House official and a Wyoming senator said Tuesday. \"I expect them to pass a bill or at least put forth a bill in hopes of getting to that 60-vote threshold sometime next week,\" Mark Meadows, the White House chief of staff, said in a televised interview Tuesday.. His comments echoed those of Sen. John Barrasso, a Wyoming Republican who presided over a brief ceremonial session of the Senate earlier today. \"We have a focused, targeted solution that we hope that the House would pass and the House would agree to. It's focused on getting people back to work, getting kids back to school,\" he told a reporter after the session. \"That's the goal, is to come back and vote to move to that,\" Barrasso said. The Republican-led Senate returns Tuesday after its traditional summer break that began this year on Aug. 13. The Democratic-held House of Representatives comes back the week after, though some House committees will be in action next week to tee up bills for floor action later. Little has changed since both chambers saw their members leave for the summer break. The White House has taken executive actions it says will help keep the economy afloat after some provisions of the CARES Act lapsed, though there is disagreement over how timely and effective measures will be. In the meantime, both House Democrats and the White House have edged away from previous positions on the size of a package. House Speaker Nancy Pelosi has said Democrats would accept a $2.2 trillion deal, down from the $3.4 trillion price tag of the bill the House passed in May. Meadows has said the White House has offered a $1.3 trillion proposal, up from the $1.1 trillion. But what would be in those packages and how much would go where appeared to still be far from resolved. U.S. Treasury Secretary Steven Mnuchin, testifying before a House committee set up to oversee coronavirus relief efforts, said he thought a deal was still possible. \"I believe a bipartisan agreement still should be reached and would provide substantial funds for schools, testing, vaccines, PPP for small businesses, continued enhanced unemployment benefits, child care, nutrition, agriculture, and the U.S. Postal Service, along with liability protection for universities, schools, and businesses,\" he said in his opening statement to the panel. Mnuchin, only days before the next monthly jobs report is to be released, said the CARES Act passed in March had helped the economy mend and that it continued to rebound. \"For the third month in a row, the jobs report exceeded forecasts, with a gain of 1.8 million jobs in July. This brings our three-month total gain to more than 9 million jobs, meaning that over 41 percent of jobs lost due to the pandemic have been recovered,\" he said. Meadows said more unilateral actions by the White House were a possibility in lieu of a new deal, including potentially help for the airline industry, which is looking at layoffs. \"We're looking very closely at a number of executive actions,\" he said. \"Whether we can actually do that to help the airlines or not still remains an open question.\" Meadows said he met late yesterday with President Donald Trump on the issue of airlines aid specifically. Pelosi has said the White House has not taken the coronavirus seriously enough and has refused to pony up the money necessary to fight it. It's also dismissed the science on the disease, she said Monday evening in an interview on MSNBC. \"What further evidence does anyone need that this President didn't care less about the spread of this virus than to see what he did, vandalizing, by the way, the White House by bringing all those people there, no masks, no distancing and the rest?\" she asked.  \"He slapped science right in the face, and what a bad example that was.\""}]}