{"article": [{"url": "https://www.marketwatch.com/story/what-google-and-amazon-are-doing-to-comply-with-californias-new-privacy-law-2020-08-18", "published": 1597751480.0, "headline": "What Google and Amazon are doing to comply with California's new privacy law", "body": "Three of the most prominent companies in the U.S. are taking steps to change their services to avoid running afoul of the California Consumer Privacy Act. Google parent Alphabet Inc. GOOGL, +1.82%  GOOG, +1.97%  , Facebook Inc. FB, +0.26%  , and Amazon.com Inc. AMZN, +3.01%  are the top three collectors of digital advertising revenue in the U.S., which puts them at risk from the CCPA, which California's attorney general began to enforce this summer. The three companies command 62% of the digital ad market, or a combined $83.8 billion in 2020, according to researcher eMarketer. The most vulnerable, Facebook, singled out CCPA as a potential headwind in its second-quarter earnings conference call in late July. The social-networking giant is expected to glean almost all of its approximately $80 billion in 2020 revenue through advertising, and has taken steps to comply with the law. See also: California's landmark privacy law is Facebook's next 'nightmare' The business models of Google and Amazon are more diversified - each boasts multibillion-dollar cloud- and e-commerce-based businesses in addition to ad sales. Yet both have made changes to adhere to CCPA. â\u0080¢ Google in November unveiled technology tools for advertisers and publishers so they can disable personalized ad serving and restrict how data is processed through Google Ads, App Campaigns, and Google Analytics. Google also adopted the Interactive Advertising Bureau's Tech Lab's technical specs for compliance with CCPA, allowing for opt-out requests and restricting data processing for AdSense, AdMob, and Ad Manager. â\u0080¢ Amazon's strict data guidelines prohibits Amazon.com sellers from using a customer's personal data to do anything other than fill orders and carry out vital customer service-related functions. An addendum to Amazon's advertising API licensing agreement puts the onus on whoever is using the API to comply with \"all applicable laws and data protection laws (e.g., GDPR, CCPA.)\" Another Amazon policy lays out unbending rules for using its remarketing and conversion pixels."}]}