{"article": [{"url": "https://www.marketwatch.com/story/senate-gop-effort-to-forge-new-coronavirus-bill-off-to-rocky-start-11595366834", "published": 1595352920.0, "headline": "Senate GOP effort to forge new coronavirus bill off to rocky start", "body": "Sen. Rand Paul speaks to the media after the weekly policy luncheon on Capitol Hill on Wednesday. Getty Images Less than 48 hours into trying to hammer out another massive coronavirus aid bill, there were signs Congress was already in danger of falling behind schedule. Senate Majority Leader Mitch McConnell said Tuesday he hoped to unveil Senate Republicans’ bill — their counteroffer to a $3.4 trillion Democratic bill passed by House Democrats in May — “in the next few days.” “We’re not settled yet, but we’re getting there,” Sen. John Kennedy, a Louisiana Republican, said after a Senate lunch meeting of GOP senators. There were signs of revolt in the GOP ranks. Sen. Rand Paul, a Kentucky Republican, sarcastically suggested he had accidentally gone to the wrong meeting, because of the talk in the closed-door meeting of $105 billion for schools and colleges. “The majority of Republicans are now no different than socialist Democrats when it comes to debt,” Paul tweeted. A slow start is not helpful for a bill that both White House officials and House Democratic leaders have publicly said they want to wrap up by July 31. As recently as last week, it was hoped the Senate bill would be unveiled Tuesday or Wednesday. McConnell’s comments came after a White House’s delegation — Treasury Secretary Steven Mnuchin and chief of staff Mark Meadows — heard from Republican senators on a range of priorities, but the meeting ended without broad agreement. Meadows tried to put the meeting in the best light possible. “As you can imagine, any time you have Senate Republicans there, you have a number of different thoughts on what should or should not happen, and I can tell you that all the input that we got will actually have an impact on the bill that we actually end up with,” Meadows told reporters after the meeting. One factor driving the July 31 date is the end of the $600-a-week add-on to the benefit checks of people on unemployment rolls. The last add-on payment will be distributed this week, and a quick turnaround on renewing it or changing it, some lawmakers hope, will mean only a short interruption. But that depends on, in McConnell’s bargaining framework, getting a bill the White House and Senate Republicans can agree on, getting Senate Democrats to relent on the threat of a filibuster and allow it to be considered on the floor, and getting the measure in a likely revised form over to the House, for Democrats there to have a say. While the House is scheduled to go into recess at the end of the month, the Senate is slated to remain in session through the first week of August, leaving open the possibility of schedule slippage. Asked by a reporter after the meeting if he expected to meet the July 31 deadline, McConnell laughed and said “no.” Similarly, Rep. Steny Hoyer, the second-ranking Democrat in the House, told reporters on his weekly press call that Democrats were prepared to stay beyond July 31 to get a bill done. If there’s a bill that can pass both chambers of Congress and be signed by Trump, Hoyer said, “we will take whatever time is needed, whenever it is needed, to pass that bill because it is critically important for the welfare of the American people.” Still, McConnell did lay out a few elements he does expect to be in the bill: coronavirus-related liability protections for establishments, another round of direct payment stimulus checks for individuals, an extension of the Paycheck Protection Program for small businesses and $105 billion for schools to help them deal with the virus and reopen. He did not mention a payroll tax break, which the White House has continued to push. White House spokeswoman Kayleigh McEnany said President Donald Trump was “very clear” he wanted the payroll provision. Hoyer, though, said Mnuchin’s time would be better spent on other ideas. “The Treasury Secretary, I think, certainly has a good sense that this is not an option that is very viable in the Congress, that there are a lot of other viable options,” he said. The emerging Senate bill would cost at least $1 trillion and McConnell said he would not put a bill on the Senate floor that didn’t include the liability protections. Sen. Chuck Schumer, the New Yorker who leads Senate Democrats, said Republicans needed to move faster. “They can’t even get their own act together. They can’t even put a bill together among themselves,” he said."}]}