{"article": [{"url": "https://www.marketwatch.com/story/oil-futures-trade-at-highest-level-since-march-as-trump-assures-market-china-trade-pact-remains-intact-2020-06-23", "published": 1592925560.0, "headline": "Oil futures end lower as U.S.-China trade tensions, rise in COVID-19 cases feed demand uncertainty", "body": "Oil prices gave up earlier gains to finish lower Tuesday, with conflicting U.S. government statements on the status of U.S.-China trade deal and a rise in COVID-19 cases feeding uncertainty over the outlook for energy demand. White House trade adviser Peter Navarro stoked confusion among investors overnight when he told Fox News that the trade agreement was “over” in a Monday evening interview. Trump then tweeted that the deal was “fully intact.” China is one of the world’s biggest importers of oil and news of Sino-American relations can have a seismic impact on global asset prices. Meanwhile, new U.S. coronavirus cases are showing an alarming increase with 28 states showing increasing trends this past week. Read Coronavirus update: U.S. case tally surging with more than half the states trending up as death toll tops 120,000 The demand outlook for oil is “less clear given the uneven recovery thus far as some states are experiencing spikes in new cases,” said Marshall Steeves, energy markets analyst at IHS Markit. West Texas Intermediate crude for August US:CLQ20, on its first full trading day as a front-month contract, fell by 36 cents, or 0.9%, to settle at $40.37 a barrel. Prices on the New York Mercantile Exchange had traded as high as $41.63, according to FactSet data. Global benchmark Brent oil for August delivery UK:BRNQ20 fell by 45 cents, or 1%, to settle at $42.63 a barrel on ICE Futures Europe, following a 2.1% gain a day earlier. On Monday, both contracts settled at their highest since early March, according to FactSet data. For the month so far, prices trade higher on signs that global economies are reviving after many businesses were shutdown around the world for a couple of months to combat the spread of the coronavirus pandemic. For example, in data published Tuesday the IHS Markit purchasing managers index for the eurozone—a measure of activity in the manufacturing and services sectors—rose to 47.5 in June from 31.9 in May to reach its highest level since February, the month before lockdowns began in Europe. Measures of U.S. economic health also have shown evidence of improvement, which could be a positive for demand expectations for crude, experts say. On Tuesday, the IHS Markit U.S. flash manufacturing PMI reading showed a rise to 49.6 in June, from 39.8 the prior month. New U.S. homes sales, meanwhile rose 16.6% in May to annual rate of 676,000. The market has also recently drawn support from an agreement between the Organization of the Petroleum Exporting Countries and its allies, in a group known as OPEC+, to reduce global output by nearly 10 million barrels a day through the end of July. “Compliance with the OPEC+ cuts has been high and the laggards (i.e. Nigeria, Iraq) have been corralled into adhering to their quotas, with Iraq even making up for overproduction in May,” said Steeves. “With U.S. production in decline, the supply outlook is supportive.” Supplies in the U.S. are expected to post a modest decline for the week ended June 19, with analysts polled by S&P Global Platts, on average, forecasting that the Energy Information Administration on Wednesday will report a fall of 100,000 barrels in domestic crude supplies. They also expect to see a decrease of 1.9 million barrels in gasoline stockpiles, while distillate inventories are likely to edge up by 100,000 barrels. Back on Nymex, July gasoline US:RBN20 added 0.6% to $1.2994 a gallon, while July heating oil US:HON20 fell 1.3% to $1.203 a gallon. Read:Why gasoline is set to lead a bumpy rebound in transportation fuels July natural gas US:NGN20 settled at $1.637 per million British thermal units, down 1.6%."}]}