{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-tick-higher-after-data-highlights-recovering-chinese-factories-2020-08-03", "published": 1596470960.0, "headline": "Treasury yields climb after factory data offers positive sign for global economy", "body": "U.S. Treasury yields rose Monday as strong manufacturing data across the U.S., Europe and China suggested the global economic recovery was on track despite mounting worries how rising coronavirus infections could stall growth.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was up 2.6 basis points to 0.551%, while the 2-year note rate TMUBMUSD02Y, 0.156% held steady at 0.111%. The 30-year bond yield TMUBMUSD30Y, 1.576% climbed 4.6 basis points to 1.244%. What’s driving Treasurys? The Institute for Supply Management said its U.S. manufacturing index rose to 54.2% from 52.6% in June, marking the highest level in 15 months. Any number above 50 represents an expansion in economic activity. And a pickup in Chinese factory activity showed the world’s second-largest economy was continuing to stabilize. China’s July Caixin Manufacturing PMI bouncing to 52.8, the highest since Jan. 2011. Global equity markets climbed on the positive economic sentiment. The Stoxx Europe 600 SXXP, +0.55% traded up 1.6%, while China’s CSI 300 index 000300, +2.04% also gained 1.6%. The S&P 500 SPX, +0.87% and the Dow Jones Industrial Average DJIA, +0.56% also posted gains on Monday. See: Why August in a pandemic is a time for vigilance for stock market investors Lawmakers in Congress butted heads over an additional coronavirus relief package. Discussions have revolved around the generosity of unemployment benefits, with Democrats looking to preserve the original $600 a week amount while Republicans have looked to trim that number. Meanwhile, reports indicate that the Federal Reserve was on course to break away from its previous monetary-policy approach of raising rates as soon as inflation reached the central bank’s 2% target, according to the Wall Street Journal. Instead, the Fed would allow inflation to run above 2% for some time to make up for periods when prices undershot the target. Dallas Fed President Robert Kaplan on Monday said the rebound this quarter was more muted than he expected, suggesting the unemployment rate could run higher than previously thought.What did market participants’ say? ”Some economists and strategists have even been suggesting a double-dip [in the economy] is inevitable.” said Steven Ricchiuto, chief economist at Mizuho. “As such, the July data due to be released this week will be a critical test of this scenario,” he said."}]}