{"article": [{"url": "https://www.marketwatch.com/story/both-trump-and-biden-are-overlooking-the-simplest-way-to-encourage-made-in-america-manufacturing-11600707334", "published": 1600707140.0, "headline": "Both Trump and Biden are overlooking the simplest way to encourage â\u0080\u0098Made in Americaâ\u0080\u0099 manufacturing", "body": "Getty Images Both Democratic nominee Joe Biden and President Donald Trump are campaigning on a â\u0080\u009cMade in Americaâ\u0080\u009d message, promising that their tax policies will help revitalize American manufacturing and bring jobs back from overseas. But Biden and Trumpâ\u0080\u0099s convoluted new tax policy ideas are unlikely to deliver the promised results. Neither candidateâ\u0080\u0099s plan would fix the issues in the current tax code that prevent companies from investing in the United States in the first placeâ\u0080\u0094and in some cases, they would make things worse. Bidenâ\u0080\u0099s overarching tax policy vision is imposing higher taxes on businessesâ\u0080\u0094a position which will certainly undermine the limited incentivesÂ he recently announcedÂ for businesses that invest in â\u0080\u009crevitalizing closed or nearly closed facilities, retooling or expanding facilities, and bringing production or service jobs back to the U.S. and creating U.S. jobs.â\u0080\u009d Some of Bidenâ\u0080\u0099s higher business taxes include raising the corporate tax rate from 21% to 28%, applying a 15% minimum tax based on profits reported on financial statements, instituting a 10% surtax on services and sales to U.S. customers from a U.S. companyâ\u0080\u0099s foreign affiliate, and changing the minimum tax policy that the U.S. applies to foreign profits of U.S. companies. TheÂ net effectÂ of the Biden tax increases will likely outweigh any positive effect of his limited, 10% â\u0080\u009cMade in Americaâ\u0080\u009d tax creditâ\u0080\u0094in other words, Biden is likely to move the tax policy calculus in the opposite direction, away from more investment in the United States. Trumpâ\u0080\u0099sÂ tax planÂ is much lighter on detail. He, like Biden, proposes a â\u0080\u009cMade in Americaâ\u0080\u009d tax credit as well as â\u0080\u009cTax Credits for Companies that Bring Back Jobs from Chinaâ\u0080\u009d and â\u0080\u009c100% Expensing Deductions for Essential Industries like Pharmaceuticals and Robotics who Bring Back their Manufacturing to the United States.â\u0080\u009d The president has also mentioned the potential ofÂ imposing tariffs on companiesÂ that do not move jobs back to the United States from overseas. While both candidates dream up new â\u0080\u009ccarrot-and-stickâ\u0080\u009d regimes that, in practice, would beÂ incredibly complexÂ to design, let alone enforce, a simpler solution hides in plain sight: end the disincentives for business investment that currently exist in the U.S. tax code. Generally, when a business has an expense, it can deduct that expense on its tax return in the same year. But for many types of capital expenses, businesses have to stretch those costs out over time periods that range up to 39 years. The result, when we account for inflation and the time value of money, is that the U.S. tax code does not allow businesses to deduct the full cost of their capital investments. This inability to fully deduct capital expenses is effectively a Â â\u0080\u009cfactory tax,â\u0080\u009d imposing a needless barrier for capital formation in the United States that stands in the way of the â\u0080\u009cMade in Americaâ\u0080\u009d revitalization both candidates aim to promote. Whatever we call it,Â tax policy under current law can hinder private investmentÂ and thus create a drag on innovation, productivity, employment, wage growth, and economic growth. Over the next few years, this treatment is scheduled to worsen as provisions that let businesses immediately deduct their research and development expenses and machinery and equipment investments end. Instead of promising limited tax credits that are inefficient at best, the candidates should seize on the opportunity to improve cost recovery treatment across all sectors and all investments. Not only is this aÂ proven strategy for boosting investment, it would be easier to administer and more neutral than trying to pick winners and losers by applying selective provisions in a piecemeal fashion across favored industries or types of investment. Ultimately, any policy proposal that falls short of full cost recovery will leave tax policy hurdles standing in the way of investment and reduce the likelihood that either candidate will deliver on their promises. Now read: How a President Biden or a President Trump could affect the student-debt crisis and college affordability Also: How Trump and Biden tax policies could affect your paycheck, tax return, investment portfolio and nest egg Erica York is an economist at the nonpartisan Tax Foundation in Washington, D.C. Follow her on Twitter @ericadyork."}]}