{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-climbs-above-26-million-and-republican-leaders-urge-americans-to-wear-face-masks-2020-07-01", "published": 1593671360.0, "headline": "Coronavirus update: U.S. case tally climbs above 2.6 million, and top Republicans now call on Americans to wear face masks", "body": "The number of confirmed cases of the coronavirus illness COVID-19 in the U.S. climbed above 2.6 million on Wednesday, a day after Dr. Anthony Fauci said new cases could spike to more than 100,000 a day if the fresh clusters emerging in southern and western states are not brought under control. Cases have been rising in 35 states in the last 14 days, according to a New York Times tracker, led by California, Texas and Florida. State officials in Texas, California, Florida, Arizona and Kansas, among others, have taken measures in the past few days to encourage their citizens to stop gathering indoors and to observe the measures that health experts say are crucial to containing the spread — hand washing, social distancing and wearing face masks. The politicization of face masks has dismayed public health experts and put the lives of vulnerable Americans at greater risk. The Republican leadership has now got the message, and are concerned that President Donald Trump has not, as the Associated Press reported. Sen. Lamar Alexander, a Tennessee Republican, expressed his frustration on Tuesday: “Unfortunately, this simple, lifesaving practice has become part of a political debate that says: If you’re for Trump, you don’t wear a mask. If you’re against Trump, you do.” Vice President Mike Pence and Senate Majority Leader Mitch McConnell have spoken out in recent days, and both have urged Americans to wear masks when they are unable to socially distance. “Put on a mask — it’s not complicated,” McConnell, a Kentucky Republican, said during his weekly news conference on Tuesday. Surgeon General Jerome Adams agreed. “If you want the return of college football this year, wear a face covering. If you want a chance at prom next spring, wear a face covering,” Adams said. Research conducted by the University of Washington published last week found that more than 30,000 deaths could be avoided by October if 95% of Americans wear face masks in public spaces, and states could move ahead with reopening their economies more safely. “People need to know that wearing masks can reduce transmission of the virus by as much as 50%, and those who refuse are putting their lives, their families, their friends, and their communities at risk,” said Dr. Christopher Murray, director of the university’s Institute for Health Metrics and Evaluation. The issue has taken on extra weight as the U.S. heads into the July 4 weekend, a holiday typically marked by barbecues and other gatherings, including fireworks displays. New York City Mayor Bill de Blasio said Wednesday that indoor dining will remain closed when the city moves into the next phase of reopening next week. New York Gov. Andrew Cuomo is expected to make the same announcement for the state later in the day. New York has succeeded in reducing its infection rate after strict lockdown measures that are gradually being lifted. Fauci Warns Coronavirus Cases Could Reach 100,000 a Day Latest tallies There are now 10.5 million confirmed cases of COVID-19 worldwide, and at least 512,331 people have died, according to data aggregated by Johns Hopkins University. At least 5.4 million people have recovered, the data show. The U.S. continues to lead the world, with a case tally of 2.64 million and death toll of 127,681. Brazil is next with 1.4 million cases and 59,594 deaths. Russia is third measured by cases at 653,479, followed by India with 585,481 and the U.K. with 314,991. The U.K. has 43,991 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 84,813 cases and 4,641 fatalities. See also:No Americans, for now — EU shuts out travelers from U.S. as it reopens to more than a dozen countriesWhat’s the latest medical news? Drug giant Pfizer Inc. PFE, -0.27% and partner BioNTech SE BNTX, +1.23% were actively traded on Wednesday, after the companies said that all 24 participants in a Phase 1/2 clinical trial who received one of two lower doses of a COVID-19 vaccine candidate developed neutralizing antibodies, as MarketWatch’s Jaimy Lee reported. This data were shared by the companies and also published in a preprint study, meaning it has not been peer-reviewed. The study has 45 participants between the ages of 18 and 55 who were randomized and vaccinated, 24 of whom received two rounds of two lower doses of the vaccine candidate. (Twelve participants received one high dose, and nine received two doses of the placebo.) Read:Why virus stocks are driving market volatility The antibody findings are important because they indicate that the experimental vaccine can generate antibodies at the same level or higher than those seen in convalescent sera, which is collected from people who have recovered from COVID-19. There were no serious adverse events reported in the trial, although some reported pain in the area of the body where the investigational vaccine was administered. Pfizer said additional data from this trial will inform the selection of a vaccine candidate — the companies are evaluating four COVID-19 vaccine candidates — and dosing level for the Phase 2b/3 study, which could begin this month, with up to 30,000 participants. Health officials in Europe have criticized the U.S. government for buying up all of Gilead Sciences Inc.’s GILD, +0.82% remdesivir, the Guardian reported. The drug is a former Ebola treatment that has been repurposed as a treatment for COVID-19. The drug speeds up recovery times for severely ill, hospitalized patients and has received an emergency-use authorization from the Food and Drug Administration. The U.S. will receive 500,000 doses through September that can be purchased by U.S. hospitals. That’s equal to 100% of Gilead’s total remdesivir production in July and 90% in August and September. Don’t miss:Here’s the latest on what we know works — and doesn’t work — in treating coronavirus infectionsWhat’s the economy saying? American manufacturers fired up their production lines in June and expanded for the first time since the start of the coronavirus pandemic almost four months ago, but growth hasn’t returned to pre-crisis levels and is unlikely to do so anytime soon, MarketWatch’s Jeffry Bartash reported. The Institute for Supply Management said its manufacturing index climbed to 52.6% from 43.1% in May and an 11-year low of 41.5% in April. Economists surveyed by MarketWatch had forecast the index to produce a reading of 50.2%. Readings over 50% indicate more companies are expanding instead of shrinking. See also: Consumer confidence jumps to 3-month high but remains well below levels before the coronavirus pandemic What’s unclear is the extent to which a recent spike in COVID-19 cases in states such as Texas, California and Florida derails the recovery. Timothy Fiore, chairman of the ISM survey, said so far the institute has not seen concrete evidence of backsliding, but he acknowledged viral flare-ups are likely to cause economic disruptions. “The renewed upturn in COVID-19 infections across the South and West in recent weeks poses a downside risk, but with states initially attempting to control the outbreaks with targeted restrictions on bars and other public venues, for now the manufacturing sector appears to be relatively less exposed,” said senior U.S. economist Andrew Hunter of Capital Economics. Don’t miss:MarketWatch’s Coronavirus Recovery Tracker The Commerce Department said outlays for construction projects fell 2.1% in May at a seasonally adjusted annual rate of $1.36 trillion. Economists polled by MarketWatch had expected a 0.7% increase. Spending in April was revised to a 3.5% fall from the prior estimate of a 2.9% drop. Residential construction fell 3.9% in May, while spending on public construction projects rose 1.2%. Separately, Automatic Data Processing Inc. said private-sector employers added 2.37 million jobs in June, against expectations for a gain of 3.5 million, MarketWatch’s Greg Robb reported. The ADP report, which comes a day before the Labor Department releases its nonfarm-payrolls report for June, has not fully lined up with government data since the start of the pandemic, but, on a longer time frame, the two are trending in the same direction. Read: Fed’s Williams warns that U.S. economy far from healthy even if worst of the coronavirus outbreak is over “Overall, a gain in private and total payrolls in June will be welcome news and will extend the gains in May. Even so, the unemployment rate will likely remain high, signaling that conditions in the labor market remain weak with a renewed threat to activity and jobs from a resurgence in virus infections,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics.What are companies saying? FedEx Corp. FDX, +0.18% proved it’s one of the beneficiaries of the pandemic with better-than-expected earnings for its fiscal fourth quarter, as the surge in online buying offset higher costs and thinner margins. The quarter was “severely affected” by the COVID-19 pandemic, Chief Executive Frederick W. Smith said in a statement. Thanks to “herculean efforts” by employees and the company’s investments in improving capacity and efficiencies, “FedEx is well-positioned to support and benefit from the reopening of the global economy,” he said. Shares of plant-based-meat-substitute maker Beyond Meat Inc. BYND, +0.80% rose more than 8%, after the company said it’s making its retail-store debut in China via a partnership with e-commerce giant Alibaba Group Holding Ltd. BABA, -0.26%. The company plans to make its Beyond Burger available in 50 Freshippo stores in Shanghai starting this weekend. Freshippo stores are Alibaba’s futuristic supermarkets that aim to fuse the physical and digital shopping experiences. Elsewhere, there were positive earnings reports from food company General Mills and booze company Constellation Brands. But Michael Kors’s parent was hurt by store closures during the pandemic and posted a large loss. Here’s the latest news about companies and the pandemic: • Michael Kors parent Capri Holdings Ltd. CPRI, +2.55% reported a fourth-fiscal-quarter adjusted profit that missed expectations, while revenue fell less than forecast. After closing all of its 455 Michael Kors, Versace and Jimmy Choo retail stores in the Americas in March as a result of the pandemic, about 70% are now open, and the “vast majority” of the remaining stores are expected to be opened by the end of the company’s second quarter. Among Capri’s business segments, Michael Kors revenue fell 18.4% to $872 million to beat expectations of $840.5 million, Versace revenue grew 55.5% to $213 million to top expectations of $165.6 million and Jimmy Choo revenue declined 23% to $107 million to miss expectations of $111.9 million. Capri did not provide guidance for fiscal 2021, citing the lack of visibility surrounding the pandemic. • Denny’s Corp. DENN, +0.76% priced its offering of 8 million shares at a discount. The offering, which represented 14.4% of the shares outstanding, priced at $9.15, or 9.4% below Tuesday’s closing price of $10.10. The company plans to use the proceeds from the offering for general corporate purposes. Separately, Denny’s announced plans to hire 10,000 restaurant employees, for both company-owned and franchised restaurants across the U.S. The hiring comes as dine-in restrictions, which were implemented as a result of the COVID-19 pandemic, are lifting and as customers are returning to restaurants and taking advantage of takeout and delivery options. • General Mills Inc. GIS, +0.78% beat earnings estimates for its fourth quarter, boosted by strong demand for at-home food during the pandemic. “The COVID-19 pandemic has had a profound impact on consumer demand across the company’s major markets, including driving an unprecedented increase in demand for food at home and a corresponding decrease in away-from-home food demand resulting from efforts to reduce virus transmission,” said the company. At-home food accounted for about 85% of its pre-pandemic net sales and away-from-home food accounted for 15%. At-home demand in North America drove higher sales of meals, baking ingredients and cereal. The impact was less elevated in Europe and Australia. The pet segment benefited from stocking up, which partially unwound at the end of the quarter. The company is not providing guidance because of the uncertainty caused by the pandemic, but will work to reduce leverage. • Macy’s Inc. M, -0.95% reported first-fiscal-quarter results that matched Wall Street expectations, and said nearly all of its stores have reopened, after closing amid the pandemic. Sales fell 45.2% to $3.02 billion, matching the FactSet consensus. “While our stores are re-opened, we expect that the COVID-19 pandemic will continue to impact the country for the remainder of the year,” said Chief Executive Jeff Gennette. “We do not anticipate another full shutdown, but we are staying flexible and are prepared to address increases in cases on a regional level.” Macy’s said it would not provide a financial outlook. • United Airlines Holdings Inc. UAL, +0.32% is adding nearly 25,000 flights to its August schedule, which will be triple the June schedule. That would bring the air carrier’s overall August schedule to 40% of its August 2019 schedule. In the U.S., United plans to fly 58% of its 2019 schedule, up from 30% in July, while internationally, United is scheduled to fly 25% of its August schedule, up from 16% in July. “We’re taking the same data-driven, realistic approach to growing our schedule as we did in drawing it down at the start of the pandemic,” said Ankit Gupta, United’s vice president of domestic network planning. “Demand is coming back slowly and we’re building in enough capacity to stay ahead of the number of people traveling.” • Whirlpool Corp.’s WHR, +0.60% job cuts will result in about $95 million in severance and other employee-related costs, the company said in a filing. Restructuring charges for fiscal 2020 are now expected to range from $260 million to $280 million, which includes a previous expectation of costs around $100 million, expenses with the job cuts, “and anticipated additional restructuring actions in 2020.” The company announced a plan to cut jobs on Friday as part of its “continued cost reduction efforts.” It did not say how many employees would be affected. The workforce-reduction plan includes voluntary retirement and layoffs, and it is expected to be completed this year. • Trucking company YRC Worldwide YRCW, +1.83% expects to receive a $700 million CARES Act loan from the U.S. Treasury. “YRCW and its operating companies Holland, New Penn, Reddaway, and YRC Freight have been significantly impacted by the COVID-19 pandemic,” the company said. The companies employ 30,000 drivers, including 24,000 members of the Teamsters union, it said. YRC will use the funds from the bailout plan to pay health care and pension costs and meet other contractual obligations and to support essential capital investment. In return for the loan, the U.S. Treasury will receive a 29.6% equity stake in the company."}]}