{"article": [{"url": "https://www.marketwatch.com/story/retirees-should-consider-todays-most-unpopular-investment-heres-why-2020-07-20", "published": 1595943500.0, "headline": "Retirees should consider today's most unpopular investment - here's why", "body": "Have you ever wondered what investment today is the most out of favor? Most of us never even ask this question, since such investments by definition don't even appear on our radar screens. But, as contrarians constantly remind us, we are vulnerable to making big mistakes by blindly following the consensus, as well as to missing some truly once-in-a-generation opportunities. A great example is U.S. Treasurys in 1981, when inflation had been running in the double-digits for several years, the 10-year T-Note yielded close to 16%, and you could hardly give Treasurys away. Retirees who decades previously had invested their portfolios in bonds had suffered what some had described as the biggest destructions of wealth in history. 80% of older Americans can't afford to retire - COVID-19 isn't helping One who nevertheless turned bullish was Dan Seiver, currently a member of the economics faculty at Cal Poly in San Luis Obispo, Calif., and editor of the PAD System Report advisory service. Seiver says that his investment helped pay for his daughter's Ivy League tuition. The question with which I led my column can perhaps be rephrased: Which investment is as out of favor today as Treasurys were 40 years ago? UBS Financial Services recently presented an analysis that helps us answer this question. They approached it by measuring how expensive it is to hedge potential losses of different assets. When hedging is expensive, then we can say it is not out of favor. But just the opposite is the case when hedging is cheap. UBS went about their analysis by measuring the implied volatilities of various asset classes and comparing today's levels to their historical distributions since 2010 (see accompanying chart). In the case of most asset classes, as you can see, hedging is quite expensive right now. But the one for which hedging is historically very cheap is inflation. The implication is that now would be a good time to invest in inflation hedges. Think of it as cheap insurance against the possibility that inflation is unexpectedly high in coming years. And it wouldn't take much for that insurance policy to pay off. Currently, the break-even 10-year inflation rate is just 1.1% annualized; the 30-year break-even rate is 1.5%. In other words, investors collectively are betting that inflation will be really, really low for at least the next 30 years. That's just the opposite of the assumption that investors had in 1981 when you couldn't give Treasurys away. TIPS Perhaps the most straightforward way of hedging against inflation in coming years is by investing in TIPS-Treasury inflation-protected securities. These bonds' returns are pegged to the Consumer Price Index, so they automatically return more when inflation is higher. Many retirees and soon-to-be retirees nevertheless are avoiding TIPS these days because their stated yields are negative. The 10-year TIPS, for example, currently is quoted with a yield of minus 0.65%. That headline yield triggers loss aversion among most of us, keeping all but the most fearless from even considering TIPS. But retirees are being misled if they think of these negative yields in nominal terms. They instead are real yields-yields relative to inflation. So a better way to think of the current TIPS yields is that your return over the next 10 years will be 0.65% below whatever the CPI's rate of growth will be. For example, if the CPI increases 10% annualized over the next decade, your return would be 9.35% annualized--guaranteed. No other inflation hedge is guaranteed to rise in lockstep with inflation. Other asset classes might do better than 9.35% annualized in such a decade, but there's no assurance of that. Take stocks, which historians have found to outperform inflation by the greatest amount over very long periods. Since 1802, in fact, according to data from Wharton professor Jeremy Siegel, U.S. equities have beaten inflation by 6.8% annualized. But in the worst decade for inflation over the last century-from the early 1970s to early 1980s-the S&P 500 lagged the CPI by 4.0% annualized, even after taking dividends into account. An alternative strategy for hedging inflation would be to go short Treasury bonds. That would be precisely the opposite strategy that Seiver pursued in the early 1980s. In an email, however, Seiver said that he is not currently recommending such a strategy. That's not because he thinks T-Bonds should be purchased; on the contrary, he says that \"T-Bonds no longer deserve anything like a AAA-rating.\" But the problem with going short is that there is a substantial carrying cost on the investment until it eventually turns a profit. \"Anyone who puts this short on now could be really sorry for years.\" What about inflation-indexed annuities? Another possible hedging strategy, especially for retirees, is to purchase an inflation-indexed annuity. Though there are many different types of annuities, the traditional version (a nominal annuity) pays a certain fixed sum every month until you (or perhaps a spouse) dies. An alternative is to purchase an annuity whose monthly payment is indexed to inflation. A potential roadblock to this strategy is that few annuity providers are even offering annuities indexed to the Consumer Price Index. That's not because hedging against inflation isn't cheap, but because investor demand for such annuities is so low. One reason demand is so low is that the initial year's payout of an inflation-adjusted annuity will be a lot lower than of a nominal annuity, and when retirees aren't worried about inflation that seems unfair. But think about it this way. Even if inflation over the next 40 years is what the markets currently are expecting-1.5% annualized-an inflation-indexed annuity's payout 40 years from now will be nearly double what it is in the first year. And, by the same token, the inflation-adjusted value of a nominal annuity's payout will be nearly half of what it is today. And if inflation averages 3% annualized over the next 40 years, the inflation-indexed annuity's payout in 2060 will be more than three times larger than in the first year. And the nominal annuity's payout will be worth less than a third as much. Those are huge differences. Michael Crook, head of UBS Financial Services' Americas Investment Strategy, acknowledged in an email these difficulties in getting investors to appreciate the value of inflation protection. But he nevertheless says he \"certainly would encourage retirees to purchase an inflation-adjusted annuityâ\u0080¦If a retiree is concerned about the cost of inflation protection in the annuity, my advice would be to find a provider that will price annuities that are identical except for the inflation step up and then calculate the implied inflation break-even between the two policies to make sure it is reasonable.\" What about gold? Finally I want to mention gold, which many investors believe is the most obvious inflation hedge. I discussed the yellow metal's inflation-hedging potential in a recent Retirement Weekly column, so won't repeat what I said there. Suffice it to say that while gold could very well be the best-performing asset if inflation unexpectedly heats up, it is by no means guaranteed to do so. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. Hulbert can be reached at mark@hulbertratings.com."}]}