{"article": [{"url": "https://www.marketwatch.com/story/the-number-of-americans-skipping-mortgage-payments-drops-for-the-first-time-since-march-2020-06-22", "published": 1592845280.0, "headline": "The number of Americans skipping mortgage payments drops for the first time since March", "body": "Fewer homeowners across the U.S. are pausing their mortgage payments, in the latest sign that real-estate sector is rebounding from the coronavirus. But whether this trend continues will depend on how smoothly the economy’s recovery goes. As of June 14, only 4.2 million homeowners were in forbearance plans, down from 4.3 million the week prior, according to data released Monday afternoon by the Mortgage Bankers Association. It is the first time that figure has decreased since the industry trade group began tracking this data in March as mortgage servicers began offering forbearance to households affected by the coronavirus pandemic, and the resulting business shutdowns. Under the CARES Act, mortgage servicers were required to provide up to 12 months of relief from mortgage payments to any homeowner with a federally-backed mortgaged, including loans backed by Fannie Mae and Freddie Mac. “Fewer homeowners in forbearance underscores the continued improvements in the job market, and provides another sign of the fundamental health of the housing market, which has rebounded considerably over the past several weeks,” Mike Fratantoni, chief economist at the Mortgage Bankers Association, said in the report. Don’t miss:If you’re skipping your mortgage payments, watch out for this costly mistake The percentage of loans in forbearance also decreased on a weekly basis to 8.48% of mortgages in the U.S. from 8.55%. The decrease was a reflection of more homeowners exiting forbearance plans than entering them. The share of loans backed by Fannie Mae FNMA, +0.73% and Freddie Mac FMCC, +0.52% in forbearance fell for the second consecutive week to 6.31% from 6.38%. The percentage of portfolio loans and private-label securities, which includes all mortgages not sold to federal agencies, also fell. As for loans guaranteed by Ginnie Mae, which include loans backed by the Federal Housing Administration and the Department of Veterans Affairs, the percentage in forbearance has held steady for three weeks now at 11.83%. While the boost in employment sparked by business reopenings has benefited homeowners across the country, that trend isn’t assured to continue, Fratantoni warned. “The big unknown with respect to this positive development is the extent to which it relies upon policy measures put in place to help families through this crisis, particularly the stimulus payments and enhanced unemployment insurance benefits that were key parts of the CARES Act,” Fratantoni said, noting that he nevertheless does expect the forbearance to improve in coming weeks."}]}