{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-fall-only-slightly-in-latest-week-as-some-states-move-to-reclose-2020-07-16", "published": 1594899800.0, "headline": "Jobless claims hit post-pandemic low of 1.3 million, but layoffs could resurge as states impose business restrictions", "body": "The numbers: Initial jobless claims fell slightly in the second week of July to a post-pandemic low of 1.3 million, but the relatively small decline points to persistent stress in the economy as the U.S. struggles to cope with evidence of a resurgence of coronavirus outbreak. New applications for unemployment benefits, a rough gauge of layoffs, fell by 10,000 to 1.30 million from 1.31 million in the prior week, the Labor Department said Thursday. The figures are seasonally adjusted. Economists polled by MarketWatch had forecast 1.24 million new claims in the seven days ended July 11. These figures reflect applications filed the traditional way through state unemployment offices. Some 928,488 new claims for benefits were also filed through a temporary federal-relief program, raising the total for the week to an unadjusted 2.43 million. Rising federal claims have largely offset the decline in state jobless claims over the past month to leave the overall number of new applications basically the same. Read:Soaring demand for federal jobless benefits points to fresh fissures in the economy The number of people receiving traditional jobless benefits through the states, known as continuing claims, fell by 422,000 to 17.34 million in the week ended July 4. That’s the lowest level since mid-April, though it remains to be seen if it keeps falling given the latest fissures in the economy. A much larger 30 million people were receiving benefits through eight state and federal assistance programs as of June 27, the most recent data available. That’s down slightly from an unadjusted 32.4 million in the prior week. MarketWatch is reporting select jobless claims data using actual or unadjusted figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have partly inflated jobless claims during the pandemic and become less accurate. Read:Jobless claims indicate 30 million are still unemployed. Is it really that bad? What happened: New jobless claims were the highest in Florida, Georgia and California — states that have experienced fresh outbreaks of COVID-19. California closed a swath of its economy again this week. Big picture: The decline in new jobless claims has slowed to a crawl in the past month. An economic rebound in May and June has lost momentum in July amid a fresh wave of coronavirus cases that has forced many states to either reimpose partial lockdowns or pause reopening plans. The latest setback is expected to put more people out of work again and delay the return of others to their jobs, making it harder for the economy to recover. Economists say Washington has to extend emergency unemployment benefits and increase other aid to prevent the situation from getting worse. What are they saying? “The trend in initial jobless claims has now just about stopped falling,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics. “Next week could easily see an increase, for the first time since March, in the wake of the continued gradual reimposition of restrictions across the South and parts of the West.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% fell in Thursday trades."}]}