{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-rise-200-points-as-stock-market-shakes-off-rise-in-coronavirus-cases-to-head-for-weekly-gains-2020-06-19", "published": 1592640320.0, "headline": "Stock market gives up early gains to end lower as Apple plans to re-close stores and W.H.O. says coronavirus has entered 'new and dangerous phase'", "body": "U.S. stock indexes gave up strong early gains to close mostly lower Friday, after the World Health Organization signaled that the coronavirus pandemic remains a deadly threat, and Apple said it will re-close some stores due to rising case counts in parts of America, casting doubt on the speed of economic recovery. All three equity benchmarks still made weekly gains though. How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% closed 208.64 points lower, down 0.8%, at 25,871.46, after being as much as 371 points higher at an intraday peak at 26,451.44. The S&P 500 index SPX, +0.87% fell 17.60 points, or 0.6%, to close at 3,097.74, but hit an intraday peak at 3,155.53. The Nasdaq Composite Index COMP, +1.39% added 3.07 points, less than 0.1%, to close at 9,946.12. For the week, the Dow rose 1%, the S&P 500 gained 1.9%, and the Nasdaq returned 3.7%.What drove the market? Stocks were knocked lower after Apple Inc. AAPL, +1.74%  said it would re-close 11 stores in Florida, the Carolinas, and Arizona starting on Saturday, CNBC reported. The World Health Organization at a Friday briefing also said that the coronavirus pandemic has entered a \"new and dangerous phase.\" Some 8.5 million people have been infected with COVID-19 world-wide and the illness has killed at least 456,000, according to data compiled by Johns Hopkins University. The announcements come amid reports of rising coronavirus cases in those states, as well as California and Texas, which all reported record-high, single-day increases on Thursday. \"It seems like any time a COVID headline comes through during the day, markets are reacting,\" said Joe Saluzzi, co-manager of trading at Themis Trading. \"I think we went up a little too much, personally,\" Saluzzi said in an interview. \"The big factor is the Fed. It's a big deal that the Fed's in the market buying corporate bonds,\" he said, referring to the Federal Reserve's efforts to help the economy recover from the financial shock from the public-health crisis. He said, \"I think we are going to be stuck here for a while until there's clarity on the virus, and that could take months. I don't think we'll see new highs or new lows. I think you'll continue to see this choppiness.\" On Friday, Boston Federal Reserve President Eric Rosengren, in webcast remarks to the Providence Chamber of Commerce, cautioned that the U.S. economy isn't likely to have a fast recovery and more support will likely be needed from the Federal Reserve and Congress, reiterating comments made by Chairman Jerome Powell earlier this week. \"Unemployment remains very high, and because of the continued community spread of the disease and the acceleration of new cases in many states, I expect the economic rebound in the second half of the year to be less than was hoped for at the outset of the pandemic,\" Rosengren said. Stocks earlier got a boost Friday from a report by Bloomberg that China plans to accelerate purchases of American farm goods to comply with the phase one trade deal signed in January. Beijing intends to step up buying of everything from soybeans to corn and ethanol as the economic disruption caused by the coronavirus pandemic has meant China has only reached 13% of the 2020 target under the deal in the first four months of the year. Still, Mike Loewengart, managing director at E-Trade Financial Corp., says that optimism around business activity resuming has overshadowed the market's concerns around other headwinds and helped provide a lift to sectors like energy, real estate and consumer discretionary. \"While supply and demand concerns continue to persist, optimism around reopenings could fuel a comeback,\" he said of the energy sector, \"as more people return to the pump. \"We're seeing similar excitement in the Consumer Discretionary sector with malls and other retailers returning to business as usual,\" he said. Separately, Fed Vice Chairman Randal Quarles, in a speech to the Women in Housing and Finance group, said the Fed will publish results on annual bank stress tests at the end of the month. \"There's probably never been more uncertainty about the economic outlook,\" Quarles said. In economic reports, the U.S. current-account deficit, a measure of the nation's debt to other countries, slipped 0.1% in the first quarter. The current-account deficit fell to $104.2 billion from a revised $104.3 billion in the 2019 fourth quarter. The small decline reflected a lower trade deficit in goods. The current account reveals if a country is a net lender or debtor. Friday also marked quadruple witching day for the quarter as single-stock options, single-stock futures, and stock-index options and stock-futures all expired which may have contributed to the session's volatility. Which stocks were in focus? Shares of Slack Technologies Inc. WORK, +3.36% were off 3.2% Friday after Goldman Sachs analyst Heather Bellini downgraded the stock to sell from neutral. Shares of Epizyme Inc. EPZM, -0.32% were down nearly 8% Friday, the day after it said the Food and Drug Administration had approved Tazverik as a treatment for relapsed or refractory follicular lymphoma. Genetron Holdings Ltd.priced its initial public offering at $16 per American depositary share, selling 16 million ADS to raise $256 million. Used car retailer CarMax Inc. KMX, -1.02%  said Friday it had net income of $4.978 million, or 3 cents a share in its fiscal first quarter to May 31, down from $266.7 million, or $1.59 a share, in the year-earlier period, weighed down by the coronavirus pandemic. Shares fell 6.2%. Penn National Gaming Inc. PENN, -1.50% said Friday that 30 of its 41 gaming and racing properties have resumed operations after shutting down during the coronavirus pandemic. Shares fell initially, but then closed 1.3% higher. Shares of Norwegian Cruise Line Holdings NCLH, +2.91%, Carnival Corp. CCL, +0.51%, and Royal Caribbean Cruises RCL, +2.59%  tumbled after the Cruise Lines International Association announced a voluntary suspension of operations from U.S. ports until Sept. 15 due to the COVID-19 outbreak. The current no-sail order had been set to expire on July 24. Apple Inc. AAPL, +1.74%  shares ticked down 0.6% after reports that the company would re-close some stores in areas where COVID-19 is flaring up again. How did other assets perform? West Texas Intermediate U.S. crude US:CLN20 was up 2% at $39.63 a barrel on the New York Mercantile Exchange, following an OPEC monitoring committee meeting. The commodity is up more than 10% for the week and looking at its highest close since June 8. The greenback rose 0.2% to 97.58, as gauged by the ICE U.S. Dollar index DXY, -0.58%. In bullion trading, August gold US:GCM20 on Comex advanced $21.90, or 1.3%, to settle at $1,753 an ounce, the highest finish for a most-active contract since May 15 and a modest 0.9% weekly gain, according to FactSet data. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was flat at 0.70%. Bond prices move in the opposite direction of yields. In global equities, the Stoxx Europe 600 index SXXP, +0.55% closed 0.6% higher, at 365.46, while the FTSE 100 index UKX, +0.64%  added 1.1% to close at 6,292.60. In Asia markets, China's benchmark CSI 300 index 000300, +2.04%  rose 1.3%, while the Shanghai Composite Index SHCOMP, +1.67% gained 1%, and the Japanese Nikkei NIK, -0.11% climbed 0.5% in Asia trade on Friday. Hong Kong's Hang Seng HSI, -0.30%  advanced 0.7% and South Korea's Kospi rose 0.4%. See:Wall Street's road warriors have spent the past three months grounded. How's that working out?"}]}