{"article": [{"url": "https://www.marketwatch.com/story/some-pet-owners-are-spending-more-than-2000-a-year-on-their-dogs-2020-08-26", "published": 1598448260.0, "headline": "Some pet owners are spending more than $2,000 a year on their dogs", "body": "Owning a dog can take a huge bite out of your budget — as some new pandemic pooch parents are discovering. Springfield, Ore. behavioral specialist Angel Matthews was one of many Americans who brought home a puppy this spring, as sheltering in place and working remotely to stop the spread of the coronavirus — or, in Matthews’ case, getting furloughed — gave many people who would otherwise be away at work all day the chance to care for a pet at home. But her coonhound/chow mix Cookie has been more expensive than she expected: neutering and vaccinations alone ran up more than $700, she told MarketWatch. “The prices are higher significantly due to the pandemic,” she said, perhaps because veterinarians are seeing a boom in business. Still, she feels Cookie’s health and companionship is priceless. “I have a great dog by my side,” she said. And as she previously shared, “We needed each other in this crazy mess.” Read more:‘We needed each other in this crazy mess.’ Is the pandemic a good time to rescue a dog? Matthews is not alone: Animal rescues and shelters have seen a spike in people fostering and adopting dogs and cats during the pandemic. The Society for the Prevention of Cruelty to Animals Los Angeles told the Washington Post that adoptions were double their usual rate in late June, with 10 to 13 a day. On the East Coast, one in four people who began fostering pooches “temporarily” from the Animal Care Centers of NYC at the beginning of the pandemic had adopted them permanently by late June; usually, only one in 10 opt to turn their foster home into a forever home. The ACC of NYC told MarketWatch in March that it had received more than 5,000 applications to foster pets in just a couple of weeks. But what new pet parents might not realize is just how much scratch it takes to keep a pup. The annual cost can range from $650 to $2,115, on average, according to new Rover.com report released on National Dog Day on Wednesday. That comes to $54 to $176 a month. Yet almost half of pet parents (47%) in the new survey admitted that they spend closer to $3,400 on their dogs each year. That’s probably because most dog owners in the survey (58%) said that they still don’t have a designated budget for their four-legged friend, so it’s easy for expenses to add up. These costs include food ($200 to $1,000 a year, according to Rover.com data), routine vet visits ($210), flea and tick prevention (up to $200) and poop bags (up to $60.) And this doesn’t include additional expenses such as emergency vet bills (which can reach $1,500 a year or more), dog training ($90 per session) and pet insurance (up to $1,800 a year.) And bringing home a pandemic puppy, or becoming a dog owner for the first time, comes with its own bundle of bills, Rover.com notes, such as adoption fees ($50 to $500, although this sometimes includes getting the pup spayed or neutered); vaccinations ($75 to $100); a crate ($30 to $150); and puppy house training pads ($10 to $50.) Clearly there is a wide range in what you can spend on a pet, which can depend on the size and breed of the dog, as well as one’s own lifestyle. (Like the people spending thousands on puppy concierge services to find the perfect dog, for example.) Indeed, just under one-third of surveyed dog owners told Rover.com that they budget $100 or less on pet expenses for their pup each month, and the most budget-minded participants in the survey were able to keep their overall costs under $1,000 per year, using hacks like making their own pet toys or switching to cheaper dog food. Related:Americans are willing to wreck their financial futures on behalf of their pets But many folks have a soft spot when it comes to doting on man’s best friend. The American Pet Products Association has reported a steady increase in what people are spending on their dogs over the last few years. Americans dropped $95.7 billion on their pets in 2019, including $36.9 billion on food and treats. The APPA anticipates that people will still spend $99 billion on their dogs this year, even if the pandemic is putting a pinch on many people’s budgets as millions of Americans remain out of work. Indeed, even though Gen X pet owners, in particular, told the APPA that they are worried about the expense of having pets during COVID-19, a higher percentage of them also said that they actually spent more money on their pet in the past month."}]}