{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-rise-ahead-of-feds-policy-statement-2020-09-16", "published": 1600267160.0, "headline": "Gold prices log a third straight gain, then extend gains after Fed policy statement", "body": "Gold futures climbed on Wednesday for a third straight session, then moved even higher after the Federal Reserve said it intends to keep key interest rates near zero through 2023, which is likely to prove bullish for long-term metals investors. The U.S. central bank signaled it plans to keep a key U.S. short-term interest rate near zero at least through the end of 2023 to help the economy recover from the coronavirus. The Fed’s forecasts for 2023, released for the first time, also show the rate staying near zero from now until at least 2024. Read:The Fed is ‘fighting the last battle,’ and here are the risks to its new strategy The Fed “confirmed that it’s not even thinking about thinking about raising rates, with its projections of zeroed interest rates for at least the next four years,” said Brien Lundin, editor of Gold Newsletter. “Moreover, it’s made its goal of higher-than-2% inflation official by including it in is post-meeting policy statement.” That “all adds up to official recognition that real, inflation-adjusted interest rates above zero are not only undesirable, but impossible given the size of the federal debt and its growth trajectory,” he told MarketWatch. “This amounts to an extremely favorable backdrop for gold for years to come.” Shortly after the Fed decision, December gold GCZ20, +2.17% GC00, +2.17% was at $1,974.10 an ounce in electronic trading. It had settled with a gain of $4.30, or 0.2%, at $1,970.50 an ounce, with most-active contract prices again ending at their highest Sept. 1, according to FactSet data. The FOMC announcement “giving off an even more dovish signal is going to help gold break out of this consolidation phase it has been in for the past several weeks,” Peter Spina, president and chief executive officer at GoldSeek.com, told MarketWatch. “It may take some weeks still with some price consolidation finishing up here, but I expect gold to break back above $2,000” in the fourth quarter and set fresh record highs as we close out the year. Prices for gold initially fell, then moved up during Wednesday’s regular session in the wake of U.S. retail sales data, which revealed a rise of 0.6% in August for a third month in a row, but momentum appears to be waning after a burst of demand earlier in the summer once the country opened for business. Overall, “gold has flat-lined since early August’s peak because the other trends driving it higher have come off the boil,” said Adrian Ash, director of research at BullionVault, pointing out that prices are currently right in the middle of the last four weeks’ range. “Bond yields after inflation are holding around -1% on the 10-year, the dollar has steadied from its drop, and so [exchange-traded fun] inflows have dried up from investors wanting to protect their capital with gold.” “As things stand at these levels, those three factors are supportive for gold, but it’s the direction of travel that really matters,” he told MarketWatch. “Another drop in the dollar, plus new lows in real rates, will very likely spur bullion and ETF demand,” which should help gold break out of its holding pattern.” Meanwhile, December silver SIZ20, +5.96% SI00, +5.96% rose a penny, or 0.04%, to end the day at $27.476 an ounce, following a 0.4% climb in the previous session. Previously, “the industrial part of silver was headwind, but now China has seen improved retail sales and a global “reopening of economy” and the return of industrial demand are a “game-changer,” said Gero. Also on Comex, December copper HGZ20, +1.38% shed 0.07% to $3.061 a pound. October platinum PLV20, +3.99% lost 0.9% to $973.50 an ounce, but December palladium PAZ20, +2.31% inched up by 0.1% to $2,417.60 an ounce, holding ground at the highest most-active contract prices since March. “We suspect that positive economic psychology, higher global equities and positive Chinese economic data will be required daily for [palladium] prices to continue to rise and regain the $2,500 level,” analysts at Zaner Metals said in daily commentary."}]}