{"article": [{"url": "https://www.marketwatch.com/story/pelosi-says-russia-poses-greater-threat-to-election-than-china-2020-08-09", "published": 1597153880.0, "headline": "Pelosi and fellow Democrats say Russia poses urgent threat to 2020 election and China and Iran donâ\u0080\u0099t belong in the same conversation", "body": "WASHINGTON â\u0080\u0094 House Speaker Nancy Pelosi said Sunday the threats of interference in the U.S. presidential election from Russia and China are not equal, pointing to a more serious risk with Moscowâ\u0080\u0099s efforts to boost President Donald Trumpâ\u0080\u0099s re-election bid. â\u0080\u009cTheyâ\u0080\u0099re not equivalent,â\u0080\u009d said Pelosi, a California Democrat. â\u0080\u009cRussia is actively 24/7 interfering in our election. They did so in 2016, and they are doing so now.â\u0080\u009d She urged intelligence agencies to â\u0080\u009cput more information out thereâ\u0080\u009d on the specific nature of the threats. An intelligence report last week said Russia was already using a â\u0080\u009crange of measuresâ\u0080\u009d to undercut Trumpâ\u0080\u0099s Democratic challenger, Joe Biden, and promote Trump with misinformation on social media. The statement Friday by William Evanina, director of the National Counterintelligence and Security Center, also said China does not want Trump to win a second term and has accelerated its criticism of the White House, and that Iran is also hoping Trump will lose. Pelosi said trying to equate China and Russia on the threat of foreign election interference doesnâ\u0080\u0099t tell the story. See:Russia aims to run down Biden candidacy in support of Trumpâ\u0080\u0099s re-election, says U.S. counterintelligence official â\u0080\u009cThe Chinese, they said, prefer Biden â\u0080\u0094 we donâ\u0080\u0099t know that, but thatâ\u0080\u0099s what theyâ\u0080\u0099re saying, but theyâ\u0080\u0099re not really getting involved in the presidential election,â\u0080\u009d she said. Trumpâ\u0080\u0099s national-security adviser, Robert Oâ\u0080\u0099Brien, said Sunday that the U.S. is taking any threat to U.S. elections seriously. He said that China has engaged in cyberattacks and phishing â\u0080\u009cwith respect to our election infrastructure.â\u0080\u009d â\u0080\u009cWeâ\u0080\u0099re not going to put up with it,â\u0080\u009d he said. â\u0080\u009cWeâ\u0080\u0099re going to take every action necessary to keep folks out, whether itâ\u0080\u0099s China or Russia or Iran or Cuba or Venezuela or others.â\u0080\u009d Pelosi and other congressional Democrats have expressed concern that intelligence agencies have been withholding from the public specific intelligence information about the threat of foreign interference in American politics. â\u0080\u009cThe facts are chilling,â\u0080\u009d Sen. Richard Blumenthal, D-Conn., wrote in an op-ed published Friday evening in the Washington Post. â\u0080\u009cI believe the American public needs and deserves to know them. The information should be declassified immediately.â\u0080\u009d Pelosi spoke on CNNâ\u0080\u0099s â\u0080\u009cState of the Unionâ\u0080\u009d and â\u0080\u009cFox News Sundayâ\u0080\u009dand Oâ\u0080\u0099Brien appeared on CBSâ\u0080\u0099 â\u0080\u009cFace the Nation.â\u0080\u009d Read on:Republican Ron Johnson subpoenas FBI documents amid Senate committee probe into origins of Trump-Russia investigation"}]}