{"article": [{"url": "https://www.marketwatch.com/story/companies-race-to-swallow-poison-pills-to-thwart-hostile-bids-as-stock-prices-plunge-2020-06-22", "published": 1592895200.0, "headline": "Companies race to swallow poison pills to thwart hostile bids as stock prices plunge", "body": "They are back, and this time they are being dubbed “anti-coronavirus pills.” Poison pills, having fallen by the wayside, are being resurrected as companies whose stock-market valuations have rushed to shore up their takeover defenses and thwart hostile bids. These shareholder-rights plans allow existing shareholders to buy preferred shares at a substantial discount, thereby diluting the stake of a bidder and making a takeover more expensive. In March alone, 57 public companies adopted poison pills in response to an activist threat or as a preventive measure — the highest number of new adoptions in such a short time period in over 20 years, according to Chicago-based law firm Sidley Austin. Read: Shareholder activists are ripping up their traditional playbook, but passivism won’t last These include household names across a range of industries, including Occidental OXY, -3.22%, Groupon GRPN, -0.33%, Barnes & Noble BNED, -0.37%, Hilton Grand Vacations and Spirit Airlines SAVE, +1.35%. “The large volume of funds accumulated in recent years by private-equity firms and hedge-fund investors, which have struggled in recent years to find attractive targets, further increases the likelihood of a potential acquisition wave that exploits the recent decline in firms’ market valuations,” noted the authors of a newly released report by executive compensation consultancy Veritas. However, private-equity groups tend to shy away from hostile bids, meaning companies are unlikely to adopt shareholder-rights plans to fend off buyout firms. “For reputational reasons, private-equity funds almost never launch hostile takeover bids over the objections on a target company’s board and management,” said Kai Liekefett, co-leader of Sidley Austin’s shareholder-activism practice. “In fact, the governing documents of many private-equity funds outright prohibit any hostile activity.” Until recently, the number of active poison pills among U.S. corporations was extremely low. Popular during the merger waves of the late 1980s and 1990s, the device fell out of favor in the last two decades, in large part due to the influence of proxy advisers. At the end of 2019, only 25 S&P 500 companies had an active positive pill, the authors of the Veritas report noted. Most of the poison pills that were recently adopted have a one-year duration, according to Sidley’s Liekefett. He expects most companies to keep these in place until they expire,he said. “While the stock market may have overcome the extreme volatility we saw in the spring and market price have recovered remarkably, there remains a real risk of a second COVID-19 wave and more economic disruptions — along with another stock market crash,” he added. Read:Here’s what stock-market investors think is the biggest factor in their investing as coronavirus cases rise — hint: it isn’t a second wave The defense mechanism has come under intense criticism from shareholders who claim they can protect directors trying to stay independent for reasons investors don’t necessarily share. Even Institutional Shareholder Services, which advises investors as to how to vote on corporate matters, has softened its stance toward poison pills amid the coronavirus crisis. In updated guidelines on April 8, it argued that, as long as they are in place for less than a year and are justified by a sharp fall in a company’s share price, poison pills should be judged on a case-by-case basis. The resurgence of poison pills is being driven by the steep decline in share prices, particularly among companies in sectors that have been hard hit by the government lockdowns, which have led collapsing sales and revenues. These include companies in the retail, airlines, leisure and tourism, and manufacturing categories. The research by Veritas found that the stock price of companies in these highly exposed sectors experienced a dramatic rise following the adoption of poison pills. Read:Liquidity at several buyout-backed businesses worsen, says Moody’s On average, companies saw their share prices rise 5% on the day, and 12.8% after 10 days. In contrast, less vulnerable companies, including those in the defense, chemicals and pharmaceutical sectors, saw a negative stock-price effect after adopting poison pills. “This suggests that the circumstances of adoption and the aftermath depend on the extent to which firms were affected by the crisis,” the authors of the report noted. Read:Cash is king — and M&A goes MIA Online deals retailer Groupon adopted a shareholder-rights plan on April 13 after a 66% fall in its share price over three months, to defend itself against any bids to take control of the company. Three days later its stock rose by 4.94%, and on April 17 it was up 8.62%, according to data from FactSet. Three days later, the board of Hilton Grand Vacations HGV, -0.34% said it had adopted a one-year shareholder-rights plan to block a potential takeover of the company following a steep selloff in its shares. “The board noted that, as of the close of trading on April 1, 2020, the price of the company’s common stock had declined by over 50% since the close of trading on Jan. 31, 2019, due to the COVID-19 pandemic and related market volatility.” Shares in HGV jumped 10.1% on April 17, according to FactSet. “As stock prices dropped precipitously in March, many companies were quick to either put poison pills in place or put them on the proverbial ‘shelf,’ ” said Frank Aquila, global head of M&A at New York–based law firm Sullivan & Cromwell. “These poison pills were clearly aimed at preventing activist shareholders from acquiring significant share positions in the midst of the market volatility. While these poison pills might also inhibit opportunistic hostile bids, they will not prevent fully priced acquisition proposals from succeeding. As always, all will be a matter of negotiation,” Aquila added."}]}