{"article": [{"url": "https://www.marketwatch.com/story/trump-threatens-to-take-back-seattle-as-protests-ramp-up-2020-06-11", "published": 1591871900.0, "headline": "Trump threatens to 'take back' Seattle as protests ramp up", "body": "SEATTLE (AP) - Seattle Police say they are looking to reopen a precinct in the city' Capitol Hill neighborhood that was shuttered during ongoing George Floyd protests. At a news conference Wednesday, Assistant Chief Deanna Nollette said barriers were removed from the front of the precinct after it became a flashpoint between officers and protesters. Police also have remained scarce in that area and in the several nights since, protests have continued peacefully. Despite that, President Donald Trump tweeted Wednesday night to criticize the governor and Seattle's mayor, saying they should \"take back\" the city, and, \"If you don't do it, I will.\" People on Capitol Hill Wednesday began painting what looked to be Black Lives Matter on one block of the street as was done in Washington, D.C. Speakers talked about the need to get demands met quickly before the state reopens fully post the COVID-19 pandemic and many can go back to work. Another group walked and biked to the city's precinct downtown and stood near a fence put up to keep people away. iframe.twitter-tweet { width: 100% !important; } Over the weekend officers used tear gas and pepper spray to disperse demonstrators in the area after they say they were assaulted with projectiles. However, several city councilmembers say police overreacted and needlessly exacerbated tensions. Nollette said the precinct has been boarded up because of credible threats that it would be vandalized or burned. She offered no details about the threats and no fires have been reported at the precinct. The Seattle Times reports that Nollette said police want to discuss reopening the precinct and noted officers are responding to 911 calls in the area. She said protesters have set up their own barricades, which are intimidating to some residents. \"We are dedicated to working with peaceful protesters on a way to move forward,\" Nollette said. \"There's a whole citywide effort to try to identify who the leaders are. It's just a matter of establishing a dialogue so we can take down the plywood and welcome people back into the lobby.\" Officers have used tear gas, pepper spray and other less-lethal weapons against crowds that have demonstrated against racism and police brutality following the killing of Floyd in Minneapolis. Seattle Mayor Jenny Durkan and Police Chief Carmen Best apologized to peaceful protesters who were subjected to chemical weapons, but even after they promised on Friday a 30-day ban on using tear gas known as CS gas, officers used it again Sunday night, saying unruly demonstrators were encroaching on their position. A Black Lives Matter group on Tuesday sued the Seattle Police Department to halt the tactics it has used to break protests. Also on Wednesday, after protesters had called for Seattle police to turn on body cameras during demonstrations to guard against police violence and to improve accountability, Police Chief Carmen Best issued a directive for that, effective immediately. The existing rule had required officers to turn off their body cameras during protests, which was previously supported by the ACLU and members of the city council related to privacy concerns. Additionally, King County's top public health official declared racism a public health crisis on Wednesday. Decades of systemic racism has adversely affected Black people and other people of color in the United States, said Patty Hayes, director of Public Health - Seattle & King County. She pledged that her agency will recommit to working with the community and with King County executive Dow Constantine's office to break down the systemic issues that lead to negative health impacts for people of color, The Seattle Times reported."}]}