{"article": [{"url": "https://www.marketwatch.com/story/bill-gates-can-the-fda-be-trusted-when-it-comes-to-a-coronavirus-vaccine-11600183214", "published": 1600178120.0, "headline": "Bill Gates questions FDA, says only one drugmaker has a chance to deliver a coronavirus vaccine by next month", "body": "Bill Gates Agence France-Presse/Getty Images “ ‘Just like the CDC was viewed as the best in the world, the FDA had that same reputation as a top-notch regulator. But there’s been some cracks with some of the things they’ve said at the commissioner level.’ ” That’s Microsoft MSFT, +2.48% co-founder and billionaire philanthropist Bill Gates calling into question the credibility of the Food and Drug Administration in an interview with Bloomberg TV. Gates explained that President Donald Trump’s push for political gain while playing down or dismissing science is the issue. As an example, he pointed to FDA commissioner Stephen Hahn, who exaggerated the benefit of blood plasma as a treatment at one of the president’s news conferences. “We saw with the completely bungled plasma statements that when you start pressuring people to say optimistic things, they go completely off the rails,” Gates told Bloomberg in an interview posted on Tuesday. “The FDA lost a lot of credibility there.” Meanwhile, in an appearance on CNBC, Gates had some bad news for the president, and, for that matter, the world: A viable coronavirus vaccine before the November election is a real longshot. But, for investors looking to pick a winner, only one company, according to Gates, even has a chance at seeking approval by next month. “ ‘The only vaccine that if everything went perfectly, might seek the emergency use license by the end of October, would be Pfizer.’ ” Gates explained to CNBC that while many other pharma companies are in the race, only Pfizer could potentially deliver in a matter of weeks. More realistically, he said, would be for multiple companies to seek approval by December or January, assuming the effectiveness is there. Pfizer CEO Albert Bourla told CNBC Monday that “hundreds of thousands of doses” of the company’s coronavirus vaccine could be distributed in the U.S. before year end. The Gates Foundation, which announced in March that it would work with drug companies to develop a vaccine, owns shares of Pfizer PFE, -0.27%, along with Johnson & Johnson JNJ, +1.39%, Merck MRK, -0.14% and others."}]}