{"article": [{"url": "https://www.marketwatch.com/story/after-u-s-tech-gains-european-stocks-pause-as-ecb-decision-awaits-11599722345", "published": 1599731180.0, "headline": "European stocks edge lower, euro rises as ECB lifts forecasts without talking down currency", "body": "European Central Bank President Christine Lagarde ECB/YouTube European stocks edged lower and the euro rose on Thursday, as the European Central Bank kept interest rates unchanged and offered a slightly more optimistic view of the economy. Up 1.6% on Wednesday, the Stoxx Europe 600 SXXP, +0.55% declined 0.3%. The ECB lifted its estimate for the eurozone economy this year, now seeing a contraction of 8% versus its previous estimate of an 8.7% drop, as it left 2021 and 2022 forecasts mostly unchanged. iframe.twitter-tweet { width: 100% !important; } During her introductory comments, ECB President Christine Lagarde did not mention the recent strength in the euro EURUSD, +0.60% as a matter for concern for economic growth. Asked by a reporter, Lagarde said the ECB’s governing council discussed the euro appreciation but said it doesn’t “target the exchange rate.” Lagarde said the ECB will have to “monitor carefully” the rate since it impacts inflation. The euro traded at $1.1902 vs. $1.1804 on Wednesday. “Scrape below the headlines and you can see why tentatively the eurozone is warming up as an investment allocation zone for global asset allocators,” said Chris Bailey, European strategy at Raymond James. “The ECB mildly improved their economic outlook, monetary policy remains exceptionally loose with no foreseeable change likely and government action over recent months on fiscal policy provides ‘important funding support’. There is a firming coherence in eurozone economic policy making, as highlighted again by the positive reaction of the euro to the comments made.” Of companies in the spotlight, Wm Morrison Supermarkets MRW, +1.52% slumped 4% after reporting a 25% slump in first-half adjusted pretax profits, with the company flagging higher costs and reduced consumer demand for fuel. “Some traders will be wondering if Morrisons can’t post a rise in profit when a pandemic has driven up demand, when will they register a rise in earnings,” said David Madden, market analyst at CMC Markets U.K. Chemicals group Akzo Nobel AKZA, +0.04% rose 3%, as the company said revenue for the third quarter will be close to last year’s levels. It reported strong decorative-paint demand in Europe and South America. Games Workshop GAW, +1.06%, which makes miniature wartime figures, jumped 10% after saying its performance for the quarter ending Aug. 30 was ahead of its expectations."}]}