{"article": [{"url": "https://www.marketwatch.com/story/bill-ackman-on-saving-capitalism-every-child-in-the-u-s-could-be-given-enough-money-at-birth-to-become-millionaires-by-retirement-11598893294", "published": 1598880200.0, "headline": "Bill Ackman on saving capitalism: Every child in the U.S. could be given enough money at birth to become millionaires by retirement", "body": "Bill Ackman has an idea for saving the system that made him a billionaire. The Pershing Square Capital Management chairman told investors in a recent note that, in order to preserve capitalism, steps need to be taken to close the increasing inequality gap. One possible measure: investment accounts for every child. Under Ackman’s plan, each child born in the U.S. would receive $6,750 in a government-funded basket of index funds that could only be tapped at retirement. Assuming 8% returns over 65 years from birth to retirement, that total would ultimately exceed $1 million, and it would cost the government about $26 billion a year, if the birthrate holds. “Compounded returns over time are indeed one of the great wonders of the world, and every day we wait to address this issue, the problem looms larger,” the hedge-fund manager wrote. He added that a government-led push for equities-investing accounts could “encourage greater financial literacy” and spread the stock-market’s gains across a wider swath of the U.S. population. “Americans that have no ownership in the success of capitalism, and who are suffering economically, are more motivated to turn toward socialism or other alternatives,” he said in the note. Meanwhile, Ackman’s strong showing this year continues, thanks in large part to a well-timed bearish bet on corporate bonds in early 2020. That investment yielded a profit of more than $2 billion during the March coronavirus meltdown in the stock market. Currently, Pershing Square’s investments are dominated by seven stocks: Lowe’s LOW, +1.38%, Restaurant Brands QSR, -0.60%, Chipotle CMG, +0.01%, Agilent A, +1.53%, Hilton HLT, -1.26%, Starbucks SBUX, +0.53% and Howard Hughes HHC, +1.00%. As for the broader market, stocks got off to a rough start this week, with the Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% both moving lower. The Nasdaq Composite COMP, +1.39%, however, managed to break into positive territory in Monday’s trading session."}]}