{"article": [{"url": "https://www.marketwatch.com/story/robinhood-vanguard-and-other-brokerage-platforms-were-down-monday-here-are-workarounds-to-get-your-stock-trades-through-next-time-2020-09-01", "published": 1599117620.0, "headline": "How to get your stock trades through when Robinhood, Vanguard and other brokerages go down, as they did this week", "body": "Investing comes with many risks, but here’s a big new hazard to worry about in the age of free trades: Just when you need access to the markets the most, you won’t have it. Online brokerage platforms at TD Ameritrade US:AMTD, Charles Schwab SCHW, +1.29%, E*TRADE Financial US:ETFC, Vanguard and Robinhood were all down or sluggish for hours Aug. 31. The same thing happened during the stock market meltdown in February and March. This is now obviously a recurring problem that should have you concerned if you lack access to professional trading platforms that don’t have similar problems. That includes a lot of us. I’ll get to several useful workarounds below. But first, here’s what we know about what’s going on, and why this is a huge issue for investors. Not only a ‘trader issue’ The trite pushback goes like this: If you’re a long-term investor, losing market access for half a day shouldn’t matter. And shame on you for being a grubby trader who can’t live without constant access! This response falls short. Long-term investors such as Warren Buffett patiently lie in wait with cash for months or years for that one moment when their favorite stocks go on sale because of fears they deem unjustified. If accounts shut down exactly when that moment arrives, you can’t follow through. That happened to many investors Monday, including myself, when retail brokerage platforms froze, presumably because of the huge spike in trades in Apple AAPL, +1.74% and Tesla TSLA, +1.89% after the companies split their shares, and the related spike in market data flow on those platforms. Many of us had no interest in trading those two stocks. But, as a result, we couldn’t buy other companies that were trading at a discount. Investors weren’t the only ones hurt. The Monday mishap came at an inopportune time — the end of the month. Anyone wanting to check direct deposits or cash levels at Vanguard and elsewhere to pay bills couldn’t do so. Four reasons this is troubling 1. If something as innocuous as a stock split shuts down brokerage platforms, we can guess that it will happen again during the next market hiccup, and especially in any major crisis caused by something like a terrorist attack or natural disaster. 2. Professional trading platforms went unaffected. “I didn’t hear anyone saying they had a problem with order management systems,” says Joe Saluzzi of Themis Trading, referring to professional platforms. “The only thing I heard about was problems on retail systems.” It was a Main Street, not a Wall Street, problem. This turned Robinhood’s trademark catch phrase — “We’re on a mission to democratize finance for all” — on its head. 3. The brokerages aren’t telling us much about what went wrong, or how they plan to fix it. I reached out to the five brokerage services listed above, but got vague responses. (See below.) Saluzzi offers a plausible explanation. Partly because commissions are now zero, the number of trades in Apple and Tesla on Monday increased 3.5 to 5 times over Friday. This included tens of thousands of one- and two-share lots. “I’ve never seen stocks trade like that,” says Saluzzi, who has worked at brokerages and trading platforms for decades. His custom app that tracks time and sales in Apple and Tesla was “spinning like a roulette wheel” all day. And it continued after-hours — also unusual. The upshot: Even if overall trading volume wasn’t high, brokerage platforms got overwhelmed by trades and market data flow, he says. This might have caused an overload in one part of their systems that shut everything down. 4. CEOs at companies that reveal pay because they are public got anywhere from $6 million last year at E*TRADE to $16 million at Schwab. Directors are pulling in $215,000 to $544,600 a year. Much of this is “performance pay.” Customers may question why they got so much for managing trading platforms that do not perform when needed. (As private companies, Vanguard and Robinhood don’t disclose pay.)Brokerage responses Vanguard, in response, says it has “heavily reinvested in our business and technology infrastructure to continuously provide a better client experience via web, mobile or phone. We will continue to review our technology systems carefully to help prevent interruptions in the future.” Robinhood says that, since March, it has improved system capacity, and to keep up with growth its engineering team “has been working diligently to further strengthen our infrastructure, improve reliability and increase capacity. We are actively growing our engineering teams.” Schwab responds that through Monday its “client-facing systems were fully available close to 99.9% of the time for the quarter.” It says it is continuing to investigate the root cause of Monday’s failure. “We do not publicly disclose the specific steps we take to ensure security and reliability.” TD Ameritrade didn’t say anything about what caused the outage, but it did say its thinkorswim app worked all day. E*TRADE declined to comment. What you can do Outages at key moments may continue. Here are some workarounds. • Use apps. Schwab tells me its phone app worked Monday, and it successfully directed customers there for market access. Ameritrade’s Margaret Farrell says its thinkorswim desktop and mobile apps worked Monday. It makes sense to enable all your brokerage’s apps as a backup. • Have some of your money on several platforms since they might not all freeze up at once. But even platforms including Interactive Brokers that have a reputation for being robust can have issues. • Invest for the long term, and don’t trade. This reduces the impact. But not by 100%. Even long-term investors watch their favorite stocks for buyable dips, a big part of long-term investing. ­• If you trade, reduce overnight exposure. But this common trading tactic won’t help when a crisis freezes platforms during trading hours. • Invest in mutual funds. Leave the driving to the pros, so outages don’t matter. The problem is that so many mutual funds so consistently underperform, it’s not necessarily a good option. • Ask your representatives in Congress for help. They can pressure financial regulators to do something. Agencies include the Securities and Exchange Commission (SEC), the U.S. Commodity Futures Trading Commission (CFTC), the Financial Industry Regulatory Authority and the Consumer Financial Protection Bureau. Unfortunately, we are in a multi-year “silly season” in the political world. So it might not pay to get your hopes up about help from politicians. That would be a shame. In the day-to-day market bustle, we tend to forget that the main role of the stock market is to channel savings to companies so they can invest and create jobs, new drugs and other innovations. We have our priorities mixed up when chat platforms including Facebook FB, +0.26% and Twitter TWTR, -0.23% work fine, but capital markets platforms are so flawed. If investors lose confidence in the stock market, everyone suffers. Michael Brush is a columnist for MarketWatch. At the time of publication, he had no positions in any stocks mentioned in this column. Brush has suggested SCHW, ETFC and TSLA in his stock newsletter, Brush Up on Stocks. Follow him on Twitter @mbrushstocks."}]}