{"article": [{"url": "https://www.marketwatch.com/story/trump-with-other-presidents-your-401-k-s-will-drop-down-to-nothing-11593712819", "published": 1594196900.0, "headline": "Trump: With a different president, your â\u0080\u0098401(k)s will drop down to nothingâ\u0080\u0099", "body": "Americansâ\u0080\u0099 retirement and investment portfolios would suffer under another president, and the economy wouldnâ\u0080\u0099t be as strong as it is now, President Donald Trump said in remarks to reporters after the Labor Departmentâ\u0080\u0099s jobs report for June.Â Since November 2016, when Republican Trump claimed a surprise Electoral College win over Democrat Hillary Clinton, the Dow Jones Industrial Average DJIA, +0.56% has risen roughly 45%, the S&P 500 SPX, +0.87% has gained 47% and the Nasdaq Composite COMP, +1.39% is up nearly 100%, he said on Thursday. â\u0080\u009cThese are not numbers other presidents would have,â\u0080\u009d he said, observing that others might be more inclined to raise taxes. He continued: “ â\u0080\u0098Your 401(k) will drop down to nothing, and the stock market will drop down to nothing.â\u0080\u0099 ” â\u0080\u0094 Donald Trump, on retirement- and investment-account ramifications of his not being president He credited the growth of the stock market to his administrationâ\u0080\u0099s actions, including the federal governmentâ\u0080\u0099s response to the coronavirus crisis. â\u0080\u009cThis is not just luck,â\u0080\u009d he said. â\u0080\u009cThis is a lot of talent.â\u0080\u009dÂ Two major Wall Street institutions in as many days, though, effectively presented rebuttals this week, with Citigroup strategists saying Tuesday that Trumpâ\u0080\u0099s presumptive Democratic rival, Joe Biden, would bring a clearer and more rational approach to trade and less policy volatility overall and strategists at J.P. Morgan having stated a day earlier that a Biden presidency would have a neutral to positive stock-market impact. Of the monthly jobs data, Trump said this, according to a White House transcript: â\u0080\u009cTheseÂ are notÂ numbers made upÂ by me;Â these are numbers.â\u0080\u009d The stock market so far in 2020 has been, for investors, a wild ride. In February, when the first cases of the coronavirus were detected in the U.S., the stock market tumbled into correction territory, and in March it officially entered a bear market. States issued lockdowns, which shuttered businesses and cost workers their jobs or a portion of their earnings, and Americans began filing unemployment claims in droves.Â Since then, the market has seen its share of ups and downs. In the three months following the initial market battering, the U.S. equity indexes rebounded, as many states successfully took aggressive action to flatten the curve of new coronavirus infections and hope formed that businesses could reopen and quickly resume near-normal operations. Rockier periods have emerged in response to economic reports, record levels of daily coronavirus cases in some states, and uncertainty over the future. On the day when the payrolls data showed the unemployment rate declining from 13.3% in May to 11.1% in June, U.S. stocks notched sharp gains and have largely held those levels since, despite declines on Tuesday. Also see: How can I protect my 401(k) from a coronavirus-driven market downturn? Throughout this period, retirement savers have been told not to panic. Volatility is normal, and if they have a financial plan from a professional adviser, it likely includes a cushion for those seeing their investments take a beating. The government expanded eligibility requirements for savers to withdraw or borrow from their retirement plans, though advisers have cautioned that option should be a last resort. Itâ\u0080\u0099s too soon to tell what the longer-lasting impacts of the coronavirus crisis, and its effects on the economy, will be for retirement savers and retirees. Nearly everyone will be affected, whether they are high or lower earners, because of lower retirement-account balances and faltering job security, experts said."}]}