{"article": [{"url": "https://www.marketwatch.com/story/ebay-says-its-will-move-pretty-quickly-on-payments-transition-as-paypal-agreement-expires-2020-07-20", "published": 1595232740.0, "headline": "EBay says its will â\u0080\u0098move pretty quicklyâ\u0080\u0099 on payments transition as PayPal agreement expires", "body": "EBay Inc. intends to â\u0080\u009cmove pretty quicklyâ\u0080\u009d on rolling out its new payments system now that its operating agreement with PayPal Holdings Inc. has officially come to an end. EBay EBAY, +6.47% Â and PayPal PYPL, +2.18% Â split into two separate companies in July 2015 but maintained a five-year operating agreement through which PayPal would remain the e-commerce giantâ\u0080\u0099s primary payments partner. The companies announced in January 2018 that they wouldnâ\u0080\u0099t be renewing that agreement upon its expiration, which took place this weekend. Heading into the weekend, eBay had 42,000 sellers using the new payments platform and it had thus far processed more than $4.7 billion in volume through this â\u0080\u009cmanaged paymentsâ\u0080\u009d initiative, according to Alyssa Cutright, eBayâ\u0080\u0099s vice president of global payments, who said the company would move fast to bring more merchants on board. The company had 250,000 more sellers who were enrolled to come onto the platform upon expiration of the PayPal agreement, which previously limited the extent to which eBay could run its own payments system. Read: Why eBay is betting on payments to help its turnaround For eBay, asserting more control over payments is viewed as a key catalyst. At the time eBay announced its plans to move to its own managed payments system, then-Chief Executive Devin Wenig said the move was intended to â\u0080\u009ccapture significantly better economics while reducing overall selling costs.â\u0080\u009d The company hopes that the new payments system, which offers the ability to pay with PayPal or various other methods, will improve conversion rates by giving buyers more options. On the other side of the equation, eBay argues that sellers will see lower fees through the new platform and benefit from being able to maintain just one relationship for all aspects of the eBay selling process, rather than separate relationships with eBay and PayPal. EBay is now partnering with European payments provider Adyen NV ADYEN, +2.09% Â for its new system, but the economics of that deal are different than they were with the PayPal arrangement because eBay is taking on aspects like risk management and payments customer service itself. Cutright told MarketWatch that eBay is â\u0080\u009ctaking advantage of end-to-end controlâ\u0080\u009d by supporting Apple Pay, Google Pay, and regionally popular payment methods like Afterpay in Australia. Because eBay is now running its own risk models, she also said that â\u0080\u009cyou should expect to see more buyers successfully get through checkoutâ\u0080\u009d because marketplaces and payments providers may approach authorization in different ways. The old operating agreement restricted eBayâ\u0080\u0099s ability to expand managed payments geographically, and eBay had only done tests in the U.S. and Germany on small portions of the merchant base. Now the company is focused on scaling the new system in those markets, expanding into Canada, the U.K., and Australia, and eventually moving elsewhere. Cutright anticipates that the majority of U.S. sellers will be using the new platform by the end of the year and that the majority of all sellers will be migrated over by the end of 2021. The company targets full migration in 2022. Chief Executive Jamie Iannone said in a release that the company expects managed payments to generate $2 billion in revenue and $500 million in operating income in 2022. Baird analyst Colin Sebastian wrote in a recent note to clients that eBay has â\u0080\u009cclear upside potentialâ\u0080\u009d if it completes a rapid rollout of managed payments, though he expects the company to be â\u0080\u009cprudently cautiousâ\u0080\u009d heading into the holiday shopping season. Read: Venmo and Squareâ\u0080\u0099s Cash App were going gangbusters before the pandemic â\u0080\u0094 now theyâ\u0080\u0099re doing even better EBay shares have gained 43% since the company announced the managed payments transition on Jan. 31, 2018, outpacing a 14% gain for the S&P 500 SPX, +0.87% Â in that span but lagging PayPalâ\u0080\u0099s 104% stock climb."}]}