{"article": [{"url": "https://www.marketwatch.com/story/iea-lowers-2020-demand-forecast-2020-09-15", "published": 1600147700.0, "headline": "IEA lowers 2020 demand forecast", "body": "LONDON-- The oil-market uncertainty brought about by the coronavirus pandemic isn't going anywhere, with the outlook for global demand even gloomier than it was last month, the International Energy Agency said Tuesday. In its closely-scrutinized monthly oil-market report, the IEA forecast a sharper shrinking in global demand for 2020 than in its last report, upping its contraction forecast for the second straight month. The agency now expects global demand to fall by 8.4 million barrels this year, a contraction of 300,000 barrels more from last month's report. That echoed a similar move Monday by the Organization of the Petroleum Exporting Countries, which deepened its own contraction forecast while also altering a number of other forecasts to signal growing pessimism about the global economic recovery and its impact on energy demand. The Paris-based IEA said it now expects global oil demand to contract in 2020's fourth quarter by 5 million barrels a day--a contraction some 600,000 barrels a day deeper than last month's forecast. Rising Covid-19 cases in Europe, new restrictions and persistently high levels of working from home on the one hand, and the increased use of personal vehicles on the other, has made analyzing the market \"very challenging,\" the agency said. With supply continuing to rise, the recovery in oil demand appearing to falter, and the onset of winter in the northern hemisphere raising questions over the virulence of the coronavirus, the outlook for the global oil market \"appears even more fragile\" than it did a month ago, the IEA said. Oil ticked down early Tuesday, after slipping Monday amid concerns that Libyan supply could return to the market. Brent crude oil--the global benchmark--was down 0.2% at $39.55 a barrel and West Texas Intermediate futures, the U.S. benchmark, fell 0.1% at $37.24 a barrel. The prices of both benchmarks have dropped by more than 12% in September due to a combination of stalling demand and price cuts from major producers, some of whom have been increasing production. While some inventories have fallen, the amount of oil in floating storage dropped in August, a deepening contango--in which the price of oil futures contracts for delivery further into the future is higher than that of oil delivered sooner--suggests underlying weakness in the physical oil market, the agency said. Other metrics, such as OECD stock levels, showed an increase in July back to record highs. In addition, Chinese purchases of oil for September and October have slowed, leading to a glut of unsold barrels. With refinery margins persistently weak, \"we see that trading houses are once again looking to charter ships to store oil,\" the IEA said. A continued depression in demand for transport fuels, hurricane-induced shutdowns, and maintenance season mean that refinery margins and runs will fall even further in the period to October, the agency forecast. OPEC and its allies will likely discuss stuttering demand and rising inventories when the cartel's joint ministerial monitoring committee meets later this week. The OPEC+ alliance has in recent months curbed some of the historic production cuts it agreed on earlier this year, and while some reports have noted a slip in the cartel's compliance, the IEA put cut compliance at 97% in August. Supply from OPEC+ increased by 1.3 million barrels in August, with Saudi Arabia responsible for 500,000 barrels of that rise and Russia accounting for a further 400,000 barrels. That increase contrasted with stalling supply recovery in non-alliance countries such as the U.S., where output dropped as the Gulf of Mexico was battered by Hurricane Laura. Even with output likely to recover in September, onshore drilling will remain \"well below levels required to offset declines across the shale patch,\" the agency said. Write to David Hodari at david.hodari@wsj.com"}]}