{"article": [{"url": "https://www.marketwatch.com/story/how-far-do-stocks-have-to-fall-for-washington-to-take-action-you-may-not-like-the-answer-11600784411", "published": 1600770500.0, "headline": "How far do stocks have to fall for Washington to take action? You may not like the answer", "body": "Wall Street investors and ordinary Americans have been waiting for Washington to legislate another round of stimulus to support the COVID-struck economy ever since the last one expired, in July. Most pundits were relatively hopeful, for a while. But in the past few weeks, a Congress that puts the “pro” in procrastination has started to alarm the market. But if Wall Street really wants to get Washington’s attention, it may take a more serious move than the steady grind lower that we’ve seen over the past few weeks, according to one analysis. “Only a 5% down day on the S&P 500 SPX, +0.87% shows real investor concern that Washington needs to step up ASAP,” said Nicholas Colas, co-founder of DataTrek Research, in a note out Tuesday. “ We haven’t had that sort of move yet.” Colas elaborated: “As rough as the recent selloff has been, we will not get really concerned about market sentiment until there is a down +5% day on the S&P 500. That’s a 5 standard deviation move and signals real trouble ahead.” There have been very few days with such a big drawdown in recent history, he noted. The 2008-2009 period, during and in the immediate aftermath of the financial crisis, saw 12. There was one in August 2011, after the ratings agency Standard & Poor’s downgraded the sovereign debt of the United States. And there have been five this year: four in March, when panic over the COVID crisis first burst to the surface, and one in June. The funny thing is, such a big market move may not only signal “real trouble ahead.” It may also persuade Washington to finally pay attention to whatever is causing the market turmoil. As Colas put it, “the March 2020 crash days were Wall Street’s distress call to Washington asking for fiscal support, and it came quickly. ” Colas has been tracking the similarities between this year’s market downturn and 2008, and thinks the earlier crisis provides a sort of playbook for navigating this year. In other words, if you’ve been anticipating another “TARP moment,” a swoon in the markets after Congress fails to do the right thing, you might want to buckle up. Read next: The coronavirus crisis is costing states and locals hundreds of billions, analysis finds"}]}