{"article": [{"url": "https://www.marketwatch.com/story/miami-marlins-home-opener-is-postponed-after-14-players-and-coaches-test-positive-for-the-coronavirus-2020-07-27", "published": 1595947040.0, "headline": "Miami Marlins season temporarily paused  after 18 players and coaches test positive for coronavirus", "body": "Major League Baseball has decided to temporarily pause the season of the Miami Marlins as the team deals with a coronavirus outbreak that has now impacted 18 of the club’s players and coaches. “I don’t see it as a nightmare,” Commissioner Manfred told MLB Network on Monday night. “We built the protocols to allow us to continue to play. That’s why we have the expanded rosters, that’s why we have the pool of additional players. And we think we can keep people safe and continue to play.” iframe.twitter-tweet { width: 100% !important; } Four more Marlins players have tested positive for the coronavirus on Tuesday morning. The team is still stranded in Philadelphia. Pitcher Jose Urena was scratched from his scheduled start in Sunday’s game, and catcher Jorge Alfaro went on the injured list Friday. No reasons were given for the moves, but manager Don Mattingly said those who tested positive would be quarantined in Philadelphia. iframe.twitter-tweet { width: 100% !important; } Multiple infectious-disease specialists have called this a “clear outbreak,” according to the Athletic. The Athletic is reporting that Major League Baseball never considered postponing any games over the weekend, even after multiple members of the Marlins tested positive for the coronavirus See also: With the baseball season in flux — here’s what U.S. sports leagues are doing amid the pandemic The Philadelphia Phillies, the team that just played the Marlins in a three-game set in Philadelphia, were scheduled to begin a four-game series against the New York Yankees on Monday night. The first two games of that series have been postponed. iframe.twitter-tweet { width: 100% !important; } The games are scheduled to be played in Philadelphia, using the same clubhouse and facility that the Marlins players used over the weekend. President Donald Trump, who had said Friday, a day after Dr. Anthony Fauci threw out the ceremonial first pitch for the Washington Nationals home opener, that he would throw out the first pitch at a Yankees game in the Bronx on Aug. 15, tweeted on Sunday that he would instead be directing his “strong focus” to “the China Virus, including scheduled meetings on Vaccines, our economy and much else” on that date, a Saturday nearly three weeks away. Fauci talked about the ongoing situation in Major League baseball on ABC’s “Good Morning America.” “This could put it in danger,” said Fauci, the nation’s top infectious disease expert. “I don’t believe they need to stop, but we just need to follow this and see what happens with other teams on a day-by-day basis.” “Major League Baseball — the players, the owners, the managers — have put a lot of effort into getting together and putting protocols that we feel would work,” Fauci said. “It’s very unfortunate what happened with the Miami (Marlins).” The Marlins’ precarious health raised anew doubts about MLB’s ability to finish the abbreviated season during a pandemic. In Cincinnati, Reds second baseman Mike Moustakas and center fielder Nick Senzel felt sick Sunday, a day after a teammate went on the injured list because he had tested positive for COVID-19. The Associated Press contributed to this report."}]}