{"article": [{"url": "https://www.marketwatch.com/story/who-is-deborah-birx-the-doctor-whose-reaction-when-trump-suggested-people-inject-disinfectants-has-gone-viral-2020-04-24", "published": 1596457520.0, "headline": "Who is Deborah Birx â\u0080\u0094 the doctor that both Trump and Pelosi are now suddenly criticizing?", "body": "For those who werenâ\u0080\u0099t tuning in to the daily White House coronavirus press briefings earlier in the coronavirus outbreak â\u0080\u0094 and who may now be actively tuning pandemic updates out â\u0080\u0094 the woman whom both President Trump and House Speaker Nancy Pelosi turned on over the weekend may be an unfamiliar face. In fact, Dr. Deborah L. Birx, 64, is a world-renowned global health official and a retired U.S. Army physician who was instrumental in HIV/AIDS vaccine research, and whose career has spanned three decades. And ever since Vice President Mike Pence appointed her as the response coordinator for the White House Coronavirus Task Force â\u0080\u0094 one of two women on the team â\u0080\u0094 sheâ\u0080\u0099s been on national TV almost daily, often alongside Dr. Anthony Fauci, the nationâ\u0080\u0099s top infectious-disease expert. But on Sunday morning, Pelosi questioned Birxâ\u0080\u0099s credibility on ABC Newsâ\u0080\u0099 â\u0080\u009cThis Week,â\u0080\u009d where she criticized the doctor for not doing more to refute the presidentâ\u0080\u0099s inaccurate remarks about the coronavirus. â\u0080\u009cI think the president is spreading disinformation about the virus and she is his appointee,â\u0080\u009d Pelosi said. â\u0080\u009cSo I donâ\u0080\u0099t have confidence there, no.â\u0080\u009d Read more: Coronavirus tally: Global cases of COVID-19 top 18 million, 689,625 deaths, Dr. Birx says US in â\u0080\u0098dangerous new phaseâ\u0080\u0099 Later Sunday, Birx struck a more dire tone on CNNâ\u0080\u0099s â\u0080\u009cState of the Union,â\u0080\u009d where she said that we are in a â\u0080\u009cnew phaseâ\u0080\u009d of the pandemic, and warned Americans in rural areas that â\u0080\u009cyou are not immune or protected from the virus.â\u0080\u009d And this has led to mixed messages from the White House. While communications director Alyssa Farah tweeted Sunday that Pelosi was â\u0080\u009cdeeply irresponsibleâ\u0080\u009d for repeatedly trying to â\u0080\u009cundermine & create public distrust in Dr Birx, the top public health professional on the coronavirus task force,â\u0080\u009d the president called Birxâ\u0080\u0099s response to Pelosiâ\u0080\u0099s criticism â\u0080\u009cpatheticâ\u0080\u009d on Twitter TWTR, -0.23% Â Monday morning. iframe.twitter-tweet { width: 100% !important; } Related: Trump blasts Dr. Birx as having taken Pelosi â\u0080\u0098baitâ\u0080\u0099 Birx has been a scene stealer before â\u0080\u0094 such as when she warned younger Americans that they were not immune to COVID-19, stating, â\u0080\u009cmillennials are the keyâ\u0080\u009d to stopping the spread of the virus. But her body language as President Trump suggested bright-light treatments and disinfectants to fight the coronavirus in April â\u0080\u0094 sitting still, taking a deep breath, blinking, setting her face still and then staring at the ground â\u0080\u0094 really blew up on social media this spring. Even then, some criticized her for not standing up and refuting the presidentâ\u0080\u0099s comments immediately. Read more:Trump suggests disinfectant as treatment for coronavirus â\u0080\u0098by injection inside or almost a cleaningâ\u0080\u0099 â\u0080\u0094 later says he was speaking â\u0080\u0098sarcasticallyâ\u0080\u0099 Others set the clip to the theme music from HBOâ\u0080\u0099s Â â\u0080\u009cCurb Your Enthusiasm,â\u0080\u009d or joked about her facial expression. â\u0080\u009cYou can see Dr. Birxâ\u0080\u0099s soul leave her body,â\u0080\u009d snarked one tweet. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } (The president later responded that he was asking the questions â\u0080\u009csarcastically,â\u0080\u009d and the White House press office accused the media of taking his comments â\u0080\u009cout of context.â\u0080\u009d) Related: Chris Cuomo satirizes Trumpâ\u0080\u0099s disinfectant-injection suggestion: â\u0080\u0098Take two shots of Windex, swallow this lightbulb, and call me in the morningâ\u0080\u0099 For those curious to learn more about Birx, however, here are five things to know about the ambassador-at-largeâ\u0080\u0099s 30-year career, and her current role as the federal coronavirus response coordinator. She was always a science buff Birx grew up in Pennsylvania, where she and her two older brothers converted the backyard shed into a makeshift lab. Their most notable invention: a satellite-dish antenna that they moved around on roller skates, the Society for Science & the Public reported. When Birx was a junior at Carlisle High School in Pennsylvania, she competed in the 1973 International Science and Engineering Fair in San Diego. Her project on paleobotany in the Carboniferous period scored the trophy for girls grand champion, plus a chance to compete in the Army and Navyâ\u0080\u0099s International Science and Engineering Fair (which she won). She eventually put herself through medical school at the Hershey School of Medicine at Penn State, the Hill reported. She has a military background Birx trained in internal medicine and clinical immunology at the Walter Reed Army Medical Center and the National Institutes of Health, according to her biography on the Department of State website. She began her government career as a military-trained clinician in immunology, mainly researching HIV/AIDS vaccines, in 1985. She attained the rank of colonel, and as Col. Birx received two prestigious U.S. Meritorious Service Medals and the Legion of Merit Award. She was named the director of the U.S. Military HIV Research Program at the Walter Reed Army Institute of Research, serving from 1996 to 2005. And she led â\u0080\u009cone of the most influential HIV vaccine trials in history,â\u0080\u009d her bio states. Related:Dr. Fauci tells MarketWatch: I would not get on a plane or eat inside a restaurant Sheâ\u0080\u0099s worked closely with three U.S. presidents â\u0080\u0094 and was dogged in getting George W. Bushâ\u0080\u0099s attention When Bush announced his Presidentâ\u0080\u0099s Emergency Plan for AIDS Relief (PEPFAR) in 2003, Birx flew back from Kenya and waited outside of the then-director of the Office of National AIDS Policyâ\u0080\u0099s town house for almost a week to get a meeting with him. She had been working on HIV vaccine research in Africa for almost six years at that point. So she showed him a 180-slide PowerPoint presentation â\u0080\u009cuntil he agreed ... to let the Army also be part of PEPFAR,â\u0080\u009d she told a George W. Bush Presidential Center podcast in September. â\u0080\u009cI was not leaving his office, and so I wore him down.â\u0080\u009d Birx was later appointed ambassador-at-large and global AIDS coordinator by President Barack Obama, and she has overseen PEPFAR at the State Department for the past six years. Now she is also aiding the government response to the coronavirus under the Trump administration. Vice President Pence has described her as his â\u0080\u009cright armâ\u0080\u009d in that role. Her signature scarves have built a following As Birx tends to wear patterned silk scarves during press conferences and interviews, viewers have taken note, and even fashion cues, the Wall Street Journal reported. Instagram FB, +0.26% Â accounts dedicated to her neckwear have sprung up, including @deborahbirxscarves and @deborahbirxscarfqueen. Some followers have posted pictures of themselves sporting similar scarves to hers on Twitter: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Why was Birx sporting scarves even before people started using them as makeshift face masks during the pandemic? Turns out, itâ\u0080\u0099s one of her tips for packing lightly and sticking to just one carry-on bag when traveling for work. â\u0080\u009cI take relatively plain dresses, black and other colors, that you can then change the scarves on, and through that it looks like itâ\u0080\u0099s a totally different outfit,â\u0080\u009d she told the Strategerist podcast last year. She throws one heck of a Christmas party Birx takes a hands-on approach to all of her work, including her annual Christmas Eve party. The Washington Post revealed in a lengthy profile that she hosts a 24-hour buffet for almost 100 people in her home on Christmas Eve every year, and that she and a deputy cook all of the food themselves. â\u0080\u009cItâ\u0080\u0099s important that I do this myself,â\u0080\u009d she said. â\u0080\u009cWe do this to show love.â\u0080\u009d The Post profile also notes that she graduated from high school at 16, got married and graduated from college at 20, finished medical school at 23 and had her daughters shortly after â\u0080\u0094 so sheâ\u0080\u0099s juggled work and home responsibilities through her entire career. On weekends in the 1980s, â\u0080\u009cBirxâ\u0080\u0099s older daughter would sit on the floor of the lab, playing with the colored caps of sample tubes, while Birx cultured HIV.â\u0080\u009d Stay up-to-date with MarketWatchâ\u0080\u0099s coronavirus coverage here. This article was first published in April 2020, and has been updated with recent comments Trump and Pelosi have made about Birx."}]}