{"article": [{"url": "https://www.marketwatch.com/story/stock-market-investors-are-suddenly-spooked-by-rapidly-rising-coronavirus-cases-in-the-us-heres-why-2020-06-24", "published": 1593255140.0, "headline": "Here's why stock-market distress over spiking coronavirus cases is intensifying on Wall Street", "body": "Flare-ups of COVID-19 in the U.S. have delivered a fresh gut check to bulls on Wall Street in the past week, following an unprecedented market rebound from the coronavirus-ignited downturn back in March. The number of new confirmed cases of the coronavirus illness COVID-19 set a fresh record in the U.S. on Thursday of almost 40,000, according to data aggregated by Johns Hopkins University. A rise in hospitalizations and deaths in states in the southern and western states of the U.S. have accelerated and threaten to reverse, or stall, plans to reopen economies nearly frozen for months to limit the spread of the deadly contagion. Read:Why one strategist is actually encouraged by a spike in new U.S. coronavirus cases On Friday, Florida banned alcohol consumption at its bars and Texas Gov. Greg Abbott issued an executive order that closes all bars in that state, further limited restaurant capacity and restricted certain outdoor activities, including tubing and rafting. That action came a day after the state reimposed a ban on elective surgeries, to keep space for COVID-19 patients. Arizona also has paused their efforts to reopen as hospitals approach full capacity. President Donald Trump traveled to Arizona on Wednesday for an event at a megachurch in Phoenix attended by about 3,000 mainly youthful supporters and a visit to a section of wall along the southern border, on which he signed his autograph. Read:Fauci says in 40 years of dealing with viral outbreaks, he's never seen anything like COVID-19 Coronavirus cases reportedly have been increasing among people between the ages of 22 and 44, notably in Arizona and Texas. While the ramp-up in infections may not represent a \"second wave\" - most experts say we remain in the first wave in the U.S., and at least one has observed that a forest fire might be a more apt description than first, second and subsequent waves - the equity market on Wednesday suffered its biggest selloff since June 11, with the Dow Jones Industrial Average DJIA, +0.56% and the S&P 500 index SPX, +0.87% ending the session 2.4% or more lower and the Nasdaq Composite Index COMP, +1.39% closing down 2.6% on Friday. Over the course of this pandemic, some market experts have sought to evolve into armchair epidemiologists, assessing the implications of the rising tide of infections in the U.S. and around the globe. Thomas Lee, head of Fundstrat Global Advisors, in a research report Monday, said that the biggest implications were on policy. \"This raises many questions but the most important is the policy direction. Given the surge in COVID-19 cases, states and the U.S. need to mitigate transmission - [which is to say] course correct,\" wrote Lee. Thirty-three states on Tuesday recorded a seven-day average of new cases that was higher than their average during the past two weeks, according to the Wall Street Journal's analysis of data from Johns Hopkins. Ironically, elevated infections and hospitalizations in clusters across America, compelled New York - formerly an epicenter of the global pandemic - to instate a quarantine on travelers visiting from Alabama, Arkansas, Arizona, Florida, North Carolina, South Carolina, Washington, Utah and Texas. New York is rolling out the 14-day quarantine protocol in coordination with Connecticut and New Jersey, states that also have seen cases stabilize in recent weeks. Trump, slated to travel to his Bedminster, N.J., golf resort this weekend, won't abide by the quarantine, according to a White House deputy press secretary. New Jersey Gov. Phil Murphy noted on CNN that there is a \"carve-out\" in the quarantine order for essential work. Fundstrat's Lee wrote that one of the fears for investors is that the jump in infections will force a broader reinstatement of stay-at-home orders, which are viewed as politically and economically unpalatable after three months of such procedures in much of the world. \"The last resort is likely reinstate shelter at home,\" Lee wrote. He said the \"best solution, probably, but also the most unpopular, is [to] require usage of masks.\" Lee provided a list of 10 public-policy steps that could be implemented to curtail a surge in COVID-19 infections: Improve contact tracing, which he described as \"failing\" in the U.S. Enforce social distancing. Isolate the elderly and those with prospective co-morbidity conditions. Require masks, which he identified as \"very unpopular.\" Require sanitization measures. Close rogue establishments. Monitor waste, inclusive of fecal testing. Close state borders. Close international borders. Roll back reopenings or reclose a state, which he described as an absolute last resort. A number of states, including Washington and California, are mandating the wearing of facial coverings. \"Until a vaccine or cure is developed, this is going to be one of our best defenses,\" Washington Gov. Jay Inslee said in a statement. On Tuesday, at a congressional hearing, public health expert Dr. Anthony Fauci described the rise in cases as a \"disturbing\" development and vowed to increase testing, but also expressed hope about progress toward a vaccine. See:Race for a COVID-19 vaccine has drug makers scaling up manufacturing - before one is developed It isn't universally clear why certain states are showing flare-ups while others aren't, though experts say that the adherence to social-distancing protocols and stricter public health policies have been far from uniform across the 50 states. Some states more eagerly heeded a White House preference for quick and full reopenings. In Arizona, some health professionals have linked the surge in cases in the Grand Canyon state to lifting stay-at-home orders too early. Arizona eased its orders a month ago. Gov. Doug Ducey has said that he's not considering reinstating a shelter-in-place measure even as cases rise, though he did stage an about-face to allow localities to mandate mask usage. Emergency rooms in the state are seeing about 1,200 suspected COVID-19 patients a day, compared with some 500 a month ago, the AP reported. That surge has prompted Dr. Joseph Gerald, a professor of public health policy at the University of Arizona, to predict that, if current trends continue, hospitals will probably exceed capacity within the weeks. \"We are in deep trouble,\" the doctor was quoted as saying. Earlier this week, California touched a new high in the number of hospitalizations related to COVID-19, surpassing the previous peak in late April. Data as of Sunday showed that the state had 3,702 hospitalized, with the rise in infections being attributed there to an erosion of social distancing, particularly as residents welcome summertime weather and activities. Fundstrat's Lee has attributed at least some of the rise in cases to a wave of national protests that erupted in late May and earlier this month following the murder of George Floyd. Floyd, a black handcuffed man, died on May 25 after Derek Chauvin, a white Minneapolis officer, was captured on video driving his knee into his neck for 8 minutes and 46 seconds even as Floyd said he couldn't breathe and stopped moving. That action helped spark a wave of civil unrest over inequality in the U.S. and treatment of black Americans in policy custody. Chauvin and three fellow officers were fired and criminally charged. \"Each of the protests involved tens of thousands of Americans in close proximity for hours,\" Lee wrote. Houston Mayor Sylvester Turner said Gov. Greg Abbott reopened Texas businesses too soon. \"I would have stayed with the course that was working well for the city of Houston and other cities in the state of Texas,\" he said, according to the Texas Tribune. Dr. Robert Quigley, senior vice president and regional medical director of International SOS, a medical-security and travel-safety company, said that it's hard to place blame on any one state for the resurgence in cases. \"Even as an immunologist, I am struggling with some of the characteristics of this novel virus and its behavior,\" he said, referring to the highly contagious nature of this coronavirus compared with other coronaviruses. The virus was first identified in Wuhan, China, in December and has infected more than 9 million people world-wide. The World Health Organization currently estimates that 16% of people with COVID-19 are asymptomatic and can transmit the coronavirus, while other data posit that 40% of coronavirus transmissions are due to carriers not displaying symptoms of the illness. As a result, public health officials have advised people to keep a distance of 6 feet between themselves and others from outside their households. Read: No, this surge in coronavirus cases in some states isn't part of a 'second wave' Plus:Disney delays reopening Disneyland and other California theme parks Quigley said that it's important for states to impose restrictions and compel citizens to wear masks and to adhere to proper sanitization procedures to have any hope of limiting the spread of the virus. \"What we do know is that if we are compliant with social distancing and universal precautions, not limited to sanitizing our hands and wearing a mask at all times possible, the likelihood of transmitting the disease is remarkably lower,\" he said. Dr. Jeremy Faust, in an interview with CNBC on Wednesday, said that states and local governments need to be more evidence-based in their decision making around the pathogen. The lesson, he said, is that they need to be \"data driven not date driven.\" He also advocated for measures that in their totality help reduce the contagion's spread, including wearing facial coverings. \"It helps a little,\" he said. \"Just because something isn't perfect, it doesn't mean it doesn't help.\" As for the market's downturn, Liz Ann Sonders, chief investment strategist at Charles Schwab, told MarketWatch via email that investors may have become too complacent about the epidemic and too hopeful that a V-shaped, or quick, economic recovery would take place. \"We probably had a lull because of 'hopium' around stronger economic data recently, but concerns are increasing (justifiably so) about the ability for the economy to sustain a V-shaped recovery with rising cases,\" she said. \"Even if governments don't shut things down again, it won't prevent businesses from doing so, or consumers from deciding on their own to shelter in place again.\" Wednesday's selloff - and early declines on Thursday - came amid growing worries about the divergence between buzzy technology stocks, which have gotten a boost from the long-term implications of the viral outbreak, and cyclical stocks that are more sensitive to the economic outlook. \"There is also some legitimate concern about equity valuations and how strong the rally has been over the past couple of months,\" wrote Brian Price, head of investment management for Commonwealth Financial Network. \"The massive amount of monetary and fiscal stimulus that has been injected into the global economy was the primary catalyst behind the market's advance, but there seems to be ambiguity about additional support. \"Reluctance to extend or offer additional stimulus could bring a risk factor into the market that may not be fully appreciated at this point,\" he said, referring to calls for further fiscal stimulus to help mitigate damage to businesses during this public health crisis."}]}