{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-cases-top-203-million-us-tally-tops-515-million-as-florida-and-georgia-see-record-one-day-deaths-2020-08-12", "published": 1597237940.0, "headline": "Coronavirus update: Global cases top 20.3 million, U.S. tally tops 5.15 million as Florida and Georgia see record one-day deaths", "body": "An earlier version of this article incorrectly stated that students and teachers in a Georgia school district were quarantined after all tested positive for COVID-19. Only 59 tested positive. The article has been corrected. AFP via Getty Images The number of confirmed cases of the coronavirus illness COVID-19 worldwide climbed above 20.3 million on Wednesday and the U.S. case tally topped 5.15 million, as Florida and Georgia reported record one-day death tolls. There were more than 1,300 deaths in the U.S. on Tuesday, according to data aggregated by Johns Hopkins University. Florida counted 276 deaths on Tuesday, according to the Florida Department of Health, topping the previous record of 257 recorded on July 31. Georgia counted 137 deaths to beat its previous record of 92 reported last Friday. In one school district in Cherokee County, more than 900 students and staff have been ordered to quarantine after 59 tested positive for COVID-19. Many schools in rural and suburban Georgia, Tennessee and Mississippi reopened in early August, and some have now been forced to close again, as the New York Times reported. In other news: • The British economy collapsed in the second quarter by the most on record, in the worst showing of any major economy during the pandemic, MarketWatch’s Steve Goldstein reported. The U.K. gross domestic product quarter-on-quarter fall of 20.4% in the second quarter was worse than even hard-hit France and Spain. It was double the roughly 10% declines of the U.S. and Germany during the period. The 20.4% decline was slightly better than the 21.2% decline forecast by economists. See also:Brace for more stimulus from Johnson and the Bank of England, as U.K economy falls into recession “The economy began to bounce back in June with shops reopening, factories beginning to ramp up production and house building continuing to recover. Despite this, GDP in June remains a sixth below its level in February, before the virus struck,” said Jonathan Athow, ONS deputy national statistician and director general for economic statistics. The U.K. has the fourth highest death toll from COVID-19 in the world, at 46,611. It has 313,403 confirmed cases of the illness, after entering lockdown after neighboring countries, and allowing some major sports events to take place, including the annual Cheltenham Festival, a four-day horse racing event that ran from March 10 to March 13. See: ‘Cable Cowboy’ John Malone’s Liberty Global lassos Sunrise Communications in $7.4 billion deal • New Zealand is starting mass testing after four new cases of COVID-19 were diagnosed on Tuesday, following more than 100 days with zero cases. New Zealand’s Prime Minister Jacinda Ardem is to hold a news conference with the country’s top health official, Ashley Bloomfied, later Wednesday, the Guardian reported. • The Paris marathon that was meant to take place on Nov. 15 has been canceled after a fresh surge in virus cases in France, Agence France-Presse reported. The race had already been moved from its original timing of April 15. “Faced with the difficulty that many runners, especially those coming from abroad, had in making themselves available for the 15 November, it was decided that it would be better and simpler for those concerned if we organized the Schneider Electric Marathon de Paris in 2021,” organizers said. • The World Health Organization warned that the displacement of people following last week’s major explosion in Lebanese capital Beirut could accelerate the spread of COVID-19. World Organization official Tarik Jarasevic told a UN briefing in Geneva that the roughly 300,000 people left homeless by the blast has caused many containment measures to be relaxed. Lebanon reported a record of 309 new cases of the virus on Tuesday, boosting the number to 7,121, the Johns Hopkins data show. • In Belgium, officials in the capital Brussels has made it compulsory to wear face masks in public places, after cases exceeded 50 per 100,000 people. Belgium has 75,008 confirmed cases of COVID-19 and at least 9,885 people have died. iframe.twitter-tweet { width: 100% !important; } Latest tallies The global death toll from COVID-19 stood at 743,599 on Wednesday, the Johns Hopkins data show. At least 12.6 million people are confirmed to have recovered. Brazil is second to the U.S. by case numbers, at 3.1 million, and deaths at 103,026. India is next by case numbers at more than 2.3 million, followed by Russia with 900,475 and South Africa with 566,109. Mexico has 492,522 cases and 53,929 deaths, the third highest in the world. What’s the latest medical news? Experts continued to weigh in on Russia’s announcement Tuesday that it is registering the world’s first COVID-19 vaccine, even though it has not yet commenced Phase 3 testing. Dr. Anthony Fauci, head of the National Insitute for Allergies and Infectious Diseases, told ABC News that having a vaccine, and having a safe and effective vaccine, are two different things. “I hope that the Russians have actually, definitively proven that the vaccine is safe and effective,” Fauci said. “I seriously doubt that they’ve done that.” His comments echoed those of other experts expressing skepticism and alarm at the speed with which Russia has developed the vaccine and its plan to start dosing volunteers, including health care workers and teachers, in October. Russia has conducted just two trials of the vaccine, with a third planned after volunteers register. The normal approval process for a new medicine is to gather data from Phase 1 and Phase 2 trials, and then expand the patient base to thousands in a Phase 3 trial to create enough evidence it is effective and safe. “There are no Olympic medals for being first,” said Dr. Matthew Schmidt, University of New Haven Associate Professor of National Security and Political Science and a Russia expert. “Cheating on the scientific process hurts the perception of vaccine safety everywhere. The goal isn’t to be first, it’s to be first in a way that gives people faith in a vaccine’s safety,” he said. In other medical news, Moderna Inc. MRNA, +0.09% agreed to sell at least 100 million doses of its COVID-19 vaccine candidate to the U.S. government for more than $1.5 billion. The vaccine is currently in a Phase 3 trial after earlier research found it produced antibodies. The news sent the stock of the small biotech up 2.4% on Wednesday and brought its year-to-date gains to 257%. See:Inovio shares tumble as analysts say COVID-19 vaccine update left more questions than answers Here’s the latest news on companies and COVID-19: • Booz Allen Hamilton Holding Corp. BAH, -0.24% is planning to offer $500 million of senior notes in a private offering. The IT consulting firm didn’t say when the notes will mature. Proceeds of the deal will be used to redeem all of the 5.125% senior notes that mature in 2025. Companies have been issuing record levels of debt during the coronavirus pandemic. • Brinker International Inc. EAT, +1.00%, the parent of Chili’s and Maggiano’s restaurant chains, reported a narrower-than-expected fiscal fourth-quarter loss, although revenue missed, and the company provided an upbeat first-quarter outlook. Total revenue fell 32.5% to $563.2 million, below the FactSet consensus of $572.9 million, as the negative effects of the pandemic were partially offset by the acquisition of 116 restaurants a year ago and increased off-premise sales. Same-store sales of company-owned Chili’s restaurants fell 32.2% and dropped 66.7% at Maggiano’s restaurants. For the first month of the current quarter, same-store sales at Chili’s were down 10.9% and were down 44.6% at Maggiano’s. See now: Tesla’s stock run leads to 5-1 share split • Carnival Corp.’s CCL, +0.51% Holland America on Tuesday extended its halt on cruises through Dec. 15 as travel and port restrictions due to the pandemic continue. Canceled cruises included trips to the Caribbean, Mexico, and Australia. The company had already canceled its Alaska, Europe and Canada/New England cruises for 2020 and some Hawaii itineraries through early 2021. Buyers will automatically receive credit for a future cruise or opt for a full refund by Sept. 15. • Eastman Kodak Co. KODK, +12.98% reported a second-quarter loss of $5 million, after profit of $201 million in the year-ago period, as the company “continued to navigate the challenges posed by the pandemic during the second quarter,” it said in a statement. Revenue fell to $213 million from $307 million a year ago. “Although the print industry slowdown impacted our performance, we continued to serve our customers and furthered our long history of innovation through the launch of six new print products,” Executive Chairman Jim Continenza said in the statement. Kodak didn’t provide per-share figures and no analyst surveyed by FactSet had financial forecasts for the company’s quarter. The company said it ended the period with a cash balance of $180 million, down from a March 31 cash balance of $209 million. Interest in Kodak shares has experienced a resurgence in recent days on news of a potential deal to give Kodak a $765 million loan to help pay for factory changes needed to make generic drugs in short supply in the U.S. • Lemonade Inc. LMND, +12.82%, the mobile-based insurance company, reported its first quarterly results a little over a month after its initial public offering showing a narrower-than-expected loss but revenue that fell short. “At the start of the quarter we significantly slowed our marketing spend, suspended nonessential hiring, and offered to defer customers’ payments,” in the midst of the pandemic, the company said. “Then, we braced for impact. We expected to see a spike in churn, a drop in demand, and a hit to our cash flow. None materialized.” Lemonade expects revenue of $14 million to $15 million for the third quarter, and $86 million to $88 million for the year • Lowe’s Cos. LOW, +1.38% is opening a West coast fulfillment center in Mira Loma, Calif. in October, part of a network of facilities that will expand company’s home delivery capabilities which are in demand during the pandemic. Lowe’s has plans for 50 cross-dock delivery terminals, seven bulk distribution centers and a total of four e-commerce fulfillment centers. Twenty of the cross-dock delivery terminals will be on the West Coast. The do-it-yourself retailer has opened a number of facilities of varying sizes in cities like Chicago and Columbus, Oh. over the past 18 months. The company announced a $1.7 billion investment in the expansion by 2023. The initial expansion will also create nearly 5,000 jobs. • Home-shopping channel QVC said Wednesday it is planning to offer $500 million of senior secured notes that mature in 2028, joining the many companies issuing debt at record levels during the pandemic. Proceeds will be used to repurchase the $500 million in outstanding 5.125% notes that mature in 2022. QVC is owned by Qurate Retail Inc. QRTEA, +0.45% QRTEB, -2.89% • Red Robin Gourmet Burgers Inc. RRGB, +2.75% reported fiscal second-quarter results that fell far short of Wall Street estimates. Red Robin executives blamed the shortfall on the closure of restaurants during the pandemic. Red Robin reported a net loss of $56.3 million, or $4.09 a share, versus net income of $981,000, or 8 cents a share, in the year-ago quarter. Revenue slumped 48% to $161.1 million from $308 million a year ago. Analysts surveyed by FactSet had expected a loss of $3.27 a share on revenue of $166.6 million. • Royal Caribbean Group RCL, +2.59% secured a $700 million term loan facility from Morgan Stanley. If the company draws on the facility, the loan will bear interest at Libor plus 3.75%, and will mature in 364 days Royal said in its recent earnings that it has liquidity of about $4.1 billion as of June 30, has debt maturities of $300 million in 2020 and $1.3 billion in 2021, and estimated a monthly cash burn rate of $250 million to $290 million during a prolonged suspension of operations as a result of the pandemic."}]}