{"article": [{"url": "https://www.marketwatch.com/story/new-york-citys-vast-numbers-of-nail-salons-face-uphill-battle-after-reopening-2020-07-10", "published": 1594394720.0, "headline": "New York Cityâ\u0080\u0099s 4,000 nail salons face uphill battle after reopening", "body": "Nail salons reopened this week in New York City as the five boroughs entered Phase 3 of reopening, but the long-term prospects for the survival of these omnipresent businesses â\u0080\u0094 and the guaranteed safety of both workers and customers â\u0080\u0094 is far from certain. Starting last Monday, â\u0080\u009cpersonal careâ\u0080\u009d services, including spas, massage parlors, and the cityâ\u0080\u0099s estimated 4,000 nail salons, were allowed to reopen in a limited capacity. But the reopenings will hardly mark a return to the typical mani-pedi routine many New Yorkers have come to expect. Phase 3 guidelines mandate that salons operate at no more than 50% capacity, and that social distancing of 6 feet between individuals be enforced wherever possible. Waiting areas areÂ closed, and masks are mandatory. Coronavirus update: Health officials clamor for U.S. states seeing spikes in COVID-19 infections to pause reopening State guidelines also recommend that personal care businesses adopt â\u0080\u009cappointment-onlyâ\u0080\u009d policies in order to limit crowding, a move that further limits revenue by cutting off business from drop-in clients, a significant source of income for many salons in highly trafficked areas.Â â\u0080\u009cAnyone who relies on people showing up at their door, whether youâ\u0080\u0099re retail, hospitality, or hair or nail salons, theyâ\u0080\u0099re all going to struggle,â\u0080\u009d said Steve Sleeper, executive director of the Professional Beauty Association, a national trade organization.Â Nail technicians and salon employees have raised concerns about whether these safety measures will be properly enforced, however, and whether protective equipment such as gloves and masks will be consistently available.Â The top concern â\u0080\u009cwith workers is if weâ\u0080\u0099re going to get proper protective equipment from salon owners to be able to come home safe,â\u0080\u009d said Luis Gomez, director of organizing for Workers United a labor union in the U.S. and Canada, which represents the New York Nail Salon Workers Association. â\u0080\u009cEven pre-Covid, workers were required to have gloves and masks provided by salon owners, but worst case, they werenâ\u0080\u0099t being provided at all, or workers were having to pay for it themselves. There were rampant violations.â\u0080\u009d To make up for limits on customer volume, some salons in parts of New York state that had entered Phase 3 before the city extended the hours and days that theyâ\u0080\u0099re open. Also see: Closed attractions and travel restrictions put New York Cityâ\u0080\u0099s $70 billion tourism industry on hold indefinitely â\u0080\u009cThese businesses that might normally be closed on a Sunday or a Monday are now open seven days a week,â\u0080\u009d said Todd Garofano, executive director of NYS Association of Salon & Spa Professionals. With longer hours but fewer customers and nail techs allowed at a time, many salon workers may not be earning the equivalent of their pre-pandemic incomes.Â Â â\u0080\u009cIf a salon is actually compliant, that means they have less people actually in the space at a time, and currently workers are still under the tip system,â\u0080\u009d Gomez said. â\u0080\u009cTip the technician well.â\u0080\u009dÂ Visitors to salons should also be prepared to keep their masks on at all times, get used to technicians working with gloves on, and stay home if theyâ\u0080\u0099re feeling sick or have otherwise potentially been exposed to the virus. Initially after reopenings in other states nail parlors saw a rush of appointments from regulars who have spent the past several months forgoing their usual beauty treatments, Sleeper said. But with some customers and even some employees uneasy about returning to business as usual, many businesses havenâ\u0080\u0099t been able to generate their usual levels of income. Also read: While politicians squabble, New York schools make their own plans â\u0080\u009cSome people are coming in, but others are still not back,â\u0080\u009d Sleeper said. â\u0080\u009cSo besides volume being physically down with the new safety protocols, client counts are down because folks arenâ\u0080\u0099t totally sure yet.â\u0080\u009d Widespread work-from-home policies may be yet another factor keeping clients out of salon chairs, as customers feel less pressure to keep up their pre-pandemic grooming regimens.Â â\u0080\u009cWith so much working from home, even clients that are coming in are spacing out their visits more,â\u0080\u009d Sleeper said. â\u0080\u009cThey think, â\u0080\u0098Iâ\u0080\u0099m not going into the office, I may not need to look quite as good or be quite as put together all the time.â\u0080\u0099 Everyoneâ\u0080\u0099s consumer behavior right now is different than it ever was.â\u0080\u009d All of which means that reopening is hardly a straightforward calculus, and many salon owners have opted to remain closed for now, an effect that could be compounded in New York City, where the volume of nail salons is already higher than in any other city in the U.S. In the long term, this could change the landscape of the industry, said Sleeper, and many stylists who have made the leap to starting their own shops and becoming small-business owners may find themselves driven back to working â\u0080\u009cbehind the chairâ\u0080\u009d in other salons. And though data on viral spread in salons, which already adhere to rigorous health standards, is encouraging â\u0080\u0094 a case of a Missouri salon where masks prevented two sick employees from spreading the virus is widely cited as an example â\u0080\u0094 restrictions that hamper manicuristsâ\u0080\u0099 ability to turn a profit are likely to remain in place indefinitely, creating long-term financial strain."}]}