{"article": [{"url": "https://www.marketwatch.com/story/wrong-trump-and-fauci-clash-over-the-resurgence-of-covid-19-cases-shutdown-of-us-economy-and-hydroxychloroquine-2020-08-02", "published": 1596458060.0, "headline": "'Wrong!' Trump and Fauci clash over surge in coronavirus cases, handling of economic shutdown - and hydroxychloroquine", "body": "Anthony Fauci and President Trump are still at odds. Fauci, director of the National Institute of Allergy and Infectious Diseases for three decade who has worked on the front lines of the AIDS pandemic in the 1980s and 1990s, the Ebola outbreak of 2014 to 2016 and the anthrax attacks two decades ago, testified before Congress last week that the U.S. should have taken speedier and more comprehensive action to close businesses when coronavirus first appeared in the U.S. earlier this year. Fauci said the U.S. effectively only shut down half the economy. \"If you look at what happened in Europe when they shut down, or locked down, or went to shelter-in-place, however you want to describe it, they really did it to the tune of about 95% plus,\" he told the hearing. \"When you actually look at what we did, even though we shut down, even though it created a great deal of difficulty, we really functionally shut down only about 50% in the sense of the totality of the country.\" President Trump hit back at Fauci on Twitter TWTR, -0.23%  on Saturday evening, replying to a post by CBS News VIAC, -2.34%  of Fauci's testimony. \"Wrong! We have more cases because we have tested far more than any other country, 60,000,000. If we tested less, there would be less cases. How did Italy, France & Spain do? Now Europe sadly has flare ups. Most of our governors worked hard & smart. We will come back STRONG!\" Nearly 53 million people have been tested for coronavirus in the U.S. to date, according to the Centers for Disease Control and Prevention, with more than 5 million or 10% of those testing positive for the virus. Wait times of more than 10 days have become the norm for many Americans. There are, however, stories of people who have had to wait 26 days to get their results. Waiting 10 days for a test defeats the purpose of getting tested, some health professionals say. Approximately half of the tests being performed daily are conducted by commercial labs such as Quest Diagnostics DGX, +0.33%  and LabCorp. \"Only one state has an average turnaround time of greater than five days,\" said Admiral Brett Giroir, a member of the White House coronavirus task force.\" Five states are between four and five days. 26 states are still three days or less, and the rest are between three and four days.\" Turnaround times of 10 to 12 days represent outliers, he added. The Trump administration, meanwhile, is trying to block $25 billion for states to conduct testing and contact tracing in the next coronavirus relief bill, people involved in the talks told the Washington Post this month. Democratic lawmakers, in negotiations over a new stimulus bill, have demanded $25 billion for the testing and contact-tracing, over three times what the GOP have suggested. Contact tracing identifies people who someone with COVID-19 has come into contact with. iframe.twitter-tweet { width: 100% !important; } At the U.S. House Select Subcommittee on the Coronavirus Crisis, Fauci reiterated that there was no scientific evidence to show that hydroxychloroquine was helpful for coronavirus patients. \"You look at the scientific data and the evidence, and the scientific data, on trials that are valid that were randomized and controlled in the proper way; all of those trials show consistently that hydroxychloroquine is not effective in the treatment of coronavirus disease or COVID-19.\" When asked by Republican Rep. Blaine Leutkemeyer from Missouri about a \"peer-reviewed\" study suggesting otherwise, Fauci said, \"The Henry Ford Hospital study that was published was a non-controlled retrospective cohort study that was confounded by a number of issues, including the fact that many people who were receiving hydroxychloroquine were also using corticosteroids, which we know from another study gives a clear benefit in reducing deaths with advanced disease.\" \"So that study is a flawed study, and I think anyone who examines it carefully [would see] that it is not a randomized placebo-controlled trial. You can peer review something that's a bad study,\" Fauci said, adding, \"I would be the first one to admit it and to promote it, but I have not seen yet a randomized placebo controlled trial that's done that. I don't have any horse in the game one way or the other. I just look at the data.\" Social-media sites attempted to quash a video pushing misleading information about hydroxychloroquine as a COVID-19 treatment - which led to Twitter partially suspending Donald Trump Jr.'s account. The video featured doctors calling hydroxychloroquine - a drug used to treat malaria, lupus and rheumatoid arthritis for decades - \"a cure for COVID\", despite a growing body of scientific evidence that has not shown this to be true. As of Monday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected at least 18.1 million people globally and 4.7 million in the U.S. It had killed over 690,413 people worldwide and at least 154,944 in the U.S. Cases in California hit 512,606 and deaths reached 9,400 as it reported 4,381 new cases Sunday and 35 new deaths, down from 7,118 new cases and 134 new deaths Saturday. New York has the most fatalities (32,710) followed by New Jersey (15,836). The Dow Jones Industrial Index DJIA, +0.56%  were trading higher Monday, as investors tracked round two of the potential fiscal stimulus. The S&P 500 SPX, +0.87%  and Nasdaq Composite COMP, +1.39% also entered the week higher; some of the industry's largest and most powerful players - Apple AAPL, +1.74%  Facebook FB, +0.26%, Amazon. AMZN, +3.01% and Google parent Alphabet Inc. GOOGL, +1.82%  GOOG, +1.97%  - reported their results Friday. Related:Dr. Fauci tells MarketWatch: I would not get on a plane or eat inside a restaurant Health professionals, economists and lawmakers are concerned about the rise in coronavirus over the last month with the rise in daily cases exceeding 1,000 for the sixth consecutive day on Saturday. The U.S. cannot afford to have a resurgence of the virus either now or in the fall, health professionals say. For one, it's harder to get people to practice social distancing and stay home again, especially after they've already abided by stay-at-home orders for more than 11 weeks. Secondly, the effect on the economy could push the U.S. into a prolonged recession, even greater than the one already predicted by some economists, despite some observers seeing public health and economic health as an either/or scenario. Thirdly, the flu season will already be upon us in the winter and those symptoms are easily confused with those of COVID-19. Fourthly, too few people will be immune to COVID-19 after this first wave ends to support herd immunity. Another thing to consider: Given the age profile of fatalities in the U.S. and other countries, elderly people would die in far greater numbers if the economy were restarted earlier. Paul Zak, a neuroscientist and author of \"The Moral Molecule: The Source of Love and Prosperity,\" said a trade-off between the economy and allowing (older) people to die of COVID-19 reflects that society values people on their economic output, which ignores a multitude of other factors. \"It's appalling to attach a dollar number to a human life - for non-economists,\" Colin Camerer, a professor of behavioral finance and economics at the California Institute of Technology in Pasadena, told MarketWatch. \"You can never make things perfectly safe with zero risk. We do have limited time, health-care staff, ventilators and money. What is the curve of transmission? How many people are going to die, if you open up the economy? No one is really too sure.\" Trump has said he is also concerned about the impact of the pandemic and job losses on people's mental health; some studies suggest it could lead to tragic outcomes. The growing epidemic of \"deaths of despair\" in the U.S. is also increasing due to the pandemic - and another 75,000 more people will likely die from drug or alcohol misuse and suicide, according to research from the Well Being Trust, and Robert Graham Center at the American Academy of Family Physicians. The response to the virus has been split down political lines. The American public has responded differently to the pandemic along political lines: 62% of Republicans and Republican leaners say the seriousness of COVID-19 is \"generally exaggerated,\" according to one survey, while just 31% of Democrats and Democrat leaners and 35% of independents say the same. Democrats and independents are more likely than Republicans that coronavirus is a threat. How COVID-19 is transmitted"}]}