{"article": [{"url": "https://www.marketwatch.com/story/40-of-50-states-are-showing-rise-in-confirmed-coronavirus-cases-2020-07-02", "published": 1593716780.0, "headline": "40 of 50 states are showing rise in confirmed coronavirus cases", "body": "FORT LAUDERDALE, Fla. — The number of confirmed coronavirus cases per day in the U.S. climbed to an all-time high of more than 50,000 on Thursday, with the infection curve rising in 40 of the 50 states in a reversal that has largely spared only the Northeast. An alarming 36 states are seeing an increase in the percentage of tests coming back positive for the virus. “What we’ve seen is a very disturbing week,” Dr. Anthony Fauci, the government’s top infectious-disease expert, said in a livestream with the American Medical Association. In a major retreat that illustrated how dire things have become in Texas, Republican Gov. Greg Abbott ordered the wearing of masks across most of the state after refusing until recently to let even local governments impose such rules. The surge has been blamed in part on Americans not covering their faces or following other social distancing rules as states lifted their lockdowns over the past few weeks. Fauci warned that if people don’t start complying, “we’re going to be in some serious difficulty.” The U.S. recorded 50,700 new confirmed cases, according to a tally kept by Johns Hopkins University. That represents a doubling of the daily total over the past month and is higher even than what the country witnessed during the most lethal phase of the crisis in April and May, when the New York metropolitan area was easily the worst hot spot in the U.S. All but 10 states are showing an upswing in newly reported cases over the past 14 days, according to data compiled by the volunteer COVID Tracking Project. The outbreaks are most severe in Arizona, Texas and Florida, which together with California have reclosed or otherwise clamped back down on bars, restaurants and movie theaters over the past week or so. Nebraska and South Dakota were the only states outside the Northeast with a downward trend in cases. While some of the increases may be explained by expanded testing, other indicators are grim, too, including hospitalizations and positive test rates. Over the past two weeks, the percentage of positive tests has doubled in Georgia, Kansas, Montana, Michigan, Missouri, Tennessee, Mississippi, South Carolina and Ohio. In Nevada, it has tripled. In Idaho, it is five times higher. In Texas, where new cases in the past two weeks have swelled from about 2,400 a day to almost 8,100 on Wednesday, the positive rate ballooned from 8% to 14.5%. In Arizona, it has gone from 5.7% to 10.3%. Abbott, who in May began one of the most aggressive reopening schedules of any governor, ordered the wearing of masks in all counties with at least 20 COVID-19 cases. Abbott said in a video posted on Twitter that the state’s lower infection rate and case counts after his stay-home order in April might have led some to think the “coast was clear.” But the number of people hospitalized in Texas because of COVID-19 has tripled since late May, after businesses began reopening. “We are now at a point where the virus is spreading so fast, there is little margin for error,” Abbott said. “I know that wearing a face covering is not the convenient thing to do, but I also know that wearing a face covering will help us to keep Texas open for business. And it will help Texans earn the paycheck they need.” The surge comes as Americans head into a Fourth of July holiday that health officials warn could add fuel to the outbreak by drawing big crowds. Many municipalities have canceled fireworks displays. Beaches up and down California and Florida have been closed. Florida reported more than 10,000 new confirmed cases for the first time Thursday. That is six times higher than the daily count of less than a month ago. The state also reported 67 deaths for the second time in a week and 325 new hospitalizations, one of the biggest 24-hour jumps in Florida yet. Georgia likewise saw its biggest single-day increase yet, nearly 3,500 cases. “I’m discouraged because we didn’t act fast enough to shut things down, and we could have done a much better job getting a handle on the virus,” said Megan Archer, a 39-year-old woman from West Palm Beach, Florida, who lost her job with a county parks department during the outbreak. Meanwhile, the government reported that U.S. unemployment fell to 11.1% in June as the economy added a solid 4.8 million jobs. But that figure may be outdated: The data was collected during the second week of June, before many states began to backtrack on restarting their economies. Several Northeastern states have seen new infections slow down significantly, including New York, Massachusetts, Connecticut, Rhode Island and New Jersey, which allowed its Atlantic City casinos to reopen Thursday, though with no smoking, drinking or eating. Pennsylvania, an outlier among Northeastern states, reported its highest one-day total of new cases since May, with more than 830, more than one-quarter of them in Pittsburgh’s Allegheny County, which will impose a one-week shutdown of bars and restaurants and all gatherings of more than 25 people starting Friday. Other states, like Colorado, a major summer destination where increases in infections have been less dramatic, are keeping a close eye on their neighbors. “I’ve been watching that map. ... We’re well aware of what’s going on around us and we’re very anxious,” said Dr. Michelle Barron, medical director of infection prevention and control at UCHealth University of Colorado Hospital. “The next couple of weeks are critical.” President Donald Trump on Wednesday seemed confident the virus would soon subside, telling Fox Business: “I think that, at some point, that’s going to sort of just disappear, I hope.” The U.S. has reported at least 2.7 million cases and more than 128,000 dead, the highest toll in the world. Globally there have been 10.7 million confirmed cases and over 517,000 deaths, according to Johns Hopkins’ count. The true toll is believed to be significantly higher, in part because of limited testing and mild cases that have been missed. Other countries are also reporting an upswing in cases. “We have now entered a new and treacherous phase in the life cycle of this pandemic,” South African President Cyril Ramaphosa warned in a broadcast to the nation, which recorded more than 8,100 new infections, a one-day record, and has the biggest caseload on the continent. India, the world’s second-most populous country with more than 1.3 billion people, has reported nearly 100,000 new cases in the past four days alone."}]}