{"article": [{"url": "https://www.marketwatch.com/story/nbas-milwaukee-bucks-boycott-playoff-game-over-the-shooting-of-jacob-blake-2020-08-26", "published": 1598479880.0, "headline": "NBA players sit out Wednesday's playoff games, other athletes follow their lead to protest Jacob Blake's shooting", "body": "The Milwaukee Bucks decided to \"strike\" and not take the floor for their playoff game today in protest of the police shooting of Jacob Blake in Kenosha, Wis. The game between the Bucks and the Orlando Magic was scheduled for Wednesday afternoon, but the teams remained in their respective locker rooms. Games between the Houston Rockets and the Oklahoma City Thunder, and the Los Angeles Lakers and Portland Trail Blazers were then also postponed, according to the NBA. iframe.twitter-tweet { width: 100% !important; } \"Our focus today cannot be on basketball,\" Bucks players said in a joint statement. \"We are calling for justice for Jacob Blake and demand for the officers to be held accountable.\" The city of Milwaukee, where the Bucks play their home games, is about 40 miles from Kenosha. iframe.twitter-tweet { width: 100% !important; } Officers in Kenosha shot and wounded Jacob Blake, a Black man, after responding to a call about a domestic dispute. The police officers shot Blake, who was unarmed, several times. Blake's father told the press that his son was paralyzed from the waist down. It's unclear whether Blake's paralysis is permanent. The incident was captured on video. NBA players have called for an emergency meeting on Wednesday night in Orlando to \"determine next steps\" according to The Athletic. iframe.twitter-tweet { width: 100% !important; } In the aftermath of the death at Minneapolis police hands of George Floyd, more athletes have been vocal about expressing their opposition to police brutality against people of color. iframe.twitter-tweet { width: 100% !important; } NBA players have been among the most vocal about police brutality in particular, with stars like LeBron James, Chris Paul and Donovan Mitchell all coming out against similar police actions. iframe.twitter-tweet { width: 100% !important; } Los Angeles Clippers coach Doc Rivers discussed the situation in Kenosha on Tuesday night, saying: \"We've been hung. We've been shot. And all you do is keep hearing about fear. It's amazing. We keep loving this country. And this country doesn't love us back.\" Kenny Smith, a former NBA player and now a marquee commentator, walked off the TNT set Wednesday in solidarity with the players' work action: iframe.twitter-tweet { width: 100% !important; } The player work stoppage has spilled over to Major League Baseball, as the Cincinnati Reds have agreed to join the Milwaukee Brewers in sitting out a scheduled game Wednesday night. The Seattle Mariners and San Diego Padres also voted not to play, as did the San Francisco Giants and Los Angeles Dodgers. \"Given the pain in the communities in Wisconsin and beyond following the shooting of Jacob Blake, we respect the decisions of a number of players not to play tonight,\" MLB said in a statement. The WNBA also postponed three games scheduled for Wednesday night. \"We stand in solidarity with our brothers in the NBA,\" Atlanta Dream player Elizabeth Williams said. Major League Soccer postponed five games. Tennis star Naomi Osaka, who has won two Grand Slam tournaments, also pulled out of the semifinals of the Western & Southern Open, saying in a statement: \"Before I am an athlete, I am a Black woman. And as a Black woman I feel as though there are much more important matters at hand that need immediate attention, rather than watching me play tennis.\""}]}