{"article": [{"url": "https://www.marketwatch.com/story/social-security-is-in-danger-senior-citizens-are-battling-a-health-crisis-its-not-easy-aging-in-america-2020-06-30", "published": 1593512120.0, "headline": "Social Security is under pressure, senior citizens are battling a health crisis â\u0080\u0094 itâ\u0080\u0099s not easy aging in America", "body": "Many Americans rely on Social Security for a majority of their retirement income, yet the future of the program is riddled with uncertainties. And right now, senior citizens are disproportionately affected by the health risks posed by COVID-19. And there are numerous ways to improve the lives of older Americans, said Max Richtman, president and chief executive officer of the National Committee to Preserve Social Security and Medicare. Older Americans are facing many challenges, said Richtman. Like the rest of the country, older people are living through a global health crisis â\u0080\u0094 but they are at a higher risk of complications from becoming infected with the coronavirus. They also suffer financially for other reasons, such as insufficient Social Security benefits, a lack of retirement savings to last them through their old age and potential federal spending cuts to programs that support their health, nutrition and safety, he said. Richtman recently assumed the role as chairman of the Leadership Council of Aging Organizations, which is a coalition of 69 national nonprofit organizations focused on older Americans and their well-being. In his roles, Richtman and his groups work toward policy changes that benefit seniors. (Richtman is also an occasional MarketWatch contributor.) Richtman spoke with MarketWatch about some of the problems older Americans face today â\u0080\u0094 and possibly in the future â\u0080\u0094 as well as ways in which the government and society could help. See: We have $190,000 in retirement savings and want to use COVID-related distribution rules to pay off $40,000 in debt â\u0080\u0094 should we? MarketWatch: What are some of the greatest challenges seniors face today? Max Richtman: Obviously what comes to mind right away is the immediate challenge from the COVID-19 pandemic. As we all know, it hit seniors harder than any age group, especially those in nursing homes. Unfortunately, the Trump administration and governors didnâ\u0080\u0099t do more to protect nursing home residents. Many of those facilities have really alarming rates of fatality. We have also been focused for quite a long time on the challenge that seniors face from high prescription drug costs. Already, the price for 20 of the most commonly prescribed brand name drugs for seniors have grown 10 times faster than the rate of inflation over the past five years. That is a startling statistic. We know seniors use prescription drugs much more than many other groups, and some seniors are rationing their pills and making choices they shouldnâ\u0080\u0099t have to make between buying food and buying medicine. There is one proposal in the Senate which includes improvements to Medicare, and it tells the federal government to negotiate with drug companies, which is specifically precluded now. When prescription drug coverage was added as Medicare Part D in 2003, there were specific prohibitions that the federal government cannot negotiate. We have been trying for 17 years to change that. Also, the cost of living for seniors has grown beyond general inflation and the reason they are falling behind with their Social Security benefits is the formula used to determine what the cost of living adjustment should be â\u0080\u0094 itâ\u0080\u0099s flawed. It uses inflation as it impacts a wage earner and looks at changes in the cost of a marketbasket of goods wage earners count on, not seniors. In other words, it doesnâ\u0080\u0099t put enough weight on whatâ\u0080\u0099s going up in price like the cost of prescription drugs and medicine. A lot of their benefits are really eaten up by rising health care costs and of course so many people depend on Social Security benefits for all or most of their income. Their personal savings have not allowed them to accumulate any nest egg and beyond that pensions have largely disappeared. Social Security is more important than ever, and weâ\u0080\u0099re glad itâ\u0080\u0099s there but we need to make sure it continues to be there. MW: How has this pandemic affected seniors? We know that regarding health theyâ\u0080\u0099re at a greater risk than others, but has it affected other aspects of their lives as well? Richtman: Their lives, period. Their ability to stay alive has been affected. The other consequence besides dying, which is a pretty big consequence, is that so many seniors and residents at nursing homes and senior living facilities have been quarantined. Itâ\u0080\u0099s the right thing to do but theyâ\u0080\u0099re experiencing extreme isolation. Weâ\u0080\u0099re seeing pictures of families coming to communicate through the window because they arenâ\u0080\u0099t allowed to have any contact. That adds to the loneliness of older people and Iâ\u0080\u0099m sure it will affect their lifestyle and health. One thing that was so troubling was the lieutenant governor of Texas making a statement a few months ago that the seniorsâ\u0080\u0099 lives should be given up or sacrificed for the good of the economy. In other words, letâ\u0080\u0099s write them off. Iâ\u0080\u0099m glad that didnâ\u0080\u0099t get a lot of support, but it is troublesome when politicians and other people in positions of authority donâ\u0080\u0099t seem to feel that the life of someone who is older has as much value or as much importance in contributing to our economy and society. I think we have to be careful that it doesnâ\u0080\u0099t become a dominant concept. MW: What are some misconceptions about aging? Richtman: I have heard before seniors who are well-off donâ\u0080\u0099t need these benefits. I want to be clear, Social Security is an earned benefit paid for while youâ\u0080\u0099re working. There are seniors who are well-off and can survive quite well with lower benefits but the truth is, most seniors are not on golf courses and going on cruises. Yes, you see cases of that but most of them have incomes of $26,000 a year and they havenâ\u0080\u0099t saved much for retirement and count on Social Security for most of their income. The misconception that seniors are a homogenous group is not true. There are some who are wealthy, and then other seniors who are able to continue working beyond 60 or 67. Itâ\u0080\u0099s important to keep in mind there are people who worked physically demanding jobs and itâ\u0080\u0099s a mistake to think everyone who is older can continue working indefinitely. We hear that a lot of seniors are living longer, which I think is a good thing but that doesnâ\u0080\u0099t mean they can continue to work. Also see: Social Security recipients may be in for a rude awakening later this year MW: What do you expect in the next five years for major programs seniors use and rely on, such as Social Security, Medicare, Medicaid, SSI and SNAP? Richtman: It all depends on the outcome of the election in less than six months. This administration, despite the fact that President Trump during his campaign said he wouldnâ\u0080\u0099t touch Social Security and Medicare, hasnâ\u0080\u0099t kept his promise â\u0080\u0094 the administration over the last few budgets has proposed cutting $1 trillion from Medicare, Medicaid, Social Security Disability Insurance and nutrition programs, as well as programs that arenâ\u0080\u0099t as high profile and donâ\u0080\u0099t get as much attention in the media. In a couple of budgets, they have eliminated federal contributions to Meals on Wheels and LIHEAP, which supplements funding for people who do qualify based on income to keep their homes warm. I think if President Trump wins reelection, if he can get a Congress that is majority his party, I think weâ\u0080\u0099re going to see a lot of pressure to continue these cuts, which would put these programs â\u0080\u0094 SNAP, SSI, SSDI and Social Security â\u0080\u0094 in jeopardy. Another aspect, despite his promises not to touch Social Security, he has been talking more about cutting payroll tax, which is what keeps the program sound. As it stands, in 15 years from now there wonâ\u0080\u0099t be enough to pay everybody. That date moves up even further with the payroll tax cuts. This interview was edited for clarity and length."}]}