{"article": [{"url": "https://www.marketwatch.com/story/apple-stock-rockets-to-record-as-amazingly-strong-earnings-calm-pandemic-iphone-fears-2020-07-31", "published": 1596282680.0, "headline": "Apple stock rockets to record as â\u0080\u0098amazingly strongâ\u0080\u0099 earnings calm pandemic iPhone fears", "body": "As Apple Inc. heads toward the anticipated launch of its first 5G-enabled phone later this year, the company just gave a confident signal that its hardware is still very much in demand during a global pandemic. Apple shares AAPL, +1.74% Â powered to another record high Friday, with the stock crossing the $400 mark for the first time and eventually gaining 10.5% as analysts cheered the companyâ\u0080\u0099s â\u0080\u009camazingly strongâ\u0080\u009d earnings results. The smartphone giant easily weathered the pandemic in its June quarter, according to a Thursday announcement, delivering revenue of $59.7 billion that came in comfortably above estimates even from earlier this year, before analysts slashed their forecasts to account for closed stores, weaker budgets, and other impacts from COVID-19. See more: Apple beats on earnings and announces stock split, sending shares toward record high â\u0080\u009cAppleâ\u0080\u0099s results were amazingly strong and when one considers the COVID-19 pandemic itâ\u0080\u0099s even more impressive,â\u0080\u009d wrote Citi analyst Jim Suva, who reiterated a buy rating on the stock and boosted his price target to $450 from $400. Piper Sandler analyst Harsh Kumar took a similar view. â\u0080\u009cOverall, the pandemic seems to be having a limited impact on Apple,â\u0080\u009d he said in a note to clients. â\u0080\u009cIn fact, one can make the case that the Mac and iPad are actually benefiting nicely due to the work from home and distance learning trends.â\u0080\u009d Mac revenue rose to $7.1 billion from $5.8 billion, while iPad revenue increased to $6.6 billion from $5 billion. Kumar keyed in on the companyâ\u0080\u0099s expectation for a strong back-to-school season this year and upped his price target to $450 from $310 while maintaining an overweight rating on the stock. RBC Capital Markets analyst Robert Muller wrote that the iPhone SE helped Apple drive a new high for its installed base, contributing to smartphone trends that make him â\u0080\u009ccontinue to gain confidence behind Appleâ\u0080\u0099s ability to drive recurring cash flows from its loyal customer base.â\u0080\u009d Muller is optimistic about smartphone trends over the next few quarters even as Apple confirmed that its next phone will be delayed by â\u0080\u009ca few weeksâ\u0080\u009d compared with last year, when it began selling its new models toward the end of September. That will push the next iPhone release into Appleâ\u0080\u0099s next fiscal year, which begins in October. â\u0080\u009cRecall that iPhone X, a highly anticipated form factor upgrade, was released in early November and drove a still-record quarterly iPhone revenue result,â\u0080\u009d he wrote. â\u0080\u009cDespite anticipation of a 5G upgrade, Apple expects recent iPhone performance (which topped expectations) will continue through next quarter.â\u0080\u009d He rates the stock at outperform while raising his price target to $445 from $390. Read: Pandemic? Antitrust? No worries for Big Tech, which racked up $200 billion in sales anyway J.P. Morganâ\u0080\u0099s Samik Chatterjee wrote that Apple â\u0080\u009csurprised even bullish expectations heading into F3Q/C2Q earnings by hardly missing a beat,â\u0080\u009d and he was upbeat about managementâ\u0080\u0099s tone in looking at the current quarter. â\u0080\u009cAll in all, Appleâ\u0080\u0099s ability as a company in a consumer discretionary product segment to completely buck sequential slowdown in F3Q/C2Q despite the massive disruption speaks volumes to the utility associated by consumers to the products as well as the momentum of a product cycle, which is leading them to be willing to circumvent the traditional practice of buying from the physical channel when required, and leads us to be more optimistic relative to the upcoming 5G product cycle,â\u0080\u009d wrote Chatterjee, who has an overweight rating on the stock and who bumped his price target up to $460 from $425. Chatterjee said that Apple also has an â\u0080\u009cunderappreciated enterprise opportunityâ\u0080\u009d as more people use Macs and iPads for remote work. â\u0080\u009cWhile the strength in the quarter was expected, led by managementâ\u0080\u0099s guidance on the last earnings call, the guidance for unit growth trends to sustain into F4Q are likely to surprise investors given that most were likely expecting it to be a one-time tailwind for these products,â\u0080\u009d he wrote. Canaccord Genuityâ\u0080\u0099s T. Michael Walkley also was encouraged that the company expects double-digit growth for all hardware categories except the iPhone in the September quarter, and he praised the â\u0080\u009cblowoutâ\u0080\u009d results for the June period while boosting his price target to $460 from $440 and keeping a buy rating on the stock. See also: U.S. economy plunges at titanic 32.9% rate in second quarter and points to drawn-out recovery At least 19 analysts raised their price targets on Appleâ\u0080\u0099s stock following the report, according to FactSet, and the new average target stands at $397.65. Of the 38 analysts tracked by FactSet who cover Appleâ\u0080\u0099s stock, 26 rate it a buy, eight rate it a hold, and four rate it a sell. Apple plans to do a four-for-one split of its stock, which will impact shareholders of record as of Aug. 24. The stock will start trading on a split-adjusted basis on Aug. 31, a move Citiâ\u0080\u0099s Suva said â\u0080\u009cis important for retail investors.â\u0080\u009d Apple said that the stock split is intended to make the stock â\u0080\u009dmore accessible to a broader base of investors.â\u0080\u009d Shares are up 39% over the past three months as the Dow Jones Industrial Average DJIA, +0.56% Â has risen 8%."}]}