{"article": [{"url": "https://www.marketwatch.com/story/amazon-bucks-the-trend-hiring-thousands-of-workers-as-online-shopping-from-locked-down-brits-booms-11599130685", "published": 1599116780.0, "headline": "Amazon bucks the trend, hiring thousands of workers, as online shopping from locked-down Brits booms", "body": "Amazon is among the small group of companies that have profited hugely from the coronavirus pandemic. Daniel Leal-Olivas/Agence France-Presse/Getty Images Tech giant Amazon is adding 7,000 permanent jobs to its U.K. workforce by the end of 2020 in a boost to its hiring spree for the year. The e-commerce firm has already added 3,000 permanent jobs in the U.K. this year alongside thousands of temporary roles. In addition to these permanent jobs, Amazon plans to hire an additional 20,000 seasonal workers before the winter holiday rush. This comes as firms around the world are laying off workers in the wake of the coronavirus crisis. With millions of people still stuck at home due to the coronavirus, e-commerce companies are doubling down on a surge in demand for online shopping. Amazon, along with online grocer Ocado OCDO, -3.17% and car firms Tesla TSLA, +1.89% have also been a boom in growth In the U.K. Amazon is in a cutthroat competition to meet that demand, especially in the grocery space, where it is competing head-to-head with Ocado and Tesco TSCO, +1.80%. Read: Marks & Spencer Latest Retailer To Cut Jobs As In-Store Sales Slump Amazon AMZN, +3.01% also plans to hire 20,000 seasonal workers ahead of the winter holiday rush. The additional jobs bring Amazon’s total British workforce to more than 40,000 and are centered on three new high-tech fulfillment centres that will absorb more than 1,000 new employees each. British Business Secretary Alok Sharma called the move “a clear vote of confidence in the UK economy” as the country grapples with the economic effects of the coronavirus. Read: Is 30 too old to work in media? This advertising boss has been forced to apologize after ageism row Amazon is among the small group of companies that have profited hugely during the coronavirus pandemic. Millions of people stuck at home have turned to online shopping for necessities and distractions alike, boosting the Seattle-based tech giant’s sales in the second quarter of 2020 by 40% compared with last year and doubling its profit in the same period. Amazon’s share price has risen over 90% since the beginning of the year, making its founder and CEO Jeff Bezos the richest person in the world."}]}