{"article": [{"url": "https://www.marketwatch.com/story/intel-admits-another-defeat-with-unprecedented-manufacturing-issues-2020-07-23", "published": 1595679980.0, "headline": "Intel admits another defeat with  unprecedented manufacturing issues", "body": "An old saying in the semiconductor industry, attributed to Advanced Micro Devices Inc. co-founder Jerry Sanders, was “real men have fabs.” That saying — along with its dated, sexist phrasing — is now officially no longer true, as semiconductor giant Intel Corp. INTC, -1.03% admitted Thursday that it could actually partner with another semiconductor foundry to help with its next-generation manufacturing technology, as it announced a delay in its next process technology for future chips. That was a huge admission of defeat for one of Silicon Valley’s most iconic companies. Intel is one of the last remaining semiconductor companies that still uses its own fabrication plants (also called fabs) to manufacture most of its chips. These plants now cost many billions of dollars as they develop increasingly microscopic transistors aimed at increasing computer processing speeds. Intel currently farms out a small percentage, around 20%, of chips or chipsets to other contractors, but manufactures the bulk of its processors in its own factories around the world. On Thursday, Intel’s huge earnings beat was overshadowed by the news of a delay in its next-generation manufacturing process that would move the chip maker to a 7-nanometer process. The news was an echo of many delays and problems with moving to the 10-nanometer process a couple of years ago, now finally in use for the company’s chips for PCs and servers. See also: An obscure court ruling could play havoc with tech companies’ earnings “We will continue to invest in our future process technology roadmap, but we will be pragmatic and objective in deploying the process technology that delivers the most predictability and performance for our customers, whether that be on our process, external foundry process, or a combination of both,” Intel Chief Executive Robert Swan told analysts on the company’s conference call. This is the second time in the past two years that the company has had issues advancing its world-class manufacturing to the next level, while its rival Advanced Micro Devices Inc. AMD, -3.94% was first to market selling chips developed by its foundry partner using a 7-nanometer manufacturing process two years ago. Intel still leads U.S. semiconductor companies in revenue and market share in the sale of chips, but investors are looking at both AMD and Nvidia Corp. NVDA, -0.54% as the momentum leaders. On Wednesday, AMD’s share price shot past Intel’s for the first time ever, and Nvidia’s market cap of $257 billion was close to Intel’s $258 billion on Thursday. Those positions are headed for a more drastic flip on Friday, as Intel shares fell 10% in after-hours trading, while AMD stock shot more than 7% higher. A fall of that magnitude would cost Intel more than $25 billion in market cap. Nearly every question on the call was about the company’s delay of 7-nanometer process, and Intel executives highlighted the contingency plan of working with another foundry not as a sign of weakness, but as a sign of strength. “That gives us much more flexibility to make the decisions, where it’s the most effective way to build our products to deliver that annual cadence of leadership for our customers, and we feel pretty good about where we are, though we’re not happy,” Swan said. “I’m not pleased with our 7-nanometer process performance, but as we sit here today, six months through the year, our people are safe.” More from Therese: IBM outlook remains cloudy at best as new CEO fails to plot the way forward Intel has always been very aggressive in how it seeks to ramp up its next-generation process technology, which ultimately dictates how many transistors can fit on a single wafer. The smaller the process node, the more transistors, and therefore more processing power. But as semiconductors get increasingly miniscule, companies are hitting up against the laws of physics to make them; one single strand of human hair is approximately 80,000 to 100,000 nanometers wide. “For a long time we just relied on process shrinks to make everything faster, more powerful,” said Kevin Krewell, principal analyst with Tirias Research. “But now packaging and architecture design are more critical to advancing the industry, not just process nodes.” Moore’s Law, the guiding dictum of the chip industry created by Intel co-founder Gordon Moore, observed that the number of transistors approximately doubled on a chip about every two years, increasing the power of computers. But this observation has been increasingly difficult to continue in the past few years, as it becomes more and more difficult to add more and more transistors. “This puts some glitches into it,” Krewell said when asked if Moore’s Law is dead. Read: This Wall Street analyst turned his Twitter feed into ‘Sell-Side Stories with Stacy’ When it lagged behind on its 10-nanometer process, Intel was able to tweak its chips via architecture changes at the software level and other changes to stay competitive with AMD and Nvidia, Krewell said. The company can do that again with the current process technology, but this time, the company has a deadline to develop a 7-nanometer part for the Aurora supercomputer currently under construction. Intel has a graphic processor, code-named Ponte Vecchio, due in 2021, that will compete with Nvidia’s Tesla chip. Swan told analysts that it has always planned to have some components for Ponte Vecchio made outside. “A delay on 7-nanometer would hurt that product,” Krewell said. “They need to get Ponte Vecchio up and running in time.” Even if Intel manages to catch up to that deadline, one thing is certain right now: The perception of Intel as a great semiconductor manufacturer may now be at its end."}]}