{"article": [{"url": "https://www.marketwatch.com/story/thousands-sign-petition-calling-on-disneyland-to-delay-july-reopening-following-coronavirus-shutdown-many-people-have-lost-loved-ones-2020-06-11", "published": 1592205500.0, "headline": "'Disneyland reopening schedule looks like the unsafest thing ever': Thousands sign petition asking to delay July opening", "body": "Disneyland DIS, +1.53%  is aiming to reopen next month. But thousands of people are asking the company to reconsider when people can resume visiting. Disney announced Wednesday that it set a goal to reopen the Disneyland and Disney California Adventure theme parks on July 17, with significant operational changes. The theme parks, which are located in Southern California, have been closed to the public since March 14 as a result of the coronavirus pandemic. The company also announced that the Downtown Disney shopping area located adjacent to the theme parks would reopen on July 9, while some of the resort's hotels would reopen on July 23. The plans are subject to state and local government approval. The capacity of the theme parks will be significantly limited in adherence with government requirements to allow for physical distancing, Disneyland officials said. Guests, including annual passholders, will be required to make a reservation in advance through a new system to visit the theme parks. Following Disney's announcement, a Change.org petition was created calling on the company to reopen Disneyland at a later date. \"Many people have lost loved ones due to this pandemic and by reopening the parks they are endangering cast members and guests to be exposed to COVID-19,\" the petition reads in part. The petition also notes concerns about the potential for a second wave of the coronavirus that causes COVID-19. Also see:Walt Disney World cancels dining reservations and stops taking new hotel bookings ahead of planned July reopening Since the petition was created, it has gathered nearly 9,000 signatures. Many also took to Twitter TWTR, -0.23%  to raise concerns about the threats posed by reopening Disneyland next month. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Gossip blogger Perez Hilton even commented on the reopening plans, saying there should have been more concern voiced when Six Flags said it would resume reopening its parks. iframe.twitter-tweet { width: 100% !important; } But theme park experts said that Disney is unlikely to be swayed by the grassroots effort to postpone the parks' reopening. \"The petition is not likely to have much effect one way or the other,\" said Don Munsil, co-owner of travel website MouseSavers.com. \"Disney regularly uses extensive market research to see how people feel about any planned action, so they're more likely to check people's feelings about reopening that way.\" Munsil added that Disney sent him and other regular Disney guests a survey about their plans and feelings about returning to the parks. Additionally, Disney is more likely to respond to health data as it gauges its reopening. \"The thing that would cause Disney to pause the reopening is if the number of new cases escalates dramatically in the next few week,\" said Len Testa, president of travel website Touring Plans. Disneyland is already set to open later than many other theme parks. The parks at the Universal Studio Orlando CMCSA, -0.99%  resort reopened last week, while SeaWorld SEAS, +3.04%  resumed operations at its Orlando theme park on Thursday. Six Flags SIX, -0.32%  has resumed hiring at many of its regional theme parks across the country in anticipation of reopening. As for Disney's other parks around the world, Shanghai Disneyland reopened back in May, as did the Disney Springs shopping complex at Walt Disney World resort in Florida. The four theme parks at Walt Disney World are set to start welcoming visitors in early July. A reopening date has yet to be set for Disneyland Paris. Prior to reopening its theme parks, Disney has instituted a range of temporary new policies and procedures to keep guests and workers healthy. These include temperature screenings prior to entering the parks, the required use of face masks and the elimination of experiences like parades and meet-and-greets where guests interact closely with Disney characters. Disneyland officials said more information on enhanced health and safety measures and operational changes for reopening locations will be shared soon."}]}