{"article": [{"url": "https://www.marketwatch.com/story/america-just-really-needs-to-start-being-honest-with-itself-how-money-and-the-slave-trade-shaped-policing-in-the-us-2020-06-19", "published": 1592640080.0, "headline": "A Juneteenth wake-up call â\u0080\u0094 how the slave trade shaped U.S. policing: â\u0080\u0098America just really needs to start being honestâ\u0080\u0099", "body": "Over the past few weeks, the nation has been grappling with the history of systemic racism in our police system. But fewer may realize how far back this tradition goes. To better understand this history, MarketWatch spoke with Luke Frederick, a doctoral candidate at Georgetown University who is studying the relationship between the slave trade, policing and incarceration during 17th and 18th century America. MarketWatch: What role did money and finance play in the period and topics you study? Luke Frederick: First off, itâ\u0080\u0099s important to recognize that the slaves themselves were a commodity and the most valuable sector of commodities â\u0080\u0094 to use that inhumane phrase â\u0080\u0094 in the country and that was the case up through the Civil War. The control, the movement, the coercion of these enslaved people was the economic engine of the country, which then spun off all of these other industries, whether they be banking, whether they be slave owners or slave traders reinvesting their money into what we would recognize as the industrial revolution. “ â\u0080\u0098Slavery is the economy. Not everyone owned slaves themselves, but everyone was trying to get a piece of this money.â\u0080\u0099 ” â\u0080\u0094 Luke Frederick, Ph.D candidate at Georgetown University The North and the Midwest are also dependent on this slave economy. Theyâ\u0080\u0099re selling their foodstuffs to the south, banking and insurance industries are heavily tied in with slave mortgages and slave insurance. Itâ\u0080\u0099s really the labor and the value in these enslaved bodies ... that the main financial instruments were running through. Slavery is the economy. Not everyone owned slaves themselves, but everyone was trying to get a piece of this money, you can think about it maybe like this tech space weâ\u0080\u0099re in today. You may not create your own app, but maybe you are working on the servers or youâ\u0080\u0099re making the website for someone else. Itâ\u0080\u0099s just like today in that whether you were a private businessman, whether you were a farmer, whether you were a bar owner, everyone is trying to get a slice of these slave profits. Luke Frederick is a Ph.D candidate at Georgetown University. Courtesy of Luke Frederick MW: What role did cities and local governments play in trying to access these profits? Frederick: For example, in D.C., the slave traders had to pay for licenses to operate in the city. If you wanted to operate a private slave jail, you would have to pay that fee also. That was a revenue enhancement mechanism. MW: What is a private slave jail? Frederick: The private jails are really operating for the domestic slave trade. There was a surplus of slaves in Virginia, North Carolina [and other upper Southern states]. Tobacco is going by the wayside and being replaced with wheat, which requires less labor. At the same time, you have cotton starting to boom in the deep South. “ The city jails were competing with private jails for room and board so slave traders to lock up slaves as they traveled south. ” These slave traders are using the upper South as their supply point and then bringing [slaves] down south. These jails are opening up in cities in between â\u0080\u0094 theyâ\u0080\u0099re in Baltimore, D.C. Norfolk, Richmond. Itâ\u0080\u0099s about a two-month journey to walk from D.C. to New Orleans or Natchez, Mississippi. As [slave traders] would go overnight, if they were in a city and they could afford it, they would lock these slaves up in these private jails. Theyâ\u0080\u0099re charging a basic room and board fee. The city jails are competing with these private jails for that room and board fee. MW: What did police forces look like during the period you studied? What role did money play in those police systems? Frederick: What weâ\u0080\u0099re really seeing are the deepest darkest fears of the founding fathers in terms of policing. When they were thinking about how to separate themselves from Britain after the revolution, the three main [aspects] of criminal justice that they wanted to get away from were: Capital punishments for every crime, they didnâ\u0080\u0099t want a standing army and they didnâ\u0080\u0099t want a national police force. “ â\u0080\u0098The number one thing that they need the police for is to guard against slaves and Native Americans.â\u0080\u0099 ” â\u0080\u0094 Luke Frederick, Ph.D candidate at Georgetown University If youâ\u0080\u0099re not going to have a national police force that means youâ\u0080\u0099re going to have local police. Then the question comes down to who is going to pay for it? The answer was no one is going to pay for it. [During the antebellum period], they go to patrols. Itâ\u0080\u0099s very transactional, itâ\u0080\u0099s not salaried, every single service that a police man would do has a fee attached to it. You have a whole section of the legal code that is etched out for black people, both slave and free. That seems to draw the attention of police forces. There are policing traditions in England, itâ\u0080\u0099s not like everything was cut from whole cloth in America, but the big problem was slavery. Once race and slavery gets interjected into this policing tradition it develops in a totally different form in the Americas then. The number one thing that they need the police for is to guard against slaves and Native Americans. Thatâ\u0080\u0099s why they come up with black codes. MW: How did that system contribute to what we see today? Frederick: It criminalizes blackness. From the very earliest moments, black people are seen as suspicious, as dangerous, as subversive. The law is saying that these are not citizens, they are non-persons, so any of this English legal heritage about freedom and trial by jury and due process donâ\u0080\u0099t apply. Once America comes up with its founding documents, these documents also donâ\u0080\u0099t apply. On the one hand, theyâ\u0080\u0099re criminalized by the system but, on the other hand, theyâ\u0080\u0099re not recognized by the system. “ â\u0080\u0098From the very earliest moments, black people are seen as suspicious, as dangerous, as subversive.â\u0080\u0099 ” When we think of a runaway slave, we think about them running through a field and thereâ\u0080\u0099s a slave posse after them and itâ\u0080\u0099s the vigilante guys. Quite often, it was a police officer thatâ\u0080\u0099s tracking down these runaway slaves, that was part of their job. If you look at a runaway-slave ad, most of them will say: â\u0080\u009cBilly ran away, hereâ\u0080\u0099s a description, hereâ\u0080\u0099s the clothes that they stole. If you find him Iâ\u0080\u0099ll give you a $50 reward. If you find him, take him to Frederick county jail and Iâ\u0080\u0099ll pick them up there. This is a huge money maker for [police], they would get half of the private reward money, at least in Washington. The police also served as a disciplinary mechanism. Letâ\u0080\u0099s you were too squeamish to whip your own slaves or you didnâ\u0080\u0099t want to have that tension, you could take him to the police [and pay him 50 cents to do it]. The policeman just pockets that 50 cents, thatâ\u0080\u0099s straight commission. The hinge in all of this is this man named Isaac Franklin, who was a slave trader in Washington, D.C. and in Alexandria, Va. Once he retired, he bought a plantation in Louisiana and that plantation was named Angola. Today it exists as Angola prison in Louisiana. That guy right there is really this sort of middle point in this system of the 1820s, and what we had in the 1920s and what we have in 2020. MW: How does this history relate to todayâ\u0080\u0099s calls to defund the police? Frederick: It really shows the triumph of policing. In the beginning no one wanted to pay for this. No one wanted to pay the salaries, buy the equipment, buy the horse, build the jail. Today they have no problem getting money. The other thing is they had to really struggle with this idea of: We just fought this war based on liberty and weâ\u0080\u0099re doing away with social and economic hierarchies [and] now we say if you break a law were going to take away your liberty and put you in jail. Thatâ\u0080\u0099s no longer a conundrum for anyone. The other thing about these police in the 19th Century â\u0080\u0094 they did all types of stuff that we wouldnâ\u0080\u0099t think of as policing today. They were out shooting stray dogs and cleaning up dead horses and doing a lot of things that you wouldnâ\u0080\u0099t really think police need to do. In the early 20th Century, all of these other public departments come online and they start to take these responsibilities away from police. Weâ\u0080\u0099re on the opposite end of that, all of these things have been slashed, thereâ\u0080\u0099s no other type of agency out there to deal with these issues so it all falls on the police. Iâ\u0080\u0099m anti-police in how they exist today, but I will be the first to recognize that they have way too much to do. MW: What can we do to deal with this legacy? Frederick: America just really needs to start being honest with itself about where things come from and its history and whatâ\u0080\u0099s really going on. Wide swaths of America have been able to live for generations believing in things that are just flat out myths or taken out of context or not historically accurate. You have a large segment of America that has existed in this country, almost with a fantasy. (This conversation was edited and condensed for style and space.)"}]}