{"article": [{"url": "https://www.marketwatch.com/story/what-we-do-know-and-dont-know-about-the-coronavirus-at-day-100-of-the-pandemic-2020-06-18", "published": 1592489060.0, "headline": "What we do know â\u0080\u0094 and donâ\u0080\u0099t know â\u0080\u0094 about the coronavirus at day 100 of the pandemic", "body": "Scientists and infectious-disease experts are pushing hard to understand more about the novel coronavirus that causes COVID-19 and how to treat patients suffering from the sometimes deadly illness and prevent transmission. In the roughly three months since the World Health Organization (WHO) declared regional COVID-19 outbreaks a worldwide pandemic and hundreds of millions of Americans began to observe stay-at-home orders, much has changed. As of June 18, more than two million people in the U.S. have tested positive for COVID-19, and at least 117,000 have died, according to data aggregated by Johns Hopkins University. We have a standard of care for hospitalized patients, though that is sure to evolve. We know that masks and physical distancing prevent transmission of the virus, though both practices have become politicized and arenâ\u0080\u0099t always observed in Western countries where mask-wearing hasnâ\u0080\u0099t been part of the culture. We know that investors overreact to mildly positive clinical news about COVID-19 treatments and vaccines and tend to ignore the bad news. â\u0080\u009cThe most important thing weâ\u0080\u0099ve learned is that in the absence of a vaccine or therapeutic, aggressive public health action and individual public health practices can reduce transmission,â\u0080\u009d Dr. Brian Castrucci, an epidemiologist and president and CEO of the de Beaumont Foundation, said in an email. â\u0080\u009cMask-wearing, social distancing, and hand-washing are critical to mitigating the spread of the virus, reopening portions of the economy, and allowing us to return to some semblance of normalcy.â\u0080\u009d Hereâ\u0080\u0099s what we know so far about COVID-19 treatments: â\u0080¢ Once-promising drugs have failed. Hydroxychloroquine, once lauded by President Donald Trump as a â\u0080\u009cvery successful drug,â\u0080\u009d doesnâ\u0080\u0099t reduce mortality in hospitalized COVID-19 patients, according to studies conducted by Veterans Health Administration and the University of Minnesota, among others. Many clinical trials including the WHOâ\u0080\u0099s Solidarity trial have stopped enrolling participants in their hydroxychloroquine trials, and the Food and Drug Administration (FDA) last week revoked the emergency use authorization for hydroxychloroquine and chloroquine. â\u0080¢ Gilead Sciences Inc.â\u0080\u0099s GILD, +0.82% Â remdesivir works; however, itâ\u0080\u0099s no silver bullet. While the experimental drug hasnâ\u0080\u0099t been proven to reduce deaths among severely ill patients, research found it can reduce the amount of time patients spend in the hospital, which in turn can help reduce capacity at overcrowded intensive care units in regions with severe outbreaks and allow patients to go home sooner. â\u0080¢ At least one drug can reduce death in severely ill patients, a finding announced this week on the heels of the FDAâ\u0080\u0099s hydroxychloroquine decision. University of Oxford researchers said a clinical trial found that dexamethasone, a commonly prescribed steroid, can reduce mortality among hospitalized patients on ventilators and oxygen support. â\u0080¢ The growing clinical evidence behind remdesivir and dexamethasone matters for two reasons: having a widening range of viable treatments can reduce the number of deaths from COVID-19, reducing capacity in emergency rooms and intensive care units and can also create a safer environment for economies to reopen, according to Dr. Roger Shapiro, associate professor of immunology and infectious diseases at the Harvard T.H. Chan School of Public Health. â\u0080\u009cItâ\u0080\u0099s a lot better to be a patient today than in March,â\u0080\u009d he said. Hereâ\u0080\u0099s what we know so far about how the virus behaves: â\u0080¢ The virus is more likely to spread by the droplets or aerosols we release when we speak, yell, or sing than on the shared surfaces we touch. Transmitting the disease becomes even more of a concern in enclosed indoor spaces than outdoors, especially in the presence of a super spreader. (â\u0080\u009cEverything we do outside is a lot safer,â\u0080\u009d Shapiro said.) â\u0080¢ COVID-19 has disproportionately sickened and killed certain groups of people, including people of color, men, the elderly, and those living in contained, crowded environments, like nursing homes and prisons. It is less likely to make children ill. More than one-third of the people who have died in the U.S. from COVID-19 lived in long-term care facilities. â\u0080\u009cCOVID-19 has exposed the weakness of infection control programs in many of our nationâ\u0080\u0099s long-term care and assisted living facilities,â\u0080\u009d said Ann Marie Pettis, a registered nurse and president-elect of the Association for Professionals in Infection Control and Epidemiology. â\u0080¢ The U.S. has primarily focused on providing diagnostic testing to people who present with common COVID-19 symptoms but there are concerns about asymptomatic and presymptomaticindividuals, who may be inadvertently continuing to spread the disease. Experts want to see more random testing of the population. â\u0080\u009cPeople without symptoms can transmit the virus, making containment very challenging,â\u0080\u009d Dr. Leana Wen, an emergency physician and public health professor at George Washington University, wrote in an email. â\u0080¢ Wearing a mask or engaging in social distancing behaviors can prevent transmission of the virus. One reason why there may be fewer cases in China, Japan, and South Korea is that mask-wearing is more common in Asia. China, where the virus first emerged late last year, has about 84,000 cases, Japan has roughly 17,000 cases, and South Korea about 12,000 cases. â\u0080\u009cWhat we do know is that social distancing, hand washing and wearing a face mask in public are the ways people can help protect themselves and others,â\u0080\u009d Pettis said. Hereâ\u0080\u0099s what we donâ\u0080\u0099t know: â\u0080¢ Does having antibodies provide immunity for the people who have been exposed to or recovered from COVID-19? With other viruses, antibodies usually indicate a level of protection against re-infection with the same virus for a set period of time. People who had SARS, for example, had antibodies for about two years and werenâ\u0080\u0099t thought to be susceptible to reinfection until three years after the first exposure to the severe acute respiratory syndrome. â\u0080\u009cHow long does immunity last, and do you need a certain level of antibodies to be immune?â\u0080\u009d Wen asked. â\u0080¢ Will herd immunity kick in?And if it does, when? Some experts predict that about two-thirds of Americans would need to have antibodies to declare herd immunity in the U.S. But without practicing physical distancing, using masks, and developing a contract tracing system, â\u0080\u009citâ\u0080\u0099s impossible to flatten the curve,â\u0080\u009d said Dr. Bob Kocher, a partner at venture-capital firm Venrock and a member of Californiaâ\u0080\u0099s coronavirus testing task force. â\u0080\u009cThe question is whether we have the desire and discipline to do that.â\u0080\u009d â\u0080¢ Will there be a viable vaccine? Vaccine development is moving at a record pace, with 13 vaccine candidates now in clinical trials worldwide. Moderna Inc. MRNA, +0.09% Â was the first company to release some clinical data from a Phase 1 study, finding that eight out of 45 participants in the first phase of its COVID-19 vaccine study developed neutralizing antibodies. However, vaccine development is notoriously difficult and time intensive â\u0080\u0094 vaccines traditionally take up to seven years to be developed â\u0080\u0094 and have to be both safe and efficacious."}]}