{"article": [{"url": "https://www.marketwatch.com/story/restaurants-and-retailers-have-regained-the-most-jobs-since-the-coronavirus-crisis-but-theres-a-catch-2020-08-07", "published": 1596815120.0, "headline": "The U.S. has only regained 42% of the 22 million jobs lost in the pandemic. Hereâ\u0080\u0099s where they are", "body": "Retailers and restaurants suffered massive job losses at the onset of the coronavirus pandemic earlier this year, and not surprisingly they have brought the most workers back in the early stages of the U.S. recovery. Yet less than half of the people who were laid off or furloughed have returned to their jobs. The economy shed a record 22.2 million jobs in March and April after large swaths of the U.S. were shut down to curb the spread of Covid-19, according the Labor Departmentâ\u0080\u0099s survey of business establishments. The survey is considered the most accurate measure of U.S. employment. Yet even after another sizable increase in employment in July, the U.S. has only recouped 9.3 million jobs so far. Thatâ\u0080\u0099s just 42% of the jobs lost. Read:Consumers hold the key to an economic recovery and right now theyâ\u0080\u0099re very anxious On Friday, the government said U.S. employment rose by 1.8 million in July, a touch above Wall Streetâ\u0080\u0099s DJIA, +0.56% Â expectations. The increase marked a sharp slowdown, however, from gains of 4.79 million in June and 2.73 million in May. Read:U.S. adds 1.76 million jobs in July as hiring slows after fresh coronavirus outbreak Also: Hereâ\u0080\u0099s â\u0080\u0098the real surpriseâ\u0080\u0099 in the July jobs report â\u0080\u0094 economists react Restaurants temporarily eliminated a whopping 6.1 million jobs in the first two months of the pandemic. Since then theyâ\u0080\u0099ve rehired 3.44 million people. Retailers, for their part, slashed employment by 2.38 million in March and April. Theyâ\u0080\u0099ve now brought back 1.47 million workers, retracing 62% of the jobs lost early on. One big caveat: Many retailers and restaurants were paid by the federal government to keep employees on the payroll even if they werenâ\u0080\u0099t working. Itâ\u0080\u0099s unclear how many of the jobs restored reflect employees being paid but not working under the Pandemic Protection Program passed by Congress. In a worst-case scenario, many of those employees could also be cut loose for good if Congress doesnâ\u0080\u0099t extend the emergency-loan program or businesses decide not enough customers will return. The latest coronavirus outbreak spurred some states to bar indoor dining, restrict the number of customers in stores or delay reopening plans â\u0080\u0094 actions to which retailers and restaurants are especially vulnerable. Read: Economy suffers titanic 32.9% plunge in 2nd quarter, points to drawn-out recovery Also:â\u0080\u0098A massive welfare economyâ\u0080\u0099 - federal aid prevents even steeper GDP collapse Other industries that have made big progress on restoring jobs include construction, health care and manufacturing. The laggards? Hotels, government and certain business and professional jobs, mainly administrative and back-office work."}]}