{"article": [{"url": "https://www.marketwatch.com/story/why-chinas-yuan-just-hit-a-17-month-high-versus-the-u-s-dollar-11602274052", "published": 1602260120.0, "headline": "Why China's yuan just hit a 17-month high versus the U.S. dollar", "body": "Agence France-Presse/Getty Images China's yuan played a little catch-up on Friday, with the onshore rate soaring to a 17-month high versus the U.S. dollar after a weeklong holiday - a move that analysts said reflected a positive Chinese economic backdrop. The underlying strength might also reflect, in part, expectations that Democratic challenger Joe Biden's growing lead in the polls over President Donald Trump will result in a victory for the former vice president on Nov. 3, and improved relations with China, analysts said. The U.S. dollar fetched 6.6947 yuan USDCNY, on Friday, the strongest showing for the Chinese currency since April 2019 and marked a 1.4% strengthening, according to FactSet. That's the strongest one-day rise since the yuan was de-pegged from the dollar in July 2005, Reuters reported. The yuan was guided higher by the People's Bank of China, which sets a daily fixing, and reflected a catch-up with a strong rise by the yuan in offshore dealings USDCNH, -0.71% during the holiday, analysts noted. The offshore yuan, meanwhile, continued to strengthen, trading Friday at 6.6871 per dollar. Biden's widening lead has been credited with lifting equities SPX, +0.87% DJIA, +0.56% and other financial assets because it lessens the prospect of a contested election outcome on Nov. 3, a prospect that has unnerved investors fearing weeks of legal and political wrangling. The president trails Biden by an average of 9.7 percentage points nationally according to the Real Clear Politics average of polling. The idea that a Biden administration would be less likely to use import tariffs in disputes with China was widely cited as a factor in the yuan's jump. But Alan Ruskin, macro strategist at Deutsche Bank, argued earlier this week that a Biden presidency would likely be a positive for most emerging market currencies, other than those that are major oil producers. He wrote: If Biden and a 'blue wave' are at worst only regarded as marginally equity negative, then from a global perspective, Biden is actually the more risk positive candidate given his international credentials for multilateralism. the reignition of foreign policy predictability, and not least a far less disruptive trade policy. In addition, to the extent the Biden is less positive for oil supply (Trump helped bring the Russia-Saudi OPEC+ deal together) and oil demand (as greener policies are pursued), this is likely to prove global growth positive except for the big oil exporters. If Biden, under a blue wave, is also associated with larger twin deficits that weakens the USD and helps global growth, it is easy to see how Biden becomes a significant boon for EM FX ex the oil producers. There are other factors at play, analysts said, that help explain the yuan's strength and the PBOC's tolerance for its appreciation. Analysts at RBC Capital Markets noted that with China's economic recovery from the coronavirus pandemic strengthening, Beijing has become more focused on supporting domestic growth drivers. \"CNY has been buoyed by the combination of implicit monetary tightening and strong credit growth, contributed in part by loose fiscal policy,\" they wrote. \"The yuan was the top performing Asian currency in Q3, and further gains are expected in coming months as growth strengthens. \""}]}