{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-gain-altitude-for-a-third-session-as-investors-await-retail-sales-and-fed-update-2020-09-16", "published": 1600277060.0, "headline": "Stocks end mostly lower after Fed holds interest rates steady near zero, but underscores risks to economic recovery", "body": "U.S. benchmark stock indexes closed mostly lower Wednesday, after the Federal Reserve said it would likely hold interest rates near zero until at least 2023 given the outlook for inflation and employment in the wake of the coronavirus pandemic, but also indicated risks to the economy remain. Initially, good earnings from the likes of FedEx provided some support, as did talk of coronavirus vaccine distribution plans by the White House, and upbeat sentiment about the latest batch of IPOs, including the cloud software company, Snowflake. How did equity benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% added 36.78 points, or 0.1%, to finish at 28,032.38, while the S&P 500 index SPX, +0.87% shed 15.71 points, or 0.5%, closing at 3,385.49. The Nasdaq Composite COMP, +1.39% index fell 139.85 points, or 1.3%, after flipping between positive and negative territory in the session. The Russell 2000 Index RUT, +0.55% of small-capitalization companies, rose 14.18 points, or 0.9%, to close at 1,552.33. On Tuesday, the Dow rose 2.27 points to finish at 27,995.60, while the S&P 500 gained 17.66 points, or 0.5%, to trade at 3,401.20, marking its third straight increase. The Nasdaq finished up 133.67 points, or 1.2%, at 11,190.32, logging back-to-back gains.What drove the market? Stocks gave up earlier gains to close mostly lower Wednesday, after the Fed indicated it will keep rates near zero through at least 2023, but also warned of risks to the economy without additional fiscal stimulus during the coronavirus pandemic. The Dow initially climbed 300 points in afternoon trade, after the Fed’s rate-setting committee indicated that future rate hikes will hinge on at least two things: labor market conditions return to the “maximum employment” and inflation has risen to 2% and “is on track to moderately exceed 2% for some time. But those gains faded after Fed Chair Powell reiterated that the economic downturn resulting from the pandemic is “the most severe in our lifetime,” in an afternoon news briefing. To that end, the central bank expects to keep up its “full range” of support up for some time, including its current $120 billion monthly pace of assets purchases in the form of government Treasurys and mortgage bonds until the economy is “far along in its recovery.” Kathy Jones, Charles Schwab’s chief fixed-income strategist, said it boils down to the Fed confirming, once again, that it’s committed to doing all it can to support the economy, but that it wants to see Congress do more to blunt the pandemic’s carnage. “I’ve never in my career heard so many Fed officials basically pleading for fiscal policy,” Jones told MarketWatch. “I think every time it comes up, and we realize it’s not happening yet, it weighs on the risk assets.” Further, the Fed’s outline for a future where interest rates likely stay at zero for at least the next three years “is not a positive signal for the economy,” Jones said. Powell said the economy likely risks ongoing unemployment stress, as well as an uptick in evictions and foreclosures, “things that will scar the economy,” without additional fiscal support from Congress, during his briefing. It was the first policy statement and updated economic forecasts under the Fed’s new flexible inflation target strategy announced last month. Here’s a recap: Fed decision day Investors have come to expect a prolonged period of support from the Fed, which has helped bolster the U.S. stock market since its lows during the coronavirus crisis in March, but many also have been waiting on Congress to pass a spending package. See: Why these strategists say at least $500 billion more is needed to fuel consumer spending during the pandemic In U.S. economic data, a reading on retail sales in August just missed the MarketWatch consensus forecast, rising 0.6% for the month. Sales topped pre-crisis levels during the month, but the rate of growth is slowing. “The consumer has performed well so far given the health and economic impact from Covid, but there is still a long way to go in the recovery story,” said James Knightley, ING’s chief international economist, in written commentary, underscoring obstacles such as high unemployment, slim chances of “meaningful fiscal stimulus in the next few months” and the “clear threat that a fractious election” that endanger consumer sentiment and spending. Findings from a Bankrate survey conducted in June found that 36% of Americans were putting off at least one major milestone — finding a new job, marriage, having a child, buying a home or retiring — because of the coronavirus pandemic. The OECD’s latest forecast for global growth published Wednesday shows the global recession may not be as bad as expected. The Paris-based organization said it now expects the world economy to shrink 4.5% this year, less than its June prediction for a 6% decline, reflecting a slowly improving U.S. labor market and China data. See: U.S. plans for free COVID-19 vaccine, but only half of Americans say they’d take itWhich stocks were in focus? Shares of Southwest Airlines Co. LUV, +1.89% rose 3.7% Wednesday, after the air carrier updated its financial guidance trends, including and upbeat outlook for load factor and reducing its third-quarter outlook for daily cash burn. Eventbrite Inc. EB, -0.09% shares gained 8.1% after the online ticketer said it saw 17% growth in paid tickets in August compared with July, and 26% growth in paid tickets to in-person events. But August’s paid-ticket volume is still 65% lower than a year ago. Unity Software Inc. on Wednesday raised the expected pricing of its initial public offering to $44 to $48 a share from $34 to $42 a share, putting it on pace to raise $1.2 billion. Facebook Inc. shares FB, +0.26% fell 3.3% after a report said that the Federal Trade Commission is preparing to file an antitrust lawsuit against the social-media giant. Shares of FedEx Corp. FDX, +0.18% closed 5.8% higher after the delivery and logistics company reported better-than-expected profit and sales for its fiscal 2021 first quarter, saying that its workers’ effort had kept “the world’s health care, industrial and at-home supply chains moving despite the challenges of the global pandemic.” DraftKings Inc. DKNG, -4.51% shares gained 5.9% after the company announced it would be the exclusive online betting platform for the New York Giants. Shares of Adobe Inc. ADBE, +2.30% ended 4.4% lower despite a price target increase, to $550, from JPMorgan. Boeing Inc. BA, -0.39% shares gained 2.4% even after a congressional committee released a report blasting the company for failing to take action that would have saved lives, despite knowing about flaws in the design of its 737 Max jets. Eastman Kodak Company KODK, +12.98% shares soared 36.6% Wednesday, after a special committee, hired by the digital imaging and printing systems company to investigate how it disclosed a U.S. government loan, found that no laws were broken. Snowflake Inc.’s stock SNOW, -0.91% debuted with a bang Tuesday, with the software company’s stock closing its first day of trade on the NYSE at $253.93, a 111.6% gain, according to FactSet data. How did other markets fare? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% rose less than 1 basis point to 0.686% after the Fed’s decision. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, gained 0.1% at 93.16. Gold futures GCZ20, +2.17% rose 0.2% to settle at $1,970.50 an ounce on the New York Mercantile Exchange. The U.S. crude oil benchmark CL.1, -1.62% finished 4.9% higher at $40.16 a barrel as investors continued to watch Hurricane Sally move toward the Gulf Coast. Global equities closed mixed, with the Stoxx Europe 600 index SXXP, +0.55% up 0.6%, and the U.K.’s benchmark FTSE 100 UKX, +0.64% down 0.4%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% closed fractionally lower and the Shanghai Composite SHCOMP, +1.67% lost 0.4%. Japan’s Nikkei NIK, -0.11% closed 0.1% higher. Mark DeCambre contributed reporting"}]}