{"article": [{"url": "https://www.marketwatch.com/story/how-a-big-decline-in-chinas-oil-imports-may-test-the-resiliency-of-the-market-2020-09-08", "published": 1599583340.0, "headline": "How a big decline in Chinaâ\u0080\u0099s oil imports may â\u0080\u0098test the resiliency of the marketâ\u0080\u0099", "body": "Oil futures have dropped to their lowest level in nearly three months, with Chinese demand contributing to the uncertainty over the outlook for energy consumption. â\u0080\u009cAn important piece of the current crude-market puzzle is Chinese demand,â\u0080\u009d said Rebecca Babin, managing director and senior energy trader at CIBC Private Wealth Management. â\u0080\u009cChina has been aggressively stockpiling crude over the past couple of months with record imports of 13 million barrels,â\u0080\u009d she said. Chinaâ\u0080\u0099s crude oil imports were at a record high of 12.99 million barrels per day in June, though they fell by 6.7% from June to 12.13 million barrels a day in July, according to S&P Global Platts report dated Aug. 7, citing preliminary data from Chinaâ\u0080\u0099s General Administration of Customs. Crude imports were at just 9.72 million barrels per day in March. For August, Reuters reported that Chinaâ\u0080\u0099s crude oil imports were at 11.18 million barrels per day, down from the record seen in June, but 12.6% higher than a year earlier. “ â\u0080\u0098The increase in Chinese crude imports has been a critical driver of the recovery of crude oil prices over the past several months and is an important pillar of a sustained recovery.â\u0080\u0099 ” â\u0080\u0094 Rebecca Babin, CIBC Private Wealth Management â\u0080\u009cThe increase in Chinese crude imports has been a critical driver of the recovery of crude oil prices over the past several months and is an important pillar of a sustained recovery,â\u0080\u009d Babin told MarketWatch. The recent rise is a reflection of improved economic recovery, as well as a â\u0080\u009cmassive amount of crude stockpiling,â\u0080\u009d she said. Chinaâ\u0080\u0099s official manufacturing purchasing managers index held relatively steady at 51.1 in August, from 51.1 in July, while the Caixin China PMI, a private gauge of the nationâ\u0080\u0099s manufacturing activity, rose to 53.1 in August, the highest in nearly a decade, from 52.8 the month before. A reading of 50 or better indicates improving conditions. However, there is â\u0080\u009cgrowing concern that independent [Chinese] refiners will cut purchases by as much as 40% in the September/October time frame,â\u0080\u009d said Babin, attributing the magnitude of the drop to analysts from ICIS China and energy consulting firm FGE. That could â\u0080\u009ctest the resiliency of the market.â\u0080\u009d If Chinese imports decline significantly, there will be pressure on crude prices globally, she warned. And if China starts trying to work off its inventories, as opposed to building them, it will â\u0080\u009clikely put a lid on rallies.â\u0080\u009d On the other hand, an uptick in Chinese oil imports would be positive for oil, leading to higher prices, but â\u0080\u009conly if demand is also stable.â\u0080\u009d So â\u0080\u009cChinese import numbers will be an important signal for the market over the coming months as we exit the summer driving season in the U.S. and we evaluate the strength of the global economic recovery,â\u0080\u009d said Babin. On Tuesday, prices for front-month U.S. benchmark West Texas Intermediate crude futures US:CLV20 Â settled at $36.76 a barrel, down 7.6%, while global benchmark Brent crude UK:BRNX20 Â fell by 5.3% to $39.78 a barrel. Both grades of crude oil logged their lowest settlements since June."}]}