{"article": [{"url": "https://www.marketwatch.com/story/facebook-removes-trump-post-for-making-false-claims-about-coronavirus-11596668999", "published": 1596655040.0, "headline": "Facebook, Twitter remove Trump posts for making â\u0080\u0098false claimsâ\u0080\u0099 about coronavirus", "body": "President Donald Trump answers a question during a press conference in the White House on Wednesday. AFP/Getty Images Facebook Inc. and Twitter Inc. on Wednesday removed posts by President Donald Trump that violated their coronavirus misinformation policies. The identical posts were a video clip from a Fox News interview with Trump about reopening schools, in which he wrongly claimed children are â\u0080\u009cvirtually immuneâ\u0080\u009d to COVID-19. While children appear to be generally less affected by the coronavirus, they are not â\u0080\u009cvirtually immune,â\u0080\u009d and a number have died. The state of California, for example, has recorded more than 48,000 cases of COVID-19 in patients 17 and younger. A Facebook FB, +0.26% spokesperson said in an email: â\u0080\u009cThis video includes false claims that a group of people is immune from COVID-19 which is a violation of our policies around harmful COVID misinformation.â\u0080\u009dÂ However, that message was not included on Facebookâ\u0080\u0099s site. The post was replaced by a message reading â\u0080\u009cThis content isnâ\u0080\u0099t available right now,â\u0080\u009d which does not explain why it was removed or that its content was inaccurate. It was the first time Facebook has taken down a Trump post for violating its coronavirus rules. In June, Facebook took down Trump campaign ads that included a Nazi symbol, and in March took down Trump campaign ads that were misleading about the census. Trumpâ\u0080\u0099s official campaign account â\u0080\u0094 which Trump retweeted â\u0080\u0094 posted the same video on Twitter, which has been more active than Facebook at taking down presidential posts that violate guidelines. It was up for at least five hours before being taken down, with a note reading: â\u0080\u009cThis Tweet violated the Twitter Rules.â\u0080\u009d A Twitter TWTR, -0.23% spokesperson confirmed the tweet was removed for being in violation of the companyâ\u0080\u0099s rules on COVID-19 misinformation. Twitter added that the Trump campaignâ\u0080\u0099s official account will be blocked from posting again until the video is removed. Trump has harshly criticized social-media companies for fact-checking and removing his posts, and in July the Trump administration asked the FCC to reinterpret a 1996 law that gives broad latitude to how tech companies police content on their sites."}]}