{"article": [{"url": "https://www.marketwatch.com/story/inflation-will-have-a-big-impact-on-your-retirement-2020-08-18", "published": 1597851500.0, "headline": "Inflation will have a big impact on your retirement", "body": "My wife and I had our photo taken standing in front of a 1,000-year-old Sitka Spruce tree, and this got me thinking about the impact of 1,000 years of growth. I can barely get my mind around a concept of the time that tree began its life, presumably around the year 1020. What was life like back then? Did anybody notice that tree when it was young? Most likely we’ll never know. Still, my curiosity was now aroused, and I found an online site with lots of information about inflation. That topic doesn’t directly apply to a tree, but it certainly applies to investors. When I came into the world as an adult, U.S. inflation was very low. To me, the 1953-1966 inflation rate of 1.5% was normal. Something that I could have purchased in 1953 for $1 (more than I usually had as a kid) would have cost about $1.21 in 1966. By then, my ability to spend money had escalated mightily, so it didn’t seem like a big deal. As a result, I was in no way prepared for the next 14 years. From 1967 through 1980, the inflation rate was 7.1%. By 1980, that mythical item which I could have acquired for $1.21 in 1966 would have cost $3.08. From 1926 through 2019, inflation in the United States and other developed nations has been roughly 3%, so at the moment it seems to make sense to regard that as a reasonable long-term expectation for the future. Read: Inflation is low now, but it still poses a big threat to retirees’ financial security In many parts of the world, inflation is much higher than in the United States. For example, Venezuela (15,000% annual rate as of April 2020), Zimbabwe (319%), Sudan (81.3%), Iran (34.2%), and Libya (22.3%). And no, 15,000% is not a typo. There’s also the phenomenon of deflation, a decrease in the general price level of goods and services. Every month, the federal government calculates the Consumer Price Index, which can be translated into an inflation rate. If you’re curious, you can find a table here with the inflation rate for every single month going back to January 1914 along with the annual rate. Scanning the table, you’ll find some interesting data points. Double-digit inflation was experienced in 1917 through 1920, ranging from “only” 15.31% (1919) to 17.8% in 1917. But in 1921, inflation turned into deflation, minus 10.85% to be precise. Even stranger, for seven straight years (1927-1932) year-end inflation was either zero (1929) or negative — that is, deflation. In my lifetime, the highest rates of inflation came in 1979 (11.22%), 1980 (13.58%) and 1981 (10.35%). So far this century, annual inflation has ranged from -0.34% (deflation again, though slight) in 2009 to 3.39% in 2005. Last year, inflation was 1.81%. Read: 10 things you should know about diversification The online page of historical data to which I referred above also has interesting discussions about the nature of inflation, hyperinflation and deflation. You can dig into these topics as much as you wish, and the site has some practical ideas on dealing with inflation. There’s this advice against holding large amounts of cash: “In a world where moderate inflation is the norm, there is little choice but to spend, invest, or be willing to accept a degree of loss due to inflation.” To which I say Amen. In fact, the U.S. stock market has a history of advancing (over long periods) at a rate that outpaces inflation, and in my opinion that’s a more reliable way to keep ahead of inflation than through commodities, real estate, art, or antiques. Now back to that 1,000-year-old tree. If we assume a long-term inflation rate of 3%, then over the course of 1,000 years, $1 will grow to $6,874,240,231,169.63. That’s very impressive, of course. Read: Should I still use the 60/40 investing rule for retirement? But now think about this: If you added just one-tenth of 1% to that inflation rate (making it 3.1%), that $1 would grow to $18,141,169,599,823.68 — nearly three times as much. Those numbers contain a powerful lesson for investors who can take a long-term outlook. Even a tiny difference in return (which can result from shaving expenses, for example) can make an enormous long-term difference. An assumed rate of future inflation is one of the key numbers necessary for thorough retirement planning. Whatever number you pick will have a large effect on the savings you need to afford a given level of spending. If you assume a higher rate, that suggests you should save more. If you assume a lower rate, the implication is you don’t need to save as much. Inflation is one of the key numbers that I highlighted in a chapter of my book Financial Fitness Forever. The chapter is called “Moving to Action: 12 numbers to change your life.” You can read that chapter free if you like. Richard Buck contributed to this article."}]}