{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-retreat-to-start-july-after-the-notching-their-highest-finish-since-2011-2020-07-01", "published": 1593613940.0, "headline": "Gold settles with a loss to start July after the notching the highest finish since 2011", "body": "Gold futures settled with a loss on Wednesday after topping $1,800 and marking the highest finish since in nearly nine years a day earlier, as uncertainty about the economic recovery from the coronavirus pandemic underpinned demand for the safe haven. As gold prices got close to $1,790, “profit taking once again kicked in,” said Craig Erlam, senior market analyst at Oanda, in an emailed update. “With such a major level lying just above, I expect to see more of this behaviour, with rallies being quickly bailed on.” “That’s not to say we won’t see $1,800 break at some point, I’d be surprised if we don’t, but there’s a huge momentum deficit that makes me highly doubt it at this time of asking,” he said. Concerns about the spread of COVID-19 and stimulus from governments and global central banks to limit the harmful impact of the contagion is expected to foster an environment ripe for the rise of gold to further records, gold bulls predict. “Gold is continuing to rise reaching new historic levels setting the stage for $2,000 gold sometime this year,” Peter Cardillo, chief market economist at Spartan Capital Securities, wrote in a Wednesday report. August gold US:GCQ20 lost $20.60, or 1.1%, to settle at $1,779.90 an ounce after trading as high as $1,807.70 overnight, FactSet data show. A day earlier, it notched the highest finish, at $1,800.50, for a most-active contract since Sept. 2011, according to Dow Jones Market Data. In August 2011, gold futures settled at a record $1,891.90. Read:Gold posts largest quarterly gain in 4 years; talk of record prices by year end grows In the first half of this year, gold futures based on the most-active contracts rose just over 18%. For the second quarter, the commodity gained nearly 13% and it climbed almost 3% in the month of June. Meanwhile, September silver US:SIU20 which is the most-active contract, shed 42 cents, or nearly 2.3%, to end at $18.218 an ounce. For the first six months of the year, the white metal climbed 4%, but surged nearly 32% in the second quarter. It tacked on nearly 0.8% in June. After the settlement for futures prices, an account of the Federal Reserve’s most recent monetary-policy meeting revealed that officials noted that the economy is likely to need support from highly accommodative monetary policy for “some time” and that it’s important in coming months to provide”greater clarity” regarding the path for interest rates. In electronic trading shortly after the meeting minutes were released, August gold was little changed, trading at $1,779.20. Data Wednesday on U.S. private-sector employment showed a smaller-than-expected addition of 2.37 million jobs in June, according to Automatic Data Processing Inc. Gold, however, moved lower following the data. The government will release its monthly jobs data on Thursday, a day earlier than usual because Friday marks the Independence Day holiday. Also on Comex Wednesday, September copper US:HGU20 ended 0.2% higher at $2.734 a pound. October platinum PLV20, +3.99% fell 2% to $834.40 an ounce and September palladium US:PAU20 declined by 1.8% to $1,930.70 an ounce."}]}