{"article": [{"url": "https://www.marketwatch.com/story/check-in-but-dont-fly-airlines-launch-flights-to-nowhere-2020-09-15", "published": 1600261700.0, "headline": "Check in, but donâ\u0080\u0099t fly? Airlines launch â\u0080\u0098flights to nowhereâ\u0080\u0099", "body": "All the fuss of air travel without actually going anywhere? Airlines are hoping that the peculiar concept has some appeal for passengers desperate to satisfy their wanderlust while grappling with coronavirus limitations. Theyâ\u0080\u0099re called â\u0080\u009cno-destinationâ\u0080\u009d flights, an idea that comes as airlines entertain ways to boost cash flow amid a severe slump in passenger demand caused by the pandemic. Singapore Airlines C6L, -1.12% Â , for example, is considering launching a â\u0080\u009cflight to nowhereâ\u0080\u009d from Changi Airport, starting in October. Basically, the passengers will board the plane, fly around for a few hours, and come back â\u0080\u0094 a quirky round-trip that could also include staycations at the cityâ\u0080\u0099s hotels and limousine ferry rides, according to a report in the Straits Times. This after Singapore Airlines said on Sept. 10 it would cut around 4,300 positions across its airlines. â\u0080\u009cAs previously indicated, the Group expects to operate under 50% of its capacity at the end of financial year 2020/21 versus pre-COVID levels. Industry groups have also forecast that passenger traffic will not return to previous levels until around 2024,â\u0080\u009d the company said in a statement. Then thereâ\u0080\u0099s Taiwanâ\u0080\u0099s Songshan airport, which is already offering its own version of a â\u0080\u009cflight to nowhere.â\u0080\u009d The concept here is to allow people to check in, clear airport security and board a plane only to disembark shortly afterwards without ever having left the ground. Separately, on Aug. 8, EVA Air offered what amounted to a sightseeing tour, with a special flight to satisfy passengersâ\u0080\u0099 desire to go abroad on a â\u0080\u009cHello Kittyâ\u0080\u009d designed plane. The trip, which took around 2 hours and 45 minutes, passed through the northeastern corner of Taiwan, and flew over the western end of the Ryukyu Islands in Japan. â\u0080\u009cDue to the global epidemic, the international tourism market has been temporarily closed for more than half a year, and the publicâ\u0080\u0099s â\u0080\u009cI really want to go abroadâ\u0080\u009d are becoming more and more intense. To satisfy passengersâ\u0080\u0099 desire to go abroad, EVA Air specially selected the special flight EVA Air â\u0080\u0098New Experience of Going Abroad,â\u0080\u0099â\u0080\u009d the company said in a statement at the time. The deal included free Wi-Fi text messaging service on board as well as a meal of seafood chirashi-sushi rice designed by Michelin three-star chef Motokazu Nakamura, as well as beef sambal noodles. The cost was 5,288 yuan ($780), with the option of upgrading to business class for another 1,000 yuan. In August, Japanâ\u0080\u0099s All Nippon Airways carried out a 90-minute sightseeing flight of its own on one of its Flying Honu A380 aircraft from Tokyoâ\u0080\u0099s Narita Airport, allowing passengers to enjoy a Hawaiian resort experience at the airport and on board, including drinks like pineapple juice, and turtle-themed souvenirs. Japanâ\u0080\u0099s First Airlines has also joined the trend. It is offering passengers the chance to â\u0080\u009cflyâ\u0080\u009d to a number of destinations, including New York, Rome, Paris and Hawaii in a flight that only takes around 120 minutes. The novel initiatives from airlines come as the industry struggles to recover from the pandemic and individuals remain hesitant to fly amid travel restrictions and rapidly-changing quarantine measures. The International Air Transport Association is predicting that air travel wonâ\u0080\u0099t return to pre-COVID-19 levels until 2024, a year later than previously projected. Read:Airlines want people to believe that air travel is safe during the pandemic, but travelers are skeptical Meanwhile, â\u0080\u009cplane-themedâ\u0080\u009d cafes are springing up in Thailand, allowing consumers to drink coffee on old airplanes without actually going anywhere. Coffee War 331 Station in Sattahip, Chonburi province, for example, serves customers on board a retired Airbus A330 commercial plane previously operated by Thai Airways. According to Newsflare, customer Sara Chen, 25, said the cafe felt like she was inside a real planeâ\u0080\u0094taking pictures to post on Instagram FB, +0.26% Â where people believed she was in midair. â\u0080\u009cI closed my eyes and imagined I was really in the sky,â\u0080\u0099â\u0080\u0099 she said."}]}