{"article": [{"url": "https://www.marketwatch.com/story/gen-z-is-starting-to-make-their-own-money-so-pay-attention-to-how-theyre-spending-and-investing-it-2020-08-24", "published": 1598268800.0, "headline": "Gen Z is starting to make their own money â\u0080\u0094 so pay attention to how theyâ\u0080\u0099re spending and investing it", "body": "The U.S. is on the verge of the Great Wealth Transfer, with baby boomers expected to bestow trillions of dollars on younger generations in the coming years. To prepare for this shift, the financial services industry is rapidly adapting to serve millennials, increasingly focusing on financial-planning solutions infused with technology and flexible fee-structures, as well as debt- and cash-management solutions and even non-financial lifestyle enhancements. But just as this is happening, another generation â\u0080\u0093 Gen Z â\u0080\u0093 is forcing the financial services industry to adapt yet again. The money habits of millennials have widely been studied. Having come of age and entered the job market during the Great Recession, they are often considered to be more cautious and intentional with their money. Millennials prioritize saving for the future, avoiding debt, and spending on life experiences over material possessions. They also tend to be more comfortable than older generations in using technology to manage their finances. Gen Z, now nearing and entering their early 20s, is forming its own set of priorities and characteristics, in some cases different â\u0080\u0094 albeit in nuanced ways â\u0080\u0094 from those of their millennial counterparts. Hereâ\u0080\u0099s what appears so far to be the most important money priorities for Gen Z, as well as the resulting trends that the financial services industry should consider as it evolves to meet the demands of this up-and-coming generation: 1. Gen Z has a more debt-centric approach to their finances: Having learned from the millennialsâ\u0080\u0099 experiences, Gen Z may be better prepared (or resigned) to handle many of the same challenges. For example, both generations have experienced a substantial increase in the costs of education, housing and personal expenses, making debt almost unavoidable. In turn, members of Gen Z are likely to be more proactive in addressing their debt, creating a real need for expert advice focused on debt management. To help them make better decisions, financial advisers should be prepared to offer advice around how much and what type of debt to incur and, by the time they graduate, provide guidance as to how best to start earning income and saving for the future while strategically addressing debt. To mitigate some of their debt burden, Gen Z may also be more flexible and intentional about where they go to school, with public schools and programs offering merit-based support gaining more interest among Gen Z students. Again, financial advisers have a role to play here, offering advice regarding student-debt strategies and even school selections. 2. Gen Z seeks to balance financial security with personal fulfillment in career and life choices: Personal fulfillment is important to Gen Z, but they donâ\u0080\u0099t disregard the financial implications of different careers. That said, many members of Gen Z do prioritize the impact of their work relative to financial gain and understand the necessary financial sacrifices. Understandably, most want both and are prepared to compromise and work hard to find the right balance. Itâ\u0080\u0099s interesting to note that when members of Gen Z enter college and choose a field of study, they may not necessarily see themselves as choosing a permanent career. Many have grown to accept that they will end up working with multiple employers in varying fields. They also may be more accepting of the need to take on multiple jobs to financially sustain themselves and achieve their goals. Advisers should consider this dynamic as they monitor and chart the progress of their Gen Z clients against their plans. Income levels are less likely to be predictable and consistent over the careers of Gen Z, possibly requiring frequent course corrections. Read: OK, boomers and millennials: This next wave of home buyers is coming up fast In any event, travel and leisure are an important part of the work-life balance Gen Z seeks and may present further financial-planning challenges. They want the time to experience new adventures and enjoy life but also must be more cost-conscious and disciplined in how they pursue these activities. Financial advisers can help members of Gen Z by providing technology-enabled advice on budgeting and saving to help them balance their financial responsibilities with their career and lifestyle goals. Advisers will need to adapt to a generation that is more pressured financially than others but still wants to leave its mark on the world. 3. Gen Z is focused on the impact of their investing: Gen Z tends to have a greater focus on socially responsible investing, perhaps even more so than millennials. With the internet and advances in technology, they have grown up with access to abundant and incessant information. With all this information, understanding exactly where and how their money is being invested and how their investments may impact others is important to them. They want financial gains to be balanced with having a positive impact on the world. For Gen Z, socially responsible companies may provide the balance they seek and could be the long-term winners in the future that they will one day lead. 4. Gen Z remains open to personalized financial advice: While Gen Z is comfortable with technology, they still remain willing to engage with professionals offering personalized financial advice versus using robo-s. As a generation, to them their challenges are bigger and more complicated than prior generations, and, as such, they may not feel well-served by algorithms â\u0080\u0094 at least not yet. What they really need is education, patience, and an understanding of their specific circumstances, along with a desire to help them achieve their goals despite the many challenges they face. Michael Nathanson is the chairman & CEO of The Colony Group. Lindsay Stelljes is an intern at The Colony Group and attends Hobart and William Smith Colleges majoring in Writing and Rhetoric (Journalism and Professional Writing). Read:When investors fear losing it all, skilled financial advisers bring them back to reality More: What do women want from their financial advisers? Straight talk, clear explanations, and lower fees, for starters"}]}