{"article": [{"url": "https://www.marketwatch.com/story/here-come-the-pros-chasing-the-retail-crowd-fund-manager-survey-shows-biggest-exit-from-cash-into-stocks-in-more-than-a-decade-2020-06-16", "published": 1592299160.0, "headline": "Here come the pros, chasing the retail crowd â\u0080\u0094 fund manager survey shows biggest exit from cash into stocks in more than a decade", "body": "A survey of global fund managers shows the institutional crowd doing what retail investors have been doing for months â\u0080\u0094 buying up stocks leveraged to an economic recovery, even though they are not quite sure it is coming. The Bank of America monthly fund manager survey for June showed the biggest decline in cash balances since Aug. 2009, a drop to 4.7% from 5.7%. Hedge fund net equity exposure soared to 52% from 34%, the highest level since Sept. 2018. A separate report released on Tuesday showed that the Eurekahedge Hedge Fund Index gained 2.03% in May, underperforming the 4.32% rise in the MSCI All-Country World Index 892400, +0.75% Â over the same period. Investors overall were overweight stocks for the first time since February. They aggressively covered short positions in small-cap, value, European, emerging markets, banks and industrials, according to the Bank of America survey. All that said, the fund managers donâ\u0080\u0099t have conviction in the economic story. Only 18% expect a V-shaped recovery, and 53% describe the gains in the stock market â\u0080\u0094 the S&P 500 SPX, +0.87% Â is up 37% since March â\u0080\u0094 as a â\u0080\u009cbear market rally.â\u0080\u009d A net 78% say the stock market is â\u0080\u009covervalued,â\u0080\u009d the most since 1998. Bank of America headlined the report the â\u0080\u009cmoody bulls.â\u0080\u009d Wall Street is past â\u0080\u009cpeak pessimismâ\u0080\u009d but June optimism was â\u0080\u009cfragile, neurotic, nowhere near dangerously bullish,â\u0080\u009d according to strategists Michael Hartnett and Shirley Wu. Conducted from June 5 to 11, 212 panelists with $598 billion in assets under management participated in the survey, Bank of America said."}]}