{"article": [{"url": "https://www.marketwatch.com/story/the-number-of-americans-skipping-mortgage-payments-drops-to-lowest-level-since-april-but-some-borrowers-face-bigger-challenges-2020-09-22", "published": 1600852460.0, "headline": "The number of Americans skipping mortgage payments drops to lowest level since April â\u0080\u0094 but some borrowers face bigger challenges", "body": "Fewer Americans are in forbearance on their mortgages now than in any point in the last five months. But that doesnâ\u0080\u0099t mean borrowers â\u0080\u0094 and the mortgage industry â\u0080\u0094 are out of the woods yet. The share of mortgages in forbearance dropped to 6.93% as of Sept. 13, according to data from the Mortgage Bankers Association. The trade group estimates that roughly 3.5 million homeowners are in forbearance plans that allow them to skip or make reduced monthly loan payments. The overall percentage of loans in forbearance has fallen for months now as the economy has begun to recover from the lockdowns triggered by the coronavirus pandemic. But not all segments of the market have improved. The drop in the forbearance rate is largely a reflection of improvements related to loans backed by Fannie Mae and Freddie Mac. The percentage of these loans in forbearance fell for the 15th consecutive week to 4.55%. Meanwhile, the number of homeowners with Federal Housing Administration (FHA) or Department of Veterans Affairs (VA) loans who are in forbearance has gone up. These loans are guaranteed by Ginnie Mae â\u0080\u0094 all told the percentage of Ginnie Mae loans in forbearance increased slightly over the past week, rising to 9.15% from 9.12%. However, the number of new requests for forbearance for Ginnie-backed loans also increased. â\u0080\u009cWhile housing market data continue to show a quite strong recovery, the job market recovery appears to have slowed, and we are seeing the impact of this slowdown on FHA and VA borrowers in the Ginnie Mae portfolio,â\u0080\u009d said Mike Fratantoni, chief economist for the Mortgage Bankers Association. Donâ\u0080\u0099t miss:If youâ\u0080\u0099re skipping your mortgage payments, watch out for this costly mistake Ginnie Mae loans, including FHA and VA mortgages, are more commonly originated to first-time home buyers. FHA and VA borrowers tend to have lower credit scores and smaller down payments than their peers with Fannie or Freddie loans. These borrowers are also more likely to be people of color. It is still too early to tell whether these homeowners will be able to resume making on-time monthly payments when their forbearance periods end. Currently, around two-thirds of homeowners in forbearance have extended their forbearance arrangements with their mortgage servicers after the initial stage. The CARES Act allowed homeowners to receive forbearance for up to one year. Come next year, delinquencies could rise significantly as homeowners struggle to resume their payment schedules. However, the actual number of people who will go into foreclosure may be far lower than what the market saw prior to the 2008 financial crisis. Thatâ\u0080\u0099s because most homeowners today have a significant amount of equity built up, and there is still high demand among home buyers. Consequently, homeowners in a bind could have more options to sell their homes before facing foreclosure."}]}