{"article": [{"url": "https://www.marketwatch.com/story/is-it-the-last-dance-the-murky-future-of-nycs-nightlife-business-2020-08-20", "published": 1597924880.0, "headline": "Is it the last dance? The murky future of NYCâ\u0080\u0099s nightlife business", "body": "Nearly four months after COVID-19 shut down House of Yes â\u0080\u0094 a nightclub in Bushwick, Brooklyn, known for its psychedelic circus vibe and fabulous dance parties â\u0080\u0094 the business got some of its groove back on July 2.Â â\u0080\u009cOpen for outdoor drinks and food in a seated, limited capacity, socially distanced environment,â\u0080\u009d the 10-year-old nightlife business noted early last month on its website. â\u0080\u009cYou can also order to-go cocktails from the bar.â\u0080\u009dÂ While itâ\u0080\u0099s a far cry from a freaky dance party, the pandemic pivot helps pay the rent. â\u0080\u009cItâ\u0080\u0099s a Band-Aid,â\u0080\u009d said co-founder and creative director Kae Burke, who ballparked the monthly rent at around $15,000.Â Like other New York City club operators, Burke is holding on for dear life. She is also thinking creatively about alternative uses for the space, and banking on her landlord â\u0080\u0094 itâ\u0080\u0099s a family-owned company, she said â\u0080\u0094 being willing to negotiate.Â â\u0080\u009cWe could maybe last a year at this rate,â\u0080\u009d she said. â\u0080\u009cNo, actually less than that â\u0080\u0094 six months.â\u0080\u009dÂ Andrew Rigie, executive director of the NYC Hospitality Alliance, which serves establishments across the city, described the foreseeable future of nightlife as â\u0080\u009cvery dim. Federal support is needed so these businesses can hang on, so when theyâ\u0080\u0099re able to reopen safely, they can do that. Without that support most wonâ\u0080\u0099t survive.â\u0080\u009d Nightclub and live music venue Elsewhere in Williamsburg, Brooklyn, also is making use of outdoor dining.Â â\u0080\u009cWe need to figure out how to clear a path to survive beyond summer,â\u0080\u009d said owner and operator Dhruv Chopra. â\u0080\u009cI donâ\u0080\u0099t see reopening until a vaccine is well in place. Will current players be in play in 12 or even six months? That depends on federal support. Also key is being able to work with landlords.â\u0080\u009dÂ Chopra is a member of the 5-month-old New York Independent Venue Association, a group seeking government support to preserve local venues. On average, the association noted earlier this month, a venue will need $300,000 to sustain itself if they must stay closed until 2021. The Association estimates that there are approximately 90 of these venues in New York. Coronavirus tally: Global cases reach 22.4 million, as U.S. cases exceed 5.5 million The shutdown seems likely. â\u0080\u009cSocially-distanced nightlife is not a sustainable business model,â\u0080\u009d Rigie added. â\u0080\u009cDancing 6 feet apart is not intriguing to most people.â\u0080\u009dÂ But dancing any closer than that is risky, especially without face coverings. The Centers for Disease Control and Prevention notes that one way the virus spreads is person-to-person; respiratory droplets produced when an infected person coughs, sneezes, or talks.Â â\u0080\u009cAny situation where people are near each other and not wearing masks is a set-up for the transmission of the virus,â\u0080\u009d said Dr. Aaron Glatt, chair of the department of medicine and infectious diseases at Mount Sinai South Nassau on Long Island. In a nightclub, he added, â\u0080\u009cpeople are practically on top of each other talking and sipping drinks, so thereâ\u0080\u0099s clearly risk for exposure.â\u0080\u009dÂ Concerns extend beyond throbbing dance floors.Â â\u0080\u009cYou can imagine a restaurant with partitions. Imagine that at a nightclub. But nightlife is more than nightclubs,â\u0080\u009d said David Rosen, who runs various nightlife establishments, including The Woods and The Breakers in Williamsburg, Brooklyn, and serves on the NYC Nightlife Advisory Board. He co-founded the industry trade group Brooklyn Allied Bars and Restaurants. â\u0080\u009cBars are in the same boat as nightclubs.â\u0080\u009dÂ The size of some nightlife venues presents a steep financial challenge. AFP/Getty Images Thanks to capitalization, judicious spending of government aid and careful negotiations, Rosen anticipates weathering the COVID storm. He estimates that about 30% of nightlife businesses wonâ\u0080\u0099t make it. Crushed by the pandemic and financial burden, Kinfolk, a Brooklyn club, announced its permanent closure on July 16 in a letter to friends and family, noting: â\u0080\u009cWe did not want this to be the way we said goodbye.â\u0080\u009d Why would they? Nightlife pre-COVID was robust. According to a New York City Mayorâ\u0080\u0099s Office of Media and Entertainment report, the bars subset alone of the nightlife aggregate, which includes restaurants and venues, accounts for 13,400 jobs, $492 million in employee compensation, and $2 billion in economic output. Kenneth Fishel and his son, Bradley Fishel, president and vice president, respectively, of Renaissance Properties, a family owned and managed New York specialist in boutique commercial real estate leasing, management and construction, see bumpy times ahead, along with drops in rent prices.Â â\u0080\u009cWeâ\u0080\u0099ve seen this show before,â\u0080\u009d said Ken Fishel, who believes the city has history on its side. â\u0080\u009cDuring the 1918 pandemic, the same things happened. Businesses, especially ones built around people congregating, such as sports and hospitality shut down. Within a few short years, the Jazz Age was on us. It all came roaring back. But the vaccine will be key.â\u0080\u009d Also see: New York gyms can reopen on Aug. 24 at 33% capacity with mandatory masks â\u0080\u009cPeople are tired of being stuck at home,â\u0080\u009d Bradley Fishel said. â\u0080\u009cTheyâ\u0080\u0099re looking forward to resuming their lives. The demand for clubbing is there.â\u0080\u009d Hospitality pro Ian Duke, the brains behind the Southampton Social Club on Long Island; the Baylander, a restaurant on a small aircraft carrier at the W. 125th St. Pier in Manhattan; and the currently shuttered Prohibition, a bar and music venue on the Upper West Side, knows how high the stakes and the hurdles are and remains optimistic. â\u0080\u009cThereâ\u0080\u0099s no upside to thinking negatively,â\u0080\u009d he said. â\u0080\u009cIf thereâ\u0080\u0099s any industry designed to handle adversity itâ\u0080\u0099s hospitality,â\u0080\u009d he added. â\u0080\u009cThere is adversity every day, thereâ\u0080\u0099s always something broken. And new regulations. This pandemic will break those with less experience and weak partnerships.â\u0080\u009dÂ The sheer size of some nightlife venues presents a steep financial challenge. Thatâ\u0080\u0099s true for clubs as well as future enterprises that may take over the locations. Amid current economic and real estate uncertainty, Rigie asks, â\u0080\u009cWho is going to line up to take these spaces? And repurpose them with what? Vibrant nightlife is a major support to a neighborhood,â\u0080\u009d he said. â\u0080\u009cBy repurposing the space, youâ\u0080\u0099re devaluing that ecosystem.â\u0080\u009dÂ Burke concurs. â\u0080\u009cBeating this will take collaboration among the owner operators, landlords and mortgage holders. Itâ\u0080\u0099s an immense collaboration. There will be casualties.â\u0080\u009d Sheâ\u0080\u0099s determined that the House of Yes wonâ\u0080\u0099t be among them.Â Read: Night and day, New York imagines a post-COVID future â\u0080\u009cOne alternative we have explored is using the space for education,â\u0080\u009d Burke said. â\u0080\u009cSchools donâ\u0080\u0099t have enough room for social distancing and there are other organizations seeking space. We are exploring every option and that includes renting out and subleasing the space. We are committed to survival.â\u0080\u009d"}]}