{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-slide-amid-fear-of-new-covid-19-restrictions-in-europe-11600691312", "published": 1600707620.0, "headline": "Treasury yields retreat amid fear of new COVID-19 restrictions in Europe", "body": "U.S. Treasury yields fell Monday as a global stock-market selloff bolstered demand for safe-haven assets such as government bonds, amid renewed worries over the spread of COVID-19.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 2.4 basis points to 0.670%, while the 2-year note rate TMUBMUSD02Y, 0.156% was steady at 0.135%. The 30-year bond yield TMUBMUSD30Y, 1.576% slipped 2.7 basis points to 1.426%. Bond prices move inversely to yields.What’s driving Treasurys? U.S. stocks fell to start the week amid worries the rising COVID-19 case tally in Europe would prompt governments to re-implement lockdowns. London Mayor Sadiq Khan was in talks to introduce new restrictions to stem the spread of the coronavirus. At the same time, politicians in Europe are looking to avoid to put in place the economically devastating restrictions on social activity akin to those in March when the coronavirus spread rapidly across the continent. Analysts say new lockdowns would deliver a blow to hopes of a steady global economic recovery, without which higher interest rates seems unlikely. The Stoxx Europe 600 index SXXP, +0.55% fell 3.2% while the S&P 500 SPX, +0.87% ended 1.2% lower. Risky assets were also facing headwinds over an investigative news report showing that U.S. and European banks had continued to do business with those suspected of wrongdoing. Some senior Federal Reserve officials spoke on Monday. Dallas Fed President Rob Kaplan worried the central bank’s pledge to keep interest rates at zero until inflation overshot above 2% could result in financial “excesses.” The Chicago Fed’s national activity index, which is designed to gauge overall U.S. economic activity, fell to 0.79 in August from a revised 2.54 in the prior month. What did market participants’ say? “ With coronavirus cases having surpassed the 31 million mark and almost 1 million deaths globally, the possibility that ‘second waves’ or indeed, first waves that were never actually brought under control will continue to weigh on the economic and policy outlook is all but certain,” said analysts at Rabobank."}]}