{"article": [{"url": "https://www.marketwatch.com/story/food-banks-are-anticipating-a-second-wave-of-demand-when-the-extra-600-in-unemployment-benefits-expires-next-month-2020-06-29", "published": 1593509180.0, "headline": "After months of â\u0080\u0098heartbreakingâ\u0080\u0099 demand, food banks say theyâ\u0080\u0099re bracing for August when unemployed Americans stop getting the extra $600", "body": "Before the coronavirus pandemic, the Food Bank of Northern Nevada in Sparks, Nev., was serving 91,000 people a month. As record numbers of Americans started losing their jobs in early April, it served 123,000 people â\u0080\u0094 its highest number of clients ever in a single month. Lines began to calm down a bit in mid-April as Americans started receiving their stimulus checks, as well as an additional $600 in weekly unemployment benefits, thanks to the $2.2 trillion stimulus package known as the CARES Act, Jocelyn Lantrip, communications and marketing director for the Food Bank of Northern Nevada, said. Lantrip thinks the worst may be yet to come. More than 25% of Nevadaâ\u0080\u0099s labor force is unemployed, the highest unemployment rate of any state, and Lantrip said sheâ\u0080\u0099s â\u0080\u009canticipating even higher need for food assistance in Augustâ\u0080\u009d than at the onset of the pandemic. By now the majority of Americans, particularly from lower-income brackets, have already spent their stimulus checks. If lawmakers donâ\u0080\u0099t act before the July 31 deadline, more than 20 million Americans will stop receiving the supplemental $600 a week in unemployment benefits. In total, that would mean that Americans would have $842 billion less to spend to pay for their own food and living expenses, according to Josh Bivens, director of research at the Economic Policy Institute, a left-leaning think tank. Related: The extra $600 Americans get in weekly unemployment benefits ends next month â\u0080\u0094 hereâ\u0080\u0099s what lawmakers are proposing to replace it But just how many people are going to show up to the food bank come August 1 is nearly impossible to predict â\u0080\u009cbecause we have never seen anything like this before,â\u0080\u009d Lantrip said. For instance, the food bankâ\u0080\u0099s Mobile Harvest program â\u0080\u0094 which distributes perishable foods and produce â\u0080\u0094 served about 8,900 people per month in the eight months prior to coronavirus. In April, that number rose to 28,272 people served in one month. Additionally, the food bankâ\u0080\u0099s program for children who arenâ\u0080\u0099t in school has also been in high demand. Since schools closed because of the pandemic, the food bank distributed more than 314,000 meals, which is more than it distributed during its entire previous fiscal year, Lantrip told MarketWatch. Volunteers help load a car at a drive-thru run by the Food Bank of Northern Nevada Jocelyn Lantrip Not only have food bank officials had to purchase more food than ever before, theyâ\u0080\u0099ve also had to reconstruct their entire business model, switching it to a drive-thru operation to accommodate social distancing. Theyâ\u0080\u0099ve also had to move their drive-thru location several times as businesses reopened and parking lots that had been empty went back into use, Lantrip said. “ The food bankâ\u0080\u0099s Mobile Harvest program â\u0080\u0094 which distributes perishable foods and produce â\u0080\u0094 served about 8,900 people per month in the eight months prior to coronavirus. In April, that number rose to 28,272 people served in one month. ” â\u0080\u009cIt has also been difficult to keep volunteers at a safe social distance while still having enough people to help,â\u0080\u009d she added.â\u0080\u0098Heartbreaking demandâ\u0080\u0099 at a Hawaii food pantry Figuring out how to operate a socially distanced food bank wasnâ\u0080\u0099t an issue for The Pantry, a food bank based in Honolulu, Hawaii which provides food to any resident in need on the Oâ\u0080\u0099ahu Island, where it is located. Before the pandemic, The Pantry was already serving clients through a contactless e-commerce platform that let families select the items they needed based on the size of their household and then pick the food up at the site. What was an issue, though, was figuring out how to handle the â\u0080\u009cheartbreaking demandâ\u0080\u009d for food assistance, said Jennine Sullivan, executive director of The Pantry. “ Over the course of the month, The Pantry distributed 15,000 pounds of food. In May it distributed 100,000 pounds of food and in the third week of June, it handed out an amount equivalent to April and May combined in just one week. ” In April demand at The Pantry began skyrocketing at unprecedented rates. Over the course of the month, it distributed 15,000 pounds of food. In May it distributed 100,000 pounds of food and by the third week of June, it handed out an amount that was equivalent to April and May combined in just one week. One family of five who Sullivan helped serve saw their entire household income â\u0080\u009cdrop to zeroâ\u0080\u009d over the course of those few months, she said. Cars line up to pick up food orders they placed through The Pantry, a food bank in Honolulu, Hawaii. Jennine Sullivan The exponential growth in demand doesnâ\u0080\u0099t appear to be slowing any time soon and is likely to climb even higher when Americans stop receiving the extra $600 in weekly unemployment benefits, given that Hawaii has the second-highest rate of unemployment, Sullivan told MarketWatch. Related: White House â\u0080\u0098very seriously consideringâ\u0080\u0099 another stimulus bill â\u0080\u0094 hereâ\u0080\u0099s how the CARES Act has impacted poverty rates â\u0080\u009cItâ\u0080\u0099s a struggle every day,â\u0080\u009d Sullivan said, particularly because â\u0080\u009cwe live on an island and food supply is so limited so we have to be creative about how we get our food.â\u0080\u009d Everyone on the island, including grocery stores and other food pantries, are competing for the limited supply of food, and the situation has been exacerbated by the fact that so many shipments of food into the island have been delayed by weeks and sometimes months. Normally grocery stores would donate unsold foods, but because more Hawaiians have been shopping at those stores and buying in bulk, they have little to spare, and The Pantry canâ\u0080\u0099t afford to buy from those stories, Sullivan told MarketWatch. Partnerships with restaurants like 53 by the Sea, an upscale fish restaurant in Honolulu, have been particularly useful. “ â\u0080\u0098Itâ\u0080\u0099s a struggle every day,â\u0080\u0099 particularly because â\u0080\u0098we live on an island and food supply is so limited so we have to be creative about how we get our food.â\u0080\u0099 ” â\u0080\u0094 Jennine Sullivan, executive director of The Pantry based in Honolulu, Hawaii Earlier in the pandemic when 53 by the Sea wasnâ\u0080\u0099t open, it donated 300,000 pounds of steak and 45 pounds of yogurt, which Sullivan said The Pantry used to make yogurt parfaits. Sullivan said she is constantly looking to form more public-private partnerships, especially as August approaches. A Nebraska food bank says â\u0080\u0098we need to brace ourselvesâ\u0080\u0099 Even in Nebraska, where there is the lowest rate of unemployment in the U.S., Scott Young, executive director of the Food Bank of Lincoln, which serves 16 counties in southeast Nebraska, said demand has been unprecedented. â\u0080\u009cImmediately when the pandemic started, we saw an increase in food insecurity,â\u0080\u009d he said. In early April, his team helped load a truck with enough food to feed 175 people, but 300 ended up showing up. Thankfully, colleagues at the scene recognized the problem early on, so they rationed out the food so everyone in line could get some, Young said. â\u0080\u009cWe try to never say to anyone â\u0080\u0098Thereâ\u0080\u0099s no food left.â\u0080\u0099 I donâ\u0080\u0099t think weâ\u0080\u0099ve ever gotten to the end of the line and said â\u0080\u0098Thereâ\u0080\u0099s no food for you.â\u0080\u0099â\u0080\u009d But similar to what Lantrip saw in Nevada, â\u0080\u009cthere was flattening after mid-April,â\u0080\u009d he said. Since then demand for food assistance has been highly unpredictable, Young told MarketWatch. Until recently, the National Guard helped distribute food, â\u0080\u009cwhich made all the difference in the world,â\u0080\u009d Young said, â\u0080\u009cnow weâ\u0080\u0099re back to rounding up volunteers.â\u0080\u009d National Guard troops help pre-package food bags to distribute for the Food Bank of Lincoln. Scott Young That hasnâ\u0080\u0099t been an easy task given that its usual team of volunteers is predominantly over the age of 65, and the food bank hasnâ\u0080\u0099t allowed them to volunteer since the pandemic hit because they are more vulnerable to coronavirus. “ â\u0080\u0098I donâ\u0080\u0099t think weâ\u0080\u0099ve ever gotten to the end of the line and said â\u0080\u0098Thereâ\u0080\u0099s no food for you.â\u0080\u0099â\u0080\u0099 ” â\u0080\u0094 Scott Young, executive director at the Food Bank of Lincoln Looking ahead into August, Young said he had no idea what to expect. But he knows that â\u0080\u009cwe need to brace ourselves.â\u0080\u009d â\u0080\u009cThereâ\u0080\u0099s a lot of missing facts,â\u0080\u009d like whether schools will remain closed in the fall or whether there will be another meat shortage, Young said. â\u0080\u009cOur priorities remain the same but we will need more donations to continue our operations.â\u0080\u009dFood pantries are also getting extra help under the CARES Act All three pantries MarketWatch spoke to have received food from the U.S. Department of Agriculture through The Emergency Food Assistance Program. Under that program, the USDA purchases foods on behalf of the states and distributes it based on state unemployment levels and the number of people with incomes below the poverty level. Over the course of the pandemic, the department has purchased more than $850 million worth of food, which has been possible because of the CARES Act. â\u0080\u009cThis is a challenging time for many Americans,â\u0080\u009d Brandon Lipps, USDA Deputy Under Secretary, said. â\u0080\u009cUSDA is addressing the unprecedented demand from all angles to equip our state and local partners across the country with food and resources to serve those in need.â\u0080\u009d The USDA declined to share any specific measures it is taking to prepare for a potential second wave of demand for food assistance in August if unemployed Americans stop receiving the extra $600 a week."}]}