{"article": [{"url": "https://www.marketwatch.com/story/trump-xi-and-putin-are-least-trusted-leaders-during-pandemic-merkel-is-most-trusted-2020-09-15", "published": 1600243400.0, "headline": "Trump, Xi and Putin are least trusted leaders during pandemic; Merkel is most trusted", "body": "President Donald Trump ranks as the least trusted to do the right thing regarding world affairs in a new survey of 13 countries, and he is even less well-regarded than Chinese President Xi Jinping and Russian President Vladimir Putin. The survey conducted by the Pew Research Center between June 10 and Aug. 3 found German Chancellor Angela Merkel is most trusted with a median positive rating of 76%, followed by French President Emmanuel Macron with a 64% positive rating. U.K. Prime Minister Boris Johnson gets a positive 48% rating. In contrast, Trump has an 83% negative rating, Xi has a 78% negative rating and Putin has a 73% negative rating. The survey found the image of the United States has taken a beating in the last year as residents of its key allies and partners are not impressed at how the Trump administration has handled the coronavirus pandemic. Just 41% of people surveyed in the U.K., for example, have a favorable opinion of the U.S., the lowest number ever recorded in a Pew survey there. In France, just 31% view the U.S. in a positive light, matching the low-water mark of March 2003 at the height of tensions between the U.S. and France over the Iraq war. In Germany, just 26% rate the U.S. favorably, also in line with a March 2003 poll. Overall, across the 13 countries surveyed, a median of 15% believe the U.S. has done a good job in managing the pandemic. But most of those surveyed have a positive opinion of the World Health Organization’s handling of the crisis. Trump has pledged to pull the U.S. out of the WHO, which he alleges is pro-China. See also:Coronavirus update: Global cases edge toward 30 million, and China says vaccine may be ready by November Relatively few of those surveyed believe China has handled the pandemic well, but it gets better reviews than the U.S. does. Trump has attracted low ratings in all 13 countries during his presidency, and the trend has remained intact this year. Trump’s worst assessment is from Belgium, where just 9% of those surveyed say they have confidence in Trump to do the right thing in world affairs. Trump’s highest rating comes from Japan, although the number there is just 25%. “Attitudes toward Trump have consistently been much more negative than those toward his predecessor, Barack Obama, especially in Western Europe,” the survey found. “In the U.K., Spain, France and Germany, ratings for Trump are similar to those received by George W. Bush near the end of his presidency.” See also:The U.S. has dropped significantly on this index that measures well-being — here’s where it ranks The Pew survey involved 13,273 respondents in 13 countries, not including the U.S., according to the research organization. The survey did not include any questions relating to the killing of George Floyd or the anti-racism protests that have erupted across the U.S. since. Don’t miss:House Democrats to probe whether officials meddled with CDC coronavirus data"}]}