{"article": [{"url": "https://www.marketwatch.com/story/british-government-says-it-will-pick-up-half-the-checks-at-restaurants-to-help-boost-economy-2020-07-08", "published": 1594278620.0, "headline": "British government says it will pick up half the checks at restaurants to help boost economy", "body": "Brits dining out in restaurants will have the cost of half of their meals picked up by the Government in an attempt to get them out and spending. The innovative scheme is aimed at kick-starting economic growth and boosting the hospitality sector, which has been hit hard by the lockdown. The measure is part of a raft of new policies unveiled on Wednesday by Chancellor of the Exchequer Rishi Sunak in a mini-budget which includes a £30 billion ($37.7 billion) plan to protect jobs and prevent mass unemployment as a result of the coronavirus pandemic. This includes a youth employment program aimed at 16 to 24-year-olds, incentives for businesses to bring back furloughed staff, and reducing tax on property purchases to inject new life into the stagnant housing market. Read: ‘No one will be left without hope’—U.K. unveils £30 billion jobs plan to prevent mass unemployment The “Eat Out to Help Out ” scheme unveiled in the Chancellor’s summer statement will entitle every diner to a 50% discount of up to £10 per head on their meal at any restaurant in the country, including upscale venues. While the discount can be used unlimited times it will only be valid from Monday through to Wednesday on any eat-in meal. The move will likely hit Uber’s UBER, -0.18% food delivery service Uber Eats, Just Eat Takeway JET, +1.22%, and Deliveroo, who have all seen a lift in business as consumers stuck at home have turned to home delivery from their favorite restaurants. The government scheme does not include alcoholic drinks and is valid for the entire month of August 2020 across the U.K. Further details about are set to be announced shortly, but restaurants will apply the discount and will then be fully reimbursed. “This moment is unique. We need to be creative. To get customers back into restaurants, cafes and pubs, and protect the 1.8 million people who work in them, I can announce today that, for the month of August, we will give everyone in the country an Eat Out to Help Out discount,” Sunak said. This scheme will support around 130,000 businesses and boost confidence among Brits, encouraging them to spend amid the looming economic recession. In May research showed a campaign to keep Britons locked down and protected from the coronavirus may have proved too successful with many now scared to leave their homes. Read: Just after Elon Musk denounced coronavirus lockdowns as infringements of freedom, research shows Britons are too scared to leave their homes anyway One-third (33%) of Britons said they would feel uncomfortable meeting friends and family outside their household, according to polling released by research firm Ipsos Mori. Just under two-thirds (61%) said they would feel uncomfortable using public transport or going to bars and restaurants. Sunak also announced that value added tax (VAT) which is currently charged at 20% would be dropped to 5% for all hospitality and tourism businesses until Jan. 12. Caroline Roylance, owner of The George at Fordingbridge, in Hampshire, U.K. Rhizome Media Caroline Roylance, who owns The George, a pub in at Fordingbridge, in Hampshire 90 miles from London said: “We will definitely be applying for the Eat Out to Help Out discount scheme, and the VAT reduction will help us make it through the next few months, because trade is unlikely to return to pre-Covid levels for some time. “People are getting used to the new normal and social distancing measures, and we are doing everything possible to ensure customers will feel safe when they do return. “I’m hopeful that we will have our bustling local pub back again in a few months, and the VAT cut and discount meals scheme will certainly help get there.”"}]}