{"article": [{"url": "https://www.marketwatch.com/story/what-to-do-when-you-inherit-your-parents-stuff-and-you-dont-want-it-2020-07-14", "published": 1594722620.0, "headline": "What to do when you inherit your parentsâ\u0080\u0099 stuff â\u0080\u0094 and you donâ\u0080\u0099t want it", "body": "One of the most daunting tasks an adult child will eventually have to face is the handling of their parentsâ\u0080\u0099 estate and all of its contents accumulated over a lifetime. No one wants to think about the future when our parents become ill or pass away. Sometimes these life events can take years to surface, and sometimes they can happen overnight. What you need is a game plan in advance. By far, most adult children are catapulted into the world of handling an estate under the duress of a crisis. It happens more frequently than most people realize, and all it takes is for a parent to fall and break a hip or to pass away suddenly. Having those courageous conversations with your older loved ones in advance while they are still healthy and sound enough to do so is one of the most important things you can do. Decisions should be made in advance of any infirmity, and adult children should be given trusted guidance they can follow. Read: 6 ways to decline your parentsâ\u0080\u0099 old stuff without starting a family feud As if caregiving or losing a parent is not wrenching enough, it is usually completely overwhelming trying to handle what your parents leave behind. Often it is not just their possessions you are dealing with. Aunt Bertha, Grandpa Joe, and Great-grandmother Eleanorâ\u0080\u0099s things are mixed in as well. Many people who lived through the Depression certainly did not throw anything away that might prove useful one day. Historically, family possessions have been absorbed into the next generation, where eager hands were ready to accept, but that is not the case in the 21st century. Today, it is rare for younger generations to want much from a grandparentâ\u0080\u0099s home; they tend to prefer modern clean lines without too much clutter. This lack of interest has also contributed to a decline in the value of antiques and collectibles. As the Depression-era generation passes away, their adult children are also downsizing, flooding the market with traditional possessions. Too much supply and not enough demand is driving value downward for a majority of the items. The younger generations do not â\u0080\u009ccollectâ\u0080\u009d like the older ones did in the 20th century. That is why china sets and Hummels are no longer selling well. Everyone is trying to sell them at approximately the same time. Read: Do these simple things to turn your retirement savings into big money The most common concern among adult children is becoming overwhelmed with too much stuff and not knowing how or where to begin the process of dismantling the estate. What do you do with it all? Is any of it valuable, and if it is, how do you sell it or divide it fairly? If it is not valuable, then what? There is much to do and a lot to consider, but itâ\u0080\u0099s not impossible. The responsibility falls on the executor of the estate to make strong decisions. Secure the home to make sure items donâ\u0080\u0099t disappear. Ask the heirs for a wish list of items they would like, and then have a personal property appraiser walk through the home to gain an understanding of what has value (and what doesnâ\u0080\u0099t). Then, assign value to those wish lists. Understanding the value of items from an objective third party also promotes equitable distribution among heirs, which will help to minimize family feuds. Do your very best not to give away or donate anything until you first understand its value. Itâ\u0080\u0099s amazing what can be found in the overlooked nooks and crannies of estates. While a personal property appraiser will assign fair market value to the estate items, keep in mind that fair market value is not equivalent to what your parents paid for these items, what a 1985 appraisal says it is worth, or what the family folklore may suggest. Assigning value also should not involve merely looking up asking prices on the internet either. Fair market value essentially is the price that is arrived at between a willing buyer and a seller; it also factors in what these items have sold for recently in the midst of a fragile economy. An item is worth what someone is willing to pay for it, and estate contents today are not worth what people think they are worth. Of course, there are always exceptions, and that is why hiring an appraiser can be helpful. Sentimentality for these items also plays a large part in the process; however, emotional attachment has nothing to do with monetary value. Separating the sentimental from the monetary values of items in your mind is an essential step in reducing conflict and having peace of mind throughout the estate appraisal process. Read: The 10 most affordable beach towns in America for retirees The key goal should be to empty the parentsâ\u0080\u0099 estate in a timely manner so the house, typically one of the larger assets, can be sold. However, it is not unusual to have one sibling ready to toss it all out while another sibling wants to take two years to sort through it all. From a financial perspective, the cost of property taxes, utilities, maintenance, and unexpected expenses to keep the house sitting empty can easily eat away at any proceeds from the sale of the home and its contents. Many steps will need to unfold between understanding the value of items and cleaning out the home. Dividing the contents and deciding the best method for selling the remainder is a priority. The clean-out part of the process, which is one of the hardest parts of handling an estate, requires serious organization and methodology. Here are some tips â\u0080¢ Remove from the home everything the family decides to keep. Offer all heirs a date for which the items need to be removed from the home. The remainder can either be sold in an estate sale www.ASELonline.com or local auction https://www.auctioneers.org/, and items that do not sell can be donated. â\u0080¢ Always start from the top of the house and work your way down. Use an assembly-line approach when cleaning out challenging areas such as basements or attics. Enlist the help of strong people because many hands make light work. Have all necessary supplies ready ahead of time, including food and beverages. If items are cracked, stained, reglued, or severely damaged, throw them out. Curb the temptation to keep a lot of stuff. Remember that your children will have to repeat this process one day. Instead, take photos of those items or keep smaller items that take up less space. â\u0080¢ Know your limits Hiring a professional company is ideal if the estate is long distance or if working together at the same time is not an option for the family. Professionals can guide you and help orchestrate the process in a relatively short period. Final thoughts: It is not a matter of if. It is a matter of when a crisis may occur or a loved one will become infirm or die. Having tended to thousands of clients, I have found that the ones who fared the best were the ones who had discussed everything with their parents ahead of time, had put in place all essential legal documents, and had established a system they could follow. Julie Hall, The Estate Lady, is a personal property expert who has assisted individuals across the country in the daunting and often painful process of managing their deceased loved oneâ\u0080\u0099s possessions. Her new book, Inheriting Clutter: How to Calm the Chaos Your Parents Leave Behind, is available in e-book, audiobook and paperback editions."}]}