{"article": [{"url": "https://www.marketwatch.com/story/mortgage-rates-keep-falling-to-record-lows-so-is-now-a-good-time-to-refinance-2020-06-25", "published": 1593163100.0, "headline": "Mortgage rates keep falling to record lows - so is now a good time to refinance?", "body": "The coronavirus pandemic has led to a dramatic decline in mortgage rates. But that doesn't mean now is a good time to refinance for everyone. Last week, Freddie Mac FMCC, +0.52%  reported that mortgage rates hit a new record low for the fourth time this year, with the average rate on a 30-year fixed-rate mortgage dropping to 3.13%. When rates hit their first record low of the year back in March, it triggered a deluge of refinancing activity just as many lenders were transitioning to remote work environments because of the spread of COVID-19. That led to a massive backlog at some lenders, with some borrowers waiting weeks to close their refinances. Now, the market has settled down, and lenders have adapted to the coronavirus world. And the good news for borrowers is that most markets are served by mobile notary services, said Pat Stone, co-founder and chairman of title insurance company Williston Financial Group, and other states allow for entirely virtual mortgage processes. That means in most parts of the country getting a new home loan won't mean risking your health, as infection rates remain stubbornly high in many areas. Read more: Home prices continued to rise even as the coronavirus pandemic swept across America, FHFA says But will refinancing your mortgage risk your financial health? Here's what homeowners need to consider before closing on a new loan.Figure out when you'll break even As a general rule of thumb, experts say that a refinance will be worthwhile if it will net a homeowner an interest rate between 50 and 75 basis points lower than their current mortgage's rate. That's because the reduced interest will compensate for the closing costs associated with the refinance. But those savings don't come immediately - it will take a few year before the savings via monthly payments accrue to outweigh the costs. \"If you're in your forever home, it might make sense to refinance with a half-point rate decrease,\" said Holden Lewis, home and mortgage expert at personal-finance website NerdWallet. \"But if you plan to sell the home within five years or so, it's most likely not worth it because you'll pay more in fees than you would save during that time.\" “ 'If you're in your forever home, it might make sense to refinance with a half-point rate decrease.' ” - Holden Lewis, home and mortgage expert at personal-finance website NerdWallet Pay attention to the loan's term Homeowners shouldn't necessarily default to a 30-year loan, despite their popularity. \"Because rates have fallen so much you could probably get into a 15-year loan and maybe maintain or even still lower your monthly payment,\" said Tendayi Kapfidze, chief economist at LendingTree TREE, -0.37%  . \"You're going to pay off the loan sooner and you're going to pay less interest.\" Choosing a shorter term has its trade-offs though, mortgage industry experts warn, if locking into such a loan means making larger monthly payments. The standard 30-year mortgage offers flexibility. \"You have the flexibility to pay extra every month when you can afford to, and you can cut back to the minimum required payment during insecure times,\" Lewis said.Don't be afraid of closing costs When doing your break-even analysis, don't shy away from paying closing costs. While paying those costs upfront may seem like it's making the refinance more expensive, in reality it could be saving you money. \"It's always attractive to say 'no cost,' but you might end up paying for it over the life of the loan,\" said Brian Koss, executive vice president of Mortgage Network, a Massachusetts-based lender. That's because those costs don't go away. Rather, they may be rolled into the loan's balance, or lead to a higher interest rate. Along those lines, you can prepay your interest by paying for mortgage points. The upfront cost, again, will be higher if you do this, but will save you thousands in interest.The tumultuous economy has made it harder to qualify As millions of Americans lost their jobs or were furloughed because of coronavirus-related business closures, lenders went into damage control mode. Many lenders raised the standards borrowers must meet to qualify for a new loan. This included higher minimum credit scores and lower debt-to-income ratios, among other factors. The prospect of an imminent economic recovery is far from certain. While the job market has improved in recent weeks, some states that have reopened their economies have seen a surge in coronavirus cases. “ 'It's always attractive to say 'no cost,' but you might end up paying for it over the life of the loan.' ” - Brian Koss, executive vice president of Mortgage Network \"The V-shaped bounce back was kind of a pipe dream in the first place, and it's looking less and less likely, notwithstanding the recent strong data that we've seen,\" Kapfidze said. \"I've been anticipating that lenders are going to get more and more conservative and restrictive with their lending standards.\" If you were furloughed, laid off or if you're self-employed, it could be harder to get approval for a refinance. In these cases, borrowers may have luck turning to their current lender for a refinance. \"Your current lender is heavily invested in you,\" Kapfidze said. It will cost them money to lose business, so they may be willing to offer homeowners deals on refinancing.If you received forbearance, you may hit roadblocks The CARES Act let millions of Americans take advantage of the ability to claim forbearance from their mortgage payments. But being in a forbearance plan could disqualify a homeowner from certain types of loans. If you skipped payments while in forbearance, you must make at least three current payments after ending the plan to be eligible for a refinance into a loan backed by Fannie Mae FNMA, +0.73%  or Freddie Mac. Also see:Americans are eyeing homes in the suburbs as pent-up demand hits housing market But if you were one of the many Americans who requested forbearance but continued making payments, you will be eligible to refinance right away so long as you stay current on your loan.Finally, don't try to time the market Yes, mortgage rates have fallen to a new record low multiple times this year. But there's no guarantee that trend will continue. \"People are waiting for a rate a half a percent below where we are now relatively - that's getting greedy,\" Koss said. There's a significant upside risk to mortgage rates right now. Their recent drops have largely come after the stock and bond markets have responded to negative news about the coronavirus pandemic. The potential for a second wave remains, and some states are seeing another surge of infections as part of the first wave of the outbreak. But health experts have suggested that a vaccine could come very soon, and researchers have several promising candidates for coronavirus treatments. If a vaccine or treatment for COVID-19 is announced, that would likely cause markets to rally - and mortgage rates to rise in tandem. \"Don't try to time the bottom, just pick the rate that makes the most sense,\" Koss said."}]}