{"article": [{"url": "https://www.marketwatch.com/story/why-you-need-a-coronavirus-care-plan-and-how-to-make-one-2020-07-25", "published": 1595344820.0, "headline": "Why you need a coronavirus care plan and how to make one", "body": "This article is reprinted by permission from NextAvenue.org. Tom Reynolds jokes that his doctors say he’s the “healthiest sick person we know.” The 71-year-old Cocoa, Fla. resident has gone through 20 medical procedures. “I have not been a good steward of my body,” he admits. “My wife and I were thinking ‘What if we get the coronavirus?’ We both have compromised immune systems.” Stress about susceptibility to COVID-19 may actually make a person more prone to illness. One way to manage stress is to take control of your health. Reynolds maintains a sense of control by being proactive. He has been discussing his health and care plans with his loved ones for years. “They’re very familiar with them. I don’t hold anything back,” he says. Reynolds has been clear with his children about his health care and end-of-life wishes. The coronavirus pandemic spurred him to put everything in writing. Through an AARP email, Reynolds learned about Cake, a free web application that guides adults through all stages of health care, estate and memorial planning. Before the pandemic, according to a survey by The Conversation Project (an Institute for Healthcare Improvement initiative to have every person’s wishes for end-of-life care expressed and respected), 92% of people thought planning end-of-life care was important, but only 32% had told others their wishes. Only 18% of people had talked to a doctor. See: The harsh realities of being on a ventilator—Would you want this? What stops people from preparing for the inevitable? “Fear of making a mistake,” says Reynolds.How to get started making a COVID-19 care plan At any stage of life, a medical crisis might render you unable to make health care choices. Because of visitor restrictions to health care facilities during the coronavirus pandemic, it will be harder for family or other advocates to be present. Sometimes decisions have to be made quickly. That said, doctors often don’t know a patient’s wishes. In today’s medical landscape, if you go to the hospital, your primary care doctor probably will not be the one taking care of you. Doctors can change daily, so you need to make your wishes easily accessible. People of all ages have become more interested in making care plans. Advance care planning involves learning about the kinds of health decisions you will need to make, selecting your choices and letting others know. Clear information and a definitive person who can speak on your behalf can help avoid arguments between family members about your wishes. The Conversation Project has starter kits in over 10 languages that can jump start talking to loved ones. When the pandemic hit the U.S., the organization had 43,000 more visits to its site than in the same period in previous years. On April 4, the group released a guide specific to COVID-19. Within two months, it was downloaded 7,607 times. If you or your loved one needs a COVID-19 care plan, here’s how to get started: 1. Think about what is most important should you become seriously ill. If you want to keep decisions from becoming overwhelming, it’s more effective to focus on overall goals rather than specific treatments. How independent do you want to remain? Do you want to be able to communicate with loved ones? Do you want to be free from pain? What makes life meaningful? 2. Pick a person who can be your health care decision maker if you become too sick to care for yourself. This person is called a health care proxy, medical power of attorney or health care agent and will need access to your medical health information. Pick one person so decisions won’t get confusing; it needn’t be a relative or partner. What’s more important is that the person is willing to make decisions for you based on your beliefs and wishes, not theirs. It’s a good idea to have an alternate as a backup, too. The health care proxy should be able to assertively communicate with authority figures such as doctors. Being decisive is a useful trait, since medical decisions often need to be made quickly. Also read: Should you be ‘fair’ with the inheritance you leave to your kids? Once you’ve made the choice, it’s a good idea to let others know, so everyone can get used to the idea. Name an alternate, too. 3. Talk about care planning with your designated health care proxy. Understanding your family life, your upbringing, your favorite activities and your intellectual interests helps the person make decisions that are consistent with your goals. Tell your proxy who you would want them to contact should you become ill. 4. List your health problems, medications and doctors. Even with the ubiquity of electronic medical records, most doctors are missing some information about their patients. Only you know every health provider you see and every medicine you take. 5. Make an appointment to talk to the doctor. Medicare pays for appointments to manage chronic conditions and for discussing advance care plans if you are 65 or older. These kinds of appointments don’t even have to be in person; they can be done via telemedicine. If you’ve filled out a care plan form — like this one from the Centers for Disease Control and Prevention — a physician can review it and make clarifications. Ask your doctor if a POLST, which is more specific than an advance directive, is right for you. And let your doctor know you have a health care proxy. 6. Share and regularly update the information. Every state has free downloadable forms for declaring proxies and making advance directives. If you spend time in more than one state, consider making forms for each state you live in. You usually don’t need a lawyer, just two witnesses who aren’t related. Review it every few years, when you become eligible for Medicare or Medicaid, get married, divorced or get diagnosed with a major illness. A web application like Cake is easy to modify anywhere with internet access. Don’t miss: Retiring during COVID-19? How to cope It’s great to have all this information in a binder, but will it be easy to find? Send documents to your health care proxy, your alternate and your doctor. Email is a great way to do it, so these people can easily save your plan on their computer. And tell family and friends what you’ve done. Dr. Christine Nguyen is a clinical assistant professor at Stanford University Medical School and an online and audio journalist. She was a Gerontological Society of America Journalists in Aging Fellow. Find her on Twitter @christinenguyen and on her website. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}