{"article": [{"url": "https://www.marketwatch.com/story/microsoft-in-advanced-talks-to-buy-tiktoks-us-business-2020-08-01", "published": 1596296780.0, "headline": "Microsoft in advanced talks to buy TikTokâ\u0080\u0099s US business", "body": "Microsoft is in advanced talks to buy the U.S. operations of TikTok, the popular Chinese-owned video app that has been a source of national security and censorship concerns, according to a person familiar with the discussions who spoke only on condition of anonymity because of the sensitivity to the negotiations. The potential deal would be a victory for both companies, making Microsoft Corp. MSFT, +2.48% Â a major player in the social media arena and providing relief to TikTok and its parent company, Bytedance Ltd., a target of President Donald Trumpâ\u0080\u0099s. Trump said Friday that he would take action as soon as Saturday to ban TikTok in the United States. Trumpâ\u0080\u0099s comments on Friday aboard Air Force One came after published reports that the administration is planning to order Chinaâ\u0080\u0099s ByteDance to sell TikTok. â\u0080\u009cAs far as TikTok is concerned, weâ\u0080\u0099re banning them from the United States,â\u0080\u009d Trump told reporters Friday on Air Force One as he returned from Florida. Trump said he could use emergency economic powers or an executive order to enforce the action, insisting, â\u0080\u009cI have that authority.â\u0080\u009d He added, â\u0080\u009cItâ\u0080\u0099s going to be signed tomorrow.â\u0080\u009d Microsoft declined to comment. See: Trump says heâ\u0080\u0099ll act to ban TikTok in US as soon as Saturday Reports by Bloomberg News and the Wall Street Journal citing anonymous sources said the administration could soon announce a decision ordering ByteDance to divest its ownership in TikTok. There have been reports of U.S. tech giants and financial firms being interested in buying or investing in TikTok as the Trump administration sets its sights on the app. The New York Times and Fox Business, citing an unidentified source, first reported Friday that Microsoft is in talks to buy TikTok. TikTok issued a statement Friday saying that, â\u0080\u009cWhile we do not comment on rumors or speculation, we are confident in the long-term success of TikTok.â\u0080\u009d On Saturday it posted a short video from its U.S. General Manager Vanessa Pappas saying that â\u0080\u009cWeâ\u0080\u0099re not planning on going anywhere.â\u0080\u009d ByteDance launched TikTok in 2017, then bought Musical.ly, a video service popular with teens in the U.S. and Europe, and combined the two. A twin service, Douyin, is available for Chinese users. TikTokâ\u0080\u0099s fun, goofy videos and ease of use has made it immensely popular, and U.S. tech giants like Facebook FB, +0.26% Â and Snapchat see it as a competitive threat. It has said it has tens of millions of U.S. users and hundreds of millions globally. But its Chinese ownership has raised concerns about the censorship of videos, including those critical of the Chinese government, and the potential for sharing user data with Chinese officials. TikTok maintains it doesnâ\u0080\u0099t censor videos based on topics sensitive to China and it would not give the Chinese government access to U.S. user data even if asked. The company has hired a U.S. CEO, a former top Disney executive, in an attempt to distance itself from its Chinese ownership. U.S. national-security officials have been reviewing the Musical.ly acquisition in recent months, while U.S. armed forces have banned their employees from installing TikTok on government-issued phones. Secretary of State Mike Pompeo said this month that the U.S. was considering banning TikTok. These national-security worries parallel a broader U.S. security crackdown on Chinese companies, including telecom providers Huawei and ZTE. The Trump administration has ordered that the U.S. stop funding equipment from those providers in U.S. networks. It has also tried to steer allies away from Huawei because of worries about the Chinese governmentâ\u0080\u0099s access to data, which the company has denied it has. The Trump administration has stepped in before to block or dissolve deals on national-security concerns, including stopping Singaporeâ\u0080\u0099s Broadcom AVGO, +0.90% Â from its $117 billion bid for U.S. chipmaker Qualcomm QCOM, +2.06% Â in 2018 in an effort to help retain U.S. leadership in the telecom space. It also told Chinaâ\u0080\u0099s Beijing Kunlun Tech Co. to sell off its 2016 purchase of gay dating app Grindr. Other countries are also taking action against TikTok. India this month banned dozens of Chinese apps, including TikTok, citing privacy concerns, amid tensions between the countries. The U.S. governmentâ\u0080\u0099s poor track record in bolstering Americansâ\u0080\u0099 data privacy more broadly lessens its credibility in taking on Chinese-owned companies, according to Susan Ariel Aaronson, a professor at George Washington University and a data governance and national-security expert. The federal government has not passed broad privacy or data-security legislation despite efforts to do so last year, and the Justice Department has tried to undermine encryption - which makes sure only a sender and receiver can see content they exchange - for law-enforcement reasons. Tech companies have pushed back against that. â\u0080\u009cI continue to be wary of forcing a sale of TikTok without data protection laws they could try to follow,â\u0080\u009d Alex Stamos, the former chief security officer at Facebook who now studies internet security at Stanford University, tweeted on Friday. He added that Microsoft â\u0080\u009chas one of the best child safety teams, which is a larger risk on TikTok right now.â\u0080\u009d Microsoft, which owns LinkedIn, is the No. 4 digital ad company in the U.S., after Google GOOG, +1.97%, Facebook and Amazon AMZN, +3.01% Â . Still, buying TikTok would be a significant change of direction from Microsoft CEO Satya Nadellaâ\u0080\u0099s focus on workplace software that makes people more productive, said technology industry analyst Patrick Moorhead of Moor Insights & Strategy. See also: Microsoft shares do a little jig on possible TikTok acquisition Unlike Google or Facebook, which dominate the digital advertising industry, Microsoft hasnâ\u0080\u0099t been under the intense scrutiny of U.S. politicians and antitrust regulators lately over its market power. Moorhead said that might make it easier to swoop in and acquire TikTok, which poses a competitive threat to social networks like Facebook, Instagram, Googleâ\u0080\u0099s YouTube and Snapchat. Itâ\u0080\u0099s an interesting irony that it was Microsoft at the center of the landmark antitrust case 20 years ago. If the deal goes through, â\u0080\u009cit would definitely make Microsoft a much more competitive advertising system in years to come,â\u0080\u009d said eMarketer analyst Ross Benes. ___"}]}