{"article": [{"url": "https://www.marketwatch.com/story/joe-biden-wants-a-15-minimum-wage-will-the-pandemic-make-that-more-likely-to-happen-11595538549", "published": 1595663000.0, "headline": "Joe Biden wants a $15 minimum wage â\u0080\u0094 will the coronavirus pandemic make that more likely?", "body": "Former Vice President Joe Biden supported raising the federal minimum wage to $12 an hour back in 2015. He has campaigned for president on the promise to raise the minimum wage to $15 an hour. Andrew Burton/Getty Images A $15-an-hour federal minimum wage has long been on many Democratic lawmakersâ\u0080\u0099 wish lists. They could have the chance to cross that goal off their lists come November with former Vice President Joe Biden ahead of President Donald Trump in several recent polls. Even before the pandemic, in Bidenâ\u0080\u0099s first official campaign speech, he promised to raise the federal minimum wage to $15 an hour if elected president. The federal minimum wage has been $7.25 an hour since 2009, which comes out to roughly $15,000 a year for someone working 40 hours a week. The conversation around increasing the minimum wage has shifted as the pandemic has highlighted the lack of labor protections, such as paid sick leave and hazard pay, for essential workers who risk their health and are typically paid low wages. Also see: Just 3 in 10 people working outside the home get hazard pay, despite â\u0080\u0098pervasive fearâ\u0080\u0099 of bringing coronavirus home The term â\u0080\u009cessential workerâ\u0080\u009d describes the group of workers that were called to work in person when the majority of the economy was shutdown to curb the spread of coronavirus.Â Essential workers typically work in fields such as transportation, food and health care administration, according to the Brookings Institution, a left-leaning policy think tank. In total 48 million Americans are essential workers, making up roughly 43% of the U.S. workforce, Brookings found. Some 4.3 million essential workers in the U.S. earn under $10 an hour. â\u0080\u009cAll told, more than 57.1 percent of essential front-line workers earn less than $20 per hour,â\u0080\u009d Brookings found. Essential workers are more likely to be people of color: 16% of essential workers are Black and 21% are Hispanic, compared to all other sectors of the workforce, where 10% of workers are Black and 15% are Hispanic. Kim Cordova, president of United Food and Commercial Workers Union Local 7,Â a union that represents more than 25,000 people based in Wyoming and Colorado who work at meatpacking sites and in grocery stores, said more than 400 members have contracted coronavirus. â\u0080\u009cTheir employers failed to adequately protect them â\u0080\u0094 treating them as disposable while our nation labels them essential,â\u0080\u009d she said. â\u0080\u009cOf our nine deceased union members, eight were people of color and one was a white woman with Down Syndrome.â\u0080\u009d “ â\u0080\u0098Of our nine deceased union members, eight were people of color and one was a white woman with Down Syndromeâ\u0080\u0099 ” â\u0080\u0094 Kim Cordova, president of United Food and Commercial Workers Union Local 7 â\u0080\u009cWhat this pandemic has done is reinforce that our economic system is broken and companies are fueling racial and economic inequity by failing to provide fair wages,Â or even basic workplace safety,â\u0080\u009d Cordova said. â\u0080\u009cCompanies must recognize they cannot return to business as usual, and essential workers deserve at least $15 an hour since they put their lives at risk, and that of their families, every day.â\u0080\u009d On Monday, thousands of workers across 160 cities participated in Strike for Black Lives, a protest to call attention to systemic racism and â\u0080\u009cunfairâ\u0080\u009d working conditions that disproportionately impact Black Americans, according to the organizers of the protest. Bettie Douglas, a McDonaldâ\u0080\u0099s MCD, -0.43% worker and a leader in the Fight for $15 and a Union, a campaign launched in 2012 by American fast food workers to push for a higher minimum wage, participated in a Strike for Black Lives demonstration in Saint Louis, Mo. on Monday. “ â\u0080\u0098Weâ\u0080\u0099re currently facing a public health emergency, an economic downturn, and a crisis of systemic racism that has led communities of color to suffer disproportionately from the impacts of COVID-19â\u0080\u0099 ” â\u0080\u0094 Bettie Douglas, a McDonaldâ\u0080\u0099s worker and leader in the Fight for $15 and a Union â\u0080\u009cThe pandemic has shown us just how important making a living wage of $15 an hour is to sustaining families,â\u0080\u009d Douglas, who makes $10 an hour working at McDonaldâ\u0080\u0099s, said. â\u0080\u009cWeâ\u0080\u0099re currently facing a public health emergency, an economic downturn, and a crisis of systemic racism that has led communities of color to suffer disproportionately from the impacts of COVID-19.â\u0080\u009d Bettie Douglas, pictured, is a leader of Fight for $15 and a Union. She also works for McDonald's in Saint Louis, Mo. where she earns $10 an hour. Fight for $15 and a Union â\u0080\u009cWe deserve at least $15 an hour with pandemic pay and a voice on the job so that we can work with companies like McDonaldâ\u0080\u0099s to improve the working conditions for all workers â\u0080\u0094 regardless of race, gender, or immigration status,â\u0080\u009d Douglas told MarketWatch in a statement. A McDonaldâ\u0080\u0099s USA spokesperson told MarketWatch that â\u0080\u009cthe average starting wage at U.S. corporate-owned restaurants is over $10 per hour and exceeds the federal minimum wage.â\u0080\u009d â\u0080\u009cMcDonaldâ\u0080\u0099s believes elected leaders have a responsibility to set, debate and change mandated minimum wages and does not lobby against or participate in any activities opposing raising the minimum wage.â\u0080\u009dRaising the minimum wage to $15 could cost 1.3 million jobs Last year, House Democrats passed the Raise the Wage Act, a bill that would increase the federal minimum wage to $15 an hour. The Congressional Budget Office, a nonpartisan branch of government, found that raising the wage to $15 an hour by 2025 â\u0080\u009cwould boost the wages of 17 million workers who would otherwise earn less than $15 per hour.â\u0080\u009dÂ The downside, however, is that 1.3 million workers could become unemployed as a result, according to the CBOâ\u0080\u0099s median estimate. “ â\u0080\u0098What will help businesses when itâ\u0080\u0099s safe for them to reopen is not a low minimum wage. Itâ\u0080\u0099s increased consumer demand that comes from raising wages and unemployment benefits that put cash in peopleâ\u0080\u0099s hands.â\u0080\u0099 ” â\u0080\u0094 Tsedeye Gebreselassie, an attorney at the National Employment Law Project Members of Bidenâ\u0080\u0099s campaign team did not respond to a request for a comment as to whether Biden has a plan to protect some of the jobs that could be eliminated as a result of a $15 minimum wage. Ahead of the Houseâ\u0080\u0099s vote to pass the Raise the Wage Act last July, the U.S. Chamber of Commerce, a lobbying group for businesses,Â said it â\u0080\u009cstrongly opposedâ\u0080\u009d raising the minimum wage to $15 an hour, citing the CBOâ\u0080\u0099s report. The Chamber did, however, say it supports raising the minimum wage to $10 because it â\u0080\u009cwould result in few, if any, job losses.â\u0080\u009d The CBOâ\u0080\u0099s report, which was published in July 2019, naturally doesnâ\u0080\u0099t capture the economic impact of the pandemic, which has put the U.S. and other countries into a recession. “ The Congressional Budget Office concluded that raising the wage to $15 an hour by 2025 â\u0080\u0098would boost the wages of 17 million workersâ\u0080\u0099 ” As a result of the recession, more than 30 million Americans have lost their jobs, pushing the unemployment rate to over 11%. That wonâ\u0080\u0099t necessarily make it more difficult to enact a $15 federal minimum wage, Tsedeye Gebreselassie, an attorney at the National Employment Law Project,Â an advocacy organization focused on workersâ\u0080\u0099 rights, said. â\u0080\u009cAny time thereâ\u0080\u0099s talks of raising the federal minimum wage, opponents will say â\u0080\u0098nowâ\u0080\u0099s not the time,'â\u0080\u009d Gebreselassie said. At the same time, the majority of Democratic and Republican voters are in favor of raising the minimum wage, according to a survey conducted by Pew Research last year. â\u0080\u009cWhat will help businesses when itâ\u0080\u0099s safe for them to reopen is not a low minimum wage,â\u0080\u009d Gebreselassie said. â\u0080\u009cItâ\u0080\u0099s increased consumer demand that comes from raising wages and unemployment benefits that put cash in peopleâ\u0080\u0099s hands.â\u0080\u009d"}]}