{"article": [{"url": "https://www.marketwatch.com/story/top-house-democrats-alarmed-by-federal-tactics-against-portland-protesters-2020-07-19", "published": 1595177840.0, "headline": "Top House Democrats â\u0080\u0098alarmedâ\u0080\u0099 by federal tactics against Portland protesters", "body": "PORTLAND, Ore. â\u0080\u0094 Top leaders in the U.S. House said Sunday they were â\u0080\u009calarmedâ\u0080\u009d by the Trump administrationâ\u0080\u0099s tactics against protesters in Portland, Oregon, and other cities, including Washington, D.C., and called on federal inspectors general investigate. â\u0080\u009cThis is a matter of utmost urgency,â\u0080\u009d wrote House Judiciary Committee Chairman Jerrold Nadler, D-New York, Homeland Security Committee Chairman Bennie G. Thompson, D-Mississippi, and Oversight and Reform Committee Chairwoman Carolyn B. Maloney, D-New York, in a letter to the inspectors general of Department of Justice and Department of Homeland Security. The Democratic lawmakers are seeking an investigation â\u0080\u009cinto the use of federal law enforcement agencies by the Attorney General and the Acting Secretary of Homeland Security to suppress First Amendment protected activities in Washington, D.C., Portland, and other communities across the United States.â\u0080\u009d The mayor of Oregonâ\u0080\u0099s largest city said Sunday the presence of federal agents is exacerbating tensions in Portland, which has seen nearly two months of nightly protests since the killing of George Floyd in Minneapolis. Speaking on CNNâ\u0080\u0099s â\u0080\u0098State of the Union,â\u0080\u0099 Democratic Mayor Ted Wheeler said federal officers â\u0080\u009care not wanted here. We havenâ\u0080\u0099t asked them here. In fact, we want them to leave.â\u0080\u009d President Donald Trump has decried the demonstrations, and Homeland Security Secretary Chad Wolf blasted the protesters as â\u0080\u009clawless anarchistsâ\u0080\u009d in a visit to the city on Thursday. â\u0080\u009cWe are trying to help Portland, not hurt it,â\u0080\u009d Trump tweeted Sunday. â\u0080\u009cTheir leadership has, for months, lost control of the anarchists and agitators. They are missing in action. We must protect Federal property, AND OUR PEOPLE. These were not merely protesters, these are the real deal!â\u0080\u009d Late Saturday, protesters broke into a building, set it on fire and started dumpster fires, police said. The fire at the Portland Police Association building was put out a short time later, Portland police said on Twitter. The department declared the gathering a riot, and began working to clear the downtown area. â\u0080\u009cAs the crowd was dispersed, several people in the crowd were arrested and officers were able to extinguish the fire. Portland Police did not use any CS gas,â\u0080\u009d the bureau said in a statement early Sunday. Tear gas was deployed, according to pictures and video from the scene, but it was not necessarily CS gas. Fencing that had been placed around the federal courthouse had also been removed by protesters and made into barricades, police tweeted. Police said protesters had gathered Saturday evening at the Portland Police Bureauâ\u0080\u0099s North Precinct, vandalizing patrol vehicles and taunting officers as they reported for work. Later, as police dispersed a group that had gathered near North Interstate Avenue, people threw rocks and paint-filled balloons at officers. Some were injured, the statement said. Before the aggressive language and action from federal officials, the unrest had frustrated Wheeler and other local authorities, who had said a small cadre of violent activists were drowning out the message of peaceful protesters in the city. But Wheeler said the federal presence in the city is now exacerbating a tense situation. â\u0080\u009cWhat weâ\u0080\u0099re seeing is a blatant abuse of police tactics by the federal government, Wheeler said Sunday. Oregon Attorney General Ellen Rosenblum sued Homeland Security and the Marshals Service in federal court late Friday. The complaint said unidentified federal agents have grabbed people off Portlandâ\u0080\u0099s streets â\u0080\u009cwithout warning or explanation, without a warrant, and without providing any way to determine who is directing this action.â\u0080\u009d Rosenblum said she was seeking a temporary restraining order to â\u0080\u009cimmediately stop federal authorities from unlawfully detaining Oregonians.â\u0080\u009d However, federal officers and Portland police advanced simultaneously on demonstrators to clear the streets early Saturday, making arrests as protesters threw bottles and pieces of metal fencing. The action by Portlandâ\u0080\u0099s police was condemned by Jo Ann Hardesty, a prominent member of the City Council. Hardesty said Saturday that local police â\u0080\u009cjoined in the aggressive clampdown of peaceful protest.â\u0080\u009d Hardesty also slammed Wheeler, telling the mayor he needed to better control local law enforcement. Hardesty, who oversees the cityâ\u0080\u0099s fire department and other first-responder agencies, said in an open letter to Wheeler if â\u0080\u009cyou canâ\u0080\u0099t control the police, give me the Portland Police Bureau.â\u0080\u009d In a statement Saturday, Portland Police said as they responded to the overnight protests some federal agencies took action â\u0080\u009cunder their own supervision and direction.â\u0080\u009d Portland Police said city officers arrested seven people, and one officer sustained a minor injury."}]}