{"article": [{"url": "https://www.marketwatch.com/story/fauci-says-public-should-temper-expectations-on-covid-19-vaccine-as-us-infections-near-5-million-2020-08-09", "published": 1597233620.0, "headline": "Dr. Fauci tells Americans to be mindful of these important limitations about any future coronavirus vaccine", "body": "Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for the last three decades and an expert on pandemics for the last four decades, has been optimistic on a vaccine arriving at the end of 2020 or in early 2021, but he has also cautioned the public on their expectations for the effectiveness of any vaccine that is developed. “The chances of it being 98% are not great, which means you must never abandon the public-health approach,” Fauci told a recent live streamed Q&A hosted by Brown University. “You’ve got to think of a vaccine as a tool to be able to get a pandemic to no longer be a pandemic, but to be something that’s well-controlled.” “What I’m shooting for is that, with a vaccine and good public-health measures, we can bring it down to somewhere between really good control and elimination,” he told Abdullah Shihipar, a public-health research associate at Brown in the interview. “So that’s what a vaccine is going to do, but it’s not going to do that alone.” “ ‘The chances of it being 98% are not great. Which means you must never abandon the public-health approach.’ ” — Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases Fauci has said he was hopeful that a coronavirus vaccine could be developed by early 2021, but has previously said it’s unlikely that a vaccine will deliver 100% immunity; he said the best realistic outcome, based on other vaccines, would be 70% to 75% effective. The measles vaccine, he said, is among the most effective by providing 97% immunity. Reviews of past studies have found that, on average, the flu vaccine is about 50% to 60% effective for healthy adults who are between 18 and 64 years old, according to a review of studies by the Mayo Clinic. “The vaccine may sometimes be less effective,” it said. “Even when the vaccine doesn’t completely prevent the flu, it may lessen the severity of your illness.” Fauci advocates face masks, social distancing and avoiding bars and indoor spaces with crowds. “If we do those things — and I’m going to repeat it until I’m exhausted — those things work,” he said on Friday’s live stream. “When you have something that needs everybody pulling at the same time, if you have one weak link in there that doesn’t do it, it doesn’t allow you to get to the end game.” Stephen Hahn, commissioner of the Food and Drug Administration, said last month that the agency would green light a coronavirus vaccine as long as it’s 50% effective. “We all want a vaccine tomorrow, that’s unrealistic, and we all want a vaccine that’s 100% effective, again unrealistic. We said 50%.” Hahn added, “That was a reasonable floor given the pandemic.” As people get used to living with coronavirus, social distancing and mask protocols are also easing. The U.S. has the world’s highest number of COVID-19 cases (5,151,369) and deaths (164,690), followed by Brazil (103,026), Mexico (53,929) and the U.K. (46,611). As of Wednesday, there have been 20,391,697 confirmed cases of coronavirus worldwide and 741,423 deaths. The Dow Jones Industrial Index DJIA, +0.56%, S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% were trading up Wednesday as investors awaited progress on round two of a fiscal stimulus during the coronavirus pandemic. The number of coronavirus cases is still rising in every region of the country. With 10,649 deaths, California is now the third U.S. state to register over 10,000 deaths after New York (32,787 deaths) and New Jersey (15,890 deaths). Texas has the fourth highest number of fatalities (9,225). Related: Feeling lax about masks? Think again. Here’s how many lives could be saved if everyone wore a mask — starting today President Trump signed four executive orders on Saturday that include extending unemployment benefits after Congress failed to reach a deal on a stimulus package. In the absence of a vaccine, health experts say social distancing and masks are the only alternative as “herd immunity” — where those who are immune protect the most vulnerable in the population — is not feasible for coronavirus. That requires a very high level of population immunity for COVID-19, the disease caused by the virus SARS-CoV-2, and for the virus to not mutate. “None of those seem to be operational at present,” Gregory Poland, who studies the immunogenetics of vaccines at the Mayo Clinic, told MarketWatch in April. “With influenza, you need herd immunity of 60% to 70%. With measles, you need about 95%. With COVID-19, it’s somewhere in the middle,” he said. “What we’ve seen during the pandemic is a lot of preprints and press releases,” Hahn said in a separate interview with the medical journal JAMA. “We can’t make a decision based upon a preprint or a press release, and that’s because we insist upon seeing all of the raw clinical trial data.” Traditionally, such research goes through a peer-review vetting process before publication. “ ‘With influenza, you need herd immunity of 60% to 70%. With measles, you need about 95%. With COVID-19, it’s somewhere in the middle.’ ” — Gregory Poland, who studies the immunogenetics of vaccines at the Mayo Clinic In the meantime, the public should continue to wear masks, authorities say. America’s COVID-19 death toll in the U.S. could reach nearly 300,000 by Dec. 1, but consistent mask-wearing beginning today could save approximately 70,000 lives, according to projections released last week from the Institute for Health Metrics and Evaluation at the University of Washington’s School of Medicine. “It appears that people are wearing masks and socially distancing more frequently as infections increase, then after a while as infections drop, people let their guard down and stop taking these measures to protect themselves and others which, of course, leads to more infections,” HME director Christopher Murray said, “and the potentially deadly cycle starts over again.” In April — after two months of obfuscation over the efficacy of face masks, during which New York City became the epicenter of the pandemic in the U.S., and one month after the WHO declared the COVID-19 outbreak a pandemic — U.S. federal authorities did a U-turn and said all Americans should, after all, wear face coverings in public settings, and be aware of asymptomatic carriers. So how contagious is someone who has contracted COVID-19 — yet displays no symptoms? This study, published in the medical journal JAMA Internal Medicine this week, provides one theory for the first question. It isolated 303 patients with COVID-19 in a treatment center in South Korea. Of those, 110 (36%) were asymptomatic and 21 (19%) developed symptoms during isolation. What they found: “Many individuals with SARS-CoV-2 infection remained asymptomatic for a prolonged period, and viral load was similar to that in symptomatic patients,” the scientists concluded. “Therefore, isolation of infected persons should be performed regardless of symptoms.” The researchers analyzed swabs taken from the group between March 6 and March 26."}]}