{"article": [{"url": "https://www.marketwatch.com/story/donald-trump-likes-to-say-were-making-tremendous-progress-one-look-at-this-chart-tells-a-different-story-2020-07-28", "published": 1595946620.0, "headline": "Donald Trump likes to say we're making 'tremendous progress' - one look at this chart tells a different story", "body": "As Donald Trump sees it, progress in the fight against the coronavirus can be described in several ways. \"Big! Tremendous! Exciting! Encouraging! Significant! Incredible!\" Others might use \"Not nearly enough!\" but, hey, that's clearly not the president's style. He prefers the rosy superlatives, even if the circumstances might call for some sobering language. Twitter user Invictus, a markets veteran and contributor to \"The Big Picture\" blog, juxtaposed those \"great\" strides Trump has trumpeted over the past few months against the mounting death toll from COVID-19 in the United States. If you've been paying attention, you won't be surprised: iframe.twitter-tweet { width: 100% !important; } There's no \"superb\" on the chart, but that didn't stop New York Democrat Hakeem Jefferies from grilling AG Bill Barr over that use of the word to describe Trump's coronavirus response: iframe.twitter-tweet { width: 100% !important; } In recent days, Trump struck a more realistic tone, saying last week he expects the pandemic to \"get worse before it gets better.\" He also shifted from months of playing down the virus by endorsing the use of masks, though his critics contend it was PR spin in reaction to dismal poll numbers. Alas, the new Trump didn't seem to last long, considering he retweeted a video claiming masks are of no use, while touting hydroxychloroquine. It was pulled from Facebook FB, +0.26%  , Twitter TWTR, -0.23% and Google GOOG, +1.97% for spreading misinformation. Meanwhile, the U.S. tally for confirmed cases of COVID-19 climbed above 4.30 million on Tuesday, and the death toll exceeded 148,000, after Texas became the fourth state with more than 400,000 cases, joining California, Florida and early hot spot New York. The U.S. counted another 1,000 COVID-19 fatalities on Monday for a sixth straight day, according to data aggregated by Johns Hopkins University."}]}