{"article": [{"url": "https://www.marketwatch.com/story/treasury-ramps-up-debt-issuance-across-entire-u-s-bond-market-for-third-quarter-11596635415", "published": 1596621500.0, "headline": "Treasury ramps up debt issuance across entire U.S. bond market for third quarter", "body": "Photo by OLIVIER DOULIERY/AFP via Getty Images The U.S. Treasury Department announced Wednesday it will sell a record $112 billion in notes and bonds next week at its quarterly refunding auction. This is $16 billion larger than the package announced last quarter. The department said it would increase auction sizes across the yield curve and especially for longer-term maturities as it looks to finance the response to the COVID-19 pandemic. Analysts have called for the Treasury to sell more longer-dated bonds to take advantage of the low interest-rate environment. The department will auction $48 billion in 3-year notes on Aug. 11 and $38 billion in 10-year notes on Aug. 12. They government will also sell $26 billion in 30-year bonds on Aug. 13. The department also announced a $6 billion increase to the auction sizes of the 2-year, 3-year, and 5-year note this quarter. Meanwhile, the 7-year note will increase by $9 billion. As a result, issuance will increase by $132 billion between August and October, compared to the previous quarter. See: Treasury sees $2 trillion in borrowing over the rest of the year “The U.S. Treasury was aggressive yet again in growing coupon issuance, pushing multiple tenors further into record territory as it terms out financing the deficit and COVID-related stimulus,” said Jon Hill, an interest-rate strategist at BMO Capital Markets and a former Treasury Department staffer. Recent debt sales suggest the market has taken the increased issuance in stride as the lingering worries over the global economy’s health have drawn domestic and foreign investors to U.S. debt. Still, the announcement weighed on values of longer-dated government bonds on Wednesday, even as labor-market data showed U.S. private sector employers had added less jobs than forecast. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 2.8 basis points to 0.541%, while the 30-year bond rate TMUBMUSD30Y, 1.576% climbed 4 basis points to 1.231%. Bond prices move inversely to yields."}]}