{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-skid-lower-as-weekly-jobless-claims-fall-below-1-million-2020-08-13", "published": 1597328660.0, "headline": "Gold notches back-to-back gain after brief dip in the wake of a fall in weekly U.S. jobless claims", "body": "Gold futures notched a back-to-back gain on Thursday, after taking a brief dip in the wake of weekly U.S. jobless claims data that showed a fall below one million for the first time since the coronavirus pandemic began almost five months ago. The slight improvement from 1.19 million jobless claims at the end of July is somewhat of a bearish development for haven seekers. New applications for unemployment benefits, a rough gauge of layoffs, declined to 963,000, the Labor Department said Thursday. It was the second straight large decline and the first below one million in more than 20 weeks. Gold futures fell briefly below $1,930 an ounce immediately after the jobless claims data, then saw a bumpy ride higher. “ ‘A pullback this week is not unexpected and even hoped for by some as profit taking, price retracement and consolidation potentially set the stage for further upside.’ ” — Will Cai, Wilshire Phoenix Funds “In these uncertain times, we expect gold prices to be volatile,” said Will Cai, partner and head of Wilshire Phoenix Funds. “A pullback this week is not unexpected and even hoped for by some as profit taking, price retracement and consolidation potentially set the stage for further upside,” he told MarketWatch. December gold GCZ20, +2.17% GC00, +2.17% climbed $21.40, or 1.1%, to settle at $1,970.40 an ounce, after tapping an intraday low of $1,923. Prices for the contract remained lower for the week, down more than 3% from last Friday’s settlement, according to FactSet data. Despite the reduction in jobless claims, some experts say that gold has managed to hold its ground because claims still remain elevated from the pre-pandemic levels. “The reason that we have not seen any substantial selloff in the gold price is because this U.S. initial jobless claims are still very high as compared to normal number,” wrote Naeem Aslam, chief market analyst at AvaTrade in a daily note. “The initial jobless claims number was much better than the market anticipation and this has pushed the equity futures higher,” he wrote. “The fact is that the U.S. economy has become more resilient to pandemic and it is trying its best to find its way out,” he said. For now, Cai thinks investors should “look to gold not as a short term bet, but a long term portfolio hedge and diversifier.” Meanwhile, silver prices Thursday outperformed gold, with September silver US:SIU20 tacking on $1.74, or 6.7%, to end at $27.718 an ounce, after retreating 0.3% a day ago. The day’s percentage rise was the largest since July 27, according to FactSet data. September copper US:HGU20 fell by 2.9% to $2.807 a pound. October platinum PLV20, +3.99% rose 2.5% to $983 an ounce and September palladium US:PAU20 settled at $2,216.80 an ounce, up 2.2%."}]}