{"article": [{"url": "https://www.marketwatch.com/story/bankrupt-hertz-files-to-sell-shares-that-could-bes-2020-06-15", "published": 1592228060.0, "headline": "Bankrupt Hertz files to sell shares that could be â\u0080\u0098worthlessâ\u0080\u0099", "body": "Potential investors in Hertz Global Holdings Inc.sâ\u0080\u0099 share offering canâ\u0080\u0099t say they havenâ\u0080\u0099t been warned. In fact, the word â\u0080\u009cworthlessâ\u0080\u009d appears five times in Hertzâ\u0080\u0099s HTZ, -1.78% Â Monday filing to sell up to $500 million worth of shares, always in connection with the car-rental companyâ\u0080\u0099s stock. The U.S. Securities and Exchange Commission filing, studded with other dire warnings, was also notable for what it didnâ\u0080\u0099t have: Any details about a reorganization plan. Investors were surprised last week when Hertz asked a bankruptcy court to issue stock, and perhaps more surprised when the court late Friday agreed to let the deal go forward. The company entered bankruptcy protection late last month, drowning in nearly $20 billion in debt and hit hard by the global restrictions on travel designed to slow the spread of the coronavirus illness COVID-19 and also deprived of most of its â\u0080\u009cloaner carâ\u0080\u009d revenue due to less driving and fewer accidents. The buyer-beware warnings in Mondayâ\u0080\u0099s filing come early on. The documentâ\u0080\u0099s sixth paragraph warns that the company is under a â\u0080\u009cprocess of a reorganization under chapter 11 of title 11, or Chapter 11, of the United States Code, or Bankruptcy Code, which has caused and may continue to cause our common stock to decrease in value, or may render our common stock worthless.â\u0080\u009d A variation of that last sentence reappears four more times. See also:Mad dash for cash drives biggest month for follow-on offerings since the financial crisis It also mentions, of course, the delisting notice received from the New York Stock Exchange on May 26, a few days after Hertzâ\u0080\u0099s May 22 bankruptcy filing. Hertz has appealed the determination and said its newly issued stock will continue to be listed and trade on the NYSE pending resolution of such appeal. â\u0080\u009cWe cannot provide any assurance as to the ultimate resolution of the appeal,â\u0080\u009d it said in the filing. Hertz goes on to say that it has not yet negotiated a reorganization plan with its creditors. Back in May, it restored executive pay to pre virus-related belt-cinching levels, except for Chief Executive Kathryn V. Marinello, who agreed to a 10% salary reduction and previously had forgone her base salary. That was due to the â\u0080\u009cmagnitude of the effortâ\u0080\u009d to fend off the eventual bankruptcy filing. The company also gave millions in executive bonuses ahead of the bankruptcy filing. If it is unable to hatch one that would enable it to remain a going concern, its bankruptcy process could end in asset liquidation for distribution to creditors. â\u0080\u009cHolders of our common stock would lose their entire investment in a Chapter 7 bankruptcy.â\u0080\u009d Hertz on Friday topped a popularity chart among Robinhood app users, but by Monday it had fallen to No. 45 â\u0080\u0094 Ford Motor Co. F, -1.36%, General Electric Co. GE, +2.85%, and American Airlines Group Inc. AAL, +0.34% Â held the top 3 spots. The stock has gained 123% this month alongside its newfound popularity. So far this year, itâ\u0080\u0099s down 85%, compared with losses of 6.3% and 11% for the S&P 500 index SPX, +0.87% Â and the Dow Jones Industrial Average. DJIA, +0.56% Â One of the largest pieces of the Hertzâ\u0080\u0099s puzzle is what happens with Hertzâ\u0080\u0099s fleet of some half million rental cars, and whether holders of its asset-backed securities will be paid. â\u0080\u009cSome critical items have not seen much transparency yet,â\u0080\u009d analysts at CreditSights said in a note late Sunday. The ABS issues will not only be significant for Hertz but also â\u0080\u009cbring a range of potential knock-on effects for the car rental industry and notably peer (Avis Budget Group Inc. CAR, +1.28% ),â\u0080\u009d the analysts said. Whether Hertz strikes a deal for its ABS could determine â\u0080\u009cfleet size, fleet liquidation risk, cash flow use, and potential haircuts to bondholder recovery rates,â\u0080\u009d the analysts said. ABS issuers in the past have stood behind their bonds, one of the reasons why the sector is considered a haven in corporate debt. Hertzâ\u0080\u0099s most widely traded October 2022 corporate bonds were changing hands at an average price of about 43.84 cents on the dollar Monday, a plunge from nearly 100 cents on the dollar at the start of March, according to bond trading and pricing platform MarketAxess. Bonds often are considered distressed once they trade below 70 cents on the dollar. Joy Wiltermuth contributed to this article."}]}