{"article": [{"url": "https://www.marketwatch.com/story/president-trump-visits-site-of-kenosha-protests-in-wisconsin-2020-09-01", "published": 1598977520.0, "headline": "Trump lays blames with Democrats as he surveys â\u0080\u0098destructionâ\u0080\u0099 in Kenosha, Wis.", "body": "KENOSHA, Wis. (AP) â\u0080\u0094 President Donald Trump dove into the latest eruption in the nationâ\u0080\u0099s reckoning over racial injustice on Tuesday, visiting the â\u0080\u009cdestructionâ\u0080\u009d left by rioters in Kenosha, Wis., and declaring that it had been enabled by Democratic leaders. Soon after arriving in the city, a visit made over the objections of state and local leaders, Trump toured the charred remains of a block besieged by violence and fire. He spoke to the owners of a century-old furniture store that had been destroyed and blasted the Democrats in charge of Kenosha and Wisconsin. â\u0080\u009cThey just donâ\u0080\u0099t want us to come in and then destruction is done,â\u0080\u009d said Trump, who has offered to send in federal enforcement. â\u0080\u009cThese governors donâ\u0080\u0099t want to call and the mayors donâ\u0080\u0099t want to call. They have to ask.â\u0080\u009d The city has been riven by protests since the Aug. 23 shooting of Jacob Blake, a Black man hit seven times in the back by police as he was getting into a car while they were trying to arrest him. On the eve of his visit, Trump defended a teenage supporter accused of fatally shooting two men at a demonstration in Kenosha last week and accused Democrat Joe Biden of siding with â\u0080\u009canarchistsâ\u0080\u009d and â\u0080\u009criotersâ\u0080\u009d in the unrest. Trumpâ\u0080\u0099s motorcade passed a mix of supporters, many holding American flags, and protesters, some carrying signs that read Black Lives Matter. As a massive police presence, complete with several armored vehicles, secured the area, barricades were set up along several of the cityâ\u0080\u0099s major thoroughfares to keep onlookers some distance from the passing presidential vehicles. Wisconsinâ\u0080\u0099s Democratic governor, Tony Evers, who deployed the National Guard to quell demonstrations in response to the Blake shooting, had pleaded with Trump to stay away for fear of straining tensions further. â\u0080\u009cI am concerned your presence will only hinder our healing,â\u0080\u009d Evers wrote in a letter to Trump. â\u0080\u009cI am concerned your presence will only delay our work to overcome division and move forward together.â\u0080\u009d Biden has assailed Trump over the deadly protests that have sprung up on his watch. But Trump, claiming the mantle of the â\u0080\u009claw and orderâ\u0080\u009d Republican candidate, has been vocal in supporting law enforcement and offered himself as the leader best positioned to keep Americans safe. He insisted his appearance in Kenosha would â\u0080\u009cincrease enthusiasmâ\u0080\u009d in Wisconsin, perhaps the most hotly contested battleground state in the presidential race, as the White House said he â\u0080\u009cwants to visit hurting Americans.â\u0080\u009d The White House said Trump was not going to meet with Blakeâ\u0080\u0099s family. Blakeâ\u0080\u0099s family planned a Tuesday â\u0080\u009ccommunity celebrationâ\u0080\u009d to correspond with Trumpâ\u0080\u0099s visit. â\u0080\u009cWe donâ\u0080\u0099t need more pain and division from a president set on advancing his campaign at the expense of our city,â\u0080\u009d Justin Blake, an uncle, said in a statement. â\u0080\u009cWe need justice and relief for our vibrant community.â\u0080\u009d The NAACP said Tuesday neither candidate should visit the Wisconsin city as tension simmers. Bidenâ\u0080\u0099s team has considered a visit to Kenosha and has indicated that a trip to Wisconsin was imminent but has not offered details. Biden, in his most direct attacks yet, accused Trump earlier Monday of causing the divisions that have ignited the violence. He delivered an uncharacteristically blistering speech in Pittsburgh and distanced himself from radical forces involved in altercations. Biden said of Trump: â\u0080\u009cHe doesnâ\u0080\u0099t want to shed light, he wants to generate heat, and heâ\u0080\u0099s stoking violence in our cities. He canâ\u0080\u0099t stop the violence because for years heâ\u0080\u0099s fomented it.â\u0080\u009d Trump, for his part, reiterated that he blames radical troublemakers stirred up and backed by Biden. But when he was asked about one of his own supporters who was charged with killing two men during the mayhem in Kenosha, Trump declined to denounce the killings and suggested that the 17-year-old suspect, Kyle Rittenhouse, was acting in self-defense. After a confrontation in which he fatally shot one man, police say, Rittenhouse fell while being chased by people trying to disarm him. A second person was shot and killed. â\u0080\u009cThat was an interesting situation,â\u0080\u009d Trump said Monday during a news conference. â\u0080\u009cHe was trying to get away from them, I guess, it looks like, and he fell. And then they very violently attacked him. ... He was in very big trouble. He would have been â\u0080\u0094 he probably wouldâ\u0080\u0099ve been killed.â\u0080\u009d After Trumpâ\u0080\u0099s defense of Rittenhouse, Biden laced into his response, saying in a statement: â\u0080\u009cTonight, the president declined to rebuke violence. He wouldnâ\u0080\u0099t even repudiate one of his supporters who is charged with murder because of his attacks on others. He is too weak, too scared of the hatred he has stirred to put an end to it.â\u0080\u009d The president also suggested that some police officers â\u0080\u009cchokeâ\u0080\u009d when faced with challenging situations and offered an odd comparison, likening them to golfers who â\u0080\u009cmiss a 3-foot putt.â\u0080\u009d Trump and his campaign team have seized upon the unrest in Kenosha, as well as in Portland, Oregon, where a Trump supporter was shot and killed, leaning hard into a defense of law and order while suggesting that Biden is beholden to extremists. Trump, en route to Wisconsin, lamented the shooting in Oregon and again tried to link the violence to Democratic leadership. Trump aides believe that tough-on-crime stance will help him with voters and that the more the national discourse is about anything other than the coronavirus, the better it is for the president. In the interview with Fox, Trump insisted that if he were not president, â\u0080\u009cyou would have riots like youâ\u0080\u0099ve never seen.â\u0080\u009d Key Words:Three of the buzziest moments from Trumpâ\u0080\u0099s interview with Fox News host Laura Ingraham Protests in Kenosha began the night of Blakeâ\u0080\u0099s shooting, Aug. 23 and were concentrated in the blocks around the county courthouse downtown. The first three nights, more than 30 fires were set and numerous businesses were vandalized. There was an estimated $2 million in damage to city property, and Kenoshaâ\u0080\u0099s mayor has said he is seeking $30 million from the state to help rebuild. The violence reached its peak the night of Aug. 25, two days after Blake was shot, when police said a 17-year-old armed with an illegal semiautomatic rifle shot and killed two protesters in the streets. Since then marches organized both by backers of police and Blakeâ\u0080\u0099s family have all been peaceful with no vandalism or destruction to public property. In Pittsburgh, Biden resoundingly condemned violent protesters and called for their prosecution â\u0080\u0094 addressing a key Trump critique. And the former vice president also tried to refocus the race on what has been its defining theme â\u0080\u0094 Trumpâ\u0080\u0099s handling of the coronavirus pandemic, which has left more than 180,000 Americans dead â\u0080\u0094 after a multiday onslaught by the presidentâ\u0080\u0099s team to make the campaign about the violence rattling American cities. Bidenâ\u0080\u0099s wife, Jill, on Tuesday kicked off a multiweek, 10-city tour of schools disrupted by the pandemic in eight battleground states, drawing a direct line from the empty classrooms to the administrationâ\u0080\u0099s failures combating COVID-19. During her tour of a Wilmington, Del., school, she spoke with teachers and administrators about doubts that in-person learning will actually resume anytime soon and the challenges â\u0080\u0094 including obtaining new small desks and protective equipment to make sure classrooms can handle social distancing â\u0080\u0094 if they do. She said feelings about heading back to school â\u0080\u009chave turned from excitement into anxiety, and the playgrounds are still.â\u0080\u009d More news about Wisconsin â\u0080\u0094 read on: Wisconsin Republican Ron Johnson on defensive over probe of Biden and Ukraine in wake of intelligence assessment about ongoing Russian election interference Wisconsin Supreme Court upholds lame-duck laws enacted by Republicans as governorship turned Democratic Trump campaign adviser tells Wisconsin Republicans in secret recording that voting-place tactics will be stepped up"}]}