{"article": [{"url": "https://www.marketwatch.com/story/president-trump-considers-ending-housing-regulation-that-advocates-say-was-created-to-combat-racial-segregation-2020-07-02", "published": 1596035840.0, "headline": "Trump says heâ\u0080\u0099ll keep low-income housing out of suburbs as he rescinds Obama-era anti-segregation regulation", "body": "President Donald Trump argues that home prices are going to increase now that his administration has rescinded an Obama-era housing regulation. On Wednesday, President Trump took to Twitter TWTR, -0.23% Â to say he had rescinded the Affirmatively Furthering Fair Housing (AFFH) rule, established by the Department of Housing and Urban Development under the Obama administration in 2015. Trump claimed that people in the suburbs would â\u0080\u009cno longer be bothered or financially hurt by having low-income housing built in your neighborhood.â\u0080\u009d â\u0080\u009cYour housing prices will go up based on the market, and crime will go down,â\u0080\u009d Trump said in his tweets. iframe.twitter-tweet { width: 100% !important; } Current HUD Secretary Ben Carson had previously announced the administrationâ\u0080\u0099s policy change last week. Carson said the administration found the AFFH rule â\u0080\u009cto be unworkable and ultimately a waste of time for localities to comply with, too often resulting in funds being steered away from communities that need them most.â\u0080\u009d Instead, Carson emphasized the benefits of the Opportunity Zone program created by Republicansâ\u0080\u0099 2017 tax legislation. Past research has shown that low-income housing doesnâ\u0080\u0099t necessarily lead to a decline in home values. A 2016 study from Zillow ZG, -0.42% Â subsidiary Trulia found that low-income housing projects in the 20 least affordable housing markets nationwide caused no significant effect on home values, with only a couple of exceptions. â\u0080\u009cThe bottom line for NIMBYs who fear that property values will take a hit when a low-income housing project locates nearby is that their anxiety is largely unfounded â\u0080\u0094 at least in cities where housing is either expensive or in short supply,â\u0080\u009d the report concluded. The Trump administrationâ\u0080\u0099s new policy comes a few weeks after Trump said on Twitter that he was â\u0080\u009cstudyingâ\u0080\u009d the housing regulation. â\u0080\u009cAt the request of many great Americans who live in the Suburbs, and others, I am studying the AFFH housing regulation that is having a devastating impact on these once thriving Suburban areas,â\u0080\u009d Trump previously wrote. He added, â\u0080\u009cNot fair to homeowners, I may END!â\u0080\u009d The AFFH rule was meant to fulfill requirements of the Fair Housing Act, which was signed into law by President Lyndon B. Johnson in 1968. The Fair Housing Act brought an end to practices such as redlining and racial covenants in home deeds. But the law was also supposed to require local governments to work to desegregate neighborhoods across the country. Under the AFFH rule, any locality that receives block-grant funds from HUD was required to produce an assessment outlining its efforts toward assuring fair housing. In 2018, HUD Secretary Ben Carson announced that implementation of the rule would be delayed. Donâ\u0080\u0099t miss:Black homeownership has declined since 2012 â\u0080\u0094 hereâ\u0080\u0099s where Black households are most likely to be homeowners With this weekâ\u0080\u0099s change, the Trump administration has instituted a new policy that defined fair housing as any housing that is â\u0080\u009caffordable, safe, decent, free of unlawful discrimination, and accessible under civil rights laws.â\u0080\u009d The Trump administration proposed this new version of the rule last January. In addition to redefining fair housing stands to focus on improving housing choice and affordability instead of eliminating discrimination, the new policy eliminated the assessments required by the Obama-era rule. The move drew sharp criticism from organizations across the country working to improve equity in the housing market. “ â\u0080\u0098Where you live impacts everything about you â\u0080\u0094 your chances of graduating from high school or attending college, your chances of being arrested, your net worth, your credit score, your income, your chances of becoming a homeowner, and even how long you will live.â\u0080\u0099 ” â\u0080\u0094 Lisa Rice, National Fair Housing Alliance â\u0080\u009cBen Carson has been working to dismantle fair housing since the day he stepped into the HUD building, so this tweet is not surprising,â\u0080\u009d said Diane Yentel, president and CEO of the National Low Income Housing Coalition. â\u0080\u009cBut itâ\u0080\u0099s particularly abhorrent for the president to threaten further entrenchment of segregated communities now, during a time of reckoning on racial injustices in our country,â\u0080\u009d she added. Critics of the Trump administration argue that the new rule would make it harder to enforce fair housing and could lead to an increase in segregation. â\u0080\u009cThe promise to dismantle government sponsored segregation has been unfulfilled in the 52 years since the passage of the Fair Housing Act,â\u0080\u009d said Shamus Roller, executive director of the National Housing Law Project. â\u0080\u009cThe proposed rule ignores segregation and, instead, seeks to push a de-regulatory agenda.â\u0080\u009d Research has shown that people of color still face discrimination in the housing market. Black Americans are far less likely than their white peers to receive mortgage funding. And parts of the country that were historically redlined continue to see lower home prices than historically White neighborhoods. The homeownership rate among Black and Hispanic households remains significantly lower than the rate for white Americans. That is in part a reflection of how those communities were targeted by subprime lending activity in the lead up to the last recession, which left them more likely to be foreclosed against. Calls for reducing discrimination in housing have taken on a renewed significance amid the coronavirus pandemic. Thereâ\u0080\u0099s evidence that Black people may be at higher risk of contracting COVID-19 because of where they live. Research has shown that when people move from segregated neighborhoods to those that are somewhat more diverse, they see improvements to their health including lower rates of obesity and diabetes. â\u0080\u009cBecause of persistent residential segregation and structural inequality, your ZIP code is a better determinant of your health than your genetic code,â\u0080\u009d said Lisa Rice, president and CEO of the National Fair Housing Alliance. â\u0080\u009cWhere you live impacts everything about you â\u0080\u0094 your chances of graduating from high school or attending college, your chances of being arrested, your net worth, your credit score, your income, your chances of becoming a homeowner, and even how long you will live.â\u0080\u009d This story was updated on July 29, 2020."}]}