{"article": [{"url": "https://www.marketwatch.com/story/the-coronavirus-crisis-is-costing-states-and-locals-hundreds-of-billions-analysis-finds-2020-07-01", "published": 1594224980.0, "headline": "The coronavirus crisis is costing states and locals hundreds of billions, analysis finds", "body": "Just how bad is the economic impact of the COVID-19 pandemic? On the national and international level, things are tough, but perhaps a little more manageable than many analysts had feared at the onset of the crisis. Corporations are reporting earnings that are better than Wall Street expected, jobs were added, not lost, in May, and central banks and fiscal policymakers stepped up with robust aid packages. On the state and local level, it’s a whole different ballgame, and observers of public finance and the municipal bond market are bracing for a long, slow burn. States, counties, cities and towns are on the hook for most of the costs associated with the pandemic — health care, emergency responses, and so on — even as their tax revenues, mostly from income and sales taxes, dwindle. Even revenue streams often seen as safe, like usage fees for things like airports, toll roads, arena ticket charges, and so on, have swooned in line with economic activity. Related:Amid the coronavirus pandemic, how healthy are hospitals backed by municipal bonds? On Monday, Stephan D. Whitaker, a policy economist at the Cleveland Federal Reserve, released a fresh analysis of just how bad the budget situation is for state and local governments. Whitaker reckons that they’ve lost $141 billion in revenue from all sources in fiscal year 2020 — that is, through June 30. The table below shows national aggregate estimates for the hit in fiscal year 2020, as well as two scenarios for 2021: a “slow recovery,” similar to the years following the Great Recession of 2007-2009, and a “second-wave” outcome, in which economic shutdowns are re-imposed in the fall. (Whitaker’s analysis, which can be found here, also includes calculations for a “V-shaped” recovery scenario.) Declines in State and Local Revenue, billions of dollars FY20 FY21, Slow recovery FY21, Second wave State 84.9 122.1 238.1 Local 56.3 48.7 111.8 State + Local 141.2 170.8 349.9 States splitting RDF between 2020/21 40 68.6 182.6 Local + states splitting RDF btw 2020/21 96.3 117.3 294.4 Source: Cleveland Fed More to the point, Whitaker estimates that states and locals will have to cut expenditures by anywhere from $59 billion to $350 billion in the coming fiscal year. Why such a wide range? Some state and local governments built up budget cushions during the expansion, Whitaker notes. But those funds vary widely, and most so-called “rainy day funds” aren’t equipped to handle the 100-year-storm that hit in 2020. The table above shows an analysis of the declines in revenues if states chose to split their current rainy day funds equally between fiscal years 2020 and 2021. Many local governments also have such funds, Whitaker notes, but there’s no reliable data source that aggregates them all. While the numbers above are sobering, it’s worth pointing out that numbers in municipal finance may carry more meaning than other areas of the financial markets. When states and locals cut their budgets, it means essential services that touch the lives of most Americans: schools, libraries, road repair, emergency services, garbage disposal, transportation systems, and more. It’s also important to note that there’s enormous disparity among the states, not to mention the local governments, across the country. For some regional economies, the collapse in oil prices CL00, -1.62% in March and April was just as devastating, if not more so, than the coronavirus crisis. Revenue losses as share of state’s own revenue FY21, Slow recovery FY21, Second wave Alabama 3.7 12.3 Alaska 14.9 27.3 Arizona 7.5 13.8 Arkansas 8.3 15.3 California 7.8 14.3 Colorado 7.1 13.1 Connecticut 7.8 14.4 Delaware 12.3 22.5 Florida 11 20.2 Georgia 8.1 14.8 Hawaii 10.1 18.6 Idaho 8.6 15.7 Illinois 9.4 17.2 Indiana 8.5 15.5 Iowa 8.4 15.4 Kansas 8.7 16 Kentucky 8.7 16 Lousiana 9.5 17.4 Maine 9.2 16.9 Maryand 9.1 16.7 Massachusetts 9.1 16.6 Michigan 3.9 13 Minnesota 7.5 13.7 Mississippi 9.6 17.6 Missouri 7.9 14.5 Montana 7.4 13.5 Nebraska 7.7 14.2 Nevada 12.2 22.3 New Hampshire 8.2 15 New Jersey 9.4 17.3 New Mexico 10.3 18.8 New York 7.4 15.9 North Carolina 8.3 15.2 North Dakota 15.5 28.4 Ohio 8 14.7 Oklahoma 7.4 13.6 Oregon 7.2 13.1 Pennsylvania 9.2 16.9 Rhode Island 8.1 14.8 South Carolina 7.7 14 South Dakota 10.1 18.5 Tennessee 11.7 21.5 Texas 5 16.5 Utah 8.1 14.8 Vermont 5 9.1 Virginia 7.3 13.5 Washington 9 16.5 West Virginia 8.4 15.5 Wisconsin 8.1 14.9 Wyoming 9.7 17.7 Source: Cleveland Fed Whitaker’s analysis takes into account dozens of revenue sources, including general sales taxes, tolls, severance taxes, parking facility fees, lottery revenues, and much more. There’s a lot more to say about the pain facing state and local governments. For one thing, most localities derive much of their revenues from property taxes. It’s likely that any impact to the real estate market, and thus the assessments that drive property tax calculations, won’t show up for a few years, elongating the downturn. See:A tax break to hasten gentrification? Housing market’s Opportunity Zones may miss their target"}]}