{"article": [{"url": "https://www.marketwatch.com/story/election-countdown-where-biden-and-trump-stand-on-social-security-2020-07-29", "published": 1596017300.0, "headline": "Election countdown: Where Biden and Trump stand on Social Security", "body": "During the 2016 election, AARP asked Americans over age 50 to list the issues they were most concerned about. One issue blew everything away: Social Security. A whopping 67% said it was their number one concern. Health care costs—particularly the rising cost of prescription drugs—were next. Those concerns seem even more worrisome now. Because of the pandemic and the resulting economic collapse, tens of millions of Americans have been laid off—which means a huge drop in the payroll taxes which support Social Security as well as Medicare and Medicaid. Even if the economy bounces back in 2021, and millions go back to work, a major long-term worry remains: The U.S. population is now growing at its slowest pace in decades. As waves of baby boomers retire (10,000 daily through 2029 or so), where will all the future workers—and revenue—to support them come from? Because these are such big topics, I’m going to break them up. In this column, we’ll look at Social Security, Next week: Medicare and Medicaid. Big cuts loom The Social Security system has begun dipping into its $2.9 trillion cash reserve to pay seniors. But the system’s trustees warn this will run out in 2034. What happens then? The trustees warn enough money will come in from taxes to pay just 76% of benefits. Clearly something has to be done. What are President Trump and former Vice President Joe Biden proposing? Let’s start with Biden.Biden’s ideas A centrist for much of his long career, Biden has in the past proposed to hold down Social Security’s galloping costs by supporting everything from a one-year benefit freeze, trimming benefits 4.5% over 40 years and raising the full retirement age (currently 70). But as the Democratic Party has moved further to the left in recent years, Biden has moved with it and now favors showering seniors—many of them, anyway—with more cash. Read: Don’t cut the payroll tax — let’s help people without a job He proposes raising benefits in two key ways. First, he wants to hike the minimum benefit to help retirees who get the least, and second, increase payments for the oldest retirees who have outlived their savings. Given that “21% of married couples and about 45% of unmarried persons rely on Social Security for 90% or more of their income,” a boost to the neediest (beyond the annual cost-of-living adjustments) could keep many of our oldest and most vulnerable citizens out of poverty. The second idea is also intriguing, given that longer life expectancies increase the chances of a retiree outliving his or savings—which in millions of cases, are meager to begin with. Keep in mind, the average Social Security payment this year is $1,503. Read: I have a seven-figure nest egg — am I saving too much for retirement? How to pay for this? Biden’s website says nothing about raising the retirement age—but again this is something he has proposed in the past. The most obvious source of revenue comes from higher payroll taxes. Right now, only the first $137,700 in income is subject to this. Biden proposes taxing all income over $400,000, leaving a “doughnut hole” between $137,700 and $400,000. He also wants to raise the top marginal income-tax rate 2.6 points to 39.6%.Trump’s ideas President Trump’s campaign website doesn’t offer the kind of detailed proposals that Biden’s does. But we do have the last 3½ years of his presidency to examine. In 2016, Trump promised to preserve Social Security—a vital issue to his base, which tends to skew older. Read: I’m 63, a widow and lost my job because of COVID. I don’t have much in savings and I lost. What can I do? Voters over the age of 50 rewarded him in 2016. In the 50-64 age group (29% of the electorate that year), he beat Hillary Clinton 51% to 45%; his margin among the 65+ group (27% of the electorate) was even wider: 53% to 44%. The president can truthfully tell these voters that Social Security has not been cut on his watch. But anyone willing to dig a bit deeper will realize that it’s not that clear-cut. Case in point: His fiscal 2021 budget proposed trimming the part of Social Security that provides benefits to about 8.5 million disabled Americans. There was no chance this would get through a Democratic-controlled House, yet he proposed it anyway. But changes to the big enchilada—the monthly payments that go out to tens of millions of Americans? This has not been cut. But presidents who are re-elected have more latitude; what might Trump do in a possible second term? In a January interview, he was asked if entitlement programs would “ever be on your plate,” meaning would cuts be something to explore? “At some point they will be,” the president said. He was even more specific two months later during a Fox News town hall, when anchor Martha McCallum told him “If you don’t cut something in entitlements, you’ll never really deal with the debt.” Trump’s response? ”Oh, we’ll be cutting.” Of course, whatever either man could do over the next four years would be tempered by whoever controls Congress. A Biden win, which looks likely, would probably come with an increased House majority—and even the possibility of a Senate takeover. This would resemble the first two years of both the Obama and Trump eras, when their respective parties controlled everything: the White House and both chambers of Congress. If Biden wins, that would be the time—that two-year window—to get the big stuff done. Next week: The candidates and Medicare / Medicaid."}]}