{"article": [{"url": "https://www.marketwatch.com/story/heres-the-real-surprise-in-the-july-jobs-report-as-economists-react-to-the-data-2020-08-07", "published": 1596793340.0, "headline": "Hereâ\u0080\u0099s â\u0080\u0098the real surpriseâ\u0080\u0099 in the July jobs report as economists react to the data", "body": "The July jobs report on Friday showed the U.S. economy added 1.8 million jobs last month, with the unemployment rate falling to 10.2% from 11.1%. Economists polled by MarketWatch had expected a gain of 1.7 million jobs and an unemployment rate of 10.6% See:U.S. adds 1.8 million jobs in July as hiring slows after fresh coronavirus outbreak Below are some initial reactions from analysts and economists, as U.S. stocks SPX, +0.87% Â DJIA, +0.56% Â opened in the red following the data. â\u0080¢ â\u0080\u009cThe real surprise in this report is that the number of permanent job losers held roughly steady in July from June. That means for every person laid off (with no expectation of being recalled) between June and July, someone else who had been permanently unemployed was hired.â\u0080\u009d â\u0080\u0094 Betsey Stevenson, professor of public policy and economics at the University of Michigan and former chief economist at the Labor Department â\u0080¢ â\u0080\u009cPermanent job losses were steady, a positive sign, but remain higher than where they were pre-virus. Recovery in jobs to pre-pandemic levels will likely be slow and prolonged, one that will restrain the pace of recovery.â\u0080\u009d â\u0080\u0094 Rubeela Farooqi, chief U.S. economist at High Frequency Economics â\u0080¢ â\u0080\u009cThe jobs recovery continues, and at a moderately faster-than-expected pace in July. Thatâ\u0080\u0099s the good news. The bad news is the pace of recovery is slowing. The easy job gains are behind us and it will be an increasingly slower slog from here unless/until a vaccine allows the economy to fully reopen.â\u0080\u009d â\u0080\u0094 Chris Low, chief economist at FHN Financial â\u0080¢ â\u0080\u009cSo who was hiring? The gains were quite broadly based, from construction, health care & education, government (all levels, despite the budgetary challenges), retail, manufacturing and transportation/warehousing. Wholesale trade and information services did not partake, however.â\u0080\u009d â\u0080\u0094 Jennifer Lee, senior economist at BMO Capital Markets â\u0080¢ â\u0080\u009cThe U.S. labor market continued to gain back jobs lost during the lockdown in July, but at a slower pace than in prior months, as an acceleration in new virus cases posed a challenge to the recovery. ... Hiring was the strongest in private industries that were directly impacted by social distancing during the lockdown, including leisure & accommodation and retail trade, and solid hiring in higher-paying sectors helped send the average wage 0.2% higher on the month. The unemployment rate fell by nine ticks to 10.2%, but that partly reflected a decline in participation in the labor force. Julyâ\u0080\u0099s print leaves 42% of the jobs lost in March and April recouped, suggesting that there is still a long way to go for the labor market to heal.â\u0080\u009d â\u0080\u0094 Katherine Judge, economist at CIBC â\u0080¢ â\u0080\u009cBlack unemployment rates continue to not change much at 14.6% for July, which means Black workers are going to face long-term consequences of being disproportionately impacted by this downturn.â\u0080\u009d â\u0080\u0094 Kate Bahn, director of labor market policy and economist at the Washington Center for Equitable Growth â\u0080¢ â\u0080\u009cEmployment is still 8% below its February level. 1.8 million jobs isnâ\u0080\u0099t V-shaped recovery speed.â\u0080\u009d â\u0080\u0094 Nick Bunker, economic research director at jobs website Indeed â\u0080¢ â\u0080\u009cPayrolls rose a healthy 1.8M and came in slightly stronger than consensus, though there was a clear downshift in momentum from last month when payrolls were up 4.791M.â\u0080\u009d â\u0080\u0094 Thomas Simons and Aneta Markowska, economists at Jefferies"}]}