{"article": [{"url": "https://www.marketwatch.com/story/exxons-debt-load-is-expected-to-rise-as-it-commits-to-paying-dividend-2020-07-31", "published": 1596279140.0, "headline": "Exxonâ\u0080\u0099s debt load is expected to rise as it commits to paying dividend", "body": "Investors had braced for bad news for Exxon Mobil Corp. and Chevron Corp., and their fears were confirmed Friday when both energy integrateds reported second-quarter results that showed steep losses and dwindling sales amid the economic destruction wreaked by the coronavirus. Exxon XOM, -1.47% Â reported an adjusted loss of 70 cents a share on sales of $32.6 billion, contrasting with a FactSet consensus that called for an adjusted loss of 61 cents a share on sales of $38.2 billion. Chevron CVX, -1.62% Â reported an adjusted loss of $1.59 a share on sales of $13.5 billion, contrasting with FactSet consensus of an adjusted loss of 95 cents a share on sales of $21.9 billion. On a call with analysts following results, Exxon said it remained committed to paying dividends. Exxon and Chevron are the only two energy companies that are â\u0080\u009cdividend aristocrats,â\u0080\u009d or S&P companies that have paid dividend for at least 25 consecutive years. Exxon has paid a dividend for 37 years, and Chevronâ\u0080\u0099s streak is almost as long. Exxon has â\u0080\u009ca long history of providing a reliable and growing dividend. A large portion of our shareholder base has come to view that dividend as a source of stability in their income, and we take that very seriously,â\u0080\u009d Vice President Neil Chapman said on the companyâ\u0080\u0099s earnings call. Exxon plans to cut operating expenses further and defer expenses where it can, and doing so â\u0080\u009cwill enable us to maintain the dividend and hold debt at its current level.â\u0080\u009d Exxonâ\u0080\u0099s cash flow for the year covers some 70% of its capital program, and none of the dividend, which is being supported through Exxonâ\u0080\u0099s balance sheet, RBC Capital Pavel Molchanov said in a note Friday. â\u0080\u009cAs such, there is no avoiding a sizable increase in leverage: we anticipate net debt/cap rising from 19% at year-end 2019 to 27% at year-end 2020, the latter being the highest level since the Exxon/Mobil merger in 1999,â\u0080\u009d he said. Exxon executives said that their goal is to avoid taking on any more debt, but they are likely to need borrowings of $10-plus billion, factoring in a flat 2021 budget, he said. â\u0080\u009cWhile we see the dividend as safe â\u0080\u0094 if for no other reason than managementâ\u0080\u0099s desire to maintain S&P Aristocrat status â\u0080\u0094 the cash flow outspend is colossal under current conditions,â\u0080\u009d Molchanov said, keeping his rating on Exxon stock at the equivalent of sell. Related:Exxon and Chevron are â\u0080\u0098dividend aristocratsâ\u0080\u0099, but for how long? Exxonâ\u0080\u0099s second-quarter â\u0080\u009cprobably poses as many questions as it does answers,â\u0080\u009d Citi analyst Alastair Syme said in a note on Friday. â\u0080\u009cThe dividend is undoubtedly the real question, or maybe more correctly the forward scenario that the company is adopting to underpin shareholder returns,â\u0080\u009d he said. The key driver for Exxonâ\u0080\u0099s miss was exploration and production price realizations, while production was generally in line, said Neil Mehta with Goldman Sachs in a note. Chevronâ\u0080\u0099s miss was driven mainly by timing effects of crude prices throughout the volatile quarter and other corporate expenses, Mehta said. â\u0080\u009cProduction came in above our expectations, with volumes primarily beating our estimates on U.S. (both liquids and gas) and International liquids,â\u0080\u009d he said. Chevronâ\u0080\u0099s â\u0080\u009cchallengingâ\u0080\u009d second quarter has seen the companyâ\u0080\u0099s debt expand 8% quarter-on-quarter, â\u0080\u009cabove our expectations and the rate of build seen at (integrated oil company) peers,â\u0080\u009d Citiâ\u0080\u0099s Syme said. Its balance sheet â\u0080\u009cis not as pristine as it once was,â\u0080\u009d and the deal to buy Noble Energy Inc. will add further pressure in the second half of the year, he said. Chevron last week announced plans to buy Noble Energy for $5 billion. Chevron stock â\u0080\u009chas been a go-to name in the sector through 1H we would argue for reasons of security,â\u0080\u009d Symes said. â\u0080\u009cBut 2Q results show a picture that is perhaps not as resilient as the market thought it might be.â\u0080\u009d Analysts at SunTrust said that they continued to prefer Chevron over Exxon, as Chevron has â\u0080\u009cample liquidity to continue to pay its dividend.â\u0080\u009d While Chevronâ\u0080\u0099s U.S. oil volumes are â\u0080\u009cholding in surprisingly wellâ\u0080\u009d quarter-on-quarter, international pricing disappointed, they said. Refining input was also lower than expected, with negative margins dragging down cash flow, they said. Shares of Exxon have lost 40% this year, while Chevron shares are down 32%. That compares with losses of around 9% for the Dow Jones Industrial Average DJIA, +0.56% Â and under 1% for the S&P 500 index SPX, +0.87% Â in the same period. Both companies are Dow components."}]}