{"article": [{"url": "https://www.marketwatch.com/story/feds-kashkari-warns-of-a-greater-catastrophe-that-could-make-the-last-few-months-feel-like-just-a-warm-up-2020-08-09", "published": 1597054280.0, "headline": "Fed's Kashkari warns of a 'greater catastrophe' that could make the last few months feel like 'just a warm-up'", "body": "“ 'To be effective, the lockdown has to be as comprehensive and strict as possible. If we aren't willing to take this action, millions more cases with many more deaths are likely before a vaccine might be available. In addition, the economic recovery will be much slower, with far more business failures and high unemployment for the next year or two.' ” That's Neel Kashkari, president of the Federal Reserve Bank of Minneapolis, sharing his thoughts in a recent New York Times op-ed co-authored with Michael Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota A week ago, Kashkari made similar comments on CBS's \"Face the Nation,\" when he argued that \"if we were to lock down hard for a month or six weeks, we could get the case count down so that our testing and our contact tracing was actually enough to control\" the spread of the virus. In the op-ed, the two argued that the March lockdown wasn't strict enough and has put the U.S. behind other countries on the road to recovery. In fact, they warned of a situation that \"could make what we have experienced so far seem like just a warm-up to a greater catastrophe.\" Of course, the initial lockdown devastated the U.S. economy, leading to the loss of at least 20 million jobs as well as a 32.9% second-quarter drop in GDP as calculated over a full-year's period. Still, Kashkari and Osterholm contend that the government should have kept restrictions in place. \"Simply, we gave up on our lockdown efforts to control virus transmission well before the virus was under control,\" they wrote, adding that doing so will ultimately deliver a stronger recovery. \"There is no trade-off between health and the economy,\" Kashkari and Osterholm said. \"Both require aggressively getting control of the virus. History will judge us harshly if we miss this life- and economy-saving opportunity to get it right this time.\" The two also wrote that the government needs to step up stimulus relief. \"Congress should be aggressive in supporting people who've lost jobs because of COVID-19. It's not only the right thing to do but also vital for our economic recovery,\" they said. \"If people can't pay their bills, it will ripple through the economy and make the downturn much worse, with many more bankruptcies, and the national recovery much slower.\" Despite all the uncertainty, the stock market continues to hold up nicely. The Dow Jones Industrial Average DJIA, +0.56% started the week with a triple-digit gain, while the S&P 500 SPX, +0.87%  also moved higher. The Nasdaq NQ00, +1.63%  , however, was in the red."}]}