{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-tick-up-as-traders-await-fed-policy-update-2020-07-29", "published": 1596037880.0, "headline": "Treasury yields struggle for direction after Fed pledges to support economy", "body": "U.S. Treasury yields ended mixed Wednesday after the Federal Reserve underlined its commitment to supporting the economy as it makes a tentative recovery during the COVID-19 pandemic.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was declined 0.3 basis point to 0.578%, while the 2-year note rate TMUBMUSD02Y, 0.156% was down 1.2 basis points to 0.129%. The 30-year bond TMUBMUSD30Y, 1.576% added 1.9 basis points to 1.242%.What’s driving Treasurys? As expected, the Fed kept its benchmark interest rate steady on Wednesday at zero to 0.25%, pledging to keep policy accommodative until unemployment recovers and inflation strengthens. The U.S. central bank also said the path of the U.S. economy “will depend significantly on the course of the virus.” Expectations for the Fed to stay supportive and revive price pressures have helped to steepen the yield curve, creating a wider spread between short-term and long-term yields. The gap between the 5-year note TMUBMUSD05Y, 0.338% and the 30-year bond increased 3 basis points to 99 basis points. In the post-meeting news conference, Fed Chairman Jerome Powell noted the pace of the recovery had slowed based on high-frequency economic data as the coronavirus situation worsened in several hotspots. The U.S. death toll from the coronavirus illness COVID-19 edged closer to 150,000 on Wednesday. See: Fed sees some pickup in activity, but maintains dovish policy stance On the data front, the U.S. trade deficit in goods fell by 6.1% to $70.6 billion in June. The index of pending home sales soared 16.6% last month, helped by low borrowing rates, as compared with May, the National Association of Realtors reported Wednesday.What did market participants’ say? “It was pretty much as expected. They have a fairly pessimistic view on the economy, which implies they will continue to push loose policies in every way they can,” said Bill Callahan, investment strategist at Schroders, in an interview. “The pace of the recovery may have slowed in recent months as virus cases have surged across the country and the Fed appears to be in no hurry to change the status quo,” Charlie Ripley, senior investment strategist for Allianz Investment Management. Read: Fed puts $18 trillion U.S. government bond market under lockdown"}]}