{"article": [{"url": "https://www.marketwatch.com/story/he-hates-shorting-the-market-and-lost-a-ton-of-money-betting-against-high-flyers-in-1999-but-hes-at-it-again-2020-06-21", "published": 1592819720.0, "headline": "He hates shorting the stock market, but this â\u0080\u0098terrible, gut-wrenching scenarioâ\u0080\u0099 has him doing just that", "body": "Wolf Richter, the veteran investor behind the Wolf Street blog, got hit hard betting against the market during the blow-off rally of in 1999. But he says this market â\u0080\u009cis even crazierâ\u0080\u009d than that legendary internet bubble, and heâ\u0080\u0099s banking on an imminent downturn. Still, heâ\u0080\u0099s keeping a sense of humor about it his short of the SPDR S&P 500 ETF SPY, +0.89% Â . â\u0080\u009cIâ\u0080\u0099m sharing this trade for your future entertainment,â\u0080\u009d he told readers, â\u0080\u009cso you can hail me as the obliterating moron that infamously shorted the greatest rally floating weightlessly ever higher above the worst economic and corporate crisis imaginable.â\u0080\u009d This isnâ\u0080\u0099t the only short trade Richterâ\u0080\u0099s made public in the past six months. Heâ\u0080\u0099s on a bit of a roll with the doom and gloom. EarlierÂ this year, Richter nailed his bearish call when he pocketed a 26.5% gain by covering his SPY position and another 13.1% covering his QQQ QQQ, +1.52% short.Â â\u0080\u009cI donâ\u0080\u0099t expect those kinds of fireworks this time â\u0080\u0094 but I didnâ\u0080\u0099t expect them last time either,â\u0080\u009d he told MarketWatch. â\u0080\u009cIâ\u0080\u0099m gunning for a regular run-of-the-mill sell-off.â\u0080\u009d Richter acknowledged that, this time, the risk-reward is out of whack and he feels â\u0080\u009ccrappyâ\u0080\u009d about it, but he just canâ\u0080\u0099t fathom how this rally can continue in the face of â\u0080\u009cthe worst economy in my lifetime.â\u0080\u009d “ â\u0080\u0098Itâ\u0080\u0099s a terrible, gut-wrenching scenario all around.â\u0080\u0099 ” He pointed to the millions of people on state and federal unemployment insurance, the desperate situation of the airlines and other industries in the face of the coronavirus pandemic, and, of course, the drying-up flow of cash from the Federal Reserve. All that, and weâ\u0080\u0099re coming off the â\u0080\u009cgreatest 50-day rally in history,â\u0080\u009d in which the S&P 500 SPX, +0.87% exploded for a 47% rebound from an intraday low on March 23. What makes the situation even more â\u0080\u009csilly,â\u0080\u009d he said, is the surge in day traders who are taking outsized risks in â\u0080\u009cget-rich-quick schemesâ\u0080\u009d that almost never end well. Richter pointed to action in shares of Hertz HTZ, -1.78% Â â\u0080\u0094 a bankrupt stock that was bid up from 40 cents a share to over $6. He said that surge could go down â\u0080\u009cas the craziest moment of the crazy rally.â\u0080\u009d The day-trading frenzy of 1999 didnâ\u0080\u0099t even reach these levels, he said, adding that investors are now facing stocks prices that will no longer be propped up by the Federal Reserve. â\u0080\u009cAnd now the market, immensely bloated and overweight after its greatest 50-day rally ever, has to stand on its own feet, during the worst economy in my lifetime, amid some of the worst corporate earnings approaching the light of the day, while over 30 million people lost their jobs,â\u0080\u009d Richter explained in his post. â\u0080\u009cItâ\u0080\u0099s a terrible, gut-wrenching scenario all around.â\u0080\u009d Read:â\u0080\u0098Thereâ\u0080\u0099s absolutely no reason to own U.S. equities right now,â\u0080\u0099 strategist says For now, his shortâ\u0080\u0099s doing just fine, with the Dow Jones Industrial Average DJIA, +0.56%, S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% all moving lower to start the week."}]}