{"article": [{"url": "https://www.marketwatch.com/story/trump-told-woodward-nothing-more-could-have-been-done-on-coronavirus-response-2020-09-13", "published": 1600032440.0, "headline": "Trump told Woodward: 'Nothing more could have been done' on coronavirus response", "body": "“ \"Nothing more could have been done. Nothing more could have been done.\" ” That's what President Donald Trump told journalist Bob Woodward in August of the U.S. government's response to the coronavirus pandemic, Woodward revealed on CBS's \"60 Minutes\" on Sunday night. By that time, more than 167,000 Americans had died from COVID-19, and the Trump administration had been heavily criticized for not doing nearly enough to prevent the spread of coronavirus. iframe.twitter-tweet { width: 100% !important; } Trump's comments were recorded in an Aug. 14 phone interview with Woodward. Last week, excerpts from Woodward's upcoming book revealed that Trump knew the coronavirus was \"deadly stuff\" early in the pandemic, but continued to play down its severity so as not to panic the American people. \"'Nothing more could have been done.' Does he remember what he told me, back in February, about, it's more deadly than the flu?\" Woodward told CBS News reporter Scott Pelley, according to a transcript. \"I mean, it almost took my breath away, that there was such certainty, when he was absolutely wrong about the issue that defines the position of this country right now.\" \"I think he did not understand the American public,\" Woodward told \"60 Minutes.\" \"And he said, 'Well, I don't wanna create a panic.' We know, from history, when the public is told the truth, they organize. 'We have a problem. We're going to step up.' And Trump thought, 'Oh, well, they'll panic.' When there's a crisis, when the president, particularly, knows something, it's time to tell the public in some form. He failed.\" Woodward came to that same conclusion at the end of his book, saying Trump \"is the wrong man for the job.\" \"It's a conclusion based on evidence, overwhelming evidence, that he could not rise to the occasion with the virus and tell the truth,\" Woodward told \"60 Minutes.\" \"And one of the things that President Trump told me, 'In the presidency, there's always dynamite behind the door.' The real dynamite is President Trump. He is the dynamite.\" Pelley did not ask Woodward about his controversial decision to not publicize Trump's comments back during the pandemic's early days."}]}