{"article": [{"url": "https://www.marketwatch.com/story/is-there-a-big-risk-of-getting-coronavirus-from-food-the-cdc-has-an-answer-2020-06-23", "published": 1593263840.0, "headline": "Is there a big risk of getting coronavirus from food? As restaurants reopen, the CDC has an answer", "body": "Are you worried about getting coronavirus if you dine out or order in? Here’s some good news: The risk of getting the disease from consuming food is “thought to be very low,” according to the U.S. Centers for Disease Control and Prevention. “Coronaviruses, like the one that causes COVID-19, are thought to spread mostly person-to-person through respiratory droplets when someone coughs, sneezes, or talks,” the CDC said Monday. That news comes as more than 3,000 New York City restaurants reopened for outdoor dining on Monday as part of the state’s Phase 2 reopening policy. “Currently, no cases of COVID-19 have been identified where infection was thought to have occurred by touching food, food packaging, or shopping bags,” the agency said. Additionally, the virus that causes COVID-19 “cannot grow on foods.” However, the CDC recommends that you “wash your hands with soap and water for at least 20 seconds” or use “hand sanitizer that contains at least 60% alcohol” before preparing or eating food. Related: ‘We don’t eat our countertops,’ yet many Americans are using cleaning products meant for fruits and vegetables, National Poison Control Center official says But food-safety experts still advise caution. While many restaurants have started using digital menus and have disposable utensils, simply touching your chair or salt shaker if they weren’t properly disinfected could cause you to get coronavirus, Benjamin Chapman, a professor at North Carolina State University, told MarketWatch. “If someone was sick and walked into a store and coughed on the handles of self-serve buffet utensils and you then touched your face, you could get coronavirus.” But you should obviously not use cleaning supplies to disinfect your food, poison-control experts say. For fruits and vegetables, the CDC recommends rinsing them “under cold, running tap water” and scrubbing them “with a clean produce brush.” “Salt, pepper, vinegar, lemon juice, and lime juice have not been shown to be effective at removing germs on produce,” the agency added."}]}