{"article": [{"url": "https://www.marketwatch.com/story/watch-top-5-moments-from-snls-most-watched-season-premiere-in-4-years-2020-10-05", "published": 1602072800.0, "headline": "WATCH: Top 5 moments from â\u0080\u0098SNLâ\u0080\u0099sâ\u0080\u0099 most-watched season premiere in 4 years", "body": "â\u0080\u009cSaturday Night Liveâ\u0080\u009d was live from New York for the first time since coronavirus lockdowns began last spring. And the topical sketch show drew its biggest season premiere audience in four years while recapping the previous weekâ\u0080\u0099s particularly manic news cycle. â\u0080\u009cSNLâ\u0080\u009d boasted a marquee lineup for its 30 Rock return, including comedian Chris Rock as the host, rapper Megan Thee Stallion as the musical guest â\u0080\u0094 and, of course, Jim Carrey making his debut as former Vice President Joe Biden alongside guest stars Alec Baldwin and Maya Rudolph reprising their roles as President Donald Trump and Bidenâ\u0080\u0099s running mate Sen. Kamala Harris, respectively. The broadcast drew 7.765 million viewers overall, according to early Nielsen Media Research numbers â\u0080\u0094 making it the Comcast-owned CMCSA, -0.99% Â NBC showâ\u0080\u0099s most-watched debut since 2016, when Margot Robbie hosted and The Weeknd performed. Also of note: the live audience, which largely consisted of first responders, was paid to show up, the New York Times reported. Thatâ\u0080\u0099s because New Yorkâ\u0080\u0099s pandemic reopening guidelines still ban the public from going to live TV shows â\u0080\u0094 unless the show pays its crowd like cast members. Here are four of the most buzzed-about moments from â\u0080\u009cSaturday Night Liveâ\u0080\u0099sâ\u0080\u009d Season 46 premiere over the weekend. Jim Carreyâ\u0080\u0099s Joe Biden squares off against Alec Baldwinâ\u0080\u0099s Donald Trump for the first time â\u0080\u009cSNLâ\u0080\u0099sâ\u0080\u009d cold open took on last Tuesdayâ\u0080\u0099s presidential debate, with the announcer noting, â\u0080\u009cTuesday feels like 100 days ago.â\u0080\u009d Carrey waltzed out with a big grin and Bidenâ\u0080\u0099s signature aviator sunglasses, and made a show of measuring whether his and Trumpâ\u0080\u0099s podiums were a socially-distanced six feet apart. Baldwinâ\u0080\u0099s Trump interrupted Carreyâ\u0080\u0099s Biden repeatedly, leading Carrey to take out a remote control at one point and hit a mute button to stop Baldwin from interrupting again. â\u0080\u009cI believe in science and karma,â\u0080\u009d Carreyâ\u0080\u0099s Biden said. â\u0080\u009cNow, just imagine if science and karma could somehow team up to send us all a message about how dangerous this virus can beâ\u0080¦â\u0080\u009d he continued, alluding to Trumpâ\u0080\u0099s later COVID-19 diagnosis. Rudolphâ\u0080\u0099s Harris also came out during the middle of the debate to tell the â\u0080\u009cboysâ\u0080\u009d to try to get the debate back on the rails, and referred to herself as the â\u0080\u009cHVPICâ\u0080\u009d (aka Hot Vice President in Charge.) Watch it here: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Chris Rock skewers the U.S. government during his opening monologue The comedy star and former â\u0080\u009cSNLâ\u0080\u009d cast member opened by referencing Trumpâ\u0080\u0099s COVID hospitalization (â\u0080\u009cMy heart goes out to COVID,â\u0080\u009d he said) and noting that heâ\u0080\u0099s been tested for the virus so much this week, â\u0080\u009cI havenâ\u0080\u0099t had so much stuff up my noise since I shared a dressing room with Chris Farley.â\u0080\u009d But he got more serious addressing Americansâ\u0080\u0099 relationship to their government. â\u0080\u009cDoes it work?â\u0080\u009d he asked, suggesting that it should be scrapped in favor of a new system. â\u0080\u009cWeâ\u0080\u0099ve agreed in the United States that we should not have kings, yet we have dukes and duchesses running the Senate and the Congress, making decisions for poor people,â\u0080\u009d he said. â\u0080\u009cRich people making decisions for poor people â\u0080\u0093 thatâ\u0080\u0099s like your handsome friend giving you dating advice.â\u0080\u009d Watch it here: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } The audience was made up of first responders The show treated the men and women whoâ\u0080\u0099ve been working on the front lines during the pandemic to the best seats in the house. â\u0080\u009cSNLâ\u0080\u009d is the first live network TV show to bring back an in-studio audience during the pandemic. Everyone was tested for the virus beforehand, and they wore masks while sitting in the audience. Crew members wore masks, and the band was socially distanced, as well. Rock gave the first responders a special shout out, and joked that, â\u0080\u009cTheyâ\u0080\u0099re so good, we let people die tonight so they could see a good show.â\u0080\u009d Many viewers, including tennis legend Billie Jean King, praised the move on social media. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } And as an added bonus, the audience was paid to attend, as part of a loophole around New Yorkâ\u0080\u0099s reopening rules, which still ban the public from going to live TV shows. Sean Ludwig, who attended the â\u0080\u009cS.N.L.â\u0080\u009d premiere, told the New York Times that he and seven friends who had gone with him each received a check for $150 from Universal Television, a division of NBCâ\u0080\u0099s parent company, after the show. â\u0080\u009cWe had no idea we would be paid before we were handed checks,â\u0080\u009d Ludwig said. â\u0080\u009cWe were all very pleasantly surprised.â\u0080\u009d Megan Thee Stallion makes a Black Lives Matter statement during her performance The â\u0080\u009cSavageâ\u0080\u009d and â\u0080\u009cDonâ\u0080\u0099t Stopâ\u0080\u009d rapper paused her first ever â\u0080\u009cSNLâ\u0080\u009d set to play audio from equal rights activists such as Malcolm X while screens behind her flashed messages like â\u0080\u009cProtect Black Women,â\u0080\u009d or shattered with images of bullet holes. â\u0080\u009cWe need to protect our Black women, and love our Black women ... because at the end of the day we needÂ our Black women,â\u0080\u009dÂ she said, before also stating that Black men need to be protected and have people stand up for them. â\u0080\u009cBecause at the end of the day, weâ\u0080\u0099re tired of seeing hashtags of our Black men,â\u0080\u009d she added, referencing the deaths this year of Ahmaud Arbury and George Floyd, as well as Breonna Taylor, which have spurred protests for equality and against police brutality across the country. Watch it here: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } â\u0080\u0098Weekend Updateâ\u0080\u0099 pays tribute to the late Ruth Bader Ginsburg The segment recapping the news of the week ended with the camera cutting to the audience, where actress and comedian Kate McKinnon sat dressed as the late Supreme Court Justice, complete with RBGâ\u0080\u0099s signature lace collar. The actress then put her hand over her heart and bowed her head, and a message reading â\u0080\u009cRest in Powerâ\u0080\u009d was shown on the screen. iframe.twitter-tweet { width: 100% !important; } Stay up-to-date with MarketWatchâ\u0080\u0099s election coverage here."}]}