{"article": [{"url": "https://www.marketwatch.com/story/thousands-in-silicon-valley-in-danger-of-eviction-as-end-of-california-moratorium-nears-2020-07-22", "published": 1595682080.0, "headline": "Thousands in Silicon Valley in danger of eviction as end of California moratorium nears", "body": "More than 43,000 households in the heart of Silicon Valley face eviction in the next few months even as local technology companies’ valuations soar, according to new research published Wednesday, in what could become a national crisis as eviction moratoriums expire during the coronavirus pandemic. With eviction bans scheduled to end next month, landlords feeling economic pain too are agitating to kick out tenants in California and elsewhere as COVID-19 cases continue to rise. In Santa Clara County, the home to Apple Inc. AAPL, +1.74% , Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% and hundreds of other tech companies, lower-paid workers who have helped those tech giants prosper could soon find themselves without a place to live. Working Partnerships USA and Law Foundation of Silicon Valley estimate that 43,490 renter households in Santa Clara County are at risk of eviction, about 16 times the typical number of evictions in a full year for the county. Most of these tenants are disproportionately people of color, women, and families with children who are not receiving unemployment insurance or income help. In addition, Americans receiving unemployment benefits could soon see that aid reduced significantly, which could put thousands more families in a similar position, the nonprofit Working Partnerships, based in San Jose, Calif., reported. Jeffrey Buchanan, director of public policy at Working Partnerships and co-author of the newly published report, said some of the affected workers his organization has helped are janitors, cafeteria workers or security guards at tech companies in the valley. Many tech companies in the area have closed their campuses amid shelter-in-place orders. While mostly higher-paid employees are working from home, the workers whose jobs required them to be onsite have either had to show up or risk their hours being cut or their positions eliminated. The region’s Black and Latinx tenants are particularly hard hit, Buchanan said, while “we see billionaires here in Silicon Valley that despite a pandemic and recession are adding billions of dollars to their net worth.” For everybody in danger of being forced from their homes, time is of the essence as the Santa Clara County moratorium on evictions expires Aug. 31, and California’s statewide moratorium will end Sept. 30. “We could see a massive rate of evictions without intervention,” state Assemblyman David Chiu, D-San Francisco, said. “It would be catastrophic during this pandemic.” From March: U.S. cities temporarily ban evictions as coronavirus outbreak worsens The extra $600 a month some households are receiving from the federal government in unemployment benefit is set to end this month, and a bill dubbed the HEROES Act that would extend those payments and establish a national eviction moratorium has been passed by the House but not reached the floor of the Senate. Silicon Valley is already notorious for its high housing prices and an economic split between workers in the tech industry and others, but evictions could exacerbate not just the coronavirus pandemic but also double or triple the homeless population in the area, according to the report. “What I’ve seen in our community is so many single African-American women and Latino women who are struggling… because we can’t find the help in this very rich valley,” said Sharon, a renter who joined a call with journalists Wednesday. See also: Black Americans face an unequal housing market — and coronavirus could make it worse Sharon, who is Black, said she has lived in Santa Clara County for 45 years and lost her job working with at-risk youth in March because of the pandemic as well as losing a part-time job with an event company. Though she recently found a job in community outreach, she has fallen behind in paying for the room she rents. “I’ve received many 30- and 60-day notices and threats of calling the police” from her landlord, she said. “I go to work stressed.” Another tenant on the press call, Carolina, said she is a single Latina mom of four who has worked as a waitress and cashier but is ineligible for unemployment because she was being paid in cash. She is now looking for a job and has fallen behind on rent on her apartment as well as her other bills. The Law Foundation of Silicon Valley has received a couple of thousand calls for help since the shelter-in-place began in March, said Nadia Aziz, directing attorney of the organization. “Tenants aren’t going to be able to pay tens of thousands of dollars in back rent in the six months to a year that the county ordinance requires,” she said. The Law Foundation and Working Partnerships recommend making moratoriums permanent throughout this emergency, along with more legal assistance, resources for renters, and government action such as rent relief or cancellation. Also see: Joe Biden has called for rent forgiveness during the coronavirus pandemic — here’s how that would work State lawmakers are working on potential solutions. Chiu has written Assembly Bill 1436, which seeks to ban evictions of tenants during the pandemic as well as provide mortgage forbearance to their landlords “We appreciate the incredibly acute situations millions of Californians are in right now,” he said in an interview with MarketWatch on Tuesday. Chiu said his bill addresses “two halves of a very challenging coin,” because both tenants and landlords are affected by the economic crisis sparked by COVID-19. AB 1436 has passed the state Assembly and is now being considered by the state Senate Judiciary Committee. A study published in May by the Luskin Institute on Inequality and Democracy at UCLA estimated that in Los Angeles County, 365,000 renter households — concentrated in neighborhoods with large percentages of low-income people of color — are in danger of being evicted. Buchanan pointed out that because California housing costs are so high, these scenarios could occur up and down the state. And the danger exists throughout the nation: In New York City, advocates say 50,000 renters risk eviction. For more: Mass evictions are the next crisis that could hit New York City At the national level, the HEROES Act includes a 12-month moratorium on evictions, $100 billion in emergency rental assistance, $15 billion to support homeless shelters and to prevent outbreaks of the coronavirus. It has been passed by the House but is awaiting a vote in the Senate. “This is really a call to action,” Buchanan said. “If Black Lives Matter, if we really care about racial justice, acting on this eviction time bomb is really critical.”"}]}