{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-slip-as-stock-market-fights-to-end-the-week-higher-2020-08-21", "published": 1598027780.0, "headline": "S&P 500, Nasdaq set fresh records, Dow adds 200 points as investors cheer economic data", "body": "U.S. stock indexes remained buoyant Friday, touching fresh records supported by positive economic data, but trading volume was low and some analysts noted that the rally remains dependent on a few large capitalization technology names. The S&P 500 posted a new record close after its longest winning streak since the week ending December 27, 2019 when the market rose for five straight weeks, according to Dow Jones Market Data. How did stock benchmarks faring? The Dow Jones Industrial Average DJIA, +0.56% rose 190.60 points, or 0.7%, to close at 27,930.33, and the S&P 500 SPX, +0.87% added 11.65 points, or 0.3%, to close at 3,397.16, notching its second record of the week. The Nasdaq Composite Index COMP, +1.39% also closed at a fresh high of 11,311.80, up 46.85 points or 0.4%, after carving out a new intraday record high at 11,323.71. It was the tech-heavy Nasdaq’s 36th record close in 2020. Separately, the small-capitalization Russell 2000 index RUT, +0.55% , viewed as a bet on the health of the economy, lost .8% to close at 1,552.47, while the large-capitalization focused Nasdaq-100 index NDX, +1.51% was up 0.7% to 11,555.16. For the week, the Nasdaq Composite gained 2.7%, the S&P 500 added 0.7%, and the Dow was flat, FactSet data show. The S&P 500 posted its longest winning streak since the week ending December 27, 2019 when the market rose for five straight weeks, according to Dow Jones Market Data. What drove the market? “It’s a grind right now,” said Keith Lerner, chief market strategist for Truist/SunTrust Advisory Services, in an interview with MarketWatch. Lerner calls another round of congressional aid a “when, not if” and expects something to be achieved without too much market drama. With so much economic data over the past few months having surprised to the upside, there will be a higher bar for positive market reaction to fresh data, he said. Still, his analysis shows that on average, one year after an all-time high, stocks are up 9.2%. For now, Lerner said, “We are in a seasonably choppier time heading into elections. We might get some consolidation. Until things change you still want to stick with what’s working. Technology, homebuilders, other areas like industrials are starting to look a little better. Don’t force the value trade, wait for confirmation.” In economic data, the U.S. IHS purchasing managers indexes for August were better than expected, with a flash reading for manufacturing at 53.6, a 19 month high, and up from 50.9 in July. The service sector index rose to 54.8 for August, a 17 month high, and up from 50 in July. A reading of 50 or above indicates improving conditions. In other economic reports, a report on sales of existing homes in the U.S. rose 24.7% between June and July to a seasonally-adjusted annual rate of 5.86 million, the National Association of Realtors reported Friday. It was the second month consecutively in which the monthly increase was the largest on record, according to the trade group. Compared with a year ago, sales were up 8.7% in July. “Low mortgage rates and strong demand, including from households looking for larger homes in less densely populated areas, continue to support home sales,” wrote Nancy Vanden Houten, lead economist at Oxford Economics in a Friday note. “Still, further gains in sales will come more slowly. Mortgage purchase applications stalled in July and August, and going forward, a slow economic recovery and a still-weak labor market will limit the upside for home sales,” she wrote. However, an ongoing stalemate in Congress on producing another coronavirus financial aid plan and light trading volumes during the seasonally slower August session have contributed to choppy trade over the week. Meanwhile, health-care news favored bullish investors, with Pfizer Inc. PFE, -0.27% and BioNTech BNTX, +1.23% saying that they are track to submit a COVID-19 vaccine candidate as early as October, while Johnson & Johnson JNJ, +1.39% said it was beginning the latter phases of its large vaccine trials. The power of technology stocks reasserted itself this week with the Nasdaq Composite posting its 35th record close of 2020 this week, and Apple AAPL, +1.74% rose to a new all time high intraday Friday. Chevron CVX, -1.62% and Exxon Mobil XOM, -1.47% dropped as oil prices fell. On the bearish side of the ledger, a report from Reuters indicated that the U.S. has not confirmed plans to meet with China to check on their adherence to the trade deal signed in January, despite comments from Chinese officials on Thursday. Democratic presidential candidate Joe Biden is not likely to ease Sino-American tensions either should he be elected in November and may aim to further crack down on the country’s human rights violations, according to a report from the Nikkei Asian Review, which came as the former vice president accepted his party’s nomination for president on Thursday night, casting himself as a salve to a nation wounded by the policies of President Donald Trump. In health news, the U.S. daily case tally of the coronavirus that causes COVID-19 increased to 46,029 on Aug. 20, according to New York Times Data, as there were at least 1,042 fatalities, the third-straight day that the death toll topped 1,000. As of Friday morning, the U.S. remained first globally with 5.58 million cases and 174,290 deaths, according to Johns Hopkins University data, has was still third in the world with 1.95 million recovered. Which stocks were in focus? Ride-hailing companies Uber Technologies Inc. UBER, -0.18% and Lyft Inc. LYFT, +2.16% were in focus on Friday after they won more time Thursday in their appeal of a ruling that ordered them to immediately classify their drivers as employees in compliance with state law. Shares of Uber were down 1.9%, while those for Lyft closed 2.8% lower. Shares of Tesla Inc. TSLA, +1.89% extended the recent run up to their first-ever close above the $2,000 mark, and to buck the weakness seen in its peers and the broader stock market. Shares gained 2.4% and are now up 390% in the year to date. Shares of Foot Locker Inc. FL, -0.80% rose 1.4% Friday, after the athletic shoe and gear retailer reported a fiscal second-quarter profit that topped forecasts and a big same-store sales beat. Shares of Deere & Co. DE, +0.24% surged more than 4% toward a record high Friday, after the agriculture and construction equipment maker reported fiscal third-quarter profit and revenue that were well above expectations, while providing a somewhat upbeat outlook. Apple’s stock AAPL, +1.74% also extended a climb after touching a market value of $2 trillion. Shares rallied more than 5%, extending its four-week gain over 32%, its best 4-week performance since April 2009, according to Dow Jones Market Data. Amazon.com’s shares AMZN, +3.01% were in focus after a key executive, Jeff Wilke, announced his retirement in 2021. The stock was off 0.4%. How did other markets fare? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 1.2 basis points to 0.64% as European economic data surprised to the downside. Bond prices move inversely to yields. December gold futures GCZ20, +2.17% seesawed through the day, settling less than 0.1% higher, at $1,947 an ounce on Comex on concerns about demand, and marking its second straight weekly decline. The U.S. crude benchmark CL00, -1.62% declined 1.2%, with the most-actively traded October contract falling 48 cents to settle at $42.34 a barrel on the New York Mercantile Exchange. Global equities were on the backfoot. China’s CSI 300 000300, +2.04% rose 0.9% and Japan’s Nikkei NIK, -0.11% closed 0.2% higher. The Stoxx Europe 600 SXXP, +0.55% closed at 365.09, down 0.15%. The U.K.’s FTSE benchmark UKX, +0.64% closed 0.2% lower at 66.10. In currencies, the greenback was up 0.5% against its major rivals at 93.28, based on trading in the ICE U.S. Dollar Index DXY, -0.58%. See:Is the stock market more important to the economy than the $600 unemployment benefit?"}]}