{"article": [{"url": "https://www.marketwatch.com/story/netflix-promotes-ted-sarandos-to-co-ceo-showing-importance-of-original-content-2020-07-16", "published": 1594968200.0, "headline": "Netflix promotes its Mr. Hollywood to co-CEO, showing importance of original content", "body": "While investors may have paid more attention to Netflix Inc.’s disappointing forecast for the second half Thursday afternoon, the promotion of Chief Content Officer Ted Sarandos to co-chief executive may be the bigger news of the day because of what it says about Netflix and where it is headed. Netflix NFLX, +1.43% explained the move as confirmation of what has been in place for many years, with CEO Reed Hastings referring to Sarandos as his partner for two decades. What it really says, though, is that Hollywood is just as important, or possibly more so, than Silicon Valley to a company that has developed differently than just about any other high-profile tech startup from the Bay Area. Sarandos is seen among investors as Mr. Hollywood — the main face of the company in Los Angeles among the movie studios, where he oversees teams cutting deals with existing studios and acquiring content — while Chief Product Officer Greg Peters is Silicon Valley, making sure the company’s streaming technology is working and supporting all its new subscribers and content. The moves are also clearly succession planning by the company, as co-founder Hastings approaches retirement age. “Ted has done a phenomenal job with content, and it’s clear that as he approaches 60, Reed would like to spend more time on his other interests, so the transition makes sense,” said Wedbush Securities analyst Michael Pachter in an email. More from Therese: An obscure court ruling could play havoc with tech companies’ earnings With this announcement, Netflix is obviously messaging that its next leader will be the man in L.A. lunching with showbiz moguls, not the executive in Los Gatos, Calif., making sure the servers are running and the algorithms are working. Sarandos will retain his title of chief content officer and will also serve as a director on Netflix’s board. Peters was appointed chief operating officer in addition to his chief product officer role, and is set up to be the No. 2 to Sarandos after Hastings takes his leave. “This change makes formal what was already informal — that Ted and I share the leadership of Netflix,” Hastings said Thursday. Sarandos has been with Netflix since 2000, and like one of the main characters in Netflix’s popular Canadian sitcom “Schitt’s Creek,” he made his name in business first in the video-rental market. Before he joined Netflix, he was vice president of product and merchandising at the video-rental chain Video City/West Coast Video, but grew quickly into a key role at Netflix after he joined. He also is credited for getting Netflix started in original content. When asked during the company’s analyst interview if his promotion meant that Hastings would now have more time to relax, Sarandos said that was unlikely. “We should start by saying that the chances that Reed is going to relax a little more are very low,” he said, adding that Hastings has been his role model for the past 20 years. “We have navigated some of the toughest decisions the company has made over the years, decisions from mailing DVDs around the U.S. to streaming around the world,” he said. Full earnings coverage: Netflix adds more than 10 million new subscribers, but stock is tanking While the two executives have guided the streaming giant to where it is today, there are clearly new challenges ahead, as the company’s big subscription lift from sheltering in place appears to be over. One of those may be the co-CEO structure, which Chaim Siegel of Elazar Advisors LLC pointed out can be difficult for companies to navigate. “Reed Hastings is the genius behind Netflix. Succession plans mean at some point he’s leaving,” he said. “Sarandos has done an incredible job, of course, on the content side, but there’s no replacing Reed. Co-CEOs are also not an amazing structure for companies.” Netflix will have to navigate some treacherous waters in the next year with the two executives sharing the helm. In June, the number of paid net additional subscribers was actually down, Siegel pointed out. Adding additional pressure, for the first half of next year, new content will be slower in coming, as production for new shows has been disrupted due to the coronavirus pandemic. “Year-to-date numbers are only supposed to build through the year. So based on end-of-quarter net cancellations, their guide for member growth is actually not conservative. If they were to see more net cancellations in July, August, this is going the wrong way.” Netflix said as the world reopens slowly from COVID-19 lockdowns, its priority is to restart production safely and in a manner consistent with local health standards. Programming for 2020 remains largely intact, but for 2021, paused productions will lead to big titles launching in the second half. Those titles were largely a result of Sarandos’s work in Southern California, and he is being rewarded with a prime placement at the top of one of the biggest names in tech. If he is able to navigate the rest of the COVID-19 pandemic along with Hastings, it appears Netflix will be led by its Mr. Hollywood for years to come."}]}