{"article": [{"url": "https://www.marketwatch.com/story/mike-bloomberg-pledges-100-million-to-help-joe-biden-win-florida-2020-09-13", "published": 1600077860.0, "headline": "Mike Bloomberg pledges $100 million to help Joe Biden win Florida", "body": "WASHINGTON (AP) — Former New York City Mayor Michael Bloomberg is committing at least $100 million to help Joe Biden’s presidential campaign in the crucial battleground state of Florida. Bloomberg’s late-stage infusion of cash reflects Democrats’ concerns about the tight race in a state that is a priority for President Donald Trump. A victory for Biden in Florida, the largest of the perennial battleground states, would significantly complicate Trump’s path to reaching the 270 Electoral College votes needed to secure a second term. Republicans, however, feel confident in their chances in the state, pointing to GOP wins in 2018 and stronger-than-expected turnout in 2016 as evidence the state is trending in their direction. They’ve invested millions in Florida focused on Latino outreach and boosting their field operation, and the state’s size and diversity makes campaigns there expensive. The billionaire Bloomberg launched his own campaign for the Democratic nomination late last year amid worries about Biden’s strengths. Despite spending $1 billion on his campaign, Bloomberg struggled and dropped out in March, quickly endorsing Biden. One of the world’s wealthiest men with a net worth estimated to exceed $60 billion, Bloomberg promised throughout his campaign that he would help Democrats try to defeat Trump regardless of how his own White House bid fared. Former New York City Mayor Mike Bloomberg, here delivering remarks at a campaign rally on Feb. 12 in Nashville, Tenn., said when he dropped out of the race for the Democratic nomination that he would do “whatever it takes” to defeat Donald Trump in November. Getty Images He exited the presidential race pledging to spend “whatever it takes” to defeat Trump, and has already invested millions to support Democrats up and down the ballot. Bloomberg transferred $18 million from his presidential campaign to the Democratic National Committee, and transferred its offices in six key swing states to the local Democratic parties there. The businessman has contributed $500,000 to Voto Latino to help register Latino voters, $2 million to the group Collective Future to help register African American voters, and $2 million to Swing Left, a group focused on electing Democrats in swing districts. One of the groups he has founded and funds, Everytown for Gun Safety, has committed to spending $60 million on elections this cycle, and Bloomberg himself has pledged another $60 million to support Democrats in House races. Bloomberg’s new spending is intended to boost Biden before the start of early voting in Florida, which begins on Sept. 24. A Bloomberg adviser said much of the money will go to television and digital advertising. Republicans are outspending Democrats by about $8 million in the state in future television ad reservations, according to a review of Kantar/CMAG data by the Associated Press."}]}