{"article": [{"url": "https://www.marketwatch.com/story/u-s-bond-fund-giant-says-gold-still-has-plenty-of-luster-11598374682", "published": 1598360780.0, "headline": "U.S. bond fund giant says gold still has plenty of luster", "body": "(Photo by DAVID GRAY/AFP via Getty Images) The impressive run-up in gold prices this year doesn’t spell the end of the shiny metal’s gains, according to Pimco. Nicholas Johnson, a portfolio manager at the bond fund giant, said in a Monday blogpost that gold still has potential to rally further based on where it stands relative to inflation-adjusted, or real, yields. “Gold remains attractively valued – one might even say cheap – in the context of historically low real interest rates,” said Johnson. Enthusiasm for gold has cooled in recent days as prices for the shiny metal retreat from their all-time highs hit earlier this month. Gold futures for December were down $17, or 0.9%, to $1,922.50 an ounce on Tuesday, on the New York Mercantile Exchange. Gold hit records earlier in August 6 at a high of $ 2051.50 an ounce. Even after falling from this all-time high, it remains up more than 24% year-to-date. Though gold can be influenced by many factors, Johnson sees inflation-adjusted yields, or the real yield, as the ultimate driver of the precious metal’s movements in the last few decades. As an inflation hedge, gold has effectively a real yield of zero. So a declining inflation-adjusted yield for Treasurys should make gold look more attractive. Since 2006, a one percentage point drop in real yields for U.S. Treasury debt has translated into a 30% jump in gold prices, according to Pimco’s calculations. It’s why many see the negative real yields offered by long-term U.S. Treasurys due to the Fed’s ultra-accommodative policy stance as the key reason why gold has set new heights this year. Yet even after hitting all-time highs, Johnson says gold prices should have risen more relative to where real yields stand. He argues the value of gold has stayed steady since 2012 based on a metric of the metal’s price relative to the real yield in Treasurys. Looking at this valuation gauge, some might see gold as “cheap,” said Johnson, highlighting the chart below. The risk to Pimco’s bullishness on gold, of course, is a surge in real yields, a move that could unravel the precious metal’s surge this year. But with the Federal Reserve signalling it will keep monetary policy unchanged unless unemployment recovers and inflation resurfaces, that danger is likely to remain diminished. Read: Powell to speak next Thursday on Fed’s new inflation-friendly strategy In other markets, the S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% were flitting between gains and losses, after establishing new records at the start of the week."}]}