{"article": [{"url": "https://www.marketwatch.com/story/mayor-of-portland-oregon-tear-gassed-by-federal-agents-2020-07-23", "published": 1595544740.0, "headline": "Portland remains tense after mayor is among those tear-gassed by federal agents", "body": "PORTLAND, Ore. — The tense standoff between demonstrators and federal police dispatched to Portland, Oregon, dragged on Thursday after the city’s mayor was tear-gassed by U.S. government agents as he made an appearance outside a federal courthouse during raucous protests. Mayor Ted Wheeler and hundreds of others Wednesday night were objecting to the presence of federal police sent by President Donald Trump, who labeled the demonstrators as “agitators & anarchists” after Wheeler was gassed. Also, late Thursday a federal judge specifically blocked federal agents from arresting or using physical force against journalists and legal observers at the ongoing Portland protests. The lawsuit was filed by the American Civil Liberties Union. U.S. Judge Michael Simon previously ruled that journalists and legal observers are exempt from police orders requiring protesters to disperse once an unlawful assembly has been declared. Federal lawyers had said that journalists should have to leave when ordered. “This order is a victory for the rule of law,” Jann Carson, ACLU of Oregon’s interim executive director, said in a statement. A freelance photographer covering the protests for The Associated Press submitted an affidavit that he was beaten with batons, chemical irritants and hit with rubber bullets this week. The ACLU lawsuit is one of several filed in response to law enforcement actions during the protests. The state of Oregon is seeking an order limiting federal agents’ arrest powers during the demonstrations. On Wednesday night Wheeler, a Democrat, appeared slightly dazed and coughed and said it was the first time he’d been tear-gassed. He put on a pair of goggles someone handed him and drank water but did not leave his spot at the front of the raging demonstration — with protesters lighting a large fire between protective fencing and the Mark O. Hatfield Federal Courthouse amid the pop-pop-pop sounds of the federal agents deploying tear gas and stun grenades into the crowd. It wasn’t immediately clear if the agents knew Wheeler, a 57-year-old sixth-generation Oregonian and longtime politician, was among those in crowd when they used the tear gas. Earlier in the night, Wheeler was mostly jeered by protesters as he tried to rally the demonstrators who have clashed nightly with federal agents. But they briefly applauded when he shouted “Black Lives Matter” and pumped his fist in the air. Trump in his tweet attempted to ridicule Wheeler, calling him the “Radical Left Mayor of Portland, who last night was booed & shouted out of existence by the agitators & anarchists.” Wheeler has opposed federal agents’ presence in Oregon’s largest city but has also faced harsh criticism from the protesters, who yelled and swore at him. Ignoring the pushback, Wheeler told those out gathered outside the courthouse that he wanted to “thank the thousands of you who have come out to oppose the Trump administration’s occupation of this city.” The Justice Department’s inspector general said Thursday it will conduct a review of the conduct of federal agents who responded to unrest in Portland and in Washington, D.C., after concerns emerged from members of Congress and the public. Wheeler has been accused by critics including city council members of not reining in local police who used tear gas multiple times on protesters before federal agents arrived early this month in response to nearly two months of nightly protests since George Floyd was killed. And city business leaders have condemned Wheeler for not bringing the situation under control before the agents showed up. On Thursday, City Commissioner Jo Ann Hardesty, the first Black woman elected to that role, said the arrival of federal agents had reignited protests that had been starting to die down after weeks. “The reason why we have thousands of people on the street every night is because Portlanders are not going to set back when they see an injustice happening. They’re going to come and they’re going to stand on a line,” said Hardesty. Hardesty also apologized for saying Wednesday that she believed police officers were setting fires to justify violence against protesters. Department of Homeland Security acting Secretary Chad Wolf denied that federal agents were inflaming the situation in Portland. He told “CBS This Morning” that Wheeler legitimized criminality in the city by going to the front of the crowd of demonstrators where the fires were lit and that people were trying to pull down a fence erected to shield the federal courthouse. Wheeler did not participate in lighting any of the fires or attempting to tear down the fence and was surrounded by his security team when he was gassed. Earlier, protesters held signs saying “Tear Gas Ted” in a reference to Wheeler and his leadership of the Portland Police Bureau, which used the substance on protesters before federal agents arrived in the city in early July. As Wheeler left the protest zone about 12:40 a.m. Thursday, one person shouted that he should be there “every single night.” Less than an hour later, police said the crowd threw Molotov cocktails, lit fires in a park and in trash cans and released hundreds of gallons of water from fire hydrants. The police bureau in response declared that there was a riot at the site and threatened to use tear gas but officers never did and made no arrests. Wheeler’s appearance in the protest zone came hours after state attorneys for Oregon urged a judge to issue a restraining order against agents deployed to tamp down on the protests. The arguments came in a lawsuit filed by Oregon Attorney General Ellen Rosenblum, who accused federal agents of arresting protesters without probable cause, whisking them away in unmarked cars and using excessive force. Federal authorities have disputed those allegations. The lawsuit is part of the growing criticism of Trump’s order that sent the federal agents to Portland and pending orders for them to head to Chicago and Albuquerque, New Mexico, to fight rising crime. The court hearing focused on the actions of the more than 100 federal agents responding to protests outside the Portland courthouse. The motion asks U.S. District Judge Michael Mosman to command agents from the Department of Homeland Security, Customs and Border Patrol, Federal Protective Service and U.S. Marshals Service to immediately stop detaining protesters without probable cause, identify themselves and their agency before arresting anyone, and explain why an arrest is taking place."}]}