{"article": [{"url": "https://www.marketwatch.com/story/why-sen-kamala-harriss-telling-vice-president-mike-pence-i-am-speaking-is-resonating-with-so-many-women-online-2020-10-07", "published": 1602141980.0, "headline": "Why Sen. Kamala Harrisâ\u0080\u0099s telling Vice President Mike Pence, â\u0080\u0098I am speaking,â\u0080\u0099 is resonating with so many women online", "body": "While Wednesday nightâ\u0080\u0099s vice-presidential debate was much more civil than last weekâ\u0080\u0099s interruption-intensive face-off between the presidential candidates, Vice President Mike Pence and Sen. Kamala Harris also talked over each other at times â\u0080\u0094 and Joe Bidenâ\u0080\u0099s running mate wasnâ\u0080\u0099t having it. â\u0080\u009cMr. Vice President, I am speaking.â\u0080\u009d â\u0080\u009cIf you donâ\u0080\u0099t mind letting me finish, we can have a conversation.â\u0080\u009d â\u0080\u009cHe interrupted me, and Iâ\u0080\u0099d like to just finish, please.â\u0080\u009d By CBS Newsâ\u0080\u0099s count, Pence interrupted Harris 10 times, which was twice as many times as the five instances when Harris cut in on him. Pence spoke for 38 minutes in total, and Harris spoke for 35. And Harrisâ\u0080\u0099s repeated refusal to let Pence talk over her led to these quotes trending on Twitter on Wednesday night, and the hashtag #imspeaking to continue trending on Thursday morning. And many tweets featured other women calling out how often they have experienced similar interruptions in their lives, particularly at work. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } In fact, when CNN analyst Gloria Borger attempted to explain why Harris pushing back against being interrupted was so significant during a panel following the debate, Former Republican Sen. Rick Santorum interrupted her â\u0080\u0094 leading Borger to respond with, â\u0080\u009cMr. Santorum, Iâ\u0080\u0099m speaking.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } Research shows that these women have a point. Several studies of differences in speech patterns between genders since the 1970s have found that men are more likely to interrupt other people â\u0080\u0094 and they interrupt women the most. A landmark Stanford University study in 1975 featured researchers listening in on conversations in coffee shops and drugstores, and counting the interruptions committed by men and women during these chats. Only one interruption in the 48 they counted was made by a woman. Thatâ\u0080\u0099s one in 48. â\u0080\u009cMen deny equal status to women as conversational partners with respect to rights to the full utilization of their turn and support for the development of topics,â\u0080\u009d the researchers concluded. A 1983 study on â\u0080\u009cInterruptions and Nonverbal Gender Differencesâ\u0080\u009d noticed that men interrupted women more when the ladies leaned away, smiled and didnâ\u0080\u0099t look at the person they were speaking to. Harris, many viewers noticed, leaned in and often looked directly at Pence while she was speaking Wednesday night. iframe.twitter-tweet { width: 100% !important; } By 2014, a George Washington University study found the overall interruption gap between men and women closing, with both genders butting in when it wasnâ\u0080\u0099t their turn at similar rates. But women were still getting talked over more â\u0080\u0094 by both men and women. Men interrupted 33% more when they were speaking with women, cutting women off 2.1 times during a three-minute conversation, but only talking over other men 1.8 times. The women in the study only interrupted men once, on average, during a three-minute conversation â\u0080\u0094 but they interrupted other women 2.8 times. Women also have to fight to get a word in edgewise on the highest court in the land. Researchers from the Northwestern Pritzker School of Law analyzed 15 years of oral-argument transcripts for the Supreme Court of the United States. And they found that male justices interrupted female justices about three times more often than they interrupted other men. And it only got worse as more women joined the court. When former Justice Sandra Day Oâ\u0080\u0099Connor was the only woman on the bench in 1990, 35.7% of interruptions were of her. When Oâ\u0080\u0099Connor was joined by the late Justice Ruth Bader Ginsburg in 2002, 45.3% of all interruptions were directed at them. And when Ginsburg, Justice Sonia Sotomayor, and Justice Elena Kagan were all on the Supreme Court in 2015, 65.9% of interruptions were directed at them. This was also not the first time that Harris has been interrupted on the national stage. She was cut off by Sen. Richard M. Burr and the late Sen. John McCain, Republicans from North Carolina and Arizona, while questioning thenâ\u0080\u0093Attorney General Jeff Sessions during a 2017 Senate Intelligence Committee hearing on Russian election interference. The same senators had interrupted her the week before as she attempted to question the deputy attorney general, Rod J. Rosenstein. This article has been updated with the CBS tally of the number of interruptions."}]}