{"article": [{"url": "https://www.marketwatch.com/story/us-initial-jobless-claims-fall-to-1-million-in-late-august-2020-08-27", "published": 1598522780.0, "headline": "U.S. initial jobless claims fall to 1 million in late August and resume downward trend", "body": "The numbers: New applications for jobless benefits fell again in late August to just above 1 million and resumed a downward trend, perhaps signaling the resumption of a gradual if painfully slow recovery in the U.S. labor market. Initial jobless claims, a rough gauge of layoffs, declined by 98,000 to 1 million in the seven days ended Aug. 22, the Labor Department said Thursday. Economists polled by MarketWatch had forecast 1 million new claims. These seasonally adjusted figures reflect applications filed the traditional way through state unemployment offices. New claims rose sharply last week after briefly falling below the 1 million mark for the first time since the coronavirus epidemic began in March, but most economists suspect problems with the seasonal adjustments or other temporary factors. The actual number of new claims suggests that might have been the case. They fell again to 821,591 and remained below 1 million for the fourth week in a row. MarketWatch is reporting select jobless claims data using actual (unadjusted) figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have become distorted by the pandemic and appear to overstate new claims at times. The number of people receiving traditional jobless benefits through the states, meanwhile, dropped by a seasonally adjusted 223,000 to another pandemic low of 14.54 million. It was the fourth straight decline. These so-called continuing claims are reported with a one-week lag and cover the seven days ended Aug 15. The actual total was somewhat lower at just under 14 million. Once again, the direction of new claims appears to have been predicted by Google searches on how to file for unemployments. Searches declined in the most recent week. Read:Google searches on how to ‘file for unemployment’ is a crystal ball for jobless claims Also: Did the expired $600 federal jobless benefit keep people from going back to work? What happened: Total new claims rose slightly to unadjusted 1.43 million last week if self-employed workers eligible under a separate federal program are counted. Just over 600,000 applied for federal benefits last week. Altogether, 27.2 million people were estimated to be receiving benefits through eight state and federal assistance programs as of Aug. 8, the latest data available. That was down from unadjusted 28.06 million in the prior week. The number of people applying for unemployment compensation has gradually declined during the summer, but they are still extremely high by historical standards. Before the pandemic new claims were running in the low 200,000s and were near a 50-year bottom. The ongoing struggles in the face of the coronavirus pandemic, what’s more, could cause layoffs to accelerate in the fall unless the economy speeds up. Earlier this week American Airlines AAL, +0.34% said it would lay off or furlough 19,000 workers because so few people are flying. Read: White House weighs options to prevent massive job cuts by airlines What’s still unclear is the effect of the expiration of a $600 federal unemployment stipend at the end of July. President Trump has authorized temporary $300 federal payments, but most states still aren’t offering the money and the extra cash is just starting to be sent out. Big picture: The economy appears to have weathered a major summer outbreak of the coronavirus better than it initially seemed. Retail sales, manufacturing production and home sales have all grown faster and Americans are starting to venture out again. Read:U.S. durable-goods orders leap 11.2% in July on strong demand for cars and trucks Yet the virus is still acting as a major brake on the economy and further progress is likely to be uneven, particularly if unemployment remains at or close to double digits. Read: Americans worry the economy will suffer for a long time even as they keep spending What they are saying? “The risk of permanent damage to the labor market remains high, which will slow the pace of recovery. The return to pre-pandemic levels of prosperity is set to be an uncertain and prolonged process,” said Rubeela Farooqi, chief U.S. economist at High Frequency Economics. “Continuing claims for unemployment are gradually falling,” said chief economist Gus Faucher of PNC Financial Services. “This indicates that some workers who lost their jobs during the pandemic are being rehired or taking new jobs, but that many others remain jobless. Unemployment in the U.S. economy is slowly declining.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose in Thursday trades. The Federal Reserve said it would adopt a new strategy on inflation targeting that gives the central bank more leeway to keep interest rates low. Low rates benefit stocks."}]}