{"article": [{"url": "https://www.marketwatch.com/story/hhs-aide-caputo-keeps-job-after-apologizing-for-claiming-cdc-conspiracy-post-election-insurrection-2020-09-15", "published": 1600191680.0, "headline": "HHS aide Caputo keeps job after apologizing for claiming CDC conspiracy, post-election insurrection", "body": "WASHINGTON — A Trump health appointee who is accused of trying to muzzle an important scientific report in the midst of the coronavirus pandemic apologized Tuesday for a separate video in which he reportedly says scientists battling the virus are conspiring against President Donald Trump and warns of shooting in America if Trump loses the election. Michael Caputo, the top spokesman for the Department of Health and Human Services, apologized to his staff for the Facebook video, said an administration official, who spoke on condition of anonymity to discuss internal matters. The department is standing by Caputo so far in the face of calls by congressional Democrats for his dismissal — and also for the resignation of his boss, HHS Secretary Alex Azar. But Caputo, a Trump loyalist and former New York political operative, has become a significant new problem for a White House that has struggled all year with its coronavirus response. He can be heard on an HHS podcast asserting that Democrats don’t want a coronavirus vaccine before the election in order to punish Trump. Trump has made the same assertion, with no evidence to support it, but such broadsides are not in a department spokesman’s normal portfolio. News reports alleged last week that Caputo’s office tried to take over and muzzle a scientific weekly published by the Centers for Disease Control and Prevention that publishes what is supposed to be authoritative, unvarnished information about disease-fighting efforts, including, most importantly at present, COVID-19. Then on Monday came an account of the video on Caputo’s personal Facebook page in which he accused government scientists of conspiring against Trump and suggested violence could break out after the election. Caputo was named the top HHS spokesman in April, during a tense period in relations between the White House and HHS Secretary Alex Azar. On a taxpayer-funded podcast earlier this summer he accused Democrats and the media of not wanting a coronavirus vaccine until after the elections in order to defeat Trump. “There are people in the United States government on the Democrats’ side ... (who) do not want a vaccine,” he said. “They don’t want a vaccine until November 4th,” he added, citing the day after the presidential election. It’s highly unusual to use an agency communications platform for such a blatantly political message. Over the weekend, Caputo made headlines when Politico and The New York Times reported that his office had tried to gain control over a CDC publication known as the MMWR, or Morbidity and Mortality Weekly Report. In previous administrations, political appointees in the HHS secretary’s office maintained a hands-off policy with regard to the publication from CDC, which is under the department’s umbrella. The story took a strange turn on Monday, after the Times reported about a live video hosted by Caputo on his personal Facebook page. In it, Caputo reportedly accused government scientists of conspiring against Trump as part of a “resistance.” The message turned apocalyptic when Caputo reportedly predicted that Democratic presidential nominee Joe Biden would refuse to concede defeat to Trump in the election, and violence would break out. The Associated Press was unable to independently view the video. HHS supported Caputo, with a statement that called him a “critical, integral part of the president’s coronavirus response, leading on public messaging as Americans need public health information to defeat the COVID-19 pandemic.” There was no immediate statement from the White House. Attempts to reach Caputo were unsuccessful. On Capitol Hill, Sen. Patty Murray, D-Wash., called on Azar to fire Caputo, accusing the spokesman of trying to interfere with CDC reports to the medical and scientific community, as well as the public at large. And Senate Minority leader Chuck Schumer, D-N.Y., called on Azar himself to resign, citing interference with the CDC as one example of what he termed the administration’s failures. Officials at CDC have privately complained of recent efforts by political appointees at main HHS to try to edit or press for changes in the agency’s weekly MMWR publications, a go-to resource for public health professionals. MMWR articles are technical, but they reveal telling details. One published earlier this year noted that while Trump’s travel restrictions dramatically reduced travel from China in February, nothing was being done at that time to restrict travel from Italy and Europe, where the coronavirus was spreading widely and rapidly. Analysis of virus samples from hard-hit New York in March suggested it was introduced there from Europe and other parts of the U.S., the CDC article reported. Caputo is an unswerving Trump loyalist. His recent book, “The Ukraine Hoax,” claims the president’s “phony” impeachment was rooted in a vast conspiracy. His appointment at HHS was seen as an attempt by the White House to exert more control over Azar, whom other administration officials were trying to blame for the government’s slow response in the initial weeks of the pandemic. At HHS, he’s been closely affiliated with Operation Warp Speed, the government’s effort to have millions of doses of a COVID-19 vaccine ready for distribution as soon as one is approved by the Food and Drug Administration. Caputo interviewed Dr. Moncef Slaoui, a top outside adviser to the vaccine effort, on an HHS podcast July 31. Commiserating with Slaoui over Democrats and news articles that were critical of the doctor, Caputo said: “I know that’s hard to believe, but the people who are abusing you, and who are beating down Operation Warp Speed, and the incredible historic work that’s going on, they don’t want a vaccine until November 4th. I don’t want to talk about politics here, but November 3rd is an important day. They don’t want a vaccine now because of politics, sir.”"}]}