{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-relief-effort-stalled-because-only-the-poor-are-hurting-former-fed-economist-11602177855", "published": 1602163940.0, "headline": "Coronavirus relief effort stalled because only the poor are hurting: former Fed economist", "body": "A person collects a box of food at a walk-up food distribution bank for people facing economic hardship or food insecurity, in a church parking lot in Los Angeles, California, Negotiations of another coronavirus relief bill have stalled in Washington, in part, because the pain of the pandemic has been concentrated in low-income households, a former top Federal Reserve economist said Thursday. “The experience of this recession at the top of the income ladder is just qualitatively different than it is at the bottom, said David Wilcox, now a fellow at the Peterson Institute for International Economics. “The stalling out of the fiscal negotiations may well reflect importantly the phenomenon that the hardship that is being experienced is not being experienced by political decision makers,” Wilcox said. Employment in the lowest earning sector remains 25% below its February level while employment in the highest wage category has fully returned to its pre-crisis level, he noted, during a discussion of the US. economic outlook sponsored by the Peterson Institute for International Economics. Stocks DJIA, +0.56% faltered on Thursday after lawmakers dimmed hopes of a package being completed, at least prior to next month’s election. Another reason for the failure of the talks is counter-intuitive. The $2.2 trillion CARES Act passed in March was massive and so successful, Wilcox said. Due to the the stimulus checks sent to households, personal income has remained above its February level despite the cratering of the economy, he noted. Wilcox said the economic recovery has lost momentum and every day that a fiscal package is delayed will slow the recovery further."}]}