{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-edge-lower-as-investors-await-speech-by-feds-powell-2020-08-27", "published": 1598547140.0, "headline": "Stocks pare gains but end mostly higher as Fed outlines policy shift", "body": "Stocks ended a choppy session mostly higher Thursday, with the S&P 500 index notching another record finish, after Federal Reserve Chairman Jerome Powell said policy makers would no longer pre-emptively hike interest rates to stave off inflation.What did major benchmarks do? The Dow Jones Industrial Average DJIA, +0.56% rose 160.35 points, or 0.6%, to close at 28,492.27, after trading as high as 28,633.85. The S&P 500 SPX, +0.87% ended with a gain of 5.82 points, or 0.2%, at 3,484.55. The Nasdaq Composite COMP, +1.39% , which closed at a record on Wednesday, fell 39.72 points, or 0.3%, to close at 11,625.34, after hitting an all-time intraday high of 11,730.01. What drove the market? Trade in financial markets saw relatively big swings Thursday as Powell detailed the results of the central bank’s two-year long policy review. The Fed chief outlined a framework that would allow inflation to run hotter than 2% a year after periods in which it has run below that target — as it has for most of the period since the financial crisis in 2008. Powell’s announcement briefly helped to bolster risk asset prices, as it underlined the central bank’s willingness to keep interest rates at rock-bottom for an extended period, but investors are still assessing the long-term implications of the actions. “Fed Chair Powell put investors on roller-coaster ride after unveiling a new policy framework of average inflation targeting, cementing the ‘Powell put’ of keeping interest rates anchored for years,” wrote Edward Moya, senior market analyst at Oanda in a daily note. The Powell put is a reference to the idea that the central bank would take steps to soothe markets in the event of a violent downturn much as a put option might for stocks. See: Here are the major changes to Fed’s strategy to foster jobs and stable inflation Read: Fed adopts ‘average inflation target’ of 2% as new policy It was also a busy day on the U.S. economic calendar. First-time applications for unemployment benefits came in at 1.01 million in the week ended Aug. 22, close to forecasts from MarketWatch-polled economists. Meanwhile, continuing claims fell slightly to 14.5 million. A revised reading of second-quarter gross domestic product showed the economy contracted at a 31.7% annualized pace. Which companies were in focus? Shares of Abbott Laboratories ABT, +1.02% rose 7.8% after the U.S. Food and Drug Administration granted emergency-use authorization for the company’s $5 rapid-response COVID-19 antigen test. Coty Inc. COTY, -5.08% shares fell more than 8% after the cosmetics company reported weaker-than-expected earnings for its fiscal fourth quarter as the COVID-19 pandemic crushed sales. Storage company NetApp Inc.’s NTAP, -0.84% shares rose 4% after it reported unexpected earnings and sales growth late Thursday. Shares of Box Inc. BOX, +1.01% gained 4.9% after it reported stronger-than-expected results late Wednesday along with strong sales guidance. Kitchen and home-furnishings retailer Williams-Sonoma Inc. WSM, +1.34% shares fell 7.9% despite reporting a second-quarter adjusted profit above expectations and sales that met forecasts. Abercrombie & Fitch Co. ANF, -3.02% stock soared 8.1% after the clothing retailer swung to a surprise second-quarter profit and beat sales expectations. Dollar Tree Inc. shares DLTR, +2.30% slid more than 7% after the operator of Family Dollar and Dollar Tree stores posted better-than-expected second-quarter earnings but said customer visits are declining during the pandemic. Shares of Dollar General Corp. DG, +0.95% fell 1.3% despite reporting second-quarter profit and sales that beat expectations. What did other markets do? Japan’s Nikkei 225 NIK, -0.11% fell 0.4%, while the Shanghai Composite SHCOMP, +1.67% advanced 0.6% and the Hong Kong’s Hang Seng Index HSI, -0.30% declined 0.8%. The Stoxx Europe 600 SXXP, +0.55% closed 0.6% lower, while U.K.’s FTSE 100 benchmark UKX, +0.64% lost 0.8%. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% TMUBMUSD10Y, 0.777% rose 5.8 basis points to 0.744%, its highest since June 16. Bond prices move inversely to yields. Gold futures GCZ20, +2.17% fell 0.8% to close at $1,932.60 an ounce. U.S. oil futures CL.1, -1.62% lost 35 cents, or 0.8%, to close at $43.04 a barrel on expectations crude output and refining activity in the Gulf Coast will recover quickly following Hurricane Laura. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the currency versus a basket of six major rivals, was flat."}]}