{"article": [{"url": "https://www.marketwatch.com/story/mortgage-rates-dip-slightly-as-americans-rush-to-refinance-their-home-loans-2020-10-08", "published": 1602153800.0, "headline": "Mortgage rates dip slightly as Americans rush to refinance their home loans", "body": "Mortgage rates are flirting with another record low — and that means the boom in refinancing has not yet finished. The 30-year fixed-rate mortgage averaged 2.87% for the week ending Oct. 8, down one basis point from the week prior, Freddie Mac FMCC, +0.52% reported Thursday. A few weeks ago, the average rate for the 30-year loan fell to an all-time low of 2.86%. The 15-year fixed-rate mortgage rose by a basis point to an average of 2.37%, while the 5-year Treasury-indexed hybrid adjustable-rate mortgage dropped one basis point to 2.89% on average. Mortgage rates usually roughly follow the direction of the 10-year Treasury note’s yield TMUBMUSD10Y, 0.777%, which trended upward this week. That’s not what happened this week, though. “Typically, Treasury yields and mortgage rates have a close relationship, with a movement in the former usually dictating a change to the latter,” said Matthew Speakman, an economist with Zillow ZG, -0.42%. “However, the pandemic has frayed this relationship, and mortgage rates remain much higher than you would expect them to be.” “ ‘The year-long slide in mortgage rates seems to be ending.’ ” — Sam Khater, Freddie Mac’s chief economist That mortgage rates remained roughly flat despite a week in which investors fled to the safety of bonds amid President Trump’s COVID-19 diagnosis and concerns about the state of the economic recovery from the pandemic suggests that even lower rates may not come to fruition. “The year-long slide in mortgage rates seems to be ending as rates have flattened over the last month and the economic rebound has slowed,” Sam Khater, Freddie Mac’s chief economist, said in the report. Nevertheless, homeowners continue to seek out refinancing opportunities in droves. Refinancing activity remains 50% higher than a year ago, according to the latest mortgage application index from the Mortgage Bankers Association. Low rates have pushed refinancing to the highest level since mid-August. But signs are emerging that ultra-low interest rates are no longer motivation enough for buyers, as home prices continue to increase at a fast clip across much of the country. While the number of applications for mortgages used to buy homes was 21% higher than a year ago, it was down on a weekly basis. Plus, credit remains hard to come by as lenders are giving loans only to the most creditworthy borrowers. “Historically-low mortgage rates are no longer offsetting higher prices, causing affordability challenges to take center stage in a market dominated by younger millennial buyers,” said George Ratiu, senior economist at Realtor.com."}]}