{"article": [{"url": "https://www.marketwatch.com/story/greenest-ice-in-the-nhl-amazon-names-venue-for-seattles-new-hockey-franchise-the-climate-pledge-arena-2020-06-25", "published": 1593441500.0, "headline": "'Greenest ice in the NHL' - Amazon names venue for Seattle's new hockey franchise the Climate Pledge Arena", "body": "Amazon.com Inc., the speedy delivery giant historically under fire for its impact on the environment, has purchased naming rights for Seattle's KeyArena, forgoing a corporate moniker to call the venue Climate Pledge Arena. The facility, where the city's incoming NHL franchise will play and where the WNBA's Storm already does, will use 100% renewable electricity and seek to achieve a zero-carbon footprint, Amazon AMZN, +3.01%  founder and CEO Jeff Bezos said Thursday on Instagram and in a release. NHL Seattle CEO Tod Leiweke told the Seattle Times the arena will source food locally and reduce all plastics by 2024. It's \"the greenest ice in the NHL,\" the release said. The revamped facility is expected to be the first net-zero-carbon-certified arena in the world, the company claims. It's only the latest, and perhaps most visual move yet, by Amazon to rethink its impact on the planet. The company only recently has begun revealing more about its carbon footprint. Climate Pledge signatories, of which Amazon is now a part, commit to regularly disclose data on their greenhouse gas emissions. \"[W]e're calling it Climate Pledge Arena as a regular reminder of the importance of fighting climate change,\" said Bezos. \"We look forward to working together with Oak View Group, a new Climate Pledge signatory, and NHL Seattle to inspire global climate action.\" Past critics, including the Amazon Employees for Climate Justice group, have pressured the company to raise its climate ambitions, pushing for efforts like zero-emissions goals without the use of offsets. Previously, Amazon supported offsets, which fund activities like forest preservation but fail, the critics say, to really compel companies not to pollute. Amazon relies on other companies throughout a large supply chain. \"As the arena works to deliver on its promises, it will be interesting to see if others follow suit and how these environmental initiatives can be scaled to even bigger facilities. What is immediately clear is that this has a front-line opportunity to get sustainability efforts front and center to sports fans, and essentially to the general public, particularly those that might not otherwise engage with climate-change campaigns,\" said Stephen Donofrio, principal of GreenPoint Innovations, a sustainability multimedia production company. Donofrio said the Formula 1 racing series and its shift to be carbon neutral has found traction as an effective campaign. Donofrio said his company's own large-scale public art projects, which aim to inspire communities to take climate action, draw support from environmental nonprofits, governments, and for-profits who forgo on-site naming rights to keep the emphasis on the sustainability agenda. They are able to leverage that participation and reputation-building through other communications. Amazon earlier this week said it is creating a $2 billion venture-capital fund focused on technology and transportation investments to reduce the impact of climate change, another leg of the sustainability initiatives from the retailer whose delivery formula has been in high demand during the COVID-19 lockdowns. With the pandemic boost, Amazon's stock is trading up 49% in the year to date. The S&P 500 SPX, +0.87%  is down 4.5% over the same span. Late last year, the company set a goal to meet the Paris climate agreement objectives 10 years early, with a pledge to be carbon neutral by 2040 even for its Prime one-day shipping service. Amazon said then it would work toward using 100% renewable energy by 2030 and had placed a big order for electric vans from Rivian, which the online retailer took a $440 million stake in. In the 2016 Paris pact, nearly 200 countries volunteered to reduce greenhouse gas emissions and keep global temperatures from rising no more than 2 degrees Celsius above pre-industrial levels. At the national level, the U.S. has pulled out of the agreement, which has left private concerns taking on the initiatives on their own."}]}