{"article": [{"url": "https://www.marketwatch.com/story/a-look-at-cadillacs-first-electric-car-promising-a-range-greater-than-300-miles-2020-08-25", "published": 1598332280.0, "headline": "A look at Cadillacâ\u0080\u0099s first electric car, promising a range greater than 300 miles", "body": "Cadillac Lyriq is the brandâ\u0080\u0099s first pure electric Crossover EV promises a range greater than 300 miles Rear- or all-wheel drive configurations Start of production still two years away May cost as much as the $80,000 Tesla Model X Cadillac revealed its first pure electric entry, the 2023 Cadillac Lyriq, which goes into production in late 2022. The luxury crossover SUV boasts advanced styling, though the body shape is more traditional hatchback than the sloping coupe-inspired 4-door look. The Cadilac Lyriq Cadillac Cadillac Lyriq pricing We expect the Cadillac Lyriq to cost around $80,000, which would put it directly up against the crossover EV Tesla TSLA, +1.89% Â Model X. Cadillacâ\u0080\u0099s design, offering a performance all-wheel drive version and a range of 300-plus miles, mimics the specs of the AWD-only dual-motor Model X, which offers 351 miles of range in long-range plus configuration and 305 miles in its performance variant. New design approach The 2023 Lyriq introduces a new look to Cadillac with more horizontal elements in the nose, moving away from the shield-like grilles of its conventional models. The Cadillac badge takes a prominent position beneath a slim slit that runs the width of the front deck. The division retains its vertical LED lighting elements, which form the outboard edge of triangular inlets. Lower inlets also manage airflow into the vehicle and around the battery pack. You might like: The Ariya is Nissanâ\u0080\u0099s new electric crossover SUV, and it will have some semiautonomous tech Even with the electric vehicle underpinnings, the Lyriq sports traditional proportions. The profile features a long hood, wheels pushed out to the corners, and a large glass area that ends in a C-pillar mounted rear-liftgate. Inside, the Cadillac Lyriq boasts a 33-inch wide LED screen incorporating the digital instrument cluster and infotainment center. Lyriq also incorporates a two-plane reality-enhanced head-up display. The near element shows speed, and other information, and the far plane displays navigation signals and other alerts.Cadillac Lyriq showcases SuperCruise, noise cancellation The Lyriq will employ new noise cancellation technology and enhanced audio with AKG, which will feature a 19-speaker system. Also available on the EV is advanced SuperCruise, Cadillacâ\u0080\u0099s hands-free driver-assist with automated lane change. A remote feature parks the vehicle either in a parallel or perpendicular space with the driver inside or nearby.New platform with Ultium batteries The Lyriq represents the first vehicle in what Cadillac says will be a portfolio of EVs from GMâ\u0080\u0099s GM, -0.15% Â luxury brand. This new EV will offer rear-drive as well as a performance version with all-wheel drive. The Cadillac Lyriq rides on a new, dedicated EV platform that incorporates GMâ\u0080\u0099s Ultium battery pack into the floor structure. Those cells use nickel-cobalt-manganese-aluminum chemistry. The aluminum content is said to reduce the use of rarer cobalt by as much as 70%. Also see: 8 new luxury SUVs for under $50,000 Cadillac promises fast-charge capability for Lyriq. Using DC current, the Lyriq can recharge at rates exceeding 150 kW, allowing for a full charge in less than an hour.When and where will the Cadillac Lyriq be built? Donâ\u0080\u0099t look for the Cadillac Lyriq at dealerships anytime soon. The division said production begins in late 2022. The vehicle will also be built in China first for that market, with a second, yet-to-be-named production facility in the U.S. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on KBB.com."}]}