{"article": [{"url": "https://www.marketwatch.com/story/why-oil-got-left-behind-as-stocks-soar-on-revived-stimulus-hopes-11602100041", "published": 1602086120.0, "headline": "Why oil got left behind as stocks soar on revived stimulus hopes", "body": "The U.S. stock market was back in rally mode Wednesday, recovering all of the previous day’s slide and more as hopes revived for an eventual round of fiscal stimulus from Congress. But oil futures got left way behind. That might say something about the expected timing of a spending package, said Robert Yawger, director of energy at Mizuho Securities U.S.A., in a note. The divergence between stocks and oil drew a lot of attention from traders, Yawger said. After all, recent oil-market gains had been attributed to rising hopes for an agreement on a new spending package that would help underpin domestic demand for gasoline. “A stimulus deal would have been a positive demand indicator for energy demand, gasoline demand in particular. As people received their checks, they would drive more to spend more,” Yawger wrote. Stocks had tumbled late Tuesday afternoon, with the Dow Jones Industrial Average DJIA, +0.56% swinging from a gain of more than 200 points to end the day down more than 400 points after President Donald Trump tweeted that he had called off stimulus talks with congressional Democrats until after the election. The S&P 500 SPX, +0.87% logged a decline of 1.4% on Tuesday, while oil futures closed with solid gains ahead of the Trump tweet. Trump on Tuesday night changed course, saying he would sign a number of targeted stimulus measures, including $1,200 stimulus checks to households and aid to airlines and small businesses. Stocks soared Wednesday, with the Dow up more than 500 points in afternoon trade Wednesday. Analysts said the equity rally wasn’t necessarily all about rising prospects for targeted fiscal stimulus in the near term, but might reflect the idea that a more sweeping package would be in store once the Nov. 3 presidential election is out of the way. But crude oil suffered in electronic trade following Trump’s initial tweet and failed to find support as equities subsequently rebounded. West Texas Intermediate crude for November delivery CL.1, -1.62%, the U.S. benchmark, fell 72 cents a barrel, or 1.8%, to $39.95 a barrel, while Brent crude BRN00, -0.07%, the global benchmark, dropped 66 cents, or 1.6% to $41.99 a barrel. Yawger said the divergence shows that “crude oil is much less forward looking than equities. “ In my opinion, a deal done in January, when the new Congress is seated, has no impact on November Crude Oil which expires on October 20. Hence, weakness in the barrel but not in equities,” he said. Meanwhile, talk of a $25 billion aid package targeted at airline employees — one of the individual measures mentioned by Trump and previously backed by Democrats — would be unlikely to do much for oil prices, Yawger argued. While such a package would be good news for airline workers and for equities, it would do little for jet-fuel demand. “The program would serve as a bridge between crisis and normalcy. The airline plan is not structured to put more people on planes,” he said. Of course, stimulus speculation wasn’t the only item for oil traders to deal with Wednesday. Weakness was also attributed to an unexpected rise in U.S. crude inventories. But at the same time, Hurricane Delta is closing in on the Gulf of Mexico, leading oil producers to curb production in the region as the major storm heads for the Louisiana Gulf Coast. Read: ‘This season has been relentless’ — for the sixth time this year, Louisiana is bracing for another hurricane"}]}