{"article": [{"url": "https://www.marketwatch.com/story/5-things-to-know-about-avocado-producer-mission-produce-before-it-goes-public-11600874554", "published": 1601624840.0, "headline": "Shares of avocado producer Mission Produce soar 18% as trading begins", "body": "Avocados have surged in popularity in the years leading up to Mission Produce's IPO AFP via Getty Images Shares of avocado producer Mission Produce soared 18% after trading began on Thursday. The stock closed at $13.80 on its first day. The avocado company priced its initial public offering at $12 on Wednesday, below the price range between $15 to $17. Mission Produce AVO, +2.20% also downsized its IPO, offering 8 million shares, down from 9,375,000 shares previously. The stock is listed on the Nasdaq under the ticker symbol “AVO.” BofA Securities, JPMorgan and Citigroup were the active bookrunners. Founded in 1983, the California-based business intends to use the proceeds from the offering for working capital and other general corporate purposes. Sales for the fiscal year ending Oct. 31, 2019, were $883.3 million. Chief Executive Stephen Barnard founded the company and serves as a director. According to U.S. Department of Agriculture data provided by Mission Produce Inc., avocado consumption has grown from 1.1 billion pounds in 2008 to 2.6 billion pounds in 2018. Meanwhile, the average retail price of Hass avocados, the dominant avocado on the market, reached $2.57 per pound in 2019, up 6% from 2018. Mission Produce Inc. AVO, +2.20% is rooted in this growing industry, with packing facilities in the U.S., Mexico and Peru; 11 distribution and ripening centers across the U.S., Canada, China and the Netherlands; and three sales offices in the U.S., China and the Netherlands. The company is planning to open a new distribution and ripening center in Texas, which will be key for avocados coming into the U.S. from Mexico. The company also owns more than 10,000 acres of land in Peru. Read: Pactiv Evergreen begins trading below IPO price and sinks further The Hass Avocado Board expects the U.S. Hass avocado market to grow at a compound annual growth rate (CAGR) of 5.5% from 2019 to 2023, reaching revenue of $8 billion owing to factors like health and wellness trends, year-round accessibility and the ready-to-eat nature of the food, which has been helped by sourcing and ripening improvements. The consumption rate of the growing U.S. Latinx population is 45% higher than non-Latinx households. And millennials are fans, with 60.1% of millennial households purchasing avocados in 2018 versus 51.3% of non-millennial households. See: McDonald’s September sales get a boost from rapper Travis Scott Avocados are also growing in popularity abroad with the EU the second biggest import market. There was a market disruption in 2019, with crops damaged by heavy rainfall in Peru, which drove a 26.1% decline in imports to the EU, Mission Produce said in its prospectus. But the region will experience “robust” growth again in the future. Mexico, Peru and California are the primary sources for Mission Produce, and the company has partnerships with a network of growers. Fresh Del Monte Inc. FDP, -0.04% are among its key competitors. The Renaissance IPO ETF IPO, +1.98% is up 65.2% for the year to date while the S&P 500 index SPX, +0.87% has gained 2.1% for the period. Here are five things to know The company isn’t sure it will pay a dividend. “We have paid cash dividends on our capital stock in the past but cannot guarantee that we will continue to do so in the future,” the prospectus says. “Any determination to pay dividends in the future will be at the discretion of our board of directors and will depend upon results of operations, financial condition, any contractual restrictions, our indebtedness, restrictions imposed by applicable law and other factors our board of directors deems relevant.” Nearly two-thirds of sales are generated through a few clients. Primary customers include Walmart Inc. WMT, +1.00%, Costco Wholesale Corp. COST, +1.19% and Chipotle Mexican Grill Inc. CMG, +0.01% Also: Chipotle brings back carne asada for a limited time Kroger Co. KR, +0.46% is the company’s top customer, accounting for about 14% of the company’s total sales for the six months ending April 30, 2020. Sales to the company’s 10 largest customers accounted for about 65% of all sales for the same period. Mission Produce has had relationships with many of its customers for decades. The company has worked with all of its top 10 customers of fiscal 2019 for at least 10 years. Food safety is a concern. “Food safety events, including instances of food-borne illness involving avocados, could create negative publicity for our customers and adversely affect sales and operating results,” the company said in its prospectus. The business could be affected by economic or political issues in Mexico and Peru. Mission Produce’s business is dependent on the border to the U.S. from Mexico remaining open. Problems with organized crime and drug-related violence in Mexico have also impacted avocado production and shipment. And the country has experienced occasional grower strikes. In Peru, past political regimes have imposed price controls, import limits, and have put other policies in place that could impact Mission Produce’s business. In 2018, there was also political instability tied to ongoing corruption investigations. And this month, impeachment hearings against President Martín Vizcarra began. Peru has the highest per capita death toll from coronavirus in the world. Don’t miss: Beyond Meat downgraded at JPMorgan as Impossible Foods snaps up share It is facing lawsuits related to its labor practices. As of April 30, 2020, Mission Produce had 3,700 employees, including 481 in the U.S., 648 in Mexico and 2,544 in Peru. Fewer than 10 workers in an Illinois distribution and ripening center are unionized. The company hires temporary workers on farms in Peru. “We believe that our employee relations are good,” the company said in its prospectus. On April 23, 2020 former employees filed a class-action lawsuit in Los Angeles, alleging violation of certain California labor laws, including failure to pay all overtime wages and minimum wage violations. And on June 10, 2020, former employees filed a class-action lawsuit, also in Los Angeles, alleging similar violations. Additional reporting by Tomi Kilgore. *An earlier version of this report included a reference to Chipotle, which Mission Produce has removed from its prospectus. The story has been updated to reflect that change."}]}