{"article": [{"url": "https://www.marketwatch.com/story/if-you-didnt-get-a-500-stimulus-check-for-your-child-it-should-be-coming-soon-2020-08-14", "published": 1597495280.0, "headline": "If you didnâ\u0080\u0099t get a $500 stimulus check for your child, it should be coming soon", "body": "Stimulus checks were supposed to pay $1,200 to eligible adults and $500 apiece for dependent children, but an Internal Revenue Service error skipped the $500 payments for some families through mid-May. Now that the glitch has been fixed, these families are about to get the long-awaited money for their kids. The IRS is distributing the previously unsent $500 payments and plans to send out all those payments by the end of the August. The $500 payments will go to households that registered for stimulus checks and claimed at least one qualifying dependent child using the non-filer tool â\u0080\u0094 but did so before May 17. Up until that point, an error in the non-filer tool skipped the $500 payments. After May 17, the stimulus checks sent to people using the non-filer tool did contain the money for dependents, the Federal Trade Commission (FTC) said. The IRS started sending the direct deposits for the overlooked dependents on Aug. 5 and began mailing out paper checks and debit cards on Aug. 7, the FTC said. Households waiting for the dependent stimulus money can track their paymentâ\u0080\u0099s progress on the IRS website. Families waiting for the cash donâ\u0080\u0099t need to take extra steps or file additional paperwork, according to the FTC and National Taxpayer Advocate Erin Collins, who heads a watchdog agency within the IRS. People who are still waiting for their dependent stimulus money by late August should contact Collinsâ\u0080\u0099 office, she said. The Taxpayer Advocate Serviceâ\u0080\u0099s hotline is 1-877-777-4778 and its website can be found here. “ IRS officials have previously said up to 450,000 recipients missed out on the dependent stimulus money. ” IRS officials have previously estimated up to 450,000 recipients missed out on the money for their kids due to the glitch, according to a Government Accountability Office report in late June. By this point, the IRS has distributed approximately 160 million stimulus payments, totaling $270 billion. Though talks continue on another stimulus bill, there are others who are waiting to be paid the first time â\u0080\u0094 and some could be seeing their money sooner than others. The IRS is also re-issuing stimulus payments to taxpayers who had an â\u0080\u009cinjured spouseâ\u0080\u009d form on their jointly-filed returns. During tax time, these forms give the IRS a notice to send a portion of the joint refund to the spouse who does not have past-due obligations, like child support. When it comes to stimulus checks, Collins said, the IRS is sending the so-called â\u0080\u009cinjured spouseâ\u0080\u0099sâ\u0080\u009d portion of the money to them if it was wrongly withheld. The money should arrive by the end of August, her office said. Anyone whoâ\u0080\u0099s still waiting for the money by the end of this month should contact Collinsâ\u0080\u0099 office. Taxpayers who have filed the â\u0080\u009cinjured spouseâ\u0080\u009d paperwork (Form 8379) shouldnâ\u0080\u0099t have to do anything extra to get their money. But people who are eligible for the relief, but havenâ\u0080\u0099t submitted a form need to file one, she said. But there are some adjustments the IRS cannot immediately make, according to Collins. For example, the IRS may have decided someone was ineligible for a stimulus payment because they made too much on their 2018 tax returns. (Full payments applied to individuals making under $75,000 and married couples filing jointly who made less than $150,000.) The personâ\u0080\u0099s 2019 income may have dropped so that they became eligible for the stimulus money. But if the IRS already made its eligibility decision, the individual will have to wait until next tax season for their stimulus check. Collins said people in this situation, and other scenarios, shouldnâ\u0080\u0099t have to hold on until next tax season for their stimulus money. â\u0080\u009cIRS has agreed to correct [economic impact payment] errors in certain categories of cases. However, many eligible individuals have not received all or part of their EIPs due to circumstances the IRS has not agreed to resolve,â\u0080\u009d Collinsâ\u0080\u0099 office said in a blog post earlier this week. â\u0080\u009cWe continue to urge the IRS to resolve all EIP cases this year for those taxpayers still waiting.â\u0080\u009d"}]}