{"article": [{"url": "https://www.marketwatch.com/story/roughly-1-in-3-americans-thinks-the-coronavirus-hasnt-killed-as-many-people-as-has-been-reported-2020-07-21", "published": 1595353700.0, "headline": "Roughly 1 in 3 Americans thinks the coronavirus hasnâ\u0080\u0099t killed as many people as has been reported", "body": "The number of deaths and hospitalizations attributed to the coronavirus pandemic continues to grow â\u0080\u0094 and so does the number of Americans who think this is fake news. Nearly one in three doesnâ\u0080\u0099t believe that the COVID-19 death toll is as high as the official count, according to the latest Axios-Ipsos Coronavirus Index released Tuesday â\u0080\u0094 the same day that the CDC warned that coronavirus cases could be six to 24 times higher than what has been reported in some areas. As of Tuesday morning, there were more than 3.8 million confirmed cases of COVID-19 in the U.S. and more than 140,000 deaths, according to data aggregated by Johns Hopkins University. The U.S. has the highest coronavirus death toll in the world; globally the virus has infected at least 14.7 million and killed at least 610,654 people. But the number of Americans now doubting the death toll (31%) has risen sizably from the 23% who questioned the numbers in May, Axios reported. Whatâ\u0080\u0099s more, this skepticism is largely divided along political lines. Most Republicans in this survey (59%) believe that the death count is inflated, which is up from 40% in May. The number of independent doubters also rose, climbing from 24% to 32%. Democrats, on the other hand, are the most likely to trust the official count, with just 9% thinking itâ\u0080\u0099s too high â\u0080\u0094 a slight uptick from 7% in May. Where people get their news also appears to play a role in determining whether they buy the official coronavirus data or not. Fox News viewers, who tend to be more conservative, are the most likely to say that these deaths have been overblown. That opinion spiked from 44% to 62% over the past couple of months. iframe.twitter-tweet { width: 100% !important; } Almost half of the respondents who said that they donâ\u0080\u0099t have a primary news source (48%) and those who count local news as their go-to source of information (44%) also distrust the data. CNN and MSNBC viewers, who tend to skew liberal, are the most likely to trust the data. Their small percentage of skeptics stayed pretty flat, with just 7% believing the death count has been overcounted, which is up slightly from 6%. â\u0080\u009cWe live in highly tribal and partisan times, and people are more likely to believe cues and signals from their political leaders than the scientists or the experts,â\u0080\u009d said Cliff Young, president of Ipsos U.S. Public Affairs, in a statement. Indeed, former Fox News host Trish Regan accused Democrats and the â\u0080\u009cliberal mediaâ\u0080\u009d of using the pandemic to â\u0080\u009cdestroy the president while speaking on the air in March. (She and the cable network, which shares common ownership with MarketWatch, later â\u0080\u009cparted waysâ\u0080\u009d following the backlash to her segment.) The president has also repeatedly downplayed the severity of the virus, such as saying it will â\u0080\u009dgo awayâ\u0080\u009d or â\u0080\u009cdisappearâ\u0080\u009d in time. He told Charles Wallace on Fox just last Sunday that â\u0080\u009cIâ\u0080\u0099ll be right eventually â\u0080¦. Itâ\u0080\u0099s going to disappear.â\u0080\u009d Overall, however, most Americans in the Axios report believe that the coronavirus death toll is either higher (37%) or on par with (31%) the official tally. And sadly, thereâ\u0080\u0099s evidence to suggest that the fallout from the pandemic is much worse than what has been reported. The CDC warned Tuesday that the true rate of U.S. coronavirus infections logged between late March and early May is actually more than 10 times higher than what was reported, based on COVID-19 antibody tests performed on routine blood samples of 16,000 people in 10 regions. And infection rates were really six times higher than the reported number of cases in Connecticut, and 24 times higher than the number of cases reported in Missouri. Research suggests the death toll was underreported, as well. A Yale study published in the Journal of the American Medical Association (JAMA) earlier this month found that there were 122,300 more deaths in the U.S. from March through May than would typically be expected at that time of year â\u0080\u0094 which was 28% higher than the official tally of coronavirus deaths at the time. Only 95,000 of these so-called â\u0080\u009cexcess deathsâ\u0080\u009d were attributed to COVID-19, yet the report argues that most of the remaining excess deaths were likely related to or directly caused by the novel coronavirus, too. Many of these deaths occurred before COVID-19 testing was widely available to properly diagnose the patients, for example. Or these deaths may have been mistakenly attributed to another respiratory disease (like influenza) or heart disease; health officials now know that the coronavirus can trigger cardiac events. In fact, the number of symptoms most commonly associated with the coronavirus has jumped from three to a dozen over the past few months as more has been learned about it. And thatâ\u0080\u0099s not counting the ways that the pandemic has indirectly put lives and livelihoods in danger, such as discouraging people from seeking medical attention. A dire recent report from Johns Hopkins Bloomberg School of Public Health warned that pandemic disruptions of health services and food supply chains could end up killing almost 1.2 million babies. Stay up to date with MarketWatchâ\u0080\u0099s coronavirus coverage here."}]}