{"article": [{"url": "https://www.marketwatch.com/story/fauci-tells-americans-to-hunker-down-this-fall-and-winter-its-not-going-to-be-easy-2020-09-11", "published": 1599898820.0, "headline": "Fauci tells Americans to â\u0080\u0098hunker downâ\u0080\u0099 this fall and winter: â\u0080\u0098Itâ\u0080\u0099s not going to be easyâ\u0080\u0099", "body": "“ â\u0080\u0098[D]onâ\u0080\u0099t try and look at the rosy side of things.â\u0080\u0099 ” â\u0080\u0094 Dr. Anthony Fauci The world is officially six months into the coronavirus pandemic, and Dr. Anthony Fauci is warning that there are still rough times ahead. Ready for the winter of our discontent? â\u0080\u009cWe need to hunker down and get through this fall and winter, because itâ\u0080\u0099s not going to be easy,â\u0080\u009d the nationâ\u0080\u0099s leading infectious-disease expert said during a panel discussion with Harvard Medical School on Thursday. The director of the National Institute of Allergy and Infectious Diseases drew on his experience battling the HIV/AIDS epidemic in the 1980s and 1990s, which began with a handful of cases before becoming a global pandemic that has caused tens of millions of deaths and infected more than 70 million people worldwide in the decades since. â\u0080\u009cWeâ\u0080\u0099ve been through this before,â\u0080\u009d he said. â\u0080\u009cDonâ\u0080\u0099t ever, ever underestimate the potential of the pandemic. And donâ\u0080\u0099t try and look at the rosy side of things.â\u0080\u009d Coronavirus update: U.S. case and death tallies keep rising, as Fauci expresses frustration and warns not to look on the bright side And he disagreed during an MSNBC interview on Friday with President Donald Trumpâ\u0080\u0099s insistence that the country has rounded the final turn in the pandemic. â\u0080\u009cIâ\u0080\u0099m sorry, but I have to disagree with that,â\u0080\u009d he said, pointing to the â\u0080\u009cdisturbingâ\u0080\u009d statistics showing the country plateauing at about 40,000 new COVID-19 cases a day. He also expressed concerned about a possible surge in cases following the Labor Day weekend. Fauci joined other health experts in expressing concern about the â\u0080\u009cunacceptably highâ\u0080\u009d number of COVID-19 cases in the U.S. as the country heads into the flu season. Fauci wants to see this baseline down at 10,000 or less before influenza begins picking up in October. The U.S. case toll rose above 6.4 million on Friday, with at least 191,600 people dead. â\u0080\u009cI keep looking at that curve, and I get more depressed and more depressed about the fact that we never really get down to the baseline that Iâ\u0080\u0099d like,â\u0080\u009d he said. Centers for Disease Control and Prevention director Robert Redfield also recently warned that Americans are in for â\u0080\u009cthe worst fall, from a public health perspective, weâ\u0080\u0099ve ever had,â\u0080\u009d citing concerns of a possible â\u0080\u009ctwindemicâ\u0080\u009d of COVID-19 cases and the seasonal flu both overwhelming hospitals. The flu has seen between 140,000 and 810,000 people hospitalized each year since 2010, and is responsible for between 12,000 and 61,000 deaths a year. Read more:CDC director warns America is in for the â\u0080\u0098worst fall â\u0080¦ weâ\u0080\u0099ve ever hadâ\u0080\u0099 Indeed, the American Academy of Pediatrics announced earlier this week that vaccinating children against the flu is â\u0080\u009cmore important than ever,â\u0080\u009d advising anyone over the age of six months to get the vaccine before Halloween. And the CDC has ordered an extra 10 million doses of this yearâ\u0080\u0099s influenza vaccine, for more than 190 million doses total, to make sure that thereâ\u0080\u0099s plenty of the vaccine to go around. Read the AAPâ\u0080\u0099s full recommendations here. The flu isnâ\u0080\u0099t the only complication that health officials are concerned about this fall. As the weather cools, people will begin moving back indoors to dine, work out and socialize, which Fauci referred to as a â\u0080\u009cprecarious situationâ\u0080\u009d during the MSNBC interview. Itâ\u0080\u0099s harder to practice social distancing indoors than it is outside in a well-ventilated area; being packed together indoors makes it easier for the virus to spread. â\u0080\u009cPeople will be spending more time indoors, and thatâ\u0080\u0099s not good for [combating] a respiratory-borne virus,â\u0080\u009d Fauci said. In fact, a CDC report released Friday found that people who tested positive for COVID-19 were approximately twice as likely to have reported eating recently at a restaurant compared with those testing negative. Fauci also told MarketWatch in a July interview that he would not dine out at any restaurant, whether seating was indoors or outdoors. Read more:People who tested positive for COVID-19 were twice as likely to report eating recently at a restaurant, CDC report says COVID-19 outbreaks have also been reported in some localities where students have returned to school. A suburban Atlanta county had to quarantine almost 1,200 students and faculty last month, for example. A recent study in the Journal of Pediatrics warned thereâ\u0080\u0099s research to suggest that children could spread COVID-19 even if they already have developed antibodies. Dispatches from a Pandemic:It seemed safe to reopen Israelâ\u0080\u0099s schools, but then came COVID-19 outbreaks â\u0080\u0094 what can we all learn from those mistakes? And a New York Times review of 203 counties in the country where students make up at least 10% of the population found that new COVID-19 cases per capita are twice as high in college towns as the rest of the country. It should be noted, however, that itâ\u0080\u0099s not clear how many cases are definitely tied to campus outbreaks, or whether extra testing in college communities could be driving the higher case counts. iframe.twitter-tweet { width: 100% !important; } Despite saying itâ\u0080\u0099s too soon to look on the â\u0080\u009crosy side of things,â\u0080\u009d Fauci did note that vaccine trials are â\u0080\u009cprogressing very well,â\u0080\u009d and reiterated the belief that a vaccine could be possible by the end of the year or early next year. He reminded the Harvard panel that weâ\u0080\u0099re still learning about this virus, and so officials are adapting their guidelines as they go. â\u0080\u009cWeâ\u0080\u0099ve really got to realize that from Day 1 you donâ\u0080\u0099t know it all,â\u0080\u009d he said. â\u0080\u009cAnd youâ\u0080\u0099ve got to be flexible enough to change your recommendations, your guidelines, your policies, depending upon the information.â\u0080\u009d"}]}