{"article": [{"url": "https://www.marketwatch.com/story/why-more-philanthropists-are-spending-themselves-out-of-existence-and-heres-what-joe-bidens-coronavirus-relief-plan-would-prioritize-2020-10-07", "published": 1602097280.0, "headline": "Why more philanthropists are spending themselves out of existence, and here's what Joe Biden's coronavirus relief plan would prioritize", "body": "Hi there, MarketWatchers. Don't miss these top stories:Personal FinanceNearly half of all professional women make this money mistake - and it's easy to fix How to stop deferring to a partner on financial matters.Late director Joel Schumacher's Greenwich Village condo just hit the market for $4.5 million The New York City loft apartment belonging to the late film director Joel Schumacher has come back on the market - but the price hasn't changed. Located in the Greenwich Village neighborhood, the three-bedroom abode is again available for $4.5 million. The IRS says it still hasn't opened more than 2 million returns this tax season - and that's an improvement \"We are hearing from our constituents right and left,\" one lawmaker said at a Wednesday hearing where IRS Commissioner Charles Rettig testified.Charity on a deadline: Why more philanthropists are spending themselves out of existence The global pandemic has spurred big donations, and some funders are giving out money faster than ever.With Trump postponing a stimulus package, here's what Joe Biden's coronavirus relief plan would prioritize Biden has said he wants another round of stimulus checks, bigger Social Security checks, and extended unemployment benefits.As Trump says he's abandoned stimulus talks, renters and landlords face a financial cliff The CDC's national eviction moratorium should keep Americans in their homes for now, but experts say emergency rent relief is needed to prevent an eviction crisis in 2021.We've been married 42 years. I cook, clean and take care of our finances. He paid for a trip to Paris, then asked for the money back \"He pretends to forget to pick up flowers. We have not been to a movie together for the longest time.'Good news: You now have until Nov. 21 to claim your stimulus check The registration deadline was previously set for Oct. 15.1 in 5 Americans say they're more likely to wear masks and practice social distancing after Trump's COVID-19 diagnosis Asked how much trust they had in the president to provide them with accurate coronavirus information, 70% of respondents said 'none at all' or 'not very much.'Joe Biden's free college plan could pay for itself within 10 years, Georgetown University analysis says The former vice president is proposing to make public college tuition free for families earning $125,000 a year or less.Elsewhere on MarketWatchBetting markets see Biden win as increasingly likely, while Trump struggles with aid issue Betting markets give Joe Biden a 63.4% chance of winning the White House race vs. President Trump's 36.0%, down just slightly from a day ago, when the former vice president posted his best-ever figure for this metric - a 64.0% chance.Giant 'Trump' sign snarls traffic, deemed a hazard in Los Angeles The Hollywood sign has been around for nearly a century. The Trump version of the classic Southern California symbol didn't last a day.Trump's vital signs 'stable and in normal range,' president's doctor says President Donald Trump's vital signs are 'stable and in a normal range,\" Dr. Sean Conley said in a brief statement released by the White House on Wednesday. Minutes of Fed's meeting show unease among officials over new interest-rate strategy Minutes of the Federal Reserve's September meeting released Wednesday show wider unease than expected over the Fed's new inflation-friendly policy plan.Red-sweatered Midwesterner Ken Bone isn't voting Trump, but he's still getting blasted by Biden backers Newsweek just checked in with Bone, whose 2016 \"15 minutes of fame\" as an undecided voter led to the discovery of his icky Reddit history, and found he's pretty much sticking to the same message he espoused four years ago."}]}