{"article": [{"url": "https://www.marketwatch.com/story/private-sector-hiring-and-job-openings-fall-in-august-as-us-economic-recovery-slows-2020-10-06", "published": 1601983340.0, "headline": "Private-sector hiring and job openings fall in August as U.S. economic recovery slows", "body": "The numbers: Hiring and job openings in the private sector fell in August in a sign the U.S. labor market was cooling off as an economic recovery lost some of its earlier momentum, a government survey showed. Businesses, governments and other organizations hired 5.9 million people in August, according to a Labor Department survey of the labor market that’s released with a one-month delay. The number of people hired was basically unchanged from July, but the total was inflated by the addition of nearly 250,000 temporary workers hired by the U.S. Census for its once-in-a-decade national survey. Hiring in the private sector declined. Job openings also slipped to 6.49 million from 6.7 million. The number of jobs available was running around 7 million a month before the coronavirus struck in March. The number of separations — layoffs, firings, people quitting — fell to 4.59 million in August from 4.99 million in July. At the peak of the pandemic in March and April, the U.S. lost more than 24 million jobs. So far it’s only recovered about half of them back. Read:Consumer confidence surges to highest level of coronavirus era What happened: Hiring increased the most in August in government and manufacturing (+41,000). Yet hotels, restaurants and health-care providers — industries hard hit by the pandemic — hired far fewer people in August than they did in July. Job openings declined in most industries across the country. The share of people who left jobs on their own, known as the quits rate, fell to 2.2% from 2.4% among private-sector employees. It’s a full percentage point lower compared to a year ago; fewer people are willing quit a secure job during a recession. See:Marketwatch’s Coronavirus Economic Recovery Tracker The big picture: Millions of people returned to their jobs after the economy reopened in May, but millions more are still without work and have little prospect of finding any. Many businesses in travel, tourism, retail and other service-oriented industries have suffered a massive loss of customers who are unlikely to return until the pandemic fades or a treatment is found. As a result, the pace of hiring has slowed and further gains in employment are likely to be harder to come by. What could make the situation worse is if a second wave of layoffs strikes the economy. Some industries badly damaged by the coronavirus, such as airlines and hotels, have said they plan to turn temporary furloughs into permanent job losses unless they get more government aid. Read:U.S. adds 661,000 jobs in September and unemployment rate falls to 7.9% What they are saying? “After a few months of being surprisingly strong, job openings have slowed down. This is a sign that while labor demand held up more than we may have expected early in the recovery, that pace is not guaranteed to continue,” said Nick Bunker, director of research at Indeed Hiring Lab. “If that’s the case, the prospects for unemployed workers permanently separated from their job finding a new one may dim,” he added. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% rose slightly in Tuesday trades."}]}