{"article": [{"url": "https://www.marketwatch.com/story/the-fed-model-is-almost-always-bullish-which-makes-it-a-perfect-face-for-this-too-good-to-be-true-stock-market-2020-06-23", "published": 1593247040.0, "headline": "The Fed Model is almost always bullish, which makes it a perfect face for this too-good-to-be-true stock market", "body": "Low interest rates do not make the market’s current sky-high P/E ratio any less bearish. That’s crucial to keep in mind, since the S&P 500’s SPX, +0.87% P/E ratio right now — 27.4, according to Birinyi Associates, based on trailing 12-month earnings — is higher than 96% of all monthly readings since 1871. If low interest rates don’t justify the S&P 500 being so high, then it’s hard to reach any conclusion other than the U.S. stock market is overvalued. That’s why the bulls are trying so hard to wriggle out from underneath the bearish significance of the market’s current P/E. Perhaps the bulls’ most widely used argument is that low interest rates justify a higher P/E. On the surface, this has a certain plausibility. If investors see stocks and bonds as competing assets, then they will naturally gravitate to the one with the higher yield. Right now, the S&P 500’s earnings yield (the inverse of the P/E) is 3.6%, nearly three percentage points higher than the 0.7% yield on the 10-year Treasury. TNX, +1.30% TMUBMUSD10Y, 0.777% If so, then stocks win, hands down. The bulls have even given their argument an official-sounding name: The Fed Model. Doing so represents a considerable amount of hubris on their part, however, since the model is not endorsed by the Federal Reserve. In fact, even its connection to the Fed is tenuous: It traces to a single paragraph in the Federal Reserve’s report to the Congress in 1997 that, more or less in passing, compared the stock market’s earnings yield to the yield on the 10-year Treasury. The Fed Model’s attraction to the bulls is that it almost always is bullish. For the Fed Model to turn bearish, the S&P 500’s earnings yield would have to get below that of the 10-year Treasury. For that to happen, either the 10-year yield would have to rise above 3.6% or the P/E ratio would have to rise to 143-to-1 — or a combination of both. No wonder the bulls love the Fed Model.Fed Model’s track record To measure the Fed Model’s track record, I looked at the stock market on a monthly basis since 1871, courtesy of data from Yale University’s Robert Shiller. I measured the Fed Model’s ability to forecast the stock market’s inflation-adjusted real return over the subsequent 1-, 5- and 10-year periods. In each case I calculated a statistic known as the r-squared, which represents the degree to which one data series (in this case, an indicator such as the Fed Model) predicts or explains another (in this case, the stock market’s subsequent return). The table below summarizes what I found: r-squared when forecasting 1-year returns r-squared when forecasting 10-year returns r-squared when forecasting 20-year returns Earnings yield Earnings yield minus 10-year yield (the Fed Model) Earnings yield Earnings yield minus 10-year yield (the Fed Model) Earnings yield Earnings yield minus 10-year yield (the Fed Model) 1.6% 1.5% 25.5% 11.4% 35.8% 11.7% Notice that, regardless of when measuring forecasting ability over the 1-, 10- or 20-year horizons, introducing interest rates into the equation reduces the P/E ratio’s explanatory power.Questionable premise You should not be surprised by these results, given that the Fed Model rests on (at best) a questionable theoretical foundation. For starters, there’s no theory that I am aware of which says stocks and bonds should have the same yield. In fact, since stocks are far riskier than bonds, you would expect them not to have similar yields. Without including some assumptions about the equity premium, therefore, we can’t even begin to derive any significance from stocks yielding more than bonds. Once you try to do that, furthermore, things quickly become more complicated. For example, since nominal corporate profits tend to expand and contract along with inflation, the earnings yield can be seen as a real (inflation-adjusted) number, in contrast to the Treasury’s 10-year yield, which is a nominal number. So comparing these two yields is even more a comparison of apples and oranges. (A good summary of these theoretical points comes from Cliff Asness of AQR Capital Management in the Journal of Portfolio Management.) The bottom line? Today’s low interest rates don’t support the bulls’ case. That doesn’t mean the bull market is about to come to an end, of course. But it does mean that, if you want to argue that it will continue, you need to base your argument on something besides low interest rates. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: Bulls just won’t believe what interest rates are saying about U.S. stock and bond returns for the next 5 years Plus: ‘La la land?’ The stock market is ‘insanely disconnected’ and due for a ‘reckoning,’ Warren Buffett buff warns"}]}