{"article": [{"url": "https://www.marketwatch.com/story/finance-isnt-worth-losing-your-life-over-the-heartbreaking-story-of-a-rookie-trader-who-racked-up-700000-in-debt-2020-06-14", "published": 1592639540.0, "headline": "Rookie trader kills himself after seeing a negative balance of more than $700,000 in his Robinhood account", "body": "The stock market, particularly in its current state, is no place for amateurs. Sullimar Capital analyst Bill Brewster delivered that message to followers in a heartbreaking Twitter TWTR, -0.23% thread in which he shared a family member’s tragic foray into trading. Here’s the full story: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Alex Kearns, just 20 years old, left this note, which Forbes posted on Wednesday: “How was a 20 year old with no income able to get assigned almost a million dollars worth of leverage?” Robinhood declined to share any details of the trading account and how such outsized losses piled up but did say that the company was aware of the situation. “All of us at Robinhood are deeply saddened to hear this terrible news and we reached out to share our condolences with the family,” the spokesperson told MarketWatch on Sunday. Here’s a screenshot of his account: iframe.twitter-tweet { width: 100% !important; } The balance displayed in red, as Forbes explained, may not have represented uncollateralized indebtedness at all, but rather a temporary balance until his option trades settled. The death serves as a reminder that trading stocks can have devastating real-life consequences. This has perhaps never been more true than when it comes to using borrowed cash to leverage positions in a stock market where the Dow Jones Industrial Average DJIA, +0.56% can be down almost 2,000 points one session, like last week, then rebound nearly 500 points the next. Inexperienced traders have been cited as a driving factor in the big bounce of the market’s late-March lows and the recent volatility. Deutsche Bank analyst Parag Thatte suggests that Wall Street professionals are being forced to chase amateurs who continue to bid up equities. Read:It’s like the Wild West with ‘get-rich-quick crowd’ vs. Wall Street pros, but it’s too easy to blame retail investors for ‘rampant speculation’ CNBC’s Jim Cramer last week also addressed the dangers of the current climate. “It got too easy, and now we all have to suffer as the get-rich-quick crowd gets blown out,” he said on his “Mad Money” show, describing the current environment as one of “rampant speculation.” If you or someone you know is thinking about suicide, please call the National Suicide Prevention Lifeline at 800-273-TALK (8255)."}]}