{"article": [{"url": "https://www.marketwatch.com/story/itching-to-get-away-here-are-the-best-destinations-in-every-state-to-keep-your-social-distance-2020-09-22", "published": 1600751540.0, "headline": "Itching to get away? Here are the best destinations in every state to keep your social distance", "body": "As people start to tentatively consider traveling again, many of us are looking for regional destinations we can reach without getting on a plane, with plenty of space to spread out and enjoy ourselves safely once we arrive. Looking for a social-distancing-friendly spot to visit near you? From secret beaches to drive-through safaris, check out this list of our favorite destinations in every state:Alabama Cool off away from crowds in Cathedral Caverns State Park in Marshall County, Ala. Cathedral Caverns cave tours are offered throughout the day with limited group sizes so you’ll have plenty of room to explore the cave’s unique features. Some formations not to miss: the “Goliath,” one of the world’s largest stalagmites clocking in at 45 feet tall, a “frozen” waterfall, and a huge stalagmite forest. Bonus: the caverns are a cool 60 degrees year-round so it’s a great place to get away from Alabama’s late summer heat waves. Alaska With a population of only 731,545 spread across 665,384 square miles, Alaskan residents are already pros at social distancing. Enjoy all that Alaska has to offer on the Tony Knowles Coastal Trail — an 11-mile greenbelt trail with several access points from downtown Anchorage. Keep your eyes peeled for Beluga whales swimming along the trail. Tony Knowles Coastal Trail offers sweeping views of Denali, North America’s tallest mountain peak, and winds through forests, too, so watch out for moose!Arizona Arizona’s Verde Canyon Railroad. istock In the small town of Clarkdale, Ariz., you’ll find one of the best ways to take in the state’s natural beauty: the Verde Canyon Railroad. The 20-mile, 3.5-hour journey winds through secluded wilderness with views of red rock buttes and steep ravines. Currently, the railroad is seating people at less than 50 percent capacity to allow for proper social distancing and requiring masks at all times. Once inside the renovated vintage cabins, guests are transported to the Wild West. Open-air cars with canopies are available for passengers to experience 360-degree views and the peace of mind of fresh air and even more space.Arkansas Enjoy the Nature State without even leaving your car on the famous Talimena National Scenic Byway. Several historic Arkansas gateway cities offer access to the Scenic Byway, including Mena, Fort Smith, and Waldron. The drive winds through 54 miles of the Ouachita National Forest in the western part of the Ouachita Mountains. Drive through in just over an hour or take a day to leisurely explore the drive’s many panoramic vistas, learning about the area’s historical significance along the way. Related: An expert’s guide to road-tripping with your dogCalifornia Bike or drive along the iconic 17-Mile Drive in Monterey Bay’s Pebble Beach to experience the majestic beauty of California’s coastline. You’ll take in stunning views of the coastal cliffs, Pebble Beach’s legendary golf courses, Crocker Grove’s giant cypress trees and pristine beaches. Biking the 17-Mile Drive is free, but if you’d rather take an easy drive, admission is $10.50 per vehicle. To avoid tourists and social distance even further, avoid peak weekend times and take a nice weekday ride. The drive is open from sunrise to sunset, but be sure to time your ride to enjoy a beach sunset (because who doesn’t like a beach sunset?).Colorado Great Sand Dunes National Park and Preserve in Colorado. istock Who knew there were giant, Sahara-like dunes in America? Great Sand Dunes National Park and Preserve in southern Colorado features the tallest sand dunes in America, and with some of the country’s unique surroundings to explore, you’ll have ample space to stay 6 feet apart from others. Hike along the 755-foot-tall Star Dune (or even try your hand at sand sledding or surfing) but to avoid superhigh surface temperatures, go during the morning or evening. To really avoid crowds, visit at night. The park was certified an International Dark Sky Park in 2019, and it’s a surreal experience to walk along the giant dunes as thousands of stars twinkle overhead.Connecticut Explore historic downtown New London at your own pace with plenty of space with the New London Mural Walk. The walk takes about an hour and begins at the well-loved Hygienic Art Galleries. You’ll pass by the Dutch Tavern, and it is highly recommended that you grab a burger to-go. Each of the unique 16 murals on the walk are created by a mix of internationally acclaimed and up-and-coming artists and several are great photo ops. Be sure to stop to admire the new Whale Tail fountain on the Parade Plaza and check out the city’s beautiful waterfront park afterward. See: I want year-round outdoor living — dry summers and no snow — on $4,000 a month. Where should I retire?Delaware As one of the state’s most scenic spots, Cape Henlopen State Park in Lewes is the perfect place to social distance in Delaware. Find solitude among 6 miles of shore or bike along the wetland trails. Two stately lighthouses can be seen from the park’s Point Overlook: the Harbor of Refuge Lighthouse and the Delaware Breakwater East End Light. Florida If you’re missing zoos and watching “Tiger King” on Netflix isn’t giving you enough animal content, Lion Country Safari in Loxahatchee, Fla., is the place to be. The best part? It’s drive-through, so you don’t have to come in contact with any other people. Stream the convenient audio tour in your car and wind through seven sections of the wildlife preserve where you’ll see animals like ostriches, water buffalo, zebras, lions, and even the endangered Southern White Rhinoceros.Georgia As the primary entrance to Georgia’s beloved Okefenokee Swamp, the remote Stephen C. Foster State Park in Charlton County is the perfect place to get outside sans crowds and experience a totally unique outdoor adventure. Guided boat tours of North America’s biggest black swamp are available, but they are limited, so call ahead to make a reservation. Be sure to try to spot one of the estimated 12,000 American Alligators that call the reserve their home. While the park is great in the daylight, at night it truly shines. It’s a certified Dark Sky Park so stargazing is a must.Hawaii The Kaumana caves in Hawaii. istock With over 100 beaches, countless hiking trails and scenic spots scattered throughout the Hawaiian islands, it’s hard to choose just one place for a socially-distant outing. Many tourists flock to Volcanoes National Park, but few check out the Kaumana Caves State Park in Hilo. Metal stairs descend down into a lava tube created in 1881 from the eruption of the Mauna Loa volcano. A headlamp or flashlight is necessary to see the cave in all its beauty. Idaho Practice social “fishstancing” (sorry, we had to) at one of Idaho’s 3,000 lakes. Anglers targeting largemouth bass will have a field day at Lake Lowell just west of Boise. But perhaps the best fishing spot is the 6,759-acre C.J. Strike Reservoir south of Boise. This large reservoir is perfect for families looking to reel in some fish or just relax on the boat, as the launching facilities are open all year. Make a weekend out of it by taking advantage of the camping spots along the water. Read: Does your community have what it takes to help you live longer?Illinois Away from the hustle and bustle of Chicago, peace and tranquility await at the Anderson Japanese Gardens in Rockford, Ill.. Spread across 12 acres, it’s easy to find a quiet place to take in the stunning water features and landscaping. To properly control the crowds, the gardens are requiring nonmembers to reserve their spots with timed-entry reservations. Don’t miss the guided tour of two of Illinois’ hidden architectural gems: Frank Lloyd Wright’s Laurent House and the Anderson Japanese Gardens’ 16th century Guest House. Indiana What better way to social distance than to head underground? Bluespring Caverns in Bedford, Ind., (about 80 miles south of Indianapolis) is home to the country’s longest navigable underground river, and it is also the perfect habitat for several rare albino and blind critters. The underground river tours leave every hour and take one hour to complete, and guests are required to wear masks at all times.Iowa Iowa's High Trestle Trail Bridge is made with old railroad spurs. istock Spanning across five towns for 25 miles, the High Trestle Trail is one of Iowa’s best and most beloved trails. But the best part is the iconic 13-story high High Trestle Trail Bridge stretching across the Des Moines River Valley. Walk across at night, and you’re in for a treat: the bridge lights up, making for the perfect trippy and futuristic photo spot. Kansas Kansas is the home of several of the world’s largest items and oddities, so it only makes sense that the perfect socially distant activity would be to take a road trip across the state to see all of them for yourself. Begin your journey in Goodland to catch a glimpse of the Van Gogh Project — a towering version of Van Gogh’s “Vase With 15 Sunflowers.” Next up is Cawker City where you can take a photo in front of the world’s largest ball of twine, followed by the world’s largest souvenir plate in the quirky town of Lucas. Kentucky While crowds flock to Kentucky’s Red River Gorge and Mammoth Cave, you’ll be enjoying your space at Carter Caves State Resort Park in Olive Hill. You can stay on-site in one of the resort’s secluded two bedroom cottages before exploring the 20 caves and 33 miles of trails in the park. Visitors can rappel down and climb up the sandstone cliff-line and walk through the caves themselves or opt for a guided tour. Louisiana There’s no better way to experience the haunted past of New Orleans than to go on a walking ghost tour. New Orleans Ghost Adventures gives guests access to the infamous St. Louis Cemetery No. 1, the burial ground of the Voodoo queen herself Marie Laveau. You’ll have ample space to distance yourself from other tour-goers as you weave through oldest above ground cemetery. Don’t forget to check out Nicholas Cage’s strange and unnamed pyramid tomb he purchased in the same graveyard. You might like: Goopa, Mawpaw and Grandma Duck? How do grandparents get their names?Maine Often called the “Bold Coast,” Cutler Coast Public Reserved Land is one of Maine’s most stunning coastal trails. There are 10 miles of trails here with a breathtaking 3.5-mile stretch of trail along the coast. Picturesque oceanside cliffs and cobblestone beaches line the trail, and you can even camp here (first come first serve) on one of the few isolated bluff camping sites. Maryland Ladew Topiary Gardens in Monkton, Md., is revered as one of the top 10 topiary gardens in the world. The expansive Ladew Gardens feature 15 impressive types of gardens, including a rose garden, the Garden of Eden fruit-themed garden, and a water lily garden. While the buildings and cafe are closed for now, you can arrange for a picnic lunch to be provided for you on the grounds as you social distance in stunning surroundings. Check out: The 12 best American road tripsMassachusetts Perhaps the most secluded and gorgeous beach in Cape Cod, Bound Brook Island Beach is nestled away in Wellfleet. Tourists (and many locals) don’t even know this beach exists, so it is the ultimate spot to get away from it all. The beach is accessible by driving or walking down Bound Brook Island Road, and once you reach the beach grass coated dunes, you won’t want to leave.Michigan Turnip Rock in Port Austin, Michigan. istock Turnip Rock in Port Austin is one of the unique features on Lake Huron. Take a seven-mile out-and-back kayak trip to the aptly-named rock and relax for a bit in the shallow waters surrounding the rock once you get there. The trip takes four hours, and you can rent or bring your own kayak. Minnesota Missing museums? Franconia Sculpture Park is a free, outdoor museum with more than 120 sculptures spread across 43 acres. Since it’s all outdoors, the park prides itself on being an oasis during these uncertain times and a place to come and enjoy art safely. Unlike your typical museum, this sculpture park is designed for visitors to interact with the art. If you visit on a Sunday, free tours are offered at 2 p.m. Also see: 4 useful rules for booking holiday travel—and keeping it flexibleMississippi Built after the War of 1812 and used by Union troops to occupy New Orleans, Fort Massachusetts on Ship Island has a long, rich history. The fort has also famously withstood centuries of hurricanes, and Ship Island itself was split in two by the 1969 Hurricane Camille. Visitors can easily walk along the island and spot dolphins, stingrays, pelicans and other wildlife. The island is accessible by ferry four times a day, so plan accordingly.Missouri National Geographic ranked Missouri’s Bonne Terre Mine as one of the top 10 adventures in the world. Once a lead ore-producing mine, a sudden flood of underground water submerged the Bonne Terre Mine’s chambers and millions of dollars of equipment. Now, the submerged mine is dubbed the largest freshwater diving site in the world, and certified divers can adventure through 17 miles of channels. Not a diver? The Mine offers boat and walking tours as well, and are currently taking precautions with mandatory mask usage, encouraging social distancing, and increased cleaning. Montana The Garden of One Thousand Buddhas is the perfect spot to find a moment of Zen during these uncertain times. Located in the middle of nowhere in Arlee, Mont., this sacred and tranquil garden covers 10 acres of land for guests to easily socially distance. The garden features 1,000 Buddha statues arranged in a wheel pattern to represent the Buddhist principles of life, death and rebirth. Be sure to take the short hike up to the prayer flags for a beautiful view of the whole site. Nebraska Toadstool Geologic Park in Nebraska. istock Deep within the sparse Oglala National Grassland in Harrison, Neb., lies the unique and otherworldly rock formations of Toadstool Geologic Park. The park is said to be in Nebraska’s “badlands,” and many don’t venture out here. But for the few that do, it’s worth it. Open 24 hours a day, the park features an easy one-mile loop trail to view the mushroom-like formations and fossils along the way. Storms roll through the area frequently, but visitors report that rain only adds to the park’s beauty as you can see where streams once flowed. Nevada The International Car Forest of the Last Church may sound like a religious site, but it’s anything but. More than 40 spray-painted automobiles balanced on their ends or arranged on top of each other are the works of artists Chad Sorg and Mark Rippie. Unfortunately, after a fight between the artists, Rippie is in jail and they no longer work together. However, the abandoned installation east of Goldfield, Nev., is open for visitors to ogle the weirdness. Read: Are you overlooking this critical factor in deciding what is the ‘best place’ to retire?New Hampshire With all the tourists visiting White Mountain National Forest’s ravines, head to the lesser known, but still stunning, King Ravine near Randolph. Because the trail to the ravine is a fairly intense hike, visitors who put in the effort are likely to not encounter another soul on the trail. The ravine is well known for its huge boulders (and you’ll likely have to scramble up a few), as well as places where ice and snow can be found even in the heat of the summer. New Jersey Grounds for Sculpture is a 42-acre outdoor sculpture park created by the artist J. Seward Johnson II. This bizarre yet beautiful park boasts hundreds of lifelike sculptures of people engaged in all sorts of activities. Guests can take a peek at life-size sculptures of various impressionist paintings, like Renoir’s famous “Luncheon of the Boating Party.” Also of note are the park’s immaculate grounds with more than 2,000 rose bushes on site.New Mexico Located in the Chihuahuan Desert in southern New Mexico, Carlsbad Caverns National Park is a sight to behold. The park features more than 100 limestone caves with such stunning and unique formations inside that it was named a World Heritage site in 1995. To tour Carlsbad Cavern itself, you’ll have to get to the cavern early as timed entry tickets are selling out by 9 a.m. The park is only allowing 35 visitors in every 15 minutes, so you will be able to adequately social distance while exploring this natural wonder. New York After a short hike down the Eternal Flame Hiking Trail in Orchard Park’s Chestnut Ridge Park, you’ll come upon one of the world’s coolest waterfalls: Eternal Flame Falls. Why is it called Eternal Flame Falls, you ask? Tucked behind the waterfall in a small grotto is a constant gas leak that is usually burning bright. If the flame has been extinguished, a simple Zippo lighter will do the trick. Also see: I went to the Met, and here’s what I sawNorth Carolina Experience the best of what North Carolina has to offer without leaving your car on the 60-mile stretch of the scenic Blue Ridge Parkway. The parkway is huge and stretches for 469 miles, but this section is one of the best. Begin just outside of Asheville at I-26 exit 33. Along the winding drive there are plenty of overlooks, hikes and waterfalls to enjoy. A few highlights: Mills River Valley Overlook at mile 13.4 for the best sunrise views, the seriously fun Sliding Rock at mile 27.1, and the roadside Looking Glass Falls at mile 29.2. North Dakota Lots of socially-distanced adventures await in Walhalla’s majestic Pembina Gorge. The 2,800 acres of undisturbed wilderness include 30 miles of trails winding by steep cliffs, lush forests and secluded prairies. From hiking and mountain biking to kayaking and even ATVing, you could spend all day here without seeing another soul. Ohio The Kalberer Emergent Tower at Holden Arboretum rises above the forest canopy for panoramic views. istock Above the forests of Kirtland, Ohio, stretches The Judith and Maynard H. Murch Canopy Walk at Holden Arboretum. The elevated walkway spans across 500 feet and is perched 65 feet up in the trees. Once you’ve bravely crossed the walkway, the nearby Kalberer Family Emergent Tower will take you even higher up the winding stairs until you’re a cool 120 feet above the ground. You will take in sweeping views of the state all the way to Lake Erie. Oklahoma Social distance with some elephants at the Endangered Ark Foundation in Hugo, Okla. The Ark Foundation is a sanctuary for retired circus elephants and provides education to the public about the endangered Asian elephant species and their future in North America. Private and public tours of the sanctuary are offered at this time, but public tours are currently limited in group size to ensure proper social distancing. If you go, be on the lookout for the brand new baby elephant, Cameron. Also see: The COVID recession has decimated some states, but barely touched othersOregon Because of their remote location in northeastern Oregon, the Wallowa Mountains are often overlooked. The Wallowas are stunning, however, and this 40-mile mountain range is home to five of Oregon’s tallest peaks. Visitors can hike or ride horseback to the top Mt. Howard, or take the easy way out and relax on a gondola as it brings you up 3,700 feet into the “Alps of Oregon.” Pennsylvania Concerts might be just a distant memory right now, but visitors to Ringing Rocks Park in Upper Black Eddy, Penn., can try their hand at making their own music. This mysterious boulder field spans across 7 acres, and when struck with a hammer, the rocks make a ringing noise. No one is exactly sure why these rocks “sing,” but some believe it has to do with the area’s freeze-thaw cycle. Whatever the case may be, it’s a totally unique and surreal experience fitting for a totally unique and surreal time. Rhode Island Look up to the cosmos and take in some of the darkest skies on the East Coast at Frosty Drew Observatory and Sky Theatre in Charlestown, R.I. The observatory opens to the public every Friday beginning at sunset for Summer Stargazing Nights. Visitors can use Frosty Drew’s viewing equipment or bring their own for a taste of celestial magic. The observatory is adhering to strict social distancing rules and has implemented a ticketing system to limit capacity, so be sure to reserve your spot before you go. South Carolina Head to the breathtaking Botany Bay Plantation Heritage Preserve on Edisto Island in South Carolina to experience some of the state’s most beautiful and undeveloped beachfront. Visitors can take a self-guided tour of the 4,600-acre preserve and explore the whole bay without running into hoards of Myrtle Beach tourists. Erosion has led to a unique view of dead trees on the sand, and because shell collecting is prohibited, visitors can spot all kinds of shells that have washed ashore. Don’t miss: Check in, but don’t fly? Airlines launch ‘flights to nowhere’South Dakota Legend has it that outlaw Jesse James and his horse leapt across Devil’s Gulch to escape after a bank robbery. Although off the beaten path, Devil’s Gulch Park in Garretson is a picturesque park to stop for a picnic or a hike to see the falls. If you’re feeling up for even more, a trail will lead you into nearby Split Rock Park where you can hike or kayak.Tennessee Situated close to the Tennessee-North Carolina border in the Appalachian Mountains is one of the state’s best-kept secrets: Roan Mountain State Park. The cool, crystal clear Doe River winds through the center of the park’s 2,000 acres and is the home of several species of trout year-round, so bring your fishing gear. Get away from it all and stay at one of the park’s cabins or rough it a little more and camp under the stars. Texas Boca Chica Beach is unique because visitors can drive right up on the sand and grill out or just enjoy the beach. The secret, undeveloped beach near Brownsville, Texas, spans across 1,000 acres so you will have plenty of space to yourself. And hey, if you’re a space buff, you’re in luck — the SpaceX Starship launch site and test facility is nearby. Utah There’s an ocean in the middle of the Utah desert, and it’s open for exploration. Bonneville Seabase in Grantsville, Utah, is one of those places that shouldn’t exist, but it does. Thanks to spring water with the salinity of the ocean coming up through the Bonneville lake bed and the addition of ocean fish, visitors can dive and snorkel smack dab in the middle of Utah. Spaced entry times allow for guests to have plenty of space to safely explore this inland ocean. Vermont Dog Mountain is a haven for dogs and their owners alike. Perched atop a private mountaintop and covering 150 acres in St. Johnsbury, Dog Mountain is a magical place dotted with wildflowers, dog ponds and hiking trails where dogs can roam leash-free. Be sure to visit the Dog Chapel, a chapel erected in 2000 as a symbol for peace and love (something we all could use a little more of!). Guests are invited to put up a photo of their departed best four-legged friend on the chapel’s walls before heading back out to play. Also see: Can I visit family for Thanksgiving or Christmas? Your pandemic holiday travel questions, answeredVirginia Minutes away from the Blue Ridge Parkway, Fairy Stone State Park is a great place for families to social distance outdoors. The park gets its name from the mysterious (and supposedly lucky!) cross-shaped stones that can be found all across the grounds, and visitors love to come search for them. Fairy Stone spans across nearly 5,000 acres and is well-loved for its large lake. Washington Get away from it all in what is touted as the quietest spot in America. One Square Inch of Silence in the Hoh Rainforest of Olympic National Park is a noise control project from researcher and author Gordon Hempton. The spot is symbolized by a small red stone placed along the path 3.2 miles from the Visitor’s Center. Find the stone among the pristine surroundings and take a breather away from the rest of the world. West Virginia Located in what is known as a National Radio Quiet Zone, the fascinating and remote town of Green Bank, W.Va. is a sanctuary for those suffering from a condition called Electromagnetic Hypersensitivity. The people here are physically affected by technology and cellular radiation, so you’ll want to leave your phones at home. What’s interesting is that this little community is also home to the world’s largest fully steerable radio telescope, which due to its sensitivity, requires zero signal interference from other technology. You likely won’t run into anyone else here, as the population is only 143. Wisconsin If you love the beach but hate sand getting everywhere, Schoolhouse Beach in Washington Island, Wis., is the place for you. It’s one of only five beaches in the world that has limestone pebbles instead of sand. The pebbles are actually geological formations that have been worn down over thousands of years via glacier polishing, so taking a souvenir stone is strictly prohibited. Wear your water shoes and enjoy the crystal clear water!Wyoming Devil's Tower in Wyoming. istock There are so many natural wonders to see in Wyoming besides the tourist-packed Yellowstone National Park. Try heading to Devil’s Tower National Monument, a mysteriously shaped geological wonder standing 867 feet tall. Lots of theories as to how this monument got its unique shape have been tossed around, but no one is completely sure. This site was the first ever to be dubbed a National Monument and is definitely worth a visit. These are the Top 100 Best Places to Live in America in 2019 Read the original article on Livability."}]}