{"article": [{"url": "https://www.marketwatch.com/story/target-reports-record-setting-quarterly-profits-and-comparable-sales-5-billion-in-market-share-gains-for-first-half-of-2020-2020-08-19", "published": 1597914140.0, "headline": "Target reports record-setting quarterly profits and comparable sales, $5 billion in market share gains for first half of 2020", "body": "Target Corp. reported a record-setting second-quarter early Wednesday, with profits and comparable sales bolstered by market share gains and customer service options across digital platforms that drove shoppers to stores. Target’s TGT, +1.14% net income totaled $1.69 billion, or a record $3.35 per share, up from $938 million, or $1.82 last year. Adjusted EPS totaled $3.38 per share, also a record. The FactSet consensus was for EPS of $1.63. Revenue totaled $22.98 billion, up from $18.42 billion last year and ahead of the FactSet outlook for $19.97 billion. Comparable sales soared a record 24.3%, with digital comparable sales nearly tripling, up 195%, and comparable-store sales up 10.9%. The retailer added 10 million new digital customers in the first half of the year. See:Walmart says government stimulus money bolstered Q2’s blowout results and analysts are concerned now that it’s been spent The results sent Target’s stock surging 12.7% in Wednesday trading. “In the current environment, each of our categories is operating very well,” Brian Cornell, Target’s chief executive, said on a call with media. Apparel made the biggest turnaround, according to Cornell, going from a 20% decline in the first quarter to double-digit growth in the second quarter. Home was up more than 30% and electronics skyrocketed more than 70%. Market share gains for the first half of the year totaled $5 billion, the company said, calling the outcome “unusually strong” in the earnings release. “We believe the company was able to take a significant amount of share during the quarter, which bolsters our long-term view for a large share opportunity,” wrote Raymond James in a note Raymond James rates Target shares strong buy. “The basic point is that Target has developed a proposition that is cohesive which means its guests will happily shop multiple categories allowing Target to maximize its share of wallet,” wrote Neil Saunders, managing director at GlobalData Retail. “This has always been beneficial, but it came into its own at a time when consumers have been reducing the number of shopping excursions that they make. Target’s position also stands in contrast to some of its competitors, such as Walmart, which is far less able to get people to shop across multiple departments.” The biggest change that Cornell noted in the quarter was that customers returned to stores. In-store pickup was up more than 60% for the quarter, and Drive Up, where items are placed in a customer’s car, was up more than 700%. Shipt, which delivers items to customers’ homes, increased 350% from last year. Also:Amazon Prime Day delay, back-to-school uncertainty is changing the shopping calendar More than 90% of second-quarter sales growth involved stores, Target said. Target’s private grocery label, Good & Gather, became a $1 billion brand less than a year after launching, joining others like kids brand Cat & Jack and home brand Threshold. Good & Gather will be adding hundreds more items to its lineup, Cornell said. Unlike Walmart Inc. WMT, +1.00% , which talked a lot about the impact that government financial stimulus had on shoppers and the business, Target focused on the investments in areas like same-day fulfillment and its portfolio that the company made before the coronavirus pandemic began. “The stimulus was a factor, but we continue to see comp growth and we’re off to a strong start in August,” Cornell said. Early August comparable sales are up in the low double digits, Cornell said, with back-to-school starting slowly. Target expects the holiday season to begin earlier, and the company is planning on a strong Halloween with customers spending the holiday closer to home and more focused on costumes and home décor. Watch:Work from home is here to stay. Here’s what it means for retail. Looking ahead, Cornell said Target is preparing for a “hard-fought election and a holiday that’s going to be unprecedented.” With COVID-19-related uncertainty in mind, the company has suspended guidance. “As we reflect on an extraordinary second quarter, we know there’s a lot of work ahead,” he said. Target stock has rallied 20.3% for the year to date while the S&P 500 index SPX, +0.87% is up 4.5% for the period."}]}