{"article": [{"url": "https://www.marketwatch.com/story/jerry-seinfeld-roasts-that-nyc-is-dead-forever-columnist-oh-shut-up-2020-08-24", "published": 1598270240.0, "headline": "Jerry Seinfeld roasts that â\u0080\u0098NYC Is Dead Foreverâ\u0080\u0099 columnist: â\u0080\u0098Oh, shut upâ\u0080\u0099", "body": "Whatâ\u0080\u0099s the deal with bailing on New York? That now-infamous â\u0080\u009cNYC Is Dead Foreverâ\u0080\u009d blog post written by former hedge-fund manager (and onetime MarketWatch columnist) James Altucher has been a talker since it hit last week. It lamented that the City That Never Sleeps has slipped into a coronavirus coma from which it may never wake up again. â\u0080\u009cI know a lot of people who went to Maine, Vermont, Tennessee, upstate, Indiana, etc. Back to live with their parents or live with friends or live cheaper,â\u0080\u009d he wrote. â\u0080\u009cThey are gone, and gone for good.â\u0080\u009d Well, Jerry Seinfeld has three words to say to that: â\u0080\u009cOh, shut up.â\u0080\u009d The iconic comedian and titular NBC CMCSA, -0.99% Â sitcom star hit back in a New York Times column on Monday entitled, â\u0080\u009cSo You Think New York Is â\u0080\u0098Dead?â\u0080\u0099 (Itâ\u0080\u0099s not.)â\u0080\u009d Seinfeld â\u0080\u0094 who notes he has performed in Altucherâ\u0080\u0099s upper West Side comedy club Stand Up N.Y. â\u0080\u0094 recalls moving to the city in the summer of 1976, when the streets were â\u0080\u009ccovered in dog crapâ\u0080\u009d and his car was almost immediately towed. â\u0080\u009cI still thought, â\u0080\u0098This is the greatest place Iâ\u0080\u0099ve ever been in my life,â\u0080\u0099â\u0080\u009d he wrote. And that sentiment hasnâ\u0080\u0099t changed, even as Broadway theaters and many restaurants have closed, and numerous midtown office buildings remain empty, in the wake of the COVID-19 outbreak. Read more:New York City is â\u0080\u0098dead forever,â\u0080\u0099 according to this proud New Yorker And the standup comic wonâ\u0080\u0099t stand for â\u0080\u009csome putz on LinkedIn,â\u0080\u009d as he referred to Altucher, â\u0080\u009cwailing and whimpering, â\u0080\u0098Everyoneâ\u0080\u0099s gone! I want 2019 back!â\u0080\u0099â\u0080\u009d “ â\u0080\u009cWipe your tears, wipe your butt and pull it together.â\u0080\u009d ” â\u0080\u0094 Jerry Seinfeld Seinfeld questioned the argument that â\u0080\u009ceveryoneâ\u0080\u0099s gone for goodâ\u0080\u009d from New York City, or that people prefer doing everything remotely, versus in person. â\u0080\u009cEnergy, attitude and personality cannot be â\u0080\u0098remotedâ\u0080\u0099 through even the best fiber optic lines. Thatâ\u0080\u0099s the whole reason many of us moved to New York in the first place,â\u0080\u009d Seinfeld wrote, noting that even Silicon Valley tech giants largely live and work in the same hub. â\u0080\u009cReal, live, inspiring human energy exists when we coagulate together in crazy places like New York City,â\u0080\u009d Seinfeld said. â\u0080\u009cFeeling sorry for yourself because you canâ\u0080\u0099t go to the theater for a while is not the essential element of character that made New York the brilliant diamond of activity it will one day be again.â\u0080\u009d Related:â\u0080\u0098New York City, dead? Pshaw!â\u0080\u0099 says this lifelong resident. â\u0080\u0098I, for one, will not forsake my city. We roll up our sleeves and helpâ\u0080\u0099 Seinfeld also took a few digs at the places Altucher said people are fleeing to. â\u0080\u009cYou found a place in Florida? Fine. We know the sharp focus and restless, resilient creative spirit that Florida is all about,â\u0080\u009d he wrote. As for Maine, Vermont, Tennessee, Indiana: â\u0080\u009cI have been to all of these places many, many, many times over many decades,â\u0080\u009d Seinfeld said. â\u0080\u009cAnd with all due respect and affection, Are .. You .. Kidding .. Me?!â\u0080\u009d “ â\u0080\u009cThis stupid virus will give up eventually. The same way you have.â\u0080\u009d ” â\u0080\u0094 Jerry Seinfeld Seinfeld ended his argument by celebrating places like New York, Rome, London and Tokyo for abiding, for changing, for mutating, for reforming and for adapting with the times. And that stems from â\u0080\u009call the real, tough New Yorkers who, unlike you, loved it and understood it, stayed and rebuilt it,â\u0080\u009d he said. But as for Altucher? â\u0080\u009cYou will not bounce back,â\u0080\u009d Seinfeld said. â\u0080\u009cIn your enervated, pastel-filled new life in Florida. I hope you have a long, healthy run down there. I canâ\u0080\u0099t think of a more fitting retribution for your fine article.â\u0080\u009d â\u0080\u009cSee you at the club,â\u0080\u009d he wrote in one last parting shot."}]}