{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-marathon-canceled-because-of-the-coronavirus-pandemic-2020-06-24", "published": 1592997800.0, "headline": "New York City Marathon canceled because of the coronavirus pandemic", "body": "NEW YORK (AP) — The New York City Marathon scheduled for Nov. 1 was canceled Wednesday because of the coronavirus pandemic. New York Road Runners announced the cancellation of the world’s largest marathon after coordinating with the mayor’s office and deciding the race posed too many health and safety concerns for runners, volunteers, spectators and others. “While the marathon is an iconic and beloved event in our city, I applaud New York Road Runners for putting the health and safety of both spectators and runners first,” Mayor Bill de Blasio said in a statement. “We look forward to hosting the 50th running of the marathon in November of 2021.” Last year’s marathon included a world record 53,640 finishers. Entrants for the 2020 race will be offered a full refund of their entry fee or a guaranteed entry to either the 2021, 2022 or 2023 marathon. The 2021 New York City Marathon is scheduled for Nov. 7. Runners registered for the 2020 marathon and others will be invited to participate in a virtual 26.2-mile race from Oct. 17-Nov. 1. Further details will be released in July. Last month, the Boston Marathon was canceled for the first time in its 124-year history, and organizers announced a virtual event would be held instead, with participants who verify that they ran 26.2 miles, or 42.2 kilometers, on their own receiving a finisher’s medal. The Boston Marathon, which draws a field of 30,000, had originally been scheduled for April 20 before being postponed for five months because of the coronavirus pandemic. The Chicago Marathon, the world’s second largest marathon by participants with 45,000, has not yet made a public determination as to whether it will be run or postponed."}]}