{"article": [{"url": "https://www.marketwatch.com/story/woodward-responds-to-criticism-over-withheld-trump-virus-comments-11599752203", "published": 1599738260.0, "headline": "Woodward responds to criticism over withheld Trump virus comments", "body": "(FILES) In this file photo taken on June 13, 2012 Associate Editor of the Washington Post Bob Woodward speaks at the Newseum during an event marking the 40th anniversary of Watergate at the Newseum in Washington, DC. - President Donald Trump admitted that he tried to minimize the lethal threat of the coronavirus early on in the pandemic, according to excerpts reported on September 9, 2020 from a new book by veteran US journalist Bob Woodward. (Photo by Jim WATSON / AFP) (Photo by JIM WATSON/AFP via Getty Images) jim watson/Agence France-Presse/Getty Images NEW YORK (AP) — Bob Woodward, facing widespread criticism for only now revealing President Donald Trump’s early concerns about the severity of the coronavirus, told The Associated Press on Wednesday that he needed time to be sure that Trump’s private comments from February were accurate. In Woodward’s upcoming book on Trump, “Rage,” the president is quoted saying the virus was highly contagious and “deadly stuff” at a time he was publicly dismissing it as no worse than the flu. Woodward, the celebrated Washington Post journalist and best-selling author, spoke with Trump more than a dozen times for his book. “He tells me this, and I’m thinking, ‘Wow, that’s interesting, but is it true?’ Trump says things that don’t check out, right?” Woodward told the AP during a telephone interview. Using a famous phrase from the Watergate era, when Woodward’s reporting for the Post helped lead to President Richard Nixon’s resignation, Woodward said his mission was to determine, “What did he know and when did he know it?” See also: Trump himself asks why Woodward didn’t immediately report the president’s comments about playing down the coronavirus On Twitter TWTR, -0.23% and elsewhere online, commentators accused Woodward of valuing book sales over public health. “Nearly 200,000 Americans have died because neither Donald Trump nor Bob Woodward wanted to risk anything substantial to keep the country informed,” wrote Esquire’s Charles P. Pierce. The issue of daily journalists presenting newsworthy information in books isn’t new. The competition for attention is intense, and headlines help boost sales and guest shots for interviews. Reporter Michael S. Schmidt of The New York Times recently attracted attention for his book, “Donald Trump v. The United States,” by reporting new details on an unannounced visit by Trump to Walter Reed military hospital in November 2019. Schmidt reported that Vice President Mike Pence was put on alert that he might have to briefly assume the powers of the presidency if the president had to undergo a procedure that required anesthesia. iframe.twitter-tweet { width: 100% !important; } Pence later said he didn’t recall being put on standby for the Reed visit, which the White House has said was part of the president’s routine annual physical. But Schmidt’s book renewed speculation about Trump’s health. Political figures with book deals also have been chastised for holding back timely material. Former national security adviser John Bolton, whose scathing memoir “The Room Where It Happened” came out in June, declined discussing Trump’s actions towards Ukraine while the impeachment hearings were being held earlier this year. Woodward’s book, which comes out next week, draws from 18 conversations with Trump between December and July. During his AP interview, Woodward said Trump called him “out of the blue” in early February to “unburden himself” about the virus, which then had few cases in the U.S. But Woodward said that only in May was he satisfied that Trump’s comments were based on reliable information and that by then the virus had spread nationwide. “If I had done the story at that time about what he knew in February, that’s not telling us anything we didn’t know,” Woodward said. At that point, he said, the issue was no longer one of public health but of politics. His priority became getting the story out before the election in November. “That was the demarcation line for me,” he said. “Had I decided that my book was coming out on Christmas, the end of this year, that would have been unthinkable.” Asked why he didn’t share Trump’s February remarks for a fellow Post reporter to pursue, Woodward said he had developed “some pretty important sources” on his own. “Could I have brought others in? Could they have done things I couldn’t do?” he asked. “I was on the trail, and I was (still) on the trail when it (the virus) exploded.”"}]}