{"article": [{"url": "https://www.marketwatch.com/story/bond-buyers-blindsided-by-higher-inflation-expectations-after-price-pressures-resurface-11597420329", "published": 1597406420.0, "headline": "Bond buyers blindsided by higher inflation expectations after price pressures resurface", "body": "Mark Wilson/Getty Images After worrying over the prospect of deflation, investors this week were hit by a combination of economic reports that suggest such concerns were overdone. As a result, the bond market’s expectations for prices of goods and services hit a near six month high. The jolt higher comes despite a COVID-19 pandemic that has caused mass bankruptcies, widespread unemployment and a sluggish economic recovery. The 10-year breakeven rate, or what buyers of Treasury inflation-protected securities (TIPs) anticipate consumer prices will look like over the next decade, rose as high as 1.72% on Thursday, their highest rate since February and well above the 0.50% low plumbed in mid-March. It eventually finished at 1.67%. Inflation breakeven rates for TIPs do a reasonable job of tracking the trajectory of consumer prices, according to the Bureau of Labor Statistics. This surge in inflation expectations has also spilled over into trading for plain-vanilla Treasurys, vulnerable to intensifying price pressures. The 10-year note yield TMUBMUSD10Y, 0.777% returned back above 0.70% on Thursday, while the 30-year bond yield climbed 5.7 basis points to 1.422%. Bond prices move inversely to yields. Consumer prices, producer prices and import prices all jumped in July, topping forecasts of analysts who still remain dour on a full recovery in inflation with the pandemic still unresolved. “There’s signs that inflation is bottoming out,” said Esty Dwek, head of global macro strategy at Natixis Investment Managers, in an interview. Morgan Stanley analysts said the 0.6% increase in July consumer prices strengthened their expectations that personal-consumption expenditures could temporarily shoot above 2% next year, a feat that rarely seen in the post-2008 economic backdrop. They advised investors to bet on a widening of yield spreads between shorter and longer-term bond yields by simultaneously going long on 5-year Treasury inflation-protected securities and shorting the 30-year bond. But some say the recent talk of reflation demonstrates how some investors have been too quick to change their opinions amid the uncertainty around the COVID-19 pandemic’s ultimate economic impact. “Traders and economists cannot wait to rush to conclusions on fundamental debates when pandemic lessons argue rushed conclusions need constant revisions,” said Jim Vogel, an interest-rate strategist at FHN Financial, in a note. Others argue breakeven inflation expectations may not offer a true snapshot of how bond investors feel inflation will shape up. That’s because trading in Treasury inflation-protected securities remains thin, so even a modest increase in demand can lift breakeven rates. “You only need a few asset managers to buy TIPs and you’ll see a significant increase in inflation expectations,” said Zhiwei Ren, a portfolio manager at Penn Mutual Asset Management, in an interview. The iShares TIPS Bond exchange-traded fund TIP, +0.03% is up 7.7% year-to-date."}]}