{"article": [{"url": "https://www.marketwatch.com/story/paul-krugman-trumps-payroll-tax-cuts-are-the-hydroxychloroquine-of-economic-policy-2020-08-10", "published": 1597077560.0, "headline": "Paul Krugman: Trumpâ\u0080\u0099s payroll tax cut is â\u0080\u0098the hydroxychloroquine of economic policyâ\u0080\u0099", "body": "President Trumpâ\u0080\u0099s bold move to bypass Congress by signing his own executive order and memorandums for coronavirus relief over the weekend drew plenty of strong reactions from both Democrats and Republicans. His actions to defer payroll taxes and replace the expired supplemental $600 unemployment benefit with a plan that would pay up to $400, in particular, drew questions about their effectiveness, and whether the president has the right to overwrite the legislative branch of U.S. government. Nobel Prize-winning economist and New York Times columnist Paul Krugman is among the most vocal critics, calling payroll tax cuts â\u0080\u009cthe hydroxychloroquine of economic policyâ\u0080\u009d in both a CNN interview and on his official Twitter TWTR, -0.23% Â account on Sunday. iframe.twitter-tweet { width: 100% !important; } His dig harks back to the fervid belief by some during the pandemic, including the president, that the malaria drug would be a silver bullet against COVID-19. That has not proven to be the case. Krugman said that payroll tax cuts are a â\u0080\u009cknown bad ideaâ\u0080\u009d on CNN, adding, â\u0080\u009cEven Senate Republicans basically said, â\u0080\u0098Letâ\u0080\u0099s forget about that. Thatâ\u0080\u0099s a really stupid idea,â\u0080\u0099â\u0080\u009d during deliberations for a new relief package. Indeed, Republican Sen. Ben Sasse of Nebraska called the executive order â\u0080\u009cunconstitutional slopâ\u0080\u009d in a statement on Sunday. â\u0080\u009cPresident Obama did not have the power to unilaterally rewrite immigration law with DACA and President Trump does not have the power to unilaterally rewrite the payroll tax law,â\u0080\u009d he said. Top Democratic senators Nancy Pelosi and Chuck Schumer also piled on, releasing a statement calling the presidentâ\u0080\u0099s actions â\u0080\u009cunworkable, weak and narrow.â\u0080\u009d Some experts told MarketWatch that they were skeptical whether the order would even bump up take-home money all that much per paycheck. Read more:Hereâ\u0080\u0099s what Trumpâ\u0080\u0099s payroll tax deferral could mean for your paycheck But Trump supporters such as Senate Majority Leader Mitch McConnell (R-Ky.) praised the executive decision. â\u0080\u009cStruggling Americans need action now,â\u0080\u009d McConnell said in a statement on Saturday. â\u0080\u009cSince Democrats have sabotaged backroom talks with absurd demands that would not help working people, I support President Trump exploring his options to get unemployment benefits and other relief to the people who need them the most.â\u0080\u009d Read more:Trump extends unemployment benefits, defers payroll tax In a Twitter thread, Krugman wrote that payroll taxes help fund Social Security and Medicare, and so cutting them would â\u0080\u009cundermine the finances of programs that are absolutely crucial to the lives of older Americans.â\u0080\u009d “ â\u0080\u009cItâ\u0080\u0099s a known quack remedy that everybody who knows anything has said is useless and dangerous, including Republicans.â\u0080\u009d ” Whatâ\u0080\u0099s more, he said that combining a payroll tax cut with a new and more complicated unemployment benefits program, especially after many people struggled to claim their benefits from the first Cares Act package, could have â\u0080\u009cdangerous side effects.â\u0080\u009d â\u0080\u009cIâ\u0080\u0099m extremely worried about a greater recession coming from it,â\u0080\u009d said Krugman. Trump announced last week that he was eyeing an executive order after Congress failed to compromise and pass a new coronavirus rescue package, even though using his executive power to provide economic aid over the legislative branch is a legal gray area. Opinion: Trumpâ\u0080\u0099s executive orders would boost the stock market Stocks opened modestly higher off the news on Monday DJIA, +0.56% Â , however, with analysts noting that even if the executive orders are illegal or ineffective, they could give Congress a kick in the pants to finally reach an agreement on a bipartisan stimulus plan."}]}