{"article": [{"url": "https://www.marketwatch.com/story/as-biden-widens-polling-lead-over-trump-heres-who-could-be-his-vice-presidential-pick-2020-06-10", "published": 1597049720.0, "headline": "With Bidenâ\u0080\u0099s VP choice expected this week, hereâ\u0080\u0099s whom he could pick", "body": "It is almost decision time for Joe Biden: The presumptive Democratic presidential nominee said in late July that heâ\u0080\u0099d settle on a running mate in the first week of August, and heâ\u0080\u0099s expected to reveal his pick this week. Biden has given a few clues about who his pick will be. The former vice president told MSNBC that four Black women are on his shortlist, though he didnâ\u0080\u0099t guarantee a Black woman would be his running mate. â\u0080\u009cBlack women have supported me my whole career,â\u0080\u009d Biden told the network on July 20. â\u0080\u009cI have been loyal, and they have been loyal to me â\u0080\u0094 and so itâ\u0080\u0099s important that my administration, I promise you, will look like America.â\u0080\u009d Also read:Bidenâ\u0080\u0099s running-mate search is getting â\u0080\u0098outsized attentionâ\u0080\u0099 and could even shake the stock market â\u0080\u0094 hereâ\u0080\u0099s how Sen. Kamala Harris of California â\u0080\u0094 who battled Biden for the nomination â\u0080\u0094 currently tops betting markets, followed by former national security adviser Susan Rice. The New York Times has reported that Rice and Rep. Karen Bass of California are among the leading contenders, and that Biden has been meeting with finalists. Harris, Bass and Rice are Black. Biden was photographed in late July holding notes with Harrisâ\u0080\u0099 name at the top, along with a set of talking points about her, fueling fresh speculation about her standing as a running mate, CNN reported. Donâ\u0080\u0099t miss:Bidenâ\u0080\u0099s running-mate search is getting â\u0080\u0098outsized attentionâ\u0080\u0099 and could even shake the stock market â\u0080\u0094 hereâ\u0080\u0099s how And see:Politicians have supported heavily armed police task forces â\u0080\u0094 with underwhelming outcomes Here is a list of possible picks for Biden, derived from recent analyses by CNN as well as the PredictIt betting market. While not intended to be fully comprehensive, the table below reflects many of the frequently discussed candidates. Name Age Position Stacey Abrams 46 Former candidate for Georgia governor Tammy Baldwin 58 U.S. senator from Wisconsin Karen Bass 66 U.S. representative from California Keisha Lance Bottoms 50 Atlanta mayor Val Demings 63 U.S. representative from Florida Tammy Duckworth 52 U.S. senator from Illinois Kamala Harris 55 U.S. senator from California Michelle Lujan Grisham 60 New Mexico governor Gina Raimondo 49 Rhode Island governor Susan Rice 55 Former national-security adviser Elizabeth Warren 71 U.S. senator from Massachusetts Gretchen Whitmer 48 Michigan governor This is an updated version of a report first published on June 10, 2020. MarketWatchâ\u0080\u0099s Victor Reklaitis contributed to this report."}]}