{"article": [{"url": "https://www.marketwatch.com/story/science-itself-is-on-the-ballot-so-this-175-year-old-institution-makes-its-first-ever-endorsement-for-president-2020-09-15", "published": 1600180520.0, "headline": "â\u0080\u0098Scienceâ\u0080\u0099 itself is on the ballot, so this 175-year-old institution makes its first ever endorsement for president", "body": "Scientific American, considered to be the longest continuously published magazine in the U.S. and claiming articles by more than 150 Nobel Prize winners dating back to its 1845 origins, has never endorsed a presidential candidate in its 175-year history. Until now. The publication is backing Joe Biden, it said Tuesday. â\u0080\u009cThis year we are compelled to do so. We do not do this lightly,â\u0080\u009d editors wrote in the October issue just released and in corresponding tweets. â\u0080\u009cThe evidence and the science show that Donald Trump has badly damaged the U.S. and its people.â\u0080\u009d â\u0080\u009cThe most devastating example is his dishonest and inept response to the COVID-19 pandemic, which cost more than 190,000 Americans their lives by the middle of September,â\u0080\u009d the editors wrote. Read:Coronavirus update: Global cases edge toward 30 million, and China says vaccine may be ready by November Environmental factors and other public-health issues also prompted the publication to take its stance. President Trump, visiting a singed California this week, could no longer put off commenting on climate change, which critics noted he had done for weeks. Wade Crowfoot, Californiaâ\u0080\u0099s secretary for natural resources, told the president during a briefing on the fires that state officials â\u0080\u009cwant to work with you to really recognize the changing climate and what it means to our forests,â\u0080\u009d spurring Trump to say: â\u0080\u009cItâ\u0080\u0099ll start getting cooler. You just watch.â\u0080\u009d Crowfoot said he wished science agreed with that view, and Trump then said he doesnâ\u0080\u0099t think â\u0080\u009cscience knows actually.â\u0080\u009d Extreme weather and natural disasters have historically had a shaky association to the broader issue of climate change. But scientists say a warming Earth has upped the frequency, irregularity and impact of extreme weather events; longer droughts, for instance, are creating a tinder box in the West. Trump, for his part, has emphasized local forest management as key to pre-emptively containing seasonal blazes; about 57% of Californiaâ\u0080\u0099s forests are federally managed. In just the latest move, Trumpâ\u0080\u0099s EPA has dropped a methane-emissions rule for oil and gas fields, prompting some states to vow to sue over the rollback. Read:Trump now backs higher-ethanol gas at pumps in move to court farm votes before November Joe Biden, speaking this week on the other side of the country, riffed on Trumpâ\u0080\u0099s recent go-to about endangered life in the suburbs. These communities are at risk, the president has suggested, from protests and efforts to abate income inequality through diverse housing. â\u0080\u009cIf we have four more years of Trumpâ\u0080\u0099s climate denial, how many suburbs will be burned in wildfires?â\u0080\u009d Biden countered on Monday. â\u0080\u009cHow many suburbs will have been flooded out? How many suburbs will have been blown away in superstorms?â\u0080\u009d Bidenâ\u0080\u0099s climate-change platform is more complete than the incumbentâ\u0080\u0099s but has faced its own questions, particularly as the former vice president has at times wavered on his stance on supporting the fossil-fuel industry, a key issue in swing states. Read:Facebook gives in to pressure on climate-change myths â\u0080\u0094 including that antifa started deadly wildfires in western states â\u0080\u0094 with new â\u0080\u0098science-basedâ\u0080\u0099 hub"}]}