{"article": [{"url": "https://www.marketwatch.com/story/cdc-says-retracted-posting-changing-the-agencys-position-on-the-aerosolized-spread-of-coronavirus-was-an-honest-mistake-2020-09-21", "published": 1600724000.0, "headline": "CDC says retracted posting that appeared to change the agency's position on the aerosolized spread of coronavirus was 'an honest mistake'", "body": "NEW YORK (AP) - The top U.S. public health agency stirred confusion by posting - and then taking down - an apparent change in its position on how easily the coronavirus can spread from person to person through the air. But officials at the Centers for Disease Control and Prevention say their position has not really changed and that the post last week on the agency's website was an error that has been taken down. It was \"an honest mistake\" that happened when a draft update was posted before going through a full editing and approval process, said Dr. Jay Butler, the CDC's deputy director for infectious diseases. The post suggested that the agency believes the virus can hang in the air and spread over an extended distance. But the agency continues to believe larger and heavier droplets that come from coughing or sneezing are the primary means of transmission, Butler said. Most CDC guidance about social distancing is built around that idea, saying that about 6 feet is a safe buffer between people who are not wearing masks. Coronavirus daily update:'Biology is independent of politics,' said White House coronavirus testing czar Admiral Brett Giroir, who also said there was currently no safe and effective vaccine In interviews, CDC officials have acknowledged growing evidence that the virus can sometimes be transmitted on even smaller, aerosolized particles or droplets that spread over a wider area. Certain case clusters have been tied to events in which the virus appeared to have spread through the air in, for example, a choir practice. But such incidents did not appear to be common. Public health experts urge people to wear masks, which can stop or reduce contact with both larger droplets and aerosolized particles. But for months, agency officials said little about aerosolized particles. So when the CDC quietly posted an update Friday that discussed the particles in more detail, the agency's position appeared to have changed. The post said the virus can remain suspended in the air and drift more than 6 feet. It also emphasized the importance of indoor ventilation and seemed to describe the coronavirus as the kind of germ that can spread widely through the air. The post caused widespread discussion in public health circles because of its implications. It could mean, for example, that hospitals might have to place infected people in rooms that are specially designed to prevent air from flowing to other parts of the hospital. But the CDC is not advising any changes in how far people stay away from each other, how they are housed at hospitals or other measures, Butler said. The CDC has come under attack for past revisions of guidance during the pandemic, some of which were driven by political pressure by the Trump administration. Butler said there was no external political pressure behind the change in this instance. \"This was an internal issue. And we're working hard to address it and make sure it doesn't happen again,\" he said. In a statement released Monday, the CDC said the revisions to the \"How COVID-19 Spreads\" page happened \"without appropriate in-house technical review.\" \"We are reviewing our process and tightening criteria for review of all guidance and updates before they are posted to the CDC website,\" the statement said. At least one expert said the episode could further chip away at public confidence in the CDC, which has taken a number of such blows as critics and the public express concern that President Donald Trump and his allies are seeking to interfere in the messaging, and perhaps even the science, of public health agencies to minimize the public perception that the country remains in a health crisis as the November election draws near. See:Trump health official Caputo to take leave of absence after blasting government scientists \"The consistent inconsistency in this administration's guidance on COVID-19 has severely compromised the nation's trust in our public health agencies,\" said Dr. Howard Koh, a Harvard University public health professor who was a high-ranking official in the Department of Health and Human Services during the Obama administration. \"To rectify the latest challenge, the CDC must acknowledge that growing scientific evidence indicates the importance of airborne transmission through aerosols, making mask wearing even more critical as we head into the difficult fall and winter season,\" Koh said in a statement. Read on:MarketWatch 'A Word from the Experts' Q&A with Dr. Howard Koh MarketWatch contributed."}]}