{"article": [{"url": "https://www.marketwatch.com/story/opec-committees-power-of-words-helps-to-lift-oil-prices-11600369655", "published": 1600355720.0, "headline": "OPEC+ committeeâ\u0080\u0099s power of words helps to lift oil prices", "body": "A handout photo released by the Saudi Press Agency (SPA) on April 9, 2020 in Riyadh shows Saudi Energy Minister Prince Abdulaziz bin Salman al-Saud (R), chairing the virtual extraordinary meeting of the virtual extraordinary meeting of Organisation of the Petroleum Exporting Countries (OPEC) and non-OPEC countries, amid the novel coronavirus pandemic. (Photo by - / SPA / AFP) / ==RESTRICTED TO EDITORIAL USE - MANDATORY CREDIT \"AFP PHOTO/ HANDOUT/ SAUDI PRESS AGENCY/SPA \" - NO MARKETING - NO ADVERTISING CAMPAIGNS - DISTRIBUTED AS A SERVICE TO CLIENTS (Photo by -/SPA/AFP via Getty Images) -/Agence France-Presse/Getty Images Members of the Organization of the Petroleum Exporting Countries and their allies held a regularly scheduled monthly joint committee meeting on Thursday that wasnâ\u0080\u0099t expected to offer any surprises, but nevertheless has made a convincing impression on those doubting the oil producersâ\u0080\u0099 commitment to fully comply with their agreed output cuts. The allied producers, collectively known as OPEC+, â\u0080\u009cgave the impression that it does not sweep troubles under the carpet,â\u0080\u009d said Bjornar Tonhaugen, head of oil market at Rystad Energy, in emailed comments. â\u0080\u009cThe alliance is clearly upset at the sub-compliers and showed that it is not willing to tolerate their lack of action for much longer.â\u0080\u009d The Joint Ministerial Monitoring Committee of OPEC+ left its current production quotas in place. Under that agreement, it pared record production cuts of 9.7 million barrels per day to 7.7 million barrels per day starting in August, and also said at the time that countries that failed to previously meet their quota limits would need to compensate for their overproduction. The most notable change Thursday was the committeeâ\u0080\u0099s announcement that it would recommend that OPEC approve an extension of this compensation mechanism, which was set to end in September, until the end of December. However, oil market traders and analysts couldnâ\u0080\u0099t help but notice the strong language the committee used in its opening and closing statements and press conference. In an opening statement, Saudi Arabiaâ\u0080\u0099s Minister of Energy Prince Abdulaziz bin Salman, who is also chair of the Joint Ministerial Monitoring Committee, emphasized the need for all countries to fully conform to their production adjustments. â\u0080\u009cNot fully complying, and then compensating, should not become the norm,â\u0080\u009d he said. â\u0080\u009cFull compliance is not an act of charity. It is an integral part of our collective effort to maximize the interest and gains of every individual member of this group.â\u0080\u009d Following the committeeâ\u0080\u0099s closed door meeting, the JMMC emphasized in its closing statement the â\u0080\u009ccritical importanceâ\u0080\u009d of fully adhering to production cuts and compensating for overproduction â\u0080\u009cas soon as possible.â\u0080\u009d It also said that it is aware that an increase in COVID-19 cases has appeared in some countries. In this environment, the committee said itâ\u0080\u0099s important to be â\u0080\u009cpro-active and pre-emptiveâ\u0080\u009d and recommended that participating countries be â\u0080\u009cwilling to take further necessary measures when needed.â\u0080\u009d That leaves open the possibility for OPEC+ discussions, outside of the monthly JMMC meetings, before the official OPEC Conference and OPEC+ gatherings that will be held on Nov. 30 and Dec. 1. Referring to OPEC+, Prince Abdulaziz said during the question and answer session with journalists: â\u0080\u009cThis alliance is here to stay.â\u0080\u009d â\u0080\u009cThe clear message of the day was that Saudi Arabia is no longer willing to act as the balancer, cutting its production more deeply in order to compensate for othersâ\u0080\u0099 overproduction. Nor is it willing to allow OPEC+ participants to spread out production cuts on their own initiative, overproducing one month and compensating another,â\u0080\u009d said Cailin Birch, global economist at The Economist Intelligence Unit. Saudi Arabia has â\u0080\u009casked for the complete buy-in of its OPEC+ partners in no uncertain terms.â\u0080\u009d Birch told MarketWatch that she believes the United Arab Emirates was the â\u0080\u009cmain target of these remarks, even though it was not specifically named.â\u0080\u009d Several countries, including Iraq and Nigeria, had been overproducing previously, â\u0080\u009cbut have made progress to adjust for this in recent months,â\u0080\u009d she said. â\u0080\u009cOf Saudiâ\u0080\u0099s main allies, only the UAE continues to steadily exceed its output quotas.â\u0080\u009d The comments by Prince Abdulaziz helped to lift oil prices Thursday. â\u0080\u009cIn this sense, the comments have already achieved one intended target,â\u0080\u009d said Birch. Â October West Texas Intermediate crude CLV20 settled at $40.97 a barrel, up 81 cents, or 2%, on the New York Mercantile Exchange, while November Brent crude BRNX20 ended at $43.30 a barrel, up $1.08, or 2.6% on ICE Futures Europe on Thursday. Still, â\u0080\u009cit remains to be seen if real production volumes will fall as quickly as Saudi Arabia would like them to, which could set off further diplomatic clashes in the coming months,â\u0080\u009d Birch said."}]}