{"article": [{"url": "https://www.marketwatch.com/story/heres-how-record-negative-real-yields-are-driving-a-crowded-rally-in-stocks-gold-and-everything-else-11597062332", "published": 1597048400.0, "headline": "Hereâ\u0080\u0099s how record negative â\u0080\u0098real yieldsâ\u0080\u0099 are driving a crowded rally in stocks, gold and everything else", "body": "AFP/Getty Images Deeply negative real yields â\u0080\u0093 bond yields after accounting for inflation â\u0080\u0093 are driving gains in all corners of financial markets. Thatâ\u0080\u0099s the growing view among market participants who say the decline of this key bond market indicator has driven increased risk-taking but also a surge in traditional safe havens like gold among investors who are looking for assets that offer higher returns and also offset the losses arising from inflation. The 10-year real yield stood at around a negative 1.05%, derived from trading in Treasury inflation-protected securities. It hit its record low of negative 1.11% on Thursday. Meanwhile, the 10-year Treasury yield BX:TMUBMUSD10Y has swung in a narrow range between 0.50% and 0.90% since March, and now trades at 0.57%, Tradeweb data show. Bond prices move inversely to yields. This deepening slide into negative territory reflects how Treasurys have been locked in place as easy monetary policy has not only kept yields in check but also raised expectations that growth and inflation will eventually normalize in the next few years. By definition, the nominal bond yield is equal to inflation expectations plus the real yield. The combination of higher price prospects but quiet trading in the bond market therefore forces down real yields. â\u0080\u009cItâ\u0080\u0099s got to come out of somewhere. Thereâ\u0080\u0099s no free lunch,â\u0080\u009d said Jim Caron, senior portfolio manager at Morgan Stanley Investment Management, in an interview. See: A lurking tension threatens to break the bond market out of its summer doldrums Investors have traditionally understood the real yield as one of the most important gauges of financial valuations because a lower risk-free interest rate makes all other assets more inviting by comparison. As a result, the fall in inflation-adjusted interest rates has fanned a broad-based rally in gold, high-growth stocks, corporate bonds and emerging market assets. The S&P 500 SPX, +0.87% is a hairâ\u0080\u0099s breadth away from its all-time high, the tech-heavy Nasdaq Composite COMP, +1.39% has rung in new records with every passing day, and meager yielding investment-grade corporate bonds have reaped double-digit gains this year. Lower real yields have also powered the dollarâ\u0080\u0099s decline as assets of other currencies become more attractive, providing another tailwind to the rally in risk assets. The greenback is down 3% year-to-date, based on trading in the ICE U.S. Dollar Index. DXY â\u0080\u009cThe dollar is the worldâ\u0080\u0099s reserve currency but also a store of value. When that value moves down, you start to look for other places for value,â\u0080\u009d said Caron. But some warn the slide in real yields is leading to crowded positioning in assets benefiting from an expectation that interest rates will remain low for a protracted period, creating the risk of a vicious whiplash if real yields do turn higher, according to Charles McElligott, Â cross-asset strategist at Nomura. That risk is especially acute as computer-driven strategies among hedge funds and commodity trading advisors levered up to amplify their profits from bullish investment positions which, in effect, were wagers on real yields staying depressed. If these levered traders are forced to dump their holdings to avoid taking on heavy losses, the reversal could amplify a selloff in gold, tech stocks and longer-dated Treasurys. However, few investors see a vigilant Federal Reserve allowing a sharp rise in real yields and the tighter financial conditions that would follow from its surge. The expectation is the central bank will step in with large-scale asset purchases tilted towards longer-dated Treasurys to ensure lending is supportive of a U.S. recovery. â\u0080\u009cThere is a view in the market that if rates were to rise and if there were any issues while the economy would continue to struggle the Fed would step in to do whatever is required,â\u0080\u009d John Canavan, an analyst at Oxford Economics, told MarketWatch. This week, investors will sift through another round of corporate earnings. Royal Caribbean Cruises Ltd RCL, +2.59%, Marriott International Inc. MAR, -0.96%, Occidental Petroleum OXY, -3.22%, Simon Property Group SPG, -3.35%, Cisco Systems CSCO, +0.15% and Applied Materials Inc. AMAT, +1.10% are among the companies reporting their results. This week will also offer a less hectic calendar for economic data. Still, retail sales and consumer prices will offer a snapshot of the recovery in U.S. household spending, without which investors say a return to normal economic activity is hard to imagine."}]}