{"article": [{"url": "https://www.marketwatch.com/story/natural-gas-futures-gain-nearly-50-in-august-but-rally-may-be-short-lived-2020-09-01", "published": 1598981960.0, "headline": "Natural-gas futures gain nearly 50% in August, but rally may be â\u0080\u0098short-livedâ\u0080\u0099", "body": "Natural-gas futures rallied in August, tacking on nearly 50% to tally their largest monthly percentage gain in more than a decade as strong demand for the fuel in power generation significantly cut U.S. supplies in storage. In March, U.S. inventories of natural gas were 81% higher than the same a time year ago, but supplies recently stood at 20% above the year-ago level, according to Peter McNally, global sector lead for industrial materials and energy at investment research firm Third Bridge. The â\u0080\u009cneed for backup power and peaking power demandâ\u0080\u009d increased in the short term, amid blackouts in California, lifting usage of natural gas, he says. On Aug. 31, October natural-gas futures US:NGV20 Â settled at $2.63 per million British thermal units, with front-month prices climbing by roughly 46% for the month to date. They posted the largest one-month percentage rise since September 2009, when prices rose 62.6%, according to Dow Jones Market Data. Prices saw a big increase at the beginning of August, buoyed by â\u0080\u009cstrong demand from natural gas-fired power generation,â\u0080\u009d according to a monthly report from the Energy Information Administration released on Aug. 11. The EIA estimates that natural-gas consumption for power generation rose to 43.6 billion cubic feet per day in July 2020, â\u0080\u009chigher than any month on record.â\u0080\u009d Still, a decline in industrial natural-gas consumption, which fell by 1.4 billion cubic feet per day in July from a year earlier, likely due to slower economic activity, partially offset strength in consumption from electric power, the EIA said. Meanwhile, the â\u0080\u009cregulatory climateâ\u0080\u009d has limited future supply growth, says McNally. Duke Energy Corp. DUK, +0.16% Â and Dominion Energy Inc. D, -0.34% Â cancelled the Atlantic Coast Pipeline, which would have â\u0080\u009ctaken natural gas from Appalachia to the Carolinas,â\u0080\u009d he says. Companies that produce natural gas, as well as the number of active natural-gas drilling rigs, have also failed to respond to higher prices, he said. â\u0080\u009cNatural-gas drilling remains at multiyear lowsâ\u0080\u009dâ\u0080\u0094likely due in part to financial issues, with Chesapeake Energy Corp. CHKAQ, +5.72%, a major producer, filing for bankruptcy, he says. Natural-gas production has fallen as producers have cut back on drilling and completion activities as a result of lower oil and natural-gas prices, according to the EIA, which estimates that output declined to 86.8 billion cubic feet per day in July, down 9.5 billion from the peak in November of 2019. That, combined with the rise in power generation demand, contributed to lower-than-average U.S. supply increases in July, it said. Even so, for the week ending Aug. 21, natural-gas inventories stood around 20% above the year-ago level. The market will be looking to natural-gas output thatâ\u0080\u0099s associated with oil production, says McNally. â\u0080\u009cAdditional supplies of natural gas have emerged from the Permian Basin that produces natural gas associated with targeted oil production,â\u0080\u009d he says. â\u0080\u009cThat associated gas supply has come off with oil production in recent months, but it is something we will be watching going ahead.â\u0080\u009d “ The natural-gas supply surplus â\u0080\u0098remains formidable with the summer cooling season drawing to a close in September.â\u0080\u0099 ” â\u0080\u0094 Marshall Steeves, IHS Markit Meanwhile, Hurricane Laura, which made landfall in Louisiana in late August, also contributed to the climb in natural-gas prices, says Marshall Steeves, energy markets analyst IHS Markit, with the resulting production decline expected to be met with a similar fall in demand due to power losses. Prices for natural gas have climbed by nearly 80% from the year-to-date low in late June of around $1.48 Btus. However, the natural-gas supply surplus â\u0080\u009cremains formidable with the summer cooling season drawing to a close in September,â\u0080\u009d which is a transitional month, says Steeves. The natural-gas price rally may be â\u0080\u009cshort-lived, absent another heat wave or supply disruption,â\u0080\u009d he says."}]}