{"article": [{"url": "https://www.marketwatch.com/story/new-york-said-action-but-many-film-and-tv-cameras-wont-get-rolling-until-september-or-later-2020-07-31", "published": 1596219620.0, "headline": "New York said â\u0080\u0098action,â\u0080\u0099 but many film and TV cameras wonâ\u0080\u0099t get rolling until September or later", "body": "New York City gave movie and television crews the Phase 4 green light on July 20, the same day professional sports teams were cleared to play without cheering (or jeering) fans in the stands â\u0080\u0094 just silent cardboard cutouts.Â And while the Yankees and Mets are swinging for the fences and the Islanders and the Rangers hit the ice for an exhibition NHL game, the stars of â\u0080\u009cThe Marvelous Mrs. Maisel,â\u0080\u009d â\u0080\u009cLaw & Order: SVUâ\u0080\u009d and â\u0080\u009cBlue Bloodsâ\u0080\u009d â\u0080\u0094 popular New York TV shows â\u0080\u0094 are still warming the bench.Â Things are progressing, though. Production offices, closed since mid-March, are opening, starsâ\u0080\u0099 schedules are getting untangled and scripts are being written and fine-tuned.Â â\u0080\u009cWeâ\u0080\u0099ve tried to take a very measured response to the production rollout. September is when weâ\u0080\u0099ll start to see some of the bigger shows come back,â\u0080\u009d said Anne del Castillo, commissioner of the Mayorâ\u0080\u0099s Office of Media and Entertainment (MOME). â\u0080\u009cThat will include some locations throughout New York City.Â â\u0080\u009cBut even then, because of geographic limitation, itâ\u0080\u0099s not like youâ\u0080\u0099re going to see a hundred productions on the street,â\u0080\u009d continued del Castillo, whose office handles permits for on-location shoots. Widespread outdoor dining up-and-down New York City streets also poses a challenge for film crews, and will change the way productions are rolled out until the end of October, when the cityâ\u0080\u0099s street-eating initiative is due to end. As part of the rules for on-location shoots, they canâ\u0080\u0099t come within 21 feet of eateries participating in the open-restaurants program without permission. When it comes to people and businesses, â\u0080\u009cNew York is so dense. Weâ\u0080\u0099re trying to share the streets. We canâ\u0080\u0099t have shows filming on top of open restaurants,â\u0080\u009d she said.Â As of July 27, a maximum of 50 cast and crew are allowed for shoots on public property, which is double the number in the previous protocols. â\u0080\u009cI know a group of filmmakers making music videos who havenâ\u0080\u0099t taken their foot off the gas,â\u0080\u009d Mitchell-Brown said, adding that they observed Phase 3 maximums and social distancing and safety guidelines. â\u0080\u009cThey were in the Lower East Side. They were in Queens.â\u0080\u009d Currently, no more than two cameras, three lighting stands, and five vehicles may be used for shooting through Oct. 31. In addition al-fresco dining, on-location shoots canâ\u0080\u0099t get in the way of hospitals and COVID-19 testing centers to ensure 24/7 access. â\u0080\u009cRight now,â\u0080\u009d del Castillo said, â\u0080\u009cweâ\u0080\u0099re all just trying to figure out what all the constraints are.â\u0080\u009dÂ They already know what the stakes are.Â In January, in response to an article about New York-based productions, Flo Mitchell-Brown, Chair of New York Production Alliance, which promotes and supports various facets of production, noted that â\u0080\u009cNew York state is now the nationâ\u0080\u0099s second-leading location for TV and film, behind only California, home of Hollywood.â\u0080\u009dÂ William Baldwin filmed on location in Brooklyn for â\u0080\u009cBlowtorchâ\u0080\u009d in 2012. Getty Images In 2019, roughly 200 productions applied for the stateâ\u0080\u0099s film tax credit, created more than 250,000 jobs and generated $4.8 billion in new spending, Mitchell-Brown said.Â See: New York metropolitan area lost nearly 1.5 million jobs in June, the most of any U.S. city Figures from MOME show that New York City TV and film production was at an all-time high pre-pandemic, generating more than $60 billion in annual direct economic activity for the city and $3 billion in tax revenue. There were 80 TV series and 300 films being shot in the city before COVID hit, putting more than 100,000 New Yorkers to work. More than 2,000 local small businesses are supported by film and TV production. â\u0080\u009cI want to be a little bit careful,â\u0080\u009d del Castillo said, adding that state and local government agencies, unions, production offices and others are in the cast of characters mapping out a safe return. â\u0080\u009cItâ\u0080\u0099s an ongoing conversation that weâ\u0080\u0099re having. Itâ\u0080\u0099s safe to say that in the first bit of Phase 4, most production will be on soundstages.â\u0080\u009d Around the boroughs, that includes the sprawling Steiner Studios in Brooklyn and Silvercup Studios in Long Island City and the Bronx, to name just a few. But studios dot the Empire State. â\u0080\u009cWeâ\u0080\u0099ve been having weekly calls with these various stages since the start of the pandemic,â\u0080\u009d Mitchell-Brown said. â\u0080\u009cThe Marvelous Mrs. Maisel,â\u0080\u009d â\u0080\u009cGod Friended Meâ\u0080\u009d and â\u0080\u009cHuntersâ\u0080\u009d are a few series shot at Steiner Studios. Steven Spielbergâ\u0080\u0099s movie remake of â\u0080\u009cWest Side Storyâ\u0080\u009d was as well, said Doug Steiner, CEO of the large studio that bears his name. It reopened July 20.Â However, Steiner Studios is still pretty quiet. Set construction there ahead of cameras rolling was already expected to begin, but thatâ\u0080\u0099s not happened yet. â\u0080\u009cWeâ\u0080\u0099re still working things out,â\u0080\u009d Steiner said, adding that there are â\u0080\u009clayersâ\u0080\u009d of guidelines when it comes to masks, social distancing and other issues. â\u0080\u009cProductions have their own set of rules. We have our own protocols for entering the studio.â\u0080\u009dÂ Steiner optimistically expects shooting to begin â\u0080\u009csometime in September. Worst case scenario,â\u0080\u009d he said, â\u0080\u009cin October.â\u0080\u009d Also read: A rough September lies ahead for New York Cityâ\u0080\u0099s tourism sector as major events pivot to virtual â\u0080\u009cEveryone has good intentions about starting back up,â\u0080\u009d Mitchell-Brown said. â\u0080\u009cBut thereâ\u0080\u0099s still a level of divide between intention and reality. The government says you can have a certain number of people on the set thatâ\u0080\u0099s acceptable. Unions may require fewer people on the set when actorsâ\u0080\u0099 masks come off. What Iâ\u0080\u0099m hearing and seeing is that unions and guilds are going to do everything in their power to protect their members. Thereâ\u0080\u0099s a lot to consider and iron out.â\u0080\u009d Making sure that everyoneâ\u0080\u0099s on the same page isnâ\u0080\u0099t just a hurdle for huge facilities, according to Matthew J. Pellowski, of Red Line Studios, a relatively compact Manhattan production and postproduction facility. Looking ahead to a â\u0080\u009cproper reopeningâ\u0080\u009d in September, he said that he anticipates that one major challenge will be ensuring the rules and regulations of outside production teams â\u0080\u009ccoincide with their own.â\u0080\u009dÂ When shooting resumes full-gallop, or thereabouts â\u0080\u0094 in studios large or small or on location â\u0080\u0094 they will look different. There will be changes across the industry for safety and facilitation of contact tracing.Â â\u0080\u009cProductions will be specced out by zones,â\u0080\u009d Mitchell-Brown said. â\u0080\u009cEssentially thatâ\u0080\u0099s so they can control the amount of people on a live set at a particular time. There will be zones for hair and makeup and costumes and so on. Some people refer to the areas as pods. Itâ\u0080\u0099s a way to have the setâ\u0080\u0099s ebb and flow in a way that adheres to guidelines.â\u0080\u009dÂ The use of color-coded wrist wristbands to identify various members of the cast and crew and where they have access on a set is another strategy being discussed. â\u0080\u009cLike you wear at a nightclub, or, if youâ\u0080\u0099re not old enough to drink, at an amusement park,â\u0080\u009d Mitchell-Brown said. Meanwhile, up-for-grabs chow served communal-style, â\u0080\u009cis a thing of the past as previously presented,â\u0080\u009d Steiner said. â\u0080\u009cThere will be no cafeteria tables. Catering for shoot days will be cooked on site and single served.â\u0080\u009d Read next: Taking the New York City streets back before the cars return As the movie and TV industry simmers in Phase 4, itâ\u0080\u0099s been a time for reflection, according to Steiner. â\u0080\u009cThereâ\u0080\u0099s a sense of urgency. Itâ\u0080\u0099s important to get back on track as soon as possible. The pandemic has brought to the fore how important this industry is to New York City and New York state. Itâ\u0080\u0099s something New York does really well.â\u0080\u009dÂ"}]}