{"article": [{"url": "https://www.marketwatch.com/story/hours-ahead-of-bidens-nomination-acceptance-trump-set-to-appear-in-former-vice-presidents-home-town-in-pennsylvania-2020-08-20", "published": 1597931180.0, "headline": "Hours ahead of Bidenâ\u0080\u0099s nomination acceptance, Trump visits former vice presidentâ\u0080\u0099s Pennsylvania hometown", "body": "WASHINGTON (AP) â\u0080\u0094 On Joe Bidenâ\u0080\u0099s big day, President Donald Trump is planning to show up in his rivalâ\u0080\u0099s old backyard. Trump, in what can only be described as a piece of campaign trolling, on Thursday afternoon was staging an event just outside the former vice presidentâ\u0080\u0099s birthplace in Scranton, Pa., mere hours before Biden formally accepts the Democratic nomination for president. Donâ\u0080\u0099t miss:Joe Biden to give speech of a lifetime as he accepts Democratic presidential nomination The political tradition of a presidential candidate lying low during the other partyâ\u0080\u0099s convention has eroded over the decades but â\u0080\u0094 to the private delight of Trumpâ\u0080\u0099s advisers â\u0080\u0094 the presidentâ\u0080\u0099s trip looked to be a particularly in-your-face piece of counterprogramming designed to rattle an opponent. The campaign said Trumpâ\u0080\u0099s speech would cover â\u0080\u009ca half-century of Joe Biden failing America.â\u0080\u009d The event points to the importance of Pennsylvania as a battleground state â\u0080\u0094 and to the urgency of the presidentâ\u0080\u0099s effort to close the gap in the polls. â\u0080\u009cJoe Biden is hiding and taking voters for granted but the Trump campaign wonâ\u0080\u0099t make the same mistake,â\u0080\u009d said Trump campaign spokeswoman Samantha Zager. â\u0080\u009cBidenâ\u0080\u0099s socialist agenda would kill jobs and hurt families in the Keystone State, which is exactly why he wonâ\u0080\u0099t confront voters in his hometown.â\u0080\u009d Bidenâ\u0080\u0099s speech will come hours later from his Delaware hometown and, as the culmination of the four-day convention, will surely dominate headlines and cable news chyrons. But Trump has offered a robust slate of competing activity, holding multiple in-person events this week meant to draw a contrast with the largely virtual campaign that Biden has conducted during the coronavirus pandemic. He visited two other battlegrounds â\u0080\u0094 Wisconsin and Arizona â\u0080\u0094 as well as Minnesota, one of the few blue states from 2016 that Trumpâ\u0080\u0099s team feels like he may have a chance to flip this fall. But Trumpâ\u0080\u0099s campaign has been warily watching his standing falter in the trio of Rust Belt states that carried him to the presidency in 2016. The so-called Blue Wall composed of Pennsylvania, Michigan and Wisconsin, meant to provide Electoral College insurance for Hillary Clinton, instead all broke for Trump by the slimmest of margins. He captured Pennsylvania by a mere 44,000 votes four years ago and has since then clashed with the stateâ\u0080\u0099s Democratic governor over whether to reopen the state economy quickly or safely. Many in the Trump campaign have all but written off Michigan, a state battered by the virus, and whose governor has repeatedly fought with the president. But advisers believe Pennsylvania, like Wisconsin, remains in play and could be captured again if the economy rebounds. The number of GOP registrations in Pennsylvania has outpaced Democrats this cycle and many political observers believe that the state, which features many white, older voters, could become stronger for Republicans. But Trump has stubbornly trailed Biden, whose team aims to return Pennsylvania to the blue column, where it had been from 1992 until 2016. The former vice president is particularly suited in the Democratic field to carry Pennsylvania, with his deep ties to Scranton and messages catering to white working-class voters and Black voters in Philadelphia and Pittsburgh. Scranton is in Lackawanna County, which went for Clinton in 2016, and Bidenâ\u0080\u0099s team hopes to increase turnout there. The Biden campaign dismissed Trumpâ\u0080\u0099s visit as a lame campaign gambit. Trump â\u0080\u009cput the health of countless families across the Keystone State in danger and plunged the strong economy he inherited from the Obama-Biden Administration into a tailspin,â\u0080\u009d said Biden spokesman Andrew Bates. â\u0080\u009cThis sideshow is a pathetic attempt to distract from the fact that Trumpâ\u0080\u0099s presidency stands for nothing but crises, lies, and division.â\u0080\u009d The Trump campaign has been concerned about an exodus of suburban voters, particularly women, in the areas around Philadelphia. In an attempt to offset that, the Trump campaign has prioritized turnout among rural and exurban voters. It has also prepared to blanket the airwaves with attack ads that link Biden to China, hoping to tarnish the Democrat with an association to the country where the pandemic originated and by playing up his ties to globalization and trade deals blamed by some for closing factories and shedding manufacturing jobs in the state. Top campaign advisers have briefed the president that his support had slipped in battleground states, particularly among seniors in states with aging populations like Pennsylvania. But advisers believe that Trump has begun to reverse that momentum in part due to his efforts to link Biden to radical left elements of the Democratic Party. Trump has been campaigning as an avid supporter of hydraulic fracturing, or fracking, in Pennsylvania, where the technique unleashed an oil and gas boom. Trump and TV ads by a pro-Trump super PAC, America First Action, accuse Biden of wanting to ban fracking. Biden calls that entirely false and has said a ban would likely be politically and legally impossible. He says he wants to bar permits for new oil and gas drilling on public lands, which account for less than a tenth of production."}]}