{"article": [{"url": "https://www.marketwatch.com/story/amd-is-set-up-for-blockbuster-second-half-but-it-isnt-guaranteed-2020-07-28", "published": 1596003800.0, "headline": "AMD is set up for blockbuster second half, but it isn't guaranteed", "body": "Advanced Micro Devices Inc. is setting up for a blockbuster second half of the year, but it had better hope that coronavirus does not get in the way. AMD AMD, -3.94%  increased its forecast for the rest of the year while reporting a strong second quarter Tuesday afternoon, sending its shares 10% higher toward a record high in after-hours trading. The stock was up 11.6% premarket Wednesday. After racking up more than $3.7 billion in sales in the first half, AMD guided for revenue of nearly $8.9 billion for the full year, suggesting that sales in the second half will top AMD\"s annual totals from 2015 and 2016. That improved forecast, though, is predicated on strong sales of its chips in the PC and notebook markets, and a new generation of videogame consoles expected to launch before the holidays. The company is also expects to see more deployments of its chips among cloud-service providers. \"We are on track to deliver strong growth in the second half of the year driven by our current product portfolio and initial shipments of our next generation Zen 3 CPUs and RDNA 2 GPUs, that are on track to launch in late 2020,\" AMD Chief Executive Lisa Su told analysts on a conference call. The company noted that its forecast takes into account the COVID-19 pandemic environment, the global economic backdrop and customer demand signals. Investor hopes were high for the AMD's results, on the heels of disappointing manufacturing news from Intel Corp. INTC, -1.03%  , and the smaller chip company did not disappoint. Many analysts tried to get Su to comment on Intel's woes, or at least to say how it might help AMD going forward, but Su would not comment beyond saying that AMD continues to execute on its product plans. More from Therese: Intel admits another defeat with unprecedented manufacturing issues \"We feel good about our road map,\" Su said. \"We just you know we updated our road maps at our financial analyst day in March, and, you know, we continue to be very focused on executing.\" Unlike Intel, which makes about 80% of its chips, AMD farms out its manufacturing to Taiwan Semiconductor Manufacturing Co. TSM, +1.11%, which is ahead of Intel on its manufacturing process. Even so, Intel has managed to tweak the designs of its chips so that some of them are at near-parity with the current TSMC process. Analysts fear that if Intel falls even further behind in its manufacturing process, it could eventually lose its dominance in PCs and servers, and AMD would be a clear winner. AMD has done its part to be in that position, but still needs more work to actually get there. One analyst asked about the \"tenor\" of its conversations with customers, since Intel started to have delays on chips developed on its newer processes. Su, to her credit, did not take the opportunity to gloat. \"We feel very good about where our products are positioned,\" she said. She also reminded investors that the potential for the company's server chips, while just reaching a double-digit percentage market share against Intel, is not short-term. Many analysts and investors are focused on AMD's upside potential in the server market, but for the rest of the year, the biggest gains are still going to come from PCs and notebook sales. Some have been predicting that instead of a back-half loaded year for consumer devices, those big sales have already occurred, as many consumers stocked up on new devices to work and play from home. For more: Tech earnings in the age of COVID-19 New gaming consoles from Sony Corp. SNE, +0.56%  and Microsoft Corp. MSFT, +2.48%  , though, will help, especially in the third quarter, executives said. Su also said that PCs have become essential during the pandemic, and that sales in the first half won't necessarily lead to a big decline in the final six months of the year. \"Our view is that the second half will continue to be, you know, good for notebooks and PCs overall, and that's part of this, this idea that PCs are now essential.\" That could feasibly change, as the coronavirus has led to a lot of unpredictable behavior. Investors, though, are counting on AMD to be right."}]}