{"article": [{"url": "https://www.marketwatch.com/story/kissinger-says-us-china-must-cease-escalating-threats-or-we-will-slide-into-a-situation-similar-to-world-war-i-2020-10-07", "published": 1602094100.0, "headline": "Kissinger says U.S., China must cease escalating threats, or â\u0080\u0098we will slide into a situation similar to World War Iâ\u0080\u0099", "body": "Henry Kissinger is no stranger to a hostile China. As President Nixonâ\u0080\u0099s national security adviser, Kissinger helped engineer the first official visit by an American delegation to the Peopleâ\u0080\u0099s Republic of China, which ultimately paved the way for Nixon to visit Beijing and the U.S. to resume a cooperative relationship with the country after a long period of diplomatic isolation. On Wednesday afternoon, the famed diplomat warned that rising tensions between the U.S. and China could ultimately lead to a disastrous, kinetic war, in a virtual discussion with Federal Reserve Bank of New York President sponsored by the Economic Club of New York. â\u0080\u009cOur leaders and [Chinaâ\u0080\u0099s] leaders have to discuss the limits beyond which they will not push threats, and how to define that,â\u0080\u009d Kissinger said, adding that a these talks must be designed in such a way that they can be conducted over a long period of time, across administrations of both parties. â\u0080\u009cYou can say this is totally impossible, but if it is, we will slide into a situation similar to World War I,â\u0080\u009d he continued, pointing out that during the years leading up to the outbreak of war in the summer of 1914, the conventional wisdom then, as today, was that war between the great powers was not conceivable. But even as world leaders at that time didnâ\u0080\u0099t take the threat of war seriously, they were simultaneously building military capabilities and strategies that made it more likely. There are parallels to that technological race and the one occurring today, as the U.S. and China compete for unassailable dominance in domains like artificial intelligence. Instead of striving for such dominance, he argued, we should â\u0080\u009cthink of an economic world in which no other country should be able to blackmail us, but where that objective is not designed in such a way that all potential technological capabilities in other countries have to be confronted and reduced. â\u0080\u009cThis is a big challenge for any administration, and itâ\u0080\u0099s not a partisan challenge, itâ\u0080\u0099s a historic challenge because we canâ\u0080\u0099t review it every four to eight years, and if we cannot get clear in our own country about this, we canâ\u0080\u0099t deal with other countries,â\u0080\u009d he added. U.S.-China relations have receded somewhat from the spotlight in the American political discourse as the COVID-19 epidemic and issues of racial justice and policing have overshadowed the ongoing trade conflict and disputes over Hong Kongâ\u0080\u0099s independence from the mainland. But the Trump administration has sought to blame China, where the novel coronavirus originated, for the international epidemic while it has continued to take a hard line on Chinese companies like the owner of the popular TikTok video-sharing app. Meanwhile, the Democratic Party has become more united in its desire to strike a combative posture with China. Democratic nominee Joe Biden once championed Chinaâ\u0080\u0099s accession to the World Trade Organization but has recently argued that the U.S. should join with its allies to â\u0080\u009cconfront Chinaâ\u0080\u0099s abusive behaviors and human rights violations,â\u0080\u009d in an article in Foreign Affairs earlier this year. â\u0080\u009cThe United States does need to get tough with China. If China has its way, it will keep robbing the United States and American companies of their technology and intellectual property,â\u0080\u009d he wrote. â\u0080\u009cIt will also keep using subsidies to give its state-owned enterprises an unfair advantageâ\u0080\u0094and a leg up on dominating the technologies and industries of the future.â\u0080\u009d Kissinger argued that the nature of the technologies and industries of the future make the current U.S.-China conflict a particularly dangerous one, because itâ\u0080\u0099s possible that technologies like artificial intelligence lend themselves to zero-sum thinking and winner-take-all outcomes. â\u0080\u009cThe last time we have a comparable technological change was hundreds of years ago, during the enlightenment, when printing was invented and it enabled the unprecedented distribution of knowledge,â\u0080\u009d Kissinger said. The essential difference between that time and now, however, is that there was a concurrent flowering of philosophical thinking that created conceptual frameworks for societies to deal with what this new technology had wrought. Kissinger warned, â\u0080\u009cIn the present world, technological thinking is way ahead of conceptual thinking.â\u0080\u009d"}]}