{"article": [{"url": "https://www.marketwatch.com/story/whats-concerning-is-that-the-pace-of-jobs-growth-is-slowing-down-economists-react-to-august-jobs-report-2020-09-04", "published": 1599214580.0, "headline": "â\u0080\u0098Whatâ\u0080\u0099s concerning is that the pace of jobs growth is slowing downâ\u0080\u0099 â\u0080\u0094 economists react to August jobs report", "body": "The August jobs report on Friday showed the coronavirus-battered U.S. economy recovered 1.4 million jobs last month, with the unemployment rate falling to 8.4% from 10.2%. Economists polled by MarketWatch had expected a gain of 1.2 million jobs and an unemployment rate of 9.8%. See:U.S. regains 1.4 million jobs in August, unemployment falls to 8.4% Below are some initial reactions from analysts and economists, as the main U.S. stock gauges SPX, +0.87% Â DJIA, +0.56% Â COMP, +1.39% Â recently traded mostly lower in Fridayâ\u0080\u0099s session following the data on nonfarm payrolls. â\u0080¢ â\u0080\u009cYes weâ\u0080\u0099ve added large numbers the last few months, but still digging out of a very big hole.â\u0080\u009d â\u0080\u0094 Martha Gimbel, economist at Schmidt Futures iframe.twitter-tweet { width: 100% !important; } â\u0080¢â\u0080\u009cUnemployment breaking the 10% barrier so decisively is a big psychological lift ... . The hiring of Census workers significantly added to jobs, but there were other key gains in the hard-hit retailing sector. Unfortunately, the easier jobs gains are over, and now weâ\u0080\u0099ll be battling permanent layoffs once thought to be temporary, bankruptcies, secondary layoffs and maybe major layoffs in the airline industry. Expect that starting this month weâ\u0080\u0099ll struggle to drop the unemployment rate as much, and possibly see break-even jobs months and even backsliding.â\u0080\u009d â\u0080\u0094 Robert Frick, corporate economist at Navy Federal Credit Union â\u0080¢ â\u0080\u009cWhatâ\u0080\u0099s concerning is that the pace of jobs growth is slowing down. If we had nothing but months like Aug going forward, itâ\u0080\u0099d take another 8 months to get back to Feb levels, and longer to get back to our pre-COVID trajectory.â\u0080\u009d â\u0080\u0094 Ernie Tedeschi, economist at Evercore ISI iframe.twitter-tweet { width: 100% !important; } â\u0080¢ â\u0080\u009cMore people with more jobs is something to celebrate, but we need to be concerned about how sustainable these gains will be. The labor market is clearly losing momentum, and the foundations appear fragile. With federal stimulus programs still lapsed and the threat of a second wave of the virus this fall, itâ\u0080\u0099s not clear the labor market can keep improving on its own.â\u0080\u009d â\u0080\u0094 Nick Bunker, economic research director at jobs website Indeed â\u0080¢ â\u0080\u009cOne big concern in the report is that the number of reported permanent layoffs jumped by 534,000 to 3.4 million, which is up 2.1 million since February. Clearly some industries, notably restaurants and bars facing renewed restrictions in the face of higher infections, are struggling.â\u0080\u009d â\u0080\u0094 Sal Guatieri, senior economist at BMO â\u0080¢ â\u0080\u009cThis is a strong employment report. August payrolls rose 1,371k, essentially spot on the consensus but much better than the whisper number and much better than the ADP data suggested. The household survey found even faster job growth. Census hiring boosted payrolls by about 240k, but the private sector added 1,027k jobs, which is not bad.â\u0080\u009d â\u0080\u0094 Chris Low, chief economist at FHN Financial â\u0080¢ â\u0080\u009cAfter 2 months of decent gains, the loss of momentum that began in July clearly extended into Aug. How much is related to renewed shutdowns/slow re-openings vs. a more lasting stall is unclear. We know that Congress needs to act.â\u0080\u009d â\u0080\u0094 Steven Rattner, who ran the Obama administrationâ\u0080\u0099s auto task force iframe.twitter-tweet { width: 100% !important; } â\u0080¢ â\u0080\u009cNote that about a quarter of the gain came in government jobs, largely due to temporary census worker hiring. ... Overall, this was brighter than some of the high frequency numbers that showed a larger deceleration in August, but essentially in line with expectations for the headline hiring gain.â\u0080\u009d â\u0080\u0094 Avery Shenfeld, chief economist at CIBC. â\u0080¢ â\u0080\u009cThe big drop in the unemployment rate was driven by a huge 3,756,000 rise in the household measure of employment and came despite an increase in the labor force of nearly one million. ... Employment growth is still set to lag the recovery in broader economic activity over the coming months given its greater exposure to the services sectors worst affected by the pandemic. Nevertheless, the August data illustrate that, despite the earlier surge in virus cases and more recent fading of fiscal support, the recovery continues to plough on.â\u0080\u009d â\u0080\u0094 Andrew Hunter, senior U.S. economist at Capital Economics"}]}