{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-cases-top-206-million-and-us-suffers-biggest-one-day-death-toll-since-may-2020-08-13", "published": 1597331300.0, "headline": "Coronavirus update: Global cases top 20.7 million and U.S. suffers biggest one-day death toll since May", "body": "The number of confirmed cases of the coronavirus illness COVID-19 world-wide rose above 20.7 million on Thursday and the U.S. suffered its biggest death toll since May with almost 1,500 fatalities counted in a single day. The U.S. has averaged more than 1,000 deaths a day for two weeks, according to data aggregated by Johns Hopkins University. Wednesday’s deaths were mostly concentrated in Sun Belt states that saw the worst case spikes in June and July, the New York Times reported. A Times analysis of data provided by the Centers for Disease Control and Prevention found that at least 200,000 more Americans than usual have died since March, or about 60,000 more than the official data is linking to COVID-19. The findings were in line with a report published by “The Conversation.” See also:The ‘excess deaths’ tally in the U.S. is 204,691 in 7 months — so COVID-19 deaths might be undercounted While case numbers are stabilizing in some regions, the high number of deaths suggests the pandemic is far from under control. President Donald Trump continued to push for schools to reopen on time and in person on Wednesday and to urge football players to “go play football.” Ahead of Trump’s briefing, former Vice President Joe Biden, the presumptive Democratic presidential nominee, made his first public appearance with Sen. Kamala Harris, his newly announced running mate. The pair slammed Trump’s management of the pandemic, pledged to bring back lost jobs and prop up the middle class. “I’m ready to get to work,” said Harris. The U.S. leads the world in coronavirus cases “because of Trump’s failure to take it seriously from the start,” she said. In other developments: • Florida Gov. Ron DeSantis compared the challenge of reopening schools with the obstacles faced by the U.S. Navy SEAL team that assassinated Osama bin Laden in 2011. “Just as the SEALs surmounted obstacles to bring Osama bin Laden to justice, so too would the Martin County School system find a way to provide parents with a meaningful choice of in-person instruction or continued distance learning,” he said at a briefing, according to a transcript published on Florida’s government website See now: Florida Gov. Ron DeSantis likens reopening schools to killing Osama bin Laden • Dr. Michael Osterholm, epidemiologist at the University of Minnesota, repeated his message that the U.S. needs to shut down again and go back to Square 1 in dealing with the crisis, which he acknowledged is “shocking news” that people “don’t want to hear.” “The bottom line is that if you look at the country, we are an anomaly among the higher-income countries of the world in that we never did lock down sufficiently; we only slowed down to get the virus activity by May to a so-so level,” Osterholm said in an interview on MSNBC. “Other countries worked harder to get the viral activity more fully under control. ‘We walked away after 80% containment.” Don’t miss: Dr. Osterholm: Americans will be living with the coronavirus for decades • India now has the fourth highest death toll from COVID-19 in the world, after passing the U.K. overnight, the Johns Hopkins data shows. India has 2.4 million cases, or third highest after the U.S. and Brazil, and 47,033 deaths. • There was bad news from China where two people who were confirmed to have had and recovered from the virus have tested positive again, according to media reports. A 68-year old woman in the Chinese province of Hubei, where the virus was first detected late last year, tested positive this month after recovering from COVID-19 in February. A man who was confirmed to have the illness in April also tested positive again, although media reports said he was not suffering any symptoms. Other anecdotal evidence relating to patients retesting positive after apparently recovering have made health experts concerned that the level of protective antibodies developed to fight the virus may quickly fall away and leave patients at risk of reinfection. • Germany reported 1,445 new COVID-19 cases in a single day, the highest number since May 1, according to the Robert Koch Institute. “This trend is unsettling,” the RKI said in a statement. “We absolutely have to avoid a further accentuation of the situation.” Germany’s most populous state, North Rhine Westphalia in the West and Hamburg in the North are showing the biggest increases in new cases. Germany has been widely admired for its success in containing the pandemic. The country has 221,219 confirmed cases and 9,217 deaths for a mortality rate of 4.2%, Johns Hopkins data shows, or 11.11 deaths per 100,000 people. That compares with the UK’s 14.8% mortality rate, equal to 70.37 deaths per 100,000 people. The U.S. mortality rate is 3.2% or 50.75 deaths per 100,000 people, the data shows.Latest tallies There are now 751,033 confirmed deaths from COVID-19 world-wide, the Johns Hopkins data shows. At least 12.9 people are confirmed to have recovered. Brazil is second with 3.16 million cases and 104,201 deaths. Read also: Vaping makes teens up to 7 times more likely to catch COVID-19: study India is third, followed by Russia with 905,762 cases and South Africa with 568,919. Mexico has 498,380 cases and 54,666 deaths, the third highest in the world. The UK has 315,583 cases and 46,791 fatalities, the highest in Europe and fifth highest in the world. China, where the illness was first reported late last year, has 89,114 cases, and 4,699 fatalitiesWhat’s the economy saying? The number of Americans applying for jobless benefits fell below 1 million in the latest week for the first time since the start of the pandemic, signaling a steady if slow revival in a battered U.S. labor market, MarketWatch’s Jeffry Bartash reported. New applications for unemployment benefits, a rough gauge of layoffs, declined to 963,000 last week from 1.19 million at the end of July, the Labor Department said Thursday. It was the second straight large decline, raising questions about whether the end of a temporary $600 federal unemployment stipend prompted more people to return to work or start looking for jobs again. New claims have tumbled by almost 500,000 in the past two weeks. Economists polled by MarketWatch had forecast 1.08 million new claims in the seven days ended Aug. 8. These seasonally adjusted figures reflect applications filed the traditional way through state unemployment offices. See also:Fed’s Barkin says economy could suffer relapse without more Washington stimulus “The drop in claims reflects economic reopening, but it also suggests the expiration of federal supplemental unemployment benefits may have convinced some people to stop collecting and find work,” said chief economist Chris Low of FHN Financial. “Alternatively, people could be falling off rolls because they no longer qualify for assistance in the absence of the emergency expansion of eligibility.” Separately, U.S. import prices rose 0.7% in July, the third straight monthly gain, the Labor Department said Thursday. The increase in import prices over the past three months is the largest since 2011. Despite this advance, import prices declined 3.3% over the past year. The gain in July was led by fuel prices, which rose 6.9% in July. The gains over the past three months in imported fuel prices is the largest since 1990. Still, fuel prices are down 32.8% over the past 12 months. Import prices excluding fuels rose 0.2% in July. Export prices rose 0.8% in July and are down 4.4% over the past year. See also:The economic recovery is faltering, the most accurate forecasters say Here’s the latest news about companies and COVID-19: • 3M Co. MMM, +0.94% said it saw “broad-based improvement” in sales trends in July. The company said total sales for the month increased 6% to $2.8 billion. Among its business segments, sales increased 29% in health care, 9% in consumer and 6% in safety and industrial, while transportation and electronics sales fell 7%. The monthly update comes after 3M reported in late-July that l second-quarter sales fell 12.2% to miss analyst expectations. 3M has been reporting monthly sales to provide transparency, while the company is unable to provide financial guidance given the uncertainties resulting from the pandemic. • 1Life Healthcare Inc. ONEM, -0.70%, manager of the One Medical doctors’ offices, reported a narrower-than-expected second-quarter loss and sales that were above forecasts. One Medical, which charges membership fees in return for same-day appointments and other perks, said it ended the quarter with 25% more members, or 475,000. It ended the quarter with $664.4 million in cash and equivalents. The company guided for a membership count between 486,000 and 496,000 for the third quarter, and between 505,000 and 515,000 by the end of the year. For the third quarter, it called for revenue between $84 million to $89 million, and adjusted Ebitda between a loss of $12 million and a loss of $7 million. The company did not provide revenue, margin, or adjusted Ebitda guidance for full year 2020 “because of uncertainties around the duration and extent of the continued COVID-19 pandemic and related community self-isolation practices,” it said. See: Cisco looking more to software, but road is slower due to the pandemic • AMC Entertainment Holdings Inc. shares AMC, -2.17%, the biggest cinema chain operator in the U.S., said it would reopen its doors on Aug. 20 to celebrate 100 years in business with plans to charge the 1920 price of 15 cents a ticket. The company was founded in 1920 with a theater at 12th Street and Grand Boulevard in Kansas City, Missouri, according to a statement. “One hundred years later, as AMC reopens its doors to U.S. moviegoers for the first time in more than five months, AMC is celebrating its history with a throwback to the year it all started by offering “Movies in 2020 at 1920 Prices,” said the statement. Because of the pandemic, capacity will be significantly reduced to achieve social distancing. The company is expecting to open about two thirds of its more than 600 cinemas in the U.S. in time for the Sept. 3 release of Warner Bros. “Tenet,” following the Aug. 28 release of “The New Mutants.” The remaining cinemas will reopen as soon as state and local officials allow. The Aug. 20 event will be followed by other promotions that will include bringing back films including “Black Panther,” “Back to the Future,” “Ghostbusters,” “Grease” and “Star Wars: Episode V — The Empire Strikes Back” at an admission price of $5. • Outdoor retailer REI said it is walking away from its nearly completed corporate campus in suburban Seattle and will shift headquarters operations to sites across the Seattle area as the coronavirus pandemic affects how it does business. The Kent, Wash.-based company said it is in talks with “multiple interested parties” to sell the 380,000-square-foot building and 8-acre campus in Bellevue, the Seattle Times reported. “The dramatic events of 2020 have challenged us to re-examine and rethink every aspect of our business and many of the assumptions of the past,” Eric Artz, president and CEO, told employees in a Wednesday video call. REI’s 1,200 headquarters employees have been working remotely since March 2 as the company navigated the pandemic, the closure of its more than 160 retail sites March 16, and a dramatic decline in revenue. • SmileDirectClub Inc. SDC, -2.59% reported second-quarter sales that were above Wall Street expectations but GAAP EPS was below forecasts “Our performance in the quarter, and more importantly since the quarter, reflects the strength of our teledentistry platform, along with the flexibility and agility of our business model; both in the context of our COVID-19 recovery efforts, and our traction toward our long-term growth and margin targets,” Chief Executive Officer David Katzman said in a statement. • Tapestry Inc. TPR, +0.80%, the parent of the Coach, Kate Spade and Stuart Weitzman brands, posted a smaller-than-expected loss and better-than-expected sales for its fiscal fourth quarter. “While the backdrop remains volatile, it has not changed our long-term objectives,” Interim CEO Joanne Crevoiserat said in a statement. “Rather, it has been a catalyst to accelerate our strategic agenda. Through our Acceleration Program, we are transforming into a world-class consumer centric organization that is more agile and data-driven with a digital-first mind-set.” The company returned to positive growth in mainland China in the quarter and reopened the majority of its directly owned stores that were closed during the pandemic. It ended the quarter with $1.4 billion in cash, including $700 million from a revolving credit facility. The company expects to return to top-line growth in the second half of fiscal 2021 and to achieve bottom line growth in fiscal 2021, 2022 and 2023. • Uber Technologies Inc. UBER, -0.18% Chief Executive Dara Khosrowshahi could shut down the company’s ride-hailing operations in its home state of California after being told he must treat drivers as employees in the state. The ruling comes as ridership is hurt by the pandemic. “If the court doesn’t reconsider, then in California, it’s hard to believe we’ll be able to switch our model to full-time employment quickly,” Khosrowshahi said on MSNBC. A judge ruled Monday that Uber and Lyft Inc. LYFT, +2.16% must reclassify drivers based on a court decision made more than two years ago that was codified into law in California last year. State and local officials sued Uber and Lyft earlier this year to get them to comply with the law, leading to the judge’s temporary injunction ahead of a trial in which Uber will seek to claim the law is unconstitutional. For more, read:Uber and Lyft say they may shut down in California if forced to classify drivers as employees"}]}