{"article": [{"url": "https://www.marketwatch.com/story/federal-judge-affirms-manhattan-prosecutors-right-to-trump-tax-returns-and-presidents-lawyers-launch-swift-appeal-2020-08-20", "published": 1597937720.0, "headline": "Federal judge affirms Manhattan prosecutorâ\u0080\u0099s right to Trump tax returns, and presidentâ\u0080\u0099s lawyers launch swift appeal", "body": "NEW YORK (AP) â\u0080\u0094 As President Donald Trumpâ\u0080\u0099s lawyers moved swiftly Thursday to appeal a federal judgeâ\u0080\u0099s ruling that granted Manhattanâ\u0080\u0099s top prosecutor access to his tax returns, Trump blasted the long-running quest for his financial records as a â\u0080\u009ccontinuation of the most disgusting witch hunt in the history of our country.â\u0080\u009d U.S. District Judge Victor Marreroâ\u0080\u0099s ruling echoed his prior decision in the case, upheld last month by the U.S. Supreme Court. The high court had returned the case to Marreroâ\u0080\u0099s courtroom to give Trumpâ\u0080\u0099s lawyers a chance to raise other concerns about the subpoena issued by Manhattan District Attorney Cyrus Vance Jr. “ â\u0080\u009cWeâ\u0080\u0099re not doing things wrong, but theyâ\u0080\u0099ll say, â\u0080\u0098Letâ\u0080\u0099s go in and inspect every deal heâ\u0080\u0099s ever done. Letâ\u0080\u0099s get papers from 10 years, every paper, every deal heâ\u0080\u0099s ever signed, maybe we can find where some lawyer made a mistake, where they didnâ\u0080\u0099t dot an i, where they didnâ\u0080\u0099t put a comma down someplace.â\u0080\u0099 â\u0080\u009d ” â\u0080\u0094 President Trump on prospective scrutiny of his tax records Vance has been seeking Trumpâ\u0080\u0099s tax returns from the presidentâ\u0080\u0099s longtime accounting firm, Mazars USA, for more than a year, since Trumpâ\u0080\u0099s former personal lawyer Michael Cohen told Congress that the president had misled tax officials, insurers and business associates about the value of his assets. Congress is also pursuing Trumpâ\u0080\u0099s financial records. Trumpâ\u0080\u0099s lawyers immediately appealed Marreroâ\u0080\u0099s Thursday ruling to the Second Circuit Court of Appeals. The president said he expected the case to end up back before the Supreme Court. The appeal means it is unlikely Vanceâ\u0080\u0099s office will get its hands on Trumpâ\u0080\u0099s tax returns before Novemberâ\u0080\u0099s presidential election. Because they are being sought as part of a confidential grand jury investigation, they would not automatically be made public. â\u0080\u009cThe Supreme Court said itâ\u0080\u0099s a fishing expedition. You donâ\u0080\u0099t have to do it,â\u0080\u009d Trump said. â\u0080\u009cAnd this is a fishing expedition, but more importantly, this is a continuation of the witch hunt â\u0080\u0094 the greatest witch hunt in history. Thereâ\u0080\u0099s never been anything like it, where people want to examine everything youâ\u0080\u0099ve ever done to see if they can find that thereâ\u0080\u0099s a comma out of place.â\u0080\u009d Trump is the only president in modern times who has refused to make his tax returns public. Before he was elected he had promised to release them. Messages seeking comment were left with Trumpâ\u0080\u0099s lawyer. Vanceâ\u0080\u0099s office declined comment. Trumpâ\u0080\u0099s lawyers have said that the request for tax records dating back to 2011 was retaliatory after the presidentâ\u0080\u0099s company, the Trump Organization, disputed the scope of a subpoena seeking records from June 1, 2015, through Sept. 20, 2018. That time span pertains to an investigation related to payoffs to two women â\u0080\u0094 porn actress Stormy Daniels and model Karen McDougal â\u0080\u0094 to keep them quiet during the 2016 presidential campaign about alleged extramarital affairs with Trump. Trump has denied the affairs. Trump, through his lawyers, has argued that the subpoena was issued in bad faith, might have been politically motivated and amounted to harassment of him, especially since the wording mimicked the language in congressional subpoenas. Vanceâ\u0080\u0099s attorneys said they were entitled to extensive records to aid a â\u0080\u009ccomplex financial investigationâ\u0080\u009d and they cited in their papers public reports of â\u0080\u009cextensive and protracted criminal conduct at the Trump Organization.â\u0080\u009d In July, the Supreme Court rejected Trumpâ\u0080\u0099s arguments that he canâ\u0080\u0099t even be investigated, let alone charged with any crime, while he is in office. But the court left open the prospect that Trump could make new arguments in a bid to keep the subpoena from being enforced. Also in July, the Supreme Court kept a hold on banking and other documents about Trump, family members and his businesses that Congress has been seeking for over a year and returned the case to a lower court. Trump, in reacting to Thursdayâ\u0080\u0099s developments, boasted about previous legal victories â\u0080\u0094 including in Special Counsel Robert Muellerâ\u0080\u0099s investigation of Russian election interference â\u0080\u0094 as he doubled down on his contention that there was a concerted effort to make him look bad. â\u0080\u009cWeâ\u0080\u0099re not doing things wrong, but theyâ\u0080\u0099ll say, â\u0080\u0098Letâ\u0080\u0099s go in and inspect every deal heâ\u0080\u0099s ever done,â\u0080\u0099 â\u0080\u009d Trump said. â\u0080\u009c â\u0080\u0098Letâ\u0080\u0099s get papers from 10 years, every paper, every deal heâ\u0080\u0099s ever signed, maybe we can find where some lawyer made a mistake, where they didnâ\u0080\u0099t dot an i, where they didnâ\u0080\u0099t put a comma down someplace, and then we can do something.â\u0080\u0099 â\u0080\u009d"}]}