{"article": [{"url": "https://www.marketwatch.com/story/us-import-prices-climb-in-may-on-higher-oil-costs-signaling-end-of-coronavirus-induced-deflation-2020-06-12", "published": 1591954580.0, "headline": "U.S. import prices climb in May on higher oil costs, signaling end of coronavirus-induced deflation", "body": "The numbers: The cost of goods imported into the U.S. rose in May for the first time since the coronavirus throttled the economy, reflecting a rebound in oil prices and signaling that a bout of deflation after the pandemic may be coming to an end. The price index for U.S. imports climbed 1% last month to mark the first increase since January. Excluding energy, import prices rose a much smaller 0.1%, the government said. Even after May’s increase, import prices are 6% lower compared to a year earlier. The pandemic has delivered a massive blow to global trade, reduced demand for a variety of goods and services and forced many companies to cut prices to try to drum up sales. Read:U.S. entered recession in February after end of longest expansion in history What happened: The cost of imported oil leaped 20.5%, the biggest increase since the government began publishing the index in 1992. Yet the spike in May followed declines of 31%, 27% and 9% in the prior three months, leaving oil and gas prices still relatively low. Import prices barely rose if fuel is excluded. The cost of imported food, drinks and consumer goods all rose, offsetting declines in autos and industrial supplies. Prices for both domestic and foreign-produce foods have risen during the pandemic with most people staying at home, buying more groceries and doing their own cooking. Supply disruptions and viral outbreaks at food plants have also contributed to shortages that have led to higher prices. See:Marketwatch’s Coronavirus Economic Recovery Tracker. Big picture: With the swoon in oil prices probably over, inflation in the U.S. is likely to stabilize after a sharp pandemic-induced decline. The yearly rate of consumer inflation — the cost of living — basically fell to zero in May, but that could end up being the bottom. Read: Consumer prices drop again as pandemic cuts rate of inflation to near zero A pickup in inflation, however mild, would actually be a good sign. It would mean demand for goods and services is recovering, people are going back to work and the economy is on the mend. Even after the latest price increase, oil and gas prices are still quite low. The huge drop earlier this year slammed U.S. energy producers and force them to cut jobs and investment. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open sharply higher in Friday trades after a big selloff the day before on fresh worries about a rise in coronavirus cases and a tepid assessment of the economy by the Federal Reserve."}]}