{"article": [{"url": "https://www.marketwatch.com/story/should-we-rethink-how-we-tax-social-security-benefits-2020-08-24", "published": 1598718920.0, "headline": "Should we rethink how we tax Social Security benefits?", "body": "Taxation of retirement income is an important issue. People with significant 401(k) holdings are going to owe the government a meaningful portion of their pile in taxes. In the process of calculating how large that tax burden might be, it was necessary to review the taxation of Social Security benefits. Read: The money in your 401(k) and IRA accounts doesn’t belong entirely to you The taxation of benefits was introduced in the 1983 Amendments to the Social Security Act. The consensus at the time was that the tax treatment of Social Security benefits should match that of private pensions. Under the rules for defined benefit pensions — the predominant form of employer-sponsored plan at the time — workers are taxed on their benefits net of any after-tax contributions they made during their careers. Since only the nominal value of the worker’s contributions are netted out, the netting process produced very small tax savings. Social Security actuaries estimated that, for most beneficiaries, this approach would result in over 90% of benefits being taxed. To avoid overtaxing anyone, the share of Social Security benefits subject to taxation was set at 85%. 80% of older Americans can't afford to retire - COVID-19 isn't helping In 1983, Congress went only partway toward the recommendation that 85% of benefits be taxed. It limited the taxable share to 50% and phased in that target by establishing that households would be taxed only to the extent that their combined income exceeded $32,000 for couples and $25,000 for singles. Ten years later, the Omnibus Budget Reconciliation Act of 1993 increased the maximum share of Social Security benefits that could be subject to tax to 85%, with the increase applying only to couples with combined income above $44,000 and to single taxpayers above $34,000. Since neither set of thresholds is indexed for increases in prices or wages, a rising portion of households will be required to include 85% of their benefits when calculating their federal income taxes. Does the current regime for taxing Social Security still make sense today? While defined-benefit plans offered a reasonable benchmark in the 1980s, today most private sector workers are covered by 401(k)s. One could argue that the taxation of Social Security should align with the treatment of these new plans. Since 2006, when Roth 401(k)s became available, taxes can be levied in two ways. In the traditional 401(k), the employee puts in pretax dollars and is taxed when the money is withdrawn in retirement. In the Roth 401(k), the employee puts in after-tax dollars and pays no tax in retirement. (In theory, if workers and retirees face the same tax rates, the tax treatment of traditional and Roth accounts is equivalent.) Social Security contributions can be thought of as one-half traditional and one-half Roth. The employer’s share of the contribution is made on a pre-income-tax basis (since no income tax is charged on the employer payroll tax payments), and the employee’s share is made on an after-income-tax basis (since earnings are subject to both income tax and payroll tax). From this perspective, taxing Social Security like private plans would suggest that the half of Social Security benefits financed by the employer’s pretax contribution should be taxable in retirement and the Roth-like other half, where taxes have already been paid, should be excluded. In other words, today 50% — not 85% — of Social Security benefits might be viewed as the appropriate share of benefits to include in adjusted gross income."}]}