{"article": [{"url": "https://www.marketwatch.com/story/ohio-mom-tasered-arrested-for-trespassing-after-not-wearing-a-mask-at-a-middle-school-football-game-2020-09-25", "published": 1601050460.0, "headline": "Ohio mom tasered, arrested for trespassing after not wearing a mask at a middle school football game", "body": "A viral video showing an Ohio woman being tasered and dragged away from a middle school football game after refusing to wear a mask is refueling the debate over the enforcement of social distancing guidelines during the pandemic. The woman identified by police as Alecia D. Kitts got into the altercation with school resource officer Chris Smith at the Logan High School Stadium early Wednesday evening. The incident was recorded by a bystander, and the original video quickly racked up more than 44,000 views on Facebook FB, +0.26% before going viral on Google-owned YouTube GOOG, +1.97% and Twitter TWTR, -0.23%. After Smith reportedly asked Kitts to wear a mask, she refused because she said that she has asthma, according to a Logan Police Department press release also posted to Facebook. After repeatedly asking her to either put on a mask or leave, he told her that she was under arrest for criminal trespassing and asked her to put her hands behind her back, which she refused to do, the report alleged. The incident escalated as Kitt began yelling at the officer, and another woman began interfering with the arrest, according to the Logan Police report. Kitts can be heard on the video yelling, “Get off of me! I will not put my hands behind my back. I’m not criminally doing nothing wrong!” She also yelled “What the f— is wrong with you?” and said Smith was “arresting me for nothing.” Smith reportedly warned her to comply or he would deploy his Taser. When she continued to resist, the report says he “placed his Taser on her shoulder area and drive stunned her once. (A “drive stun” is when the Taser is held against the subject’s body and the trigger pulled with no probes being fired, causing pain but not an incapacitating effect.) He was able to successfully handcuff the female at that time.” Spectators on the video can be heard audibly gasping and yelling as the officer drive stuns her. “Tased somebody over a mask,” one can be heard saying. Kitts was charged with criminal trespassing and released at the scene. While she was not charged for not wearing a mask, additional charges are pending, the report said. The Logan-Hocking Local School District told NBC affiliate WCMH that Kitt was there cheering for the opposing football team, Marietta City School. What’s more, Logan-Hocking schools were put on lockdown on Thursday after receiving threats that law enforcement believe stem from the incident. “An attendee was asked to comply with the Ohio High School Athletic Association’s and the athletic facility’s policies,” the district’s superintendent Monte Bainter told NBC News in a statement. “The attendee refused to do so and consequently was asked to leave by the attending law enforcement officer. After resisting the request to exit the premises, the individual was apprehended at the discretion of the attending law enforcement officer.” The video drew outrage on social media, with many viewers pointing out that it appeared Kitt was more than six feet apart from other spectators on the outdoor risers. “100% social distancing but NOT wearing a mask. This is insane,” tweeted one. “This is a case of vast overreach,” wrote another, while one woman argued, “This is NOT America.” Others noted that she was tasered for resisting arrest — not for her refusal to wear a mask. “It’s generally a bad idea to fight with armed men wearing badges,” tweeted one viewer. Another noted, “She had a mask in her pocket and went through all this because she didn’t want to put it on. Smh [shaking my head].” Also on Wednesday, an Idaho man was arrested for not wearing a mask while singing at an outdoor worship service in the Moscow City Hall parking lot. Gabriel Rench, a Latah County commission candidate, was one of three people arrested at the “psalm sing” attended by more than 150 people for violating a coronavirus mask/social distancing order. Many Americans have chafed over mask mandates and other social distancing orders designed to limit the spread of the coronavirus that causes COVID-19. The virus spreads from person to person primarily through respiratory droplets, so CDC guidelines call for wearing a mask that covers both your nose and your mouth to prevent spreading your own droplets and ingesting droplets from other people. At least 230,000 cases of the coronavirus may have been prevented due to government orders requiring face masks in 15 states and the District of Columbia between April and mid-May, according to one study by two University of Iowa professors. Another study suggests that nearly 45,000 U.S. deaths from coronavirus could be prevented by November if 95% of the population wore masks. As of Friday morning, the U.S. had 6.98 million confirmed coronavirus cases and 202,819 deaths, leading the world in the number of infections and deaths."}]}