{"article": [{"url": "https://www.marketwatch.com/story/senators-elizabeth-warren-and-chuck-schumer-say-u-s-should-immediately-cancel-50-000-in-student-loans-for-millions-of-borrowers-11600358049", "published": 1600420880.0, "headline": "Senators Elizabeth Warren and Chuck Schumer say U.S. should immediately cancel $50,000 in student loans for millions of borrowers", "body": "Senate Minority Leader Chuck Schumer (D-NY) and Sen. Elizabeth Warren (D-MA) are calling for the cancellation of $50,000 in student debt for all federal student loan borrowers. (Photo by Drew Angerer/Getty Images) Drew Angerer/Getty Images Democratic Senators Elizabeth Warren and Chuck Schumer are calling on the president to cancel student debt. The Senators announced that they will be introducing a resolution urging the U.S. President to immediately cancel $50,000 in student loan debt for all federal student loan borrowers. Schumer noted on a conference call with reporters that the pair doesn’t believe President Donald Trump will take up their suggestion. Instead, the two lawmakers “want to get people focused on this issue as a major issue,” that could be dealt with next year. Put another way: “Democrats are ready to act in 2021,” Warren said. The introduction of the resolution and its backing by Schumer, the Senate minority leader, is the latest indication that the political mainstream is becoming more comfortable with the idea of cancelling student debt, an idea that first bubbled up during the Occupy Wall Street protests. “America is facing a historical economic and public health crisis,” Warren said on a conference call with reporters. “We have a responsibility to act, broadly cancelling student loan debt will improve the lives of tens of millions of Americans,” as well as boost the economy and help curb the racial wealth gap, Warren said on the call. Though the Senators framed the resolution as a way to provide relief to struggling Americans during the coronavirus pandemic, the resolution also situates the proposal as part of curbing the nation’s student loan challenges more broadly. “Even before the COVID–19 pandemic, the United States also faced a historic student loan crisis, which is currently holding back our struggling economy and restricting opportunity and prosperity for millions of American families,” the resolution states. Student debt cancellation made it to the presidential election for the first time As the impact of student debt on households’ ability to achieve financial security, and in particular, the disproportionate impact the student loan system has had on Black families and borrowers has become more clear, the idea of student debt cancellation has gained traction, even making it to the presidential debate stage. During her campaign for the Democratic nomination, Warren proposed cancelling up to $50,000 in student debt for borrowers who earn up to $250,000. Senator Bernie Sanders, an Independent of Vermont who also ran for the Democratic nomination, vowed to cancel all of the nation’s outstanding student debt as part of his presidential campaign. Vice President Joe Biden, the Democratic nominee for president, has said that if elected he would immediately cancel $10,000 in student loans for all borrowers. He would also push a plan to cancel federal undergraduate student debt for borrowers earning up to $125,000 as long as the debt was related to their education at a public college, a Historically Black College and University or Minority Serving Institution. Schumer told reporters on the call that they’ve talked to Biden about this proposal, and he’s “very seriously entertaining” it. The Biden campaign didn’t immediately respond to a request for comment. The difference in these plans reflects debate over whether and how to best to target student loan relief. Some critics of broad-based debt cancellation, of the type Sanders called for in his original proposal, have argued that it would benefit highly-educated borrowers (and in some cases, wealthier borrowers) the most — at least in dollar terms — because graduate school tends to produce the highest debt balances. Critics of a more targeted approach have said it could wind up leaving out struggling borrowers that the program intended to help. A working paper published last month by the Roosevelt Institute, a progressive think tank, found that cancelling $20,000 in student debt would wipe away the loans of over half of all households with loans and cancelling $40,000 in student debt would leave 75% of households without any educational debt. There’s evidence to indicate that cancelling student debt would provide a boost to the economy by allowing borrowers bogged down by their debt to spend on houses and cars and take steps to make more money. Resolution comes amid debate over COVID relief As part of the resolution, Warren and Schumer argue that the Trump administration has the legal authority to cancel student debt without Congress, echoing an argument Warren made during her presidential campaign. Attorneys from Harvard Law School’s project on Predatory Student Lending wrote in a letter to Senator Warren released along with the resolution that “Congress has granted the Secretary a more specific and unrestricted authority to create and to cancel or modify debt owed under federal student loan programs in the Higher Education Act (HEA) itself.” “This authority provides a safety valve for the student loan program now is the time to use it,” Warren said on the call with reporters. The resolution comes amid stimulus talks, where there’s been debate over relief for student loan borrowers. The HEROES Act, which the Democratic-led House of Representatives passed in May, would have cancelled $10,000 in student loans for economically distressed borrowers. The stimulus plan proposed by Senate Republicans in July included a provision which would allow borrowers with no income to stay current on their loans without making payments, an option that is already available. Last month, President Donald Trump extended a pause that began in March on student loan payments and collections through the end of the year. Student borrower advocates have said it’s likely borrowers will still be struggling when payments resume."}]}