{"article": [{"url": "https://www.marketwatch.com/story/the-pandemic-revealed-the-cracks-in-u-s-manufacturing-heres-how-to-fix-them-11599671092", "published": 1599726440.0, "headline": "The pandemic revealed the cracks in U.S. manufacturing. Hereâ\u0080\u0099s how to fix them.", "body": "The COVID-19 pandemic has revealed glaring deficiencies in the U.S. manufacturing sectorâ\u0080\u0099s ability to provide necessary productsâ\u0080\u0094especially amid a crisis. Itâ\u0080\u0099s been five months since the nation declared a national emergency, yetÂ shortagesÂ of test kit components, pharmaceuticals, personal protective equipment andÂ other critical medical suppliesÂ persist. Globalization is at the heart of the problem. With heavy reliance on global supply chains and foreign producers, the pandemic has interrupted shipping of parts and materials toÂ nearly 75% of U.S. companies. Decades of â\u0080\u009coffshoringâ\u0080\u009d domestic manufacturing to other countries have led the U.S. to the current crisis. It has seriously damaged the nationâ\u0080\u0099s industrial base, increased income inequality and caused stagnation inÂ U.S. living standards. How the U.S. responds will determine the long-term health and prosperity of the nation. Opinion: We deserve an economy that provides jobs, public health and a sustainable environment Manufacturing offshored After World War II, U.S. policies promoted more liberal international trade, reducing tariffs and encouraging increasinglyÂ globalized manufacturing. The process accelerated during the 1980s, when the production of consumer electronics, vehicle parts, packaged semiconductors and other goods was transferred to Mexico, Taiwan, Malaysia and other low-wage countries. WhenÂ China opened to foreign investmentÂ in 1978, its low-cost manufacturing proved irresistible to many American companies. From 2000 to 2019,Â U.S. direct investment in manufacturingÂ in China jumped from $7 billion to more than $54 billion. The rising importance ofÂ shareholder profitsÂ in corporate decisions led companies to claim that the only way to remain competitive was by moving offshore to minimize production costs. In the U.S.,Â investment shiftedÂ from manufacturing to marketing, branding, and research and development. With far fewer factories and factory jobs, the nation moved to a postindustrial â\u0080\u009cknowledge economyâ\u0080\u009d driven by information technology, software, advanced communication, and cutting-edge basic research. Dani Rodrik: To tackle inequality, help the middle class get back up In our work at the nonprofitÂ MForesight, a technology forecasting project based at the University of Michigan, we address government policy and national manufacturing competitiveness. Our research has confirmed the detrimental effects of these trendsÂ on U.S. employment and resilience. For example, the U.S.Â no longer has sufficient production capacityÂ or the manufacturing know-how to provide essential goods amid this current crisisâ\u0080\u0094from pharmaceutical ingredients to fabrics for personal protective equipmentâ\u0080\u0094or to meet critical defense needs. Globalization has eliminatedÂ more than 50,000 U.S. factories over the past 20 yearsÂ along withÂ over 5 million manufacturing jobs. Thatâ\u0080\u0099s because a knowledge economyâ\u0080\u0094unlike manufacturingâ\u0080\u0094offers relatively few high-paying positions. New technologies invented in the U.S. are often manufactured abroad and then imported back, contributing to the currentÂ $850 billion trade deficit.The larger costs In our view, three widely embraced fallacies have caused U.S. policy makers to favor the knowledge economy over a production economy: Fallacy 1:Â Research results and inventions are sufficient to create jobs and raise living standards. The U.S. has built a world-leading research base, led by universities and national laboratories, whichÂ receives about $150 billion in federal funding each year. Under the current system, many important innovations conceived on American soil are then manufactured offshore, creating tens of millions of factory jobs in other countriesâ\u0080\u0094while hurting U.S. manufacturers. These products are then imported back: cellphones, flexible and flat panel displays, rechargeable lithium-ion batteries, solar cells, drones and more. The economic benefits for American workers areÂ minimal at best. Instead of high-wage factory positions, imports create jobs in warehousing, distribution and sales thatÂ pay too little to support adequate living standards. Rex Nutting: How Donald Trump hijacked the Democratsâ\u0080\u0099 best issue A national commitment to domestic manufacturing from its R & D investments would generate high-paying jobs and produce valuable technology exports that would reduce the massive U.S. trade deficit. Fallacy 2:Â Industrial policy is incompatible with American capitalism. Across the globe, a range ofÂ industrial policies and government actionsÂ foster the development of specific industries, usually in support of strategic national goals. In the past, the United States has intervened to develop strong manufacturing in the aerospace,Â nuclear power, telecommunications and semiconductor industries, among others. Continued U.S. government support for military priorities is a key reason why aerospace has remained one of theÂ few sectors with a trade surplus. Since the Reagan administration, the U.S. has been reluctant to pursue industrial policies that have brought success to other manufacturing economies, includingÂ Germany, theÂ Asian Tigersâ\u0080\u0094Hong Kong, Singapore, South Korea and Taiwanâ\u0080\u0094andÂ China. With a smarter industrial policy, the U.S. could become a world leader, for example, in the manufacture of clean-energy products, power storage and electric cars. Fallacy 3:Â Whatâ\u0080\u0099s good for large corporations is good for the United States. Generally, social interests and corporateÂ interests donâ\u0080\u0099t alignâ\u0080\u0094and havenâ\u0080\u0099t for more than three decades. U.S. multinationals are in business to make money, with cost-cutting as a go-to strategy. Moving factories to low-wage countries has become a default decision, despite negative impacts on the skilled workforce, suppliers and overall job numbers. It hasÂ devastated domestic manufacturingÂ while boosting corporate profits and executive salaries. The cost has been high during this current pandemic:Â Supply shortagesÂ have cost some people their lives.National response needed The pandemic has revealed the urgent need for an effective national response that re-establishes the ability to manufacture everything from small components to complex machines in the U.S. Opinion: 2020 candidates should say how they would reboot the American Dream Policies favoring domestic production of essential products would create a large number of well-paid jobs for skilled, innovative workers that can provide resiliency in a crisis. Identification of and support for critical industries and technologies, financial incentives to build U.S. factories and strict â\u0080\u009cBuy Americanâ\u0080\u009d requirements for government purchases are examples of possible strategies. Manufacturing is criticalÂ to innovation and job creation. We have recommended how to increase prosperity andÂ regain industrial leadershipÂ through manufacturing. Those recommendations include rebuilding domestic supply chains, supporting local production of innovations emerging from U.S. research, creating manufacturing investment funds, and growing domestic engineering and technical talent. Some of these ideas that would aid U.S. manufacturing are gaining traction in Washington, with at least four bills, including theÂ Endless Frontier ActÂ and theÂ American Manufacturing Leadership Act, introduced into the House and Senate. Provisions would bolster domestic manufacturing and competitiveness with increased funding for advanced technology development. They would also provide technical training and apprenticeships to strengthen the workforce and help small and medium-size manufacturers upgrade equipment. If the products created through taxpayer-funded research were manufactured in U.S. factories, both workers and the economy would benefit. Creation of a new federal agency focused on national manufacturing strategies and coordinated implementation would help maintain commitment to a strong manufacturing sector. A Cabinet-level voice and sufficient, sustained funding would ensure that the nation responds effectively to the industrial shortcomings revealed by the current pandemic. With the right steps, the COVID-19 crisis could become a positive tipping point. It could create a stronger, wealthier nation that is better prepared to confront the next crisis, be it medical, military or a natural disaster. Sridhar Kota is professor of mechanical engineering at the University of Michigan. Glenn S. Daehn is the Fontana Professor of Materials Science and Engineering at The Ohio State University. Tom Mahoney, associate director at MForesight, contributed to this article. .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"counter\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"counter\"], body .header .wsj-interactive.generic-iframe-embed[name=\"counter\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"counter\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"counter\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"counter\"] { height: 1px; } This article was originally published at The Conversationâ\u0080\u0094The pandemic has revealed the cracks in US manufacturing: Hereâ\u0080\u0099s how to fixÂ them"}]}