{"article": [{"url": "https://www.marketwatch.com/story/when-this-california-company-tried-to-build-a-diverse-board-it-was-really-hard-to-find-people-11602183120", "published": 1602169160.0, "headline": "When this California company tried to build a diverse board, â\u0080\u0098it was really hard to find peopleâ\u0080\u0099", "body": "A concierge for Shift, an online used-car seller that offers to bring test drives to its customers. Shift Technologies For the gay, immigrant co-chief executive of soon-to-be-public Shift Technologies Inc., it was important that the board of his company not be made up of a majority of straight, white men. When George Arison tried to make that a reality, though, he hit a wall. â\u0080\u009cThe first set of lists, it was really hard to find people to put on them,â\u0080\u009d Arison â\u0080\u0094 who is married and raising two 1-year-olds while also going through the process of taking his San Francisco-based company public via a special-purpose acquisition company, also known as a SPAC or blank-check company â\u0080\u0094 said in one of a series of interviews with MarketWatch that provided an inside look at the SPAC process . â\u0080\u009cThe people [I] know are mostly men.â\u0080\u009d See also: Online car seller gives an inside look at the pandemicâ\u0080\u0099s most popular path to going public California companies like Arisonâ\u0080\u0099s donâ\u0080\u0099t really have a choice when building a board, though. State law requires that boards of publicly traded companies with headquarters in the state that have six members or more must have at least three women by next year. In addition, a law signed by Gov. Gavin Newsom last month will also require boards to have at least one member from an underrepresented race, ethnicity or the LGBTQ community by the end of next year. Shiftâ\u0080\u0099s board will be in compliance with both laws from the start. Arison, who said he is no fan of government-mandated â\u0080\u009cquotasâ\u0080\u009d and prefers corporate actions that drive change, said it was â\u0080\u009ccriticalâ\u0080\u009d to find women for Shiftâ\u0080\u0099s board because data show that companies that have female directors perform better. Besides, the company should â\u0080\u009crepresent all the people you cater to,â\u0080\u009d he added. Enter Lindsay Trout, a recruiter for executive search firm Egon Zehnder, who has increasingly been tasked with finding candidates from underrepresented groups. Last year, two-thirds of her companyâ\u0080\u0099s board placements were â\u0080\u009cdiverse,â\u0080\u009d meaning the directors who were hired were from some sort of underrepresented group. â\u0080\u009cWhat is the case now, in order to kind of broaden your talent pool, you look more broadly,â\u0080\u009d she said. â\u0080\u009cA lot of people are having first-time director roles vs. the same groups of people rotating in and out.â\u0080\u009d See: California is trying to legally require more diversity on corporate boards Shift, which could go public as soon as next week, has eight members on its board, three of whom are women. Victoria McInnis, a veteran of General Motors Co. GM, -0.15% who brings audit and tax expertise and was an audit chair for VectoIQ, the SPAC that recently completed its merger with electric-truck maker Nikola Corp. NKLA, -1.36%, is one of two women who joined the board last month. â\u0080\u009cGeorgeâ\u0080\u0099s approach about being purposeful [in finding women for the Shift board] was refreshing and genuine,â\u0080\u009d McInnis said in an interview with MarketWatch, in which she noted that it was unusual to be contacted for a board position by a recruiter because â\u0080\u009coften you get a call from someone you know.â\u0080\u009d She also liked that â\u0080\u009cthe word â\u0080\u0098fitâ\u0080\u0099 didnâ\u0080\u0099t come up because itâ\u0080\u0099s so frequent that you hear the word diversity but also the word fitâ\u0080\u009d â\u0080\u0094 which can reflect a lack of true commitment to bringing in someone who may think differently or have different experiences. Arison said that as he has gone through the SPAC â\u0080\u009croadshowâ\u0080\u009d process, he has spoken to about 150 investors. â\u0080\u009cOnly 10 of them had a woman in the call,â\u0080\u009d he said. â\u0080\u009cThatâ\u0080\u0099s insane when you think about it. I donâ\u0080\u0099t want my daughter growing up 25 years from now having to face that situation.â\u0080\u009d Shiftâ\u0080\u0099s board contains just one non-white director (Indian-American Manish Patel of Highland Capital Partners, which is an investor in Shift). But itâ\u0080\u0099s not for lack of trying, Arison said. â\u0080\u009cWeâ\u0080\u0099ve done our best to include men and women, straight and gay as well as immigrants and people of different ethnicities, heritages and races on our board,â\u0080\u009d said Arison, an immigrant from former Soviet republic Georgia. He added that the board will continue to evolve and its makeup will change. One challenge the company ran into as it searched for directors: the business itâ\u0080\u0099s in. Some women, including minority women with whom Shift talked, werenâ\u0080\u0099t â\u0080\u009cexcited about cars,â\u0080\u009d Arison said. â\u0080\u009cClearly, itâ\u0080\u0099s a heavily male-dominated industry,â\u0080\u009d McInnis said. But having come from GM, she said she has a â\u0080\u009cgenuineâ\u0080\u009d love for cars, and that she finds Shiftâ\u0080\u0099s business model â\u0080\u009cfantasticâ\u0080\u009d because of the accessibility it provides. â\u0080\u009cWhen I think used car, I think dealership, or meeting a stranger,â\u0080\u009d she said. Shift â\u0080\u0094 which buys and sells cars in California (Sacramento, San Francisco and the rest of the Bay Area, San Diego, Los Angeles), Oregon and is expanding to Washington state â\u0080\u0094 delivers cars that would-be buyers can test drive from their own homes. Shift would not disclose the demographics of its total workforce of about 475, with Arison saying that thereâ\u0080\u0099s a broad spectrum of people who work at the company. They include concierges who bring cars for customers to test drive, mechanics, salespeople and more. He said the companyâ\u0080\u0099s leaders in finance, legal and marketing are all women. â\u0080\u009cBoard recruiting is really different from workforce hiring,â\u0080\u009d he said. â\u0080\u009cRelaxing some of the constraints is really important.â\u0080\u009d Those constraints include having previous board experience, or being local. McInnis, for example, is in Canada. â\u0080\u009cOur board meetings for the next 12 months are going to be virtual anyway,â\u0080\u009d Arison said."}]}