{"article": [{"url": "https://www.marketwatch.com/story/cnbcs-jim-cramer-says-enough-is-enough-this-is-the-beginning-of-the-end-of-the-selloff-11600705105", "published": 1600697180.0, "headline": "CNBC's Jim Cramer says enough is enough: 'This is the beginning of the end of the selloff'", "body": "Jim Cramer Getty Images The stock market was getting beaten up pretty badly midway through Monday's trading session, with the Dow Jones Industrial Average DJIA, +0.56% down more than 800 points amid rising concerns of another spike in COVID-19 cases in Europe. But CNBC's \"Mad Money\" host Jim Cramer, who has been telling his viewers for weeks to consider locking in profit, doesn't seem to be too worried about it. “ 'We're down on something that nobody really understands. I'm kind of tempted to take the other side of the tradeâ\u0080¦ I'm looking for opportunity just because everything is so ugly. Isn't that when you look for opportunity?' ” Cramer played down coronavirus fears, saying that another lockdown in Europe doesn't necessarily mean that the U.S. is trending in the same direction. He also addressed troubling reports from the finance sector. \"I know that you get a lockdown in Europe and you've got a problem with some banks and that causes us to go down big? I don't know. Doesn't seem right to me,\" he said in reference reports that banks allowed money laundering for years, involving $2 trillion in transactions in question. At last check, the Nasdaq Composite COMP, +1.39%, which hit a record high on Sept. 2, was falling deeper into correction territory, as big name tech stocks continued to drag on the market. \"I do think that this is the beginning of the end of the selloff,\" Cramer said. \"I'm willing to put it out there like that.\" Watch the full segment: .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body .header .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"cramer\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"cramer\"] { height: 349px; } -"}]}