{"article": [{"url": "https://www.marketwatch.com/story/dow-sp-500-set-to-kick-off-august-trade-higher-as-tech-stocks-resume-rally-but-stalled-coronavirus-stimulus-talks-in-focus-2020-08-03", "published": 1596472400.0, "headline": "Nasdaq ends at record as stocks rally after pickup in manufacturing activity to kick off August", "body": "U.S. stocks closed higher Monday to start to kick off August on a positive note as investors took heart in upbeat manufacturing data, even as talks over another round of coronavirus stimulus appeared stalled.How did equity benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% climbed 236.08 points, or 0.9%, to close at 26,664.40. The S&P 500 SPX, +0.87% rose 23.49 points, or 0.7%, touching 3,294.61 at the close. The Nasdaq Composite COMP, +1.39% gained 157.52 points, or 1.5%, to close at 10,902.80. The tech-heavy benchmark earlier set a new intraday record at 10,905.40, putting it in sight of another 1,000-point milestone. The small-cap Russell 2000 index RUT, +0.55% added 1.8%, a sign investors are looking for value among companies that haven’t benefited from the massive run-up enjoyed by tech giants so far this year. On Friday, the Dow put in a weekly loss of 0.2%, while the S&P 500 gained 1.7% and the Nasdaq surged 3.7% over the period. In July, the indexes booked a fourth straight monthly gain, with the Dow gaining 2.4%, the S&P 500 advancing 5.5% and the Nasdaq rallying 6.8% for the month. What drove the market? In economic data, the Institute for Supply Management reported that its manufacturing gauge rose to a reading of 54.2, while new orders jumped to 61.5. MarketWatch-polled analysts had forecast the purchasing managers index to rise to 53.6, from 52.6 in June. Any reading above 50 indicates expansion in factory activity. “The ongoing uncertainty around the virus and state of the economy still raises questions on the sustainability of the rebound in manufacturing. The strong July report provides further confirmation of improvement in recent months,” said Jim Baird, chief investment officer at Plante Moran Financial Advisors. A raft of stronger-than-expected manufacturing purchasing managers indexes in Europe and in China, signaling a steadying global economy, helped to set the stage for the upthrust in the market. For all that, there are still no signs of a stimulus package agreement between Democrats and Republicans after negotiations over the weekend failed to yield a replacement for a $600-a-week boost to unemployment benefits that expired Friday. House Speaker Nancy Pelosi, D-California, and Treasury Secretary Steven Mnuchin revealed clear fault lines in negotiations between the parties during Sunday talk shows. Pelosi said that “we’ll be close to an agreement when we have…an agreement,” speaking to ABC’s Martha Raddatz on “This Week.” At issue for Democrats and Republicans is the amount of unemployment assistance for Americans. The White House has come out in favor of reducing the federal assistance to $200 a week, Democrats have called for keeping it at $600 a week. However, the parties appear to both support a fresh round of stimulus checks of $1,200 for workers. The fight for aid for out-of-work Americans comes ahead of Friday’s July report on the labor market that will be examined to determine the impact on employment as cases of the infection have steadily risen in a number of states. Indeed, coronavirus infections in the U.S. reached a record in July, with more than 1.9 million new cases. The U.S. has nearly 4.7 million confirmed COVID-19 cases and about 155,000 deaths, while the global tally for infections stands at more than 18 million and almost 690,000 deaths, according to data compiled by Johns Hopkins University. Meanwhile, investors may focus on developments between Microsoft Corp. MSFT, +2.48% and video-sharing app TikTok, owned by a Chinese company, ByteDance. Microsoft confirmed talks to buy the American unit of the company and Microsoft CEO Satya Nadella said he spoke with President Donald Trump. Trump on Friday had signaled that he was considering a ban of the popular app. On Monday, Trump said he favored an outright purchase of TikTok by Microsoft and said that the deal should be completed before Sept. 15 if TikTok isn’t avoid a U.S. ban. Trump on Monday suggested the U.S. government should get part of the proceeds of any sale of TikTok. Secretary of State Mike Pompeo over the weekend said that the White House may take action against other Chinese software companies, highlighting elevated tensions between Beijing and Washington. On the Federal Reserve front, Dallas Fed President Robert Kaplan said the economic rebound this quarter “is more muted” than expected and, as a result, the unemployment rate this year will likely be higher than previously thought.Which stocks were in focus? Shares of Clorox Co. CLX, +0.90% fell 2% after the maker of cleaning and household products reported a fiscal fourth-quarter profit and revenue that beat expectations, as it benefited from demand for cleaning products as a result of the COVID-19 pandemic, while providing an in-line outlook. The company also announced a planned change at CEO. Microsoft MSFT, +2.48% shares rallied nearly 6% after confirming on Sunday that it is holding talks with China-based ByteDance to buy the U.S. operations of its TikTok unit. Marathon Petroleum Corp. MPC, -3.21%, fresh from the sale of its gas stations to the owners of the 7-Eleven convenience store chain for $21 billion in the largest U.S. energy deal of the year, posted second-quarter earnings Monday, showing a smaller-than-expected adjusted loss but revenue that lagged estimates. Marathon shares fell in early trade, but then rebounded. Shares of residential and commercial security provider ADT Inc. ADT, -0.83% soared 59% Monday, after the company announced a new venture with Alphabet Inc.’s GOOG, +1.97% GOOGL, +1.82% Google to create the next generation of smart home security offerings. Apple Inc. AAPL, +1.74% rose 2.5% after it purchased an online payments startup that could turn the iPhone into a payment terminal, much as Square SQ, +2.06% does, according to a report. Apple has bought Montreal’s Mobeewave for about $100 million, according to Bloomberg News. Shares of McKesson Corp. MCK, -1.75% climbed more than 6% after the drug distributor reported fiscal first quarter profit and revenue that beat expectations. Tyson Foods Inc. TSN, -1.71% shares rose 0.9% after the meat producer’s earnings topped Wall Street forecasts. Global Payments Inc. GPN, +1.22% topped earnings expectations Monday and announced a new partnership with Amazon Web Services, sending the stock more than 1% higher. How did other markets trade? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.5 basis points to 0.549%. Bond prices move inversely to yields. Global equity markets marched higher on Monday. The Stoxx Europe 600 index SXXP, +0.55% closed at 363.64, up 2.1%, and the FTSE 100 UKX, +0.64% closed up 2.3%. In Asia, China’s CSI 300 index 000300, +2.04% gained 1.6%, the Shanghai Composite Index climbed 1.8%. Japan’s benchmark Nikkei index NIK, -0.11% climbed 2.2%. In other assets, the greenback reversed some of its decline this year, with the ICE U.S. Dollar index DXY, -0.58% jumping 0.3%. Crude futures CL00, -1.62% shed their early losses to move up 2%, 83 cents, to $41.11 a barrel, on the New York Mercantile Exchange. Gold futures for December US:GCQ20 rose 40 cents, or less than 0.1%, to settle at $1,986.30 an ounce, after touching a fresh intraday peak at 2,009.50."}]}