{"article": [{"url": "https://www.marketwatch.com/story/disney-fans-say-a-popular-ride-is-racist-and-should-be-overhauled-it-wouldnt-be-the-first-time-disney-has-changed-with-the-times-2020-06-15", "published": 1592815820.0, "headline": "Disney fans say a popular ride is racist and should be overhauled - it wouldn't be the first time Disney has changed with the times", "body": "Some Disney fans are hoping to convince the company to overhaul one of its most popular attractions to remove racist references. If they succeed, it wouldn't be the first time Disney has tweaked an attraction in the face of changing societal norms and shifting attitudes. A petition on Change.org that has collected over 21,000 signatures is calling on Disney DIS, +1.53%  to overhaul the ride Splash Mountain, which is based on the controversial 1946 Disney film \"Song of the South.\" The petition suggests that Disney reimagine the ride and use the 2009 animated film \"The Princess and the Frog\" as inspiration for the new version. On Twitter TWTR, -0.23%, others have suggested reworking the ride and basing it on other Disney animated films, including \"Moana\" and \"The Emperor's New Groove.\" The petition comes as Americans are seeing some of their most beloved cultural hallmarks with new eyes as the country faces a national reckoning over race following George Floyd's killing by Minneapolis police and weeks of Black Lives Matter protests. In some cases Americans are realizing that some of their happiest childhood memories also reinforce harmful racial stereotypes. HBO Max T, -1.01% for instance temporarily removed the 1939 movie \"Gone with the Wind\" from its library, and the Paramount Network VIAC, -2.34%  cancelled the long-running TV series \"Cops.\" (Disney did not respond to requests for comment about changing Splash Mountain.) Splash Mountain, a log flume ride, is located at three Disney theme parks around the world: Walt Disney World's Magic Kingdom in Florida, Disneyland in California and Tokyo Disneyland in Japan. While the three rides differ slightly from one another, all feature characters and stories from \"Song of the South.\" “ Splash Mountain is based on \"Song of the South,\" which Disney has refused to release on DVD or its streaming platform Disney+. ” The film is based on a collection of Uncle Remus folk tales and include the Academy Award-winning song \"Zip-a-Dee-Doo-Dah.\" Since its original release, \"Song of the South\" has been criticized for its racist portrayal of African-Americans and the way it presents its plantation setting as appealing. The NAACP condemned the film when it was released (while also applauding its technical achievements), saying that it \"helps to perpetuate a dangerously glorified picture of slavery.\" Also see:'Disneyland reopening schedule looks like the unsafest thing ever': Thousands sign petition asking to delay July opening The film has never been made available on VHS or DVD in the U.S., and Disney has said it would not include it on its video streaming platform, Disney+. On Twitter, Frederick Chambers, who says he is a Disneyland employee, posted a rendering of how Splash Mountain could be redone to tell the story from \"The Princess and the Frog.\" The post has been retweeted nearly 5,000 times and has garnered thousands more likes. iframe.twitter-tweet { width: 100% !important; } In its current form, Splash Mountain is \"sanitized\" of the problematic aspects of the movie it's based on, Chambers said. \"The time has come to at least look at where our stories come from and how people of color are represented in films and the parks,\" Chambers told MarketWatch, noting that his comments and opinions were his own and do not reflect those of The Walt Disney Co. \"Many guests are either unaware or simply do not care about this history,\" Chambers added. A retheme on the scale of what fans have proposed for Splash Mountain may only come to fruition if Disney sees the ride's connection to \"Song of the South\" as a liability. \"It's very hard to know what Disney is thinking internally,\" said Don Munsil, co-owner of travel website MouseSavers.com. \"Retheming a popular ride would be a huge undertaking, but for sure Disney would do it if they felt the ride was making significant numbers of guests uncomfortable or it was sending a message that wasn't in keeping with company values.\"Disney has a history of changing attractions to remove controversial references The controversy over Splash Mountain isn't the first time Disney has been asked to revisit an attraction from a new perspective in light of changing attitudes about social justice. In 2018, Disney reworked another popular attraction, Pirates of the Caribbean,at Walt Disney World and Disneyland to remove a scene in which the ride's pirates were shown auctioning women to be brides. In the new version of the ride, one of the red-headed women is now one of the pirates. Disney has also rebranded or renamed attractions to be more culturally sensitive. A ride at Disneyland that was called the Indian War Canoes was later changed to Davy Crockett's Explorer Canoes. In 2001, Disney renamed a hotel at Walt Disney World that used to be called Disney's Dixie Landings Resort to Disney's Port Orleans Resort Riverside. “ Two years ago, Disney redid a scene on the attraction Pirates of the Caribbean in which women were depicted as being auctioned off as brides. ” \"If you want to talk about a completely tone deaf set of choices, the center-most building [of Dixie Landings Resort] where you went in to check in and where you had your food was a cotton mill,\" Jim Hill, a theme park historian and blogger, told MarketWatch. There's evidence that Disney has considered \"retheming\" - Disney parlance for reworking - Splash Mountain in the past. A Disney internal memo obtained by Hill and provided to MarketWatch outlines a possible iteration of Splash Mountain for Disneyland Paris. Disney officials floated theming the ride after the 1995 film \"Pocahontas\" or Davy Crockett instead of \"Song of the South,\" citing Europeans' lack of familiarity with the \"Song of the South\" characters. Ultimately, Disney did not construct the ride. (Disney did not respond to requests for comment about the memo.) Read more:Walt Disney World cancels dining reservations and stops taking new hotel bookings ahead of planned July reopeningRedoing Splash Mountain presents opportunities and obstacles Replacing \"Song of the South\" with \"The Princess and the Frog\" as the theme of Splash Mountain would carry special meaning. The film was the first Disney movie to showcase a black princess. The film follows Tiana, a waitress from New Orleans, who hopes to own her own restaurant one day. While the film had a very strong opening weekend when it was released and received positive reviews, it was seen as somewhat of a disappointment, at least by investors. In a 2016 MarketWatch analysis of how Disney's stock performed following the release of its animated films, \"The Princess and the Frog\" ranked No. 31 out of the 38 films analyzed. Also read:This mother took her family on a $2,200 vacation to Disney World - for free Despite the relatively underwhelming response to the film's box office gross, the characters from the film have proven popular. The character of Tiana is already a major presence at Disney's theme parks and cruise lines. She's featured in parades and meet-and-greets, and in 2009 a live show based on the film debuted at the Magic Kingdom. On Disney Cruise Lines, vacationers can dine at Tiana's Place, a restaurant based on the movie. But an entire ride inspired by \"The Princess and The Frog\" would be a different ball game, and could prove popular among visitors, experts said. \"This is a huge opportunity for Disney - new rides bring in customers,\" said Len Testa, president of travel website Touring Plans. (Testa confirmed to MarketWatch that he had signed the petition regarding Splash Mountain.) “ 'This is a huge opportunity for Disney - new rides bring in customers.' ” - Len Testa, president of travel website Touring Plans Overhauling Splash Mountain isn't a simple proposition though. Much of the ride's structure, Hill said, is made of concrete, which makes redoing it more difficult than other attractions. Additionally, Splash Mountain qualifies as a thrill ride by Disney standards, which means it may not appeal to younger children who are the target audience of the film. \"This would be something really that they would want to be friendly to 3-to-5-year-old girls and the height limit for Splash Mountain is kind of restrictive in that manner,\" Hill said. The bigger hurdle for Disney currently could be financial: The company's theme parks around the world closed for months because of the coronavirus pandemic, and its parks in the U.S. are not set to reopen until July. The pandemic has already cost the company's theme-parks division $1 billion in profit, and the company has said it would reduce capital spending to compensate. Shares of Disney have been down 18% this year to date compared to a 9% decline for the Dow Jones Industrial Average DJIA, +0.56%  and a nearly 5% dip for the S&P 500 Index SPX, +0.87%. "}]}