{"article": [{"url": "https://www.marketwatch.com/story/why-this-frustrated-value-stock-pro-sees-shades-of-1999-in-the-market-now-and-bargains-in-the-future-2020-10-01", "published": 1601741840.0, "headline": "Why this frustrated value stock pro sees shades of 1999 in the market now â\u0080\u0094 and bargains in the future", "body": "A year ago, I said the U.S. stock market was â\u0080\u009cpartying like itâ\u0080\u0099s 1999.â\u0080\u009d I was off by a year. Last year was missing the necessary euphoric speculation, which ironically arrived in the middle of a worldwide pandemic. Just as history doesnâ\u0080\u0099t repeat itself but rhymes, so does U.S. stock market behavior. Though there are a lot of similarities between 1999 and 2020, there are differences, too.Â In 1999 the market was flooded with dot-coms â\u0080\u0094 â\u0080\u009cnew economyâ\u0080\u009d companies that traded at astronomical valuations, were losing money, and had unproven business models. Today we have a lot of â\u0080\u009cnew economyâ\u0080\u009d companies, too, but unlike in 1999, these companies generate cash flows. Most appear to be real businesses, but it is not always clear how sustainable their competitive advantages are. This is paramount when the market expects super-high growth rates to continue decades into the future.Â Here is one example: Zoom Video Communications ZM, +2.89% Â â\u0080\u0094 a clear beneficiary of the coronavirus pandemic. The pandemic turned its name into a verb. But there are zero switching costs from Zoom. Could Alphabet GOOGL, +1.82% Â , Facebook FB, +0.26% Â , or even a startup displace it? Too early to tell. In 1999, the stock market plunged into a speculative frenzy. Day trading became the past time of everyday folks. At least in 1999 you had to wait to place trades until you got home or to the office. Today, you can even trade (gamble) from the comfort of your own bathroom on your smartphone. Clear signs of speculative behavior became apparent recently when shares of Apple AAPL, +1.74% Â and Tesla TSLA, +1.89% Â soared 50% or more in the days after they announced stock splits recently. Apple has created more value for its shareholders by announcing a stock split in 2020 than by coming out with new products. Teslaâ\u0080\u0099s market capitalization has exceeded the market cap of all U.S., European, and Japanese car makers combined. Here is the rub: Stock splits create zero economic value. Letâ\u0080\u0099s say there is a publicly traded pizza. It has 16 slices and each slice trades for $1. So the price of the whole pie â\u0080\u0094 its market capitalization â\u0080\u0094 is $16 ($1 times 16). Letâ\u0080\u0099s say this pizza observed Teslaâ\u0080\u0099s and Appleâ\u0080\u0099s positive experience with stock splits and decided that it wanted to be cut into 32 slices instead of 16 â\u0080\u0094 a two-for-one slice split. So if you owned one slice that was worth $1, now you own two at 50 cents each.Â Now, after our pizza announces its two-for-one slice split, investors get excited about new â\u0080\u009ccheaperâ\u0080\u009d slices and push the price-per-slice up 50% to 75 cents from 50 cents. Pizza weight and size and calories have not changed, but â\u0080\u009cinvestorsâ\u0080\u009d are suddenly willing to pay $24 (0.75 times 32) for the same pie they paid $16 for. This sounds ridiculous, but this is what happened with Tesla and Apple shares. The U.S. marketâ\u0080\u0099s current speculative phase may have been triggered by a combination of low interest rates, which have resulted in low margin rates, the decline of retail trading commissions to zero, pandemic stimulus money, and/or boredom from lockdown.Â In any case, just as in 1999, stocks that have been rising continue to rise. Speculators ride the wave of what worked lately. Another factor helps these stocks: call options on individual stocks, as traders gamble to leverage their bets on rising stock prices. According to the CBOE, the volume of single-stock contracts rose 80% in August versus a year earlier. Investorsâ\u0080\u0099 euphoric bets on call options creates a skew in the options market. A significant imbalance develops between calls and puts, which usually balance each other out.Â Thus, every time someone buys a call option, a counterparty on the other side (a market maker) has to buy stock in the open market to hedge its exposure. As the stock price rises, the counterpartyâ\u0080\u0099s exposure to the stock increases and it has to buy more stock, which in turn drives the stock price up. Higher stock prices lead to higher stock prices. This vicious cycle will continue â\u0080\u0094 until it doesnâ\u0080\u0099t. Read: Why S&P 500 returns could be flat until 2030 unless you reinvest dividends Here is another thing about 1999: Growth stocks become priceless and value stocks became worthless. This started to happen again last year, and in recent months the gap has widened considerably.Â Growing (but not fast-growing) businesses were left for dead in 1999. As growth and dot-com stocks were going up, value stocks were declining. It was extremely demoralizing being a value investor in 1999. Value investors that kept to value investing and didnâ\u0080\u0099t chant the â\u0080\u009cthis time is differentâ\u0080\u009d mantra were going out of business (frustrated clients were leaving them) or were simply quitting out of frustration. Iâ\u0080\u0099d be lying if I told you that over the past few years value investing has not been frustrating. Albert Einstein defined insanity as â\u0080\u009cdoing the same thing over and over again but expecting a different outcome.â\u0080\u009d I can relate to this on some level. But let me tell you how I keep my sanity: Stoicism.Â The Greek Stoic philosopher Epictetus said, â\u0080\u009cThere are things which are within our power, and there are things which are beyond our power.â\u0080\u009d The stoics developed a framework known as dichotomy of control. Epictetus described it this way: â\u0080\u009cWithin our power are opinion, aim, desire, aversion, and, in one word, whatever affairs are our own. Beyond our power are body, property, reputation, office, and, in one word, whatever are not properly our own affairs.â\u0080\u009dÂ If we apply this framework to investing, then we find that within our power is our research and investing process, analyzing and assembling a portfolio of high-quality, undervalued companies. It is within our power to strive to be as rational as possible and to not be swayed by the external environment. It is within our power to communicate with our clients and show them stocks and the economy through our eyes.Â We can control what we do. We cannot control when the stock market will stop pricing fast-growing companies as priceless and slower-growing companies as essentially worthless. Since the â\u0080\u009cwhenâ\u0080\u009d is not in our control, we donâ\u0080\u0099t focus on it; we just stick to the â\u0080\u009cwhat.â\u0080\u009d Today, the marketâ\u0080\u0099s â\u0080\u009cpricelessâ\u0080\u009d stocks are not priced on price-to-earnings. When price-to-earnings exceeds 100, quoting it on that basis becomes embarrassing. So analysts and investors started quoting price-to-revenue multiples â\u0080\u0094 somehow smaller numbers serve to keep investors calmer. Zoom, for instance, is trading at somewhere between 150 and 200 times next yearâ\u0080\u0099s earnings but 50 times 2021 revenues. You see, 50 is not as scary as 150.Â Zoom is priceless, just like Cisco Systems CSCO, +0.15% Â and Qualcomm QCOM, +2.06% Â were in 1999. Ironically, my firm owns both Cisco and Qualcomm shares, but we bought them at bargain-basement prices after the dot-com investors were done with them. I get the feeling that in the future weâ\u0080\u0099ll get to pick up todayâ\u0080\u0099s growth darlings on the cheap, too. How does one invest in this overvalued market? Our strategy is spelled outÂ in this fairly lengthyÂ article.Â Â Â Â Â Vitaliy Katsenelson is chief investment officer atÂ Investment Management AssociatesÂ in Denver, which holds positions in Qualcomm and Cisco Systems, and put options in Tesla. More:What history says tends to happen after the U.S. stock market logs ugly September losses Plus:Warren Buffett knows these are the best investors to follow with your own money"}]}