{"article": [{"url": "https://www.marketwatch.com/story/ubers-abandonment-of-grubhub-deal-is-a-clear-negative-analysts-say-2020-06-11", "published": 1591885160.0, "headline": "â\u0080\u0098What a lost opportunityâ\u0080\u0099: Uberâ\u0080\u0099s abandonment of GrubHub deal is a â\u0080\u0098clear negative,â\u0080\u0099 analysts say", "body": "The food-delivery landscape is getting a shakeup, but not in the way investors had been expecting over the past few weeks. European player Just Eat Takeaway.com N.V. JET, +1.22% Â TKWY, +1.00% Â confirmed Wednesday afternoon that it would be acquiring GrubHub Inc. GRUB, +0.83% Â in an all-stock deal. Uber Technologies Inc. UBER, -0.18% Â was thought to be close to its own deal for GrubHub recently, but the ride-hailing giant reportedly backed away due to the potential for antitrust opposition to the combination. Opinion: Uber plus Grubhub called â\u0080\u0098a new low in pandemic profiteering,â\u0080\u0099 and thatâ\u0080\u0099s not the only problem Analysts mostly agreed that missing out on a GrubHub deal was unfortunate for Uber, even though some saw a few silver linings. â\u0080\u009cUber walking away at the altar from the GrubHub deal is a clear negative as competition and pricing pressure will be fierce going forward,â\u0080\u009d Wedbush analysts Daniel Ives and Ygal Arounian. â\u0080\u009cGrubHub being acquired by a larger competitor will only embolden the market-share battle just at the same time that the regulatory environment around delivery fees across cities is becoming a larger headwind.â\u0080\u009d They continue to rate Uberâ\u0080\u0099s stock at outperform with a $47 price target. Deutsche Bankâ\u0080\u0099s Lloyd Walmsley also wrote that the lack of an Uber-GrubHub deal is a â\u0080\u009cclear negativeâ\u0080\u009d for Uber that will slow down â\u0080\u009cwhat looked likely to be a fast-track towards rationalization in the market and path towards profitability.â\u0080\u009d â\u0080\u009cWhat a lost opportunity,â\u0080\u009d he said in his note to clients. At the same time, he wrote that he spoke with Uberâ\u0080\u0099s investor relations team after the Just Eat Takeaway.com announcement took place and â\u0080\u009ccame away with a better understanding for their rationale and some confidence that this is mostly a bump in the road.â\u0080\u009d He wrote that in his view, Uberâ\u0080\u0099s inability to reach a deal with GrubHub seemed to hinge on more than just disputes about a reverse break-up fee. Other concerns may have included â\u0080\u009cunsavory tactics at GrubHub that might have to be discontinuedâ\u0080\u009d and â\u0080\u009cmarketplace fee caps in NYC and elsewhere that could ultimately get made permanent,â\u0080\u009d he argued. Walmsley rates Uber shares a buy with a $40 price target. Todd Holman, a director at Union Square Advisors, said that for Uber Eats and Doordash, GrubHubâ\u0080\u0099s tie up with a well-funded European player is â\u0080\u009cif not the worst case scenario, one they donâ\u0080\u0099t want to wake up and see.â\u0080\u009d Consolidation to only two major players wouldâ\u0080\u0099ve allowed those two companies to focus on the cities where they were already best positioned and then â\u0080\u009creally begin to crank on profitability,â\u0080\u009d he told MarketWatch. GrubHub seemed to be letting up on some of its marketing efforts in recent months in an attempt to control spending, but Just Eat Takeaway is â\u0080\u009cmuch better prepared an willing to continue this market-share battle.â\u0080\u009d MKM Partners analyst Rohit Kulkarni called the GrubHub-Just Eat merger a â\u0080\u009ca marginal negative for Uber shares over the near-term as we think this was a lost opportunity to become a market share leader in the U.S.,â\u0080\u009d though he still sees a window for Uber Eats to grow its share over the next year as the GrubHubâ\u0080\u0099s new merger arrangement â\u0080\u009cgoes through the digestion process.â\u0080\u009d He rates Uber shares a buy with a $38 target price. Opinion: IBM, Amazon moves on facial recognition are good baby steps toward removing bias Bernsteinâ\u0080\u0099s Mark Shmulik was more mixed on the situation. â\u0080\u009cOur confidence in Uber management continues to grow,â\u0080\u009d he wrote. â\u0080\u009cWe didnâ\u0080\u0099t want to see Uber overpay for GrubHub, particularly given uncertainty around how regulators would respond to the deal, and weâ\u0080\u0099re happy to see that management stood its ground.â\u0080\u009d Shmulik said that Just Eatâ\u0080\u0099s offer â\u0080\u009cfeels expensiveâ\u0080\u009d given that it and GrubHub operate in different geographies, limiting the opportunity for obvious synergies. Still, heâ\u0080\u0099s concerned that this deal wonâ\u0080\u0099t lead to rationalization in the food-delivery industry like there could have been if Uber or a different U.S. player chose to purchase GrubHub. â\u0080\u009cItâ\u0080\u0099s unlikely that Just Eat would be happy buying the #3 player in the US without wanting to gain share â\u0080\u0093 a new player stepping in is probably bad for competition,â\u0080\u009d he wrote, while reiterating an outperform rating and $35 target price on Uberâ\u0080\u0099s stock. Uber shares are down about 8% in Thursday trading, while Lyft Inc.â\u0080\u0099s stock LYFT, +2.16% Â is off roughly 6%. Both companies were dealt a blow to their business models late Wednesday after the California Public Utilities Commission said that ride-sharing drivers were to be classified as employees under the stateâ\u0080\u0099s new law governing gig-economy work. This determination is a â\u0080\u009creal headwind to [Uber and Lyft] from a unit-economics standpointâ\u0080\u009d and will force the companies to determine whether they should make company-wide changes to how drivers are treated or move toward a â\u0080\u009cpotential patchwork approachâ\u0080\u009d by preparing to deal with each stateâ\u0080\u0099s potential regulations independently, Holman said. Uberâ\u0080\u0099s stock has added 1.6% over the past month as the S&P 500 has increased 4%."}]}