{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-tumble-on-expectations-for-return-of-libyan-crude-production-global-stock-market-selloff-2020-09-21", "published": 1600706420.0, "headline": "Oil prices down 4% on expectations for return of Libyan crude production, global stock-market selloff", "body": "Oil futures fell Monday, sending U.S. prices down by more than 4%, on expectations Libyan crude will soon return to the market, while worries over a rise in European COVID-19 cases and a global equity market selloff added to the negative tone. “Oil prices are lower on turmoil, whether it be from mother nature or politics,” said Phil Flynn, senior market analyst at The Price Futures Group. The return of Libya oil is weighing on prices, along with fears of more COVID-19 shutdowns, while concerns over “increasing political divides after the death of Supreme Court Justice Ruth Bader Ginsburg reduces the odds that the U.S. will get much-needed coronavirus relief,” he said in a note. “Even mother nature is creating problems for oil,” he said. Tropical Storm Beta is forecast to move toward the central coast of Texas and inland by late Monday, according to a morning update from the National Hurricane Center. The Gulf of Mexico region is still recovering from back-to-back hurricanes, following Hurricane Laura in late August and Hurricane Sally last week. As of Monday 8.36% of the region’s oil production remained shut in, along with 5.98% of natural-gas output, according to the Bureau of Safety and Environmental Enforcement. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 fell $1.80, or 4.4%, to settle at $39.31 a barrel on the New York Mercantile Exchange, ahead of the contract’s expiration at the end of Tuesday’s session. Global benchmark, November Brent crude BRN.1, -0.07% BRN00, -0.07% shed $1.71, or 4%, to $41.44 a barrel on ICE Futures Europe. Among the petroleum products, October gasoline US:RBV20 shed 4.8% to finish at $1.1771 a gallon and October heating oil US:HOV20 settled at $1.1073 a gallon, down 4.5%. Recent reports that Libyan military commander Khalifa Haftar, who controls the eastern portion of the country, would lift an eight-month blockade on crude exports that has virtually shut down production contributed to the weaker tone, analysts said. Some of Libya’s key oil fields are preparing for a restart, but that’s likely to be gradual due to technical and operational glitches, as well as political volatility, S&P Global Platts reported Monday. Analysts at JBC Energy, a Vienna-based consulting firm, changed their base case to a gradual ramp up of Libyan supply starting from the end of the month to 650,000 barrels a day in early 2021. “This level is well below precrisis levels of 1.2 million barrels a day, based on earlier reports of damaged infrastructure,” they said in a Monday note. “This means Libya is set to add 230,000 barrels a day on average over Q4 2020, with a certain upside risk given that steeper than anticipated ramp-up patterns may be possible.” The prospect of returning Libya production is particularly negative amid uncertainty over the state of the global economy as worries rise over a second wave of COVID-19 infections, analysts said. “Obviously, the global oil market is in a fragile state, given the slower than expected demand recovery, therefore any additional supply is only going to make efforts from OPEC+ to rebalance the market more difficult,” said Warren Patterson, head of commodities strategy at ING, in a note. A selloff across global equity markets, tied in part to worries over the rise in COVID-19 cases and the potential for the renewal of restrictions on activity in European countries added to the negative tone, analysts said. European equities tumbled Monday, while U.S. benchmark stock indexes moved sharply lower on Wall Street. Meanwhile, natural-gas futures suffered the biggest percentage decline on Nymex Monday, with the October contract US:NGV20 down 21 cents, or 10.4%, at $1.835 per million British thermal units. Tropical Storm Beta is “expected to make landfall tonight, but is already bringing heavy rains and flooding to the Texas coast, and could potentially lead to outages at U.S. [liquefied natural gas] export facilities,” said Christin Redmond, commodity analyst at Schneider Electric, in a daily note. Additionally, the National Oceanic and Atmospheric Administration is predicting a return of below-normal temperatures to parts of the eastern and Midwestern U.S. from Sept. 28 through Oct. 4, “which will likely continue to suppress power generation demand for gas,” she said."}]}