{"article": [{"url": "https://www.marketwatch.com/story/ubers-delivery-business-tops-core-ride-hailing-as-pandemic-rocks-earnings-11596745421", "published": 1596732980.0, "headline": "Uberâ\u0080\u0099s delivery business tops core ride-hailing as pandemic rocks earnings", "body": "Uber Technologies Inc. reported second-quarter earnings Thursday. Getty Images Uber Technologies Inc. posted another quarterly loss of more than $1 billion Thursday as the COVID-19 crisis took a toll on its core ride-hailing business, which was actually surpassed by Uberâ\u0080\u0099s food-delivery business. Uber UBER, -0.18% reported a second-quarter loss of $1.78 billion, or $1.02 a share, on revenue of $2.24 billion, compared with a record loss of $4.72 a share on revenue of $3.17 billion in the year-ago quarter. Revenue fell 29%, showing the dramatic effects of the COVID-19 pandemic on a once fast-growing business. The companyâ\u0080\u0099s results fell short of Wall Streetâ\u0080\u0099s expectations on the bottom line, but revenue actually held up better than analysts projected. Analysts surveyed by FactSet on average had expected Uber to post a loss of 81 cents a share, or nearly $1.4 billion, on revenue of $2.1 billion. Uberâ\u0080\u0099s ride-hailing business has taken a huge hit. Gross bookings fell 35% to $10.2 billion, but bookings within the â\u0080\u009cmobilityâ\u0080\u009d segment fell more steeply at 73%, and ride-hailing revenue plunged 67% from last year to $790 million. Chief Executive Dara Khosrowshahi described the ride-hailing business as â\u0080\u009ca tale of 10,000 citiesâ\u0080\u009d in a conference call Thursday afternoon, saying that cities in Asia and Europe are bouncing back while the U.S. is struggling. â\u0080\u009cOur Mobility recovery is clearly dependent on the public health situation in any given area,â\u0080\u009d he said. Meanwhile, Uber Eats bookings more than doubled from last year, saving the quarter as Uber prepares to dramatically increase the size of that business with the acquisition of PostMates. Uber Eats brought in more revenue than ride-hailing for the first time, rising 103% to $1.21 billion. The company and analysts had expected increased demand in its food-delivery business to help offset the plunge in rides, as would-be riders spent the bulk of the second quarter sheltering in place but got more used to ordering takeout. â\u0080\u009cAt a roughly $30 billion annual gross bookings run rate at the end of Q2 our Delivery business alone is now as big as our Rides business was when I joined the Company in 2017,â\u0080\u009d Khosrowshahi said in a conference call Tuesday, while adding that PostMates produced annualized gross bookings of $4 billion in the quarter. â\u0080\u009cWeâ\u0080\u0099ve essentially built a second Uber in under three years with an accelerated growth profile, a global footprint and an enormous [total addressable market] .â\u0080\u009d Shares of Uber UBER, -0.18% dropped more than 4% in after-hours trading after ending the regular session up 4.6% at $34.72. The stock is up 16% this year. Uber released results at the same time its lawyers were defending against a lawsuit brought against the company and rival Lyft by California Attorney General Xavier Becerra and the city attorneys of San Francisco, Los Angeles and San Diego over the companiesâ\u0080\u0099 noncompliance with a state law that would classify their drivers as employees instead of independent contractors. A preliminary injunction hearing, in which the plaintiffs were seeking immediate reclassification of the drivers before a trial, was set for Thursday afternoon at San Francisco Superior Court."}]}