{"article": [{"url": "https://www.marketwatch.com/story/marylands-republican-governor-slams-trumps-handling-of-coronavirus-pandemic-2020-07-16", "published": 1595071520.0, "headline": "Marylandâ\u0080\u0099s Republican governor slams Trumpâ\u0080\u0099s handling of coronavirus pandemic", "body": "The Republican governor of Maryland published a withering account of President Donald Trump's handling of the coronavirus pandemic on Thursday, outlining how the federal government failed to offer states support on testing and even added to their burden, and including this lament: “ â\u0080\u0098Iâ\u0080\u0099m a GOP governor. Why didnâ\u0080\u0099t Trump help my state with coronavirus testing?â\u0080\u0099 ” â\u0080\u0094 Gov. Larry Hogan of Maryland In an essay published in the Washington Post thatâ\u0080\u0099s excerpted from a forthcoming book, Gov. Larry Hogan describes how he turned to his South Korean wife, Yumi, for help in procuring vital test kits from her home country by asking President Moon Jae-in to connect Maryland with LabGenomics, a medical testing company. Seoul sent Maryland a half-million tests at a cost of $9 million. â\u0080\u009cIt was a bargain considering the $2.8 billion in revenue we projected the pandemic would cost Maryland,â\u0080\u009d Hogan wrote. See: Hunt for medical supplies creates marketplace of desperation Even then, Maryland had to take extra precautions to secure the tests by driving them to a warehouse at an undisclosed location. That was after the federal government seized 3 million N95 masks purchased by Gov. Charlie Baker of Massachusetts, like Hogan a Republican governor of a typically â\u0080\u009cblueâ\u0080\u009d state. â\u0080\u009cWe werenâ\u0080\u0099t going to let Washington stop us from helping Marylanders,â\u0080\u009d said Hogan. The test-kit purchase was necessary after Hogan and other governors watched Trump consistently play down the threat of the virus, failing to â\u0080\u009cissue public warnings, draw up a 50-state strategy, or dispatch medical gear or lifesaving ventilators from the national stockpile to American hospitals.â\u0080\u009d â\u0080\u009cEventually, it was clear that waiting around for the president to run the nationâ\u0080\u0099s response was hopeless; if we delayed any longer, weâ\u0080\u0099d be condemning more of our citizens to suffering and death,â\u0080\u009d he wrote. Hogan recounted how Trump responded to news of the first U.S. case of COVID-19 while at Davos in January, immediately insisting during a friendly CNBC interview that it was â\u0080\u009ctotally under control.â\u0080\u009d The U.S. now has 3.49 million confirmed cases, and 137,420 people have died, according to data aggregated by Johns Hopkins University. â\u0080\u009cSo many nationwide actions could have been taken in those early days but werenâ\u0080\u0099t. While other countries were racing ahead with well-coordinated testing regimes, the Trump administration bungled the effort,â\u0080\u009d Hogan wrote. The first CDC test was faulty, and burdensome regulations delayed private U.S. labs from coming up with accurate tests. As Trump tweeted and told reporters that â\u0080\u009canyone can have a test,â\u0080\u009d the reality on the ground was far different. â\u0080\u009cThe resulting disorganization would delay mass testing for almost two months and leave the nation largely in the dark as the epidemic spread,â\u0080\u009d Hogan wrote. Read: Trump calls coronavirus testing â\u0080\u0098overrated,â\u0080\u0099 claims U.S. would have â\u0080\u0098very fewâ\u0080\u0099 cases if no testing At the National Governors Association winter meeting in February, Hogan, current chairman of that bipartisan group, were addressed by public health experts, including Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, who â\u0080\u009cwas already widely admired but whose awesome knowledge and straight-talking style hadnâ\u0080\u0099t yet made him a national rock star,â\u0080\u009d as well as virologist and CDC director Robert Redfield. â\u0080\u009cThey hit us with detailed presentations and the unfiltered truth, as well as it was known then,â\u0080\u009d Hogan recalled. There were dire forecasts, he noted: that the outbreak would become a catastrophe, that the death toll could be significant, that the coronavirus was much more contagious than SARS. â\u0080\u009cYou have to follow the science â\u0080\u0094 thatâ\u0080\u0099s where the answers lie,â\u0080\u009d the governor wrote. Read:Coronavirus update: Global COVID-19 cases climb to 13.6 million after record one-day tally of 230,400 new infections During a private dinner with Trump after the event, Hogan described himself as having been aghast when the president heaped praise on President Xi Jinping of China; Prime Minister Abe of Japan, whom Hogan said Trump described as his buddy â\u0080\u009cShinzoâ\u0080\u009d; and North Korean dictator Kim Jong Un, before saying he didnâ\u0080\u0099t like dealing with President Moon. â\u0080\u009cThe South Koreans were â\u0080\u0098terrible people,â\u0080\u0099 he said, and he didnâ\u0080\u0099t know why the United States had been protecting them all these years. â\u0080\u0098They donâ\u0080\u0099t pay us,â\u0080\u0099 Trump complained,â\u0080\u009d related Hoganâ\u0080\u0099s essay. Other criticisms of Trump in the essay include his falsely blaming the Obama administration for the CDCâ\u0080\u0099s faulty tests and his bragging that the U.S. was testing more than anybody in the world. â\u0080\u009cThis was true in absolute numbers, since we are a much bigger country, but weâ\u0080\u0099d tested far fewer per capita than the Koreans had â\u0080\u0094 1,048 tests per million people vs. South Koreaâ\u0080\u0099s 6,764 per million â\u0080\u0094 and of course that was the only figure that mattered,â\u0080\u009d said Hogan. Read on:Russia accused by U.S., Britain, Canada of hacking coronavirus vaccine trials"}]}