{"article": [{"url": "https://www.marketwatch.com/story/democrats-to-open-convention-like-no-other-as-bidens-big-party-goes-virtual-2020-08-16", "published": 1597689980.0, "headline": "Democrats to open convention like no other as Bidenâ\u0080\u0099s big party goes virtual", "body": "Forget the balloon-drops, backslapping and cheering crowds: This yearâ\u0080\u0099s Democratic National Convention, beginning Monday, will be an almost entirely virtual event, as the party faithful gather around computer screens and TVs to celebrate Joe Biden as their presidential nominee. Originally scheduled as an in-person event in Milwaukee, the convention has instead changed to something resembling a four-day Zoom ZM, +2.89% Â meeting thanks to the coronavirus pandemic. Biden will accept the nomination on Thursday from his home state of Delaware, and speakers including vice-presidential pick Kamala Harris and party stars like Bill Clinton and Rep. Alexandria Ocasio-Cortez will be addressing fellow Democrats via video instead of onstage in Wisconsin. Now read:Biden calls for national mask mandate, saying it would save 40,000 lives over 3 months. But voters and investors will find plenty to chew on from four nights of prime-time speeches, including how Biden attempts to unite progressives and establishment Democrats and how he might further detail economic policies. The eventâ\u0080\u0099s speaking schedule is a nod to Bidenâ\u0080\u0099s effort to bring a disparate party together. Sen. Bernie Sanders, who battled Biden for the nomination, has been given a speaking spot, as has fellow progressive Ocasio-Cortez. See:Hereâ\u0080\u0099s how to watch the Democratic convention â\u0080\u0094 plus whoâ\u0080\u0099s speaking, and when. â\u0080\u009cI think the progressives are going to fall into line because they just want to defeat [President Donald] Trump,â\u0080\u009d said J. Wesley Leckrone, a political scientist at Widener University in Pennsylvania. Bidenâ\u0080\u0099s task for his speech is to project a â\u0080\u009ccompetency and presidential air that shows that he can unite the country,â\u0080\u009d Leckrone said. Trailing Biden in national and swing-state polls as well as betting markets, Trump is attacking the former vice president as beholden to the left of his party, as exemplified by the likes of Sanders and Ocasio-Cortez. Thatâ\u0080\u0099s despite Bidenâ\u0080\u0099s rejection of policies like Medicare for All, which Sanders championed. Read:Biden leads Trump, 50% to 41%, new poll finds. Trump has charged that the Biden-Harris ticket could sink stock markets DJIA, +0.56% Â and the economy â\u0080\u0094 though at least one analyst has said that itâ\u0080\u0099s a Democratic sweep of the White House and Congress that would be best for the economy in the long run. Wall Street, whatâ\u0080\u0099s more, was reassured by Bidenâ\u0080\u0099s pick of Harris over a more-liberal vice-presidential contender such as Sen. Elizabeth Warren. Now read:A Biden-Harris sweep would be best for economy, says Fidelity International. Bidenâ\u0080\u0099s policy proposals include expanding Obamacare by offering a public-insurance option; increasing the federal minimum wage to $15 an hour; spending $2 trillion over four years on clean-energy projects; and free COVID-19 testing. Also read:Joe Biden wants a $15 minimum wage â\u0080\u0094 will the coronavirus pandemic make that more likely? John Briggs, head of strategy, Americas, for NatWest Markets, told MarketWatch that heâ\u0080\u0099ll be listening for more clues about Bidenâ\u0080\u0099s regulatory agenda. â\u0080\u009cPart of the boost to the economy early in Trumpâ\u0080\u0099s administration was not just the tax cuts, but the big drop in regulation,â\u0080\u009d said Briggs, â\u0080\u009calong with just the general tone from the top on business.â\u0080\u009d â\u0080\u009cIâ\u0080\u0099m going to be looking for things like, does [Biden] sound like heâ\u0080\u0099s moving far into re-imposing a lot of regulations?â\u0080\u009d he said. U.S. stocks SPX, +0.87% Â have rebounded since their March lows. At the same time, however, millions of Americans are out of work as the coronavirus continues to pound the economy, with U.S. unemployment remaining at more than 10%. Such grim statistics give Biden an opening, says Leckrone. â\u0080\u009cThe economy â\u0080\u0094 that was what Trump had going for him before all this started,â\u0080\u009d Leckrone said. â\u0080\u009cBut now, [Biden] can start reaching out and saying, â\u0080\u0098I know what youâ\u0080\u0099re going through right now, I grew up in that environment, and weâ\u0080\u0099re going to build back.â\u0080\u0099â\u0080\u009d Biden frequently references his middle-class upbringing, and called Harris a â\u0080\u009cfearless fighter for the little guyâ\u0080\u009d when he announced her as his running mate. Democratic-convention speakers will give remarks each night from 9 p.m. to 11 p.m. Eastern. Trump Today:Trump kicks off trips to 4 battleground states as Democrats open convention. Republicans will re-nominate Trump during the week of Aug. 24, and the president is planning his acceptance speech for Aug. 27. Also see:Mark Mobius: Biden-Harris win will be â\u0080\u0098disastrousâ\u0080\u0099, Trump will boost stock market."}]}