{"article": [{"url": "https://www.marketwatch.com/story/marine-corps-assistant-commandant-tests-positive-for-coronavirus-after-pentagon-meeting-2020-10-07", "published": 1602109460.0, "headline": "Marine Corps assistant commandant tests positive for coronavirus after Pentagon meeting", "body": "WASHINGTON (AP) — The assistant commandant of the Marine Corps has tested positive for the coronavirus, days after he and members of the Joint Chiefs of Staff were in a Pentagon meeting with a Coast Guard leader who was infected with the virus. The Marine Corps said Wednesday that Gen. Gary L. Thomas tested positive for COVID-19, becoming the latest to be infected by a virus that has afflicted President Donald Trump and an array of top staff at the White House. Thomas attended a meeting of the Joint Chiefs on Friday, and so far U.S. officials said none of the other top military leaders in the meeting — including Gen. Mark Milley, chairman of the Joint Chiefs of Staff — have tested positive. Still, Thomas’s positive test raises worrying questions about the health of the others at the meeting, including the chiefs of the Army, Navy, Air Force, Space Force and National Guard. Pentagon officials have been quick to stress that military preparedness has not been affected and that the nation’s armed services stand ready to defend the country. See:Joint Chiefs chairman and other military brass to quarantine after Coast Guard official’s positive coronavirus test Thomas and the others have been in self-quarantine since Tuesday when they found out that Adm. Charles W. Ray, the vice commandant of the Coast Guard who was at the Friday meeting, had tested positive. “At this time we have no additional senior leader positive test results to report,” said the Pentagon’s chief spokesman Jonathan Hoffman. “We will continue to follow CDC guidance for self-quarantining and contact tracing.” The Marine Corps said Thomas “is experiencing mild symptoms, but otherwise is feeling well.” The Corps said Thomas will continue to quarantine at home, officials are doing contact tracing and any personnel who had been in close contact with him will also isolate. Ray attended the Joint Chiefs meeting Friday in the so-called Tank — the classified meeting room in the Pentagon. Officials said that is where most of the military leaders were exposed to him, but he also had other meetings with officials. The Marine Corps, in a statement, said the service has been following CDC guidelines “for temperature testing, social distancing to the greatest extent possible, and the wearing of masks when social distancing is not possible. The Marine Corps remains operationally ready to answer the Nation’s call.” The news of the positive tests has stunned officials at the Pentagon. Top leaders there have largely remained free of the virus, although there have been a number of outbreaks across the active-duty force and the reserves around the nation and overseas. Overall, more than 47,000 service members have tested positive for the virus, as of Monday; 625 have been hospitalized and eight have died. It is not known how Ray contracted the virus. He attended an event for Gold Star military families at the White House on Sept. 27 that was hosted by President Donald Trump and first lady Melania Trump. Several senior military leaders, including Milley, Defense Secretary Mark Esper, Army Gen. James McConville and Army Secretary Ryan McCarthy, also attended the Gold Star event, which honored the families of service members who have died. A number of the military officials who were there got COVID-19 tests late last week after Trump and his wife both tested positive for the virus. According to officials, the military leaders were negative at that time, and they will continue to be tested in the coming days."}]}