{"article": [{"url": "https://www.marketwatch.com/story/warren-buffetts-berkshire-hathaway-buys-stakes-in-5-japanese-investment-companies-2020-08-30", "published": 1598828720.0, "headline": "Warren Buffettâ\u0080\u0099s Berkshire Hathaway buys stakes in 5 Japanese investment companies", "body": "Warren Buffettâ\u0080\u0099s Berkshire Hathaway Inc. took stakes of slightly more than 5% in five of Japanâ\u0080\u0099s most venerable corporate names with big investments in energy. Berkshire BRK.B, +0.24% Â disclosed the investments in Mitsubishi Corp. 8058, -0.48% Â , Mitsui & Co. 8031, +0.08% Â , Sumitomo Corp. 8053, -1.02% Â , Itochu Corp. 8001, -1.43% Â and Marubeni Corp. 8002, -0.88% Â just before the Tokyo stock market opened Monday. Shares in the five companies surged at least 5% and in some cases more than 10%, helping drive the overall Nikkei Stock Average NIK, -0.11% Â up 2% in intraday trading Monday. Berkshire didnâ\u0080\u0099t say how much it spent to acquire the stakes. Based on the companiesâ\u0080\u0099Â Friday closing prices, a 5% stake in each would collectively be worth about $6 billion. The five are often called trading companies, but investment company might be a more precise description. All have stakes in a variety of businesses including interests in energy and mining. Mitsubishi and Itochu each control a major convenience-store chain in Japan. â\u0080\u009cI am delighted to have Berkshire Hathaway participate in the future of Japan and the five companies we have chosen for investment,â\u0080\u009d said Buffett in a statement. He said the five companies â\u0080\u009chave many joint ventures throughout the world and are likely to have more of these partnerships.â\u0080\u009d An expanded version of this report appears on WSJ.com. Also popular on WSJ.com: Warren Buffett and the $300,000 haircut. One of the brains behind Tesla may have a new way to make electric cars cheaper."}]}