{"article": [{"url": "https://www.marketwatch.com/story/vroom-stock-doubles-in-first-day-of-trading-amid-hopes-pandemic-accelerates-online-car-buying-2020-06-09", "published": 1592046380.0, "headline": "Vroom stock more than doubles in first day of trading amid hopes pandemic accelerates online car buying", "body": "Vroom Inc.’s top executive is betting that more people will give online used car-buying a try amid the coronavirus pandemic, and Wall Street, at least on Tuesday, seemed to agree. Shares of Vroom VRM, -0.26%, an online used-car seller, gained 118% on their first day of trading, and the rally continued in the extended session, with Vroom shares up more than 3%. The company has never been profitable since its start in 2012, its dividends are nowhere in sight, and its losses have piled up. The pandemic is a tough time for people in the U.S. and elsewhere, but more U.S. residents are considering Vroom, looking for contactless car shopping and delivery, Vroom Chief Executive Paul Hennessy told MarketWatch. Related:Vroom IPO: 5 things to know about the online used-car seller “We actually have momentum coming our way,” as people are more likely to consider online car shopping at the moment, besides other advantages that Vroom offers, Hennessy said. While Vroom hopes to benefit from a broader shift to online shopping accelerated by the pandemic, the economic uncertainty and turmoil in the car industry could render its business model more challenging. According to Vroom’s prospectus, the company lost $143 million in 2019 and $41.1 million in the first quarter, compared with losses of $85.2 million for 2018 and $27.1 million in the first quarter of 2019. Hennessy, a former Priceline.com chief executive and chief marketing officer of Booking.com, both owned by Booking Holdings Inc., has led Vroom since 2016. He declined to give an specific timeline for Vroom’s profitability, but said the company has a “clear line of sight” to profits once it hits a sales pace of 200,000 vehicles, which it expects to reach “in the coming years,” he said. Vroom sold just under 19,000 vehicles last year. Don’t miss:IPO market gears up for another busy week with 8 deals expected to raise $2 billion The company was “humbled” by the successful initial public offering, and after twice upping the IPO price range it knew investor enthusiasm would be there, Hennessy said. Vroom priced the IPO at $22 a piece. Vroom’s performance is the latest sign of green shoots for the IPO market, with the biggest deal of the year, Warner Music Group Corp. WMG, +0.54% pricing at the higher end of its price range last week. Vroom has a major competitor in Carvana Co., also an online used-car selling platform, which had its IPO in April 2017. Carvana may have spun its wheels on its IPO day, having ended it down nearly 3%, but it has more than made up for the rocky start and has gained more than 900% from its IPO price of $15. Hennessy said that there’s room in the market for more online car sellers, given that the current e-commerce penetration is under 1%. Besides being a contactless option amid a pandemic, customers also praise Vroom’s nationwide car selection, vs. shopping from their local used-car lot; its pricing, which Hennessy called “transparent” and said it avoids haggling, which most customers don’t like; and the shop-from-anywhere aspect of the experience. Vroom, like Carvana, also offers a 7-day return policy on its cars. While it is true that close competitors are doing similar things, the market is so fragmented that in reality Vroom has thousands of competitors in the dealerships scattered across the U.S., not to mention the very large peer-to-peer market, Hennessy said. Only a handful of top players share a small slice of the market, he said. “There’s plenty of runway to disrupt it.”"}]}