{"article": [{"url": "https://www.marketwatch.com/story/the-cyclical-rotation-is-here-jefferies-analysts-say-for-real-this-time-2020-07-21", "published": 1595416820.0, "headline": "The cyclical rotation is here, Jefferies analysts say. For real this time.", "body": "It’s time to rotate, Jefferies analysts say. That is, it’s time to swap growth stocks like technology, which have had a long run up since March, for unloved stocks like cyclicals. It’s an idea that’s emerged over and over again over the past few years — see here and here — only to be abandoned when investors get spooked and retreat back to the familiar growth narrative. But now, Steven DeSanctis and Eric Lockenvitz write, the economic outlook and stock market fundamentals have aligned. Growth stock “valuations are at extremes and economic indicators are turning up, boosting cyclicals,” the analysts write. “These stocks have started to come back to life a bit but remain very cheap with the cyclicals sitting in the single-digit percentiles vs. Growth, Bond Proxies.” “The ISM has made a bottom and is improving along with the PMI and so it has become a better economic backdrop for these stocks,” they added. What’s more, earnings and sales revision trends are getting better for cyclicals, while deteriorating for growth stocks. MarketWatch reported last week that multiple investing industry sources agree that it’s time for investors to consider cyclicals, but not necessarily abandon growth stocks. With that in mind, DeSanctis and Lockenvitz helpfully offer a baker’s dozen of buy-rated stocks from cyclical sectors, which they say have “above-average” return on equity and which have not experienced a downward earnings or sales revision, as noted in the table below. Company Sector ROE Ares Management Corp. ARES, +0.41% Financials 8.6 Core-Mark Holding Co CORE, -0.86% Discretionary 10.6 Deckers Outdoor Corp. DECK, +2.42% Discretionary 25.3 Gentex Corp. GNTX, +0.88% Discretionary 21.9 Lear Corp. LEA, -0.22% Discretionary 15.2 Martin Marietta Materials MLM, -0.98% Materials 11.6 Nordson Corp. NDSN, +0.30% Industrials 21.8 Ollie’s Bargain Outlet Holdings OLLI, +1.49% Discretionary 13.0 Oshkosh Corp. OSK, -0.31% Industrials 18.7 Teledyne Technologies Inc. TDY, -0.11% Industrials 16.0 TopBuild Corp BLD, +1.84% Discretionary 10.6 Western Alliance Bancorp WAL, +0.80% Financials 16.2 Xilinx Inc. XLNX, +14.10% Info Tech 30.6 Source: Jefferies Equity Research Read next:Sustainable-investing flows have smashed records in 2020. What’s going on?"}]}