{"article": [{"url": "https://www.marketwatch.com/story/feds-bullard-doesnt-see-signs-a-damaging-asset-bubble-is-forming-2020-06-23", "published": 1592915240.0, "headline": "Fedâ\u0080\u0099s Bullard doesnâ\u0080\u0099t see signs a damaging asset bubble is forming", "body": "Companies are taking on debt so they can stay in business until the coronavirus pandemic ends but this isnâ\u0080\u0099t a precursor for a dangerous asset bubble forming, said St. Louis Fed President James Bullard on Tuesday. â\u0080\u009cBubbles are always an issue, and I do keep my eye on it, but I am just not seeing things that are on the same magnitude as what happened in the late 1990s, the so-called dot com bubble that blew up on us and then the much more serious housing bubble in the mid-2000s,â\u0080\u009d Bullard said, in an interview on Bloomberg TV. He said that firms were taking on debt to make sure they can â\u0080\u009csurvive and thriveâ\u0080\u009d in a time of low revenue. â\u0080\u009cSo far so good, but we will certainly watch this closely,â\u0080\u009d he said. Bullard said the Fedâ\u0080\u0099s bond-buying wasnâ\u0080\u0099t undermining capitalism by protecting zombie firms. Firms that were viable before the coronavirus are figuring out how to run their businesses in ways to keep everyone healthy, he said. The pandemic was throwing a curve ball to a few businesses, but â\u0080\u009cmostâ\u0080\u009d firms will be up and running after July, he said. There is constant market chatter about bubbles forming as the Fed has cut its benchmark interst rate to near zero and purchased more than $2 trillion in U.S. Treasury debt and agency mortgage backed securities to repair damaged financial markets. Read: Stock market legend Jeremy Grantham says there is a financial bubble that is â\u0080\u0098the real McCoyâ\u0080\u0099 Bullard was skeptical of using a new tool called â\u0080\u009cyield curve controlâ\u0080\u009d under which the Fed would peg yields on longer duration securities. â\u0080\u009cI think there are a lot more questions than answers around yield curve control right now,â\u0080\u009d he said. One of the main concerns is that yield curve control â\u0080\u009cended in tearsâ\u0080\u009d after it was used in World War II, he noted. Fed officials wanted to end the controls after the war but the Truman administration, fearing inflation, resisted until 1951. Bullard suggested yield curve control is not a front-burner issue as the market and Fed are on the same page about the outlook for low interest rates. The Fedâ\u0080\u0099s dot-plot of projected interest rates released earlier this month showed officials expect rates to stay near zero until 2023. â\u0080\u009cI donâ\u0080\u0099t really think this is a pending thing for the committee,â\u0080\u009d Bullard said. The Fed has credibility because it kept interest rates close to zero from the end of 2008 until 2015. The Fedâ\u0080\u0099s 2% inflation target is also credible to the markets , Bullard said, and this will keep inflation relatively close to the target in this recession. Stocks were higher on Tuesday with the S&P 500 index SPX, +0.87% Â up almost 1%."}]}