{"article": [{"url": "https://www.marketwatch.com/story/700000-nyc-public-school-students-to-head-back-to-classrooms-in-september-2020-08-10", "published": 1597076900.0, "headline": "700,000 NYC public school students to head back to classrooms in September", "body": "Three-fourths of all public school students in New York City, roughly 700,000 children, are expected to return to classrooms come September, Mayor Bill de Blasio said on Monday. “We’re the only major school district in America — the only major urban school district planning for in-person classes this fall,” he said at a daily briefing, citing the city’s low viral spread as reasoning for the decision. Parents had to decide by Friday if they planned to send their children back to school or keep them in 100% remote learning. So far, 26% of the district, or more than a quarter-of-million students, have opted to learn from home. The rest will start a so-called “blended learning” model, in which they will go to school two to three times a week on a set schedule and learn remotely the other weekdays. The city’s back-to-school plan is meant to accommodate as many students as space will allow in public school buildings while social distancing. The district’s construction authority has been scrambling to maximize space and find alternative locations to host classrooms with only a few weeks left before schools reopen on Sept. 10. That’s included talks with the Catholic Archdiocese of New York to use some of their former school buildings across the five boroughs, de Blasio said. “Those are the ideal facilities for expanding out,” he said. Friday also marked the deadline by which teachers could request to work remotely, including elderly teachers and those who suffer — or whose loved ones suffer from — other health concerns. About 85% of the teacher workforce, or about 66,000 educators, have said they’ll return, while about 15% have requested reasonable accommodation. Don’t miss:Students get suspended for posting pictures of packed halls — now the high school is closing after 9 people were infected “Those who are granted that accommodation will exclusively teach remotely,” said Schools Chancellor Richard Carranza. Until now, most communication with parents has focused on the generic, districtwide format for learning this fall. By Monday, individual schools will begin to send out much-awaited individualized schedules for students and other school-tailored announcements about their reopening, Carranza said. The number of students that attend classes in person could change, however. The city allows parents to take their child remote at any point. Conversely, parents only have four opportunities during the school year to place a child back in the classroom. It creates the possibility that more families opted in, knowing they could pull out at any time. Be sure to read: Inside the struggle to close the education equality gap exacerbated by COVID-19 In order to build trust with parents, the state has instructed New York City — and four other major school districts — to host at least five remote information sessions in the next two weeks with parents to explain the dramatically altered school year, including issues such as alternative day care arrangements, testing and tracing protocols, Gov. Andrew Cuomo reiterated at his own briefing on Monday. “I had some school districts that said, well, do we have to talk to the parents? Yes, you have to consult with the parents,” Cuomo said. “If the parents don’t agree to send their children back to school, I don’t know how you have school without students.” Coronavirus tally: U.S. cases top 5 million, as global cases near 20 million Cuomo has not commented on which district reopening plans, including New York City’s, have final state approval to move forward. As of Friday, at least 50 plans of the state’s 750 districts were still incomplete or needed changes, the governor said. Another 100 districts had yet to even submit a back-to-school plan to the state Health Department for review as of Monday—most of them smaller school systems. Cuomo said that any district that fails to send in a plan by Friday “can’t open.” Cuomo’s decision on Friday to allow schools statewide to reopen with proper safety measures also paved the way for private and religious schools to open in September."}]}