{"article": [{"url": "https://www.marketwatch.com/story/with-the-big-stock-market-gains-over-its-time-for-some-unusual-coupon-clipping-hsbc-strategist-says-2020-10-09", "published": 1602234500.0, "headline": "With the big stock-market gains over, itâ\u0080\u0099s time for some unusual â\u0080\u0098coupon clipping,â\u0080\u0099 HSBC strategist says", "body": "MARKETWATCH FRONT PAGE Government bonds aren't the hedges they used to be, with monetary policy on steroids, says HSBC Global Asset Management strategist. See full story.Netflix is pushing for huge international expansion after successes with â\u0080\u0098Sex Educationâ\u0080\u0099 and â\u0080\u0098The Crownâ\u0080\u0099 Netflix is set to triple its office space in the U.K., after a string of high-profile successes in the country. See full story.Pelosi rejects idea of a stand-alone fiscal stimulus measures Hopes for a restart of talks over a large scale economic stimulus package, or even more targeted aid for the troubled airline industry, took a big hit Thursday after House Speaker Nancy Pelosi said she still wanted a bigger bargain. See full story. Trumpâ\u0080\u0099s vaccine czar says the first vaccine should be submitted for emergency authorization around Thanksgiving Moncef Slaoui, an immunologist by training and a longtime pharmaceutical executive, is running the Trump administrationâ\u0080\u0099s Operation Warp Speed program to spur development of vaccines on the fastest ever timetable. See full story.Amazon expands its NFL â\u0080\u0098Thursday Night Footballâ\u0080\u0099 programming â\u0080\u0094 will the e-commerce giant buy more NFL rights? The NFLâ\u0080\u0099s â\u0080\u009cThursday Night Footballâ\u0080\u009d game this week between the Tampa Bay Buccaneers and the Chicago Bears will be broadcasting on Fox, NFL Network and for the first time this season, Amazon Prime. See full story.MARKETWATCH PERSONAL FINANCE Self-employed people who use part of their residence to do business or meet with customers can claim deductions. See full story."}]}