{"article": [{"url": "https://www.marketwatch.com/story/apple-stocks-gain-after-analysts-shrug-off-fortnite-china-fears-2020-08-24", "published": 1598273180.0, "headline": "Apple stocks gain after analysts shrug off â\u0080\u0098Fortnite,â\u0080\u0099 China fears", "body": "Apple Inc. shares are rising for the fifth straight trading session after Morgan Stanley analyst Katy Huberty chimed in with an increasingly bullish view of the companyâ\u0080\u0099s prospects. Huberty raised her price target on Appleâ\u0080\u0099s stock AAPL, +1.74% Â to $520 from $431 in a Monday note to clients. The analystâ\u0080\u0099s new target is now higher than all those listed on FactSet. The stock is up about 2% in morning trading. The price-target hike comes amid a strong rally for Apple shares even as the iPhone maker has faced increased pushback from developers over its App Store practices. Epic Games, the developer of â\u0080\u009cFortnite,â\u0080\u009d is suing Apple over what it deems to be â\u0080\u009cmonopolisticâ\u0080\u009d policies on the platform that it says prevent developers from collecting payments using their own mechanisms within apps downloaded through Appleâ\u0080\u0099s App Store. Apple collects up to 30% from purchases made using its payment technology on the App Store. Read more: â\u0080\u0098Fortniteâ\u0080\u0099 maker accuses Apple, Google of illegal monopolistic practices in tech battle royale Huberty wrote that she doesnâ\u0080\u0099t expect â\u0080\u009cany near-term changes to the App Store modelâ\u0080\u009d given that legal battles like this take years and â\u0080\u009cFortniteâ\u0080\u0099sâ\u0080\u009d in-app purchase revenue is immaterial to Appleâ\u0080\u0099s overall top line. She also said that the risk to Appleâ\u0080\u0099s business from the Trump Administrationsâ\u0080\u0099 interest in banning transactions between Tencent Holdings Ltd.â\u0080\u0099s TCEHY, +1.98% 700, +0.84% WeChat and people in the U.S. is â\u0080\u009coverblown.â\u0080\u009d While Huberty said that investors seem concerned that the ban could extend beyond usage in the U.S. and restrict Apple from dealing with WeChat in China as well, which could prompt Chinese iPhone users to switch to other devices, she doubts that Apple will be prohibited from providing WeChat access to Chinese citizens in China. Wedbush analyst Daniel Ives took a similar view in a Monday report. â\u0080\u009cWhile the WeChat ban is within the US (App Store), importantly for Apple we believe Chinese consumers should see no disruption with this app which is key especially heading into the companyâ\u0080\u0099s long awaited 5G iPhone 12 supercycle ready to launch in early October,â\u0080\u009d he wrote. Ives rates Appleâ\u0080\u0099s stock at outperform with a $515 target price. He said he has been â\u0080\u009cseeing considerable strength from the China region over the last few months, a dynamic we expect to continue heading into the next six to nine months.â\u0080\u009d Officials from the Trump administration have reportedly sought to privately reassure tech companies that they will still be able to support WeChatâ\u0080\u0099s China business, according to Bloomberg. Apple shares have gained 58% over the past three months as the Dow Jones Industrial Average DJIA, +0.56% Â has risen 15%."}]}