{"article": [{"url": "https://www.marketwatch.com/story/virgin-galactic-shows-off-interior-of-passenger-spaceship-2020-07-28", "published": 1595957180.0, "headline": "Virgin Galactic shows off interior of passenger spaceship", "body": "LOS ANGELES — Passengers flying Virgin Galactic on suborbital trips into space will be able to see themselves floating weightless against the backdrop of the Earth below while 16 cameras document the adventures, the company said Tuesday. Highly detailed amenities to enhance the customer flight experience were shown in an online event revealing the cabin of the company’s rocket plane, a type called SpaceShipTwo, which is undergoing testing in preparation for commercial service. There are a dozen windows for viewing, seats that will be customized for each flight’s six passengers and capable of adjusting for G forces, and, naturally, mood lighting. iframe.twitter-tweet { width: 100% !important; } Yet designer Jeremy Brown said the passengers’ most lasting impression may come from a large mirror at the rear of the cabin. “We think that there’s a real memory burn that customers are going to have when they see that analog reflection of themselves in the back of the cabin, seeing themselves floating freely in space ... that very personal interaction that they’ll have with the experience,” he said. Virgin Galactic SPCE, -3.12% was founded by British billionaire Richard Branson after the prize-winning flights of the experimental SpaceShipOne in 2004. Branson plans to be the first passenger when commercial flights begin. Like its predecessor, SpaceShipTwo is a rocket plane that is slung beneath a special jet airplane and released at high altitude. After a moment of free fall, the two pilots ignite the rocket and the craft pitches up and accelerates vertically at supersonic speed. The rocket shuts down but momentum carries the craft into the lower reaches of space where it flips upside down so that the windows on the roof of the cabin give a view of the Earth far below. The passengers, clad in space suits designed by Under Armour UA, +0.09% , will be able to leave their seats and float about the cabin, using handholds tested by chief astronaut trainer Beth Moses during Virgin Galactic’s second flight into space last year. The test was aimed at helping finalize the design and at learning how to train passenger astronauts for what they will experience as they become weightless and reach the top of the flight profile, known as its apogee, before the descent begins. Moses said she tested different ways of getting in and out of the seats, moved around the cabin and waved at the mirror, concluding that it was not disorienting. “I also purposely went to a point in the cabin to most dramatically try to enjoy apogee and a view of Earth from the stillness of space,” she said. The passengers will need to return to their seats after a few minutes as the craft reorients and begins to interact with the increasing density of the atmosphere and then glides to an unpowered landing. SpaceShipTwo was developed at Virgin Galactic facilities in Mojave, Calif., and will operate commercially from Spaceport America in southern New Mexico, where passengers will undergo several days of training before their flights. George Whitesides, the former longtime company CEO who is now its chief space officer, said upcoming test flights will include four crew members playing the role of passengers. Whitesides, who will now focus on future technology, recently handed the CEO role to Michael Colglazier, a former president and managing director of Disney Parks International. The company has yet to set a date for flights with paying passengers. The company has said more than 600 people have put down deposits. The initial seats were sold at $250,000 apiece. Whitesides said the cost may increase for a while but the long-term goal is to make the adventure more accessible, possibly at a lower cost."}]}