{"article": [{"url": "https://www.marketwatch.com/story/the-dollar-is-going-to-fall-very-very-sharply-warns-prominent-yale-economist-2020-06-16", "published": 1592901560.0, "headline": "'The dollar is going to fall very, very sharply,' warns prominent Yale economist", "body": "Stephen Roach, Yale University senior fellow and former Morgan Stanley Asia chairman, has a warning for U.S. dollar bulls. The prominent economist says that the era of the U.S. buck may be coming to an end and is forecasting a 35% decline soon in the U.S. currency against its major rivals, citing increases in the nation's deficit and dwindling savings. The lecturer said during CNBC's \"Trading Nation\" on Monday that the rise of China and the decoupling of the U.S. from its trade partners is setting the stage for a dramatic weakening of the U.S. currency in the next few years that is likely to end the supremacy of the monetary unit as the world's reserve currency. \"The dollar is going to fall very, very sharply,\" he told the business network. Roach's comments follow similarly themed op-ed that he wrote in Bloomberg last week, in which he specifically declared that the \"era of the U.S. dollar's 'exorbitant privilege' as the world's primary reserve currency is coming to an end. In that article, the economist said that the U.S. economy is already \"stressed\" by the impact of the COVID-19 pandemic, and suggested that the recession that has gripped the U.S. in February amid the public health crisis will only amplify the dollar's woes. The finance expert said that the rest of the \"world is having serious doubts about the once widely accepted presumption of American exceptionalism.\" On Monday, Roach said that the U.S.'s fiscal deficit, as the government expends trillions of dollars, in an effort to mitigate the harm from COVID-19, may only make matters worse for bucks. Meanwhile, Roach says that China's currency, the yuan USDCNY, USDCNH, -0.71%, may garner increasing appeal from investors, as Beijing goes through a phase of structural reforms that could shift the country's manufacturing-heavy economy to one focused more on services and one with greater consumer-led growth. Roach makes the case that although a weaker dollar, sometimes favored by President Donald Trump, would benefit U.S. exports in the short term, it would prove more problematic over the longer term. One measure of the buck, the ICE U.S. Dollar Index DXY, -0.58%, has been weakening over the past 30 days, down 3.9% but is up slightly on the year, rising 0.1%, according to FactSet data. The index measures the buck against a basket of six rival currencies, including the euro EURUSD, +0.60%, the pound GBPUSD, +0.83% and the yen USDJPY, -0.38%. A weaker dollar has implications for assets and the stock market, including the Dow Jones Industrial Average DJIA, +0.56% and S&P 500 index SPX, +0.87%, with most debts denominated in dollars. In addition, a majority of cross-border financing and international trade are conducted in dollars. Worries about the global economy have traditionally encouraged buying of dollars along with other havens because of the perception of the U.S. as a stable economy and currency. Roach, however, says that growing deficits will eventually change that perception and deliver a gut punch to the greenback. Check out the CNBC interview:"}]}