{"article": [{"url": "https://www.marketwatch.com/story/did-warren-buffett-just-bet-against-the-us-economy-his-latest-investment-raises-some-questions-2020-08-16", "published": 1597591460.0, "headline": "Did Warren Buffett just bet against the U.S. economy? His latest investment raises some questions", "body": "Warren Buffett has long been critical of gold as an investment, saying that it “has no utility” and that the “magical metal” is no match for “American mettle.” He once wrote, “Anyone watching from Mars would be scratching their head” over how we treat the shiny stuff on this planet. Yet the Berkshire Hathaway BRK.A, +0.06% BRK.B, +0.24% boss just acquired nearly 21 million shares of Barrick Gold GOLD, +2.86% worth $563 million, while selling shares of Wells Fargo WFC, and J.P. Morgan Chase JPM, -0.57%, according to 13-F filings released Friday afternoon. The move kicked up buzz among gold bugs and other Wall Street watchers across the internet, who saw Buffett’s trades as perhaps signalling a shift in his views on the market. iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } The popular Zero Hedge blog took a deep dive into Buffett’s repositioning, saying that it’s “a signal that none other than the Oracle Of Omaha appears to now be quietly betting against the United States,” because “the famously anti-gold investor has abandoned banks — the backbone of America’s credit-driven economy — in favor of a gold miner.” Of course, while gold bugs and staunch market bears come up with their own conclusions, Berkshire is still, nevertheless, deep into the banks, including Bank of America BAC, +0.47% , where it’s been pouring its money into over the past month. Mike Shedlock of Sitka Pacific Capital Management took exception to the interpretation of the news, explaining in a blog post that it’s as simple as “Buffet [sic] knows financials are struggling due to COVID. And Barrick pays a dividend.” Furthermore, Barrick is merely a tiny piece of his overall pie, and Buffett didn’t back off his stakes in Amazon AMZN, +3.01% or Apple AAPL, +1.74%. “This is neither a huge cave-in nor a fundamental sea of change regarding gold,” Shedlock wrote. “Potentially it is a short-term sell signal that corresponds to the recent pullback.” Meanwhile, the stock market continues to stalk record highs. The Dow Jones Industrial Average DJIA, +0.56% closed with a 1.8% weekly gain, while the S&P 500 SPX, +0.87% briefly traded at a record before ending the week up less than 1%. The Nasdaq Composite COMP, +1.39% finished barely higher for the week, as well. The index has posted 32 records so far in 2020. Barrick Gold, at last check, was up more than 8% after hours."}]}