{"article": [{"url": "https://www.marketwatch.com/story/in-this-case-losing-apple-as-a-customer-would-be-good-news-2020-06-15", "published": 1592834720.0, "headline": "If Intel lost Apple as a customer, it would be good news", "body": "Over the past year, we have been hearing rumors of Apple’s plans to reduce and/or eliminate its partnership with Intel for CPU chips for its Mac lineup. With Apple’s Worldwide Developer Conference (WWDC) set to begin June 22, these rumors have heated up again, and it’s increasingly looking like Intel will soon find itself outside Apple’s plans for its next-generation Mac. For many, this appears to be bad news for Intel INTC, -1.03%. I disagree. In fact, I believe Intel will be better off without Apple AAPL, +1.74%. Today, Apple represents about 6% of the global PC market based on units sold and accounts for somewhere around 2% to 4% of Intel’s sales. Based on Intel’s trailing 12-month revenue of more than $75 billion, that means the Apple relationship represents between around $1.5 billion and around $3.0 billion in annual sales for the chip maker. This number is significant, but given the overall size of the Intel business, it is hardly insurmountable. Moreover, Apple is a demanding supplier that has a history of putting immense pressure on vendors. We saw this in the 5G modem business — not just with Intel, which sold its business to Apple last year, but also with mobile chip giant Qualcomm QCOM, +2.06%. Without Apple, Intel can focus more attention on where its most significant growth is coming from — its broad data-centric strategy, which incorporates data center, network and Internet of Things (IoT). In the two most recent quarters since divesting the 5G modem business, Intel has delivered strong results, first in its period ending in January 2020 and in the quarter ending in April, when it saw 69% year-over-year earnings growth with 23% revenue growth. Perhaps more important than the overall growth is where the growth is coming from. While the company saw a notable 14% increase in client computing (PC) revenue in the April quarter from a year earlier, it saw much bigger growth in its Data Center Group. Sales reached $7.0 billion in this period — growth of 43% year over year. Within these strong numbers is cloud service providers, where revenue jumped 53% year-over-year while volume and average selling price increased 27% and 13%, respectively. That in itself is impressive given that tech’s usual pricing direction is downward. The recent success is a testament to a more diversified Intel. Its data-centric strategy, which was formally announced in April 2019, has launched or expanded many business areas including storage, memory, artificial intelligence and networking. This has driven the company’s total addressable market north of $300 billion, which is nearly 10 timed the addressable market for Intel’s historic CPU business, which Intel has pegged at $35 billion. Based upon the significant growth of Intel’s Data Center Group in the past two quarters alone, continued attention in this area will bear greater fruit for Intel in terms of revenue and earnings than focusing on Apple could. By diverting more resources away from Apple, Intel can turn its attention to these challenges — especially as global PC demand surges alongside the growing desire to enable employees to work from home even after the coronavirus pandemic recedes. This will mean increased enterprise spend in the data center and the cloud to support workloads, data, AI and security — all of which benefits Intel’s more diverse strategy. The company has also made significant investments to further diversify in areas such as Edge, IoT, Autonomous Vehicles (ADAS) and 5G Networks. These technologies are still early-day for Intel, but already represent a multibillion-dollar revenue stream for Intel and are part of the above-mentioned $300 billion total addressable market. Over the next four quarters, growth in these areas, which is anticipated at a 7% compounded annual growth rate, will also help offset lost revenue from Apple. Apple’s inevitable departure isn’t unfamiliar territory for Intel. Over the past few years, the company has regularly experienced pressure on its business. Between supply constraints, delays in new process technology for its 10nm and 7nm and the rise of stronger competitors in AMD, Qualcomm and ARM, it has become popular to bet against Inte. So far those bets have been losers. ARM and its Windows on ARM always-connected PCs have been slow to gain market adoption despite early enthusiasm. AMD has made small bites into Intel’s client computing and data center business; however, Intel has maintained strong market positions in both areas despite the increased competition and AMD’s innovative offerings. I believe Intel was aware and has been planning for this moment as Apple has continued its vertical integration in its iPhones and iPads over the past few generations. Overall, despite a lot of strong headlines, Apple leaving Intel really isn’t a big deal. Even in just a year, we’ll look back on this and say it actually was good for Intel, much like its 5G modem exit last year has proven to be. Daniel Newman is the principal analyst at Futurum Research. Follow him on Twitter @danielnewmanUV. Futurum Research, like all research and analyst firms, provides or has provided research, analysis, advising, and/or consulting to many high-tech companies in the tech and digital industries. Neither he nor his firm holds any equity positions with any companies cited."}]}