{"article": [{"url": "https://www.marketwatch.com/story/should-black-and-latino-people-get-priority-access-to-a-covid-19-vaccine-2020-07-16", "published": 1599465500.0, "headline": "Should Black and Latino people get priority access to a COVID-19 vaccine?", "body": "As the U.S. government prepares to deploy a COVID-19 vaccine once it becomes available, public-health experts are mulling which groups of people should get early doses. And some, including philanthropist Melinda Gates, have weighed a controversial idea: moving people of color, whose communities have been disproportionately stricken by the disease, toward the front of the queue. The U.S. Centers for Disease Control and Prevention told states recently that they should be ready to distribute a coronavirus vaccine by Nov. 1. And in one of three planning documents first reported by the New York Times, the CDC told health officials in states, territories and five big U.S. cities to “identify and estimate sizes of critical populations, particularly those to receive first available doses,” as well as other groups that might need special consideration for distribution and expanded access. Those populations include essential workers working in sectors such as health care, national security, education and food; people living in group settings; people at heightened risk for severe COVID-19 illness, including those aged 65 and older, people with underlying conditions, tribal community members, residents of long-term care facilities, and “people from racial and ethnic minority populations,” according to the document. Research shows that Black and Latino people bear a disproportionate share of COVID-19 illness and death in the U.S. People of color are also overrepresented in essential jobs that require them to work outside the home. They are more likely to have underlying health conditions that can lead to more severe cases of the coronavirus, less likely to have health insurance, and more likely to report experiencing discrimination within the health-care system. Meanwhile, the National Academies of Sciences, Engineering and Medicine released a draft framework this week for how to equitably allocate a vaccine. The experts who compiled the 114-page draft, co-sponsored by the CDC and soliciting public comment through Sept. 4, said they had opted to focus on the underlying causes of racial and ethnic COVID-19 disparities rather than on “discrete racial or ethnic categories.” “Currently there is little evidence that this is biologically mediated, but rather reflects the impact of systemic racism leading to higher rates of co-morbidities that increase the severity of COVID-19 infection and the socioeconomic factors that increase likelihood of acquiring the infection, such as having front line jobs, crowded living conditions, lack of access to personal protective equipment, and inability to work from home,” the National Academies said in a press release. In response to a request for comment on an earlier New York Times report about discussions of prioritizing Black and Latino Americans in an eventual vaccine rollout, CDC spokeswoman Jasmine Reed in July highlighted the agency’s Advisory Committee on Immunization Practices (ACIP), “the federal advisory board, consisting of scientific and medical experts from across the country, that makes recommendations to the agency’s director on the routine use of vaccines.” “The ACIP board has created a work group to review data on COVID-19 vaccine candidates and consider a recommendation to CDC,” Reed told MarketWatch. “A portion of the group’s work will involve determining if there are priority groups that should get vaccinated based on occupation, risk of serious outcomes and health disparities.”‘Race is just a proxy’ None of the experts who spoke with MarketWatch in July advocated for prioritizing vaccine access based solely on race and ethnicity. But some saw value in considering race as an indicator for other factors, such as income and education, that aren’t readily apparent in the data being collected. Monica Peek, a University of Chicago associate professor of medicine who researches health disparities, said she favored first vaccinating the populations that have been hardest hit by the coronavirus and are at increased risk for exposing others. “ ‘Race is just a proxy for the social conditions and the structural racism and interpersonal racism that puts people at increased risk for the coronavirus.’ ” — Monica Peek, a University of Chicago associate professor of medicine who researches health disparities That means people living in congregate living facilities such as nursing homes and prisons, essential workers without the ability to work from home, and, yes, racial and ethnic minorities living in densely populated areas that make it difficult to practice social distancing, she said. Public-health professionals now know “that the coronavirus has disproportionately ravaged its way through marginalized communities,” she said. But it’s important for people to understand why race should be a factor, Peek added — after all, it’s not the color of a person’s skin that puts them at increased risk for COVID-19. Rather, their brown or Black skin puts them at increased risk for racism, which in turn puts them at greater risk for the virus, she said. “Race is just a proxy for the social conditions and the structural racism and interpersonal racism that puts people at increased risk for the coronavirus,” Peek said. “The reason that race enters the equation is because of the increased risk for exposure to the coronavirus in the first place — not because we’re saying that brown and Black people in and of themselves deserve extra benefits.” Melody Goodman, the associate dean for research and an associate professor of biostatistics at the NYU School of Global Public Health, who studies health disparities, also said she wouldn’t base vaccine prioritization on race and ethnicity alone. But she agreed that race could serve as a proxy for other data points that aren’t available, such as income, education and racism — one “quick question” that helps get at other questions. “It’s all of those things that we know correlate with race, but it’s not someone’s racial or ethnic makeup,” Goodman said. “But the way our society is set up, if you said race, you probably have a good bucket of people who are vulnerable.” If Goodman were in charge of implementing an early COVID-19 vaccine rollout, she said, she would use a place-based approach — likely at a ZIP-code level — that targeted low-income and medically underserved communities; communities with a high proportion of racial and ethnic minorities; and prisons, nursing homes and other densely populated institutionalized settings. She would also target jobs in which workers’ frequent movements help the virus spread more easily, such as meatpacking workers, delivery drivers, postal workers and transit workers. “It just so happens that a lot of these workers are Black and brown, not that there’s not non-minorities in these groups,” Goodman said.Prioritizing COVID-19 vaccine access by race or ethnicity could create stigma Georges Benjamin, the executive director of the American Public Health Association and former secretary of the Maryland Department of Health and Mental Hygiene, said he believes fast-tracking vaccine access solely by race and ethnicity could be “stigmatizing” and might not result in the right groups being prioritized. “ ‘It’s stigmatizing to the African-American community to say we’re more risky because of who we are than what we do.’ ” — Georges Benjamin, the executive director of the American Public Health Association “It says that people are at risk because of their skin color, which isn’t the case — they’re at risk because they have public-facing jobs, chronic diseases, and other social determinants that put them at risk,” Benjamin told MarketWatch. “And we have to be very careful — this is not a Black disease. People should not be concerned about African Americans being more infectious than anybody else.” In other words, “it’s stigmatizing to the African-American community to say we’re more risky because of who we are than what we do,” Benjamin said. Instead, he said, he would prioritize access based on risk factors such as occupation, susceptibility to disease, age and income, and identify health-care providers and delivery systems that are more likely to serve those populations. Swapna Reddy, a clinical assistant professor at Arizona State University’s College of Health Solutions who researches how to reduce health disparities, said that while she thought the conversation around race and ethnicity was well-intentioned, it painted the problem with too broad a brush. It’s more important to look upstream at the factors that put many people of color at greater risk for hospitalization and death from COVID-19 in the first place, she suggested, such as overrepresentation in low-wage jobs that offer less opportunity for social distancing; preexisting health conditions; and social determinants like poor access to health care and preventive care, food deserts and substandard housing. “That’s where the inequity originates, and that’s really, to me, the conversation that’s more important,” Reddy said. “If we have a real intention to actually do something now, especially also as we’re having these larger conversations nationally about systemic racism [and] systemic inequities, then we have to make the changes at the systemic level — or we’re just going to continue to experience all of these inequities on loop.” (Some Native American communities, including in Reddy’s home state of Arizona, have also been particularly hard hit by the pandemic, she pointed out.) In the present, Reddy said she would focus on implementing available and evidence-based harm-reduction methods, testing, and ensuring accessible and affordable health care in these communities. She would also provide “support for concurrent other disparities taking place and exacerbated by the fallout from the pandemic,” such as food, housing and child care, and connect people with other available safety-net programs, she said. Both Benjamin and Reddy also suggested that early access to a COVID-19 vaccine could make racial and ethnic minorities feel like they’re the subjects of an experiment. “I’m very cringey at this suggestion regarding giving the vaccine that hasn’t been distributed at the population level to brown and Black folks,” Reddy said. “As well-intentioned as it might be … it almost feels like it’s being tried out on them.”Black Americans have longstanding mistrust of the health-care system Black Americans’ mistrust of the health-care system has been “well-earned,” Peek said, and isn’t limited to the lasting impact of the 1932 to 1972 Tuskegee experiment, during which the U.S. government allowed Black men to die from syphilis after withholding treatment. Peek points to J. Marion Sims, the so-called father of gynecology, who during the 19th century experimented on enslaved Black women without using anesthesia. There are more recent examples, she added, such as COVID-19 prison conditions for incarcerated Americans, who are still disproportionately Black and brown — and, reportedly, the use of Oregon prison labor to clean laundry from medical facilities. “ ‘I am concerned about the distrust, rightfully so, that Black and brown communities have in our government and how disenfranchised some communities feel from our government at the moment — particularly if our government is going to be the one to push for people to take the vaccine.’ ” — Melody Goodman, an associate professor of biostatistics at the NYU School of Global Public Health Meanwhile, some 49% of U.S. adults on average say they would get a COVID-19 vaccine if it became available, according to an AP-NORC poll conducted in May. But just 25% of Black people and 37% of Hispanic people say they would get the vaccine, compared with 56% of white people. “I am concerned about the distrust, rightfully so, that Black and brown communities have in our government and how disenfranchised some communities feel from our government at the moment — particularly if our government is going to be the one to push for people to take the vaccine,” Goodman said.Any COVID-19 vaccine needs a strong educational campaign “We can make a great vaccine, but if we don’t have the community buy-in — people willing to take that vaccine — we actually don’t have a great vaccine,” Goodman said. That means that once a safe, effective vaccine is developed, there must be a substantial public-health investment in educational campaigns that explain the vaccine’s safety profile and side effects; who should get it; and whether the drug has been tested on people of different races and ethnicities, ages and body compositions, said Goodman, who also recommended offering the vaccine for free. These campaigns should explain what a vaccine is, how it’s produced, what it prevents from happening, and how it’s delivered, Benjamin added. At the same time, public-health officials will be up against broader anti-vaccination sentiment in the U.S., Goodman said, as well as existing skepticism and misconceptions about the influenza vaccine. “This whole environment of not trusting the media, not trusting scientists — it could really backfire on us when it’s time to roll out a vaccine,” she said. Especially in densely populated areas like New York City, where Goodman lives, COVID-19 has demonstrated how interconnected people are with one another, she said — and “if communities of color don’t get [a vaccine], it’s not just going to be communities of color who are affected.” Consider, for example, that people of all races and socioeconomic backgrounds ride the subway. “It’s not going to work if only the rich people get vaccinated,” Goodman said. “If everyone’s not protected, then no one is really protected.” This story was originally published on July 16, 2020 and has been updated."}]}