{"article": [{"url": "https://www.marketwatch.com/story/cruise-operators-took-a-deep-bruising-from-covid-19-but-history-says-they-will-recover-2020-08-28", "published": 1598857340.0, "headline": "Cruise operators took a deep bruising from COVID-19, but history says they will recover", "body": "This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. The cruise industry was among the industries rocked hardest by the COVID-19 pandemic, with many fearing the virus could leave a permanent bruise on a sector with a history of onboard illness outbreaks. But it’s exactly that history that suggests this time won’t be different, and cruising will eventually flourish again. Cruise operators have a number of variables to worry about during non-outbreak periods, including fuel costs, weather, the economic cycle, fluctuations in foreign currency rates, foreign port availability, the limited number of usable shipyards, and regulatory restrictions. Throw in a disease outbreak, much less a global pandemic, and it’s easy to question why anyone would get into the business. “ “What has been demonstrated time and time again, from various outbreaks and epidemics, is that people have a short memory.” ” — Dr. William Lang, chief medical officer of WorldClinic and former director of the White House Medical Unit. As an example of the risks to cruise company’s business, the “risk factor” section of S&P 500 index component Royal Caribbean Group’s RCL, +2.59% latest 10-Q quarterly filing is 14 pages long. In comparison, the risk factor section in the latest 10-Q of Apple Inc. AAPL, +1.74%, is less than half a page. Royal Caribbean’s second-quarter revenue plunged 94% from a year ago, while fellow S&P 500 component and cruiser Carnival Corp.’s CCL, +0.51% revenue for the quarter ended May 31 tumbled 85%. Neither company has responded to a request for comment. What has been demonstrated time and time again, from various outbreaks and epidemics, is that people have a short memory. Take 2019 as an example. Even after a year that saw a shipyard accident that reduced the earnings outlook, a gastroenteritis outbreak, a Trump administration ban on cruises to Cuba, worries of rising fuel costs after an attack on a Middle East oil refinery and a negative earnings effect because of Hurricane Dorian, Royal Caribbean’s stock still managed to reach a record close on Jan. 17. The stock has tumbled 47.5% year to date through Friday. Carnival shares have shed 66.1% this year, while the S&P 500 SPX, +0.87% has gained 8.6%. This difficulty in running the business can be viewed as a positive, because it raises the barriers to entry. But more important, like the hotel industry, cruising satisfies a couple of basic human wants, to be social and to get away, and it does both at the same time. This not only encourages customers to forget outbreaks, it also makes them very loyal. Don’t miss: COVID-19 hit the hotel industry hard. Here’s how hotels are pivoting in the new reality. Dr. William Lang, chief medical officer at WorldClinic and a former director of the White House Medical Unit, said it’s important to separate the cruise industry from the rest of the travel industry during the current COVID crisis. A cruise ship is “substantially different” than a dry land environment, he said. Add to that the possibility of being trapped at sea, if another onboard outbreak occurs. But that hasn’t stopped people from taking cruises after disease outbreaks in the past. “What has been demonstrated time and time again, from various outbreaks and epidemics, is that people have a short memory,” Lang told MarketWatch. Although an element of fear will likely drive down bookings for future cruises in the near term, given uncertainties over the duration of long-term effects of the COVID-19 virus, “that will pass,” Lang said. “People will tend to forget about it. It’s a time-limited phenomenon on cruises.”Unknown unknowns One problem with expecting an eventual rebound, is how can you do that before you even know when cruise ships can start sailing again? What makes the cruise industry different that others in the travel business, is that the U.S. government’s Centers for Disease Control and Prevention (CDC) has direct control over when ships can set sail. Last month, the CDC announced the extension of its “No Sail Order” through Sept. 30. But that doesn’t mean cruises will depart the day after. The CDC said its order followed data showing there were 99 outbreaks of COVID-19, or COVID-like illness cases, on 123 cruise ships during the period of March 1 through July 10. Don’t miss: Cruise stocks fall as CDC extension of no-sail order could be just the beginning. “Now, since the crisis began, we extended our suspension of operations seven times, now through Oct. 31 for most voyages,” said Royal Caribbean Chief Executive Richard Fain in a call with analysts on Aug. 10. “But it’s fair to say there is still a lot of uncertainty.” Carnival’s Italy-based cruise operator Costa Cruises is planning to gradually restart operations on Sept. 6, but its Holland America line is extending its halt on cruises through Dec. 15. Despite all this concern and uncertainty, the customers remain loyal. Royal Caribbean has said bookings for 2021 are “trending well,” and are within historical ranges, and Carnival said it “continues to see demand for new bookings for 2021,” despite a substantial reduction in marketing. Cruise companies are considering many changes in how passengers are boarded and to the onboard experience, to make their guests feel safer. Dr. Andrew Coggins, Jr., a professor at Pace University’s Lubin School of Business, said cruises will be cleaning more, reducing capacity, spacing out the restaurant, beefing up the filtration systems and using ultraviolet cleaning tools. The buffet, a longtime favorite of cruisers, may “go away altogether.” As WorldClinic’s Dr. Lang says, buffets are a great way to pass viruses and other respiratory diseases. But he said that’s an easy fix for a cruise line, as it can move from an open buffet to a cafeteria-like line, or a conveyor belt that passes trays past different food stations. “Those are just examples of what can be done that don’t significantly change the experience, but can allow for decreased risk of exposure,” Lang said. Another way to reduce the risk is to use technology to help disperse people throughout the ship, even before they gather. Nadir Ali, CEO of Inpixon, an indoor intelligence company, is working with cruises and hotels to do just that. The Inpixon app works like a Waze GPS for an indoor environment, as it allows cruise operators to manage density by showing where the traffic is, and allows users to avoid crowded walkways and eating areas. “People are going to get out of their homes, [so] how do you make them feel safe?” Ali said in an interview with MarketWatch. “You provide technology that allows people to see where you are and where you’re going.” Like other industries using technology-based solutions to make a post-COVID world more contactless and efficient, guests will probably start to like using it, and miss it when they can’t: “Safety may be the driver, but it certainly becomes a convenience tool,” Ali said. Read also: ‘It’s unlikely we can prevent widespread transmission of COVID-19 between students if our undergraduates return to campus’: College students on an unusual fall semester."}]}