{"article": [{"url": "https://www.marketwatch.com/story/its-time-for-investors-to-divest-from-companies-that-profit-from-mass-incarceration-and-cheap-us-prison-labor-2020-06-29", "published": 1593535340.0, "headline": "It's time for investors to dump shares of companies that profit from mass incarceration and prison labor", "body": "“ From exploiting unpaid or cheap prison labor to price gouging basic necessities - companies continue to profit as incarceration rates increase. ” In the wake of the murders of George Floyd, Breonna Taylor and Ahmaud Arbery, and the resulting widespread calls to defund police, investors are scrambling to figure out how to create portfolios that support racial equity. For example, Calvert Research & Management, an industry leader in ESG (Environmental, Social, and Governance) investing, recently made a commitment to push companies to disclose racial diversity data. This is a great first step, but more must be done. Investors cannot have a conversation about racial equity without talking about mass incarceration and the U.S. prison industrial complex. The U.S. has 20% of the world's incarcerated population - but less than 5% of its citizens. The mass incarceration crisis disproportionately impacts Black Americans - there's a reason it's called the \"new Jim Crow.\" Many companies have a direct financial incentive to keep this unjust system in place. From exploiting unpaid or cheap prison labor to price gouging basic necessities - companies continue to profit as incarceration rates increase. This is not a small problem; more than 4,000 companies have benefitted from this injustice. Read: How America perfected the 'art of demonizing Black men' Investors can help dismantle the prison industrial complex - and given the profits many shareholders already have made off of this system, they have a responsibility to do so. Our team at FreeCap helps investors move their money out of prisons and into companies with solutions to mass incarceration. Here are steps we recommend investors can take to reduce the harm caused by mass incarceration: Divest from the prison industrial complex: For starters, it is time to completely divest from private prisons. Geo Group GEO, -0.17%  and CoreCivic CXW, -0.87%  , the two U.S. based publicly traded private prison companies, explicitly identify a reduction in incarceration rates as a material risk in their annual reports. Any company whose financial model is built on the exploitation of Black and Brown communities is not worth saving. Shareholders of these two stocks, including the two largest - mutual-fund and exchange-traded fund providers Vanguard Group and BlackRock - BLK, +1.18%  should divest from these companies. Thanks to mobilization efforts by groups including Dream Defenders and the  Families Belong Together coalition, many Wall Street banks are in fact ending financing arrangements with the private prison industry, including CoreCivic and Geo Group. JP Morgan Chase JPM, -0.57%  , Wells Fargo WFC,  , Bank of America BAC, +0.47%  , SunTrust Banks , BNP Paribas BNP, -1.30%  and Barclays BCY, +0.49%  have all agreed to cut ties. Some banks still have previously existing lending agreements in place that they have committed to not renewing. For example, Bank of America made its commitment weeks after signing a $90 million deal that goes through 2024. It is time for banks that lend to CoreCivic and Geo Group - namely Regions Financial RF, -1.91%  , Citizens Financial Group CFG, -2.10%  Pinnacle Bank PNFP, -0.87%  , First Horizon Bank and Synovus Financial SNV, -1.77%  - to do the same. But the prison industrial complex is much larger than just private prisons. Other publicly traded companies' revenue growth depends on increasing incarceration. For example, Fairfax Financial Holding FRFHF, +0.54%  and Tokio Marine Holdings TKOMY, -0.48%  own two of the largest bail bond insurers in the U.S. Meanwhile, Aramark ARMK, +0.74%  provides food vending services to prisons - and is cited widely for its poor services and use of prison labor. Keefe Group, iCare (a subsidiary of Aramark), and Securus Technologies have secured monopoly vending contracts with corrections departments - and charge predatory prices to incarcerated people and their loved ones for basic necessities, such as telephone calls, toiletries and care packages. Many of these companies are unreceptive to shareholder engagement or advocacy and also warrant divestment. Divestment is a helpful first step - but it cannot stop there: For the vast majority of companies engaged in the prison industrial complex, revenue from prisons is a small percentage of their overall revenue stream (though their involvement plays a big role in fueling the system). So with the right mix of shareholder engagement and alignment from investors committed to ESG principles, investors can pressure these companies to cease doing business with the prison industrial complex and implement policies to help end mass incarceration. Coalitions including the Interfaith Center on Corporate Social Responsibility (ICCR), and advisors including Candide Group, North Star Asset Management and Zevin Asset Management, are leading the charge in this area. What investors can do Here are three ways investors can push companies to do better: 1. Monitor supply chains for prison labor: Enabled by the prison-labor carve-out to the Thirteenth Amendment's ban on slavery, there are companies using prison labor and paying incarcerated workers pennies per hour of work. Investors should be concerned with the long-term reputational risk this practice poses to their portfolio. In the 1990's, both Starbucks SBUX, +0.53%   and Victoria's Secret (now owned by L Brands LB, -0.98%  ) employed prison labor through third-party contractors. Nearly three decades later, the companies have yet to shake the negative reputational consequences; both are still named in lists of companies that use or have used prison labor. In 2015, \"Orange is the New Black\" - the Emmy award-winning Netflix series about a women's prison - included prisoners sewing lingerie for Victoria's Secret as a storyline. And Starbucks had to issue a statement disclaiming its reliance on prison labor. As public opinion continues to shift, the reputational risk to companies using prison labor will only continue to grow. Companies must ban unpaid and below-market-rate prison labor in their supply chain and hire an external auditor to ensure compliance. “ Formerly incarcerated job seekers make better employees. ” 2. Become a leader in fair chance hiring: Many companies that use prison labor in their supply chain frequently deny those same people quality employment opportunities when they are freed. Almost 75% of formerly incarcerated individuals are still unemployed a year after release. The private sector has a responsibility to solve this crisis. Beyond the moral obligation, it makes good business sense. A recent report by the ACLU makes it clear that formerly incarcerated job seekers make better employees. Private companies such as Total Wine & More, Dave's Killer Bread and Butterball Farms are leading the way in this area through hiring policies that reduce discrimination. Plus, organizations including R3 Score and the Center for Employment Opportunities are making it easier for employers to implement fair chance hiring practices. 3. Use corporate social responsibility to reduce recidivism: Employment is one of the most crucial components of reducing recidivism, and companies can put their corporate social responsibility dollars to work in this area. Slack Technologies WORK, +3.36%, for example, collaborated with The Last Mile to create The Next Chapter - an initiative that teaches coding in prisons with the goal of transitioning students to full-time employment opportunities when returning home. More initiatives like this are needed. If companies' recent public expressions of solidarity with Black liberation are genuine, then there is an unprecedented opportunity for investors to use their influence to help them get it right. Ending the influence of the prison industrial complex is mission-critical to racial justice, and asset owners are uniquely situated to make sure this moment sparks a movement for lasting change. Tanay Tatum-Edwards is the founder and CEO of FreeCap Financial, a financial data provider of socially responsible investing criteria to help investors divest from the prison industry and adopt alternatives to mass incarceration. More: America's prison business thrives as pandemic ravages economy Plus: Black tech workers hope nationwide protests will force industry to be more inclusive"}]}