{"article": [{"url": "https://www.marketwatch.com/story/google-oracle-face-off-in-supreme-court-in-largest-software-development-case-ever-11602092309", "published": 1602078380.0, "headline": "Google, Oracle face off in Supreme Court in largest software development case ever", "body": "Google, Oracle clashed at the U.S. Supreme Court on Wednesday. Getty Images Alphabet Inc.’s Google and Oracle Corp. took their decadelong, multibillion-dollar copyright case to the U.S. Supreme Court on Wednesday, each arguing the future of innovation hinges on its outcome. The highly technical case centers on how Google GOOGL, +1.82% GOOG, +1.97% used code to create its popular Android mobile operating system. Oracle ORCL, +0.42% claims Google stole 11,500 lines of code originally written by Sun Microsystems Inc. for its Java application programming interface. Oracle acquired Sun in 2010 and filed suit shortly thereafter. Google counters the code is not subject to copyright protection under the Copyright Act’s exception for fair use. The intricacies and nuance of the dispute prompted a flurry of questions from the eight justices, many of which attempted to clarify the case and its impact on software development and coding. “The fear is that the sky will fall if you lose,” Associate Justice Brett Kavanaugh said to Google attorney Thomas Goldstein. About 90 minutes of oral arguments were made via teleconference because of the coronavirus pandemic. A decision is expected next year. As in previous legal skirmishes in lower courts, the two tech behemoths reaffirmed their underlying arguments. “Strong intellectual property protection is the cornerstone of American innovation. We are confident the Supreme Court will agree with us that all software is covered by copyright and that Google’s copying for its own commercial advantage and expediency can’t possibly be fair use,” Oracle General Counsel Dorian Daley said in a statement Wednesday. “We spoke for software developers, computer scientists, businesses and consumers who support software innovation. Developers want to create applications that work across platforms, without fearing that companies will misuse copyright law to block interoperability,” a Google spokesman said. The case, which has bounced among lower courts for years, has drawn the interest of some of the biggest names in tech, who have aligned on each side of the dispute. Microsoft Corp. MSFT, +2.48% has submitted a brief in support of Google, warning Oracle’s suit “threatens modern paradigms of software development.” The Justice Department has sided with Oracle, on the grounds that Microsoft and Apple Inc. AAPL, +1.74% were able to create mobile operating systems without using Oracle’s code."}]}