{"article": [{"url": "https://www.marketwatch.com/story/pence-misleads-on-biden-harris-fracking-stance-and-viewers-ask-what-is-fracking-again-11602175618", "published": 1602166520.0, "headline": "Pence misleads on Biden-Harris fracking stance, and debate viewers ask, â\u0080\u0098What is fracking, again?â\u0080\u0099", "body": "Vice President Mike Pence debated Democratic rival Sen. Kamala Harris on the controversial practice of fracking and other climate-change policy proposals that divide the parties. Alex Wong/Getty Images The Biden-Harris campaign has been treading carefully around the controversial process of fracking because of the jobs it provides in key swing states such as Pennsylvania. Such care has earned the ticket criticism at times for lack of clarity, including in a Pittsburgh Post-Gazette editorial. Google search results from Wednesdayâ\u0080\u0099s vice-presidential debate also reflected confusion and curiosity from viewers, who queried on â\u0080\u009cfrackingâ\u0080\u009d and sought a refresher on the â\u0080\u009cGreen New Deal,â\u0080\u009d which has effectively become shorthand for any climate-change proposal by Democrats. Vice President Mike Pence ventured to clear up his opponentsâ\u0080\u0099 position on fracking and climate change during Wednesdayâ\u0080\u0099s head-to-head for the presidential running mates. But his take, and an even harsher rehash by President Trump early Thursday, donâ\u0080\u0099t pass fact-check muster. â\u0080\u009cThis monster, she says no, no there wonâ\u0080\u0099t be fracking,â\u0080\u009d Trump said early Thursday of Harris when calling in to Fox Business a day after Pence claimed from the debate stage that his opponents would ban the drilling practice that has helped push the U.S. toward a more dominate position against global energy heavyweights Saudi Arabia and Russia but has proven unstable at times. â\u0080\u009cThey want to bury our economy under a $2 trillion Green New Deal. [They] want to abolish fossil fuels, and ban fracking, which would cost hundreds of thousands of American jobs all across the heartland,â\u0080\u009d Pence said in answering a debate question not on climate change but on the COVID-19 economic recovery. â\u0080\u009cI will repeat, and the American people know, that Joe Biden will not ban fracking,â\u0080\u009d Harris answered Wednesday. â\u0080\u009cThat is a fact.â\u0080\u009d Read: Hereâ\u0080\u0099s where Trump and Biden stand on climate change Biden hasnâ\u0080\u0099t proposed banning fracking overall, rather new exploratory fracking on protected land, but his campaign has had to clarify that position. The bulk of fracking, which uses high-pressure water to expel deep underground oil and creates the byproduct natural gas, takes place on private land. Michigan, Ohio and the Dakotas also have a stake in the fracking debate. Biden has not pushed abolishing fossil fuels in the near term but has promoted a cleaner U.S. energy basket that will push the nation toward net-zero emissions from power plants by 2035, he claims. Biden has at times latched on to the â\u0080\u009cGreen New Dealâ\u0080\u009d buzzphrase, while also calling out his own policy differences from the aspirational framework that stalled in a divided Congress. One key difference is Bidenâ\u0080\u0099s willingness to keep some drilling in the mix alongside solar, wind and other energy generation. Read: â\u0080\u0098Scienceâ\u0080\u0099 itself is on the ballot, so this 175-year-old institution makes its first ever endorsement for president Pence, critics said, did not fully answer the question later as to whether he thought climate change presented an existential threat requiring emergency action, reviving long-running criticism from some that the administration tacks toward climate-change â\u0080\u009cdenial.â\u0080\u009d Thatâ\u0080\u0099s despite the science around the topic and the position of some key Republican lawmakers and mostly younger conservative voters who want a diverse energy mix that doesnâ\u0080\u0099t favor fossil fuels over other options. One group, the right-leaning Citizens for Responsible Energy Solutions, said Penceâ\u0080\u0099s willingness to address climate change is significant and that the country needs to move with reachable actions. â\u0080\u009cRepublicans are asked time and time again whether they believe in some aspect of climate science in order to try and paint them as out of touch with the general public. Vice President Pence did not take the bait. He spoke plainly, eloquently and honestly about American leadership in clean air, clean water, lowering emissions, improving our national parks and bringing back American power in global energy markets,â\u0080\u009d said Heather Reams, executive director at CRES. â\u0080\u009cHe talked about American innovation, fracking and natural gas as key enablers for emissions reduction, and driving our leadership in climate-change mitigation. â\u0080\u009c â\u0080\u009c70% of Americans believe we should be part of the Paris Climate Agreement. So Pence can go on trash talking it. â\u0080¦ [I]tâ\u0080\u0099s only going hurt them with voters,â\u0080\u009d tweeted Jamie Henn, director of Fossil Free Media and co-founder of the international climate-change movement 350. â\u0080\u009cAll the more reason why Harris, Biden, and all Dems should play better OFFENSE on climate.â\u0080\u009d Harris, meanwhile, her critics said, still wasnâ\u0080\u0099t direct enough in talking about the Green New Deal, drawn up in 2019 by Rep. Alexandria Ocasio-Cortez and Sen. Edward Markey but never formally proposed as legislation. Some Pennsylvania voters interviewed Thursday morning by MSNBC said they feel Harris hasnâ\u0080\u0099t been clear on fracking previously. Harris, before joining the Biden team, was a congressional sponsor of early versions of the Green New Deal from her partyâ\u0080\u0099s progressive arm. â\u0080\u009cFracking is bad, actually,â\u0080\u009dÂ tweetedÂ Ocasio-Cortez, the New York Democrat, on Wednesday night, as Harris made her counter to Pence. The topic, a big piece of sweeping environmental policy, has found traction as the Nov. 3 election nears. The search phrase â\u0080\u009cWhat isÂ fracking?â\u0080\u009d spiked by 4,150% in the first hour of the debate Wednesday, Google data showed. And U.S. search interest for the topic â\u0080\u009cGreen New Dealâ\u0080\u009d spiked 5,000%. Fracking, also called hydraulic fracturing, has contributed to historically plunging natural-gas prices that save on energy costs for U.S. homes and businesses. But extraction uses large amounts of water, which must be transported to the site. Some evidence points to increased earth tremors, while potentially carcinogenic chemicals may escape during drilling and contaminate groundwater. Methane can also leak at the capture site. Other climate issues continue to be informally debated, often outside of science and policy proposals. Some Republicans have also claimed that their rivals would ban emitters cows and planes, an unfounded claim. Republicans say Democrats are generally too pessimistic, which slows action on energy policy. The pressure is on both parties to lead as economic rival China has become more aggressive in its climate-change pledges, as have many major corporations, including Walmart WMT, +1.00%, and investing giants like BlackRock BLK, +1.18%, in recent weeks and months."}]}