{"article": [{"url": "https://www.marketwatch.com/story/more-than-1-in-5-college-students-wont-be-enrolling-in-college-this-fall-2020-08-19", "published": 1597840220.0, "headline": "More than 1 in 5 college students wonâ\u0080\u0099t be enrolling in college this fall", "body": "Many students are taking a pandemic gap year. More than one in five college undergraduates donâ\u0080\u0099t plan to enroll this fall, according to a new College Reaction/Axios poll of about 800 students taken Aug. 16-17. And 85% of those surveyed believe they are likely or very likely to be exposed to the novel coronavirus that causes COVID-19 if they are on campus. Thatâ\u0080\u0099s not too surprising, as coronavirus outbreaks have been reported across several universities that just recently reopened. Four colleges and universities suspended in-person classes already this week, including Notre Dame and the University of North Carolina, after reporting clusters of dozens of students and faculty testing positive for COVID-19. Read more:Notre Dame and University of North Carolina abandon in-person classes after COVID cases grow â\u0080\u0094 and outbreaks are happening at several other campuses The schools that are reopening their campuses have been strategizing how to bring students back safely since the spring, cobbling together heightened sanitation measures, mask mandates, smaller class sizes, limiting the number of students living on campus, and rolling out hybrid curricula mixing in-person and online learning sessions. And some, including Penn State, are asking students to sign agreements akin to liability waivers that acknowledge the students are assuming the risk of contracting COVID-19 by participating in school activities, which has raised some eyebrows. No wonder 22% of college students longing for a â\u0080\u009cnormalâ\u0080\u009d on-campus experience are choosing to postpone their enrollment until 2021, according to the College Reaction/Axios poll. Indeed, Harvard, which will be fully remote this year, said 20% of its incoming freshman class have deferred. Most students told Axios they will be working instead (73%), while around 4% are taking classes at a different school, and 2% plan to do volunteer work. Still, the majority are on board with being on campus. This aligns with a previous College Reaction/Axios poll published last month, which found that 76% of surveyed students planned to go to campus if their schools gave them the option, and 66% said they would attend in-person classes if those were on the table. Most were willing to wear face masks and download an app to conduct contact tracing â\u0080\u0094 and 79% said that they wouldnâ\u0080\u0099t attend parties the way they did before the pandemic. Read more:More than 3 in 4 college students plan to return to campus this fall â\u0080\u0094 but they promise not to party But thatâ\u0080\u0099s been much easier said than done. An incoming William & Mary sophomore admitted to MarketWatch last month that, â\u0080\u009cI donâ\u0080\u0099t think a lot of students will stick to their word and stay away from parties or social events, including me.â\u0080\u009d And indeed, some of the recent campus outbreaks have been traced back to students not taking social distancing rules seriously. Several University of Connecticut students have been evicted from campus housing after a viral video showed the young men and women partying in a packed dorm room without wearing masks. Most of the infected Notre Dame students were seniors living off-campus who were infected at â\u0080\u009cgatheringsâ\u0080\u009d where social distancing rules were not followed, and masks werenâ\u0080\u0099t worn, the â\u0080\u009cTodayâ\u0080\u009d show said, and Oklahoma State reported 23 COVID cases at a single sorority house. The University of North Carolina has traced its clusters to dorms, a frat house and other student housing, with the schoolâ\u0080\u0099s independent student newspaper calling out both the students and the university for the â\u0080\u009cclusterf---.â\u0080\u009d â\u0080\u009cWe all saw this coming,â\u0080\u009d the editorial board wrote. â\u0080\u009cUniversity leadership should have expected students, many of whom are now living on their own for the first time, to be reckless. Reports of parties throughout the weekend come as no surprise. Though these students are not faultless, it was the Universityâ\u0080\u0099s responsibility to disincentivize such gatherings by reconsidering its plans to operate in-person earlier on.â\u0080\u009d Indeed, another notable statistic from the latest College Reaction/Axios poll: only 58% of surveyed students said they would notify their school if they saw someone breaking campus safety protocol. As of Wednesday morning, the overall number of U.S. COVID-19 cases rose to 5.48 million, and the death toll grew to 171,833, according to Johns Hopkins University data. The daily U.S. death toll more than doubled on Tuesday to more than 1,300 Americans."}]}