{"article": [{"url": "https://www.marketwatch.com/story/global-pc-shipments-surge-as-coronavirus-fuels-drive-into-chromebooks-2020-07-09", "published": 1594315520.0, "headline": "Global PC shipments surge as coronavirus fuels drive into Chromebooks", "body": "Global PC shipments rose in the second quarter, driven by COVID-19 demand, with Chromebooks accounting for a big boost — but that demand is not expected to remain the case going into next year, according to industry tracking firms. Late Thursday, International Data Group said second-quarter global PC shipments rose 11.2% from the year-ago period to 72.3 million units. That’s a notable shift from the first quarter, as the COVID-19 pandemic disrupted supply chains even as demand rose. “The strong demand driven by work-from-home as well as e-learning needs has surpassed previous expectations and has once again put the PC at the center of consumers’ tech portfolio,” said Jitesh Ubrani, research manager for IDC’s Mobile Device Trackers. “What remains to be seen is if this demand and high level of usage continues during a recession and into the post-COVID world, since budgets are shrinking while schools and workplaces reopen,” Ubrani said. The role Chromebooks — those PCs that run on Alphabet Inc.’s GOOG, +1.97% GOOGL, +1.82% Google Chrome operating system — played in the boost was evident when one compares IDC’s figures to those of research firm Gartner, which does not include Chromebooks in their figures. Gartner said shipments of PCs worldwide rose 2.8% to 64.8 million units in the second quarter compared with the year-ago period, driven by growth in Europe, the Middle East and Africa — that’s a difference of 7.5 million units. “After the PC supply chain was severely disrupted in early 2020 due to the COVID-19 pandemic, some of the growth this quarter was due to distributors and retail channels restocking their supplies back to near-normal levels,” said Mikako Kitagawa, research director at Gartner, in a statement. According to IDC, HP Inc. HPQ, -0.15% shipments surged 17.7% to 18.1 million units, topping the former market leader Lenovo Group Ltd. 992, -1.91%, which saw shipments rise 7.4% to 17.4 million. Dell Technologies Inc. DELL, -0.39% shipments rose 3.5% to 12 million PCs, Apple Inc. AAPL, +1.74% shipments surged 36% to 5.6 million units, and Acer Group shipments rose 12.7% to 4.8 million units. Without Chromebooks, Lenovo just barely held onto its lead, according to Gartner data. Lenovo shipments rose 4.2% to 16.2 million units, while HP shipped about 32,000 fewer units than Lenovo for a 17.1% gain to just under 16.2 million units. Dell shipments slipped 0.3% to 10.6 million units, Apple shipments rose 5.1% to 4.4 million units, and Acer shipments surged 23.6% to 4 million units, according to Gartner."}]}