{"article": [{"url": "https://www.marketwatch.com/story/astrazenecas-coronavirus-vaccine-setback-shows-why-big-pharma-would-rather-be-safe-than-sorry-2020-09-09", "published": 1599726560.0, "headline": "AstraZenecaâ\u0080\u0099s coronavirus vaccine setback shows why Big Pharma prefers to be safe than sorry. Which is good news", "body": "AstraZeneca, the U.K.-based pharmaceuticals giant, said on Tuesday that it would pause the clinical trial of the coronavirus vaccine it is developing with the University of Oxford after a British subject became ill. The decision will affect the so-called Phase 3 trials the company just started by enrolling 30,000 volunteers in the U.S., after recruiting 10,000 subjects in the U.K. over the summer. - AstraZeneca AZN, +0.63% Â seemed destined to become the first company to deliver a vaccine it said it would be ready to manufacture in the fall, if the trials proved conclusive and the drug was approved. After the latest incident, an independent committee will now review safety data before the trials can resume. - The U.K. companyâ\u0080\u0099s shares fell more than 1% on Wednesday on the news, in generally positive European markets as measured by the Stoxx 600 SXXP, +0.55% Â index. - U.K. health secretary Matt Hancock said on Wednesday in an interview that the pause in AstraZenecaâ\u0080\u0099s trial would not necessarily be a â\u0080\u009csetbackâ\u0080\u009d and that it was a â\u0080\u009cnormal part of a vaccine development.â\u0080\u009d Hancock added that â\u0080\u009cItâ\u0080\u0099s not actually the first time it has happened to the Oxford vaccine and itâ\u0080\u0099s a standard process in clinical trials.â\u0080\u009d Read:AstraZeneca stock falls as drugmaker pauses vaccine trial after volunteerâ\u0080\u0099s â\u0080\u0098unexplained illnessâ\u0080\u0099 - Before the AstraZeneca announcement, its chief executive and the top executives of eight other big pharmaceutical companies â\u0080\u0094 BioNTech BNTX, +1.23%, GlaxoSmithKline GSK, +1.10%, Johnson & Johnson JNJ, +1.39%, Merck MRK, -0.14%, Moderna MRNA, +0.09%, Novavax NVAX, +0.18%, Pfizer PFE, -0.27%, and Sanofi SANO, +1.14% Â â\u0080\u0094 had pledged on Tuesday that they would â\u0080\u009cunite to stand with scienceâ\u0080\u009d and only seek approval of a COVID-19 vaccine â\u0080\u009cafter demonstrating safety and efficacyâ\u0080\u009d through a Phase 3 clinical study. - Big Pharmaâ\u0080\u0099s unusual statement comes amid concerns that the Trump administration may try to push one or more COVID-19 vaccines through the approval process, such as by granting an emergency-use authorization sooner than science might dictate, in order to gain an advantage in the presidential election. The outlook: AstraZenecaâ\u0080\u0099s setback is just one example of the type of cold showers that may pour on heightened vaccine hopes in the next few months. In a U.S. election year and as the virus is spiking again in Europe, the pharmaceutical companies want to ensure that politics wonâ\u0080\u0099t interfere with science â\u0080\u0094 and safety. And that governments wonâ\u0080\u0099t try to rely on them as good-news providers in an otherwise gloomy autumn context. Read:Last chance saloon for U.K.-EU trade talks, as Johnson threatens to walk out on deal. But is he serious?"}]}