{"article": [{"url": "https://www.marketwatch.com/story/apple-is-splitting-its-stock-after-a-massive-quarter-3-things-retail-investors-should-know-before-they-take-a-bite-2020-07-31", "published": 1599300620.0, "headline": "After Apple and Tesla's stock splits, read this before jumping in", "body": "Monday was a big day for smaller shares of big companies. Apple Inc. AAPL, +1.74%  began trading on a lower cost per share. That's because it enacted the four-to-one stock split to become \"more accessible to a broader base of investors,\" the company announced after a knockout third-quarter earnings report. The same went for Tesla TSLA, +1.89%. The electric car maker said it is splitting its own stock five-to-one to \"make stock ownership more accessible to employees and investors.\" It also started trading Monday on a split-adjusted basis. A stock split divides the original share price into smaller prices per share. A current Apple stockholder with one share will get three extra shares once the split occurs. (And one man inheriting 7,000 shares of Apple now has 28,000 shares.) Likewise, a current Tesla stockholder with one share will get four extra shares. Apple shares closed Friday at $499.23 and opened Monday at $127.62. Meanwhile, Tesla shares closed Friday at $2,213.40 and opened Monday at $444.61. While that might feel like an unmistakable bargain to the new batch of retail investors out there, financial advisors who spoke with MarketWatch urged caution. “ 'This is not a financial event and has no economy implications or bearing on the value of the investment or the outlook for Apple as a business. It's a non-event.' ” - Ric Edelman, founder of Edelman Financial Engines It's important to remember what a stock split is - and isn't, according to Ric Edelman, the founder of Edelman Financial Engines, a national fee-only financial advisory firm. \"This is not a financial event and has no economy implications or bearing on the value of the investment ... It's a non-event,\" he said. \"The second answer is, this is a huge event from a psychological perspective,\" he added. \"That's the reason companies engage in stock splits - they know it plays on the emotions of investors.\" This is Apple's fifth stock split, according to the press release on its latest earnings results. A spokesperson could not be immediately reached for comment. This is Tesla's first stock split.How a stock split is like breaking a $20 bill Suppose you have a $20 bill and break it into four $5 bills: You don't have more wealth, just more bills. The same is true of a stock split, according to Ryan Sterling, the founder of Future You Wealth in Manhattan. Without a doubt, Apple did have a great quarter, Sterling said. But it's important to keep the earnings results and the stock-split news separate. Stock splits \"are cosmetic,\" he said. \"They don't say anything about the fundamentals.\" Don't miss: Opinion: Should you be a day trader? Investors can already trade fractional shares on a number of platforms, including Charles Schwab SCHW, +1.29%, Acorns and Robinhood, Edelman and Sterling noted. The news \"effectively increases demand for people who don't understand fractional shares,\" Sterling said. \"If anything, it causes more volatility in the stock.\" Don't give in to impulse \"Any enthusiasm you feel from a stock split, I would take with a whole lot of caution,\" Sterling said. \"When you talk about money in the stock market, the biggest eroder of wealth over time is human emotions.\" “ 'Any enthusiasm you feel from a stock split, I would take with a whole lot of caution.' ” - Ryan Sterling, founder of Future You Wealth If Apple shares fit into a long-term diversified strategy, go for it, Sterling said. But there are plenty of other ways to profit from the company's growth aside from holding stock, he said, suggesting exchange-traded funds as one option. \"You should ignore this and instead invest in diversified stock mutual funds,\" Edelman added. The bottom line for retail investors, according to Daniel Tobias, the owner of Passport Wealth Management in Cornelius, N.C.: \"Continue to be wary and stick to a long-term plan.\"This could impact some portfolios Though advisors say the stock split really doesn't amount to much, there is one caveat: Apple's stock split will alter its influence on the Dow Jones Industrial Average DJIA, +0.56%  . That's because the Dow is a price-weighted index, and if Apple's share price falls, it becomes a smaller component of the Dow. See also:Pandemic? Antitrust? No worries for Big Tech, which racked up $200 billion in sales anyway So if investors want exposure to Apple through an indexed fund, they'll be getting less of it starting Aug. 31 if the fund is pegged to the Dow, Sterling said. Don't miss:Why Dow's shake-up is bad for stocks added to it-and less bad for those booted The stock split has no effect on Apple's standing in the S&P 500 SPX, +0.87%  , which is market capitalization-weighted and based on the overall value of the companies within the index. If an investor has money in funds pegged to the Dow, Tobias said, they might have to do some research on how Apple's stock split could affect their portfolio. If not, he said, it's a \"more introspective\" question of whether buying a slice of Apple - at a reduced price - makes financial sense for that investor. Apple shares on Monday were up approximately 74% year to date. The Dow Jones Industrial opened Monday -0.13% and the S&P 500 was up 8.5%. This story was published on July 31 and updated on August 31."}]}