{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-and-death-tallies-keep-rising-as-fauci-expresses-frustration-and-warns-not-to-look-on-the-bright-side-2020-09-11", "published": 1599835820.0, "headline": "Coronavirus update: U.S. case and death tallies keep rising, as Fauci warns not to look on the â\u0080\u0098rosy sideâ\u0080\u0099", "body": "On a somber day for Americans, the number of U.S. cases and deaths resulting from the coronavirus that causes COVID-19 continued to climb to lead the world, prompting Dr. Anthony Fauci to express frustration in the â\u0080\u009clack of successâ\u0080\u009d the U.S. has had in containing the outbreak as the pandemic reached the six-month mark. The U.S. case toll rose to 6.43 million on Friday and at least 191,800 people have died, according to data provided by the New York Times. That comes after 37,786 new cases were reported on Thursday, above the daily average of 35,629 over the past week, and as the death toll increased by at least 915. “ â\u0080\u009cDonâ\u0080\u0099t ever, ever underestimate the potential of the pandemic,â\u0080\u009d Fauci said. â\u0080\u009cAnd donâ\u0080\u0099t try and look at the rosy side of things.â\u0080\u009d ” â\u0080\u0094 Dr. Anthony Fauci Fauci, who is head of the National Institute for Allergies and Infectious Diseases and the White House adviser on the coronavirus, said at a Harvard Medical School webinar Thursday that every day he looks at the COVID-19 data, he gets â\u0080\u009cmore depressed and more depressedâ\u0080\u009d that daily cases have never declined to the baseline he would like. He said that while daily new cases have come down a bit â\u0080\u0094 the daily average is down 16% from the average two weeks earlier â\u0080\u0094 he said it was still an â\u0080\u009cextraordinarily unacceptable baselineâ\u0080\u009d when considering the economy is reopening. When he presented data showing the reason for the high baseline, when compared with other countries, was likely because the U.S. didnâ\u0080\u0099t shut down to the extent of other countries, he â\u0080\u009cgot a little push back from people in the government.â\u0080\u009d If there is a lesson to learn, as the Friday marks six months since the World Health Organization declared the COVID-19 outbreak a pandemic, Fauci said, â\u0080\u009cDonâ\u0080\u0099t ever, ever underestimate the potential of the pandemic. And donâ\u0080\u0099t try and look at the rosy side of things.â\u0080\u009d Donâ\u0080\u0099t miss: Fauci tells Americans to â\u0080\u0098hunker downâ\u0080\u0099 this fall and winter: â\u0080\u0098Itâ\u0080\u0099s not going to be easy.â\u0080\u0099 Also read: Opinion: The COVID-19 pandemic is about to enter its most treacherous phase. His comments come as President Donald Trump faced a backlash over his interview with Washington Post journalist Bob Woodward in which the president said he knew of the dangers of the coronavirus but played down them to not create a panic. And at a rally in Michigan on Thursday, Trump defended his optimistic tone by reportedly comparing it to that of U.K. Prime Minister Winston Churchill during World War II, who had advised people to keep calm and carry on.In other news: â\u0080¢ Despite some recent claims that the U.S. mortality rate was one of the lowest in the world, New York Times data showed that out of 169 countries, U.S. had the 51st highest rate at 3.0%, which puts it in the 70th percentile. And for deaths per 100,000 population, it was among the highest at 58.61. Johns Hopkins University & Medicine â\u0080¢ Although 34 U.S. states have shown a decline in new cases over the past week, according to data provided by Johns Hopkins University, 33 states have also reported a decline in tests per 1,000 people. Meanwhile, 30 states have had more than 5% of tests produce positive results, which the WHO has said is a threshold that positivity rates should remain below. â\u0080¢ A New York Times survey of more than 1,600 universities and colleges in the U.S. indicated that there have been at least 88,000 cases and at least 60 deaths since the pandemic began. And research published in JAMA this week showed that of 3,222 young adults aged 18 to 34 years who required hospitalization for COVID-19, 21% (684) required intensive care, 10% (331) required mechanical ventilation and 2.7% (88) died. â\u0080¢ A new report released by the U.S. Centers for Disease Control and Prevention (CDC) showed that people who tested positive for COVID-19 were about twice as likely to have reported eating recently at a restaurant compared with people who tested negative. Read more. â\u0080¢ The pandemic has changed how 9/11 was being commemorated. At the New York memorial, thousands of family members are still invited, but the names of the people who died were heard from a recording, rather than live as in previous years. Read more.Latest tallies There are now 28.27 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show. At least 911,282 people have died and at least 19.05 million people have recovered. The U.S. case and death tolls are by far the highest in the world. In cases, India is second at 4.56 million and Brazil is third at 4.24 million, followed by Russia at 1.05 million and Peru at 710,067. Brazil has the second highest death toll after the U.S. at 129,522, India is third at 76,271 and Mexico is fourth with 69,649 deaths. The U.K. is fifth in the world but first in Europe with 41,703 deaths. For recoveries, the U.S. is third at 2.40 million, behind India at 3.54 million and Brazil at 3.66 million. China has 90,139 confirmed cases and 4,733 deaths, according to its official numbers, while 85,021 have recovered.What are companies saying? â\u0080¢ Peloton Interactive Inc. PTON, +6.97% Â reported late Thursday its first profitable quarter, as the at-home fitness companyâ\u0080\u0099s top- and bottom-line results both beat expectations. â\u0080\u009cThe strong tailwind we experienced in March as the COVID-19 pandemic took hold has continued to propel demand for our products into the [fiscal] fourth quarter and the first couple of months of Q1 fiscal year 2021,â\u0080\u009d said Chief Executive James Foley, as MarketWatchâ\u0080\u0099s Jeremy Owens reported. â\u0080¢ Oracle Corp. ORCL, +0.42% Â reported late Thursday fiscal first-quarter profit and revenue that rose above expectations, and provided a second-quarter outlook that was above forecasts. One of the reasons for the better-than-expected Q1 results was that revenue from Zoom Video Communications Inc. ZM, +2.89%, one of the beneficiaryâ\u0080\u0099s of the work-from-home trend accelerated by the pandemic, had more than doubled during from Q4, as MarketWatchâ\u0080\u0099s Wallace Witkowski reported. â\u0080¢ BMO Capital Markets analyst Simeon Siegel said that while the pandemic has hurt the retail sector in many ways, forcing some companies to close some stores is not one of them. He said quick reaction by companies to â\u0080\u009cshrink to growâ\u0080\u009d is providing an opportunity to thrive that doesnâ\u0080\u0099t appear very often, as MarketWatchâ\u0080\u0099s Tonya Garcia reports. â\u0080¢ Hologic Inc. HOLX, +1.61% raised its fiscal fourth-quarter revenue outlook, to put it well above analyst expectations, citing increased production and strong sales of COVID-19 tests. The diagnostics products and medical imaging systems company said it now expects revenue to rise 54% to 60% from a year ago to $1.225 billion to $1.275 billion, up from previous guidance of $925 million to $1.025 billion. The FactSet consensus was $986.5 million."}]}