{"article": [{"url": "https://www.marketwatch.com/story/bye-boomer-the-coming-cull-of-workers-over-50-2020-07-29", "published": 1596285500.0, "headline": "Bye, boomer: the coming cull of workers over 50", "body": "Uh-oh. Those of us who remember when ’80s music was new had better start bracing ourselves for those big-box-store greeter jobs earlier than we expected. It doesn’t take a genius to see that the jobs market is probably heading for a massive, rolling shakeout. And that means plenty of employers may be using the cover of COVID-19 to get rid of lots of expensive older workers. 80% of older Americans can't afford to retire - COVID-19 isn't helping Age discrimination in the jobs market, which is supposedly illegal, goes up in recessions. Some employers take the opportunity to ax experienced workers who are paid a reasonable wage, and replace them with cheap, desperate kids who will put up with anything. This isn’t just my opinion. New research from the National Bureau of Economic Research finds that, yes, age discrimination rises hand in hand with the unemployment rate. Older workers tend to be the last hired back and the first fired. And while the unemployment rate has been dropping back down for the last two months, after the initial COVID shock, you’re a fool if you think it’s over. (OK, that was the ’70s.) Economists Gordon Dalh of the University of California, San Diego, and Matthew Knepper of the University of Georgia ran the numbers on age-discrimination complaints filed with the Equal Employment Opportunity Commission and compared them with the unemployment rates in the relevant industry and U.S. state at the time. Read: Mid-career? Your job is at risk. Here’s what to know “For each 1 percentage point increase in a state-industry’s monthly unemployment rate, the volume of age discrimination firing and hiring charges increases by 4.8% and 3.4%, respectively,” they found. And that was even more true when they eliminated weaker or possibly frivolous complaints, and looked only at those that the EEOC deemed had merit and deserved further investigation. “Even though the incentive to file weaker claims is stronger when unemployment is high, the fraction of meritorious claims also increases significantly when labor market conditions deteriorate,” they write. Read: You’re likely to be out of a job in your 50s — 4 ways to prepare and minimize the pain Just for good measure, they also ran analyses of a study conducted in 2012 which sent out fake (female) résumés across the country in response to job openings. Their findings? “Each one percentage point increase in the local unemployment rate reduces the callback rate for older women by 1.7 percentage points (oﬀ a baseline 10.8% callback rate), relative to younger women,” they conclude. That’s about a 16% relative decline in callback rates for each percentage point added to the unemployment rate. (The younger “applicants” were allegedly aged 35 to 42, the older ones over 50, they say.) Bottom line: The higher the unemployment rate, the likelier employers are to favor younger women applicants over older women applicants. “All else equal, an older female is 6.8 percentage points less likely to receive a callback when she is competing against two additional younger female applicants, which translates to a 63% reduction relative to the mean.” They conclude: “Taken together, our two analyses provide compelling evidence that age discrimination rises as labor markets deteriorate. As far as we know, this is the ﬁrst direct evidence for age discrimination varying with the business cycle, both for the ﬁring and hiring margins.” Oh, great. Technically employers aren’t allowed to discriminate against workers over 40 on the basis of age, thanks to the 1967 Age Discrimination in Employment Act. But it’s honored more in the breach than in the observance. In 2005 the Supreme Court ruled that its protections were pretty narrow. “[M]any employer decisions that are intended to cut costs or respond to market forces will likely have a disproportionate eﬀect on older workers,” and that is legal, wrote Justice Sandra Day O’Connor for the majority. The stock market and some of the economic data may be pointing upward, but the bond market is telling a different tale and forecasting something in the region of catastrophe. The 10-year Treasury yield is back down to March panic levels. Gold is booming. Tensions are rising between China and the U.S. Also, it slowly seems to be dawning on the world that the virus didn’t just “go away” because we all hid for a couple of months. Cases have surged from here in the U.S. to China. Restarting the world was always going to lead to the virus’s coming straight back, as the scientists at Imperial College, London, warned way back in March. This is causing some reopening plans to be put on pause, or even into reverse. Massachusetts Gov. Charlie Baker is reimposing a 14-day quarantine on anyone entering the state. Good times. Let’s hope when this is all over there are actually some stores left hiring greeters."}]}