{"article": [{"url": "https://www.marketwatch.com/story/two-years-after-trump-kim-summit-north-korea-reiterates-vow-to-pursue-military-force-buildup-2020-06-12", "published": 1591976240.0, "headline": "Two years after Trump-Kim summit, North Korea reiterates vow to pursue military-force buildup", "body": "SEOUL, South Korea (AP) — North Korea on Friday again vowed to build up its military force to counter what it perceives as U.S. threats and said there would be little reason for a personal relationship between leader Kim Jong Un and President Donald Trump if Washington persists with sanctions and pressure. On the two-year anniversary of the leaders’ first summit, North Korean Foreign Minister Ri Son Gwon said the North would never again gift Trump with high-profile meetings and concessions he could boast as foreign-policy achievements unless it gets something substantial in return. On this date in 2018:North Korea summit: Trump calls halt to U.S.–South Korea war games “The question is whether there will be a need to keep holding hands shaken in Singapore, as we see that there is nothing of factual improvement to be made in the DPRK-U.S. relations simply by maintaining personal relations between our supreme leadership and the U.S. President,” Ri said in a statement carried by state media, referring to North Korea by its formal name, the Democratic People’s Republic of Korea. “Never again will we provide the U.S. chief executive with another package to be used for [political] achievements without receiving any returns. Nothing is more hypocritical than an empty promise.” In their 2018 summit in Singapore, the first-ever meeting between active leaders of the two countries, Kim and Trump agreed to improve bilateral relations and issued a vague statement on a nuclear-free Korean Peninsula without describing when and how it would occur. But negotiations faltered after the United States rejected North Korean demands for broad sanctions relief in exchange for a partial surrender of the North’s nuclear capabilities at Kim’s second summit with Trump in Vietnam in February 2019. Trump and Kim met for a third time last June at the inter-Korean border, but a subsequent working-level meeting broke down over what the North Koreans described as the Americans’ “old stance and attitude.” Kim, who unilaterally suspended nuclear and intercontinental ballistic missile tests during talks with Washington and Seoul, entered the new year vowing to bolster his nuclear deterrent. The North in recent months conducted short-range missile tests while also dialing up pressure on South Korea. Ri said the past two years of diplomacy has only revealed that the United States the continues to pursue “regime change” in Pyongyang and threatens the North with the prospects of a pre-emptive nuclear strike and “isolation and suffocation.” “The secure strategic goal of the DPRK is to build up more reliable force to cope with the long-term military threats from the U.S.,” he said. North Korea has suspended virtually all cooperation with South Korea in recent months while pressuring Seoul to defy U.S.-led international sanctions and restart inter-Korean economic projects that would breathe life into the North’s struggling economy. It also has threatened to end an inter-Korean military agreement reached in 2018 while expressing anger over South Korea’s inability to stop activists from floating anti-Pyongyang leaflets across the border."}]}