{"article": [{"url": "https://www.marketwatch.com/story/the-worlds-biggest-sovereign-wealth-fund-wants-to-rid-itself-of-poor-esg-performers-11602084190", "published": 1602162920.0, "headline": "The worldâ\u0080\u0099s biggest sovereign-wealth fund wants to rid itself of poor ESG performers", "body": "Nicolai Tangen, CEO of Norges Bank Investment Management, which runs Norway’s oil fund. hakon mosvold larsen/Agence France-Presse/Getty Images The boss of Norwayâ\u0080\u0099s $1 trillion oil fund has said it should sell out of more companies that perform badly on environmental, social and governance (ESG) issues, to increase its returns. Nicolai Tangen, chief executive of Norges Bank Investment Management (NBIM), which runs the worldâ\u0080\u0099s largest sovereign-wealth fund, told the Financial Times that the fund, should â\u0080\u009cuse risk in a more clever wayâ\u0080\u009d by divesting its holdings in more companies for ESG reasons. The fund, which owns 1.5% of globally listed stocks and portfolios of bonds and real estate, sold out of 42 companies in 2019 following assessments of ESG risks. These included shedding holdings in 16 power producers and 12 mining companies. Tangen said he wanted to increase that number, and was planning to recruit more staff to deal with ESG matters. The fundâ\u0080\u0099s risk-based divestments has helped improve returns in recent years. From 2012 to the end of 2019, they boosted the cumulative return on the equity reference portfolio by around 0.27 percentage points, or 0.02 percentage points annually, according to NBIMâ\u0080\u0099s latest Responsible Investment report. Risk-based divestments linked to climate change and human rights have increased the cumulative return on the equity reference portfolio by 0.21 and 0.06 percentage points respectively. Read: Norway sovereign-wealth fund aims to dump a swath of oil and gas stocks Increased pressure from activists and investors in recent years has forced companies and financial institutions to become more focused on ESG matters. JPMorgan JPM, -0.57%, Citigroup C, +0.47%, and Bank of America BAC, +0.47% have all issued green and social-good bonds this year. Read: Climate change is huge risk for the American financial system, a major new bipartisan report says Multinational food and drinks group Danone BN, +0.98% placed greater focus on its ESG goals in June when it adopted the French â\u0080\u009cEntreprise Ã Missionâ\u0080\u009d legal framework, and set up an independent committee to oversee and report on its progress. Tangen, 54, took over from Yngve Slyngstad as chief executive of the fund in September, after a recruitment process that led to him donating his controlling stake in AKO Capital â\u0080\u0094 the $21 billion asset manager he set up in 2005 â\u0080\u0094 to a charitable foundation. Read: Nicolai Tangen, Norwayâ\u0080\u0099s Trillion Dollar Man On Tuesday, Tangen unveiled his new leadership group, which strengthened its focus on technology by including both a chief operating officer, Birgitte Bryne, and a chief technology officer, Age Bakker. â\u0080\u009cWe have formed a smaller leader group to strengthen our areas of expertise and gain more synergies. Our main responsibility is to continue to deliver good return,â\u0080\u009d Tangen said in a statement. Read: California will require public companies to have diverse boards A third of the fundâ\u0080\u0099s leadership group will be women, while women make up 21% of its employees overall. â\u0080\u009cThis is not good enough. One of my primary priorities is to promote diversity. A good organization needs employees with different perspectives,â\u0080\u009d Tangen said, adding that he will relaunch the trainee program to achieve an even more diverse working environment, and promote more skilled women."}]}