{"article": [{"url": "https://www.marketwatch.com/story/trump-campaign-follows-through-on-threat-to-sue-philadelphia-over-poll-watchers-2020-10-02", "published": 1601638040.0, "headline": "Trump campaign follows through on threat to sue Philadelphia over â\u0080\u0098poll watchersâ\u0080\u0099", "body": "HARRISBURG, Pa. (AP) â\u0080\u0094 President Donald Trumpâ\u0080\u0099s campaign followed through on a threat to sue Philadelphia, filing papers in court Thursday night over city officials preventing campaign representatives from watching people registering to vote or filling out mail-in ballots in election offices there. The lawsuit comes amid Trump claiming that he can only lose the crucial battleground state of Pennsylvania if Democrats cheat and, as he did in 2016â\u0080\u0099s campaign, suggesting that the Democratic bastion of Philadelphia needs to be watched closely for election fraud. The 14-page lawsuit, filed in a state court in Philadelphia, revolves around the question of what rights there are for campaign representatives to watch people in election offices where they can register to vote, apply for mail-in ballots, fill them out or turn them in. â\u0080\u009cBad things are happening in Philadelphia,â\u0080\u009d the campaignâ\u0080\u0099s lawsuit said. â\u0080\u009cWhile transparency and accountability are hallmarks of election integrity, the actions of Philadelphia election officials to date have undermined election integrity by shrouding the casting of ballots in secrecy.â\u0080\u009d The campaign is asking to be able to assign representatives to observe inside satellite election offices that Philadelphia began opening Tuesday around the city to help collect what is expected to be an avalanche of mail-in ballots in the Nov. 3 presidential election. But election lawyers, city officials and the stateâ\u0080\u0099s top elections official all say that there is no right under Pennsylvania law, even for a certified poll watcher, to watch people do things like register to vote or fill out a mail-in ballot. Those rights, they say, are limited to certified campaign representatives to observe voting at a polling place on Election Day or the opening of absentee and mail-in ballots in an election office. A spokesperson for the cityâ\u0080\u0099s election board chairwoman said Thursday night that he had not reviewed the lawsuit, but the board generally does not comment on litigation. The Trump campaign originally threatened to sue Tuesday night. Some recent Pennsylvania polls show Trump and Biden in a competitive race, while others have Biden slightly ahead. Philadelphia on Tuesday opened the first seven of what is expected to be 17 satellite election offices. The offices are a new creation, deemed to be legal under state law last month by the state Supreme Court in a lawsuit brought by the state Democratic Party. Trump campaign employees promptly showed up, insisting they be allowed to go in and observe the activity inside. However, city election officials â\u0080\u0094 including a Republican member of a three-member city election board â\u0080\u0094 prevented them, although they offered the campaign a tour of the facilities to let them see how they operate. Trump referred to that confrontation in Tuesday nightâ\u0080\u0099s debate with Democratic presidential nominee, Joe Biden, saying â\u0080\u009cbad things happen in Philadelphia.â\u0080\u009d The fight could widen. A number of counties, including the stateâ\u0080\u0099s most heavily populated counties, are opening satellite election offices and putting out drop boxes for voters to drop off mail-in ballots. Philadelphia is home to one in five registered Democratic voters in Pennsylvania, and its turnout is closely watched in presidential elections. In 2016, Trump won Pennsylvania by about 44,000 votes, or less than 1 percentage point. But he lost Philadelphia to Democrat Hillary Clinton by 67 percentage points, or about 475,000 votes, a gap that was slightly smaller than the historic margins produced for Barack Obama. It is at least the second lawsuit filed in Pennsylvania by the Trump campaign, in an effort to expand poll watching rights and limit how counties can collect mail-in ballots and which mail-in ballots can be counted."}]}