{"article": [{"url": "https://www.marketwatch.com/story/our-national-hibernation-is-coming-to-an-end-uk-to-reopen-pubs-restaurants-and-cinemas-2020-06-23", "published": 1592985920.0, "headline": "â\u0080\u0098Our national hibernation is coming to an endâ\u0080\u0099 â\u0080\u0094 U.K. to reopen pubs, restaurants and cinemas", "body": "The long wait for a pint in the pub will soon be over and Brits will finally be able to return to their favorite restaurants, get a haircut, stay in a hotel and go to the movies. Pubs and restaurants in the U.K. will reopen in early July, after Prime Minister Boris Johnson announced the biggest easing of lockdown measures so far on Tuesday. Johnson said hotels, cinemas, museums, hairdressers and places of worship will also be allowed to open on July 4, provided they can â\u0080\u009cdo so safely.â\u0080\u009d However, nightclubs, indoor gyms and swimming pools will remain closed. The controversial two-meter social distancing rule â\u0080\u0094 longer than the World Health Organizationâ\u0080\u0099s one-meter advice â\u0080\u0094 has also been relaxed to â\u0080\u009cone meter-plus,â\u0080\u009d while two households will be able to meet from early July, and overnight stays in hotels and other accommodation will be allowed. Read:The British pub faces ruin. The government must act. â\u0080\u009cToday we can say our national hibernation is beginning to come to an end and life is returning to our streets and our shops. The bustle is starting to come back and a new, but cautious, optimism is palpable,â\u0080\u009d Johnson said in Parliament. He added that each step was reversible and urged people to use common sense and follow the guidelines. In another key development, Johnson said that the rules around coronavirus would no longer be legislation but downgraded to guidance. Pub stocks rose on Tuesday as investors welcomed the announcement, with JD Wetherspoon JDW, +2.99%, Marstonâ\u0080\u0099s MARS, +20.66%, Mitchells & Butler MAB, +5.58% Â and City Pub Group CPC, +1.66% all making strong gains before slipping back. Wagamama and Frankie & Bennyâ\u0080\u0099s owner The Restaurant Group RTN, Â also climbed. Low-cost hotel operator Whitbread WTB, +2.25% Â rose along with Cineworld CINE, +0.54% Â â\u0080\u0094 the worldâ\u0080\u0099s second-largest cinema operator. Reopening pubs, restaurants and other venues on July 4 was always part of the plan, but Tuesdayâ\u0080\u0099s announcement that the two-meter distancing rule will be relaxed has come as a pleasant surprise to the hospitality sector and investors. See also: England takes a baby step out of lockdown, opening some schools and markets Johnson explained that the rule could be relaxed to one-meter where two meters isnâ\u0080\u0099t possible, provided venues implement mitigation measures, including reducing the number of people indoors and removing face-to-face seating. Pub and hospitality trade groups had urged the government to halve the distance to protect businesses and millions of jobs. The British Beer and Pub Association said cutting the distance to one meter would increase the number of pubs able to reopen, from one-third to three-quarters of the U.K.â\u0080\u0099s 47,000 pubs."}]}