{"article": [{"url": "https://www.marketwatch.com/story/the-covid-19-recession-will-widen-the-gender-pay-gap-but-there-might-be-a-silver-lining-to-this-she-cession-11597225748", "published": 1597675100.0, "headline": "The COVID-19 recession will widen the gender pay gap â\u0080\u0094 but there might be a silver lining", "body": "Women in the U.S. have endured steep job losses due to their high representation in “high-contact” service sectors such as restaurants, travel and hospitality, a new analysis says. (Photo: Stephanie Keith/Getty Images) COVID-19â\u0080\u0099s disproportionate economic toll on women could create a larger gender wage gap during and immediately after this downturn, suggests a new study. But the so-called she-cession could also fuel changes that decrease gender inequality in the long run, the analysis adds. Women in the U.S. have endured steep job losses due to their high representation in â\u0080\u009chigh-contactâ\u0080\u009d service sectors such as restaurants, travel and hospitality, which social-distancing guidelines have capsized, according to a working paper distributed by the National Bureau of Economic Research and authored by researchers from the University of California San Diego, Northwestern University and the University of Mannheim. Women are also more likely than men to be unable to work during the pandemic due to â\u0080\u009ca lopsided division of laborâ\u0080\u009d in heterosexual couples, the paper said, the result of women taking on a greater burden of extra child-care duties amid day-care and school closures. “ â\u0080\u0098In the short and medium term, a pandemic recession erodes womenâ\u0080\u0099s position in the labor market, first through direct employment losses, and later through the loss in labor market experience brought about by low employment during the recession.â\u0080\u0099 ” â\u0080\u0094 a new study distributed by NBER Men have borne the brunt of unemployment during previous U.S. recessions, the paper said, including in the 2008 downturn, which earned the unfortunate nickname â\u0080\u009cman-cession.â\u0080\u009d But the coronavirus recession flipped the script: While menâ\u0080\u0099s unemployment increased 9.9 percentage points as jobless claims surged between February and April, womenâ\u0080\u0099s unemployment rose 12.8 percentage points, according to the paper. Womenâ\u0080\u0099s employment rate also saw a greater decline than that of men. â\u0080\u009cAs a result of the COVID-19 pandemic, countries around the world, including the United States, have entered the sharpest economic downturn since the Great Depression,â\u0080\u009d wrote the authors, whose analysis used a quantitative macroeconomic model. â\u0080\u009c[W]e argue that the central economic distinction between this downturn and other recent recessions, aside from its severity, lies in its impact on womenâ\u0080\u0099s employment.â\u0080\u009d Typical recessions moderately decrease the gender wage disparity since they tend to have a greater impact on men, the NBER study said. While normal recessions close the gender wage gap by 2 percentage points, though, a pandemic recession widens the gap by 5 percentage points.Â â\u0080\u009cIn the short and medium term, a pandemic recession erodes womenâ\u0080\u0099s position in the labor market, first through direct employment losses, and later through the loss in labor market experience brought about by low employment during the recession,â\u0080\u009d they said. But in the long-term future, the authors contend, a pandemic recession can actually decrease labor-market gender gaps. They point to the rise in husbands serving as primary child-care providers, as well as an increase in the amount of time fathers spend on child-care duties in a pandemic recession; these two factors, they say, will â\u0080\u009cerode social norms that underlie the unequal distribution of childcare between women and men, thus increasing the share of â\u0080\u0098modernâ\u0080\u0099 couples with egalitarian social norms.â\u0080\u009d “ Many positions women have gained over the last few months are in sectors such as leisure and hospitality, and therefore at risk of being affected by subsequent business shutdowns. ” â\u0080\u0094 a recent analysis by the National Womenâ\u0080\u0099s Law Center Itâ\u0080\u0099ll still take several years to fully compensate for the initial skill depreciation of women who work less or leave the labor force, they said. â\u0080\u009cWe also conjecture that the wide adoption of working-from-home arrangements during the crisis will lead to a persistent rise in the share of jobs in the economy for which telecommuting is an option,â\u0080\u009d the authors added. â\u0080\u009cTogether, these changes imply that the â\u0080\u0098new normalâ\u0080\u0099 after a pandemic recession will see a higher share of women in the labor force and a lower gender wage gap compared to the pre-recession economy.â\u0080\u009d Just two in five of the 12.1 million jobs lost by women from February to April have returned, according to a recent analysis by the National Womenâ\u0080\u0099s Law Center, a nonprofit that advocates for womenâ\u0080\u0099s equality. Many positions women have gained over the last few months are in sectors such as leisure and hospitality, the organization said, and therefore at risk of being affected by subsequent business shutdowns. â\u0080\u009cEven after Julyâ\u0080\u0099s gains, Black women and Latinas continue to be hit hard by the economic crisis,â\u0080\u009d the report added. â\u0080\u009cWhile the overall unemployment rate dropped to 10.2% in July, almost 1 in 7 Black women (13.5%) and Latinas (14.0%) remained unemployed.â\u0080\u009d"}]}