{"article": [{"url": "https://www.marketwatch.com/story/its-not-too-late-to-save-election-day-from-chaos-11596035526", "published": 1596113840.0, "headline": "Trump can't delay the vote, but there are still many reasons to worry about a fair and free election", "body": "Voters wait in a long line outside Riverside High School in Milwaukee on April 7 during the Wisconsin primary. AFP via Getty Images By now, President Donald Trump's tactics of division and diversion are well known. There was a horrible economic report today: The U.S. economy collapsed at a 33% pace in the second quarter, by far a record. And so Diversion Don, desperately trying to change the conversation, says the November election should be delayed. Let me emphasize: Presidents do NOT have any authority to delay or set the date for an election. The Constitution grants that power to Congress. Trump is free to ask his good friend Nancy Pelosi what she thinks. In calling to reschedule the election, Trump is meddling in one of our most cherished traditions and pillars of American democracy: our right to choose our leaders by free, fair and open elections. It's a reflection of his well-known authoritarian impulses. The economy is bad, we're past the 150,000 mark on coronavirus deaths; Trump knows he's behind-perhaps way behind-former Vice President Joe Biden. The United States has held elections in the midst of Civil War, in the midst of the Great Depression, and in terrible years like 1968, when there were assassinations, there was social unrest that eclipsed what we have encountered this year. There was even a pandemic in 1968. The election will go on as scheduled-whether Desperate Don likes it or not. Problems in many states That being said, it's worth remembering that several states had all sorts of problems during primaries and caucuses earlier this year. If we're not careful, there could be big problems in November. In Georgia, for example, hopeful voters ran into problem after problem. At polling stations, there weren't enough workers to check people in and voting machines were malfunctioning. Officials promised to ease bottlenecks by providing paper ballots, but didn't. Voters witnessed, writes Norm Ornstein in The Atlantic, \"a perfect storm of bad luck, malfeasance, and ineptitude.\" Variations on these sorts of problems exist across much of the nation. Variations on these sorts of problems exist across much of the nation.   Such \"malfeasance, and ineptitude\" is an opening for bad actors to stir the pot. This declassified-but heavily redacted-Senate Intelligence Committee report says that, although the committee saw no hard evidence that Russians were able to change any votes in the 2016 election, Moscow \"may have been probing vulnerabilities in voting systems to exploit later.\" In other words, 2016 may have been just a dry run for-well, this year, perhaps. Ignorance and complacency Let's be honest here. That we've allowed an enemy to get this close can be blamed on our own ignorance and complacency. The intelligence committee report adds: \"In 2016, cybersecurity for electoral infrastructure at the state and local level was sorely lacking; for example, voter registration databases weren't as secure as they could have been. Aging voting equipment, particularly voting machines that had no paper record of votes, were vulnerable to exploitation by a committed adversary. Despite the focus on this issue since 2016, some of these vulnerabilities remain.\" This is a national emergency. That the federal government-the Trump administration-and states aren't making a flat out effort to patch these vulnerabilities is an outrage. Assorted legislation has stalled in Congress amid partisan bickering-reflecting the fact that some Americans have chosen to treat the integrity of our elections as a partisan issue, a left-right, blue-red thing. This is far beyond petty partisanship. The enemy is at the gate-and we're squabbling with each other? Shame on us.  Adding to all this is the coronavirus, which will certainly be with us in November and beyond. Typically, one of every four workers at polling stations is age 70 or more, says the federal Elections Assistance Commission pandemic fears may keep them home on Nov. 3.    Think lines were long during primary season? What do you think Nov. 3 will look like? How long do you think folks will wait outside in, say, Detroit, if it is snowing and 26 degrees on Election Day? Some voters may just give up, or not bother showing up in the first place-this in a state that Trump won in 2016 by just 10,704 votes. Voting by mail The answer to many of these issues lies in voting by mail. Before I go any further, let's dispense with a giant lie that is always being peddled by President Donald Trump and swallowed by his I-automatically-believe-anything-he-says-without-thinking-for-myself followers: That absentee balloting is rife with corruption. Rubbish. Since 2000 more than a quarter of a billion votes have been cast via mailed-out ballots, in all 50 states, notes the Brennan Center for Justice at New York University Law School, which says \"fraud rates remain infinitesimally small.\" To give just one example: Oregon, one of the early adopters of voting by mail, \"has documented only about a dozen cases of proven fraud\" in 20 years; state officials say that is 0.0000001% of all votes cast.  One reason voting by mail is so secure is that there are numerous, and overlapping security measures: Identity verification, bar-coded envelopes, ballot tracking via the U.S. Postal Service, secure drop-off locations and drop boxes and, after the fact, postelection audits. Trump's response to all this? The whole thing's \"rigged.\" As usual, he offers zero proof against this mountain of evidence against this-or any of the other conspiracy theories he has peddled over the years. The solutions What can be done to make November go smoother?  The shortage of poll workers can be alleviated easily: Millions of Americans are unemployed; funds should be made available for training and staffing. High school and college students should also be recruited.  Mail balloting needs to be expanded, and fast. But ballots can't be printed until at least after Trump and Biden are officially certified as candidates by their parties next month. Other parties-remember the Greens?-may also get into the act. Ornstein offers additional advice as well, urging a crash effort by Congress, federal and state officials, and relevant agencies such as the Postal Service. All must step up their game. Botched deliveries, like the ones that occurred in DC and Maryland, cannot occur. None of this is hyperbole. It goes straight to the core of whether we the people can vote, and whether we can know with assurance that our vote will be counted in a fair and timely manner. Upon this simple and cherished exercise we have chosen our leaders for more than two centuries."}]}