{"article": [{"url": "https://www.marketwatch.com/story/this-videogame-company-is-in-the-spotlight-as-sony-and-microsoft-face-off-with-new-consoles-11600448400", "published": 1600434440.0, "headline": "This videogame company is in the spotlight as Sony and Microsoft face off with new consoles", "body": "The games industry is experiencing a moment right now. As Sony and Microsoft send their industry-dominant gaming consoles into a head-to-head battle for the fourth time, they face a new market from consumer demand. Mark Ralston/Agence France-Presse/Getty Images Irish gaming services company Keywords Studios could be set to benefit from a coming wave of competition between gaming consoles, as well as a coronavirus-induced surge in consumer demand, according to analysts. In its half-year results on Thursday, London-listed Keywords Studios KWS, +4.26% reported strong revenue growth, even as it took a hit from the coronavirus pandemic, and revealed the strategic acquisition it hopes will strengthen and scale its game development services. The games industry is experiencing a moment right now. As Sony SNE, +0.56% and Microsoft MSFT, +2.48% send their industry-dominant gaming consoles into a head-to-head battle for the fourth time, they face a new market from consumer demand boosted by millions of people housebound amid the pandemic. Also: Corsair Gaming to sell up to $252 million worth of stock in its IPO Keywords is a provider of technical services to the gaming industry, making it broadly exposed to the sector. The company is a collection of smaller studios across 21 countries with different areas of expertise and capabilities. These studios offer art, audio, quality assurance, player support, and other services for a host of larger companies, including Google GOOGL, +1.82%, Microsoft, EA EA, +1.15%, Ubisoft UBI, +1.81%, Warner Bros., Sega 6460, +1.25%, and Nintendo 7974, -0.34%. Keywords’ revenue was €173.5 million in the six months to June 30, up 8% over the same period last year. Adjusted profit before tax was 18% higher than last year at €21.7 million, and margins inched higher despite a hit on some operations from the coronavirus. The coronavirus pandemic has broadly benefited the gaming industry, with demand surging from both new and existing consumers alike. However, the pandemic did impact the ability of some games developers to work on new projects. “As a provider of key services to game developers, the boom in demand for new gaming content has been felt by Keywords too,” said Emilie Stevens, an analyst at Hargreaves Lansdown. “But while there’s certainly been an uplift, Keywords hasn’t seen the astronomic boost the likes of Activision Blizzard (home to brands like ‘Candy Crush’ and ‘Call of Duty’) has enjoyed, because the company is focused on new content and the planning and launch of new games has been disrupted over lockdowns.” The gaming sector is riding the tailwind of increased consumer demand as the industry’s defining hardware titans prepare to launch their newest consoles. Sony’s PS5 and Microsoft’s Xbox X-Series will both launch in mid-November with a suite of new and exclusive games. Read: Nvidia launches new generation of gaming chips, announces ‘Fortnite’ will introduce ray tracing Also on Thursday, Keywords announced that it had acquired U.S.-based Heavy Iron Studios for $13.3 million, adding to its acquisitions of Coconut Lizard and Maverick Media over the summer. Heavy Iron studios has been involved in developing the popular ‘Call of Duty’ games as well as productions for Disney, both of which were hugely popular through the lockdown period. “Things look set to improve, partly because Keywords and its clients are now up and running remotely and able to service the increased demand for content,” Stevens said. “But the long awaited launches of PlayStation 5 and Xbox X-Series, arriving to a much bigger market, are likely to have an even greater impact on the company.” Stevens noted that Keywords’ acquisition of Heavy Iron should boost it as the sector heats up. Other analysts are broadly bullish on the company. Analysts at Numis Securities, Goodbody, Liberum, and Stifel Nicolaus all have the target price of the company above £2,300 a share. Keywords’ stock dropped 5.5% on Thursday following the release of its financial results, and traded near flat on Friday, rising 0.5%. Will Wallis at Numis Securities said there was no material cause for the drop. Instead, Wallis said, this was likely the stock giving up some gains following a period of intense growth."}]}