{"article": [{"url": "https://www.marketwatch.com/story/this-latest-estimate-on-health-care-costs-in-retirement-may-make-you-sick-11596559762", "published": 1596546080.0, "headline": "This latest estimate on health care costs in retirement may make you sickÂ", "body": "CBS/Courtesy Everett Collection Got an extra $295,000 lying around?Â The vast majority of Americans in, or approaching, retirement donâ\u0080\u0099t, and thatâ\u0080\u0099s a problemâ\u0080\u0094because thatâ\u0080\u0099s how much a typical couple retiring at age 65 can expect to spend on health care over the rest of their lives.Â Thatâ\u0080\u0099s according to a long-awaited report from Fidelity, the Boston-based asset management giant, which estimates health care spending each year.Â It estimates that a single man retiring at 65 can expect to have health expenses of some $140,000, but because women typically live longer, their figure is $155,000.Â Read: Health care will cost this much in retirement â\u0080\u0094 but probably even more Weâ\u0080\u0099re obviously talking big money here, and hereâ\u0080\u0099s some context. The $295,000 figure for a couple is up $10,000 from last year. Thatâ\u0080\u0099s a 3.5% jump, which indicates that health-care costs continue to rise much faster than the overall cost of living. The federal government said three weeks ago that the closely-watched Consumer Price Index rose just 0.6% over the past 12 months.Â Â Why are costs rising so quickly? There are several reasons, says Fidelityâ\u0080\u0099s Hope Manion. Pharmaceutical researchers continue to make breakthroughs with specialty life-saving and life-sustaining drugs, which can be effectiveâ\u0080\u0094but also expensive. The same is true for what Manion calls â\u0080\u009cnew fangled technology,â\u0080\u009d which can drive better care, but can also be pricey. â\u0080\u009cThere are more tools in the health care toolbox,â\u0080\u009d she says, â\u0080\u009cand the marketâ\u0080\u0099s going to charge for that.â\u0080\u009d Demographics also play a role. The number of older Americans is growing rapidlyâ\u0080\u0094adding extra demand to a healthcare system that is already overburdened. This too, can increase costs.Â Â Thereâ\u0080\u0099s an additional reason for soaring health care costs too, and it concerns our lifestyles. More than two in five Americans were obese in 2017-2018, and one in 11 were severely obese, according to the Centers for Disease Control. This translates into everything from diabetes to heart disease and other maladies, all of which help drive up spending.Â Â â\u0080\u009cWeâ\u0080\u0099re less healthy,â\u0080\u009d Manion says simply.Â These costÂ estimates are based on the assumption that retirees are enrolled in traditional Medicare and taking advantage of its so-called â\u0080\u009calphabet coverage:â\u0080\u009d Medicare Part A, for example, covers hospital insurance, and Part B covers medical insurance.Â But a lot of things fall through the cracks.Â â\u0080\u009c40% are the premiums that you have to pay to participate in Medicare,Â Medicare Part B and Part D,â\u0080\u009d Manion points out. â\u0080\u009cMajor medical and prescription drug coverage are not free.â\u0080\u009dÂ Then there are co-pays and deductibles; itâ\u0080\u0099s also important to remember that at a time in life when eyesight and hearing can become more problematic, that Medicare doesnâ\u0080\u0099t cover vision and hearing exams, or eyeglasses. Bit by bit, year over year, it adds up.Â This all sounds very dire, but Manion pointed out that some things are beginning to help to control costs. The rise of telehealth is one example. Growing in popularity even before the coronavirus pandemic hit, telehealth has really taken off, allowing patients to â\u0080\u009cvisitâ\u0080\u009d doctors remotely. â\u0080\u009cItâ\u0080\u0099s less expensive, easier to obtain and deliver care than a traditional office visit,â\u0080\u009d Manion said. And as daunting as $295,000 is (or again, $140,000 for single men and $155,000 for single women), I pointed out to Manion, and she agreed, that this spending isnâ\u0080\u0099t distributed evenly over the course of oneâ\u0080\u0099s retirement. The bulk of health care spendingâ\u0080\u0094perhaps 80%â\u0080\u0094is actually concentrated over the last stage of a personâ\u0080\u0099s life, perhaps over the final year or two.Â This is an important point, because retirees, or those nearing retirement may have more time to accumulate assets that will be needed for that last stage of life. As always, couples in their late 50s or early 60s should discuss the best way to proceed with a trusted financial adviser. As usual, thereâ\u0080\u0099s a political angle to much of this. Former Vice President Joe Biden, who will officially become the Democratic nominee for president later this month, has spoken of loweringÂ theÂ Medicare eligibility ageÂ to 60. This would allow, according to one estimate, 23 million Americansâ\u0080\u0094many of whom have lost their jobs and thus their health insurance during the pandemicâ\u0080\u0094access to care. Bidenâ\u0080\u0094at a time of massive federal deficits and a soaring national debtâ\u0080\u0094says this would be covered by additional spending, i.e. taxes.Â Â Â President Donald Trump has not made any similar proposal, but has vowed to kill the Obama-era Affordable Care Act. He has also promised to roll out a healthcare plan of his own over the next few weeks. One clue could come from the administrationâ\u0080\u0099s own budget proposalÂ Â Â . for fiscal year 2021, however, which outlined a $756 billion cut in Medicare spending between 2021 and 2030. Another way to hold costs down could be the continued expansionÂ of Medicaid. According to the Commonwealth Fund, 28 states and theÂ District of Columbia haveÂ expanded Medicaid; seven have partially expanded it. But it has yet to be expandedÂ in 13 states, mostly in the South and Midwestâ\u0080\u0094including the second and third-most populated states: Texas and Florida.Â"}]}