{"article": [{"url": "https://www.marketwatch.com/story/russia-aims-to-run-down-biden-candidacy-in-support-of-trumps-re-election-says-us-counterintelligence-official-2020-08-07", "published": 1596821600.0, "headline": "Russia aims to run down Biden candidacy in support of Trump's re-election, says U.S. counterintelligence official", "body": "WASHINGTON (AP) - U.S. intelligence officials believe that Russia is using a variety of measures to denigrate Democratic presidential candidate Joe Biden ahead of the November election and that individuals linked to the Kremlin are boosting President Donald Trump's re-election bid, the country's counterintelligence chief said Friday. U.S. officials also believe that China does not want Trump to win a second term and that Beijing has accelerated its criticism of the president and its efforts to shape American opinion and public policy. Opinion:No, China is rooting for Trump to win, and here's why The statement from William Evanina comes amid criticism from House Speaker Nancy Pelosi and other congressional Democrats that the intelligence community has been withholding from the public specific intelligence information about the threat of foreign interference in the upcoming election. See:Trump needs to go public with threats to election security, top Democrats say On Russia, U.S. intelligence officials assess that it is working to \"denigrate\" Biden and what it sees as an anti-Russia \"establishment\" among his supporters, Evanina said. He said that would track Moscow's criticism of Biden when he was vice president for his role in Ukraine policies and his support of opposition to President Vladimir Putin inside Russia. The latest intelligence assessment reflects concerns to varying degrees about China, Russia and Iran, warning that hostile foreign actors may seek to compromise election infrastructure and interfere with the voting process. “ House Speaker Nancy Pelosi and fellow congressional Democrats have expressed frustration that the intelligence community has been withholding from the public specific intelligence information about the threat of foreign interference in the upcoming election. ” Those concerns are especially acute following a wide-ranging effort by Russia to interfere in the 2016 election on Trump's behalf through both the hacking of Democratic emails and a covert social-media campaign aimed at sowing discord among U.S. voters. Don't miss:Russian intelligence is spreading coronavirus disinformation in U.S., officials warn \"Many foreign actors have a preference for who wins the election, which they express through a range of overt and private statements; covert influence efforts are rarer,\" said Evanina, director of the National Counterintelligence Security Center. \"We are primarily concerned about the ongoing and potential activity by China, Russia and Iran.\" iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } China views Trump as \"unpredictable\" and does not want to see him win re-election, Evanina said. China has been expanding its influence efforts ahead of the November election in an effort to shape U.S. policy and pressure political figures it sees as against Beijing, he said. \"Although China will continue to weigh the risks and benefits of aggressive action, its public rhetoric over the past few months has grown increasingly critical of the current administration's COVID-19 response, closure of China's Houston consulate and actions on other issues,\" he wrote. On Iran, the assessment said Tehran seeks to undermine U.S. democratic institutions as well as Trump and divide America before the election. \"Iran's efforts along these lines probably will focus on online influence, such as spreading disinformation on social media and recirculating anti-U.S. content,\" Evanina wrote. \"Tehran's motivation to conduct such activities is, in part, driven by a perception that President Trump's re-election would result in a continuation of U.S. pressure on Iran in an effort to foment regime change.\" Read on:Biden eyes major foreign-policy shifts if he wins"}]}