{"article": [{"url": "https://www.marketwatch.com/story/soaring-demand-for-federal-jobless-benefits-points-to-fresh-fissures-in-the-us-economy-2020-07-09", "published": 1594386920.0, "headline": "Soaring demand for federal jobless benefits points to fresh fissures in the U.S. economy", "body": "The number of unemployed people collecting jobless benefits through a temporary federal-relief program has exploded in the past month to more than 14 million, suggesting the U.S. labor market is facing a fresh set of problems. After a small decline in mid-May, applications for benefits filed through the federal Pandemic Unemployment Assistance program have soared 53% to 14.4 million as of June 20 from 9.37 million a month earlier. Federal continuing claims are reported with a two-week lag. Read:Jobless claims fall to four-month low of 1.31 million in early July, but layoffs still high The increase in federal filings has mostly offset a gradual decline in continuing claims paid out by the states through the traditional unemployment compensation program. They’ve fallen to 16.8 million as of June 27 from a pandemic high of 22.8 million in early May. All figures are unadjusted for accuracy and an apples-to-apple comparison. The government’s seasonal adjustments don’t apply with federal claims since they did not exist prior to the viral outbreak. The portrait of the coronavirus-infected labor market looks worse if all continuing jobless claims are combined. Almost 33 million people were receiving benefits as of June 20, up from 31.5 million in the preceding week, according to Labor Department data. By contrast, the Bureau of Labor Statistics’ normally more reliable monthly employment report indicated 17.8 million people were unemployed in June. The gap between weekly continuing jobless claims and the monthly unemployment numbers has left a big — and inexplicable puzzle — for Wall Street DJIA, +0.56%. Why aren’t all these people telling the Labor Department they are unemployed? Read:Jobless claims tell us 32.9 million people are unemployed, but is it really that bad? “It tells me one of two things: Either the claims are wrong or the unemployment figures are wrong,” said Joel Naroff of Naroff Economic Advisors. “There is no other way I can explain that.” Which numbers should they trust? Many say it’s hard to fully trust either number given the devastation wrought by a once-in-a-century pandemic and the government’s flailing response to keep track of it all. State unemployment offices, for example, have been overwhelmed by more than 55 million new claims in the past several months. Many were also understaffed or relied on ancient technology, a problem compounded by the introduction of a federal relief program that loosened eligibility standards. For the first time ever the self-employed such as mom-and-pop businesses, Uber drivers and other “Gig” workers could get compensation. It’s possible, economists say, that many federal claims were filed weeks or months ago and are just being reported now. Most states struggled to graft the federal claims program onto their state programs. Read:U.S. regains 4.8 million jobs in June. Is rehiring poised to slow? Whatever the case, the more than 14 million people receiving federal benefits would not have been able to collect a dime before the pandemic since they do not contribute to the joint state-federal compensation fund. Those getting relief under the federal law can get benefits through the rest of the year, but a separate government bonus of up to $600 for each unemployed worker is set to expire at the end of July. Some economists think the extra benefits may have inflated the claims figures because many workers earn more from unemployment than what their jobs paid. There’s also been scattered reports of workers declining to go back to their jobs because of both safety concerns and the generosity of government benefits. “The number of people collecting benefits is roughly double the number of people telling the BLS that they are unemployed. Something is fishy here,” wrote Stephen Stanley, chief economist of Amherst Pierpont Securities. “My inclination is, unfortunately, to largely ignore these data until the dust clears a little more, which is a shame because we need timely data now more than ever.”"}]}