{"article": [{"url": "https://www.marketwatch.com/story/trump-touts-kodak-loan-and-ppe-procurement-defends-hydroxychloroquine-video-11595979071", "published": 1595965160.0, "headline": "Trump touts Kodak loan and PPE procurement, defends hydroxychloroquine video", "body": "President Donald Trump speaks during a news conference at the White House on Tuesday. Associated Press President Donald Trump confirmed on Tuesday that the administration was using the Defense Production Act to provide a $765 million loan to support Eastman Kodak’s efforts to produce active ingredients needed to make generic drugs in the U.S. “Today’s action is our latest step to build the greatest medical arsenal in history,” Trump said. Eastman Kodak KODK, +12.98% stock popped 203% Tuesday after the Wall Street Journal first reported the loan. Eastman Kodak shares rose another 63% in after-hours trading. The president appeared for about 30 minutes during Tuesday’s coronavirus task force briefing at the White House. He spent much of his time touting the administration’s efforts to deliver supplies, improve coronavirus testing and replenish the national stockpile of personal protective equipment. He said that the combined efforts of the U.S. Department of Health and Human Services, the Federal Emergency Management Agency and the private sector have procured 20 billion surgical gloves, 34 million face shields, 1 billion N95 and surgical masks, and 354 million surgical gowns. When asked if he supports Senate Republicans’ proposed $1 trillion stimulus bill, Trump pointed to the need to have further discussions with Senate Majority Leader Mitch McConnell. Trump asked all Americans to practice social distancing, remain vigilant about hygiene, and avoid indoor and large gatherings. He also said to wear a mask wherever appropriate. But when asked about a video he shared on Twitter, which has since been removed from social media sites for promoting COVID-19 misinformation, Trump questioned why the video was removed. “I think they’re very respected doctors,” he said, referring to doctors in the video that touted the use of hydroxychloroquine for COVID-19 patients. “There was a woman who was spectacular in her statements about it.” When a reporter noted the woman he referred to, Dr. Stella Immanuel, has reportedly made outlandish comments, including that alien DNA is used in medicine, Trump said, “I thought her voice was an important voice, but I know nothing about her.” When asked if he’ll be speaking in Charlotte, N.C., for the Republican National Convention, Trump said his speech will take place on Aug. 27, but did not divulge the location. Last week he canceled the Jacksonville, Fla., leg of the convention, which would have hosted party festivities, including his speech. Trump said delegates will still meet in Charlotte on Aug. 24, but said the White House will announce plans for his speech soon. Trump also defended his reportedly tense relationship with Dr. Anthony Fauci, pointing out that the doctor works for the administration. He also referenced Fauci and Dr. Deborah Birx’s high approval ratings, jokingly contrasting them to his. “They’re highly thought of, but nobody likes me,” he said. “It can only be my personality.”"}]}