{"article": [{"url": "https://www.marketwatch.com/story/this-is-how-covid-19-could-change-our-homes-in-the-future-2020-06-29", "published": 1593407480.0, "headline": "This is how COVID-19 could affect homes of the future", "body": "Our homes, amid the COVID-19 pandemic, have become so much more than just living spaces. They’re makeshift offices, gyms and classrooms. They’ve hosted at-home happy hours and made room for new hobbies. And, after spending the past few months sheltering in place — interacting with our spaces in entirely new ways — we’ve redefined what being “at home” ultimately means. Ahead, real-estate experts share how COVID-19 is changing what home buyers care most about, and predict how home design will adapt to this new normal.1. Bigger lot sizes Today’s home buyers are looking for bigger lot sizes, even if prioritizing the space and acreage pushes them further away from a city center, says Alan Paul, a real-estate agent with Re/Max Associates in Pueblo, Colo.. Because so many buyers are working from home, and plan to do so post COVID-19, they no longer care as much about commute times, Paul says. As a result, they’re moving out toward the edge of town, and homes in the country are piquing their interest more. “People want a lot more space,” he says. 2. Smart bathrooms and bidets While bidets are staples in many homes around the world, Americans have largely overlooked them until the Great Toilet Paper Shortage of 2020. Bidet companies have reported a spike in sales during COVID-19, and D.J. Patel, a real estate specialist in Chattanooga, Tenn., says buyers are seeing them as less of a luxury and more of a practical necessity in residential bathrooms. Still, most homes on the market today have traditional toilets. “I’ve noticed firsthand my clients talking about wanting to add a bidet,” he says. “The short-lived toilet paper scarcity has left a mark on home buyers.” The demand for smarter bathrooms, though, may have been picking up momentum even prior to COVID-19. Earlier this year at the Consumer Electronics Show in January, Wisconsin-based Kohler introduced a suite of smart bathroom technology that includes touchless toilets with smart sensors and bath presets that will remotely draw a bath.3. Multigenerational homes with new features Multigenerational homes have been trending for several years, as parents and in-laws have been moving in with their adult children, requiring care as they age and also helping out with grandkids. But COVID-19 has accelerated this trend, says Michelle Mumoli, a real-estate agent with The Mumoli Group at Triplemint, who specializes in moving people out of Jersey City and Hoboken into smaller suburban towns. “I think we are seeing families not wanting to consider assisted living facilities, and instead bringing their families together under one roof,” she says. The pandemic has been tough on families who have not been able to visit their loved ones in senior living communities during the shutdown due to visitor restrictions. Mumoli expects more multi-generational homes will create a demand for ground-level home suites. These homes will be mindful of ADA-compliances, like wider bathroom doors, lower positioning of light switches, and dropping down kitchen countertops a few inches, she says. With more people living under one roof, green homes features will be prioritized, too, Mumoli expects.4. A new space designed for package delivery E-commerce has been around for years, but our home design hasn’t necessarily caught up, with packages left unsecured on our doorsteps making easy and tempting targets for thieves. Now, as people are avoiding stores and shopping more online, developers and contractors will be considering a new home feature: a designated area for package drop-offs. This space will not only keep delivered items secure, they’ll also streamline the sanitation process, predicts Matthew Martinez, a real estate broker with Diamond Real Estate Group in Napa Valley, Calif., The area will be accessible to delivery people, but not thieves, he says. “It will most likely be a small room with a door to the outside and have the capability to receive drone deliveries,” Martinez says. “This room should also include a door to the recycling bin so that unpacking can happen there before the contents are brought into the house.”5. Not just smart homes — healthy homes Smart technology in homes got its start as a luxury born out of convenience. But today’s buyers are hyper aware of touching surfaces and want to use voice technology to control devices and electronics, and will be looking for ways to avoid touching doorknobs, says Martinez. He also predicts new health-focused features becoming more common, like viral-resistance surfaces, indoor air quality monitoring and UV air-treatment systems. “Our homes must be our sanctuaries now,” he says. See: How the pandemic has changed tech in its first 100 days6. Fewer open floor plans Already, Steve Keighery, who rehabs homes in Louisiana, says he’s been shying away from open floor plans. “Having walls and being able to self-isolate from other members of the household is becoming more important,” he says. In addition to dedicated spaces indoors, he’s prioritizing outdoor living spaces, with a greater emphasis on patios and decks, he says.7. Home offices in creative places Kitchen tables have been working overtime, serving as workstations and home schooling desks amid COVID-19. As remote work becomes more prevalent, home buyers will want to ensure that there’s adequate office space, says Ashley Baskin, licensed real-estate agent based in Irvine, Calif., who serves on the advisory board for Home Life Digest. “In the coming months we are anticipating there will be an increase in demand for office space in homes, a novelty that has been fading over the last few decades,” Baskin says. Also see: Home prices continued to rise even as the coronavirus pandemic swept across America, FHFA says Bedrooms may be staged to look like a home office. Or, homeowners may upgrade spaces to include home office features like built-in bookshelves and desks. Finishing garages, attics and basements to create an extra room may become a popular renovation, Baskin expects. She also predicts people will start using outdoor space for home offices in creative formats: If allowed by municipal codes and permitted by HOAs, converted shipping containers or tiny homes may pop up in the yard to create a workspace that’s separate from the home. These are the Top 100 Best Places to Live in America in 2019 Read the original article on Livability."}]}