{"article": [{"url": "https://www.marketwatch.com/story/robinhood-traders-could-learn-from-this-growth-stock-investor-whos-beaten-indexes-by-a-wide-margin-for-years-2020-06-16", "published": 1592320640.0, "headline": "Robinhood traders could learn from this growth-stock investor whoâ\u0080\u0099s beaten indexes by a wide margin for years", "body": "If youâ\u0080\u0099re hitting a lot of trades right on the Robinhood trading platform, be careful of hubris. Overconfidence kills returns. If you need a little something to spark your humility, consider this investorâ\u0080\u0099s record. John Malooly, who manages the Wasatch Ultra Growth fund WAMCX, +1.20%, has beaten his small-growth category and the Russell 2000 Growth Index RUO, +1.07% Â by an annual average of 11.5 to 19.5 percentage points over the past three to five years, according to Morningstar. The fund is ranked No. 1 in its category for total returns over the past three years, per Morningstar. If youâ\u0080\u0099re new to investing, let me tell you: You donâ\u0080\u0099t often see such a good long-term record. Few people consistently beat broad indexes, such as the S&P 500 Index SPX, +0.87%, the Dow Jones Industrial Average DJIA, +0.56% or Nasdaq Composite Index COMP, +1.39%. I always wonder what I can learn from performers like these, so I recently talked with Malooly to find out. Here are the key takeaways. Go for big growth Malooly likes to have an average revenue growth of 20% in his portfolio. This looks risky because itâ\u0080\u0099s about 8 percentage points higher than his benchmark index, according to Morningstar. But his portfolio is a deliberate mix of supercharged growth names in areas like tech and sectors you donâ\u0080\u0099t normally associate with growth to offset the risk. In supercharged tech, he favors plays on the â\u0080\u009cdigitization of businesses,â\u0080\u009d like Zendesk Inc. ZEN, +2.81% in customer-service software. Others here include DocuSign Inc. DOCU, +2.36% in digital-signature documents, Five9 Inc. FIVN, +2.71% in cloud-based call-center software, and HubSpot Inc. HUBS, +3.82%, which helps smaller companies use the internet and digital marketing. Meanwhile, he also goes with â\u0080\u009csaferâ\u0080\u009d companies that have lower growth, but less propensity to blow up. For example, you rarely see grocery stores in growth portfolios, but he holds Grocery Outlet Holding Corp. GO, +2.63%. The off-price grocery chain posts 10% sales growth, in part, by enticing entrepreneurial store managers with generous profit splits and lots of operational freedom. Favor defensive growth â\u0080\u009cJust buying fast-growing companies is high risk,â\u0080\u009d says Malooly. They can get hurt even on a small misstep. One way to cut risk: Avoid debt. â\u0080\u009cWith faster-growing companies, leverage is not an asset,â\u0080\u009d he says. â\u0080\u009cThey should be self-funding. Fast-growing companies with leverage tend to blow up, and you are not going to see the signs of stress until they blow up.â\u0080\u009d He also looks for recurring revenue. About half the stocks in his portfolio have this. â\u0080\u009cWhen you get hit in companies that have recurring revenue, you are down 20% to 30%, not completely blown up,â\u0080\u009d he says. This can come in the form of subscription revenue like at Paylocity Holding Corp. PCTY, +1.94%, which offers cloud-based human-resource-management software. Paylocity serves small businesses hit hard by the lockdown. â\u0080\u009cBut even if they donâ\u0080\u0099t grow next quarter, Iâ\u0080\u0099m not looking at them being down 90%,â\u0080\u009d he says, because of the subscription revenue. Repeat revenue also comes from follow-up maintenance and supply sales. Here he cites Kornit Digital Ltd. KRNT, +2.49%, which sells printers and ink used for â\u0080\u009cfast fashionâ\u0080\u009d and sports team apparel. He even finds repeat revenue in biotechnology. The DNA-based cancer-screening tests of Exact Sciences Corp. EXAS, -0.40% Â get re-administered every few years. â\u0080\u009cThe hurdle to grow is a lot lower than it appears,â\u0080\u009d he says. Another is Tandem Diabetes Care Inc. TNDM, +0.93%. Its insulin pumps have to be replaced every few years. Otherwise, cut risk by resisting the temptation to chase stocks. And buy when temporary issues knock a good stock down. For example, in May 2019 Trex Co. TREX, +2.47% Â reported manufacturing issues in a new line of decks. That seemed like a fixable problem at an otherwise good company, so Malooly bought the weakness. It is now â\u0080\u009ca double,â\u0080\u009d meaning the price rose 100%. Invest for the long haul Malooly buys names he thinks he can stick with for years. His portfolio turnover is typically a low 17%. To find buy and hold names, Malooly looks for â\u0080\u009clong duration,â\u0080\u009d sustainable growth. How to identify this? Malooly likes companies that can take market share. Here, he cites Silk Road Medical SILK, -0.53% in specialized cardiovascular surgical equipment, and Inspire Medical Systems Inc. INSP, +1.02%, which sells devices that help manage sleep apnea. Another is Esperion Therapeutics Inc. ESPR, +0.20%, which is on the cusp of launching a non-statin therapy for elevated cholesterol. Malooly also spends lots of time getting to know management. He even hires a private investigator to do background checks and interview former colleagues, bosses and employees. About 10% of the time they yield important results â\u0080\u0094 negative or positive. Reports on FreshPet Inc. FRPT, +1.40% management helped boost returns. â\u0080\u009cThe reports on the CEO were ridiculously glowing. Everybody said he is no-nonsense and a winner.â\u0080\u009d This stock is up 800% since Maloolyâ\u0080\u0099s first Morningstar-reported purchases in the last quarter of 2015. (Itâ\u0080\u0099s up 635% since I suggested it in my stock letter, Brush Up on Stocks, in April 2017.) Malooly emphasizes meeting management in person. â\u0080\u009cItâ\u0080\u0099s like the difference between going to a restaurant with someone and eating in their house. It is just a different experience.â\u0080\u009d On-site meetings also let him witness company culture and how management interacts with others. â\u0080\u009cWe rank all our companies by management team,â\u0080\u009d he says. â\u0080\u009cOur best teams tend to do the best over time.â\u0080\u009d Malooly also looks for good track records, signs that a management team isnâ\u0080\u0099t a slave to quarterly results so it has the freedom to invest long term, and pay incentives that favor shareholders.Shop for Covid-19 plays Malooly believes a vaccine will be key to getting the economy back to normal. He expects vaccine approval for emergency use by the end of the year. But since heâ\u0080\u0099s loath to chase stocks, he avoids the coronavirus-vaccine plays. Heâ\u0080\u0099s skeptical of Moderna Inc. MRNA, +0.09%, pointing out that early data were based on only a few patients. â\u0080\u009cI wouldnâ\u0080\u0099t bet against Moderna, but I am not betting with them,â\u0080\u009d he says. Instead, for Covid-19 plays he likes companies that benefit from lasting behavioral change because of the virus. For example, people normally donâ\u0080\u0099t shop for furniture online. But during the lockdown, they had to. And they got used to it. So while Malooly generally avoids companies that compete with Amazon.com Inc. AMZN, +3.01%, he likes Wayfair Inc. W, -2.59%, which sells furniture online. He thinks people will now buy furniture online more often. â\u0080\u009cThere will be a sustained change in behavior,â\u0080\u009d he says. He thinks Wayfair does a great job of creating its own designs and brands, which makes it harder for customers to comparison shop. Experience pays Market commentators on Twitter post lots of snarky comments about young people trading on the Robinhood platform. I think this is great, because itâ\u0080\u0099s nice to see people getting into the industry, and experience is the best teacher in investing. Another Malooly maxim supports my take. He attributes his fundâ\u0080\u0099s success to experience â\u0080\u0094 and lots of it. â\u0080\u009cTwo or three of us will go into a meeting and there might 40 to 60 years of small-cap investing experience,â\u0080\u009d he says. Malooly contributes 24 of those years. At the time of publication, Michael Brush owned EXAS and ESPR. Brush has suggested EXAS, ESPR, FRPT, and AMZN in his stock newsletter, Brush Up on Stocks. Brush is a Manhattan-based financial writer who has covered business for the New York Times and The Economist Group, and he attended Columbia Business School. Follow Brush on Twitter: @mbrushstocks."}]}