{"article": [{"url": "https://www.marketwatch.com/story/how-the-eu-will-speed-up-approval-of-eventual-covid-19-vaccine-2020-10-07", "published": 1602162380.0, "headline": "How the EU will speed up approval of eventual COVID-19 vaccine, in contrast to what has happened in U.S.", "body": "The European health regulator said on Tuesday it would launch a “rolling review” of the coronavirus vaccine being developed by Pfizer PFE, -0.27% and BioNTech BNTX, +1.23%, days after it announced a similar decision for the competing vaccine of AstraZeneca AZN, +0.63% and the University of Oxford. - A rolling review means the regulator will start examining the data from laboratory, animal and human testing in real time, without waiting for the whole set to be submitted at the end of the so-called Phase 3 trials. - “This does not mean that a conclusion can be reached yet on the vaccine’s safety and effectiveness, as much of the evidence is still to be submitted to the committee,” the European Medicines Agency said in its release. - As it did in the AstraZeneca case, the EMA said it had launched the process because “preliminary results from nonclinical and early clinical studies in adults (...) suggest that the vaccine triggers the production of antibodies and T cells that target the virus.” iframe.twitter-tweet { width: 100% !important; } - The chief executives of all major global pharmaceuticals companies pledged last month, in an unprecedented joint release, in response to pressure to speed up the research, to “continue to adhere to high scientific and ethical standards regarding the conduct of clinical trials” and “only submit [a vaccine] for approval or emergency use authorization after demonstrating safety and efficacy through a Phase 3 clinical study.” Opinion:AstraZeneca’s coronavirus vaccine setback shows why Big Pharma prefers to be safe than sorry. Which is good news The outlook: The rolling review will save time on the approval process, but doesn’t change anything to the clinical trials process, which will develop at pace. The regulator’s decision isn’t a political one, and contrary to what has happened in the U.S., there has been no pressure from European governments on the regulator to speed up the approval of vaccines currently being developed. The EMA insists in its release that it will wait for all the data from the completed trials before it makes a decision. But once they are in, the bureaucratic process of decision will be faster than it would have been for an ordinary drug. Read:Second coronavirus wave could delay Europe’s recovery: ECB President Lagarde"}]}