{"article": [{"url": "https://www.marketwatch.com/story/will-videogames-be-the-achilles-heel-for-big-tech-in-antitrust-investigations-2020-08-21", "published": 1598088920.0, "headline": "Will videogames be the Achilles heel for Apple, Google in antitrust investigations?", "body": "It finally may be game on for antitrust actions against Big Tech. As gaming grows in stature in the lives of Americans during the pandemic, it has highlighted the extraordinary grip that two of the four tech companies under investigation have over the white-hot industry. Epic Games Inc.’s lawsuits against the online stores of Apple Inc. AAPL, +1.74% and Alphabet Inc.’s GOOGL, +1.82% GOOG, +1.97% Google for punitive business practices associated with 30% fees could for the first time shine the anticompetitive light on so-called network-effects platforms that exhibit the deep reservoirs of power that tech’s largest companies wield, say gaming developers and experts in the field. “This is an inflection point, and the start of a long-running debate on how these platforms push us right to the edge of what we are willing to pay,” said James Currier, managing partner at NFX, a Silicon-Valley-based venture capital firm. Currier has co-founded several startups, including videogame company Wonderhill. “These closed gardens feel like extortion,” Currier told MarketWatch. “You need to pay to survive. It harkens to Microsoft MSFT, +2.48% and the Department of Justice investigation [in the 1990s], and AT&T T, -1.01% before that. With Apple and Google, it comes down to what is the ‘right’ take for the platforms? Thirty percent? 10%?” Indeed, the Epic lawsuits are likely to serve as a starting point for what is shaping up as a long-standing debate in a network-effect economy of large-scale players. A handful of companies — Apple, Google, Amazon.com Inc. AMZN, +3.01% and Facebook Inc. FB, +0.26% , all of which are under investigation for their business practices — wield massive platforms that make it almost essential for smaller companies to inhabit if they choose to survive, Currier said. Apple already is the subject of a probe by the Justice Department over its App Store, while Google is being scrutinized for its search practices. “Ultimately the app developers are completely at the whim of the distribution store owners — it’s fairly often an app will be banned temporarily with no recourse,” said Adam Landis, chief executive of AdLibertas Inc., a small tech company that helps mobile developers make money from their apps. “When customers ask us ‘do [we] have to pay the 30% Apple tax?’ our counsel is that the developer simply bite the bullet or devise an around-the-horn approach — Spotify SPOT, +0.08% is the best example of this,” Landis told MarketWatch. (Spotify filed a complaint against Apple with the European Commission last year.) Apple and Google haul in billions of dollars annually through fees for gaming companies to gain entry to their app stores, something Currier and others liken to pay-to-play forums. “The gaming industry, with all that’s happening around the world, and it’s really unfortunate, but it’s made gaming the largest entertainment medium in the world,” Nvidia Corp. NVDA, -0.54% CEO Jensen Huang said during an earnings call Wednesday. “The thing that people haven’t realized about videogames is that it’s not just a game itself anymore. You’re spending time with your friends. You’re using it to create, to realize your imaginations. People are using it for broadcast, for sharing ideas and techniques with other people, and then of course it’s just an incredibly fun way to spend time.” Nvidia’s gaming-chip sales rose more than expected in the second quarter, to $1.65 billion from $1.31 billion a year ago. Read more: Nvidia’s server business eclipses gaming chips for first time, though maybe not for long With gaming industry profits at record levels, the decision on how they’re doled out has never been more important. Apple and Google, for example, are in danger of losing one of their most profitable titles, “Fortnite,” as they face greater antitrust scrutiny from legislators. (“Fortnite” hauled in $1 billion in player spending on Apple iOS devices through mid-May, based on estimates from mobile-app research company Sensor Tower, suggesting Apple received hundreds of millions of dollars from the hit videogame.) Just as significant, those companies and others may finally relinquish their demands on a fee that dates to game cartridges in the early 1980s. Nintendo Entertainment System initiated the platform fee in 1983, when Namco Ltd., creator of “Pac-Man” and other arcade games at the time, wanted to expand its distribution via Nintendo’s nascent console. Since then, Apple, Google, Sony Corp. SNE, +0.56% and Microsoft Corp. MSFT, +2.48% have charged software makers a 30% revenue cut, regardless of whether game purchases are delivered via physical format or digital download. Apple CEO Tim Cook contends his company offers security, development support and the chance for small companies to reach 1 billion users for an annual $99 fee to participate in its developer program. See also: ‘Fortnite’s’ impact could be Epic on antitrust investigations of Big Tech An outcry among videogame makers underpins a larger sentiment among developers that Apple is exacting a steep, punitive price. On Thursday, a trade group representing the Wall Street Journal, Washington Post and New York Times sent a letter to Cook seeking more favorable terms on Apple’s App Store. For now, the front lines of the battle royal are centered on Epic Games, whose CEO, Tim Sweeney, has insisted software developers deserve a bigger share of the pie. Should Epic succeed, it would have “significantly positive implications” for the videogame industry, Cowen analyst Paul Gallant told MarketWatch. “This can go in only direction: Better terms from Apple,” he said, noting that Epic is represented by Cravath, Swaine & Moore — whom he considers perhaps the best antitrust law firm in the country — and possible concerns within Apple of a Biden administration siding with Epic. Additionally, Epic’s lawsuit presses the issue on the business relationship between Apple and its developers, and on antitrust investigations, according to attorney Scott Wagner. “Antitrust law is generally far behind the times,” he said. “For those reasons, I believe there will be some resolution.” The issue of Google, however, isn’t as clear cut. Proving Play Store rules violate antitrust laws may be more difficult than with the App Store, antitrust lawyer Paul Swanson said. Apple requires all apps be installed through the App Store, while Google offers options via several different app stores. About 70% of U.S. app revenue comes from App Store users. Nonetheless, a class-action lawsuit filed this week accused Google of violating federal antitrust laws via “ongoing abuse of its market power, including the exclusion of competition, the stifling of innovation, the inhibition of consumer choice, and Google’s imposition on app developers of a supracompetitive 30% transaction fee,” in Google Play, its marketplace for Android OS apps. An Android app developer, Pure Sweat Basketball Inc., brought the suit against Google’s allegedly anticompetitive, unlawful practices related to its Google Play Store. “Just as we’ve proven antitrust claims regarding e-book pricing against Apple — Big Tech’s other app monopolizer — we are confident that our claims against Google will be thoughtfully considered by the court,” Steve Berman, one of attorneys suing Google, told MarketWatch in an email message. “It is our hope that the DOJ will continue to keep a close investigative eye on Big Tech, including against Google in this matter, but in the interim, this case spotlights the importance of privately brought antitrust litigation on behalf of consumers and others being harmed by Big Tech monopolies.”"}]}