{"article": [{"url": "https://www.marketwatch.com/story/he-paid-for-all-our-first-class-travel-my-boyfriend-76-said-hed-take-care-of-me-i-gave-up-everything-then-he-dumped-me-am-i-entitled-to-anything-2020-09-29", "published": 1601829860.0, "headline": "â\u0080\u0098He paid for all our first-class travelâ\u0080\u0099: I gave up everything for my boyfriend, 76 â\u0080\u0094 then he dumped me. Am I entitled to anything?", "body": "Dear Moneyist, I am a 72-year-old widow. Three years ago, I met a man, 76. We developed a relationship and, after six months of dating, I moved in with him. He wanted to travel, and we did. He paid for all our first-class travel and very expensive cruises, safaris and tours. I paid mostly for hotels and incidentals. We talked about this arrangement, and I was very clear that I didnâ\u0080\u0099t have the funds to travel the way he intended. He said money was not an issue. I also told him before I moved in that, by quitting my job and giving up my home, I would be priced out of the real-estate market where I lived. He said that I could stay in his home for as long as I wanted, and he would advise his executor of this arrangement. I spent money decorating his homes and providing a loving environment for him. “ â\u0080\u0098He said that I could stay in his home for as long as I wanted, and he would advise his executor of this arrangement.â\u0080\u0099 ” This year, after returning from a safari in Africa, he told me we were over without any explanation or discussion. He owns homes in California and Texas, and we were in Texas at the time. He said that I could stay in the California house for four months until he returned there. When I met him I had a part-time job and my own home. I gave up both to create a life with him. The cost of living is very high where I live. I could not afford my own place on my retirement income, and I had to get another job. Thatâ\u0080\u0099s not easy at 72. Anyway, I did get a job and I did get a place to live, but Iâ\u0080\u0099m left wondering what I am owed. I had given up my whole life for him and it cost me a lot of money to pack up, move and find another place. Am I entitled to anything? He assured me that I would have a home for as long as I live. Single Again at 72 Dear Single Again at 72, You measured the risks you were taking with the rewards, and you decided to go for it. It was a gamble, and it did not pay off. People change their minds. Humans disappoint: We donâ\u0080\u0099t always keep our word, and we donâ\u0080\u0099t always know what we want. Sometimes we mean what we say in the moment, or make promises without thinking. A promise without a contract such as marriage or some other kind of legal arrangement, however, is difficult to enforce. You walked into this relationship with both eyes open. He promised you the world, and you willingly gave up yours in return. You tasted a lifestyle beyond your wildest dreams: first-class travel, safaris, cruises (although they have fallen out of favor of late) and residence in several homes.On that note, here is a complete list of everything that life owes us: The Moneyist: My wife and I live with my dying mother. My brothers and I will inherit her home. Should I ask her to sell it â\u0080\u0094 and move in with me? You are not the first. In Marvin v. Marvin (1976), Michelle Marvin sued actor Lee Marvin for breach of contract. She had changed her name to Marvin and they lived together for several years. She alleged that Lee Marvin promised to support her for the rest of her life. It went to the California Supreme Court and Court of Appeals. The courts ruled against her. There was no marriage contract. California is a community property state: Even if you marry, you typically take out of the marriage what you brought into it. You built sand castles in the sky. They crumble, especially in a court of law. I understand that you may be hurt and disappointed, and that you feel cheated. But he didnâ\u0080\u0099t breach a contract. He simply changed his mind and, for better or for worse, he is entitled to do that. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Hello there, MarketWatchers. Check outthe Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}