{"article": [{"url": "https://www.marketwatch.com/story/how-to-avoid-a-10-bite-when-you-dip-into-your-retirement-funds-2020-06-23", "published": 1592920700.0, "headline": "How to avoid a 10% bite when you dip into your retirement funds", "body": "In an effort to discourage the use of retirement funds for purposes other than retirement, Congress enacted a supplementary tax that applies to premature distributions. However, the dreaded 10% Internal Revenue Code Section 72(t) penance does not apply to all withdrawals, and several statutory exceptions have been carved out. In addition, in the last six months the legislature has added new opportunities to circumvent the 10% penalty, which makes this a great time to review the topic. Several statutory exemptions apply to all types of employer-provided qualified plans, 403(b) plans, IRAs, SEPs, and SIMPLEs. Please note that in many cases the withdrawals will be subject to ordinary income tax and will increase the amount you owe the government. However, the following cases, even though they may incur a tax hit, will escape the 10% penalty. • Distributions resulting from the pandemic. If you qualify for a coronavirus related distribution (CRD), the 10% penalty does not apply to withdrawals that occur in 2020. The CARES Act (enacted in March 2020) specifies two categories of people who can get CRDs. First, you qualify if you, your spouse, or your dependent has been diagnosed with Covid-19. Second, undiagnosed people who have suffered adverse financial consequences because of the disease may also qualify. This includes individuals who have been quarantined, furloughed, laid off, had work hours reduced, or become unable to work because of child care responsibilities. Business owners and operators are also eligible if they have had to close the business or reduce hours. In addition to avoiding the 10% penalty it should be noted that the opportunity to take plan withdrawals has been loosened by many (but not all) employers. • Distributions occurring after age 59½. These are not considered premature distributions even if you are still in the workforce, so no penalty tax applies. For example, if Tommy, age 61, takes a qualified distribution from his Roth IRA (he met the five-year holding period) to pay for personal expenses he qualifies for a tax-free and penalty free Roth distribution. • Distributions arising from a death. Money paid to a beneficiary or an estate avoids the 10% penalty. For example, Tammy (age 50) is a widow who received a distribution from her deceased husband’s retirement plan. There is no penalty on the payment. However, if Tammy rolled the distribution to an IRA and then took a premature distribution, the penalty would apply. Once Tammy chose to rollover the funds into her own IRA, the source of the funds becomes irrelevant and she loses the ability to qualify for the exception from the 10-percent penalty. • Distributions stemming from permanent or total disability. Another exception to the 10% penalty applies when you have a disability. The definition for disability has come to mean that you are permanently disabled and unable to do your prior job. Verification by a doctor will be required for this. • Distributions based on qualified medical expenses. Note that not all medical expenses qualify (e.g., unnecessary cosmetic surgery is not qualified, but treatment by a doctor for a broken leg is qualified). You also need to understand that distributions for qualified medical expenses must exceed the itemized deduction threshold of AGI in the year taken (7.5% in 2019). The good news is that this provision applies even if the standard deduction is claimed. The bad news is this provision only applies to uninsured medical expenses. • Distributions following the birth or adoption of a child. Effective Jan. 1, 2020, you are allowed to take a withdrawal for the birth or adoption of a child without the 10% penalty applying. The SECURE Act allows you to avoid the penalty on up to a $5,000 withdrawal ($10,000 for a married couple). You can take the withdrawal up to one year from the date of adoption or the birth of a child. You can also repay the $5,000 ($10,000) to your IRA should you come into money. One caveat — the exception does not apply in a “Brady Bunch” situation. This is because an eligible adoptee is an individual other than a child of the taxpayer’s spouse who has not attained age 18 or is physically or mentally incapable of self-support. There is a statutory exception that applies to all types of qualified plans, 403(b) plans, but not to IRAs, SEPs, and SIMPLEs. This exception is: • Distributions proceeding from retirement after age 55. Under the so-called “age 55 exception” (age 50 if the person is a qualified public safety employee, e.g., police and fire) there is no penalty if you retire from the employer after age 55. For example, Ted retires from ABC Company at age 57. Ted can take withdrawals without triggering a penalty. There are a few exemptions that apply to IRAs, SEPs, and SIMPLEs and not to qualified employer plans and 403(b) plans. Once again, an ordinary income tax will apply, even though the 10% penalty is circumvented. • Distributions for purchasing the ‘first home’. The maximum that can be taken for the first-time homebuyer exception is $10,000 per person. The first-time homebuyer exception applies to you, your spouse, your child, or your grandchild. The law says “first-time homebuyers,” but in application this means anyone who did not own a home in the last two years, even if they owned a home before that. One final point, the distribution must occur within 120 days of acquiring (buying, building, rebuilding) the home. • Distributions needed to pay for qualified higher education expenses. The payment for education for you, your spouse, or your child or grandchild also avoids the 10% penalty. The funds must be for a college, university, or vocational school. Qualified education expenses include tuition, fees, books, supplies, equipment, and room and board (room and board only applies to a student if they are at least half-time). Only out of pocket expenses can be used — in other words, the eligible amount will be reduced by scholarships, grants, and employer tuition assistance.The substantially equal periodic payout strategy If you don’t fit into any of the exceptions that were previously outlined, you still will be entitled to avoid the 10% penalty if you use the substantially equal periodic payout strategy. This opportunity applies to IRAs, SEPs, and SIMPLEs, and all employer qualified plans. The general rule requires the distribution be “part of a series of substantially equal periodic payouts made at least annually over the life expectancy of the taxpayer”. In addition, qualified plan and 403(b) plan participants must be separated from service. There are three permissible ways to implement this strategy. Under the required minimum distribution method annual payments are re-determined each year and usually go up. However, in many instances you will be forced to take out less money under this method, and for this reason it is often preferred. Under the amortization method the annual payment is the same every year. The third method is the annuity method. Under this method the annual payment is the same every year, but it is different than the amortization amount. No matter what method is used: • Payments can begin at any age • Withdrawals must be made at least annually (or more often) • A one-time election can be made to change from the amortization method or annuity method to the RMD method (this is generally a way to reduce the required withdrawals). Even though the Code Section says that payments must continue “over a lifetime”, in actual application withdrawals may be terminated without penalty as long as they last the later of: – Five years from the date the withdrawals begin – Age 59½ For example, if your client Tabitha starts distributions at age 40, she can stop distributions at age 59½. If, however, she starts distributions at age 57 she must wait until age 62 to stop distributions. There are other exceptions to the 10% penalty that don’t come up as frequently. They apply to distributions attributable to an IRS levy of funds, distributions taken by qualified reservists who are called to active duty, distributions needed to pay for health insurance premiums by an unemployed person, distributions occurring because of a divorce (so-called QDRO distributions), and distributions that are rolled over (e.g., Tim withdraws funds from his individual retirement account for personal use and then redeposits them within 60 days). One important consideration has been stated several times — even though you avoid the 10% penalty you probably will not avoid extra ordinary taxes on the distribution. A second important consideration is that you should avoid taking a distribution for frivolous reasons. In light of the pandemic and the personal financial havoc it wreaks, financial planners may acknowledge that withdrawals may be needed. But no financial planner should let you take a withdrawal without illustrating the consequences to your retirement plan. Thoughtful consideration should be given to the impact on future savings. If, however, your situation calls for a plan withdrawal, care should be taken to avoid the 10% penalty for premature withdrawals taking into consideration the possibilities described above."}]}