{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-approach-highest-settlement-in-history-as-silver-futures-take-a-breather-2020-07-23", "published": 1595514860.0, "headline": "Gold futures end a stoneâ\u0080\u0099s throw away from a record", "body": "Gold futures ended higher for a fifth straight session Thursday, with the most-active contract just short of notching a settlement record, highlighting feverish demand for bullion amid the worst pandemic in over a century. If gold gets to its 2011 record high, â\u0080\u009cwho is to say it canâ\u0080\u0099t go to $2,000 next?â\u0080\u009d wrote Fawad Razaqzada, market analyst at ThinkMarkets, in a Thursday research note. â\u0080\u009cObviously, no one knows if it will get there, but momentum is certainly bullish, and the fundamental backdrop is still supportive.â\u0080\u009d Gold for August delivery GC00, +2.17% Â on Comex rose $24.90, or 1.3%, to settle at $1,890 an ounce after trading as high as $1,897.70. Prices based on the most-active contracts stopped just short of the record settlement of $1,891.90 from August 2011, according to Dow Jones Market Data. The record intraday level for most-active futures prices stands at $1,923.70 an ounce from Sept. 6, 2011. The front-month July gold contract US:GCN20, which trades on much lower volume, settled at $1,889.10 on Thursday, up $25, or 1.3%, for the session. That was a record for the front-month contracts, based on data going back to 1975. The surge for gold comes against a backdrop of continued uncertainty about the economic landscape for the U.S. and other countries attempting to deal with the fallout from the COVID-19 pandemic. There are now more than 15.25 million confirmed cases of COVID-19 world-wide and about 624,000 people have died, data aggregated by Johns Hopkins University show. Gold has flourished in this environment at least partly due to the outsize efforts by central banks and governments to provide funding to lessen the economic effects of the global outbreak, which has benefited buying in gold and silver to a lesser extent. As the rally for gold intensified Thursday, silver briefly erased its early losses before settling with a modest loss. The September contract US:SIU20 Â fell 16 cents, or 0.7%, to $22.988 an ounce. Silver prices had surged by 7.4% on Wednesday to extend a climb to its highest levels since 2014 after a 6.8% rally on Tuesday. â\u0080\u009cSilver finally graduated from being poor manâ\u0080\u0099s gold,â\u0080\u009d George Gero, managing director at RBC Wealth Management, told MarketWatch. Industrial demand for the metal, which â\u0080\u009cwere headwinds, became tail winds in the economic recovery.â\u0080\u009d Read:Why silver is trading at a nearly 4-year high James Hatzigiannis, chief market strategist at Ploutus Capital Advisors, attributed the rally for gold to the combination of a weakening dollar, which is approaching the March lows of this year, â\u0080\u009ctalks from both sides (House and Senate) and the president seriously indicating we are in need of another stimulus bill.â\u0080\u009d â\u0080\u009cThis is causing investors to flee into assets that are considered a hedge against inflation,â\u0080\u009d such as gold and other inflation protected securities, he told MarketWatch. â\u0080\u009cI believe inflation is certainly building up,â\u0080\u009d with significant increases in food prices and a very beaten up U.S. dollar. The ICE U.S. Dollar Index DXY, -0.58% Â trades 1.3% lower week to date and has lost 2.7% so far in July. Read:Gold ETFs on track for best week since March Data Thursday showed that U.S. initial jobless claims rose in the week ended July 18 for the first time since late March, by 109,000 to 1.42 million. The U.S. jobs report once again confirmed that the economy is â\u0080\u009cin desperate need of help,â\u0080\u009d said Naeem Aslam, chief market analyst at AvaTrade. That lends support to haven gold. Among other Comex metals, September copper US:HGU20 Â rose 0.5% to $2.9385 a pound. October platinum PLV20, +3.99% Â added 0.7% to $963.80 an ounce, while September US:PAU20 Â settled at $2,239.80 an ounce, up 0.5%."}]}