{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-down-over-100-points-as-stocks-aim-for-fourth-straight-weekly-loss-2020-09-25", "published": 1601051240.0, "headline": "Stocks close higher, as late-session rally clinches Nasdaq's first weekly gain since August", "body": "U.S. stock indexes closed higher after a choppy session Friday, but the Dow Jones Industrial Average and S&P 500 logged their fourth straight weekly losses as worries grow over the economic outlook in the absence of renewed aid from Washington, the November presidential election and rising COVID-19 infections in the U.S. and Europe. What did major benchmarks do? The Dow Jones Industrial Average DJIA, +0.56%  rose 358.52 points, or 1.3%, to close at 27,173.96; while the S&P 500 SPX, +0.87%  advanced 51.87 points, or 1.6%, to 3,298.46, well above its correction level at 3,222.76 - commonly defined as a drop of at least 10% from a recent peak - which was being watched closely by market participants, as a sign of further deterioration in equities. The Nasdaq Composite Index COMP, +1.39% closed up 241.3 points, or 2.3%, at 10,913.56. For the week, the Dow was down 1.8%, and the S&P 500 lost 0.6%. It was the fourth straight weekly decline for the two indexes, matching the longest losing streak since August 2019. The Nasdaq gained 1.1% for the week, ending a three-week stretch of declines.What drove the market? Several weeks of selling have left market participants wary. \"Overall, risk sentiment is still raw after investors had to bear witness to the steep declines in U.S. equities this month, as benchmark indices are set to post their first monthly loss since March,\" said Han Tan, market analyst at FXTM, in a note. Although the Cboe Volatility Index VIX, -5.15% \"appears relatively tame compared to the spike earlier in the month, market participants must remain vigilant and brace for potentially more volatility over the near-term.\" The VIX, which reflects investor expectations for S&P 500 volatility in the coming 30 days, stands just below 30, above its long-term average near 20, after jumping to nearly 36 earlier this month as tech stocks kicked off a sharp market pullback. Rising COVID-19 cases have led to the return of some lockdown measures in European countries, while rising cases in parts of the U.S. have highlighted worries about the potential of another wave in this fall. Signs of a slowing of the economic rebound from the pandemic-induced sudden stop in March have undercut sentiment. Investors continue to watch Washington for signs of progress in long-stalled talks on another round of spending aimed at cushioning the blow of the pandemic. House Democrats on Thursday were preparing a $2.4 trillion aid package that includes a number of items seen having bipartisan support, including direct payments to households, the Paycheck Protection Program, a revival of a federal add-on to state unemployment benefits, as well as a renewal of aid to airlines and money to help restaurants stay open. But analysts said the path to an agreement remained unclear, while jitters are rising over the prospect of a contested presidential election on Nov. 3 that could leave the outcome of the contest in limbo for weeks. Read: Why investors are starting to freak out about the 2020 presidential election Related:2000 redux? Stock-market election fears have investors revisiting Bush-Gore battle \"You've got all these crosscurrents at play which creates a violent back and forth,\" noted Andrew Smith, chief investment strategist of Dallas-based Delos Capital Advisors. \"Drawdown events don't usually happen so quickly - we had like a downward 'swoosh'.\" Smith said it's becoming increasingly clear that investors had indeed priced in another round of fiscal stimulus. \"What I think the market is craving now is the stimulus package,\" he told MarketWatch. Economic momentum waned as the first round of support expired, Smith noted. \"It's important that fiscal policy take the baton from monetary policy. More monetary stimulus will just inflate risk assets. We need to send paychecks to people in the service industry.\" In economic reports, orders for durable goods rose 0.4% in August, the fourth straight gain but a more modest increase after three straight strong gains, the government said Friday. Economists had forecast a 1.5% increase in orders for durable goods in August. Orders were up a revised 11.7% in July and 7.7% in June.Which companies were in focus? Shares of Costco Wholesale Corp. COST, +1.19%  were down 1.3% despite topping earnings and revenue expectations for its fiscal fourth quarter. Novavax NVAX, +0.18%  shares jumped nearly 11% after the company said Thursday it has started a final-stage study of its experimental COVID-19 vaccine in the U.K. Sunworks Inc. stock SUNW, -1.67% sank more than 46% after a recent rocket ride higher for the photovoltaic-based power systems company. Zillow Group Inc. ZG, -0.42%  raised its outlook for home price growth over the next year, as sales and prices have stayed strong through the summer given increasingly short inventory and continued strong demand. Shares of Zillow were up nearly 4%. Cruise operator stocks surged Friday after Barclays analysts turned bullish. Shares of Norwegian Cruise Line Holdings Ltd. NCLH, +2.91%  were 13% higher, while Carnival Corp. CCL, +0.51% shares gained 9.7%. Honeywell International Inc. HON, +0.34% shares were 1.8% higher after the company announced plans to hike its dividend. How did other markets fare? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was one basis point lower at 0.656% after the durable-goods report. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, a gauge of the greenback's value relative to its major rivals, was up 0.3%, notching its steepest weekly climb since late April. Gold futures GCZ20, +2.17% retreated, settling $10.60 lower, down 0.6%, at $1,866.30 an ounce, on track for its worst week since March. U.S. oil futures CLX20, -1.62% fell 6 cents, or nearly 0.2%, amid demand concerns in the face of rising case counts, to settle at $40.25 a barrel on the New York Mercantile Exchange. The pan-European Stoxx Europe 600 Index SXXP, +0.55% closed 0.1% lower, at 355.51, and the U.K.'s benchmark FTSE 100 FTSE, +0.63% rose 0.3% to close at 536.50. In Asia, Hong Kong's Hang Seng Index HSI, -0.30% declined 0.3% and the Shanghai Composite Index SHCOMP, +1.67% finished the session 0.1% lower. Japan's Nikkei NIK, -0.11% gained 0.5%. Read next:How far do stocks have to fall for Washington to take action? You may not like the answer William Watts contributed reporting."}]}