{"article": [{"url": "https://www.marketwatch.com/story/risks-are-mounting-for-us-stocks-heres-where-investors-should-look-instead-says-blackrock-2020-07-20", "published": 1595312780.0, "headline": "Risks are mounting for U.S. stocks. Hereâ\u0080\u0099s where BlackRock says investors should look instead.", "body": "Europe has a â\u0080\u009cleg upâ\u0080\u009d over other regions, including the U.S. and emerging markets, as the global restart gathers pace, BlackRock strategists said. BlackRock Investment Institute remained neutral on U.S. equities, citing â\u0080\u009cthe risk of fading fiscal stimulus and election uncertainty,â\u0080\u009d and overweight on European stocks after upgrading the region in its midyear outlook, it said in a note earlier this week. It said European stocks offered the â\u0080\u009cmost attractive regional exposureâ\u0080\u009d to a varying global reopening. A growth pickup would typically benefit emerging markets, it said, but in this instance Europeâ\u0080\u0099s robust health infrastructure and policy response left it better placed. New cases in Europe, which was once the epicenter of the virus, have gradually reduced from a peak in April, while infections in Latin America have risen, as shown in the chart below. â\u0080\u009cEuropeâ\u0080\u0099s health capabilities and containment measures position the region well for a domestic recovery. European companies are also highly geared to an improvement in global trade and recovering Chinese economy,â\u0080\u009d global chief investment strategist Mike Pyle said. â\u0080\u009cImportantly, the monetary and fiscal support to cushion the virus shock is stronger in Europe than in EM countries and Japan â\u0080\u0094 and there is space and appetite for additional stimulus,â\u0080\u009d Pyle added. Technology-focused Asian countries were showing early signs of a pickup in trade and could also benefit, he added. European stocks climbed early on Tuesday after EU leaders agreed a â\u0082¬1.8 trillion ($2.1 trillion) budget and coronavirus recovery package. The German DAX DAX, +0.06% Â turned positive for the year after the deal was struck. The chart BlackRock Investment Institute."}]}