{"article": [{"url": "https://www.marketwatch.com/story/fed-caps-bank-dividend-payments-and-suspends-share-buybacks-for-third-quarter-after-stress-tests-2020-06-25", "published": 1593161960.0, "headline": "Fed caps bank dividend payments and suspends share-buybacks for third quarter after stress tests", "body": "The Federal Reserve on Thursday voted to require large banks to preserve capital by suspending share repurchases and cap dividend payments in the third quarter. In a 4-to-1 vote, the Fed will tie the distribution of dividends to a formula based on recent income. The formula sets third-quarter dividends at a level equal to average net income over the past four quarters. Fed Gov. Lael Brainard dissented from the decision. By that calculation, some banks may have to cut their dividends. A senior Fed official said this could be “binding” for some banks. In her dissent, Brainard said: “I do not support giving the green light for large banks to deplete capital,” arguing instead for a blanket suspension of dividends. A senior Fed official said the Fed will go forward on a quarter-by-quarter basis. And banks’ net income might be reduced given the impact of the pandemic. The stress tests cover 34 banks, including five foreign firms. In a statement, the Financial Services Forum, a trade group of the eight largest banks, said they “understand the Fed’s decision regarding capital returns through the third quarter.” The banks urged the Fed to be transparent with the banks going forward. The Fed released two studies — a traditional stress test set in February before the pandemic and an analysis of bank capital under three ways the economy might evolve in coming quarters amid the public-health crisis, roughly a V-shaped, U-shaped and W-shaped scenarios. The traditional stress test showed that all large banks remain well-capitalized. Under the very worst of the COVID-19 scenarios, “many” banks would be operating within their stress capital buffers and a quarter of the banks would be getting close to minimum capital standards, Brainard said. “Past experience shows that banks operating close to their regulatory minimums are much less likely to meet the needs of creditworthy borrowers, and the resulting tightening of credit conditions could impair the recovery,” she added. The Fed said it would require banks to reassess their capital needs and resubmit capital plans later this year. The stress test capped a day of several actions by the Fed and other regulators. First, the Fed , the Financial Deposit Insurance Corp. and the Office of the Comptroller of the Currency, the Securities and Exchange Commission and the Commodity Futures Trading Commission, voted to finalize changes to the Volcker Rule, which limits bank trading for their own portfolio. The Fed, FDIC, OCC, the Federal House Finance Agency and the Farm Credit Administration voted to eliminate bank inter-affiliate margin requirements. Gregg Gelzinis, senior policy analyst for economic policy at the Center for American Progress, criticized the changes to the Volcker Rule, saying it will permit investment in highly-risky fund vehicles. Lifting the margin requirements reduces ability of banks to absorb losses if one of its affiliates cannot meet its swap obligations. “Both these final rules reject important lessons learned in the last financial crisis, putting workers and families at greater risk,” Gelzinis said."}]}