{"article": [{"url": "https://www.marketwatch.com/story/landlords-sue-cdc-trump-administration-over-unconstitutional-national-eviction-moratorium-2020-09-23", "published": 1600939040.0, "headline": "Landlords sue CDC, Trump administration over 'unconstitutional' national eviction moratorium", "body": "At least two lawsuits filed in federal court argue that the national eviction moratorium issued by the U.S. Centers for Disease Control and Prevention and the Trump administration earlier this month is unconstitutional. The National Apartment Association, a trade group that represents the apartment segment of the rental housing industry, recently joined a lawsuit filed in a Georgia federal district court seeking to roll back the moratorium. The lawsuit was brought by a group of landlords and the New Civil Liberties Alliance, a nonprofit organization that describes itself as seeking to protect civil rights and constitutional freedoms \"from violations by the Administrative State.\" The lawsuits claims that the CDC's moratorium \"violates the U.S. Constitution because the CDC has not identified any act of Congress that confers upon it the power to halt evictions or preempt state landlord-tenant law,\" the New Civil Liberties Alliance said in a summary of the court filing. \"Agencies have no inherent power to make law, and nothing in the relevant statutes or regulations gives CDC the power or authority to issue an eviction-moratorium order,\" the organization said. The group also argues that the CDC's order essentially \"commandeers\" state officials, including judges and law enforcement officers, to implement federal law. Read more: Renters in U.S. cannot be evicted through the end of the year due to coronavirus, CDC order states Meanwhile, a group of property owners in a Tennessee filed a separate lawsuit in federal district court similarly arguing that the CDC's moratorium is unconstitutional. This case claims that by issuing the order, the CDC has prevented landlords from accessing due process with respect to the properties they own. \"Plaintiffs readily acknowledge the nobility of the CDC's and, by extension, the executive branch's, desire to help those profoundly affected by the current health crisis,\" the suit states. \"However, that help must conform to the law and must not infringe unlawfully upon the rights of others.\" Rental-housing industry officials have warned that the CDC's order could have devastating effects on landlords, particularly smaller \"mom-and-pop\" landlords who own only a handful of properties. \"The CDC eviction moratorium will surely cause more economic harm than it prevents,\" said David Howard, executive director of the National Rental Home Council, another industry trade group. \"It puts renters in a position of having to pay back rent that they likely won't have, while causing immediate hardship for property owners who have no means of carrying the costs of ownership.\" Now that the moratorium is in effect, Howard said, many property owners have come to the conclusion that they may not be able to afford to stay in business. (The National Rental Home Council is not party to either of the lawsuits against the CDC.) The National Multifamily Housing Council, which has not signed onto either lawsuit, has questioned the legality of the moratorium, Paula Cino, the organization's vice president of construction, development and land use policy, said. But Cino's organization has chosen to focus on seeking rental assistance. \"It is far better to focus on ensuring renters can pay the rent than to try and come up with policies like eviction moratoriums that do not address the root cause and put housing providers at financial risk,\" she said. On this point, affordable-housing experts agree with the rental industry. \"Rather than suing for the right to evict during a pandemic, landlords should be working with renters to ensure Congress provides at least $100 billion in emergency rental assistance to help renters avoid a financial cliff when the moratorium expires and to help landlords continue to operate their rental homes,\" said Diane Yentel, president and CEO of the National Low Income Housing Coalition. Affordable-housing experts further argued that the two lawsuits against the CDC's order are unlikely to be successful. Landlords have previously attempted to challenge state moratoria on evictions using the same arguments as these two federal cases, said Eric Dunn, director of litigation at the National Housing Law Project. \"Every single case filed previously was dismissed for lack of merit, and we think the same thing should happen with these new cases,\" Dunn said. Also see: What landlords are saying about the CDC's eviction ban And while the CDC has issued its moratorium, evictions are still making their way through state and local courts nationwide. The CDC's order doesn't automatically protect tenants from being kicked out of their homes for failure to pay the rent amid the coronavirus pandemic. Instead, renters must proactively sign a document stipulating that they cannot pay and provide that document to their landlord. Legal experts have also suggested that loopholes in the order could allow for evictions to occur. As of Monday, roughly 3,500 eviction cases had been filed by private-equity firms and other corporate landlords, according to information collected by the Private Equity Stakeholder Project, an initiative that seeks to monitor these firms. In the last week alone, more than 1,860 cases had been filed. \"Corporate landlords are moving quickly to file evictions before renters can make use of the protections,\" Yentel said. \"As the CDC order makes clear, eviction poses significant harm to individuals, their communities, and our broader public health as we collectively work to contain the coronavirus pandemic and prevent unnecessary deaths.\""}]}