{"article": [{"url": "https://www.marketwatch.com/story/survivors-talk-about-the-aftereffects-of-covid-19-2020-07-14", "published": 1594703240.0, "headline": "Survivors talk about the aftereffects of COVID-19", "body": "This article is reprinted by permission from NextAvenue.org. When someone with COVID-19 leaves the hospital, doctors’ discharge instructions and the media tend to focus on physical recovery, which can be difficult. But we hear much less about the psychological toll. Coronavirus survivors often have psychological effects ranging from anxiety to depression to PTSD. Many recovering from the disease feel stigma. Megan Hosey, an assistant professor at Johns Hopkins Medical School and a clinical psychologist who works in the ICU and a COVID-19 inpatient rehab unit, says some recovering from the coronavirus live with survivor’s guilt. “They’re concerned that a loved one or a neighbor might have picked it up, and the patient is very concerned that they might be judged for that,” says Hosey. “Some of our patients are talking about survivor’s guilt. For example, if a loved one died of the disease, the question might remain in their mind, ‘Why did I make it but my loved ones didn’t?’” Here are stories of two people who’ve been dealing with the aftereffects of coronavirus, plus advice from Hosey on coping with the emotional strain of COVID-19:Esther Aguayo Rocha: Back living together, but separately Esther Aguayo Rocha, 73, considers herself healthy despite having pre-existing conditions that made her more susceptible to severe COVID-19 disease — high blood pressure, diabetes and a kidney transplant. She wound up in the hospital with coronavirus for 10 days, some of it in the ICU, and then isolated at home for 2½ weeks. Due to the coronavirus, Rocha, who is retired and formerly ran a day care center, developed acute kidney injury. That’s an abrupt kidney dysfunction, a common consequence of severe COVID-19. Also see: Here’s how the U.S. could save 45,000 people from dying of COVID-19 by November According to the National Kidney Foundation, 15% of patients hospitalized with the coronavirus and 20% or more of those who have been in an ICU get acute kidney injury. The acute kidney injury led to swelling and problems with her electrolytes. “I couldn’t even text because it felt like my fingers were twice their size,” says Rocha. After being discharged, Rocha’s adult daughter and son made a “sick area’ for her — to keep her husband Arturo safe. “They did a barricade of plastic so I wouldn’t escape from my two rooms. I wanted to, let me tell you,” she says. Living together apart in the same house, the couple would call each other or speak from open windows. “I still couldn’t hear him from the window, so we used to get the phone and we would talk to each other through the window. He would be outside the house and I’d be inside the room,” Rocha says. Her recovery took time. Still weak, Rocha could walk from one room to another and then needed to rest in bed. Her children took turns coming over to cook and do housework. When Rocha finally left her house in her daughter’s car, she felt like the world had changed. “I kept looking, ‘Oh wow! Oh, wow!’ [My daughter] goes, ‘Mom, you’ve already seen all this before.’ I go, ‘I know, but I’m seeing it again,’” Rocha says. She is thankful that her kidney function has since returned to normal. Rocha is still cautious, however. “If you’re asking me if I’m scared to be out there? Oh yes, I’m very scared,” she says. For now, she relishes the small things in life that give her joy. “Sometimes, I’ll tell my husband, ‘You know what? I want a hamburger.’ He would say, ‘OK, let’s go for a ride.’ We’ll go for a ride and bring it home. That’s all I’ve done. Then in the evening time, we usually go outside in the backyard and just look at the flowers.”Nick Lê: Deluged by paperwork and memories Nick Lê, 64, a former refugee who fled Vietnam by boat at 22, compares surviving COVID-19 to living through the destruction of his hometown, Hue, during the carnage of the 1968 Tet Offensive. “That wartime, we can see the enemy, we can see the bullets and weapons,” says Lê, a retired engineer in Milpitas, Calif. “But now you don’t see the enemy. It comes from nowhere. So, it’s scary.” His wife (he prefers to keep her name private), as well as his son and daughter in their 30s, contracted the coronavirus, too. Lê struggled with COVID-19 at home; the rest of his family went to the hospital. Also see: Coronavirus can spread in the air ‘beyond any reasonable doubt,’ over 200 scientists tell the World Health Organization Lê’s wife, then 64, and his son were put on ventilators. His son came home after 17 days. His wife died in the hospital; she was on a ventilator for roughly three weeks. For years, Lê and his wife had talked about advance care planning and estate planning. She had helped others do that in her job as a Realtor. But the couple never got around to it. See: Do your family a favor and make your wishes clear with an advance medical directive “We’d say, ‘Oh it’s no hurry. OK, next month, then next month, then next month.’ And it ended up we hadn’t had time to do it. It just happened so quick and unexpected. Everything fell through a crack. A big crack,” says Lê. Still grieving, Lê has had to deal with a deluge of paperwork from his wife’s unfinished business affairs. “My mentality is still somewhere in the middle of the sky,” he says. “I cannot concentrate. I am still in a state of denial. I’m facing a lot of memories. Pictures of my wife everywhere, her clothing, her stuff is still all over. How can I deal with it?” The couple had been together since they married at 22 and fled Vietnam together. “Truly we built our own life from bare hands. She’s gone now. I really miss her. I think somebody said our love was really rare to see. And I agree,” says Lê. Some of his friends who contracted COVID-19 have been struggling with other aftereffects. A few have ongoing memory problems. One needs an oxygen tank and can’t walk on his own. He is depressed. “You can die because of depression,” Lê says. For now, he is staying in isolation with his son and waiting for time to help heal his sadness. “It’s just like a fresh wound. It’s always hurt and pain. I spend time in my garden. My wife used to enjoy a lot of backyard flowers. I keep continuing to take care of that. To make her pleased.”Two ways to cope with the emotional strain after COVID-19 Hosey offers the following two tips to cope with the emotional strain after surviving the coronavirus: Educate yourself. “The number one thing that loved ones can do is just be aware that some of these symptoms are possible,” says Hosey. Try to stay up to speed physically and mentally. Hosey says staying active reduces ICU-acquired weakness and may improve cognitive and mental health outcomes as well. “You will want to be working with your [medical] team as much as you can and getting up and active, even if you’re still feeling confused or tired,” says Hosey. Dr. Christine Nguyen is a clinical assistant professor at Stanford University Medical School and an online and audio journalist. She was a Gerontological Society of America Journalists in Aging Fellow. Find her on Twitter (@christinenguyen) and on her website. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}