{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-join-global-rally-as-sp-500-nears-record-2020-08-04", "published": 1596500600.0, "headline": "Asian markets join global rally as S&P 500 nears record", "body": "Shares advanced across Asia on Tuesday after Wall Street closed broadly higher on encouraging economic reports, starting off August by closing within 3% of the record high it set in February. Investors appear to be shrugging off surging coronavirus caseloads in dozens of countries. Japan’s Nikkei 225 NIK, -0.11% gained 1.4% while Hong Kong’s Hang Seng index HSI, -0.30% advanced 0.8%. The Shanghai Composite SHCOMP, +1.67% inched up 0.1% and the smaller-cap Shenzhen Composite 399106, +3.09% retreated 0.5%. South Korea’s Kospi 180721, +0.21% gained 1%, and benchmark indexes in Taiwan Y9999, +1.10% , Singapore STI, -0.39% and Indonesia JAKIDX, +0.28% edged up. Australia’s S&P/ASX 200 XJO, +0.00% rose 1.7%. The Reserve Bank of Australia was scheduled to make an announcement Tuesday on interest rates following its latest monetary policy meeting. It is widely expected to leave rates unchanged. Overnight, the S&P 500 SPX, +0.87% added another 0.7% onto its four-month winning streak, closing within 3% of the record high it set in February, at 3,294.61. Big Tech led the way higher again, and Microsoft MSFT, +2.48% and Apple AAPL, +1.74% alone accounted for most of the S&P 500’s gain. The rally followed reports showing that manufacturing has improved across much of the world, including in China, Europe and the United States. With the total caseload rising by less than 50,000 for two straight days, investors bet that U.S. outbreaks might be moderating, said Jeffrey Halley of Oanda. “Hopes rose that the U.S. might avoid a deeper recession, which was all financial markets needed to send equity markets higher, and for the U.S. dollar to continue recovering some of its recent losses,” Halley said in a commentary. The Dow Jones Industrial Average DJIA, +0.56% rose 0.9% to 26,664.40, while gains for tech stocks, particularly Microsoft and Apple, pushed the Nasdaq composite COMP, +1.39% 1.5% higher, to 10,902.80, another record. Microsoft jumped 5.6% Monday after it confirmed that it’s in talks to buy the U.S. arm of TikTok, a Chinese-owned video app that is very popular but has also drawn the White House’s scrutiny. Microsoft said its CEO, Satya Nadella, has discussed the issue with President Donald Trump, and the tech giant expects the talks with TikTok to end no later than Sept. 15, either with a deal or without. Apple added 2.5%, piling more gains onto its 10.5% rise Friday following a blowout report showing that its profits during the spring easily topped Wall Street’s expectations. In Washington, slow, grinding negotiations on another huge relief effort for the U.S. economy continue, with both the Trump administration negotiating team and top Capitol Hill Democrats reporting progress over the weekend. The discussions have added urgency now that $600 in weekly benefits from the federal government for laid-off workers have expired, just as the number of layoffs ticks up amid a resurgence of coronavirus counts and business restrictions. The continued spread of the coronavirus is raising worries that the economy could backslide again and snuff out the budding improvements it’s shown. Through the pandemic, though, Big Tech has remained almost immune to such concerns on expectations that it can continue to grow. Apart from the “wall of money” buttressing markets thanks to massive monetary stimulus and government spending, it seems that “investors are already inoculated from the virus while camping under the tech umbrella,” Stephen Innes of AxiCorp. said in a commentary. Meanwhile, across the market corporate profits have exceeded analysts’ expectations. Roughly two-thirds of the way into earnings season, 84% of S&P 500 companies have reported stronger results than expected, according to FactSet. In other trading, the yield on the 10-year Treasury rose to 0.56% from 0.55% late Monday. Benchmark U.S. crude US:CLU20 lost 28 cents to $40.73 per barrel in electronic trading on the New York Mercantile Exchange. It rose 1.8% to settle at $41.01 per barrel on Monday. Brent crude UK:BRNV20 , the international standard, slipped 31 cents to $43.84. It climbed 1.4% to $44.15 per barrel on Monday. The U.S. dollar USDJPY, -0.38% bought 106.12 Japanese yen, up from 105.96 yen late Monday."}]}