{"article": [{"url": "https://www.marketwatch.com/story/fiscal-stimulus-prospects-at-dead-end-after-senate-vote-a-top-republican-says-11599767437", "published": 1599753500.0, "headline": "Fiscal stimulus prospects at dead end after Senate vote, a top Republican says", "body": "US Senator John Cornyn (L), Republican of Texas, and US Senator Richard Shelby (R), Republican of Alabama, both wearing masks to protect themselves and others from COVID-19 leave following the weekly Republican policy luncheon on Capitol Hill in Washington May 5, 2020. (Photo by SAUL LOEB / AFP) (Photo by SAUL LOEB/AFP via Getty Images) Hopes for a new coronavirus aid package soon may not be dead yet on Capitol Hill, but they are fading fast. After Democrats blocked a Senate Republican bill on the Senate floor Thursday, the way forward is unclear, several senators said. If a package can’t advance on its own, it would need to be married to a temporary spending bill, a prospect that’s already been ruled out. Asked if fiscal stimulus efforts were over until after the November elections, Sen. Richard Shelby, the Alabama Republican who heads the Senate Appropriations Committee, said, “It looks that way.” “You know, you never know around here. Sometimes things look bleak and they revive, and so forth. But we thought the scaled down version was a good bill, good timing and everything else. The Democrats obviously thought otherwise.” To advance, the Republican bill needed 60 votes. It only received 52, which was still something of a victory for Senate Majority Leader Mitch McConnell. On Wednesday, McConnell had declined to say he had even 51 of his party conference’s 53 votes. No Democrats voted in favor of the bill and one Republican, Rand Paul of Kentucky, crossed the aisle to also vote against it. The bill would have revived a federal add-on payment on top of state jobless benefits, set higher legal liability standards for suing over contracting coronavirus, and renewed Paycheck Protection Program to help keep small businesses afloat. Sen. John Cornyn, a Texas Republican, said “I think it’s a 50-50 proposition at this point. I just don’t know to what extent our Democratic colleagues want a deal.” Democrats have held fast to their stance that a bill has to be big one. They have come down to a price tag of $2.2 trillion, $900 billion above Trump the administration’s last offer of $1.3 trillion. The so-called skinny bill Senate Republicans were trying to pass Thursday was even smaller, touted as costing about $500 billion. With House Democrats having approved an even bigger bill than their current offer in May, and Senate Republicans having a bill they can point to as their unified offer, lawmakers in both parties have votes they can talk up in their electorates, even if nothing gets passed until after the election. The last, best hope for a stimulus package probably lies in just parts of it being included in a deal to keep the government open past Sept. 30. House Speaker Nancy Pelosi, Treasury Secretary Steven Mnuchin and McConnell have all agreed to work out a stopgap spending bill, even if they haven’t agreed on significant details, like how long its duration should be. Pelosi at her weekly press conference was adamant Thursday on keeping the issues separated. “No, that’s not going to be in there,” she said when asked if some coronavirus aid could ultimately be included."}]}