{"article": [{"url": "https://www.marketwatch.com/story/buffetts-berkshire-buys-gold-miner-barrick-slashes-wells-fargo-and-jpmorgan-stakes-amid-coronavirus-2020-08-14", "published": 1597426340.0, "headline": "Buffett's Berkshire buys gold miner Barrick, slashes Wells Fargo and JPMorgan, dumps Goldman stake amid coronavirus", "body": "Warren Buffett's Berkshire Hathaway Inc. BRK.A, +0.06% BRK.B, +0.24% unloaded more than a quarter of its stake in Wells Fargo & Co. WFC, and about 61% of its position in JPMorgan Chase JPM, -0.57%, while acquiring a new position in Barrick Gold Corp. GOLD, +2.86%, according to 13F filings with the Securities and Exchange Commission for the period ended Jun 30, that were released Friday afternoon. Berkshire's moves appeared to reflect a broad lightening of the conglomerates exposure to large-capitalization banks during the worst public health crisis in generations. Berkshire sold 85.6 million shares of Wells Fargo, representing about 26% of its stake and putting its ownership to about 3% from 5.3%. The insurance conglomerate also shed 35.5 million shares of JPMorgan, 61% of its position, which now represents 1% of Berkshire's overall portfolio from 3% in the prior period. Meanwhile, the investment firm acquired nearly 21 million shares of Barrick Gold worth $563 million, representing 0.3% of Berkshire's holding. Berkshire also reduced its holding in PNC Financial Services PNC, -0.91%, selling 3.85 million shares to cut its position to 0.3% from 0.5%. The insurance conglomerate boosted its stake in grocery chain Kroger Co. KR, +0.46% by 15%, purchasing 3 million shares. The report also showed that Buffett's firm dumped its entire stakes in Goldman Sachs GS, -0.21%, Occidental Petroleum Corp. OXY, -3.22%, as well as consummating an exodus of airline companies, including American Airlines Group Inc. AAL, +0.34%, Delta Air Lines DAL, +0.39% United Airlines UAL, +0.32% and Southwest Airlines Co. LUV, +1.89%. Berkshire didn't change its holdings in Apple Inc. AAPL, +1.74%, where the firm owns at 245.156 million shares. Large investors must disclose long stock positions held at the end of a quarter 45 days later in a 13F filing with the SEC, which means such filings are merely a snapshot of an investor holdings at a given point. Berkshire Class A and B shares are down by about 0.6% and 0.5% at Friday's close. Meanwhile, shares of Wells Fargo were down 0.8% in after-hours trade on Friday, JPMorgan shares edged 0.1% lower, while Barrick's stock was up 3.9% after Friday's closing bell. The Dow Jones Industrial Average DJIA, +0.56% booked a meager gain on the day, while the S&P 500 index SPX, +0.87% and technology-laden Nasdaq Composite Index COMP, +1.39% closed in negative territory. However, all three benchmarks booked weekly gains."}]}