{"article": [{"url": "https://www.marketwatch.com/story/who-will-replace-shinzo-abe-5-things-investors-need-to-know-about-japan-prime-ministers-resignation-2020-08-28", "published": 1598627780.0, "headline": "Who will replace Shinzo Abe? 5 things investors need to know about Japan prime minister's resignation", "body": "Shinzo Abe, the prime minister of Japan, is stepping down, but don't look for his successor to immediately abandon the economic program known as Abenomics, which began as an aggressive mix of monetary stimulus and calls for structural reforms. Abe's resignation nonetheless raises questions about the world's third largest economy. Here's what investors need to know:Why did he resign? Abe, 65, on Friday announced he would step down due to an intestinal illness that he feared would keep him from completing his duties. The prime minister, who has held office since 2012, said he would leave once a successor has been chosen - a process that could take months. Abe's first term as prime minister was cut short in 2007 due to the same illness, and while speculation over a potential resignation had risen over the past couple of weeks the move sparked a selloff in Japanese equities on Friday, with the Nikkei 225 Index NIK, -0.11%  ending the day down 1.4%. The Japanese yen USDJPY, -0.38%  soared, as it often does during periods of domestic turmoil when Japanese investors reflexively repatriate overseas investments. The U.S. dollar dropped 1.1% to ¥105.41 on Friday, with weakness versus the Japanese currency contributing to a 0.7% fall for the ICE U.S. Dollar Index DXY, -0.58%, a measure of the greenback against a basket of six major rivals.Who will replace him? Abe's term runs out next year. Japan's parliament is responsible for electing prime ministers, which effectively leaves the choice with Abe's ruling Liberal Democratic Party. A vote, likely by party lawmakers or other leaders, is expected next month, The Wall Street Journal reported, though analysts have warned the process could take longer. Potential successors include Shigeru Ishiba, a former minister for defense and regional vitalization and long Abe's top rival within the Liberal Democratic Party, according to Chris Scicluna, economist at Daiwa. Ishiba is the most popular with the public. Japan watchers say other potential candidates include Defense Minister Taro Kono, former Foreign Minister Fumio Kishida, Chief Cabinet Secretary Yoshihide Suga, Economy Minister Yasutoshi Nishimura, Health, Labor and Welfare Minister Katsunobu Kato, and Foreign Minister Toshimitsu Motegi.What did Abe accomplish? Abe led the LDP to victory in 2012 by vowing that he would force the Bank of Japan to unleash aggressive monetary stimulus alongside an increase in government spending while working to reduce regulatory hurdles and other economic inefficiencies - an approach dubbed \"Abenomics.\" Those efforts get mixed reviews from economists. The focus of Abenomics underwent a significant shift during Abe's tenure, said Shigeto Nagai, head of Japan economics at Oxford Economics. Initially billed as a reflation policy centered on a \"shock-and-awe\" approach to monetary policy, it initially boosted corporate profits and sentiment through a weaker yen and rising corporate profits, Nagai said. But momentum fizzled out and it failed to produce significant wage gains, leaving domestic demand to falter. After the Bank of Japan instituted yield-curve control in 2016, he stopped pushing the central bank to do more despite repeated downward revisions in inflation forecasts, Nagai noted. Abe has ducked making politically painful structural reforms in public finance, pensions, the health insurance system, and migration policy, Nagai said, while maintaining that Abenomics will boost nominal economic growth through a productivity miracle in order to justify a plan to rein in fiscal spending that doesn't include painful reforms. \"Abe's successor will inherit these unsolved longstanding structural problems and will not have the luxury of further postponing them because the adverse demographics will start to accelerate in the coming years,\" he said.What happens to policy? Economists and investors see little reason for any major policy shifts by Abe's eventual successor, though markets may remain more volatile during the transition phase. Speculation regarding the fate of Bank of Japan Gov. Haruhiko Kuroda could rise, however, and some potential candidates to succeed Abe , such as Ishiba and Kono, have called for more clarity on how the central bank will exit its hyper-accommodative monetary policy stance, Scicluna said. Skeptics see little reason for a successor to make waves. Abe's decision early last decade to pursue ambitious monetary easing and regulatory reform positioned Japan as one of the few low-interest-rate markets and a region of stability during periods of turmoil, said Eva Sun-Wai, a fund manager at M&G Investments, in a note. \"Now, with global rates having fallen in line with Japan, there isn't much reason for them to drastically shake up monetary or fiscal policies,\" she said..What could unnerve investors? While analysts largely expect Abe's economic policies to remain in place, concerns about political stability could be a bigger driver of financial market volatility. Abe earlier in the week became Japan's longest-serving prime minister as measured by consecutive days in office. A return to a rotating cast of premiers could prove unsettling, analysts said. \"Prior to Abe's second term, Japan suffered through a revolving door period of six prime ministers in six years. A return to these constantly shifting political sands could weigh on Japan's markets,\" wrote analysts at UBS Securities, in a Friday note."}]}