{"article": [{"url": "https://www.marketwatch.com/story/opinion-the-real-reason-that-mary-trumps-tell-all-book-matters-11594229111", "published": 1594215200.0, "headline": "The real reason that Mary Trump's tell-all book matters in the presidential election", "body": "A new book by Mary Trump, President Donald Trump 's niece, is already getting media coverage with its official publication date still several days away. Journalists who have gotten advance copies of the book, Too Much and Never Enough: How My Family Created the World's Most Dangerous Man, report that the book contains some nuggets that are sure to attract attention. For example, Mary Trump alleges that her Uncle Donald paid someone to take a college-entrance test, the SAT, for him. She also claims that Donald Trump lasciviously remarked upon her body when she wore a bathing suit at a family gathering. Publication of the book is also an occasion for revisiting bombshell stories we already know about-for instance, the 2018 New York Times report alleging that Donald Trump and other family members relied on tax evasion and fraud to avoid paying taxes on hundreds of millions of dollars (Mary Trump has revealed she was a key source for the Times story). Trump critics are of course eager to exploit incendiary revelations that could damage Trump politically. Mary Trump's book is certainly not good news for the president, and signals new trouble for his campaign-though perhaps not in the way the president's opponents expect. There is no guarantee that any new revelation, no matter how dramatic, will sink Trump. We've seen him survive enormous scandals, including the Access Hollywood recording, the Mueller report and related prosecutions and incarcerations of Trump associates, extramarital affairs and reported payoffs to two mistresses, impeachment for an attempt to extort electoral assistance from a foreign country, and recent reports that Trump failed to take action after learning of U.S. intelligence concerns that Russia was paying bounties for the murder of American soldiers in Afghanistan. That's not to say these or other bombshells are irrelevant-they may well have contributed to Trump's deficit in the polls and could do so again with his niece's book-but we're past a point where we can expect any scandal, no matter how big, to topple his presidency. There is simply no indication that congressional Republicans will abandon Trump, no matter what happens. The real problem for Trump, however, is that the book is yet another distraction for an easily distractible president. The election is now less than four months away. At this point in the 2016 cycle, Trump was successfully beating the drum on the issues that would define the campaign-his promise to build a wall Mexico would pay for, Hillary's emails, supposedly dangerous immigrants threatening to invade America. The Republican national convention took place July 17-18-in other words, at almost precisely the same stage in the cycle that we stand at now in 2020. No one would call Trump's 2016 campaign well-organized, but he had gotten his preferred themes locked into the narrative by mid-July. People knew what he stood for (the wall, anti-immigrant policies, reworking trade deals) and what he was against ( Hillary Clinton 's supposed corruption, immigrants, Muslims). It was no surprise to hear chants of \"lock her up\" at the July 2016 Republican convention. It followed predictably from the narrative Trump had pounded home, a narrative that dominated media coverage of the campaign. This time around, Trump is having far less luck controlling the narrative. His campaign argues that there's still time for him to make a move-as he did in 2016. That's possible, of course. His supporters can point to October 2016, when then-FBI director James Comey 's last-minute announcement about Clinton's emails likely gave Trump an edge he needed to win the election by a razor-thin margin in three states that decided the Electoral College. The problem for Trump, as he hopes to relive history (much of his 2020 campaign, like the 2016 effort, is built on nostalgia-this time, that includes an effort to relive the 2016 campaign itself), is that it's later than he thinks. He was able to benefit from the Comey letter because he had stayed close to Clinton through the summer of 2016-which depended in large part on his ability to control the narrative. So far, 2020 does not look like 2016. For one thing, Joe Biden leads Trump in the polls by significantly more than Clinton did. Another difference from 2016 is that Trump is now the incumbent, and is struggling with multiple crises that dominate headlines and constantly put him on defense. He has had no luck advancing an anti-Biden narrative-remember the Zelensky phone call from last year? Trump had hoped to smear Biden with the same shadowy allegations of corruption that he successfully dumped on Clinton. But the script just hasn't worked for Trump this time-in part, perhaps, because Trump was caught and impeached, but also because the coronavirus pandemic and resulting economic downturn have dominated headlines. Trump has been so busy trying to convince Americans that the pandemic is no big deal that he hasn't even found enough time to settle on the right playground insult to use as a nickname for Biden. It's clear that Trump would like to use racism as a galvanizing energy for his base-substituting protesters seeking racial justice, Confederate monuments, and the Confederate flag for immigrants and the border wall. But Americans may simply have had enough-similarly racist scare tactics did not work for Trump and Republicans in the 2018 midterm elections. There is evidence that the center of gravity on race has shifted away from Trump, leaving his race-baiting tactics so far outside the mainstream that even Sen. Lindsey Graham was forced to seek some distance from the president. There may or may not be more bombshells to come from Mary Trump's book. But, from Biden's perspective, this is beside the point. The mere fact that the book is appearing in news headlines is another distraction that makes it harder for Trump to play offense with the election now less than four months away. With Trump unable to control the narrative as he did in 2016, the election is shaping up as a referendum on the president-\"America or Trump\" as a Lincoln Project ad recently put it. Nothing is impossible, and of course the election results aren't guaranteed, but what may be most significant about his niece's book is that it's yet another reminder of how 2020 is different than 2016, and that, for Trump, it's later than he thinks. Chris Edelson is an assistant professor of government in American University's School of Public Affairs. He has written two books on presidential power, and recently wrote a book chapter describing the problem of constitutional failure in the United States."}]}