{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-hold-ground-as-bond-market-looks-past-landmark-deal-on-eu-recovery-fund-2020-07-21", "published": 1595347640.0, "headline": "Two-year Treasury yield lowest in more than two months as bond market looks past deal on EU fiscal stimulus package", "body": "U.S. Treasury and European bond yields showed muted reaction on Tuesday to a deal on the European Union’s recovery fund, which will deploy billions of euros across its member states to cushion the economic blow from the coronavirus-driven downturn.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 1.3 basis point to 0.606%, while the 30-year bond yield TMUBMUSD30Y, 1.576% edged 0.5 basis lower to 1.313%. The 2-year note rate TMUBMUSD02Y, 0.156% was declined 0.6 basis point to 0.143%, around its lowest level in more than two months. What’s driving Treasurys? EU leaders agreed to jointly borrow €750 billion ($857.8 billion) of funds for a fiscal stimulus package that would support the hardest hit economies in the 27-member economic bloc. An agreement was also reached on the EU’s budget over the next seven years, amounting to €1074 billion. The deal will see €390 billion given as grants to individual countries, with the rest coming from loans, lower than the proposed €500 billion in grants. Investors had mostly anticipated a deal on the EU recovery fund, despite negotiations had stretched to five days. Even though Italy was set to secure 209 billion euros of funds, the 10-year Italian bond yield TMBMKIT-10Y, 0.722% held their ground at 1.09% Equities showed more of a response, with the Stoxx 600 Europe index SXXP, +0.55% gaining 0.3%. The S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% traded higher. Investors also eyed the Federal Reserve on Tuesday. The Senate Banking Committee voted to approve on the nominations of Judy Shelton, an early supporter and adviser to President Donald Trump, and Christopher Waller, head of economic research at the St. Louis Fed, to a seat on the Fed board of governors.What did market participants’ say? “A lot of the positive market reaction was priced in at the Merkel and Macron announcement” in May, said Esty Dwek, head of global market strategy at Natixis Investment Managers, in an interview, after investors noted that Germany was on board with the recovery fund. “The fact that there are more grants is one of the biggest signals we’ve had in years that Europe is sticking together and we’re not leaving a country behind,” she said."}]}