{"article": [{"url": "https://www.marketwatch.com/story/heres-what-exxons-removal-from-the-dow-says-about-the-energy-sector-2020-08-25", "published": 1598358200.0, "headline": "Here's what Exxon's removal from the Dow says about the energy sector", "body": "Exxon Mobil Corp. shares extended their losses Tuesday, a day after the energy integrated company was removed from the Dow Jones Industrial Average to make room for Salesforce.com Inc. CRM, +2.21%  , but the swap also says a lot about the energy sector. Exxon XOM, -1.47%  stock traded as low as $41.27, on pace for its largest percent decrease in a week. The stock is down six of the past seven sessions, and down 41% year-to-date, which compares with losses around 1.3% for the Dow Jones Industrial Average. DJIA, +0.56%  Exxon shares were the second worst performer in the Dow on Tuesday. Exxon has been on the 30-component, price-weighted index since 1928, as then the Standard Oil of New Jersey before its various iterations and the 1999 Exxon and Mobil merger. \"Minor\" selling was to be expected from the change, as the Dow is not commonly used as a benchmark for actively managed funds, analyst Jennifer Rowland with Edward Jones said. Removing the company from the index, however, \"is symbolic of just how far the energy sector has fallen over the past several years.\" See also:Opinion: Exxon getting booted from the Dow Jones Industrial Average may be a blessing in disguise for its investors \"Going forward, (Chevron Corp. CVX, -1.62% ) will be the only energy stock on the DJIA. In the S&P 500, there are 5 stocks (Apple Inc. AAPL, +1.74%, Microsoft Corp. MSFT, +2.48%, Amazon.com Inc. AMZN, +3.01%, Alphabet Inc. GOOG, +1.97%  GOOGL, +1.82%,  and Facebook Inc. FB, +0.26% ) that are individually larger than the entire U.S. energy sector - that's pretty sobering,\" she said. S&P Dow Jones Indices announced the changes, effective Aug. 31, late Monday. Exxon as well as Pfizer Inc. PFE, -0.27%  and Raytheon Technologies Corp. RTX, -1.46%  will be out, the latter two replaced by biotech drugmaker Amgen Inc. AMGN, -1.41%  and industrial conglomerate Honeywell International Inc. HON, +0.34%  S&P Dow Jones said the changes were prompted by Apple's decision to carry out a 4-for-1 stock split, reducing the index's tech-sector weighting. Related:Opinion: Apple investors: Watch out for the winners' curse Exxon's ousting \"is another blow to sentiment towards a sector that has been under intense selling pressure while losing relevance with the investment community over the past six years,\" analysts at Tudor Pickering Holt said in a note Tuesday. The analysts rate Exxon stock a hold, reflecting the company's going further into debt to finance its dividend and pressure in key segments like refining, they said. The energy sector was the worst-hit sector on the S&P 500 index SPX, +0.87%  on Tuesday, down nearly 2%. \"At a time when energy is a mere 2.5% of the S&P 500's market cap, it seems incongruous that two oil and gas supermajors have been part of the Dow Jones Industrial Average,\" said in a note Pavel Molchanov, an analyst at Raymond James. \"Well, the powers that be at S&P Dow Jones Indices have finally addressed this anomaly.\" Energy companies have battled twin shocks of years of oversupply and wrecked demand from the coronavirus pandemic. That's alongside ongoing concerns about an eventual peak in oil demand, which has emerged before the pandemic, and ESG-related objections to fossil fuels, Molchanov said. \"For the record, our view on the oil market is more upbeat, and as such as we envision room for, on the whole, a healthy recovery in oil-levered equities into 2021, especially the latter half of the year,\" he said. As to why Exxon and not Chevron is being removed, it may stem from the fact that Chevron's share price is twice as high, since the DJIA incorporates share price in its weightings. But that's unlikely to be the only reason, he said. \"Fundamentally, Chevron is positioned much more straightforwardly as an oil producer: a high degree of operating leverage to commodity prices, and by contrast limited exposure to refining and almost none to chemicals,\" he said. \"The index committee probably wanted to maintain some oil exposure, making Chevron the better choice to do so, especially given that chemical giant Dow Inc. DOW, -0.04%  ... already represents the chemical industry in the index.\""}]}