{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-rise-as-investor-buy-in-for-prospect-of-new-us-pandemic-relief-circles-globe-2020-10-08", "published": 1602119060.0, "headline": "Asian markets rise as investor buy-in for prospect of new U.S. pandemic relief circles globe", "body": "TOKYO (AP) — Asian shares were mostly higher on Thursday on optimism U.S. stimulus may be coming after all, as President Donald Trump appeared to reverse his earlier decision to halt talks on another economic rescue effort. Japan’s benchmark Nikkei 225 NIK, -0.11% added 0.9% to 23,636.35. South Korea’s 180721, +0.21% ained 0.2% to 2,391.63. Australia’s S&P/ASX 200 XJO, +0.00% jumped 1.4% to 6,119.20. Hong Kong’s Hang Seng HSI, -0.30% fell 0.8% to 24,048.48. Trading was closed in Shanghai for a holiday. Riki Ogawa of Mizuho Bank in Singapore noted that considerable uncertainty remains, given the “rollercoaster” swings in investor mood in response to signs from Trump about the stimulus. “The on-and-off nature of the fiscal stimulus discussion in the U.S. hardly inspires lasting confidence,” Ogawa said, noting such uncertainty will continue through the presidential election campaign, and perhaps even after the vote. The S&P 500 climbed 1.7% to 3,419.45 after Trump sent a series of tweets late Tuesday saying he’s open to sending out $1,200 payments to Americans, and to limited programs to prop up the airline industry and small businesses. The tweets came just hours after Trump sent the market into a tailspin with his declaration that his representatives should halt talks with Democrats on a broad stimulus effort for the economy until after the election, claiming House Speaker Nancy Pelosi had been negotiating in bad faith. See: Amid ruins of stimulus talks, Trump, Pelosi and McConnell trade blame The stakes are high, as economists, investors and the chair of the Federal Reserve all say the economy needs another dose of support following the expiration of weekly jobless benefits and other stimulus Congress approved earlier this year. The Dow Jones Industrial Average DJIA, +0.56% gained 1.9%, to 28,303.46. The Nasdaq Composite COMP, +1.39% climbed 1.9%, to 11,364.60, despite a call by Democratic lawmakers for Congress to rein in Big Tech companies that dominate it and other indexes. The proposal, which follows a 15-month investigation by a House Judiciary Committee panel, could make it harder for Amazon AMZN, +3.01%, Apple AAPL, +1.74%, Facebook FB, +0.26% and Google’s parent company Alphabet GOOGL, +1.82% GOOG, +1.97% to acquire other companies and impose new rules to safeguard competition. Still, much of the market’s attention remains fixed on the prospects for more stimulus for the economy from Washington. Airlines jumped to some of the day’s bigger gains after Trump singled out the industry, asking Congress to “IMMEDIATELY” approve $25 billion for them. The S&P 500 SPX, +0.87% rose broadly, with technology stocks making the biggest gains. Other areas that would benefit most from a strengthening economy were also climbing, including retailers and travel-related companies. Smaller stocks also rose more than the rest of the market, an indication of rising optimism about the economy’s prospects. The Russell 2000 index of small-cap stocks RUT, +0.55% climbed 33.75 points, or 2.1%, to 1,611.04. The 360-degree spin for Wall Street in less than 24 hours is just the latest bump in its shaky run since early last month. Investors are also worried about whether the continuing pandemic will lead governments to put more restrictions on businesses. Tensions between the United States and China are still simmering. In energy trading, benchmark U.S. crude CL00, -1.62% added 3 cents to $39.98 a barrel. Brent crude BRN00, -0.07%, the international standard, gained 9 cents to $42.08 a barrel. The U.S. dollar inched down to 106.00 Japanese yen USDJPY, -0.38% from 106.06 yen Wednesday. The euro USDEUR, -0.60% cost $1.1766, up slightly from $1.1763."}]}