{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-is-on-a-tear-but-now-comes-september-the-worst-month-of-the-year-2020-08-28", "published": 1598868800.0, "headline": "The stock market is on a tear, but now comes September, the worst month of the year", "body": "The only thing to fear about the stock market in September is fear itself. That’s important because September’s reputation as a poor month for equities is well-known. Since the Dow Jones Industrial Average DJIA, +0.56% was created in the late 1800s, the Dow has fallen an average of 1% in September. The Dow’s gain in all other months averages 0.7%. There are nevertheless two reasons not to give any weight to this history: • There is no plausible theory for why September should be awful for the stock market, and without such an explanation, data mining becomes far more likely. • In any case, the stock market has not, on average, lost ground in September of presidential election years. Read:The biggest problem in the stock market: Bullishness is clouding investors’ thinking The lack of a plausible explanation for September’s record is not for want of trying. For many years I have challenged readers to propose one. None that I have received can withstand historical scrutiny. One of the most widely proposed ideas is that September’s record is caused by tax-loss selling from mutual funds, especially since 1990, because of a new tax law that took effect then. But if that were a plausible explanation, we’d expect September’s record since 1990 to be worse than it was before. But that’s not the case. The Dow’s average September loss prior to 1990 was four times worse than it’s been since then — minus 1.2% versus minus 0.3%. Other explanations that have been proposed don’t even meet a simple smell test. One of my favorites is that the stock market in September suffers from pent-up selling from investors who are just returning from their summer vacations. But that explanation could just as easily be turned on its head; why doesn’t the market soar in September from pent-up buying demand? That could especially be the case this year, given the Federal Reserve’s announcement Thursday suggesting its monetary policy will be even easier than previously thought, for a lot longer than previously thought. The so-called Fed Put is alive and well. In any case, according to Lawrence Tint, it’s a waste of time trying to find a plausible explanation for September’s dismal record. Tint is the former U.S. CEO of BGI, the organization that created iShares (now part of BlackRock BLK, +1.18% ). “Unless you or I are able to discover something nobody else knows about, by the time we know why a pattern exists, it’s too late to profit from it,” he said in an interview. That’s because, once this discovery is made, “savvy investors would immediately begin jumping the gun by selling in August, others in turn would try to beat them, and the historical pattern would quickly disappear.”Election-year September If the discussion up to this point isn’t sufficient to convince you not to fear September, consider this: In September of the average presidential-election year, the stock market actually has risen. This is illustrated in the accompanying chart at the top of this column, which plots the Dow’s average monthly gains back to 1896. Notice that, in presidential-election years, not only does the Dow on average rise in September, but there are also five months that have the worst average returns. So there you have it. There is no sound theoretical or statistical reason to bet that September is bad for the stock market. But even if there were, you’d still have reason in this election year not to bet on equities suffering in September. None of this is a guarantee the stock market won’t fall. With five straight months of gains under its belt, the stock market has every right to take a breather — especially in a crazy year like 2020 that has already broken so many historical precedents. My point is that, should the stock market decline, it won’t be because it’s the ninth month of the calendar. Mark Hulbert is a columnist for MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}