{"article": [{"url": "https://www.marketwatch.com/story/what-to-expect-as-banks-report-earnings-more-loan-pain-but-plenty-of-fee-income-2020-07-09", "published": 1594698740.0, "headline": "What to expect as banks report earnings: more loan pain but plenty of fee income", "body": "The largest U.S. banks will announce their second-quarter results this week. Investors should expect another big hit to earnings as banks set aside more money to cover expected loan losses. On the other hand, the big banks are also continuing to see a boost to fee income from elevated investment-banking and trading activity, even as the coronavirus crisis continues. JPMorgan Chase & Co. JPM, -0.57%, Citigroup Inc. C, +0.47% and Wells Fargo & Co. WFC, are all scheduled to report their second-quarter results on Tuesday. Goldman Sachs Group Inc. GS, -0.21% is expected to report on July 15, followed by Bank of America Corp. BAC, +0.47% and Morgan Stanley MS, -0.34% on July 16, to round out the “big six” U.S. banks. All earnings announcement will be made before the market open. Opinions about the group vary greatly. Investors naturally shy away from bank stocks during a recession. Memories of the 2008 financial crisis, caused in great part by the banks and resulting in a government bailout and dilutive capital raises, are fresh enough. But this time around, “capital levels are good and sturdy for the large U.S. banks,” according to Jon Curran, a senior bank analyst and portfolio manager at Aberdeen Standard Investments. During an interview, Curran pointed to “a surge in investment-grade bond offerings” as well as fees from increased mortgage lending as two factors that are helping to offset the big banks’ rising credit costs. Below are consensus second-quarter earnings-per-share estimates among analysts polled by FactSet, along with actual numbers from the previous quarter and the year-earlier quarter: Bank holding company Ticker Total assets - March 31, 2020 ($bil) Estimated EPS - Q2, 2020 EPS - Q1, 2020 EPS - Q2, 2019 JPMorgan Chase & Co. JPM, -0.57% $3,139 $1.08 $0.78 $2.82 Bank of America Corp. BAC, +0.47% $2,620 $0.29 $0.40 $0.74 Citigroup Inc. C, +0.47% $2,220 $0.31 $1.05 $1.95 Wells Fargo & Co. WFC, $1,981 -$0.05 $0.01 $1.30 Goldman Sachs Group Inc. GS, -0.21% $1,090 $3.68 $3.11 $5.81 Morgan Stanley MS, -0.34% $948 $1.09 $1.01 $1.23 Source: FactSet You may have to scroll the tables to see all of the data. You can click on the tickers for more about each company, including news coverage and price charts. Three of the six are expected to show sequential improvements in earnings. Profits will be down significantly from a year earlier, because of the higher provisions for loan losses. Bank holding company Ticker Estimated provision for loan-loss reserves - Q2, 2020 ($mil) Provision for loan-loss reserves - Q1, 2020 ($mil) Provision for loan-loss reserves - Q2, 2019 ($mil) Estimated net income - Q2, 2020 ($mil) Net income - Q1, 2020 ($mil) Net income - Q2, 2019 ($mil) JPMorgan Chase & Co. JPM, -0.57% $8,105 $8,285 $1,149 $3,438 $2,852 $9,596 Bank of America Corp. BAC, +0.47% $5,082 $4,761 $857 $2,783 $4,010 $7,348 Citigroup Inc. C, +0.47% $6,953 $6,446 $2,074 $773 $2,519 $4,732 Wells Fargo & Co. WFC, $4,559 $4,005 $503 $78 $653 $6,206 Goldman Sachs Group Inc. GS, -0.21% $991 $937 $214 $1,360 $1,213 $2,421 Morgan Stanley MS, -0.34% N/A $292 $0 $1,715 $1,698 $2,201 Source: FactSet The provision is the amount added to loan-loss reserves each quarter; it directly affects earnings. A lender will set aside specific reserves for commercial loans that it expects will not be repaid, while estimating how much reserve coverage it will need for other loan types. At the end of the first quarter, the banks quickly boosted reserves, even though only a few weeks had passed since the World Health Organization had declared COVID-19 a pandemic on March 11. At the end of the second quarter, banks were still early in the nonperforming loan cycle. Not only have some businesses been able to avoid loan defaults by participating in the Payment Protection Program, but the CARES Act, with its extra $600 a week in unemployment benefits (set to expire July 31), has pushed back mortgage loan and credit-card defaults, while helping rents continue to flow to landlords. Banks’ loan forbearances and payment deferments have also stretched the credit cycle. The above numbers show the analysts expect the second-quarter numbers to be pretty much a repeat of the first quarter, with a significant sequential increase in earnings for JPMorgan Chase, and painful earnings decline for Wells Fargo. (Yes, the consensus among analysts is for Wells Fargo to lose 5 cents a share in the second quarter, while the consensus net income estimate is a slight profit of $78 million.) Here’s why JPMorgan Chase, Goldman Sachs and Morgan Stanely are expected to show higher earnings in the second quarter than in the first: Bank holding company Ticker Estimated noninterest income - Q2, 2020 Noninterest income - Q1, 2020 Noninterest income - Q4, 2019 JPMorgan Chase & Co. JPM, -0.57% $15,019 $13,812 $14,434 Bank of America Corp. BAC, +0.47% $10,568 $10,637 $10,895 Citigroup Inc. C, +0.47% $7,776 $9,239 $6,808 Wells Fargo & Co. WFC, $8,016 $6,405 $9,489 Goldman Sachs Group Inc. GS, -0.21% $8,155 $7,430 $8,390 Morgan Stanley MS, -0.34% $8,935 $8,131 $9,215 Source: FactSet The Federal Reserve’s quick action to lower the federal-funds rate target to a range of zero to 0.25% on March 15, along with the central bank’s aggressive bond purchases, have led to such a decline in interest rates that companies are scrambling to lock in those low rates by issuing bonds. People are refinancing their homes for the same reason. All of this action, along with the remarkable recovery for the U.S. stock market from its late-March lows, boosts banks’ fee revenue. David Konrad, a senior research analyst at D.A. Davidson, upgraded his rating for J.P. Morgan Chase to a “buy” on July 9, writing in a note to clients that he expected the bank to be “the largest beneficiary” of the increased liquidity brought about by the Federal Reserve. The “unique opportunity to buy the stock at “a cheaper than peer valuation,” is underlined by the strong bond market and “increased risk appetite from investors leading to opportunities in [fixed income trading] and equity derivatives,” he wrote.No crystal ball ... In his banking industry earnings preview report on July 8, J.P. Morgan senior analyst Vivek Juneja called the credit situation for the industry “still opaque due to deferrals/forbearance.” Curran of Aberdeen Standard Investments called the loan-quality picture “a known unknown,” even when saying that “there is a strong foundation right now for the large banks” because of their capital strength and much higher loan underwriting standards when compared to the years before the 2008 credit crisis. Ken Usdin, Jefferies managing director of equity research, summed up the credit mystery in his industry earnings preview on July 9: “Tell us about 3Q20.” For investors, quite a bit is riding on how confident they are in the U.S. economy’s ability to bounce back quickly. As if all the moving parts weren’t enough, the rapid rise in infections as states began reopening their economies is creating more uncertainty. An extension of the extra $600 a week for unemployment benefit recipients would no doubt be cheered by stock investors. “The nice thing about large diversified money-center banks is they have all sorts of levers” to pull to make money, even when interest rates are very low, Curran said. The banks fared pretty well in this year’s regulatory stress tests, which the Federal Reserve augmented to reflect the severity of the coronavirus recession. Among the six big banks, only Wells Fargo said it was likely to cut its dividend. But there is still uncertainty because the banks will need to submit new capital plans to the Fed, and their dividends cannot exceed the rolling average net income for four quarters. Next week, investors’ reaction to earnings reports may ride on bank management teams’ outlooks, Curran said. You can go to the banks’ investor relations sites to listen to earnings calls. Some will later post transcripts of their call.... But plenty of love on the sell-side Wall Street analysts have majority “buy” or equivalent ratings for five of the six major U.S. banks. Bank holding company Ticker Share 'buy' ratings Share neutral ratings Share 'sell' ratings Closing price - July 8 Consensus price target Implied 12-month upside potential JPMorgan Chase & Co. JPM, -0.57% 52% 44% 4% $93.30 $109.79 18% Bank of America Corp. BAC, +0.47% 59% 41% 0% $23.10 $28.19 22% Citigroup Inc. C, +0.47% 85% 15% 0% $50.88 $65.83 29% Wells Fargo & Co. WFC, 17% 62% 21% $24.55 $31.54 28% Goldman Sachs Group Inc. GS, -0.21% 58% 42% 0% $202.25 $231.70 15% Morgan Stanley MS, -0.34% 69% 31% 0% $48.91 $53.29 9% Source: FactSet Wells Fargo is singled out in part because of the Federal Reserve’s regulatory restriction on growth of its total assets, which resulted from several customer-service scandals. The bank’s shares are down 51% this year (with dividends reinvested), compared to a decline of 36% for the KBW Bank Index BKX, -0.33%. Susan Roth Katzke, the senior analyst covering U.S. large-cap banks at Credit Suisse, has a neutral rating on Wells Fargo’s stock. However, wrote in a note to clients on July 8 that she was “far more interested in the stock given the expressed risks and underappreciated longer term value inherent in the Wells Fargo franchise.”"}]}