{"article": [{"url": "https://www.marketwatch.com/story/im-60-my-spouse-is-45-can-i-retire-if-our-expenses-are-12000-a-month-2020-09-02", "published": 1601894900.0, "headline": "Iâ\u0080\u0099m 60, my spouse is 45 â\u0080\u0094 can I retire if our expenses are $12,000 a month?", "body": "Hello, I have read a few of your HelpMeRetire inquiries, and I have a situation that I canâ\u0080\u0099t seem to find much information about when I read retirement planning guides. I am 60 years old, and my spouse is 45. Currently, we both make over $300,000, and he is steadily moving up in his career; however, we only have about $1.5 million in savings (401(k)s and IRAs), and we still owe about $500,000 on our home. Our living expenses arenâ\u0080\u0099t extravagant, but we do like to travel. I would guess taking into account all expenses, including our mortgage, to be around $12,000 a month. However, the house should be paid off in approximately seven years. Also, my husband has health insurance coverage for both of us through his employer. Assuming nothing changes in his career path, do you think I could retire now and we continue with our current expenses? Thanks, Planning in Florida See: Iâ\u0080\u0099m 52, wonâ\u0080\u0099t live past 80 and have $1.6 million. â\u0080\u0098I am tired of both the rat race and workplace politics.â\u0080\u0099 Should I retire? Dear Planning in Florida, Congratulations first and foremost on having saved so much â\u0080\u0094 that is quite the accomplishment! Truthfully, your question is a bit difficult to answer without a few more details, such as if that $1.5 million is mostly in your retirement accounts or his or if you have any assets outside of those accounts. I will tell you what the financial advisers told me about this situation in general. I hope it helps you and fellow readers! To answer your question: It really depends on numerous factors. I read your question as though you earn $300,000 combined, in which case, if you contribute disproportionately more to your joint income, then no, it may not be the best decision to retire right now. Why? Because you would have to draw down your savings more quickly than if you could rely on your spouseâ\u0080\u0099s salary for most if not all of your annual expenses, and doing so poses a problem later in life when he is closer to retirement age. Now, if you earn about the same, or if he earns more, thereâ\u0080\u0099s wiggle room for you to retire without worrying as much about the monthly bills. The other benefits to this equation: youâ\u0080\u0099ve included your mortgage into your monthly expenses, your spouseâ\u0080\u0099s employer offers health insurance and you are older than 59.5 years old, which means if the money is in retirement accounts in your name there are no penalty fees for withdrawing assets early. Comparatively, say you do earn $300,000 each, then yes, the numbers suggest you could retire now and continue paying your current expenses. But you may want to double and triple check your monthly expenses if thatâ\u0080\u0099s the case, said Lora Hoff, wealth manager at IPI Wealth Management, as it would indicate you currently have a significant amount of money unspent at the end of the year. There are other things to consider besides the ability to continue paying current expenses, advisers said. For example, thinking about your cash flow now and for the next few decades is crucial given the age difference, said Joyce Streithorst, director of financial planning at Frisch Financial Group. â\u0080\u009cThey must make sure that they are funding through both retirements,â\u0080\u009d she said. â\u0080\u009cIf we are planning their cash flow and finances to age 90 or 95, we are planning for the next 50 years!â\u0080\u009d You should review all of your assets â\u0080\u0094 in retirement accounts and outside â\u0080\u0094 and run the numbers to see if youâ\u0080\u0099d have to tap into any of them, as well as which, and at what point. Also consider the tax implications of these decisions, Streithorst said. If youâ\u0080\u0099re drawing down retirement assets, that money will be taxed at the top marginal bracket. If youâ\u0080\u0099re married filing jointly, youâ\u0080\u0099re in the 24% federal bracket. The good news: There is no income tax in Florida and retiring would put you in a lower bracket, she said. Ask yourselves: What money will we be using to pay our current and future expenses, and what are the most tax-advantageous ways to do that? Letâ\u0080\u0099s talk about your mortgage for a second. Paying off $500,000 in seven years is quite the feat. Many advisers say entering retirement with a mortgage isnâ\u0080\u0099t an issue, but you may want to review this expense before leaving the workforce since it is quite hefty. â\u0080\u009cI personally do not like my clients to carry a mortgage on their residence into retirement as it means their monthly income needs to be that much higher in order to cover their bills,â\u0080\u009d said Shaun Melby, a financial adviser and founder of Melby Wealth. â\u0080\u009cIf they have a significant asset base, it might not be an issue. But if they donâ\u0080\u0099t have that, it means their nest egg is going to be spent down at a faster rate.â\u0080\u009d Given your income level, it may be easier to try to pay down the mortgage a bit quicker, Melby said. Streithorst suggests asking yourselves a few other questions as well: Do you plan on ever downsizing your home? Would it be before the seven years are up, at your spouseâ\u0080\u0099s retirement or later? If youâ\u0080\u0099re thinking about doing it sooner than his retirement date, it could reduce your monthly expenditures significantly, she said. You asked about your retirement but I am compelled to ask you about your spouseâ\u0080\u0099s as well, so that you both live comfortably in the future. Have you spoken to your spouse about his retirement goals? A wide age gap between spouses means having to make a few extra considerations in the retirement planning process. Also see: Iâ\u0080\u0099m a 57-year-old nurse with no retirement savings and I want to retire within seven years. What can I do? One thought: Social Security. You personally cannot claim Social Security yet (no one can until age 62 at the earliest), but if possible, itâ\u0080\u0099d be best for you to delay claiming benefits for as long as you can, Melby said. The latest you can begin benefits is 70 years old, which not only maximizes the money youâ\u0080\u0099ll get every month from Social Security â\u0080\u0094 but your husbandâ\u0080\u0099s spousal benefits as well, he said. The decision to claim Social Security is very personal, and depends on numerous points, such as if you need the money sooner rather than later or what your anticipated life expectancy is, but itâ\u0080\u0099s worth deliberating about when it would make the most sense for the both of you. Other considerations to make: if you have or need life insurance or a trust, and what your wishes are for your money now and in the future, said Michael Whitman, managing partner of Millennium Planning Group. Long-term care insurance is also beneficial, Hoff said, especially with you and your spouseâ\u0080\u0099s age difference. â\u0080\u009cThat will be more important for the remaining spouse,â\u0080\u009d she said. You can learn more about that here. You may want to reach out to a financial planner, who can walk you through the best options and help you plan for moments and issues you may not be thinking about right now. â\u0080\u009cThere are a lot of other details that come into play with this besides income and expenses,â\u0080\u009d Whitman said. Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com"}]}