{"article": [{"url": "https://www.marketwatch.com/story/grand-jury-indicts-one-of-three-police-officers-involved-in-breonna-taylors-death-01600883444", "published": 1600876340.0, "headline": "No officers indicted for Breonna Taylor death, but one charged for shooting into neighboring apartments", "body": "A woman reacts to news in the Breonna Taylor shooting Wednesday in Louisville, Ky. AP Photo/Darron Cummings LOUISVILLE, Ky. (AP) — A Kentucky grand jury brought no charges against Louisville police for the killing of Breonna Taylor during a drug raid gone wrong, with prosecutors saying Wednesday that two officers who fired their weapons at the woman were justified in using force to protect themselves. The grand jury instead charged fired officer Brett Hankison with three counts of wanton endangerment for firing into Taylor’s neighbors’ homes during the raid on the night of March 13. The FBI is still investigating potential violations of federal law in the case. See: Louisville mayor says the case is ‘far from over’ as the FBI continues to probe the matter Along with the killing of George Floyd in Minnesota, Taylor’s case became a major touchstone for the nationwide protests that have gripped the nation since May — drawing attention to entrenched racism and demanding police reform. Images of Taylor, a Black emergency medical worker, has been painted on streets, emblazoned on protest signs and silkscreened on T-shirts worn by celebrities. The charges drew immediate sadness, frustration and anger that the grand jury did not go further. The wanton-endangerment charges each carry a sentence of up to five years. Protesters began marching through the streets of Louisville, where Taylor was killed, after the announcement, shouting “No justice, no peace.” Some sat quietly and cried. Attorney Ben Crump, who is representing Taylor’s family, called the grand jury’s decision “outrageous and offensive!” “Justice has NOT been served,” tweeted Linda Sarsour of Until Freedom, a group that has pushed for charges in the case. Taylor was shot multiple times by officers who entered her home on a no-knock warrant during a narcotics investigation. The warrant used to search her home was connected to a suspect who did not live there, and no drugs were found inside. The use of no-knock warrants has since been banned by Louisville’s Metro Council. The case exposed the wide gulf between public opinion on justice for those who kill Black Americans, and the laws under which those officers are charged, which regularly favor working police and do not often result in steep criminal accusations. At a news conference, state Attorney General Daniel Cameron, a Republican aligned with Senate Majority Leader Mitch McConnell, spoke to that disconnect. “Criminal law is not meant to respond to every sorrow and grief,” Cameron told reporters after the charges were announced. “But my heart breaks for the loss of Miss Taylor. And I’ve said that repeatedly. My mother, if something was to happen to me, would find it very hard,” he added, choking up. But Cameron, who is the state’s first Black attorney general, said that the officers acted in self-defense after Taylor’s boyfriend fired at them. He added that Hankison and the two other officers who entered Taylor’s apartment announced themselves before entering — and so did not execute the warrant as “no-knock,” according to the investigation. “According to Kentucky law, the use of force by [officers Jonathan] Mattingly and [Myles] Cosgrove was justified to protect themselves,” he said. “This justification bars us from pursuing criminal charges in Miss Breonna Taylor’s death.” Taylor’s boyfriend, Kenneth Walker, opened fire when police burst in, hitting Mattingly. Walker was charged with attempted murder of a police officer, but prosecutors later dropped the charge. Walker told police he heard knocking but didn’t know who was coming into the home and fired in self-defense. Regarding the disappointment of those who wanted criminal charges brought in Taylor’s death, he remarked, “The decision before my office as the special prosecutor in this case was not to decide if the loss of Ms. Taylor’s life was a tragedy. The answer to that is unequivocally yes.” The McConnell protégé Cameron, who has been tagged by some as the Senate veteran’s heir apparent, had his name appear among the 20 on President Donald Trump’s list to fill a future Supreme Court vacancy. Before charges were brought, Hankison was fired from the city’s police department on June 23. A termination letter sent to him by interim Louisville Police Chief Robert Schroeder said the white officer had violated procedures by showing “extreme indifference to the value of human life” when he “wantonly and blindly” shot 10 rounds of gunfire into Taylor’s apartment in March. See: Louisville to pay $12 million to Breonna Taylor’s family Hankison had already been placed on administrative reassignment, as were Sgt. Johnathan Mattingly, officer Myles Cosgrove and the detective who sought the warrant, Joshua Jaynes. On Sept. 15, the city settled a lawsuit against the three officers brought by Taylor’s mother, Tamika Palmer, agreeing to pay her $12 million and enact police reforms. Protesters in Louisville and across the country have demanded justice for Taylor and other Black people killed by police in recent months. The release in late May of a 911 call by Taylor’s boyfriend marked the beginning of days of protests in Louisville, fueled by her shooting and the killing of Floyd while at the hands of police in Minneapolis on May 25. Several prominent African American celebrities including Oprah Winfrey and Beyoncé Knowles have joined those urging that the officers be charged."}]}