{"article": [{"url": "https://www.marketwatch.com/story/is-it-safe-yet-to-work-and-go-back-to-school-in-new-york-2020-08-11", "published": 1597165940.0, "headline": "Is it safe yet to work and go back to school in New York?", "body": "Mobile, medical and testing: three simple words. It’s when you put the three of them together that all the trouble begins. You have to meet up with the test subject. You have to extract the specimen. You have to send the specimen to the lab. You have to trust the lab’s results. (This particular step is now officially known as “the Mike DeWine,” in honor of the Republican governor of Ohio who got a false positive on his coronavirus test last week just as he was heading into the White House.) You have to report the results to the patient and anyone else with a right to see them. You might or might not have to deal with an insurance company, and you know what a barrel of fun that can be! And you have to achieve all this quickly enough that it actually does some good. There’s no use discovering that someone was infected two weeks ago. In that amount of wait time, that one case could spread to half of New York. And these long test-result delays — a week, 10 days, even two weeks—are still a maddening problem almost everywhere, as adults begin returning to the workplace and kids start returning to school. “As an employer, I’d have a tough time asking my employees to come back to work in exactly the same way they did in January,” said Andrew Shulman, the CEO of Mobile Health, a Manhattan-based occupational health company. “The risks are elevated, and so are people’s fears. You have to deal with both of those.” Pre-COVID, Shulman was already overseeing the testing of 200,000 people a year, most of them home-health aides or other medical personnel. Then, the coronavirus hit, and the demand for employee health screening has gone crazy. “Before,” he said, “we were screening for measles, mumps and rubella. Coronavirus is a whole different kind of challenge. And there are so many additional complexities to making the system work now,” starting with the sheer volume of the demand. “A big part of it is making people comfortable coming back to work.” If you can’t test every employee — or you can’t test every employee every day — can you come up with a system that identifies those most likely to be infected and focus the testing on them? That’s the latest thicket that companies like Shulman’s are guiding professional firms, charter schools, film shoots and other employers through. One increasingly popular approach: Every morning, a short questionnaire arrives by text on the employee’s phone. Do you have a cough? Do you have a fever? Have you lost your sense of taste or smell? If the answers are no, no and no, a QR code pops up on the phone. Once the employee arrives at work, that code is flashed into a reader. A temperature check is made. If that comes back normal, the workday begins. And if the temperature’s high or there’s some other sign of trouble? “The COVID test is done right then and there,” Shulman said. It’s testing where it’s needed most. Don’t miss: The Great Return: How to get the wealthy to come back to New York City? Rituals like these could soon become a part of everyone’s workday, as people begin to leave their homes and apartments and fill the office towers again. But why stop with that? There’s an even more urgent challenge looming for New York City public schools, and it comes with an imminent deadline. Could these private-sector techniques work in public school? In less than a month, 700,000 students, 66,000 teachers and a whole army of cafeteria workers, school nurses, bus drivers and others begin an educational and public-health experiment in New York City called the “blended option.” Two or three days a week spent in the school building, two or three days a week of “distance learning” at home. Will the kids wear masks in the hallways? Will the cafeteria tables be 6 feet apart? What happens when a girl sneezes? What if a boy goes home sick? Just thinking about all the possibilities is enough to give anyone a headache. But Mayor Bill de Blasio is promising to deliver. See: 97,000 kids tested positive for the coronavirus in just two weeks in July “If you look at what’s happening in other places,” the mayor said to New York parents on Monday. “it probably causes you a certain amount of concern, a certain amount of doubt. But we’re not those other places. We’re the only major school district in America, the only major urban district, planning for in-person classes this fall.” As for the details, those are being left to the system’s 32 district superintendents and 1,866 principals. Also read: Inside the struggle to close the education equality gap exacerbated by COVID-19 But what does Andrew Shulman, the man who actually knows the complexity of coronavirus testing, think about the odds here? The best he could muster was “logistically difficult.” “The alternative is going back to the way we were in the spring, and that didn’t work for everyone,” he said. “With the proper planning, all this can be accomplished. But get ready for a lot of starts and stops. Open, close, open, close. Plan accordingly.” Ellis Henican is an author based in New York City and a former newspaper columnist."}]}