{"article": [{"url": "https://www.marketwatch.com/story/ratcliffe-joins-trump-in-claiming-congressional-leaks-are-reason-to-halt-election-security-briefings-2020-08-30", "published": 1598864540.0, "headline": "Ratcliffe joins Trump in claiming congressional leaks are reason to halt election security briefings", "body": "WASHINGTON (AP) — Racing the political clock, frustrated Democrats on Sunday searched for a way to force the Trump administration to continue briefing Congress in person about foreign attempts to interfere in the November election. The director of national intelligence, John Ratcliffe, said most briefings on what the administration knows about efforts to influence the vote will now be given to Congress in writing. In the past, delivering “all-member” briefings in-person, he said, has resulted in “leaks” for political purposes within moments. President Donald Trump has made that same claim as the news that congressional briefings would be halted was met by outrage from lawmakers and the public. “A falsehood, yet again another lie by the president,” responded Democratic Rep. Adam Schiff of California, chairman of the House Intelligence Committee. Sen. Angus King, a Maine independent who caucuses with the chamber’s Democrats, said on MSNBC early Monday that he can recall no leak of classified information in his years on the Senate Select Committee on Intelligence. He added that Ratcliffe will need to demonstrate an understanding of the difference between intelligence classified for legitimate reasons of national security and information that might merely be embarrassing. Ratcliffe said those lawmakers who are “entitled to the briefings and classified information will still get that information” and that the briefings would be “primarily in writing.” “What we won’t be doing is all-member briefings, to all members of the House and all members of the Senate,” he said. King said it’s a rare in-person briefing at which the give-and-take between intelligence professionals and lawmakers does not yield valuable information. Background (May 2020):Democrats remain skeptical that Ratcliffe will operate independently as the Trump ally and Texas Republican wins confirmation as intelligence chief John Ratcliffe, then a Republican congressman from Texas a day away from formal renomination by President Trump for director of national intelligence, speaks on Feb. 27, 2020, at the annual Conservative Political Action Conference at Gaylord National Resort & Convention Center in National Harbor, Md. Getty Images It was unclear which lawmakers would receive the intelligence material and how giving them the assessments in writing would cut down on leaking. There was little time for Democrats to challenge the decision in the shadow of the Nov. 3 election and few options to compel the administration to change course, though they mustered plenty of outrage. See:Russia meddled on Trump’s behalf in 2016, bipartisan Senate intelligence report concludes Plus:Russia aims to run down Biden candidacy in support of Trump’s re-election, says U.S. counterintelligence official Democratic presidential nominee Joe Biden blasted the administration for trying to hide well-documented efforts by Russia to help Trump politically. The decision on briefings, Biden said in a statement, shows that Trump is “hoping Vladimir Putin will once more boost his candidacy and cover his horrific failures to lead our country through the multiple crises we are facing.” Schiff, D-Calif., said his committee could demand that Ratcliffe or other intelligence officials testify under oath, but that decision would be made by House Speaker Nancy Pelosi, D-Calif. An official with Schiff’s committee said Ratcliffe’s decision was unexpected because Ratcliffe’s office earlier had reached out to schedule an in-person briefing to the committee on Sept. 17. A room on Capitol Hill had already been reserved, according to the official, who was not authorized to discuss the matter publicly and spoke on condition of anonymity. “We will compel the intelligence community to give Congress the information that we need,” Schiff said. Ratcliffe insisted that China is the graver threat to election security than Russia. Earlier this month, the nation’s counterintelligence chief, William Evanina, issued a statement saying U.S. intelligence officials believe Russia is using various methods to denigrate Biden and that people linked to Russian President Putin are boosting Trump’s reelection bid. U.S. officials also believe China does not want Trump to win a second term and has accelerated its criticism of the White House, Evanina wrote. “This is not where you cut off Congress from getting the information. That’s what happened in 2016 — there wasn’t enough information out there. Now we know. We’ve learned a lesson,” said Sen. Amy Klobuchar, D-Minn. A requirement to subpoena Ratcliffe, she said, “is crazy. We are just a few months out of a major election.” In a statement late Saturday, the acting chairman of the Senate Intelligence Committee indicated the Senate may still have some access to some briefings. Sen. Marco Rubio, R-Fla., said that the “grotestque criminal misconduct” of leaking does not release intelligence agencies from fulfilling their legal requirements to keep Congress informed. It was unclear whether that means Senate will receive in person briefings. A spokesman for Rubio said he would not elaborate beyond the statement. Trump on Saturday said Ratcliffe “got tired” of intelligence about election security leaking from Congress. The president did not offer details to support his statement. From the MarketWatch archives (August 2019): Trump says Rep. John Ratcliffe has withdrawn as intelligence chief nominee amid concerns about his experience and charges that he inflated his résumé Maine Sen. Angus King, a member of the Senate committee, said the idea that the national intelligence director’s office would stop briefing Congress on foreign threats to the U.S. election is “an outrage” and that written updates were “flatly insufficient.” “America’s election — indeed, our foundation of democracy itself — is under threat as we face weaponized disinformation from global foes around the planet,” King said in a statement. “To stifle and limit the American peoples’ awareness of this fact cannot be explained — or allowed.” Ratcliffe was on Fox News Channel’s “Sunday Morning Futures,” Schiff was on CNN’s “State of the Union,” and Klobuchar appeared on ABC’s “This Week.” Read on:Flynn-Kislyak transcripts released by Ratcliffe, and allies and foes of Trump administration say they prove their points MarketWatch contributed."}]}