{"article": [{"url": "https://www.marketwatch.com/story/5-auto-tech-features-that-improve-fuel-efficiency-2020-06-29", "published": 1593407600.0, "headline": "5 auto tech features that improve fuel efficiency", "body": "Even though gas prices are down, there still is a need to be fuel-efficient and not overpay at the pump. So even if you’re eying that full-size pickup or SUV, or just haven’t been in the market for some time, here are the top five technologies to look for in your next purchase.Stop/start technology Many new vehicles automatically stop and restart when your vehicle comes to a rest at a light for more than five seconds. Manufacturers employ these systems to eke out the maximum efficiency in order to meet federal fuel economy standards. Some of the early systems were quite crude. But refinements in the newer systems make the transitions much smoother. Things to look for are systems that can be switched off if you find the constant stop/start sequences annoying. Fuel-efficient hybrid/plug-in hybrid technology Combining electric power with conventional internal combustion technology is another way that manufacturers have found to stretch mileage. Standard hybrid technology continues to improve. The Toyota TM, -0.65% Prius is a case in point, where the current model hits 55 mpg. Typically, conventional hybrids are cheaper than their plug-in counterparts. But there’s something else to consider with plug-in technology. It allows you to travel anywhere from 20 to 50 miles in EV mode before the engine kicks in. Theoretically, if your commute is short enough, you could go quite some time without putting any gasoline in the tank. Another factor that offsets the higher price of these vehicles is a federal tax credit. These incentives vary depending on the pure EV range of the vehicle. Don’t miss: What it’s like to drive a Tesla Model YContinuously variable transmissions Automakers are turning to continuously variable transmissions (CVTs) to also improve fuel economy. The rationale behind these so-called step-less or gearless transmissions is that they keep the engine turning at a constant rpm. This maximizes efficiency. While this looks great on paper, there have been some drivability issues with CVTs. Drivers may experience droning or “motorboating” where the transmission keeps the engine revs up in the most efficient portion of the torque band. The other issue is an elastic or “rubber band” acceleration feel where the car seems to have trouble catching up to the engine’s output. Also see: 9 cars that get great mileage Manufacturers have addressed some of these issues by putting in artificial steps like gears that can be controlled with paddle shifters, allowing the driver to select a more normal feeling rev range to match the vehicle’s speed. As for elastic acceleration, Toyota has added a conventional first gear to the CVT in its new Corolla hatchback. This gives the vehicle a more natural feel off the line while taking advantage of the CVT’s efficiency at higher speeds.Fuel-efficient sailing or gliding mode Back in the day, some people with manual transmissions would coast with the vehicle in neutral as a fuel-saving technique. As one of the top 5 fuel-efficient technologies, manufacturers are beginning to mimic this approach by decoupling the engine from the transmission when your foot is off the accelerator. This allows the engine to drop down to a fuel-saving idle and not become a drag on the vehicle and allowing it to coast more freely. What you gain in fuel economy you also lose in the car’s ability to use the engine for braking, which may in turn, result in additional brake wear in vehicles equipped with this technology. See: The 10 best cars for new college gradsIntelligent cruise control More and more vehicles are offering intelligent or adaptive cruise control that will essentially follow traffic even in stop-and-go scenarios. That ability in of itself is fuel-efficient by more consistently controlling the vehicle’s speed than your right foot. But another layer is already filtering into high-end production cars where a terrain-based navigation system actually anticipates curves and hills and adjusts the vehicle’s speed accordingly. This means smoother power application and braking and as a result greater fuel savings. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on KBB.com."}]}