{"article": [{"url": "https://www.marketwatch.com/story/payroll-tax-deferral-a-silly-idea-is-now-the-rule-of-the-land-2020-09-21", "published": 1600856000.0, "headline": "Payroll tax deferral messes with Social Security - one of the few good things in this crazy world", "body": "With all the other things in the news, it is easy to overlook the fact that the president's proposal to defer Social Security payroll tax payments went into effect on Sept. 1. Specifically, employers can stop withholding the 6.2% employee share of the Social Security tax through the end of the year for those earning under $104,000. Of course, the employer must recoup those deferred taxes from the employee in early 2021. What if I'm in my 40s and don't have a retirement fund? The proposal is a bad idea on so many fronts. â\u0080¢ First, those fortunate enough to keep their jobs are the lucky ones and the least in need of financial relief. â\u0080¢ Second, individuals whose employers adopt this measure will see a big increase in their taxes next year. â\u0080¢ Third, employers could end up on the hook for unpaid taxes if their employees leave. But the real issue is the folly of messing around with one of the good things in this crazy world. The Social Security program not only provides steady income to retirees and people with disabilities, but it is also serving as a safety net for older workers who are reluctant to go back to work because of the virus or who cannot find employment. The program is too important to toy with. Read: Social Security is already in trouble - and a payroll-tax cut might only make it worse In some sense, one could say \"why all the fuss?\" The consensus is that most employers will not participate in this voluntary initiative. They are worried about explaining it to employees and the potential costs if they end up responsible for repayment. (Interestingly, the federal government's executive branch is suspending payroll tax withholding for eligible workers.) Read: Social Security could be vulnerable under Trump's plan for payroll taxes The problem is that the deferral of payroll taxes could be laying the groundwork for permanent payroll tax cuts. The president has repeatedly advocated for a reduction in the payroll tax, but has met with little enthusiasm in Congress. Critics worry that Congress will turn the deferral into a permanent cut. Given Social Security's financing shortfall, the discussion should be focused on how to raise additional revenue - not how to reduce a tried and true source of program support. And proposals that involve a shift from payroll taxes to general revenues endanger the program's future. For decades, an earmarked payroll tax has protected Social Security from the vicissitudes of annual budget decisions. These concerns may explain the efforts by Democrats to overturn the payroll tax deferral program. Their weapon of choice is the Congressional Review Act, which allows Congress to overturn administrative \"rules.\" The administration was able to unilaterally establish the deferral plan because under the tax code the Treasury can delay tax deadlines during a disaster. As an initial step in overturning the deferral plan, some Democrats have asked the Government Accountability Office to assess - by Sept. 22 - whether the plan is significant enough to qualify for action under the Congressional Review Act. Essentially, is the three-page payroll tax deferral guidance issued by the IRS a \"rule\"? If it is deemed a rule, the Congressional Review Act gives Congress the ability to overrule it through a joint resolution. In the great scheme of things, overruling the foolish tax deferral plan may not be that important. But calling attention to any initiative that undermines the financing for the Social Security program is time well spent."}]}