{"article": [{"url": "https://www.marketwatch.com/story/pelosi-on-trumps-coronavirus-aid-orders-he-doesnt-know-what-hes-talking-about-2020-08-09", "published": 1597000100.0, "headline": "Pelosi on Trumpâ\u0080\u0099s coronavirus-aid orders: â\u0080\u0098He doesnâ\u0080\u0099t know what heâ\u0080\u0099s talking aboutâ\u0080\u0099", "body": "BRIDGEWATER, N.J. â\u0080\u0094 President Donald Trumpâ\u0080\u0099s end run around Congress on coronavirus relief is raising questions about whether it would give Americans the economic lifeline he claims and appears certain to face legal challenges. Democrats called it a pre-election ploy that would burden cash-strapped states. â\u0080\u009cWhen you look at those executive orders ... the kindest thing I could say is he doesnâ\u0080\u0099t know what heâ\u0080\u0099s talking about or somethingâ\u0080\u0099s wrong there,â\u0080\u009d House Speaker Nancy Pelosi said. â\u0080\u009cTo characterize them as even accomplishing what they set out to do, as something that will take the place of an agreement, is just not so.â\u0080\u009d After negotiations with lawmakers on the next package of pandemic economic assistance hit a wall, Trump used what he said were the inherent powers of the presidency to forge ahead on tax and spending policy that Congress says it is granted by the Constitution. Trump asserted he had the authority to defer payroll taxes and extend an expired unemployment benefit, although at a lower amount than what the jobless had been getting during the crisis. His reelection chances imperiled by the pandemic, the president contended his orders â\u0080\u009cwill take care of pretty much this entire situation, as we know it.â\u0080\u009d But the orders appeared to carry less weight than Trump promoted and cut federal relief spending by shifting more onto the shoulders of struggling states. Critics said the actions crossed a legal line and fell well short of what is needed to help right the fragile economy. â\u0080\u009cPaltry,â\u0080\u009d said Senate Democratic leader Chuck Schumer of New York, given the scope of the economic and health crises. Though certain to further strain relations with Congress, the moves were framed by the White House as the president breaking through the Washington gridlock in order to directly distribute aid. Advisers hope it will sustain an economic recovery that Trump likely needs to defeat Democrat Joe Biden in November. With an eye on reversing his slide in the polls, Trump took full credit for the measures, which he signed at his New Jersey golf club on Saturday after congressional talks broke down this past week. Democrats initially sought a $3.4 trillion package, but said they lowered their demand to $2 trillion. Republicans had proposed a $1 trillion plan. Trump accused Democrats of trying to spend more than was needed and adding money for priorities unrelated to the pandemic. He said local aid amounted to â\u0080\u009cbailout moneyâ\u0080\u009d for states and cities â\u0080\u009cbadly run by Democrats for many years. ... And weâ\u0080\u0099re not willing to do that.â\u0080\u009d The president wants to continue paying a supplemental federal unemployment benefit for millions of Americans put out of work during the outbreak. But his order called for up to $400 payments each week, compared with the $600 that people had been receiving. Trump also said states would cover 25 percent of this money even as many are dealing with major budget shortfalls. The federal contribution would be redirected from disaster relief money at the Federal Emergency Management Agency â\u0080\u0094 dollars not likely to last more than two months. Shifting FEMA disaster funds also would occur as the peak of hurricane season looms and the National Oceanic and Atmospheric Administration warns of an â\u0080\u009cextremely activeâ\u0080\u009d season already underway. Trumpâ\u0080\u0099s top economic adviser, Larry Kudlow, struggled during a television interview Sunday to clearly explain the specifics of his bossâ\u0080\u0099s order on unemployment aid. Treasury Secretary Steven Mnuchin said the $100 share from states would come from from an earlier pool of federal money and that Trump may waive the requirement about how it can be used. â\u0080\u009cLook, that would cost us about $500 million between now and the end of the year,â\u0080\u009d said Connecticut Gov. Ned Lamont, a Democrat. â\u0080\u009cI could take that money from testing. I donâ\u0080\u0099t think thatâ\u0080\u0099s a great idea. I could take that money from, you know, mass disinfecting for our schools. I donâ\u0080\u0099t think thatâ\u0080\u0099s a great idea. In fact, I think the presidentâ\u0080\u0099s plan is not a great idea.â\u0080\u009d Pelosi, D-Calif., criticized Trump for not doing anything to help schools trying to reopen and she said the orders were â\u0080\u009cunconstitutional slop.â\u0080\u009d Trump also acted to defer payment of the payroll tax, a long-pushed goal that had little support from either party on Capitol Hill, and federal student loans. His order on housing is not a guarantee against eviction, as he claimed, but instead directs the departments of the Treasury and Housing and Urban Development to identify money that could help those struggling to pay their monthly rent. Trump said the employee portion of the payroll tax would be deferred from Aug. 1 through the end of the year, and he raised the possibility of making it permanent, though experts said he lacked that authority. The temporary deferral would not directly aid unemployed workers, who do not pay the tax when they are jobless. Employees would need to repay the federal government eventually without an act of Congress. The president was silent on how he would fund Medicare and Social Security benefits that the 7% tax on employee income covers. Democrats seized on the possible threat to Social Security as a signal that Trump wanted to cut the social safety net. His team pushed back. â\u0080\u009cIf the Democrats want to challenge us in court and hold up unemployment benefits to those hardworking Americans who are out of a job because of COVID, theyâ\u0080\u0099re going to have a lot of explaining to do,â\u0080\u009d Mnuchin said. Both the White House and congressional Democrats indicated Sunday they wanted to resume negotiations, but no talks were scheduled. The breakdown comes with the Nov. 3 election approaching and the White House nervously watching signs that the economic recovery is slowing down as the coronavirus surges. â\u0080\u009cThis is not presidential leadership,â\u0080\u009d Biden said. â\u0080\u009cThese orders are not real solutions. They are just another cynical ploy designed to deflect responsibility. Some measures do far more harm than good.â\u0080\u009d Pelosi and Mnuchin were on â\u0080\u009cFox News Sunday,â\u0080\u009d Schumer was on ABCâ\u0080\u0099s â\u0080\u009cThis Weekâ\u0080\u009d and Lamont was on CBSâ\u0080\u0099 â\u0080\u009cFace the Nation.â\u0080\u009d"}]}