{"article": [{"url": "https://www.marketwatch.com/story/just-5-and-an-iphone-can-open-the-door-to-investing-in-the-worlds-rarest-fine-wines-2020-09-03", "published": 1599206120.0, "headline": "Just $5 and an iPhone can open the door to investing in the worldâ\u0080\u0099s rarest fine wines", "body": "Investors will soon have an opportunity to literally put their money where their mouth is, by investing in shares of some of the worldâ\u0080\u0099s best wines. On Friday, Rally, the New Yorkâ\u0080\u0093based alternative investment platform, will slice a collection of these into shares and offer them to buyers â\u0080\u0094 allowing individuals to participate in the ownership of luxury collectibles, which are typically the domain of the ultrarich â\u0080\u0094 all from an iPhone AAPL, +1.74%. Among the wines being offered are a 2005 Chateau Latour, produced in Bordeaux; a 2014 Domaine De La Romanee-Conti Assortment; Chateau Petrus from 2016; and a 2016 Screaming Eagle from California worth a combined $148,000. The offering is slated to be available on Rallyâ\u0080\u0099s platform starting at noon Eastern time on Friday. Founded in 2017, Rally buys collectible items including rare cars, sports memorabilia, high-fashion apparel, books and vintage comics and then splits these alternative assets into shares and offers them to investors for as little as $5. The value of those shares then floats on Rallyâ\u0080\u0099s marketplace, depending on market expectations for an eventual sale price. Investors can sell their stakes, or increase their ownership, after a lockup period of 90 days. Buyers and sellers can then transact in a peer-to-peer bid/ask secondary market on Rallyâ\u0080\u0099s platform, where prices may fluctuate over time. The platform often fields offers for collectors to buy an entire item off the platform, in which case investors receive pro-rata returns based on the acquisition price. Rallyâ\u0080\u0099s backers include the rapper Nas; Eli Broverman, co-founder of robo-adviser Betterment; and Jeff Cruttenden, co-founder of the U.S. savings app Acorns. In an interview with MarketWatch, Rob Petrozzo, co-founder of Rally, said the average user on the platform is 28 years old, and he expected buyers of the fine wines to range from 18 to 60, very similar to buyers of such other asset classes as books. â\u0080\u009cUsers who are interested in wine can spot a good one on a wine list at a restaurant, understand the value in something like a Dominic De La Romanee-Conti but couldnâ\u0080\u0099t afford to invest in an entire case themselves,â\u0080\u009d Petrozzo said. â\u0080\u009cWe also expect to see crossover from members who didnâ\u0080\u0099t necessarily know anything about investment-grade wine before Rally but will use our platform to learn about the asset class and make their first investment.â\u0080\u009d The auction comes with data showing Americans drinking more during the pandemic. Consumers bought 26.7% more wine between March 7 and May 30, compared with the same period a year ago, according to Nielsen. Wine dollar sales were still growing by 24.4% in the week ending May 30, 2020, compared with the same week a year before, the data showed. From the MarketWatch archives (April 2020):â\u0080\u0098Fractional investmentâ\u0080\u0099 app backed by actor Will Smith and NFL star J.J. Watt surges in popularity as coronavirus fears roil financial markets The market for so-called fractional investing has grown in popularity during the pandemic as most people spend more time at home. â\u0080\u009cThe pandemic has reinvigorated many peopleâ\u0080\u0099s passion for hobbies and nostalgia â\u0080\u0094 people looking for new activities, stuck at home going through their attic for old baseball cards or collectibles, etc. â\u0080\u0094 which in turn has been leading to record appreciation in the broader collectible market, outside of Rally,â\u0080\u009d Petrozzo said. In May, Rally debuted a certified mint-condition basketball card produced by Fleer for Michael Jordanâ\u0080\u0099s 1986-87 season in a $40,000 IPO, which sold out in 30 seconds and was eventually bought off the platform up by an investor for $72,000. Critics have cautioned that collectibles and other rare items can be risky investments. While some will appreciate in value over time, others can quickly lose their value. The concept also means investors miss out on the pleasure of owning the luxury asset â\u0080\u0094 which are housed in Rallyâ\u0080\u0099s SoHo showroom in New York City or in one of two secure storage facilities, located in Delaware and New Jersey â\u0080\u0094 of which they have bought a sliver. Petrozzo said investing in an asset on Rally isnâ\u0080\u0099t designed to be a replacement for taking possession and drinking wine. â\u0080\u009cNot many people can afford to buy and drink, or invest in, a $54K case of wine. Rally is changing this by becoming the access layer that lets anyone invest in assets and enjoy the emotional and [potential] financial returns they otherwise wouldnâ\u0080\u0099t have been able to obtain.â\u0080\u009d Since 2016, Rally has completed almost 120 initial offerings and says it has around 200,000 users. The wine offering marks the platformâ\u0080\u0099s 10th asset class. In September 2018, the company raised $7 million in Series A funding from a slew of investors including the Santa Monica, Calif., venture-capital firm Upfront Ventures."}]}