{"article": [{"url": "https://www.marketwatch.com/story/a-look-at-claims-made-by-william-barr-on-mail-in-voting-china-and-more-in-his-wolf-blitzer-interview-on-cnn-2020-09-03", "published": 1599132560.0, "headline": "A look at claims made by William Barr on mail-in voting, China and more in his Wolf Blitzer interview on CNN", "body": "WASHINGTON (AP) — With President Donald Trump continuing to trail Democrat Joe Biden in national polling as well as in most battleground states, Attorney General William Barr sat for an interview Wednesday with CNN’s Wolf Blitzer, echoing Trump’s unsubstantiated claim on the potential for large-scale fraud in voting by mail — omitting necessary context, with states that rely on the process saying there is no evidence of such a phenomenon. Opinion:Key lessons on voting by mail — from a state that has only voted that way for decades Barr also suggested that China poses a greater threat to election security than Russia, aligning himself with Trump and Republican allies seeking to present that as a central conclusion of an official intelligence assessment last month, which in fact found that, while China and Iran have shown an interest in the Nov. 3 presidential election — with China believed to favor Biden because of the perceived chaos in bilateral relations under Trump — it is Russia that is again engaged in active measures against American democracy. See: Russia meddled on Trump’s behalf in 2016, bipartisan Senate intelligence report concludes Here’s a look at the claims, made in a Wednesday evening interview with CNN: William Barr on fraud in the vote-by-mail process: “Elections that have been held with mail have found substantial fraud and coercion.” The facts: Multiple studies have debunked the notion of pervasive voter fraud in general and in the vote-by-mail process. The five states that relied on mail-in ballots even before the coronavirus pandemic — Colorado, Hawaii, Oregon, Washington and Utah — have said they have necessary safeguards in place to ensure against fraud and to prevent hostile foreign actors from co-opting the vote. More states intend to rely more heavily on mail-in voting this fall because of the pandemic. The attorney general cited a report from more than a decade ago from a commission led by former President Jimmy Carter and former Secretary of State James Baker that said vote-by-mail was vulnerable to fraud. But the commission pointed out in a statement in May that it had found little evidence of fraud in states like Oregon that had sufficient safeguards. From the archives (February 2019):Operative for North Carolina Republican congressional candidate charged over ballot irregularities President Donald Trump, Attorney General William Barr and acting Homeland Security Secretary Chad Wolf on arrival at Andrews Air Force Base in Maryland after a trip to Kenosha, Wis., on Tuesday. Associated Press Barr also said he was basing on “logic” his concern that a hostile foreign actor could produce bogus ballots for the election. But senior U.S. officials said on a conference call with reporters last week that they had no intelligence to suggest that was happening. Barr, on the question of whether Russia, China or Iran, has been most assertive in interfering in the election: “I believe it’s China.” The facts: Barr’s assessment does not line up with last month’s formal statement from the government’s counterintelligence chief, William Evanina. The statement directly implicated Russia in 2020 election interference by saying it was actively working to denigrate Biden. Its characterization of China’s activities was considerably more nebulous, however, saying it regards Trump as unpredictable and prefers that he not win. The statement said intelligence officials believed China has been expanding “its influence efforts” to shape the policy environment ahead of the November election and will continue to weigh the risks and benefits of aggressive action. But they did not specifically place China as a more serious threat or allege that Beijing was directly interfering in the election. See:Trump needs to go public with threats to election security, top Democrats say Plus:Ratcliffe joins Trump in claiming congressional leaks are reason to halt election security briefings Barr said he had reviewed intelligence to inform his assessment on China, which lines up with recent comments from national intelligence director John Ratcliffe and is in keeping with the Trump administration’s position that Beijing presents significant national security concerns for the U.S., particularly when it comes to espionage and the theft of intellectual property from American universities and businesses. Read on:Wisconsin Republican Ron Johnson on defensive over probe of Biden and Ukraine in wake of intelligence assessment about ongoing Russian election interference"}]}