{"article": [{"url": "https://www.marketwatch.com/story/versace-parent-capri-holdings-and-ralph-lauren-slump-as-luxury-sales-takes-a-hit-during-pandemic-2020-08-05", "published": 1596728240.0, "headline": "Versace parent Capri Holdings and Ralph Lauren slump as luxury sales takes a hit during pandemic", "body": "During the coronavirus pandemic, consumers have redefined luxury as a well-made home-cooked meal and a comfortable home, driving down sales for the high-end clothes and shoes sold by companies like Capri Holdings Ltd. and Ralph Lauren Inc. Capri Holdings CPRI, +2.55% , the parent company to Versace, Michael Kors and Jimmy Choo, saw sales drop to $451 million in the fiscal first quarter versus $1.35 billion last year. Michael Kors sales fell 68.7% to $307 million. Capri reported earnings early Wednesday. Ralph Lauren RL, -0.59% said Tuesday that sales for its fiscal first quarter fell to $487.5 million from $1.43 billion last year. Capri stock climbed 12.5% in Wednesday trading while Ralph Lauren stock was up 2.8%. Read: Ann Taylor joins other retailers that have recently filed for bankruptcy. Here are a few things they have in common “With the results from both Capri and Ralph Lauren out, a clear pattern is emerging: The pandemic has deteriorated demand for apparel and accessories across the board, but nowhere more so than in the luxury sector,” wrote Neil Saunders, managing director at GlobalData Retail. Capri’s core customers haven’t suffered financially as much as some others during the pandemic, Saunders said. However, their interests have turned elsewhere. “Large numbers of people elected to divert spending from clothing to other priorities such as homewares, groceries and electronics,” Saunders said. “With its fashion-focused portfolio, this put Capri at a disadvantage.” Capri’s Chief Executive John Idol also talked about the impact that the dramatic travel declines have had on his company. “[A]ll of our regions have been impacted as international travel has virtually come to a standstill since the outbreak of COVID-19,” he said on the earnings call, according to FactSet. “Tourism and travel-related sales comprise a meaningful part of our business. Tourist activity impacts our travel retail.” iframe.twitter-tweet { width: 100% !important; } Saunders thinks Ralph Lauren’s exposure to department stores and other parts of the wholesale channel is a challenge for the brand. But it, too, is selling goods that people aren’t looking for at the moment. “Ralph Lauren is more exposed to the occasion part of the apparel market than many mainstream retailers,” Saunders said. “As social events and activities have ground to a halt, so too has purchasing. The same dynamic also holds true for more formal products which are purchased for work.” See:Target talks Christmas in July with holiday announcement Cowen analysts lowered their price target on Ralph Lauren shares to $61 from $78, but maintained its market perform stock rating. “Given the brand’s significant exposure to the challenged North American wholesale channel, albeit reduced from prior years, we think further footprint distribution rationalization is likely to occur for the brand,” wrote analysts led by John Kernan. “Revenue recapture may not be linear even with the shift to digital and improved CRM [customer relations management] capabilities.” Rural lifestyle specialty chain Tractor Supply Co. TSCO, +0.47% , do-it-yourself home goods retailer Lowe’s Cos. Inc. LOW, +1.38% and athletic goods retailer Hibbett Sports Inc. HIBB, +8.39% have been among the shops that consumers have been flocking to amid the pandemic. Also on the list are grocers like Kroger Co. KR, +0.46% , Walmart Inc. WMT, +1.00% and Target Corp. TGT, +1.14% . Don’t miss:Amazon is making gains with older consumers as more people turn to e-commerce during COVID-19 But GlobalData’s Saunders also points out that Capri and Ralph Lauren face hurdles that pre-date the coronavirus. “Looking beyond the pandemic, when Capri does emerge it will not only have to fix the financial damage but also tackle issues with some of its brands — particularly Michael Kors,” he said. “Even before the crisis, performance was not where it should be because of a lack of clarity in ranges and brand messages.” And Ralph Lauren must continue its turnaround efforts. “Ralph Lauren cannot be blamed for the terrible numbers,” Saunders said. “However, as consumer preferences shift, the company needs to work harder to reinvent itself and to pivot into new channels and segments to secure growth.” Ralph Lauren stock has fallen 44.3% for the year to date while Capri shares are down 60.6% for the period. The S&P 500 index SPX, +0.87% has risen 3.6% for 2020 to date."}]}