{"article": [{"url": "https://www.marketwatch.com/story/as-stocks-bounce-back-from-trump-covid-diagnosis-history-shows-investors-are-quick-to-brush-off-presidential-health-woes-11601920431", "published": 1601913740.0, "headline": "As Dow jumps over 400 points, history shows investors are quick to brush off presidential health woes", "body": "History shows that the stock market’s rebound after faltering late last week following President Donald Trump’s COVID-19 diagnosis isn’t out of the ordinary. A look back over the past 101 years shows investors have usually been quick to shrug off bouts of even serious illness and death when it comes to U.S. presidents, noted Sam Stovall, chief investment strategist at CFRA, in a Monday note. CFRA Referring to the table above, Stovall observed that “the deaths of presidents Harding, Roosevelt, and Kennedy, along with many other presidential medical surprises, resulted in declines of 3% or less for the Dow Jones Industrial Average DJIA, +0.56% that lasted just a few days. “Only Dwight Eisenhower’s heart attack in 1955 and diagnosis of Crohn’s disease in 1956 were greeted by declines in excess of 5% that lasted multiple months,” he said. Stocks fell sharply in early trade Friday, with the Dow down more than 400 points at its session low after Trump tweeted that he had tested positive for COVID-19. The president was hospitalized on Friday. Equities ended Friday’s session with a loss, but off the day’s lows, with the S&P 500 SPX, +0.87% falling 1% and the Dow ending 134.09 points lower, off 0.5%. Stocks rose Monday, with the Dow up around 450 points, or 1.6%, the S&P 500 advancing 1.7% and the Nasdaq Composite COMP, +1.39% rising 2.3%, extending gains after Trump tweeted in the afternoon that he would be leaving the hospital at 6:30 p.m. Eastern. Read: Trump ‘not out of the woods’ yet, but meets discharge criteria, doctor says Doctors and White House staff offered conflicting assessments of Trump’s condition over the weekend, but on Sunday said the president had seen improvement. Trump briefly left Walter Reed Medical Center Sunday to ride by and wave at supporters gathered outside the hospital. Coronavirus update: Doctors are alarmed that Trump’s Sunday jaunt put his security detail at risk Meanwhile, White House press secretary Kayleigh McEnany said she tested positive on Monday morning for COVID-19, adding that she was experiencing no symptoms. Analysts attributed the Monday rebound in stocks to a number of factors. The apparent improvement in Trump’s condition diminishes one element of uncertainty. Meanwhile, worsening poll numbers for the president in the race against Democratic challenger Joe Biden are seen potentially boosting the odds the White House and congressional Republicans will be eager to come to a deal with congressional Democrats on another round of coronavirus aid. Also, some market watchers see a growing lead for Biden diminishing the prospects for a contested election result on Nov. 3 that could lead to weeks of legal wrangling and political infighting. Others argued that the diagnosis does little to change the market fundamentals at all. “The initial stock market reaction to news of President Trump’s COVID test never made much sense. Sure, markets do not like uncertainty, but in a country where the election is only four weeks away, and very few voters remain undecided, it’s hard to see how Mr. Trump’s diagnosis materially changes the race,” said Ian Shepherdson, chief economist at Pantheon Macroeconomics, in a Sunday note. A Biden win has been the most likely outcome, according to the polls, for months, he said. Shepherdson also argued that Trump’s diagnosis is also unlikely to boost chances of passing a stimulus bill before the election. Stovall said the seeming immunity to presidential health woes reflects the idea that “the stock market is a barometer of economics, not politics.”"}]}