{"article": [{"url": "https://www.marketwatch.com/story/heres-how-stocks-typically-perform-in-october-and-why-you-might-want-to-buckle-up-2020-09-25", "published": 1601740940.0, "headline": "Hereâ\u0080\u0099s how stocks typically perform in October and why you may want to buckle up", "body": "October is coming. The most volatile month of the year for the U.S. stock market is here but if youâ\u0080\u0099re prepared thereâ\u0080\u0099s nothing to fear. In fact, the market typically rises in October and combined with the volatility, gives investors one of the best opportunities for getting into stocks of the entire year. So itâ\u0080\u0099s important to review Octoberâ\u0080\u0099s history so that you donâ\u0080\u0099t get spooked out of the market. A good place to start is the chart below, which plots the standard deviation of each monthâ\u0080\u0099s daily changes in the Dow Jones Industrial Average DJIA, +0.56% Â since 1896. Octoberâ\u0080\u0099s is 1.43%, far higher than the all-month average of 1.09%. You might wonder if Octoberâ\u0080\u0099s volatility is due to the two worst stock market crashes in U.S. history â\u0080\u0094 1929 and 1987 â\u0080\u0094 both of which happened in October. But itâ\u0080\u0099s not. October is the most volatile month of the calendar even if we donâ\u0080\u0099t include those two years in the calculation. You might also wonder if Octoberâ\u0080\u0099s above-average volatility can be traced to the month coming immediately prior to elections (both presidential and mid-term). But again the answer is â\u0080\u009cno.â\u0080\u009d The stock market in October is more volatile than in any other month even if we focus only on the first- and third years of the presidential cycle. Itâ\u0080\u0099s actually a mystery why October historically has exhibited so much volatility. I came up empty upon inquiring of several academics as to why October should have this characteristic. Normally I would conclude that this means that Octoberâ\u0080\u0099s above-average volatility is nothing more than a statistical fluke and is unlikely to persist into the future. But, since volatility can be caused by nothing more than the expectation of volatility, Octoberâ\u0080\u0099s reputation may be sufficient for the pattern to continue. I note in this regard that the Stock Traderâ\u0080\u0099s Almanac refers to October as the â\u0080\u009cjinxâ\u0080\u009d month. To appreciate how the combination of Octoberâ\u0080\u0099s volatility and average gain can work to your benefit, I measured the Dowâ\u0080\u0099s gain from its lowest closing price during the month to its highest close over the subsequent two months. Though youâ\u0080\u0099d have to be clairvoyant to fully capture this return, itâ\u0080\u0099s a helpful metric with which to compare the stock marketâ\u0080\u0099s short-term potential. On average since the late 1800s, Octoberâ\u0080\u0099s potential when measured this way is higher than for any other month of the calendar. The bottom line? Be prepared for a marked increase in stock market volatility in coming weeks. And unless you have other reasons to get out of stocks, you should ride out the volatility rather than go to cash. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com Read: Small-cap stocks typically lose in the fourth quarter and this group of wealthy investors are to blame More: Why Septemberâ\u0080\u0099s selloff has these savvy traders convinced that stock prices are going up"}]}