{"article": [{"url": "https://www.marketwatch.com/story/uber-engineer-slams-californias-proposition-22-says-issue-is-bigger-than-my-employment-at-uber-11602022230", "published": 1602008300.0, "headline": "Uber engineer slams Californiaâ\u0080\u0099s Proposition 22, says issue is â\u0080\u0098bigger than my employment at Uberâ\u0080\u0099", "body": "A ride-hailing driver participates in a protest Aug. 20 at Los Angeles International Airport. An Uber engineer is on the side of the drivers and on Oct. 6 published an op-ed against Proposition 22. Robyn Beck/AFP via Getty Images An Uber Technologies Inc. engineer said Tuesday he is taking a risk by speaking up against his companyâ\u0080\u0099s California ballot measure, which is meant to avoid classifying ride-hailing drivers as employees as is called for by state law. But â\u0080\u009cworkers are subsidizing the product with their free labor,â\u0080\u009d and the issue â\u0080\u009cis bigger than my employment at Uber,â\u0080\u009d he said. Mobile engineer Kurt Nelson brings a unique perspective to the Proposition 22 battle, which is backed with $185 million from Uber UBER, -0.18%, Lyft Inc. LYFT, +2.16%, DoorDash Inc., Instacart and Postmates. He told MarketWatch shortly after an op-ed he wrote was published by TechCrunch that he has looked at the worker-classification question from the viewpoint of someone who has done gig work (for Lyft, Uber Eats and Caviar, especially during college), a user of gig-economy platforms and now as someone who helps work on the Android version of the Uber app. In his op-ed, he wrote that he knows what itâ\u0080\u0099s like to have no employee protections and believes drivers deserve more rights: â\u0080\u009cBefore joining Uber, I worked a range of low-wage jobs from customer service at Disneyland to delivering pizza with no benefits.â\u0080\u009d See: Uber and Lyft must make drivers employees because California law has â\u0080\u0098overwhelmingâ\u0080\u0099 edge, judge says The San Francisco-based ride-hailing giant has specifically asked its employees to urge their friends and family to vote for Proposition 22, and has offered them T-shirts, car decals and window signs, Nelson said. â\u0080\u009cIâ\u0080\u0099m definitely worried about this affecting my working conditions at Uber,â\u0080\u009d he said. Nelson knows he could become the latest casualty in tech worker activism. In the past few years, other tech companies, like Google and Amazon, have fired employees who have publicly criticized or protested against them. However, Nelson added that â\u0080\u009cI care about a bunch about this issue,â\u0080\u009d and that he is especially concerned about the measureâ\u0080\u0099s â\u0080\u009cimmutability.â\u0080\u009d Proposition 22 â\u0080\u0094 which offers drivers a new guaranteed minimum wage, contributions to health benefits and other promises that its opponents say fall short of full employee protections â\u0080\u0094 contains a clause that would require seven-eighths of the state Legislature to approve any amendments to it. â\u0080\u009cThe ballot proposition system in California has flaws, and is easily exploitable by anyone who has enough money and spending power,â\u0080\u009d he said. â\u0080\u009cLike Proposition 13, this could stick with us for decades.â\u0080\u009d (Proposition 13 caps property-tax increases in the state.) A company spokesman said Uber had no comment Tuesday. See: Uber and Lyft granted emergency stay, shutdown averted in California Nelson said some of his colleagues feel the same way about Proposition 22 but are afraid to speak up. He said some have already thanked him for doing so through his op-ed. On the other hand, he also works with people who are strongly for the initiative and against Assembly Bill 5, the worker-classification law that Uber and other gig companies are fighting with all their might. They include people who â\u0080\u009cpersonally attackâ\u0080\u009d Assemblywoman Lorena Gonzalez, D-San Diego, who wrote the bill, he said. In his op-ed, he implored his colleagues and other employees of gig companies to stand with other workers. â\u0080\u009cWhen your employer tells you to vote for something because itâ\u0080\u0099s what is best for the company, consider that your employerâ\u0080\u0099s interests might not align with your own, or with societyâ\u0080\u0099s,â\u0080\u009d Nelson wrote."}]}