{"article": [{"url": "https://www.marketwatch.com/story/here-are-the-fdas-covid-19-vaccine-guidelines-that-the-white-house-blocked-it-from-releasing-01602012857", "published": 1602001280.0, "headline": "Here are the FDAâ\u0080\u0099s COVID-19 vaccine guidelines that the White House opposed", "body": "The Food and Drug Administration laid out updated safety standards Tuesday, Oct. 6, for makers of COVID-19 vaccines, calling for a two-month observation period to see whether people who got the vaccine suffered negative side effects. AP Photo/Hans Pennink WASHINGTON (AP) â\u0080\u0094 The Food and Drug Administration released updated safety standards Tuesday for makers of COVID-19 vaccines after the White House blocked their formal release, the latest political tug-of-war between the Trump administration and the governmentâ\u0080\u0099s public health scientists. In the new guidelines posted on its website, the FDA said vaccine makers should follow trial participants for at least two months to rule out safety issues before seeking emergency approval. That requirement would almost certainly preclude the introduction of a vaccine before Nov. 3. President Donald Trump has repeatedly insisted a vaccine could be authorized before Election Day, even though top government scientists working on the effort have said that timeline is very unlikely. On Monday Trump said vaccines are coming â\u0080\u009cmomentarily,â\u0080\u009d in a video recorded after he returned to the White House. Former FDA officials have warned that public perception that a vaccine was being rushed out for political reasons could derail efforts to vaccinate millions of Americans. A senior administration official confirmed Monday that the White House had blocked FDAâ\u0080\u0099s plans to formally publish the safety guidelines based on the two-month data requirement, arguing there was â\u0080\u009cno clinical or medical reasonâ\u0080\u009d for it. But on Tuesday, the FDA posted the guidance on the agencyâ\u0080\u0099s website, making clear that regulators plan to impose the safety standards for any vaccine seeking an expedited path to market. FDA Commissioner Stephen Hahn said in a statement that he hoped the guidelines would help â\u0080\u009cthe public understand our science-based decision-making process that assures vaccine quality, safety and efficacy.â\u0080\u009d The requirements are aimed at companies seeking rapid approval through the FDAâ\u0080\u0099s emergency authorization pathway. That accelerated process, reserved for health emergencies, allows medical products onto the market based on a lower bar than traditional FDA approval. But FDA has made clear only vaccines that are shown to be safe and effective will be authorized against COVID-19. Former FDA acting commissioner Dr. Stephen Ostroff said the requirements seem reasonable given the agency is in largely â\u0080\u009cuncharted territoryâ\u0080\u009d in terms of considering emergency use of a vaccine. The agency has only previously cleared one vaccine through the method â\u0080\u0094 a decades-old shot that was authorized to prevent anthrax poisoning in 2005. â\u0080\u009cThere really is no margin for error here,â\u0080\u009d Ostroff said. â\u0080\u009cEven when youâ\u0080\u0099re talking about limited use of a vaccine there has to be some level of assurance that there isnâ\u0080\u0099t a risk here that would far outweigh the benefit.â\u0080\u009d To meet the FDAâ\u0080\u0099s threshold, companies will need to submit two months of follow-up data from half of their trial participants to show there were no major side effects or health problems. Vaccines, unlike drugs, are normally given to otherwise healthy people, and normally require enhanced documentation of safety. Initial doses of vaccines for emergency use would likely be reserved for medical workers and people with health conditions that make them particularly vulnerable to coronavirus. Full FDA approval for the general population will require significantly more data and is not expected until mid-2021. The White House attempt to block the guidance release follows a string of instances in which the Trump administration has undercut its own medical experts working to combat the pandemic. FDAâ\u0080\u0099s Hahn has been attempting to shore up public confidence in the vaccine review process for weeks, vowing that career scientists, not politicians, will decide if the shots are safe and effective. Pfizer CEO Albert Bourla has stoked excitement by saying that he expects data on whether the companyâ\u0080\u0099s candidate works to be ready in late October. But a number of variables would still have to align for the company to submit, and the FDA to review and greenlight, a vaccine application before Nov. 3. Pfizerâ\u0080\u0099s competitors Moderna, AstraZeneca and Johnson & Johnson are working on longer research timelines. Vaccine development typically takes years, but the U.S. government has invested billions in efforts to accelerate the process and help multiple drugmakers prepare multiple candidates. All the doses will be purchased by the federal government for use vaccinating the U.S. population. Beyond exposing the rift between the White House and FDA, the delay in releasing the information may have had limited practical effect. FDA scientists have been discussing the guidelines publicly for weeks and have made clear that the recommendations have already been shared with each of the vaccine developers. â\u0080\u009cThe companies know what weâ\u0080\u0099re expecting,â\u0080\u009d said Dr. Peter Marks, the head of FDAâ\u0080\u0099s vaccine division, in an online interview last week with the nonprofit Friends of Cancer Research. The guidelines released Tuesday made clear that all upcoming vaccines would be reviewed by FDAâ\u0080\u0099s independent panel of outside vaccine advisers, before the agency makes its own final decision. Last week, seven former FDA commissioners blasted the Trump administration for â\u0080\u009cundermining the credibilityâ\u0080\u009d of the agency in a Washington Post op-ed and called for the release of the stalled vaccine guidelines. â\u0080\u009cScientists should make decisions based on data, unfettered by political pressure or the intrusions of ideology or vested interests,â\u0080\u009d the officials wrote."}]}