{"article": [{"url": "https://www.marketwatch.com/story/heres-what-has-to-happen-for-president-trump-and-mitch-mcconnell-to-seat-a-new-supreme-court-justice-before-election-day-11600697760", "published": 1600707380.0, "headline": "Here's what has to happen for President Trump and Mitch McConnell to seat a new Supreme Court justice before Election Day", "body": "Tributes to Ruth Bader Ginsburg outside the Supreme Court. AFP via Getty Images United States Supreme Court Justice Ruth Bader Ginsburg died on Sept. 18, thrusting the acrimonious struggle for control of the Supreme Court into public view. President Trump and Senate Majority Leader Mitch McConnell have already vowed to nominate and confirm a replacement for the 87-year-old justice and women's rights icon. This contradicts the justification the Republican-controlled Senate used when they refused to consider the nomination of Merrick Garland, President Barack Obama's pick for the Court after the death of Antonin Scalia in February 2016. Garland, a moderate judge on the D.C. Circuit Court of Appeals, was nominated in March 2016, but McConnell balked on the basis that it was an election year. \"The American people are about to weigh in on who is going to be the president,\" said McConnell in March 2016. \"And that's the person, whoever that may be, who ought to be making this appointment. The 2020 presidential election was just 46 days away on the day of Bader Ginsburg's death, but McConnell has apparently abandoned such considerations this time around. Trump tweeted on Sept. 19 that he would nominate a replacement \"without delay.\" Read: Trump says he'll name Supreme Court pick on Friday or Saturday Since the 1990s, the Supreme Court has increasingly split 5-4 along ideological lines on many important cases, including decisions on voting rights, affirmative action, gay marriage, the Affordable Care Act, gerrymandering and gun rights. Being able to replace a reliable liberal voice on the Court with a conservative justice would entrench a 6-3 tilt towards the right for years. There is bound to be vehement opposition from the Democrats. Read: Republicans wagering sudden Supreme Court vacancy will galvanize their voters However the politics play out, there is a process for Supreme Court nominations and confirmations. Here are the four steps:Step 1: The presidential pick The first thing to know is that the Constitution of the United States gives the power of nomination to the president. Article II, section 2 provides that the president \"shall nominate, and by and with the advice and consent of the Senate, shall appoint â\u0080¦ judges of the Supreme Court.\" By law, so long as he is in the White House, President Trump can nominate whomever he wants to replace Justice Ginsburg. Appointment is really a three-step process: nomination (by the president), confirmation (by the Senate), and appointment (by the president again). Things can get tricky somewhere between nomination and confirmation. But changes made in the Senate - in particular, the rule change in 2017 that allows a Supreme Court Justice to be confirmed with 51 votes, instead of 60 - are likely to smooth the way considerably.Step 2: The Senate Judiciary Committee Once the president has made a choice, the nomination is referred to the United States Senate. Since the early 19th century, this has meant that the nomination will first be considered by a smaller group within the Senate, the Senate Judiciary Committee. The only exception was in 2016, when the Judiciary Committee refused to consider President Obama's nomination of Judge Garland. The Judiciary Committee currently has 22 members - 12 Republicans and 10 Democrats - and has a three-step process of its own. First, it conducts an investigation into the nominee's background. This process can take 30 to 45 days, but it's easy to imagine it going a lot faster. Second, the committee holds a public hearing, in which the nominee is questioned and may give testimony about everything from her judicial philosophy to her stand on abortion. This may give voters a chance to see the Democratic vice presidential nominee, Kamala Harris, who also serves on the Judiciary Committee, display her prosecutorial skills during questioning of the nominee. Finally, the committee will report its recommendation to the full Senate as either favorable, negative, or no recommendation. The 10 Democratic members of the committee have already sent a letter to the chairman, Republican Sen. Lindsey Graham, calling on him to \"state unequivocally and publicly that you will not consider any nominee to fill Justice Ginsburg's seat until after the next President is inaugurated.\" But that seems highly unlikely, given Graham's new statements backtracking from his 2018 assertions that he would not want a confirmation vote on a Supreme Court appointment in a presidential election year. \"I want you to use my words against me,\" said Graham at the time, \"[if] a vacancy occurs in the last year of the first term, you can say Lindsey Graham said let's let the next president, whoever it might be, make that nomination.\" Once the public hearings have concluded, if the Democrats want to buy time, they can delay the committee vote for a week. But after that, it's on to the main floor of the Senate. So let's move on to the next stage, shall we?Step 3: The full Senate There are 100 senators in the United States Senate - two for each state. Currently, the Senate is majority Republican, with 53 Republicans, 45 Democrats and two Independents, who both caucus with the Democrats. While the Senate has historically followed rules so arcane and incomprehensible that otherwise reasonable writers freely refer to them as \"insane,\" they can now be changed by a simple majority vote, which simplifies matters for the majority party considerably. If the motion that the nomination be considered is made during a special \"executive\" session of the Senate, then the motion itself is debatable and can be blocked by filibuster - that movie-ready delay tactic in which which a senator recites Shakespeare, Dr. Seuss or recipes for fried oysters until everyone gives up and goes home. But closing debate on the motion so that the Senate could move on to a vote no longer requires a supermajority of 60 votes, just a bare 51-Senator majority. So filibustering is likely to be about as effective as a paper hammer. After that, the Democrats can insist on a minimum of 30 hours of debate, and then, they will be out of options to delay or stop a confirmation vote.Step 4: The vote The vote to confirm requires a simple majority of the senators present and voting. If the nominee is confirmed, the secretary of the Senate will transmit the confirmation vote to the president. The president then will sign a commission appointing the person to the Supreme Court.The timing The real question is whether all of this can be accomplished before the election on Nov. 3, or if it will roll over into the lame-duck session of Congress after the election. Either way it will be a first. The Senate has never filled a Supreme Court vacancy this close to a presidential election. The closest time in the past was when Chief Justice Charles Charles Evans Hughes resigned from the Court to run for president. And that was 150 days before the election. Read: Ruth Bader Ginsburg played a pivotal role in the women's-rights era - and that was before she joined the Supreme Court Caren Morrison is an associate professor of law at Georgia State University in Atlanta. This was first published by The Conversation - \"Can Trump and McConnell get through the 4 steps to seat a Supreme Court justice in just 6 weeks?\" .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}