{"article": [{"url": "https://www.marketwatch.com/story/billionaire-bill-ackman-has-a-4-billion-blank-check-to-buy-a-company-but-he-hasnt-said-which-one-2020-07-22", "published": 1595490500.0, "headline": "Billionaire Bill Ackman has a $4 billion 'blank check' to buy a company, but he hasn't said which one", "body": "Billionaire hedge-fund manager Bill Ackman's largest-ever \"blank check\" company went public Wednesday, with more than $4 billion in its kitty to acquire an as yet undetermined company, and it has two years to pick one. Pershing Square Tontine Holdings Ltd. US:PSTH  is a special purpose acquisition company (SPAC), formed to buy one private company and take it public by way of an acquisition similar to a reverse merger. The company raised $4 billion, as it sold 200 million shares in its initial public offering which priced at $20 a share. The company's stock started trading on the New York Stock Exchange Wednesday morning, with the first trade at $21.10, or 5.5% above the IPO price. It has edged higher since to close up 6.5% at $21.30. Ackman has built this war chest at a time, as he said in an interview on CNBC Wednesday, that he is \"long-term bullish\" on America and the stock market, although he was bearish on highly indebted companies. See: Ackman says he's 'long-term bullish' on the stock market but 'bearish' on highly indebted companies SPACs are shell companies without an operating business, formed only to buy private companies, or act as a backdoor means for a company to go public without the usual regulatory and Wall Street fanfare, and costs, associated with an traditional IPO. Read more about 'blank check' companies. Renaissance Capital, a provider of institutional research and IPO exchange-traded funds, said it does not include SPACs in their IPOs because they are not operating companies. Investors should therefore be cautious, as the SPACs can't be valued, other than for the cash they hold, until after an acquisition is made. \"SPACs can be extremely lucrative for the founders, who typically take a healthy chunk of equity at a nominal value, as well as the IPO advisors, lawyers and bankers involved with the IPO and eventual M&A deal,\" said Matthew Kennedy, senior strategist at Renaissance Capital. \"However, it's worth noting that SPACs have been a mixed bag for long-term investors.\" While there have been some \"high flyers\" in which companies going public via SPACs have outperformed the IPO and broader stock market, such as Nikola Corp. NKLA, -1.36%  and DraftKings Inc. DKNG, -4.51%  , most of the SPACs that have completed acquisitions this year (59%) trade below issue, with a median return of decline of 12%, Kennedy said. The same was true last year. As the market for SPACs continues to swell, with the $16.8 billion raised by SPACs this year even before Pershing Square Tontine went public already surpassing record for SPAC proceeds of $12.1 billion, the space has started maturing, Kennedy said. \"Bulge-bracket banks increasingly underwrite the deals. More institutional long-term investors are buying SPACs. More quality IPO candidates are considering going public via SPAC,\" Kennedy said. \"And we're also encouraged by Pershing Square Tontine's structure, where the sponsor will not make money unless public investors do.\" Pershing Square Tontine is sponsored by Pershing Square TH Sponsor LLC, which is wholly owned by three investment funds - Pershing Square Holdings Ltd., Pershing Square L.P. and Pershing Square International Ltd. - all of which are managed by Ackman's hedge fund Pershing Square Capital Management L.P. Ackman is also chairman and chief executive officer of the SPAC. Citigroup, Jefferies and UBS Investment Bank are the joint bookrunning managers of the IPO. There are a host of other bankers involved, including those from co-lead managers of the IPO CastleOak Securities L.P., Loop Capital Markets, Ramirez & Co. Inc. and Siebert Williams Shank. In connection with the IPO, Pershing Square funds have committed to buying a minimum of $1 billion worth of equity units, each consisting of one share of common stock and one-third of a warrant to buy stock, at a price of $20 per unit. The funds will have the right to buy up to an additional $2 billion worth of equity units. That gives the SPAC a minimum of $5 billion of cash equity capital to make a purchase. Although many other funds of equal or larger size formed to make acquisitions often buy 100% or majority interests in multiple companies, Pershing Square Tontine said it plans to merge with just one private company and take it public, through a deal that gives it only a minority interest in the newly public company. When the SPAC disclosed its intent to go public in June, it said it was planning to raise $3.45 billion by offering 172.5 million shares at $20 a share. At that time, as is usual with SPACs, it said if a business combination wasn't completed within 24 months, or 30 months if a letter of intent is executed, then it would return 100% of the shares to owners through a cash payment. Ackman chose what has been a stellar year for IPOs to take Pershing Square Tontine public. The Renaissance IPO ETF IPO, +1.98%  , which holds the largest IPOs that have been completed in the past two years, has run up 39.7% year to date, while the S&P 500 index SPX, +0.87%  has gained 1.4%. On the way to amassing his fortune, Ackman has been known to make some investments that turned out badly, such as his bearish bet on Herbalife Nutrition Ltd. HLF, +0.94%  and bullish bet on Valeant Pharmaceuticals International Corp., which is now a subsidiary of Bausch Health Companies Inc. BHC, -3.10%  It will be seen, in no more than two years, whether what he buys with his SPAC money can make investors a little bit richer."}]}