{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-who-warns-of-record-rise-in-global-covid-19-cases-in-a-single-day-and-northeastern-us-is-heating-up-again-2020-10-09", "published": 1602254540.0, "headline": "Coronavirus update: WHO warns of record single-day rise in global COVID-19 cases, while northeastern U.S. states heat up again", "body": "The World Health Organization on Friday reported a record rise in global cases of the coronavirus that causes COVID-19 in the last 24 hours, in the latest sign that the illness is far from contained. There were 338,779 new cases and 5,514 fatalities in the 24-hour period, the agency said. India counted 78,524 new infections, followed by Brazil with 41,906. The previous record was 330,340, set on Oct. 2. The WHO reported a one-day record number of deaths on April 17 at 12,393. The U.S. continues to lead the world by case tally and death count and added 56,045 new cases on Thursday, according to a New York Times tracker. There were at least 928 deaths, the tracker shows. The U.S. has averaged 47,036 cases a day in the past week, up 12% from the average two weeks earlier. The U.S. has 7.6 million cases, and 212,789 Americans have died, according to data aggregated by Johns Hopkins University. The virus is surging in the Northeast, after it was successfully tamped down there earlier in the year, when New York was the epicenter. Now, new cases are on the rise, and hospitalizations are increasing, leading governors to reimpose restrictions. “ ‘The U.S. COVID outbreak appears to be on a knife-edge.’ ” — Ian Shepherdson, Pantheon Macroeconomics Clusters have emerged in Connecticut, Maryland, Pennsylvania and Rhode Island, according to the New York Times. In New York City, the number of new cases is averaging more than 500 for the first time since June, and the city is closing nonessential businesses and houses of worship in areas of Queens and Brooklyn. The continued increase in test numbers, averaging 878,000 over the past week, compared with a low of 624,000 in mid-September, is contributing to the increase in confirmed cases, said Ian Shepherdson, chief economist at Pantheon Macroeconomics. “But the national average test-positivity rate has risen to near the top of its [4.5% to 6.5%] range, and the median state positivity rate over the past week is 6.7%, the highest since early September,” Shepherdson wrote in a note to clients. “Such high positivity rates imply an increased risk of undetected clusters, which can then spread rapidly. “The U.S. COVID outbreak appears to be on a knife-edge, with a real risk of much more rapid increases in cases over the next few weeks, following the pattern seen in Europe,” Shepherdson wrote. The upper Midwest and the Plains are becoming a hot spot that is pressuring hospital capacity, according to the Associated Press. Wisconsin, North Dakota and South Dakota are leading the U.S. in new cases per capita, following months in which their citizens and in some cases state governments rejected face-mask requirements and downplayed the risk of the disease. North Dakota has no face-mask mandate and is seeing 770 new cases per 100,000 residents, the highest in the country. From the archives (July 3):Masks optional, no social distancing on agenda for Trump fireworks event at Mount Rushmore Wisconsin health officials are planning to open a field hospital next week to combat a shortage of beds that threatens to overwhelm hospitals and health centers. “We hoped this day wouldn’t come, but unfortunately, Wisconsin is in a much different, more dire place today and our healthcare systems are beginning to become overwhelmed by the surge of COVID-19 cases,” Democratic Gov. Tony Evers said in a statement. “This alternative care facility will take some of the pressure off our healthcare facilities while expanding the continuum of care for folks who have COVID-19.” Evers is currently facing a court challenge from state Republicans over Wisconsin’s face-mask mandate. See also: New England Journal of Medicine says Trump should be voted out over pandemic management as U.S. death toll tops 212,000 Meanwhile, the number of close contacts of President Donald Trump who have tested positive for the coronavirus following recent White House and Republican National Committee events has risen to 34, according to the Federal Emergency Management Agency. The White House is reported to be conducting limited contact tracing, complicated by the fact that so many attendees have returned to their home states. For more, read:D.C.-area health departments fault contact-tracing efforts amid White House coronavirus outbreak Trump continued to play down the virus on Thursday, telling Fox Business in a telephone interview that “when you catch it, you get better. And then you’re immune, you know?” Trump also said he believed he could have recovered without the multiple treatments he was given. Michael Dowling, chief executive of Northwell Health, a nonprofit health-care network serving New York state, lamented the lack of leadership that has put the U.S. in the dire position of most cases and deaths in the world. “If you get COVID in a serious way, it does dominate you,” Dowling said in an interview on MSNBC, addressing language used by Trump, who told Americans not to be afraid or let the virus dominate them earlier this week “It would be interesting if way back a number of months ago, we had national leadership who said, ‘You know, we’re at war against a major virus, and I am going to show you through my example and educate you that all of us in a unified way across the whole U.S. should be taking every safety measure that we possibly can,’ so you have a unity of purpose, a unity of mission. If we had done that nationally five or six months ago, we would be in a much better position today.” Dowling also criticized Trump over mixed messaging on face masks, which has led many of his supporters to reject wearing them. “Leadership is about telling the truth and dealing with reality,” he said. Fox News said Friday it will have Dr. Marc Siegel interview Trump live on camera on Friday night. In case you missed it: Expert calls for ‘radical transparency’ on Trump’s coronavirus treatment and progress as more in president’s circle test positive In other news: • Spain has declared a state of emergency to force a lockdown in Madrid, MarketWatch’s Barbara Kollmeyer reported. A Madrid regional court ruled on Thursday that lockdown measures imposed by the health ministry were a breach of fundamental human rights, siding with local officials who had challenged the legality of measures that ban all nonessential travel in and out of Madrid and nine surrounding towns. Spain declared a state of emergency at the peak of the pandemic in the spring, allowing the government to severely restrict movement. • China has joined a global program for the distribution of COVID-19 vaccines that is backed by the WHO, Reuters reported. “We are taking this concrete step to ensure equitable distribution of vaccines, especially to developing countries, and hope more capable countries will also join and support COVAX,” foreign ministry spokeswoman Hua Chunying said in a statement. The move is a boost for the program, which was rejected by Trump. The COVAX program aims to deliver 2 billion doses of vaccine by end-2021. • More French cities are joining Paris in closing bars and cafés for at least two weeks, Euronews reported. Lyon, Lille, Grenoble and Saint-Étienne will be designated maximum alert zones from Saturday. Paris and Marseille have already shut their bars and cafés, and other cities including Toulouse and Montpellier are on watch and may be moved to a similar alert level next week. France counted 18,746 new cases of coronarivus on Thursday, a fresh record. France has 711,704 confirmed cases of COVID-19, Johns Hopkins data show, and at least 32,539 people have died. • The 2020 Nobel Peace Prize has been awarded to the World Food Program for its efforts to combat hunger and food insecurity around the globe during the pandemic, the AP reported. The Nobel Committee said that the pandemic has added to the hunger faced by millions of people around the world and called on governments to ensure that WFP and other aid organizations receive the financial support necessary to feed them. The award comes with a 10 million krona ($1.1 million) cash prize and a gold medal to be handed out at a ceremony in Oslo, Norway, on Dec. 10, the anniversary of prize founder Alfred Nobel’s death. This year’s ceremony will be scaled down due to the pandemic. iframe.twitter-tweet { width: 100% !important; } Latest tallies There are now more than 36.7 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show, and at least 1.06 million people have died. So far, 25.5 million people have recovered. Brazil has the second highest death toll after the U.S. at 148,957, but third highest case tally at 5 million. India is second to the U.S. by case tally at 6.9 million, and has the third highest death toll at 106,490. See: Prepare for a ‘marathon’ and two years of wearing masks to battle COVID-19, says prominent Spanish virologist Mexico is fourth with 83,096 deaths and ninth with 804,488 cases. The U.K. has had 42,769 deaths and 578,384 cases, the highest death toll in Europe and fifth highest in the world. Read: Second coronavirus wave could delay Europe’s recovery: ECB President Lagarde China, where the illness was first reported late last year, has had 90,736 cases and 4,739 fatalities, according to its official numbers. Read also:Abbott exec: Why better COVID-19 tests may help the U.S. get back to normalWhat’s the latest medical news? Gilead Sciences Inc. GILD, +0.82% said that a late-stage study of its experimental COVID-19 treatment showed it shortened time to recovery. The company said a study of remdesivir plus standard of care shortened the time of recovery by an average of four days, compared with a placebo and standard of care. Patients were also 50% more likely to have recovered 15 days after treatment compared with those given a placebo, the company said. Results of the study were published in the New England Journal of Medicine. Remdesivir was one of the medications reportedly prescribed to Trump for his COVID-19 infection.What are companies saying? • AT&T Inc.’s T, -1.01% WarnerMedia subsidiary is preparing a restructuring aimed at cutting costs by as much as 20%, resulting thousands of employees losing their jobs, according to a report in the Wall Street Journal. Citing people described as familiar with the matter, the report said the restructuring, which is expected to begin in the coming weeks, comes as earnings from movie tickets, cable subscriptions and TV ads have taken a hit from the pandemic. The layoffs will affect AT&T’s Warner Bros. studios, as well as TV channels such as HBO, TBS and TNT, the report said. The layoffs are in addition to the more than 500 jobs WarnerMedia eliminated at Warner Bros. in August. See: Netflix is pushing for huge international expansion after successes with ‘Sex Education’ and ‘The Crown’ • HCA Healthcare Inc. HCA, +1.61% offered an upbeat outlook for third-quarter revenue, guiding for $13.3 billion, up 4.8% from a year ago and ahead of the FactSet consensus of $12.69 billion. The hospital operator expects same-facility admissions to decline 4% and same-facility emergency room visits to fall 20%. The company expects net income before income taxes to fall 3.0% to $950 million, with results reflecting a reversal of $822 million in government stimulus recorded in the second quarter related to distribution of funds received under the Coronavirus Aid, Relief and Economic Security (CARES) Act. The company repaid early all of its share of the CARES Act distribution and made about $4.4 billion in Medicare accelerated payments. • JetBlue Airways Corp.’s JBLU, -0.07% debt was downgraded by Fitch Ratings, sending it one notch deeper into high-yield, or junk, status. A “recovery in air traffic will be slower than previously anticipated,” hampering JetBlue and other airlines’ efforts to drum up business until COVID-19 cases decrease or until treatment or a vaccine against the virus become available. JetBlue’s cash burn is likely to “remain material well into 2021,” Fitch said. The ratings agency also worried about the airline’s going deeper into debt, which helped it with liquidity but puts pressure on debt metrics in the longer term, it said. Airlines have been “proactive” in cutting capacity as demand has lagged, Fitch said. As capacity increases, so will costs, “and JetBlue will not see the same types of cost savings that some larger carriers will see from things like fleet retirements and management head count reduction,” the ratings agency said. “However, JetBlue is starting from a lower cost base, which Fitch believes puts the company in a better position to recover from the downturn.” Air-travel demand recovered some from April’s trough, but the pace of recovery slowed as reported cases began to rise again in June. “Fitch expects traffic levels to remain anemic until case levels improve substantially or until more effective treatments or a vaccine become widely available,” it said. • Walt Disney Co. DIS, +1.53% said “Soul,” the latest movie from Pixar Animation Studios, will debut exclusively on the streaming platform Disney+ on Dec. 25. The movie will be released in theaters internationally, with dates to be announced. “We are thrilled to share Pixar’s spectacular and moving ‘Soul’ with audiences direct to Disney+ in December,” Disney Chief Executive Bob Chapek said in a statement. The movie features the voices of Jamie Foxx, Tina Fey, Phylicia Rashad, Ahmir Questlove Thompson, Angela Bassett and Daveed Diggs. “Soul” is expected to give Disney a big boost, as “Hamilton” did earlier this year, as it fights for viewers during the pandemic with Apple Inc. AAPL, +1.74%, Netflix Inc. NFLX, +1.43%, Hulu, Comcast Corp. CMCSA, -0.99%, AT&T Inc., Amazon.com Inc. AMZN, +3.01% and others."}]}