{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-slide-as-coronavirus-stimulus-negotiations-come-into-focus-2020-08-04", "published": 1596557960.0, "headline": "10-year Treasury yield flirts with record closing low as investors grow gloomy on economic rebound", "body": "U.S. Treasury yields fell Tuesday as investors remained pessimistic about the U.S. economy’s health and eyed the slow pace of negotiations in Congress on another fiscal relief package to combat the coronavirus pandemic.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 4.8 basis points to 0.514%, its lowest since March 9. If the benchmark rate falls below 0.501%, it will set a new record closing low. The 2-year note rate TMUBMUSD02Y, 0.156% held steady at 0.111%, while the 30-year bond TMUBMUSD30Y, 1.576% slumped 5.3 basis points to 1.191%. Opinion: Why would anyone own bonds now? There are at least five reasons What’s driving Treasurys? The COVID-19 pandemic’s trajectory in the U.S. drew focus and raised doubts about whether it could stall the recovery in the labor market. The U.S. coronavirus case tally climbed to 4.72 million and the death toll rose to 155,471, according to data aggregated by Johns Hopkins University. However, the number of new U.S. cases of COVID-19 on Monday was below 50,000 for a second day, The Wall Street Journal noted, with some of the most hard-hit states showing a slowdown in infections. On the data front, U.S. factory orders rose 6.2% in June to mark the second increase in a row, but remained well below last year’s levels. Investors said they were mostly looking ahead to the official monthly jobs report on Friday, where MarketWatch-polled analysts forecast the U.S. economy recovered 1.75 million jobs in July. The worry is that without continued gains in the labor market, consumer spending will remain subdued and hold back the U.S. economic recovery. Market participants also watched the progress of the coronavirus aid bill in Congress as Republicans and Democrats continued to haggle over the extension of enhanced unemployment benefits. Senate Majority Leader Mitch McConnell said he was “prepared to support” a coronavirus relief agreement if Democrats and the White House reached a deal. The U.S. Treasury Department said Monday it expects to borrow $2 trillion over the rest of the year as the federal government’s takes on debt to finance the response to the coronavirus pandemic. Analysts say the rush of new issuance is unlikely to dent appetite for government bonds this year, as the Federal Reserve’s bond-buying and pledge to keep monetary policy easy have kept bond yields pinned down near their record lows. The Reserve Bank of Australia left its benchmark interest rate unchanged and said it would resume bond purchases to keep yields in check.What did market participants’ say? “Treasurys are definitely signaling a certain level of frustration and pessimism surrounding the global recovery,” said Patrick Leary, chief market strategist at Incapital, in an interview."}]}