{"article": [{"url": "https://www.marketwatch.com/story/this-nasdaq-whale-may-have-triggered-the-stock-markets-brutal-rout-claims-report-11599234572", "published": 1599294080.0, "headline": "This 'Nasdaq whale' may have helped trigger the stock-market's brutal rout", "body": "The trigger for a seismic stock-market slump Thursday and Friday that has erased weeks of gains for a frothy U.S. stock market, may have been embattled investment firm SoftBank, according to a report by Financial Times (paywall). The report from the London-based financial paper says that Japanese investing conglomerate SoftBank has been loading up on options in technology stocks over the past several months that contributed to the rally and may have been the market vulnerable to the punishing declines that equity markets have been experiencing over the past 24 hours. The FT, quoted one investment banker as describing the options purchases that SoftBank made as \"dangerous\" bets on the market. Experts have said that the boom in options bets in recent weeks helped to make the market more susceptible to massive pullbacks like those playing out on Friday and in the previous session. On Thursday, the Dow Jones Industrial Average DJIA, +0.56% ended with a loss of 807.77 points, or 2.8%, at 28,292.73, after dropping more than 1,000 points at its session low. The S&P 500 index SPX, +0.87% closed 125.78 points lower, down 3.5%, at 3,455.06. The Nasdaq Composite COMP, +1.39% tumbled 598.34 points, or 5%, to end at 11,458.10. The declines marked the biggest one-day drops for all three indexes since June. The FT report suggests the SoftBank investment fund may have been purchasing bullish call options. Call options give holders the right but not the obligation to buy a certain number of shares (100 per option contract) at a certain price (strike price) by a certain date (expiration date). See: Barron's: SoftBank's Bets on Hot Tech Stocks May Have Fueled Tech's Big Rally MarketWatch earlier reported that bets on call options were rising even as the stock market trades in record-setting territory, citing research from Bespoke Investment Group. Call options are viewed as bullish bets on an asset, as opposed to put options, and Bespoke indicated that appetite for calls, particularly among individual investors, had boomed. The Wall Street Journal wrote on Friday that SoftBank bought options tied to billions of dollars worth of individual tech stocks, which may have included bullish bets on Tesla TSLA, +1.89% and Apple AAPL, +1.74%. The Journal wrote that regulatory filings show the investor bought nearly $4 billion of shares in technology companies in the spring. They said that not included in those disclosures were the massive options trades, which were reportedly bought to pay off if the stock market rises to a certain level and then lock in gains, the paper said citing people familiar. Barron's in mid August also reported that SoftBank netted equity gains of $611.5 million in the second quarter after investing $10 billion of cash in large-cap stocks. Read: SoftBank Made Big Bets on Amazon, Tesla, and 23 Other Tech Stocks. The Timing Was Perfect. The reported \"aggressive move into the options market\" for SoftBank would mark a new chapter for the investment firm, which has traditionally made big bets on start-ups through its $100 billion Vision Fund, including those for office-sharing platform WeWorks, which have proved a black eye for the company run by Masayoshi Son. A SoftBank spokesperson declined to comment to MarketWatch on the trading moves reportedly executed by the investment firm."}]}