{"article": [{"url": "https://www.marketwatch.com/story/kodaks-stock-surge-turned-executive-options-into-huge-potential-payday-2020-07-31", "published": 1596274940.0, "headline": "Kodakâ\u0080\u0099s stock surge turned executive options into huge potential payday", "body": "A sudden surge in Eastman Kodak Co.â\u0080\u0099s stock this week has turned a bunch of money-losing executive stock-option grants made in the past two years â\u0080\u0094 including some made on Monday â\u0080\u0094 into a sudden personal windfall for the companyâ\u0080\u0099s executive chairman. On Tuesday, Kodak KODK, +12.98% Â and the U.S. government announced a preliminary agreement under which the firm would receive a loan to produce drug ingredients. The news has since led the one-time photography giantâ\u0080\u0099s share price to more than triple. This week, the companyâ\u0080\u0099s stock has risen to as high as $60 a share from around $2 last week. It is the latest company to capture investorsâ\u0080\u0099 attention as they scrabble to find winners in a volatile and often confounding market. Even companies in bankruptcy proceedings, such as Hertz Global Holdings Inc., have surged in value. One of the largest winners from the rebound is Kodak Executive Chairman Jim Continenza, who stands to gain more than $95 million from the rebound if he exercises his options at current prices. Those paper gains would change depending on where the stock trades whenever he decides to sell his stake. In a statement, a company spokesman said Continenzaâ\u0080\u0099s potential gains havenâ\u0080\u0099t been realized and that Continenza, Kodakâ\u0080\u0099s biggest individual shareholder, believes strongly in the company, has never sold a share of its stock and has no intention of doing so. As of late March, Continenza owned 5.8% of Kodakâ\u0080\u0099s shares. An expanded version of this report appears on WSJ.com. Popular on WSJ.com: Mystery Seeds Spread Around the World What the Apple Stock Split Means"}]}