{"article": [{"url": "https://www.marketwatch.com/story/exxons-debt-load-is-expected-to-rise-as-it-commits-to-paying-dividend-2020-07-31", "published": 1596279140.0, "headline": "Exxon's debt load is expected to rise as it commits to paying dividend", "body": "Investors had braced for bad news for Exxon Mobil Corp. and Chevron Corp., and their fears were confirmed Friday when both energy integrateds reported second-quarter results that showed steep losses and dwindling sales amid the economic destruction wreaked by the coronavirus. Exxon XOM, -1.47%  reported an adjusted loss of 70 cents a share on sales of $32.6 billion, contrasting with a FactSet consensus that called for an adjusted loss of 61 cents a share on sales of $38.2 billion. Chevron CVX, -1.62%  reported an adjusted loss of $1.59 a share on sales of $13.5 billion, contrasting with FactSet consensus of an adjusted loss of 95 cents a share on sales of $21.9 billion. On a call with analysts following results, Exxon said it remained committed to paying dividends. Exxon and Chevron are the only two energy companies that are \"dividend aristocrats,\" or S&P companies that have paid dividend for at least 25 consecutive years. Exxon has paid a dividend for 37 years, and Chevron's streak is almost as long. Exxon has \"a long history of providing a reliable and growing dividend. A large portion of our shareholder base has come to view that dividend as a source of stability in their income, and we take that very seriously,\" Vice President Neil Chapman said on the company's earnings call. Exxon plans to cut operating expenses further and defer expenses where it can, and doing so \"will enable us to maintain the dividend and hold debt at its current level.\" Exxon's cash flow for the year covers some 70% of its capital program, and none of the dividend, which is being supported through Exxon's balance sheet, RBC Capital Pavel Molchanov said in a note Friday. \"As such, there is no avoiding a sizable increase in leverage: we anticipate net debt/cap rising from 19% at year-end 2019 to 27% at year-end 2020, the latter being the highest level since the Exxon/Mobil merger in 1999,\" he said. Exxon executives said that their goal is to avoid taking on any more debt, but they are likely to need borrowings of $10-plus billion, factoring in a flat 2021 budget, he said. \"While we see the dividend as safe - if for no other reason than management's desire to maintain S&P Aristocrat status - the cash flow outspend is colossal under current conditions,\" Molchanov said, keeping his rating on Exxon stock at the equivalent of sell. Related:Exxon and Chevron are 'dividend aristocrats', but for how long? Exxon's second-quarter \"probably poses as many questions as it does answers,\" Citi analyst Alastair Syme said in a note on Friday. \"The dividend is undoubtedly the real question, or maybe more correctly the forward scenario that the company is adopting to underpin shareholder returns,\" he said. The key driver for Exxon's miss was exploration and production price realizations, while production was generally in line, said Neil Mehta with Goldman Sachs in a note. Chevron's miss was driven mainly by timing effects of crude prices throughout the volatile quarter and other corporate expenses, Mehta said. \"Production came in above our expectations, with volumes primarily beating our estimates on U.S. (both liquids and gas) and International liquids,\" he said. Chevron's \"challenging\" second quarter has seen the company's debt expand 8% quarter-on-quarter, \"above our expectations and the rate of build seen at (integrated oil company) peers,\" Citi's Syme said. Its balance sheet \"is not as pristine as it once was,\" and the deal to buy Noble Energy Inc. will add further pressure in the second half of the year, he said. Chevron last week announced plans to buy Noble Energy for $5 billion. Chevron stock \"has been a go-to name in the sector through 1H we would argue for reasons of security,\" Symes said. \"But 2Q results show a picture that is perhaps not as resilient as the market thought it might be.\" Analysts at SunTrust said that they continued to prefer Chevron over Exxon, as Chevron has \"ample liquidity to continue to pay its dividend.\" While Chevron's U.S. oil volumes are \"holding in surprisingly well\" quarter-on-quarter, international pricing disappointed, they said. Refining input was also lower than expected, with negative margins dragging down cash flow, they said. Shares of Exxon have lost 40% this year, while Chevron shares are down 32%. That compares with losses of around 9% for the Dow Jones Industrial Average DJIA, +0.56%  and under 1% for the S&P 500 index SPX, +0.87%  in the same period. Both companies are Dow components."}]}