{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-slump-220-points-as-resurgence-of-coronavirus-cases-and-trade-tensions-take-focus-2020-06-24", "published": 1593017000.0, "headline": "Dow ends 710 points lower, stocks book worst day in about two weeks, amid quarantines and rising coronavirus cases", "body": "U.S. stocks finished sharply lower Wednesday, booking their worst drop in about two weeks, as investors worried that rising coronavirus cases in many American states will set back economic recovery. All 11 sectors in the S&P 500 index were lower after Florida and California booked daily records for new cases, while intensive-care unit beds in Houston, Texas were reported at 97% capacity.How did benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% shed 710.16 points, or 2.7%, ending at 25,445.94. The S&P 500 SPX, +0.87% fell 80.93 points, or 2.6%, to end at 3,0501.33. The Nasdaq Composite COMP, +1.39% gave up 222.20 points, or 2.2%, finishing at 9,909.17, a day after booking a fresh record closing high. It was the worst daily point and percentage drop for all three stock benchmarks since June 11, according to Dow Jones Market Data. On Tuesday, the Dow Jones Industrial Average rose 131.14 points, or 0.5%, to close at 26,156.10, The S&P 500 index gained 13.43 points, or 0.4%, finishing at 3,131.29. The Nasdaq Composite Index rose 74.89 points, or 0.7%, to end at a new 10,131.37 record. Watch: U.S. Equities: Overbought or Undervalued?What drove the market? New York, New Jersey and Connecticut announced 14-day quarantines on Wednesday on visitors from states with high COVID-19 infection rates. The “travel advisory,” which impacts residents of nine states, raises concerns about the pace of business activity resuming after lockdowns imposed to contain the spread of the pandemic. “Once you start talking about quarantines, there’s a potential that it will lead to less travel,” James Ragan, director of wealth management research at D.A. Davidson, in Seattle told MarketWatch, adding that markets had been rallying on the reopening story, underscored by improving consumer activity and daily airline travel. “If that starts to slow, that does create the narrative that the recovery could be on pause,” Ragan said. Airline stocks swooned, with shares of the U.S. Global Jets Exchange Traded Fund JETS, +0.16% closing down 5.5%, American Airlines Group Inc AAL, +0.34% 7.1% lower andUnited Airlines Holdings Inc. UAL, +0.32% off 8.3%. The 7-day average of daily new COVID-19 cases increased more than 30% compared with a week ago, according to a CNBC analysis of Johns Hopkins University data, while Bloomberg noted coronavirus cases are surging in Texas, Florida, Arizona and California with some city and state officials considering slowing or reversing business reopening plans. Texas Gov. Greg Abbott on Tuesday advised all the state’s residents to stay home, while intensive-care beds at Houston’s Texas Medical Center were reported as 97 percent occupied. Hospitals in the state have been grappling with a more than doubling of patients hospitalized with coronavirus since the beginning of the month. “We have a coronavirus gut check in the market. The news we’ve seen recently suggest the recovery is going to be uneven,” said Keith Lerner, chief market strategist at Truist/SunTrust Advisory Services, in an interview. Lerner also thinks part of the selloff could be related to mutual funds and pension funds needing to rebalance their gains from equities to bonds before the end of the quarter. The sharp rebound in stocks since March have led some investors to become overweight to equities, analysts said. On Tuesday, at a Congressional hearing, public-health expert Dr. Anthony Fauci described the rise in cases as “disturbing,” while vowing to increase testing, but also saying he was hopeful about a vaccine. Read:Fauci says in 40 years of dealing with viral outbreaks, he’s never seen anything like COVID-19 The epidemic has been moving beyond densely urban cities to rural communities, often the center of the nation’s agricultural production. The Trump Administration said it plans to pull federal funding for 13 coronavirus testing facilities across the nation by the end of June, shifting control to states, including several in Texas. On the interational trade front, Bloomberg reported that the U.S. is considering imposing tariffs on some $3.1 billion worth of goods from France, German, Spain and the U.K., on products, including beer, gin, olives and trucks, also creating headwinds for stocks and igniting fears of a fresh trade war as the American economy reels from the pandemic. The Trump administration also has been threatening to reimposing tariffs on imports of aluminum from Canada on July 1 as the new USMCA, or the United States Mexico Canada Agreement, which replaced the North American Free Trade Agreement, is set to take effect. Meanwhile, the International Monetary Fund cut its economic forecast for 2020, saying that the coronavirus pandemic has caused an unprecedented decline in global activity. The IMF dropped its global economic growth expectations for this year to negative 4.9%. That’s almost two percentage points lower than three months ago. In 2021, global growth is expected to rebound to a 5.4% growth rate, still leaving the level of GDP about 6.5 percentage points lower than the pre-COVID-19 projections in January. Chicago Fed President Charles Evans said the U.S. economy may require more monetary stimulus, especially with inflation so low and at risk of further weakness, in a speech Wednesday delivered virtually to a luncheon in Cedar Rapids Iowa. This comes as the U.S. government debt is set to explode to more than twice the size of the entire economy in three decades, warned the Committee for a Responsible Federal Budget, in a report issued Wednesday by the bipartisan group, which focuses on fiscal matters.Which stocks were in focus? Shares of Dell Technologies DELL, -0.39% rose 8.4% after the Wall Street Journal reported that the company was examining options including a spinoff for its roughly $50 billion stake in VMware Inc. as the PC maker seeks to boost the value of its shares. Apple Inc. shares AAPL, +1.74% shed 1.8% as the Department of Justice and state attorneys general are looking at an investigation that would focus on the company’s App Store, according to a Politico report. The iPhone maker also said it would close seven stores in Houston amid the city’s COVID-19 case spike. GNC Holdings Inc. US:GNC filed for bankruptcy late Tuesday, as it expects to accelerate its plan to close at least 800 to 1,200 of its stores. Shares of the vitamin and wellness supplements retailer slid 24.4% T-Mobile U.S. Inc. shares TMUS, +1.50% closed 1.2% higher after Softbank Group Corp.sold a large chunk of its stake in the wireless carrier. Softbank sold 143.4 million shares to investors at $103 per share, a 3.9% discount to Tuesday’s closing price. Shares of Hertz Global Holdings Inc. HTZ, -1.78% shot up 29.8% in active trade Wednesday, snapping a 4-day losing streak in which they plunged 38%, after Jefferies analyst Hamzah Mazari said his checks suggest that CarMax Inc. KMX, -1.02% and AutoNation Inc. AN, -1.70% could be interested in the bankrupt car rental company. Caesars Entertainment Corporation CZR, -4.36% shares shed 3.2%, after the company said Wednesday that masks must be worn at all times for everyone indoors at its properties, except when eating and drinking. Plug Power Inc. PLUG, +3.07% shares soared 17.7% Wednesday, as Wall Street analysts boosted price targets after the provider of hydrogen engines raised its longer-term revenue target given the completion of recent acquisition. How did other assets perform? West Texas Intermediate U.S. crude US:CLQ20 fell $2.36, or nearly 5.9%, to end at $38.01 a barrel on the New York Mercantile Exchange. In precious metals, gold futures ended lower, with the August contact US:GCM20 down $6.90, or 0.4%, to settle at $1,775.10 an ounce, a day after hitting an eight-year high. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 2.5 basis points to 0.683% amid inflows into haven assets. Bond prices move inversely to yields. The greenback was up 0.6% against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index. DXY, -0.58% In global equities, the Stoxx Europe 600 index SXXP, +0.55% closed 2.8% lower as concerns around a a renewed tariff spat put investors on edge. In Asian markets, China’s benchmark CSI 300 index 000300, +2.04% rose 0.4%, the Japanese Nikkei NIK, -0.11% was down 0.1%, Hong Kong’s Hang Seng HSI, -0.30% lost 0.5%. Mark DeCambre contributed reporting"}]}