{"article": [{"url": "https://www.marketwatch.com/story/im-a-young-68-with-3200-a-month-in-social-security-and-dont-want-it-taxed-where-should-i-retire-north-or-west-of-colorado-2020-08-15", "published": 1600687520.0, "headline": "I'm a 'young 68' with $3,200 a month in Social Security and don't want it taxed - where should I retire north or west of Colorado?", "body": "Dear MarketWatch, I am finishing 50 years in the airline industry next year, and I am looking to relocate to anywhere north or west of Colorado (including Colorado) - but not California because of the taxes. I will have approximately $3,200 a month in Social Security and will hopefully get a part-time job on top of that. No sale of a house. I love the outdoors, hiking, photography, mountains and snow. The location cannot tax Social Security, and I prefer no state income tax. College towns are great. No retirement towns as I hate the R word. I prefer to say I am going onto new adventures. I am a young and very healthy 68. Thank you, S. Dear S., Congratulations on 50 years in the airline industry - quite an accomplishment for an industry that regularly goes through upheaval. Given the size of that Social Security check, I'm guessing you've also delayed claiming past your full retirement age, so congratulations on that, too. If a clear-cut no taxes on Social Security is your top priority, start with Washington, Wyoming and Nevada (no income tax, including Social Security) and Oregon (no tax on Social Security income). California doesn't tax Social Security income either, by the way. But Colorado would be out. However, Social Security taxes are never cut and dried; other states offer exemptions of various kinds. Using calculators on the Smart Asset website, for example, you wouldn't pay taxes on that $38,400 in Social Security in Colorado, Idaho or Montana either. That part-time job? You may pay taxes, but - let's be honest - it won't be much. (Another money tip: With your retirement income, you can file your taxes - federal and state - for free through the Free File Alliance.) So you may not want to be so single-minded about income taxes. One way or another, there's a bill for clearing snow from the road and filling potholes. Sales taxes may be higher, or your rent will cover your landlord's property taxes. Look at all of your costs. Equally, be realistic about what that part-time job will pay and the hours you'll work. So where could you move? I started my search for your dream retirement location by using MarketWatch's \"where should I retire\" tool. Given that you want a part-time job, I selected below-average unemployment (pre-pandemic) as well as college town, no taxes on Social Security, July average highs in the 80s and median rents under $1,000 as \"must-haves\". A below-average cost of living given your budget, no state income taxes, low overall tax burden (for good measure), national forest and ski town (to get that mountain flair) were my five \"nice to haves.\" You may decide you prefer other criteria. Perhaps you prefer a larger or smaller metro? None delivered on everything, but here are some of the broader metro areas (formally called metropolitan and micropolitan statistical areas by the Census Bureau) that popped up: Laramie, Wyo. (here's a look at Cheyenne, less than an hour away); Elko, Nev.; Reno, Nev.; Lewiston, Idaho; and Pullman, Wash. Places can sound good on paper, of course, but that's not the same as experiencing them in real life. When you do visit, pretend you are living there and think about how you'll build a new network of friends. Meetup groups? House of worship? Senior center? Something else? You don't want to be unhappy and go through the expense of another move. Given that you haven't indicated an extra cushion from savings, tax-deferred or otherwise, there's not much room for a costly mistake. READ:There is more to picking a place to retire than low taxes - avoid these 5 expensive mistakes Let's look at two locations that came up on MarketWatch's retirement tool, plus a Colorado option. I'm focusing on the main cities in the metro areas, but don't rule out nearby towns. iStockphoto Elko, Nevada Elko is a city of 20,000 in northeastern Nevada and part of a two-county metro area of about 55,000 people. This gold-mining center is home to Great Basin College and about 4,000 students. Unemployment was low pre-pandemic. For your outdoor adventures, you'd be near the Ruby Mountains and Ruby Lake National Wildlife Refuge. When in town, check out the California Trail Interpretive Center, which explores the 2,000-mile route from the Missouri River to California (overlapping in part with the Oregon Trail) during America's era of westward expansion. Northeastern Nevada Regional Hospital is your first stop for major medical care, but you'd need to go to the Reno or Las Vegas area for more complicated care. Nevada has no income tax, which ticks that financial box. To get a sense of what's available for rent, see the listings on Realtor.com (which, like MarketWatch, is owned by News Corp.) Getty Images Pullman, Wash. I was torn between Pullman and Lewiston, only 35 minutes apart and each with more than 30,000 residents. Lewiston is your cheaper choice (and you'd have the Snake and Clearwater rivers to play in), but Pullman is the better college town, given that it's home to Washington State University and about 20,000 college students. (Lewis-Clark State College, with fewer than 4,000 students, is in Lewiston.) It also gets more snow - and you said you like snow. You'd get an average of 10 to 11 inches of snow in December and then again in January, even more than in Elko. Explore the area to the east - the Palouse Scenic Byway - and Palouse Falls State Park with its stunning canyon and waterfall. Lewiston does have the more extensive hospital, according to the Washington Department of Health. St. Joseph Regional Medical Center is a level III trauma center, and Pullman Regional Hospital is a Level IV. The Pullman-Moscow (Idaho) MSA is larger, with about 90,000 residents and the median rent in Whitman County, which includes Pullman, is $952 for a two-bedroom apartment, according to U.S. Housing and Urban Development data; the Lewiston-Clarkston (Wash.) MSA has about 63,000 people, and rent on a two-bedroom running about $913. Washington has no income tax. Here's what's for rent in both Pullman and Lewiston, according to Realtor.com. Downtown Grand Junction. iStockphoto Grand Junction, Colorado This is a city of 63,000 people - and a metro area of 154,000 - on Colorado's Western Slope, best known as the state's fruit-growing region. You'll also find wineries. That's because average highs in July are 93 degrees. Winter nights get below freezing, but daytime highs average around 40 degrees. Two rivers come together here: the Colorado (once called the Grand) and the Gunnison. Just outside town is Colorado National Monument, a national park full of red-rock canyons and other rock formations. There's yet more canyons in Dominguez-Escalante National Conservation Area to the south and the McInnis Canyons National Conservation Area to the west. Don't forget Grand Mesa National Forest to the east for more hiking opportunities. Grand Junction is home to Colorado Mesa University, with about 8,000 students. St. Mary's Medical Center is a Level II trauma center. Here's what the rental market looks like in Grand Junction right now. Readers, where should Spencer retire?"}]}