{"article": [{"url": "https://www.marketwatch.com/story/trump-has-now-admitted-hes-blocking-financial-rescue-of-post-office-curb-role-of-mail-in-votes-in-november-election-2020-08-14", "published": 1597431140.0, "headline": "Trump has now admitted heâ\u0080\u0099s blocking financial rescue of post office to curb role of mail-in votes in November election", "body": "WASHINGTON (AP) â\u0080\u0094 President Donald Trump frankly acknowledged that heâ\u0080\u0099s starving the U.S. Postal Service of money to make it harder to process an expected surge of mail-in ballots, which he worries could cost him re-election. Donâ\u0080\u0099t miss:Trump explicitly links mail-in voting and his opposition to post-office financial relief Plus:Biden calls Trump opposition to by-mail voting â\u0080\u0098un-Americanâ\u0080\u0099 In an interview on Fox Business Network, Trump explicitly noted two funding provisions that Democrats are seeking in a relief package that has stalled on Capitol Hill. Without the additional money, he said, the Postal Service wonâ\u0080\u0099t have the resources to handle a flood of ballots from voters who are seeking to avoid polling places during the coronavirus pandemic. â\u0080\u009cIf we donâ\u0080\u0099t make a deal, that means they donâ\u0080\u0099t get the money,â\u0080\u009d Trump told host Maria Bartiromo on Thursday. â\u0080\u009cThat means they canâ\u0080\u0099t have universal mail-in voting; they just canâ\u0080\u0099t have it.â\u0080\u009d Capitol Report:Trump used coronavirus briefing to criticize Bidenâ\u0080\u0099s call for a mask mandate, decry mail-in voting, question Kamala Harrisâ\u0080\u0099s eligibility to serve as vice president Key Words:Trump blasts Democratic demands for postal-service money, saying mail-in voting would be â\u0080\u0098fraudulentâ\u0080\u0099 Trumpâ\u0080\u0099s statements, including the false claim that Democrats are seeking universal mail-in voting, come as he is searching for a strategy to gain an advantage in his November matchup against Joe Biden. Heâ\u0080\u0099s pairing the tough Postal Service stance in congressional negotiations with an increasingly robust mail-in-voting legal fight in states that could decide the election. In Iowa, which Trump won handily in 2016 but is more competitive this year, his campaign joined a lawsuit Wednesday against two Democratic-leaning counties in an effort to invalidate tens of thousands of votersâ\u0080\u0099 absentee ballot applications. That followed legal maneuvers in battleground Pennsylvania, where the campaign hopes to force changes to how the state collects and counts mail-in ballots. And in Nevada, Trump is challenging a law sending ballots to all active voters. His efforts could face limits. The U.S. Supreme Court on Thursday rebuffed Republicans who challenged an agreement in Rhode Island allowing residents to vote by mail through Novemberâ\u0080\u0099s general election without getting signatures from two witnesses or a notary. For Democrats, Trumpâ\u0080\u0099s new remarks were a clear admission that the president is attempting to restrict voting rights. Biden said it was â\u0080\u009cPure Trump. He doesnâ\u0080\u0099t want an election.â\u0080\u009d See:Amid bluster, Trump requests mail-in ballot for himself in Florida Colorado Secretary of State Jena Griswold said it was â\u0080\u009cvoter suppression to undermine the safest method to vote during a pandemic, and force Americans to risk their lives to vote.â\u0080\u009d Negotiations over a big new virus relief package have all but ended, with the White House and congressional leaders far apart on the size, scope and approach for shoring up households, reopening schools and launching a national strategy to contain the coronavirus. While there is some common ground over $100 billion for schools and new funds for virus testing, Democrats also want other emergency funds that Trump rejects. â\u0080\u009cThey want $3.5 billion for something that will turn out to be fraudulent. Thatâ\u0080\u0099s election money, basically,â\u0080\u009d Trump said during Thursdayâ\u0080\u0099s call-in interview. Democrats have pushed for a total of $10 billion for the Postal Service in talks with Republicans on the COVID-19 response bill. That figure, which would include money to help with election mail, is down from a $25 billion plan in a House-passed coronavirus measure. Postmaster General Louis DeJoy has said that the agency is in a financially untenable position, but he maintains it can handle this yearâ\u0080\u0099s election mail. A major donor to Trump and other Republicans, DeJoy is the first postmaster general in nearly two decades who is not a career postal employee. Opinion:Hereâ\u0080\u0099s the truth about mail-in voting: fair, safe and honest Plus:Trump claims he has authority to issue executive order on mail-in ballots â\u0080\u009cAlthough there will likely be an unprecedented increase in election mail volume due to the pandemic, the Postal Service has ample capacity to deliver all election mail securely and on-time in accordance with our delivery standards, and we will do so,â\u0080\u009d he told the Postal Serviceâ\u0080\u0099s governing board last week. Memos obtained by The Associated Press show that Postal Service leadership has pushed to eliminate overtime and halt late delivery trips that are sometimes needed to ensure mail arrives on time, measures that postal workers and union officials say are delaying service. Additional records detail cuts to hours at post offices, including reductions on Saturdays and during lunch hours. Democrats, and a handful of Republicans, have sent DeJoy several letters asking him to reverse his changes and criticizing what they say is a lack of openness by the agency. Late Wednesday, Senate Democrats again wrote DeJoy, this time saying postal leadership is pushing state election officials to opt for pricier first-class postage for mail-in ballots to be prioritized. â\u0080\u009cInstead of taking steps to increase your agencyâ\u0080\u0099s ability to deliver for the American people, you are implementing policy changes that make matters worse, and the Postal Service is reportedly considering changes that would increase costs for states at a time when millions of Americans are relying on voting by mail to exercise their right to vote,â\u0080\u009d the Democrats wrote. Separately, in a letter last month, the Postal Service warned Michigan Secretary of State Jocelyn Benson that the agency might not be able to deliver ballots in time to be counted under the stateâ\u0080\u0099s deadlines for casting mail-in votes. Postal Service spokesman David Partenheimer said in a statement that â\u0080\u009ccertain deadlines concerning mail-in ballots, may be incompatible with the Postal Serviceâ\u0080\u0099s delivery standards,â\u0080\u009d especially if election officials donâ\u0080\u0099t pay more for first-class postage. â\u0080\u009cTo the extent that states choose to use the mail as part of their elections, they should do so in a manner that realistically reflects how the mail works,â\u0080\u009d he said. In a memo to staff Thursday, DeJoy said his policies have brought â\u0080\u009cunintended consequences that impacted our overall service levels,â\u0080\u009d but added that the Postal Service â\u0080\u009cmust make a number of significant changes which will not be easy, but which are necessary.â\u0080\u009d â\u0080\u009cThis will increase our performance for the election and upcoming peak season and maintain the high level of public trust we have earned for dedication and commitment to our customers throughout our history,â\u0080\u009d DeJoy wrote, according to the memo obtained by the AP. Judy Beard, legislative and political director for the American Postal Workers Union, said postal workers are up to the task of delivering mail-in ballots this year. â\u0080\u009cWe definitely know that the president is absolutely wrong concerning vote-by-mail,â\u0080\u009d she said. “ Ballots were mailed Wednesday to both the president and first lady Melania Trump at the Mar-a-Lago resort, which Trump lists as his legal address, according to online Palm Beach County elections records. Both voted by mail in the presidential preference primary in March. ” Rep. Gerry Connolly, D-Va., chair of the House subcommittee on government operations, said Trump is acknowledging that he wants to hold up funding for the U.S. Postal Service to hinder Americans from voting. â\u0080\u009cThe president admits his motive for holding USPS funding hostage is that he doesnâ\u0080\u0099t want Americans to vote by mail,â\u0080\u009d Connolly said in a statement Thursday. â\u0080\u009cWhy? It hurts his electoral chances. Heâ\u0080\u0099s putting self-preservation ahead of public safety, for an election he deserves to lose.â\u0080\u009d Trump has requested a mail-in ballot for Floridaâ\u0080\u0099s primary election Tuesday. Ballots were mailed Wednesday to both the president and first lady Melania Trump at the Mar-a-Lago resort, which Trump lists as his legal address, according to online Palm Beach County elections records. Both voted by mail in the presidential preference primary in March, according to records. Read on:Trump suddenly supports mail-in voting â\u0080\u0094 for the key swing state of Florida"}]}