{"article": [{"url": "https://www.marketwatch.com/story/feds-mester-says-labor-market-is-even-weaker-than-data-suggests-2020-08-05", "published": 1596653300.0, "headline": "Fed's Mester says labor market is even weaker than data suggests", "body": "The U.S. labor market is even weaker than the data indicates, said Cleveland Fed President Loretta Mester on Wednesday. In a virtual speech to the 2020 Liberal Arts Macroeconomic Conference in Pomona Calif., Mester said that over half of the business contacts in her district are pulling back in response to the recent rise in coronavirus cases. Companies are recalling workers more slowly than originally planned. And they are \"meaningfully altering their plans\" by reducing employment, cutting employee compensation or pulling the plug on planned capital expenditures, she added. \"The tone that we're getting from businesses really has turned down since the increase in the virus cases,\" she said. Cutting wages is going to harm demand, Mester said. There are almost 18 million unemployed workers, up from 6 million in February. That means one in 15 Americans over the age of 16 is unemployed, Mester said. Many workers are stuck working part-time even though they want full-time work, and some are so discouraged they've stopped looking entirely and are no longer counted on the government's official tally. Data released by ADP earlier Wednesday showed that the private sector pulled back on hiring in July. On Friday, the July employment report from the Labor Department is also expected to show a slowdown in job growth after strong gains in May and June. Read: Wave of rehiring to subside in July, economists say Overall, Mester said U.S. economic growth \"has begun to decelerate with the rise in virus cases.\" \"These recent developments add uncertainty to what was already an uncertain outlook,\" the Cleveland Fed president said. It remains too early to tell whether this deceleration will be temporary. But it means the economy will be in the \"reopening\" phase, rather than the \"recovery\" phase, for a little longer. Mester called on Congress to increase spending to help Americans while the economy struggles. \"It is also clear that more fiscal support is needed to provide a bridge for households, small businesses, and state and local municipalities that have borne the brunt of the economy shutdown until the recovery is sustainably in place,\" she said. She said she was hopeful a new coronavirus relief measure would be passed by Congress. Uncertainty around the measure is one of the risks facing the economy, she said. Stocks closed higher on Wednesday, with the Dow Jones Industrial Average DJIA, +0.56%  up 373 points."}]}