{"article": [{"url": "https://www.marketwatch.com/story/heres-why-apples-stock-split-might-not-be-so-bullish-for-its-shares-2020-08-03", "published": 1596877460.0, "headline": "Hereâ\u0080\u0099s why Appleâ\u0080\u0099s stock split might not be so bullish for its shares", "body": "Appleâ\u0080\u0099s AAPL, +1.74% Â planned 4-for-1 stock split announcement last week would normally be an extremely bullish signal for the U.S. market. But these are not normal times. A stock split typically is a bullish signal because it signaled managementâ\u0080\u0099s confidence that its stock would perform well in subsequent months and years. Thatâ\u0080\u0099s because a firmâ\u0080\u0099s managers have a loosely defined â\u0080\u009csweet spotâ\u0080\u009d in which they want their stock to trade. If it trades far above that sweet spot, they would split their stock only if they believed the price wouldnâ\u0080\u0099t otherwise fall back into that range. This bullish effect is confirmed by academic studies. One of the earliest, and most prominent, of such studies was authored by David Ikenberry, a finance professor at the University of Colorado. He found that the average stock undergoing a two-for-one stock split beat the market by 7.9% over the year after the announcement of the split â\u0080\u0094 and by 12.2% over the three years after that announcement. This effect has become a lot weaker in recent years, for several reasons. One is that highly priced shares donâ\u0080\u0099t present any obstacle to institutional investors, and those large institutions have come to increasingly dominate the market. The second is that retail investors with relatively small amounts to invest are now able to purchase fractional shares. So even they arenâ\u0080\u0099t fazed by a high-priced stock. Read: How Appleâ\u0080\u0099s stock split will change the pecking order in the 124-year old Dow industrials Also see: Two stock market risks are hiding in Apple, Amazon, Facebook and Alphabet (You may not have been aware of this ability to buy fractional shares of a company, since only this year have the biggest discount brokerage firms â\u0080\u0094 notably Fidelity Investments and Charles Schwab â\u0080\u0094 made it possible for clients to do so. But for several years now a number of smaller online brokerages have given clients this ability.) Regardless of the reasons, thereâ\u0080\u0099s little doubt that stock splits have become far less common. Over the course of the nine calendar years from 2011 through 2019, for example, there was a 75% reduction in the number of forward splits within the S&P 1500 index. This reduction in split frequency occurred despite an increasing number of high-priced stocksâ\u0080\u0094shares that are undoubtedly above whatever sweet spot that used to exist. Among the constituent stocks in the S&P 500 SPX, +0.87% Â , contrast the number of high-priced stocks now with the number the prevailed at the beginning of 2011. January 2011 Current Trading for more than $1,000 per share 0 7 Trading for more than $500 per share 1 16 Trading for more than $100 per share 20 211 Split Effect: Weakened â\u0080\u0094 or eliminated? To be sure, just because the decades-ago rationale for splitting shares has weakened doesnâ\u0080\u0099t mean it no longer has any bullish significance. To find out how much it may have been lessened, I turn to a newsletter entitled 2-for-1 Stock Split Newsletter, which editor Neil MacNeale created in 1996. His strategy calls for him, each month, to purchase a stock for his model portfolio that had recently split its shares, and hold it for exactly 30 months. This portfolio was initially so successful that an ETF was created based on it (the Stock Split Index Fund). Due to a lack of interest, this ETF closed in 2017, and the trend towards fewer and fewer splits surely didnâ\u0080\u0099t help. Earlier this year, in fact, MacNeale wrote: â\u0080\u009cBecause of the lack of split announcements, our ability to ferret out the future winners from the rest of the market has been greatly diminished.â\u0080\u009d Even though this ETF was closed, the NYSE continues to calculate the performance of the stock split index to which it was benchmarked. This index is plotted in the chart below. Notice that, while it has handily beaten the Wilshire 5000 index on a total return basis since 1996, its lead over the Wilshire hasnâ\u0080\u0099t widened much over the past decade. (This is evident from the logarithmic scale in the chart: The distance between the two lines has stayed relatively constant since 2009.) Keep this chart in mind as you gauge the significance of Appleâ\u0080\u0099s split announcement. If you focus on the full 25-year history in the chart, you will be inclined to think the announcement is bullish. But if you focus on the past 10 years, you will consider its significance to be modest at best. None of this means that Appleâ\u0080\u0099s stock wonâ\u0080\u0099t continue its remarkable rally since the U.S. marketâ\u0080\u0099s March lows. The question is whether, because of the split, it will rally more than it would have otherwise. The answer to that question is very much in doubt. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: Apple is splitting its stock after a massive quarter â\u0080\u0094 3 things retail investors should know before they take a bite Plus: Big Tech stocks are on the cusp of creating a setback for indexes"}]}