{"article": [{"url": "https://www.marketwatch.com/story/should-i-have-gotten-my-stimulus-check-by-now-why-some-people-are-still-waiting-and-what-to-do-about-it-2020-08-06", "published": 1597239020.0, "headline": "Should I have gotten my stimulus check by now? Why some people are still waiting - and what to do about it", "body": "In Washington D.C., lawmakers are debating a second batch of stimulus checks in another coronavirus rescue bill. In Blairstown, N.J. Frank Natoli is scratching his head on news of the negotiations. “ 'My first reaction was 'second what?' What about the first?' ” - Frank Natoli, a software engineer still waiting for his first stimulus check \"My first reaction was 'second what?' What about the first?\" the 68-year-old software engineer told MarketWatch. The Internal Revenue Service has distributed approximately 160 million economic impact payments, totaling $270 billion since April, the commissioner said in late June. But Natoli and his wife are still waiting for their share. When Natoli looks up the status on the IRS' 'Get My Payment' portal , he keeps getting the \"Payment Status Not Available\" reply. The response says the IRS doesn't have enough information about Natoli's case, or he's not eligible. Neither reply is right, Natoli says. Frank Natoli Courtesy Frank Natoli He and his wife, who receives Social Security benefits, are under the $150,000 gross income threshold to trigger a $1,200 check for each of them. They've filed their 2018 and 2019 taxes, like many years before that. The electronically-filed returns included bank account information for 2018, but not 2019. Natoli already received a paper check for his 2019 refund. He called the IRS last week, stayed on hold for around 15 minutes, and spoke to a representative who told him to keep checking the site and call back after October 15 if things hadn't changed. The call agent \"volunteered that date and he did not offer any explanation what was magical about that,\" Natoli said. The IRS worker said he wasn't surprised to hear a caller mentioning a stimulus check delay, Natoli added. Natoli says he can understand processing delays, because the IRS has been busy churning out millions of payments all while processing tax returns on a tight staff during a pandemic. He is grateful he's still working at a time of double-digit unemployment and acknowledges the money is not a financial lifeline for him. “ 'I accept the delay. I do not accept the fact I cannot get accurate information as to the status.' ” \"I accept the delay. I do not accept the fact I cannot get accurate information as to the status.\" The Natolis' neighbors are still waiting for their payments too. So are his friends in Montana, one of whom retired after working in federal law enforcement, Natoli added. And so are too many other people across the country who needed that money yesterday to make ends meet, critics say. By early June, IRS still needed to pay out between 30 and 35 million checks, according to the House Ways and Means Committee. That sum included 13 to 18 million people, like the Natolis, who filed taxes and met the income eligibility rules for full payment ($75,000 for singles and $150,000 for married couples filing jointly). \"Almost two months later, Treasury appears to have made little progress towards issuing the remaining payments,\" according to a July 27 letter from Rep. Richard Neal, a Massachusetts Democrat chairing the committee, and Sen. Ron Wyden, the top-ranking Democrat in the Senate Finance Committee. “ 'Americans cannot wait any longer for the emergency assistance they were told would arrive in the spring.' ” - Rep. Richard Neal and Sen. Ron Wyden Between early June and late July, the IRS had made fewer than 1.5 million additional stimulus payments, a pace the pair said was \"unacceptable.\" They urged \"immediate and decisive action\" to make the outstanding payments because \"Americans cannot wait any longer for the emergency assistance they were told would arrive in the spring.\" Fourteen percent of households making under $50,000 have yet to receive their stimulus payment, according to a 2,252-sample survey Prosperity Now, a research and policy organization, conducted between June and July. That's one of the ways the pandemic is squeezing poor families who are skipping bills and skimping on groceries, the organization said. See also:Don't toss that junk mail in the recycling bin just yet - it might contain your stimulus check in the form of a prepaid debit card The IRS did not immediate respond to a request for comment, but in late June, Charles Rettig, the tax collector's commissioner, said the agency was focused on a backlog of mailed-in tax returns and getting refund checks to those filers. Another focus was getting stimulus checks to homeless people, underserved communities and people who don't have to file taxes who might otherwise miss out on their stimulus payment, Rettig said. What people can do if they are still waiting on their stimulus payment Natoli's case sounds like many Economic Impact Payment problems that come through the door at Philadelphia Legal Assistance, said Omeed Firouzi , a staff attorney working in the free legal service provider's low-income tax clinic. “ 'By all accounts, the taxpayer is eligible for payment and for some unexplained reason, they haven't received it yet.' ” - Omeed Firouzi, staff attorney at Philadelphia Legal Assistance The clients meet the income requirements and have filed taxes. Their immigration status isn't a question and there isn't a pending child support bill that would lop off some or all of the money. \"By all accounts, the taxpayer is eligible for payment and for some unexplained reason, they haven't received it yet,\" he said. The stakes are high in these cases. One woman is skipping meals while she waits on her money, Firouzi said, noting that his organization has at least 25 open cases related to stimulus payments. So what should people do if they are still waiting? It might make sense to bring the matter to a lawyer. Some stimulus check questions can get complicated quickly, like seeking a check if you haven't filed a return but want to file one, Firouzi said. This could involve getting tax transcripts and the process might be tricky for people with low incomes, Firouzi said. That's the kind of knotty issue a lawyer can help navigate, he said. Also, attorneys might be able to get case specifics quicker. The hotline for economic impact payments (1-800-919-9835) gives generalized information, but Firouzi said he'd made headway in certain cases with the IRS hotline for tax attorneys, enrolled agents and practitioners who are authorized to represent someone for the IRS. (He only started connecting with IRS experts on that line in May.) Here's a list of low-income taxpayer clinics across the country. Many will provide services for free, or for a small fee, according to the Taxpayer Advocate Service, a watchdog agency within the IRS. The general income cut-off is $50,000. Calling your local Congressional representative can be another avenue. This might be a good option if a person makes too much money to qualify for assistance at a low-income tax clinic, Firouzi noted. It also might be a good choice if there's no nearby tax clinic that can help, he said. Natoli says he'll be calling his local representative, Rep. Josh Gottheimer, if he and his wife are still waiting for their checks by mid-October. Consider reaching out to the Taxpayer Advocate Service. Beginning Monday, Aug. 10, the watchdog agency is going to accept cases from people who are missing their entire payment or a portion of it. The agency will take the case, so long as the person fits one of five scenarios. “ The IRS is going to start making payments for certain types of cases in the coming weeks, says National Taxpayer Advocate Erin Collins ” After setting up procedures for these types the cases, the IRS is going to start issuing the payments in the coming weeks, National Taxpayer Advocate Erin Collins said in a blog post. The scenarios are: â\u0080¢ Someone who didn't file taxes and registered for payment using the Non-Filer web portal. But when filing, they claimed a dependent child and didn't get the $500 payment. The IRS is sending extra payments to cover the dependent children in coming weeks. â\u0080¢ Someone who filed an \"injured spouse allocation,\" (Form 8379) on the jointly-filed returns, but didn't get a stimulus payment. In an income tax return, these forms act as a heads up to the IRS to get back their portion of a joint refund if the other spouse has past-due obligations, like child support. â\u0080¢ Someone who missed out on all or some of a payment because of an IRS math error, like mistakes calculating adjusted gross income. â\u0080¢ Someone who hasn't been paid because they are an identity theft victim. â\u0080¢ Someone whose payments were canceled, returned or never issued because they filed jointly with an spouse is now dead, or now incarcerated. Supplemental payments will usually come in the same format as the first payment. Someone getting a debit card will get a paper check for re-issued payment, Collins said. Here's how to contact the Taxpayer Advocate Service. For low-income Americans, \"time is real money\" - money that can't be used for groceries, rent, utilities or other necessities, said Aaron Klein, an economic studies fellow at the Brookings Institution. America's payment system for actually relaying money and having it post into accounts is outdated, said Klein, a former Deputy Assistant Secretary who served in the Treasury Department during the Obama administration. This results in overdrafts and high-priced check cashier charges for people who can least afford it, he said. Either the Federal Reserve or Congress needs to say banks will make the funds immediately available upon deposit, Klein said. For people on the edge, America's payment system is \"slow and increasingly costly.\" Instead, it's currently \"designed to service people who already have money in their bank account.\""}]}