{"article": [{"url": "https://www.marketwatch.com/story/hiring-and-promoting-women-police-officers-could-bring-real-justice-reform-and-make-communities-safer-2020-06-10", "published": 1591809740.0, "headline": "Hiring and promoting women police officers could bring real justice reform and make communities safer", "body": "As my brain tried processing the incompressible death of George Floyd, I filtered it through the lens of my 25 years of urban policing, and the recurring theme I continued circling to, was that of police culture. I wasn't the only cop grappling with what I saw. My social media pages were filled with memes from cops declaring “There’s nothing more that a good cop hates, than a bad cop.” Cops overwhelmingly view Floyd's death as indefensible, but what do good cops actually do about bad cops? Many U.S. cities have policies that require police officers to intervene when someone is using excessive force; other policies mandate that officers report misconduct. How often do cops take action based on those policies? Reform vs. reality There are 18,000 police agencies in the United States but there is no national standard governing them. I have first-hand experience with the conflict between policy and culture in a large police agency. The Newark, N.J. police department has been operating under a federal consent decree since 2016, after the Department of Justice found it had engaged in a pattern of unconstitutional policing. Among the many policies implemented was the requirement to report misconduct. As a police captain in Newark, handling discipline was among my responsibilities. There were occasions where police misconduct was brought to my attention and charges brought against the officer. Yet all too often, the outcome of investigations depended on who the officer was, and their relationship with members of senior administration. In one such matter, the charges I filed were dropped without a hearing, despite audio evidence and even witnesses. The blowback I experienced for charging one of these “good ol’ boys” was pervasive, public and ruinous — but that was the point. The public attacks and humiliation served as a warning to the group that they, too, would be crushed if they strayed from the group norms that define the culture of the organization. A total of 101 sergeants, lieutenants and captains were promoted in the year I charged “one of their own,” but no promotions were made from the deputy chiefs’ list, where I ranked No. 1. The message was clear: there were consequences to my actions, not the least of which were negative professional consequences. While lessons on group norms were being given at my expense, leadership had the cameras removed from the meetings I later learned. Keep in mind, this was occurring in the midst of a federal consent decree. Policy has a steep cultural mountain to climb. All police managers in those meetings received the message loud and clear: the group norms supersede any policy, consent decree be damned. Benefits of a female style of policing These types of messages are transmitted in organizations, sometimes discreetly or in my case, with a sledgehammer, creating the cultural norms for the group. Surveys find that officers cite the organization as the most stressful aspect of their work and often rate organizational legitimacy and procedural justice low. In work environments like mine, culture eats policy for breakfast. Sadly, my story isn’t unique. I am currently earning a PhD, studying policewomen, organizational legitimacy and procedural justice, which led to a fellowship and a TED Talk. I’ve been interviewing officers since 2016. What I’ve found from my talks with female police executives from across the country, was that many could recount harrowing stories I could relate to. In their ascension of the career ladder, they all had some story of navigating toxicity, surviving but not always thriving. Read: John Oliver explains ‘defund the police’ — and why it doesn’t mean ‘no police’ More: Defund the police for safer, healthier and sustainable black communities Why should we want more women in policing? There is a body of research showing there are benefits associated with a female style of policing. Research also finds that the minority groups and women who are organizationally under-represented cannot effectuate cultural change until they reach a critical mass of at least 30%. Fewer than 4% of police commanders in the U.S. are female. In my situation, I was always the only female commander in the room. Sure, there are policies that clearly prohibit what happened to me, but we know policies alone don’t change culture. Research finds “a chasm between what officers say and what they do”. I helped organize a summit on women in policing in December 2018 that culminated in a report published by the National Institute of Justice, Women in Policing: Breaking Barriers and Blazing a Path.The summit included global police leader. From our counterparts in New Zealand, Australia, Canada and the U.K., we learned that many of the barriers women experience in the U.S. have been ameliorated in other countries, resulting in more than twice the number of policewomen than we currently have in the U.S. For example, this New Zealand recruiting video portrays a different type of policing than the American context, and this was intentional. New Zealand has a police service, not a police force. New Zealand is making steady progress towards a goal of gender parity in recruiting by 2021. The U.S. must strive for the same gender parity to reap the same results. “ Women police officers are less likely to react negatively to factors like race and are less likely to be named in a lawsuit or citizen complaint. ” Research shows women police officers are less likely to react negatively to factors like race and are less likely to be named in a lawsuit or citizen complaint. Furthermore, not only are women officers less likely to use force and excessive force, preliminary research indicates that the presence of women officers in a group reduces the chances that anyone in the group — men and women — will receive complaints of excessive force. Recently, the research on women in policing was embodied in Fort Lauderdale, Fla. where a female officer physically intervened when a male officer knocked a kneeling female protester to the ground. I was both proud, and fearful, for her. Will there be blowback? Maureen McGough, chief of staff for the Policing Project at NYU Law was recently featured in a Reducing Crime podcast discussing the underrepresentation of women in policing. McGough explained how this disparity deprives communities of the vast benefits identified through scientific research. Policewomen are critical in overcoming policing’s greatest challenges. They are better able to interact with diverse cultural groups, perceived as more honest and compassionate, and are associated with better outcomes for crime victims. McGough and I have begun laying the groundwork for a project we’re calling the 30X30 initiative. Our goal is to reach 30% representation of policewomen in the U.S. by 2030. We’re not just taking on recruitment practices; we’re seeking to support a monumental shift in culture to create and support departments where women don’t just survive, they thrive. We will be bringing together law enforcement, professional associations, researchers, policymakers and community stakeholders to build a better, more equitable police profession. Preliminary research clearly indicates that the meaningful integration of women officers in law enforcement agencies will advance the profession and improve relationships between law enforcement and communities they serve. We will be measuring not only changes in representation of women, but also use of force incidents, community relationships, internal and external perceptions of procedural justice, and outcomes for victims of sexual assault and domestic violence. We predict that increasing the representation of women officers will generate statistically significant improvements in each metric. Policing has a moral imperative to change. In most cities, a lot of what happens in public safety is controlled by city leadership. The mayor or business administrator appoints the chief, and the council sets the budget. Prioritizing increasing gender diversity in policing begins with the mayor or business administrator and is reinforced by what the council decides to fund within the police department. Your public servants need to hear your voice about prioritizing the hiring and promoting of women in your police force. They probably don’t know the research about women police or realize just how bad underrepresentation is and how that impacts the quality of service delivered to communities. Yet policies alone will not change a police culture that excludes or dissuades women from applying. Most police chiefs have substantial autonomy around recruitment, assessment, and promotion requirements. They set the tone and culture of the agency. If a chief does not address the culture, the number of women in policing will continue to stagnate. Keep in mind that female chiefs will get more pushback from a predominantly male workforce, as research on female leadership indicates. Appointed women have to be ready to tackle the protective culture in police departments that allows corruption to fester. Ivonne Roman is the founder of the Women’s Leadership Academy, which seeks to increase the representation of women in law enforcement. Roman has 25 years of experience in policing, having served in every rank, from police officer to police chief, in the Newark, N.J. police department. More:The only way to truly solve the race problem in America is to narrow the wealth gap, black economists say Plus: George Floyd, white supremacy — and the ‘otherization’ of African-American men"}]}