{"article": [{"url": "https://www.marketwatch.com/story/how-bidens-war-chest-is-catching-up-to-trumps-in-one-chart-2020-07-21", "published": 1595409320.0, "headline": "How Biden's war chest is catching up to Trump's - in one chart", "body": "As the 2020 White House race sparks massive fundraising and spending, the latest disclosures show that Democratic challenger Joe Biden no longer has a much smaller war chest than President Donald Trump. The Republican incumbent's campaign and its affiliates have brought in more money from donors than Biden's side has in the 2020 cycle so far, but they've also spent more, so the Democratic and GOP sides now are close in their cash on hand. The MarketWatch chart below shows how much has been raised and shelled out by Biden and Trump's principal campaign committees, as well as by the two politicians' joint fundraising committees with their respective parties. The joint committees - the Biden Victory Fund, Biden Action Fund, Trump Victory Committee and Trump Make America Great Again Committee (also known as T-Magic) - can accept six-figure donations, while the most that you can give to a candidate's main campaign committee is $2,800, though it can total $5,600 if you contribute for both the primary and general elections. Related:These are the basics of campaign finance in 2020 - in two handy charts Trump's main campaign committee \"has spent about $1.50 for every $1 Biden's campaign has,\" said Michael Beckel, research director at watchdog group Issue One, in a tweet. But he also noted that pro-Biden outside groups, such as super PACs like Priorities USA Action and the Lincoln Project, have combined to pay out about $2.50 for every $1 pro-Trump groups have spent. The additional chart below shows the reported cash on hand as July started for Biden's campaign ($238 million) vs. the cash remaining for the president's effort ($295 million). The totals are based on figures as of June 30 from the two politician's principal campaign committees, their joint fundraising committees, and they also include the Democratic National Committee's cash on hand and the Republican National Committee's cash remaining. The party committees are spending in support of not only their presidential candidates, but their Congressional candidates as well. If the DNC and RNC's resources aren't included, the Biden team's reported cash on hand is $201 million vs. $195 million for Trump's effort. A campaign's financial reports are a closely watched measure of viability, along with polling data. Trump also often touts the performance of the stock market SPX, +0.87%  DJIA, +0.56%, which hit all-time highs in February but since then has traded below its peaks amid worries over the coronavirus pandemic's economic effects. In a RealClearPolitics moving average of national polls as of Tuesday, Biden drew support of 49.3% of voters, ahead of Trump's 40.7%. During the contest to become the Democratic Party's presidential nominee, Biden lagged behind rivals such as Bernie Sanders in his fundraising. But after that contest ended in early April, the former vice president managed to outpace Trump's fundraising for the second quarter, even as the president still has raised more overall in the 2020 cycle. This report was first published on July 21, 2020. MarketWatch's Katie Marriner contributed to this report."}]}