{"article": [{"url": "https://www.marketwatch.com/story/in-latest-dark-twist-of-the-pandemic-companies-appear-to-be-cutting-wages-2020-07-01", "published": 1593607880.0, "headline": "In latest dark twist of pandemic, companies appear to be cutting wages", "body": "In the latest unpleasant twist of the coronavirus pandemic, many businesses have begun cutting worker take-home pay, said Mark Zandi, chief economist of Moody’s Analytics on Wednesday. In the past, businesses shied away from cutting “nominal” pay, which is the amount of money earned per hour. Firms didn’t even cut wages during the 2008 financial crisis. Real wages, or pay adjusted for inflation, was different. Firms often didn’t react if a rise in consumer prices ate away at worker pay. Cutting nominal worker pay is unpopular for a simple reason. It has often backfired for firms. Morale tends to plummet and workers stop being productive, thus pay cuts have been seen as counterproductive for companies, Zandi said, during a telephone call with reporters to discuss the ADP employment data for June. But the pandemic has had a way of changing long-standing economic practices as firms struggle to stay afloat. “The fact that we’re seeing more nominal wage cutting now may simply reflect the fact that we’ve got a number of firms that are in survival mode,” Zandi said. The drop in worker pay was something he “felt” while looking at the ADP data, Zandi said. It is not yet apparent in the U.S. government data. The private sector rehired 2.37 million workers in June, Wednesday’s ADP report said. One measure, average hourly earnings data, will be published by the Labor Departmnet on Thursday as part of the June unemployment report. Average hourly earnings has not been a reliable indicator during the pandemic, as it was hit by cross currents such as the loss of many entry-level jobs. This made it look like overall wages went up for people who remained in the workforce. A drop in nominal wages, if realized, would be a worry for the Federal Reserve because it would raise the prospect of “deflation,” or falling prices, as consumers would have less to spend, lowering demand and encouraging retailers to discount prices. This can be just as damaging as high inflation. Deflation also makes debt burdens harder to bear for households who may have to pay back loans with lower earnings. In this scenario, the Fed may have has limited power to spark economic growth because its benchmark interest rate is now already at zero. “The Fed has tools to play defense, they don’t have tools to play offense,” Zandi said. He said the Fed can make sure the economy doesn’t overwhelm the financial system, but will have a harder time stimulating growth so firms would raise wages. That puts the onus on Congress and the executive branch, Zandi said. In a recent speech, Chicago Fed President Charles Evans said he was worried about the inflation outlook. The central bank had a hard time hitting its 2% target even before the pandemic hit the economy in mid-March. Read:Fed’s Evans says low inflation may require more monetary easing Stocks were marginally higher in mid-day trading with the S&P 500 index SPX, +0.87% up 0.6%."}]}