{"article": [{"url": "https://www.marketwatch.com/story/as-ipos-roar-back-to-life-wall-street-readies-for-new-breed-of-tech-giants-2020-08-27", "published": 1598532020.0, "headline": "A new breed of tech IPOs may give the stock market reason to party like itâ\u0080\u0099s 1999", "body": "A stampede of companies have filed to go public in recent days, as they look to take advantage of a rapid recovery in U.S. capital markets, in a flurry of activity reminiscent of the heady days of the dot-com boom of 1999. A global total of 241 initial public offerings has been recorded so far during the second half of 2020, marking the fastest start to the second half of the year since 2007, according to financial data provider Refintiv. Proceeds raised during the eight weeks since the start of July total $36.7 billion, up 140% compared with last year and a 10-year high for this period, Refinitiv data shows. Read:IPO market braces for another 7 deals this week and yet another blank-check company So far this year, IPOs have raised $96.7 billion globally, up 11% from the same period in 2019. The health-care sector dominated the number of listings in the period, raising a total of $15.4 billion, closely followed by technology with $14.7 billion and financials with $13.6 billion. That number is set to surge as companies race to make their market debuts to raise capital, months after the coronavirus pandemic played a significant role in declining IPO activity. Global IPO activity slowed dramatically in April and May, with a 48% decrease by volume (97 deals) and a 67% decrease in proceeds ($13.2 billion) compared with the same two months in 2019, according to data from EY. Read:Global IPO market springs back to life after two months in a deep freeze Earlier in August, short-term home rental company Airbnb filed with regulators for an IPO, but said it had not yet set the size and price range for the offering. That was followed this week by several Silicon Valley companies announcing plans to list on the U.S. stock market, including cloud data-warehouse company Snowflake Computing and videogame technology company Unity Software. On Monday, Asana, a software provider started by Facebook FB, +0.26%, joined the list when it made public its IPO filing, opting for a direct listing. One day later, Palantir Technologies, the data-mining company backed by tech billionaire Peter Thiel, also filed to go public through a direct listing. Read: NYSEâ\u0080\u0099s Plan for New IPO Alternative Wins Green Light From SEC Unlike a conventional IPO, where banks offer new shares to investors at a set price before trading begins, direct listings involve selling shares straight to the public, without paying underwriters to line up investors at a set price. This allows them to circumvent investor roadshows, avoid paying often hefty bank fees and steer clear of the lockup periods that prevent insiders from selling stock for a set duration, all of which accompany traditional public offerings. Last year, Slack Technologies WORK, +3.36%, the owner of a popular workplace instant messaging app, also chose a direct listing, and saw its shares surge nearly 50% in their public trading debut, valuing the company at more than $23 billion. Music-streaming company Spotify Technology SPOT, +0.08% Â also opted for a direct listing in 2018. On Wednesday, the New York Stock Exchange gained regulatory approval for its proposal to allow to create a new type of direct listing, in which companies can issue new shares. Previously, companies had only been allowed to use the process for existing investors to sell shares. Nasdaq NDAQ, +0.36% Â was the most active exchange during the period, with debut listings raising $26.8 billion, according to Refinitiv. Shanghaiâ\u0080\u0099s technology focused STAR Market ranks as the second most popular IPO venue so far during 2020, with $13.9 billion. On Tuesday, Chinaâ\u0080\u0099s mobile payments firm Ant Group, the fintech arm of Alibaba and Chinaâ\u0080\u0099s dominant mobile payments firm, filed for a dual-listing on Hong Kong and on Shanghaiâ\u0080\u0099s Nasdaq-style STAR Market. Read:Ant Group files IPO prospectus, says it earned $3.2 billion in first half Ant is expected to fetch a market valuation of above $200 billion, which would make it the largest IPO of all time and propel Hong Kong and the year-old STAR Market up the ranking of the worldâ\u0080\u0099s top listing venues. Opinion:Trumpâ\u0080\u0099s push to delist Chinese companies from U.S. exchanges might be welcomed by China The move comes as the Trump administration has issued recommendations to crack down on listings of Chinese companies on U.S. exchanges that donâ\u0080\u0099t comply with American accounting standards. The European IPO market is also starting to show signs of life. On Thursday, retail and technology group The Hut Group unveiled plans for an IPO with plans to raise gross proceeds of Â£920 million pounds ($1.21 billion), giving the company an equity valuation of Â£4.5 billion ($5.6 billion). It would be the first major listing in London since the start of the pandemic. The Lookfantastic owner, which sells both its own brands and over 1,000 third-party brands, said it would use the proceeds from the float to expand its business as it taps into the accelerating trend for online shopping."}]}