{"article": [{"url": "https://www.marketwatch.com/story/quarantine-me-ill-quarantine-you-2020-06-19", "published": 1592565800.0, "headline": "Quarantine ME? Iâ\u0080\u0099ll quarantine YOU!", "body": "In the long-running insult war between the Rotten Apple and Godâ\u0080\u0099s Waiting Room, you can score a big one for the mushy fruit. New York Gov. Andrew Cuomo is threatening to impose a 14-day quarantine on anyone who travels to New York from Florida, where coronavirus cases are taking off like a NASA rocket (Apollo-era), while New Yorkâ\u0080\u0099s infection numbers fall faster than a penny off the Empire State Building observation deck (currently closed). â\u0080\u009cI have experts who have advised me to do that,â\u0080\u009d Cuomo warned Florida Gov. Ron DeSantis and his 20 million increasingly at-risk constituents. â\u0080\u009cIâ\u0080\u0099m considering it now.â\u0080\u009d It could be that Cuomo is only poking the alligator cage. The New York DNA, even in the age of COVID-19, is all about welcoming immigrants, foreign and domestic, not restricting them. New York has never been into building walls or blocking cars with out-of-state plates at the Holland Tunnel. Thereâ\u0080\u0099s no asterisk on the Statue of Libertyâ\u0080\u0099s Emma Lazarus poem: â\u0080\u009cGive me your tired, your poor, Your huddled massesâ\u0080¦*â\u0080\u009d (*unless their swab tests come back positive.) As the old song almost goes: If you can make it here â\u0080\u0094 well, youâ\u0080\u0099re perfectly welcome to hang around. But still. Cuomo was clearly delighted on Thursday by what he described as the â\u0080\u009cfull 180â\u0080\u009d between New Yorkâ\u0080\u0099s and Floridaâ\u0080\u0099s coronavirus counts. Back in March, he noted, â\u0080\u009cFlorida and other states imposed a quarantine on New Yorkers. If you went to Florida, you had to quarantine for two weeks because they were afraid New Yorkers were bringing the virus to their state. Fast forward 100 days. Now we are afraid they are bringing the virus to our stateâ\u0080¦.Who would have believed this 180-degree turnaround?â\u0080\u009d No, no oneâ\u0080\u0099s calling Florida the sixth borough of New York City anymore! Thereâ\u0080\u0099s always been a friendly rivalry between the Empire and Sunshine states. A not-so-friendly rivalry, too. Florida gleefully lures tax-and-snow weary New Yorkers with promises of warmer winters, endless shuffle board and no state income tax, while New Yorkers shake their heads at Floridaâ\u0080\u0099s slowpoke drivers, soggy bagels and sandals on the beach with black socks. Those long-simmering stereotypes flared into mutual outrage just after Cuomo told New Yorkers to stay at home to help bend the COVID curve. Instead of doing something similar in his own state, DeSantis pointed the finger of blame at arriving New Yorkers, ordering them to self-isolate. At that point, New York had 12,305 cases and Florida had 1,100, numbers that both sound puny now. Also see: Arnold Schwarzenegger backs California face-mask order: â\u0080\u0098Anyone making it a political issue is an absolute moronâ\u0080\u0099 DeSantis said Cuomo had left him no choice. â\u0080\u009cAs soon as that shelter-in-place order came down from the New York governor, man, the flights took off. People just got out of Dodge.â\u0080\u009d And DeSantis meant business. â\u0080\u009cIt is actually a criminal offense if you violate the quarantine order,â\u0080\u009d the Florida governor told reporters at The Villages, Floridaâ\u0080\u0099s and the worldâ\u0080\u0099s largest retirement community. He warned that violators would be â\u0080\u009cheld accountable if they buck the law.â\u0080\u009d So is it time for some New York revenge? â\u0080\u009cIt could happen, and itâ\u0080\u0099s something Iâ\u0080\u0099m considering,â\u0080\u009d Cuomo said. The reversal is startling. Florida reported 3,207 new cases on Thursday, the stateâ\u0080\u0099s largest one-day spike ever. That same day, New York reported 614, out of 68,541 people tested, a positive rate of less than 1%. It was the stateâ\u0080\u0099s lowest daily total since March 20. Floridaâ\u0080\u0099s total now tops 86,000 coronavirus infections, eight times what New York had when DeSantis slammed the door. Florida has â\u0080\u009call the markings of the next large epicenter of coronavirus transmission,â\u0080\u009d scientists at the Childrenâ\u0080\u0099s Hospital of Philadelphia and the University of Pennsylvania warned this week. Among Floridaâ\u0080\u0099s risk factors, the scientists noted an aging population and the stateâ\u0080\u0099s many retirement communities and nursing homes. Florida hospitals are already getting crowded. More than three quarters of the stateâ\u0080\u0099s intensive care beds are filled, as are almost 75% of the regular hospital beds. Thatâ\u0080\u0099s according to the Florida Agency for Health Care Administration. Be sure to read: What we do know â\u0080\u0094 and donâ\u0080\u0099t know â\u0080\u0094 about the coronavirus at day 100 of the pandemic Cuomo quickly pooh-poohed a claim made by DeSantis and some other governors that their recent virus spikes are merely a product of increased testing. Itâ\u0080\u0099s more than positive tests, Cuomo said. Itâ\u0080\u0099s sick patients. â\u0080\u009cMore people are walking into hospitals,â\u0080\u009d the New York governor said with no shortage of New York attitude. â\u0080\u009cThey are not walking into hospitals because they are feeling well.You walk into a hospital when you are sick, and the number of people who are getting infections and getting sick and walking into a hospital is going up in these states.â\u0080\u009d Wonder how many of them feel like taking a drive. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}