{"article": [{"url": "https://www.marketwatch.com/story/over-a-dozen-senior-pentagon-leaders-are-quarantining-after-being-exposed-to-coronavirus-01602007228", "published": 1601993300.0, "headline": "Over a dozen senior Pentagon leaders are quarantining after being exposed to coronavirus", "body": "Chairman of the Joint Chiefs of Staff Gen. Mark Milley has tested negative for the virus but remains under quarantine as a precaution. AP Photo/Andrew Harnik WASHINGTON (AP) — Top military leaders are under self-quarantine after a senior Coast Guard official tested positive for the coronavirus, the Pentagon said Tuesday. The chairman of the Joint Chiefs of Staff, Gen. Mark Milley, was among those affected, U.S. officials said. Military leaders who were in contact with Adm. Charles W. Ray, the vice commandant of the Coast Guard, have been tested, Pentagon spokesman Jonathan Hoffman said in a statement. None have exhibited symptoms or have so far tested positive. Hoffman said the quarantining of leaders won’t affect “the operational readiness or mission capability of the U.S. Armed Forces.” “Senior military leaders are able to remain fully mission capable and perform their duties from an alternative work location,” he said. Hoffman’s statement did not identify those affected, but multiple U.S. officials said that besides Milley, they included the chiefs of the Army, Navy and Air Force, as well as the head of U.S. Cyber Command, Gen. Paul Nakasone. The officials spoke on condition of anonymity to discuss information not yet made public. It is not known how Ray contracted the virus, but it was not believed to be related to the outbreak affecting President Donald Trump and others at the White House, the officials said. The Coast Guard said in a statement that Ray felt mild symptoms over the weekend and was tested on Monday. Up to 14 officials are believed to have been potentially exposed to the virus after meetings last week with Ray. The officials were informed about the positive test on Monday."}]}