{"article": [{"url": "https://www.marketwatch.com/story/gm-swings-to-loss-but-tops-estimates-in-q2-2020-07-29", "published": 1596011600.0, "headline": "GM swings to loss but tops estimates in Q2", "body": "General Motors Co. posted a $758 million second-quarter net loss mostly due to factory shutdowns in its home U.S. market, although resilient sales of pricey pickup trucks propelled results beyond analysts' forecasts. The company said its U.S. plants are cranking into overdrive to replenish thinly stocked dealership lots, a sign that its bottom line could rebound in coming quarters as the company tries to make up for weeks of lost production this spring from the pandemic. GM said nearly all its U.S. factories are running at prepandemic levels. GM lost an adjusted 50 cents per share for the April-to-June period, better than the average analyst estimate of $1.77, according to FactSet. The pretax profit adjusted for one-time items was $536 million, compared with a $3 billion profit in the same period a year earlier. GM's factory output in North America -- historically the source of nearly all of its profit -- was frozen for roughly half the quarter after the company idled plants to comply with state-mandated quarantines this spring. Still, the company posted a loss of $101 million in the region, while analysts had expected a loss of about $1.7 billion, according to FactSet. Revenue fell 53%, to $16.78 billion, a result of the factory shutdowns. GM said it ended the quarter with cash and liquidity of $30.6 billion. Investors remain focused on car companies' ability to weather potential future waves of Covid-19 outbreaks, according to a Bank of America research note last week. GM and other major auto makers burned through billions of dollars in cash this spring after their plants shut down. GM and other global auto makers scrambled to hoard cash this spring as the pandemic spread and operations were suspended for several weeks, choking off cash flow. GM padded its cash position by more than $20 billion by drawing down a revolving credit line, suspending its dividend and issuing unsecured debt. Car makers reopened most of their U.S. factories in May and in many cases have ramped up output to near prepandemic levels. Sales at dealerships also have snapped back more quickly than analysts predicted when the crisis hit, sparking hope that the industry's recovery can continue in the second half of the year. For GM, stronger-than-expected demand for big pickup trucks have helped avoid sharp losses. GM executives say they have prioritized output of the company's big pickup trucks, the Chevrolet Silverado and GMC Sierra, which saw selling prices rise on average by about $1,500 per vehicle in the second quarter from the first, the company said. The trucks typically sell for about $45,000 each and deliver about half of GM's global profit, analysts estimate. Many dealers have said they are running low on pickup-truck models following better-than-expected sales this spring, when GM offered deep discounts and zero-interest promotions to prevent sales from cratering during Covid-19 lockdowns. --(MORE TO COME) Write to Mike Colias at Mike.Colias@wsj.com"}]}