{"article": [{"url": "https://www.marketwatch.com/story/teslas-stock-skids-5-as-promised-battery-day-innovations-remain-off-in-the-future-2020-09-22", "published": 1600846280.0, "headline": "Teslaâ\u0080\u0099s stock skids 6% as promised â\u0080\u0098Battery Dayâ\u0080\u0099 innovations remain off in the future", "body": "Tesla Inc. unveiled battery innovations and increased efficiencies that appeared to underwhelm investors late Tuesday at its much anticipated â\u0080\u009cBattery Day.â\u0080\u009d Tesla stockâ\u0080\u0099s TSLA, +1.89%, which had gained more than 4% after an upbeat post-shareholder-meeting presentation, turned south as soon as Chief Executive Elon Musk said that some of the innovations showcased at the event were â\u0080\u009cclose to workingâ\u0080\u009d and some three years away from fruition. Shares fell as much as 7.6% in Tuesdayâ\u0080\u0099s after-hours session, but have pared some gains to trade down 6.0% in Wednesdayâ\u0080\u0099s premarket session. â\u0080\u009cIt does work but not [yet] with a high yield,â\u0080\u009d Musk said, adding that Tesla has set up a pilot battery plant in Fremont, Calif., to work through the challenges, with production â\u0080\u009cramping up.â\u0080\u009d Thereâ\u0080\u0099s a â\u0080\u009cclear path to success but a ton of work from here to there,â\u0080\u009d Musk said. Long-term investors make their plans for a year away, and a three-year horizon is â\u0080\u009cjust a long time,â\u0080\u009d said Gene Munster with Loup Ventures. â\u0080\u009cEverything they talked about had substance,â\u0080\u009d Munster said. â\u0080\u009cBut investors wanted immediately.â\u0080\u009d The dayâ\u0080\u0099s â\u0080\u009creal takeawayâ\u0080\u009d was that Tesla is aiming for full vertical integration, which would position it one step ahead of the rest of the industry, Munster said. Keeping it all in house, from mining interests to battery design and manufacturing, is â\u0080\u009ca flywheel that is difficult to catch,â\u0080\u009d he said. It would lead to cost reductions, lower prices and ultimately more demand for Tesla cars, Munster said. Musk on Monday had already sought to tamp down Wall Streetâ\u0080\u0099s high expectations for the event, tweeting that some of the technologies to be revealed â\u0080\u009cwill not reach serious high-volume production until 2022.â\u0080\u009d The stock closed more than 5% lower in Tuesdayâ\u0080\u0099s regular trading session. Tesla set out to completely rethink how cells are produced and designed, Musk, chief executive of not just Tesla but SpaceX, and Teslaâ\u0080\u0099s senior vice president of energy engineering, Drew Baglino, said as they took the stage moments after the conclusion of the shareholder meeting. It was part presentation, part chemistry lesson, as the two took turns extolling Teslaâ\u0080\u0099s progress toward producing cheaper and more efficient batteries. The innovations included changes in battery size and in silicon engineering, plans for easier access to lithium, battery recycling, and better integration between battery cell and vehicle. The combined changes would result improvements in range and battery prices. Tesla shares had gained in the after-hours session during the shareholder-meeting portion of the dayâ\u0080\u0099s proceedings, mostly thanks to Muskâ\u0080\u0099s saying that it was looking â\u0080\u009cpromisingâ\u0080\u009d that the Silicon Valley car maker would post an annual profit and stay within its previous vehicle-delivery goals for 2020, while vowing to release a more advanced version of Autopilot, the companyâ\u0080\u0099s suite of advanced driver-assistance systems, â\u0080\u009cin a month or so.â\u0080\u009d Musk, no stranger to lofty goals, also announced plans for a $25,000 fully autonomous electric vehicle within three years. Musk called the year â\u0080\u009cinsanely hardâ\u0080\u009d â\u0080\u0094 the hardest ever for Tesla, he said. The shareholder meeting and â\u0080\u009cBattery Dayâ\u0080\u009d were held outdoors in Fremont due to pandemic-related restrictions on gatherings. The few shareholders on site were in their Tesla cars, drive-in style, occasionally honking their horns to signal enthusiasm. The shareholder meeting had been postponed from July. Shares of Tesla have gained 407% so far this year, contrasting with gains of just 2.6% for the S&P 500 index SPX, +0.87%."}]}