{"article": [{"url": "https://www.marketwatch.com/story/4-reasons-why-being-a-responsible-esg-investor-can-help-your-401k-do-better-2020-07-13", "published": 1595063000.0, "headline": "4 reasons why being a responsible ESG investor can help your 401(k) do better", "body": "Environmental, Sustainable and Governance (ESG) focused investments are performing as well, if not better, than traditional investments. In 2019, $21.4 billion went into sustainable funds, according to investment researcher Morningstar and this trend is strengthening, with deposits of $10.5 billion in the first quarter of 2020 alone. One out of every four investment dollars is in a socially responsible investment, according to a study from the US SIF Foundation. If your 401(k) and other investments aren’t part of this developing, future-focused part of the market, you are missing out. Rather than listen to the naysayers and old-school financial professionals, learn more. Then, take action today to align your investments with your values. Here are four arguments against ESG investing — and why they don’t hold water: 1. ‘It’s been tried before’: Socially responsible portfolios used to be one-issue campaigns: South Africa and apartheid; tobacco; weapons, “sin stocks,” for example. Many religious and cultural institutions invest only with responsible-investing companies that meet their strict requirements to cover only aligned investments. This approach is targeted, rather than comprehensive, and returns suffered as a result. Nowadays, socially responsible investments (SRI) embrace a larger investment landscape, going beyond the exclusion of companies to including companies that make an impact. 2. ‘They don’t make money’: ESG funds have performed well in downturns, and that was true in the first quarter of 2020. Among ESG-focused U.S.-equity index funds, 10 out of 12 surpassed iShares Core S&P 500 ETF IVV, +0.87% by an average of 1.37 percentage points, net of fees. All 11 ex-U.S. equity index ESG funds outperformed their respective indexes by an average of 1.89 percentage points. “ Only 3%-4% of employer-sponsored retirement plans feature an ESG option. If you want it, ask for it. ” 3. ‘My 401(k) does not have that option’: Only 3%-4% of employer-sponsored retirement plans feature an ESG option. If you want it, ask for it. This is your plan and your investment dollars. Your employer may not have considered this option unless you bring it up. Petition the trustees of the plan about this shortfall. The trustees may think they know the traditional norms of Wall Street and therefore believe it’s safer to stick with the tried and true. Include data to show you’re informed; that will help your advocacy of ESG as a practical and solid investment option. Working in your favor is the 401(k) trustees’ goal is of having more employees and more dollars enrolled in the company plan. According to a Natixis study, more participants invest when there is an ESG option. For example, millennials are more likely to invest in ESG funds, so offering them the opportunity could increase 401(k) enrollment. 4. ‘The fees are too expensive’: Be wary when an investment professional says that ESG funds are too expensive. Looking only at fees is a narrow view. The total outcome is what you want to know. What is the fund’s net return versus similar investments? As with an investment, evaluate the risk, the return and the impact. CD Moriarty is a Vermont-based financial speaker, writer and coach. She can be reached through her website. Read: As boomers hand over the keys to the stock market, sustainability-minded younger investors let their consciences lead More: The only way to truly solve the race problem in America is to narrow the wealth gap, Black economists say"}]}