{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-see-tepid-rise-after-stock-market-rout-but-tech-stocks-remain-under-heavy-selling-pressure-ahead-of-jobs-report-2020-09-04", "published": 1599294980.0, "headline": "Stocks fall but end off session lows as investors continue to rotate out of tech and momentum sectors", "body": "Stocks finished with losses but off session lows in choppy trade on Wall Street on Friday, with some previously unloved sectors finding support as technology and other highflying segments felt the pressure of continued profit-taking. U.S. markets on Monday will be closed in observance of Labor Day, a factor that might have added to market volatility by sapping volume in the run-up to the long holiday weekend.How did stock-market benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% closed 159.42 points lower, down 0.6%, at 28133.31, after falling 628 points at its session low. The blue-chip gauge bounced in the final hour of trading, briefly pushing back into positive territory before falling back. The S&P 500 index SPX, +0.87% dropped 28.10 points, or 0.8%, to finish at 3,426.96, while the Nasdaq Composite Index COMP, +1.39% declined 144.97 points, or 1.3%, to end at 11,313.13. The tech-heavy Nasdaq saw a 3.3% weekly decline, its largest since March, while the Dow fell 1.8% and the S&P 500 lost 2.3%. On Thursday, the Dow ended with a loss of 807.77 points, or 2.8%, at 28,292.73, after dropping more than 1,000 points at its session low. The S&P 500 closed 125.78 points lower, down 3.5%, at 3,455.06. The Nasdaq Composite tumbled 598.34 points, or 5%, to end at 11,458.10. The declines marked the biggest one-day drops for all three indexes since June. In One Chart:Tech stocks and the rest of the market are both very expensive -- but for very different reasonsWhat drove the market? “We view the latest selloff as a bout of profit-taking after a strong run,” said Mark Haefele, chief investment officer at UBS Global Wealth Management, in a note. The S&P 500 rose 7% last month for its strongest August in 34 years, then added another 2.3% in the first two days of September to hit another record high before Thursday’s selloff, he noted. “Stocks are still well-supported by a combination of Fed liquidity, attractive equity risk premiums, and an ongoing recovery as economies reopen from the lockdowns.” The S&P 500 index tech sector fell 1.3% Friday, while the similarly popular communications services sector gave back another 1.9% and consumer discretionary stocks fell 1.4%. Meanwhile, beaten down sectors found buying interest, with financials up 0.8%, industrials up 0.2% and materials up 0.1%. Market bulls expect that pattern to continue in the near term, a potential positive for the broader market. “Look for the bull market to continue [on] some sector rotation as people take profits in technology names and put more money to work in more cyclical parts of the market such as in the energy, materials and financials sectors,” said Chris Zaccarelli, chief investment officer for Independent Advisor Alliance, in emailed comments. Signs of rotation were evident when it comes to investing styles, with the iShares Edge MSCI USA Value Factor ETF VLUE, -0.50% rising 0.5%, while the iShares Edge MSCI USA Momentum Factor ETF MTUM, +1.24% fell 1%. Momentum has substantially outperformed value in 2020, with MTUM up 16.9% in the year to date versus a 15.5% fall for VLUE. Stocks had earlier opened mostly higher after a July jobs report that was better-than-estimated but still reflective of a slowdown in the economic recovery, but equities soon turned south in morning trade. See:‘What’s concerning is that the pace of jobs growth is slowing down’ — economists react to August jobs report Data from the Labor Department showed that the economy regained 1.4 million jobs in August and the unemployment rate fell to 8.4% from 10.2%. Economists polled by MarketWatch had predicted an increase of 1.2 million jobs. Private-sector payrolls rose by a smaller 1 million. Hours worked rose 0.1 hour to 34.6 hours. The increase in hiring in July was revised down slightly to 1.73 million. The report showed that the gains are “slow but steady which is actually a perfect thing to see overall,” JJ Kinahan, chief market strategist for TD Ameritrade, told MarketWatch. That said, the strategist thinks investors may need to see more progress, especially given where the labor-market was in February. Mike Loewengart, managing director investment strategy at E-Trade Financial US:ETFC, said that investors could see more turbulence after Thursday’s unsettling action. “It’s been a while since we’ve been in the throes of the type of volatility that defined the market earlier this year, so investors may have some post-traumatic stress after yesterday’s landslide,” he wrote in emailed comments on Friday. “For some perspective, September ushers in a historically volatile period for the market, and has a particularly bearish reputation,” he wrote. “Certainly, wide price swings are never comfortable, but investors should keep in mind that periods of volatility like this are not uncommon, especially on the heels of an epic rally, and should be taken in stride,” Loewengart said. Which stocks were in focus? Apple Inc. AAPL, +1.74% shares reversed earlier losses to end with a gain of 0.1%, after an 8% tumble for the company’s worst day since March 16, when shares plunged 12.9%. Athletic-apparel company Under Armour Inc. UA, +0.09% UAA, -0.39% said Friday it will close all of its UA Brand House and UA Factory House retail locations in the U.S. for Thanksgiving on Nov. 26., as a way to thank workers for their efforts during the pandemic. Shares of Tesla Inc. TSLA, +1.89% erased an early decline, rising 2.8% to allow the electric-vehicle maker to avoid a fourth straight decline. How did other markets trade? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% jumped 9.9 basis points to 0.72% after skidding lower on Thursday. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, was flat. Gold futures GCZ20, +2.17% ended lower, retreating for a third straight session. U.S. benchmark crude futures CL.1, -1.62% tumbled on demand worries, finishing below $40 a barrel. The Stoxx Europe 600 index SXXP, +0.55% closed off 1.1%, while the U.K.’s benchmark FTSE 100 UKX, +0.64% ended 0.9% lower on Friday. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% fell 1.3% and China’s CSI 300 000300, +2.04% closed 1% lower. Japan’s Nikkei NIK, -0.11% rose 1.1%."}]}