{"article": [{"url": "https://www.marketwatch.com/story/existing-home-sales-jumped-in-august-to-the-fastest-pace-in-over-a-decade-alongside-rising-prices-and-improving-foot-traffic-2020-09-22", "published": 1600852460.0, "headline": "Existing-home sales jumped in August to the fastest pace in over a decade - alongside rising prices and improving foot traffic", "body": "The numbers: Existing-home sales increased for the third consecutive month in August, as the U.S. housing market continued its rebound from the coronavirus pandemic. Total existing-home sales rose 2.4% from July to a seasonally-adjusted, annual rate of 6 million, the National Association of Realtors reported Tuesday. It was the fastest pace of home sales recorded since December 2006. Compared with a year ago, home sales were up 10.5%. Economists polled by MarketWatch had projected existing-home sales to rise to a median rate of 6.03 million. What happened: The Northeast experienced the biggest jump in sales, with a 13.8% increase from July. All regions reported an increase in sales, though the pace of sales was only up 0.8% in the West and the South. In the case of the West, economists noted that the ongoing wildfires across much of that region could be hampering sales activity, while the South likely displayed the effects of Hurricane Laura and Tropical Storm Marco. As sales increased, so did prices. The median existing-home price was $310,600 in August, up 11.4% from a year ago. Tightening inventory contributed to the rise in prices. Unsold inventory sat at a 3-month supply in August, down from 3.1 months in July and a 4-month supply a year ago. A 6-month supply of homes is generally considered to be indicative of a balanced market. Read more:As wildfires burn the West Coast, residents face another challenge: High prices pushing people out of urban centers The big picture: A separate report from the National Association of Realtors found that buyer foot traffic was up in August, with home showings up 20% compared with a year ago. Clearly, demand for homes is up - largely a reflection of the positive effect of record-low mortgage rates. But the supply of homes remains historically tight, and that's creating major challengers for Americans looking to buy. \"Even more homes would have been sold if more people would put their homes on the market,\" said Holden Lewis, home and mortgage expert at personal-finance website NerdWallet. \"The inventory of homes for sale is low, probably because would-be sellers don't want strangers in their homes.\" Plus, while mortgage rates are low, lenders are being stingier with credit in the face of the risks still posed by the coronavirus pandemic. That could put a dent in foot traffic if a growing number of buyers are unable to secure financing. What they're saying: \"The downside to existing home sales is not from weak demand but from tight inventories and high prices,\" Rubeela Farooqi, chief U.S. economist for High Frequency Economics, wrote in a research note. \"The rising trend in mortgage applications over the summer points to further gains through early fall. But the tightening of lending standards in recent months appears already to be crimping applications, so sales likely will peak around the year-end,\" said Ian Shepherdson, chief economist at Pantheon Macroeconomics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56%  and the S&P 500 SPX, +0.87%  were both up slightly in Tuesday morning trading."}]}