{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-point-higher-as-investors-watch-stimulus-talks-await-earnings-flood-2020-07-27", "published": 1595868020.0, "headline": "Dow ends 114 points higher, U.S. stocks snap 2-day losing streak, as investors await stimulus progress", "body": "Major U.S. stock indexes finished higher Monday, as investors watched lawmakers haggle over a coronavirus rescue program and braced for the busiest week of earnings season.How did major benchmark perform? The Dow Jones Industrial Average DJIA, +0.56% closed 114.88 points higher, or 0.4%, at 26,584.77, while the S&P 500 SPX, +0.87% rose 23.78 points, or 0.7%, to finish at 3,239.41. The tech-heavy Nasdaq Composite COMP, +1.39% led the market’s gains on Monday, ending 173.09 points higher, or 1.7%, at 10,536.27. Major benchmarks ended modestly lower Friday, leaving the Dow with a weekly loss of 0.8%, while the S&P 500 declined 0.3% for the week. The Nasdaq lost 1.3% in a week that saw previously high-flying tech shares suffer the brunt of selling pressure. What drove the market? Investors were buying technology stocks Monday, while keeping an eye on progress in Washington on a second major U.S. spending plan, a raft of geopolitical concerns and the march higher in U.S. COVID-19 cases and deaths. “It’s a tech day,” said Donald Townswick, director of equity strategies at Conning, in an interview, adding that he expects high-flying technology stocks to stay aloft and “continue to dominate for the reasons they have,” including their ability to provide top-line growth, while most other companies haven’t during the pandemic. Senate Republicans also were expected on Monday to unveil their plans to provide additional coronavirus aid, following disagreements between themselves and the White House on the proposal, news reports said. However, Republican plans to tackle the legislation in a piecemeal approach remain stiffly opposed by Democrats. The talks come as a provision that provides an additional $600 a week in unemployment benefits to more than 32 million out-of-work Americans expires at the end of the month. “There is a very strong case to be made for additional fiscal stimulus. Both sides of the political aisle want to get something down,” said Talley Leger, senior investment strategist for Invesco, in an interview. He noted high-frequency data-tracking movements of Americans’ shopping habits and dining reservations had stalled in several states, suggesting the recovery in U.S. economic activity during the pandemic was at risk of coming apart. U.S.-China tensions simmered, as the U.S. closed its consulate in the western Chinese city of Chengdu at Beijing’s demand, in retaliation for Washington ordering the closure of China’s Houston consulate. Earnings season continues apace this week, including results from a host of tech heavyweights. Google parent Alphabet Inc. GOOG, +1.97% GOOGL, +1.82%, Amazon.com AMZN, +3.01%, Apple Inc. AAPL, +1.74% and Facebook Inc. FB, +0.26% are due to report Wednesday and Thursday. “Markets are fairly quiet today, while continuing their upward momentum earlier this month,” said Charlie Ripley, senior investment strategist for Allianz Investment Management in Minneapolis, in an interview. But he also sees “a tremendous amount of uncertainty in the market,” including around “high expectations” around tech earnings. Chief executives from all four companies will appear in congressional hearings on Wednesday to answer questions about their business practices. Earnings Watch:Big Tech’s big test arrives in the busiest week of earnings season Through the end of last week, companies representing 30.5% of the S&P 500’s market value had reported second-quarter results, with earnings beating expectations by 13.7% in aggregate, with 79% of companies beating lowered estimates, said Jonathan Golub, chief U.S. equity strategist at Credit Suisse, in a note. See:S&P 500 earnings have been as bad as feared, even as the beat rate has improved Price action, however, has been more muted than normal, he wrote, with companies beating both revenues and earnings outperforming the market by 1.2% versus a historical average of 1.6%. Companies missing on both measures have lagged by just 0.7% versus a historical average of 3.1%. On the economic front, durable-goods orders for June climbed 7.3%, and orders minus transportation rose 3.3%, with core capital-goods orders seeing a similar rise. The Federal Reserve will conclude its two-day policy meeting on Wednesday. Investors generally don’t expect the central bank to make any major announcements, but are looking for Chairman Jerome Powell to maintain a dovish tone. Powell’s remarks also might resonate on Capitol Hill as negotiations toward a coronavirus rescue package continue, said Bernard Baumohl, chief global economist at the the Economic Outlook Group, in a note. “If the Fed chairman emphasizes the urgent need for fiscal policy to address the widening economic divide in this country caused by the COVID-driven recession, it will be hard for those on Capitol Hill to ignore it,” he said.Which companies were in focus? Moderna Inc. MRNA, +0.09% shares rose 9.2% after the company said over the weekend that it had secured another $472 million commitment from the government to develop a COVID-19 vaccine. Shares of Hasbro Inc. HAS, +1.36% were fell 7.4% after the toy maker reported an adjusted second-quarter profit and revenue that came in below expectations, as the COVID-19 pandemic has led to temporary store closures, product shortages and lower retail inventories. Albertsons Cos. Inc. ACI, +1.71% stock fell 5.4% even after the grocer reported first-quarter earnings that beat expectations. Papa John’s International Inc. PZZA, -1.18% stock gained 1.4% after the pizza chain said that it will bring on another 10,000 workers due to the COVID-19-related surge in business. Alphabet Inc. GOOGL, +1.82% said it would extend its work-from-home order for its employees until summer 2021. Previously, the tech company had told employees they could return to the office as early as January. Its shares gained 1.4%. The U.S.-listed shares of Taiwan Semiconductor Manufacturing Co. Ltd. TSM, +1.11% shot up 12.7% after Intel INTC, -1.03% said it may make use of another company’s foundry to make its 7-nanometer chips. Biogen Inc. BIIB, -0.13% shares rose 5.1%, after Morgan Stanley gave the drug maker an overweight from underweight and a price target increase by $94 to $357. Shares of Lemonade Inc. LMND, +12.82% were 6.4% lower on Monday after Goldman Sachs initiated coverage by giving the insurance startup a sell rating and $44 price target, after it went public on July 1. Shares of Carnival Corp CCL, +0.51% tumbled 7.1%, while other cruise lines also came under pressure Monday amid rising COVID-19 cases in much of the U.S. Norwegian Cruise Line Holdings Ltd.’ NCLH, +2.91% shares tumbled 7%, while Royal Caribbean Cruises Ltd.’s RCL, +2.59% fell 3%. Gilead Sciences Inc. GILD, +0.82% shares gained 1.2% Monday, after it said late Friday its CAR-T cell therapy received approval from the Food and Drug Administration as a treatment for adult patients with relapsed or refractory mantle cell lymphoma. How did other markets trade? In Asia, China’s CSI 300 gauge 000300, +2.04% rose 0.5%, the Shanghai Composite Index gained 0.3%, while Hong Kong’s Hang Seng inde x HSI, -0.30% shed 0.4%. In Europe, the Stoxx 600 Europe index SXXP, +0.55% closed down 1.1%, while the U.K.’s FTSE 100 UKX, +0.64% declined 0.3%. Gold futures US:GCQ20 surged $33.50 to a fresh record Monday, up 1.8%, to settle at $1,931 an ounce on the New York Mercantile Exchange, with its latest boost courtesy of a falling dollar. In currency markets, the dollar weakened 0.8% against its six major rivals, falling to around its lowest level in two years, as gauged by the ICE U.S. Dollar Index DXY, -0.58%. September futures for the U.S. crude benchmark US:CLU20 gained 31 cents, or nearly 0.8%, to settle at $41.60 a barrel on the New York Mercantile Exchange. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 2 basis points to 0.609%, its biggest daily gain since July 10. Yields move in the opposite direction of prices. William Watts contributed reporting"}]}