{"article": [{"url": "https://www.marketwatch.com/story/gold-retreats-poised-for-first-back-to-back-loss-in-about-a-month-2020-08-12", "published": 1597241360.0, "headline": "Gold settles higher, a day after losing more than 4%", "body": "Gold futures settled higher on Wednesday, recouping a small portion of the more than 4% drop suffered a day earlier, as U.S. Treasury yields traded off the day’s highs and the dollar edged lower, providing some support for the precious metal. The recent weakness for the asset came as yields for benchmark government bonds have risen firmly in recent trade, providing haven-seeking investors another alternative to bullion, which doesn’t offer a coupon. The rise in U.S. yields “delivered a sledgehammer blow to precious metal markets on Tuesday,” said Craig Erlam, senior market analyst at Oanda, in a note. Gold rallied to an all-time high over the summer as U.S. real yields went negative and continued to decline, so the sudden spike in yields over the last couple of days “triggered a rush for the exits in what has become an incredibly overcrowded trade,” he said. The rise in yields has been attributed to a “slew of upcoming auctions and higher PPI numbers, Erlam said. Bond yields continued to rise Wednesday as data revealed that the U.S. consumer-price index rose in July for a second month in a row. The 10-year Treasury note TMUBMUSD10Y, 0.777% yielded 0.658% Wednesday, up from 0.562% at the end of last week, according to Dow Jones Market Data. However, it was off the day’s strongest level, after having touched a high of 0.694% Wednesday. The ICE U.S. Dollar Index DXY, -0.58%, meanwhile, traded 0.3% lower as gold futures settled, supporting prices for the metal, which is traded in the greenback. “The outlook for gold remains bullish,” with the recent pullback “potentially opening the path to fresh all-time highs as fundamentals stimulate appetite for the metal,” said Lukman Otunuga, senior research analyst at FXTM. “Looking at the technical picture, a weekly close above $1,900 could signal further upside in the medium term.” On Wednesday, December gold GCZ20, +2.17% GC00, +2.17% rose $2.70, or 0.1%, to settle at $1,949 an ounce. It traded low as $1,874.20 for the session, the lowest intraday mark for a most-active contract since July 23, according to FactSet data. Prices for the yellow metal dropped 4.6% Tuesday, which represented the steepest one-day dollar decline since April 15, 2013, and steepest percentage slide since March 13 of this year, based on the most-active contracts. September silver US:SIU20 lost 7 cents, or 0.3%, at $25.979 an ounce, after the metal tumbled 11% in the previous session to register its sharpest daily dollar fall since Sept. 23, 2011 and largest daily percentage drop since March 16 of this year. Prices for precious metals have surged to, or near, records in recent weeks at least partly on the back of the economic damage wrought by the COVID-19 pandemic, and the potential for a vaccine has been considered a bearish factor for the precious metal that thrives on uncertainty. On Tuesday, reports of a vaccine being registered in Russia helped to spark selling in silver and gold, experts said. Among other Comex metals Wednesday, September copper US:HGU20 added 0.5% to $2.891 a pound. October platinum PLV20, +3.99% lost 1.3% to $959.20 an ounce and September palladium US:PAU20 inched lower by 0.3% to $2,168.20 an ounce."}]}