{"article": [{"url": "https://www.marketwatch.com/story/i-moved-into-my-in-laws-home-my-husband-wants-to-pay-his-parents-mortgage-but-it-will-come-out-of-my-income-how-can-i-protect-myself-2020-09-15", "published": 1601100980.0, "headline": "I moved into my in-lawsâ\u0080\u0099 home. My husband wants to pay his parentsâ\u0080\u0099 mortgage, but it will come out of my income. How can I protect myself?", "body": "Dear Moneyist, I got married recently and moved into my husbandâ\u0080\u0099s house that he shares with his parents. (His name and his parentsâ\u0080\u0099 name are on the deed.) Currently, we pay a small amount for rent, but my husband hopes to take on the mortgage of the house over the next couple of years. I am the breadwinner, and so the majority (or even all) of the money that would go towards the mortgage would be coming from me. Before fully committing to this, are there any precautions I need to take? Or what are the risks I could be facing? I am worried about what would happen if I end up paying off their home, and they want to sell it or my in-laws pass away, or if they decide to give their share of the house to my husbandâ\u0080\u0099s sister, or if my husband and I separate (which is more of a worse-case scenario). In all those cases would I be entitled to anything with the house? Unfortunately, you can sometimes get screwed over dealing with family. How can I prevent this from happening? I do want to help pay the mortgage. I would like to think my husband and his family would not do anything untoward, but I still would like to take precautions. I live in the San Francisco Bay Area. Thank you for your help. Daughter-in-law The Moneyist: My sister-in-law moved in with her mother, changed her will, set up a new trust and inherited everything. Is it too late to claim what rightfully belongs to us? Dear Daughter-in-law, Itâ\u0080\u0099s not a good idea to use marital funds to pay off your in-lawsâ\u0080\u0099 mortgage, particularly given all of the potential scenarios you lay out. There are probably a few more that you have not thought of, but they all end up in the same place. You use your income, which could be used to build wealth and/or pay off your own mortgage, and end up with half or quarter of a home when youâ\u0080\u0099re done. Before using your own funds for this purpose, you would need your parents to either sign a quit claim to deed 50% of the home to you and your husband, and/or set up an agreement where you both own the home and your in-laws have the right to live there for the rest of their lives. Put your heads together and pay off your own mortgage. California is a community property state. But inheritance is generally considered separate property. But itâ\u0080\u0099s not so cut and dry. According to Fernandez & Karney, a Santa Monica, Calif.-based law firm, â\u0080\u009cMuch of the work in the divorce process comes down to picking apart where separate and community property has co-mingled over the course of the marriage.â\u0080\u009d The Moneyist: My motherâ\u0080\u0099s will says her boyfriend can live in her home after she dies. Can I still kick him out if the deed is transferred to me? Given that you would use marital funds to pay your husbandâ\u0080\u0099s part of the mortgage, his portion of the house should then turn from separate property to community property where you both own 50% of his half. Similarly, if you made improvements to this home, his portion of the property would become community property. But thatâ\u0080\u0099s messy. Make sure your in-laws and your husband agree to everything in writing before you make contributions to their half of the mortgage. As you say, you could pay off all of this mortgage, your in-laws could die, resulting in the house being split 50/50 between your husband and his sister, you divorce from your husband and are left with quarter of a home. If this column proves nothing else, itâ\u0080\u0099s that families and the people you trust the most in the world can sometimes be the most unpredictable. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Hello there, MarketWatchers. Check outthe Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}