{"article": [{"url": "https://www.marketwatch.com/story/banks-to-wait-until-market-close-on-june-29-to-talk-about-impact-of-fed-stress-tests-on-their-capital-plans-2020-06-19", "published": 1592571860.0, "headline": "Banks to wait until market close on June 29 to talk about impact of Fed stress tests on their cap", "body": "The Federal Reserve will release the results of its annual stress tests on the nation’s largest banks next Thursday but has asked the firms to refrain from discussing how the results will impact their own plans until after the market closes on June 29, a top U.S. central banker said Friday. The Fed has conducted stress tests on the biggest banks every year since 2009 and this year is particularly important in the wake of the coronavirus pandemic. Fed officials have said banks entered the crisis in a strong position, but analysts have said the length of the pandemic could erode the balance sheets of some banks as credit losses mount. In a speech to the Women in Housing and Finance, Fed Vice Chairman Randal Quarles said the Fed asked for the delay “to provide for a more orderly dissemination of information to the public.” Banks have been under pressure to stop paying dividends. Some analysts think a few banks are at risk of dividend cuts after the Fed tests. Read:These big banks may be at risk of dividend cuts after Federal Reserve’s stress tests Quarles said that almost all U.S. large banks have already suspended share repurchases for the second quarter. Share buybacks accounted for over 70% of the capital distribution of large global banks before the pandemic, he said. Quarles said the Fed will publish results based on a stress test developed before the pandemic and additional information to assess bank capital under three different downside risk paths for the economy. “We simply would not have been doing our jobs if we had just run the test using a scenario framed before the economy began to deteriorate in March,” he said. “There’s probably never been more uncertainty about the economic outlook,” Quarles added. The stress tests cover 34 banks each with more than $100 billion in assets. They are designed so make sure that banks can survive a severe economic downturn without stopping lending. Quarles said the Fed will release both firm-specific and aggregate results for the pre-pandemic stress tests. The Fed will only release aggregate data on the three coronavirus-related scenarios. This year, for the first time, each bank will get a stress capital buffer requirement based on the pre-pandemic stress test results. “By giving the firms their effective capital buffer requirement for the coming year and allowing them to adjust their capital plans to that buffer, the change will result in a more thoughtful assessment of risks,” Quarles said. Once the banks have determined their final capital plans, the Fed will release the final capital requirements for each firm later this year, before they take effect in the fourth quarter. Some banks may determine that they are required by U.S. securities laws to disclose their stress capital buffer requirement before the Fed releases the information later this year, Quarles said. But the Fed said it expected the banks to wait until after trading on June 29 to make any announcements. In prior years, many banks put out announcements immediately after the Fed’s results were published."}]}