{"article": [{"url": "https://www.marketwatch.com/story/amazon-will-host-its-delayed-prime-day-shopping-event-on-oct-13-and-14-2020-09-28", "published": 1601365040.0, "headline": "Amazon will host its delayed Prime Day shopping event on Oct. 13 and 14", "body": "Amazon.com Inc. has announced the dates for this year’s Prime Day: Oct. 13 and 14. Prime Day, usually a summertime shopping event, was pushed back this year due to the COVID-19 pandemic. Media reports began circulating last week that Prime Day would take place on Oct. 13. Amazon AMZN, +3.01% did not confirm those reports. The dates were announced just days after the e-commerce giant revealed the latest iterations of its Echo smart speakers and other devices, such as a new home-camera drone. The coronavirus pandemic has upended the shopping calendar, extending the back-to-school period and shifting holiday shopping to an even earlier start. Some experts had proposed that Oct. 10, or 10/10/2020, would mark the start of the holiday shopping season this year. Read:General Mills and Tractor Supply among the companies that stand to make long-term gains from COVID-related ‘pet boom’ With many shoppers expected to begin purchasing items on wish lists earlier than usual, Prime Day could mark the unofficial start of the holiday shopping season even before Halloween. Historically, other big retailers like Walmart Inc. WMT, +1.00% and eBay Inc. EBAY, +6.47% have benefited from Prime Day as well. Prime Day starts at Oct. 13 at midnight Pacific, though Amazon will begin offering deals on Monday, with Amazon devices and private labels among the items that will be discounted in the lead up. Through Oct. 12, Amazon will also offer a $10 credit to spend on purchases made from small businesses. Amazon said it will invest $100 million on promotional activities catering to small businesses. Prime Day will also expand globally, with Turkey and Brazil participating for the first time. Other countries hosting Prime Day include the U.K., Spain, Singapore, the Netherlands, Japan, Germany and Australia. See:Walmart to hire 20,000 seasonal workers, sticks up on TVs for the holidays Amazon typically doesn’t provide a post-event Prime Day tally, but said last year that sales surpassed Black Friday and Cyber Monday combined. Its own Echo Dot device was reportedly one of the best-sellers. E-commerce is expected to be a driver of holiday sales this year as consumers avoid stores amid the pandemic and take greater advantage of options like in-store pickup and contactless delivery and payments. Amazon announced earlier this month that it will hire 100,000 workers across the U.S. and Canada to manage the holiday shopping surge. Don’t miss:Holiday sales forecast to grow 1% to 2.6% during new October-to-December shopping season: AlixPartners Amazon stock has rallied 71.8% for the year to date, the Amplify Online Retail ETF IBUY, +1.39% is up 73% and the S&P 500 index SPX, +0.87% has gained 3.7% for the period."}]}