{"article": [{"url": "https://www.marketwatch.com/story/us-seen-adding-almost-4-million-jobs-in-june-but-is-the-momentum-already-fading-2020-07-01", "published": 1593619100.0, "headline": "U.S. seen adding almost 4 million jobs in June â\u0080\u0094 but is the momentum already fading?", "body": "Wall Street is divining an increase of nearly 4 million jobs in June as the U.S. recovers from the coronavirus lockdowns, but really, itâ\u0080\u0099s anyoneâ\u0080\u0099s guess given the sheer magnitude of the pandemicâ\u0080\u0099s reverberations. Hereâ\u0080\u0099s what to watch in the June employment report from the Labor Department due on Thursday morning. The report is being released a day early because of the July 4 holiday. See: MarketWatch Economic CalendarReturning to work The reopening of the U.S. in May and early June resulted in scores of people returning to work, but just how many is difficult to tell. The number of people applying for or collecting unemployment benefits has remained in the tens of millions despite clear improvement in the economy. Some 22 million jobs were lost in the first two months of the pandemic. Whatever the case, economists polled by MarketWatch predict 3.9 million jobs were created or restored in June, with some estimates ranging as high as 8 million. If the actual number is around 3 million or higher, investors are likely to react positively. A weaker number would add to fresh worries that the recent resurgence in coronavirus cases is restraining the economic recovery. A separate report on Wednesday by large payroll processor ADP said private-sector companies added 2.37 million jobs in June. Yet the ADP report has not closely tracked the governmentâ\u0080\u0099s official jobs report during the pandemic. Big redo of Mayâ\u0080\u0099s employment? The reported increase of 2.51 million jobs in May took Wall Street totally by surprise as another big plunge in employment had been expected. In all likelihood, the government will sharply revise employment growth for May in Thursdayâ\u0080\u0099s report, so it will be best for investors to add the May and June figures together to get a better sense of how quickly the labor market is rebounding. Read:Consumer confidence jumps to 3-month high, but still well below precrisis levels A better-than-expected increase in jobs in June wonâ\u0080\u0099t look so great if the May numbers are significantly lowered. â\u0080\u009cIt looks like we could have another multi-million job gain, though who knows what the revisions to May will look like,â\u0080\u009d said Joel Naroff of Naroff Economic Advisors. Unemployment rate puzzle If figuring out how many jobs have been restored isnâ\u0080\u0099t hard enough, the government has had even more trouble trying to determine the real unemployment rate as millions of people have simply dropped out of the labor force because thereâ\u0080\u0099s no jobs to be had. They donâ\u0080\u0099t count in the unemployment rate. Whatâ\u0080\u0099s more, many people who have been temporarily laid off or furloughed have been improperly classified as â\u0080\u009cemployed but absent from work,â\u0080\u009d further skewing the unemployment rate to the lower side. In May, for example, the Bureau of Labor Statistics said the U.S. unemployment rate slipped to 13.3% from a modern record of 14.7%. Had all unemployed workers been classified properly, the jobless rate would have been three points higher at 16%-plus in May. Economists forecast the official unemployment rate slipping to just 13% in June on the assumption the government takes steps to correct the mis-classification of anyone who has missed time from work because of the virus. The best substitute for the â\u0080\u009crealâ\u0080\u009d jobless rate, however, might be a broader measure of unemployment known as the U6. It stood at 21.2% in May.Worker pay There doesnâ\u0080\u0099t seem to be much doubt among economists that wages are going down. Nearly 30 million people were either not working or working fewer hours at the end of May because of a sharp drop in demand. Read: In latest dark twist of pandemic, companies appear to be cutting wages Companies have cut hours, put workers on furloughs, reduced pay and taken other steps to cut costs â\u0080\u0094 trends sure to continue until the economy is mostly recovered. Donâ\u0080\u0099t look for the average amount of hourly pay in the monthly employment report to offer much clarity for the next several months, however. Pay soared in April by a record 4.7% because so many lower-wage workers lost their jobs, then earnings fell almost 1% in May. Typically wages move a few tenths in either direction. The changes in the past two months have been the most lopsided ever."}]}