{"article": [{"url": "https://www.marketwatch.com/story/private-browsing-online-isnt-as-anonymous-as-you-think-it-is-11596201400", "published": 1596187460.0, "headline": "Private browsing online isnâ\u0080\u0099t as anonymous as you think it is", "body": "Getty Images Many people look for more privacy when they browse the web by using their browsers in privacy-protecting modes, called â\u0080\u009cPrivate Browsingâ\u0080\u009d in Mozilla Firefox, Opera and Apple Safari; â\u0080\u009cIncognitoâ\u0080\u009d in Google Chrome; and â\u0080\u009cInPrivateâ\u0080\u009d in Microsoft Edge. These private browsing tools sound reassuring, and theyâ\u0080\u0099re popular. According to aÂ 2017 survey, nearly half of American internet users have tried a private browsing mode, and most who have tried it use it regularly. However,Â our researchÂ has found that many people who use private browsing have misconceptions about what protection theyâ\u0080\u0099re gaining. A common misconception is that these browser modes allow you to browse the web anonymously, surfing the web without websites identifying you and without your internet service provider or your employer knowing what websites you visit. The tools actually provide much more limited protections. Other studies conducted by theÂ Pew Research CenterÂ and the privacy-protective search engine companyÂ DuckDuckGoÂ have similar findings. In fact, aÂ recent lawsuit against Google GOOG, +1.97% Â GOOGL, +1.82% alleges that internet users are not getting the privacy protection they expect when using Chromeâ\u0080\u0099s Incognito mode.How it works While the exact implementation varies from browser to browser, what private browsing modes have in common is that once you close your private browsing window, your browser no longer stores the websites you visited, cookies, user names, passwords and information from forms you filled out during that private browsing session. Essentially, each time you open a new private browsing window you are given a â\u0080\u009cclean slateâ\u0080\u009d in the form of a brand new browser window that has not stored any browsing history or cookies. When you close your private browsing window, the slate is wiped clean again and the browsing history and cookies from that private browsing session are deleted. However, if you bookmark a site or download a file while using private browsing mode, the bookmarks and file will remain on your system. Although some browsers, including Safari (from Apple AAPL, +1.74% ) and Firefox, offer some additional protection against web trackers, private browsing mode does not guarantee that your web activities cannot be linked back to you or your device. Notably, private browsing mode does not prevent websites from learning your internet address, and it does not prevent your employer, school or internet service provider from seeing your web activities by tracking your IP address.Reasons to use it We conducted aÂ research studyÂ in which we identified reasons people use private browsing mode. Most study participants wanted to protect their browsing activities or personal data from other users of their devices. Private browsing is actually pretty effective for this purpose. We found that people often used private browsing to visit websites or conduct searches that they did not want other users of their device to see, such as those that might be embarrassing or related to a surprise gift. In addition, private browsing is an easy way to log out of websites when borrowing someone elseâ\u0080\u0099s device â\u0080\u0094 so long as you remember to close the window when you are done. Private browsing provides some protection against cookie-based tracking. Since cookies from your private browsing session are not stored after you close your private browsing window, itâ\u0080\u0099s less likely that you will see online advertising in the future related to the websites you visit while using private browsing. Additionally, as long as you have not logged into your Google account, any searches you make will not appear in your Google account history and will not affect future Google search results. Similarly, if you watch a video on YouTube or other service in private browsing, as long as you are not logged into that service, your activity does not affect the recommendations you get in normal browsing mode.What it doesnâ\u0080\u0099t do Private browsing does not make you anonymous online. Anyone who can see your internet traffic â\u0080\u0094 your school or employer, your internet service provider, government agencies, people snooping on your public wireless connection â\u0080\u0094 can see your browsing activity. Shielding that activity requires more sophisticated tools that use encryption, like virtual private networks. Private browsing also offers few security protections. In particular, it does not prevent you from downloading a virus or malware to your device. Additionally, private browsing does not offer any additional protection for the transmission of your credit card or other personal information to a website when you fill out an online form. It is also important to note that the longer you leave your private browsing window open, the more browsing data and cookies it accumulates, reducing your privacy protection. Therefore, you should get in the habit of closing your private browsing window frequently to wipe your slate clean.Whatâ\u0080\u0099s in a name It is not all that surprising that people have misconceptions about how private browsing mode works; the word â\u0080\u009cprivateâ\u0080\u009d suggests a lot more protection than these modes actually provide. Furthermore,Â a 2018 research studyÂ found that the disclosures shown on the landing pages of private browsing windows do little to dispel misconceptions that people have about these modes. Chrome provides more information about what is and is not protected than most of the other browsers, and Mozilla now links to an informational page on theÂ common mythsÂ related to private browsing. However, it may be difficult to dispel all of these myths without changing the name of the browsing mode and making it clear that private browsing stops your browser from keeping a record of your browsing activity, but it isnâ\u0080\u0099t a comprehensive privacy shield. Lorrie Cranor is a professor of computer science and of engineering & public policy at Carnegie Mellon University in Pittsburgh. Hana Habib is a graduate research assistant at Carnegie Mellonâ\u0080\u0099s Institute for Software Research. This was first published by The Conversation â\u0080\u0094 â\u0080\u009cPrivate browsing: What it does â\u0080\u0093 and doesnâ\u0080\u0099t do â\u0080\u0093 to shield you from prying eyes on theÂ webâ\u0080\u009d .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; margin-bottom: 5px; } .at16units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at12units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body .header .wsj-interactive.generic-iframe-embed[name=\"\"], body.at8units .bleed .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; } body.at4units .inline .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .offset .wsj-interactive.generic-iframe-embed[name=\"\"], body.at4units .header .wsj-interactive.generic-iframe-embed[name=\"\"] { height: 1px; }"}]}