{"article": [{"url": "https://www.marketwatch.com/story/lvmh-countersues-tiffany-over-failed-merger-2020-09-28", "published": 1601321600.0, "headline": "LVMH countersues Tiffany over failed merger", "body": "LVMH Moet Hennessy Louis Vuitton SE sued Tiffany & Co over their soured merger deal, saying the U.S. jeweler's business has been so deeply damaged during the pandemic that their takeover agreement is invalidated. The lawsuit, filed Monday in Delaware Chancery Court, counters a lawsuit that Tiffany filed this month against LVMH after the French conglomerate -- owner of Louis Vuitton, Dior and dozens of other luxury brands -- said it was backing out of its $16 billion acquisition of the jeweler. LVMH's lawsuit says Tiffany has been mismanaged during the pandemic and is particularly vulnerable to the disruption the industry is likely to suffer in the years to come. Tiffany has suffered a material adverse change to its business, LVMH says, triggering a standard provision in merger agreements that allows the buyer to walk away. Tiffancy declined to comment. The complaint says Tiffany's dependence on the U.S. market and foot traffic in malls means the jeweler's prospects are particularly grim compared to the broader luxury industry, which has been thrown into turmoil by the pandemic. \"The pandemic's disruption to the luxury industry and to Tiffany in particular will persist well into 2021 at a bare minimum,\" LVMH's complaint says. \"Tiffany is particularly ill-suited for the challenges ahead.\" To escape from a merger contract, acquiring companies face the burden of showing that a target company's performance has been unusually bad relative to others in its industry, legal experts say. The complaint repeats the claim that LVMH is legally barred from completing the deal because of a letter sent by the French foreign minister, Jean-Yves Le Drian, that said LVMH \"should\" delay the acquisition of Tiffany to early January, more than a month after the deadline for closing the deal. \"'Should' is a translation of 'il conviendrait,' used in the original letter in French, which is understood to have a (polite) mandatory meaning under French law,\" LVMH said. Before Mr. Le Drian sent his letter, LVMH representatives asked the French finance minister for help in backing out of its agreement to take over Tiffany, and was turned down, according to senior French officials. Mr. Le Drian last week said he was responding to a request from LVMH for political advice when he wrote the letter to the luxury conglomerate. Write to Matthew Dalton at Matthew.Dalton@wsj.com"}]}