{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-retreat-as-coronavirus-cases-and-oversupply-worries-haunt-industry-2020-06-30", "published": 1593532340.0, "headline": "Oil posts hefty quarterly climb, but coronavirus cases, oversupply worries feed year-to-date loss", "body": "Oil futures ended lower on Tuesday as persistent concerns about the rising number of cases of COVID-19 offset upbeat data suggesting both China’s manufacturing and service sectors are recovering. Despite a significant rebound for oil prices in the second quarter, U.S. oil prices still ended the first half of the year with losses of close to 36%. “The second quarter will not soon be forgotten by energy traders given that WTI crude oil futures plunged into negative territory for the first time in history, and decidedly so, in the month of April,” said Tyler Richey, co-editor at Sevens Report Research. That was “due to logistics issues in the physical supply chain, most notably a critical lack of available storage for freshly lifted crude barrels in the U.S.” On April 20, WTI oil futures fell 306% to settle at negative $37.63. “Since then, oil and refined product markets have staged an equally historic rebound with prices poised to end the second quarter nearly 100% higher than where they ended Q1 due to a swift recovery in consumer demand as well as sharp output cuts by global oil producers,” Richey told MarketWatch. On Tuesday, West Texas Intermediate crude for August US:CLQ20 fell 43 cents, or 1.1%, to settle at $39.27 a barrel on the New York Mercantile Exchange. So far this year, prices based on the front-month contracts, were nearly 36% lower, according to Dow Jones Market Data. For the quarter, however, prices rose nearly 92%. Global benchmark Brent oil for August delivery UK:BRNQ20 shed 56 cents, or 1.3%, to end at $41.15 a barrel on ICE Futures Europe. Front-month contract prices fell by almost 38% year to date, but was up nearly 81% for the quarter. The August contract expired at the end of the session. The new front month September contract UK:BRNU20 fell 58 cents, or 1.4%, to $41.27. The global tally for confirmed cases of the coronavirus that causes COVID-19 rose to 10.3 million on Tuesday, according to data aggregated by Johns Hopkins University. The number of deaths climbed to 505,518, while the number of people who have recovered reached 5.2 million. A steady climb in the number of infections has raised the threat of delaying or reversing efforts to reopen economies that have been facing lockdowns to curb the coronavirus pandemic. On top of that, investors were monitoring Libya to see if the oil exporter would resume oil production which has been almost entirely blockaded since January amid the country’s civil war, Reuters reported. Meanwhile, China’s official manufacturing purchasing managers for June rose to 50.9 from 50.6 in May, while the services PMI rose to 54.4 from 53.6, suggesting the second-largest economy and biggest importer of oil is continuing to show signs of recovery from the virus that was first identified in Wuhan. “As we move into the second half of the year, the energy rebound is showing signs of stalling, however, as traders assess the threat of the recent resurgence in COVID-19 cases and the looming possibility of more economic shutdowns in the back half of the year,” Richey said. “If this most recent wave of the outbreak peaks in the coming days or weeks, and the process of economic reopenings resumes, then normalizing market conditions should see WTI crude oil prices continue to grind back towards the pre-pandemic price range between $50 and $60 a barrel as the market becomes more balanced,” he added. Oil prices very briefly trade modestly higher during Tuesday session, with Richey attributing the move to a reported explosion in Tehran that “triggered a geopolitical fear bid as the reason for the blast and resulting fire remain unknown” and tensions between the U.S. and Iran have been on the rise this week. Oil products on Nymex settled higher at the end of Tuesday’s session, which marked expiration of the July contracts. July gasoline US:RBN20 rose about 1.4% to $1.2001 a gallon, with prices based on the front-month contract more than doubling for the quarter. Still, they were down 29% year to date. July heating oil US:HON20 added 1.1% to $1.1781 a gallon, with prices up over 16% for the quarter, but down around 42% so far this year. August natural gas US:NGQ20 ended at $1.751 per million British thermal units, up 2.5% Tuesday. Prices saw a quarterly rise of nearly 7% and a loss of 20% for the year to date. Weekly data on U.S. petroleum supplies will be released by the American Petroleum Institute, a trade group, late Tuesday. The Energy Information Administration’s data are due out Wednesday. On average, the government report is expected to show crude inventories declined by 2.7 million barrels last week, according to analysts polled by S&P Global Platts. The analysts also forecast a supply decline of 2.7 million barrels for gasoline and an increase of 900,000 barrels for distillate inventories."}]}