{"article": [{"url": "https://www.marketwatch.com/story/manufacturers-come-back-strong-in-june-ism-finds-but-its-a-slow-recovery-at-this-point-2020-07-01", "published": 1593601160.0, "headline": "Manufacturers come back strong in June, ISM finds, but â\u0080\u0098itâ\u0080\u0099s a slow recovery at this pointâ\u0080\u0099", "body": "The numbers: American manufacturers fired up their production lines in June and expanded for the first time since the start of the coronavirus pandemic almost four months ago, but growth hasnâ\u0080\u0099t returned to precrisis levels and is unlikely to do so soon. The Institute for Supply Management said its manufacturing index climbed to 52.6% from 43.1% in May and an 11-year low of 41.5% in April. Economists surveyed by MarketWatch had forecast the index to total 50.2%. Readings over 50% indicate more companies are expanding instead of shrinking. Whatâ\u0080\u0099s unclear is the extent to which a recent spike in COVID-19 cases in states such as Texas, California and Florida derails the recovery. Timothy Fiore, chairman of the ISM survey, said so far the institute has not seen concrete evidence of backsliding, but he acknowledged viral flare-ups are likely to cause some disruptions. Read:Consumer confidence jumps to 3-month high, but still well below precrisis levels What happened: The ISMâ\u0080\u0099s indexes for new orders, production and employment all surged. The index for new orders, for instance, jumped to 56.4% from 31.8%. Production saw a similar gain. The employment index, meanwhile, rose 10 points to 42.1%, reflecting more people returning to work. Still, the level of employment remains well below precrisis levels. â\u0080\u009cWhile we are seeing signs of an uptick in business activity, it is a slow recovery at this point,â\u0080\u009d said an executive at a chemical maker. â\u0080\u009cDemand is down significantly due to COVID-19 but is starting to stabilize. We are hopeful for recovery in the second half of the year,â\u0080\u009d said another manufacturer executive. Thirteen of the 18 industries tracked by ISM expanded in June, led by food manufacturers benefiting from people buying more groceries and eating at home. Yet manufacturers of transportation equipment, metals and metal parts and machinery shrank again. The ISM index is compiled from a survey of executives who order raw materials and other supplies for their companies. The gauge tends to rise or fall in tandem with the health of the economy. See: MarketWatch Economic Calendar Big picture: The big improvement in manufacturing adds to a pile of evidence showing the economy gaining steam in May and early June. Manufacturers havenâ\u0080\u0099t been hit quite as hard by the pandemic as businesses such as restaurants and airlines that serve large clusters of consumers. Yet further viral outbreaks and a depressed global economy, that has undercut American exports, are likely to keep manufacturers on a tight lease for months to come. If demand doesnâ\u0080\u0099t accelerate a lot faster, some companies might have to eliminate more jobs, further restraining a recovery. What they are saying? â\u0080\u009cThe renewed upturn in COVID-19 infections across the South and West in recent weeks poses a downside risk, but with states initially attempting to control the outbreaks with targeted restrictions on bars and other public venues, for now the manufacturing sector appears to be relatively less exposed,â\u0080\u009d said senior U.S. economist Andrew Hunter of Capital Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% had been rising in Wednesday trades, with the ISM report adding to the gains."}]}