{"article": [{"url": "https://www.marketwatch.com/story/twitter-employees-are-getting-an-election-day-perk-this-november-2020-06-24", "published": 1593076640.0, "headline": "Twitter employees are getting an Election Day perk this November", "body": "Twitter is giving its staff a paid day off so they can cast their vote in national elections, the company announced Tuesday. The social media company will close Tuesday, Nov. 3 so employees can vote in the presidential election. When workers in other countries have a national election, they’ll also get a paid day off as well, the company added. “Given the importance of voting, going forward all national election voting days that take place on a weekday will be a paid day off,” the internal announcement said. Twitter’s approximate 5,100 staffers previously had up to two hours of paid time off to vote. The workers tasked with cybersecurity responsibilities will stay on the job that day, the company said. Twitter TWTR, -0.23% joins a growing list of companies that give workers paid time off — sometimes the whole day — so they have one less barrier in getting to the voting booth. Don’t miss: Twitter labels Trump tweet as ‘glorifying violence’ National voter turnout rates have hovered at just over 50% during the past two major elections: it was 55.6% in the 2016 presidential election and 53.4% in the 2018 mid-term elections. Patagonia, the outdoor retailer, has been closing its retail stores and corporate office every Election Day since 2016. All U.S. employees are paid for the day, a spokeswoman said. Levi Strauss & Co. LEVI, -2.24% gives its workers five hours of paid time off on Election Day. Time To Vote, a non-partisan coalition of businesses, pledges some type of accommodation so its rank and file can go and vote. The companies signing on are taking steps such as offering paid time off, cancelling meetings for the day or helping workers with early voting and mail-in ballots. More than 380 companies have signed up as earlier this year, the coalition’s website said. Two members include Walmart WMT, +1.00% , which has a website where workers can register to vote. Employees at the retail chain have up to three hours of paid time off, a spokesman said. Another member, Best Buy BBY, +1.45% , announced last week it would be shortening store hours on Election Day to give its members a chance to vote. See also:Why some companies want their employees (and customers) to vote Forty-three percent of companies said they offered workers paid time off for voting, according to a 2019 annual benefits survey from the Society for Human Resources Management. That’s essentially unchanged from the 44% of surveyed companies that offered the paid time off for voting in 2018 and the 42% in 2017."}]}