{"article": [{"url": "https://www.marketwatch.com/story/stocks-in-asia-follow-their-us-counterparts-higher-early-wednesday-2020-07-14", "published": 1594766240.0, "headline": "Stocks in Asia follow their U.S. counterparts higher early Wednesday", "body": "Stocks in Asia were mostly higher early Wednesday, following a rally in U.S. markets driven by optimism over the gradual economic recovery from the coronavirus pandemic. Japan’s Nikkei NIK, -0.11% was leading the way, up about 1.5%, as investors looked to the Bank of Japan’s policy decision later in the day for clues about the economic outlook. The U.S. dollar and Japanese yen were trading little changed. Chinese stocks were mixed, with the Shanghai Composite SHCOMP, +1.67% down about 0.5% but Hong Kong’s Hang Seng HSI, -0.30% up 0.75% Equities in Australia XJO, +0.00% were advancing a little better than 1% despite discouraging economic news Wednesday. The latest weekly payrolls data unsettled High Frequency Economics. The data, for the week ended June 27, showed a 1% drop in payroll employment and marked the first week-to-week decline since April 25. Carl Weinberg, chief economist at High Frequency Economics, had been hoping for a better outcome. “Two weeks before the renewed lockdown in Victoria, employment was already falling,” he says. “This makes us nervous.” A second indicator, the Westpac-Melbourne Institute Index of Australian consumer sentiment, fell 6.1% to 87.9 in July from 93.7 in June on a resurgence in Covid-19 cases. Westpac Chief Economist, Bill Evans says the drop in confidence reverses all of last month’s impressive gain, taking the index back to the weak levels seen in May but still leaving it 16% above April’s extreme low of 75. New Zealand’s NZX-50 NZ50GR, +0.36% is gaining for a third day, adding 0.5% in early trade. Gains are across the board with Ryman Healthcare RYM, -0.47% , a2 Milk ATM, -0.82% and Contact Energy CEN, +3.97% driving the index’s rise. Church software PPH, +0.66% ushpay extended losses, dropping 1.9% after a 8.4% fall the day before when its major shareholder sold part of its stake. The stock remains the best performer in the index year to date with a 106% gain. Malaysia posted positive data. May unemployment data reflects encouraging signs that labor-market pressures may be easing, UOB says. There were fewer additional unemployed persons in May, fewer new recipients under the employee wage retention and wage subsidy programs, and increased job vacancies, UOB notes. The bank says this is partly due to the country’s stimulus measures and more businesses being allowed to operate since early May. Malaysian stocks FBMKLCI, +0.71% were trading slightly in the green early Wednesday. The story was compiled from Dow Jones Newswires and Associated Press reports."}]}