{"article": [{"url": "https://www.marketwatch.com/story/flowers-homemade-signs-singing-outside-supreme-court-in-ginsburg-tribute-2020-09-19", "published": 1600507820.0, "headline": "Flowers, homemade signs, singing outside Supreme Court in Ginsburg tribute", "body": "Mourners dropped off bouquets and gathered outside the Supreme Court early Saturday in quiet tribute to the late Justice Ruth Bader Ginsburg. Homemade cardboard signs and a collection of flowers blanketed the court’s grounds. Hours earlier, hundreds of people had turned out after hearing of Ginsburg’s death. They wept and sang in a candlelight vigil, packing the high court’s steps in a spontaneous memorial. Scores of candles flickered in the nighttime wind as people knelt to leave flowers, American flags and handwritten condolence messages for Ginsburg, who died of metastatic pancreatic cancer at age 87 after 27 years on the court. Prayer candles with Ginsburg’s photo on them were also left on the steps. Opinion:Ruth Bader Ginsburg played a pivotal role in the women’s-rights era — and that was before she joined the Supreme Court Several times, dozens in the crowd broke out into song, singing “Amazing Grace” and “This Land is Your Land” as others embraced one another and wiped tears from their eyes. At one point, the crowd broke into a thunderous applause — lasting for about a minute — for Ginsburg. “Thank you RBG,” one sign read. On the sidewalk, “RBG” was drawn inside a pink chalk heart. Jennifer Berger, 37, said she felt compelled to join the large crowd that gathered to pay tribute to Ginsburg’s life. “I think it is important for us to recognize such a trailblazer,” she said. “It is amazing to see how many people are feeling this loss tonight and saying goodbye.” President Donald Trump has issued a proclamation directing that flags at the White House and all public buildings and grounds and military facilities be flown at half-staff until the late Justice Ruth Bader Ginsburg is interred. The president has also directed that flags be flown at half-staff at all U.S. embassies and other facilities abroad. The proclamation calls Ginsburg “a trailblazer, not only in the field of law, but in the history of our country.” Read:McConnell says a Trump pick to replace Ginsburg on Supreme Court would get Senate vote Former President Barack Obama is calling Ruth Bader Ginsburg “a relentless litigator and an incisive jurist” who “inspired generations, from the tiniest trick-or-treaters to law students burning the midnight oil to the most powerful leaders in the land.” Ginsburg spent her final years on the bench as the unquestioned leader of the court’s liberal wing and became something of a rock star to her admirers. Young women especially seemed to embrace the court’s Jewish grandmother, affectionately calling her the Notorious RBG, for her defense of the rights of women and minorities. The memorial service remained mostly peaceful and somber, but turned tense for several minutes after a man with a megaphone approached people in the crowd and began to chant that “Roe v. Wade is dead,” a reference to the landmark Supreme Court ruling establishing abortion rights nationwide. A large group confronted the man, leading to a brief shouting match. Many in the crowd began yelling “RBG” to try to drown out the man’s voice as he continued to say Republicans would push to quickly appoint a conservative justice to the court. Supreme Court police officers stood alongside the crowd and the man eventually left the area."}]}