{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-is-in-a-bubble-but-the-bubble-is-likely-to-get-bigger-2020-08-07", "published": 1596874940.0, "headline": "The stock market is in a bubble - but the bubble is likely to get bigger", "body": "Investors are asking me how high can this stock market go. The July employment report, released Friday, is providing a relief for the stock market. Nonfarm payrolls came at 1.46 million. Normally I compare economic data with the consensus forecast. In this case the forecasts were all over the place. The key point is that optimists have proven to be right. President Trump has banned TikTok and WeChat. In a normal market, this would be bad news for the stock market. However, in this market, bad news is good news. The momo (momentum) crowd is excited about Facebook FB, +0.26% replacing TikTok. The enthusiasm has caused a rip-roaring rally in Facebook stock. At the same time, the momo crowd is excited about Microsoft MSFT, +2.48% buying TikTok. It does not occur to the momo crowd that if Microsoft ends up buying TikTok, it will be a much stronger competitor to Facebook than TikTok ever was. How about retaliation from China? Apple AAPL, +1.74% is in the crosshairs. What does the momo crowd do about this higher risk in Apple stock? They are oblivious, buying Apple stock on the momentum. There are many crosscurrents. If you watch the S&P 500 ETF SPY, +0.89%, which tracks the S&P 500 Index SPX, +0.87%, you would note the following: â\u0080¢ A chasm is developing between what stock market analysts say and what they know. To save their careers, analysts have no choice but to follow the momo crowd in the stock market. These days analysts' calls have often become a case of the tail wagging the dog. Human nature as it is, anything can be justified. â\u0080¢ Being independent, I have been able to call a spade a spade - the stock market is in a bubble but the bubble is likely to get bigger. This call is based on macro and fundamentals. â\u0080¢ Under these circumstances, technical analysis is invaluable. The target for the S&P 500 is about 3,800 points. If the coronavirus didn't exist, the target would be higher. â\u0080¢ The chart shows that RSI (relative strength index) is overbought but has room to go higher. â\u0080¢ It is important to note that the Nasdaq 100 NDX, +1.51%, represented by the Invesco QQQ Trust QQQ, +1.52%, has significantly over-performed relative to the S&P 500 and Dow Jones Industrial Average DJIA, +0.56%. This is due to the heavy weighting of five mega-cap tech stocks Apple, Microsoft, Amazon AMZN, +3.01%, Facebook and Alphabet GOOG, +1.97%  GOOGL, +1.82%. Big institutions are hiding in the presumed safety of those stocks. Watch them closely for clues for what is next in the stock market. â\u0080¢ Consider watching popular momo stocks such as Fastly FSLY, +9.38% and Datadog DDOG, +8.89%. The momo crowd ran them up to unrealistic heights prior to their earnings reports this week and is now suffering massive losses. Opportunities abound A lot of money is to be made in an environment like this. Consider using the concept of protection bands to protect your long-term portfolios. In addition, consider opportunistically taking advantage of short- to medium-term opportunities as they arise. As a note of caution, the risk is much higher than generally believed. It is important to be nimble, have access to proven, independent sources and have risk-control measures in place. Consider buying a proper allocation of gold as an insurance policy. However, gold is very overbought in the short term and vulnerable to a pullback. The two gold ETFs to consider are SPDR Gold Shares GLD, +1.81% and iShares Gold Trust IAU, +1.82%, depending on a set of specific criteria. To learn more, please read \"Stock market bulls should consider owning gold as an insurance policy.\" Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, Microsoft and Facebook. Nigam Arora is the founder of The Arora Report, which publishes four newsletters. He can be reached at Nigam@TheAroraReport.com."}]}