{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-mostly-higher-dow-on-track-to-erase-2020-loss-2020-08-28", "published": 1598632340.0, "headline": "Dow erases 2020 loss, S&P 500 and Nasdaq notch fresh records", "body": "Stocks closed modestly higher Friday, with the Dow Jones Industrial Average erasing its losses for the year to date and the S&P 500 and Nasdaq indexes carving out fresh record closes, as investors sifted through data on U.S. consumer spending and confidence, a day after the Federal Reserve announced a policy shift that would allow employment and inflation to run hotter than in the past. What did major benchmarks do? The Dow DJIA, +0.56% closed higher by 161.60 points, or 0.6%, at 28,653.87, while the S&P 500 SPX, +0.87% rose 23.46 points, or 0.7%, to close at 3,508.01. The Nasdaq Composite COMP, +1.39% COMP, +1.39% advanced 70.30 points, 0.6%, to 11,695.63. For the week, the Dow gained 2.6%, the S&P 500 added 3.3%, and the Nasdaq was up 3.4%. All three indexes have gained about 8% in August, continuing a trend of August being the best month for stocks in an election year, even if 2020 feels anything but average. On Thursday, the Dow rose 160.35 points, or 0.6%, to close at 28,492.27. The S&P 500 ended with a gain of 5.82 points, or 0.2%, at 3,484.55, a record close. The Nasdaq , which closed at a record on Wednesday, fell 39.72 points, or 0.3%, to close at 11,625.34.What drove the market? The Dow clinched its third weekly gain in four weeks Friday afternoon, led by both Intel Walmart WMT, +1.00% and Coca-Cola KO, +0.69% , ahead of a restructuring of the index come Monday. Stocks put in a choppy performance Thursday after Federal Reserve Chairman Jerome Powell announced that the Fed was shifting to a policy of average inflation targeting which would effectively see policy makers end the practice of preemptively hiking interest rates to stave off inflation. Need to Know:The Fed might never hike rates again. Here are growth stocks for the long run, according to one strategist “By any metric, valuations are in nosebleed territory, but there is this entrenched view that the Fed has your back, that the polls are wrong and there will be a Trump sweep, and that a vaccine is coming this fall,” said David Rosenberg, a long-time strategist now running his own firm, Rosenberg Research. “These are hardened views in the marketplace. That’s what’s triggering this ongoing rally in risk equities.” Reflationary moves in the market, including the steepening of the yield curve and jump in bond yields to a roughly two-month high, is “likely temporary, but may still have more room to run near-term,” Rosenberg said in an interview with MarketWatch. The Fed’s new stance might as well be “an overt attempt to steepen the yield curve to help out the bank stocks,” Rosenberg noted. “They have helped out everyone else – the growth stocks, the credit markets, everything except the value trade, which needs the steeper yield curve. They’ve made no bones about the fact that they want to stimulate financial conditions. I’m not bullish on the economy going into the fourth quarter, and I don’t think the Fed is going to be successful in generating sustainable inflation any more than they have over the past 12 years. But I do think it’s a great buying opportunity for Treasurys.” See:‘The stock market no longer thinks it needs the economy if it has the Fed,’ David Rosenberg says Cleveland Federal Reserve President Loretta Mester, in a television interview Friday, said the economic recovery from the pandemic-induced recession “is likely to be a slow one.” “There is more pain out there that we are going to have to support the economy through,” Mester said. Data showed U.S. personal income rose 0.4% in July, while consumer spending was up 1.9%. Economists surveyed by MarketWatch expect had expected income to fall another 0.4% after a 1.1% drop in June. Spending was expected to show a 1.6% rise after a 5.6% increase in June. Spending on durable goods is up 12.2%, while spending on services is down 9.3% for a net shortfall of 4.6% in total consumer demand, said Aneta Markowska, chief financial economist at Jefferies, adding that the variation in spending patterns explains “part of the disconnect between the stock market and the economy, since the former has much less exposure to the service sector than the latter.” Read:Stop saying ‘stocks are not the economy’ The final reading of the University of Michigan’s August consumer sentiment index came in at 74.1 versus a preliminary reading of 72.8 and up from 72.5 in July.Which stocks were in focus? Coca-Cola Co. KO, +0.69% on Friday announced a reorganization and said it would offer voluntary job cuts to 4,000 workers in the U.S., Canada and Puerto Rico. Shares gained 3.3%. Shares of HP Inc. HPQ, -0.15% were up 6.2% after reporting fiscal third-quarter sales that exceeded Wall Street estimates by $1 billion, boosted by a pandemic-inspired jump in personal-computer sales. Dell Technologies Inc. DELL, -0.39% shares rose nearly 6% after the computer maker topped profit estimates. Visa Inc. V, +1.80% shares notched their first record close since February. Shares of Workday Inc. WDAY, +0.75% soared nearly 13% after topping earnings forecasts, boosting guidance and announcing a new co-CEO. Okta Inc. OKTA, -0.47% shares lost 5% after the identity-management services company topped Wall Street estimates on its quarter and outlook. Moderna Inc. MRNA, +0.09% shares gave up early gains scored after the company said it’s in talks with the Ministry of Health, Labor and Welfare of Japan to potentially sell 40 million or more doses of mRNA-127, its COVID-19 vaccine. U.S.-listed shares of Nio Inc NIO, +0.14% , a Chinese manufacturer of autonomous vehicles, fell nearly 7% after the company announced an offering of 75 million American depositary shares. Shares of Tesla Inc. TSLA, +1.89% dipped 1.1% on the final day before the company’s five-for-one stock split. How did other markets fare? The Shanghai Composite SHCOMP, +1.67% rose 1.6% and the Hong Kong’s Hang Seng Index HSI, -0.30% gained 0.6%. The Stoxx Europe 600 SXXP, +0.55% closed at 368.80, down 0.5%, while U.K.’s FTSE 100 benchmark UKX, +0.64% lost 0.6% to close at 66.32. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% TMUBMUSD10Y, 0.777% was down 2 basis points at 0.738%. Bond prices move inversely to yields. Gold futures GCZ20, +2.17% rose $42.30, or 2.2%, to settle at $1,974.90 an ounce. West Texas Intermediate crude for October delivery CL.1, -1.62% fell 7 cents, or 0.2%, to settle at $42.97 a barrel on the New York Mercantile Exchange. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the currency versus a basket of six major rivals, slumped 0.7%. Read:There will be no V-shaped recovery for consumer sentiment, DataTrek says"}]}