{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-edge-higher-but-march-to-2000-hamstrung-by-rising-dollar-2020-08-04", "published": 1596551660.0, "headline": "Gold ends above $2,000 for the first time in history as U.S. dollar and bond yields recede", "body": "Gold futures powered higher Tuesday, gathering momentum late in the session to finish at a fresh record as government bond yields headed lower and as the U.S. dollar’s recent rebound receded somewhat, allowing the precious metal to make an assault on a record close above the $2,000 threshold. The sustained rally in gold has come as governments across the world have flooded their economies with financial aid to combat the COVID-19 pandemic. . And investors are betting that the uptrend for the yellow metal continues as the dollar weakens and interest rates remain around 0% in many parts of the world. Analysts at BofA Global Research forecast that bullion will surge by 50% over the next 18 months to around $3,000 an ounce and see other precious metals benefiting in the COVID-19 environment. “When you’re looking at what [DXY, 10 year real yields] levels we would need to see gold at $2500 per ounce, it is combinations like the DXY at 90 and real rates at minus 2,” said Michael Widmer, metals strategist in comments included in an Aug. 3 research note, citing a July 30 call with clients featuring Widmer and commodity research analyst Francisco Blanch. “That will take gold to $2500. The DXY at 85 and real rates at minus 1.75 will also take you to $2500. DXY at 80 and real rates at minus 1.5 also take it to $2500 an ounce,” Widmer said, referencing bond yields and the ticker symbol for the ICE U.S. Dollar Index DXY, -0.58%, or DXY, a gauge of the dollar against a half-dozen major currencies. The DXY stood at 93.387 on Tuesday up less than 0.1%, moderating from a slightly firmer rise for greenback earlier in the session and providing some tailwind for precious metals that are priced in the currency. Assets pegged to U.S. dollars tend to weaken in price when the dollar strengthens because it makes those commodities more expensive for overseas buyers. Meanwhile, the 10-year Treasury note yield TMUBMUSD10Y, 0.777% was holding at around 0.52%, off 4.4 basis point on the day. On Tuesday, December gold GCZ20, +2.17% GC00, +2.17% rose $34.70, or 1.7%, at $2,021 an ounce, after notching a less-than 0.1% gain on Monday and starting out with meager gains on Tuesday. Commodity experts say that investors are watching the Federal Reserve for fresh signs of monetary stimulus as Congressional lawmakers debate a further coronavirus fiscal package in the U.S., which could serve as a catalyst for the next move in gold, said Carlo Alberto De Casa, chief analyst at ActivTrades, in a note. “It is clear the resistance level of $2,000 is a strong threshold for the price and significant volumes are placed there,” he wrote. “Any news regarding new monetary stimulus from the US Federal Reserve could trigger gold to break up the resistance level of $2,000.” September silver US:SIU20, meanwhile, mounted its own charge higher, climbing $1.61, or 6.6%, to end at $26.028 an ounce after the commodity rose 1% a day ago. In other Comex metals, September copper US:HGU20 lost 1.75 cents, or 0.6%, to reach $2,8945 a pound. October platinum PLV20, +3.99% rose $24.10, or 2.6%, to settle at $955.20 an ounce, while September palladium US:PAU20 gained $31.10, or 1.5%, to end at $2,170.60 an ounce."}]}