{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-come-off-overnight-lows-as-stocks-aim-for-higher-open-on-wall-street-2020-07-31", "published": 1596212600.0, "headline": "2-year Treasury yield plumbs record low after July rally as economic mood stays gloomy", "body": "U.S. Treasury yields ended lower on Friday, capping a weekly and monthly decline as concerns around the economic hit to the global economy from the coronavirus bolstered values for government bonds.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was down 0.4 basis point to 0.536%, around its lowest since March 9. The benchmark maturity fell 5.3 basis points this week, and 11.7 basis points in July. Yields fall as Treasury prices rise. The 2-year note rate TMUBMUSD02Y, 0.156% edged a basis point lower to an all-time low of 0.111%, contributing to a 4 basis point decline over the week and month. The 30-year bond yield TMUBMUSD30Y, 1.576% was at 1.198%%, leaving its weekly drop of 4 basis points and monthly fall of 21.2 basis points intact. What’s driving Treasurys? Treasury yields were initially higher after Amazon, Facebook, Apple and Google reported stronger results than Wall Street had forecast, putting a stop to the overnight gains in government bonds. The stock market’s rise has been driven by the relentless climb in a handful of tech company shares, raising worries that the stock market is becoming detached from the broader malaise weighing on the U.S. and global economy due to the COVID-19 pandemic. But continued concerns around the coronavirus kept yields around their lowest levels on record, with shorter-dated maturities already at all-time lows as the Federal Reserve pledges to keep rates near zero until the economy recovers. In testimony before Congress, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said the virus was unlikely to disappear as it was highly contagious, but that public health officials and policymakers could work together to bring it down to “low levels.” As expected, investors saw some bruising eurozone economic data, with the 19-member currency bloc reporting its biggest contraction on record in the second-quarter, falling by 12%. As for the U.S., consumer spending rose by 5.6% in June, marking its second straight monthly increase. Personal income also fell by 1.1% in June. Read: ‘A massive welfare economy’ - huge federal aid prevents an even steeper GDP collapseWhat’s driving Treasurys? “Yields have been skewing lower as the employment picture still remains a concern. It’s also clear the virus never really went away,” said Gregory Faranello, head of U.S. rates at AmeriVet Securities, in an interview."}]}