{"article": [{"url": "https://www.marketwatch.com/story/tiktok-saved-my-business-candy-retailer-finds-internet-fame-as-covid-19-forces-a-pivot-11599847515", "published": 1600074200.0, "headline": "TikTok saved my business: Candy retailer finds internet fame as COVID-19 forces a pivot", "body": "Nema Causey uses her confectionery storefront as a backdrop for viral TikTok videos. Nema Causey It took a pandemic for Nema Causey, the head of a candy retailer, to discover that she was sitting on a viral internet goldmine. Even before the World Health Organization officially declared the COVID-19 crisis a pandemic in early March, Causey noticed that orders were starting to dry up at Candy Me Up, her San Diego-based business that specializes in selling sweets to retail clients for use in events like candy buffets. “I was tripping out because I never fail in business,” said Causey, 33, who “hustled” candy to classmates back in middle school and then started a candy-catering company at age 18 that served as the eventual inspiration for her current business. “I was 99% sure we were going to shut down,” she told MarketWatch, as her storefront began taking a big hit in February. Candy runs in Causey’s veins as her father, an Iraqi immigrant, ran a business selling Michael Jackson pins, pocket brushes, and eventually candy bars to local convenience stores. When he became ill, the children opened up their own divisions of the company, with Causey focusing on a storefront that sold candy primarily to retail clients. A slowdown in orders in the early days of COVID-19 made her realize that the company needed a modern-day twist, however, so she made a TikTok account for it. As it turned out, the Candy Me Up storefront had the makings of a modern-day Willy Wonka paradise, replete with emoji piñatas, bright decor, and rows upon rows of candy. Causey and her brother Jonny Hallak, who focuses on the distribution part of their father’s original candy business, began filming themselves riding through the sugar-filled aisles and guzzling gummy candies. They also piggybacked onto the “Jelly Fruit challenge,” a viral trend that involved using only their mouths to open jelly candies wrapped in food-grade plastic. Kids were eating it up, YouTube GOOGL, +1.82% influencers took notice, and Causey realized she had a business opportunity on her hands: She ordered a pallet of 1,200 Jelly Fruits and opened up an online store for the first time. “TikTok is the one that really, truly saved our business,” Causey told MarketWatch. She originally worried that Jelly Fruits were a fad, but she quickly sold out of the first pallet and then went through 10 more, in addition to hawking other trendy sweets.Prophetic advice At first it seemed that one of Causey’s biggest entrepreneurial icons had some tough love for business owners in her shoes. She began tuning in to Instagram FB, +0.26% Live sessions with Marcus Lemonis of the television show “The Profit” and initially got the impression that he was suggesting businesses that lost money last year should close down given the pandemic. Candy Me Up had been profitable in prior years but posted a loss in 2019, according to Causey. Then sentiment seemed to change. “He said you need to figure out how to change your business,” Causey told MarketWatch. “He was like, you need to figure out a way to get revenue with everyone at home. I was like, I need to go on social media and figure it out.” Causey had been slowly growing Candy Me Up’s Instagram presence for about 10 years, but she decided to take a stab at TikTok, which had been surging in popularity as people looked to occupy themselves with fun content during their extended time at home. A few early posts went viral, leading to a steady stream of followers. Then a YouTube star reached out about the candies and gave Candy Me Up a shoutout as a way to help the small business get through the pandemic. “That brought 40,000 instant followers overnight,” Causey said. “They’re all kids and kids love candy.” Causey said that she and her brother are naturally goofy but that it took some time for them to feel comfortable being that way on camera. “We weren’t those people who took selfies of ourselves,” she said. “Now we’re used to it and our personalities are showing.” The videos have brought a sort of internet stardom that has crept into Causey’s offscreen life, as young fans now flock to her San Diego storefront. “I think Leo DiCaprio is famous, but they come in and they’re totally starstruck,” she said of her newfound fan base. A financial cushion A $10,000 loan through the Paycheck Protection Program gave Candy Me Up a financial cushion before Causey made the pivot to direct web sales. Like many small business owners, she struggled to get the money she needed in the early days of the program. After more than a month without seeing progress on the PPP application she filed through her bank, she put in an application through PayPal Holdings Inc. PYPL, +2.18%. Candy Me Up was approved for the loan two days later and the money got delivered on the third business day. “I was really happy about PayPal and how easy it was to get the money,” she said. She used the PPP money for payroll and other elements of Candy Me Up’s overhead, and she found herself guiding fellow members of the Middle Eastern business community through the PPP application process with PayPal. Causey was originally unsure about whether to even apply for PPP money given that her business lost money in 2019, as she worried that the loan could put her in a deeper hole. She ended up taking that loan, which she said “helped keep us open for that one month until I had to change the business in a way.” Once Candy Me Up made the online transition, Causey found herself turning down other forms of government loan assistance. She eventually was given the option to take out $100,000 in loan money through a different Small Business Administration program based on an application she filed earlier in the pandemic, but she felt she no longer needed it given the company’s newfound success on TikTok. “Why take out money when money’s now flowing in?” Causey said, though she noted that if not for the company’s online pivot, the initial PPP funds likely wouldn’t have been enough. “$10,000 was helpful at the time but it actually ran out fast.”Looking ahead Despite Candy Me Up’s online successes, the company is still feeling the sting from COVID-19 and its impact on physical gatherings. The company usually participates in the San Diego County Fair, a monthlong event early in the summer “that brings us so much money in 28 days that we don’t even need to be open for half the year,” Causey said. This year’s event was canceled due to the pandemic. The hope is that next year, the company will be able to benefit from both the in-person fair as well as the ongoing online operation. Candy Me Up now has roughly 400,000 TikTok followers, and it’s racked up a number of viral hits. One of the company’s first videos amassed more than 5 million views for its depiction of the behind-the-scenes process of making Chick-O-Sticks, a peanut butter candy that’s coated in coconut. Causey found the footage on Chick-O-Sticks’ site. Her original videos are also having success. A more recent clip featuring Causey and Hallak as they pour sour liquid on their Juicy Drop Pop lollipops has more than 2 million views. One showing Causey as she packs a customer’s order is nearing 5 million views. On a relative basis, Causey hasn’t had as much success building up her Instagram or YouTube followings, in part because she had originally tailored her Instagram page more toward business clients with aesthetic photos of confectionary assortments, rather than kid-friendly videos. She began asking fans to follow her on those other platforms as well once she heard that President Donald Trump might ban TikTok, though ultimately she’s not too worried about that outcome. After reading articles on U.S. companies like Microsoft Corp. MSFT, +2.48% and their interest in TikTok, she was left with the feeling that TikTok won’t be disappearing."}]}