{"article": [{"url": "https://www.marketwatch.com/story/heres-a-hedge-fund-strategy-that-just-might-work-for-you-2020-06-26", "published": 1593264200.0, "headline": "Hereâ\u0080\u0099s a hedge fund strategy that just might work for you", "body": "There are lots of analyses out there about what hedge funds are buying, but strategists at Jefferies Equity Research on Friday published a slightly different spin on that theme. The success of this particular investing trend, they argue, suggests not just that hedge funds are â\u0080\u009cgetting it right,â\u0080\u009d but that stock-picking may be back in favor. Steven DeSanctis and Eric Lockenvitz broke out the stocks that hedge funds had swapped from long positions to short â\u0080\u0094 that is, those they think are likely to increase in value versus those that are likely to decline â\u0080\u0094 and vice versa. Itâ\u0080\u0099s not just an academic exercise: â\u0080\u009cThe stocks that hedge funds were short but moved to a long position over the month have posted the best gain in June at 6.7%, and these names are now up 66% from the low,â\u0080\u009d the Jefferies team wrote (those calculations are as of June 24.) â\u0080\u009cStocks that moved from long to short are actually down 2.6% and lagging off of the bottom after being one of the leaders.â\u0080\u009d The performance data suggests something intriguing: could hedge funds be making the correct calls, finally, after years of underperformance? â\u0080\u009cThere will be many Haves and Have Nots across the market and hedge funds and long only investors will be able to separate wheat from chaff,â\u0080\u009d DeSanctis and Lockenvitz write. Itâ\u0080\u0099s worth noting that many market observers donâ\u0080\u0099t agree. Famed investing guru Burton Malkiel told MarketWatch earlier this week that â\u0080\u009cmore and more active managers are beaten by the index. Every year itâ\u0080\u0099s about two-thirds to 70% of active managers get beaten. Those that win in one year arenâ\u0080\u0099t the same ones that win the next year. There is no evidence that some years are going to be active years. Thereâ\u0080\u0099s no evidence whatsoever that because of COVID-19 itâ\u0080\u0099s time for active management.â\u0080\u009d If, however, you'd like to try, the two lists of hedge fund holdings, long to short and short to long, are below. New longs New shorts Southwest Airlines Co. LUV, +1.89% Â Target Corp. TGT, +1.14% Â Square SQ, +2.06% Â Home Depot Inc. HD, +0.49% Â Northrop Grumman Corp. NOC, -1.37% Â Johnson & Johnson JNJ, +1.39% Â Chubb CB, -0.68% Â Intel Corp. INTC, -1.03% Â Parker-Hannifin Corp. PH, +0.09% Â MSG Networks Inc. MSGN, Â Etsy Inc. ETSY, +5.11% Â Bristol-Myers Squibb BMY, +0.32% Â GenMark Diagnostics Inc. GNMK, -1.32% Â Verizon Communications Inc. VZ, +0.23% Â Williams-Sonoma Inc. WSM, +1.34% Â Walmart Inc. WMT, +1.00% Â Euronet Worldwide Inc. EEFT, -0.96% Â Starbucks Corp SBUX, +0.53% Â Devon Energy Corp. DVN, -2.42% Â Oracle Corp. ORCL, +0.42% Â Molina Healthcare Inc. MOH, -0.27% Â PepsiCo Inc. PEP, +0.42% Â Boeing Co. BA, -0.39% Â T-Mobile US Inc. TMUS, +1.50% Â 3M Co. MMM, +0.94% Â McDonaldâ\u0080\u0099s Corp. MCD, -0.43% Â J.M. Smucker SJM, +1.32% Â Kimberly-Clark Corp. KMB, +1.45% Â Lennar Corp. LEN, +0.07% Â Duke Energy Corp. DUK, +0.16% Â MercadoLibre MELI, +3.40% Â Advanced Micro Devices AMD, -3.94% Â Hexcel Corp. HXL, -3.06% Â Palo Alto Networks PANW, +1.20% Â Americold Realty Trust COLD, +2.39% Â Gilead Sciences Inc. GILD, +0.82% Â American Eagle Outfitters Inc. AEO, -0.97% Â Amgen Inc. AMGN, -1.41% Â UDR Inc. UDR, -0.75% Â Sarepta Therapeutics Inc. SRPT, -0.77% Â Source: Jefferies Equity Research Related:Expect â\u0080\u0098violently flatâ\u0080\u0099 markets, but be ready to buy the dip, analyst says"}]}