{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-sees-biggest-one-day-spike-in-cases-of-covid-19-as-health-experts-urge-caution-for-july-4-holiday-2020-07-02", "published": 1593700520.0, "headline": "Coronavirus update: U.S. sees biggest one-day spike in cases of COVID-19 as health experts urge caution for July 4 holiday", "body": "The U.S. recorded the highest number of new cases of the coronavirus illness COVID-19 in a single day at more than 50,000 on Wednesday, according to data provided by Johns Hopkins University, amid a surge in several states that were first to reopen and lift restrictions on movement. Cases have been climbing in 38 states in the last 14 days, a New York Times tracker shows, led by Idaho, Florida and Nevada. The virus is racing through Texas, Arizona and other states and at least seven are reporting new highs in hospitalizations and in the number of tests that are coming back positive. Public health experts are concerned that the pandemic is far from contained as the U.S. heads into the July 4 holiday weekend, which is typically celebrated with barbecues and fireworks displays. The U.S. Surgeon General and the Department of Health and Human Services issued a public service announcement early Thursday, urging Americans to follow the recommended actions of washing their hands frequently, socially distancing and wearing face masks in public when social-distancing is not possible. Read:Florida coronavirus cases surge 46% over the last week — but Gov. DeSantis says he won’t delay state’s reopening plans Health experts have been promoting that message for weeks now and Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, made an appeal directly to young people last week, urging them to recognize their societal obligation and stop gathering indoors in larger numbers while maskless. Fauci identified another major challenge in managing the crisis in an interview on CNN this week when he said the U.S. is unlikely to develop herd immunity to the illness, because of the expected combination of a vaccine being only partially effective and the large number of Americans who are unlikely to be vaccinated. Read also:New York, New Jersey and Connecticut want people coming from hot spots to quarantine — but how will they enforce it? “There is a general anti-science, anti-authority, anti-vaccine feeling among some people in this country — an alarmingly large percentage of people, relatively speaking,” he said. Face masks, meanwhile, have become increasingly politicized and critics have said President Donald Trump’s refusal to wear one is exacerbating the problem, as the Associated Press reported. “There’s a reason we keep coming back to these same public health messages – they are tried and true,” Surgeon General Jerome Adams said Thursday. “We all have a role to play in beating this virus and getting back to school, work, worship, play, and overall health.” Latest tallies There are now 10.76 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show, and at least 517,647 people have died. At least 5.5 million people have recovered. The U.S. continues to lead the world, with a case tally of 2.71 million and death toll of 128,421. Brazil is next with 1.45 million cases and 60,632 deaths. Russia is third measured by cases at 660,231, followed by India with 604,641 and the U.K. with 314,992. The U.K. has 43,991 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 84,825 cases and 4,641 fatalities. The health minister of New Zealand, David Clark, resigned after twice breaching lockdown rules and making other errors of judgement, the Guardian reported. Japan reported more than 100 new cases in Tokyo, boosting its confirmed case tally to 18,934. The World Health Organization said the Middle East is at a “critical threshold” in managing the crisis, Al Jazeera reported, as restrictions are lifted. More than 80% of deaths in the region come from just five countries, namely Egypt, Iran, Iraq, Pakistan and Saudi Arabia. What’s the economy saying? The U.S. added 4.8 million jobs in June and the unemployment rate fell for the second straight month to 11.1%, but the economy’s recuperation from the coronavirus might already be suffering a setback from a renewed surge in COVID-19 cases, as MarketWatch’s Jeffry Bartash reported. Millions of people have returned to work since the states began to reopen in May, signaling a recovery took root after what’s likely to turn out to be the deepest and shortest recession in American history. See:Marketwatch’s Coronavirus Economic Recovery Tracker Still, the economy has a long way to go to get back to normal, especially with the coronavirus coursing through the veins of major population arteries such as Los Angeles, Houston and Miami. Some states have reimposed restrictions and others plan to proceed more slowly on reopening because of the fresh viral outbreak. The survey used to compile the June employment report took place from June 7 to June 13 — before the latest wave of coronavirus cases erupted. The U.S. lost more than 22 million jobs during the height of the pandemic and only restored 7.5 million of them in the past two months. “The end of the lockdowns has allowed for a faster than expected recovery in jobs in the past two months, but more recent events and data suggest much tougher slogging ahead,” said Sal Guatieri, senior economist at BMO Capital Markets. Chuck Schumer, Senate Minority Leader and a New York Democrat, described the report as a “slight peak in a much larger valley,” and called on Trump to show leadership in fighting the health crisis and on Republicans to work with his party to help the jobless get fiscal relief. “President Trump must not repeat the same mistakes with this economic crisis that he made initially with COVID-19—ignoring it and brushing it aside now will only ensure that things will get worse once again,” Schumer said in a statement. Black Workers Face Slower Economic Recovery A separate report found initial jobless claims, a rough gauge of layoffs, dipped to 1.43 million in the seven days ended June 27 from 1.48 million in the prior week. The figures from the Labor Department are seasonally adjusted. Claims were at 1.57 million in the first week of June and 3.18 million in the first week of May. The U.S. trade deficit widened by 9.7% in May to $54.6 billion, the U.S. Census Bureau and Bureau of Economic Analysis said Thursday. Exports in May fell 4.4% to $144.5 billion, while imports declined 0.9% to $199.1 billion. Total exports are down 32% from May 2019, while imports are down 25%, as the coronavirus pandemic slows global trade.What are companies saying? Telsa Inc. stock TSLA, +1.89% continued its recent rally, after the electric car maker surprised the market with far better-than-expected second-quarter deliveries, its proxy for sales, even as its Fremont, Calif. plant was closed for much of the quarter because of the pandemic. Tesla delivered roughly 90,650 vehicles in the second quarter, ahead of the 72,000 deliveries that analysts surveyed by FactSet had been predicting. Tesla’s actual delivery count also came in comfortably above even the highest estimate tracked by FactSet, which was 86,000. “In our opinion, a 90,000 delivery number in this COVID lockdown environment is a jaw dropper and the bulls will run with this as a potential paradigm changer moving ahead,” Wedbush analyst Daniel Ives wrote after the delivery numbers came out, calling the numbers a “major home run.” His research indicates that China “appeared to be the star of the show” in the second quarter, though Tesla didn’t provide any regional breakdowns in its release. Other companies were putting their reopening plans on hold amid the spike in new cases. McDonald’s Corp. MCD, -0.43% paused the reopening of dine-in service and said it would wait at least three weeks before adding it to its current drive-through, takeout and delivery operations, the Wall Street Journal reported. Apple Inc. said it is temporarily closing another 30 stores because of new cases, bringing the total to 77. Here are the latest COVID-19 developments at companies: • Alaska Air Group Inc. ALK, +0.15% has secured $1.2 billion in private funding while a subsidiary, McGee Air Services, a ground services company that operates independently, has received $30 million in loans from the Payroll Support Program (PSP) under the Coronavirus Aid, Relief and Economic Security (CARES) Act. Alaska Airlines and Horizon Air have also received $992 million, including a $725 million grant and a $267 million loan, that companies can use exclusively for employee wages and benefits through September 30. Alaska Air’s private loan will be funded on or around July 2, with the company using 61 of its planes as collateral. Series A, a $966 million portion of the loan, will be repaid by Aug. 15, 2027, and the $208 million in Series B will be repaid by Aug. 15, 2025. • Citing a spike in the coronavirus pandemic, Apple Inc. AAPL, +1.74% has decided to temporarily re-close 30 of its retail stores in the U.S., bringing the nationwide total to 77. The stores affected are in Alabama, California, Florida, Georgia, Idaho, Louisiana, Mississippi, Nevada, Oklahoma, Texas, and Utah. “Due to current COVID-19 conditions in some of the communities we serve, we are temporarily closing stores in these areas,” an Apple spokesperson said in a statement. “We take this step with an abundance of caution as we closely monitor the situation and we look forward to having our teams and customers back as soon as possible.” • Centene Corp. CNC, -0.74% will create 6,000 new jobs and invest $1 billion in the Charlotte, North Carolina community over time, as the health care company builds a new East-Coast headquarters in the city. Construction of the new campus will begin in August. The first phase of construction is expected to be completed in the second half of 2022, and will accommodate about 3,000 employees. The next phase of construction will begin in 2024, and accommodate an additional 3,000 employees. Centene said it currently has nearly 600 employees in North Carolina. • FormFactor Inc. FORM, +5.78%, the chip maker testing and equipment company, said the pandemic did not hurt sales as expected. The company expects second-quarter revenue of between $157 million and $161 million. Analysts surveyed by FactSet expect quarterly revenue of $145.1 million, or a 9.8% sequential decrease. “Our original May 6th estimate that revenue in the second quarter would be approximately 10% lower than in our first quarter contemplated some level of Covid-19 disruption in our manufacturing operations and our suppliers’ logistics chains,” said Mike Slessor, chief executive of FormFactor, in a statement. “We experienced no major disruptions in either, and as a result, we expect to report revenue higher than what we had originally anticipated.” The company is scheduled to report earnings on July 29. • Forterra Inc. FRTA, -1.86%, the maker of water and drainage pipes, priced an upsized bond deal on Thursday, joining the many companies issuing debt during the pandemic. The Irving, Tx.-based company issued $500 million of senior secured notes that mature in 2025 at an interest rate of 6.50%. The original plan was to issue just $400 million of bonds. Proceeds will be used to repay part of the sum outstanding under a term loan facility. The company earlier this week issued guidance for the second quarter that was higher than expected. • Nu Skin Enterprises Inc. NUS, -0.01%, a maker of supplements and personal care products, expects second-quarter sales of $603 million to $608 million, above its previous forecast. That’s due to “strong global customer growth with particular strength in the Americas and Europe,” with online sales accounting for 80% of volume, Nu Skin said. The company had called for second-quarter sales between $520 million and $550 million previously. Nu Skin said it would report results and provide a full-year outlook on Aug. 5 after the bell. Analysts polled by FactSet expect Nu Skin to report adjusted earnings of 49 cents a share on sales of $541 million. • Tailored Brands Inc. US:TLRD subsidiary Men’s Wearhouse Inc. has not made interest payments due Wednesday of about $6.1 million on its 2022 senior notes, Tailored Brands said in a filing. Instead, the subsidiary and Tailored Brands have chosen to enter a 30-day grace period and could make the payment within that time frame, the company said. At the end of the grace period, a non-payment becomes an “event of default.” Tailored Brands did make interest payments on its credit facilities, it said. The company in early June said it had taken “decisive actions” to manage its liquidity and requested an extension to file quarterly results because of the “disruption” caused by the pandemic. Some 44% of its stores, which include Men’s Wearhouse and Jos. A. Bank, have reopened, it said. As of June 5, Tailored Brands had $201 million in cash and requested an extension to file quarterly results because of the “disruption” caused by the pandemic. • Walmart Inc. WMT, +1.00% is partnering with Robert De Niro-backed Tribeca Enterprises to temporarily turn 160 of its U.S. store parking lots into drive-in movie theaters as the pandemic spoils summer plans for many. The retail giant will have a combined 320 family-friendly showings beginning in early August and running through October. Walmart will help with concessions as it will “make it easy for families to fill their picnic baskets by ordering their drive-in essentials online for curbside pickup on the way to their movie.” There are an estimated 315 drive-in movie theaters in the U.S., down from a peak of about 4,000 in the late 1950s, according to driveinmovie.com."}]}