{"article": [{"url": "https://www.marketwatch.com/story/stock-market-anxiety-will-only-intensify-over-the-next-60-90-days-warns-expert-who-profited-in-1987-and-2008-crises-11600792377", "published": 1600778420.0, "headline": "Stock-market â\u0080\u0098anxiety will only intensify over the next 60-90 daysâ\u0080\u0099 warns expert who profited in 1987 and 2008 crises", "body": "Looking for calm in this suddenly turbulent market? Well, fat chance, warns, writes Alan B. Lancz, in his latest reflection on the state of the equity market. “ â\u0080\u0098Investor anxiety will onlyintensify over the next 60-90 days. It will likely build with uncertainty from U.S.-China relations, election chaos, delays in further relief/stimulus, and a second wave of COVID like parts of Europe are experiencing. â\u0080\u0098 ” â\u0080\u0094 Alan Lancz The contrarian money manager, who is a disciple of famed investor John Templeton, says that stocks arenâ\u0080\u0099t likely to see any substantial gains in the wake of their run-up since late March. The investor outlines the host of headwinds that he believes will create substantial friction against a more substantial rally in stocksâ\u0080\u0094and they are numerous and all represent the current wall of worry that investors will need to ascend to take stocks to greater heights. In his newsletter, published Monday, Lancz said that many investors have thrown caution to the wind, highlighting the fervor for initial public offerings like Snowflake, and said significantly more investor prudence will be required in the months ahead. â\u0080\u009cMitigating risk has become lost in the elation of a rising market, and yet should be a primary area of focus, at least through December,â\u0080\u009d he wrote. Lancz said that there is a risk this time that the litany of problems the market faces in this phase of its trade from its coronavirus-induced lows in March â\u0080\u0094 including a testy presidential race, which could see results delayed, rising cases of COVID-19 and a lack of traction on a fresh relief package to help out-of-work Americans â\u0080\u0094 could be too high a wall for investors to scale in the near-term. â\u0080\u009cAll these uncertainties will eventually dampen investor confidence, thus pressuring lofty valuations,â\u0080\u009d he said. Stocks were seeing choppy trade on Tuesday after the S&P 500 index on Monday narrowly avoided tumbling into correction territory, defined as a decline from a recent peak of at least 10%. Still, the S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% are both up by more than 45% since hitting their bear-market lows on March 23, while the Nasdaq Composite Index COMP, +1.39% is up 58% since that point, despite slipping into correction on Sept. 8. The question Lancz and other investors have posed persistently is what will be the driver for a further climb and will the bias to technology-related stocks, that are believed to be more resistant to the economic damage from this pandemic, begin to abate and fan out to other less-loved areas of the market. Against the uncertain backdrop, Lancz recommended building cash stores. Our â\u0080\u0098strategy would be to continue to build cash, especially with many of the value oriented more defensive companies no longer in buying range,â\u0080\u009d he wrote. The founder of the eponymous Toledo, Ohio-based investment advisory firm isnâ\u0080\u0099t the only one advocating for building up cash. Billionaire media mogulÂ Barry Diller,Â in a CNBC interview on Tuesday,Â urged investors to keep plenty of powder dry in light of just how far the stock market has come since bouncing off lows from earlier this year.Â Lancz, who forged a relationship with Templeton until theÂ investment guruâ\u0080\u0099s death in 2008, is a firm believer in the contrarian investing, finding value when others see battered assets. Back in 2007, he advised clients to sell before the market soured, and in 1987, he sidestepped the crash, a period in which the Dow saw a 22% drop in a single session. Earlier in the current public health crisis, back in late April, he pointed to Amazon.com AMZN, +3.01%, United Parcel Service Inc. UPS, +0.27%, Merck & Co. MRK, -0.14%, Cisco Systems CSCO, +0.15% and Abbott Laboratories ABT, +1.02% as companies he thought were good opportunistic purchases. Shares of Amazon have climbed 28% since late April, UPS shares have climbed 60%, but Merck shares have been mostly flat, while Ciscoâ\u0080\u0099s shares are down more than 8%."}]}