{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-gain-after-wall-street-caps-impressive-quarter-2020-07-01", "published": 1593563060.0, "headline": "Asian markets gain after Wall Street caps impressive quarter", "body": "TOKYO — Asian shares were mostly higher Wednesday after Wall Street capped its best quarter since 1998, shrugging off continued signs of global economic damage from the coronavirus pandemic. Japan’s Nikkei 225 NIK, -0.11% slipped 0.2% while Hong Kong’s Hang Seng index HSI, -0.30% gained 0.5%. The Shanghai Composite SHCOMP, +1.67% rose 0.9% and South Korea’s Kospi 180721, +0.21% advanced 0.9%. Benchmark indexes rose in Taiwan Y9999, +1.10% and Singapore STI, -0.39% , but stocks fell in Indonesia JAKIDX, +0.28% . Australia’s S&P/ASX 200 XJO, +0.00% gained 0.6%. Markets have continued gaining despite signs global economies are ailing seriously because of the outbreak, with uncertainty still the new normal as reported cases keep surging around the world while no cure or vaccine for COVID-19 is available. A quarterly Bank of Japan survey released Wednesday showed Japanese manufacturers’ sentiment plunged to its lowest level in more than a decade, as the pandemic crushes exports and tourism, mainstays for the world’s third largest economy. The headline measure for the “tankan,” tracking sentiment among large manufacturers, fell to minus 34, the lowest since 2009, from minus 8 the previous quarter. The tankan measures corporate sentiment by subtracting the number of companies saying business conditions are negative from those responding they are positive. A survey showed China’s manufacturing activity improved in June, adding to signs of a gradual recovery from the country’s deepest economic downturn since at least the mid-1960s. The monthly purchasing managers’ index issued by a business magazine, Caixin, rose to 51.2 from May’s 50.7 on a 100-point scale on which numbers above 50 indicate activity increasing. A sub-index for export orders rose to 47 from 41.7. The Chinese economy has been recovering but only slowly since global demand for exports is weak and consumers and businesses inside China are wary of further outbreaks and other risks from the pandemic. On Wall Street, the S&P 500 climbed 1.5%, bringing its gain for the quarter to nearly 20%. That rebound followed a 20% drop in the first three months of the year, the market’s worst quarter since the 2008 financial crisis. The plunge came as the pandemic brought the economy to a halt and millions of people lost their jobs. “It’s the first time you’ve had back-to-back (quarters) like this since the 1930s,” said Willie Delwiche, investment strategist at Baird. “It’s pretty unprecedented.” The whiplash that ripped through markets in the second quarter came as investors looked beyond dire unemployment numbers and became increasingly hopeful that the economy can pull out of its severe, sudden recession relatively quickly. Promises of massive amounts of aid from the Federal Reserve and Congress helped propel markets upward. Low interest rates generally push investors toward stocks and away from the low but less volatile returns from bonds, and the Federal Reserve has pinned short-term interest rates at a record low of nearly zero. The hopes looked prescient after reports during the quarter showed that employers resumed hiring again and retail sales rebounded as governments relaxed lockdown orders. But most of Wall Street says not to expect anything close to a repeat of the rocking second quarter. Rising infections have several states pausing their lifting of restrictions. The surge in confirmed new cases, which has prompted the European Union to bar U.S. travelers from entry, is seeding doubts that the economic recovery can happen as quickly as markets had forecast. That helps explain why the market’s momentum cooled somewhat in June. On Tuesday Dr. Anthony Fauci, the nation’s top infectious-disease expert, warned that the number of daily new reported infections could surge to 100,000 if Americans don’t start following public health recommendations. Beyond the coronavirus, analysts also point to the upcoming U.S. elections and other risks that could upset markets. If Democrats sweep Congress and the White House, which many investors see as at least possible, it could mean higher tax rates, which could weaken corporate profits. The S&P 500 SPX, +0.87% gained 47.05 points to 3,100.29 on Tuesday. The Dow Jones Industrial Average DJIA, +0.56% rose 0.9% to 25,812.88. The Nasdaq composite COMP, +1.39% climbed 1.9%, to 10,058.77. The quarter featured steady gains in technology stocks, which climbed 27.6%, second only to the consumer discretionary sector’s 30.2% gain. Airlines and cruise operators traded wildly after being battered for much of the first quarter. Benchmark U.S. crude US:CLQ20 lost 56 cents to $39.83 a barrel. It slid 43 cents to $39.27 a barrel on Tuesday, still nearly double where it was at the end of the first quarter. Brent crude UK:BRNQ20 fell 56 cents to $41.15 a barrel. The U.S. dollar USDJPY, -0.38% fell to 107.82 Japanese yen from 107.93 yen."}]}