{"article": [{"url": "https://www.marketwatch.com/story/small-businesses-grew-more-optimistic-in-june-nfib-says-but-new-coronavirus-outbreak-threatens-fresh-pain-2020-07-14", "published": 1594714280.0, "headline": "Small businesses grew more optimistic in June, NFIB says - but new coronavirus outbreak threatens fresh pain", "body": "The numbers: Optimism among small-business owners rose in June for the second straight month, a survey shows, but a fresh spike in coronavirus cases and tightening restrictions in states such as California and Texas could snuff out hopes for a faster economic recovery. The small-business optimism index climbed 5.2 points last month to 100.6, marking the highest level since February, the National Federation of Independent Business said Tuesday. The increase was well above Wall Street's forecast for a reading of 96. The surprisingly positive increase, however, didn't capture the sudden shift in sentiment toward the end of the month as a surge in coronavirus cases in states that reopened the earliest forced them to reimpose restrictions. Another closely followed survey by Homebase, for example, indicated a decline in employment or shifts worked in early July at restaurants, retailers and other Main Street businesses. While the Fourth of July holiday accounted for some of the decline, it couldn't explain all of it. On Monday, California ordered many small businesses to re-close in an effort to limit the latest outbreak. Read:Coronavirus spike in the dog days of summer saps economy of momentum What happened: Most small businesses expect sales to rise from historically depressed levels in late March and early April. \"Owners are anticipating improving sales as the economy continues to reopen,\" said the NFIB, the nation's largest advocacy group for small businesses. Employment levels were weak, however, and investment was still in recession. The latest closures in California also rattled Wall Street. The good news? Other large states where the coronavirus now appears in retrenchment are set to reopen a larger swath of their economies. New York, New Jersey and Pennsylvania are among them. Read:Soaring demand for federal jobless benefits points to fresh fissures in the economy Big picture: The early optimism that the economy might recover more rapidly from the pandemic than the more dire forecasts suggested has faded amid a fresh upsurge in COVID-19 cases. Small businesses are at the center of the maelstrom. Few have the resources or the profit margins of big companies to survive for lengthy periods without customers. The more that fail, the harder it will be for the economy to rebound. Until the coronavirus is brought under control, or treatments and/or a vaccine is identified, experts say, unemployment is likely to remain high and the economy will struggle to return to precrisis levels soon. Read: U.S. budget deficit soars to a record $864 billion in June on surge in coronavirus aid What they are saying?: \"Small businesses are navigating the various federal and state policies in order to reopen their business and they are doing their best to adjust their business decisions accordingly,\" said NFIB Chief Economist Bill Dunkelberg. \"We're starting to see positive signs of increased consumer spending, but there is still much work to be done to get back to precrisis levels.\" Market reaction: The Dow Jones Industrial Average DJIA, +0.56% ended nearly flat, and S&P 500 SPX, +0.87% and Nasdaq Composite Index COMP, +1.39%  finished sharply lower, reversing early gains on Monday after California's governor rolled back eased coronavirus restrictions."}]}