{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-edge-lower-shrugging-off-hurricane-lauras-landfall-2020-08-27", "published": 1598541980.0, "headline": "U.S. oil prices suffer first loss in 4 sessions as traders bet on quick output recovery from Gulf storm", "body": "Oil futures declined Thursday, putting an end to a three-session streak of gains in U.S. prices, as traders bet on a quick recovery for the energy market in the Gulf of Mexico region after one of strongest hurricanes in years made landfall near the heart of the U.S. refining industry. “Historically, hurricanes lead to widespread shut-ins, but production is immediately restored within a matter of days, therefore, leading to little long-term supply disruption,” said Manish Raj, chief financial officer at Velandera Energy. Hurricane Laura came ashore in the early hours Thursday, near the Texas-Louisiana border, as a Category 4 storm after achieving sustained winds of around 150 miles per hour. The National Hurricane Center said Laura has since weakened to a tropical storm as it moved further inland over Louisiana and Arkansas Thursday afternoon. The Interior Department’s Bureau of Safety and Environmental Enforcement on Thursday estimated that 84.3% of current oil production in the Gulf of Mexico was shut in, unchanged from a day earlier. It also said 60.1% natural-gas production was shut in Thursday, down from 60.9% a day earlier. Over 45% of total U.S. petroleum refining capacity is located along the Gulf Coast, according to the Energy Information Administration. Around 3 million barrels a day of U.S. refining capacity was closed or reduced, estimated JBC Energy, a Vienna-based consulting firm. “Gulf coast oil production facilities, refineries and energy infrastructure projects are designed to withstand harsh weather conditions like these,” Raj told MarketWatch. Given that, “there is no expectation of a widespread damage to facilities, other than temporary shut-ins.” Read:Hurricane Laura may do little to disturb relative calm in summer gasoline prices Also see:How the 2020 hurricane season could end up rivaling the worst on record West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 declined by 35 cents, or 0.8%, to settle at $43.04 a barrel on the New York Mercantile Exchange. October Brent crude UK:BRNV20, the global benchmark, declined 55 cents, or 1.2%, to $45.09 a barrel on ICE Futures Europe. The reaction in oil prices to the hurricane and to data on Wednesday that showed large drops in U.S. crude and gasoline inventories has been “remarkably cool,” said Eugen Weinberg, analyst at Commerzbank, in a note. The EIA reported on Wednesday a fifth straight weekly decline in U.S. crude inventories, down 4.7 million barrels for the week ended Aug. 21. Gasoline supplies saw a weekly decline of 4.6 million barrels. On Nymex, front-month September gasoline US:RBU20 fell 5.6% at $1.2845 a gallon, while September heating oil US:HOU20 declined by 2.7% at $1.2107 a gallon. “In normal times, hurricanes would cause substantial, albeit temporary, disruption of refinery operations, gasoline distribution and local shortages, given the concentration of U.S. refineries in the Gulf Coast,” said Raj. “However, since U.S. refineries are currently operating well below their designed utilization, there is sufficient refining capacity outside of the Gulf Coast to contain a widespread supply disruption.” Still, potential knock-on effects, including flooding that damages equipment, can hinder the recovery, JBC analysts wrote. Overall, they expect to see a further weakening of Gulf of Mexico crude prices relative to the cash price for WTI in Houston, a process that is already under way, according to media reports. Product stocks, however, may fall in the near term, which could provide support for refining margins, the JBC analysts said. Weinberg noted that the price reaction to the hurricane has been more pronounced in the natural-gas market, even though only 5% of U.S. production is located in the region. Natural-gas prices have been lifted because storms have hampered exports of liquefied natural gas, which has also contributed to a rise in European prices for the fuel, Weinberg said. On Thursday, natural-gas futures were a standout, ending at the highest since November after the EIA reported that domestic supplies of natural gas rose by 45 billion cubic feet for the week ended Aug. 21. The increase matched the average forecast by analysts polled by S&P Global Platts. On the contract’s expiration day, September natural gas US:NGU20 settled at $2.579 per million British thermal units, up 12 cents, or 4.8%. That was the highest finish for a front-month contract since November 2019, according to Dow Jones Market Data. The new front-month contract, October natural gas US:NGV20 added 14 cents, or 5.3%, to end at $2.71."}]}