{"article": [{"url": "https://www.marketwatch.com/story/england-to-ban-gatherings-of-more-than-6-people-as-coronavirus-cases-spike-2020-09-08", "published": 1599590960.0, "headline": "England to ban gatherings of more than 6 people as coronavirus cases spike", "body": "LONDON — Britain’s government is banning gatherings of more than six people in England, as officials try to keep a lid on daily new coronavirus infections after a sharp spike across the U.K. that has been largely blamed on party-going young adults disregarding social distancing rules. Downing Street said urgent action was needed after the number of daily laboratory-confirmed positive cases hit nearly 3,000 on Sunday. The figure dipped Tuesday to 2,460. Officials said that starting Monday, the legal limit on all social gatherings in England will be reduced from the current 30 people to six. The new law applies both indoors and outdoors, including private homes, restaurants and parks. Failure to comply could result in a 100-pound ($130) fine. Weddings, school, funerals and organized team sports are exempt, and larger gatherings will also be allowed if the household or “support bubble” is larger than six. Government ministers and scientists took to the airways to urge Britons not to let down their guard. “We’ve been able to relax a bit over the summer ... but these latest figures really show us that much as people might like to say ‘Oh well, it’s gone away’ — this hasn’t gone away,” said Dr. Jonathan Van-Tam, the government’s deputy chief medical officer. He said while the rise in infections is “much more marked” among people between 17 and 21, he was concerned about a “more general and creeping geographic trend” across the U.K. “People have relaxed too much,” he said. “Now is the time for us to re-engage and realize that this is a continuing threat.” The U.K. has Europe’s worst death toll from the virus, with nearly 41,600 deaths within 28 days of testing positive. The actual toll is believed to be far higher as the government tally does not include those who died without having been tested. The spike in U.K. cases follows big daily case increases in Spain and France, both of whom have seen rising numbers of COVID-19 patients being hospitalized. Spain saw an average of 8,800 new cases a day over the weekend, and France has been recording over 5,000 a day. The worry is that the U.K. will also start seeing increases in virus patients being hospitalized and dying. “While young people are less likely to die from this disease, be in no doubt that they are still at risk,” Health Secretary Matt Hancock told lawmakers, adding that six months after getting infected, some previously fit people are still laid low by chronic fatigue, muscle pain and breathing difficulties. Prime Minister Boris Johnson’s Conservative government has faced strong criticism for its mixed messages since it started easing the coronavirus lockdown in late spring. It spent much of the summer encouraging people to eat out to help the hard-pressed hospitality sector and is now urging workers to return to their offices to help hard-hit businesses in city centers. John Edmunds, an epidemiologist at the London School of Hygiene & Tropical Medicine, said cases are rising, though “not spectacularly,” but he’s worried about what will happen following the reopening of schools and universities. “There are big movements afoot in the country and these will inevitably accelerate transmission,” he told Sky News. “I’m not sure we have to go back to work when we can work from home.” The government has also been criticized for testing problems, prompting an apology from Sarah-Jane Marsh, director for the National Health Service’s Test and Trace program. “All of our testing sites have capacity, which is why they don’t look overcrowded. It’s our laboratory processing that is the critical pinch point,” she said. “We are doing all we can to expand quickly.” “The testing team work on this 18 hours a day, seven days a week,” she said. Still, the U.K. is testing tens of thousands more people than it did in the early months of the pandemic. On Monday, it processed around 175,000 tests. A local lockdown, meanwhile, went into effect Tuesday in the Welsh district of Caerphilly. Under the new restrictions, people there will not be allowed to enter or leave the area without a reasonable excuse, everyone over 11 must wear masks in shops and indoor meetings between different households are banned. Hancock also announced new lockdown restrictions for Bolton, a city in northwest England that has the highest number of per capita coronavirus cases in the U.K. Most new cases there involve people between 18 and 49. Among the restrictions, Hancock said restaurants, cafes and pubs in Bolton now can only offer takeaway services."}]}