{"article": [{"url": "https://www.marketwatch.com/story/trees-dont-grow-to-the-sky-tech-stocks-cant-outperform-forever-bca-research-argues-11598284766", "published": 1598270840.0, "headline": "Trees donâ\u0080\u0099t grow to the sky:  tech stocks canâ\u0080\u0099t outperform forever, BCA Research argues", "body": "Tall tree in the spring iStockphoto Are tech stocks in a bubble? Itâ\u0080\u0099s a question that markets observers pose frequently, in part because the good times just keep rolling on for stocks like Amazon.com Inc. AMZN, +3.01%, Apple Inc., AAPL, +1.74% Facebook FB, +0.26%, and Netflix NFLX, +1.43%, and perhaps in part because overvalued tech stocks bursting in spectacular fashion is a script weâ\u0080\u0099ve seen in not-too-distant memory. BCA Research tackled that question several times over the summer. â\u0080\u009cWe believe that tech stocks are in a bubble,â\u0080\u009d wrote Mathieu Savary, in its signature piece known as the Bank Credit Analyst, â\u0080\u009cand the mania will expand further as long as inflation remains low and monetary conditions stay accommodative, despite occasional pullbacks. Moreover, the broad market will suffer when the bubble eventually bursts.â\u0080\u009d In a more focused note out August 21, BCA Chief Global Strategist Peter Berezin lays out several reasons why he thinks techâ\u0080\u0099s outperformance canâ\u0080\u0099t last. Among them are some technical factors. For example, value, not growth, stocks generally do better when the U.S. dollar is weakening, as it is likely to continue to do for some time. In contrast, tech stocks tend to outperform when inflation and interest rates are falling, a condition Berezin argues isnâ\u0080\u0099t likely to continue. But mostly, Berezin points out that in markets, everything eventually reverts to the mean. The tech sector has benefited from bricks-and-mortar stores being closed down during the coronavirus pandemic â\u0080\u0093 and people reluctant to visit them, once reopened. Berezin cites an estimate from Bank of America that suggests the US e-commerce penetration rate more than doubled over the past year, from 16% to 33%, â\u0080\u009crepresenting more than ten years of growth in only a few months.â\u0080\u009d Related: Coronavirus was the perfect storm for tech innovation, and this fund manager made out E-commerce will grab even more market share from here, he writes. But as lockdown measures ease, there will be a bounceback for in-person shopping. â\u0080\u009cThis could produce a temporary air pocket in sales for online sellers, a risk that does not seem to be fully discounted.â\u0080\u009d Whatâ\u0080\u0099s more, as the old saying goes, trees donâ\u0080\u0099t grow to the sky. Put another way, as Berezin does, â\u0080\u009cmany marquee tech companies have become so big that further gains in market share may be difficult to achieve.â\u0080\u009d Nearly three-quarters of American households have an Amazon Prime account, he says, and slightly over half have a Netflix account. Globally, Netflix subscriptions jumped 27% year over year in the second quarter as people stayed home. That juiced second-quarter results, but, as Berezin puts it, â\u0080\u009cIf someone did not bother to purchase a Netflix subscription in March or April, how likely is it that they will subscribe for the first time in September?â\u0080\u009d Stocks in the Nasdaq-100 have had annualized earnings per share growth of 16% since 2010, 2.5 times the pace of the S&P 500 index and 3.2 times faster than the non-IT stocks of the S&P 500, Berezin writes. Looking ahead, analysts project earnings growth of 27% for the S&P 500 in 2021, verus 20% for the Nasdaq. But that also would reflect the â\u0080\u009ccollapseâ\u0080\u009d in most non-tech stocks during the pandemic, Berezin admits. Is a 27% gain from a low base really that much better than a 20% gain in a tried-and-true growth stock? Time will tell. Berezin ends his analysis by noting that â\u0080\u009chistory is littered with tech companies that failed to keep up with a changing world: RCA, Kodak, Polaroid, Atari,â\u0080\u009d and many more. But itâ\u0080\u0099s worth noting that many of the current crop of tech giants have adapted, and dominated, through multiple market and technological cycles. Â Read next: These 2 stocks dominated S&P 500 returns in 2019 â\u0080\u0094 and the decade"}]}