{"article": [{"url": "https://www.marketwatch.com/story/these-5-giant-stocks-are-driving-the-us-market-now-but-bigger-is-not-always-better-2020-06-26", "published": 1593275120.0, "headline": "These 5 giant stocks are driving the U.S. market now, but watch out down the road", "body": "A story now making the rounds on Wall Street holds that the five biggest stocks represent an unprecedented share of the total U.S. market, bigger even than at the top of the internet bubble in 2000 — and we all know how that turned out. If you’re worried about such a top-heavy market — don’t. The current market share of the five largest stocks is actually below the market’s long-term average. Those five biggest stocks by market capitalization currently are Microsoft MSFT, +2.48% , Apple AAPL, +1.74% , Alphabet GOOGL, +1.82% , Amazon.com AMZN, +3.01% , and Facebook FB, +0.26% . The problem with comparing this market to the internet boom is that the argument doesn’t go back far enough. While the largest five stocks now represent a greater share of the total market than at any time over the past two decades, that share is far lower than what was seen in prior decades. The data come from Dimensional Fund Advisors, and are plotted in the chart below. Since 1927, the share of the total stock market represented by the five largest stocks has averaged 17%, which means the latest value is slightly below the long-term average. As the firm notes, “the fact that a small subset of companies’ stocks account for an outsized portion of the stock market is not new…. [It] is not a new normal; it is old normal.” To be sure, just because what we’re seeing now is not unprecedented doesn’t mean it’s a sign of market health. To find out, I input into my PC’s statistical program the data in the accompanying chart, along with the S&P 500’s SPX, +0.87% inflation-adjusted total return. I was searching for any correlations between the five largest companies’ share of market cap and the market’s return over the subsequent 1-, 5- and 10-year periods. I came up empty. That means we can draw no conclusions about the stock market’s likely future return from the share of the market invested in the five largest stocks. To be sure, I would have reached a different conclusion if I had focused solely on data since the 1990s. But that just illustrates, yet again, the need to look at as much historical data as possible when trying to draw inferences for the future.Losing steam Unfortunately, we can’t be as optimistic about the performance prospects for the largest companies themselves. The DFA study found that after becoming one of the 10 largest companies, their stocks on average lag the market over the five- and 10 years. The data are summarized below: Return relative to overall market (annualized) Over 1 year after becoming one of the 10 largest stocks +0.7% Over 5 years after becoming one of the 10 largest stocks -1.1% Over ten years after becoming one of the 10 largest stocks -1.5% The implication of both results is that, over the next decade, other stocks are likely to replace the current top five. This is the “creative destruction” that is the hallmark of capitalism. Just ask shareholders of General Electric GE, +2.85% ; it was the largest stock in the S&P 500 for five of the first six years of this century. Over the past four years, the stock has lost 77% of its value, and is now the 65th largest company in the S&P 500. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More: The Fed Model is almost always bullish, which makes it a perfect face for this too-good-to-be-true stock market Plus: A lot of bad news is converging on the stock market — here’s how to deal with it"}]}