{"article": [{"url": "https://www.marketwatch.com/story/asian-markets-muted-as-traders-warily-await-us-stimulus-deal-2020-08-13", "published": 1597363340.0, "headline": "Asian markets muted as traders warily await U.S. stimulus deal", "body": "Asian markets were little changed in early trading Friday, after stocks fell on Wall Street as the stalemate over a second coronavirus-aid plan continued to fester on Capitol Hill. Japan’s Nikkei 225 NIK, -0.11% was nearly flay, while Hong Hong’s Hang Seng Index HSI, -0.30% slipped 0.2%. The Shanghai Composite SHCOMP, +1.67% fell 0.2% and the Shenzhen Composite 399106, +3.09% dipped 0.1%. South Korea’s Kospi 180721, +0.21% sank 1.4% while benchmark indexes in Taiwan Y9999, +1.10% , Singapore STI, -0.39% , Malaysia FBMKLCI, +0.71% and Indonesia JAKIDX, +0.28% were mixed. Australia’s S&P/ASX 200 XJO, +0.00% advanced 0.7%. Sony 6758, +0.38% gained in Tokyo trading while SoftBank 9984, -1.24% sank, while in Hong Kong, Wharf Real Estate 1997, -1.93% rose as HSBC 5, +0.15% and PetroChina 857, fell. Samsung 005930, -0.33% declined in Seoul trading. Asian stocks were muted as U.S. lawmakers’ “political grandstanding delay is posing some risk for the global recovery,” wrote Stephen Innes, chief global markets strategist at AxiCorp, in a note. “Still, there is no chance of this deal not going through ... and one thing investors feel confident about is that they like stocks higher, so look for dips to be bought on the expectation of the deal eventually going through.” House Speaker Nancy Pelosi said Thursday the two sides remain “miles apart” in the stimulus talks, and Senate Majority Leader Mitch McConnell officially sent senators home for a three-week summer recess, though they may be recalled if there is a breakthrough to vote on. U.S. stocks finished lower in listless trading. The Dow Jones Industrial Average DJIA, +0.56% fell 80.12 points, or 0.3%, to close at 27,896.72, while the S&P 500 SPX, +0.87% lost 6.92 points, or 0.2%, to close at 3,373.43, after hitting an intraday peak at 3,387.24 to momentarily breach its Feb. 19 closing record at 3,386.15. The Nasdaq Composite COMP, +1.39% rose 30.27 points, or 0.3%, higher to close at 11,042.50."}]}