{"article": [{"url": "https://www.marketwatch.com/story/trumps-executive-orders-would-boost-the-stock-market-2020-08-10", "published": 1597136600.0, "headline": "Trumpâ\u0080\u0099s payroll-tax executive order could boost the stock market", "body": "After Republicans and Democrats reached a stalemate in Congress, President Trump issued an executive order from his golf club in New Jersey and signed other memorandums. The executive order called for a payroll-tax deferral. The payroll tax pays for Social Security and Medicare. This column is not intended to be a comprehensive analysis but is limited to the impact of the deferral on the stock market. Trumpâ\u0080\u0099s order, if implemented (amid questions over both its legality and its efficacy, with one Republican senator labeling it â\u0080\u009cunconstitutional slopâ\u0080\u009d), would spike the stock market. Small amounts but big impact Here are the reasons why additional amounts in small accounts from Trumpâ\u0080\u0099s payroll-tax deferral would have a disproportionately large effect. â\u0080¢ The total amount over tens of millions of accounts adds up. â\u0080¢ It lifts stock-market sentiment. â\u0080¢ So far the data show that newer investors with small accounts tend to be superaggressive. Many place market orders, not limit orders. This has a disproportionate effect in running up the stock market. â\u0080¢ This stock market is controlled by the momo (momentum) crowd. The momo crowd keeps on buying not because the economy is good but because the stock market is going up. The momo fire is raging. Think of providing additional money to millions who will put it in the stock market as pouring gasoline over the fire. What does it all mean? There is a high probability of the stock-market bubble getting bigger. Please see the chart referenced in â\u0080\u009cThe stock market is in a bubble â\u0080\u0094 but the bubble is likely to get bigger.â\u0080\u009d Investors should consider positioning themselves to make money from the stock-market bubble getting bigger while protecting themselves. Opportunities to make money while controlling risks abound. Disclosure: Arora Report portfolios have positions in Apple, Amazon, Alphabet, Microsoft and Facebook. Nigam Arora is the founder of The Arora Report, which publishes four newsletters. He can be reached at Nigam@TheAroraReport.com."}]}