{"article": [{"url": "https://www.marketwatch.com/story/lincoln-project-is-needling-trump-the-way-he-needled-hillary-over-her-emails-2020-06-22", "published": 1593247100.0, "headline": "Lincoln Project is needling Trump the way he needled Hillary over her emails", "body": "For Americans who see Donald Trump’s presidency as a threat to the U.S. constitutional system, it is not surprising that they are worried 2020 will end up being a replay of 2016. Then, as now, Trump trailed in the polls. Then, as now, Trump made shocking statement after shocking statement, and it seemed absurd to believe enough Americans could vote for such a dangerous, unqualified, temperamentally unfit man to be president of the United States. And yet he won. Can Trump again defy the odds and win in November? It’s certainly possible, but there are a few differences this time. In 2016, Trump was able to control the campaign narrative by succeeding in getting the media to cover and describe the election in his preferred terms. Voters heard — ad nauseam — about Hillary Clinton’s emails. In fact, Gallup interviews found that “email dominate[d] what Americans…heard about Clinton.” Research showed that “the various Clinton-related email scandals accounted for more sentences [in mainstream news coverage] than all of Trump’s scandals combined.” Referendum on Trump In 2020, Trump is finding it harder to control the narrative, and the November election is shaping up as a referendum on him. He is now the incumbent, rather than a former reality TV star with an image (not based in reality) as a successful business tycoon. Moreover, the U.S. is dealing with multiple crises that dominate the headlines — coronavirus, the related economic downturn, and mass protests related to police killings of black Americans. Trump’s preferred narrative so far isn’t breaking through. He doesn’t have a way now to shape media coverage to his liking. Trump’s campaign rallies have been on hold for months, and when he was able to hold one this past weekend in Tulsa, Okla., he was unable to fill a 19,000 seat arena. Chris Wallace of Fox News observed that media coverage of the Tulsa rally was “show[ing] big empty areas” and that the Trump campaign’s deflections about the disappointing turnout “makes [the campaign] look silly when [they] deny the reality of what happened”. Small crowd sizes are not an indicator that a candidate will lose, but it’s clear that Trump’s packed 2016 rallies helped energize him and gained outsized media coverage. In 2020 Trump is still getting plenty of media coverage, of course, but this time it may be undermining his candidacy. Trump is no longer seen as a non-ideological, relatively moderate Republican, and Joe Biden is polling better in 2020 than Clinton ever did in 2016. It may be that Americans have simply tired of Trump’s divisive, bullying, boorish shtick. Republicans strike back There’s at least one more thing that’s different about 2020: the Lincoln Project, a super PAC run by current and former Republican and conservative political strategists, including former advisers to Republican presidents and presidential campaigns. The Lincoln Project is putting out “devastating” ads that are “produced with lightning speed” to “catch the public debate at just the right moment…hammer[ing] Trump where he is personally most vulnerable”. It’s clear they are getting under Trump’s skin; Keith Edwards of the Lincoln Project boasts that the group “lives in Donald Trump’s head rent free”. iframe.twitter-tweet { width: 100% !important; } It’s fair to raise questions about some of the Lincoln Project’s tactics (though the same standard must be applied to Trump’s own attacks against Biden), and it’s hard to know whether the group’s strategy is working, or even how to gauge its effectiveness. But there are at least two indications that the Lincoln Project may be having an impact. First, their ads are getting attention and coverage from major media outlets, helping to shape the campaign narrative (in part because of Trump’s responses to the ads, including in late night tweetstorms). Second, if Trump is using valuable time, energy and money responding to the Lincoln Project’s ads, then he is waging the campaign on his opponents’ terms, not his. Clearly, it seems that nothing Trump does will shake his support from Republicans in Congress. But the Lincoln Project’s effort shows that some on the political right recognize the danger Trump poses to U.S. democracy. Scholarly research shows that one of the best ways to defend democracy is for political elites to cross party lines and campaign against authoritarians from their own party. One of the failures in 2016 was that most Republicans fell in line behind Trump’s candidacy — and now, his presidency. The people behind the Lincoln Project have found a way to exploit two of Trump’s most notorious vulnerabilities: a short attention span and thin skin. So while the election is still several months away, committed Trump adversaries like the Lincoln Project are making it clear that it’s going to be harder for Trump, who wallows in nostalgia, to get that old 2016 feeling back. Chris Edelson is an assistant professor of government in American University’s School of Public Affairs. He has written two books on presidential power, and recently wrote a book chapter describing the problem of constitutional failure in the United States. Read: Rather than jump-start reelection campaign, Tulsa rally highlights Trump’s vulnerabilities More: History suggests Trump is heading for a fall in November"}]}