{"article": [{"url": "https://www.marketwatch.com/story/odds-are-as-high-as-35-that-next-coronavirus-aid-package-wont-become-reality-until-september-analyst-says-2020-08-03", "published": 1596472580.0, "headline": "Odds are â\u0080\u0098as high as 35%â\u0080\u0099 that next coronavirus aid package wonâ\u0080\u0099t become reality until September, analyst says", "body": "As Democrats and Republicans continue their negotiations over another big coronavirus financial-aid package, one analyst is cautioning that the next bill may not come together until next month. â\u0080\u009cThings are progressing to the point where we feel comfortable maintaining our 75% odds that this bill will be wrapped up in August, but there are at least 25% odds that negotiations stall out and start again in September,â\u0080\u009d said Henrietta Treyz, director of economic policy research at Veda Partners, in a note on Sunday. â\u0080\u009cIf pressed (and we have been by increasingly anxious investors), weâ\u0080\u0099d be willing to place as high as 35% odds on the bill slipping into September.â\u0080\u009d She noted ongoing differences between Democrats and the GOP, as well as frictions between the White House and Republican lawmakers. Republican priorities for the next measure include coronavirus-related liability protections for businesses, while Democrats have been pushing for additional aid for state and local governments, as well as an extension for a $600 enhanced unemployment benefit. Related:Hereâ\u0080\u0099s where things stand on the extra $600 a week in unemployment benefits that expired on Friday Analysts have been predicting that the new relief package is likely to become reality in August â\u0080\u0094 possibly next week. â\u0080\u009cWe continue to expect that Congress will pass a bill, but chances are growing that it will not reach a deal with the White House until next week,â\u0080\u009d said KBW analyst Brian Gardner in a Monday note. U.S. stocks SPX, +0.87% Â DJIA, +0.56% Â closed higher Monday as investors tracked the talks over the next stimulus measure, while also digesting better-than-expected readings on manufacturing. Related:First week of coronavirus aid talks in Congress make no progress Senate Minority Leader Chuck Schumer, the New York Democrat, said he and House Speaker Nancy Pelosi, the California Democrat, met for two-and-a-half hours on Monday afternoon with Treasury Secretary Steven Mnuchin and the Trump White Houseâ\u0080\u0099s chief of staff, Mark Meadows. â\u0080\u009cWe had a productive meeting,â\u0080\u009d said Schumer in a speech on the Senate floor. â\u0080\u009cWe narrowed some differences. Frankly, there are many that remain.â\u0080\u009d Mnuchin told reporters that the group had made \"a little bit of progress.â\u0080\u009d"}]}