{"article": [{"url": "https://www.marketwatch.com/story/initial-data-from-a-pair-of-clinical-trials-may-revive-interest-in-arthritis-drugs-as-covid-19-treatments-2020-09-18", "published": 1600673900.0, "headline": "Initial data from a pair of clinical trials may revive interest in arthritis drugs as COVID-19 treatments", "body": "There is some renewed hope for rheumatoid arthritis drugs, like Eli Lilly & Co.’s and Incyte Corp.’s Olumiant and Roche Holding AG’s Actemra, as possible COVID-19 treatments after a series of clinical setbacks this summer seemed to close the door on the category’s potential. Lilly’s LLY, +2.20% stock was up 1.1%, shares of Incyte INCY, +3.19% were down 4.2%, and Roche’s ROG, +1.80% stock had gained 1.8% in trading on Friday afternoon. “The industry has done what it should, to really test those [hypotheses],” said Patrik Jonsson, president of Lilly Bio-Medicines. “You never know what the outcome will be...I think that will probably continue to be the progress made and also sometimes disappointment.” Lilly and Incyte said Monday that giving Olumiant to hospitalized COVID-19 patients in combination with Gilead Sciences Inc.’s GILD, +0.82% remdesivir helped them recover faster. The Food and Drug Administration in May granted an emergency use authorization to remdesivir as a treatment for COVID-19 during the pandemic. Then, on Friday, Roche said a late-stage trial that primarily enrolled people of color found that hospitalized COVID-19 patients who took Actemra were less likely to go on ventilators than those receiving placebo — an intriguing finding given that Black and Hispanic Americans are disproportionately more likely to contract and die from COVID-19. “We wanted to start a clinical trial with Actemra because it was being investigated in a general population for the treatment of COVID-19 pneumonia,” said Dr. Jamie Freedman, head of U.S. medical affairs for Roche’s Genentech business. “We decided we should [enroll a] trial with African-Americans and other minority patients.” The interest in testing rheumatoid arthritis drugs as COVID-19 treatments began back in February, when The Lancet published a list of already approved drugs that could benefit COVID-19 patients, including Olumiant. In March, researchers in China shared findings from a single-arm study that tested Actemra as a treatment for 21 severely ill COVID-19 patients. One of the non-arthritis indications for Actemra is for cytokine release syndrome in leukemia patients undergoing gene therapy. Cytokine release is a type of an immune response seen in some severely ill COVID-19 patients. Given the lack of proven treatment options during the pandemic, doctors began to prescribe Actemra to their COVID-19 patients “extensively off-label,” Freedman said. All of these factors set off a flurry of global trials, initiated by the drug makers, governments, and public health bodies, evaluating Actemra, Kevzara, and Olumiant as coronavirus therapies. But then this summer, Actemra and Kevzara, another FDA-approved rheumatoid arthritis treatment, both failed Phase 3 clinical trials testing the therapies in severely ill COVID-19 patients. Roche said in July that there was no difference in the number of patients who died by week four among those taking Actemra or placebo, while Sanofi SNY, +0.89% and Regeneron Pharmaceuticals Inc. REGN, +0.36%, which market Kevzara, said Sept. 1 they would no longer pursue coronavirus-related clinical development for the drug. The snapshot of data that Lilly released this week about Olumiant is the first finding that the company has released about using the drug as a treatment for COVID-19 treatment. This data may also indicate that rheumatoid arthritis drugs like Olumiant and Actemra, which are also being tested with remdesivr, with data expected to be shared sometime this year, may work better in combination than as standalone therapies for COVID-19 patients. Olumiant “could serve as an important additional treatment option as the medical community continues to learn how to best manage patients hospitalized with COVID-19,” Mizuho Group’s Vamil Divan told investors in a Sept. 14 note. Lilly and Roche separately said they both expect to publish this week’s findings in peer-reviewed medical journals. So far this year, Lilly’s stock has rallied 16.6%, shares of Incyte are down 1.4%, and Roche’s stock is up 16.4%. The S&P 500 x SPX, +0.87% is up 3.9% year-to-date."}]}