{"article": [{"url": "https://www.marketwatch.com/story/new-york-will-continue-mandatory-quarantines-despite-cdcs-changing-guidance-2020-08-26", "published": 1598455820.0, "headline": "New York will continue mandatory quarantines despite CDCâ\u0080\u0099s changing guidance", "body": "New York state, along with New Jersey and Connecticut, will continue to require travelers coming from areas with â\u0080\u009csignificant community spreadâ\u0080\u009d of COVID-19 to quarantine, a departure from guidance issued Monday by the Centers for Disease Control and Prevention (CDC). Until last week, the CDC had also been recommending a two-week quarantine for those traveling between states or from overseas, but guidelines updated Monday no longer include that recommendation.Â â\u0080\u009cWeâ\u0080\u0099re not going to follow the CDC guidance,â\u0080\u009d Gov. Andrew Cuomo said during a conference call with reporters on Wednesday. â\u0080\u009cIt is the exact opposite of what the CDC has been saying.â\u0080\u009d The governor urged New Yorkers to follow state guidance on quarantine. The CDC website indicates travelers should â\u0080\u009cfollow state, territorial, tribal and local recommendations or requirements after travel.â\u0080\u009d The updated guidelines also added new recommendations as to who should be tested. People who may have been exposed to the virus but have not shown symptoms no longer need a test, according to the CDC website. The governor said the health organization had â\u0080\u009creversed its guidanceâ\u0080\u009d on this issue, as well.Â â\u0080\u009cIâ\u0080\u0099ve spoken to health experts from around the globe,â\u0080\u009d Cuomo explained. â\u0080\u009cNone of them will say that this makes any sense from a health point of view.â\u0080\u009d See: Health experts express alarm at CDC change in testing guidelines that exclude asymptomatic patients Cuomo also announced that the infection rate in New York state was under 1% for the 19th day in a row. It was 0.79% on Tuesday, bringing the total number of reported cases up to 431,340. Three people died on Tuesday from the virus.Â"}]}