{"article": [{"url": "https://www.marketwatch.com/story/why-theres-so-much-drama-about-when-to-claim-social-security-2020-06-25", "published": 1593083360.0, "headline": "Why thereâ\u0080\u0099s so much drama about when to claim Social Security", "body": "No wonder thereâ\u0080\u0099s such wide disagreement about the optimal age at which to begin receiving Social Security. Seemingly trivial differences in how you ask the question lead to dramatically different responses. You get one answer if you frame the issue in terms of how long soon-to-be retirees must live before they make up the income they lose by not claiming their Social Security benefits at age 62. And you get quite another if you frame the issue in terms of how much less their monthly payment will be if they start receiving benefits before reaching the maximum retirement age of 70. These two ways of framing the issue are just the flip sides of the same coin, of course, so if we were entirely rational economic actors, as economists like to assume, our answers would be the same regardless of how the question is phrased. But, needless to say, weâ\u0080\u0099re not entirely rational. Welcome to the growing field in behavioral economics known as â\u0080\u009cchoice architecture.â\u0080\u009d It focuses on the impact on our choices of the different ways in which those choices are framed. One economist who has extensively studied choice architecture is Dan Ariely, a professor of psychology and behavioral economics at Duke University. He goes so far as to argue that our decisions are often made for us, since how choices are framed can have a bigger impact on our answers than the thought process we go through in coming up with those answers. (Click here for one of Arielyâ\u0080\u0099s TED talks on the subject.) So while we think we are objectively analyzing the pros and cons of the choices weâ\u0080\u0099re given, we in fact are being unconsciously led toward one choice or another simply because of how those choices are framed. The impact of choice architecture on the Social Security claiming decision was studied several years ago by Jeffrey Brown (Dean of the College of Business at the University of Illinois at Urbana-Champaign and director of the Retirement Research Center of the National Bureau of Economic Research), Arie Kapteyn (a professor of economics at the University of Southern California), and Olivia Mitchell (who holds two professorships at the Wharton School of the University of Pennsylvania: Business Economics and Public Policy, and Insurance and Risk Management). To understand their findings, itâ\u0080\u0099s worth remembering that the Social Security Administration (SSA) has set the magnitude of Social Security benefits to be actuarially equivalent no matter when you decide to begin receiving benefits. If you claim your benefits at age 62, the first year in which youâ\u0080\u0099re eligible, you will receive payments over a longer period of time but at a reduced rate. If you instead claim at age 70, the age by which you must begin receiving benefits, your monthly payments will be commensurately higher. The net effect is that, if you live as long as what is shown in the SSAâ\u0080\u0099s actuarial tables to be your life expectancy, the inflation-adjusted value of your lifetime benefits will be more or less the same regardless of when you start claiming benefits. That means thereâ\u0080\u0099s a limit to how much benefit you get from slicing and dicing the numbers. For their study, the professors surveyed several thousand soon-to-be retirees about the age at which they intended to claim their Social Security benefits, altering slightly the way the question was asked. Those slightly differences had a huge impact. Consider two of the ways in which the professors posed the survey question: â\u0080¢ The first started by reporting how much the monthly benefit would be if the respondent chose to begin receiving benefits at age 62. It then reported the impact of delaying this claiming decision, indicating how many years he would need to live before receiving the same lifetime Social Security benefits he otherwise have received by not delaying. â\u0080\u0094 Specifically, this first way of posing the question read: â\u0080\u009cIf you delay claiming, your monthly benefit will increase. For example, if you claim your benefits at age 63 (one year later), your benefit will increase by $103 per monthâ\u0080¦ However, by delaying your benefit by one year, you will forfeit the $18,588 that you would have received between age 62 and 63. By our calculations, you would need to live at least 15 more years in order to get back the $18,588 you forfeited by waiting one year.â\u0080\u009d [These dollar amounts were current at the time the Survey was conducted.] â\u0080¢ The second simply reported what the respondentâ\u0080\u0099s monthly payment would be at each possible age at which benefits could be claimed. It didnâ\u0080\u0099t frame these payment amounts as more or less than those associated with another claiming age, but just the raw amounts themselves. â\u0080\u0094 Specifically, this second way of posing the question read: â\u0080\u009cSuppose that you claim your benefit at age 66. In this case you will receive $2,065 each monthâ\u0080¦ If you claim one year earlier, at age 65, your benefit would be $1,927 a month. If you claim one year later, at age 67, your benefit would be $2,230 a month.â\u0080\u009d Notice that, in comparison with the second, the first way of posing the question frames the decision as a risky bet on your life expectancy. Since we donâ\u0080\u0099t like to take risky bets with our retirements, it shouldnâ\u0080\u0099t surprise us that this way of posing the question would lead people to an earlier claiming age. And that is precisely what the professors found: Respondents who had their choice framed in the first way chose an earlier claiming ageâ\u0080\u009415 months earlier, on average. That statistically was very significant. Note furthermore that these are just two of the ways in which the professors made seemingly slight changes in their survey question. Each of the additional eight changes they analyzed also had an impact on the average claiming age of respondents. There is much irony here. Think of all the ink that has been spilled over the years in an attempt to come up with the one right answer for when you should begin receiving Social Securityâ\u0080\u0094only to discover that the answers were predetermined by seemingly benign differences in how the questions were worded in the first place. The general implication of this research is the need to be aware of the potential impact of how a question is framed. Specifically for when to claim Social Security, the implication is to examine the question from each of many different angles. A good place to start is by asking the 10 different questions that the professors posed in their surveys. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. Hulbert can be reached at mark@hulbertratings.com."}]}