{"article": [{"url": "https://www.marketwatch.com/story/new-japanese-pm-suga-is-unlikely-to-stray-far-from-abenomics-but-he-has-more-pressing-issues-2020-09-14", "published": 1600090640.0, "headline": "New Japan leader Yoshihide Suga was Shinzo Abe's key enforcer of Abenomics - now he has to tackle coronavirus and a recession", "body": "Japan's ruling Liberal Democratic Party Monday chose Shinzo Abe confidant Yoshihide Suga as leader and Japan's next prime minister, in an overwhelming show of support that signals continuity with the resigning premier's policies. â\u0080¢ Suga, 71, the son of a strawberry grower from northern Japan, served as chief cabinet secretary during the eight years of the Abe administration. He was a key enforcer of \"Abenomics,\" the economic policy based on long-term monetary easing, fiscal stimulus and structural reforms. â\u0080¢ He's set to formally become prime minister after a vote of Japan's parliament, the Diet, on Wednesday. But he is only serving Abe's remaining year as LDP leader, and will face a new leadership election in September 2021. â\u0080¢ Japanese political analysts expect Suga to call for a general election before the end of the year, to give him the popular mandate that will help him push through further economic reforms. Opinion: Olympics postponement will make just a dent in Japan's GDP. It could have been worse, if the games had gone ahead The outlook: Suga's lack of international and diplomatic experience may prove a hindrance, most notably when elaborating Japan's policy toward increasingly assertive China, or dealing with President Donald Trump's frequent tirades against countries that export a lot to the U.S., and the Trump era's uncertain commitment to the defense of U.S. allies. But the new prime minister's main task in the short term is to pull the country's economy from the depths of its current recession. Japan, already plagued by slow growth before the coronavirus, has been hit by a steep fall in both consumer demand and exports, as world trade slowed on the pandemic impact. Read next: Rio Tinto legally blew up ancient caves, and now the chief executive has quit - here's why"}]}