{"article": [{"url": "https://www.marketwatch.com/story/nvidias-gaming-business-is-becoming-important-again-2020-08-19", "published": 1597907960.0, "headline": "Nvidia hits a sweet spot, with both gaming and data center on the rise", "body": "While investors have gone gaga for Nvidia Corp.‘s data-center business this year, we should sit back and appreciate the rise of its core business. Nvidia NVDA, -0.54% reported Wednesday that a huge boost in its data-center business meant that revenue from server chips outpaced its gaming business for the first time in the second quarter. With both data centers and videogaming fueled by the work-from-home trend in the ongoing global pandemic, Nvidia is in a sweet spot with both of those businesses. “We find ourselves really in this perfect condition, where the future is going to be more virtual, more digital,” Nvidia co-founder and Chief Executive Jensen Huang told analysts on a conference call. Nvidia said that its new Ampere A100 graphics processor for the data center has been widely adopted by all the major server makers and cloud-service providers. And new products for the gaming industry are expected to be unveiled at an upcoming event to be livestreamed on Sept. 1 When asked in a brief interview after the analyst call if Huang is going to introduce new gaming chips, Chief Financial Officer Colette Kress did not deny that Nvidia plans to introduce new gaming products, and said it would be an “opportunity to update the market on new products, but also new things in the development world.” She also noted that the company plans events the rest of this month leading up to its upcoming GeForce special event on Sept. 1. Nvidia appears to foster a competition between both businesses internally. Last quarter, the data center was the star, with sales of chips for data centers surging 80% and the company creating a new segment-reporting structure. Now, with Nintendo Co. Ltd. manufacturing new Switch consoles for the holidays and computer manufacturers pushing out new laptops for back-to-school sales and the holidays, Kress said she expects gaming to take the title back in the current quarter. “We have to keep both of these businesses on their toes and racing,” Kress said. “Watching them trade off once in a while is great thing.” She pointed out that videogaming has become one way for a wide range of age groups to socialize virtually, in the shelter-in-place world of today. “It is an entertainment form like no other,” she said, adding that there is not a lot else to do for some stuck at home missing their friends. “You really can’t do much, but amazingly the sport of gaming is right there and continuing to attract users from all over the world….teenagers, young adults, to others.” While the other major videogame-console makers, Sony Corp SNE, +0.56% and Microsoft Corp. MSFT, +2.48%, are expected to refresh their gaming consoles with new Advanced Micro Devices Inc. AMD, -3.94% chips, Kress said that she looks forward to the new games developed for those consoles, which are likely to also head for PCs. The new consoles will raise the tide for the entire videogame industry, including Nvidia. “I think it’s going to be quite a huge second half of the year,” Huang told analysts, when asked about what videogame platforms he was excited about, adding that he was already seeing “amazing” numbers from Nintendo. Going forward, investors in Nvidia may begin to feel like they are watching an exciting Federer-Nadal tennis match, watching the ball go from one side to the next, quarter to quarter — but clearly, that’s what the company wants. As long as both the videogame business and the data center keep growing, Nvidia is going to be the overall winner no matter which segment comes out on top."}]}