{"article": [{"url": "https://www.marketwatch.com/story/tax-us-abigail-disney-among-83-millionaires-begging-for-higher-taxes-for-coronavirus-relief-2020-07-13", "published": 1594643300.0, "headline": "Tax us: Abigail Disney among 83 millionaires begging for higher taxes for coronavirus relief", "body": "Dozens of millionaires are demanding higher taxes — on themselves. Over 80 men and women worth seven figures from the U.S., U.K., Germany, New Zealand, Canada and the Netherlands calling themselves the “Millionaires for Humanity” have signed an open letter asking their governments to “raise taxes on people like us. Immediately. Substantially. Permanently.” “ “So please. Tax us. Tax us. Tax us. It is the right choice. It is the only choice.” ” The signatories include Walt Disney Co. DIS, +1.53% heiress Abigail Disney, Ben & Jerry’s co-founder Jerry Greenfield, former BlackRock managing director Morris Pearl and “Love, Actually” director Richard Curtis. Some, like Disney and Pearl, are also members of the “Patriotic Millionaires” club, a couple hundred ultra-wealthy Americans who have pushed to be taxed more to help close the wealth gap. Related:Disney heiress: Jesus Christ himself doesn’t deserve this much money The “Millionaires for Humanity” note in their new letter that they are not driving ambulances, restocking supermarket shelves or delivering food as essential workers have been doing throughout the pandemic. “We owe a huge debt to the people working on the frontlines of this global battle,” the millionaires write. They add that 70% of health care workers are women, and most essential workers are “grossly underpaid” while putting themselves and their families at risk of contracting the novel coronavirus that causes COVID-19 every day. “Unlike tens of millions of people around the world, we do not have to worry about losing our jobs, our homes, or our ability to support our families. We are not fighting on the frontlines of this emergency and we are much less likely to be its victims,” the millionaires write. “But we do have money, lots of it,” they add. “Money that is desperately needed now and will continue to be needed in the years ahead, as our world recovers from this crisis.” Coronavirus update: Global case tally edges toward 13 million, and Florida trounces one-day case record set by California last week It should be noted that these millionaires can cut a check for coronavirus relief at any time, of course. Microsoft MSFT, +2.48% founder and philanthropist Bill Gates and Twitter TWTR, -0.23% CEO Jack Dorsey have pledged more than $1 billion to vaccine research and COVID-19 relief efforts. Amazon AMZN, +3.01% founder Jeff Bezos donated $100 million to Feeding America, although the online shopping giant has also been slammed for how it’s handled the safety of its warehouse workers during the pandemic. The “Millionaires for Humanity” argue that charity alone can’t get us through this crisis, however. “Government leaders must take the responsibility for raising the funds we need and spending them fairly,” they claim. “We can ensure we adequately fund our health systems, schools, and security through a permanent tax increase on the wealthiest people on the planet, people like us.” As of early Monday afternoon, 12.9 million people have been infected with COVID-19 worldwide, and 569,878 have died, according to Johns Hopkins University data. Millions of Americans are out of work. Worldwide, it’s estimated that 1.3 billion children were pulled out of school as the pandemic spread — and nearly 370 million of them depend on school meals."}]}