{"article": [{"url": "https://www.marketwatch.com/story/does-your-estate-plan-use-the-right-type-of-power-of-attorney-for-you-2020-10-08", "published": 1602237140.0, "headline": "Does your estate plan use the right type of Power of Attorney for you?", "body": "This article is reprinted by permission from NextAvenue.org. When do you need your estate plan to “go to work” for you? While you may think the right answer is “after I die,” the actual answer is “if I lose the ability to manage my own affairs.” That means having the right kind of Durable Power of Attorney for Finance drafted and signed. A June 2020 Transamerica Center for Retirement Studies survey found that only 28% of retirees have a financial power of attorney. And many people don’t understand that there are two types of these advance directives; each has very different purposes. Knowing how both types work is critically important in this COVID-19 environment, just in case you contract coronavirus.Two types of Durable Power of Attorney for Finance A Durable Power of Attorney for Finance can be either “springing” or “immediate.” “Durable” refers to the fact that this Power of Attorney will endure after you have lost mental or physical capacities, whether temporary or permanent. It lists when the powers would be granted to the person of your choosing and the powers end at your death. An “immediate” Durable Power of Attorney for Finance is effective immediately after you sign the document. But a “springing” Durable Power of Attorney for Finance means two physicians must first examine you and declare that you cannot manage independently anymore. In other words, “springing” means the person you’ve chosen and named in the document to act on your behalf (known as your agent) can’t use the powers unless the doctors’ letters are acquired first. Also see: Why your estate plan is not as buttoned up as you think it is So, in order to start paying your bills, your agent must have those two physicians’ letters; he or she doesn’t automatically have the authority to ask for them.Why you might want a ‘springing’ version You might want your Durable Power of Attorney for Finance to be a springing document because you fear that otherwise your agent might go to the bank and add his or her name to your account without your permission or awareness. Some people name their spouse as the immediate agent; then successor agents would have to get doctors’ letters. When barriers such as doctors’ letters are required before the person you chose can serve you, ask your attorney for guidance. That’s because an impairment requiring a Durable Power of Attorney for Finance can happen devastatingly quickly and possibly include you and your spouse at the same time. You might both contract COVID-19, for instance, or be in a car accident together.Naming the right agent for you It’s also essential that the person you’ve named in your Durable Power of Attorney for Finance is the right one to do the job for you. Consider this: What if you were to give your checkbook to your chosen agent for two billing cycles, with no instruction other than to get the bills paid on time? If you’d feel any hesitation about this, you may have selected the wrong person. Read: My mother-in-law is narcissistic. My father-in-law is selfish. My brother-in-law is amoral. How do we protect our inheritance? If you recover your capacity, your agent has a duty to turn everything back over to you when you ask. If you’re worried that your agent wouldn’t want to give you back your own power, you’ve chosen the wrong person. The powers granted by a typical Durable Power of Attorney for Finance are often broad and sweeping. They allow for selling and buying assets; managing your debt, car and Social Security payments, filing your tax returns and handling any assets not named in a trust you may have, such as your individual retirement account. It is likely that the executor of your will, your trustee and Durable Power of Attorney for Finance agent are the same person or people. They will be responsible for accounting for every single penny you have, knowing where everything you own is and making sure your funds are used as efficiently as possible for your benefit first. Remember: your advance directive documents are only as good as the people who implement them. Often, family members chosen to do this work have never done it before and may not have the time or energy.What your Durable Power of Attorney agent needs One last tip: It’s not enough to complete your Durable Power of Attorney for Finance document and have it in a file somewhere. Make sure anyone named knows they’ll have the job if needed. They must know where to find this and all other important financial documents, where you bank and invest and have information about all your assets and liabilities. They should also possess detailed information about how you would want things done if you are alive, but unable to manage on your own. In short, you want your selected person to be ready to “go to work” the moment you need that. Marguerite Lorenz is a Master Trustee/Managing Partner with Lorenz Private Trustees and has served high net worth families since 2003. She was appointed by Gov. Jerry Brown to serve on the Professional Fiduciary Bureau Advisory Committee, 2012-2015. She is vice chair for the Independent Trustee Alliance and wrote “Ethics for Trustees” and “Ethics for Trustees 2.0.” Lorenz is a thought leader on LinkedIn. Follow her on Twitter @SanDiegoTrustee This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}