{"article": [{"url": "https://www.marketwatch.com/story/we-want-a-diverse-area-with-moderate-population-warm-beach-and-culture-so-where-should-we-retire-2020-07-18", "published": 1600438220.0, "headline": "We want a diverse area with moderate population, warm, beach and culture â\u0080\u0094 so where should we retire?", "body": "Dear MarketWatch, We are African-Americans and want to retire to a diverse area with moderate population, warm, beach, culture. We can afford a better-than-average lifestyle and want to feel accepted in our new community â\u0080\u0094 hopefully somewhere with high walkability and homes with character. And maybe near a major airport.... for lots of traveling. Let me know what you come up with. Thanks. â\u0080\u0094 Jennifer Dear Jennifer, We all know there are plenty of beach towns in the U.S., but finding one with personality is a bigger challenge. Iâ\u0080\u0099m going to leave out some obvious places, like Miami Beach and, though less diverse, Hilton Head. On the West Coast, no Southern California. Too obvious. Plus, while you can afford a better-than average lifestyle, home prices there are so high that they could hamper your travel budget. The same goes for Sag Harbor and the Hamptons more broadly (plus youâ\u0080\u0099d still have winter on Long Island). Instead, Iâ\u0080\u0099ll look for some off-the-beaten path possibilities. Iâ\u0080\u0099m sure readers will have their own suggestions. As always, explore the area in all seasons, and be realistic about the retirement budget. When you find your dream place, ask which areas are susceptible to flooding during hurricanes and other storms. Read:There is more to picking a place to retire than low taxes â\u0080\u0094 avoid these 5 expensive mistakes A street in the historic district of Wilmington, N.C. Courtesy Wilmington and Beaches Convention & Visitors Bureau The Atlantic: Wilmington, North Carolina Check out the Cape Fear region, which includes Wilmington as well as beach towns like Carolina Beach and the more upscale Wrightsville Beach. Wilmington is growing quickly and at 123,000 people has more than half of New Hanover Countyâ\u0080\u0099s population. The share of those 65 and older are roughly in line with the U.S. average. Look for a place where youâ\u0080\u0099ll catch a breeze off the Intracoastal Waterway or the ocean to counter the summer humidity â\u0080\u0094 so not too far inland. Youâ\u0080\u0099ll have no shortage of cultural offerings, starting with Thalian Hall, the Cameron Art Museum and the Wilson Center. The University of North Carolina Wilmington, which has 17,000 students, lets those 65 and older audit classes for free, while its Osher Lifelong Learning Institute offers shorter courses to those 50 and older. Be sure to explore the Gullah Geechee Cultural Heritage Corridor, which stretches from Wilmington to Jacksonville, Fla., and is home to cultural groups descended from enslaved peoples from West and Central Africa. Poplar Grove Plantation is one local site. Winter days get into the 50s, with average lows in the 40s. Average highs in July are in the 80s. Hereâ\u0080\u0099s whatâ\u0080\u0099s on the housing market now in Wilmington and in New Hanover County using Realtor.com (which, like MarketWatch, is owned by News Corp.). As for travel, while Wilmington has an airport, youâ\u0080\u0099ll have more choices flying from Raleigh two hours away. Gulfport, Fla., next to St. Petersburg Courtesy Visit St. Pete/Clearwater The Gulf of Mexico: Gulfport, Florida Floridaâ\u0080\u0099s popularity with retirees is no secret, in part because itâ\u0080\u0099s affordable and has no state income tax. But all too often, home means living in a high rise or a gated community. Gulfport, though, is described as how Key West was before it became overrun with tourists. This town of 12,000, just west of St. Petersburg, is your artsy, funky, walkable spot in the middle of the Tampa Bay metro area and its 3 million people. Youâ\u0080\u0099ll also find plenty of retirees; 30% of Gulfportâ\u0080\u0099s residents are 65 or older. Gulfport comes with sunset views from its own (man-made) strip of sand over Boca Ciega Bay so, yes, itâ\u0080\u0099s on the Gulf side of Florida but technically not on the Gulf of Mexico. But opposite the bay is St. Pete Beach, which gets raves from TripAdvisor (a local says head to the Pass-A-Grille section at the southern tip). When you tire of that, there are more white-sand beaches to sink your toes in, including Siesta Beach in Sarasota an hour south (and Dr. Beachâ\u0080\u0099s pick in 2017 for best beach in the U.S.) as well as Caladesi Island State Park (No. 6 on Dr. Beachâ\u0080\u0099s list this year) an hour north. And if you just want to walk, donâ\u0080\u0099t overlook the 45-mile Pinellas Trail that stretches from St. Petersburg to Tarpon Springs and goes through the northern edge of Gulfport. For bigger getaways, thereâ\u0080\u0099s Tampa International Airport. To get a sense of the local housing market, hereâ\u0080\u0099s whatâ\u0080\u0099s for sale now, again using Realtor.com. As you explore the Tampa area, also check out Safety Harbor, a town of 18,000 on the western side of Tampa Bay with its own walkable downtown, and Dunedin (pronounced Duh-nee-din) north of Clearwater thatâ\u0080\u0099s also popular with retirees. You know thereâ\u0080\u0099s plenty of cultural offerings in a metro this size. One that might be easy to overlook: the Dr. Carter G. Woodson African-American Museum in St. Petersburg. An aerial photo of Honoluluâ\u0080\u0099s Waikiki Beach, with Diamond Head Mountain in the distance. iStockphoto The Pacific: Oahu, Hawaii If year-round pleasant weather is the priority, Hawaii canâ\u0080\u0099t be beat. Average highs are in the 80s year-round, and average lows bottom out in the mid-60s. Of course thereâ\u0080\u0099s no shortage of beautiful beaches. When you tire of water, take advantage of wonderful hiking opportunities. And while the focus of your international travels might shift toward Asia, you may want to spend more time just staying, discovering Hawaiian culture and exploring some of the national parks. You admittedly wonâ\u0080\u0099t find a big population of African-Americans here, but Hawaiians have a much more open and fluid view of race and diversity than many of us on the mainland. Start your search for your retirement life on Oahu Island. About a third of the islandâ\u0080\u0099s million residents live in Honolulu itself, one of the countryâ\u0080\u0099s most diverse and affluent cities and the birthplace of President Barack Obama. Curious about sites associated with him in some way? Here are even more. Youâ\u0080\u0099ll find plenty of cultural offerings in Honolulu (including some of Hawaiiâ\u0080\u0099s best festivals, as voted by readers of Hawaiâ\u0080\u0099i Magazine), plus the state university (those 60 and older can audit classes for free). Thereâ\u0080\u0099s even Costco, if thatâ\u0080\u0099s your thing. Oh, and that Elvis statue... Yes, thereâ\u0080\u0099s the cost of getting everything to Hawaii â\u0080\u0094 some things will be even more expensive than parts of California. Hereâ\u0080\u0099s what the local housing market looks like. If Honolulu is too pricey, consider some of the smaller towns on the island. Or check out the less-populated (and cheaper) Big Island, also known as Hawaii Island. Start with the Kalaoa area. Readers, where should Jennifer retire?"}]}