{"article": [{"url": "https://www.marketwatch.com/story/biden-to-fault-trump-over-approach-to-school-reopenings-pandemic-2020-09-02", "published": 1599061820.0, "headline": "Biden faults Trump over approach to school reopenings, pandemic", "body": "Joe Biden on Wednesday blasted President Donald Trump’s push for schools to quickly reopen amid the coronavirus pandemic, sharpening his attack as some students return to classrooms but others continue to learn online. Trump has offered “no real plan for how to help parents feel secure for their children,” charged Biden in a speech in Wilmington, Del. The president is “offering nothing but failure and delusions,” Biden said. Democratic presidential nominee Biden spoke after being briefed by education experts. He urged Trump to work with Congress to get emergency funding to U.S. schools, saying the Federal Emergency Management Agency should provide aid to K-12 schools to support reopening. His campaign cited school organizations as saying at least $200 billion in emergency funding is needed. Coronavirus update:Global case tally nears 26 million and experts are alarmed that U.S. will not join WHO-backed effort on vaccine. As the Associated Press writes, the Wilmington event was the latest in a series of dueling efforts by Trump and Biden to cast the other as a threat to the day-to-day security of Americans. Trump has steered debate toward “law and order,” with Biden pushing a referendum on Trump’s competence. Trump has demanded that schools reopen this fall, threatening to cut federal funding for those districts that didn’t comply. Yet many districts have begun the school year with online learning. “If Joe Biden is going to argue to reopen schools and do it safely, he needs to demand that [House Speaker] Nancy Pelosi pass the bill that the president has requested for $105 billion to get schools the equipment they need to reopen safely,” Tim Murtaugh, Trump 2020 communications director, told reporters. Trump visited North Carolina, a battleground state, on Wednesday, for a World War II commemoration event. Trump Today:Trump visits North Carolina as latest polls give him an edge in that swing state. The Associated Press contributed to this report."}]}