{"article": [{"url": "https://www.marketwatch.com/story/10-economically-diverse-cities-that-have-what-it-takes-to-overcome-turbulent-times-2020-08-11", "published": 1597122560.0, "headline": "10 economically diverse cities that have what it takes to overcome turbulent times", "body": "Curious which U.S. economies are healthiest, and likely to rebound quickest after COVID? An important vital sign to check is the diversity of industries within a metro economy. Relying too heavily on a single industry — say, tourism and hospitality in a time of travel restrictions — is detrimental. But a healthy mix of market sectors can help communities better weather economic storms. “Every market and industry has been impacted either directly or indirectly by COVID-19,” explains Meredith Metsker, a content marketing specialist with labor market analytics firm Emsi. “However, some communities are more resilient than others, particularly if they have a diversified, knowledge-based economy.” Emsi shared a list of the 10 most diversified metro economies in the U.S. These are the economies with the range of industries, depth and nimbleness needed to overcome turbulent times and come out the other side even stronger. Now, we’re diving into what makes these places great places to work and live. 1. Madison, Wis. Madison is a lot of things: a college town, state capital and, since it’s nestled between two lakes, a paradise for outdoors enthusiasts. The Wisconsin city also has the most diverse economy in the country, with advanced manufacturing, agriculture, health care, information technology and life sciences among the key industries. Plus, those looking to launch a career in Madison have access to unique programs, like SCORE, a group of retired executives who are dedicated to helping small businesses get off the ground.2. Burlington, Vt. Thinking about starting a new chapter? Turn your attention to Vermont. The state is looking to grow its workforce and has incentives for those who move there, including grants and a Stay to Stay Weekend program connecting visitors interested in moving to Vermont with employers, entrepreneurs and potential neighbors. You already know Vermont for its maple syrup (it produces nearly half of the nation’s maple crop), but manufacturing, software development, financial services, green energy and tourism are among some of the other key industries. Also read: The Great Return: How to get the wealthy to come back to New York City?3. Davenport, Iowa Several Fortune 500 companies call Davenport home, including Kraft Heinz KHC, -0.35% , Sterilite Corporation, Nestle Purina, Sears Manufacturing SHLDQ, -3.08% and John Deere DE, +0.24% . But Davenport, where the average home is priced under $150,000, is also a magnet for small businesses. Located along the Mississippi River, the Iowa city has several incentives to help grow small businesses and attract new ones, including tax incentives and economic development loans. Key industries in the Quad Cities area include advanced metals and materials, agricultural innovation, corporate operations, defense and logistics.4. Eugene, Ore. Eugene is a regular on Livability’s Best Places to Live rankings, thanks in part to the hiking and biking trails that wind through lush forests and showcase gorgeous mountain views. While the University of Oregon and Lane Community College are major employers, this tightknit college town also has a burgeoning tech scene. Creative types will feel at home here, too, with Eugene commissioning artists to create 22 vibrant outdoor murals to adorn public spaces in this walkable city.5. Rochester, N.Y. Rochester, N.Y. Getty Images/iStockphoto Beloved family-owned grocer Wegmans is based in Rochester and is one the area’s largest employers with more than 13,000 local employees. The University of Rochester and Rochester Regional Health are also top employers. Companies that set up shop in the region are able to hire from a highly educated workforce and benefit from research centers in fields that include food and beverage manufacturing, optics, photonics and imaging, biotech and life sciences, software and IT services and energy innovation. For the curious, Rochester has some interesting museums, including the International Center for the History of Electronic Games and the National Toy Hall of Fame in addition to The George Eastman Museum dedicated to photography. Be sure to visit: Where Should I Retire?6. Johnson City, Tenn. Johnson City has been investing in its outdoor offerings, including the Tannery Knobs Mountain Bike Park that includes 40 acres of wooded terrain and a ridgeline overlooking the Appalachian Mountains. Affordability is a perk, with the average rent $150 less than the state average and home prices at $130,000, which is $5,000 less than the Tennessee average. Crown Laboratories, which makes skin care and beauty products like Blue Lizard Australian Sunscreen, is a major employer in Johnson City. The county is also positioning itself as a leader in aerospace engineering with its expanding Aerospace Park and as home to Moog Protokraft, which designs and makes electronics used in advanced military aircraft.7. Eau Claire, Wis. Menard home centers, the Mayo Clinic Health System, Eau Claire Area School District and the University of Wisconsin’s Eau Claire campus are among the top employers here, giving this west central Wisconsin city a healthy mix of industries. Recreation is also a key industry here in the Chippewa Valley. Residents here can enjoy walking, biking, and kayaking along the Chippewa River State Trail. Eau Claire, one of Livability’s best places to live, has also made a name for itself as a creative hot spot, with indie music and funky art galleries.8. Baton Rouge, La. Baton Rouge is making a name for itself in the field of audio engineering, with companies like PreSonus developing hardware and software for musicians. Also, Celtic Media Centre is home to more than two dozen companies working to support the area’s film industry and Baton Rouge Community College offers degree programs for entertainment technology. Other industries that thrive here include education, energy and government and big-name employers include Coca-Cola KO, +0.69% Exxon Mobil XOM, -1.47% , EA Games EA, +1.15% and IBM IBM, -2.81% . A global food scene, year-round celebrations and affordable housing are among the many reasons to move to Baton Rouge. Also see: Five growing post-COVID industries and where their jobs are9. Lexington-Fayette, Ky. Known as the “Horse Capital of the World,” Lexington is filled with beautiful horse farms (roughly 450 of them in the region!). Bourbon distilleries, scenic “timbered tunnels,” and bluegrass music help define Lexington. The University of Kentucky is a major employer in this metropolitan area. But in addition to education, other top industries include health care, distribution and manufacturing. Amazon AMZN, +3.01% has a fulfillment center in the area and other major employers include laser printer maker Lexmark International and Lockheed Martin LMT, -0.68% . Lexington has made Livability’s list of the best places to live, is one of and is a great spot for antique shopping and has little to no traffic. Related: Rethinking big city life? Here are 8 smaller places that still have the urban perks10. Portland, Ore. Portland, Oregon Getty Images You may have visited Portland for a concert, to take in the scenery or to sample its “proud to be weird” culture. But have you considered moving there? Portland boasts lots of economic opportunity as its tech industry continues to grow. High-tech employee hiring has been reaching new highs, and the software side of tech is especially hot. Nike NKE, +0.97% and Columbia Sportswear COLM, +1.49% are headquartered in Portland, and Adidas ADDYY, +2.03% , Keen, Danner Boots and several other athletic and outdoor apparel companies have North American headquarters in the city. Manufacturing and health care are also top industries. Portland also made Livability’s list of top cities for entrepreneurs. These are the Top 100 Best Places to Live in America in 2019 Read the original article on Livability."}]}