{"article": [{"url": "https://www.marketwatch.com/story/this-is-just-slowing-the-clock-on-evictions-why-the-cdcs-moratorium-on-evictions-wont-solve-americas-looming-100-billion-rental-crisis-2020-09-17", "published": 1600521920.0, "headline": "â\u0080\u0098This is just slowing the clock on evictionsâ\u0080\u0099: Why the CDCâ\u0080\u0099s moratorium on evictions wonâ\u0080\u0099t solve Americaâ\u0080\u0099s looming $100 billion rental crisis", "body": "Public-health officials have enacted a nationwide moratorium on evictions to protect Americans from COVID-19. When the Centers for Disease Control and Prevention announced in early September that it was establishing a temporary ban on evictions across the country, the news was celebrated by housing advocates who feared that as many as 40 million Americans could be kicked out of their homes during the pandemic. The bottom line: The historic move did not come with additional funding to support struggling renters and landlords across the country.Housing advocates and industry officials say if lawmakers donâ\u0080\u0099t set aside funds for emergency rental assistance, the eviction crisis could hit a fever pitch once the current moratorium ends. The moratorium doesnâ\u0080\u0099t automatically protect renters â\u0080\u0094 they must proactively fill out a form and send it to their landlord to receive protection under the CDCâ\u0080\u0099s order. But the CDCâ\u0080\u0099s moratorium was essentially a unilateral act. White House officials stressed that some emergency funding at the Department of Housing and Urban Development and the Department of Treasury â\u0080\u0094 including money allocated by the CARES Act â\u0080\u0094 could be accessed by struggling renters and landlords alike. Have questions about how the national eviction moratorium works as a landlord or renter? Email us at EvictionQuestions@marketwatch.com Congress, however, has not yet appropriated any funds for the explicit purpose of providing rental assistance. Meanwhile, millions of Americans remain unemployed because of business closures triggered by the coronavirus pandemic. “ â\u0080\u0098This is just slowing the clock on evictions, itâ\u0080\u0099s not providing additional resources.â\u0080\u0099 ” â\u0080\u0094 Marion McFadden, senior vice president for public policy at Enterprise Community Partners The $600 in supplemental unemployment payments expired many weeks ago â\u0080\u0094 the Trump administration has allowed states to tap emergency funds to provide an additional $300 per week in unemployment payments to eligible workers. But those funds too are likely to run out soon. As a result, the CDCâ\u0080\u0099s moratorium is not in itself a solution to the eviction crisis the nation is facing. â\u0080\u009cThis is just slowing the clock on evictions, itâ\u0080\u0099s not providing additional resources,â\u0080\u009d said Marion McFadden, senior vice president for public policy at Enterprise Community Partners, an affordable housing non-profit. â\u0080\u009cIt doesnâ\u0080\u0099t look like weâ\u0080\u0099re going to see a quick bounce back from the economic impact of COVID,â\u0080\u009d said McFadden, who previously served at the deputy assistant secretary for grant programs at HUD. â\u0080\u009cWe need Congress to be forward-looking to think about [providing] community assistance.â\u0080\u009d Also see:CDCâ\u0080\u0099s eviction moratorium doesnâ\u0080\u0099t automatically protect renters â\u0080\u0094 here are the strict criteria you must meet Itâ\u0080\u0099s not just renters who are in sore need of the assistance. Industry experts have warned that landlords â\u0080\u0094 particularly mom-and-pop landlords who own only a handful of rental properties â\u0080\u0094 are also staring down financial ruin. “ â\u0080\u0098$100 billion was always perceived to be a floor, a minimum that would be needed.â\u0080\u0099 ” â\u0080\u0094 Marion McFadden, senior vice president for public policy at Enterprise Community Partners â\u0080\u009cThe vast majority of single-family rentals have landlords who only have one, two or three homes â\u0080\u0094 they donâ\u0080\u0099t have much by way of resources to fall back on,â\u0080\u009d said David Howard, executive director of the National Rental Home Council, a trade group representing landlords in the single-family rental industry. Many of these small-scale landlords own these units as a source of retirement income or a way to defer long-term housing costs. And many had already gone months without seeing monthly rental payments before the CDCâ\u0080\u0099s eviction order went into effect. â\u0080\u009cA landlord could very well have tenants who are not paying rent and who havenâ\u0080\u0099t been paying rent for some time, yet the landlord is still responsible for paying the mortgage, paying for the maintenance and the upkeep costs,â\u0080\u009d Howard said. â\u0080\u009cAnd if they canâ\u0080\u0099t, they can be foreclosed on.â\u0080\u009dHow much emergency rental assistance is needed? When asked what was needed in terms of emergency assistance, most rental housing industry officials and affordable housing experts cited the same figure: $100 billion. That was the amount of emergency rental assistance that was allocated in the $3 trillion HEROES Act legislation written by Democrats, which was passed in the House of Representatives earlier this year. A majority of those funds would be distributed to serve individuals or families experiencing or at risk of homelessness who earn less than 50% of their area median income. The rental industry took issue with certain components of the HEROES Act â\u0080\u0094 the legislation included its own eviction moratorium, which was far-reaching and would have lasted until March 2021 â\u0080\u0094 but officials said they supported the amount set aside for rental assistance. â\u0080\u009cIt will accomplish what itâ\u0080\u0099s designed to accomplish, which is providing assistance for people who are who are having trouble paying the rent, and we think thatâ\u0080\u0099s a good thing,â\u0080\u009d Howard said. But $100 billion might not be enough money, depending on how many Americans continue to face difficulty paying the rent â\u0080\u0094 especially as supplemental unemployment payments run out. â\u0080\u009c$100 billion was always perceived to be a floor, a minimum that would be needed,â\u0080\u009d McFadden said. No one knows how long the coronavirus crisis and resulting economic fallout will last, so putting a price tag on the amount of emergency funds needed is difficult, she said. â\u0080\u009cI donâ\u0080\u0099t know if the $100 billion we supported before would even be enough,â\u0080\u009d said Bob Pinnegar, president and CEO of the National Apartment Association. Whatâ\u0080\u0099s more, the amount needed in funds explicitly intended for rental assistance will depend on whether a future stimulus package â\u0080\u0094 if one passes in Congress â\u0080\u0094 includes more money for unemployment insurance. A July report from the Urban Institute, a nonpartisan think-tank, calculated that without unemployment aid, it would cost $14.2 billion per month to alleviate the rent burden for all renters nationwide. With the supplemental $600 per week in unemployment benefits, that figure drops down to $11.8 billion. â\u0080\u009cOnly the federal government can provide the resources needed at this scale across the country,â\u0080\u009d McFadden said. Donâ\u0080\u0099t miss:Gaps in the CDCâ\u0080\u0099s eviction ban could leave some renters homeless, housing advocates sayHow would emergency rental assistance be distributed? Any form of emergency rental assistance passed by Congress would likely make use of existing programs and channels at HUD to distribute it nationwide. â\u0080\u009cOnce we get some sort of stimulus legislation through, we need to get those monies out as quickly as possible,â\u0080\u009d Pinnegar said. â\u0080\u009cThereâ\u0080\u0099s not time to reinvent the wheel to get that money out there.â\u0080\u009d Assistance would most likely come in multiple forms, McFadden said. Much of the money would likely be distributed in the form of Section 8 housing-choice vouchers. â\u0080\u009cRental assistance that goes directly to families in the form of vouchers helps them pay the rent and gives them choice over the buildings they want to live in,â\u0080\u009d McFadden said. But for a variety of reasons, a voucher program alone wonâ\u0080\u0099t be sufficient to meet the shortfalls in rent. â\u0080\u009cThere are going to be renters falling through the cracks who are not accessing assistance theyâ\u0080\u0099re qualified to,â\u0080\u009d McFadden said. “ â\u0080\u0098The key is to get more funding into the hands of folks in the least bureaucratic way.â\u0080\u0099 ” â\u0080\u0094 Diane Yentel, president and CEO of the National Low Income Housing Coalition Some rental assistance likely would be distributed to states and localities through grants administered by HUD, particularly the Emergency Solutions Grants Program. States and cities that receive those grants, which are typically used to help individuals facing homelessness, will then distribute them to non-profits who will oversee dispersing the funds to residents and landlords to address the shortcomings of vouchers. â\u0080\u009cThe key is to get more funding into the hands of folks in the least bureaucratic way,â\u0080\u009d said Diane Yentel, president and CEO of the National Low Income Housing Coalition. McFadden argued that some emergency funding should be earmarked specifically for payments directly to affordable-housing providers. â\u0080\u009cThey are spending much more money on cleaning their buildings to keep people safe and providing PPE to their staff and residents,â\u0080\u009d she said. â\u0080\u009cThose are kinds of things that an individual voucher is not going to pay for.â\u0080\u009d However, some progressive activists have argued for other approaches to emergency housing assistance. A plan put forth earlier this year by Rep. Ilhan Omar, a Democrat from Minnesota, called for nationwide renter forgiveness. Under her plan, rather than tasking renters with seeking out assistance, they would be allowed to forego rent payments entirely if facing hardship due to COVID-19. Instead, landlords would be the ones tasked with navigating government assistance â\u0080\u0094 and Omarâ\u0080\u0099s legislation would require landlords to agree to a range of protections for their tenants in order to receive financial assistance. â\u0080\u009cThe landlord relative to the tenant has way more power and way more security in this moment simply by virtue of having an asset to borrow against,â\u0080\u009d Tara Raghuveer, housing campaign director at Peopleâ\u0080\u0099s Action, a political network devoted to grassroots organizing, previously told MarketWatch. â\u0080\u009cTenants should not be faced with the burden of navigating a government bureaucracy to get their relief.â\u0080\u009d"}]}