{"article": [{"url": "https://www.marketwatch.com/story/how-people-who-cant-work-from-home-face-a-double-burden-from-covid-19-11598975652", "published": 1598961740.0, "headline": "How people who can't work from home face a 'double burden' from COVID-19", "body": "A new study suggests that 'the worse health outcomes for non-remote workers may relate to the nature of their jobs.' Stephanie Keith/Getty Images Americans who lacked the ability to work from home during the first four months of the pandemic both sustained steeper job losses and showed more symptoms of respiratory illness than their remote-working counterparts, according to a new working paper - with some of the worst effects falling on non-remote workers from the poorest families. As COVID-19's spread across the U.S. prompted stay-at-home orders and business closures, the share of non-remote workers who lost their employment by early April was three times higher (24%) than the share of remote workers who lost their jobs (8%), estimated the study, conducted by researchers from the University of Texas at Austin and the University of Southern California and distributed by the National Bureau of Economic Research. The easing of restrictions on non-essential businesses didn't significantly boost employment, the report's authors added. And though job losses were also worse for women than for men, for people without a college degree than for those with a college degree, and for African-American people and Hispanic people than for white people, the gap between non-remote and remote workers was wider. Meanwhile, non-remote workers experienced worse respiratory health than those who worked remotely, the study found, as demonstrated by their tendency to report more symptoms of respiratory illness and perceive greater risk of being infected with the coronavirus. “ 'Since the losses were highest among remote workers from very low income households, these disparities exacerbated growing income inequality in the U.S.' ” - researchers from the University of Texas at Austin and the University of Southern California Measuring symptoms such as cough, fever, shortness of breath, sore throat or sneezing provided a \"proxy for exposure to respiratory pathogens such as SARS-CoV-2,\" the report said, referring to the virus that causes COVID-19. \"Because COVID-19 is less prevalent than other respiratory illnesses (e.g. the common cold), most reported symptoms do not arise from actual COVID-19 cases,\" it added. The pandemic compounded disparities that had already existed, the authors wrote: Non-remote workers from low-income households bore the brunt of job losses \"and, to a lesser extent, health losses.\" \"Our results highlight the double burden borne by non-remote workers: these workers had substantially larger job losses, and those who kept their jobs faced elevated health risks,\" the researchers wrote. \"Since the losses were highest among remote workers from very low income households, these disparities exacerbated growing income inequality in the U.S.\" The study authors conducted a longitudinal survey as part of the University of Southern California's ongoing Understanding America Study, analyzing data from a nationally representative panel of 6,922 U.S. adults. They surveyed respondents every other week between March and July. The researchers also examined differences in protective behaviors taken by people in work and non-work-related contexts. While remote and non-remote workers didn't significantly differ in their protective behaviors outside of work, \"people with non-remote jobs in March practiced fewer work-related protective behaviors, especially if they remained employed in April-July,\" they wrote. \"In this case, the double difference is 11 percentage points,\" the authors said, \"suggesting that the worse health outcomes for non-remote workers may relate to the nature of their jobs.\" Policymakers should work to reduce non-remote workers' risk of infection to address the problems they face during the pandemic, the authors suggested. \"Nevertheless, it appears unlikely that non-remote workers will face dramatic improvements in their employment opportunities in the short run,\" they added. \"Adequate financial assistance for the unemployed, therefore, appears to be an essential policy tool.\""}]}