{"article": [{"url": "https://www.marketwatch.com/story/yes-covid-19-death-rates-increase-with-age-2020-06-16", "published": 1592496140.0, "headline": "COVID-19 is not as big a threat to typical older workers as you might think", "body": "Working longer is the best way to ensure a secure retirement, and people appear to have gotten the message. Lately I am worried that the COVID-19 pandemic could reverse the trend toward increased labor-force participation of older people. With the constant commentary about older people being more vulnerable, individuals may simply withdraw, viewing the environment — in the absence of a vaccine — as too treacherous. Or employers, whose enthusiasm for older workers is always questionable, may discourage them from participating. Read: For older workers, there are risks if they return to the office — and risks if they don’t I wanted to take a look at the underlying relationship between age and COVID-19. The Centers for Disease Control and Prevention (CDC) report deaths from COVID-19 by age group (see table 1). The death counts, which are available through June 6 are based on death certificates. Since it takes several weeks for death certificates to be submitted and processed, the totals are substantially lower than those reported by state and local health departments. The data in table 1 show that the death rate increases with age. The question is how to think about these numbers in the context of older workers. The very high death rates for those ages 85 and older and for those 75 to 84 are not really relevant for a discussion of workforce issues. The more pertinent question is whether a death rate of 27 per 100,000 of the population for those 55 to 64 compared with 11 per 100,000 of the population for those 45 to 54 is something that should determine whether it is wise to keep working. Of course, both these percentages are currently higher as the total number of deaths has surpassed 112,000, but the ratio of one age group to another probably hasn’t changed. The only other thing I could think of was to compare the pattern of COVID-19 to deaths from some other illness. The CDC groups together influenza and pneumonia, and the death rates by age from these two diseases is shown in table 2 for a similar four-month period during the peak of the 2017-2018 flu season. Again, the pattern is age-related, but remains relatively low for those ages 55 to 64. And, interestingly, while the death rates for influenza and pneumonia are lower than those for COVID-19, the relative risk of dying for people 55 to 64 compared with those 45 to 54 is actually similar for both. The bottom line from all these numbers is that most older workers are ages 55 to 64, not 85 and over, where the shockingly high death rates have occurred. They, like the rest of us, need to be careful as the economy opens up. But their situation does not differ dramatically from that of prime-age workers 45 to 54, and should not be a major determinant of their work/retirement decision."}]}