{"article": [{"url": "https://www.marketwatch.com/story/first-trump-biden-debate-fox-news-chris-wallace-the-moderator-criticized-for-chaotic-clash-2020-09-29", "published": 1601556140.0, "headline": "First Trump-Biden debate: Fox News' Chris Wallace, the moderator, criticized after chaotic clash in Cleveland", "body": "While the U.S. presidential election campaign is showing how the country is divided on a lot of issues, Tuesday night's debate left many Americans in agreement on how the face-off's moderator performed. Chris Wallace from Fox News drew flak from partisans and pundits amid a messy debate in Cleveland between President Donald Trump and Democratic challenger Joe Biden. “ 'If I'd been hired to moderate either of the next two presidential debates, I think I'd call in sick.' ” - Melissa K. Miller, Bowling Green State University Larry Sabato, director of the University of Virginia's Center for Politics, offered this criticism, and then later tweeted that Wallace had done an \"awful\" job: iframe.twitter-tweet { width: 100% !important; } A former spokesman for 2016 Democratic nominee Hillary Clinton offered a similar take on the moderator, while also putting down Trump: iframe.twitter-tweet { width: 100% !important; } Among Trump supporters, a common complaint was that Wallace was injecting himself into the debate too much and favoring Biden. Laura Ingraham of Fox News had this critique of her colleague at the cable channel: iframe.twitter-tweet { width: 100% !important; } Fox News roaming correspondent-at-large Geraldo Rivera offered support for Wallace. \"Criticism of #ChrisWallace misplaced,\" Rivera tweeted. \"He signed up to moderate a debate, ending up in middle of a knife fight.\" Put conservative commentator Ann Coulter in the column of those taking issue with Wallace's approach: iframe.twitter-tweet { width: 100% !important; } The complaints about Wallace come four years after he drew praise for how he moderated the final Clinton-Trump debate. Undecided voters hold the key to the election, but some of them may have decided not to vote as \"sheer chaos\" reigned on the debate stage, said Melissa K. Miller, a professor of political science at Bowling Green State University in Ohio. \"Chris Wallace of Fox News is a tough interviewer, but even he couldn't keep the train on the tracks tonight,\" she told MarketWatch in an email. \"Wallace couldn't get the candidates to stop talking over and interrupting one another. If I'd been hired to moderate either of the next two presidential debates, I think I'd call in sick.\" In Los Angeles Times and New York Times stories published on Wednesday, Wallace was quoted as saying the face-off was \"not the debate I had planned for,\" as \"interruptions got in the way of a substantive discussion of serious issues.\" He also described the event as \"a terrible missed opportunity,\" and he said he hopes the moderators for the upcoming debates will \"be quicker to realize what's going on than I was.\" Read more:Chris Wallace on whether candidates should have mute buttons during debates - and his advice for the next moderator Fox News and the Commission on Presidential Debates made comments that were supportive of Wallace. The network's parent, Fox Corp. FOX, -1.45% FOXA, -1.25%, and MarketWatch's parent, News Corp NWS, -1.29% NWSA, -1.35%, share common ownership. \"We are extremely proud of his professionalism, skill and fortitude in a unique situation while doing everything possible to hold both candidates accountable,\" Fox News executives said in a company-wide memo. The debates commission, which plans changes to avoid a repeat of Tuesday night's problems, said in a statement that it's \"grateful to Chris Wallace for the professionalism and skill he brought.\" This is an updated version of a story first published on Sept. 29, 2020."}]}