{"article": [{"url": "https://www.marketwatch.com/story/us-unemployment-rate-falls-to-pandemic-low-of-79-but-thats-not-the-whole-story-2020-10-02", "published": 1601654600.0, "headline": "U.S. unemployment rate falls to pandemic low of 7.9%, but that's not the whole story", "body": "The unemployment rate has shrunk from a modern record high of 14.7% during the worst stages of the coronavirus pandemic to just under 8% in September, but the rapid plunge is not nearly as good as it looks. Not by a longshot. The jobless rate fell for the fifth month in a row, to 7.9% from 8.4%, the government said Friday. Good news, right? Yes, but it comes with a lot of caveats. Read:U.S. adds 661,000 jobs in September and unemployment rate falls to 7.9% First and foremost, nearly 700,000 people stopped looking for scarce jobs and dropped out of the labor force in September. As such they aren't counted in the unemployment rate. More broadly, the size of the labor force dropped to 160.1 million last month from 164.5 million in February, the last month before the viral outbreak in the U.S. That means 4.4 million people have basically fallen off the map. Then there's the ongoing problem of people surveyed by the government not answering its employment questionnaire correctly. Many respondents who've been furloughed continue to indicate they still have jobs even though there's little chance they'll be called back. Had the survey been answered properly, the Bureau of Labor Statistics said Friday, the official unemployment rate would have been about 0.4 percentage points higher. Or 8.3%. So what's the real unemployment rate? Most economists believe it's at least several points higher. \"Given the large number of people who have exited the labor market, that number understates the true level of unemployment by roughly 3 percentage points,\" said chief economist Joe Brusuelas of RSM. \"For this reason, the 'real unemployment rate' is likely somewhere between 11% and 12%.\" Read:Consumer confidence surges to highest level of coronavirus era Another close proxy is the so-called U6 unemployment rate included in the government's report. It captures more of the people on the fringes of the labor market. The U6 rate fell to 12.8% in September from 14.2% in August. While still quite elevated, it's come down sharply from a pandemic peak of 22.8% in April. Nearly half of the 23 million people who lost their jobs early in the crisis have since returned to work, government data show. Even that, that still leaves some 11 million people or perhaps even more on the outside looking in."}]}