{"article": [{"url": "https://www.marketwatch.com/story/some-of-europes-biggest-travel-companies-are-leaving-consumers-covering-the-cost-of-coronavirus-holding-on-to-cash-while-handing-out-credit-notes-11598007085", "published": 1598209700.0, "headline": "Some of Europeâ\u0080\u0099s biggest travel companies are leaving consumers covering the cost of coronavirus â\u0081 â\u0080\u0094 holding on to cash while handing out credit notes", "body": "Failing to hand over refunds to customers is a direct breach of guidance from European and U.K. authorities. Yet several tour operators have failed to refund customers their money. Some of Europeâ\u0080\u0099s largest travel companies are holding on to their customersâ\u0080\u0099 cash months after trips were canceled because of coronavirus.Â Failing to hand over the money is a direct breach of guidance from European and U.K. authorities. Yet several tour operators have failed to refund customers their money. For instance, ski tour operator Sunweb told customers it is â\u0080\u009cfinancially unfeasibleâ\u0080\u009d to pay cash refunds. Luxury-tour operator Scott Dunn said it has been addressing a backlog of refund requests throughout the crisis and said it has refunded millions of pounds in cash so far. â\u0080\u009cWeÂ recognize this has not been as quickly as we would have been able to do in a non-global pandemic situation which has led to frustrations,â\u0080\u009d Scott Dunn Chief Executive Sonia Davies told MarketWatch. Club Med has also failed to pay some customers cash refunds, although a spokesperson said the company plans to do so and that refunds are being held up by administrative difficulties. European regulators ruled earlier this year that travel companies must offer customers cash refunds, rather than vouchers, for trips canceled because of coronavirus. The U.K.â\u0080\u0099s Competition and Markets Authority also criticized those that fail to pay cash refunds. Sunwebâ\u0080\u0099s chief commercial officer Tim Van den Bergh said: â\u0080\u009cWe completely understand that some of our customers would prefer a refund to rebooking. In normal circumstances, a refund would be paid within 14 days. But these circumstances are extraordinary.â\u0080\u009d Davies also cited the unprecedented scale of the crisis, saying: â\u0080\u009cAt Scott Dunn, we have been working through customer bookings in date order of travel as quickly and seamlessly as possible, given the huge backlog of refunds and the unprecedented nature of the situation we are in.â\u0080\u009dÂ Read: Tomorrowland Winter ticket-holders given â\u0080\u0098corona-vouchersâ\u0080\u0099 and could face 18-month wait for cash refunds A Club Med spokesperson said it it â\u0080\u009cnot about withholding cash, it is about how we can physically do it in a timely manner.â\u0080\u009d Still, at least one customer has given up hope of getting cash back from Club Med. Steve Kemish, who had booked what he described as a â\u0080\u009conce in a lifetimeâ\u0080\u009d family trip to Brazil, part of which was booked through Club Med, said he has little hope that he will see his money again.Â â\u0080\u009cThe rules said refund within two weeks,â\u0080\u009d he told MarketWatch. â\u0080\u009cIt just feels like they are doing everything they can to hold on to the money.â\u0080\u009d Kemish said he paid Club Med more than Â£4,000 ($5,300). He said he has rebooked the majority of the holiday for a year later with other tour operators, and that he wonâ\u0080\u0099t book with Club Med in the future because of their handling of the crisis. Club Med said on Twitter in August that it would refund all customers within 60 days of them making a refund request.Â The European Commission ruled in May that customers of tour operators have the right to a full cash refund within 14 days of their vacation being canceled. In the U.K., the Competition and Markets Authority in July said that it had received 17,500 complaints about travel companies breaching regulations since March. The CMA said it expects businesses to comply with rules that say airlines that cancel flights must offer cash refunds within seven days, while package holiday operators are obliged to do so in 14 days. Ben Cordwell, travel and tourism analyst at analytics company GlobalData, said some companies will struggle to pay out refunds to all customers given the scale of the coronavirus impact.Â â\u0080\u009cI wouldnâ\u0080\u0099t be surprised to see companies going bust if they are made to issue all refunds immediately,â\u0080\u009d Cordwell said. â\u0080\u009cIt is no secret that companies are struggling financially at the moment and if the industry isnâ\u0080\u0099t back up and running soon, weâ\u0080\u0099re almost certainly going to see casualties,â\u0080\u009d he added. Sunweb customer Dennis Skinner told MarketWatch he was â\u0080\u009cincredibly upset and disappointedâ\u0080\u009d by the companyâ\u0080\u0099s response after his package holiday to the Tomorrowland Winter Music festival in French ski resort Alpe dâ\u0080\u0099Huez was canceled. Read: How the canceled music festival Tomorrowland Winter is getting a private-equity-owned travel giant entangled in a legal fight Tickets to the festival cost as much as $5,000, and included travel, ski passes, and accommodation for the event, which was scheduled for March.Â Skinner received an email from a Sunweb representative, seen by MarketWatch, that said, â\u0080\u009cWhile the European Commission is aware that the travel industryâ\u0080\u0099s survival is of unprecedented importance to all countries, it seems to have forgotten that the ruling will inevitably lead to bankruptcies in which our customers are ultimately the worst victims.â\u0080\u009d Scott Dunn has also been criticized over refund delays on the review website TrustPilot and across social media.Â One Twitter user said: â\u0080\u009cHas anyone had any success getting a cash refund from Scott Dunn? They are now outside the 14 days cash refund period for us, and are in BREACH of the law! Disgusting company, and will never travel with them again.â\u0080\u009dÂ In a review on the companyâ\u0080\u0099s TrustPilot page, a customer said they have reported the company to the CMA and that they will not travel with Scott Dunn again.Â But Davies said it has seen pent-up demand, which has boosted bookings for short-haul travelers. â\u0080\u009cIncreasingly our guests have recently been choosing to opt for an exchange over cash refund,â\u0080\u009d she said. British travel trade association Abta told MarketWatch that those who have handled the crisis worse will lose out as the crisis passes, as companies who performed better will have built up goodwill. It also said it expected members to process refunds. â\u0080\u009cAbta has always expected its Members to refund customers without undue delay,â\u0080\u009d a spokesperson said. A spokesperson for the European Comission told MarketWatch: â\u0080\u009cThe European Commission has underlined repeatedly throughout the coronavirus crisis, the rights of consumers in the EU should always be protected as per EU law.â\u0080\u009d It has opened infringement proceedings against several countries for allowing companies to offer refund credit notes in place of cash refunds, which it said â\u0080\u009cdeprives travelers and passengers of their right to choose between being reimbursed in cash or by a voucher for the payment made for their trip.â\u0080\u009dÂ"}]}