{"article": [{"url": "https://www.marketwatch.com/story/russian-intelligence-is-spreading-coronavirus-disinformation-in-us-officials-warn-2020-07-28", "published": 1595958200.0, "headline": "Russian intelligence is spreading coronavirus disinformation in U.S., officials warn", "body": "WASHINGTON — Russian intelligence operatives are using a trio of English-language websites to spread disinformation about the coronavirus pandemic, seeking to exploit a crisis that America is struggling to contain ahead of the presidential election in November, U.S. officials said Tuesday. Two Russians who have held senior roles in Moscow’s military intelligence service known as the GRU have been identified as responsible for a disinformation effort directed at American and Western audiences, U.S. government officials said. They spoke to The Associated Press on condition of anonymity because they were not authorized to speak publicly. The information had previously been classified, but officials said it had been downgraded so they could more freely discuss it. Officials said they were doing so now to sound the alarm about the particular websites and to expose a connection between the sites and Russian intelligence. Between late May and early July, one of the officials said, a trio of websites published about 150 articles about the pandemic response, including coverage aimed at propping up Russia and denigrating the U.S. Among the headlines that caught the attention of U.S. officials are “Russia’s Counter COVID-19 Aid to America Advances Case for Détente,” which suggested that Russia had given urgent and substantial aid to the U.S. to fight the pandemic, and “Beijing Believes COVID-19 is a Biological Weapon.” The disclosure comes as the spread of disinformation, including by Russia, is an urgent concern heading into November’s presidential election as U.S. officials look to avoid a repeat of the 2016 contest, when Russia launched a covert social media campaign to divide American public opinion to favor then-candidate Donald Trump. The country’s chief counterintelligence official warned in a public statement Friday about Russia’s continued use of internet trolls to advance their goals. Even apart from politics, the twin crises buffeting the country and much of the world — the pandemic and race relations and protests — have offered fertile territory for misinformation or outright falsehoods. Officials described the disinformation as part of an ongoing and persistent Russian effort to cause confusion. They did not say whether the effort was directly related to the November election, though some of the coverage on the websites appeared to denigrate Trump’s Democratic challenger, Joe Biden. The stories call to mind Russian efforts from 2016 to exacerbate race relations in America and drive corruption allegations against U.S. political figures. U.S. officials on Tuesday singled out a news agency, InfoRos.ru, that operates a trio of websites InfoRos.ru, Infobrics.org and OneWorld.press — that they say have leveraged the pandemic to promote anti-Western objectives and to spread disinformation. The sites promote their narratives in a sophisticated but insidious effort that officials liken to money laundering, where stories in well-written English — and often with pro-Russian sentiment and anti-U.S. sentiment — are cycled through other news sources to conceal their origin and enhance the legitimacy of the information. The sites also amplify stories that originate elsewhere, the government officials said. The sites focus on contemporary politics as well. A headline Tuesday on InfoRos.ru about the unrest roiling major American cities read “Chaos in the Blue Cities,” accompanying a story that lamented how New Yorkers who grew up in the tough-on-crime approach of Mayors Rudy Giuliani and Michael Bloomberg “must adapt to life in high-crime urban areas.” Another story carried the headline of “Ukrainian Trap for Biden,” and claimed that “Ukrainegate” — a reference to stories surrounding Biden’s son Hunter’s former ties to a Ukraine gas company — “keeps unfolding with renewed vigors.” Two individuals who have also held leadership roles at InfoRos, identified Tuesday as Denis Valeryevich Tyurin and Aleksandr Gennadyevich Starunskiy, have previously served in a GRU unit specializing in military psychological intelligence and maintain deep contacts there, the officials said. InfoRos and One World’s ties to the Russian state have attracted scrutiny in the past from European disinformation analysts. In 2019, a European Union task force that studies disinformation campaigns identified One World as “a new addition to the pantheon of Moscow-based disinformation outlets.” The task force noted that One World’s content often parrots the Russian state agenda on issues including the war in Syria. A report published last month by a second, nongovernmental organization, Brussels-based EU DisinfoLab, examined links between InfoRos and One World to Russian military intelligence. The researchers identified technical clues tying their websites to Russia and identified some financial connections between InfoRos and the government. “InfoRos is evolving in a shady grey zone, where regular information activities are mixed with more controversial actions that could be quite possibly linked to the Russian state’s information operations,” the report’s authors concluded. On its English-language Facebook page, InfoRos describes itself as an “Information agency: world through the eyes of Russia.”"}]}