{"article": [{"url": "https://www.marketwatch.com/story/apple-2-trillion-this-chart-might-have-you-rethinking-your-investment-2020-07-13", "published": 1594641620.0, "headline": "Apple $2 trillion? This chart might have you rethinking your investment", "body": "Apple shares opened the week with another strong push to the upside, rallying toward a fourth straight record and approaching a $2 trillion valuation. Excitement is running high thanks to the “massive pent-up iPhone 12 cycle,” according to Wedbush analyst Daniel Ives, who just raised his price target on the stock to $450 from $425. “We believe in China alone between 60 million to 70 million iPhones are in the window of an upgrade opportunity over the next year with Apple going aggressively at all price points (SE, iPhone 12) to cement its installed base despite competitive pressures from domestic players,” he wrote, adding that he believes Apple could be the first company to notch a $2 trillion market cap. Jesse Felder of the popular Felder Report, however, tapped the brakes on the bullishness. He tweeted this chart to show how Apple’s rally — up about 40% over the past three months — has pushed the stock to risky levels compared with how the business is actually faring. “Apple just passed its all-time peak valuation seen in mid-2007 when revenues were growing 90% year-over-year as a result of the introduction of the iPhone,” Felder wrote in the tweet. “Revenues for the company’s fiscal Q3 ending in June are expected to fall 5%.” As one of his followers pointed out, “It’s pretty much a videogame at this point. I’m a big AAPL fan, but it’s stock trades nothing like it’s fundamentals.” Apparently, that doesn’t matter to investors buying into Apple’s future. A recent peek into Warren Buffett’s Berkshire Hathaway shows almost half of the company’s $214 billion publicly traded portfolio is made up of Apple stock. It’s not just individual investors, like 30-something billionaire Ryan Cohen and his massive stake, who are relying heavily on Apple’s performance. The market, as a whole, has become increasingly dominated by Apple and a few other big tech names. If it weren’t for the huge gains logged by the “Giant 5,” Apple AAPL, +1.74% , Microsoft MSFT, +2.48% , Amazon AMZN, +3.01% , Alphabet GOOG, +1.97% and Facebook FB, +0.26%, the broader market has delivered virtually nothing in recent years. At last check, Apple was up more than 3% Monday, while the Dow Jones Industrial Average DJIA, +0.56% , S&P 500 SPX, +0.87% and Nasdaq COMP, +1.39% were all moving higher."}]}