{"article": [{"url": "https://www.marketwatch.com/story/amazon-has-the-right-businesses-to-weather-coronavirus-but-spending-could-grow-even-faster-2020-04-13", "published": 1595599400.0, "headline": "Amazon has the right businesses to prosper during coronavirus, but spending could grow even faster", "body": "Amazon.com Inc.’s stock has soared to record heights since mid-March, catapulting the company’s market value to over $1.5 trillion, because in the age of COVID-19 it is arguably Big Tech’s best-positioned player. Amazon AMZN, +3.01% , which logged a monster first quarter on the strength of its dominant e-commerce business, the Amazon Web Services cloud-computing offering, and Amazon Prime Video streaming, is expected to repeat the feat when it reports second-quarter earnings on July 30. Just look at the estimates of several high-profile street analysts, led by Goldman Sachs’ Heath Terry, who jacked up his annual revenue estimate on Amazon to $361.5 billion on July 20 – easily topping Wall Street consensus of $348.5 billion — and hoisted his price target on the stock to a street high $3,800 from $3,000. However, as Amazon has proved many times, its spending can easily outpace revenue growth even if sales are extremely strong. As the company ramps up hiring — a push to add 100,000 new workers recently grew by another 75,000 to meet demands in retail — its infrastructure, and bottom line, will be taxed. Chief Executive Jeff Bezos said in late April the company will spend $4 billion or more on its coronavirus response in the second quarter, which should wipe out its operating profit. “If you’re a shareowner in Amazon, you may want to take a seat,” Bezos said at the time. The jump in expenses will come from spending “hundreds of millions of dollars” developing testing capabilities for all of its employees for COVID-19, starting with front-line workers; personal protective equipment for the company’s hundreds of thousands of employees; “enhanced cleaning” of its facilities; and “higher wages for hourly teams.” Read more: Amazon will spend $4 billion or more on coronavirus response, potentially wiping out Q2 profit Still, the investment is essential if Amazon is to serve a home-bound country increasingly reliant on online shopping and streaming for entertainment. Case in point: Amazon’s hiring of 175,000 more full- and part-time workers in its distribution and delivery centers to get essential supplies to a nation crippled by coronavirus. Amazon has about 800,000 employees worldwide. See also: Amazon to add 100,000 warehouse, delivery workers to handle spike in demand Amazon’s breakaway growth hasn’t gone unnoticed. Federal regulators continue to scrutinize the company’s business practices, especially in how it impacts third-party businesses whose products compete with those of Amazon on its sprawling digital platform. Bezos is one of four tech CEOs scheduled to speak before the House on antitrust matters. The others are Tim Cook of Apple Inc. AAPL, +1.74% , Mark Zuckerberg of Facebook Inc. FB, +0.26% , and Sundar Pichai of Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% .How the numbers are changing Revenue: Average analyst expectations for second-quarter revenue were $75.36 billion at the end of 2019, and have increased to $81.1 billion as of July 23. Revenue for the powerhouse Amazon Web Services have stayed steady at $11 billion in that time period, according to FactSet. For the full year, FactSet expects revenue of $348 billion, nearly half ($177.1 billion) of which will come from online store sales. Earnings: Average analyst expectations from FactSet were $5.86 a share for second-quarter earnings at the end of 2019. After Bezos promised to spend profits, they fell to $1.42 per share as of July 23. For the full year, analysts expect earnings of $18.79 a share. Stock movement: So far in 2020, Amazon shares are up 62%; the broader S&P 500 index is up 0.2% this year.What the company is saying July 10: Amazon shares ended the day at a record $3,200, topping the previous closing record of $3,182.63 set on July 9. June 26: Amazon announced plans to acquire autonomous-car developer Zoox in a deal valued at slightly more than $1.2 billion. Amazon plans to continue development of Zoox’s robot taxi. Within hours of the deal, Tesla Inc. TSLA, +1.89% Chief Executive Elon Musk called Bezos a copy cat on Twitter. April 30: Amazon topped $75 billion in sales in the first quarter as COVID-19 swept across the globe, but profit declined and the company said it might lose money in the current period as it spends to keep up with demand. The company cautioned it will spend $4 billion or more on its coronavirus response, as it invests “hundreds of millions of dollars” developing testing capabilities for all of its employees for COVID-19; personal protective equipment for the company’s hundreds of thousands of employees; “enhanced cleaning” of its facilities; and “higher wages for hourly teams.”What analysts are saying • “Amazon’s Q2 results should be a more extreme version of Q1, with an even greater acceleration in the top line coinciding with continued erosion of the bottom line. Amazon is the main beneficiary of e-commerce’s massive pandemic-driven tailwind, but sales gains come with higher costs for labor and logistics and a shift towards a less profitable category mix of lower-margin grocery and household essentials. Despite the near-term profit hit, Amazon has strengthened its future position in key growth areas like grocery, health and advertising.” — eMarketer principal analyst Andrew Lipsman, on July 24. • Goldman Sachs raised its annual revenue estimate 3.4% to $361.5 billion, from $349.6 billion — topping current Wall Street consensus at $348.5 billion. Its optimism is predicated on accelerated growth of both Amazon’s enterprise cloud computing and consumer adoption of online shopping during the pandemic. — Goldman Sachs analyst Heath Terry, maintaining a buy rating and lifting his price target on the stock to a street high $3,800, from $3,000, on July 20. • “Amazon has been the best performing mega cap this year, and recently, bearish investors have highlighted several arguments to us recently, and think that ‘good news worth several quarters is priced in now.’ ...We believe it is a risky proposition to bet against Amazon, however, we wouldn’t be surprised if near-term focused investors are looking to step to the sidelines ahead of earnings.” — MKM analyst Rohit Kulkarnianalyst, maintaining a buy rating and raising his price target to $3,350, from $2,525, on July 20. This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. It was originally published on April 13."}]}