{"article": [{"url": "https://www.marketwatch.com/story/why-a-joe-biden-presidency-would-help-older-americans-2020-05-29", "published": 1592035820.0, "headline": "Joe Bidenâ\u0080\u0099s retirement reforms are the boldest weâ\u0080\u0099ve seen in generations", "body": "Last year, The Week published an article titled â\u0080\u009cJoe Biden Doesnâ\u0080\u0099t Get It.â\u0080\u009d The article breezily states that Biden supports â\u0080\u009cabysmal ideas like cutting social insurance programs.â\u0080\u009d It quotes the former Vice President as saying: â\u0080\u009cPaul Ryan was correct when he did the tax code. Whatâ\u0080\u0099s the first thing he decided we had to go after? Social Security and Medicareâ\u0080¦Thatâ\u0080\u0099s the only way you can find room to pay for it.â\u0080\u009d Later, the Sanders campaign emailed the article to their supporters. A Sanders staffer cited the above quote and wrote that Biden had â\u0080\u009clauded Paul Ryan for proposing cuts to Social Security and Medicare.â\u0080\u009d But he hadnâ\u0080\u0099t. The ellipsis in that quote was misleading and the quote itself was cherry-picked. It came from an hour-long speech Biden gave in 2018 on why we should expand the safety net. When he uttered those particular words, Biden was parodying Ryan, whose ideas he cited as being antithetical to his own. How annuities could protect your retirement income That speech wasnâ\u0080\u0099t empty rhetoric. Last summer, Biden released a comprehensive plan for reforming retirement policy, yet it received little media attention. While political pundits were busy painting Biden, Sanders, and other presidential contenders with broad verbal brushes such as â\u0080\u009cmoderateâ\u0080\u009d and â\u0080\u009cliberal,â\u0080\u009d they spent little time diving into the candidatesâ\u0080\u0099 plans. Bidenâ\u0080\u0099s actual policies tell a different story than any out-of-context quote, misleading email, or vague epithet ever will: Uncle Joe has a deeply progressive economic agenda. His Social Security proposals are a case in point. Under the current Social Security system, the highest-wage workers receive the most generous benefits. A retiree with average lifetime earnings of $1,000 a month receives a Social Security check of $877. A retiree who made $10,000 a month, on the other hand, receives a monthly benefit of $3,040. The current Social Security benefit structure is depicted in the graph below. Biden wants to increase benefits for retirees who, on account of their low lifetime wages, had trouble saving for retirement. For the very poorest retirees, benefits from Social Security and SSI would increase by as much as $6,500 a year. The Social Security Administration estimates that a transition to the Biden benefit structure (shown in the graph below) would pull over half a million seniors out of poverty in 2030. Along with helping formerly low-wage workers, Bidenâ\u0080\u0099s plan aids two other vulnerable groups: the eldest of the elderly, and the widowed. Retiree poverty rates rise in lockstep with age: as seniors draw down on their retirement accounts, their incomes tend to fall. Because no one knows how long they will live, retirees who outlive their savings rely predominantly on their Social Security benefits. Increasing aid to the oldest retirees â\u0080\u0094 say, those 85 or above â\u0080\u0094 is an obvious solution to this problem. Thereâ\u0080\u0099s just one holdup: Socioeconomic gaps in life expectancy are growing, so a special â\u0080\u009celder benefitâ\u0080\u009d would mostly help the rich. Here too, Biden has a solution. His plan would increase benefits for all seniors who had received Social Security checks for at least 20 years. Since the poor start claiming benefits at younger ages than the rich, this minor tweak would open the elder benefit to people in real need. Finally, Bidenâ\u0080\u0099s plan would increase benefits for widows and widowers. Under current law, when a husband or wife dies, the surviving spouse is left with the higher of two amounts: either their own Social Security check, or half of their dead partnerâ\u0080\u0099s check. This scheme fails to account for what economists call â\u0080\u009ceconomies of scale.â\u0080\u009d When the size of oneâ\u0080\u0099s household decreases by half, the costs of living donâ\u0080\u0099t fall by the same amount. The surviving spouse can spend less on food and drinks, but they canâ\u0080\u0099t sleep on half a bed or use half a toilet. According to the methodology endorsed by the Congressional Budget Office, when a two-person household becomes a one-person household, total costs fall by 29%. The Biden campaign appears to be listening to the experts: under their plan, when one partner dies, the survivor will receive 75% of the coupleâ\u0080\u0099s joint spousal benefit. This policy will be especially helpful to low-income widows, since women tend to have lower earnings and longer lives than men. In total, benefits are expected to increase about 20% for the affected seniors. These are not halfhearted measures. Biden has been portrayed as a moderate throughout the 2020 campaign, and in some regards, that is probably an accurate moniker. He is moderate in temperament and style, and often expresses centrist attitudes toward social policy and culture. But he is not moderate when it comes to helping the poor. His economic policy proposals reflect Franklin Delano Roosevelt more than Paul Ryan. When it comes to retirement policy, Biden is proposing the boldest set of reforms since the creation of Social Security itself. Nick Buffie is a second-year Masterâ\u0080\u0099s in Public Policy student at the Harvard Kennedy School (HKS). Before coming to HKS, Buffie spent three years working at two economic policy think tanks in Washington, D.C."}]}