{"article": [{"url": "https://www.marketwatch.com/story/trump-is-losing-big-to-biden-in-voter-polls-heres-how-this-will-likely-play-out-on-election-day-2020-07-27", "published": 1595852000.0, "headline": "Trump is losing big to Biden in voter polls. Hereâ\u0080\u0099s how this will likely play out on Election Day", "body": "“ The 2016 election has left many voters in 2020 with polling PTSD. ” â\u0080\u009cThe only poll that matters is the one on Election Day.â\u0080\u009d This election adage gets tossed out pretty much every time a new political poll drops â\u0080\u0094 a product of the many election night surprises seen over the years, where the winner of the election ended up being the loser of the polls.Â This is exactly what happened in the 2016 U.S. presidential election, when key Midwestern states in the Democratsâ\u0080\u0099 â\u0080\u009cBlue Wallâ\u0080\u009d consistently produced leads for Hillary Clinton over Donald Trump that were well outside of the margins of error, but where Trump ended up with narrow victories â\u0080\u0094 a trifecta of upsets for the record books.Â The 2016 election has left many voters in 2020 with polling PTSD. During the Democratic primary period, Joe Biden, now the partyâ\u0080\u0099s presumptive nominee and then one of only two Democratic prospects with name recognition high enough to conduct head-to-head ballot tests against President Trump, enjoyed on average aÂ 4.5-point advantage against TrumpÂ â\u0080\u0094 just outside most surveyâ\u0080\u0099s margins of error.Â Had the dynamics of the race stayed there, Democratic hand-wringing and poll-doubting would no doubt still be quite intense. At that time onlyÂ my forecasting modelÂ was confident of a Biden victory in Novemberâ\u0080\u0099s general election. But a once-a-century global pandemic has altered American life, sent the U.S. economy into a tailspin, and tested Americaâ\u0080\u0099s â\u0080\u009cchaos presidentâ\u0080\u009d â\u0080\u0094 a test many voters now say Trump is failing.Â Indeed, Trumpâ\u0080\u0099s mismanagement of the U.S. response to the coronavirus pandemic has accomplished the seemingly impossible in this polarized era: It has spurred a seismic shift in voter preferences among independents. What was aÂ 13-point advantageÂ for Trump among independents in theÂ YouGov/EconomistÂ tracking panel of registered voters in March is currently aÂ 9-point Biden advantageÂ in their most recent poll â\u0080\u0094 a total swing of 22 points.Â “ A new anxiety is seeping in among Democrats â\u0080\u0094 what if it happens again?Â ” In poll after poll, Biden now holds double-digit leads nationally in head-to-head contests against Trump, along with robust leads in an ever-expanding map of swing states. In some ways, it feels like 2016 again. With less than 100 days before the 2020 election, a new anxiety is seeping in among Democrats â\u0080\u0094 what if it happens again?Â It, of course, refers to the 2016 election night shock of seeing states like Wisconsin, long marked â\u0080\u009csafeâ\u0080\u009d for Clinton, instead popping into vibrant GOP red on whichever election tracker you were using that night. Though the public has a general sense of \"the polls got it wrong in 2016,â\u0080\u009d few voters understand what specifically went wrong.Â Although itâ\u0080\u0099s a complex topic with many moving parts and contributing elements, three major factors generally contribute to election night surprises. The most common explanation is a sudden, last-minute shift in voter preferences, which, while rare, certainly can happen. More likely though, what looks like a last-minute preference change is usually the product of a decent number of undecided voters coming down the stretch who break decisively against the candidate who has been leading in the polls, causing that lead to reverse at the ballot box.Â This is partly what happened in Michigan, Wisconsin, and Pennsylvania in 2016.Â Although over-representation of college-educated voters in the Midwest state surveys impacted polling estimates in these states, atypically high third-party and write-in balloting, combined with abnormally high numbers of undecided voters who thenÂ broke disproportionately for Trump, played a big role in Americaâ\u0080\u0099s election night surprise.Â A polling autopsy I conducted on 2016 polls for myÂ book on the 2016 electionÂ revealed how clear a signal in the aggregated polling data these atypically large numbers of undecided voters were sending out â\u0080\u0094 one that in retrospect should have been obvious. In fact,Â Nate Silver of 538.com did cite a high percentage of undecideds as a factor for why his election model was slightly more generous to Trump than others.Â Undecided voters decide elections To illustrate just how high the number of undecideds were in 2016, and how atypical this was, consider that at the end of October 2012 just 5% of voters remained undecided in their presidential choice.Â In 2016 that percentage tripled to 15%. Meaning that instead of a forgone conclusion for Clinton, the narrative for the 2016 election should have been that â\u0080\u009canything can happen.â\u0080\u009d The failure wasnâ\u0080\u0099t the polls â\u0080\u0094 but in how they were interpreted.Â Pollsters, and those who covered them, generally failed to notice or at least greatly minimized a clear signal in the 2016 data â\u0080\u0094 the unusually high numbers of voters breaking for the third party or write-in option. Due to variation in the way pollsters deal with voters who indicate a choice that is not one of the two party nominees or undecided, this was a noisier signal than the \"undecided\" signal. One of the reasons people, myself included, were dismissiveÂ of such \"protest voting\" data is the well-known and well-documented tendency for third-party support to be overstated in polls. But third-party balloting, especially factoring in the historically high 2016 write-in ballots, was on average, three times higher than in the past four presidential election cycles. In Wisconsin, for example, where Trump won by just 0.7 of a point, almost 7% of the electorate cast \"protest\" ballots.Â “ Democrats and left-leaning independents are more likely to vote since Trump got elected. Â ” A second source of poll-result disconnect occurs when the electorate ends up â\u0080\u009clooking differentâ\u0080\u009d than what pollsters modeled. In 2016, pollsters expected an electorate that was slightly more diverse and younger than the one that ended up casting ballots, especially in cities like Detroit, Philadelphia, and Milwaukee. Pollsters weight surveys to reflect anticipated turnout â\u0080\u0094 the demographic composition of the electorate that actually shows up to vote â\u0080\u0094 in terms of race, gender, age, and education. This can lead to overestimates of Democratic candidate support, which is why Clinton failed to capture the White House, and why Democrats across the Senate and House maps underperformed despite strong poll numbers. Sometimes when good polls go bad, it's because of a significant, aggregate voter behavior change pollsters fail to anticipate, or anticipate fully, such as the massive voter turnout surgesÂ that have erupted in elections since 2016 as a backlash to Trump. These turnout surges form the foundation of my election forecasting work: the American electorate is changing significantly due to â\u0080\u009cnegative partisanship,â\u0080\u009d which argues that along with positive emotions about their own political party, partisans experience negative emotions about the opposition party, particularly hate and fear. Applying negative partisanship to voting behavior shows that Democrats and left-leaning independents are more likely to vote since Trump got elected. Â 2020 polling is sending clear signals Another major source of poll-result disconnect occurs because of the way polls are interpreted. Most of this confusion ties back to whatâ\u0080\u0099s called the â\u0080\u009cmargin of error.â\u0080\u009dÂ Margin of error introduces error estimates ranging from 3-to-5 points. Polls inside the margin of error, unless they are stretchedÂ toÂ the outside bands of it, should only be characterized as â\u0080\u009ctoss-ups.â\u0080\u009dÂ So, what if a candidate has a lead of say 8- or 9-points, which is well outside of the margin of error, and it is a consistentÂ finding across multiple polls? Should the polls be trusted?Â This is, of course, exactly where the Trump vs. Biden polling is right now. And as in 2016, the 2020 polling is sending clear signals.Â The â\u0080\u009cDems in Disarrayâ\u0080\u009d issue of 2016 has been replaced with early signs of solid party unity as Democrats rally around Biden. Already,Â 91% of Democrats indicate they plan to vote for him.Â In 2016 after Bernie Sanders ceded the presidential nomination to Clinton,Â just 84% of Democrats had rallied behind her â\u0080\u0094 an ominous sign of the trouble to come and another clear signal from polling data that we didnâ\u0080\u0099t take seriously, though in context, Republicans were also having \"rallying\" issues at that time. Although it is early, myÂ Lincoln ProjectÂ colleagues are working hard to chip away at Trump's support among Republicans, which has dipped toÂ 88% in the latest YouGov/Economist poll.Â The 2020 election also stands in stark contrast to 2016 in terms of how many undecided voters there are. Few voters are on the sidelines in an election with stakes for the future of the country as high as the election of 1860. Compared to 2016â\u0080\u0099s 15% undecided voter pool, a scant 4% of voters now report being Â â\u0080\u009cnot sureâ\u0080\u009d who they will vote for, according toÂ YouGov/Economist polling, which I should emphasize is polling registered voters and is not yet imposing any type of likely voter modeling. These are sure signs that voters know what side they are on in this election, which with the addition of the pandemic has become a referendumÂ on America herself.Â Another key difference from 2016 is that voters hate one presidential candidate far more than the other. Granted, in this polarized era, it's all but impossible to be loved in the political arena. A more achievable goal is to be less vilified than your opponent. Not only does Biden come out neutral, or close to it, on the net favorability ratio compared to Trump's massive net deficit, but among voters who say they dislike both candidates, the Democrats have the edge:Â Biden is heavily favored over Trump.Â Read: AP-NORC poll finds just 32% approve of Trumpâ\u0080\u0099s handling of pandemic Plus: Trump plays on fears in campaign for suburbs This fall will bring us hundreds of polls, on the presidential race as well as competitive Senate and House races. In terms of polling, we've never had access to more data, and other thanÂ challenges pollsters face getting people to take surveys, polling has never been more sophisticated or better executed.Â Pollsters, and the people who consume polls can mitigate polling \"surprises\" by demystifying polls and familiarizing themselves with the capabilities, and the limitations, of horse raceÂ polling. As much as pundits and the media will hate to hear this, the hard truth is that in races where polls put the candidates competing within the margin of error, the only statisticallyÂ valid conclusion is that the race is highly competitive. With better education as to the statistical limitations of polling data, there would be far fewer Election Day surprises. With great polling comes great responsibility to convey its limitations and not to oversell its capabilities.Â RachelÂ BitecoferÂ is theÂ election forecasterÂ and senior fellow atÂ The Niskanen Center, host ofÂ The Election Whisperer podcast, and senior adviser to The Lincoln Project. She is the author ofÂ The Unprecedented 2016 Presidential Election (Palgrave Macmillan, 2017). Follow her atÂ @RachelBitecoferÂ on Twitter. Read:As Trump trails in national polls, his new campaign manager says the surveys â\u0080\u0098keep getting it wrongâ\u0080\u0099 More: Lincoln Project is needling Trump the way he needled Hillary over her emails Â Â"}]}