{"article": [{"url": "https://www.marketwatch.com/story/3-white-men-indicted-on-murder-charges-in-killing-of-ahmaud-arbery-2020-06-24", "published": 1593021380.0, "headline": "3 white men indicted on murder charges in killing of Ahmaud Arbery", "body": "ATLANTA — A prosecutor on Wednesday announced that three men have been indicted on murder charges in the killing of Ahmaud Arbery in coastal Georgia. Speaking to reporters outside the Glynn County courthouse, prosecutor Joyette Holmes said a grand jury has indicted Travis McMichael, Greg McMichael and William “Roddie” Bryan Jr. on charges including malice and felony murder in the death of the African American man. “This is another positive step, another great step for finding justice for Ahmaud, for finding justice for this family and the community beyond,” Holmes said during the news conference, which was streamed online by news outlets. Lawyers for the McMichaels have cautioned against a rush to judgment and have said the full story will come out in court. A lawyer for Bryan has maintained that his client was merely a witness. Arbery was slain Feb. 23 when the Greg and Travis McMichael, a white father and son, armed themselves and pursued the 25-year-old Black man running in their neighborhood. Greg McMichael told police he suspected Arbery was a burglar and that Arbery attacked his son before being shot. Bryan lives in the same subdivision, just outside the port city of Brunswick. Bryan said he saw the McMichaels driving by and joined the chase, a Georgia Bureau of Investigation agent testified earlier this month. It wasn’t until May 7 — two days after Bryan’s cellphone video leaked online and stirred a national outcry — that the McMichaels were arrested. Bryan was arrested on May 22, and an arrest warrant said he tried “to confine and detain” Arbery without legal authority by “utilizing his vehicle on multiple occasions” before Arbery was shot. In addition to malice murder and felony murder charges, the McMichaels and Bryan each are charged with two counts of aggravated assault and one count each of false imprisonment and criminal attempt to commit false imprisonment. Court functions in Georgia have been severely limited in recent months because of a statewide judicial emergency declared by the chief justice of the state Supreme Court in response to the coronavirus pandemic. Holmes said they were able to call in a grand jury that had been impaneled prior to the judicial emergency. They followed public guidelines, providing hand sanitizer to the grand jurors and allowing them to sit far apart, she said. Because of the uncertainty caused by the virus, the Arbery family didn’t know when the next steps would be taken after a probable cause hearing held earlier this month, Holmes said. But they were notified as soon as the grand jury returned an indictment, she said. “The family was ecstatic to hear that it had happened this morning,” she said. Bob Rubin, a lawyer for Travis McMichael, said in an email that prosecutors choose the facts they want to present to a grand jury when seeking an indictment. The defense team has found other facts “that are an integral part of the case,” he wrote. “To this indictment, Travis McMichael will plead not guilty, and we look forward to presenting all of the facts regarding this tragic death in a court of law,” Rubin wrote. Attorney Kevin Gough, who represents Bryan, spoke to reporters at the county courthouse right after Holmes announced the indictment. “We welcome the action of the grand jury today,’ Gough said. “While we disagree with it, it’s an important step in the process to moving this case closer to the speedy trial that Roddie has demanded.” He said his client has committed no crime and has cooperated with law enforcement officers from the beginning. Lawyers for Greg McMichael did not immediately respond to an email seeking comment Wednesday afternoon."}]}