{"article": [{"url": "https://www.marketwatch.com/story/feds-brainard-eyeing-weak-recovery-says-new-policy-tools-may-be-needed-2020-07-14", "published": 1594736960.0, "headline": "Fed's Brainard, eyeing weak recovery, says new policy tools may be needed", "body": "Federal Reserve Governor Lael Brainard on Tuesday said the economic recovery from the pandemic will likely have a hard time gaining traction and the central bank might have to use a new policy tool - known as yield curve control - to help bolster economic growth. In remarks to a National Association for Business Economics webcast, Brainard said the outlook for the economy was covered by \"a thick fog of uncertainty.\" Even if the rate of the spread of COVID-19 slows down, the economy \"is likely to face headwinds,\" she warned. Latest data available to the Fed suggest the strong job gains in May and June might not be sustained, she added. Brainard is the only Fed governor remaining who was not appointed by President Donald Trump. Some analysts speculate she might be on Democratic presidential candidate Joe Biden's short-list to be the next Fed chairman. In her remarks, Brainard said that Congress and the administration have a big role to play on how the economy performs in the short-run. The strength of the recovery will deepend on fiscal policy, she said. Over the longer term, Brainard said the Fed will have to take more steps to boost economic growth. At the moment, Fed policy is aimed at stabilizing conditions, she said, but there will have to be a \"pivot\" to \"accommodation,\" she said. One policy that might be effective would be for the Fed to promise not to move rates above zero until inflation reaches the central bank's 2% target. This forward guidance might be reinforced by the Fed setting targets for the short-to-medium end of the U.S. Treasury yield curve, Brainard said. Research shows this might lead to some temporary modest overshooting of the target, which would help offset the previous underperformance, she said. Here is where yield curve control, or capping interest rates for shorter-maturities, might come in, Brainard said. \"There may come a time when it is helpful to reinforce the credibility of forward guidance and lessen the burden on the balance sheet with the addition of targets on the short-to-medium end of the yield curve,\" Brainard said. Other Fed officials in recent weeks have expressed wariness about adopting yield-curve controls but Brainard said she was open to more analysis and discussion of this approach. Yields on 10-year Treasury notes TMUBMUSD10Y, 0.777%  are not far above the low of 0.5% hit in early March."}]}