{"article": [{"url": "https://www.marketwatch.com/story/what-are-medicare-advantage-plans-and-are-they-worth-the-risk-2020-10-01", "published": 1601529080.0, "headline": "What are Medicare Advantage plans, and are they worth the risk?", "body": "This article is reprinted by permission from NerdWallet. About 1 in 3 people 65 and older in the U.S. enroll in Medicare Advantage, the private insurance alternative to traditional Medicare. It’s not hard to see why: Medicare Advantage plans often cover stuff that Medicare doesn’t, and most people don’t pay extra for it. But Medicare Advantage can be more expensive if you get sick because copays and other costs can be higher, says Katy Votava, president of Goodcare.com, a health care consultant for financial advisers and consumers. Unhappy customers who want to switch back to traditional Medicare may find they no longer qualify for the supplemental policies to help pay their medical bills, or that they would face prohibitively high premiums. “These are complicated products,” says Votava, author of “Making the Most of Medicare.” “They’re like nothing else, no other insurance that people encounter anywhere until they get to Medicare.”Medicare’s alphabet soup The first hurdle many people face when deciding about Medicare coverage is simply understanding how the various parts fit together. Traditional Medicare, also known as original Medicare, has two parts: Part A covers hospitalization and is typically premium-free. Part B covers outpatient care, including doctor visits, and has a standard monthly premium of $144.60 for 2020, although higher-income people pay more. You can choose any doctor who accepts Medicare, and most do. The government pays health care providers directly. Part D is prescription drug coverage, which is provided by private insurers. The drugs that are covered and the amounts you pay out of pocket vary widely. Monthly premiums vary as well but average $32.74 in 2020. Don’t miss: Payroll tax deferral messes with Social Security — one of the few good things in this crazy world Traditional Medicare has deductibles, copays and coinsurance that can quickly add up. To cover these gaps, private insurers also offer supplemental plans known as Medigap. The average monthly Medigap premium in 2019 was $152, according to health insurance marketplace eHealth.com, but it can be lower or much higher depending on the plan, the insurer and the area where you live. The plans are known by letters A through N. As with traditional Medicare, you can choose any doctor who accepts Medicare. If you apply for a Medigap policy when you’re first eligible for Medicare, the insurer has to accept you and can’t charge more for preexisting conditions.How Medicare Advantage is different Medicare Part C is Medicare Advantage. Rather than add to the other parts of Medicare, however, Medicare Advantage plans replace them. Insurers that offer Medicare Advantage are required to provide all the benefits of Part A and Part B, and most plans include Part D drug coverage as well. In addition, the plans typically cover certain expenses that Medicare doesn’t, such as hearing, vision and dental care. Also see: Social Security missteps could push millions of elderly Americans into poverty Most Medicare Advantage enrollees in 2020 paid no additional premiums for their coverage, other than their regular Part B premiums, according to the Kaiser Family Foundation, a health research group.How Medicare Advantage manages costs Medicare Advantage plans are similar to employer-provided group health insurance: To be covered, you typically must choose health care providers in the insurance company’s network. The network may be relatively narrow if the plan is a health maintenance organization (HMO) or somewhat broader if it’s a preferred provider organization (PPO). You may need preapproval for certain types of care or referrals to see specialists. If you go out of network, your costs may not be covered or may not apply to your out-of-pocket limits. Even if your doctor is in-network now, that could change and you might not get much notice. Also, Medicare Advantage plans are typically regional. If you move out of the area or travel to other states, you may not be covered. The devil’s in the details, and Medicare Advantage plans have many, many details. The average Medicare beneficiary has access to 28 Medicare Advantage options, with varying networks, coverage, deductibles, copays and co-insurance, according to the Kaiser Family Foundation. In general, though, Medicare Advantage costs less upfront and potentially more overall if you need lots of medical care. Many Medigap plans have higher upfront costs but cover most if not all of your expenses when you need care. If you want to switch from one Medicare Advantage plan to another, you can do so during annual enrollment periods. But if you want to switch from Medicare Advantage to traditional Medicare, you often won’t have guaranteed access to a Medigap policy. That means the insurer may charge you more, exclude preexisting conditions for a time or not issue you a policy at all. Read more: Medicare enrollment: How to sign up if you’re a new member That doesn’t mean Medicare Advantage plans are a poor choice — just a complicated one, says Tatiana Fassieux, a training specialist with California Health Advocates, a Medicare advocacy nonprofit. She recommends people contact their state health insurance assistance program, which can provide free, unbiased one-on-one counseling. Links to these programs can be found by visiting the SHIP National Technical Assistance Center. “People should not rely exclusively on television commercials,” Fassieux says. “That’s when people get stuck and sometimes make the wrong decision.”More from NerdWallet: Smart Money Podcast: Fake Reviews and Saving ‘Too Much’ Is Moving Now Your Best Financial Move? When Debt Relief Does More Harm Than Good Liz Weston is a writer at NerdWallet. Email: lweston@nerdwallet.com. Twitter: @lizweston."}]}