{"article": [{"url": "https://www.marketwatch.com/story/oil-futures-inch-higher-after-inventory-report-shows-big-fall-in-us-supplies-2020-07-01", "published": 1593616880.0, "headline": "Oil futures end higher as U.S. supply marks biggest weekly decline of the year", "body": "Oil futures ended higher Wednesday after a U.S. government report showed the largest weekly decline in domestic crude inventories so far this year. “Refining activity above 14 million barrels per day for the first time since late March, [and] combined with a drop in imports and exports holding above three million barrels per day, has led to the largest crude inventory draw of the year so far,” Matt Smith, director of commodity research at ClipperData, told MarketWatch. The Energy Information Administration reported Wednesday that U.S. crude inventories fell by 7.2 million barrels for the week ended June 26. That followed three consecutive weeks of increases. Analysts polled by S&P Global Platts had forecast an average crude supply decline of 2.7 million barrels, while the American Petroleum Institute on Tuesday reported a fall of 8.2 million barrels. The EIA data also showed crude stocks at the Cushing, Okla., storage hub edged down by about 200,000 barrels for the week. The decrease in U.S. supplies has injected some optimism in crude markets, which have been whipsawed by anxieties around the growing spread of COVID-19 and the impact of the contagion on crude demand. On Wednesday, West Texas Intermediate crude for August US:CLQ20 rose 55 cents, or 1.4%, to settle at $39.82 a barrel on the New York Mercantile Exchange. For the first half of the year, prices based on the front-month contracts, were nearly 36% lower, according to Dow Jones Market Data. For the second quarter, however, prices rose nearly 92%. Read:This commodity escaped the first half of 2020 drop in the energy sector Meanwhile, global benchmark Brent oil for September UK:BRNU20 picked up 76 cents, or 1.8%, to $42.03 on ICE Futures Europe. Front-month contract prices fell by almost 38% in the first half of 2020, but was up nearly 81% in the second quarter of the year. Among the oil products, gasoline supply rose by 1.2 million barrels, while distillate stockpiles fell by 600,000 barrels last week, according to the EIA data Wednesday. The S&P Global Platts survey had shown expectations for a supply decline of 2.7 million barrels for gasoline and an increase of 900,000 barrels for distillate inventories. On Nymex, August gasoline US:RBQ20 rose 1.3% to $1.2169 a gallon and August heating US:HOQ20 tacked on 1.1% to $1.1996 a gallon. Crude prices briefly turned negative Wednesday and then bounced back into the green after a report on private-sector from Automatic Data Processing Inc. showed that employers added 2.37 million jobs in June. Economists surveyed by Econoday expected a gain of 3.5 million. “Oil is more concerned with demand-side factors revolving around COVID-19 and risks over another round of lockdowns,” said Lukman Otunuga, senior research analyst at FXTM. The prospects of the Organization of the Petroleum Exporting Countries and its allies, collectively known as OPEC+, easing record production cuts from August is “another theme that continues to cap upside gains,” he told MarketWatch. “Although oil just had its best quarter in 30 years, it will be difficult to mirror such gains in Q3 given the growing list of negative themes haunting investor attraction towards the commodity,” said Otunuga. “Looking at the technical picture, $40 continues to act as a mighty gatekeeper for WTI crude. Sustained weakness below this level may open a path back towards $36,” he added. Round out energy action, August natural gas US:NGQ20 settled at $1.671 per million British thermal units, down 4.6%. The EIA will issue its weekly update on supplies of the fuel Thursday. On average analysts polled by S&P Global Platts expect the report to show an increase of 77 billion cubic feet."}]}