{"article": [{"url": "https://www.marketwatch.com/story/my-husband-of-20-years-is-having-an-affair-he-told-friends-he-wants-a-divorce-and-does-not-want-to-pay-alimony-what-should-i-do-2020-10-06", "published": 1602038360.0, "headline": "My husband of 20 years is having an affair. He told friends he wants a divorce and does NOT want to pay alimony. What should I do?", "body": "Dear Moneyist, I recently discovered evidence that my husband of 20 years is having an affair, and he has made claims to others that he wants out of our marriage. He has not asked me to end the marriage yet, and I have not confronted him with this information. Some of his colleagues have been advising him on ways to get out of the marriage without having to pay alimony. We own our home and have some retirement accounts. His is substantially better (bigger) than mine. Early in our marriage we decided I would stay home for a few years to raise our young children. As they got older, I became employed in a low-paying job that suited our family’s needs. I have worked steadily for 10 years. There is a huge pay gap between us, as my husband has more education and an uninterrupted work history as he has continued to climb the corporate ladder. What can/should I do to protect myself and my children’s financial interests? Should this be done prior to confronting him? Thank you. Wife in Shock in Pennsylvania Dear In Shock, Prepare now, confront later. Have this conversation when you are calm and in a position of strength. One option: If you have a trusted family attorney that you would like to use, call him/her now. If you have a trusted family attorney that you would not like to use, call him/her as your last port of call. If you have discussed your situation with a divorce attorney, they will be unable to represent your husband due to a conflict of interest. Lee Rosen, a divorce attorney in Raleigh, N.C., says talking to the top divorce attorneys in your town can cut both ways. “I don’t think that it’s generally a good approach for people to take,” he writes. “In fact, I think having an excellent attorney on both sides of the divorce case probably facilitates reaching a prompt and equitable settlement.” “When you eliminate the good lawyers from the potential of being involved in the case, I think that sometimes causes things to be harder to get worked out,” he adds. “You might have a great attorney on one side but a mediocre attorney on the other side, and they have a tough time reaching an agreement.” The Moneyist: My wife and I live with my dying mother. My brothers and I will inherit her home. Should I ask her to sell it — and move in with me? Gather financial documents: emails, credit report, debts, bank statements, retirement accounts, savings accounts, stocks and bonds. Pennsylvania is not a community-property state, but any assets or money acquired during your marriage is considered marital property and should be divided equally. That does not include inheritance. Get a copy of the current balance in all your bank accounts, a copy of your marriage license, and a list of your income and expenditures as a couple, including mortgage payments, property tax and life insurance. Rosen advises opening a new credit-card account and new bank account, and depositing money for an emergency in the latter. Pennsylvania divorce law does not automatically entitle one spouse to alimony. However, you’re in a good position given the differences in your income, the length of your marriage, the sacrifices in your career you made during your marriage in order to raise your children, and the circumstances relating to your divorce (your husband’s affair). By the time you confront your husband about his affair, you will have done enough gathering of documents and information that you will know your rights and, hopefully, feel empowered to embark on the next chapter as a single (and free) woman, if that’s what you want. Change all the passwords on your email and other social-media accounts, and stay off social media. You deserve a good relationship and a happy, financially secure life. I wish you all three. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Hello there, MarketWatchers. Check outthe Moneyist private Facebook FB, +0.26% group where we look for answers to life’s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}