{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-and-u-s-equity-futures-fall-after-chaotic-presidential-debate-11601450310", "published": 1601460020.0, "headline": "European stocks struggle choppy after chaotic U.S. presidential debate", "body": "People sit and watch a broadcast of the first debate between President Donald Trump and Democratic presidential nominee Joe Biden on September 29, 2020 in West Hollywood, California. Mario Tama/Getty Images European stocks traded choppy on the last trading day of the month and quarter, with investors rattled by U.S. politics after a messy presidential debate, and by the rising number of coronavirus cases. Bouncing around for most of the session, the Stoxx Europe 600 index SXXP, +0.55% was last up 0.2%. The index was poised for a gain of just 0.3% in the quarter, but around a 1.2% drop for September, the biggest monthly drop since March, according to Dow Jones Market data. The German DAX DAX, +0.06% slipped 0.1% and the French CAC 40 PX1, +0.71% was flat, while the FTSE 100 UKX, +0.64% was up 0.2%. After U.S. futures spent much of the European session lower, Wall Street stocks DJIA, +0.56% SPX, +0.87% COMP, +1.39% opened with modest gains, following Tuesday’s weaker finish on Wall Street. What has been described as an acrimonious and chaotic debate between President Donald Trump and Democratic contender Joe Biden late on Tuesday probably didn’t change the minds of undecided voters, analysts said. “If anything the betting markets have moved slightly in the direction of Joe Biden and U.S. futures moved lower,” said Ian Williams, economics and strategy analyst at Peel Hunt, in a note to clients. Read more market reaction to the debate here. Some investors fear a Biden win will mean higher corporate taxes, which could be a negative for the stock market. Meanwhile, investors will closely watch last-ditch efforts by U.S. lawmakers to get another coronavirus fiscal stimulus package passed. Read: Here’s how the stock market tends to perform after the first presidential debate Elsewhere, data showed China’s economic recovery picked up the pace following its coronavirus outbreak earlier in the year. The official manufacturing purchasing managers index rose to 51.5 in September, beating forecasts and August’s reading of 51.0. The service sector also rebounded with a strong September. Europe continues to struggle with a rise in coronavirus cases in what some are calling a second wave. The U.K. recorded the largest-ever rise in new cases on Tuesday, with a jump in deaths. William Hill shares WMH, -1.14% rose 0.9%, after U.S.-based Caesars Entertainment said it has agreed to a 272 pence per share deal for the U.K. betting company, which values it at £2.9 billion ($3.73 billion). Caesars shares rose Shares of oil major Royal Dutch Shell RDSA, +2.08% RDS.A, +0.83% were mostly flat after the energy company said it would cut up to 9,000 jobs by the end of 2022, as it expects to book charges of between $1 and 1.5 billion for the third quarter. Shares of French waste-management group Suez SEV, -0.62% climbed over 6%, after Veolia Environnement VIE, -0.92% raised its offer for the majority of Engie SA’s Suez stake to €3.4 billion ($3.99 billion). Veolia shares were little changed. Shares of G4S GFS, +6.20% climbed 5%. The security company on Wednesday rejected a 2.97 billion pound ($3.82 billion) cash offer from Montreal-based Garda World Security , saying it would significantly undervalue the company. The offer was unchanged from a previous proposal G4S received from Garda."}]}