{"article": [{"url": "https://www.marketwatch.com/story/ceo-cook-on-apples-role-in-tackling-inequality-i-do-believe-optimistically-this-is-one-of-those-moments-that-we-could-make-significant-progress-2020-06-22", "published": 1592829140.0, "headline": "CEO Cook on Apple's role in tackling inequality: 'I do believe, optimistically, this is one of those moments that we could make significant progress'", "body": "For most of the Trump Administration's reign, Apple Chief Executive Tim Cook has maintained a diplomatic disposition, sagely navigating choppy political waters - whether it involved tariffs with China, manufacturing jobs in the U.S., or H1-B visas. On Sunday, however, Cook broke from his carefully prepared script and strongly pushed social issues, the latest corporate chieftain to weigh in, amid intensifying discussions about inequality in the U.S. and representation of Black Americans in technology-related enterprises. \"I do believe, optimistically, this is one of those moments that we could make significant progress,\" Cook said of a groundswell of calls for social justice in the wake of the killing of George Floyd while in police custody on May 25. \"For so many things, it seems like there's such slow progress, and then all of the sudden, there's a giant leap.\" Ostensibly, Cook appeared on CBS Sunday Morning to promote the company's Worldwide Developers Conference, which will take place virtually for the first time on Monday. But the 8-minute interview quickly turned into a discourse on racial inequity, rights for the gay, lesbian, bisexual, transgender and queer community, and challenges managing a $1.5 trillion tech behemoth in the age of COVID-19. Perhaps his most telling comments came when discussing the iPhone and its role in filming the murder of Floyd, a black man who died under the knee of former Minneapolis police officer Derek Chauvin, who is white. Chauvin driving his knee into the neck of an unarmed Floyd for 8 minutes and 46 seconds until he perished, was captured on video and has helped to ignite a modern civil rights movement. \"Some of the most dramatic societal changes have occurred because someone captured video,\" Cook said. \"The thing that has changed though, and we're very proud of this, is that we put a camera in everybody's pocket, and so it becomes much tougher as a society, I believe, to convince themselves that it didn't happen, or that it happened in a different manner or whatever it might be.\" The Alabama native shared his first encounter with racism, which he remembered \"as if it were yesterday.\" It was seeing doors marked \"whites only,\" and failing to understand \"how people could convince themselves that this was right.\" Cook, who is gay, later lauded the Supreme Court's decision against job discrimination toward people based on gender or orientation. He said he is \"incredibly grateful for their opinion.\" Amid the social protests, there is a raging pandemic and economic recession that has put the safety of Apple's AAPL, +1.74%  137,000 employees squarely on his shoulders. The company is in the process of slowly onboarding workers at its vast Apple Park campus in Cupertino, Calif., after it temporarily closed some Apple Stores in Florida, North Carolina, South Carolina, and Arizona because of COVID-19 spikes. \"The thing that I worry that we'll be missing is the serendipity that we all count on,\" Cook said of the disconnect between a small number of employees returning to offices working with a vast majority working from home. \"And for that reason I can't wait until we're all back together.\" \"As a general rule, very few people that thrive on uncertainty,\" Cook said. \"But the most important thing for us is, we viewed it as a challenge to overcome.\" True to Apple form, Cook was evasive on what to expect from Monday's keynote speech opening WWDC. \"I'm full of secrets and it's hard not to overflow right now,\" he joked. \"But I've been trained well.\" This hasn't stopped the rumor mill from speculating on what to expect at WWDC. The biggest? Apple may announce support for a new processor architecture for the Mac, ARM, in place of long-time part Intel Corp. INTC, -1.03%  . The iPhone is due for iOS 14, which could include support for AirTag location trackers."}]}