{"article": [{"url": "https://www.marketwatch.com/story/trump-says-he-will-reschedule-2020-campaign-rally-in-tulsa-that-fell-on-juneteenth-holiday-2020-06-13", "published": 1592036120.0, "headline": "Trump says he will reschedule 2020 campaign rally in Tulsa that fell on Juneteenth holiday", "body": "President Trump said on Friday that he would reschedule a June 19 campaign rally in Tulsa, Okla., succumbing to calls to change the date of the event that falls on a holiday that marks the end of slavery in the U.S. Via Twitter late Friday, Trump said that he would move the date of the event, intended to kick off his return to public campaigning after the easing of COVID-19 lockdowns meant to limit the spread of the pandemic, to June 20. Juneteenth, which is celebrated annually by many on June 19, is a day commemorating the end of slavery in the U.S. in 1865. It was on that date that Union General Gordon Granger read the Emancipation Proclamation to African-Americans. “Many of my African American friends and supporters have reached out to suggest that we consider changing the date out of respect for this Holiday, and in observance of this important occasion and all that it represents,” the president tweeted. “I have therefore decided to move our rally to Saturday, June 20th, in order to honor their requests.” iframe.twitter-tweet { width: 100% !important; } Both the date and the cite of the planned 2020 presidential campaign had drawn criticism from the black community and many others. Tulsa is notoriously the site of a white mob that in 1921 stormed a prosperous business district, informally known as Black Wall Street, destroying black-owned businesses and leaving as many as 300 dead in what is referred to as one of the “worst single instance of racial killing in U.S. history.” “To choose the date, to come to Tulsa, is totally disrespectful and a slap in the face to even happen,” Sherry Gamble Smith, president of Tulsa’s Black Wall Street Chamber of Commerce, was quoted as saying by the Associated Press. The Trump rally comes during a period in which calls for racial justice have reached a crescendo in America, in the aftermath of a series of deaths of blacks at the hands of police officers, and other racially charged incidences, highlighted by the killing of George Floyd, a black man, who perished as a police officer knelt on his neck for 8 minutes and 46 seconds, even as the unarmed man said he couldn’t breathe. That death helped to spark a wave of national protests about racial equality and police brutality."}]}