{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-edge-lower-on-demand-worries-brent-set-for-weekly-decline-2020-08-21", "published": 1598024600.0, "headline": "Oil ends lower on demand worries", "body": "Oil futures finished lower Friday, under pressure from continued worries over prospects for demand as the COVID-19 pandemic undermines economic growth. West Texas Intermediate crude for October delivery US:CLV20 CL00, -1.62% lost 48 cents, or 1.1%, to finish at $42.34 a barrel on the New York Mercantile Exchange, while the global benchmark, October Brent crude UK:BRNV20 shed 55 cents, or 1.2%, to settle at $44.35 a barrel on ICE Futures Europe. WTI ended the week with a gain of 3 cents, or 0.1%, while Brent fell 1%. Crude remained under pressure after oil-field services company Baker Hughes Co. BKR, -1.34% reported that the number of U.S. oil rigs rose by 11 this week to 183, ending a three-week streak of declines. The number of rigs has fallen sharply this year in response to crude’s earlier pandemic-induced plunge, with the number of units down 571 from the same time last year. Eurozone purchasing managers index readings Friday showed a slowdown in the region’s economic activity, while data out of Japan indicated a continued decline in activity. Meanwhile, a renewed rise in COVID-19 cases in parts of Europe and elsewhere have underlined worries about the outlook for energy demand. In Asia, a cutback in refining activity in response to poor fuel demand is a troubling sign, analysts said. “Simply put, demand for crude has waned over the past month. Firm refinery run rates paired with an increased amount of refined product output and weak end use demand leads to an excess of gasoline and diesel being exported or dumped onto the open market,” said Michael Tran, analyst at RBC Capital Markets, in a note. “This pattern crushes regional refinery margins, which can result in lower refinery run rates and crude demand destruction,” he said, noting that Asian margins are a leading market indicator heading into fall and the end of the summer driving season. Crack spreads — the difference between the price of crude and the petroleum products refined from it — “will not improve until either demand leads the way or run cuts curtail output,” he said. September natural-gas futures US:NGU20 jumped 4.1% to end at $2.488 per million British thermal units, leaving it with a weekly rise of 3.9%. September gasoline US:RBU20 fell 1.24 cents, or 1%, to $1.2841 a gallon, while September heating oil US:HOU20 shed 3.87 cents, or 3.1%, to close at $1.2080 a gallon. Gasoline saw a weekly rise of 3.2%, while heating oil retreated 2.3%."}]}