{"article": [{"url": "https://www.marketwatch.com/story/cruise-stocks-dive-as-cdc-extension-of-no-sail-order-could-be-just-the-beginning-2020-07-17", "published": 1595153540.0, "headline": "Cruise stocks fall as CDC extension of no-sail order could be just the beginning", "body": "Shares of cruise operators took a hard hit Friday from the extension of the no-sail order by the Centers for Disease Control and Prevention, in the wake of the recent surge in COVID-19 cases. The CDC said passenger operations on cruise ships with a capacity of at least 250 passengers in U.S. waters, must now be suspended through Sept. 30, 2020. The previous no-sail order was set to expire on July 24. The government action follows the decision by the Cruise Lines International Association announced in mid-June to extend the voluntary suspension of operations of cruise ship travel until Sept. 15. Shares of Norwegian Cruise Line Holdings Ltd. NCLH, +2.91% dropped 2.2%, Royal Caribbean Cruise Ltd. RCL, +2.59% 1.5% and Carnival Corp. CCL, +0.51% fell 2.0%. The moves bucked the gains in the broader stock market, as the S&P 500 index SPX, +0.87% rose 0.3%. Since cruise stocks were among the first to suffer as coronavirus outbreak started prompting lockdown measures, Friday’s decline may act as a warning for other travel-related companies, such as airlines and hotel operators, given that new COVID-19 cases have been increasing at a record pace. Don’t miss: Coronavirus update: Global cases of COVID-19 edge closer to 14 million as U.S. sets record case tally, Brazil tops 2 million. FactSet, MarketWatch Although the CDC’s move wasn’t a shock, investors can’t be faulted for being disappointed, after Carnival announced last week that its Germany-based cruise line AIDA Cruises will start resuming operations in August. And some analysts are concerned this delay was just the first of many. SunTrust Robinson Humphrey’s Patrick Scholes said he believes sailings won’t resume in quantity in North America until the second quarter of 2021, at the earliest. He said that while there are signs of pent-up demand for cruising, the CDC remains the gating factor in the U.S. “While companies had indicated that cruising could resume in September or October in North America, our industry sources believed this is highly unrealistic, at least in any meaningful way,” Scholes wrote in a note to clients. “Subsequently, we reiterate our belief there will be continued investor disappointment as further starting date delays are announced.” The cruise resailings delay comes as the latest data from U.S. Transportation Security Administration showed a pullback in the numbers of travelers going through TSA checkpoints and in hotel demand over the past week. The daily average of travelers for weeks ending Sundays have increased for each week since hitting a post-COVID-19 bottom of 97,799 for the week ended April 19, according to a MarketWatch analysis of TSA data. The daily average for the week ended July 12 was 694,489, but the daily average for this week through Thursday is down to 633,426. The percentage decline in average daily travelers from a year ago is also set to increase this week, which would snap a 12-week streak of declines. After peaking at a 95.8% year-over-year decline during the week ended April 19, the percentage has declined every week to hit 73.1% for the week ended July 12. So far this week, the decline is 75.4%. Raymond James analyst William Crow said data from lodging industry analytics company STR showed that U.S. industrywide hotel revenue per available room (RevPAR) fell 54.6% for the week ended July 11, compared with a 44.8% decline the previous week. “While we had enjoyed a slow, steady recovery in demand (nearly all of it leisure), the 11-week streak of sequential gains reversed with last week’s data as a spike in COVID-19 cases caused a pause to, or a reversal, in local and state reopening efforts,” Crow wrote in a research note. Among some airline companies, shares of American Airlines Group Inc. AAL, +0.34% slid 4.3% Friday, United Airlines Holdings Inc. UAL, +0.32% shed 1.7% and Delta Air Lines Inc. DAL, +0.39% slipped 0.8%. Among hotel operators, shares of Marriott International Inc. MAR, -0.96% declined 1.8% and Hilton Worldwide Holdings Inc. HLT, -1.26% dropped 1.2%. Meanwhile, the wild card for cruise stocks, as well as for shares of other travel companies, is any news of a potential vaccine for COVID-19. On Wednesday, shares of Norwegian soared 20.7%, Royal shot up 21.2% and Carnival jumped 16% after Moderna Inc.’s MRNA, +0.09% vaccine candidate produced a “robust” immune-system response, and after an ITV report that positive news on the University of Oxford vaccine candidate backed by AstraZeneca PLC AZN, +1.16% AZN, +0.63% may soon be released. “Of course the game changer continues to be a vaccine, and we continue to believe the stocks will be volatile on news/rumors of such,” Scholes said. Year to date, shares of Norwegian have plunged 73.9%, Royal Caribbean have tumbled 60.2% and Carnival have dropped 69.6%, while the S&P 500 has eased 0.2%."}]}