{"article": [{"url": "https://www.marketwatch.com/story/meadows-mnuchin-say-they-are-recommending-trump-issue-executive-orders-soon-after-stalemate-on-coronavirus-relief-package-2020-08-07", "published": 1596833780.0, "headline": "Trump eyes executive orders after stalemate on coronavirus relief package but doesn't pull trigger", "body": "President Donald Trump on Friday evening signaled he is close to issuing executive orders to make an end run around a stalled stimulus package with Congressional Democrats but stopped short of issuing them. Trump said the orders might be issued before next week. \"They are being drawn by the lawyers right now,\" Trump said. White House Chief of Staff Mark Meadows and Treasury Secretary Steven Mnuchin had earlier said they would recommend the president move forward with the unilateral measures. Trump said he would defer the payroll tax until the end of the year retroactive to July 1. The president has long supported lowering this tax, but critics say it does nothing for the 16 million Americans who are not on a payroll as a result of the pandemic. Unemployment benefits would also be extended until the end of the year, the president said, but refused to say how much money out-of-work Americans would receive. He said he had the money to pay for the benefits. Trump said he would also defer student loans programs and forgive interest \"until further notice\" and would extend the eviction moratorium. The president said he would take the steps \"if democrats continue to hold the stimulus bill hostage.\" The Treasury secretary said he and Meadows were willing to resume talks with House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer if the Democrats made new proposals. \"In the meantime, we're going to take executive orders to try to alleviate some of the pain that people are experiencing,\" Meadows said. \"This is not a perfect answer. We'll be the first ones to say that. But it is all that we can do, and all the president can do, within the confines of his executive power, and we're going to encourage him to do it.\" Democrats have passed a $3.4 trillion coronavirus stimulus package in the House. Republicans had countered with a $1 trillion plan. Democrats said they offered a $2 billion compromise but were turned down. The White House has continued to press democrats to pass a partial deal. Related: Talks on coronavirus aid package fail to produce deal Friday And see:Next coronavirus aid package probably won't become reality this month after better-than-expected July jobs report, analyst says Trump had told reporters Thursday that the order could come Saturday morning. \"Some things he can do via Executive Order legally, others he probably can do but could be challenged in court (question here is who is going to challenge) and others he might do but will have minimal economic impact,\" Bill Hoagland, senior vice president with the Bipartisan Policy Center and formerly a long-time budget staffer for Republicans, told MarketWatch in an email. Asked if he would reach out to Pelosi, Trump said \"we'll see.\" \"We're having it out. We're finally having it out,\" the president said. The main U.S. stock benchmarks closed slightly higher on Friday as investors tracked the stimulus negotiations and digested a better-than-expected July jobs report, with the S&P 500 SPX, +0.87%  up 0.1% and the Dow industrials DJIA, +0.56%  gaining 0.2%. Both indexes booked their sixth straight gains on Friday. Jonathan Nicholson contributed to this report."}]}