{"article": [{"url": "https://www.marketwatch.com/story/stock-futures-point-higher-on-optimism-over-stimulus-prospects-11602156403", "published": 1602176060.0, "headline": "Dow ends at five-week high as election uncertainty dims, offsetting lack of fiscal stimulus progress", "body": "Getty Images/iStockphoto Stocks finished higher Thursday, as investors focused on polls showing less uncertainty around November’s presidential election. House Speaker Nancy Pelosi also rejected the idea of a standalone bill to aid the airline industry, saying such a measure would need to be part of a broader fiscal stimulus package. How did major benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% closed up 122.05 points, or 0.4%, at 28,425.51, while the S&P 500 SPX, +0.87% rose 27.38 points, or 0.8%, to finish at 3,446.83. The Nasdaq Composite COMP, +1.39% added 0.5%, or 56.38 points, ending at 11,420.98. All three major equity benchmarks ended at their highest levels in five weeks. The Dow on Wednesday finished with a gain of 530.70 points, or 1.9%, at 28,303.46, while the S&P 500 advanced 58.49 points, or 1.7%, to close at 3,419.44. The Nasdaq Composite rose 210 points, or 1.9%, finishing at 11,364.60. The Dow had its best day since July on Wednesday. What drove the market? Optimism has been building about the longer term prospects of another sweeping stimulus package from Washington, particularly in January following the elections. Indeed, even as talks between the White House and Democratic lawmakers have made scant progress, equities have managed to sustain steady gains this week. “Any stock market weakness that stems from failure to break the impasse will be short-lived. The election is 25 days away, so it should come as no surprise Wall Street is already pricing in a blue wave that comes with higher taxes but also a massive $5 trillion spending plan that will provide a strong boost for the economy,” said Edward Moya, senior market analyst at OANDA. Also, fears of a contested election, which could leave the outcome of the contest in doubt for weeks, have faded as polls show Democratic challenger Joe Biden increasing his lead over Trump, analysts said. Read: Stocks are rallying because fears of a contested election are fading While a Biden administration would aim to repeal Trump’s corporate tax cuts and increase regulation across a number of industries, the potential for a drawn-out and divisive post-election fight has been viewed as a worst-case scenario by many investors. “Our base case is a Biden win and Democrats sweeping Congress. In this scenario, the Democrats pursue a net fiscal stimulus that combines tax hikes with an elaborate spending plan on energy and climate change management,” wrote analysts at Credit Suisse, in a note. Talks in Washington this week on additional coronavirus aid have yet to yield any fresh breakthroughs. U.S. Treasury Secretary Steven Mnuchin and Pelosi, D-Calif., resumed negotiations Wednesday, after President Donald Trump tweeted the previous evening that he was open to piecemeal stimulus measures, including aid for airline workers. But on Thursday, Pelosi said she wouldn’t back an independent package for airlines without a broader stimulus bill. “There is no stand-alone bill without a bigger bill. There is no bill,” Pelosi told reporters at her weekly press conference at the U.S. Capitol. “It’s likely that there will continue to be near-term volatility due to the back-and-forth over a deal, the U.S. elections, U.S.-China tensions, vaccine developments, and increasing mobility restrictions due to rising COVID-19 cases in Europe,” said Mark Haefele, chief investment officer at UBS Global Wealth Management, in a note. “But we do maintain a positive medium-term view for stocks into the middle of next year,” he said. “A stimulus deal will be struck eventually, central banks will continue to stay supportive, and medical developments still have scope to surprise, in our view.” Meanwhile, initial jobless claims filed through state programs slipped to 840,000 in the week ended Oct. 3 from a revised 849,000 in the prior week, the Labor Department reported. Economists polled by MarketWatch had forecast new claims to fall to 820,000. The slowing decline of the number of Americans who applied for jobless benefits could be a sign the labor market is experiencing a setback amid another wave of corporate layoffs. Which companies were in focus? The airline-industry-tracking U.S. Global JETS ETF JETS, +0.16% rose 1.8%. Hopes for aid have lifted the index 3.6% so far this week. Shares of International Business Machines Corp. IBM, -2.81% rose 6% after the technology company said it would separate its managed infrastructure services unit of its Global Technology Services division into a new public company. Morgan Stanley MS, -0.34% said Thursday it has agreed to acquire asset manager Eaton Vance Corp. EV, -0.56% in a cash-and-stock deal with an equity value of about $7 billion. Eaton Vance shares jumped 48.1%, while Morgan Stanley shares rose 0.6% Regeneron Pharmaceuticals Inc. REGN, +0.36% shares gained 1.4% after Trump praised an experimental antibody cocktail made by the company, which is still in clinical trials. Trump was administered the combination when he was hospitalized for COVID-19. Shares of McDonald’s Corp. MCD, -0.43% fell 0.3% after the fast-food giant reported third-quarter same-store sales that beat forecasts and said it was raising its dividend by 3%. How did other markets trade? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 2.1 basis points to 0.764%. Bond yields move inversely to prices. The pan-European Stoxx 600 Europe index SXXP, +0.55% rose 0.8%, while London’s FTSE 100 UKX, +0.64% gained 0.6%. Gold futures GOLD, +2.86% attempted a rebound, rising 0.2% to settle at $1,895.10 an ounce. In oil, U.S. crude futures CL.1, -1.62% gained $1.24 per barrel, or 3.1%, to settle at a more than four-week high of $41.19 a barrel, boosted by worries over the near-term supply outlook amid a widening strike in Norway and as Hurricane Delta closes down production in the Gulf of Mexico. The ICE U.S. Dollar Index DXY, -0.58%, a measure of the currency against a basket of six major rivals, was virtually flat."}]}