{"article": [{"url": "https://www.marketwatch.com/story/europe-is-struggling-to-avoid-a-return-to-general-lockdowns-it-might-even-succeed-2020-09-01", "published": 1599048320.0, "headline": "Coronavirus cases are rising again in Europe and governments try desperately to avoid a return to brutal lockdowns. They may succeed", "body": "As European children return to their reopened schools this week, governments are still grappling with multiple second waves of the virus and tightening coronavirus-related restrictions to avoid having to resort to more radical measures. - Europe can “conquer the pandemic” by learning to live with it without waiting for a vaccine, and can avoid going back to full economic and social lockdowns, World Health Organization regional director for Europe Hans Kluge said on Tuesday. - Wearing masks in the workplace is compulsory in France, as the number of new cases has shot back to its record level since the height of the pandemic in March. Masks are also mandatory in the streets of most major French cities, including Paris. - Tourism in Spain was down 75% in July compared with the same month in 2019, according to data released on Tuesday. And spending by international visitors was down 70% in the same month. - Spain and France are by far the two countries in Europe where the number of new cases has risen fastest, but coronavirus infections are also up, albeit in smaller numbers, in Germany, Italy and the U.K. - Attempts by German far-right protesters to storm the Bundestag, the country’s Parliament building, in anti-mask protests over the weekend, were condemned by politicians left and right, with the interior minister warning there would be “zero tolerance” for such acts. - According to an article from the Johns Hopkins Bloomberg School of Public Health, although no less than 125 coronavirus vaccines are currently under development, little chance remains that one of them will prove effective before the end of 2021. Read:Retail sales in the U.K. are back to their pre-coronavirus levels. Here’s why this may not last The outlook: Although most European countries are facing new COVID-19 spikes, the number of deaths hasn’t been rising in similar proportions. Heading into the winter season, that seems to give governments some leeway to tailor their responses to the pandemic, and, notably, experiment with local restrictions. Still, governments such as France’s or the U.K.’s are warning that they may not be left with much choice other than returning to economically devastating general lockdowns if the virus keeps spreading. That in turn depends on the governments’ own credibility, and the trust they inspire - or not - among their citizens. Read: Japanese Prime Minister Abe’s resignation shocks the markets but what happens next depends on his successor"}]}