{"article": [{"url": "https://www.marketwatch.com/story/the-stock-market-rallys-euphoria-stage-may-be-here-as-investors-buy-into-earnings-recovery-analyst-warns-11598369908", "published": 1598425160.0, "headline": "Why the stock marketâ\u0080\u0099s record-breaking rally has investors on the cusp of â\u0080\u0098euphoriaâ\u0080\u0099", "body": "Getting out of hand? Everett Collection It might be time for investors to check their enthusiasm after buying into prospects for a V-shaped recovery in corporate earnings after the plunge in stock prices as the coronavirus pandemic hit in the second quarter, warned one analyst as stocks struggled to reach new records Tuesday. â\u0080\u009cU.S. earnings expectations have certainly â\u0080\u0098V-shapedâ\u0080\u0099 and this has been accompanied by an enormous reversal in risk appetite in almost a minuscule amount of financial time,â\u0080\u009d said Sean Darby, global head of strategies at Jefferies, in a Tuesday note. â\u0080\u009cSome of our indicators are beginning to move into the â\u0080\u0098euphoriaâ\u0080\u0099 stage, and we caution that managing drawdown risk is coming to the fore.â\u0080\u009d Key Words: A â\u0080\u0098powerful forceâ\u0080\u0099 will determine what happens next in the stock market, Wharton professor predicts The S&P 500 index SPX, +0.87% hit an all-time intraday high Tuesday and closed at a record, having returned to all-time highs last week as it fully erased the nearly 34% plunge that began in late February and took the market to its pandemic low on March 23. The Dow Jones Industrial Average DJIA, +0.56% pulled back to close with a loss of 60.02 points, or 0.2%, while the Nasdaq Composite COMP, +1.39% logged another record close. In One Chart: Stop saying â\u0080\u0098stocks are not the economyâ\u0080\u0099 The shutdown in businesses in the U.S. and around the world to combat the pandemic earlier this year resulted in corporate earnings plunging, but the recovery in U.S. earnings revisions â\u0080\u0094 a measure of analyst upgrades versus downgrades â\u0080\u0094 has been the fastest on record (see chart below), according to the bankâ\u0080\u0099s figures, Darby said. And while not moving at the same pace of earnings, â\u0080\u009csentiment has also shifted at the speed of financial light alongside risk appetite.â\u0080\u009d JEFFERIES Neither earnings nor sentiment need to revert to the mean to inspire a pullback, Darby said, while acknowledging that many of the usual signals for a downturn have been absent. Stocks over the past 10 days, however, have started to show some signs of â\u0080\u009cexhaustion,â\u0080\u009d he said. These signs include: An increasing divergence by the top 20 S&P 500 stocks from their 200-day moving average. A widening discrepancy between the record-setting S&P 500 index and its â\u0080\u009cflatliningâ\u0080\u009d equal-weighted version. Global risk and S&P 500 sentiment indicators, while not at extremes, are â\u0080\u009cpretty close,â\u0080\u009d Darby said (see chart below). JEFFERIES â\u0080\u009cThe obvious catalysts for a correction are not present but the technical â\u0080\u0098stretchâ\u0080\u0099 of some of our indicators are a warning sign,â\u0080\u009d said Darby. â\u0080\u009cA close watch should be kept on the U.S. 30-year yield and any sign that that U.S. money supply is rolling over.â\u0080\u009d Mark Hulbert: Insiders are now unloading stocks â\u0080\u0094 hereâ\u0080\u0099s why you shouldnâ\u0080\u0099t view it as a sell signal"}]}