{"article": [{"url": "https://www.marketwatch.com/story/we-can-get-through-this-how-to-manage-your-mental-health-during-the-coronavirus-pandemic-2020-03-30", "published": 1598972840.0, "headline": "Advice for Salesforce staff who reported having a mental-health issue â\u0080\u0094 and all workers during the COVID-19 pandemic", "body": "The COVID-19 pandemic poses an obvious threat to physical safety, but advocates stress that Americans shouldnâ\u0080\u0099t sleep on their mental health. As Salesforce.com Inc. CRM, +2.21% Â saw its stock surge this week after a record-setting quarter and reportedly notified some of its staff about layoffs, CEO Marc Benioff revealed on a conference call that about one-third of the cloud-based software companyâ\u0080\u0099s 54,000 now-remote employees had reported experiencing mental-health issues. Theyâ\u0080\u0099re not alone. More than half of U.S. adults (53%) report that coronavirus-related stress and worry have negatively affected their mental health, according to a Kaiser Family Foundation poll conducted in July â\u0080\u0094 a 14-percentage point increase from two months earlier. Women, Black adults, younger adults, and people who have had trouble affording household expenses due to the pandemicâ\u0080\u0099s financial impact are more likely to report a negative impact on their mental health. See Also:Google searches for â\u0080\u0098panic attack,â\u0080\u0099 â\u0080\u0098anxiety attackâ\u0080\u0099 hit all-time high during coronavirus pandemic Meanwhile, a Centers for Disease Control and Prevention report published this month found that U.S. adults had reported â\u0080\u009cconsiderably elevated adverse mental health conditions associated with COVID-19â\u0080\u009d during a survey administered June 24 to June 30. â\u0080\u009cYounger adults, racial/ethnic minorities, essential workers, and unpaid adult caregivers reported having experienced disproportionately worse mental health outcomes, increased substance use, and elevated suicidal ideation,â\u0080\u009d the report said. “ Social distancing is â\u0080\u0098actually physical distancing.â\u0080\u0099 â\u0080\u0098Socially, we can remain even closer.â\u0080\u0099 ” â\u0080\u0094 Christine Moutier, the chief medical officer of the American Foundation for Suicide Prevention While the shared experience of navigating a pandemic can help individuals connect with one another, â\u0080\u009cit also is going to be different for different people, so that can create its own challenges,â\u0080\u009d Christine Moutier, the chief medical officer of the American Foundation for Suicide Prevention, told MarketWatch in March. A variety of stressors, including job loss, poor health, self-isolation and quarantine, and general anxiety and uncertainty, could negatively impact mental health. Some people may also be struggling with existing conditions such as substance-use disorders or depression. But â\u0080\u009cpeople are resilient,â\u0080\u009d said Vaile Wright, a clinical psychologist and researcher at the American Psychological Association. â\u0080\u009cWe can adapt,â\u0080\u009d she said. â\u0080\u009cWe can get through this.â\u0080\u009d Here are some strategies for coping, according to experts who spoke with MarketWatch this past spring:Tap into crisis hotlines â\u0080\u009cOne hundred percent, if youâ\u0080\u0099re in crisis, call a hotline,â\u0080\u009d Wright said. To access coronavirus-related crisis counseling from the Substance Abuse and Mental Health Services Administrationâ\u0080\u0099s (SAMHSA) Disaster Distress Helpline, call 1-800-985-5990 or text â\u0080\u009cTalkWithUsâ\u0080\u009d to 66746. You can also reach the National Suicide Prevention Lifeline at 1-800-273-8255, the Crisis Text Line by texting â\u0080\u009cHOMEâ\u0080\u009d to 741741, and the National Domestic Violence Hotline at 1-800-799-7233.Be kind to yourself Normalize any intense uncomfortable emotions youâ\u0080\u0099re having right now, said Joan Cook, a clinical psychologist and Yale School of Medicine associate professor who studies traumatic stress. Donâ\u0080\u0099t judge yourself if you feel mild anxiety or depression, loneliness, boredom, frustration or anger. This is an unprecedented time for all of us, she said, and â\u0080\u009cthere are a lot of unknowns.â\u0080\u009d â\u0080\u009cWhile itâ\u0080\u0099s important to ground ourselves by remembering to â\u0080\u0098count our blessingsâ\u0080\u0099 and be grateful for our lives and any privileges we have, it is equally important for us to acknowledge that social distancing, quarantine or isolation is hard,â\u0080\u009d Cook said. â\u0080\u009cAnd know that you are not alone in finding the consequences of social distancing, like losing our jobs or being physically distanced from family and friends, also very difficult.â\u0080\u009d Give yourself credit if you are following the social-distancing directives of federal, state and local health officials, Cook added. â\u0080\u009cItâ\u0080\u0099s important that we give ourselves the recognition when we do a good job,â\u0080\u009d she said. â\u0080\u009cYouâ\u0080\u0099re reducing the possibility of transmitting the virus, and protecting those who are most vulnerable.â\u0080\u009dAddress your physical health You may be out of a job or working from home, but you still need to mind your basic human needs. Establish a routine, Wright said: Get enough sleep, get dressed in the morning, take a shower and eat a healthy diet. Exercise, she added, even if itâ\u0080\u0099s just by going outside for fresh air. Build structure into an otherwise loose day by scheduling all of these needs, Moutier said. â\u0080\u009cMental health is not only critically important to pay attention to during COVID-19 for its own sake,â\u0080\u009d Moutier added, â\u0080\u009cbut because the brain is connected to the body, how well weâ\u0080\u0099re managing our mental health will directly affect our physical health â\u0080\u0094 for example, things even like the strength of our immune system.â\u0080\u009dConnect with friends, family and/or online communities Stay in connected with friends and family through phone calls, text messages, FaceTime AAPL, +1.74% Â video calls and social media. â\u0080\u009cWe all need to put in extra effort right now,â\u0080\u009d Wright said. If you are struggling with tough emotions, reach out to the most trustworthy person in your life to share how youâ\u0080\u0099re feeling, Moutier said; that simple act could be a game changer. Laughter and play are â\u0080\u009ccritically necessaryâ\u0080\u009d during this time, Moutier added. Moments of humor might be harder to come by right now, but try to prioritize them. If you lack an existing social-support system, â\u0080\u009cnow is the time to go out and find connection with others, even if you donâ\u0080\u0099t know who they are,â\u0080\u009d Wright said. Seek out online support groups or social-media communities related to your interests. After all, social distancing is actually physical distancing, Moutier said. â\u0080\u009cSocially, we can remain even closer.â\u0080\u009dConsume news wisely Stay informed about the pandemic, especially at your local level, but try to get off your devices too, Wright said. â\u0080\u009cFind the bit of the news that either empowers you or doesnâ\u0080\u0099t drive up your anxiety,â\u0080\u009d she said. Wright, for example, has found that TV pundits and Twitter TWTR, -0.23% Â tend to make her more anxious. â\u0080\u009cAbsolutely do not read the news or check stuff before going to sleep,â\u0080\u009d she added.Take advantage of telehealth services The federal government has expanded access to telemedicine in response to COVID-19, as have some states. â\u0080\u009cIf you are in therapy or mental-health treatment, make sure that you continue it and ask your provider specifically if theyâ\u0080\u0099re providing video chat or telehealth,â\u0080\u009d Moutier said. If you believe your mental health is deteriorating, seek help. â\u0080\u009cThereâ\u0080\u0099s evidence that shows that telehealth can be as effective as in-person treatment in many instances,â\u0080\u009d she said. The present situation â\u0080\u009ccould be a tipping point for not just acceptance for telehealth, but also removing the barriers to it around reimbursement and access,â\u0080\u009d Wright said.Try a mental-health app Look for an app that has scientific backing, as well as mental or behavioral-health experts who served as subject-matter experts, Wright said. Understand the appâ\u0080\u0099s privacy policy and where your data might go, and look through the reviews. Experts praise the Department of Veteran Affairsâ\u0080\u0099 line of health apps, which includes apps for PTSD coping and mood boosting. Ground yourself Is your anxious mind racing at 100 miles per hour? Theresa Nguyen, the chief program officer for the nonprofit Mental Health America, suggested the mental-heath technique of grounding. â\u0080\u009cGrounding is a technique to use your five senses and just bring your attention to the present moment,â\u0080\u009d she said. â\u0080\u009cItâ\u0080\u0099s very effective, because your mind can only think about one thing at a time.â\u0080\u009d If youâ\u0080\u0099re gardening, for example, put your hand in the soil and just focus on that. Touch whatever is around you or try reciting a mantra to yourself, and remember to breathe deeply. We sometimes hold our breath when we are anxious or working hard, which can also exacerbate our anxiety, mental-health professionals say. Engage in activities you know will help you feel healthy and centered, Moutier said, whether itâ\u0080\u0099s exercise like yoga, walking or running, or hobbies like reading, crafting or music. Relax yourself with deep breathing exercises. â\u0080\u009cNot everyone is a nature person, but there is a fairly common experience that being in nature is grounding in and of itself,â\u0080\u009d she added. To reduce that feeling of existential dread... Take each day as it comes. Much about the future of the pandemic remains unknown, and itâ\u0080\u0099s easy to feel a sense of impending doom. Try to shorten the time frame of your perspective, Nguyen said: â\u0080\u009cIf you find yourself going to, â\u0080\u0098What if the world is going to end?â\u0080\u0099 you want to bring it back a little closer to, â\u0080\u0098What am I going to do in two days, what am I going to do today, what does it look like right now?â\u0080\u0099â\u0080\u009d This article was originally published March 30, 2020, and has been updated."}]}