{"article": [{"url": "https://www.marketwatch.com/story/new-trump-health-care-vision-is-largely-aspirational-but-promises-200-drug-discount-cards-to-medicare-enrollees-2020-09-24", "published": 1600981700.0, "headline": "New Trump health-care â\u0080\u0098visionâ\u0080\u0099 is largely aspirational but promises $200 drug discount cards to Medicare enrollees", "body": "CHARLOTTE, N.C. (AP) â\u0080\u0094 More than 3Â½ years into his presidency and 40 days from an election, President Donald Trump on Thursday launched what aides termed a â\u0080\u009cvisionâ\u0080\u009d for health care that appeared largely aspirational but that also promised to mail out $200 drug discount cards to Medicare recipients â\u0080\u0094 which critics immediately derided as an attempt to buy votes on Nov. 3, as polls show persuadable seniors breaking in Democrat Joe Bidenâ\u0080\u0099s direction. Key Words:â\u0080\u0098Trump Cardsâ\u0080\u0099? Drug companies reportedly balked at White House insistence on sending cash cards to Americaâ\u0080\u0099s seniors Boasted Trump of the Thursday announcement: â\u0080\u009cIt is affirmed, signed and done, so we can put that to rest.â\u0080\u009d “ â\u0080\u0098Executive orders issued close to elections are not the same thing as actual policies.â\u0080\u0099 ” â\u0080\u0094 Katherine Hempstead, a senior policy adviser with the nonpartisan Robert Wood Johnson Foundation, He signed an executive order on a range of issues, including protecting people with pre-existing medical conditions from insurance discrimination. That right is guaranteed in the Affordable Care Act, the Obama-era health law that his administration is asking the Supreme Court to overturn. House Speaker Nancy Pelosi observed that Trumpâ\u0080\u0099s â\u0080\u009cbogus executive order on pre-existing conditions isnâ\u0080\u0099t worth the paper itâ\u0080\u0099s signed on.â\u0080\u009d Democrats are betting that they have the edge on health care this election season. Trump spoke at an airport hangar in swing state North Carolina to a crowd that included white-coated, mask-wearing health workers. He stood on a podium in front of a blue background emblazoned with the words â\u0080\u009cAmerica First Healthcare Plan.â\u0080\u009d His latest health-care pitch predictably won plaudits from administration officials and political supporters but failed to impress others. â\u0080\u009cExecutive orders issued close to elections are not the same thing as actual policies,â\u0080\u009d said Katherine Hempstead, a senior policy adviser with the nonpartisan Robert Wood Johnson Foundation, which works on a range of health-care issues, from coverage to quality. President Donald Trump shows off a signed executive order after delivering remarks on health care at Charlotte Douglas International Airport on Thursday in battleground North Carolina. Associated Press Trumpâ\u0080\u0099s speech served up a clear political attack, as he accused Democrats of wanting to unleash a â\u0080\u009csocialist nightmareâ\u0080\u009d on the U.S. health-care system, replete with rationing. But Biden, the two-term vice president under President Obama, has rejected calls from his partyâ\u0080\u0099s left for a government-run plan for all. Instead, he wants to expand the Affordable Care Act and add a public program as an option. Trump returned to health care amid disapproval of his administrationâ\u0080\u0099s handling of the coronavirus pandemic and growing uncertainty about the future of the Obama-era law. In a rambling North Carolina speech, Trump promised quality health care at affordable prices, lower prescription drug costs, more consumer choice and greater transparency. His executive order would also to try to end surprise medical bills. â\u0080\u009câ\u0080\u0099If we win we will have a better and less expensive plan that will always protect people with pre-existing conditions,â\u0080\u009d Trump declared. But while his administration has taken some steps in the health-care realm, the sweeping changes Trump promised as a candidate in 2016 have eluded him. The clock has all but run out in Congress for major legislation on lowering drug costs or ending surprise bills, much less replacing the Affordable Care Act, widely known as â\u0080\u009cObamacare,â\u0080\u009d a moniker attached to it by Republicans and later reluctantly embraced by the Obama administration. Pre-election bill-signing ceremonies on prescription drugs and surprise medical charges were once seen as achievable â\u0080\u0094 if challenging â\u0080\u0094 goals for the president. No longer. Trumpâ\u0080\u0099s speech Thursday conflated some of his administrationâ\u0080\u0099s achievements with policies that are in stages of implementation and others that remain aspirational. Democrats are warning Trump would turn back the clock if given another four years in the White House, and theyâ\u0080\u0099re promising coverage for all and lower drug prices. “ â\u0080\u0098For more than 20 years, we debated ways to protect people from pre-existing-conditions limitations,â\u0080\u0099 until President Barack Obamaâ\u0080\u0099s landmark health-care legislation established such protections. ” â\u0080\u0094 Robert Laszewski, health-care consultant Health and Human Services Secretary Alex Azar said Trumpâ\u0080\u0099s executive order would declare it the policy of the U.S. government to protect people with pre-existing conditions, even if the ACA is declared unconstitutional. However, such protections are already the law, and Trump would have to go to Congress to cement a new policy. See:President Trump suggests he might not allow FDA to tighten standards for an emergency-use authorization of a coronavirus vaccine On surprise billing, Azar said the presidentâ\u0080\u0099s order will direct him to work with Congress on legislation and, if thereâ\u0080\u0099s no progress, move ahead with regulatory action. However, despite widespread support among lawmakers for ending surprise bills, the White House has been unable to forge a compromise that steers around determined lobbying by the interest groups affected. Health-care consultant and commentator Robert Laszewski said heâ\u0080\u0099s particularly puzzled by Trumpâ\u0080\u0099s order on pre-existing conditions. â\u0080\u009cFor more than 20 years,â\u0080\u009d said Laszewski, â\u0080\u009cwe debated ways to protect people from pre-existing-conditions limitationsâ\u0080\u009d â\u0080\u0094 until Obamaâ\u0080\u0099s landmark legislation established protections. â\u0080\u009cSo, after 20 years of national public-policy debate and hard-fought congressional and presidential approval, how does Trump conclude he can restore these protections, should the Republican Supreme Court suit overturn them, with a simple executive order?â\u0080\u009d For Trump, health care represents a major piece of unfinished business. “ The number of uninsured Americans started edging up under Trump even before job losses in the economic shutdown to try to contain the coronavirus pandemic. ” Prescription-drug inflation has stabilized when generics are factored in, but the dramatic price rollbacks he once teased have not materialized. In his speech the president highlighted another executive order directing Medicare to pay no more than what other nations pay for medications, but it remains yet to be seen how that policy will work in practice, if it can overcome fierce opposition from the drug industry. Trump said Medicare recipients will soon receive a card that they can use to save $200 on medications. â\u0080\u009cI will always take care of our wonderful senior citizens,â\u0080\u009d he promised. Opinion:Does Donald Trump have a plan to save Social Security? If so, he should tell voters what it is The estimated federal price tag for those discount coupons â\u0080\u0094 $7 billion â\u0080\u0094 is to be funded through savings from Trumpâ\u0080\u0099s â\u0080\u009cmost-favored nationsâ\u0080\u009d drug pricing proposal, a regulation, as STATnews.com noted late Thursday, that has not been implemented. That fact would find the Trump administration pledging to spend $6.6 billion in savings that do not exist. The cards, Trump said, would be â\u0080\u009cactual discount cards for prescription drug co-pays.â\u0080\u009d iframe.twitter-tweet { width: 100% !important; } More broadly, the number of uninsured Americans started edging up under Trump even before job losses in the economic shutdown to try to contain the coronavirus pandemic. Various studies have tried to estimate the additional coverage losses this year, but the most authoritative government statistics have a long time lag. Larry Levitt of the nonpartisan Kaiser Family Foundation said his best guess is â\u0080\u009cseveral million.â\u0080\u009d Meanwhile, Trump is pressing the Supreme Court to invalidate the entire Obama health law, which provides coverage to more than 20 million people and protects Americans with medical problems from insurance discrimination. That case will be argued a week after Election Day. The death of Supreme Court Justice Ruth Bader Ginsburg has added another layer of uncertainty. Without Ginsburg, thereâ\u0080\u0099s no longer the majority of five justices who previously had voted to uphold the ACA. Democrats, likely unable to slow the Republican march to Senate confirmation of a replacement for Ginsburg, are ramping up their election-year health-care messaging. Itâ\u0080\u0099s a strategy that helped them win the House in 2018. A recent Kaiser Foundation poll found Biden had an edge over Trump among registered voters as the candidate with the better approach on making sure everyone has access to health care and insurance, 52% to 40%. The gap narrowed for lowering costs of health care: 48% named Biden, while 42% picked Trump. Trump was unveiled his agenda ahead of a two-day swing to several battleground states, including the all-important Florida. There, he will hold a rally in Jacksonville and later court Latino voters at a round table in Doral on Friday. Then heâ\u0080\u0099ll fly to Atlanta o deliver a speech on black economic empowerment. Heâ\u0080\u0099ll end the day with another rally in Newport News, Va. The scramble to show concrete accomplishments on health care comes as Trump is chafing under criticism that he never delivered a Republican alternative to Obamacare. Trump had repeatedly insisted his plan would be coming, for months saying it was two weeks in the future. â\u0080\u009cWeâ\u0080\u0099ve really become the health-care party â\u0080\u0094 the Republican Party,â\u0080\u009d he said Thursday. â\u0080\u009cAnd nobody talks about that.â\u0080\u009d Read on:Trump says Kentucky attorney general is â\u0080\u0098handlingâ\u0080\u0099 Breonna Taylor situation â\u0080\u0098very wellâ\u0080\u0099 and refuses to commit to peaceful transition of power MarketWatch contributed."}]}