{"article": [{"url": "https://www.marketwatch.com/story/biden-to-attend-democratic-convention-in-milwaukee-but-delegates-urged-to-stay-home-2020-06-24", "published": 1593079580.0, "headline": "Biden to attend Democratic convention in Milwaukee, while delegates are urged to stay home", "body": "The Democratic National Committee said Wednesday that Joe Biden will accept the presidential nomination in Milwaukee, but the party will urge delegates to skip the summer convention because of coronavirus concerns. The DNC said convention organizers will encourage state delegations to plan to conduct their official business remotely. The committee is developing a process to ensure that delegates can cast their votes on convention matters, including the presidential nomination, without being at the convention in person. The party will also host events in several satellite cities across the nation during the convention. Organizers have also decided to move all proceedings from the Fiserv Forum, the 17,000-plus-capacity home of the NBA’s Milwaukee Bucks and Marquette University basketball, to the Wisconsin Center, a smaller convention center nearby. The moves by the party come as people grapple with whether to attend gatherings and travel during the pandemic, which has killed more than 120,000 Americans. The Republican National Committee shifted major events to Jacksonville, Fla., after President Trump battled with North Carolina leaders over social-distancing precautions connected to holding the convention in Charlotte as originally planned. DNC officials said Milwaukee would still anchor four nights of programming from Aug. 17-20. People familiar with the planning said the satellite events are likely to be held in locations including Pennsylvania, Biden’s birth state, and another site connected to his eventual running-mate pick. Coronavirus cases will also factor into the selection of regional gatherings, the people said. An expanded version of this report appears on WSJ.com. Also popular on WSJ.com: Coronavirus cases are accelerating across the U.S. ‘Crush this lady’: inside eBay’s bizarre campaign against a blog critic"}]}