{"article": [{"url": "https://www.marketwatch.com/story/hamilton-debuts-to-smashing-reviews-spike-in-downloads-of-disney-app-2020-07-07", "published": 1594124600.0, "headline": "â\u0080\u0098Hamiltonâ\u0080\u0099 debuts to smashing reviews, spike in downloads of Disney+ app", "body": "Itâ\u0080\u0099s official: â\u0080\u009cHamiltonâ\u0080\u009d is a hit on Broadway, on film, and now on streaming. The Pulitzer Prize- and Tony Award-winning musical of the founding fatherâ\u0080\u0099s life delivered a spike in app downloads on Walt Disney Co.â\u0080\u0099s DIS, +1.53% Â Disney+ over the July 4 weekend. The movie version of Lin-Manuel Mirandaâ\u0080\u0099s play premiered on Friday and, through Sunday, the Disney+ app was downloaded 752,451 times globally, including 458,796 times in the U.S., according to analytics firm Apptopia. This represents a 74% jump in average downloads over the four weekends in June 2020, according to Apptopia data. Worldwide app downloads were 47% higher this past weekend than the average of the four prior Friday-Sunday totals. Worldwide numbers do not include India or Japan because Disney+ is delivered through pre-existing apps in those countries. See also: â\u0080\u0098Hamiltonâ\u0080\u0099 and everything else coming to Disney+ in July 2020 Disneyâ\u0080\u0099s stock was flat in late-morning trading Tuesday. No matter how you cut it, the runaway success of â\u0080\u009cHamiltonâ\u0080\u009d â\u0080\u0094 which some feared might bring down the internet â\u0080\u0094 should provide a boom in its fierce competition with Apple Inc.â\u0080\u0099s AAPL, +1.74% Â Apple TV+, Netflix Inc. NFLX, +1.43% Â , AT&T Inc.â\u0080\u0099s T, -1.01% Â HBO Max, Amazon.com Inc.â\u0080\u0099s AMZN, +3.01% Â Prime Video, and other streaming services. Disney is banking on â\u0080\u009cHamiltonâ\u0080\u009d to draw paying customers in droves. The movie, a â\u0080\u009cliveâ\u0080\u009d recording of the musical as it appeared on stage in New York, was shifted by Disney to a direct-to-streaming release a year before it was to scheduled to appear in theaters because of the coronavirus pandemic. Since mid-June, Disney+ stopped offering a free seven-day trial offer in hopes that â\u0080\u009cHamiltonâ\u0080\u009d would give it a bump in paid subscribers. As of early May, the service had 54.5 million subscribers world-wide just six months after its launch. It costs $6.99 a month or $69.99 a year in the U.S."}]}