{"article": [{"url": "https://www.marketwatch.com/story/white-house-virus-task-force-member-says-none-of-us-lie-2020-07-14", "published": 1594814300.0, "headline": "White House virus task-force member Giroir says 'none of us lie'", "body": "WASHINGTON (AP) - A top member of the White House coronavirus task force said Tuesday that \"none of us lie\" to the public, an accusation President Donald Trump had retweeted, and that while kids need to be back in school as Trump insists, \"we have to get the virus under control.\" Adm. Brett Giroir's comment came a day after Trump shared a Twitter post from a former game show host who, without evidence, accused government medical experts at the Centers for Disease Control and Prevention, among others, of \"lying.\" Trump himself has at times disregarded the advice of his medical experts on the task force and continues to play down the threat from the virus as it spikes across the country, forcing some states to slow or reverse steps to reopen their economies. Asked on NBC's \"Today,\" whether the CDC and other doctors are lying, Giroir allowed that mistakes have been made and that public guidance is updated when more is learned about the virus, \"but none of us lie. We are completely transparent with the American people.\" Trump has said on several occasion that the virus will \"just disappear.\" Giroir said that is unlikely \"unless we take active steps to make it disappear.\" He appealed to people to wear masks, practice social distancing and to avoid bars and other tightly packed areas. With U.S. virus cases spiking and the death toll mounting, the White House has worked to undercut its most trusted coronavirus expert, playing down the danger as Trump pushes to get the economy moving before he faces voters in November. The U.S. has become a cautionary tale across the globe, with once-falling cases now spiraling. However, Trump suggests the severity of the pandemic that has killed more than 135,000 Americans is being overstated by critics to damage his reelection chances. Trump on Monday retweeted a post by Chuck Woolery, onetime host of TV's \"Love Connection,\" claiming that \"Everyone is lying\" about COVID-19. Woolery's tweet attacked not just the media and Democrats but the CDC and most doctors \"that we are told to trust. I think it's all about the election and keeping the economy from coming back, which is about the election.\" At the same time, the president and top White House aides are ramping up attacks against Dr. Anthony Fauci, the nation's top infectious diseases expert. Fauci has been increasingly sidelined by the White House as he sounds alarms about the virus, a most unwelcome message at a time when Trump is focused on pushing an economic rebound. \"We haven't even begun to see the end of it yet,\" he said Monday in a talk with the dean of Stanford's medical school, calling for a \"step back\" in reopenings. Last week, Fauci contradicted Trump about the severity of the virus during a FiveThirtyEight podcast. While Trump contends repeatedly that he has done a great job against the pandemic, Fauci said, \"As a country, when you compare us to other countries, I don't think you can say we're doing great. I mean, we're just not.\" Trump later said Fauci had \"made a lot of mistakes.\" He pointed to Fauci's early disagreement with him over the China travel ban and to the evolving guidance over the use of masks as scientists' understanding of the virus improved - points the White House expanded on in statements to media outlets over the weekend. Asked whether the president still had confidence in Fauci, a White House official on Monday insisted Trump did. The official said Fauci, director of the National Institute of Allergy and Infectious Diseases, was regarded as \"a valued voice\" on the White House coronavirus task force. The official spoke on condition of anonymity even though the president has repeatedly railed against anonymous sources. \"I have a very good relationship with Dr. Fauci,\" Trump told reporters Monday, calling him \"a very nice person.\" But the president added, \"I don't always agree with him.\" That supportive message was not echoed by Peter Navarro, a top White House trade adviser who has been working on the coronavirus effort. See:Trump shares Chuck Woolery tweet that alleges 'everyone is lying' about the coronavirus to hurt Trump's re-election chances In an email, Navarro continued to criticize Fauci to the Associated Press on Monday, saying the doctor has \"a good bedside manner with the public but he has been wrong about everything I have ever interacted with him on.\" That includes, he said, downplaying the early risk of the virus and expressing skepticism over the use of hydroxychloroquine, which Navarro - who is not a doctor - has aggressively championed despite contradictory evidence on its efficacy and safety. Asked by NBC News if he was bothered by the White House's treatment of Fauci, Giroir didn't answer directly but said \"none of us are always right and that's just the way things are.\" Giroir also appeared to disagree with Trump and Education Secretary Betsy DeVos, who have been pressuring schools to fully open in the fall, even going as far to threaten those that remain closed with the loss of some federal funds. Giroir said it was important to \"get the virus under control\" first. \"And if we get the virus under better control, clearly kids can get back into school safely,\" he said. Fauci, who has not appeared at recent White House task force briefings and has been largely absent from television, told the Financial Times last week that he last saw Trump in person at the White House on June 2 and hadn't briefed him in at least two months. He blamed the fact that he has refused to toe the administration's line for its refusal to approve many of his media requests. \"I have a reputation, as you probably have figured out, of speaking the truth at all times and not sugar-coating things. And that may be one of the reasons why I haven't been on television very much lately,\" Fauci said. Trump's political foes put it more strongly. \"The president's disgusting attempt to pass the buck by blaming the top infectious disease expert in the country - whose advice he repeatedly ignored and Joe Biden consistently implored him to take - is yet another horrible and revealing failure of leadership as the tragic death toll continues to needlessly grow,\" said Andrew Bates, a spokesman for Democrat Biden's presidential campaign."}]}