{"article": [{"url": "https://www.marketwatch.com/story/bidens-running-mate-search-is-getting-outsized-attention-and-could-even-shake-the-stock-market-heres-how-2020-06-10", "published": 1597049840.0, "headline": "Biden's running-mate search is getting 'outsized attention' and could even shake the stock market - here's how", "body": "As Joe Biden's campaign wraps up its work on rolling out a running mate, the effort has been drawing heightened interest for several reasons - some of them arising from 2020's unprecedented tumult. The recent nationwide protests over police killings of Black Americans have sparked calls for the presumptive Democratic presidential nominee to select a Black running mate. Biden on July 20 said that four Black women are in fact on his shortlist for vice president. At the same time, social-distancing measures due to the coronavirus pandemic have prevented Biden from holding big campaign rallies and other events. \"With little traditional campaigning covered in the news, the choice of Biden's vice president is garnering outsized attention,\" said Melissa K. Miller, a professor of political science at Bowling Green State University in Ohio. What's more, the 77-year-old politician's age has prompted questions about whether he would serve two terms as president and put extra focus on his choice for vice president. If he defeats President Donald Trump in the November election, Biden would be 78 when he's sworn into office and rank as the country's oldest-ever commander-in-chief, topping Ronald Reagan, who was 77 when he left office and 69 when he entered the White House. Trump is now 73 and was 70 at his swearing-in, so the Republican incumbent currently rates as the oldest president at the start of his time in office. Some party activists also \"wonder whether a carefully chosen vice president could swing the presidential pendulum back in the Democrats' favor\" after Trump's razor-thin margins of victory in 2016 in the battleground states of Michigan, Wisconsin and Pennsylvania, Miller said. But she cautioned that while research suggests running mates are \"chosen in order to maximize the ticket's chances of winning,\" other research suggests the choice has \"little demonstrable effect on who wins in November.\" Related:Biden holds 15-point lead over Trump in new national poll And see:'We have polls that show me leading in almost every swing state,' Trump says Biden said in late July that he would make his decision on his running mate in the first week of August, and he's expected to reveal his pick this week. The former vice president, who pledged in March that he would choose a woman as his vice president, said at a virtual fund-raising event on May 27 that he wants a No. 2 who \"is simpatico with me\" and \"has some qualities that I don't possess.\" \"They don't have to agree with me on everything, but they have to have the same basic approach to how we handle the economy and how we handle everything,\" Biden said at that May event. Former Democratic presidential hopeful Kamala Harris - the senator from California who attacked Biden over school busing at a debate a year ago - is currently the favorite in betting markets, helped by the view that a Black former attorney general could be just what voters want at this moment. Biden was photographed in late July with handwritten notes about Harris. Related:Politicians have supported heavily armed police task forces - with underwhelming outcomes But one veteran pollster has said another former Democratic presidential hopeful - progressive Sen. Elizabeth Warren of Massachusetts - is the \"obvious\" choice for the more-moderate Biden, arguing that selecting her provides the clearest and easiest way to unite their party. Don't miss:With Biden's VP choice expected soon, here's who he could pick The U.S. stock market SPX, +0.87%  DJIA, +0.56%  might be shaken if Biden announces Warren as his running mate. An RBC survey of institutional investors last year showed they were growing anxious when she was performing well in the Democratic presidential race. \"Biden has been talking about progressive policy change now more than he has in the past,\" said Larry Jacobs, director of the University of Minnesota's Center for the Study of Politics and Governance. Jacobs added that the coronavirus causing the disease COVID-19, the economic downturn and racial disparities have \"all rocked America\" and may convince Biden that he needs to push for government activism and higher taxes. \"Warren would accent that policy agenda and its threat to Wall Street,\" said the University of Minnesota expert, who also told MarketWatch that stocks \"may well respond with good reason to the choice of Warren.\" But Miller, the Bowling Green professor, said she expects Biden will prioritize race over progressive politics in his choice for VP. That's because \"aiming to generate African-American turnout is the safer bet\" - and because, at this point, an all-white Democratic ticket looks like \"a nonstarter among a broad swath of voters,\" according to Miller. When it comes to who is most likely to be picked, she said her top five consists of Rep. Val Demings of Florida, previously Orlando's police chief, as well as Harris, former Georgia gubernatorial candidate Stacey Abrams, Atlanta Mayor Keisha Lance Bottoms and former national-security adviser Susan Rice. \"Institutional racism, criminal-justice reform and policing reform will remain key issues through November,\" Miller said. \"Appointing someone who can speak powerfully to those issues would send an important message to voters.\" Related:Abrams says it's 'critical' to show Black Americans that coronavirus won't hold up voting And see:Harris blasts stalling of anti-lynching bill Sarita McCoy Gregory, who chairs the department of political science and history at Hampton University in Virginia, said her top five is \"a bit more aspirational and reflects my hope that the Biden team is paying attention to the current demands for nationwide police reform and the need to excite and unify the Democratic Party base.\" Her list doesn't include Demings and Harris because she views the former \"top cops\" as \"nonstarters\" amid widespread calls for reform and the Black Lives Matter movement, Gregory said. \"I don't believe they will rally the energy and enthusiasm needed,\" she said. Instead, Gregory said her top five includes Rice and Rep. Barbara Lee of California, who \"has solid progressive politics that would excite the Sanders wing and the West Coast.\" It also includes Abrams as well as former Flint, Mich., Mayor Karen Weaver, who \"ushered her city through the worst water crisis in the nation's history,\" and Rep. Lucy McBath of Georgia, whose story \"resonates with this current political moment.\" McBath ran for Congress after losing her 17-year-old son in a shooting.Other twists in the 'veepstakes' However, Biden could be focused in large part on selecting a running mate who would work well with him in Washington, according to Jacobs, the University of Minnesota expert. \"Just about everyone is viewing the VP pick as geared to 'winning' votes and the election, whereas Biden is mostly viewing the choice as whether the person fits his style, policy and need for help governing,\" Jacobs said. He said running mates are \"nearly forgotten\" by October, and starting with Walter Mondale, the Democratic challenger to Reagan in 1984, every presidential candidate since him has picked their VP \"based on policy/governing fit.\" Past White House hopefuls have handled \"the age or the health issue by putting somebody a heartbeat away who would be viewed as a plausible president,\" said Joel Goldstein, a law professor emeritus at Saint Louis University in Missouri who has written two books on the vice presidency. He cited Reagan's picking George H.W. Bush and the selection by Bob Dole, the GOP challenger to Bill Clinton in 1996, of Jack Kemp, who was a \"presidential-caliber figure in the Republican Party.\" \"Biden, of course, has said that's his main criteria - that the person has to be ready to step in on Day One. So that would lead to the expectation that he's accepting responsibility to pick somebody who would be perceived as being presidential, which would suggest more of a Bush or a Kemp analogy than a young up-and-comer,\" Goldstein added, referring to older presidential candidates who picked more youthful running mates, such as John McCain's selection of Sarah Palin in 2008. The Saint Louis professor also warned there are still probably more twists ahead in the \"veepstakes.\" \"At this point, I'd be pretty confident that Biden doesn't know who he's going to pick - and that the political context could change dramatically between now and the beginning of August,\" he said. This is an updated version of a report first published on June 10, 2020."}]}