{"article": [{"url": "https://www.marketwatch.com/story/florida-governor-permits-extension-of-voter-registration-deadline-after-site-crash-2020-10-06", "published": 1601991680.0, "headline": "Florida governor permits extension of voter-registration deadline after site crash", "body": "TALLAHASSEE, Fla. (AP) — Florida Gov. Ron DeSantis extended the state’s voter registration deadline Tuesday after unexpected and unexplained heavy traffic crashed the state’s online system and potentially prevented thousands of enrolling to cast ballots in next month’s presidential election. DeSantis extended the deadline that expired Monday until 7 p.m. Eastern time Tuesday. In addition to online registration, DeSantis ordered elections, motor vehicle and tax collectors offices to stay open until 7 p.m. local time for anyone who wants to register in person. Florida Secretary of State Laurel Lee, who oversees the voting system, said the online registration system “was accessed by an unprecedented 1.1 million requests per hour” during the last few hours of Monday. Lee said in a statement Tuesday that the state “will work with our state and federal law-enforcement partners to ensure this was not a deliberate act against the voting process.” The FBI and the Cybersecurity and Infrastructure Security Agency warned elections officials nationwide last week that cyberattacks could disrupt their systems during the run-up to the election. They particularly noted “distributed denial-of-service” attacks, which inundate a computer system with requests, potentially clogging up servers until the system becomes inaccessible to legitimate users. The potential for outside meddling is an especially sensitive issue in Florida, a key battleground state in November’s election between President Donald Trump and his Democratic challenger, former Vice President Joe Biden. The state has lingering questions about Russian hacking during the election four years ago. Republican Gov. Ron DeSantis’s state has faced lingering questions about Russian hacking during the election four years ago. Getty Images Last year, state officials confirmed that election-related servers of at least two Florida counties were breached by Russian meddlers. No votes or records were tampered with. Whatever caused the disruption, it threw up a roadblock for those trying to register. Sarah Dinkins, a Florida State University student, tried to help her younger sister register Monday night. They began trying about 9 p.m. and by 10:30 p.m. had not been successful. “I feel very frustrated,” she said. “If the voting website doesn’t work, fewer people potentially Democratic voters will be able to vote.” This is not the first major computer shutdown to affect the state government this year. For weeks in the spring, tens of thousands of Floridians who lost their jobs because of the coronavirus pandemic couldn’t file for unemployment benefits because of repeated crashes by that overwhelmed computer system, delaying their payments. DeSantis replaced the director overseeing that system but blamed the problems on his predecessor, fellow Republican Rick Scott, who is now a U.S. senator. Democrats jumped on the latest issue, saying it and the unemployment fiasco show that the DeSantis administration is inept and accused it of trying to stop people from voting. “The utter incompetence of Gov. Ron DeSantis in allowing the state’s voter registration website to crash on the very last day to register for the upcoming November election is, sadly, completely believable,” U.S. Rep. Debbie Wasserman Schultz said. “His administrative buffoonery in operating the state’s unemployment system telegraphed today’s executive ineptitude. However, this particular blunder intimates a continuing pattern of voter suppression that the governor has become notorious for.” A civil rights group had threatened to sue if the governor did not extend the deadline. The Lawyers’ Committee for Civil Rights Under Law said the breakdown would unjustly deprive thousands of casting ballots for president and other offices. Kristen Clarke, the group’s president, said the group sued Virginia in 2016 after its computer system crashed just before the deadline, winning an extension that allowed thousands of additional voters to register. __ Spencer reported from Fort Lauderdale. AP writer Adriana Gomez Licon in Miami contributed to this report."}]}