{"article": [{"url": "https://www.marketwatch.com/story/in-debate-over-school-reopenings-its-trump-vs-the-health-experts-again-2020-07-11", "published": 1594428440.0, "headline": "In debate over school reopenings, it's Trump vs. the health experts - again", "body": "WASHINGTON (AP) - The White House seating chart spoke volumes. When the president convened a roundtable this week on how to reopen schools with coronavirus cases rising, the seats surrounding him were filled with parents, teachers and top White House officials, including the first and second ladies. But the head of the Centers for Disease Control and Prevention, usually the leader of disease-fighting efforts, was relegated to secondary seating in the back with the children of parents who had been invited to speak. Intentional or not, it was a telling indication of the regard that President Donald Trump has for the government's top health professionals as he pushes the country to move past the coronavirus. Whatever they say, he's determined to revive the battered economy and resuscitate his reelection chances, even as U.S. hospitalizations and deaths keep climbing. Confirmed COVID-19 cases in the U.S. hit the 3 million mark this week, with over 130,000 deaths now recorded. The surge has led to new equipment shortages as well as long lines at testing sites and delayed results. States are responding. At midnight Friday, Nevada was to enforce new restrictions on bars and restaurants in several areas including Las Vegas and Reno after a spike in cases. And New Mexico's Gov. Michelle Lujan Grisham said her state was halting indoor restaurant service, closing state parks to nonresidents and suspending autumn contact sports at schools in response to surging infections within its boundaries and neighboring Texas and Arizona. Yet Trump paints a rosy picture of progress and ramps up his attacks on his government's own public health officials, challenging the CDC's school-reopening guidelines and publicly undermining the nation's top infectious diseases expert, Anthony Fauci. \"Dr. Fauci is a nice man, but he's made a lot of mistakes,\" Trump told Fox News Channel host Sean Hannity in a call-in interview Thursday, pointing, in part, to changes in guidance on mask-wearing over time. In his latest beef with the CDC, the president accused the Atlanta-based federal agency of \"asking schools to do very impractical things\" in order to reopen. The recommended measures include spacing students' desks 6 feet apart, staggering start and arrival times, and teaching kids effective hygiene measures to try to prevent infections. Director of the National Institute of Allergy and Infectious Diseases Anthony Fauci speaks at the White House in April as President Donald Trump and Vice President Mike Pence look on. Fauci last saw Trump in person at the White House on June 2, he told the Financial Times in an interview to be published in the weekend edition of that newspaper. AFP via Getty Images After Trump's scolding comment, Vice President Mike Pence announced Wednesday that the CDC would be \"issuing new guidance\" that would \"give all-new tools to our schools.\" But the agency's director, Dr. Robert Redfield, pushed back amid criticism that he was bowing to pressure from the president. \"I want to clarify, really what we're providing is different reference documents. ... It's not a revision of the guidelines,\" he said the next day. Indeed, draft documents obtained by The Associated Press seem to confirm Redfield's assertion, though officials stress the drafts are still under review. Deputy White House press secretary Judd Deere issued a supportive statement Friday: \"The White House and CDC have been working together in partnership since the very beginning of this pandemic to carry out the president's highest priority: the health and safety of the American public.\" But the flap has touched a nerve amid increasing concern over how the administration has sidelined, muzzled and seemed to derail the CDC. Repeatedly now, the administration has shelved or altered CDC draft guidance, or even told the the agency to take down guidance it has already posted. That includes in early March, when administration officials overruled CDC doctors who wanted to recommend that elderly and physically fragile Americans be advised not to fly on commercial airlines because of the pandemic. In May, officials removed some recommendations for reopening religious events hours after posting them, deleting guidance that discouraged choir gatherings and shared communion cups. \"Here we have at this time the 21st century's biggest public health crisis, and the CDC has been shunted aside,\" said Dr. William Schaffner, a professor of preventive medicine and infectious diseases at the Vanderbilt University School of Medicine in Nashville. They have \"been sidelined and their voices - their clear, consistent, transparent voices - have been muffled or even completely silenced.\" While Trump has led the way, he's not the only one sending messages contrary to those of public health officials. At a briefing this week by the White House coronavirus task force, Pence's message to those in states like Texas, Florida, California and Arizona where cases are rising, was simple: \"We believe the takeaway from this for every American, particularly in those states that are impacted, is: Keep doing what you're doing.\" Not so, said Dr. Deborah Birx, the task force's response coordinator. She said those states should instead close bars, end indoor dining and limit gatherings \"back down to our phase one recommendation, which was 10 or less.\" Experts warn the U.S. has suffered from a lack of clear, science-based messaging during the pandemic - typically provided by the CDC. But Trump and the White House have kept the agency at arm's length since the early days, when it botched development of a test kit, delaying tracking efforts. Trump also grew enraged in late February when Dr. Nancy Messonnier - a CDC official who was then leading the agency's coronavirus response but has since been sidelined - contradicted statements by other federal officials that the virus was contained. \"It's not so much a question of if this will happen anymore, but rather more a question of exactly when,\" Messonnier said, sending stocks plunging and infuriating Trump, even though she proved correct. From the archives (May 11):Public health experts worry that the CDC is being sidelined by the Trump administration Many outside the White House also fault Redfield, who was appointed two years ago, for failing to adequately assert himself and his agency. Redfield does not have a close personal relationship with the president and has rubbed some at the White House the wrong way. This week, before his later, tougher comments, Redfield appeared to fold before Trump's complaints, saying that the CDC guidelines should not \"be used as a rationale to keep schools closed.\" \"This is the opposite of good public health practice,\" said Carl Bergstrom, a University of Washington evolutionary biologist who studies emerging infectious diseases. \"You put guidelines out there about what's necessary to keep people safe and then you expect people to follow them - not act disappointed if people follow them.\" The school re-opening controversy is just the latest chapter in a depressing tale, said Jason Schwartz, a government health policy expert at the Yale School of Public Health. \"This reflects a failure on the part of the CDC director to defend his agency, his scientists and the science through the pandemic. And this is what has led to this crisis in the CDC's public standing, and frankly will take years to recover,\" Schwartz said. Some others expressed more sympathy for Redfield. Vanderbilt's Schaffner said that Redfield's commitment to public health is clear, but said he nonetheless lacks the standing and forcefulness needed to influence the president's thinking. \"His rhetorical style is nothing like what would be necessary for him to push back. And it's unclear how much he could push back without being removed,\" he said. Read on (April 2020):Trump's pandemic response was hindered by missed opportunities, ignored warnings"}]}