{"article": [{"url": "https://www.marketwatch.com/story/etf-wrap-banks-bonds-and-a-98-return-for-one-stock-picker-11602115737", "published": 1602234020.0, "headline": "ETF Wrap: Banks, bonds, and a 98% return for one stock picker", "body": "What just happened? It’s The Trump Show and we’re just living in it. From the shocking news that the president tested positive for coronavirus and was checked into the Walter Reed National Military Medical Center for three nights, to his proclamation that there would be no fiscal stimulus, to his next-day reversal, President Donald Trump dominated the talk in markets over the past week. We covered the ups, and the downs, for airline and travel-focused ETFs: a lot of turbulence, you might say. Also, the materials sector started to strengthen, and financials jumped as markets began to price in a Democratic sweep that could boost fiscal spending and reflate yields. That’s reflected in weekly fund flows, shown at the bottom of this page. Bond funds sold off, but bank funds rallied. Thanks for reading. “A fascinating time to be an active manager” A fund that launched in 2019 is having a terrific 2020. The Hoya Capital Housing ETF HOMZ, +0.00% initially branded itself as the only ETF to cover the entire housing market ecosystem, from builders to realtors to REITs to Home Depot. But it was struggling to gather assets. So in August, the fund’s founder, Alex Pettee, rebranded it to more directly compete with the two better-known “homebuilder” ETFs, the SPDR S&P Homebuilders ETF XHB, +0.54% and the iShares U.S. Home Construction ETF ITB, +0.79%, both of which also are laden with stocks that aren’t homebuilders. Among ETFs that picked up the most incoming money last month, there was only one actively managed fund in the top 20: ARK Invest’s flagship fund, the Innovation ETF ARKK, +2.17%. For all the recent excitement about “semitransparent” ETFs and “active non-transparent” ETFs, ARK’s founder, Cathie Wood, an unabashed and active stock picker, just happens to prefer the transparency that good old-fashioned ETFs provide. MarketWatch sat down with Wood, virtually, in June, after her terrific run through the spring. In the disruption following the March market swoon, she was having a great time. “It’s a fascinating time to be an active manager,” she said at the time. Wood’s career always has focused on innovative tech, including products and services that span sectors and industries and others, like remote learning and medicine, that seemingly leapfrog into the future. An earlier long conversation with her can be found here. In the year to date, ARKK’s share price basically has doubled itself: it’s up 98.2% as of the close of business Wednesday. That compares with a 26% gain for the Nasdaq COMP, +1.39% over the same stretch. ARKK’s assets under management also mushroomed: up $4.2 billion so far in 2020, according to FactSet, to $8.9 billion. “The ARK lineup, and ARKK in particular, take thematic investing, which has been gaining traction, and do stock picking with a very patient approach,” said Todd Rosenbluth, CFRA head of ETF research. “She’s been right a lot. It’s just impressive. It’s a strategy that combines a few different innovative themes. It’s also a swing for the fences strategy, and she’s been connecting and hitting home runs. It’s a home run year. Will it continue? That’s to be determined, but we have a five star rating on the ETF, in part, based on its performance and, in part, based on its holdings.” In addition to her active approach, Wood is well-known for being a Tesla uber-bull. Her most recent call is for a $7,000 share price. No, we didn’t add an extra zero. Is there an ETF for that? Is there an ETF for every corner of the financial markets? With the launch last week of the Defiance Next Gen SPAC Derived ETF SPAK, +0.03%, it seems likely. SPACs – Special Purpose Acquisition Companies – are sometimes called “blank-check companies.” They raise capital, then identify a company already in operation as an acquisition target. As part of the merger process, the new entity goes public – and shares in the SPAC convert to equity in the new company. The traditional IPO market has been a “closed ecosystem” for most ordinary investors, said Paul Dellaquila, Defiance’s president. An investment in SPAK offers access to companies at the very early stages of their life cycle, with the promise of outsize returns ahead. Right now, the ETF’s portfolio is heavily weighted toward companies that already went public via a SPAC, with only about 20% allocated to pre-IPO companies. Dellaquila expects that to balance out more as the SPAC marketplace matures and individual SPACs become more liquid. For now, that means the portfolio is tilted toward some names investors probably know well: 18.6% is in DraftKings Inc. DKNG, -4.51%, and 4.2% is in Virgin Galactic Holdings Inc. SPCE, -3.12%. “This isn’t going to replace an investor’s core holding,” Dellaquila told MarketWatch. He considers it a good addition to the alternatives section of the portfolio. Top 5 gainers of the past week Invesco SmallCap Consumer Discretionary ETF PSCD, +2.37% 10.4% First Trust NASDAQ ABA Community Bank Index Fund QABA, -0.85% 8.1% Invesco KBW Regional Banking ETF KBWR, -1.15% 8% SPDR Kensho Clean Power ETF CNRG, +2.75% 7.7% SPDR S&P Regional Banking ETF KRE, -1.12% 7.7% Source: FactSet, through close of trading Wednesday, October 7, excluding ETNs and leveraged products Top 5 losers of the past week Vanguard Extended Duration Treasury Index Fund ETF EDV, -0.26% -2.7% iShares Trust – iShares 25+ Year Treasury Strips Bond ETF GOVZ, -0.09% -2.3% AGFiQ U.S. Market Neutral Anti-Beta Fund BTAL, +0.15% -2.2% HCM Defender 100 Index ETF BTAL, +0.15% -1.8% SPDR Portfolio Long Term Treasury ETF SPTL, -0.06% -1.8% Source: FactSet, through close of trading Wednesday, October 7, excluding ETNs and leveraged products Top 5 biggest inflows of the past week iShares 20+ Year Treasury Bond ETF TLT, -0.01% $1.67 billion iShares U.S. Real Estate ETF IYR, -0.42% $788.5 million SPDR Bloomberg Barclays High Yield Bond ETF JNK, +0.15% $623.7 million Vanguard Intermediate-Term Corporate Bond ETF VCIT, +0.10% $592.2 million iShares iBoxx $ Investment Grade Corporate Bond ETF LQD, +0.23% $561.4 million Source: FactSet, through close of trading Wednesday, October 7, excluding ETNs and leveraged products Visual of the week The ARK Innovation Fund flows, 2020 year to date. Source: FactSet"}]}