{"article": [{"url": "https://www.marketwatch.com/story/despite-surge-in-us-coronavirus-cases-trump-tells-fox-news-ill-be-right-eventually-its-going-to-disappear-2020-07-19", "published": 1595247440.0, "headline": "Despite surge in COVID-19, Trump says: 'I'll be right eventually - it's going to disappear'", "body": "President Trump is sticking to his early predictions on COVID-19, despite a surge in cases. During an interview on Fox News Sunday, journalist Chris Wallace asked the president about his repeated statements that COVID-19 would just go away. Starting in February, Trump said that the coronavirus would \"disappear,\" \"fade away\" and/or \"go away\" more than a dozen times. Some 3.8 million people in the U.S. have tested positive; coronavirus has also killed 140,563 in the U.S. “ 'I'll be right eventually. I said it's going to disappear. I'll say it again: It's going to disappear - and I'll be right.' ” - President Trump on the coronavirus pandemic \"I'll be right eventually,\" Trump said during the one-on-one. When Wallace laughed, Trump doubled down on his previous statements. \"I said it's going to disappear. I'll say it again: It's going to disappear - and I'll be right.\" When asked if such statements discredit him, Trump said no, adding, \"You know why it doesn't discredit? Because I've probably been right more than anybody else.\" Wallace said testing was up by 37%, yet positive cases of COVID-19 were up 194%. Trump replied, \"Many of those people are young people that would heal in a day. They have the sniffles.\" Trump will not change his position on masks. \"No, I want people to have a certain freedom,\" he said, adding, \"I don't agree with the statement that if everyone wears a mask everything disappears.\" Asked if he takes responsibility for not having a federal policy on coronavirus during the interview, Trump replied, \"Look, I take responsibility always for everything because it's ultimately my job too. I have to get everybody in line. Some governors have done well, some governors have done poorly. We have more testing by fair than any country in the world.\" CityWatch:CDC confirms that coronavirus already spreading in New York City when European travel ban went into effect in March Of those governors, Anthony Fauci, one of the leading experts on pandemics in the U.S. and director of the National Institute of Allergy and Infectious Diseases for three decades, credited the work of New York Gov. Andrew Cuomo, a Democrat. In an interview on PBS NewsHour on Friday, he said, \"New York got hit worse than any place in the world. And they did it correctly.\" “ 'Some governors have done well, some governors have done poorly. We have more testing by fair than any country.' ” - President Trump Cuomo also issued a mandate that people should wear masks in stores and in public spaces where social distancing was not possible. Hospitalizations in New York have dropped to the lowest daily total since March 18. Several states, including Arizona, California, Texas and Florida, which had relaxed social distancing protocols and started to reopen their economies, have seen a surge. As of Monday, COVID-19 had infected 14.5 million people globally. It had killed over 606,922 people worldwide, according to Johns Hopkins University's Center for Systems Science and Engineering. New York, the epicenter of the virus in the U.S., has still had the most deaths of any state (32,495), followed by New Jersey (15,706) and Massachusetts (8,431). The five-day average for new coronavirus cases hit 70,000, higher than the peak of the pandemic, John Hopkins University reported. Florida reported over 12,400 new cases of coronavirus on Sunday; Gov. Ron DeSantis, a Republican, refused to issue a mask mandate. Invoking the 1933 inauguration speech by Franklin D. Roosevelt, he said, \"I think fear is our enemy here.\" The markets appear torn between optimism on vaccine research and the economic impact of new surges. The Dow Jones Industrial Index DJIA, +0.56%  closed lower Friday, though stocks posted modest weekly gains, as investors looked toward the prospect of further fiscal stimulus. The S&P 500 SPX, +0.87%  and Nasdaq Composite COMP, +1.39%  ended up slightly."}]}