{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-led-lower-by-hsbc-us-virus-worries-2020-07-08", "published": 1594182560.0, "headline": "European stocks led lower by HSBC, U.S. virus worries", "body": "European stocks traded lower on Wednesday, with a surge in coronavirus cases in the U.S. and other parts of the world continuing to weigh on investor appetite. Shares of HSBC Holdings PLC helped drag the index lower amid signs of rising U.S.- China tensions. The Stoxx Europe 600 index SXXP, +0.55% fell 0.3% to 367.78. The German DAX DAX, +0.06% fell 0.2%, the French CAC 40 index PX1, +0.71% dropped 0.4%, and the FTSE 100 index UKX, +0.64% eased 0.2%. U.K. Chancellor of the Exchequer Rishi Sunak is expected to unveil more spending measures to aid the economy’s battle against a Covid-19 downturn, with his summer statement on the economy Wednesday. The Stoxx 600 closed 0.6% lower on Tuesday, tracking losses on Wall Street amid investor concerns that a resurgence of coronavirus cases, specifically across the Sun Belt — the Southeast and Southwest of the U.S. — will make a quick global recovery more difficult. A lockdown in Australia’s Melbourne has also raised concerns. “Covid-19 worries are genuine. But the fact that investors are finally acknowledging this fact is more due to the overbought nature of the short-term market, and not a structural turn in sentiment.,” said Jeffrey Halley, senior market analyst at OANDA, told clients in a note. “That will likely require an escalation in lockdowns across the U.S. Sun Belt states.” U.S. stock futures pointed to modest gains at the start of trading on Wednesday, with Dow YM00, +0.82% up 58 points. China-U.S. tensions were factoring into losses for some shares. A major negative driver for the main Europe index on Wednesday were shares of HSBC HSBC, -0.93% HSBA, -1.49% , which tumbled 3.6%. Bloomberg News reported that advisers for President Donald Trump may try to punish Hong Kong banks by undermining the Hong Kong dollar peg. HSBC has been criticized for supporting Beijing’s national security law in Hong Kong. “Should the peg disappear it could further destabilise Hong Kong and increase currency impacts on earnings,” said Jasper Lawler, head of research at London Capital Group, in a note to clients. Elsewhere, shares of Electrolux AB ELUX.B, +1.21% jumped over 5% after the Swedish home-appliance manufacturer said late Tuesday that it will report a smaller-than-expected second quarter loss for 2020, driven by 3% organic sales growth in June and successful cost cuts. Shares of Nokia Corp. NOK, +2.02% NOKIA, +3.72% tumbled 6% amid a report U.S. telecoms company Verizon Communications Inc. VZ, +0.23% could replace Nokia with Samsung Electronics 005930, -0.33% as a key equipment supplier. A spokesperson for Verizon could not immediately be reached for comment."}]}