{"article": [{"url": "https://www.marketwatch.com/story/crowding-and-the-coronavirus-why-different-parts-of-nyc-have-been-hit-harder-2020-07-02", "published": 1593789080.0, "headline": "Crowding and the coronavirus: Why different parts of NYC have been hit harder", "body": "Urban density has been linked to the spread of COVID-19 in New York City. But it goes further than that, according to medical doctors and researchers. Some dense residential neighborhoods, such Stuyvesant Town-Peter Cooper Village in downtown Manhattan, had far lower rates of infection than others that are just as populated, according to city data. StuyTown, as the locals call it, is the largest rental apartment complex in the U.S., housing more than 27,000 New Yorkers in more than 11,200 units in 56 buildings in Manhattan’s East Village. It represents 1.7% of the borough’s population, according to owners Blackstone and Ivanhoé Cambridge. Its residents also have a higher income than at some other dense housing developments, particularly those in upper Manhattan or the outer boroughs, according to U.S. Census information. There are a few factors that could have played in roles in helping to keep COVID-19 numbers down in StuyTown. During the coronavirus, some residents with resources may have left the city during the pandemic. In addition, the community spans 80 acres, giving people room to spread out, and there also may be fewer people living in each unit than there are in developments in other areas. “There’s a difference between population density and crowding,” said Dr. Uché Blackstock, an emergency medicine physician and the founder and CEO of Advancing Health Equity, which aims to eliminate racialized health disparities. “Crowding is defined as more than one person per room in an apartment or house....and if you have crowding, people are unable to socially distance, right? So if you have one infected person with a highly infectious and transmissible virus, it’s just a recipe for disaster.” New research is backing that up. A study published in June of almost 400 pregnant women in the city showed that lower neighborhood socioeconomic status and greater household crowding increase the risk of contracting SARS-CoV-2, the virus that causes COVID-19. Researchers looked at the infection rates and neighborhood characteristics of 396 women who gave birth at NewYork-Presbyterian/Columbia University Irving Medical Center or NewYork-Presbyterian Allen Hospital from March 22 through April 21. “What we found was that the more dense your personal environment is, so your household rather than the city, ​the greater the likelihood of COVID positivity,” said Dr. Cynthia Gyamfi-Bannerman, a co-author of the study, and a maternal-fetal medicine specialist at NewYork-Presbyterian/Columbia University Irving Medical Center. “It wasn’t as simple as New York City is densely populated and that’s why we have COVID. It was much more granular and specific than that.”By the numbers City data has shown that COVID-19 has disproportionately affected Black and Hispanic residents in lower-income neighborhoods. Many live in crowded quarters that make social distancing all but impossible. ZIP Code data provided by the city shows that in the area covered by 10009, which includes Stuyvesant Town-Peter Cooper Village, there were 712 reported cases. Just over 11% of those tested there were positive. Beam Living, which manages the properties at Stuyvesant Town-Peter Cooper Village, did not respond to requests for comment. About 143,582 people lived in that area in 2018, according to data available from New York University’s Furman Center, which conducts research on housing, neighborhoods, and urban policy. The median household income there was $137,130, about 111% more than citywide median household income ($64,850), with nearly 70% of residents self-identifying as white. About 8% identified as Hispanic and 3.2% identified as Black. Meanwhile, East Harlem saw an almost 20% infection rate, with 2,340 reported cases, city data showed. The population of the neighborhood was about 110,800, with 27.3% identified as Black, 46.5% identified as Hispanic and 16.1% identified as white, according to the Furman Center. Median household income in 2018 was $33,090, about 49% less than the citywide median. Hard-hit East Elmhurst in Queens had an almost 30% infection rate at its peak and 4,486 reported cases. That area has a population of about 150,131 people, with 4.2% identified as Black, 54.3% identified as Hispanic and 5.7% identified as white. The median household income was $54,250, about 16% less than the median. There have been 215,902 cases of COVID-19 reported in New York City as of Thursday, according to New York state data. More than 18,000 have died from the virus, according to the city, and an additional 4,604 deaths are likely to have been caused by the virus, but those victims were not tested.The privilege of social distance Many of these neighborhoods that have had the most cases of the virus often have residents living more than one person to a room, according to the Columbia study. That means that someone showing symptoms of the virus may not have a place to isolate themselves. “Our study shows that neighborhood socioeconomic status and household crowding are strongly associated with risk of infection,” Dr. Alexander Melamed, an assistant professor of obstetrics and gynecology at Columbia University Vagelos College of Physicians and Surgeons and a gynecologic oncologist at NewYork-Presbyterian/Columbia University Irving Medical Center, said in a statement about the research. “This may explain why Black and Hispanic people living in these neighborhoods are disproportionately at risk for contracting the virus.” It was Melamed who had the idea to use a publicly available data set that linked people’s addresses to the built environment and their neighborhoods, she said. That led to their finding that household crowding has more to do with virus contraction than density alone. “The ability to socially isolate is also something that is somewhat related to privilege,” Gyamfi-Bannerman explained. “A lot of the essential workers come from some of these neighborhoods where people still have to commute and still have to do things that maybe others don’t have to do.”Addressing disparities The implications of the study could inform the city’s health department as it navigates the next phases of the pandemic, or the potential second or third wave of the virus. “The knowledge that SARS-CoV-2 infection rates are higher in disadvantaged neighborhoods and among people who live in crowded households could help public health officials target preventive measures, like distributing masks or culturally competent educational information to these populations,” according to Melamed. Research and data like this underscores existing disparities in many of these neighborhoods. Many lack insurance and/or don’t have the funds for preventive medicines, which means they have a host or pre-existing conditions. Blackstock, who also works at an urgent-care clinic in Brooklyn, began reading about how the virus was affecting patients in China at the beginning of the year. Also read: Almost 1.2 million babies could die during the pandemic — but not from the coronavirus “They [were] saying that people with high chronic disease burdens, like diabetes, high blood pressure, asthma, those people aren’t doing well,” she remembered. “I was like, ‘oh no, this is not going to be good.’” She was proved right, sadly. Many of her patients were essential or public transit workers, and she compared them to the “walking wounded.” Additionally, there wasn’t enough testing in these neighborhoods, so cases of the virus were not being identified. Once they were, medical facilities in these neighborhoods were ill-equipped to handle the onslaught of sick patients, without enough ventilators, personal protective equipment and other necessary equipment. Blackstock said that with the possibility of future waves of the virus, the city needs to do a better job working with people across all neighborhoods. That includes making sure they have enough personal protective equipment, working with community leaders, and amping up testing and contact tracing. Also see: After months of speculation, investors get excited about Pfizer, BioNTech’s coronavirus vaccine candidate But it also means addressing the disparities in the system that have existed for years. “It’s not just problems with health care,” Blackstock said. “It’s because they live in neighborhoods where there’s not adequate housing. They don’t have job opportunities that offer them health insurance or give them some sense of job security. They don’t have options for a quality education, and all of those factor into someone’s health. It’s important to have a more holistic view of what it takes to make individuals and communities healthy.”"}]}