{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-drop-over-500-points-to-join-in-global-equity-selloff-2020-09-21", "published": 1600710440.0, "headline": "Dow ends more than 500 points lower but S&P 500 avoids correction in wild Wall Street session", "body": "U.S. stocks suffered a sharp selloff on Monday but avoided a much uglier loss for the main benchmarks, as investors contended with the COVID-19 trajectory in Europe and a lack of progress toward another round of fiscal stimulus out of Washington. Major global banks also faced pressure, after weekend news reports claimed that lenders continued doing business with customers suspected of illicit activity and wrongdoing.How did major benchmarks fare? The Dow Jones Industrial Average DJIA, +0.56% fell 509.72 points, or 1.8%, to close at 27,147.70, well off its low for the session at 26,715.15. The technology-laden Nasdaq Composite COMP, +1.39% staged an amazing turnaround, ending with a relatively meager 14.48-point decline, or 0.1%, to close at 10,778.80, after seeing an intraday nadir at 10,519.49. The Nasdaq-100 index NDX, +1.51%, composed of the Nasdaq Composite’s 100 largest companies, eked out a gain for Monday, up 43.24 points, or 0.4%, to close at 10,980.22. The S&P 500 SPX, +0.87% slipped 38.41 points, or 1.2%, to 3,281.06. The broad-market index managed to sidestep a close beneath 3,222.76, which would have marked the index’s entrance in to correction territory, defined as a 10% drop from its recent peak. Major U.S. benchmarks have suffered three consecutive weekly losses.What drove the market? Stocks ended lower to start the week but it could have been worse, as a late-session rally helped to mitigate some of the day’s worst selling and avoid bearish patterns crystallize in some of the major benchmarks and assets. Helping to catalyze the slump was U.S. and European equities tumbling as a rising number of COVID-19 cases across several European economies sparked fears of renewed restrictions on activity, a development that would slow the global economic recovery’s pace. London Mayor Sadiq Khan said on Monday that he and local officials will propose a round of new restrictions to stem the coronavirus’ spread. Pubs in England could be subject to early closes to tackle rising infections, while some bars and restaurants in hard-hit areas could be shut completely, according to a report from the Sun. Meanwhile, the regional government overseeing Madrid ordered a lockdown for some areas of Spain’s capital. “There remains to be a tremendous amount of uncertainty,” said John Kaprich, investment director at Aware Asset Management, pointing to rising Covid-19 case counts in Europe. “The numbers coming out of Europe don’t look as optimistic as they once did.” Another concern is the heated U.S. political environment heading into November’s general election, which could further delay additional fiscal aid. Equity markets already during the pandemic have been prone to powerful whipsaws. “With an equity market that’s been stretched, it’s not surprising to see a pullback,” Kaprich said. “We went from big, big lows back to normal, not in years, but in months.” See: Monday’s stock-market selloff sets up worst September in 18 years Esty Dwek, head of global macro strategy for Natixis Investment Managers, said it would be important to see what Europe’s climbing case count means to the economic recovery. “Data has basically stalled over the summer, so if [European policy makers] manage to keep activity going with ‘minor’ measures, data can hold up,” she said in emailed comments. “But if the situation deteriorates further or self-discipline impacts growth even further, we could have a tougher few months for European assets.” U.S. and European bank shares fell sharply after BuzzFeed News and other outlets published articles alleging that the world’s most powerful banks continued doing business with customers they suspected of engaging in money laundering and other illicit activities. The SPDR Financial Select Sector ETF XLF, +0.11% dropped 2.8%. Shares of JPMorgan Chase & Co. JPM, -0.57%, which was mentioned in the investigative news report, fell 4.2%. Investors also weighed the potential market implications of Supreme Court Associate Justice Ruth Bader Ginsburg’s death, which looks poised to spark an intense battle over the nomination of her successor, complicating an already bitter presidential election race. Related: Why the Dow is plunging: Ginsburg replacement battle amplifies election jitters President Donald Trump said he would announce a nominee on Friday or Saturday, while Democrats contend the winner of the Nov. 3 election should choose the nominee after the Republican-led Senate in 2016 used that rationale to block a nomination by Barack Obama, following the death of Associate Justice Antonin Scalia. Read:Biden to senators: Extinguish the ‘flames’ engulfing U.S. politics by not ‘jamming’ through a Supreme Court justice Investors continued to watch for signs of the much-discussed rotation from high-growth shares to more beaten-down stocks in industries like retail and energy. Tech-related stocks, which had led the market’s rally back from the March pandemic lows, have flagged in recent weeks, leading the market back down from all-time highs. But Monday’s selloff was led by more growth-sensitive sectors, reflecting the fickle swings in market expectations around an uncertain U.S. economic recovery. On Monday, Dallas Federal Reserve President Robert Kaplan said the Fed’s new forward guidance could create “excesses” in financial markets. Other central bankers including New York Fed President John Williams will speak throughout the day. In economic data, the Chicago Fed’s national activity index, which is designed to gauge overall U.S. economic activity, fell to 0.79 in August from a revised 2.54 in the prior month. The debt burden on the U.S. economy rose at a record pace in the second quarter, with the share of federal government debt soaring 58.9% to $22.58 trillion, as Washington ramped up is response to the pandemic, the Federal Reserve reported on Monday.Which companies were in focus? Shares of electric-truck maker Nikola Corp. NKLA, -1.36% dropped 19.3% after founder Trevor Milton resigned as executive chairman, following allegations by a short seller the company had misled investors about its technology. Oracle Corp. ORCL, +0.42% shares closed up 1.8%, after Trump on Saturday said he had given his “blessing” to a proposed deal that would see the company and Walmart Inc. WMT, +1.00% take over U.S. operations of Chinese-owned app TikTok. Walmart shares rose 1.3%. Beyond Meat Inc.’s BYND, +0.80% stock was off 0.2% Monday, after Friday’s downgrade to underweight from neutral from JPMorgan. Walt Disney Co. DIS, +1.53% shares were 2.5% lower even after it and Lucasfilm said they have teamed up for “Mando Mondays,” a weekly release of new product tied to the blockbuster Disney+ series “The Mandalorian.” Shares of Toll Brothers Inc. TOL, +1.21% were up 5.1% even after the luxury home builder issued an upbeat mid-quarter update. Microsoft Corp. MSFT, +2.48% announced the acquisition of ZeniMax Media and its game publisher Bethesda Softworks for $7.5 billion in cash. Shares of Microsoft rose 1.1%. Shares of electric-car maker Tesla Inc. TSLA, +1.89% gained 1.6%, a day ahead of its battery-technology day. Airline shares tumbled, with Delta Air Lines Inc. DAL, +0.39% shares the worst hit and off 9.2%. Airlines have been battling renewed fears of more lockdowns, especially in the U.K., and the looming expiration of U.S. government aid to protect airline jobs. What did other markets perform? The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% fell 2.4 basis points to 0.67%. Bond prices move inversely to yields. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the performance of the greenback against its major rivals, jumped 0.7%, paring its year-to-date losses to 3%. Gold futures GCZ20, +2.17% slid 2.% to settle at $1,910.60 an ounce. The U.S. crude oil benchmark CL.1, -1.62% slumped 4.4% to end at $39.31 a barrel. The Stoxx Europe 600 Index SXXP, +0.55% dropped 3.2%, while the U.K.’s benchmark FTSE UKX, +0.64% fell 3.4%. In Asia, Hong Kong’s Hang Seng Index HSI, -0.30% fell 2.1% and the Shanghai Composite Index SHCOMP, +1.67% fell 0.6%, while Japan’s Nikkei NIK, -0.11% was closed for a public holiday. William Watts contributed reporting."}]}