{"article": [{"url": "https://www.marketwatch.com/story/when-is-the-first-debate-between-trump-and-biden-2020-09-22", "published": 1601369960.0, "headline": "When is the first Trump and Biden debate?", "body": "Donald Trump and Joe Biden are preparing to face off Tuesday night in the first of three presidential debates, as a Supreme Court vacancy supercharges the election season and the U.S. continues to grapple with the coronavirus pandemic. The first debate will be held at 9 p.m. Eastern on Tuesday, and is hosted by Case Western Reserve University and the Cleveland Clinic, in the battleground state of Ohio. “Fox News Sunday” anchor Chris Wallace will moderate. Now see:Ohio Republicans say they’re seeing suburban support for Trump in sharp decline statewide Trump and Biden will field questions for 90 minutes, without commercial breaks, according to the Commission on Presidential Debates. Topics selected by Wallace are the candidates’ records, the Supreme Court, the coronavirus pandemic, the economy, race and violence in U.S. cities and the integrity of the election, the commission said. A New York Times report that Trump paid just $750 in federal taxes in both 2016 and 2017, and no federal income tax in 10 of the previous 15 years, will also almost certainly be a subject during the debate. The president has disputed the report. Read:Trump reportedly paid no federal income tax in 10 of the 15 years before his election. Why 75 million U.S. households pay no federal income tax. Trump and Biden will debate twice more after Cleveland: on Oct. 15 in Miami and on Oct. 22 in Nashville. Vice President Mike Pence and Biden’s running mate Kamala Harris will have a single debate, scheduled for Oct. 7 in Salt Lake City. Heading into the debates, Trump lags Biden in polls of key battleground-state voters. In Ohio, Biden has a narrow lead over Trump of just over 3 percentage points, according to RealClearPolitics. Biden also led Trump in cash on hand as of Aug. 31. Now read:Democrats score Ginsburg-related surge in donations, after Biden topped Trump last month in cash on hand As MarketWatch has reported, history shows markets DJIA, +0.56% don’t typically see outsize moves following first debates, which are typically the most watched. In the election years since 1960 that did feature presidential debates, the median move by the S&P 500 SPX, +0.87% the following day was a fall of -0.14%, according to Dow Jones Market Data. See:What stock-market investors will be watching for in first Trump-Biden debate. The first debate will be shown on all the major networks and cable channels, as well as on platforms like YouTube. Check out:Biden must ‘aggressively’ push back against Trump to win Tuesday’s presidential debate, expert says"}]}