{"article": [{"url": "https://www.marketwatch.com/story/start-planning-now-for-how-you-will-vote-in-november-2020-08-19", "published": 1601457620.0, "headline": "Start planning now for how you will vote in  November", "body": "The time is now! Voting in the presidential election has begun in many states — as early as Sept. 4 in North Carolina. Every state’s regulations and procedures are different, so it is vital that you understand the requirements and opportunities to vote where you live. Here’s how to make sure you’re ready to vote, and that your vote will count. Check your registration Make sure that you are registered to vote at your current address. You may not have voted in a while. You may have moved or changed your name. You may have forgotten when you last registered to vote. Calling or visiting your secretary of state’s office or local Board of Elections may be a good place to start. You can also visit Vote.org, Rock the Vote, I am a voter or the U.S. Vote Foundation, all nonprofit, nonpartisan websites providing lots of detailed information about voting rights, registration and the process of voting. It took only a few minutes online for me to verify my own registration and voter ID number. The federal government offers lots of useful voting information, too.Not registered? Register now If you’re not registered — whether you have never registered or your registration is out of date — there is still time. Sept. 22 was National Voter Registration Day, when millions of individuals register to vote. Each state has its own process and deadlines, and you may be able to register online through Vote.org, which can take less than two minutes. If you’d rather register to vote on paper, download and print a simple form from the federal government, which asks you to provide some personal information, like your name and address. The instructions give state-specific details and provide the mailing address you need to send the form to. While you’re at it, encourage your friends to register too.Make a plan to vote Not everyone who is registered to vote actually casts a ballot. You’re more likely to actually vote if you make a plan. You’ll need to find out when to vote in person and where to do it. Election Day is Tuesday, Nov. 3, 2020 — but different cities and towns have different voting hours. Many communities have several polling places, and you need to go to the right one, depending on where you live. Make sure you know where to go. In some places you can vote in person for some number of days ahead of Election Day, often at the main municipal government building. Your town office — and its website — will likely have the dates and location information prominently displayed. Read:Ballot drop boxes are safe, secure and have been used by Republicans and Democrats for decades — so why is Trump bashing them? If you don’t want to vote in person, either because of your work or personal schedule, or because of the pandemic, think about voting by mail. Some states will mail you a ballot automatically, either because they conduct their elections by mail or because they have made special provisions to do so as a result of the pandemic. In other states you have to request one — and sometimes you need to provide a specific excuse for wanting to avoid in-person voting. If you’re voting by mail, you may need to pay postage to send your ballot back in. Call your local election office and ask how much you’ll need — and get the right postage. You can order postage online for free delivery — and splitting the cost of a book of stamps is another great opportunity to share voting with a friend. Read:Postal Service head suspends changes until after November election, says can handle mail-in ballots In 2016, nearly one-quarter of U.S. votes were cast by mail. Research and evidence show that it is safe and reliable — though with large numbers of people expected to vote by mail this year, it’s best to mail your ballot back as early as possible to make sure it has plenty of time to arrive before it needs to be counted. The U.S. Postal Service recommends mailing your ballot at least a week before the deadline. Large amounts of mail also might mean you don’t get your ballot in the mail until just before the election. If it arrives with less than a week to go, call your local Board of Elections or municipal clerk immediately to find out what your options are. You may be able to drop off the ballot rather than mailing it in, and you should also still have the option to vote in person, either on or before Election Day. If you’re worried about the safety of voting by mail, there are plenty of administrative and legal protections for mailed-in ballots, and steep penalties for those who tamper with election mail. Set reminders to vote Many people set reminders for all sorts of important things: medical appointments, friends’ birthdays, bill payment dates and so on. Add voting to your calendar — including alerts to request a mail-in ballot, to vote early, to mail your ballot and certainly for Election Day itself.Tell your friends and family Every vote that is cast is a vital contribution to the nation’s future. Encourage everyone you know to vote. You can even invite people to your calendar events — or share your plans on social media, in an email to family and friends. Send texts to people you know. Pledge to call 10 people and ask them to vote, and ask each of them to call 10 more people.Do not be intimidated or afraid If you make your plan and follow the requirements of your state and local government, you can cast your ballot and be certain that your vote will count. You may encounter people claiming there could be “widespread” voter fraud or that the election is somehow “rigged.” But the biggest problem is that so few people actually vote: In 2016, 40% of eligible American voters didn’t cast a ballot. It is your right to vote. Exercise that right proudly and make your voice heard. Now read:I’m the Republican secretary of state in Washington — and I believe voting by mail works Also:Indiana’s alternative to vote by mail: 28 days of early in-person voting Amy Dacey is executive director of the Sine Institute of Policy and Politics at American University in Washington, D.C. She is is a former CEO of the Democratic National Committee. This was first published by The Conversation — “How to make sure your vote counts in November”."}]}