{"article": [{"url": "https://www.marketwatch.com/story/venture-funding-remains-elusive-for-black-tech-entrepreneurs-2020-07-07", "published": 1594280420.0, "headline": "Venture funding remains elusive for Black tech entrepreneurs", "body": "An earlier version of this article had a typo in the spelling of Sarah Kunst, founding managing partner of Cleo Capital. It has been corrected. Lo Toney left Alphabet Inc.’s GV to start Plexo Capital in 2018. Lo Toney A social protest movement sweeping the world has prompted the tech industry to accelerate its glacial progress in recruiting, hiring and promoting Black workers, with recent multimillion-dollar pledges, changes in employment practices, and upper-management appointments. Yet one area remains agonizingly elusive: Venture funding. Venture capital, from Silicon Valley to New York, remains an industry deeply rooted in its investing and hiring patterns, self-perpetuating funding for a limited number of privileged companies that are overwhelming white, male and Ivy League-educated. In its case, the more things change... “Do big funds care deeply? No. If they did, we would have seen change long ago,” Sarah Kunst, founding managing partner of Cleo Capital, told MarketWatch. “Once [social protest] became the thing to do, some did.” See also: Black tech workers hope nationwide protests will force industry to be more inclusive Since the killing of George Floyd in Minneapolis, venerable VC firms have voiced support for protesters and the Black Lives Matter movement. Benchmark, Sequoia Capital, Bessemer Venture Partners and others tweeted in support of the cause and offered to take steps to improve representation in their industry. Nihal Mehta, co-founder of Eniac Ventures in New York, announced on Twitter TWTR, -0.23% that he was taking no-charge appointments with Black founders via Superpeer, which sells one-to-one video calls. Within 24 hours of Mehta’s tweet, he booked more than 100 meetings with Black founders for the summer. Indeed, looking forward, a national reckoning over systemic discrimination could well be reflected in “impact investing” among wealthy millennials and forward-thinking VCs over the next 12 months, resulting in a “significant shift in billions of dollars,” said Keenan Beasley, founder of Venture Noire, a venture catalyst that helps minority entrepreneurs start and connects them to VCs. Still, Kunst and other Black entrepreneurs and investors are skeptical, given paltry investments in Black-founded tech startups, as well as years of inaction. The numbers have barely budged. Of the estimated $136.5 billion in venture funding that went to tech startups in 2019, Black-founded companies received just 1%, according to the nonprofit Transparent Collective. Meanwhile, VC firms have exhibited no hesitation in making a “ton of investments” in emerging technologies like cryptocurrency, virtual reality, augmented reality and potential COVID-19 cures when it wants, Kunst said. Representatives at Sequoia, Benchmark, Mayfield Fund, Bessemer and Kleiner Perkins Caufield & Byers did not respond to email messages seeking comment. Into this vacuum have emerged specialty funds for Black-, Latinx- and female-founded startups. And as these funds invest in diverse companies, they could perpetuate a cycle of growth of more companies and investments. Lo Toney, who left Alphabet’s GV to start Plexo Capital in 2018, said he is “pragmatically optimistic.” Last month, Base10 Partners, the world’s largest Black-led venture capital firm, said it raised $250 million to invest in startups and back a handful of initiatives designed to diversify the mostly white industry. The firm’s second fund is nearly twice the size of its previous one. Additionally, the San Francisco-based company pledged to permanently donate 1% of management fees and 1% of the firm’s future profits to organizations focused on increasing racial justice and representation in tech. Meanwhile, investors including New Enterprise Associates and Science have injected nearly $100 million into PlayVS Inc., an eSports startup founded by Black businessman Delane Parnell, over the past four years — including $50 million in September — according to PitchBook Data Inc. There have been other positive signs, said Toney. Sequoia hired at least one female partner, though not Black or Latina. There have been high-profile pledges, like the $100 million pledge Netflix Inc. NFLX, +1.43% has made to the Black community. And there is the ongoing success of AfroTech, a conference for Black business leaders, that is again scheduled for November in Oakland, Calif. Read more: Netflix launches $100 million commitment to help close ‘centuries-long financial gap between Black and white families’ “I want more than a fleeting moment of cultural and economic equality, and want to leverage the moment,” said Toney, who has pledged to donate more than 1% of his future profits to his alma mater, Hampton University, a historically Black school. Toney said he is speaking with large firms about making similar commitments. Toney is part of a growing community of investors who are breaking from the old norms and narratives of classic VC firms. “In venture, women and minorities are conspicuously absent,” said Chenxi Wang, general partner at Rain Capital in Silicon Valley, an investor in cybersecurity startups, one-third of which are run by women. “We are part of a new approach.” Consider Arlan Hamilton, founder and managing partner at Backstage Capital, a 5-year-old venture-capital fund that has raised more than $7 million and invested in more than 130 startups led by founders who are Black, women and/or LQBTQ. Redirecting the course of VC firms may be akin to turning an aircraft carrier, Wang and others acknowledge, but the current cultural climate has some powerful momentum. At least a dozen major tech companies have made proclamations in recent weeks for specific hiring goals and amounts of money dedicated to the effort, including Facebook Inc. FB, +0.26%, Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97%, Netflix, Slack Technologies Inc. WORK, +3.36%, Microsoft Corp. MSFT, +2.48%, SAP SE SAP, +0.65% and Apple Inc. AAPL, +1.74%. Read more: After years of talk, tech companies appear to be getting serious about diversity efforts “If in a year or two, if we see progress in hires and funding, then great,” Kunst said. “We may see improved dollars [invested in Black-found businesses], but as a percentage of spending I am doubtful it will improve.”"}]}