{"article": [{"url": "https://www.marketwatch.com/story/theres-only-one-person-who-is-looking-out-for-your-retirement-you-11600281642", "published": 1600350260.0, "headline": "Who is looking out for your retirement?", "body": "Walt Disney Co./Courtesy Everett Collection OK, would-be retirees. Do you want the bad news, or the bad news? The bad news is that no one has ever faced a bigger or more difficult retirement challenge than those planning for it today. You’ll live longer after working longer than previous generations (OK, that’s good news, but it makes the finances much harder), you’ll face skyrocketing health care costs during your old age, and the Social Security, Medicare and Medicaid safety network you’re relying on is under sustained attack. The other bad news? When it comes to dealing with all this, you’re pretty much on your own. The finance industry, apparently, is checking out from reality. A case in point is the latest survey of pension fund managers and global money managers. An astonishing 58% of the top money managers in the world have just told Bank of America that they believe “a new bull market has begun.” That figure has doubled just since May. Sure, why not? Never mind that the S&P 500 SPX, +0.87% has already tripled in the past decade. Or that the index is now valued at nearly half of the entire world’s annual economic output. The bull markets of the 1920s, the 1950s and 60s, and the 1980s and 1990s all began when the stock market was trading on less than 10 times the previous decade’s earnings, a ratio known as the Shiller PE after Yale Nobel laureate Robert Shiller. The bull market that began in 2009 began with a Shiller PE of 14. Today? Try 33. Yes, by all means, let’s just assume this is the “floor” and from here the market is going to double, and double again in the years ahead. Meanwhile a survey on retirement preparedness from my old alma mater the American College of Financial Services casually repeats the financial advisers’ mantra about the so-called “4% rule” — the idea that you can withdraw 4% a year (plus inflation) from a retirement portfolio of stocks and bonds and have a 95% chance of making it last 30 years. Again: Sure, why not? As long ago as 2013, Morningstar’s David Blanchett, Texas Tech University’s Michael Finke and the American College’s Wade Pfau pointed out that this rule was wildly out of date. It stemmed from a world when intermediate bonds yielded 5.5% on average and stocks traded on a Shiller PE (again) of around 16, they noted. “Bond yields today are well below and stock market valuations are well above their historical average,” they wrote. “There are no historical periods in the United States where comparable low bond yields and high equity valuations have occurred simultaneously.” They calculated that, based on the valuations when they were writing, the 4% rule had less than a 50% chance of success for a typical portfolio of 60% stocks and 40% bonds. And that was then, when bond yields were 2% and the Shiller PE was 22. Ahem. Today, not only is the Shiller PE way up among the pixies, but the yield on those intermediate bonds is no longer 2%, but…0.3%. Yep. Good luck squeezing the same “average” returns from stocks that are, by one measure, twice as expensive as average and bonds that are, from one point of view, 18 times as expensive. It reminds me of the old joke of the economist who drowned after trying to walk across a river with an “average” depth of 3 feet. You can do a lot with averages. Steve Parrish, a professor at the American College, tells MarketWatch: “There is recent research to suggest this number may be optimistic in light of more recent stock and bond yields. Particularly because the 4% rule of thumb is largely based on historical U.S. stock and bond performance, there is reason to suspect that a lower percentage may be more appropriate because of persistent low interest rates and volatile stock performance. This number is simply meant to offer an initial withdrawal rate to use for decumulating one’s retirement capital, and it assumes the retiree will monitor and adjust as conditions merit.” In this scary environment we’re all going to have to think for ourselves. So it is depressing to see the other gloomy result from the American College’s survey: That vast numbers of us are floundering in ignorance about what we’re supposed to do. Among the alarming findings: Less than a third of those surveyed realize that a 65-year old man is likely to live another 20 years. More than two-thirds have no plan to pay for long-term care needs when they’re old. And barely a quarter realized that long-term nursing home costs typically fall on Medicaid. Read: Long-term care insurance — there’s no good alternative Just 17% plan to maximize their annual Social Security payments by waiting till age 70 to start claiming, while a quarter will claim at 62, as early as possible, even though that will slash their annual payments. Oh, and apparently almost half of those surveyed were unaware that Social Security is hurtling toward a funding crisis in little over a decade. Good times."}]}