{"article": [{"url": "https://www.marketwatch.com/story/four-electric-and-hybrid-vehicles-that-can-tow-some-serious-weight-2020-08-20", "published": 1597900340.0, "headline": "Four electric and hybrid SUVs that can tow some serious weight", "body": "Hybrids and EVs are slowing becoming more popular. But what if you need your (kinda) fuel-sipping hybrid SUV to also tow? Usually, that’s a deal breaker. For example, the Toyota Highlander Hybrid can tow but Toyota TM, -0.65% says that’s limited to about 3,500 lbs. That means you can likely pull a small to medium-size utility or some kind of a horse trailer. However, if you’re seeking to purchase a hybrid or EV that can handle the task of towing even more – say a 23-foot camper, there is hope. Fortunately, there are a handful of models in this segment that can get the job done when there’s towing on the menu. Learn more: Everything you need to know about plug-in hybrids The hybrids and EVs listed below are all capable of pulling 5,000 pounds or more. They’re presented in alphabetical order.2020 Ford Explorer Hybrid The Explorer recently got a complete makeover. The resulting all-new Ford F, -1.36% Explorer is both very similar to the three-row SUV we’ve always loved but also dramatically different. One of the main differences is the addition of a hybrid model. The total driving range is about 450 miles. The rear-wheel-drive version earns an EPA fuel-economy estimate of 29 mpg in combined city and highway driving. That drops to 25 mpg for the hybrid all-wheel-drive version. While the gasoline-only Explorer starts under $35,000, the hybrid is a choice only when you get to the Limited version and that puts the price around $53,000. Still, it’s the least expensive vehicle on this list. Ford says the towing capacity is right at 5,000 lbs. 2020 Lincoln Aviator Grand Touring The Lincoln Aviator Lincoln The Aviator is mechanically similar to the Explorer but they’re far from the same vehicle. This new Lincoln is just as luxurious as European brands and is impressive as a total package. The Aviator Grand Touring is actually a plug-in hybrid (PHEV) model. That means you can drive for about 20 miles on just electricity, then gasoline engine kicks in. It all adds up to a combined EPA rating of 56 MPGe. The twin-turbo engine combined with the electric motor makes 494 hp and 630 lb-ft of torque. Max towing is 6,700 lbs., quite a bit for a luxury hybrid. Price starts just under $70,000 You might like: Keep your dog safe when you travel—here are some pointers2020 Tesla Model X The Tesla model X iStock If you’re looking for a midsize luxury SUV with green credentials, it’s hard to beat the Tesla TSLA, +1.89% Model X. This electrified hauler offers available three-row seating, a gigantic touch screen and a cabin design that’s infinitely modern. And since it’s able to travel up to 295 miles between charges (according to EPA estimates), it offers enough driving range to make it a practical choice for most car shoppers. However, towing will decrease the overall range. The Model X is a star when it comes to towing, and it can pull up to 5,000 pounds. Some owners have tested and exceeded that towing capacity. A Tesla Model X P100D set a new Guinness World Record for the heaviest tow by an electric production passenger vehicle after pulling a Boeing BA, -0.39% 787-9 Dreamliner. Pricing starts at $82,000. 2020 Volvo XC90 Plug-in Hybrid The Volvo XC90 Volvo Volvo has been quietly upping its game, and its current roster features vehicles that are both capable and effortlessly stylish. The XC90 Plug-in Hybrid is one of the standouts in a superb lineup. Its handling is sharp and sure, and its cabin offers a compelling take on Scandinavian elegance. And since it’s a Volvo, this SUV comes with an exhaustive list of active safety features. The Volvo XC90 Plug-in Hybrid is capable of pulling up to 5,000 pounds. Pricing starts at $67,000. Check out: A first look at Toyota’s new RAV4 plug-in hybridBottom line The luxury segment often leads the way in the automotive industry, and this class is home to EVs and hybrids that are at the front of the pack when it comes to towing capability. If you must have an electrified SUV that tows more than 5,000 lbs., the Ford Explorer Hybrid is the most cost-effective way to do that. The new Lincoln Aviator Grand Touring is the best at combining a reasonable luxury SUV price with towing capacity and a plush interior. Also see: These 3 EVs are the lowest cost to own over 5 years This story originally ran on Autotrader.com."}]}