{"article": [{"url": "https://www.marketwatch.com/story/the-10-coolest-things-about-the-new-ford-bronco-2020-07-27", "published": 1595826800.0, "headline": "The 10 coolest things about the new Ford Bronco", "body": "After years of speculation, numerous leaks, and an original launch date pushed back by the ongoing pandemic, Ford F, -1.36% finally pulled the wraps off the revived Bronco. And right away it’s looking like it’s going to turn the adventure vehicle segment on its head. A dedicated off-roader with heaps configurability and new features, the Bronco brings loads of excitement to an already red-hot off-road space, and here we’ll highlight 10 of our favorite things about it.It’s true to the original… kind of 1966 Ford Bronco Ford The original Ford Bronco made its debut back in 1966 as a competitor to the Jeep CJ-5. With its simplistic design, removable roof, and go-anywhere capability, it achieved an iconic status over the years, and the new one looks to pick up where that original Bronco left off. The design of the 2021 model is heavily influenced by the original, with a flat hood, flat doors, and an overall boxy shape, but with modern accouterments, like LED lighting, active safety tech, beadlock capable wheels, available 35-in off-road tires, and much, much more. There’s a two-door version The Ford Bronco 2-door. Ford This may not seem like that big of a deal, but don’t take a two-door SUV for granted here in 2020. These truncated off-roaders offer a better breakover angle and are considerably more maneuverable on the trail, making them the bodystyle of choice for serious off-road enthusiasts. While they were popular decades ago, two-door off-road vehicles are a rarity today, and virtually every one that has been attempted recently, outside of the venerable Jeep Wrangler of course, has been quietly discontinued within a few years. If any vehicle can buck the trend, it’s the Bronco. No pun intended, of course.The roof and doors come off, but the mirrors stay on Ford Clearly targeted at the Jeep Wrangler, the Bronco features a removable roof and doors, just like its Toledo-built rival. Unlike Jeep though, Ford has gone to lengths to make the Bronco’s roof and doors easier to handle. Like the Wrangler, both two- and four-door Broncos are available with a three-piece hardtop with two removable panels over the driver’s and passenger’s seats. But the Bronco also offers an optional four-piece hardtop that adds an additional removable panel over the second row, allowing for an open-top experience for all passengers without requiring the removal of the bulky rear piece. Additionally, unlike the Wrangler which has a cross beam located just above the second row, the Bronco’s rear crossbeam is located over the cargo area, leaving nothing but open sky over the heads of second row passengers. As for the Bronco’s doors, they come without window frames, making them lighter, easier to carry, and perhaps most important of all, capable of being stored in the cargo area, which allows for impromptu door removal. Also on MarketWatch: American muscle: We compare a Chevy Camaro to Dodge Challenger Additionally, unlike the Wrangler, which sees its mirrors located on the front doors themselves, the Bronco’s mirrors come affixed to the A-pillars, meaning that you don’t lose them when you remove the doorsYou can get it with a seven-speed manual transmission The Bronco will launch with two available engines. The entry-level engine is the same 2.3-liter turbocharged four-cylinder found in the Ranger, and makes the same 270 horsepower and 310 lb-ft of torque it does in Ford’s midsize pickup. This engine comes paired to either a ten-speed automatic, or a clever seven-speed manual, the lowest gear of which is a special ultralow crawler gear, meant for technical off-roading. Upper-level models get Ford’s 2.7-liter turbocharged V6, which will make 310 horsepower and 400 lb-ft of torque. This engine comes paired exclusively with the ten-speed auto.It’ll launch with loads of accessories Given the Bronco’s customizability, Ford has made it known that they’ll be introducing a whole line of accessories for the Bronco prior to it going on sale. Think lighting, wheels, tow hooks, winch mounts, roof racks, limb risers (those wires that run from the front corners up to a roof rack), doors with cutouts, fenders, lift kits, rock sliders, bumpers, and more. On top of that, the aftermarket is champing at the bit, with companies from Hennessey Performance to ARB certain to introduce a full line of Bronco products. Rest assured that there’ll be plenty of options for customization.Base and Black Diamond trims come with steel wheels Ford Another seemingly minor point, but in the era of bigger and bigger wheel diameters, it’s nice to see an automaker embracing simplicity, especially in the form of subtle, utilitarian wheel designs. In the off-road space, it’s not uncommon to replace factory rims with smaller, more durable wheels, so it’s great to see Ford offering a set of simple, timeless steel wheels from the factory (for what it’s worth, Land Rover is doing something similar with the new Defender as well). Additionally, the Bronco is said to accept wheels as small as 16-in, which allows for more sidewall, and sidewall is your friend when venturing off-road.There’s more off-road tech than you could dream of Ford In its most capable form, the Bronco will pack an unprecedented array of off-road tech; more than you can get on the Jeep Wrangler. Four-wheel drive is standard, and in addition to two-high, four-high, and four-low modes, the Bronco’s four-wheel drive system will come with an auto mode, capable of switching from two- to four-wheel drive on the fly whenever the system senses slippage. The Bronco will be available with locking front and rear differentials, making it just one of three vehicles offered with independent front suspension and a front locker, the other two being the Chevrolet Colorado ZR2 and Mercedes-Benz G-Class. Read: The best SUVs for less than $40k Like it’s rival from Jeep, the Bronco will also offer an available disconnecting front sway bar, but the Bronco uses a much more sophisticated design than the Wrangler in that it can disconnect under full load. Additionally, the Bronco has an edge on the Wrangler when it comes to breakover and departure angles, ground clearance, and water fording capability (the Wrangler barely beats it out on approach angle). The Bronco is also said to have greater wheel travel than its chief rival, despite its use of an independent front suspension. Finally, the Bronco will offer a ‘Trail Turn’ assist mode, and up to seven different traction modes, including Sand, Rock, and our favorite from the F-150 Raptor, Baja.There’s something called the Sasquatch package It’s fair to say that the most drool-worthy Bronco is any one that’s riding on 35-in tires. To get these, you’ll have to opt for what Ford is referring to as the ‘Sasquatch Package’, and it’s available on all trim levels. In addition to 35-in tires, the ’Squatch Pack gets you 17-in beadlock-capable wheels, Bilstein position-sensitive monotube shocks, a 4.7 final drive ratio, high-clearance fender flares, and every off-roader’s favorite – locking front and rear differentials. We can’t help but wonder if the name of this package isn’t a subtle reference to the legendary Ford F-150-based monster truck known as Bigfoot.The software is as cool as the hardware In addition to its killer mechanical features, the Bronco will pack a new fourth-generation version of Ford’s Sync infotainment system, which will include mainstream features like Android Auto and Apple CarPlay, along with a unique trail mapping feature that allows drivers to plan, program, and follow off-road trail itineraries, and then share them via an integrated social feature. Through the system, you can also access a number of different mapping services, including Trails Offroad, AccuTerra, and FunTreks. Additionally, the Bronco is available with a massive 12-in infotainment screen, and a 360-degree camera system, great for everything from tight parking spots to navigating Hell’s Revenge in Moab.There’s a crossover version The Ford Bronco Sport Ford Ford seems to be setting up the Bronco nameplate to become its own subbrand of off-roaders within the company’s greater lineup, and has thus introduced a small crossover dubbed the Bronco Sport alongside the primary Bronco. While the flagship Bronco comes with a body-on-frame construction and a solid rear axle, the Bronco Sport rides on the same unibody platform as the Escape, and features a fully-independent suspension. Its closest rivals are the Jeep Compass and Cherokee. Also see: Ford promises you can return your car within the first year if you lose your job—here’s how it works While it won’t offer the configurability of the main Bronco, expect the Bronco Sport to offer decent fuel economy, more comfortable on-road driving manners, and a lower price, while being about the most capable body-on-frame crossover there is when it comes to venturing off-road. This story originally ran on KBB.com."}]}