{"article": [{"url": "https://www.marketwatch.com/story/tech-stock-rout-stirs-memories-of-1999-2000-but-heres-whats-different-11599588066", "published": 1599905600.0, "headline": "Tech-stock rout stirs memories of 1999-2000, but hereâ\u0080\u0099s whatâ\u0080\u0099s different", "body": "Alan Greenspan, left, and Jerome Powell Getty Images Ah, memories. For investors old enough to remember â\u0080\u0094 or who otherwise know their turn-of-the-century stock-market history â\u0080\u0094 the selloff in tech stocks that picked up speed in the past week inevitably prompted some reminders of the final stages of the dot-com bubble that saw tech stocks and the Nasdaq Composite COMP, +1.39% and Nasdaq-100 NDX, +1.51% accelerate to all-time highs before collapsing. Technical analyst Jeff deGraaf, founder of Renaissance Macro Research, has argued that there are some valid comparisons to be made between the aggressive actions taken on the monetary and fiscal front six months ago and the Federal Reserveâ\u0080\u0099s intervention to flood the financial system with liquidity in 1998 after the collapse of Long Term Capital Management, deGraaf wrote, noting that six months ago the economy was similarly strong with record low unemployment and a pickup under way in neglected sectors, such as housing. The Fedâ\u0080\u0099s intervention in 1998, after an emerging markets debt crisis brought down the high-profile hedge fund, was credited with helping to propel financial assets to their 2000 peak. DeGraaf said that episode led him to wonder if the monetary and fiscal boost provided in March as the COVID-19 pandemic brought the U.S. and global economy to a near-halt could do the same again. Using the LTCM collapse in September 1998 as one benchmark and March 23, 2020, as a COVID-19 benchmark, he noted similarities, as well as a â\u0080\u009cglaring difference.â\u0080\u009d There was a stretch of nearly 18 months between the LTCM crisis and the Nasdaq-100 peak, he said. â\u0080\u009cToday,Â weâ\u0080\u0099reÂ five monthsÂ intoÂ theÂ COVID aftermath.Â By the time the NDX peaked (in 2000), theÂ FedÂ hadÂ begun removing stimulus, today thereâ\u0080\u0099s little consideration, let alone talk, of stimulus removal.â\u0080\u009d DeGraaf said the recent fall for the Nasdaq-100 had served, in particular, to remind investors of the 2000 peak. He noted that there were some examples of 5%-plus declines in the Nasdaq-100 during the 1999 run-up, which goes to show that momentum-driven markets can suffer brief but meaningful â\u0080\u009cpressure points.â\u0080\u009d Renaissance Macro Research Another key difference, however, is that market breadth â\u0080\u0094 the number of stocks participating in a move â\u0080\u0094 is far healthier than in 1999-2000, he said. Back then, tech â\u0080\u009cwas workingÂ at the EXCLUSION of everything else,â\u0080\u009d deGraaf said. â\u0080\u009cToday, tech is outperforming but not at the absolute exclusion of everything else.â\u0080\u009d While the tech-heavy Nasdaq Composite led the charge higher for major indexes following the marketâ\u0080\u0099s March 23 pandemic bottom, the S&P 500 SPX, +0.87% pushed back into record territory last month and had set a record high close early last week before the tech-led selloff began. The Dow Jones Industrial Average DJIA, +0.56% had pushed back above 29,000 early last week for the first time since February, before the selloff dragged the blue-chip gauge back into negative territory for the year. A spike in 20-day lows for tech stocks suggests some stress has developed, but a â\u0080\u009cfirm relative strength lineâ\u0080\u009d for the Nasdaq-100 and an improvement in communications equipment suggest that while a â\u0080\u009cmodest shiftâ\u0080\u009d may be under way, itâ\u0080\u0099s unlikely to be a â\u0080\u009c2000-style top.â\u0080\u009d"}]}