{"article": [{"url": "https://www.marketwatch.com/story/i-dont-want-to-be-someone-in-need-of-cash-economic-downturns-can-lead-to-consumer-scarring-will-it-happen-now-2020-06-18", "published": 1592560820.0, "headline": "'I don't want to be someone in need of cash': How economic slumps inflicts permanent 'scars' on spending and saving", "body": "Jacob Yi, a 20-year-old college student, says he learned a powerful financial lesson when he saw a line of cars stretching four blocks outside a Fullerton, Calif. food bank. Furloughed from his job unloading inventory at Saks Fifth Avenue, it was Yi's first day volunteering at the food bank, loading groceries into car trunks. He saw the drivers waiting for groceries were in a mix of older cars and some newer models, including a Tesla TSLA, +1.89%  Model X, which start at around $80,000. That moment permanently changed the way he thinks about money, he told MarketWatch. “ 'I see the true power of an emergency fund and cash on hand.' ” - Jacob Yi \"Just seeing that people can't afford necessities in a time like this, and the demand for groceries, is so hard. â\u0080¦ I see the true power of an emergency fund and cash on hand.\" He's stopped his Starbucks SBUX, +0.53%  habit and now orders food once a week, instead of four times. He's doubled his savings account to $2,000. Jacob Yi says the economic downturn has permanently changed the way he thinks about money. Courtesy Jacob Yi In Orlando, Florida, Krista Thompson, an in-house lawyer for a satellite maker and single mother of three, has never spent more money on groceries and less on gas since the pandemic upended her work-life routine. The 35-year-old has taken a 20% pay cut and will be spending less on Christmas presents this year, and putting more towards her rainy day fund. Before the pandemic, Thompson had savings to cover six months of expenses. Now she wants to save enough cash to get her through a year. She's focused on saving - but not as intensely as her grandfather, a man who grew up during the Great Depression and stashed his money under the floorboards years after the economic collapse. Krista Thompson had a six-month emergency savings fund before the pandemic. Now her goal is to save enough for a year. courtesy Krista Thompson \"I don't think I'm going to permanently change how I act financially. I think I'll be more cautious for an extended period of time, in my behavior at least,\" she said. Those two personal-finance tales in the COVID-19 era touch on a broader question: will America's spending and savings habits permanently change because of the pandemic-related downturn? Economic slumps can inflict permanent \"scars\" on a person's views about spending and saving, researchers say. Don't miss:Now I totally get why my father was so frugal “ 'Consumers' past lifetime experiences of economic conditions have a long-lasting effect on beliefs and consumption, which is not explained by income, wealth [and] liquidity.' ” - The study 'Scarred Consumption,' by Ulrike Malmendier and Leslie Sheng Shen Before the outbreak, economists at the University of California, Berkeley and the Federal Reserve wrote in a 2019 paper on \"Scarred Consumers\" that people who live through periods of high unemployment show \"persistent pessimism about their future financial situation and spend significantly less.\" Using information from decades-old ongoing surveys, the authors wrote that people who have lived through periods of high unemployment in their lifetimes \"have more pessimistic beliefs about their financial situation in the future, and are more likely to believe that it is not a good time to purchase major household items in general.\" The effect was seen across age, income levels, and other demographic factors. It's been 100 days since the World Health Organization labeled the coronavirus outbreak a pandemic. Since then, unemployment rates swung from a decades-low rates to double digits, reaching at post-World War II peak in April. Congress spent $2.2 trillion in a stimulus bill that included $290 billion for direct checks to Americans and $260 billion in supplemental unemployment benefits. The economy entered a recession in February, following a record-breaking expansion that lasted more than 10 years. After the \"second great catastrophe in a decade,\" Richard Curtin, director of the University of Michigan's Survey Research Center, says he's \"sure people will save more.\" The center has been producing monthly indices on consumer sentiment for decades. “ The pandemic 'only reinforces these views that you have to prepare and you have to save yourself.' ” - Richard Curtin, director of the University of Michigan's Survey Research Center \"One of the lasting things that consumers learned from the Great Recession was that while large financial institutions could be saved by government policy, even corporationsâ\u0080¦they were too small to save and they were left to face the problems on their own,\" he said. The pandemic \"only reinforces these views that you have to prepare and you have to save yourself.\" (After the Great Recession, Americans' savings rates had been edging upward.) The outbreak will alter many people's \"money scripts\" - a term for their emotional relationship with money - said Angie O'Leary, who heads wealth planning at RBC Wealth Management-U.S. For younger consumers, the downturn could lead to a \"scarcity of goods\" mindset, she wrote. Evidence suggests that, for now at least, Americans are saving more money. Americans in April tucked away one-third of their after-tax disposable income in April, according to the U.S. Bureau of Economic Analysis. That's a record high, up from a roughly 13% savings rate in March and an 8% rate in February. Americans had an aggregate balance of $6.4 billion in all deposit accounts under $250,000 during this year's first quarter, according to the American Bankers Association. That's up from $6.1 billion in 2019's fourth quarter, the trade association said. In that same time, accounts above $250,000 - which exclude retirement accounts - rose from $7 billion to $7.7 billion. Other data challenges the idea we're all fast becoming more frugal. For example, retail sales soared 17.7% month-over-month in May, according to the Commerce Department. Meanwhile, general merchandise sales in the first week of June were up 3% compared to the same point last year, according to the NPD Group, a consumer research company. See also:The stunning retail-sales surge in May is great news, but don't expect a repeat April marked the first time since 2010 that a majority of Americans (51%) told Gallup they were spending less than they were in recent months. This time, 53% of people who said they were spending less viewed it as a \"new, normal pattern for years ahead.\" Ten years earlier, two-thirds of people spending less said this was the permanent pattern.What's happening to money habits now? \"100 days is certainly long enough to form a habit,\" said Wendy Wood, author of 'Good Habits, Bad Habits: The Science of Making Positive Changes That Stick.' Habits are behaviors that develop with repetition until they become an act that's performed without consciously thinking about it, explained Wood, a business and psychology professor at the University of Southern California. It can take two months for a simple task to become a habit, like having fruit at lunch, said Wood. It can take three or four months to establish an exercise routine, which involves more steps. “ 'It will be surprising to many people, I think, that once we get back to some semblance of normalcy, that our habits will come back quite quickly because we are back in the context that is cueing old behavior.' ” - Wendy Wood, professor of psychology and business at the University of Southern California \"It will be surprising to many people, I think, that once we get back to some semblance of normalcy, that our habits will come back quite quickly because we are back in the context that is cueing old behavior,\" she said. Some financial advisors say clients are re-thinking their investing behavior as a result of the pandemic. Ryan Bayonnet, principal of Hyland Financial Planning, a firm in Akron, Ohio's suburbs with $15 million in assets under management, has been telling his clients for years they need to boost their emergency savings. Some only had emergency cash for a month or two when Bayonnet advised between three and six. His clients are predominantly medical professionals, including doctors, pharmacists and dentists. They made it through the 2000 and 2009-2019 downturns without much impact on their own bottom line. This time, some had hours cut or salary reductions and took his advice to heart. “ 'There was almost this illusion you'll never be touched, and now that illusion is gone.' ” - Ryan Bayonnet, principal of Hyland Financial Planning \"There was almost this illusion you'll never be touched, and now that illusion is gone,\" he said. Clients, on average, put an extra 25% to 50% in those emergency funds. He thinks they'll keep those accounts well-funded for good, knowing a recession \"could happen again and they could do something about it.\" Yi was furloughed from Saks Fifth Avenue in late March. If he's called back, it will be July at the earliest. The accounting major has developed a new routine in the meantime. He starts the day reading a chapter or two in a book, and he gets a workout in. He's been trading for 18 months and invests in stocks and index funds - another part of his plans to build up his own money. \"I don't want to be someone in need of cash ever in my life,\" he said. \"I want to be able to help others.\""}]}