{"article": [{"url": "https://www.marketwatch.com/story/the-mandalorian-returns-but-what-other-streaming-picks-are-worth-paying-for-in-october-2020-2020-09-28", "published": 1601810420.0, "headline": "â\u0080\u0098The Mandalorianâ\u0080\u0099 returns, but what other streaming picks are worth paying for in October 2020?", "body": "Baby Yoda is coming back. Disney+ will launch the second season of its flagship series, â\u0080\u009cThe Mandalorian,â\u0080\u009d on Oct. 30. Itâ\u0080\u0099s without a doubt the most anticipated streaming series of the year, and with good reason: In addition to driving tens of thousands of new subscribers to the Walt Disney Co.â\u0080\u0099s DIS, +1.53% Â streaming service, itâ\u0080\u0099s also a whole lot of fun to watch. But aside than that, there arenâ\u0080\u0099t a lot of compelling new streaming offerings next month, making October perhaps a good time for budget-minded consumers to cut back on their subscriptions. As this column has previously mentioned, consumers can take full advantage of cord-cutting by capitalizing on the ability to add and drop streaming services each month, and all it takes is good planning and timing. Remember, a billing cycle starts when you sign up, not necessarily at the beginning of each month. Consumers can also take advantage of deals for free streaming trials, as Disney+ and Apple TV+ in particular focus on building subscriber bases rather than growing revenue (for now, at least). Youâ\u0080\u0099re never going to get a better deal than free, and the offers wonâ\u0080\u0099t last forever. In addition to the new Apple One subscription bundle, for example, you can still get a year of Apple TV+ for free when you purchase a new Apple AAPL, +1.74% Â device, and Verizon VZ, +0.23% Â offers a free bundle of Disney+, Hulu and ESPN+ for some wireless customers. Free and bundled possibilities aside, when itâ\u0080\u0099s time to decide where your subscription dollars should go, Whatâ\u0080\u0099s Worth Streaming is here to help. We rate each major streaming service every month as a â\u0080\u009cplay,â\u0080\u009d â\u0080\u009cpauseâ\u0080\u009d or â\u0080\u009cstop,â\u0080\u009d similar to investment analystsâ\u0080\u0099 ratings of buy, hold and sell, and pick the best content to help you make your monthly decisions. Hereâ\u0080\u0099s a look at whatâ\u0080\u0099s coming to the various streaming services in October 2020, and whatâ\u0080\u0099s really worth the monthly subscription fee.Disney+ ($6.99 a month) Forget Halloween, Disney+ is all about space in October. â\u0080\u009cThe Mandalorianâ\u0080\u009d kicks off its second season at the end of the month, but before that, thereâ\u0080\u0099s the reboot of â\u0080\u009cThe Right Stuffâ\u0080\u009d (Oct. 9). The miniseries, made by NatGeo, is based on the classic Tom Wolfe book, which in turn was made into the Oscar-winning 1983 movie. It focuses on the early years of Americaâ\u0080\u0099s space program, as hotshot test pilots compete to become the Mercury astronauts and push the boundaries of human and technological achievement. The miniseries faces a daunting task: The book and the movie were each nearly perfect, and anything less than that will have to be considered a disappointment. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Season 2 of â\u0080\u009cThe Mandalorian,â\u0080\u009d however, seems like a sure thing. The â\u0080\u009cStar Warsâ\u0080\u009d spinoff series, and Disney+â\u0080\u0099s biggest hit so far, returns on a weekly basis starting Oct. 30. The new season sounds a bit more serialized this time around, as the eponymous bounty hunter (played by Pedro Pascal) and Baby Yoda (sorry Disney, weâ\u0080\u0099re not calling it â\u0080\u009cThe Childâ\u0080\u009d) zip across the galaxy trying to avoid the clutches of the evil Moff Gideon (Giancarlo Esposito). Expect some familiar settings (looks like they make a stop on Tatooine) and new faces (Timothy Olyphant, Rosario Dawson and Termeura Morrison as Boba Fett), as well as the return of some old friends (Carl Weathers and Gina Carano). The first season was a lot of fun, so expect more of the same â\u0080\u0094 the Season 2 trailer looks spectacular. Honestly, â\u0080\u009cThe Mandalorianâ\u0080\u009d is one of the most purely enjoyable, escapist shows out there, and yes, itâ\u0080\u0099s worth signing up for Disney+ just for it. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Those two shows should have Disney breathing a sigh of relief, as the pandemic forced the delay of some of its most anticipated series and movies into 2021, including the new Marvel series â\u0080\u009cThe Falcon and the Winter Soldier.â\u0080\u009d Another Marvel spinoff series, â\u0080\u009cWandaVision,â\u0080\u009d appears to still be on track for release later this year. Whoâ\u0080\u0099s Disney+ for? Families with kids, and hard-core â\u0080\u009cStar Warsâ\u0080\u009d and Marvel fans. For those not in that group, its library is lacking. Play, pause or stop? Play. There arenâ\u0080\u0099t many must-see shows anymore. But â\u0080\u009cThe Mandalorianâ\u0080\u009d is one, and it works on enough levels that the whole family can enjoy it. And for that matter, â\u0080\u009cThe Right Stuffâ\u0080\u009d might be as well.Netflix ($8.99 or $12.99 a month) The best thing coming to Netflix NFLX, +1.43% Â in October isnâ\u0080\u0099t even a Netflix original. Itâ\u0080\u0099s the sixth and final season of â\u0080\u009cSchittâ\u0080\u0099s Creek,â\u0080\u009d the Canadian sitcom that just swept the Emmys. After originally airing on Canadian TV and Pop TV in the U.S. earlier this year, itâ\u0080\u0099ll drop on Netflix Oct. 7, joining the previous five seasons that are already available on Netflix. If youâ\u0080\u0099re late to the game, â\u0080\u009cSchittâ\u0080\u0099s Creekâ\u0080\u009d is about a wealthy family who find themselves suddenly broke, and must reinvent themselves in a small town they once bought as a joke. Itâ\u0080\u0099s a lighthearted, feel-good comedy thatâ\u0080\u0099s well worth checking out. Another one to watch for is â\u0080\u009cRebeccaâ\u0080\u009d (Oct. 21), an adaptation of Daphne du Maurierâ\u0080\u0099s classic 1938 novel that was made into an Oscar-winning movie in 1940 by Alfred Hitchcock. Lily James stars as the new wife of a mysterious and wealthy widower (Armie Hammer), who struggles to settle into life at their estate thatâ\u0080\u0099s haunted by the memory of his deceased wife, thanks in part to the frightening housekeeper Mrs. Danvers (Kristin Scott Thomas). Much like â\u0080\u009cThe Right Stuffâ\u0080\u009d on Disney+, â\u0080\u009cRebeccaâ\u0080\u009d has an imposing task to live up to the iconic source material, but the cast is solid and the movies' trailer looks lush and unsettling. It has the potential, at least, to be very good. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Besides those, Netflix will offer up a smattering of Halloween offerings in October, including the ghost story â\u0080\u009cThe Haunting of Bly Manorâ\u0080\u009d (Oct. 9) and the Adam Sandler comedy â\u0080\u009cHubie Halloweenâ\u0080\u009d(Oct. 7). Be warned: Last year, Sandler warned that if he was snubbed by the Oscars for his legitimately outstanding performance in â\u0080\u009cUncut Gems,â\u0080\u009d heâ\u0080\u0099d make the worst movie ever as revenge. He wasnâ\u0080\u0099t even nominated for an Oscar, so...connect the dots. Also see:Hereâ\u0080\u0099s everything coming to Netflix in October 2020 There are also a handful of new, bingeable shows to get through the next month, including â\u0080\u009cEmily in Parisâ\u0080\u009d (Oct. 2), a comedy-drama series about a Midwestern girl who hopes to make it big in Paris; â\u0080\u009cGrand Armyâ\u0080\u009d (Oct. 16), a drama about five teens struggling to succeed at Brooklynâ\u0080\u0099s largest high school; a new batch of â\u0080\u009cUnsolved Mysteriesâ\u0080\u009d (Oct. 19); and new seasons of David Lettermanâ\u0080\u0099s interview show â\u0080\u009cMy Next Guest Needs No Introductionâ\u0080\u009d (Oct. 21) and the genial food/travel show â\u0080\u009cSomebody Feed Philâ\u0080\u009d (Oct. 30). And for pure comfort-watching, thereâ\u0080\u0099s also the latest season of â\u0080\u009cThe Great British Baking Show,â\u0080\u009d with new episodes every Friday. Whoâ\u0080\u0099s Netflix for? Fans of buzz-worthy original shows and movies. Play, pause or stop? Play. Netflix is still the king of streaming, and October looks like another strong month for new releases, with a little something for everyone.Amazon Prime Video ($12.99 a month) Amazonâ\u0080\u0099s AMZN, +3.01% Â offerings, though, appear a bit weak in October (with one big exception). Among new series, the highlight may very well be â\u0080\u009cTruth Seekersâ\u0080\u009d (Oct. 30), a supernatural British comedy about ghost hunters. It comes from the creative team of Simon Pegg and Nick Frost (â\u0080\u009cShaun of the Dead,â\u0080\u009d â\u0080\u009cHot Fuzzâ\u0080\u009d) which is highly encouraging. The pair have balanced horror and comedy brilliantly in the past (See: â\u0080\u009cShaun of the Deadâ\u0080\u009d), and thereâ\u0080\u0099s potential here for an entertaining series. Prime Video will also drop a quartet of chilling movies from horror factory Blumhouse, withâ\u0080\u009cBlack Boxâ\u0080\u009d and â\u0080\u009cThe Lieâ\u0080\u009d (both Oct. 6) followed byâ\u0080\u009cEvil Eyeâ\u0080\u009d and â\u0080\u009cNocturneâ\u0080\u009d (both Oct. 13). If youâ\u0080\u0099re into scary movies, they may be worth a watch. â\u0080\u009cThe Lie,â\u0080\u009d in particular, looks intriguing, mostly due to its impressive cast â\u0080\u0094 Mireille Enos, Peter Saarsgard and Joey King â\u0080\u0094 along with writer/director Veena Sud. But it also debuted at the Toronto Film Festival two years ago, and that kind of delay should give one pause. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Also see: Hereâ\u0080\u0099s whatâ\u0080\u0099s coming to Amazon Prime Video in October 2020 Amazon will also roll out a competition series for Twitch videogame streamers â\u0080\u0094 â\u0080\u009cChasing the Crown: Dreamers to Streamersâ\u0080\u009d (Oct. 9). Thursday nights starting Oct. 8 will feature NFL football games, and the next two Fridays will see new episodes of the popular (and ultraviolent) superhero satire â\u0080\u009cThe Boys,â\u0080\u009d which concludes its second season on Oct. 9. Those looking for a good binge should also check out fourth and final season of â\u0080\u009cMr. Robotâ\u0080\u009d (Oct. 6), which aired on cable last year. While some fans were put off by the second seasonâ\u0080\u0099s twists, the cyber-conspiracy show corrected itself nicely in its last two seasons, concluding on a satisfying note. Update: In a late-breaking October surprise, Amazon will launch a â\u0080\u009cBoratâ\u0080\u009d sequel on Oct. 23 â\u0080\u0094 and that could be a very, very big deal (the 2006 Sasha Baron Cohen comedy racked up $262 million worldwide in theaters). The first trailer has dropped, and the sequel looks just as stupid, offensive, cringe-inducing and hilarious as the original. In other words: Itâ\u0080\u0099s a must-see. iframe.twitter-tweet { width: 100% !important; } Whoâ\u0080\u0099s Amazon Prime Video for? Movie lovers, TV-series fans who value quality over quantity. Play, pause or stop? (Recommendation has been updated, post-â\u0080\u009cBoratâ\u0080\u009d announcement.) Pause and think it over. While Amazon has an impressive catalog, thereâ\u0080\u0099s nothing particularly compelling about Octoberâ\u0080\u0099s offerings, aside from â\u0080\u009cBorat,â\u0080\u009d which will be required viewing for some people (you know who you are). Hulu ($5.99 a month or $11.99 with no ads) Huluâ\u0080\u0099s new releases may be even less compelling than Amazonâ\u0080\u0099s. Like its rival, Hulu is launching a quartet of horror movies and series just in time for Halloween â\u0080\u0094 â\u0080\u009cMonsterlandâ\u0080\u009d (Oct. 2), â\u0080\u009cBooks of Bloodâ\u0080\u009d(Oct. 7),â\u0080\u009cHelstromâ\u0080\u009d(Oct. 16) and â\u0080\u009cBad Hairâ\u0080\u009d (Oct. 23) â\u0080\u0094 none of which looks particularly outstanding. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } The real draw for Hulu in October will be its extensive library and its ability to show network and cable shows the day after broadcast. That will include â\u0080\u009cSaturday Night Liveâ\u0080\u009d (Oct. 4), â\u0080\u009cThe Bacheloretteâ\u0080\u009d (Oct. 14), â\u0080\u009cThe Voiceâ\u0080\u009d (Oct. 20) and â\u0080\u009cSuperstoreâ\u0080\u009d (Oct. 23), as well as new episodes of â\u0080\u009cFargoâ\u0080\u009d and â\u0080\u009cArcherâ\u0080\u009d from FX on Hulu. Also see:Hereâ\u0080\u0099s whatâ\u0080\u0099s coming to Hulu in October 2020, and whatâ\u0080\u0099s leaving Donâ\u0080\u0099t forget the just-released second season of â\u0080\u009cPen15,â\u0080\u009d a cringe-inducing but heartfelt comedy about the horrors of adolescence. Whoâ\u0080\u0099s Hulu for? TV lovers. Thereâ\u0080\u0099s a deep library for those who want older TV series, and next-day streaming for many current network and cable shows Play, pause or stop? Pause. Hulu remains the best value in streaming, but with a weak offering of originals in October, you wonâ\u0080\u0099t miss much by dropping it for a month or so.HBO Max ($14.99 a month) October will bring a ton more movies and a handful of interesting originals to HBO Max. In terms of big names, the top newcomer is â\u0080\u009cThe Undoingâ\u0080\u009d (Oct. 25), an HBO miniseries starring Nicole Kidman as a New York therapist whose life spirals out of control amid revelations that her husband (Hugh Grant) may have done some very bad things. With a deep pool of talent (it also co-stars Donald Sutherland, and was written by David E. Kelley and directed by Susanne Bier), thereâ\u0080\u0099s no excuse for this to be anything but very good. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Also among the highlights: Greg Berlantiâ\u0080\u0099s docudrama series â\u0080\u009cEqualâ\u0080\u009d(Oct. 22), about the unsung heroes of the LGBTQ+ rights movement; the â\u0080\u009cWest Wingâ\u0080\u009d reunion special â\u0080\u009cA West Wing Special to Benefit When We All Voteâ\u0080\u009d (Oct. 15), in which the cast will perform a live script-reading;â\u0080\u009cDavid Byrneâ\u0080\u0099s American Utopiaâ\u0080\u009d (Oct. 17), a film directed by Spike Lee capturing the Talking Heads frontmanâ\u0080\u0099s critically praised Broadway show; the new documentaryâ\u0080\u009cJohn Lewis: Good Troubleâ\u0080\u009d (Oct. 27), about the late Georgia congressman and civil rights icon; and the season finales of a pair of HBO series, â\u0080\u009cLovecraft Countryâ\u0080\u009d and â\u0080\u009cThe Vowâ\u0080\u009d (both Oct. 18) There are also dozens of new movies coming to the service, including â\u0080\u009cBoogie Nights,â\u0080\u009d â\u0080\u009cFriday,â\u0080\u009d â\u0080\u009cGalaxy Quest,â\u0080\u009d â\u0080\u009cMalcolm X,â\u0080\u009d â\u0080\u009cThe Matrixâ\u0080\u009d trilogy, and â\u0080\u009cWhen Harry Met Sallyâ\u0080\u009d (all Oct. 1). Whoâ\u0080\u0099s HBO Max for? HBO fans and movie lovers. Though frustratingly enough, itâ\u0080\u0099s still NOT for Roku or Amazon Fire users, since HBO Max owner AT&T Inc. T, -1.01% Â has yet to hammer out a deal with the two biggest makers of streaming-TV devices. Play, pause or stop? Stop. If you already get HBO, then by all means explore Max â\u0080\u0094 youâ\u0080\u0099re already paying for it. But the lack of Roku and Amazon compatibility makes it hard to recommend Max for most consumers.Peacock (free basic level, $4.99 a month with ads, or $9.99 a month with no ads) The new-ish streaming service from Comcast Corpâ\u0080\u0099s. CMCSA, -0.99% Â NBCUniversal is fast becoming an appealing option for cord-cutters who still want their network shows. October will see the additions of â\u0080\u009cSaturday Night Liveâ\u0080\u0099sâ\u0080\u009d entire 45-season library (dates TBA), all eight â\u0080\u009cHarry Potterâ\u0080\u009d movies, and â\u0080\u009cMr. Mercedesâ\u0080\u009d (Oct. 15), a dark crime drama from David E. Kelley, based on the books by Stephen King. Brendan Gleeson stars as a retired detective whoâ\u0080\u0099s haunted by an unsolved serial-killing case. The series, which spans three seasons and first ran on the obscure Audience cable network, got good reviews from critics and could be worth a watch. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Two promising late-night talk shows debuted in September â\u0080\u0094 Larry Wilmoreâ\u0080\u0099s â\u0080\u009cWilmoreâ\u0080\u009d and Amber Ruffinâ\u0080\u0099s â\u0080\u009cThe Amber Ruffin Showâ\u0080\u009d â\u0080\u0094 and will drop new episodes every Friday in October. Both are smart, funny and timely, and offer a welcome bit of diversity among the late-night offerings. Peacock will also become the exclusive streaming home of the beloved sitcom â\u0080\u009cParks and Recreationâ\u0080\u009d in October, ending its run on Netflix, Hulu and Amazon Prime Video. It will still be available on Peacockâ\u0080\u0099s free tier, though with ads, along with Peacockâ\u0080\u0099s other prize: â\u0080\u009cThe Office.â\u0080\u009d Update: Peacock is also drawing ire from some soccer fans for keeping big Premier League matches on the paid, Premium tier of the service, rather than airing them on NBCUniversalâ\u0080\u0099s cable channels as they did in the past. But donâ\u0080\u0099t expect that to change anytime soon â\u0080\u0094 U.S. fans of English soccer may be forced to pay up if they want to see live matches. Whoâ\u0080\u0099s Peacock for? If you donâ\u0080\u0099t mind ads, the free version of Peacock is great. If youâ\u0080\u0099re eligible for Premium through a Comcast or Cox cable subscription, itâ\u0080\u0099s also a perfectly fine free addition. Play, pause or stop? Stop. By all means check out the free version (which is now available through Roku devices), but the paid tier will be unnecessary for most people (with the possible exception of soccer fans).Apple TV+ ($4.99 a month) Itâ\u0080\u0099s getting to be a repetitive criticism â\u0080\u0094 Apple TV+ has some decent things to watch, just not enough of them. But as time goes on, its catalog is indeed getting better and a bit deeper. October will see just two big splashes: the nature documentaryâ\u0080\u009cTiny Worldâ\u0080\u009d (Oct. 2), as narrator Paul Rudd explores small but amazing creatures, and the movie â\u0080\u009cOn the Rocksâ\u0080\u009d (Oct. 2), a comedy directed by Sofia Coppola and starring Bill Murray and Rashida Jones. Itâ\u0080\u0099s getting good reviews, as Jones plays an author with writerâ\u0080\u0099s block and a crumbling marriage who reconnects with her father (Murray) while playing detective to find out if her husband (Damon Wayans Jr.) is having an affair. Like many things Apple TV+, it sounds perfectly fine, but not quite compelling enough on its own to jump for a subscription. It shouldnâ\u0080\u0099t be long, though, before Apple has enough of those in its catalog to make it worth signing up (among those: the surprisingly delightful â\u0080\u009cTed Lasso.â\u0080\u009d) div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Whoâ\u0080\u0099s Apple TV+ for? Thatâ\u0080\u0099s the big question â\u0080\u0094 it offers a little something for everyone, but not enough for anyone, really. Play, pause or stop? Stop. With the shallowest library of any other streaming service and only one or two originals a month, itâ\u0080\u0099s still not worth the admittedly low price.CBS All Access ($5.99 a month or $9.99 with no ads) â\u0080\u009cStar Trek: Discoveryâ\u0080\u009d was one of CBS All Accessâ\u0080\u0099 first big shows, and it returns for a third season Oct. 15. While the first two seasons were set about a decade before the original â\u0080\u009cStar Trek,â\u0080\u009d Season 3 will see the crew of the USS Discovery travel 900 years into the future, as they try to reverse a galactic cataclysm. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Meanwhile, the first season of â\u0080\u009cDiscoveryâ\u0080\u009d is airing on CBS this fall, as the broadcast network hopes to lure new fans to the streaming service. All Access (soon to be Paramount+ â\u0080\u0094 long story, weâ\u0080\u0099ll talk about that another time) also has NFL football on Sundays, as well as a growing catalog of shows from ViacomCBS VIAC, -2.34% Â cable networks. Whoâ\u0080\u0099s CBS All Access for? Cord-cutters who miss network TV and sports. Play, pause or stop? Stop. Thereâ\u0080\u0099s still not enough to justify the price.Quibi ($4.99 a month with ads, $7.99 a month with no ads) Forget wondering if Quibi is worth paying for (itâ\u0080\u0099s not, still), the question now is, will it even exist in a couple of months? The troubled short-form streaming service is reportedly looking for a buyer just six months after launching, after failing to meet subscriber and advertising targets. Some experts say the serviceâ\u0080\u0099s underlying technology â\u0080\u0094 particularly its ability to flip screen proportions vertically or horizontally â\u0080\u0094 is worth more than its content (which Quibi doesnâ\u0080\u0099t even own, it just licenses), leading to the very real possibility that we wonâ\u0080\u0099t have Quibi â\u0080\u0094 ahem, pardon, Emmy-winning Quibi â\u0080\u0094 to kick around for much longer. But while itâ\u0080\u0099s still here, Quibi has a few dramatic offerings for October: â\u0080\u009cLast Looksâ\u0080\u009d (Oct. 12), about true crimes that rocked the fashion world; â\u0080\u009cMurder Unboxedâ\u0080\u009d (Oct 19), another true-crime series delving into real case evidence; and â\u0080\u009cThe Expectingâ\u0080\u009d (Oct. 5), a horror series about a mysterious pregnancy. Whoâ\u0080\u0099s Quibi for? Some bigger company that wants its underlying technology, most likely. Play, pause or stop? Stop. Save your money. Just not nearly enough quality for the price, and who knows how much longer Quibi will be around."}]}