{"article": [{"url": "https://www.marketwatch.com/story/infectious-disease-expert-says-were-thinking-too-much-about-a-second-wave-of-covid-19-when-its-really-more-like-a-forest-fire-2020-06-23", "published": 1592918660.0, "headline": "Infectious-disease expert says we're thinking too much about a second wave of COVID-19 when it's really more like a forest fire", "body": "In much the way onlookers can get overly invested in describing the specific status of a market cycle or an economic recession or recovery as if it were an inning of a baseball game - generally leaving aside the fact that extra innings are always a possibility - we've gotten too caught up in the wave metaphor as representative of a country's or region's pandemic experience, says one noted infectious-disease expert. “ 'I think this is more like a forest fire. I don't think this is going to slow down. ... I think that wherever there is wood to burn, this fire is going to burn, and right now we have a lot of susceptible people.' ” - Dr. Michael Osterholm, Center of Infectious Disease Research and Policy at the University of Minnesota The wave language, said Osterholm, is drawn from the pattern of influenza outbreaks, in which an initial case load is traditionally followed by a lull and then a secondary and perhaps tertiary outbreak, whereas in this coronavirus pandemic the U.S. is still seeing daily case tallies trend upward in dozens of states on a regular basis, some 104 days after the World Health Organization formally made its pandemic call. \"I'm not sure the influenza analogy applies anymore,\" he said. \"I don't think we're going to see one, two and three waves - I think we're just going to see one very, very difficult forest fire of cases.\" Dr. Michael Osterholm leads the Center of Infectious Disease Research and Policy at the University of Minnesota. CIDRAP/University of Minnesota Don't miss:Yes, America needs to brace itself for a second wave of coronavirus Watch the \"Meet the Press\" interview: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Read on:5 critical mistakes that created the biggest public-health crisis in a generation"}]}