{"article": [{"url": "https://www.marketwatch.com/story/biden-says-he-wont-downplay-threats-to-u-s-at-pennsylvania-town-hall-11600389869", "published": 1600377740.0, "headline": "Biden blasts Trumpâ\u0080\u0099s â\u0080\u0098close to criminalâ\u0080\u0099 COVID response at Pennsylvania town hall", "body": "Joe Biden is seen on a video screen as he participates in a CNN town hall moderated by Anderson Cooper in Moosic, Pa., on Thursday. Associated Press MOOSIC, Pa. â\u0080\u0094 At a Thursday town hall, Joe Biden went after President Donald Trump again and again over his handling of COVID-19, calling Trumpâ\u0080\u0099s downplaying of the pandemic â\u0080\u009ccriminalâ\u0080\u009d and his administration â\u0080\u009ctotally irresponsible.â\u0080\u009d â\u0080\u009cYouâ\u0080\u0099ve got to level with the American people â\u0080\u0094 shoot from the shoulder. Thereâ\u0080\u0099s not been a time theyâ\u0080\u0099ve not been able to step up. The president should step down,â\u0080\u009d the Democratic presidential nominee said to applause from the drive-in crowd in Moosic, outside his hometown of Scranton. Speaking about Trumpâ\u0080\u0099s admission that he publicly played down the impact of the virus while aware of its severity, Biden declared: â\u0080\u009cHe knew it and did nothing. Itâ\u0080\u0099s close to criminal.â\u0080\u009d Later, Biden decried Americansâ\u0080\u0099 loss of basic â\u0080\u009cfreedomsâ\u0080\u009d during the pandemic, like the ability to go to a ballgame or walk around their neighborhoods. â\u0080\u009cI never, ever thought I would see just such a thoroughly, totally irresponsible administration,â\u0080\u009d he said. Biden faced a half-dozen questions about the coronavirus and a potential vaccine early in the town hall from moderator Anderson Cooper and audience members. The pandemic was not just the main topic of the night â\u0080\u0094 it was the cause of the unusual format of the event: a drive-in of 35 cars parked outside PNC Field. The cars were parked around the stage, each with small groups of people standing outside them or leaning or sitting on the hoods to watch Cooper and Biden on the stage in front of them. The network erected blue and red spotlights over the dirt and gravel parking lot to make it easier to see, and each parking space was marked off with white chalk in large rectangles to ensure that each group of spectators stayed more than 6 feet (1.8 meters) apart. The town hall marked the first time that Biden had faced live, unscripted questions from voters since winning the nomination. Trump participated in an ABC town hall Tuesday in an auditorium in Philadelphia. The appearances have been seen as tuneups before the three presidential debates; the first is Sept. 29, and the stakes for the matchup will be high. Bidenâ\u0080\u0099s uneven debate performances during the Democratic primary contributed to his initial struggles in polls and the early primary vote, and Trump has pushed unfounded conspiracy theories about Biden taking performance-enhancing drugs and has raised questions about Bidenâ\u0080\u0099s mental acuity. Biden, meanwhile, has promised to be a â\u0080\u009cfact-checker on the stageâ\u0080\u009d with Trump but has said he doesnâ\u0080\u0099t want to get drawn into a â\u0080\u009cbrawlâ\u0080\u009d with the Republican. On Thursday night, Biden said he was indeed beginning to prepare for the upcoming debate, by reviewing Trumpâ\u0080\u0099s remarks and preparing his own. The format of Bidenâ\u0080\u0099s event was a stark reminder of the issue thatâ\u0080\u0099s been a central focus of Bidenâ\u0080\u0099s campaign â\u0080\u0094 that the pandemic rages on, affecting Americansâ\u0080\u0099 lives in ways large and small, and that stronger leadership in White House could have eased the crisis. More than 195,000 Americans have died of the coronavirus, by far the highest death toll in the world. Trump and Biden have spent the week accusing each other of undermining public trust in a potential coronavirus vaccine. As Trump prepared for an evening rally in Wisconsin, Biden seized onÂ the president openly contradictingÂ the nationâ\u0080\u0099s top health officials to claim a vaccine would be ready as early as next month, just before the Nov. 3 election. â\u0080\u009cMark my words â\u0080\u0094 if Iâ\u0080\u0099m president, Iâ\u0080\u0099ll always level with the American people, and Iâ\u0080\u0099ll always tell the truth,â\u0080\u009d Biden said in a statement. A former Republican official in the Trump White House â\u0080\u0094 Olivia Troye, onetime homeland security aide to Vice President Mike Pence â\u0080\u0094 endorsed Biden on Thursday, citing Trumpâ\u0080\u0099s mishandling of the pandemic. Earlier in the day, Biden joined Senate Democrats for a conference call lunch and told allies that he is taking nothing for granted in theÂ race for the White HouseÂ and the down-ballot effort to wrest the Senateâ\u0080\u0099s majority control from Republicans. The 30-minute event was a homecoming of sorts for the former Delaware senator. On the private call, Biden fielded questions, particularly from senators facing reelection, about his strategy win back the chamber and defeat Trump. â\u0080\u009cHe just said, â\u0080\u0098You know what weâ\u0080\u0099re up against. You know why this is so important,â\u0080\u0099â\u0080\u009d said Sen. Debbie Stabenow, D-Mich. West Virginia Sen. Joe Manchin said he encouraged Biden to remind workers how much he has been on their side during his many years in government. â\u0080\u009cIâ\u0080\u0099ve said, â\u0080\u0098Joe, people need to know that you recognize the dignity of the work, the people have built this country,â\u0080\u0099â\u0080\u009d Manchin told reporters. â\u0080\u009cThey need to know that you fought for their pensions, you fought for their health care â\u0080¦ and youâ\u0080\u0099re not gonna leave them behind.â\u0080\u009d Bidenâ\u0080\u0099s campaign team has come under scrutiny in recent days over its outreach efforts, particularly for what some see as short shrift with Latino voters. At the same time, Democrats have mixed views over the partyâ\u0080\u0099s get-out-the-vote effort that largely bypasses traditional door-knocking to avoid health risks during the pandemic, instead relying on virtual outreach."}]}