{"article": [{"url": "https://www.marketwatch.com/story/the-ariya-is-nissans-new-electric-crossover-suv-and-it-will-have-some-semiautonomous-tech-2020-07-27", "published": 1595481080.0, "headline": "The Ariya is Nissanâ\u0080\u0099s new electric crossover SUV, and it will have some semiautonomous tech", "body": "TheÂ NissanÂ Ariya is a new all-electric crossover SUV. 300 miles of driving range. Priced â\u0080\u009caround $40,000â\u0080\u009d according to Nissan â\u0080\u009cHands-offâ\u0080\u009d automated driving in some circumstances You might remember the IMx, the concept car thatÂ Nissan NSANY, -1.50% Â Â showed offÂ back in 2017. At this yearâ\u0080\u0099sÂ Tokyo Auto Show, Nissan introduced the all-new Nissan Ariya Concept, then followed that up with the production version in July of 2020.Â The Nissan Ariya is anÂ electric crossover SUVÂ that kicks off the next chapter in Nissan vehicles. The company even has a new logo. If Nissan can bring the Ariya to the market in a timely fashion, it could seriously compete with theÂ Â Tesla TSLA, +1.89% Â Â Model Y,Â Toyota TM, -0.65% Â RAV4 Prime, andÂ Fordâ\u0080\u0099s F, -1.36% Â Â Mustang-inspired electric crossover. How fast, how far, how much? The Ariya will be available for sale as early as the fall of 2021. Nissan says the range of 300 miles is a â\u0080\u009cpreliminary Nissan estimate for the long-range 2WD model.â\u0080\u009d Thatâ\u0080\u0099s kind of a loaded statement because it tells us that there will be an all-wheel-drive version, which Nissan has confirmed. It also tells us that there will be varying models with different ranges, likely, costing more or less depending on how far you want to go on a single charge. That â\u0080\u009caround $40,000 priceâ\u0080\u009d will probably be for the base model. Based on Nissanâ\u0080\u0099s reinvention of itself, that base model will probably include some premium features with the option to add more. The 0-to-60 mph time should be under 5 seconds. Check out: A first look at Toyotaâ\u0080\u0099s new RAV4 plug-in hybridHereâ\u0080\u0099s what we know We know the physical dimensions of the Ariya â\u0080\u0094 the crossover will be pretty similar to theÂ Nissan RogueÂ compact crossover, but itâ\u0080\u0099ll be wider and lower to the ground, which gives it a decidedly more athletic stance. Itâ\u0080\u0099s a 2-row, 5-passenger crossover. Buyers will have the choice of front-wheel drive or â\u0080\u009ce-4FORCEâ\u0080\u009d all-wheel drive. Nissan describes e-4FORCE like this: â\u0080\u009cThe e-4FORCE balances the powerful performance with a smooth, comfortable ride and all-weather capability. The systemâ\u0080\u0099s twin electric motors provide balanced, assured handling with sports car-level power.â\u0080\u009d Over-the-air firmware, Amazon AMZN, +3.01% Â Alexa, Android Auto, and Apple AAPL, +1.74% Â Car Play are all on board as are Nissanâ\u0080\u0099s excellent Zero-Gravity seats. Nissan says the Ariya is the beginning of a new look for the brand. The exterior is interesting and the front plays off of the V-Motion grille shared by most Nissan models, but weâ\u0080\u0099re more interested in the interior. Itâ\u0080\u0099s very minimalist â\u0080\u0094 the 12.3-in screen has just one physical knob, and the rest of the controls appear to be via either touchscreen or haptic feedback. Thereâ\u0080\u0099s also a prominent digital driver information display rather than a traditional gauge cluster. Itâ\u0080\u0099s a sleek and clean look that we hope to see in future production Nissans.Safety In addition to the next generation ProPilot Assist 2.0, the Ariya gets a bunch of standard safety equipment. Nissan Safety Shield 360 is standard and that includes automatic emergency braking, forward collision warning, rear automatic braking, lane-departure warning, blind-spot warning, rear cross-traffic alert, high-beam assist, and Nissanâ\u0080\u0099s around-view monitor. Also see: The 10 best new car models of 2020 Nissan is also promising ProPilot 2.0, the next step in Nissanâ\u0080\u0099s semiautonomous driver assistance technology suite, on the production-model Ariya. The suite will include hands-free highway driving, similar to what you can find with theÂ Cadillac Super CruiseÂ system. No production Nissan available in the U.S. is equipped with ProPilot 2.0 yet, so itâ\u0080\u0099s possible that the Ariya will introduce that tech to American buyers.The Leaf needs a friend TheÂ Nissan LeafÂ was one of the first all-electric cars from a mainstream automaker. That was 10 years ago. When the Ariya hits the market, itâ\u0080\u0099ll be nice to see the Leaf finally get an SUV counterpart that hopefully delivers similarly strong value.Â Also see: These 3 EVs are the lowest cost to own over 5 years See the specs here. This story originally ran on Autotrader.com."}]}