{"article": [{"url": "https://www.marketwatch.com/story/restaurants-in-new-york-city-look-to-reopen-but-future-remains-uncertain-2020-06-17", "published": 1592411060.0, "headline": "Restaurants in New York City look to reopen, but future remains uncertain", "body": "New York City’s bars and restaurants face mounting losses, and their workers an uncertain future, as they prepare to reopen for outdoor dining as part of the city’s second phase, which Gov. Andrew Cuomo announced will begin on Monday. “It’s scary,” said Robert Guarino, who owns several restaurants in New York City and is the CEO of Five Napkin Burger, which has four locations in Manhattan. “But I’m excited about starting to ramp up again and then getting people back to work.” Cuomo shut down restaurants for all business except takeout and delivery orders on March 16 in New York City, once the national epicenter for the virus and where more than 17,000 lives have been lost. Since the shut down and throughout Phase 1, eateries have adjusted to a grab-and-go model, in which bars are temporarily allowed to serve liquor to-go along with food orders. Starting with Phase 2 on Monday, they will be allowed to serve customers outdoors, six feet apart. During Phase 3, restaurants will be allowed to serve customers indoors at 50% of maximum occupancy . But how exactly bars and restaurants in New York City will navigate phases of reopening with limited capacity, or be able to reopen at all, is still unclear. Watch: Inside Seattle’s ‘Autonomous Zone’ “The vast majority of restaurants and bars are owned by small business owners,” said Andrew Rigie, executive director of the New York City Hospitality Alliance, a nonprofit that represents and serves restaurant and nightlife establishments in the city. “They don’t have big investors behind them or large cash reserves to weather this storm.” David Stockwell is the owner of Faun in Prospect Heights, Brooklyn, which specializes in Italian-leaning fine dining in a casual atmosphere. The restaurant closed down for months this spring because of coronavirus and PAUSE orders. He described the pandemic’s effect on his business as getting “hit by a Mack truck.” Faun has about three staff people at the moment, down from around 30 it has during the busiest times of the year. The restaurant has an outdoor patio, but with socially distancing, it will seat a fraction of what it could before the pandemic, and is at the whim of a rainstorm. “It’s not just turning the switch back on,” Stockwell said of reopening. “We’re not going to be at full revenue because we’re limited in capacity. So you have to come up with a new model that works with this different kind of capacity and more delivery. And we weren’t a restaurant that was really set up to do a lot of delivery in the first place.” Meanwhile, restaurants will have to deal with previous costs like rent while competing for fewer customers. Other factors that will affect businesses during the next few months are a lack of tourists and lower foot traffic, according to Melissa Fleischut, the president and CEO of the New York State Restaurant Association, a trade group. It will be well into July or potentially later when restaurants can bring diners inside as part of Phase 3 of reopening. How quickly the city goes from one phase to another is based on how successful it is at keeping coronavirus infection rates low, diagnostic testing capacity available, and building a robust contact tracing program. Even then it will be at a reduced capacity. “If indoor dining is limited to 50% of their occupancy, which it is under the current state guidelines, where are they going to make the rest of it up?” Fleischut said. “Are they going to be able to increase delivery and takeout? Are they going to be able to use outdoor dining to help make that up?” It’s also unclear how comfortable New Yorkers will be to eat in restaurants, even when they’re allowed. The coronavirus pandemic’s effect on consumer behavior remains to be seen, but an economy that has been decimated does not bode well for discretionary spending. “When are people going to get jobs back and have disposable income to eat and drink out?” Rigie said. Also read: The coronavirus recession is destroying millennials’ retirement dreams and they need to act now The Paycheck Protection Program, a forgivable loan program for businesses that restaurant owners can qualify for, was passed by Congress in April, but many restaurant owners found it difficult to navigate major restrictions about how they had to use the money, and even get the loan in the first place. To supplement that, de Blasio announced earlier this month a “Restaurant Revitalization Program,” to support restaurant workers and employers affected by COVID-19. The program includes short-term payroll support, and restaurants will be eligible for funding up to $30,000. However, only $3 million will be spent to support around 100 restaurants and 1,000 displaced restaurant workers in a city of millions. Before the pandemic, New York City had more than 25,000 eating and drinking establishments, according to the NYC Hospitality Alliance. All four locations of Five Napkin Burger have stayed open for delivery and takeout orders. The chain had around 300 employees before coronavirus quarantine, according to Guarino, and is now running with about 50 employees. Don’t miss: As tables turn, New York fears visitors from out of state could cause rise in infections “I almost feel like I’m busier just trying to learn about the different loans, loan programs that are out there and figure out planning for the future and, you know, negotiating with landlords,” Guarino said. “It’s been a very intense few months.” All of the Five Napkin Burger locations already have sidewalk cafe permits, and Guarino was working to adjust what outdoor seating will look like during Phase 2. He will also reach out to some former staff about coming back for the next phase. “Once we actually start, once we have a better gauge of demand, then we’ll know how many people we can bring back and when. And that’s really what we’re looking forward to,” Guarino said."}]}