{"article": [{"url": "https://www.marketwatch.com/story/just-launched-an-etf-made-for-black-swan-moments-like-these-11600288102", "published": 1601121860.0, "headline": "Just launched: an ETF made for black-swan moments like these", "body": "Could previously unimaginable market events start to become more common as the underpinnings of global stability melt away and years of massive central bank intervention lose their firepower? Gabriel Bouys/Agence France-Presse/Getty Images How is the market going to perform over the next several months? While every moment in history may always feel like the most precarious so far, this year’s pandemic and unstabilized geopolitics may mean 2020 is truly a special case. Any one of a number of triggers over the next few months – a hard Brexit, a contested U.S. election, a COVID-19 vaccine failure – could prompt a market tumble, like in early March. On the other hand, policy responses, or welcome surprises, may trigger a meltup, like the one that started in late March. There may just be an ETF for that. The Simplify US Equity PLUS Convexity SPYC, +0.83% exchange-traded fund, launched in early September, uses options to offer investors access to the broader stock market, with protection against big swings either way. “The question you have to ask is, what are markets going to look like for the next six months or so, and anyone who tells you he knows is lying,” said Dave Nadig, chief investment officer and director of research at ETF Database. “Four or five years ago, we’d all have a baseline expectation, with a few variations,” Nadig said in an interview. “Now we’re in a different kind of market. The tails become as likely as the central tendency. SPYC is a product specifically designed for this world where the curve has been squashed, so you can maximize the profit from the tails.” Simplify is a new issuer of ETFs, but it was founded and is run by industry veterans, including Paul Kim and Brian Kelleher, who both spent years at PIMCO, the massive asset manager known for its bond strategies. The two want Simplify to be “the PIMCO of options,” Kim told MarketWatch. The options strategy works like this: 98% of SPYC’s portfolio is invested in the S&P 500 SPX, +0.87% via iShares’ popular and dirt-cheap ETF IVV, +0.87%. The remaining 2% is in puts and calls – financial instruments that allow the investor to sell and buy the underlying security at certain points in the future at pre-specified prices. That 2% does a lot of heavy lifting. Puts offer downside protection, helping preserve capital, while calls protect against big upside moves. The bigger the market swings, the more those benefits accrue to the portfolio. (That’s a financial markets concept known as “convexity,” which is the “C” in the ETF’s ticker.) What’s a worst-case scenario for an investor in SPYC? One where markets drift along for a while and don’t go too far up or down. The 2% allocated to the options strategy would be lost – $100 invested in the fund, say, would become $98. Solving for the problem of the two “tails” isn’t just an ETF industry pet project. It’s top of mind for advisors and investors big and small, Kim notes. Stanley Druckenmiller, the former hedge fund manager now worth billions, told Bloomberg News early in September that the market is in “a raging mania” because of Federal Reserve intervention. Inflation could skyrocket by 5 or 10% over the next few years, he said – and yet deflation is just as possible. SPYC’s two-tail strategy differentiates it from the “low-volatility” products like the Invesco S&P 500 Low Volatility ETF SPLV, +0.82% and the iShares Edge MSCI Min Vol ETF USMV, +0.64%, which got so-so reviews for their performance through the March mayhem. It’s also distinct from the popular “defined outcome” products pioneered by companies like Innovator, which offer what Nadig calls “guardrails.” investors in those products give up some upside in exchange for some protection against downside risk, and both parameters are known in advance. Whether or not this is truly a more challenging time or unknowable investing landscape than ever before is up for debate. But one thing is certain: 2020’s market backdrop adds an additional wrinkle. Thanks largely to central bank maneuverings in the wake of the coronavirus crisis, time-tested approaches to managing investment risk may no longer work. Read: The Fed is going to buy ETFs. What does it mean? “Our claim is that bonds are just as risky now,” Kim said. “You’re getting the return of cash with interest rate and credit risks. Cash could even be less risky than bonds.” Bond valuations TMUBMUSD10Y, 0.777% are near all-time highs and yields near all-time lows. But moving money into cash carries plenty of risk, as well: the S&P 500 is up more than 50% from its late March low. Other traditional safe-haven assets, like gold, are similarly stretched, Nadig argued. Meanwhile, he said, “we’re more likely in this environment for the foreseeable future than in another because we’ve pulled forward so many decades of monetary policy. I think that we have created so many pro-cyclical, reflexive pockets of the economy that I would argue black swans are becoming gray real fast.”"}]}