{"article": [{"url": "https://www.marketwatch.com/story/retail-sales-gains-in-may-may-fade-once-government-stimulus-money-runs-out-experts-say-2020-06-16", "published": 1592384240.0, "headline": "Retail sales gains in May may fade once government stimulus money runs out,  experts say", "body": "The record 17.7% surge in U.S. May retail sales is driving Tuesday’s stock market rally, but experts are concerned that once consumers spend their government stimulus money, the urge to shop will disappear. “It is clear that huge fiscal and monetary support, including the extra $600 per week in unemployment benefit, has given households the income and the confidence to spend,” wrote James Knightley, chief international economist at ING. “However, this $600 extra payment ends in July and we must remember that employment is still 20 million down on where it was at the beginning of the year,” he said. “As such the outlook for the coming months remains uncertain and is going to be determined by how quickly the re-opening gathers momentum and how many of the laid-off workers return to their previous jobs.” Knightley is also keeping an eye on renewed jumps in COVID-19 cases in states that have reopened. Ten states, including California, Florida and Texas saw record hospitalizations this past Sunday. See:Retail sales surge a record 17.7% in May but coronavirus wounds still visible Retailers that sell essentials like Walmart Inc. WMT, +1.00% , Target Corp. TGT, +1.14% and Costco Wholesale Corp. COST, +1.19% remained open as other retailers shut down, and carry food, disinfectant and other items that shoppers sought during their time at home. Clothing stores suffered the steepest year-over-year declines between March and May 2020, though other categories, including electronics, were down as well. During the month of May, clothing stores were up a whopping 188%. In April, retail sales fell a record 14.7% as consumers and businesses were locked down to combat the coronavirus pandemic. Read:Lululemon Athletica is the top publicly traded specialty retailer, says Susquehanna Faced with a jump in coronavirus case numbers, the National Retail Federation is still pushing to allow stores to remain open. “The most important thing now is to keep these retail stores open for business and not penalize them by closing their doors in the event of a coronavirus surge,” said Matthew Shay, chief executive of the National Retail Federation, during a CNBC appearance on Tuesday. The NRF is the largest retail trade association in the world. “As those stores that remained open – our economic first responders – have shown, retailers have developed solutions that protect the safety of their customers and associates, and they are sharing those lessons to the benefit of store owners large and small in communities across the country.” Among the solutions that retailers have devised are limiting crowds in stores, encouraging social distancing, and installing barriers at checkout stations to protect both workers and customers. GlobalData retail says a second shutdown could do further damage to a retail sector that has also seen declines and bankruptcy filings from well-known retailers like J.C. Penney Co. Inc. JCP, -2.53% and JCrew which had been struggling even before COVID-19 struck. “In our view, the damage from this would be far worse than the first shutdown and would immediately reverse the embryonic recovery,” said Neil Saunders, managing director at GlobalData Retail. He also cautioned about a fall-back in consumer activity in late summer and fall once the impact of unemployment benefits and other government stimulus payments diminishes and he warned about the damage being done to retailers’ profits. Don’t miss:Walmart surpasses eBay in U.S. e-commerce for the first time, Amazon still stops: eMarketer “[W]hile sales numbers are improving, there continues to be immense damage to the bottom line,” he said. “Much of retail is a volume business and even gentle declines in sales can cause severe erosion to profits.” With so much retail activity shifting online, retailers are using store locations in a variety of ways. Besides the traditional sales transactions, curbside pickup has become popular, with customers driving up to retail locations to retrieve online purchases, but not going into stores. Retailers have also frequently used their stores as mini-fulfillment centers, shipping items bought online from a brick-and-mortar location rather than a fulfillment center. Still, online sales have not replaced stores. “E-commerce sales have jumped 18% so far this year but this is not enough to offset the decline in store sales, and not all retailers were prepared for the sudden switch to online sales,” said Dr. Kerstin Braun, president of Stenn Group, an international trade finance provider. With many stores closed, those that made big digital investments prior to the pandemic were well-positioned. “Walmart, with its extensive store footprint, loyal customers, and robust e-commerce platform is emerging as the winner in the omnichannel retail game,” Braun said. The SPDR S&P Retail ETF XRT, +0.05% is down 6.4% for the year to date, the Amplify Online Retail ETF IBUY, +1.39% is up 32.7% for the period, and the S&P 500 index SPX, +0.87% is down 3.3%."}]}