{"article": [{"url": "https://www.marketwatch.com/story/trump-warns-bolton-could-face-criminal-charges-if-his-book-is-released-2020-06-15", "published": 1592246960.0, "headline": "Trump warns Bolton could face criminal charges if his book is released", "body": "WASHINGTON — President Donald Trump said Monday that his former national security adviser, John Bolton, could face a “criminal problem” if he doesn’t halt plans to publish a new book that describes scattershot, sometimes dangerous, decision-making by a president focused only on getting re-elected. Trump said it would be up to Attorney General William Barr to issue any charges, but hinted that the matter would end up in court. “We’ll see what happens. They’re in court — or they’ll soon be in court,” Trump said about the book, set to be released early next week. The president accused Bolton of not completing a pre-publication review to make sure the book does not contain classified material. That contradicts statements from Bolton’s attorney, Chuck Cooper, who says his client worked painstakingly for months with classification specialists at the White House National Security Council to make changes to avoid releasing classified material. Barr echoed Trump’s accusation. During an event at the White House, the attorney general said administration officials who have access to sensitive information typically sign non-disclosure agreements that require them to go through a clearance process before they can publish something based on information they accessed in the job. “We don’t believe that Bolton went through that process — hasn’t completed the process — and, therefore, is in violation of that agreement,” Barr said. The Trump administration is “trying to get them to complete the process — go through the process — and make the necessary deletions of classified information,” Barr said. Bolton’s book, “The Room Where It Happened: A White House Memoir,” was supposed to be released in March. Its release date was twice delayed and it is now set to be released next week by publisher Simon & Schuster. “Bolton covers an array of topics — chaos in the White House, sure, but also assessments of major players, the president’s inconsistent, scattershot decision-making process, and his dealings with allies and enemies alike, from China, Russia, Ukraine, North Korea, Iran, the United Kingdom, France, and Germany,” according to the publisher. “I am hard-pressed to identify any significant Trump decision during my tenure that wasn’t driven by reelection calculations,” Bolton writes in the book, according to a news release from the publisher. In a recent op-ed published in The Wall Street Journal, Cooper accused the White House of using the pre-publication review process as a way to protect the president from embarrassment. He said he sent Bolton’s manuscript to classification specialist Ellen Knight on Dec. 30, 2019. Knight and Bolton, who was Trump’s national security adviser for 18 months ending Sept. 10, 2019, spent nearly four months going through the nearly 500-page book multiple times, “often line by line,” Cooper said. In a March 27 letter, Knight thanked Bolton for his efforts to address the classification issues, but said additional edits were required to ensure national security information was protected. She outlined her concerns in 17 single-spaced pages of typed comments, Cooper said. He said Bolton worked through that weekend and sent Knight a response the following Monday. Bolton accepted most of Knight’s suggestions and proposed alternative solutions to others, Cooper said. In mid-April, after resolving a shorter list of remaining issues, it appeared that the pre-publication review process had been finalized. Yet when Bolton asked for a letter confirming his book was cleared for publication, Cooper said his client was told his book had prompted “very delicate” interactions at the White House and there remained “some internal process considerations to work through.” Knight said she thought the letter might be ready soon, but more than six weeks later, Bolton still hasn’t received it. On June 8, Bolton got a letter from John Eisenberg, the president’s deputy counsel for national security, who claimed that Bolton’s manuscript still contained classified information and that publishing the book would violate his nondisclosure agreements. “This is a transparent attempt to use national security as a pretext to censor Mr. Bolton, in violation of his constitutional right to speak on matters of the utmost public import,” according to Cooper. “This attempt will not succeed, and Mr. Bolton’s book will be published June 23.”"}]}