{"article": [{"url": "https://www.marketwatch.com/story/it-took-decades-for-me-to-retire-wealthyshould-i-feel-guilty-11595355928", "published": 1595422820.0, "headline": "It took decades for me to retire â\u0080\u0098wealthyâ\u0080\u0099â\u0080\u0094should I feel guilty?", "body": "Getty Images/iStockphoto If youâ\u0080\u0099ve worked a lifetimeâ\u0080\u0094while prudently saving and investingâ\u0080\u0094so that in old age youâ\u0080\u0099re well off financially, should you feel guilty? If your retirement income is greater than the income of most American families, including those still raising young children and facing college costs, as well as the cost of their own retirement, is that embarrassing? A few years back, during a discussion about how people spend, save and invest, my son-in-lawâ\u0080\u0094whoâ\u0080\u0099s a financial adviser to high net worth familiesâ\u0080\u0094casually said to me, â\u0080\u009cYouâ\u0080\u0099reÂ wealthy.â\u0080\u009d What? Me wealthy? Iâ\u0080\u0099m not even close to qualifying as one of his clients. I was shocked by the comment. Had I completely lost perspective? Iâ\u0080\u0099m well aware of the data on Americansâ\u0080\u0099Â income,Â net worthÂ andÂ savingsÂ rates. Rather, I think my shock reflects the fact that my road to wealth (I still cringe at that word) has been a long one. I started work at age 18, retired at 67 and have continued to collect investment gains in the 10 years since. My wealth isnâ\u0080\u0099t that out of line with the averageâ\u0080\u0094meaning theÂ mean, not the medianâ\u0080\u0094for Americans in my age group. I suspect many seniors have been on a similar long journeyâ\u0080\u0094â\u0080\u009clongâ\u0080\u009d being the operative word. When I listen to some millennials talk, I get the impression they believe us old folks rolled out of bed at age 18, instantly found financial success and that the road to where we are today was without potholes and bumps. Half of my investment wealth is the 401(k) balance Iâ\u0080\u0099ve accumulated since 1982. Another chunk is my former employerâ\u0080\u0099s stock, which I amassed over my career of nearly 50 years by taking advantage of the companyâ\u0080\u0099s stock purchase plan and reinvesting dividends. What about the rest? Much of it was accumulated in the years after sending our four children to collegeâ\u0080\u0094a decade of high costs that ended in 1998. Those were the lean years, when I worked full time, while running a small side business just to get by. A big portion of my net worth is real estate. Some of that came from living in a modest home for 44 years that we purchased for $59,000 andÂ recentlyÂ sold for $505,000. The proceeds allow us to live in our current condo mortgage-free. I also bought a vacation home 33 years ago for $159,000, which I rented most of the summer to help pay the mortgage. Itâ\u0080\u0099s now valued at $425,000. In retirement, I drive aÂ luxury carâ\u0080\u0094my one frivolous purchase. But in my defense, I saved for more than a decade, so I could pay cash for it at age 70. I have friends and relatives who have not done as well, partly because of life choices and partly because of misfortune beyond their control. Should that cause me guilt? This wealth accumulation thing meant tradeoffsâ\u0080\u0094in how I spent my time, and how my wife and I spent our money: working 12 or more hours a day, many times on weekends, and avoiding excess spending, because saving money always came first. In the 55-plus condo community where we now live, many of the residents retired after selling businesses that they owned for many yearsâ\u0080\u0094another road to wealthâ\u0080\u0094but where the decades of effort is often overlooked by those who envy the end result. I have two financial goals left: to be sure my wife can maintain her lifestyle should she be on her own and to leave as much money as possible to my four children. Some people will disagree with that second goal. But I view it as an obligation. Indeed, the accumulation of even modest wealth comes with obligations. As I see it, if you can, you should help with the grandchildrenâ\u0080\u0099s college, support your children if they run into temporary financial difficulties, and donate to charities and local volunteer organizations. If you can, you should also be generous in mundane ways, such as leaving large tips. Back to the original question: Should those of us with accumulated wealth feel guilty for a lifetime of saving and investing? I still struggle with the question. But I know one thing for sure: Those of us with wealth (thereâ\u0080\u0099s that word again) should be grateful for our good fortuneâ\u0080\u0094financially and otherwiseâ\u0080\u0094even if we worked for what we have. This column firstÂ appeared on Humble Dollar. It was republished with permission. Richard Quinn blogs atÂ QuinnsCommentary.com. Before retiring in 2010, Dick was a compensation and benefits executive. His previous articles includeÂ Making Cents,Â Scared DebtlessÂ andÂ What If.Â Follow Dick on TwitterÂ @QuinnsComments."}]}