{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-tops-5-million-and-is-more-than-one-quarter-of-global-cases-of-near-20-million-2020-08-10", "published": 1597091480.0, "headline": "Coronavirus update: U.S. case tally tops 5 million, more than one-quarter of the 20 million global cases", "body": "The U.S. reached another dire milestone on Monday in confirmed cases of the coronavirus that causes COVID-19, as the new case tally topped 5 million, which is more than one-quarter of the global total of more than 20 million cases, as uncertainties over the U.S. response continue to grow. The continued climb in cases comes amid increasing concerns over the start of the school year, after a Georgia high school was forced to re-close, and after the top infectious disease expert, Dr. Anthony Fauci, tempered enthusiasm over a potential vaccine. There was also uncertainty over the legality of executive orders signed by President Donald Trump over the weekend that extended some elements of the coronavirus relief package. Dr. Fauci, head of the National Institute for Allergies and Infectious Diseases, said the chances of any vaccine being 98% effective “are not great,” meaning the public-health approach must not be abandoned. He said a more realistic outcome for a vaccine would be 70% to 75% effective, while the flu vaccine is just 50% to 60% effective for healthy adults between 18 and 64 years old. Don’t miss: Fauci tells Americans to be mindful of these important limitations about any future coronavirus vaccine. Just as New York Gov. Andrew Cuomo gave people a glimmer of hope for a return to normalcy late Friday, by saying schools in his state can reopen for in-person learning in September as long as certain guidelines were maintained, Georgia’s North Paulding High School may have crushed the hopes of some for a return to normal school habits. After the Georgia school district said mask-wearing was a “personal choice,” students at the high school posted pictures of a crowded hallway, with very few people wearing face masks. The school’s principal sent a letter to parents over the weekend, which was cited by ABC News, saying nine people at the school tested positive for the virus, including six students and three staff members. On Sunday, the school said it would close for in-person classes on Monday and Tuesday. Also read: ‘It was chaos!’ Students get suspended for posting pictures of packed halls -- now the high school is closing after 9 people were infected. Georgia saw 3,169 new cases in a day, the fourth-highest daily total among U.S. states, behind Florida’s 6,229, Texas’s 5,696 and California’s 5,358, according to data aggregated by Johns Hopkins University. Georgia is tied for 10th in the number of people tested per 1,000, at 2.8. There was also growing concerns over whether college football can be played, with the commissioners of the Power Five conferences meeting to discuss those concerns. The Mid-American Conference had already become the first among the 10 leagues that play at the highest level of Division I college football to cancel falls sports. On Monday, Detroit Free Press reported that the Big Ten conference voted to cancel the 2020 football season. Meanwhile, after the White House and government lawmakers failed to reach an agreement on a new round of stimulus measures, President Trump signed on Saturday, in front of members of his Bedminster, N.J. golf course, orders to pause the collection of payroll taxes, provide rent relief, help with student-loan payments and extend a part of additional unemployment benefits that had lapsed at the end of July. Many in Washington, including Republicans, criticized Trump’s orders, saying they were unconstitutional. There was also a scathing op-ed, co-wrote by Neel Kashkari, president of the Federal Reserve Bank of Minneapolis, and Michael Osterholm, director of the Center of Infection Disease Research and Policy at the University of Minnesota, that criticizes the U.S. response to the COVID-19 pandemic. “Simply, we gave up on our lockdown efforts to control virus transmission well before the virus was under control,” they wrote, saying that a strict nationwide lockdown of for a month or six weeks could have been enough to control the outbreak. Read more: Dr. Osterholm: Americans will be living with the coronavirus for decades. With all the uncertainties, there was a mixed reaction on Wall Street Monday, as the Nasdaq Composite Index COMP, +1.39% 0.4% to extend its pullback from Thursday’s record close, while the Dow Jones Industrial Average DJIA, +0.56% rallied 358 points, or 1.3%, to a seventh-straight gain. That’s the longest win streak since the 8-day stretch of gains ending Sept. 13, 2019. See Market Snapshot.Latest tallies There are now 20 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data shows, and 733,897 people have died. At least 12.15 million people are confirmed to have recovered from the illness. The U.S. has by far the highest case tally and death toll, with 5,085,821 new cases and 163,370 deaths. Cases have trended higher in 11 states over the past week, while 28 states have seen declines and 11 states have been steady. Although Florida and California have the highest daily totals of new cases, they have seen cases trend lower over the past week, while Texas and Georgia have been steady. Brazil is second in the world with 3.0 million cases and 101,049 deaths. India is third measured by cases at 2.2 million, followed by Russia with 890,799 and South Africa with 559,859. Mexico has 480,278 cases and 52,298 deaths, the third highest in the world. The U.K. is 12th worldwide with 313,390 cases, but has the most fatalities in Europe, and is fourth in the world, with 46,659. China, where the illness was first reported late last year, has 88,862 cases, and 4,689 fatalities.What is the economy saying? U.S. job openings jumped by 518,000 to 5.9 million in June, the Labor Department reported on Monday, which was above the median forecast of 5.3 million jobs. At the same time, the number of layoffs and firings rose by 522,000 to 4.8 million in the month. The data comes after data out Friday showing that the economy regained 1.76 million jobs in July, while the unemployment rate fell to 10.2%.What are companies saying? • Royal Caribbean Cruises Ltd. RCL, +2.59% reported a wider-than-expected second-quarter loss, although revenue fell less than forecast as cruises remain suspended as a result of the COVID-19 pandemic. The cruise operator said the net loss was $1.64 billion, or $7.83 a share, after net income of $472.8 million, or $2.25 a share, in the year-ago period. Excluding nonrecurring items, such as an asset impairment loss of $156.5 million, the adjusted per-share loss was $6.13, compared with the FactSet loss consensus of $4.82. Revenue tumbled 93.7% to $175.6 million, but that beat the FactSet consensus of $47.4 million. The company said it expects cash burn, on average, of about $250 million to $290 million per month during a prolonged suspension of operations, compared with guidance provided in the first-quarter report of about $250 million to $275 million. The company said it had liquidity of $4.1 billion as of June 30. •Canada-based cannabis company Canopy Growth Corp. CGC, +2.49% WEED, +1.80% reported a narrower-than-expected fiscal first-quarter loss, although revenue rose less than forecast. The net loss for the quarter to June 30 narrowed to C$108.5 million ($81.05 million), or 30 cents a share, from C$185.9 million, or 54 cents a share, in the year-ago period. The FactSet consensus was for a loss of 35 cents a share. Revenue grew 22% to C$110.5 million ($82.47 million), below the FactSet consensus of C$112.3 million, as Canadian recreational net revenue fell 11% while Canadian medical revenue increased 19%. • Marriott International Inc. MAR, -0.96% reported a wider-than-expected loss and revenue that fell more than forecast, although trends improved during the quarter as the economy recovers amid reopenings following closures resulting from the COVID-19 pandemic. The hotel operator swung to a net loss of $234 million, or 72 cents a share, from net income of $232 million, or 69 cents a share, in the year-ago period. Excluding non-recurring items, the adjusted loss per share was 64 cents, compared with the FactSet consensus for a loss of 41 cents. Total revenue dropped 72% to $1.46 billion, below the FactSet consensus of $1.68 billion, as revenue per available room (RevPAR) fell 84.4% globally and 83.6% in North America. RevPAR improved to a decline of 70% for the month of July after hitting a low point of down 90% in April. As of early May, all hotels were open, with occupancy levels reaching 60%, compared with 70% a year ago. “Following our previously announced restructuring actions, we have substantially reduced our expense and cash burn in this quarter in addition to reducing head count by over 18% since the beginning of this calendar year,” said Chief Financial Officer Mike Lee. • Foot Locker Inc. FL, -0.80% said it expects to report a surprise fiscal second-quarter profit, as the reopening of stores helped drive a surprise jump in sales. The athletic shoe and gear retailer said it expects net earnings per share of 38 cents to 42 cents, down from 55 cents a year ago. Excluding non-recurring items, the company expects to report adjusted EPS of 66 cents to 70 cents, while the FactSet consensus was for a per-share loss of 60 cents. The company said same-store sales for the quarter rose about 18%, compared with the FactSet consensus for a decline of 23.6%. “As we continued to reopen stores throughout the quarter, we saw a strong customer response to our assortments, which we believe was aided by pent-up demand and the effect of fiscal stimulus,” said Chief Executive Richard Johnson. • SeaWorld Entertainment Inc. SEAS, +3.04% reported that it swung to a wider-than-expected second-quarter loss with revenue tumbling 96%, as the COVID-19 pandemic led to park closures. The theme park operator said the net loss was $131.0 million, or $1.68 a share, after net income of $52.7 million, or 64 cents a share, in the year-ago period, with results including $3.9 million in expenses associated with reopening costs. The FactSet consensus for net loss per share was 96 cents. Revenue fell 95.6% to $18.0 million from $406.0 million, below the FactSet consensus of $26.9 million, as attendance dropped 95% to about 300,000 guests. The company said it had cash and cash equivalents of about $376 million as of June 30, down from $400 million as of April 30, representing an average monthly cash outflow of about $12 million per month."}]}