{"article": [{"url": "https://www.marketwatch.com/story/tenet-earns-202-million-in-us-debut-in-big-test-for-box-office-2020-09-06", "published": 1599412040.0, "headline": "â\u0080\u0098Tenetâ\u0080\u0099 earns $20.2 million in U.S. debut, in big test for box office", "body": "NEW YORK â\u0080\u0094 In a litmus test for American moviegoing in the pandemic, Christopher Nolanâ\u0080\u0099s â\u0080\u009cTenetâ\u0080\u009d brought in an estimated $20.2 million through the holiday weekend in U.S. and Canadian theaters. The result could be greeted as either the rejuvenation of U.S. cinemas â\u0080\u0094 more Americans went to the movies this weekend than they have in nearly six months â\u0080\u0094 or a reflection of drastically lowered standards for Hollywoodâ\u0080\u0099s top blockbusters given the circumstances. About 70% of U.S. movie theaters are currently open; those in the countryâ\u0080\u0099s top markets, Los Angeles and New York, remain closed. Theaters that are operating are limiting audiences to a maximum of 50% capacity to distance moviegoers from one another. â\u0080\u009cTenetâ\u0080\u009d played in 2,810 North American locations, about three-fourths of what most major releases typically launch in. AT&Tâ\u0080\u0099s T, -1.01% Â Warner Bros. declined to split up U.S. and Canadian box office receipts. Theaters in Canada, where COVID-19 cases are much lower than in the U.S., began showing â\u0080\u009cTenetâ\u0080\u009d a week earlier. The film debuted stateside with nightly preview screenings Monday through Wednesday before the official opening on Thursday. Warner Bros. included all of the above in its estimated gross Sunday, along with expected returns for Mondayâ\u0080\u0099s Labor Day. â\u0080\u009cTenetâ\u0080\u009d opened stronger in China. It debuted there with $30 million in ticket sales from Friday to Monday. Internationally, â\u0080\u009cTenetâ\u0080\u009d has exceeded expectations. In two weeks of release, its overseas total is $126 million, with a global tally thus far of $146.2 million. Warner Bros. has emphasized that the usual opening-weekend calculus is out the window. Few onlookers felt it was possible to gauge how â\u0080\u009cTenetâ\u0080\u009d would open. The film, which cost $200 million to make and at least $100 million to market, will need to get close to $500 million to break even. In the filmâ\u0080\u0099s favor: It currently has the big screen almost entirely to itself. Some multiplexes played â\u0080\u009cTenetâ\u0080\u009d as many as 100 times over the weekend. With little else on the horizon, Warner Bros. is counting on a long run for â\u0080\u009cTenet.â\u0080\u009d Not in the filmâ\u0080\u0099s favor: Audiences didnâ\u0080\u0099t love Nolanâ\u0080\u0099s latest time-bender. Moviegoers gave the thriller, starring John David Washington, Robert Pattinson and Elizabeth Debicki, a â\u0080\u009cBâ\u0080\u009d CinemaScore, the lowest grade for a Nolan release since 2006â\u0080\u0099s â\u0080\u009cThe Prestige.â\u0080\u009d Reviews (75% positive on Rotten Tomatoes) have been good but far from overwhelming. Warner Bros. declined to make executives available to discuss the opening but said in a statement that â\u0080\u009cTenetâ\u0080\u009d had to be judged differently. â\u0080\u009cWe are in unprecedented territory, so any comparisons to the pre-COVID world would be inequitable and baseless,â\u0080\u009d said the studio. Analyzing the filmâ\u0080\u0099s performance was virtually impossible, said senior media analyst Paul Dergarabedian for data firm Comscore. He acknowledged North America remains a more challenged marketplace than Europe or Asia, but called it a solid start in what will be lengthy run for â\u0080\u009cTenet.â\u0080\u009d â\u0080\u009cItâ\u0080\u0099s going to take a longer time to assess this,â\u0080\u009d said Dergarabedian. â\u0080\u009cThe win is just to have movies open. To me, that says a lot.â\u0080\u009d Hollywood is watching closely. With the majority of the studiosâ\u0080\u0099 top productions delayed until next year, the industry is experimenting with how to release its most expensive movies in the COVID-era. The Walt Disney Co. DIS, +1.53% Â this weekend also debuted its $200 million live-action â\u0080\u009cMulanâ\u0080\u009d remake, but did so as a $30 purchase for Disney+ subscribers. Disney on Sunday didnâ\u0080\u0099t share digital returns for â\u0080\u009cMulanâ\u0080\u009d â\u0080\u0094 a practice thatâ\u0080\u0099s been common among streaming companies and previous anticipated VOD releases like Comcastâ\u0080\u0099s CMCSA, -0.99% Â Universalâ\u0080\u0099s â\u0080\u009cTrolls World Tourâ\u0080\u009d and Disneyâ\u0080\u0099s own â\u0080\u009cHamilton.â\u0080\u009d But â\u0080\u009cMulanâ\u0080\u009d is also playing in theaters in some overseas territories. It began with $5.9 million in Thailand, Taiwan, the Middle East, Singapore and Malaysia. Next week, it debuts theatrically in its most important market: China. The release of â\u0080\u009cTenetâ\u0080\u009d was also hotly debated, given the health risks associated with indoor gatherings. Several prominent film critics said they wouldnâ\u0080\u0099t review â\u0080\u009cTenetâ\u0080\u009d over ethical concerns. Theater chains, meanwhile, are struggling to remain solvent. Exhibitors have argued that they need new films to survive. Last weekend offered the first significant opportunity for U.S. cinemas to convince moviegoers to come back. Disneyâ\u0080\u0099s â\u0080\u009cThe New Mutants,â\u0080\u009d a long delayed â\u0080\u009cX-Menâ\u0080\u009d spinoff, collected about $7 million in 2,412 locations last weekend. Dipping significantly in its second weekend, its total is now up to $11.6 million. Fittingly in an upside-down year, the palindromic â\u0080\u009cTenetâ\u0080\u009d â\u0080\u0094 a thriller in which time is reversed â\u0080\u0094 essentially began the summer movie season on the weekend it typically ends. Labor Day weekend, this year a historical one at the movies, is usually among the sleepiest weekends of the year at cinemas."}]}