{"article": [{"url": "https://www.marketwatch.com/story/health-care-industry-was-top-recipient-of-ppp-loans-data-show-2020-07-06", "published": 1594048400.0, "headline": "Health-care industry was top recipient of PPP loans, data show", "body": "The health-care industry was the top recipient of loans under the Paycheck Protection Program through the end of June, the Trump administration said Monday, as it released the names of more than 650,000 businesses that got funds under the small-business lending program. Launched as part of the government’s stimulus in response to the coronavirus pandemic, the PPP has so far issued $521 billion in loans. In a report Monday, the Small Business Administration said the program had helped support about 51 million jobs. The health-care and social assistance sector got 12.9% of the money; professional and technical services received 12.7%; and 12.4% went to construction. Slightly more than 10% went to manufacturing and 8% went to hotels and restaurants. Also read:Treasury says Paycheck Protection Program loans below $2 million typically won’t face audits. Health-care companies that received loans include Allegiant Healthcare of Phoenix and Horizon Health and Wellness Inc. Recipients also include the family companies of West Virginia Gov. Jim Justice and a company owned by Ohio Gov. Mike DeWine, according to the Associated Press. The AP also said Muy Brands Inc., a franchisee with more than 750 Wendy’s, Taco Bell and Pizza Hut restaurants, got between $15 million and $30 million through the PPP. CEO James Bodenstedt is a major donor to President Donald Trump. The Trump administration had resisted naming any of the companies that received the loans, but relented to pressure and pledged to provide more details about the borrowers. President Trump over the weekend signed legislation that extends the PPP. The bill passed by Congress extends the deadline for applying for PPP loans to Aug. 8. See:Bill extending Paycheck Protection Program gets Trump’s signature."}]}