{"article": [{"url": "https://www.marketwatch.com/story/my-sister-in-law-moved-in-with-her-mother-changed-her-will-set-up-a-new-trust-and-inherited-everything-is-it-too-late-to-claim-what-rightfully-belongs-to-us-2020-08-25", "published": 1598944580.0, "headline": "My sister-in-law moved in with her mother, changed her will and inherited everything. Is it too late to claim what belongs to us?", "body": "Dear Moneyist, I read your column often, and now I find that I could use your advice. My husband’s aunt passed away earlier this year. His uncle passed many years ago, and had a will set up to be split equally between my husband and his siblings. (His aunt and uncle were well off, and had no kids). After his uncle died, his oldest sister became the care giver, even though their aunt was in good health and had a long-term care policy. Sometime within the past few years, this oldest sister took the aunt to update her will, and changed it to a trust to have her be the only beneficiary and executor. She is a compulsive liar and has not been honest about anything concerning the trust. There is talk about elder abuse, but we cannot prove it. We believe she isolated their aunt. A few years ago, cards and letters we sent her were returned. No one was able to visit her. (This was before COVID-19). My husband and I live in another state and were not able to visit. Do you have any advice? Sad Sister-In-Law Dear Sister-in-Law, Don’t become distracted by your feelings for your husband’s sister. It’s easy to let family resentments fester and luxuriate in them. If you want your husband and his siblings to be made whole, and receive what you believe is rightfully theirs, act now. It is often the case in these kinds of situations that the person named the executor thinks they call all the shots and are free to help themselves, and act as they see fit but, in fact, just the opposite is true. You are at a disadvantage living so far away. You weren’t there to see what actually went on. You will need to hire a lawyer in the state where your sister-in-law lives and mother-in-law resides. She is beholden to the laws of her state where your mother-in-law died, and must act accordingly. An executor must always fulfill his/her “fiduciary duty,” which essentially puts the onus on the fiduciary to place the interests of other interested parties ahead of their own. The Moneyist: I filed a joint tax return with my estranged wife because she is a gambler and her finances are a mess. But I got NO stimulus check — what can I do? Typically, you only have a limited amount of time to contest a will, assuming she made a new one, or trust. This varies from state to state, and it’s often better to act before and/or as soon as possible after the will is filed. This period of time could run from months to several years. In California, for example, you have 120 days to petition the court once probate is opened, although lawyers generally say that it’s better to contest a will before it’s deemed a valid will by the probate court. In Michigan, If the will is admitted by an informal proceeding (by “application”), there is no statute of limitations for contesting the will; however, a challenger may be prevented from contesting the will due to an unreasonable delay in bringing the claim,” according to Clark Hill law firm. “If a will is admitted by formal proceeding (by “petition”), the challenger must raise his or her claims by filing Objections prior to the admission of the will.” The Moneyist: I didn’t get my stimulus check because I owe back child support. It’s not fair. My stepchildren rely on me — what can I do? Undue influence or elder abuse is normally very difficult to prove, but isolation and control is one of the hallmarks. “Isolation is a red flag and many studies of elder abuse say a lack of a good support system and physical and psychological isolation are hallmarks of the problem,” according to the National Adult Protective Services Association. The more people keeping an eye on the elderly the better: Over 90% of reported cases of abuse involve a family member or a trusted care giver. There are 1 million cases of elder abuse reported to National Adult Protective Services Association per year, which is a small fraction of overall cases. U.S. states are currently working on compiling a database of national elder abuse data. The National Center on Elder Abuse, a government agency affiliated with the U.S. Administration on Aging, reports that elder abuse lags by as much as “two decades” behind research into fields of child abuse and domestic violence. I hope you find the resolution you need and, if it’s too late to pursue, the peace you require to move on from this situation and focus on your own lives. I assume that’s what your mother-in-law would want for both you and your husband. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Don’t miss:‘We will not have a vaccine by next winter.’ Like the 1918 Spanish flu, CDC says second wave of coronavirus could be worse. So what happens now? Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% group where we look for answers to life’s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns. Coronavirus update: As of Tuesday, COVID-19 has infected over 25 million people worldwide, which mostly does not account for asymptomatic cases, and killed 850,605. The U.S. still has the world’s highest number of COVID-19 cases (6,031,013), followed by Brazil (3,908,272), India (3,691,166) and Russia (992,402), according to data aggregated by Johns Hopkins University. In the meantime, cases keep rising in the U.S. with California becoming the first state in the country to surpass 700,000 confirmed cases; infections there hit 712,475 as of Tuesday with 13,022 COVID-related deaths. New York has recorded 434,756 infections and the highest number of deaths in the U.S. (32,957). COVID has killed 183,598 people in the U.S. AstraZeneca AZN, +1.16% , in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% ; Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those currently working toward COVID-19 vaccines. The Dow Jones Industrial Index DJIA, +0.56% and the S&P 500 SPX, +0.87% ended lower Monday, while the Nasdaq Composite COMP, +1.39% clinched another record close. Over the past five months, the Dow’s advanced 29.7%, its biggest 5-month percent gain since July 2009, while the S&P 500 added 35.4%, its best 5-month run since October 1938."}]}