{"article": [{"url": "https://www.marketwatch.com/story/why-russia-faces-new-sanctions-if-europe-reacts-to-the-navalny-poisoning-confirmation-2020-09-04", "published": 1599214460.0, "headline": "Europe is mulling new sanctions against Russia after the Navalny poisoning. But will it bite or bark?", "body": "The future of a major Russia-to-Europe gas pipeline was thrown in doubt after German doctors confirmed this week that Russian democracy activist Alexei Navalny had been poisoned by a nerve agent from the Novichok family. And NATO members are meeting on Friday to discuss the consequences of the case and eventual sanctions. - German Chancellor Angela Merkel demanded in a press conference this week that Moscow “explain” how a military-grade nerve agent might have been used against Navalny as he was traveling in Siberia to organize and campaign for the country’s regional elections. - Opposition politicians and leading lawmakers from Merkel’s own party are demanding the government withdraw its support for the Nord Stream 2, an offshore pipeline due to bring Russian gas to Europe. That would likely signal the end of the $11 billion project, after the U.S. slapped sanctions on Western participating companies. - The German government said earlier that tests conducted at the Berlin hospital where Navalny still lies in a coma “have revealed unequivocal proof of the presence of a chemical nerve agent from the Novichok group,” the name of the substance used in the U.K. in March 2018 against former KGB official Sergei Skripal. - The chairman of Nord Stream 2, a project controlled by Russian state-owned gas giant Gazprom, is Merkel’s predecessor, the former social-democrat chancellor Gerhard Schröder. Read:Pentagon leaders say reports of Russian bounties unproven, but would trigger ‘action’ if true The outlook: Merkel wants to “decouple” the geopolitical aspects of the Navalny case and business matters. But political pressure and the general indignation in Europe after the attack against the main figure of Russian President Vladimir Putin’s opposition will make it difficult for her to keep Nord Stream 2 on a business-as-usual path. More generally, the confirmation of Navalny’s poisoning by one of the Kremlin’s weapons of choice will encourage the European advocates of a hard line against Moscow. And it complicates the task of those who, like French President Emmanuel Macron, argue that Europe should re-engage with Russia. Read: France launches €100 billion stimulus plan to avoid ‘economic collapse.’ It could even help Macron get re-elected"}]}