{"article": [{"url": "https://www.marketwatch.com/story/social-security-missteps-could-push-millions-of-elderly-americans-into-poverty-2020-09-22", "published": 1601905340.0, "headline": "Social Security missteps could push millions of elderly Americans into poverty", "body": "Sunday is the day I catch up on my reading that has piled up during the week. Here’s something that caught my eye: Without Social Security, more than 40% of elderly Americans would live in poverty. More than 40%. That’s according to an analysis by the Center for Budget and Policy Priorities (CBPP), which says the data underscores just how important Social Security is, and without it, how millions of Americans would slip into destitution. Kathleen Romig, CBPP senior policy analyst, says the 40% estimate is based on the official federal poverty level of about $12,000 for a single person. But this may be understating the true level of poverty, given that some economists say the $12,000 figure is unrealistically low—and peg the true figure at twice that amount: About $24,000. Meantime, Romig says the poverty figures could be skewed in another way, thanks to the coronavirus pandemic. 80% of older Americans can't afford to retire - COVID-19 isn't helping Why? Because “the SSA (Social Security Administration) shutdown its field offices (roughly 1,200 of them) six months ago and moved online. That makes sense,” she says, “because it’s not safe for SSA employees and its beneficiaries who are disproportionately vulnerable to this virus, since they’re primarily elderly and disabled.” But moving online has likely kept countless citizens who have become eligible for benefits from applying. “A lot of people don’t know they’re eligible, or just can’t handle the application process on their own.” So at the very time when people need help the most, it’s harder to get it. The result? Suffering, and for some, the descent into poverty likely ensues. “It’s awful,” Romig says simply. Some context here: Those 1,200 SSA offices serve some 40 million people a year, and thus have “have enormous reach in normal times,” says Romig. In the past, when one field office closed for whatever reason, “applications went down in that community.” So when all 1,200 close for half-a-year — and counting — the number of people affected is huge. This situation seems destined to continue for at least several more months, given data that shows the pandemic—after taking some 200,000 lives already—now shows possibility of entering a dreaded “second wave”. Cases have risen at least 10% in the past week in 31 states, according to data released over the weekend by Johns Hopkins University. A second wave could inflict further damage on the U.S. economy, which has only partially recovered from an epic second quarter collapse that sent GDP plunging at a 32% pace and throwing tens of millions of Americans out of work. (Second waves often occur during flu season. It’s unclear at this time whether a coronavirus like SARS-CoV-2 will lead to a second wave of infections.) Remember: When people don’t work, neither they nor their employers pay payroll taxes, which is how Social Security is financed. So less money—a lot less—has been coming in. But it’s going out at the same rate. Little wonder then, that the nonpartisan Congressional Budget Office said earlier this month that the $2.9 trillion Social Security surplus—previously forecast to run out in 2035, will now run out in 2031. That’s four years faster than previously estimated. What might happen to this timetable if a second wave of the pandemic took root, forcing companies to engage in a second round of layoffs and furloughs? Social Security’s increasingly precarious position hasn’t exactly escaped voters’ attention. In fact, according to a recent survey by Data for Progress, a progressive think tank, more people listed the prevention of Social Security cuts as a top issue than anything else—anything else. Yet much of the media, with its focus on politics as nothing more than a horse race—who’s ahead, who’s behind?—has barely focused on this. It should. There’s no single federal program that is more essential, and impacts more people, more regularly. And when I say Social Security is “essential,” here’s what I mean. As of June, according to data provided by the Social Security Administration: • Social Security benefits are about 33% of all elderly income. • Among elderly Social Security beneficiaries, 50% of married couples and 70% of unmarried persons receive 50% or more of their income from Social Security. • Among elderly Social Security beneficiaries, 21% of married couples and about 45% of unmarried persons rely on Social Security for 90% or more of their income. Social Security isn’t just essential. It’s utterly essential. Millions of older Americans already live in, or near, poverty. If the politicians—and the people who vote for them—aren’t careful, millions more could join them."}]}