{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-fight-for-direction-before-benchmark-10-year-note-auction-2020-07-08", "published": 1594224740.0, "headline": "Treasury yields hold ground as 10-year note auction fetches lowest rate on record", "body": "U.S. Treasury yields struggled for direction on Wednesday as even an auction for benchmark debt failed to inspire trading during the bond market’s summer doldrums.What are Treasurys doing? The 10-year note yield TMUBMUSD10Y, 0.777% edged 0.4 basis point higher to 0.652%, while the 2-year note rate TMUBMUSD02Y, 0.156% fell 0.8 basis point to 0.155%. The 30-year bond yield TMUBMUSD30Y, 1.576% was virtually unchanged at 1.391%.What’s driving Treasurys? The U.S. Treasury Department auction drew healthy appetite among investors for a record-large sale of $29 billion of 10-year notes, fetching its lowest yield in the auction’s history, but the sale did not spur additional trading in a quiet session. Investors will now turn their attention to a $19 billion auction for 30-year bonds on Thursday. Analysts say volatility in Treasurys has noticeably fallen due to expectations for the Federal Reserve to keep monetary policy on hold over the next few years until economic growth, inflation and employment make a robust recovery. See: Government debt is skyrocketing across the world. Here are their options, according to Barclays The coronavirus pandemic showed no signs of halting its spread. New COVID-19 cases in the U.S. increased by 60,000. Texas reported more than new 10,000 cases on Tuesday. Infections have climbed in 38 states and regions over the past 14 days. As for the Fed, Vice Chairman Richard Clarida said on Tuesday there was no limit to the amount of Treasurys the central bank could buy. And Cleveland Fed President Loretta Mester said a full recovery was still a long way away. Daleep Singh, head of the New York Fed’s markets group, noted the functioning of corporate credit markets had strengthened since the Fed unrolled its emergency lending backstops. He said the U.S. central bank could slow its pace of corporate debt purchases if financial markets continued to improve. Read: Federal Reserve leaders see ‘bumpier’ recovery, slower decline in unemploymentWhat did market participants’ say? “Summer trading conditions are clearly present as evidenced by Wednesday’s price action. A quiet economic calendar left 10-year supply as the major risk event for the day, although the key takeaways were known well before the official auction close. In short, supply is not a primary driver of Treasury yields,” said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets, in a Wednesday note."}]}