{"article": [{"url": "https://www.marketwatch.com/story/gold-surges-toward-all-time-high-silver-continues-rise-as-us-china-tensions-mount-2020-07-22", "published": 1595427140.0, "headline": "Gold surges toward all-time high, silver ends at highest since 2013 as U.S.-China tensions mount", "body": "Gold and silver rose further Wednesday, with silver ending at its highest since 2013, getting a boost after China said the U.S. had ordered it to close its Houston consulate, marking a further climb in tensions between the two countries and sparking demand for haven assets. “Gold attracts flows when real interest rates compress and when political tensions rise, so the current market regime is a perfect recipe for a move higher over the intermediate term horizon,” Boris Schlossberg, managing director of FX Strategy for BK Asset Management, in a Wednesday note. The news on the geopolitical front is sure to weigh on risk flows as concerns will mount that “political jockeying could impair the global recovery from the pandemic, especially if the rhetoric turns more strident as the summer proceeds,” he said. Gold for August delivery GC00, +2.17% on Comex rose $21.20, or nearly 1.2%, to settle at $1,865.10 an ounce. FactSet data based on the most-active contracts show prices settled at their highest since September 2011. The record intraday level for most-active gold futures stands at $1,923.70 an ounce on Sept. 6, 2011, with the settlement record at $1,891.90 from August 22, 2011, according to Dow Jones Market Data. September silver US:SIU20 surged $1.59, or 7.4%, to end at $23.144 an ounce. The most-active contract finished at its highest since September 2013, a day after posting a more than six-year high. Read:Silver logs highest finish since 2014 and is up more than 80% from 2020’s low China’s foreign ministry said it was ordered to shut the consulate, which serves much of the South, in what it called an “unprecedented escalation” by the U.S., threatening retaliation if the decision isn’t reversed. The U.S. State Department said it ordered the closure to protect American intellectual property and private information, according to media reports citing a brief statement. China also said Tuesday it would take unspecified “necessary measures” after the U.S. government imposed trade sanctions on 11 companies it says are implicated in human rights abuses in China’s Muslim northwestern region of Xinjiang. Related:U.S. accuses Chinese hackers of stealing COVID-19 research from companies George Gero, managing director at RBC Wealth Management, said the price of gold offers a “barometer” of our economic and political well being, and the impact of the pandemic, signaling more attention from investors to global worries, including escalating tensions between the U.S. and China. “We are near nine-year highs in gold because everywhere investors look, more stimulus, more debts, more worries abound, translating to gold and silver buyers to act more decisively,” he said in a emailed commentary. Gero warned that the next couple of days “could see more volatility” from jobs numbers and political headlines as elections in the U.S. heat up. That “could bring sudden profit taking,” but “longer-term big buyers on big dips remain.” Gold had found support on expectations for an additional round of U.S. fiscal stimulus, which is seen contributing to the potential for further U.S. dollar weakness. A weaker dollar can be supportive to commodities priced in the unit, making them cheaper to users of other currencies. On Wednesday, the ICE U.S. Dollar Index DXY, -0.58% was down 0.1%. Silver, meanwhile, has surged by around 17% so far this week, with analysts saying the metal was overdue for a catch-up with gold. Need to Know:Here’s what’s behind the ‘perfect storm’ sending silver prices surging Among other Comex Metals, copper was the lone decliner, with the September contract US:HGU20 down 1.1% at $2.9245 a pound. October platinum PLV20, +3.99% tacked on 4.2% to $957.40 an ounce and September palladium US:PAU20 rose 1.9% to $2,229 an ounce."}]}