{"article": [{"url": "https://www.marketwatch.com/story/baseball-is-back-heres-how-mlb-and-other-us-sports-leagues-are-returning-during-the-pandemic-2020-07-22", "published": 1596101420.0, "headline": "NBA games return today - here's what U.S. sports leagues are doing amid the pandemic", "body": "Without any fans in attendance, the National Basketball Association will resume its season on July 30. While many European and Asian countries have found ways to reduce the number of coronavirus cases and deaths, cases in the U.S. continue to soar in many states. Despite the rising case numbers, most major U.S. sports leagues have recently begun playing games. But a lot of top athletes are concerned that the conditions won't be safe enough during the pandemic. Several high profile MLB and NBA players have decided to sit this season out. And recently, many of the NFL's top players took to Twitter TWTR, -0.23%  to ask the NFL to clarify how it will keep players safe. And their concern is understandable. Less than a week into the MLB season, 18 players and coaches on the Miami Marlins tested positive for the coronavirus, and several games were canceled as a result. MLB is not making its teams live in a \"bubble,\" as the NBA is, and the latter has a better chance of finishing this season as a result of that decision. Most leagues have said fans will not be present at upcoming competitions, but some have left the door open for fan attendance. Here's how each league is approaching the resumption of play during the COVID-19 pandemic: NBA Return date: July 30 The NBA is set to resume its season with 22 teams at the Wide World of Sports campus in Disney World. The league has constructed a complex bubble where players, team staff, league personnel, etc, will remain for the duration of the season, which could extend as late as October 13. Players are being tested every other day, according to an NBA's Health and Safety document. Reports from the NBA bubble say the league is able to provide test results in just 12 to 15 hours, a stark contrast to how long others in the U.S. have waited for results. One promising sign: In the latest round of testing, no NBA players tested positive for coronavirus out of 346 tested. iframe.twitter-tweet { width: 100% !important; } The league is scheduled to begin games on July 30, with an eight-game regular season before the postseason begins. Games will be televised as normal, and played in Disney DIS, +1.53%  with no fans in attendance. ESPN has reported that the bubble construction will cost the NBA more than $150 million. iframe.twitter-tweet { width: 100% !important; } The league and the players union have said that there have been zero positive coronavirus test results of the 346 players tested at the league's bubble in Florida, since July 13. The NBA suspended its regular season on March 11 after Jazz center Rudy Gobert tested positive for COVID-19. MLB Return date: July 23 After months of labor disputes between team owners and the players association, Major League Baseball has started its season. It will play a 60-game regular season - rather than its usual 162 game schedule - and then a normal playoffs schedule. Players are tested for the coronavirus every other day. \"The MLB protocol emphasizes contact tracing and rapid testing, two elements of the kind of robust response to the virus that the federal government largely has failed to deliver,\" according to the Los Angeles Times. MLB isn't having teams live in essentially a bubble, as the NBA and other leagues are - see below for more on that. The plan is that teams will not play games against other teams outside their geographical regions. Teams in the eastern time zone will play other teams in the east, for example. And less than a week into the season, there are problems. The Miami Marlins first two games at home have been cancelled after 18 players and coaches test positive for the coronavirus. Two games between the Phillies, the team that recently played against the Marlins, and the New York Yankees have also been cancelled. As of now, Major League Baseball is not considering ending its season. But it has implemented new rules after what happened to the Marlins. According to ESPN, MLB \"is encouraging players not to leave hotels in road cities except for games, mandating the use of surgical masks instead of cloth masks during travel and requiring every team to travel with a compliance officer who ensures players and staff properly follow the league's protocol.\" Fans are not be permitted to attend, at least in the beginning of the regular season. In lieu of this, several teams, including the Giants, Dodgers and Mets, are allowing fans to pay to have a cardboard cutout of themselves in the stands during home games. Rates for the cutouts have reached up to $299 for an undetermined amount of games. Stadiums will also be playing virtual crowd noises during games - the nearly 75 sound effects will be audio taken from the popular \"MLB The Show\" video game. The league has put in place safety guidelines like maintaining social distancing within dugouts, and outlawing spitting of sunflower seeds, gum or peanuts. One of the many wrinkles in the early goings: The Canadian government won't let the Blue Jays play in Toronto because the team might bring COVID-19 back from the U.S. The Associated Press reported on July 24 that the team will play its home games at a minor league park in Buffalo, N.Y. NFL Return date: Sept. 10 The National Football League has benefited from the timing of the coronavirus pandemic, since it started during the league's off-season. As of today, the NFL is planning to play its full 2020-21 season, starting with a game between the Super Bowl champion Kansas City Chiefs and the Houston Texans on Sept. 10. NFL teams will travel to stadiums for their games. Dr. Allen Sills, chief medical officer of the NFL, has stated, \"We do not feel it's practical or appropriate to construct a bubble. Anyone who tests positive will be isolated until medically appropriate to return.\" The NFL and the NFL Players Association are requiring daily COVID-19 testing for the first two weeks of training camp, but may scale down testing thereafter if certain test rate benchmarks are hit, according to ESPN. After two weeks, if the positive test rate is below 5%, the league would scale back to testing every other day. If the positive test rate is not below 5%, they will continue with daily testing until such time as it falls below that number. If the positivity rate hits 5% or higher at any point, they go back to daily testing until it comes down again. NFL training camps open over the next few weeks, depending on the team. See also: Can the federal government stop the NFL from playing this year? Oakley, an NFL sponsor and a unit of the Italian conglomerate Luxottica Group SpA, whose parent is EssilorLuxottica EL, +0.45%  has designed a \"Mouth Shield\" product that can be worn by NFL players to mitigate the spread of the coronavirus on the field of play. The NFL has not given updates on whether there will be full-capacity crowds at stadiums this season. There have been reports that the league will move forward with fans (who may have to sign a liability waiver), but many teams are at the mercy of local government regulations. The league has stated that any fans at NFL games this year would be required to wear face masks. The NFL has offered to cancel the entire preseason as the league and the players union move toward safety guidelines for the 2020 NFL season, according to ESPN's Adam Schefter. In the proposal, the regular season would begin as scheduled, without any exhibition games played first. Multiple NFL players have decided to opt-out of the 2020 NFL season, including Pro Bowler Dont'a Hightower of the New England Patriots iframe.twitter-tweet { width: 100% !important; } NHL Return date: August 1 The National Hockey League is set to begin its season resumption on Saturday August 1 with a modified postseason format. The 24-team format will feature several playoff rounds, capped by the Stanley Cup - no regular season games will be played. Edmonton and Toronto will be the \"hub cities\" where the season restart will take place. Western Conference games will resume at Rogers Place in Edmonton and Eastern Conference games will be played at Scotiabank Place in Toronto. See also: Two ways Washington dropping the 'Redskins' nickname could make the team money Similar to the NBA, the NHL is calling both locations \"bubbles\" and has many similar rules like daily testing and mask wearing at all times (excluding exercise). The NHL says they administered 4,256 COVID tests from July 18th-25th and there were zero positive tests. Return timelines for those who are tested positive tests will be evaluated on a case by case basis. The NHL suspended its season on March 12, a day after the NBA suspended its season. National Women's Soccer League (NWSL) Return date: June 27 The NWSL was the first American sports league to return during the pandemic. Several top players, including Megan Rapinoe and Tobin Heath, decided not to play this season. The league's coronavirus plan was created by more than a dozen doctors and included sequestering players from all nine teams at a training facility in Utah The season lasted a month and ended by crowning the Houston Dash as champion on July 26. MLS Return date: July 8, with setbacks Major League Soccer suspended its season March 12 due to the coronavirus pandemic. The League has resumed with a postseason-only \"MLS is Back\" tournament at the ESPN Wide World of Sports Complex at the Walt Disney World Resort. All 26 teams are participating, and players are being tested every other day for the first two weeks, then less frequently after that, according to ESPN. Games have been going on since July 8, but there have been many setbacks. FC Dallas has been forced to leave the MLS bubble due to a high volume of positive coronavirus tests. Tennis' ATP and WTA Tours Return date: The Palermo Open, a women's-only event to be held Aug. 3-9, is scheduled to be the first tour-level event following a five-month break for the coronavirus pandemic. Some exhibition tournaments were played in June, and the first Grand Slam scheduled to be played during the pandemic is the US Open on Aug. 31. Since the pandemic began, Wimbledon has been canceled and the French Open has been rescheduled, to now begin on Sept. 27 instead of its usual late May start. The US Open still plans to start at its planned date, Aug. 31 - with no fans in attendance. In the absence of professional tournaments, some pros put together exhibition matches in June. The No. 1 player in the world, Novak Djokovic, put a tournament of exhibition matches on in Serbia and Croatia and it did not go well. Djokovic, his wife, and multiple other players in the tournament all tested positive for the coronavirus before the matches were completed. Some of the top women played an exhibition match in Charleston, S.C., and it went better: none of the players got the coronavirus. Showing how ever-changing the pro tennis schedule is at the moment, on July 17 it was announced that an annual professional tournament in Washington, D.C. - the Citi Open - had been canceled and on July 21 it was announced that a new WTA tournament would start on Aug. 10. Serena Williams, as well as several other high profile players, have so far agreed to participate. Some changes that tournaments are employing to help minimize the transmission of the coronavirus: fewer ball people and more electronic line-calling. World TeamTennis is currently playing matches, and on July 21, the American player Danielle Collins was dismissed from the league for breaking its rules: She left West Virginia's Greenbrier Resort during a three-week period when no players were allowed to leave the premises."}]}