{"article": [{"url": "https://www.marketwatch.com/story/us-likely-added-12-million-job-in-august-economists-say-but-hiring-has-slowed-2020-09-03", "published": 1599153260.0, "headline": "U.S. likely added 1.2 million jobs in August, economists say, but hiring has slowed", "body": "The U.S. economy’s long journey back to recovery appears to have taken another step forward in August as more people returned to work, but growing evidence suggests companies are rehiring workers at a slower pace compared to earlier in the summer. Here’s what to watch when the government issues the U.S. jobs report for August on Friday morning See: MarketWatch Economic CalendarNew hiring The U.S. may have added about 1.2 million new jobs last month, based on the estimate of economists surveyed by MarketWatch. That would mark a sizable drop from 1.76 million in July and 4.8 million in June. Yet Wall Street scuttlebutt suggests hiring could end up being significantly weaker. How come? Large payroll processor ADP said less than a half-million private-sector jobs were created last month, for one thing. And several surveys of large and small businesses by the Institute for Supply Management and Homebase have pointed to just a small improvement in hiring in August. Read: ADP says private sector added a less-than-expected 428,000 new jobs in August On the flip side, the ADP report has not proven to be an especially good bellwether lately for the official U.S. employment report. Ditto for the ISM surveys. Even if job gains top 1 million, the number could be inflated by a large number of temporary Census workers. The government hired almost 250,000 Census takers last month. Read:Initial jobless claims fall to new pandemic low of 881,000, but there’s a catchUnemployment The official jobless rate is seen ticking down to 9.8% from 10.2%, but it’s probably not that low. Several million Americans dropped out of the labor force and stopped looking for work after the pandemic struck. They aren’t counted as unemployed. A broader measure of unemployment that includes discouraged jobseekers or those who can only find part-time work stood at 16.5% in July and probably gives a more realistic picture of the damage done to the labor market by the coronavirus. It’s also expected to fall slightly in August. Before the pandemic, the official jobless rate had fallen to a half-century low of 3.5%. Read:Economy softened in August as some temporary layoffs turn permanentLabor force A record 164.6 million people were part of the labor force shortly before the viral outbreak, but more than 8 million Americans dropped out in the first two months of the pandemic. Although more people are looking for jobs again, there were still 4.7 million “missing” from the labor market at the end of July. Another increase in August would be a sign of progress. Read: Fed’s Clarida says new inflation strategy has roots in failure of old approachWorker pay The rate at which wages increase is typically a good barometer of whether the labor market is strong and how much workers are benefiting. Not so much during the pandemic. Average hourly pay actually soared early on because more low-wage workers lost their jobs. Higher-income earners were more likely to be able to work from home and so dragged the average up. Economists say wage figures won’t be all that useful until the threat from the coronavirus pandemic fades. Yet falling wage growth in the next few months would actually be a good thing. It would signal that more working-class Americans or those in lower-paying fields are returning to their jobs, pushing the averages down again. Wild cards The Labor Department’s process of seasonal adjustments normally smooths out a big increase in government jobs in August as schools and public colleges reopen. The virus epidemic might throw a kink in those adjustments. With many schools opting for later openings or virtual learning, the seasonally adjusted number of people working in state and local education could give a distorted view of overall employment growth in August. That’s what happened in July A better way to gauge underlying job creation is to strip out government hiring and focus on employment growth in the private sector. Privately run businesses added 1.46 million jobs in July, but that number could dip below 1 million in August."}]}