{"article": [{"url": "https://www.marketwatch.com/story/2020-is-the-year-of-the-spac-yet-traditional-ipos-offer-better-returns-report-finds-2020-09-04", "published": 1600243340.0, "headline": "2020 is the year of the SPAC - yet traditional IPOs offer better returns, report finds", "body": "After a record 82 initial public offerings of special purpose acquisition corporations - known by the acronym SPAC - 2020 seems to have upended the traditional IPO market, yet most offer lower returns on average than conventional deals, according to a report. Of 223 SPAC IPOs conducted from the start of 2015 through July, 89 have completed mergers and taken a company public, offering the chance to examine their performance, according to the report from Renaissance Capital, a provider of IPO ETFs and institutional research. Of those 89, the common shares have delivered an average loss of 18.8% and a median return of minus 36.1%. That compares with the average after-market return from traditional IPOs of 37.2% since 2015. As of July 24, only 26 of the SPACs in that group had positive returns, the study found. SPACs, also known as blank-check companies, have been around since the 1980s, but have become a juggernaut this year amid high levels of liquidity and a strong appetite for new growth companies. Don't miss: The CEO who made one of Silicon Valley's worst acquisitions wants a $400 million blank check SPACs raise money in an IPO, and then place it in a trust while the sponsor searches for a business or businesses to acquire, usually within a two-year period. The companies then complete a merger and the target becomes a listed stock. Recent examples include sports-betting operator DraftKings Inc. DKNG, -4.51%, electric truck maker Nikola Corp. NKLA, -1.36%  and space travel company Virgin Galactic Holdings Inc. SPCE, -3.12%. \"It's a back door to going public and avoiding scrutiny,\" said Kathleen Smith, Principal at Renaissance. \"You hear about the moonshots, like DraftKings and Virgin Galactica, which have done well, but the average return is negative. You can't just blindly go in and make money.\" See also: A new breed of tech IPOs may give the stock market reason to party like it's 1999 DraftKings went public via a merger with SPAC Diamond Eagle Acquisition Corp. and a gambling tech business, SBTech Global Ltd., earlier this year. The renamed DraftKings has been on a tear, gaining 258% in the year to date, even as major sports events were canceled during the pandemic. Nikola merged with VectolQ Acquisition in June and immediately benefited from the cult status enjoyed by fellow electric vehicle maker Tesla Inc. TSLA, +1.89%  , which has propelled that stock to record levels this year. Nikola has gained 232% in the year to date. See:Former House Speaker Paul Ryan to chair $300 million blank-check company: report Virgin Galactic's route to public markets came through a merger with Social Capital Hedosophia last October. The stock is up 35% in 2020, outperforming the S&P 500 's SPX, +0.87%  5% gain and the Dow Jones Industrial Average's DJIA, +0.56%  2% loss. The recent crop of SPAC mergers have performed better than the broader group, the report found. The common shares of the 21 SPAC mergers completed in the period from Jan. 1 to July are averaging a return of 13.1% from their offer price, but that's mostly due to the two highest performers - DraftKings and Nikola. Without those two, the SPACs produced better returns than in the period going back to 2015, but are still a negative 10.5%. That compares with the 2020 IPO market's average aftermarket positive return of 6.5%. The trend isn't expected to end anytime soon. SPACs have raised a record $31 billion in 2020 to date, and new announcements are coming every day as investors seem to be racing to join the club. The year also brought the biggest-ever SPAC, when billionaire hedge-fund manager Bill Ackman took one public in July with more than $4 billion in its kitty to spend. At the time, Ackman said he was \"long-term bullish\" on America and the stock market, although he was bearish on highly indebted companies. James Gellert, chief executive of Rapid Ratings, a data and analytics company that assesses the financial health of private and public companies, said SPACs are a bull market phenomenon that gain in popularity when markets are doing well, as the stock market was until the recent selloff. See: The 'death of valuation' and what it could mean for investors going forward \"There's a lot of liquidity looking for nuanced asset classes and SPACs as a sub-category of equity is an interesting one to take a flier on,\" he said. \"If you have a diverse portfolio, a SPAC that is executed well is like a liquid private-equity investment.\" Many of the companies that are merged into SPACs come from private-equity portfolios, which usually means they are more mature businesses and in better financial health. For investors, they are really betting on the management team of the SPAC finding a good target business. The broader initial public offering market is expected to be busy through the end of the year, with 45 companies in the current pipeline aiming to raise about $8 billion, according to Smith from Renaissance Capital. See:Fisker is going public: Five things to know about the electric-car maker ahead of its IPO Another 65 companies have filed confidentially with the aim of raising $28 billion, boosting the total to a potential 110 deals raising $36 billion. So far this year, there have been 111 U.S. IPOs, raising $37 billion. The last year to see proceeds of more than that was 2014, when there were 275 deals that raised $85 billion. \"Even if we don't get to that backlog of confidential filers, we'll still probably exceed any year going back to 2014,\" she said. That was the year Alibaba Group Holding Ltd. BABA, -0.26%  went public, raising $25 billion in the biggest deal ever. That deal is expected to be eclipsed by the flotation of Ant Group, the payments company that was set up to serve Alibaba in 2004 and was spun off in 2011. Ant is expected to list on the Hong Kong and Shanghai exchanges later this year in a deal expected to raise up to $30 billion. Smith said the pullback in stocks at the end of this week was a positive for the IPO market, \"as it puts a bit more fear in the market. Fear gets better pricing, because multiples drop as peers drop and pricing falls,\" she said. Among the deals on tap are Palantir Technologies, the data-mining company backed by tech billionaire Peter Thiel; cloud data-warehouse company Snowflake Computing; videogame technology company Unity Software; Asana, a software provider started by Facebook; construction software company Bentley Systems; telehealth companies Amwell and GoodRx; packaging company Pactiv Evergreen Inc.; and Chinese online internet finance marketplace Lufax, among others. The Renaissance IPO ETF IPO, +1.98%  has gained 49% in 2020 to date."}]}