{"article": [{"url": "https://www.marketwatch.com/story/young-people-could-be-driving-a-surge-in-coronavirus-cases-in-europe-warns-the-who-11596042096", "published": 1596102380.0, "headline": "Young people could be driving a surge in coronavirus cases in Europe, warns the WHO", "body": "The World Health Organisation (WHO) has warned that young people could be behind an increase in coronavirus cases across Europe. The European regional director for the WHO said in a radio interview that increasing infections among young people could be responsible for rising case numbers. “We’re receiving reports from several health authorities of a higher proportion of new infections among young people,” Dr Hans Kluge told BBC radio. Read: Fauci takes aim at Trump administration, lawmakers and young Americans: ‘You’re propagating the pandemic’ Meanwhile in the U.S., media reports suggest young people travelling to and from work or enjoying the reopening of bars and restaurants are fuelling a rise in coronavirus cases, including risking spreading coronavirus to older people and family members. Kluge said he understood that young people did not want to miss out on summer, but said: “They have a responsibility towards themselves, their parents, grandparents and their communities and we do know, how now to adopt good healthy behaviours so let’s take advantage of the knowledge.” “An increasing number of countries experienced localised outbreaks and a resurgence in cases. Whether this is a first wave or a second wave, what we do know is it’s a consequence of a change in human behaviour,” he said. He said the evidence of the surge in cases among young people was anecdotal, but that health authorities and governments should find ways to better engage with young people. Read: New York sees increase in virus infections among 20-somethings “For me, the call is loud enough to rethink how to better involve the young people in the response and how to better involve the young people in the response and engage next to them,” Kluge said. An increase in daily recorded cases in Spain caused the U.K. to put the country back on its unsafe list from Sunday, meaning that travellers arriving in the U.K. from Spain must quarantine for 14 days."}]}