{"article": [{"url": "https://www.marketwatch.com/story/gold-silver-prices-rise-as-investors-parse-feds-historic-policy-shift-2020-08-28", "published": 1598625200.0, "headline": "Gold turns higher for the week as investors parse Fedâ\u0080\u0099s historic policy shift", "body": "Gold futures rose Friday, leaving prices higher to end the week, after the Federal Reserve announced a policy shift Thursday that would allow employment and inflation to run hotter than in the past, implying that the central bank may keep benchmark interest rates lower for longer. The Fed is shifting to a policy of average inflation targeting which would effectively see policy makers end the practice of preemptively hiking interest rates to stave off inflation. Instead, the Fed would allow inflation to run above its 2% target to make up for periods when inflation runs below it â\u0080\u0094 signaling that a long period of ultralow interest rates lies ahead. After volatile trading on Thursday, which briefly sent bullion surging higher immediately after the announcement by the Fed, gold ended sharply lower, with investors attributing that decline to investors profit-taking and attempting to interpret the implications of the historic move by the Fed, according to some metals enthusiasts. â\u0080\u009cGold prices were sent on a roller-coaster ride last night as investors tried to decipher what the Fedâ\u0080\u0099s shifting stance on inflation could mean for the yellow metal, with prices soaring above $1,970 before careening below $1,910 in the immediate aftermath,â\u0080\u009d wrote Han Tan, market analyst at FXTM, in a research note. Need to Know:The Fed might never hike rates again. Here are growth stocks for the long run, according to one strategist Against that backdrop, December gold GCZ20, +2.17% GC00, +2.17% rose $42.30, or 2.2%, to settle at $1,974.90 an ounce. The most-active December silver contract SIZ20, +5.96% SI00, +5.96%, meanwhile, added 59 cents, or 2.2%, to reach $27.79 an ounce. For the week, gold saw a weekly rise of 1.4%, while silver tallied a weekly advance of nearly 4%, based on last Fridayâ\u0080\u0099s most-active contract settlements, according to Dow Jones Market Data. Gold continues to be viewed as the â\u0080\u009chaven of choice, with silver closely followingâ\u0080\u009d as everywhere investors look, there are old worries, such as those tied to the global economy and pandemic, combining with new ones, such as the resignation of Japanese Prime Minister Shinzo Abe and the upcoming elections, said George Gero, managing director at RBC Wealth Management, in a daily note. This leads to the need for more asset allocations, â\u0080\u009cso $2,000 gold and $30 silver [are] coming soon.â\u0080\u009d Precious metals also drew some support Friday from a weakening U.S. dollar that fell on the back of strength in the Japanese yen on the back of news that Prime Minister Shinzo Abe resigned due to his worsening health. The benchmark Nikkei 225 NIK, -0.11% closed down 1.4% and the yen USDJPY, -0.38% strengthened to change hands at 105.45, surging 1.1%. A broader measure of the dollar against a half-dozen currencies, including the yen, was down 0.6%, as gauged by the ICE Dollar Index DXY, -0.58%. A weaker dollar can make precious metals that are priced in the currency more appealing on a relative basis. Overall, gold and silver prices have been mostly marching higher as investors purchase precious metals as a perceived safe play against the uncertainty created by the COVID-19 pandemic. Responses to the deadly disease by governments and central banks have also bolstered appetite for gold, which is seen as a hedge against money printing and an asset the propers in a low-rate environment. In U.S. economic reports, data on personal-consumption expenditure rose 0.3% in July, while core inflation for the month rose 0.3%, and a reading of consumer spending rose 1.9% last month, while personal incomes climbed 0.4% in July. The final consumer sentiment survey in August, meanwhile, rose to 74.1 from a preliminary reading of 72.8, according to the University of Michigan. Back on Comex, December copper HGZ20, +1.38% Â added 1% to $3.0195 a pound, with prices based on the most-active contract prices settling above $3 for the first time since Aug. 19 and tacking on 3.5% for the week. October platinum PLV20, +3.99% Â rose 1.3% to $940 an ounce, with most-active contract prices up 1.5% for the week, while December palladium PAZ20, +2.31% Â climbed 1.9% to $2,231.50 an ounce, for a weekly most-active contract advance of nearly 2.4%."}]}