{"article": [{"url": "https://www.marketwatch.com/story/the-stakes-are-really-high-for-pence-in-vp-debate-as-trump-campaign-seeks-to-narrow-biden-lead-in-polls-experts-say-2020-10-06", "published": 1602058220.0, "headline": "â\u0080\u0098The stakes are really highâ\u0080\u0099 for Pence in VP debate as Trump campaign seeks to narrow Biden lead in polls, experts say", "body": "Wednesday nightâ\u0080\u0099s vice presidential debate could be a turning point in President Donald Trumpâ\u0080\u0099s quest for reelection, with less than a month remaining in the campaign and polls showing him trailing former Vice President Joe Biden by a significant margin, experts say. Bidenâ\u0080\u0099s average lead in national polls increased from 7.1% to 8.1% after some viewers were turned off by the presidentâ\u0080\u0099s combative style during last weekâ\u0080\u0099s debate, according to Five Thirty Eight, and experts say that Vice President Mike Pence must put in a strong performance against the Democratic nominee, Sen. Kamala Harris of California, to turn the electorateâ\u0080\u0099s attention away from the first presidential debate and a barrage of negative news coverage related to Trumpâ\u0080\u0099s recent COVID-19 diagnosis and subsequent hospitalization. The vice-presidential debate will take place in Salt Lake City on Wednesday at 9 p.m. Eastern Time, and will run until 10:30 p.m., without commercial breaks. â\u0080\u009cTrump didnâ\u0080\u0099t have a great first debate in 2016, and Pence was able to follow that up with a strong debate performance,â\u0080\u009d said Steve Pavlick, head of policy at Renaissance Macro Research and former deputy assistant secretary for legislative affairs at the Treasury Department under Trump, pointing to a CNN poll that showed viewers believed Pence won the debate. â\u0080\u009cIf Trump is going to make a comeback, Pence has to have a really good debate to get some momentum going,â\u0080\u009d he added. â\u0080\u009cThat happened in 2016, so itâ\u0080\u0099s not unprecedented, but the stakes are really high.â\u0080\u009d While the presidentâ\u0080\u0099s supporters are eager to point out that polls four years ago predicted that it was unlikely that Trump would win the 2016 election, the data shows the president in an even weaker position this time around. RealClearPoliticsâ\u0080\u0099 polling average projects Biden will garner 51.3% of the national popular vote, compared to Trumpâ\u0080\u0099s 42.1%, a 9.3% gap, versus a 46.8% to 43.6% lead, or 3.2% on Oct. 6, 2016. Polls at that time showed Trump projected to win the battleground states of Florida, Ohio, North Carolina and Nevada, whereas, on average, polls today show Biden ahead in all four. Joel Goldstein, professor emeritus at Saint Louis University School of Law and scholar of the vice presidency, told MarketWatch that one factor that may blunt the impact of Wednesdayâ\u0080\u0099s event is that vice presidential debates tend to garner less attention than presidential ones. At the same time, there are factors that could draw the publicâ\u0080\u0099s attention and provide the trailing Trump campaign with the opportunity to burnish its reputation with voters. â\u0080\u009cBecause of Trumpâ\u0080\u0099s recent COVID diagnosis and because of the advanced ages of the candidates, itâ\u0080\u0099s possible that the vice presidential debate could take on a larger importance in terms of peopleâ\u0080\u0099s attention,â\u0080\u009d due to the increased chance that age and illness could lead to either candidateâ\u0080\u0099s incapacitation and their respective vice presidents assuming the powers of the presidency, Goldstein said. Meanwhile, the historic nature of Harrisâ\u0080\u0099s vice presidential candidacy could be another factor garnering increased attention. According to Nielsen Media Research data cited by the Commission on Presidential Debates, the two highest-rated vice presidential debates in history were in 1984 and 2008, when Geraldine Ferraro and Sarah Palin were the first and second female major-party vice presidential candidates in history. This year, â\u0080\u009cItâ\u0080\u0099s the first time that a woman is running on a ticket that had a good chance of winning,â\u0080\u009d Goldstein said, pointing out that Walter Mondale and John McCain were significant underdogs at the time they chose a female running mate. â\u0080\u009cThe selection in each case was a hail mary, and this time, Biden is favored.â\u0080\u009d Trumpâ\u0080\u0099s recent COVID-19 diagnosis will alter the nature of the debate, as the candidates will now sit at least 12 feet apart rather than the originally planned seven feet, according to Politico, while the Washington Post reported late Tuesday that both campaigns had agreed to the erection of plexiglass barriers between the candidates as further protection, after the Trump campaign had earlier resisted the move. While Pence has not tested positive for COVID-19, he was present a Rose Garden ceremony on Sept. 26 that was attended by several top Republicans who have since tested positive, including President Trump, former White House adviser Kellyanne Conway, former New Jersey Gov. Chris Christie, Utah Sen. Mike Lee, North Carolina Sen. Thom Tillis and Wisconsin Sen. Ron Johnson. The Commission on Presidential Debates did not respond to multiple requests for comment on its comprehensive protocol for preventing the spread of the virus at the debate. Recent events will likely place the novel coronavirus front and center as an issue during the debate, according to Renaissance Macroâ\u0080\u0099s Pavlick. He argued that with Trump back in the White House, Pence will look to paint the presidentâ\u0080\u0099s experience as a success, due to rapid testing and recently developed treatments for the disease. â\u0080\u009cHeâ\u0080\u0099ll argue that you shouldnâ\u0080\u0099t be afraid, you shouldnâ\u0080\u0099t have the same level of fear as back in March and that Democrats are fear mongering,â\u0080\u009d he said. â\u0080\u009cThatâ\u0080\u0099s the message they have to paint and do this jujutsu on the coronavirus that turns the issue from a weakness to a strength.â\u0080\u009d The president began pushing such a message in prerecorded videos disseminated on social media, claiming that he had already recovered from the disease and telling Americans, â\u0080\u009cdonâ\u0080\u0099t be afraid of COVID, donâ\u0080\u0099t let it dominate your life,â\u0080\u009d even though his doctor cautioned Monday that â\u0080\u009che may not be out of the woods yet.â\u0080\u009d"}]}