{"article": [{"url": "https://www.marketwatch.com/story/royal-caribbean-trials-cruises-to-nowhere-with-ships-sailing-in-circles-from-singapore-11602159694", "published": 1602145760.0, "headline": "Royal Caribbean trials â\u0080\u0098cruises to nowhereâ\u0080\u0099 with ships sailing in circles from Singapore", "body": "A general view of the Quantum of the Seas cruise ship. patrik stollarz/Agence France-Presse/Getty Images Royal Caribbean International and Genting Cruise Lines, two of the worldâ\u0080\u0099s largest cruise lines, will start sailing again out of Singapore, but instead of whisking passengers to faraway lands, guests will pay thousands of dollars to go around in circles. Ships have now been given the green lights to sail from the city-stateâ\u0080\u0099s port, after permission was granted by authorities in Singapore. Cruise holidays already restarted in some countries from August, but the development in Singapore will be seen as a big boost because its port is a major travel hub in Asia. Read: Check in, but donâ\u0080\u0099t fly? Airlines launch â\u0080\u0098flights to nowhereâ\u0080\u0099 The development will be welcome news for Royal Caribbean RCL, +2.59% and Genting G13, -0.71%, who have been hit hard, along with other holiday operators, by the impact of the coronavirus pandemic on tourism. Cruise ships had been a particular focal point because of the speed in which the virus can spread across its enclosed space, and due to high profile instances when countries have prevented infected ships from docking and letting passengers disembark at their ports. The Diamond Princess was quarantined in the Port of Yokohama in Japan in February. Read: Carnival lays off more than 100 ship officers The Singapore Tourist Board has developed its CruiseSafe program â\u0080\u0094 strict new safety procedures to protect passengers from the SARS-CoV-2 coronavirus, and it is working with cruise lines to test a limited number of trips sailing to â\u0080\u009cnowhere.â\u0080\u009d This prevents passengers from disembarking and catching or spreading the virus in different ports. While passengers wonâ\u0080\u0099t be able to enjoy the sights and experiences of visiting different countries, they will still be able to appreciate the facilities, food and weather onboard. Royal Caribbeanâ\u0080\u0099s Quantum of the Seas will sail for up to four nights in December, leaving and returning to Singapore, aimed at domestic passengers. Read: Cruise Stocks Are Jumping on Barclays Upgrade, and Signs of Pent-Up Demand It said on its Singapore website: â\u0080\u009cA lot has changed, but some things are still the same â\u0080\u0094 when you vacation with Royal Caribbean, your health and safety remains our top priority. Weâ\u0080\u0099ve partnered with top medical minds and the Singapore Government to design our plan.â\u0080\u009d Gentingâ\u0080\u0099s Dream Cruises will set sail next month. Genting said in a statement: â\u0080\u009cWorking very closely with the Singapore government, Dream Cruises was granted approval by the local authorities to start a pilot based on the companyâ\u0080\u0099s stringent and enhanced health and safety protocols, complemented by its exemplary safety track record during its first two months of operations in Taiwan.â\u0080\u009d"}]}