{"article": [{"url": "https://www.marketwatch.com/story/as-trump-says-he-is-positive-for-coronavirus-a-look-back-at-his-shifting-statements-on-face-masks-and-the-severity-of-covid-19-11601634370", "published": 1601749100.0, "headline": "â\u0080\u0098Just stay calm. It will go awayâ\u0080\u0099: A look back at Trumpâ\u0080\u0099s shifting stance on face masks and on the threat of COVID-19", "body": "In this photo taken on July 11, 2020, U.S. President Donald Trump wears a mask as he visits Walter Reed National Military Medical Center in Bethesda, Maryland. (Photo: Agence France-Presse/Getty Images.) President Donald Trump was transported on Marine One from the White House to Walter Reed Hospital late Friday, the same day that he and first lady Melania Trump had tested positive for coronavirus. Trump was given a dose of Regeneron Pharmaceuticals Inc.â\u0080\u0099s experimental neutralizing antibody cocktail, in addition to Gilead Sciences Inc.â\u0080\u0099s remdesivir, which highlights a challenge faced by the 7.3 million Americans diagnosed with the disease and many more around the world: Six months into the pandemic, there are still precious few treatment options available for patients with COVID-19, and if a vaccine becomes available, itâ\u0080\u0099s unlikely to be readily available until 2021. His diagnosis came hours after the White House announced that senior aide Hope Hicks tested positive for the virus after traveling with the president several times over the last week. Trump, 74, is at a higher statistical risk of serious complications from the virus that has killed more than 200,000 people in the U.S., analysis of hospitalization data in several countries has shown over the last six months. Being obese is another potential complication for the president. Itâ\u0080\u0099s not yet clear whether the next two presidential debates with the Democratic candidate Joe Biden will go ahead; the president has canceled public engagements and campaign rallies. Trumpâ\u0080\u0099s vitals over the past 24 hours were very concerning and the next 48 hours will be criticalÂ as he fights the coronavirus, The Wall Street JournalÂ reported Saturday, citing a person familiar with the presidentâ\u0080\u0099s health. TheÂ Associated PressÂ attributed these comments, which contradict earlier comments made by the presidentâ\u0080\u0099s physician, to White House Chief of Staff Mark Meadows . Trumpâ\u0080\u0099s physician, Dr. Sean Conley at Walter Reed Medical Center in Bethesda, Md., where the president is staying, painted a more optimistic picture of the presidentâ\u0080\u0099s condition. â\u0080\u009cThe team and I are extremely happy with the progress the president has made,â\u0080\u009d he said. â\u0080\u009cHe had a mild cough and nasal congestion and fatigue, all of which are now resolving and improving.â\u0080\u009d Trump is at a higher statistical risk of serious complications from the virus that has killed more than 200,000 people in the U.S.Â Before testing positive for coronavirus, Trump was planning to hold rallies in Wisconsin this weekend, even as the White House task force said people need to double down on social distancing â\u0080\u009cto the maximal degree possible,â\u0080\u009d the Washington Post reported. Two cities where the rallies were to take place, La Crosse and Green Bay, have been designated COVID-19 â\u0080\u009cred zones,â\u0080\u009d the paper added. Trump has chosen not to wear a mask during most public engagements, and members of his family, including four of his children, were photographed not wearing masks during Tuesday eveningâ\u0080\u0099s presidential debate. Trump has chosen not to wear a mask during most public engagements, and members of his family, including his children Eric, Don Jr., Ivanka and Tiffany were photographed not wearing masks during Tuesday eveningâ\u0080\u0099s presidential debate, in violation of the co-host Cleveland Clinicâ\u0080\u0099s policy for the event. (It was reported by NBC News that a Cleveland Clinic doctor offered the Trump coterie medical-grade masks in hopes of persuading them to comply with the policy but was rebuffed.) While the president had told people the virus would go away earlier in the summer, at one point even positing Easter marking the pandemicâ\u0080\u0099s finish line, his position on COVID-19 and face coverings has shifted in recent months. As of Saturday, COVID-19 has now killed at least 1,030,667 people worldwide, and 208,731 in the U.S., according to Johns Hopkins. The U.S. still has the worldâ\u0080\u0099s highest number of COVID-19 cases (7,373,881), just ahead of India (6,473,544). The virus has infected at least 34,758,446 worldwide. The U.S.â\u0080\u0099s mask policy has evolved in recent months. Last January, the Centers for Disease Control and Prevention said it did not recommend the general public wear masks. â\u0080\u009cThe virus is not spreading in the general community,â\u0080\u009d Dr. Nancy Messonnier, director of the Center for the National Center for Immunization and Respiratory Diseases, said. â\u0080\u009cWe donâ\u0080\u0099t routinely recommend the use of face masks by the public to prevent respiratory illness.â\u0080\u009d The presidentâ\u0080\u0099s stance has shifted along with his administrationâ\u0080\u0099s on both the severity of COVID-19 and mask wearing.Â Eric Trump, Ivanka Trump, U.S. First Lady Melania Trump, Tiffany Trump and Donald Trump Jr., sitting ahead of the first presidential debate at the Case Western Reserve University and Cleveland Clinic in Cleveland, Ohio. (Photo: Jim Watson/Getty Images.) Hereâ\u0080\u0099s a timeline of Trumpâ\u0080\u0099s comments: Jan. 22: Speaking to CNBC, Trump says: â\u0080\u009cWe have it totally under control. Itâ\u0080\u0099s one person coming in from China, and we have it under control. Itâ\u0080\u0099s going to be justÂ fine.â\u0080\u009d February:Â During an interview with journalist Bob Woodward for â\u0080\u009cRage,â\u0080\u009d a biography on the president, Trump told him that the coronavirus was â\u0080\u009cdeadly stuff.â\u0080\u009d Feb. 2: â\u0080\u009cWe pretty much shut it downÂ coming in fromÂ China,â\u0080\u009d the president tells Sean Hannity of Fox News. Feb. 10: Trump tells a campaign rally in New Hampshire: â\u0080\u009cLooks like by April, you know, in theory, when it gets a little warmer, it miraculously goes away. I hope thatâ\u0080\u0099s true. But weâ\u0080\u0099re doing great in our country.â\u0080\u009d Feb. 26:Â Trump is asked what the U.S. is doing to boost production of masks. â\u0080\u009cWell, we can get a lot of it. In fact, weâ\u0080\u0099ve ordered a lot of it just in case we need it. We may not need it; you understand that. But [just] in case â\u0080\u0094 weâ\u0080\u0099re looking at a worst-case scenario. Weâ\u0080\u0099re going to be set very quickly.â\u0080\u009d March 9:Â Trump compares coronavirus to influenza, tweeting: â\u0080\u009cLast year 37,000 Americans diedâ\u0080\u009d from the flu. â\u0080\u009cNothing is shut down, life & the economy go on,â\u0080\u009d he added. One week later, the president said, â\u0080\u009cNothing would be worse than declaring victory before victory is won.â\u0080\u009d March 10: â\u0080\u009cJust stay calm. It will goÂ away,â\u0080\u009d the president tells reporters in Washington, D.C. â\u0080\u0098You donâ\u0080\u0099t have to do it. Iâ\u0080\u0099m choosing not to do it, but some people may want to do it and thatâ\u0080\u0099s OK. It may be good. Probably will.â\u0080\u0099 March 16: The president announces new social-distancing guidelines: â\u0080\u009cMy administrationÂ isÂ recommendingÂ thatÂ all Americans,Â includingÂ theÂ youngÂ andÂ healthy,Â workÂ toÂ engageÂ inÂ schooling fromÂ homeÂ whenÂ possible,Â avoid gatheringÂ inÂ groupsÂ ofÂ more than 10 people,Â avoid discretionary travel, andÂ avoid eatingÂ andÂ drinkingÂ atÂ bars,Â restaurants, andÂ public food courts.â\u0080\u009d April 2: On the shutdown of businesses as the virus reached its peak, Trump says, â\u0080\u009cThe sacrifices we make over the next four weeks will have countless American lives saved.Â Weâ\u0080\u0099re going to save a lot of AmericanÂ lives.â\u0080\u009d April 3:Â Trump says his administration recommends wearing cloth face coverings. However, the president says he wonâ\u0080\u0099t wear a mask himself. â\u0080\u009cFrom recent studies, we know that the transmission from individuals without symptoms is playing a more significant role in the spread of the virus than previously understood,â\u0080\u009d Trump said, adding, â\u0080\u009cYou donâ\u0080\u0099t have to do it. Iâ\u0080\u0099m choosing not to do it, but some people may want to do it and thatâ\u0080\u0099s OK. It may be good. Probably will.â\u0080\u009d April 24: Speaking of potential treatments, Trump tells a press conference: â\u0080\u009cI see the disinfectant which knocks it out in a minute. One minute. And is there a way we can do something like that? By injection inside for almost a cleaning? Because you see it gets in the lungs and it does a tremendous number on the lungs, so itâ\u0080\u0099d be interesting to check that.â\u0080\u009d â\u0080\u009cSupposing we hit the body with a tremendous â\u0080\u0094 whether itâ\u0080\u0099s ultraviolet or just very powerful â\u0080\u0094 light and, I think you said, that hasnâ\u0080\u0099t been checked but youâ\u0080\u0099re gonna test it? And then I said, â\u0080\u0098Supposing it brought the light inside the body, which you can either do either through the skin or some other way?'â\u0080\u009d (Trump later said he was being â\u0080\u009csarcastic.â\u0080\u009d) May 19: â\u0080\u009cWhen we have a lot of cases, I donâ\u0080\u0099t look at that as a bad thing, I look at that as, in a certain respect, as being a good thing,â\u0080\u009d Trump said, on the rise in cases of coronavirus infections. â\u0080\u009cIt means our testing is much better. I view it as a badge of honor.â\u0080\u009d I wore one in the back area. I didnâ\u0080\u0099t want to give the press the pleasure of seeing it.â\u0080\u0099â\u0080\u0094President Trump speaking on May 21 about his decision to not wear a mask while visiting a Ford plant May 21: On whether or not the president wore a mask while visiting a Ford factory, he said, â\u0080\u009cI wore one in the back area. I didnâ\u0080\u0099t want to give the press the pleasure of seeing it.â\u0080\u009d July 4: â\u0080\u009cWe have tested over 40 million people. By so doing, we show cases, 99% of which are totally harmless.â\u0080\u009d July 19:Â â\u0080\u009cIâ\u0080\u0099ll be right eventually,â\u0080\u009d Trump said during an interview with Fox News journalist Chris Wallace. When Wallace laughed, Trump continued: â\u0080\u009cI said itâ\u0080\u0099s going to disappear. Iâ\u0080\u0099ll say it again: Itâ\u0080\u0099s going to disappear â\u0080\u0094 and Iâ\u0080\u0099ll be right.â\u0080\u009d When asked if such statements discredit him, Trump said no, adding, â\u0080\u009cYou know why it doesnâ\u0080\u0099t discredit? Because Iâ\u0080\u0099ve probably been right more than anybody else.â\u0080\u009d On testing lagging behind the rise in cases, Trump adds, â\u0080\u009cMany of those people are young people that would heal in a day. They have the sniffles.â\u0080\u009d Trump will not change his position on masks. â\u0080\u009cNo, I want people to have a certain freedom,â\u0080\u009d he said, adding, â\u0080\u009cI donâ\u0080\u0099t agree with the statement that if everyone wears a mask everything disappears.â\u0080\u009d July 20:Â Trump tweets a photo of himself wearing a mask with a presidential seal. â\u0080\u009cMany people say it is Patriotic to wear a face mask when you canâ\u0080\u0099t socially distance.â\u0080\u009d July 21:Â At the presidentâ\u0080\u0099s daily presser, Trump said, â\u0080\u009cI have no problems with the masks. If youâ\u0080\u0099re close together, I would put on the mask.â\u0080\u009d In response to a question about whether heâ\u0080\u0099d experienced a change of heart on both masks and social distancing. â\u0080\u009cIâ\u0080\u0099m getting used to the mask â\u0080¦ I will wear it where appropriate. Iâ\u0080\u0099ve always agreed with that. Iâ\u0080\u0099ve never fought either one.â\u0080\u009dÂ Aug. 27: â\u0080\u009cThe United States has among the lowest case fatality rates of any major country anywhere in the world.â\u0080\u009d (As of Oct. 3, approximately 100 countries have a lower fatality rate than the 2.8% fatality rate in the U.S.) Sept. 16:Â In an ABC town hall, Trump responded to a question that he had played down the virus, given his comments in Woodwardâ\u0080\u0099s book. â\u0080\u009cYeah, well, I didnâ\u0080\u0099t downplay it. I actually, in many ways, I up-played it, in terms of action,â\u0080\u009d the president said."}]}