{"article": [{"url": "https://www.marketwatch.com/story/republicans-wagering-sudden-supreme-court-vacancy-will-galvanize-their-voters-2020-09-20", "published": 1600640300.0, "headline": "Republicans wagering sudden Supreme Court vacancy will galvanize their voters", "body": "WASHINGTON (AP) — Four years ago, the allure of conservative Supreme Court appointments helped persuade skeptical Republicans to support Donald Trump for president. Two years ago, a contentious clash over Trump’s choice of Brett Kavanaugh for the court was credited with bolstering GOP gains in the Senate in an otherwise disastrous midterm election. And now, just 44 days before Election Day, Republicans are again looking to a Supreme Court nomination fight to unite a deeply fractured party as it faces the very real possibility of losing the White House and control of the Senate this fall. GOP leaders are optimistic they can pull it off. In the turbulent Trump era, nothing has motivated the Republican Party’s disparate factions to come home quite like the prospect of a lifetime appointment to the nation’s highest court. “This can be an important galvanizing force for President Trump,” said Leonard Leo, co-chairman of the conservative Federalist Society who has advised the Trump administration on its first two confirmations, of Neil Gorsuch and Kavanaugh. The emerging nomination debate that follows the death Friday of Justice Ruth Bader Ginsburg threatens to reshuffle voter priorities in the closing weeks of an election that had been squarely focused on another set of generational issues: the pandemic, economic devastation and deep civil unrest. Trump, backed by Senate Majority Leader Mitch McConnell, is pledging to replace the liberal Ginsburg with a conservative jurist, promising on Saturday evening that he will announce his nominee “very soon.” See:Biden to senators: Extinguish the ‘flames’ engulfing U.S. politics by not ‘jamming’ through a Supreme Court justice Plans are in motion for a swift nomination and confirmation. Lest there be any questions about the political implications, Trump is expected to make his choice in a matter of days. Those close to the president are encouraging him to announce his pick before the first presidential debate against Democratic challenger Joe Biden on Sept. 29. Biden said the winner of the Nov. 3 election should choose the next justice. Biden’s team is skeptical that the Supreme Court clash will fundamentally change the contours of a race Trump was trailing so close to Election Day. Indeed, five states are already voting. In fact, Democrats say it could motivate voters to fight harder against Trump and Republicans as the Senate breaks the norms with an unprecedented confirmation at a time when Americans are deciding crucial elections. “Everything Americans value is at stake,” Senate Democratic leader Chuck Schumer told fellow Democratic senators on a conference call Saturday, according to a person who was not authorized to publicly discuss the private call and spoke on condition of anonymity. Biden is not planning to release a full list of potential court nominees, according to a top aide, because it would further politicize the process. The aide was not authorized to publicly discuss private deliberations and spoke on condition of anonymity. Biden’s team suggests that the court fight will heighten the focus on issues that were already at stake in the election: health care, environmental protections, gender equity and abortion. Health care, in particular, has been a top voter concern this pandemic-year election, Democrats say. They will argue that protections for Americans with preexisting conditions are essentially on the ballot as the Supreme Court will hear the administration’s argument to strike down President Barack Obama’s health law shortly after the election. The Affordable Care Act includes such protections and the court is expected to render a verdict next year. “Make it real,” said Hillary Clinton, urging Democrats to take the fight to the polls, in an interview on MSNBC. See:Biden says death of Justice Ginsburg highlights threats to U.S. health care Republicans say voters, particularly those the party needs to win back, are motivated by the chance to name a conservative judge — so much so that it could take some states off the map for Democrats. The focus on the nomination fight could help unify such voters around a common issue in an election season with so many distractions, said Leo of the Federalist Society. “Going as far back as 2000, poll after poll shows that the Supreme Court is an issue that resonates strongly with Republican and conservative voters, and importantly even with low-propensity voters from those groups,” he said. Republicans were especially optimistic that the court battle would boost their chances of holding the Senate, particularly in Republican-leaning states such as Montana, Iowa, Kansas, Georgia and South Carolina where GOP candidates are at risk. Democrats need to pick up three seats to claim the Senate majority if Biden wins and four if he doesn’t. Key GOP senators who face tough reelection contests in such states where Trump is popular quickly linked themselves to his push for a swift vote, embracing the prospect of another conservative on the bench. Among them: Martha McSally in Arizona, Thom Tillis in North Carolina and Lindsey Graham in South Carolina. Yet other Republicans in more contested battleground states, including Sen. Cory Gardner in Colorado, held back, heeding McConnell’s advice to keep their “powder dry.” Two Republicans, Sens. Susan Collins of Maine and Lisa Murkowski of Alaska, spoke out after Ginsburg’s death to object to the speedy pace, saying the Senate should not vote before the election so the candidate elected on Nov. 3 can decide. As he left the White House for Saturday evening’s rally in North Carolina, Trump signaled his displeasure with Collins — and a potential warning to other wayward Republicans: “I totally disagree with her,” he said. Democratic challengers and outside allies seized on what they called “hypocrisy” of Republicans refusing to consider Obama’s nominee before the 2016 election, unearthing past statements from many of the same senators now pushing ahead for Trump. The Democrats raised more than $71 million in the hours after Ginsburg’s death. Many Republicans are hopeful the Supreme Court fight will supersede many conservative voters’ concerns about Trump’s inconsistent leadership and divisive rhetoric. But voters in key states are already dealing with unprecedented hardships that will not simply disappear in the coming weeks. Conservative activist Tim Phillips, president of the group Americans for Prosperity, is doubtful that the court fight will change many votes. He spent much of Saturday canvassing suburban neighborhoods around Kansas City as part of his organization’s massive push to boost down-ballot Republicans in November. When conservative activists gathered in the morning, the Supreme Court was a prime topic of conversation that “strengthened their resolve to get out and work,” Phillips said. But once they started knocking on voters’ doors, “it didn’t even come up.” “I just think given the magnitude of the crises — plural — facing swing voters, this is just not going to be a crucial factor in their final decision,” Phillips said. At the Cambria County Republican Party headquarters in western Pennsylvania, the vacancy wasn’t a major topic of conversation as people swung by on Saturday to pick up yard signs and campaign swag. Lisa Holgash, a 49-year-old Trump supporter, said she would “love it” if Trump were able to appoint another Supreme Court Justice. But she said she was concerned about the idea of Republicans pushing through a nominee so quickly ahead of the election, especially after Republicans denied Obama a final pick in his last year. “It’s not that far now to the election,” she said. “I don’t think it should be rushed.” See:Flowers, homemade signs, singing outside Supreme Court in Ginsburg tribute"}]}