{"article": [{"url": "https://www.marketwatch.com/story/10-year-treasury-yield-trims-drop-a-day-after-hitting-eight-week-high-as-traders-digest-rush-of-economic-data-2020-08-14", "published": 1597399820.0, "headline": "Treasury yields log biggest weekly jump in more than 2 months", "body": "U.S. Treasury yields mostly fell Friday but kept their weekly increase intact as trading in the bond market reflected the raft of stronger-than-expected economic data and increased Treasury auctions over the past few days. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% fell 0.6 basis point to 0.708%, trimming its weekly gain to 14.6 basis points. The benchmark maturity closed at an eight-week high on Thursday. The 2-year note rate TMUBMUSD02Y, 0.156% fell 1.6 basis points to 0.147%, paring its weekly rise to 2 basis points, while the 30-year bond yield TMUBMUSD30Y, 1.576% rose 1.8 basis points to 1.442%, adding to a weekly climb of 21.3 basis points. All three maturities recorded their biggest weekly yield increase since June 5. What’s driving Treasurys? The bond market showed signs of stabilizing on Friday after a weeklong selloff sparked by a round of larger debt auctions, increased by the Treasury Department last week. Another round of stronger-than-expected economic numbers added to the signs that the U.S. recovery continued to make steady progress, as data showed a boost in consumer and wholesale prices in July. See: Bond buyers blindsided by higher inflation expectations after price pressures resurface Retail sales in July rose 1.2%, and increased by 1.9% once stripping out for auto and gas sales which can unduly influence the data. Second-quarter productivity jumped 7.3%, while second-quarter unit labor costs surged by 12.2%. Separately, a reading on industrial production rose 3% in July for the third straight monthly gain after sharp declines in March and April, the Federal Reserve reported Friday. The gain in July was above Wall Street expectations of a 2.7% gain, according to a survey by MarketWatch. Production in June was raised to a 5.7% gain from the earlier estimate of a 5.4% increase. Investors continued to wait for developments on a coronavirus relief package from Congress. Analysts are growing more despondent on the prospect of a breakthrough before Labor Day, after Senate broke for recess on Thursday. On U.S.-China trade talks, both sides have canceled plans for a virtual weekend meeting to assess their so-called phase one trade deal as it hits its six-month mark. What did market participants’ say? “I’m still interested in knowing the timing of the stimulus. I thought it would have happened by now and it needs to take place,” said Karissa McDonough, chief fixed income strategist at People’s United Advisors, in an interview."}]}