{"article": [{"url": "https://www.marketwatch.com/story/there-are-only-5-days-left-to-get-this-tax-smart-retirement-benefit-11594391421", "published": 1594734260.0, "headline": "Youâ\u0080\u0099re almost out of time to get this smart retirement benefit", "body": "The extended tax filing deadline is July 15, and with it comes the last day to fund or max out an individual retirement account for the previous year.Â Every year, workers have until Tax Day to contribute to the prior yearâ\u0080\u0099s IRA. For example, in 2020, you could continue to put money toward your IRA for the 2019 calendar year. When the government extended the tax filing deadline to July 15 from April 15 as part of the CARES Act, the deadline to fund last yearâ\u0080\u0099s IRA was pushed to that date as well.Â There may only be less than a week left until this deadline, but itâ\u0080\u0099s not too late to act, financial advisers said.Â Many IRAs can be open with a custodian or financial institution online, said Ashley Gragtmans, a behavioral financial adviser at Parsec Financial. â\u0080\u009cAt this point, all an investor needs to do is open and fund the account,â\u0080\u009d she said. After the account is opened, which could be done in a day, the investor can send a check to add money to the account. â\u0080\u009cAs long as the check is postmarked by the tax-filing deadline, you are fine,â\u0080\u009d Gragtmans said.Â See: I have student debt, a mortgage, a growing family and Iâ\u0080\u0099m relocating for work â\u0080\u0094 how do I save for retirement?Â Most financial firms will accept contributions right until the deadline, though investors should double check with their institution, said Brian Ellenbecker, a financial adviser at Shakespeare Wealth Management. Contributions can also be made with cash or a direct bank account transfer. Future contributions can be made with automatic deposits from a checking account.Â Investors should alert the financial firm that these contributions are meant on behalf of 2019. The IRA contribution limit for 2019 is $6,000, and an additional $1,000 for a total of $7,000 for people 50 and older. There are two types of IRAs â\u0080\u0094 traditional and Roth. The first is funded with pretax dollars, whereas the latter is funded with after-tax dollars and distributed tax-free. There are pros and cons with either account, and the best choice depends on personal circumstances, such as age, current earnings and anticipated income tax bracket in retirement.Â A few considerations to make regarding tax filing and IRA contributions: If contributing to a traditional IRA, you have to report what your contribution to the account will be on your tax return, whether it is considered a deductible contribution or not. The IRS is allowing taxpayers to file their 2019 returns now and report the contribution before itâ\u0080\u0099s actually made, Ellenbecker said. Investors just have to be sure they get the money in those accounts before the deadline â\u0080\u0094 and if they donâ\u0080\u0099t, theyâ\u0080\u0099ll have to file an amended return. Roth contributions do not have to be reported on tax returns.Â Also see: I have a seven-figure nest egg â\u0080\u0094 am I saving too much for retirement? Financial advisers suggest workers max out their 2019 IRA if they can, or fund it as much as they can before moving on to the 2020 IRA limits. â\u0080\u009cThis gives them the flexibility to make contributions for both 2019 and 2020, particularly since you have until April 15th of 2021 to make 2020s contribution,â\u0080\u009d said Danielle Harrison, a financial planner in Columbia, Mo. â\u0080\u009cThis strategy gives an individual the most latitude and flexibility in their decision-making and the ability to potentially contribute twice as much to their account, especially if they are just now opening their first IRA or Roth IRA.â\u0080\u009dÂ Those concerned about how to invest an IRA can start with something simple, such as a target-date fund that correlates with your anticipated retirement date, said Jennifer Weber, vice president of financial planning at Weber Asset Management. Investors should look for low-cost options, but also have the ability to adjust their investments later.Â Contributions should only be made with money that isnâ\u0080\u0099t needed elsewhere, Gragtmans said. â\u0080\u009cIf you are funding an IRA, it should be viewed as a long-term move,â\u0080\u009d she said. â\u0080\u009cIf you think you will need the money soon, then donâ\u0080\u0099t do it. Otherwise, you could be subject to taxes and penalties depending on the circumstances of your withdrawal.â\u0080\u009d"}]}