{"article": [{"url": "https://www.marketwatch.com/story/apple-hits-2-trillion-market-cap-in-intraday-trading-establishing-yet-another-milestone-2020-08-19", "published": 1597854860.0, "headline": "Apple comes up short of $2 trillion mark as markets sink in afternoon trading", "body": "Apple Inc.’s market capitalization climbed into $2-trillion territory Wednesday, though its shares pulled back toward the end of the session, bringing its valuation back below the mark by the close of trading. Shares AAPL, +1.74% traded as high as $468.65 in Wednesday’s session but failed to close at or above $467.77, the level needed for Apple to be worth $2 trillion. Still, the intraday ascent to the $2-trillion mark came as yet another valuation milestone just two years after Apple became the first U.S. company to top $1 trillion. Apple first closed above a $1-trillion valuation on Aug. 2, 2018, 38 years after the company went public. After falling back below the mark for one day on March 23, amid concerns that the COVID-19 crisis would pressure its business, Apple was able to more than double its market capitalization in less than five months. Despite fears about what store closures and economic pressure would mean for the company’s hardware sales, Apple demonstrated the resilience of its business last quarter with sales that exceeded estimates even from before the pandemic came into view. The company’s Mac and iPad sales have been especially strong given that more people are studying and working from home. The company is expected to roll out its first 5G-enabled iPhone this fall, with management telling investors to expect a delay of a few weeks compared with last year’s launch timing. Apple shares have continued marching higher even amid renewed scrutiny of the company’s App Store practices. Chief Executive Tim Cook appeared at a House of Representatives antitrust hearing in July and faced questions on the company’s fee structure for the App Store, in which Apple retains up to 30% of sales of digital goods purchased through third-party apps that users download from the App Store. The company also faces a lawsuit from “Fortnite” developer Epic Games, which accuses Apple of monopolistic practices for retaining a big cut of digital purchases and not allowing developers to take purchases within apps using their own payment mechanisms. Epic’s complaint has drawn support from other high-profile developers including Spotify Technology SA SPOT, +0.08% and Match Group Inc. MTCH, -0.94% . Shares have added 58% so far this year as the Dow Jones Industrial Average DJIA, +0.56% has lost about 3%."}]}