{"article": [{"url": "https://www.marketwatch.com/story/why-small-business-owners-may-want-to-consider-filing-taxes-after-the-july-15-deadline-2020-06-02", "published": 1594729160.0, "headline": "Why small business owners may want to file taxes AFTER July 15 deadline", "body": "In response to the COVID-19 crisis, the IRS postponed the usual deadlines for: (1) paying what business taxpayers will owe Uncle Sam with their as-yet-unfiled federal income tax returns and (2) taking several actions that can affect what will be owed with those returns. So, if your business entity’s federal income tax return is still awaiting completion, you may have more tax planning flexibility than you thought, and you have plenty to think about in that regard. Ditto for individual taxpayers who own pass-through business entities. I will explain, after first covering the tax payment and return filing postponements granted by the IRS in response to COVID-19. Postponed tax payment and return filing deadlines for business entities Thanks to relief granted by the IRS, July 15 is the new deadline for federal income tax payments and federal income tax return filings that would otherwise be due on or after 4/1/20 and before 7/15/20. Example 1: Your C corporation uses the calendar year for tax purposes. The normal 4/15/20 deadline for paying any federal income tax that’s still owed for the corporation’s 2019 tax year is postponed to 7/15. This relief is automatic. You don’t need to file anything with the IRS to take advantage, and your corporation won’t owe any interest or penalty if you do. The normal deadlines for making your corporation’s first and second estimated federal income tax installments for the 2020 tax year are 4/15 and 6/15. Both deadlines are postponed to 7/15. This relief is automatic. You don’t need to file anything with the IRS to take advantage, and your corporation won’t owe any interest or penalty if you do. Finally, the normal deadline for filing your corporation’s 2019 federal income tax return (Form 1120) is 4/15/20. That deadline is also postponed to 7/15. This relief is automatic. You don’t need to file anything with the IRS to take advantage, and your corporation won’t owe any penalty if you do. Postponed tax return filing deadlines for business entities that use non-calendar tax years Some business entities use non-calendar tax years that don’t end on December 31. The aforementioned postponement of federal income tax return filing deadlines can apply to them too. Example 2: You own a C corporation that uses an 8/31 tax year-end, because its business is seasonal. The original due date for the corporation’s tax year that ended on 8/31/19 was 12/15/19, but you filed an extension request with the IRS to extend the due date to 5/15/20. Since that date is on or after 4/1 and before 7/15, the filing deadline for your corporation’s federal income tax return (Form 1120) is postponed to 7/15. This relief is automatic. You don’t need to file anything with the IRS to take advantage, and your corporation won’t owe any penalty if you do. Postponed tax payment and return filing deadlines for individual business owners The aforementioned postponements of federal income tax payment deadlines and federal income tax return filing deadlines can be a big help to individuals who own interests in pass-through business entities (sole proprietorships, single-member LLCs treated as sole proprietorships for tax purposes, partnerships, multi-member LLCs treated as partnerships for tax purposes, and S corporations). If you are one of these individuals, July 15 is your new deadline for tax payments and return filings that would be due on or after 4/1/20 and before 7/15/20. Example 3: Like almost all individuals with ownership stakes in pass-though business entities, you use the calendar year for tax purposes. You can defer paying any federal income tax (including any self-employment tax) that’s still owed for your 2019 tax year until July 15. The normal payment deadline is 4/15. This relief is automatic. You don’t need to file anything with the IRS to take advantage, and you won’t owe any interest or penalty if you do. You can also defer your first and second estimated federal income tax installments for the 2020 tax year until July 15. The normal deadlines for those payments are 4/15 and 6/15. This relief is automatic. You don’t need to file anything with the IRS to take advantage, and you won’t owe any interest or penalty if you do. Finally, the normal 4/15/20 deadline for filing your 2019 personal federal income tax return (Form 1040) is postponed to July 15. This relief is automatic. You don’t need to file anything with the IRS to take advantage, and you won’t owe any penalty if you do.Business taxpayers have important choices to make on still-unfiled returns You have tax planning options to consider between now and July 15. Here are some important ones. Claim 100% first-year bonus depreciation (or not) You can claim 100% first-year bonus depreciation for qualifying business assets placed in service between 9/28/17 and 12/31/22. That means you can write off the entire cost of those assets on the federal income tax return for the year the assets are placed in service. This valuable break is allowed for both new and used qualifying assets, which include most categories of tangible depreciable assets, off-the-shelf software, and real estate qualified improvement property (QIP). While claiming 100% first-year bonus depreciation whenever allowed is usually a tax-smart move, think twice if you anticipate higher tax rates in future years. In that case, consider foregoing bonus depreciation and instead depreciating the assets in question over a number of years. The depreciation write-offs will offset income in future years that might be taxed at higher rates (maybe much higher). The choice to claim 100% first-year bonus depreciation, or not, is made on your still-unfiled federal income tax return. The Coronavirus Aid, Relief, and Economic Security Act (CARES Act) allows a five-year carryback privilege for any business net operating loss (NOL) that arises in a tax year beginning in 2018-2020. Claiming 100% first-year bonus depreciation can potentially create or increase an NOL. You can then carry back the NOL to an earlier tax year and recover some or all of the federal income tax paid for that year. So, this factor argues in favor of claiming 100% first-year bonus depreciation on your still-unfiled return. Retroactive COVID-19 business tax relief provisions The CARES Act includes a number of retroactive tax relief provisions for business taxpayers. These retroactive provisions can impact your still-unfiled return. * As stated earlier, the CARES Act allows an NOL that arises in a tax year beginning in 2018-2020 to be carried back five years. So, an NOL reported on your still-unfiled return can be carried back to an earlier tax year to recover some or all of the federal income tax paid for that that year. Because federal income tax rates were generally higher in years before the Tax Cuts and Jobs Act (TCJA) took effect, NOLs carried back to pre-TCJA years can yield big tax refunds. * The CARES Act also fixed a TCJA drafting error to allow faster depreciation for real estate qualified improvement property (QIP) placed in service after the TCJA took effect. QIP is generally defined as an improvement to an interior portion of a nonresidential building that’s placed in service after the date the building was placed in service. The CARES Act correction allows 100% first-year bonus depreciation for QIP placed in service in 2018-2022. Alternatively, you can choose to depreciate QIP placed in service in 2018 and beyond over 15 years. The choice to claim 100% first-year bonus depreciation for QIP, or not, is made on your still-unfiled federal income tax return. * An unfavorable TCJA provision disallowed current federal income tax deductions for so-called excess business losses incurred by individual taxpayers in tax years beginning in 2018-2025. An excess business loss is one that exceeds $250,000 or $500,000 for a married joint-filing couple. The CARES Act suspended the excess business loss disallowance rule for losses that arise in tax years beginning in 2018-2020. Good!Business taxpayers should consider extending returns past July 15 Business taxpayers have lots of things to consider for their still-unfiled federal income tax returns. With that thought in mind, recognize that things are very different this time around. You have COVID-19 tax relief provisions, some of which are retroactive, to evaluate. You have the upcoming November general election to think about. The outcome of that election could have major tax implications for future years. What you choose to do with your still-unfiled return can impact taxable income in those future years. With all these factors in play, I think business taxpayers should strongly consider extending the due date for their still-unfiled returns past July 15. That would give you more time to get your act together. How to extend At the time this was written, the standard procedures must be followed to extend filing deadlines for federal income tax returns past July 15. Extend the deadline for your personal 2019 return (Form 1040) to October 15 by submitting Form 4868 to the IRS. Extend the deadline for the return of a business entity by submitting Form 7004. The bottom line Like I said at the beginning of this column, business taxpayers have plenty to think about in connection with their still-unfiled federal income tax returns. Talk to your tax pro. Extending return due dates past July 15 is probably a wise move in many cases. Talk to your tax pro about that too."}]}