{"article": [{"url": "https://www.marketwatch.com/story/weekend-reads-were-not-going-to-vaccinate-our-way-out-of-covid-19-2020-07-31", "published": 1596271520.0, "headline": "Weekend reads: Weâ\u0080\u0099re not going to vaccinate our way out of COVID-19", "body": "Not very long ago, states were reopening their economies after weathering the first wave of COVID-19 infections, and it was easy to be caught up in the enthusiasm about life starting to return to normal. Then infection rates began to spike again, not only in the U.S. but also in countries that had seemed to be very successful in clamping down on the coronavirus earlier this year. Now there are continual reports of vaccines being developed, and executives at companies that have been terribly affected by the economic shutdown have expressed confidence that business will be back to normal by 2022. Maybe we are all still making too many assumptions. Jaimy Lee interviewed Dr. Michael Osterholm, an epidemiologist at the University of Minnesota, who made sobering comments about the effectiveness of vaccines, antibodies and herd immunity and even predicted that weâ\u0080\u0099ll be coping with COVID-19 for decades.How the pandemic might lower your Social Security payments Alessandra Malito explains why the COVID-19 pandemic may cause payments for those who become eligible for Social Security in 2022 or later to decline. Ogden, Utah, is approximately 10 miles east of the Great Salt Lake iStockphoto Life goes on: fun retirement destinations Silvia Ascarelli helps a reader who wishes to retire in a â\u0080\u009csocially liberalâ\u0080\u009d place with plenty of live music and good skiing close by.No job, not much in savings â\u0080\u0094 and 63 years old Alessandra Malito digs into financial planning and Social Security decision points for to a widow who lost her job as a result of the COVID-19 pandemic and feel lost.PayPal is rocking in 2020 This weekâ\u0080\u0099s earnings-season headlines have been dominated by Facebook FB, +0.26%, AAPL, +1.74%, Amazon.com AMZN, +3.01% Â and Alphabet GOOG, +1.97% Â GOOGL, +1.82%, Â but shares of PayPal PYPL, +2.18% have performed better than any of those giants this year, with a 78% gain. PayPal CEO Dan Schulman described the new e-commerce environment in an interview with Emily Barry. Apple Central World in Bangkok. Getty Images Appleâ\u0080\u0099s coming split Mark DeCambre explains how Appleâ\u0080\u0099s AAPL, +1.74% Â coming 4-for-1 stock split will affect the Dow Jones Industrial Average DJIA, +0.56%. Read this if you think you have any privacy online The most popular web browsers have â\u0080\u009cprivate browsingâ\u0080\u009d features that really donâ\u0080\u0099t provide much privacy. Hereâ\u0080\u0099s why. Hand-sewing protection masks at home. Getty Images/iStockphoto A potential coronavirus tax problem for people who run their own businesses If you began your own business as a result of the COVID-19 pandemic, chances are that your investment this year will outweigh your revenue. If you expect a tax benefit as a result, you have to be very careful, as Bill Bischoff explains. Related: Did the extra $600 unemployment benefit stop people from job hunting? These Yale economists say they finally have an answerContrarian stock picks for the pandemic recovery Bill McMahon, the chief investment officer for active strategies at Charles Schwab, recommends investors diversify away from momentum stocks for gains when the economy eventually recovers. Stock picks â\u0080\u0094 going green Michael Brush interviews money managers who recommend stocks that can benefit from various environmentally-friendly trends. Speaker of the House Nancy Pelosi, Joe Biden and Senate Minority Leader Chuck Schumer. Getty Images A stock sector for a Democrat sweep The prospect of a Democratic sweep of the Presidential and Congressional elections in November might cause investors to shy away from managed health care companies, but Ed Clissold of Ned Davis Research thinks they will be excellent performers. Want more from MarketWatch? Sign up for this and other newsletters, and get the latest news, personal finance and investing advice."}]}