{"article": [{"url": "https://www.marketwatch.com/story/watch-out-for-these-six-new-coronavirus-symptoms-2020-04-27", "published": 1593515120.0, "headline": "Watch out for these 3 new coronavirus symptoms", "body": "Since the beginning of the COVID-19 pandemic, the CDC has warned people to monitor themselves for fever, cough and shortness of breath. That list of warning signs has gotten longer. Three more potential symptoms of the novel coronavirus that causes COVID-19 have been added to the CDC’s list. They include: Congestion or runny nose Nausea or vomiting Diarrhea In April, the CDC flagged several other warning signs, ranging from mild symptoms to severe illness, which can develop two to 14 days after exposure to the virus. They include: Chills and repeated shaking with chills Fatigue Muscle or body aches Headache Sore throat New loss of taste or smell Those are in addition to the original three symptoms: Fever Cough Shortness of breath or difficulty breathing This expanded list of warning signs is significant because some testing sites may require a patient to show symptoms before they can be tested. Related:These 21 companies are working on coronavirus treatments or vaccines — here’s where things stand The CDC stresses that this list is not all-inclusive, however, as there is still so much we don’t know about the coronavirus, in that it is novel. For example, there are reports of coronavirus patients in Italy exhibiting skin rashes, while some children and teens in Spain developed pseudo-frosbite lesions (called pernio, or chilblains) on their toes, which is being called “COVID toes.” Some young COVID-19 patients that were otherwise healthy are suffering severe strokes, while others are developing blood clots even while on anticoagulants. Broadway actor Nick Corduro had to have a leg amputated due to clotting resulting from the virus. Read more: What parents should know about the mysterious coronavirus-related disease affecting kids: multisystem inflammatory syndrome in children The bottom line: Call your doctor or local health department if the above COVID-19 signs emerge, or you’re seeing any symptoms that are severe or causing concern. Health officials emphasize that the “emergency warning signs” for COVID-19 include: Trouble breathing Persistent chest pain or pressure in the chest Confusion or inability to arouse/wake after sleeping Bluish lips or face You should always call 911 for any medical emergency. If you’re not showing these emergency warning signs, you may be told to self-isolate and recover at home. The CDC notes that decisions about testing are at the discretion of state and local health departments and/or individual clinicians. And most infected people continue to be expected to experience mild illness and to be able to recover at home without medical care. While the death toll from the virus is staggering and even frightening, 5 million people and counting have also recovered. Read more:Coronavirus survives longer airborne and travels further in these public spaces — here’s where to be extra careful So if you feel sick, stay home, take care of yourself and avoid public transportation to prevent spreading the virus. Try to separate yourself as much as possible from the rest of your household, and stay in frequent touch with your doctor. For tips on how to self-quarantine, click here. And find more information about caring for someone with COVID-19 here. Read more: ‘He said it was the sickest he’s ever been in his life’: How to care for a coronavirus patient at home As of Monday morning, the global COVID-19 case tally has surpassed 10 million people, with more than half a million dead. The U.S. continues to have the highest case toll in the world with 2.55 million confirmed infected, as well as the highest death toll, with 125,803 and counting having succumbed to the virus. Read more of MarketWatch’s coronavirus coverage here. This article was originally published in April 2020, and has been updated with new symptoms from the CDC, as well as the most recent COVID-19 statistics from Johns Hopkins University."}]}