{"article": [{"url": "https://www.marketwatch.com/story/gold-shatters-summer-doldrums-as-it-climbs-to-record-territory-2020-07-23", "published": 1595515520.0, "headline": "Gold shatters 'summer doldrums' as it climbs to record territory", "body": "The gold market saw a lot of excitement on Thursday, with its climb over the last five sessions in a row ultimately lifting prices into record territory. \"Ordinarily this is the quiet time for gold-summer doldrums,\" said Ross Norman, chief executive officer of precious metals news and information provider Metals Daily. \"Well, not this year.\" Read: Why gold has become a 'weapon of choice' for investors “ 'In reality, virtually everything is going gold's way - record debt, epic increase in money supply, silver catching up, negative real yields, and even a dollar correction.' ” - Ross Norman, Metals Daily \"In reality, virtually everything is going gold's way-record debt, epic increase in money supply, silver catching up, negative real yields, and even a dollar correction,\" Norman told MarketWatch. August gold rose $24.90, or 1.3%, to settle at $1,890 an ounce on Comex Thursday, after trading as high as $1,897.70. The contract ended just short of the most-active contract settlement record of $1,891.90 from August 22, 2011, based on records going back to November 1984, according to Dow Jones Market Data. The record most-active intraday level stands at $1,923.70 an ounce from Sept. 6, 2011. However, the front-month July gold contract US:GCN20, which trades on significantly lower volume, settled at $1,889.10 on Thursday, up $25, or 1.3%, for the session. That's a record for the front-month contracts, based on data going back to 1975. Silver prices, meanwhile, also recently rallied to their highest settlement since 2013, with the September silver US:SIU20 contract on Wednesday settling at $23.144 an ounce. Gold's upward momentum is \"caused by perfect storm of pandemic headlines, benign dollars and interest rates, as global economic stimulus grows,\" George Gero, managing director at RBC Wealth Management, told MarketWatch. \"This may last longer than usual cycles\" as the pandemic casts a shadow on Europe, South America, the Far East, as well as the U.S. Contributing to gold's haven appeal are escalating tensions between China and the U.S., the upcoming U.S. election, worries about an increase in debts from continuing stimulus, and unrest everywhere, said Gero. Gold prices have climbed by around 50% since the summer of 2018, when the metal bottomed under $1,200 an ounce, said Adrian Ash, director of research at BullionVault. That's the fastest two-year gain since New Year 2012, he said. The yellow metal also has climbed around $400 an ounce from March's COVID-19 crash, \"its steepest 17-week gain since the very tops of September 2011 and before that January 1980,\" said Ash, adding that trading volumes on BullionVault, an online platform for physical precious metals, reached $28.9 million, which was the third busiest day ever, after March 17 when the COVID crisis really broke, and June 24, 2016, the day of the U.K.'s Brexit referendum result. \"Hot money's finally joined in,\" said Ash. That said, analysts warned that gold could soon see a correction. Prices could move lower \"on profit taking,\" said Norman. At the same time, the stock market is \"looking disconnected from the real economy and a sell off could see margin calls again like we saw\" in the first quarter, prompting traders to sell gold to cover those margins. Gero voiced caution as well. \"Next week, options expirations on Comex, with in the money options becoming futures contracts needing cash margin, could bring traders profit taking\" in gold, he said. Even if there was a pullback in gold prices, however, Norman said \"all that would do is provide a fresh buying opportunityâ\u0080¦so that window could close quite quickly.\""}]}