{"article": [{"url": "https://www.marketwatch.com/story/trump-administration-behaved-like-a-gangster-to-push-the-us-tiktok-deal-and-beijing-has-no-reason-to-approve-it-chinese-media-2020-09-23", "published": 1600925840.0, "headline": "The U.S. behaved like a â\u0080\u0098gangsterâ\u0080\u0099 to â\u0080\u0098robâ\u0080\u0099 TikTok from China and Beijing has â\u0080\u0098no reasonâ\u0080\u0099 to approve the deal: Chinese media", "body": "An agreement on the ownership of TikTokâ\u0080\u0099s U.S. operations approved by Washington last weekend is a â\u0080\u009cdirty and underhanded trickâ\u0080\u009d based on â\u0080\u009cbullying and extortion,â\u0080\u009d state-owned English language newspaper China Daily wrote in an editorial on Wednesday. It went on to compare the U.S. administration to â\u0080\u009ca gangster forcing an unreasonable and unfair business deal on a legitimate company.â\u0080\u009d - The White House last weekend approved a deal that quickly showed the three signatory companies at odds over its interpretation. TikTokâ\u0080\u0099s Chinese owner, ByteDance, said it would own 80% of a new TikTok Global entity, while Oracle and Walmart, its U.S. future partners, insisted instead that they will control the company. - Global Times, an English language version of the Communist Party newspaper Peopleâ\u0080\u0099s Daily, also denounced the Trump-approved deal on Wednesday, proclaiming in a headline that China wouldnâ\u0080\u0099t â\u0080\u009callow the U.S. to rob TikTok.â\u0080\u009d The paper also quoted an expert describing Oracleâ\u0080\u0099s founder Larry Ellison as â\u0080\u009cdefinitely an anti-China person.â\u0080\u009d - ByteDance chose database software company Oracle ORCL, +0.42% Â and retailer Walmart WMT, +1.00% Â over technology giant Microsoft MSFT, +2.48% Â when it was forced by Washington to hand over its U.S. operations under the threat of an outright ban. The U.S. government balked at a first version of the deal that kept the Chinese in control of the popular videosharing app. - â\u0080\u009cEven if it means TikTok could be shut down complete in the U.S., China will not sit idle and allow the U.S. government to seize a Chinese asset so brazenly,â\u0080\u009d the Global Times warned. Read:China flexes its muscles in Hong Kong with arrest of pro-democracy media tycoon Jimmy Lai The outlook: It looks like the White House-sanctioned deal wasnâ\u0080\u0099t quite a deal after all. But it is still hard to tell whether the Chinese media editorials signal Beijingâ\u0080\u0099s outright opposition to any form of agreement, or whether they just amount to a bit of saber-rattling before another compromise is found. However important it has become to the online lives of American and European teenagers, and to President Donald Trumpâ\u0080\u0099s campaign against Chinese security threats, TikTok isnâ\u0080\u0099t seen by analysts as crucial to Beijingâ\u0080\u0099s interests. And in any case, the dispute about its ownership must be placed in the overall context of the tense and deteriorating U.S.-China relations. Read: From lockdowns to Brexit, the U.K. economy is heading toward a rough winter"}]}