{"article": [{"url": "https://www.marketwatch.com/story/rule-change-for-how-hospitals-report-coronavirus-data-to-government-comes-under-fire-2020-07-16", "published": 1595071460.0, "headline": "Rule change for how hospitals report coronavirus data to government comes under fire", "body": "A federal dashboard that provides information to the public about COVID-19 data that is provided by hospitals has not been updated since a rapidly implemented rule for how hospitals report that kind of data was put into place. The new rule, issued July 10 by the Department of Health and Human Services, went into effect July 15. The last set of data is from July 14. Rather than send COVID-19-related data to the Centers for Disease Control and Prevention, as has been done since March, hospitals, hospital laboratories, and other acute-care facilities have been told to submit that information to a portal operated by TeleTracking Technologies Inc., a privately held data company. Health officials say the new process will reduce “confusion and duplication of reporting,” create more flexibility with what data is collected during the pandemic, and better allocate medications such as Gilead Sciences Inc.’s GILD, +0.82% remdesivir. (The terms of the experimental drug’s emergency use authorization from the Food and Drug Administration requires that the medication is allocated by the federal government.) Read: Global COVID-19 cases climb to 13.6 million after record one-day tally of 230,400 new infections The decision prompted the National Governors Association to ask the Trump administration to delay the rule by 30 days. “Governors are requesting a 30-day delay of these new requirements, in order for hospitals to learn a new system, as they continue to deal with this pandemic,” the organization said Thursday. “In addition, governors urge the administration to make this information publicly available.” CDC Director Dr. Robert Redfield told reporters on Wednesday that “no one is taking access or data away from CDC.” But health experts are questioning the viability of having hospitals change their data-reporting systems at the same time that they are struggling to care for growing numbers of COVID-19 patients, and asked if the decision has political motivations. See:Maryland’s Republican governor slams Trump’s handling of coronavirus pandemic “It’s quite important given how politicized this can be,” said Jen Kates, senior vice president and director of global health and HIV policy at the Kaiser Family Foundation. “This decision raises more questions than answers.” There are two questions about the reporting change, she said: How will the new reporting rule improve the process of data collection? And will that data be made public to researchers and the public going forward? The coronavirus pandemic in the U.S. is worsening by the day, with more than half of U.S. states now considered COVID-19 “hot spots,” based on case count increases over 14 days and high or growing positivity rates, according to the KFF. The rise in cases is in contrast to how countries in Europe and Asia have handled the pandemics within their borders. The U.S. has reported about one-quarter of the world’s coronavirus cases (3.49 million) and deaths (137,420), according to data aggregated by the Johns Hopkins University. See also:Walmart, Target, Best Buy now require customers to wear face coverings at its stores The Johns Hopkins University and The COVID Tracking Project — which operate two commonly cited public sources of COVID-19 data in the U.S. — both say they don’t expect to be affected by the change in data collection. The JHU site sources some data from the project, which focuses on state-level data and was built by journalists at The Atlantic. “We support more transparency and hope all the HHS data will be released,” The COVID Tracking Project tweeted Wednesday. “That said, there’s a reason we built a process to capture national numbers that doesn’t rely on our national government.” Sen. Kamala Harris, a Democrat from California, agreed. iframe.twitter-tweet { width: 100% !important; } The data submitted to the federal government by hospitals includes important indicators such as intensive care unit bed capacity, the total number of mechanical ventilators in a facility, and the total number of hospitalized, suspected or confirmed positive COVID patients being treated in their facilities. At least one online dashboard operated by the CDC sharing hospital bed capacity at the state level was taken down on Thursday and then reinstated, with a disclaimer noting that the most recent data is from July 14, the day before the rule went into effect."}]}