{"article": [{"url": "https://www.marketwatch.com/story/politicians-have-supported-heavily-armed-law-enforcement-task-forces-as-seen-in-portland-for-years-at-vast-expense-but-with-underwhelming-outcomes-for-public-safety-2020-08-07", "published": 1597412540.0, "headline": "How politicians like Kamala Harris have long backed Portland-style policing", "body": "Many Americans have been shocked by scenes out of Portland, Ore., where federal agents dressed in military-style combat gear clashed with protesters. Oregon’s governor, Portland’s mayor and a raft of Democratic senators have launched stinging attacks on the operations. But the use of heavily armed law-enforcement task forces, such as have been drafted into Portland, has for years been supported by U.S. mayors and other politicians, both Democratic and Republican, despite allegations of police overreach and a lack of evidence they lead to improvements in public safety. “They come in with tanks. They come in dressed for combat. The methods themselves look so much like what you’re seeing in Portland,” said Judith Green, director of Justice Strategies, a research organization in New York. “If you were standing outside a housing project in the middle of one, you wouldn’t know the difference.” The Justice Department has acknowledged some task-force failures in studies and reports, but it posits these as management problems rather than the failure of a strategy that, when it works, can bring federal and state funding, information sharing, and other benefits to local policing. Critics, though, say agencies sometimes exaggerate problems to justify launching a multijurisdictional task force, and then overreach in their efforts to record a success. “For exchange of information and resources, I think they are great,” said James Hernandez, a California State University at Sacramento criminal-justice professor specializing in gangs. But “some are hokey as hell.” Read:Legal experts call Portland force deployment a constitutional ‘red flag,’ while Trump eyes federal actions on Chicago streets In April 2012, Carlos Gamino had just arrived at his Sacramento park maintenance job when he had to rush back home because he learned his daughters had been harmed by a stun grenade thrown by police raiding his house. “They have an army vehicle. They have cops, and sheriff’s deputies. My one daughter is sitting outside, and she’s had a panic attack where she can’t breathe. She’s handcuffed. I’m trying to get inside, and I’m like, ‘Show me the warrant.’ They say, ‘We don’t have to show you anything,’ ” said Gamino, describing the scene in a recent interview. Police arrested Gamino as a suspected gang member before releasing him from jail without charges that day, and sent his 16-year-old daughter to the hospital with burns on her legs from a stun grenade. Officers had mistakenly identified Gamino’s home as the residence of his brother, who had left the country years earlier. This was part of the culmination of “Operation Red Sash,” focused on the largely Hispanic Broderick neighborhood of West Sacramento. It involved an anti-land-mine vehicle obtained from the military, SWAT snipers, more than 100 officers from a dozen agencies — including the Yolo Narcotic Enforcement Team; the Davis, Woodland and West Sacramento police departments; the Yolo County Sheriff’s Department; and the Yolo Gang Task Force — who served 12 arrest warrants and 16 search warrants, according to a press release from the office of Kamala Harris, California’s attorney general at the time. Harris, now Joe Biden’s vice presidential pick, had been battling proposals from Gov. Jerry Brown to slash funding supporting regional law-enforcement task forces. And she billed Operation Red Sash as a success in her initiative to battle what her office called “transnational gangs.” “Today’s operation will cripple these criminal street gangs and their criminal enterprise network,” Harris said in a statement at that time. In the case of Operation Red Sash, the D.A. sought tough sentences based on the idea that the alleged crimes of those charged were gang-related. However, juries rejected the idea of gang involvement, and those convicted were mostly given lesser sentences for crimes such as drug dealing. Harris was hardly unique in putting gloss on a task-force operation. Politicians nationwide have claimed that task forces have routed, crippled or eliminated a particular type of misfeasor. “It’s a political thing,” said John Raphling, a criminal-justice researcher with Human Rights Watch. “They’re using the shock value, the visceral reaction to ‘gang’ to justify funding these useless, and ultimately harmful, operations.” For local officials, a multijurisdictional law-enforcement task force is often seen as all bonus, no onus. Typically, such an operation “adds resources and removes accountability,” said Raphling. Rick Gore, a former investigator with the district attorney’s office in Yolo County, which had led Operation Red Sash, described task-force operations there as a way to grow budgets: “Grant money is a huge incentive to grow departments. When you hire more detectives, more supervisors, more cases, [you] need more assistant district attorneys, you need more supervising district attorneys, your office grows, and you can put on your résumé that you went from a 40-person office to 650.” Patrick Jaicomo, an attorney with the Institute for Justice, said politicians “have to justify the funding, and so they have to be active on this issue,” he said. “If your task force is tasked with arresting a certain number of people, or finding a certain amount of drugs, you don’t think twice about raiding someone’s house at 3 a.m. Why not raid five houses? It leads to a mind-set where you do whatever it is you can think of to achieve the goal.” Through a spokeswoman, Yolo County’s sheriff declined to comment on Operation Red Sash. Yolo County’s district attorney, through a spokeswoman, declined to comment, saying Kamala Harris was responsible for the operation. Sen. Harris’s office didn’t respond to phone calls nor emailed questions. Read: ‘Shame on you, Mr. Barr’: Attorney general clashes with Democrats over protests Multiagency law-enforcement task forces have been around since the 1970s and now include hundreds of organizations encompassing thousands of officers. The Drug Enforcement Administration, one of many federal and state organizations coordinating law-enforcement task forces, reports managing 271 task forces involving 5,000 federal and state officers. The Federal Bureau of Investigation, for its part, counts 160 gang task forces involved around the country. There is no official tally of spending on these types of operations. But a 2014 report by the Brennan Center for Justice said the federal government sends at least $3.8 billion in federal criminal-justice grants across the country, largely for task-force operations. Billions more are sent through national-security programs run by the Departments of Defense and Homeland Security, the report said. And this doesn’t include state, local and regional agency budgets, which also contribute significant funds and resources to task-force operations. “These task forces are operating in every community in the country,” said Jaicomo. Despite the vast expense, critics say there has been scant effort to evaluate whether the task forces actually reduce the problems they were set up to solve. The idea has been to pick a single crime topic of public concern — gangs, narcotics, terrorism and the like — and rather than have local agencies addressing crimes as they arise, attacking a single problem by assembling teams and equipment from various agencies to conduct surveillance, raids, arrests and trials. Read:John Oliver explains ‘defund the police’ — and why it doesn’t mean ‘no police’ In 2007, a report for the Justice Department detailed how task forces could do a better job of figuring out whether their efforts reduced crime or other problems. Up to that point, the report’s author said in an interview, they took stock largely of things such as the number of arrests or gun seizures made. The following year the Justice Department produced guidelines, again recommending “performance measurement” gauging whether they’d done any good. But there is little incentive to measure whether these operations reduce the problems they are set up to deal with, according to the 2014 Brennan Center report. Grants to local law-enforcement agencies base funding on activities such as arrests, seizures and prosecutions, rather than proof of increased public safety per dollar spent. This “inadvertently creates incentives to increase arrests,” the report said, adding that hundreds of federal grant programs “provide additional dollars while slipping the leash of accountability and clear direction.” Subsequent studies analyzing law-enforcement task forces found a similar information vacuum. FBI analyst Laura Jamison found that “there is no system or requirement to measure performance, aside from criminal statistics, nor even a clear definition of success,” according to her December 2019 paper “Measuring Performance Within Anti-Gang Task Forces in Texas.” Experts who have immersed themselves in individual task-force operations have found problems similar to those of Operation Red Sash, where overwhelming use of force was followed by underwhelming outcomes. In February 2008, hundreds of officers from nine different agencies descended on the largely Black Oakwood neighborhood of Los Angeles to, according to a press release from Democratic City Attorney Rocky Delgadillo, stop narcotics gangs from terrorizing the community. The raid on two dozen homes left plenty of community members terrified, Raphling said. “They invaded the neighborhood. They had armored vehicles and 300 officers. They put hooks on window bars and broke windows, kicked down doors. In one instance, they kicked down a door, baby sleeping, just missed falling down on the baby. They rousted everybody and handcuffed people outside their houses. And they didn’t come up with shit,” he said. In a response to an inquiry, a spokesman for current City Attorney Michael Feuer said he “has nothing to say about a previous City Attorney’s actions or policies.” In April 2016 the U.S. Justice Department issued a press release heralding the “largest gang takedown in New York history,” by a task force including the City of New York Police Department, the Department of Homeland Security, the Drug Enforcement Administration, and the Bureau of Alcohol, Tobacco, Firearms and Explosives. Nearly 700 officers conducted a dawn raid on the Eastchester Gardens apartments and the surrounding neighborhood in the Bronx with special weapons and tactics teams, tanks and helicopters. At a press conference, U.S. Attorney Preet Bharara said the U.S. had charged 120 defendants with racketeering, narcotics and firearm offenses. He also said there were allegations of murder, shootings and stabbings. In reality, less than half of the people picked up in the raids were gang members, and some people were actually recharged for crimes they had already been punished for, according to Babe Howell, a law professor at City University of New York who studied the aftermath. Most weren’t charged with violent crimes but rather were dealers of marijuana, cocaine or other drugs. “They used a small set of homicides in the single digits, some of them already solved, to justify a massive takedown,” Howell said. “They were prosecuting non–gang members in a gang takedown, and admitting that they reprosecuted people for offenses they were already punished for.” The Justice Department responded in a statement, highlighting violent criminals arrested in the raid and adding that it is possible to charge non–gang members with gang racketeering because they sometimes help gangs. When locally applied sentences for the same crime are too short to deter gang activity, they can be revisited under federal anti-racketeering laws, the statement said. A federal officer pepper sprays a protester on July 20 in front of the Mark O. Hatfield United States Courthouse in Portland. Getty Images Read:Portland remains tense after mayor is among those tear-gassed by federal agents In Portland in May, much as in cities all over the country, several hundred protesters gathered along a six-block stretch of street emanating north from the Willamette River to denounce the police killing of George Floyd. On June 23 a group organized a march commemorating two men who had been killed defending Black teenage girls from racist epithets. Portland protesters surrounded a police station, and later the headquarters of the local police union. Some people set fire to a downtown sculpture of an elk. “Daily protests have regularly been followed by nightly criminal activity in the form of vandalism, destruction of property, looting, arson, and assault,” wrote a U.S. Federal Protective Service agent in a criminal affidavit accusing two protesters of interfering with officers’ job of defending federal buildings. On July 4 dozens of federal agents in camouflage and riot gear formed around the building housing Portland’s federal courts. And for the next three weeks, scenes of flash-bang grenades, fireworks, tear gas, injured protesters and agents spiriting away a protester in an unmarked van dominated America’s national conversation. Agents arrested 60 protesters. Federal prosecutors charged 46 with crimes such as arson, property damage and assault. On July 31, “Operation Diligent Valor” withdrew from the downtown area. Experts studying less-noticed task-force operations say they have seen many of these elements before. “The aggressive manner in which these operations are carried out, with little concern for the actual impact on the community, strikes me as similar,” said Raphling of Human Rights Watch. Added Howell, the CUNY law professor: “They’re able to say, ‘We are the white hat coming into the local jurisdiction and taking care of your street-crime problems.’ ” Matt Smith reports for MarketWatch and Barron’s Group from San Francisco."}]}