{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-rise-as-dollar-weakens-but-bullish-stocks-cap-gains-11601901888", "published": 1601907740.0, "headline": "Gold prices end at 2-week high on dollar weakness, fresh stimulus talk", "body": "Gold futures climbed on Monday, marking their highest settlement in just over a week, with a softer U.S. dollar and fresh talk of a stimulus deal supporting prices for the metal. “Like equities, the gold market seems to think easy money from the [Federal Reserve], plus big deficit spending by government, is going to win out over COVID’s deeply deflationary impact ,“ Adrian Ash, director of research at BullionVault, told MarketWatch. Bullion’s advance, however, remains threatened by increased appetite for risk as markets react to promising developments in President Donald Trump’s recovery from COVID-19. Meanwhile, “renewed hope for a fiscal stimulus deal,“ also provided support for gold, Michael Armbruster, managing partner at Altavest, told MarketWatch. House Speaker Nancy Pelosi said that progress was being made on coronavirus relief legislation, Reuters reported Sunday. Gold for December delivery GCZ20, +2.17% rose $12.50, or 0.7%, to settle at $1,920.10 an ounce, after posting a 2.2% weekly gain to close out Friday’s run. Silver for December delivery SIZ20, +5.96% added 53 cents, or 2.2%, to $24.56 an ounce, following a 4.1% rise of for gold’s sister metal last week. The ICE U.S. Dollar Index DXY, -0.58% declined nearly 0.4% in Monday dealings, as gauged by the index that measures the buck’s strength against a half-dozen currencies. A weaker dollar can make asset’s priced in the monetary unit relatively more expensive to overseas buyers. Equity markets globally were rising, a snapback from the softness seen on Friday and eroding some enthusiasm for precious metals on the session. Experts said uncertainty about the 2020 election, after Trump said he contracted the deadly disease, rattled markets on Friday. But more clarity has been provided about the president’s improved condition, after he was hospitalized over the weekend, which undercut some demand for bullion. Since then, more U.S. government officials have tested positive for COVID-19, prompting a “dash for safe havens,” such as gold, said Chintan Karnani, chief market analyst at Insignia Consultants. Among other metals, January platinum PLF1 tacked on 1.5% to $904.70 an ounce and December palladium PAZ0 added 2.3% to $2,378.40 an ounce. December copper HGZ20, +1.38% fell by 0.5% to $2.963 a pound. “There were a few factors that likely amplified the declines in copper last week including multiple Asian markets being closed for holidays as well as turn-of-the-quarter positioning,“ analysts at Sevens Report Research wrote in Monday’s newsletter. “Still, the drop to six-week lows (Thursday) was a notable development for the macroeconomic backdrop as the price action in copper is once again signaling a potential increase in broad market volatility on the horizon,“ they said. Read: Silver, copper provide hints for the global economic outlook"}]}