{"article": [{"url": "https://www.marketwatch.com/story/global-coronavirus-cases-hit-10-million-azar-warns-the-window-is-closing-for-us-to-curb-spread-2020-06-28", "published": 1593381560.0, "headline": "Grim coronavirus milestones: 10 million global cases, 500,000 deaths; Azar warns 'the window is closing' for U.S. to curb spread", "body": "ROME - The world surpassed two sobering coronavirus milestones Sunday - 500,000 confirmed deaths, 10 million confirmed cases - and hit another high mark for daily new infections as governments that attempted reopenings continued to backtrack and warn that worse news could be yet to come. \"COVID-19 has taken a very swift and very dangerous turn in Texas over just the past few weeks,\" said Gov. Greg Abbott, who allowed businesses to start reopening in early May but on Friday shut down bars and limited restaurant dining amid a spike in cases. California Gov. Gavin Newsom rolled back reopenings of bars in seven counties, including Los Angeles. He ordered them to close immediately and urged eight other counties to issue local health orders mandating the same. South Africa's health minister warned that the country's current surge of cases is expected to rapidly increase in the coming weeks and push hospitals to the limit. Health Minister Zwelini Mkhize said the current rise in infections has come from people who \"moved back into the workplace. It was therefore inevitable that there would be cluster outbreaks as infections spilled over from communities into places of congregation such as mines, factories, taxis and buses.\" New clusters of cases at a Swiss nightclub and in the central English city of Leicester showed that the virus was still circulating widely in Europe, though not with the rapidly growing infection rate seen in parts of the U.S., Latin America and India. Poland and France, meanwhile, attempted a step toward normalcy as the held elections that had been delayed by the virus. Wearing mandatory masks, social distancing in lines and carrying their own pens to sign voting registers, French voters cast ballots in a second round of municipal elections. Poles also wore masks and used hand sanitizer, and some in virus-hit areas were told to mail in their ballots to avoid further contagion. \"I didn't go and vote the first time around because I am elderly and I got scared,\" said Fanny Barouh as she voted in a Paris school. In Texas, Abbott appeared with Vice President Mike Pence, who cut campaign events from upcoming visits to Florida and Arizona because of rising virus cases in those states. Pence praised Abbott for both his decision to reopen the state, and to roll back the reopening plans. \"You flattened the curve here in Texas ... but about two weeks ago something changed,\" Pence said. Pence urged people to wear masks when unable to practice social distancing. He and Abbott wore face masks as they entered and left the room, taking them off while speaking to reporters. Health and Human Services Secretary Alex Azar, meanwhile, defended the fact that President Donald Trump has rarely worn a mask in public, saying he doesn't have to follow his own administration's guidance because as a leader of the free world he's tested regularly and is in \"very different circumstances than the rest of us.\" Addressing spikes in reported coronavirus cases in some states, Azar said on NBC's \"Meet the Press\" that people \"have to take ownership\" of their own behaviors by social distancing and wearing masks if possible. Azar stressed that \"the window is closing\" for the U.S. to take action to effectively curb the coronavirus. Azar pointed to a recent spike in infections, particularly in the South. He said people have \"to act responsibly\" by social distancing and wearing face masks, especially \"in these hot zones.\" Speaking on NBC and CNN, Azar argued that the U.S. is in a better position than two months ago in fighting the virus because it is conducting more testing and has therapeutics available to treat COVID-19. But he acknowledged that hospitalizations and deaths could increase in the next few weeks. A reported tally Sunday from Johns Hopkins University researchers said the death toll from the coronavirus pandemic had reached 500,108. About 1 in 4 of those deaths - more than 125,000 - have been reported in the U.S. The country with the next highest death toll is Brazil, with more than 57,000, or about 1 in 9. The true death toll from the virus, which first emerged in China late last year, is widely believed to be significantly higher. Experts say that especially early on, many victims died of COVID-19 without being tested for it. To date, more than 10 million confirmed cases have been reported globally. About a quarter of them have been reported in the U.S. The World Health Organization announced another daily record in the number of confirmed coronavirus cases across the world - topping over 189,000 in a single 24-hour period. The tally eclipses the previous record a week earlier at over 183,000 cases, showing case counts continue to progress worldwide. Overall the U.S. still has far and away the most total cases. At more than 2,450,000 - roughly twice that of Brazil. The number of actual cases worldwide is much higher. New York, once the nation's pandemic epicenter, is now \"on the exact opposite end,\" Gov. Andrew Cuomo said in an interview with \"Meet the Press.\" The state reported five new virus deaths Saturday, its lowest reported daily death toll since March 15. During the state's peak pandemic in April, nearly 800 people were dying every day. New York still leads the nation in COVID-19 deaths with nearly 25,000. In the state of Washington, Gov. Jay Inslee put a hold on plans to move counties to the fourth phase of his reopening plan as cases continue to increase. But in Hawaii, the city of Honolulu announced that campgrounds will reopen for the first time in three months with limited permits to ensure social distancing. Britain's government, meanwhile, is considering whether a local lockdown is needed for the central English city of Leicester amid reports about a spike in COVID-19 among its Asian community. It would be Britain's first local lockdown. \"We have seen flare-ups across the country in recent weeks,\" Home Secretary Priti Patel told the BBC on Sunday. Polish voters were casting ballots, in person and by mail, for a presidential election that was supposed to have taken place in May but was chaotically postponed amid the pandemic. President Andrzej Duda, a 48-year-old conservative backed by the nationalist ruling Law and Justice party, is running against 10 other candidates as he seeks a second five-year term. Iwona Goge, 79, was encouraged to see so many people voting in Warsaw. \"It's bad. Poland is terribly divided and people are getting discouraged,\" she said. French voters were choosing mayors and municipal councilors in Paris and 5,000 towns and cities in a second round of municipal elections held under strict hygiene rules. Key battlegrounds include Paris, where the next mayor will preside over the 2024 Summer Olympics. Italy was honoring its dead later Sunday with an evening Requiem concert in hard-hit Bergamo province. The ceremony in the onetime epicenter of the European outbreak came a day after Italy registered the lowest daily tally of COVID-19 deaths in nearly four months: eight. European leaders were taking no chances in tamping down new clusters. German authorities renewed a lockdown in a western region of about 500,000 people after about 1,300 slaughterhouse workers tested positive. Swiss authorities ordered 300 people into quarantine after a \"superspreader\" outbreak of coronavirus at a Zurich nightclub. Africa's confirmed cases of COVID-19 continued to climb to a new high of more than 371,000, including 9,484 deaths, according to figures released Sunday by the African Centers for Disease Control and Prevention. China on Monday reported a further decline in new confirmed cases, with a total of just 12, including seven cases of domestic transmission in Beijing, where nearly 8.3 million people have now undergone testing in recent weeks. No new deaths were reported Monday, leaving the total at 4,634 among 83,512 confirmed cases of COVID-19."}]}