{"article": [{"url": "https://www.marketwatch.com/story/trump-orders-clampdown-on-tiktok-and-wechat-beginning-sunday-prevents-download-in-the-u-s-01600431486", "published": 1600421720.0, "headline": "Trump orders clampdown on TikTok and WeChat beginning Sunday, prevents download in the U.S.", "body": "FILE - Icons for the smartphone apps TikTok and WeChat are seen on a smartphone screen in Beijing, in a Friday, Aug. 7, 2020 file photo. AP WASHINGTON (AP) — The U.S. will ban the use of the Chinese app WeChat on Sunday citing national security concerns. Downloads of the the app TikTok, owned by the same company, will be banned at the same time, and use of that platform will be banned in the U.S. by Nov. 12. But Commerce Secretary Wilbur Ross said early Friday on Fox Business News that access to that app may be possible if certain safeguards are in place. “At the President’s direction, we have taken significant action to combat China’s malicious collection of American citizens’ personal data, while promoting our national values, democratic rules-based norms, and aggressive enforcement of U.S. laws and regulations,” Ross said in a prepared statement. The government said its order, previously announced by President Donald Trump in August, will “combat China’s malicious collection of American citizens’ personal data.” Some security experts have raised concerns that ByteDance Ltd., the Chinese company that owns TikTok, would maintain access to information on the 100 million TikTok users in the United States, creating a security risk. Like most social networks, TikTok collects user data and moderates users’ posts. It grabs users’ locations and messages and tracks what they watch to figure out how best to target ads to them. Similar concerns apply to U.S.-based social networks such as Facebook FB, +0.26% and Twitter TWTR, -0.23%, but Chinese ownership adds an extra wrinkle because the Chinese government could order companies to help it gather intelligence. TikTok says it does not store U.S. user data in China and that it would not give user data to the government. But experts say the Chinese government can get any information it wants from companies there. The action is the Trump administration’s latest attempt to weaken influence from China, a rising economic superpower. Since taking office in 2017, Trump has waged a trade war with China, blocked mergers involving Chinese companies and stifled the business of Chinese firms like Huawei, a maker of phones and telecom equipment. China-backed hackers, meanwhile, have been blamed for data breaches of U.S. federal databases and the credit agency Equifax, and the Chinese government strictly limits what U.S. tech companies can do in China. Republican and Democratic lawmaker concerns about TikTok include its vulnerability to censorship and misinformation campaigns, and the safety of user data and children’s privacy. But the administration has provided no specific evidence that TikTok has made U.S. users’ data available to the Chinese government. Officials point to the hypothetical threat that lies in the Chinese government’s ability to demand cooperation from Chinese companies."}]}