{"article": [{"url": "https://www.marketwatch.com/story/if-the-democrats-win-the-senate-big-tech-better-be-ready-for-a-bigger-fight-2020-10-06", "published": 1601987240.0, "headline": "If the Democrats win the Senate, Big Tech better be ready for a bigger fight", "body": "If the Democrats manage to win control of the Senate in the coming election, the pressure on Silicon Valley would only grow. Democratic senators have signaled a willingness to make substantial changes to antitrust law and advocate breakups of the largest American tech companies, including campaigning for president on the issue. If the party can flip four seats, those same senators — such as Amy Klobuchar of Minnesota and Elizabeth Warren of Massachusetts — could be in position to act against some of their favorite targets, including Facebook Inc. FB, +0.26% and Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% GOOG, +1.97% If Democrats wrest control of the U.S. Senate on Nov. 3 (or in the following days and weeks it takes to count ballots), it could lead to the first major changes in antitrust law in a generation, Joel Mitnick, a former Federal Trade Commission trial lawyer who specializes in antitrust issues, told MarketWatch. A late July Congressional hearing, in which David Cicilline, a Democrat from Rhode Island, chairman of House Subcommittee on Antitrust, and other Democrats grilled three of the four companies under investigation, could offer a template on how a Democratic-controlled Senate would approach the Big Four. A report from Cicilline’s subcommittee, expected soon, reportedly recommends splitting up companies and limiting their future acquisitions. Read more: House Democrats proposing to split big technology firms, reports say Klobuchar is in line to chair the Senate Subcommittee on Antitrust, Competition Policy, and Consumer Rights, where she is the ranking Democratic member, and has held hearings and proposed new antitrust law. A Senate Judiciary hearing last month offered the clearest “intent from Klobuchar and [Sen. Richard] Blumenthal [of Connecticut] to change the antitrust standards in ways that benefit prosecutors and claimants,” Carl Szabo, vice president and general counsel of NetChoice, a trade association with two dozen e-commerce members that include Google, Facebook, eBay Inc. EBAY, +6.47%, and Airbnb told MarketWatch. In March, Klobuchar introduced the Anticompetitive Exclusionary Conduct Prevention Act, which “prohibits anticompetitive exclusionary conduct that risks harm to the competitive process.” The bill — co-sponsored by Blumenthal and Sen. Cory Booker, D-N.J. in August — introduced the Monopolization Deterrence Act to crack down on monopolies that violate antitrust law. And in June, Klobuchar and Sen. Chuck Grassley, R-Iowa, introduced legislation to help prevent anticompetitive mergers, the Merger Filing Fee Modernization Act. “They want to make more rules enforceable; make it easier to bring these actions,” Szabo said. The Trump administration is reportedly investigating Google, Facebook, Amazon.com Inc. AMZN, +3.01% and Apple Inc. AAPL, +1.74% for antitrust issues, amid concurrent state inquiries and lawsuits from competitors. The Justice Department is reportedly seeking to file suit against Google in October, while the Federal Trade Commission hopes to take similar action against Facebook by the end of the year, according to multiple reports. For more: Big Tech is turning on one another amid antitrust probes and litigation The presidential candidates are not actually that far apart on their statements on tech companies, but the Democrats’ relationship with Big Tech has changed since the Obama administration’s policies that alternately promoted, permitted, or ignored the industry. Robert Kaminsky, an analyst at Capital Alpha Partners, expects a Biden-Harris administration would seek tech-focused legislation, but focus more on consumer data and platforms than antitrust law. See: Here’s where Biden and Trump stand on antitrust, social media and other tech issues “We see a Democrat Senate providing a Biden administration with a better chance of passing privacy legislation and making changes to Section 230 liability protections, but jurisdictional issues within Congress still present a challenge to finding consensus,” Kaminsky told MarketWatch. “We don’t see antitrust as a huge White House focus in a Biden presidency,” financial analysts at Beltway political newsletter Height Commentary wrote, adding that they would expect Biden’s appointees at the Justice Department and FTC “to take a much more aggressive stance than past administrations.” The X-factor could be Warren, who as a presidential candidate loudly advocated for the breakup of Facebook and Google. Whether as a member of a Biden administration, or in her current role in a Democratic-controlled Senate, Warren has shown no hesitancy in advocating drastic measures. “Americans all across the country are seeing how Big Tech has used its massive power to harm our economy and our democracy,” Warren said in a statement to MarketWatch. “When Democrats win in 2020, it should be a top priority for us to stop these giants from rigging the rules in their favor and against everyone else.” The tone and rancor of a recent three-and-a-half-hour meeting with a Google executive illustrates how much has changed in an increasingly soured relationship between Silicon Valley and the Beltway. Trillion-dollar valuations and record revenue and profits by its biggest names — compounded by competitors’ claims of monopolistic business behavior and consumer outcry over privacy violations and misinformation — has turned both major political parties against the industry. “You are in the thankless task of defending the indefensible. Google deserves antitrust action. It has been a stunning abuse of market power,” Blumenthal told Donald Harrison, president of global partnerships and corporate development at Google, during a Sept. 15 committee hearing entitled, “Stacking the Tech: Has Google harmed competition in online advertising?” An imminent Justice Department antitrust action against Google “could be the beginning of a reckoning in antitrust laws,” Klobuchar said. “I just want our capitalistic system to work. You simply can’t have one company dominate this market.” Read more: Antitrust questions bruise but don’t break Big Tech CEOs in historic hearing “Democrats would intensify the momentum [of antitrust actions] on Facebook, Google, and Amazon,” Bhaskar Chakravorti, dean of global business at the Fletcher School at Tufts University, told MarketWatch. “It would be a continuation of the late-summer hearings. Those three companies are in the crosshairs. Apple is a little bit to the side.” One company with an especially large target is Facebook, the subject of scathing comments from Klobuchar in her presidential campaign kickoff event in Minnesota in February. “We need to put digital rules in the law to protect privacy,” said Klobuchar, an ardent critic of Facebook who is also co-author of a data-privacy bill. “For too long, the big tech companies have said, ‘Don’t worry, we have your back.’” Klobuchar’s animus toward Facebook could receive support from a theoretical Biden Administration. The former vice president called Facebook “the nation’s foremost propagator of disinformation about the voting process” last month in a letter to Facebook CEO Mark Zuckerberg. Not everyone is convinced a Blue Wave will translate into punitive actions against some of the world’s most-valuable companies. Paven Malhotra, a Silicon Valley lawyer who specializes in intellectual property, told MarketWatch that “a Democratic president and Senate is unlikely to make tech a high priority.” “They will continue a DOJ action against Google, I imagine, but it may get lost with actions to reverse actions over the past four years on health care, education policy, trade, climate change and everything else.”"}]}