{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-boosted-as-hurricane-sally-approaches-us-gulf-coast-2020-09-15", "published": 1600183520.0, "headline": "Oil prices finish higher as Hurricane Sally disrupts Gulf of Mexico energy production", "body": "Oil futures got a lift Tuesday as Hurricane Sally neared landfall, forcing the shutdown of more than a quarter of offshore Gulf of Mexico crude production and a number of refineries. Rising worries over energy demand served to limit the upside for oil prices, prompting them to finish off the day’s best levels. The center of Hurricane Sally is expected to pass near the coast of southeastern Louisiana Tuesday and make landfall late in the day or early Wednesday, the National Hurricane Center said in a Tuesday afternoon update. “Historic, life-threatening flash flooding is likely” along portions of the northern Gulf Coast. The Bureau of Safety and Environmental Enforcement on Tuesday estimated that 26.87% of oil production in the Gulf of Mexico has been shut in, along with 28.03% of natural-gas production. Reuters reported that the Phillips 66 PSX, -1.11% Alliance oil refinery, which processes 255,600 barrels a day of oil closed on Monday, while Shell RDS.A, +0.83% cut production to minimum rates at its 227,400 barrel-a-day refinery in Norco, Louisiana. “The current weather system can potentially shut down as much as 1 million barrels of oil per day, mainly in the Mississippi Canyon area,” according to a report from Rystad Energy Tuesday. As opposed to the previous evacuation tied to Hurricane Laura in late August, “we only expect this situation to last for a couple of days before redeployment and restart begins.” The report said the current estimate for the total outage associated with Sally is between three million and six million barrels of oil over approximately 11 days. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 rose $1.02, or 2.7%, to settle at $38.28 a barrel on the New York Mercantile Exchange, while November Brent crude BRN.1, -0.07% UK:BRNX20, the global benchmark, rose 92 cents, or 2.3%, to $40.53 a barrel on ICE Futures Europe. Among the products, October gasoline US:RBV20 settled at $1.1381 a gallon, up 2.8%, while October heating oil US:HOV20 added 0.5% to $1.0993 a gallon. October natural gas US:NGV20 rose nearly 2.3% to $2.362 per million British thermal units. Still, worries remain over the outlook for oil demand were fed by a report from the International Energy Agency on Tuesday which showed expectations for a fall of 8.4 million barrels this year in global oil demand to 91.7 million barrels a day. That marks a contraction of 300,000 barrels a day more from last month’s report. “Oil producers will continue to have to align their output strategies with the hesitant recovery in demand well into 2021,” said Cailin Birch, global economist at The Economist Intelligence Unit, in emailed commentary. Oil consumption had already been slowing considerably in the euro zone and Japan “prior to the onset of the pandemic, and in line with moderating GDP and greater energy efficiency,\" she said. “Major emerging markets, and particularly China, offer the only real bright spots for 2020,” Birch said. “China’s oil consumption rebounded in the second quarter, as its lockdown measures were lifted, bringing consumption back on a par with pre-coronavirus levels.” “We still expect overall demand in China to fall by about 1.5% in the full-year compared with 2019. However, China will be the main source of demand growth in 2021,” she said. The Organization of the Petroleum Exporting Countries, or OPEC, on Monday again cut its 2020 demand outlook and cut its 2021 demand-growth forecast, citing the continued effects of the COVID-19 pandemic. OPEC and its allies, a group known as OPEC+, isn’t expected to make any changes when members of a joint committee meet Thursday to discuss its existing program of output cuts. Analysts see room for tension amid recent pressure on prices though. “While Saudi Arabia is appealing for rigorous compliance with the quotas and is threatening rebel members with a price war, growing resentment is evident even among its traditional allies, the UAE (United Arab Emirates) and Kuwait,” wrote analysts at Commerzbank. “And if this is the case, what is the situation going to be like in countries such as Iraq, Angola or Nigeria, which are not as economically and financially solid as the Gulf states? Sentiment could hardly be worse ahead of Thursday’s meeting. Yet it is not only the status quo that needs to be maintained – actually more pronounced cuts will be needed from October, for demand is considerably weaker than anticipated, according to yesterday’s OPEC monthly report,” they said. Weekly updates on U.S. petroleum supplies are due out from the American Petroleum Institute late Tuesday and from the Energy Information Administration early Wednesday. On average, analysts expect domestic crude-oil supplies for the week ended Sept. 11 to show a decline of 1.8 million barrels, according to a survey conducted by S&P Global Platts. Gasoline supplies are forecast to drop 7 million barrels for the week, while distillates, which include heating oil, are seen climbing by 500,000 barrels."}]}