{"article": [{"url": "https://www.marketwatch.com/story/fisker-is-going-public-five-things-to-know-about-the-electric-car-maker-ahead-of-its-ipo-2020-07-14", "published": 1595073920.0, "headline": "Fisker is going public: Five things to know about the electric-car maker ahead of its IPO", "body": "Electric-car maker Fisker Inc. is hoping to ride twin waves of investor interest in electric vehicles and blank-check companies to get its first vehicles onto roads in a couple of years. Fisker and Spartan Energy Acquisition Corp. SPAQ, +4.73%, a special purpose acquisition corporation, or blank-check company backed by Apollo Global Management Inc. APO, -0.85% announced their merger on Monday. The deal valued Fisker at $2.9 billion and it is expected to close in the fourth quarter. Fisker said it had a net loss attributable to shareholders of $10.4 million in 2019, compared with a net loss of $4.7 million in 2018. It had $1.9 million in cash and cash equivalents last year. Fisker’s IPO is “timely” as it is taking advantage of Tesla Inc. TSLA, +1.89% share rally “and the PR blitz” of electric-truck maker Nikola Corp. NKLA, -1.36%, said David Kudla, CEO of Mainstay Capital Management. “Going public through a SPAC allows the company to raise proceeds in a timely and cost efficient manner,” he said. “Whether or not Fisker can become profitable and cash flow positive with a $40,000 EV SUV remains to be seen.” SPACs are companies that don’t have an actual business until they acquire one or more. Here are five things to know about Fisker:‘Sky high’ investor interest in clean energy and blank-check companies Fisker's journey to becoming a public company comes on the heels of the success of Nikola, which also came to public markets through a SPAC. Nikola shares have gained 410% this year. Others taking a similar route include electric-truck maker Hyliion Inc., which in late June announced a merger with Tortoise Acquisition Corp. US:SHLL, with the newly combined company remaining listed on the New York Stock Exchange under a new ticker. Outside the car sector, online sports-gambling company DraftKings Inc. DKNG, -4.51% also went public through a merger with a blank-check company. Besides the heightened interest in blank-check companies, there’s “sky high” sentiment for clean energy, analysts at Evercore ISI said in a recent note. That’s evidenced by Tesla Inc.’s meteoric share rise and almost equal rallies for shares of other EV and EV-adjacent companies, such as China’s Nio Inc. NIO, +0.14% and Plug Power Inc. PLUG, +3.07%, as well as the drumbeat of automobile SPACs, they said. “What’s clear is EV capital is now abundant,” the analysts said. Before Fisker, there was Karma, and before that there was Fisker too Fisker had an earlier life as privately held Fisker Automotive, which went bankrupt in 2013 after six years in business. The company’s assets were acquired by Chinese auto parts maker Wanxiang Group in 2014. Wanxiang also owned battery maker A123 Systems, which supplied batteries to Fisker. A123 Systems also went bankrupt and hastened the demise of the old Fisker. Wanxiang relaunched and renamed the company Karma Automotive, the name of the former Fisker’s first and only car, a luxury plug-in hybrid that was first marketed in 2011. Karma has attempted to gain some traction in the years since, and it has revamped and renamed the car the Revero. The founder of Fisker Automotive, legendary Danish designer Henrik Fisker, had resigned from the company amid board infighting just before the bankruptcy. But he retained some brand rights and went on to found Fisker Inc.‘Legendary’ automobile designer Fisker, the man, is best known for designing luxury vehicles for companies such as Ford Motor Co. F, -1.36%, BMW AG BMW, -1.55%, and Aston Martin Lagonda Global Holdings PLC ARGGY, +4.47% Fisker is “a proven designer with a history of developing legendary vehicles,” the company said in its prospectus. He also brings an “expert management team” to Fisker Inc., the company said. “The right team, combined with deep financial resources provided by this transaction, further position the company to succeed in a rapidly growing industry.” Fisker has said its “‘emotional design’ will be the way his vehicles stand out in a crowded EV market,” Mainstay’s Kudla said. IPO proceeds will be used to get the Fisker Ocean on the road Fisker will use the proceeds of the IPO to develop the Fisker Ocean, which is expected to be available in late 2022. The company is promising a “premium yet affordable” SUV with a starting price of $37,500, and as much as $69,000 for a higher-end model; by comparison, the Model Y, Tesla’s compact SUV, starts at $49,990. The company says the Ocean is “a fully electric SUV with premium styling and features and has been designed to be the world’s most sustainable vehicle.” The five-seat vehicle was first showcased at CES in January. Fisker will sell the Ocean outright and also offer it through what it calls a “flexible lease.” Unlike regular, fixed-term leases, drivers can return the car after one month, several months, or several years, with no long-term contracts, and 30,000 miles per year included in the lease, rather than the more usual 15,000 miles or so. The Ocean has a range of up to 300 miles between charges. The car’s interior is also billed as “vegan,” using plastic, with not a piece of leather in sight. Over the years, some Tesla shareholders advocated for leather-free, “vegan” Teslas, and the company has started offering those “vegan” Teslas. Fisker hopes to partner with Volkswagen Fisker said it has been in talks with Volkswagen AG VOW3, -0.23% to use the German auto maker’s EV platform. That partnership is “under negotiations,” but terms are worked out and an official announcement is expected in the second half of the 2020, Fisker said. The companies signed an MOU for the platform sharing in November 2017. That sharing arrangement would allow Fisker to enter the market in half the time and with “substantially reduced” costs, Fisker said in an investor presentation. Volkswagen could also supply parts and components to Fisker, giving the company access to Volkswagen’s deep supply chain and all the pricing and quality advantages that comes with it. Perhaps having learned a lesson from the A123 Systems debacle, Fisker said it also plans to tap into Volkswagen’s battery supply, reaping the benefits of “one of the world’s largest battery procurement supply contracts.” What comes after the Ocean SUV? The Emotion, a luxury sedan, is waiting in the wings, with no firm launch date yet. The Emotion has had a longer life, however, than the Ocean. It was unveiled at CES 2018 and like the Karma years before it, the Emotion has been hailed as the one to give the Tesla Model S a run for its money. Fisker said it aims to use “new electrification technology that is currently in development” in the Emotion, without offering further details. The company is going public at a strong time for the IPO market. The Renaissance IPO ETF IPO, +1.98% has gained 36% in the year to date, while the S&P 500 index SPX, +0.87% has fallen 1.5%."}]}