{"article": [{"url": "https://www.marketwatch.com/story/amazon-looks-to-open-1-500-small-warehouses-in-u-s-suburbs-report-11600305391", "published": 1600291520.0, "headline": "Amazon looks to open 1,500 small warehouses in U.S. suburbs: report", "body": "While Amazon looks to pad its real estate portfolio, it’s not interested in abandoned department store space, according to the report. AFP via Getty Images Amazon.com Inc. aims to open as many as 1,500 small warehouses across the U.S. — many of them in suburban locations — as it raises the stakes in its battle against Walmart, according to report. The Seattle-based retail giant, which was caught flat-footed during the pandemic when it couldn’t keep up with demand for basic items like toilet paper and milk, is ramping up its delivery capabilities with more hubs in cities and suburbs, according to a Bloomberg report. Amazon AMZN, +3.01% chief executive Jeff Bezos is investing billions in these new warehouses and in improving the company’s transportation capabilities, Bloomberg said. As demand for online goods surged in the early days of the pandemic, Amazon struggled fulfill its two-day delivery promise to Prime members. But it has since hired 175,000 workers who have gotten the company back on track. Walmart WMT, +1.00% and Target TGT, +1.14% have also upped their game with same-day delivery via their vast network of stores, with Walmart recently launching Walmart Plus, its answer to Amazon Prime. Walmart Plus costs $21 less than Amazon’s $119 yearly subscription price, but requires a $35 purchase minimum for free delivery. While Amazon looks to pad its real estate portfolio, it’s not interested in abandoned department store space, according to the report. Struggling department stores that are closing sites, including JCPenney, are an “option of last resort” for the Seattle-based giant, according to the report, which cited anonymous sources. In the New York metro area, Amazon bought two former Fairway Market stores in New Jersey, but it’s unclear what those spaces will be used for as Amazon did not disclose that information in court filings in the Fairway bankruptcy case. This report originally appeared on NYPost.com."}]}