{"article": [{"url": "https://www.marketwatch.com/story/stock-index-futures-point-to-mixed-start-after-another-round-of-records-for-sp-500-nasdaq-2020-08-26", "published": 1598460740.0, "headline": "S&P 500 and Nasdaq end at fresh records as Amazon, Netflix and Tesla stocks soar", "body": "Stocks ended sharply higher Wednesday, powered by shares of technology and e-commerce shares, amid news of progress on coronavirus vaccine trials and expectations for the Federal Reserve to signal it will keep monetary policy easy in a speech by Chairman Jerome Powell on Thursday. How are major benchmarks trading? The Dow Jones Industrial Average DJIA, +0.56% closed up 83.48 points, or 0.3%, to end at 28,331.92; while the S&P 500 SPX, +0.87% pushed 35.11 points, or 1%, higher, to close at 3,478.73. The Nasdaq Composite Index COMP, +1.39% finished at 11,665.06, up 198.59 points for a gain of 1.7%. The S&P 500 scored its 18th record close of the year and the Nasdaq marked its 39th all-time closing high of 2020. Meanwhile, the Dow closed within 1% of going positive for the year after the coronavirus-induced turbulence in March. The blue-chip benchmark also stands 4.1% from its Feb. 12 record closing high at 29,551.41, according to FactSet data. The Nasdaq-100 index NDX, +1.51%, composed of the biggest constituents in the Nasdaq by market value, surged by 2.1% to a record at 11,971.94, while the small-capitalization oriented Russell 2000 RUT, +0.55% declined 0.7% at 1,560.19. What’s driving the market? Technology-related names surged Wednesday, powered primarily by Tesla Inc., Amazon.com and Netflix, extending a stratospheric run-up for large-cap tech and online-based companies. Shares of Salesforce.com Inc. CRM, +2.21% surged nearly 26%, also helping to underpin appetite for the tech names after the cloud-based customer-relationship-management company announced quarterly results late Tuesday that topped forecasts as its revenues hit $5 billion for the first time. The company also was benefiting from Monday’s announcement by S&P Dow Jones Indices that it would be among a trio of companies to be included in the Dow, effective Monday. The rally for equities comes ahead of a potentially market-moving speech from Powell, who will deliver a webcast address to the annual Jackson Hole gathering of central banks Thursday morning. He’s expected to outline changes to the Fed’s policy framework that would allow inflation to run hotter than in the past, ending the Fed practice of hiking interest rates at the first whiff of rising price pressures. However, it is too soon to know what additional steps the Federal Reserve can take to help the economy continue to recover from the sudden lock down in March and April, said Kansas City Fed President Esther George on Wednesday. Investors may also be looking for clues to the potential for additional action by the Fed in terms of monetary stimulus, particularly if the White House and congressional Democrats remain deadlocked on a new coronavirus aid package, said Charalambos Pissouros, senior market analyst at JFD Group. A falling trend in the number of new coronavirus infections in the U.S. and optimism over prospects for a vaccine and other COVID-19 treatments have been credited with pushing stocks to new highs, but analysts said equities might struggle to extend the rise without fresh impetus. Some fear that investors are nearing a “euphoria” stage that could herald a near-term pullback. Carlos Diez, founder and CEO of MarketGrader, agreed with that sentiment. “There’s a lot of euphoria around the large cap names and that gives me a little bit of pause about what might happen in the near term,” Diez told MarketWatch. Still, he said, “We have one of the biggest tailwinds in the history which is the massive, massive monetary stimulus globally. It’s hard to argue against risk assets when there’s so much liquidity sloshing around. Over the next six to nine months I don’t expect a major downturn.” Unlike some market participants, Diez doesn’t think another round of fiscal stimulus is needed — or priced in. “I think investors are probably starting to worry a little bit about the fiscal situation and what happens after all this is over.” See:The market is tuning out coronavirus, so stocks will head higher until there’s another reason to stop, one analyst says In U.S. economic data, orders for durable goods rose 11.2% in July helped by a 22% surge in automobile demand. Economists surveyed by MarketWatch were looking for a 4.8% rise after a 7.6% jump in June. Which companies are in focus? Autodesk Inc. ADSK, +1.36% shares declined 1.6%, despite earnings and revenue that beat estimates. Shares of Intuit Inc. INTU, +2.03% rose 1.8% after the maker of tax, accounting and small-business software said delayed tax-filing deadlines helped it top forecasts for its fiscal fourth-quarter earnings and revenue. Dick’s Sporting Goods Inc. DKS, -1.09% shares rocketed nearly 16% after the retailer reported a 194% e-commerce sales surge in Q2 and said Q3 is off to a good start. Apple Inc. AAPL, +1.74% shares rose 1.4% after a price target increase to $600, the highest among Wall Street analysts and a nearly 20% gain from current trading levels. Shares of Tesla Inc. TSLA, +1.89% pushed past the $2,150 mark, up 6.4%, after a price target upgrade, to $2,500. Hewlett Packard Enterprise Co. HPE, -1.80% shares rose 3.6% one day after reporting earnings that beat expectations. Shares of Moderna Inc. MRNA, +0.09% gained 6.4% on Wednesday after a company executive told a government advisory committee that its experimental COVID-19 vaccine had triggered antibodies in elderly patients. Shares of Netflix NFLX, +1.43% rose 11.6% higher, near its highest level since July 10 and on track for its best one-day percentage gain since January of 2019. Amazon.com shares AMZN, +3.01% climbed 2.9% end near the top of the Nasdaq-100. How are other markets trading? The Stoxx Europe 600 SXXP, +0.55% finished Wednesday trade up 0.9%, while U.K.’s FTSE 100 benchmark UKX, +0.64% rose 0.1%. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% TMUBMUSD10Y, 0.777% rose 0.6 basis point to 0.686% as traders readied for a round of new issuance. Bond prices move inversely to yields. Gold futures GCZ20, +2.17% jumped 1.5% to settle at $1,952.50 an ounce, partly helped by expectations for a dovish stance from Powell. Oil futures CL.1, -1.62% inched up by 4 cents, or less than 0.1%, to settle at $43.39 a barrel on the New York Mercantile Exchange. as the U.S. Gulf Coast braced for Hurricane Laura and potential damage to the region’s energy infrastructure. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the currency versus a basket of six major rivals, was fractionally lower, near 93.02. Read: Is the stock market more important to the economy than the $600 unemployment benefit?"}]}