{"article": [{"url": "https://www.marketwatch.com/story/the-trump-administration-wants-to-discourage-your-401k-from-including-esg-investment-options-2020-09-07", "published": 1599585560.0, "headline": "The Trump administration wants to discourage your 401(k) from including ESG investment options", "body": "Two proposed rulemakings from the Labor Department in the past eight weeks would largely gut sustainable investing options and strategies in retirement plans. These proposals would reverse the Labor Department’s 2015 and 2016 guidance while ignoring the growing consensus among academics, retirement plan fiduciaries and professional money managers that responsible companies are likely to outperform over the long haul. The first measure, “Financial Factors in Selecting Plan Investments,” now in the late stages of the approval process, would discourage 401(k) and other qualified retirement plans from offering funds from managers that consider environmental, social and governance (ESG) factors in their due diligence. The proposal establishes burdensome requirements for analysis and documentation around inclusion of ESG options. The Labor Department currently has no such requirements for any other kinds of funds. Support for the measure has been decidedly underwhelming. A group of investor organizations and financial firms analyzed the more than 8,700 public comments on the proposed rule and found that only 4% of comments expressed support. Some 95% of the comments — across individuals, investment-related groups and non-investment-related groups — were strongly opposed, and 1% expressed neutral views or didn’t clearly express support or opposition. The 30-day public comment period ended on July 30 and the Labor Department is likely to implement the proposal before the end of the year. The second proposal, “Fiduciary Duties Regarding Proxy Voting and Shareholder Rights,” which was announced at the end of August, would restrict the ability of retirement plans to hold company leadership accountable through proxy voting. It alleges that proxy measures are onerous for public companies. A fundamental misunderstanding The reasoning betrays a fundamental misunderstanding of how financial professionals consider ESG criteria in their investments and how proxy voting practices enhance long-term value of investments. Because of inconsistent corporate disclosure rules, investors often file proxy proposals to receive relevant ESG information. Both proposals represent a solution in search of a problem. They imply that investment managers and plan fiduciaries promote social goals over sound investment analysis, but proponents fail to cite a single instance that this has happened or any related enforcement actions they have taken. Moreover, the agency doesn’t acknowledge any of the dozens of studies that demonstrate that consideration of ESG issues may lead to better investment outcomes. Morningstar found that during the stock collapse in the first quarter of 2020, all but two of 26 ESG indexes suffered fewer losses than their conventional counterparts. Studies of longer periods from Morgan Stanley and MSCI have found no financial trade-off in the returns delivered by ESG funds relative to traditional funds. Additionally, a 2018 report from the Government Accountability Office (GAO) reported that 88% of the academic studies it reviewed found a neutral or positive relationship between the use of ESG information and financial performance. Setting aside the academic debates over ESG, the market has already spoken. As of 2018, more than one of every four dollars under professional management was invested using ESG criteria, according to the US SIF Foundation’s 2018 Report on U.S. Sustainable, Responsible and Impact Investing Trends. Morningstar has reported that in 2020, flows into sustainable funds outpaced traditional funds. Read:Sustainable-investing flows have smashed records in 2020. What’s going on? Far from making a concession to ESG, professional money managers increasingly analyze ESG factors precisely because of risk, return and fiduciary considerations. They know that bad policies and practices can harm companies’ reputations, affect consumers and lead to stock-price declines. Climate change is widely recognized as an environmental and financial risk for companies. Similarly, companies that fail to promote racial equity face real and meaningful challenges. Investors are coming to recognize that companies with better policies and practices and more robust corporate governance will outperform over the long term. A 2018 US SIF Foundation survey of U.S. sustainable investment money managers with aggregated assets of more than $4 trillion found that three-quarters of the respondents employ ESG criteria to improve returns and minimize risk over time, and 58% cited their fiduciary duty as a motivation. “ In 2020, flows into sustainable funds outpaced those into traditional funds. ” The Labor Department’s proposals would largely supplant an existing regulatory regime that was already working. In 2015 and 2016, President Obama’s Labor Department carefully considered these issues and issued Interpretive Bulletins clarifying that fiduciaries of ERISA-governed retirement plans “do not need to treat commercially reasonable investments as inherently suspect or in need of special scrutiny merely because they take into consideration environmental, social, or other such factors.” The second Interpretive Bulletin recognized that shareholder rights, including voting proxies, are important to long-term shareholder value and consistent with fiduciary duty. These new proposals are not taking place in a vacuum. They are part of the Trump administration’s broader effort to generate barriers to investment practices that have a focus on environmental, social or governance issues. The Securities and Exchange Commission is currently seeking to create its own barriers on this topic, including the role of proxy voting firms, fund names and shareholder rights. By tipping the scales against consideration of ESG criteria when selecting investments and against the use of proxies to encourage better governance and better disclosure, the Labor Department proposals prevent plan sponsors from fulfilling their fiduciary obligation. It should retain current practices related to the utilization of ESG criteria and proxy voting. Lisa Woll is CEO of US SIF: The Forum for Sustainable and Responsible Investment. Follow her @LisaWoll_USSIF. Judy Mares is former deputy assistant secretary in the Labor Department."}]}