{"article": [{"url": "https://www.marketwatch.com/story/the-police-officer-crying-in-that-viral-egg-mcmuffin-video-wants-you-to-know-shes-sick-of-people-being-mean-2020-06-19", "published": 1592641220.0, "headline": "The police officer crying in that viral Egg McMuffin video wants you to know sheâ\u0080\u0099s â\u0080\u0098sick of people being meanâ\u0080\u0099", "body": "Sheâ\u0080\u0099s not â\u0080\u009cStaceyâ\u0080\u009d or â\u0080\u009cOfficer Karenâ\u0080\u009d or â\u0080\u009cMolly McMuffinâ\u0080\u009d â\u0080\u0094 her name is Stacy Talbert. And the jokes and comments at her expense over the past week just reinforce the reason she recorded her viral video, she says. â\u0080\u009cEverybody lost the whole point of the video,â\u0080\u009d Talbert, a sheriffâ\u0080\u0099s deputy in McIntosh County, Ga., told NBC News. â\u0080\u009cIâ\u0080\u0099m just so sick of people being mean.â\u0080\u009d Talbertâ\u0080\u0099s tearful 2Â½-minute clip accusing the staff at her local McDonaldâ\u0080\u0099s MCD, -0.43% of withholding her breakfast order because sheâ\u0080\u0099s a cop â\u0080\u0094 and possibly even tampering with it â\u0080\u0094 went viral on Twitter TWTR, -0.23% Â on Wednesday. It racked up millions of views and tens of thousands of comments, and came on the heels of NYPD officers accusing Manhattan Shake Shack workers of spiking their milkshakes with bleach earlier this week. (The NYPDâ\u0080\u0099s Chief of Detectives later said there was â\u0080\u009cno criminalityâ\u0080\u009d involved.) Both fast food incidents have served to further highlight the growing tension between police officers and the communities they serve, as well as the backlash against police and the widespread protests against racial injustice and police brutality in the weeks since Breonna Taylor, George Floyd and Rayshard Brooks were killed during their encounters with law enforcement. Read more:This video of a tearful Georgia police officer accusing McDonaldâ\u0080\u0099s of withholding her Egg McMuffin order on purpose has gone viral Talbert revealed that she recorded herself breaking down outside of the McDonaldâ\u0080\u0099s restaurant in Richmond Hill, Ga. in a Facebook Live video FB, +0.26% Â on Monday morning after she had finished an overnight shift. And she told the Comcast-owned CMCSA, -0.99% Â news channel that she was frustrated, not afraid. â\u0080\u009cItâ\u0080\u0099s not that people are waiting in the wings to hurt us. Itâ\u0080\u0099s that people donâ\u0080\u0099t trust us,â\u0080\u009d she said, adding that sheâ\u0080\u0099s been to that McDonaldâ\u0080\u0099s more than 100 times and has always been well-treated there. But she also noted that she has felt more suspicious in general. â\u0080\u009cI just wanted to share that I hurt, too,â\u0080\u009d she said. “ â\u0080\u009cIf [officers] donâ\u0080\u0099t feel compassion or emotion, if they donâ\u0080\u0099t cry over anything, I promise you that is not the officer that you want on the street.â\u0080\u009d ” Talbert struck a different tone with BuzzFeed News, however, claiming that her McDonaldâ\u0080\u0099s experience on Monday felt â\u0080\u009csketchy.â\u0080\u009d â\u0080\u009cIâ\u0080\u0099m not going to accuse anyone, but it was sketchy,â\u0080\u009d she said. Talbertâ\u0080\u0099s video, which went viral on Twitter when it was posted by a conservative, pro-Trump account that has since been deleted, was viewed more than 10 million times on Facebook before it jumped to Twitter. It features Talbert explaining that she placed a mobile order for an Egg McMuffin meal. But her order wasnâ\u0080\u0099t ready when she went to pick it up. â\u0080\u009cAnd Iâ\u0080\u0099m waiting. And Iâ\u0080\u0099m waiting. And Iâ\u0080\u0099m waiting,â\u0080\u009d she says. She was told to pull over to the side, and an employee eventually came over and gave her a coffee. But Talbertâ\u0080\u0099s order was supposed to include an Egg McMuffin and a hash brown, as well. â\u0080\u009cThatâ\u0080\u0099s all she hands me is the coffee,â\u0080\u009d she says, breaking down into tears. â\u0080\u009cI said, â\u0080\u0098Donâ\u0080\u0099t bother with the food because right now Iâ\u0080\u0099m too nervous to take it!â\u0080\u0099 It doesnâ\u0080\u0099t matter how many hours Iâ\u0080\u0099ve been up. It doesnâ\u0080\u0099t matter what Iâ\u0080\u0099ve done for anyone. Right now, Iâ\u0080\u0099m too nervous to take a meal from McDonaldâ\u0080\u0099s because I canâ\u0080\u0099t see it being made!â\u0080\u009d She didnâ\u0080\u0099t clarify her suggestion that the McDonaldâ\u0080\u0099s staff was tampering with her food, telling BuzzFeed on Thursday that, â\u0080\u009cI am telling you I have no idea of that, and I didnâ\u0080\u0099t take it to find out.â\u0080\u009d Related:On Juneteenth, a look back at how America perfected the â\u0080\u0098art of demonizing black menâ\u0080\u0099 The restaurantâ\u0080\u0099s franchisee owners, Gary and Jill Stanberry, told MarketWatch by email on Wednesday that they have apologized to Talbert. â\u0080\u009cWe are happy to report that the officer was never denied service and also shared positive feedback on the employee with whom she interacted,â\u0080\u009d they said. Talbert told BuzzFeed that Jill Stanberry had asked her to take down her video on Facebook, but she refused because â\u0080\u009citâ\u0080\u0099s done so much good.â\u0080\u009d It certainly sparked a heated online debate, with supporters sympathetic to the pressures and anxieties that many working in law enforcement are facing amid the backlash. But critics blasted what they deemed as an overreaction over a breakfast sandwich at a time when the nation is grappling with a pandemic and reckoning with racism and police brutality. Some questioned whether she was capable of serving as an officer. Her response: â\u0080\u009cI was hired by my sheriffâ\u0080\u0099s office to do a job, and they knew when they hired me that I was stable enough to do the job without an issue and Iâ\u0080\u0099ve been doing the job for 15 years,â\u0080\u009d she told BuzzFeed. As for her tears: â\u0080\u009cIt was exactly how every single officer feels, and if they donâ\u0080\u0099t feel compassion or emotion, if they donâ\u0080\u0099t cry over anything, I promise you that is not the officer that you want on the street.â\u0080\u009d “ â\u0080\u009câ\u0080\u0098Cop Karenâ\u0080\u0099 â\u0080\u0094 whoever did that, thatâ\u0080\u0099s funny.â\u0080\u009d ” As for the jokes calling her â\u0080\u009cOfficer Karenâ\u0080\u009d and the like â\u0080\u0094 â\u0080\u009cKarenâ\u0080\u009d has become a slang term for the stereotype of an entitled, privilege white woman â\u0080\u0094 she said sheâ\u0080\u0099s laughed at them. â\u0080\u009cItâ\u0080\u0099s actually kind of funny,â\u0080\u009d she told NBC. She sounded even more amused while speaking with BuzzFeed. â\u0080\u009cIâ\u0080\u0099m not bitching. I think that s---â\u0080\u0099s funny,â\u0080\u009d she said. â\u0080\u009câ\u0080\u0098Cop Karenâ\u0080\u0099 â\u0080\u0094 whoever did that, thatâ\u0080\u0099s funny. â\u0080\u0098Molly McMuffin,â\u0080\u0099 someone called me. Thatâ\u0080\u0099s funny! Iâ\u0080\u0099d make money if I was that funny.â\u0080\u009d"}]}