{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-climbs-above-429-million-as-texas-becomes-fourth-state-with-more-than-400000-cases-2020-07-28", "published": 1595949380.0, "headline": "Coronavirus update: U.S. case tally climbs above 4.30 million as Texas becomes fourth state with more than 400,000 cases", "body": "The U.S. tally for confirmed cases of the coronavirus illness COVID-19 climbed above 4.30 million on Tuesday, and the death toll exceeded 148,000, after Texas became the fourth state with more than 400,000 cases, joining California, Florida and early hot spot New York. The U.S. counted another 1,000 COVID-19 fatalities on Monday for a sixth straight day, according to data aggregated by Johns Hopkins University. The virus continues to spread in the South and West and governors are responding in different ways. Kentucky Gov. Andy Beshear, a Democrat, said he would conform with the advice offered by White House Task Force coordinator Dr. Deborah Birx over the weekend to close bars again and limit gatherings. Kentucky has 27,601 confirmed cases of the virus and 709 people have died, according to the state health department. Birx recommended that Indiana, Ohio, Tennessee and Virginia also close down bars and reimpose restrictions on movement. Tennessee Gov. Bill Lee, a Republican, said he has no intention of doing so and would not give local mayors the authority to take the action themselves. President Donald Trump, who last week appeared to reverse course on wearing face masks and to be taking a new approach to the pandemic that would acknowledge the risks facing Americans, appeared to revert to form late Monday. Trump tweeted out clips of a video showing a group of doctors making a series of false and misleading claims about the virus after the video was removed by Facebook FB, +0.26%. The video claimed that face masks and lockdowns are not needed to contain the deadly illness and touted the use of hydroxychloroquine as a treatment. The anti-malarial drug has been determined to be ineffective in multiple trials, but Trump continues to promote it, contradicting the advice of his own public health experts. Twitter TWTR, -0.23% and Google’s YouTube GOOGL, +1.82% GOOG, +1.97% also deleted the video, which was promoted by the right-wing site Breitbart News. Twitter added a note to its trending topics warning about the dangers of hydroxychloroquine, which can cause cardiac problems. The video was viewed thousands of times before it was deleted, according to media reports. See:Twitter suspends Donald Trump Jr.’s account for 12 hours over hydroxychloroquine tweet There are still 30 states seeing rising cases of COVID-19 over the last 14 days, according to a New York Times tracker. There was positive news for Florida, Louisiana and Alabama, which are showing new cases roughly flat, the tracker shows. Just three states, Arizona, Utah and Vermont, and the U.S. Virgin Islands, are showing cases declining over the last two weeks. The number of hospitalizations also rose above 59,000 on Monday, according to the COVID Tracking Project. There are currently 59,023 COVID-19 patients in hospitals, edging back toward the record of 59,940 set on April 15. A new Axios-Ipsos poll found that 46% of Americans know someone who has tested positive for COVID-19, and about half of those, or 23%, know someone in their own community. A full 75% of those polled said other people’s behavior is making things worse. Other findings include that of the roughly half of those who saw friends or family in the past week, or 44%, just one in five report wearing a face mask or social distancing. In a sign of the anti-science mood undermining health experts’ efforts to contain the virus, the survey found three in five Americans view taking the first COVID-19 vaccine as soon as one is available to be a moderate or large risk. Latest tallies There are now 16.5 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data show, and 655,300 people have died. At least 9.6 million people have recovered. Brazil is second to the U.S. with 2.4 million cases and 87,618 deaths. India is third measured by cases at 1.5 million, followed by Russia with 822,060 and South Africa with 452,529. The U.K. has 302,290 cases and 45,963 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 86,889 cases, and 4,656 fatalities. Fresh clusters in Europe are leading several countries to warn of non-essential travel to parts of Spain. Germany became the latest to warn holidaymakers of the risks of being infected in certain regions of Spain, joining the U.K. and Norway, which are asking returning travelers to self-quarantine when they get home. See: U.K., other European countries caution against Spain travel as virus rebounds Iran reported 235 new deaths from the virus on Tuesday, a record one-day toll, AFP reported.What’s the latest medical news? Pfizer Inc. and BioNTech SE BNTX, +1.23% said late Monday they have also started a late-stage clinical trial for one of their COVID-19 vaccine candidates, involving 30,000 people around the world. The news came just hours after Moderna Inc. MRNA, +0.09% announced the start of its phase 3 trial of its vaccine candidate. Pfizer and BioNTech’s vaccine candidates have triggered T-cell responses in participants in addition to neutralizing antibody titers, and one of them is moving forward to the larger trial. A T-cell response is thought to be critical in order for the human body to develop immunity to the novel coronavirus, and the Pfizer-BioNTech candidates and an AstraZeneca PLC AZN, +1.16% AZN, +0.63% candidate were the first vaccine candidates to show some response on the T-cells, a key component of the human body’s immune system. Fauci said Monday he remains “cautiously optimistic” about the Moderna trial, which is being conducted along with his agency, the NIAID. In an interview with CNN, Fauci said it will take several months to determine whether the vaccine works. However, “To go from not even knowing what the virus was in early January to a Phase 3 trial is really record time,” he said. Fujifilm Holdings Corp. 4901, -0.21% said it will receive federal funding from the Biomedical Advanced Research and Development Authority to help manufacture COVID-19 vaccines. The Operation Warp Speed contract was granted to the Texas A&M System, which then subcontracts with Fujifilm Diosynth Biotechnologies, for $265 million. The Fujifilm subsidiary had previously announced a manufacturing deal with Novavax Inc. NVAX, +0.18%, one of the other companies developing a COVID-19 vaccine candidate.What’s the economy saying? Consumer confidence swooned in July amid a rash of new coronavirus cases in many U.S. states, signaling a rockier economic recovery in the months ahead, MarketWatch’s Jeffry Bartash reported. The index of consumer confidence fell to 92.6 this month from a revised 98.3 in June, the Conference Board said Tuesday. Economists polled by MarketWatch had expected a reading of 96.0. The level of confidence is still above its pandemic low of 85.7, but it’s likely to be a long time before it returns to its pre-crisis peak. The index stood near a 20-year high at 132.6 in February before the pandemic struck. The economy is not expected to make a full recovery for at least a year or two. “Consumers have grown less optimistic about the short-term outlook for the economy and labor market and remain subdued about their financial prospects,” said Lynn Franco, senior director of economic indicators at the board. “Such uncertainty about the short-term future does not bode well for the recovery, nor for consumer spending.” Separately, home-price appreciation maintained a steady pace in May amid the pandemic, according to a major price barometer released Tuesday, MarketWatch’s Jacob Passy reported. The S&P CoreLogic Case-Shiller 20-city price index posted a 3.7% year-over-year gain in May, down from 3.9% the previous month. On a monthly basis, the index increased 0.4% between April and May. “More data will obviously be required in order to know whether May’s report represents a reversal of the previous path of accelerating prices or merely a slight deviation from an otherwise intact trend,” Craig Lazzara, managing director and global head of index investment strategy at S&P Dow Jones Indices, said in the report. “Even if prices continue to decelerate, that is quite different from an environment in which prices actually decline.” See: With the baseball season in flux — here’s what U.S. sports leagues are doing amid the pandemicWhat are companies saying? The second-quarter earnings season moved ahead with reports from four members of the Dow Jones Industrial Average, among others. The four — Pfizer Inc. PFE, -0.27%, McDonald’s Corp MCD, -0.43%, 3M Co. MMM, +0.94% and Raytheon Technologies Corp. RTX, -1.46% —posted mixed numbers with McDonald’s and 3M falling short of estimates. Both stocks moved lower and were shaving about 50 points off the Dow. McDonald’s missed profit estimates as restaurants were closed for the pandemic, and 3M was unable to offset pandemic disruption with demand for face masks and other personal protective equipment. Harley-Davidson Inc. HOG, -3.31% swung to a loss and unveiled another overhaul of its operating model. The iconic motorcycle company will streamline its product line and focus on 50 markets in North America, Europe and Asia-Pacific that account for most of its volume and growth. JetBlue Airways Corp. JBLU, -0.07% saw its revenue fall about 90% in the quarter as travel was mostly grounded, in line with the numbers already posted by big carriers. Elsewhere, companies continued to issue debt and the initial public offering market remained strong. Read: IPO market braces for another 7 deals this week and yet another blank-check company See also: Buyer beware: SEC warns investors to avoid coronavirus-related frauds and scams Here are the latest stories about companies and COVID-19: • 3M, the diversified maker of health care, consumer and industrial products, reported second-quarter profit and sales that missed expectations, as results were “significantly impacted” by the pandemic. Safety and industrial sales declined 9.2% to $2.7 billion, above the FactSet consensus of $2.62 billion; health care sales slipped 0.4% to $1.8 billion to miss expectations of $1.95 billion; transportation and electronics sales dropped 20.9% to $1.9 billion to miss expectations of $1.97 billion; and consumer sales fell 6.2% to $1.2 billion, in line with expectations of $1.22 billion. The company said it is still not able to provide financial guidance given uncertainties related to the pandemic. For July to date, 3M said sales are tracking up in the low-single digit percentage range from last year. • Altria Group Inc. MO, +0.76%, the parent of Marlboro and Skoal tobacco products, reported a second-quarter profit that beat expectations but revenue that missed, while raising its quarterly dividend. Altria recorded charges of $50 million related to business disruptions cause by the pandemic. Total revenue fell 3.6% to $6.37 billion, missing the FactSet consensus of $6.50 billion, as smokeable revenue fell 4.3% to $5.60 billion. Cigarette shipments fell 8.8% to 24.95 billion sticks, with Marlboro shipments declining 8.4% to 21.79 billion sticks. Altria expects 2020 adjusted EPS of $4.21 to $4.38, surrounding the FactSet consensus of $4.30. The company raised its quarterly dividend to 86 cents a share from 84 cents, with the new dividend payable Oct. 9 to shareholders of record on Sept. 15. • Crane Co. CR, +0.17%, the maker of construction cranes and other industrial equipment, beat adjusted profit expectations for its second quarter and sales were above forecasts. Sales fell 20% to $678 million, due to “COVID-19 related macroeconomic factors.” “Our teams executed extremely well in a challenging environment, and second-quarter results modestly exceeded our expectations largely due to certain timing related items,” Chief Executive Max Mitchell said. Crane narrowed its GAAP earnings guidance for 2020 to a range of $2.65 a share to $3.45 a share, from a prior range of $2.35 a share to $3.60 a share. The company narrowed the band for adjusted earnings guidance to $3.30 a share to $4.10 a share, from a previous range of $3 a share to $4.25 a share. As of June 30, it had $592 million in cash and equivalents, and total debt was $1.43 billion. It also has $308 million available under its revolving credit facility, it said. Separately, the company announced a dividend of 43 cents a share, payable on Sept. 9 to shareholders of record as Aug. 31. • Francesca’s Holdings Corp. FRAN, +2.49% shares soared after the women’s clothing and accessories retailer gave a second-quarter sales outlook that improves on its first-quarter result. Sales are expected to fall due to COVID-19-related store closures, though e-commerce offset some of those losses. The company permanently closed eight stores during the quarter, reducing the total to 703. Francesca’s has reopened 674 locations, most with reduced operating hours and reduced capacity. Twenty-two stores in California have re-closed due to the coronavirus. All reopened stores require customers to wear a face covering. Francesca’s has repaid $2.0 million of borrowings under its amended ABL credit agreement with $12.1 million outstanding. The company expects $10.7 million from the CARES Act, which it will use towards this outstanding balance. For the second quarter, Francesca’s expects sales in the range of $67.0 million and $71.0 million. Comparable-store sales are expected to fall 11% to 16%. Margins are expected to be under pressure as the company clears inventory, however “our priority remains to ensure that we maintain disciplined inventory levels,” said Andrew Clarke, Francesca’s chief executive, in a statement. • G-III Apparel Group Ltd. GIII, +0.78% is planning to offer $350 million in senior secured notes that mature in 2025. The owner of brands, including DKNY and Donna Karan has licensing agreements with Calvin Klein and Tommy Hilfiger, among others, and said it will use the proceeds to repay a term loan that matures in 2022 and for general corporate purposes. The company joins the many issuing record levels of debt to bolster liquidity during the pandemic. • Hershey Co. HSY, +1.47% is confident that consumers will want to take their kids trick-or-treating this Halloween despite the ongoing pandemic. “It is an outdoor event. And it’s an event where a lot of masks are already worn,” said Michelle Buck, Hershey’s chief executive on the company’s recent second-quarter earnings call, according to a FactSet transcript. “There’s no evidence of the virus being passed through packaging or food, so we feel pretty good based on what we’re seeing so far from consumer feedback.” Hershey reported a profit that beat expectations, but sales fell short. Hershey has already started shipping Halloween orders, Buck said, with shipments continuing through early October. Hershey didn’t provide 2020 guidance due to the uncertainty caused by the pandemic. • Harley-Davidson Inc. shares swung to a loss in the second quarter and unveiled an overhaul of its business that will see it exit certain markets and streamline its product line. Milwaukee-based Harley said U.S. motorcycle sales fell 27% to $31.3 million, EMEA sales fell 30% to $11 million and Asia Pacific sales were down 10% to $6.9 million. The company is not offering guidance, given the uncertainty created by the pandemic. Harley is planning a ‘Rewire’ restructuring of its global operating model, that will impact all areas of the business from commercial operations to center-led support functions. The plan includes 700 job cuts that were previously announced and a streamlining of motorbike models by about 30%. The company will focus on about 50 markets in North America, Europe and Asia Pacific that currently account for most of its volume and growth potential. The company is planning a marketing campaign featuring “Aquaman” actor Jason Momoa. The company expects too save $250 million in cash in 2020 and to book a $42 million restructuring charge. • JetBlue Airways Corp. swung to a loss in the second quarter as the COVID-19 pandemic grounded travelers. Revenue tumbled 89.8% to $215 million from $2.105 billion. Traffic volumes and yields improved in May and June from their April trough. The airline reduced capacity by 85% from the year-earlier period due to aggressive action to offset cash burn. The company’s average daily cash burn in May was $9 million, compared with expectations for just below $10 million. Average daily cash burn in the quarter was $9.5 million, lower than the company’s expectation for $11 million. The company expects average cash burn to range from $7 million to $9 million a day in the third quarter. The company had about $2.9 billion in cash at quarter-end, and liquidity of about $3.4 billion including funds from the government program, the CARES Act. “While demand has improved materially from the lows we saw in April, bookings remain choppy, and we remain focused on addressing changing trends as we progress through the summer,” Chief Executive Robin Hayes said in a statement. • McDonald’s Corp. reported second-quarter earnings that missed expectations. Global comparable sales sank 23.9% with the U.S. down 8.7%. The FactSet consensus was for a global comparable sales decline of 22.8%. Comparable sales improved month-to-month through the quarter with the average check growing, though guest count was down, particularly at breakfast, the company said. As of June 30 nearly all restaurants around the world were open, with about 2,000 dining rooms in the U.S. reopened with reduced capacity due to the pandemic. Results for the quarter also include $200 million in franchisee support investments. “Our strong drive-thru presence and the investments we’ve made in delivery and digital over the past few years have served us well through these uncertain times,” said Chris Kempczinski, chief executive of the company. • Pfizer Inc. reported profit and revenue that beat expectations and raised its full-year outlook, despite the challenges resulting from the pandemic. Biopharma revenue rose 4% to $9.80 billion while Upjohn revenue dropped 32% to $2.01 billion. For 2020, the company raised its guidance ranges for adjusted EPS to $2.85 to $2.95 from $2.82 to $2.92 and for revenue to $48.6 billion to $50.6 billion from $48.5 billion to $50.5 billion. • Raytheon Technologies Corp. reported second-quarter profit and revenue that beat expectations, as a “good performance” in its defense business offset challenges in commercial aerospace. Among Raytheon’s business segments, Collins Aerospace sales fell 36% to $4.20 billion, above the FactSet consensus of $3.56 billion; Pratt & Whitney sales dropped 32% to $3.49 billion but beat expectations of $3.25 billion; Raytheon Missiles & Defense sales were $3.59 billion to miss expectations of $3.90 billion; and Raytheon Intelligence & Space sales were $3.31 billion to miss expectations of $3.54 billion. • Xerox Holdings Corp. XRX, -1.38% posted a surprise profit for the second quarter, but revenue fell slightly short of estimates amid the pandemic. Revenue tumbled to $1.465 billion from $2.263 billion, below the $1.482 billion FactSet consensus. “The global COVID-19 pandemic crisis significantly impacted our second quarter 2020 revenues due to business closures and office building capacity restrictions that impacted our customers’ purchasing decisions and caused lower printing volumes on our devices,” the company said in a statement."}]}