{"article": [{"url": "https://www.marketwatch.com/story/the-worlds-poorest-countries-may-get-another-freeze-on-their-debt-payments-what-they-really-need-is-debt-forgiveness-2020-09-25", "published": 1601038400.0, "headline": "The world's poorest countries may get another freeze on their debt payments. What they really need is debt forgiveness", "body": "The finance ministers of the G-7 group of major industrial countries are due to agree on Friday in a videoconference on extending by six months, to June 2021, the suspension of the world's 73 poorest countries' debt payments. - The G-7 backing may help trigger a similar agreement by the G-20 larger group of the world's wealthiest nations, whose finance ministers will meet on October 14. - Answering calls from the IMF and the World Bank, the G-20 agreed in April on a \"Debt Service Suspension Initiative,\" granting debt-service suspension to the neediest countries until December. The IMF recently called for the deadline to be pushed by one year, to the end of 2021. - The World Bank has estimated that the countries benefiting from the initiative would together save up to $11.5 billion in debt service payments this year on debt held by official creditors (governments or international organizations). - The Institute of International Finance in April urged private creditors to extend debt relief to their poorest debtors along the same lines. The outlook: A final decision on extension will be taken by the G-20 summit of heads of states and governments in November. But the biggest question remains unsolved: Beyond a simple and temporary freeze on their debt payments, the 73 countries really need a major debt restructuring plan that would include some debt forgiveness. Most of them were often classified as stressed debtors before the COVID-19 pandemic began, and so it is adding to an already unsustainable financial burden. Read: EU won't recognize Lukashenko as Belarus president, opening a new front in its worsening relationship with Putin's Russia"}]}