{"article": [{"url": "https://www.marketwatch.com/story/im-a-57-year-old-nurse-with-no-retirement-savings-and-i-want-to-retire-within-seven-years-what-can-i-do-2020-08-26", "published": 1599898460.0, "headline": "Iâ\u0080\u0099m a 57-year-old nurse with no retirement savings and I want to retire within seven years. What can I do?", "body": "Dear MarketWatch, I am 57. I have saved nothing. It always seemed like there would be time butâ\u0080¦here I am. Iâ\u0080\u0099m a Registered Nurse and make $80,000 a year. Iâ\u0080\u0099m thinking I could work the next 10 years and save half my salary â\u0080\u0094 five more years full time and two more years part time, at which time I will be 64. That would get me about $400,000 to retire. Not much. I am tired â\u0080\u0094 nursing is a hard job. I am a nurse manager but it is a mentally stressful job. I need a plan. My expenses are about $3,500 per month, including a $1,600 mortgage payment and $400 car payment. I have $5,000 in credit card debt. Thanks again for your help M See: Iâ\u0080\u0099m 52, wonâ\u0080\u0099t live past 80 and have $1.6 million. â\u0080\u0098I am tired of both the rat race and workplace politics.â\u0080\u0099 Should I retire? Dear M, You are right â\u0080\u0094 this year alone has shown us how difficult â\u0080\u0094 and essential â\u0080\u0094- a nurseâ\u0080\u0099s job is. I understand how stressful it must be to work in this field, and on top of that be planning a retirement with little savings. You are not alone in having nothing saved for retirement. Many Americans are nowhere near prepared for this stage of their lives. The good news for you is that you still have time, a job and the ability to work, and youâ\u0080\u0099re being proactive about it now. So youâ\u0080\u0099re already moving in the right direction! Now for the not-so-good news. You may have to readjust your expectations, for what retirement looks like, how much youâ\u0080\u0099ll have saved for it and potentially when it starts, financial advisers. This depends on numerous factors, of course, such as if your current living expenses will change, by how much, and if you have any additional resources you can tap. But assuming you want to maintain somewhat of the same lifestyle, and you have no other sources of income in retirement, you will have to shift gears just a bit. Iâ\u0080\u0099m not sure how you arrived at the $400,000 estimation. For simplicityâ\u0080\u0099s sake, say you worked full time for the next seven years and saved exactly half of your gross income ($40,000) â\u0080\u0094 that would be $3,333 a month compounded monthly and youâ\u0080\u0099d need a nearly 10% rate of return, which is much more aggressive than the average. Many advisers try to stay conservative in their estimates â\u0080\u0094 some use a 5-7% rate of return, for example. So assuming you saved that much every month for seven years and earned a 5% rate of return, youâ\u0080\u0099d have somewhere closer to $334,000. But even this calculation has flaws. You wouldnâ\u0080\u0099t have enough for your current expenses, as $3,500 a month amounts to $42,000 a year and we need to account for taxes. â\u0080\u009cSaving half of that money she is making and living on $40,000, that is probably not realistic,â\u0080\u009d said Rodney Loesch, a financial adviser at LifeGoals Strategies Group. All hope is NOT lost, though. Please remember that. â\u0080\u009cSheâ\u0080\u0099s still young (50s are the new 40s) and can catch up if sheâ\u0080\u0099s financially disciplined enough to do so,â\u0080\u009d said Rose Swanger, principal of Advise Financial. Before we get into how to build a plan, itâ\u0080\u0099s important to remind yourself often â\u0080\u009cto be kind to yourself,â\u0080\u009d said Jude Boudreaux, senior financial planner at The Planning Center. â\u0080\u009cItâ\u0080\u0099s hard when you are looking for a goal you want to accomplish and feel it will be really difficult to get there,â\u0080\u009d he said. Becoming too stressed about achieving that goal may take you farther away from it, as you might overspend, for example. Perhaps instead of trying to save half of your salary immediately, create smaller more manageable goals, such as $1,000 a month, he said. First, advisers said, cut down your monthly expenses as much as you possibly can while being safe about it. For some people, this could be as simple as unsubscribing from various television packages or canceling monthly magazine subscriptions. For others, this might be downsizing a home (easier said than done, especially if you own your home), getting rid of a car payment (again, easier said than done if you need your car) and cutting other big-ticket expenses. â\u0080\u009cIn her case, her savings need to do a lot of the work that investments would have done for someone younger,â\u0080\u009d he said. You may be surprised at how much you donâ\u0080\u0099t actually need to spend, and reducing these expenses will help you transition into retirement. This exercise is even useful if you intend to cut down costs when you retire, as youâ\u0080\u0099ll already be familiar with your â\u0080\u009cnewâ\u0080\u009d cost of living. â\u0080\u009cThe sooner she does it, the better off she will be both monetarily in terms of her portfolio, but also psychologically, after she already made the transition,â\u0080\u009d said Joshua Mungavin, principal at Evensky & Katz / Foldes Financial Wealth Management. If youâ\u0080\u0099ve already trimmed your budget, the next step is to look at the length of your remaining working years. I know you said your plan is to work full time for another five years and then part time for two more years, but you may have to work longer to amass a sustainable amount of money in retirement, Loesch said. Again, easier said than done and certainly if a job is taxing like yours, but while you have the ability and agility to work, try to capitalize on that time and strength. Unfortunately, not everyone has the opportunity to do so, due to a disability or a layoff, Mungavin said. Continuing to work has its benefits, though. For starters, you still get employee benefits this way, such as if your employer offers health insurance and youâ\u0080\u0099re not yet old enough for Medicare coverage (which, as Iâ\u0080\u0099m sure you know, can get expensive). You also get to accumulate more money in investment accounts. If your employer offers a retirement plan, and especially if it has a contribution match, take advantage of that for as long as you can. If you really want or need to get out of your current job though, there are alternatives. You have incredibly useful and necessary skills as a Registered Nurse, and you can use that knowledge and skill set to apply to other jobs, even if itâ\u0080\u0099s part-time or gig work. â\u0080\u009cI understand nursing is challenging and may not be feasible,â\u0080\u009d said Marguerita Cheng, chief executive officer of Blue Ocean Global Wealth. â\u0080\u009cPerhaps turn your hobby into an alternative source of income in retirement.â\u0080\u009d If you want to stay in the nursing field, some employment options include administrative work in physician offices, consulting or research roles for medical facilities, patient educators for pharmaceutical companies and even teacher jobs at private or public educational institutions, according to Nightingale College. Working longer also means your Social Security benefits will continue to grow. The longer you wait to claim Social Security, the more money you will get. Comparatively, if you were to claim before your Full Retirement Age, youâ\u0080\u0099d see a reduction in your benefit. If you are 57 now, your FRA is likely around 67 years old. You can check your FRA as well as your expected benefits at various ages and your employment history on the Social Security Administrationâ\u0080\u0099s site. Speaking of Social Security â\u0080\u0094 think carefully before you decide to claim it, especially if you choose to leave the workforce in your early 60s and intend to have that money offset your savings deficit. And of course, if you can afford to wait. Beneficiaries donâ\u0080\u0099t always realize that when they begin to claim Social Security benefits at 62, which is the earliest a retiree can do so, or anytime before their FRA, theyâ\u0080\u0099re going to get a permanent reduction in their benefits. By creating an account with the Social Security Administration, and checking what your estimated benefit will be, you can also get a picture as to how much that money will really help you live comfortably in retirement. Also, if you planned to take Social Security while working part time, a portion of your benefits will be withheld. In 2020, the base earnings threshold for people who claim Social Security before the year they reach their FRA is $18,240 â\u0080\u0094 for every two dollars you earn above that level, $1 is deducted. You do eventually get that money back in the form of benefit payments after you reach Full Retirement Age, but who wants to willingly go through that stress if they donâ\u0080\u0099t have to? Try to avoid it if you can. Here is more information on that rule. Also see: Iâ\u0080\u0099m 63, a widow and lost my job because of COVID. I donâ\u0080\u0099t have much in savings and feel lost. What can I do? Here are some other suggestions advisers had: â\u0080¢ Look into the APR on your credit card debt. If itâ\u0080\u0099s high (some could be 20% or more, prioritize paying that down alongside ramping up retirement savings). If itâ\u0080\u0099s much less, such as 3% or 5%, keep tackling the debt repayment but it can be much lower on the priority list, Mungavin said. â\u0080¢ As for the types of investments you use, look toward target-date funds, which allocate a portfolio to an expected retirement date, Cheng said. â\u0080\u009cI donâ\u0080\u0099t want her to allocate her dollars in an aggressive manner, because that can backfire for someone who is not comfortable investing,â\u0080\u009d she said. â\u0080¢ If an employer-sponsored retirement account is not available to you, fund an individual retirement account. Hereâ\u0080\u0099s more on that. â\u0080¢ Because you own a home, you may also be able to tap into the equity within it one day through a reverse mortgage. This can be a complicated process and itâ\u0080\u0099s important to vet the professional you work with. Hereâ\u0080\u0099s more information on that. â\u0080¢ Find a financial planner, who can walk through the specifics of your situation and help you make financial adjustments where needed. You donâ\u0080\u0099t need to work with them regularly â\u0080\u0094 some advisers help clients create a financial plan they can follow on their own. There are also advisers who do pro bono work, meaning they donâ\u0080\u0099t charge and consider the time volunteering, Loesch said. You could reach out to the local chapters of financial planner organizations, such as the Financial Planning Association or NAPFA, to see if that is an option for you. â\u0080\u009cAt this point, to create a workable plan, she really needs a detailed retirement projection (done by a fiduciary professional, not a calculator on the internet) to determine how much she needs to save and how those savings should be invested, in order to set her up for success,â\u0080\u009d said Gretchen Behnke, founder and financial planner at Pearl Financial Planning. And meanwhile, just keep putting in the work and try to stay positive. â\u0080\u009cBy facing her situation and preparing to change her behavior, she has already made an essential first step,â\u0080\u009d said Carol Fabbri, founder and executive director of Fair Advisors Institute. â\u0080\u009cSo many people are in this situation and prefer to hide their concern instead of facing it.â\u0080\u009d Have a question about your own retirement savings? Email us at HelpMeRetire@marketwatch.com"}]}