{"article": [{"url": "https://www.marketwatch.com/story/nouriel-roubini-says-reports-of-the-dollars-demise-are-greatly-exaggerated-11598282130", "published": 1598356220.0, "headline": "Nouriel Roubini says reports of the dollarâ\u0080\u0099s demise are greatly exaggerated", "body": "dollar_beat_up_0721 MarketWatch photo illustration/iStockphoto NEW YORK (Project Syndicate)â\u0080\u0094The recent sharp depreciation of the U.S. dollar BUXX, -0.69% has led to concerns that it may lose its role as the main global reserve currency. After all, in addition to the Federal Reserveâ\u0080\u0099s aggressive monetary easingâ\u0080\u0094which threatens to debase the worldâ\u0080\u0099s key fiat currency even furtherâ\u0080\u0094gold pricesÂ GOLD, +2.86% and inflation expectations have also been rising. But, to paraphrase Mark Twain, reports of the dollarâ\u0080\u0099s early demise are greatly exaggerated. The dollarâ\u0080\u0099s recent weakness is driven by shorter-term cyclical factors. In the long run, the situation is more complicated: the dollar has both strengths and weaknesses that may or may not undermine its global position over time. Mohamed A. El-Erian: The smart money is wrong about the battered dollar Negative factors Chief among the short-term negative factors is the Fedâ\u0080\u0099s ultraloose monetary policy. With the United States monetizing ever-larger budget deficits, the Fedâ\u0080\u0099s approach looks more accommodative than that of most other major central banks. “ The public-health failures and related economic vulnerabilities in the U.S. are thus further contributing to the dollarâ\u0080\u0099s weakness. ” The dollar DXY, -0.58% tends to weaken during risk-on episodes, andÂ vice versa. That is why its value peaked during the February-March panic over COVID-19, and then weakened from April onward as market sentiment recovered. Read more:Â Hereâ\u0080\u0099s what the U.S. dollarâ\u0080\u0099s fall means for the stock market Moreover, the Fedâ\u0080\u0099sÂ activationÂ of currency swap lines with other central banks eased the dollar illiquidity that had been pushing the exchange rate higher earlier in the crisis. Now, a flood of global dollars is putting downward pressure on the U.S. dollar. Moreover, some developed countries (in Europe and elsewhere) and some emerging markets (such as China and others in Asia) are doing a much better job of containing COVID-19 than the United States is, implying that their economic recoveries may prove to be more resilient. The public-health failures and related economic vulnerabilities in the U.S. are thus further contributing to the dollarâ\u0080\u0099s weakness. It also bears repeating that before the pandemic, the dollar hadÂ appreciatedÂ by over 30% in nominal and real (inflation-adjusted) terms since 2011. Given the yawning U.S. external deficit, and because interest rates are not high enough to finance it with capital inflows, a dollar depreciation was necessary to restore U.S. trade competitiveness. And the U.S. turn to protectionism signals that it prefers a weaker dollar to restore external competitiveness.Dollar could strengthen Even in the short run the dollar could strengthen again ifâ\u0080\u0094as the latest global growth data suggestâ\u0080\u0094a V-shaped recovery stalls into an anemic U-shaped recovery, let alone a double dip, if the first pandemic wave is not controlled and a second wave kills the recovery before effective vaccines are found. In the medium to long term, multiple factors could preserve the dollarâ\u0080\u0099s global dominance. The dollar will continue to benefit from a broad-based system of flexible exchange rates, limited capital controls, and deep, liquid bond markets. More to the point, there simply is no clear alternative currency that could serve as a broad unit of account, means of payment, and stable store of value. Furthermore, despite its pandemic travails, theÂ potential annual US growth rate, at around 2%, is higher than in most other advanced economies, where it is closer to 1%. The U.S. economy also remains dynamic and competitive in many leading industries, such as technology, biotech, pharmaceuticals, health care, and advanced financial services, all of which will continue to attract capital inflows from abroad. Any country vying for the U.S. position would have to ask itself if it really wants to end up with a strong currency and the associated large current-account deficits that come with meeting the global demand for safe assets (government bonds). This scenario seems rather unattractive for Europe, Japan, or China, where strong exports are central to economic growth. Under the current circumstances, the U.S. is likely to maintain its â\u0080\u009cexorbitant privilegeâ\u0080\u009d as the issuer of safe long-term debt that private and public investors want in their portfolios.Longer outlook The question, then, is what factors might undermine the dollarâ\u0080\u0099s global position over time. First, if the U.S. keeps monetizing large budget deficits, thereby fueling large external deficits, a surge of inflation eventually could debase the dollar and weaken its attractiveness as a reserve currency. Given the current mix of economic policies, this is a growing risk. Now read this: Dollar could be a â\u0080\u0098crash riskâ\u0080\u0099 if U.S. loses â\u0080\u0098credibility,â\u0080\u0099 analyst warns Another risk is the loss of U.S. geopolitical hegemony, which is one of the main reasons why so many countries use the dollar in the first place. There is nothing new about the hegemonâ\u0080\u0099s currency being the global reserve currency. This was the case with Spain in the 16th century, the Dutch in the 17th century, France in the 18th century, and Great Britain in the 19th century. If the coming decades bring what many have already called the â\u0080\u009cChinese century,â\u0080\u009d the dollar may well fade as the yuan USDCNH, -0.71% (also known as the renminbi) rises. Weaponization of the dollar via trade, financial, and technology sanctions could hasten the transition. Even if American voters elect a new president in November, such policies are likely to continue, as the Cold War between the U.S. and China is a long-term trend, and U.S. strategic rivals (China and Russia) and allies alike are already diversifying away from dollar assets that can be sanctioned or seized. At the same time, China has been introducing more flexibility to its own exchange rate, gradually relaxing some capital controls, and creating deeper debt markets. It has convinced more trade and investment partners to use the renminbi as a unit of account, means of payment, and store of value, including in foreign reserves. It is building an alternative to the Western-led Society for Worldwide Interbank Financial Telecommunication (SWIFT) system, and working on a digital renminbi that eventually could be internationalized. And its own tech giants are creating huge e-commerce and digital-payments platforms (Alipay and WeChat Pay) that other countries could adopt in their own local currency. So, while the dollarâ\u0080\u0099s position is safe for now, it faces significant challenges in the years and decades ahead. True, neither Chinaâ\u0080\u0099s economic system (state capitalism with financial controls) nor its technocratic-authoritarian political regime has much appeal in the West. But the Chinese model has already become quite attractive to many emerging markets and less democratic countries. Over time, as Chinaâ\u0080\u0099s economic, financial, technological, and geopolitical power expands, its currency may make inroads in many more parts of the world. NourielÂ Roubini, professor of economics at New York Universityâ\u0080\u0099s Stern School of Business, is host of NourielToday.com. This article was published with permission of Project Syndicateâ\u0080\u0094Is the Almighty Dollar Slipping? Suggested further reading How will the U.S. ever repay all this debt? Innovation is too important to be left to investors alone Anne Krueger: The American tragedy: A lousy economy and lots of COVID-19 infections Robert Shiller explains the pandemic stock market and why it is decoupled from the economyÂ"}]}