{"article": [{"url": "https://www.marketwatch.com/story/worried-about-going-back-to-the-gym-heres-a-guide-to-staying-fit-at-home-2020-07-01", "published": 1593610520.0, "headline": "Worried about going back to the gym? Hereâ\u0080\u0099s a guide to staying fit at home", "body": "This article is reprinted by permission from NextAvenue.org. While his gym was closed, you might have found Tom Hippman, 55, working out to Survivorâ\u0080\u0099s â\u0080\u009cEye of the Tigerâ\u0080\u009d in his Dallas living room, using whatever props he can find. He did sit-ups against the wall, deadlifted 64-load bottles of Woolite, ran through his parking garage, and other exercises for 45 minutes a day. â\u0080\u009cBeing in a 700-square-foot apartment is a little more challenging,â\u0080\u009d Hippman said. â\u0080\u009cIâ\u0080\u0099ve taken it on as a challenge.â\u0080\u009d During shelter-in-place orders amid the coronavirus pandemic, many couldnâ\u0080\u0099t go to the gym or group classes to stay fit like they usually did. While facilities may be reopening in some places, some people might be reluctant to return. â\u0080\u009cWith coronavirus out there, thereâ\u0080\u0099s a tendency not to exercise, but now itâ\u0080\u0099s even more important,â\u0080\u009d says Dr. Rajiv Misquitta, director of lifestyle medicine at Kaiser Permanente Medical Center in South Sacramento, Calif. â\u0080\u009cIf people donâ\u0080\u0099t have a [fitness] plan at home, theyâ\u0080\u0099ll become sedentary and that will affect their health.â\u0080\u009d Regular exercise is important to keep your body and mind healthy. But you donâ\u0080\u0099t need a gym, expensive equipment, special clothing or a large space to do many activities at home.Exercise, but not too much Adults typically should get at least 150 minutes of moderate-intensity exercise a week, according to the U.S. Department of Health and Human Services. But itâ\u0080\u0099s different during this coronavirus pandemic, says Tamara Hew-Butler, an associate professor of exercise and sports science at Wayne State University in Detroit. Also see: 24 Hour Fitness permanently shuts nearly a quarter of its gyms Instead, Hew-Butler recommends 20 to 45 minutes of moderate exercise three times a week. People, however, can modify that guidance according to their normal fitness routines. But exercise no more than five times a week and no exercise if you have flu-like symptoms, Hew-Butler adds. To replicate your gym workout, replace your usual equipment with household items, such as canned food for barbells or a bowling ball instead of a medicine ball. Research on the response of the bodyâ\u0080\u0099s immune system to exercise shows moderate exercise is â\u0080\u009cthe sweet spotâ\u0080\u009d and inactivity or exercising too much can increase your risk of respiratory viruses, says Hew-Butler, an avid runner. The goal during a pandemic, she explains, is to maintain your fitness level, not increase it. Donâ\u0080\u0099t miss: The â\u0080\u0098work-from-homeâ\u0080\u0099 ETF is here. Get ready for some surprises. How do you know if youâ\u0080\u0099re overdoing it? Listen to your body. Extreme soreness, pain or fatigue are probably signs youâ\u0080\u0099re exercising too much.Stick to an exercise routine Create an exercise routine. Make it simple, so youâ\u0080\u0099ll achieve your goals and want to keep exercising. Older adults should combine moderate aerobic activity with balance and muscle-strengthening (at least twice a week) exercises. Balance and muscle mass deteriorate as people age. Read next: New rules for exercising if youâ\u0080\u0099re over 50 To mirror your gym workout at home, replace your usual equipment with household items, such as canned food for barbells or a bowling ball instead of a medicine ball. Erika Nelson of St. Paul, Minn., often rearranges the living room furniture or moves her car out of the garage to perform exercises, yoga and Pilates. She does tricep dips with a chair and jumps off her deck. Nelson, 54, says staying active is important to her. â\u0080\u009cI really need it for my brain more than my body,â\u0080\u009d she says. â\u0080\u009cI push myself to do it, and I always feel better after.â\u0080\u009dStaying motivated Exercising at home can be challenging without equipment, an enthusiastic coach and team support. But it doesnâ\u0080\u0099t mean you canâ\u0080\u0099t interact with others. Talk to your trainer or workout buddies by phone and with video chat apps. Another idea: Get into a little competition with friends on your number of daily steps or push-ups, suggests Misquitta, who is a certified personal trainer. You might like: Hot springs in January, no traffic, and universal health care â\u0080\u0094 the best retirement escape youâ\u0080\u0099ve never heard of Mix various activities to keep things interesting or try something new. Think about what you enjoy: Gardening and dancing count as aerobic exercises, too. If you need a little inspiration, youâ\u0080\u0099ll find many online resources, such as yoga videos on YouTube and digital music services, like Spotify.Track your progress Stay motivated and accountable by tracking your activity. Wear a fitness tracker, use mobile apps to track your exercise regimen or simply write down what you do (number of steps or repetitions, your heart rate) on a calendar to see your progress week to week. Also read: Hereâ\u0080\u0099s what you need to set up the home gym thatâ\u0080\u0099s right for youExercises to try The following simple exercises donâ\u0080\u0099t require special equipment. You can find descriptions for them at the American Council on Exercise website, and yoga poses at the Yoga Journal website. Cardiovascular training: The National Association of Sports Medicine recommends cardiovascular training three to five times a week or one to three times a week for beginners. â\u0080\u009cYou want to get your heart rate up a little bit, get warm and start sweating,â\u0080\u009d Misquitta says. He suggests walking or jogging in place while watching television, walking up and down stairs, dancing or doing jumping jacks. Core (abdominal muscles): Ab crunches: This provides similar benefits as sit-ups with less strain on your neck and back. Planks: While planks focus on the core muscles of your abdomen and lower back, they really work the whole body. You can start on your knees or place your elbows on a hassock or couch. Trunk rotations: This exercise usually is done with a medicine ball, but you can use a household item, like a heavy book. Start with 2 pounds and gradually increase the weight. Upper body: Push-ups: In addition to upper-body muscles, push-ups work your core. If you canâ\u0080\u0099t do push-ups on your toes, start on your knees or plant your feet against a wall. Bicep curls: You can use water bottles or jugs of laundry soap instead of barbells. Lower body: Squats: Misquitta says squats give you the most bang for your buck. Squats work muscles from your feet to your butt and your core. Use a chair for support. Lunges: This exercise also strengthens abs and improves balance and mobility. First, you may want to become comfortable doing a single-leg stand. Later, extend your arms toward the front or hold weights for a greater challenge. Yoga poses for balance: Chair pose: It also strengthens the lower back and arm and leg muscles. Tree pose: Beginners can stand near a wall for support. Extend your arms toward the ceiling for more intensity. Sheryl Jean was a newspaper journalist for more than 20 years before becoming a freelance writer. She has contributed to the American Heart Association, Chicago Tribune, the Dallas Morning News, Texas Christian University publications, City National Bank and RBC Wealth Management. Connect with her on LinkedIn or follow her on Twitter @SJeanWrites. This article is reprinted by permission from NextAvenue.org, Â© 2020 Twin Cities Public Television, Inc. All rights reserved."}]}