{"article": [{"url": "https://www.marketwatch.com/story/a-hippocratic-oath-for-financial-advisers-the-secs-new-regulation-best-interest-gets-mixed-reviews-2020-06-30", "published": 1595147360.0, "headline": "A â\u0080\u0098Hippocratic oathâ\u0080\u0099 for financial advisers? The SECâ\u0080\u0099s new â\u0080\u0098Regulation Best Interestâ\u0080\u0099 gets mixed reviews.", "body": "Vance Barse is a San Diego, California-based financial advisor who runs a company called â\u0080\u009cYour Dedicated Fiduciary.â\u0080\u009d The financial advice industry is often seen as bifurcated between broker-dealers, who execute trades for clients on a commission basis, and Registered Investment Advisors, who provide wider sets of financial advice for a fee, and who have a fiduciary duty to their clients. But Barse, whose company serves 55 households around the country, is neither. He is an Investment Adviser Representative. And he is also an Accredited Investment Fiduciary, a designation that demonstrates heâ\u0080\u0099s met certain criteria to act as a fiduciary for clients â\u0080\u0094 that is, in their best interest. Clear as mud, right? For anyone who thinks the business of buying financial advice ought to be easier to understand, industry observers arenâ\u0080\u0099t very hopeful. Consumers are on their own and regulators arenâ\u0080\u0099t likely to be much help, many think. That notion is especially evident now, as financial services professionals get used to a new industry rule taking effect June 30. Regulation Best Interest, which was developed as a successor to the Fiduciary Rule proposed by the Obama administrationâ\u0080\u0099s Department of Labor, has an innocuous name. But industry observers say itâ\u0080\u0099s confusing, scattershot, and designed to protect industry, not investors. â\u0080\u009cThe standard doesnâ\u0080\u0099t do enough to strengthen the regulatory obligations of broker-dealers or investment advisors,â\u0080\u009d said Barbara Roper, director of investor protection for the Consumer Federation of America. â\u0080\u009cIt doesnâ\u0080\u0099t do enough to assist investors in making informed choices between broker-dealers and investment advisers. Everything it set out to do, it has failed. And that is precisely because the (Securities and Exchange Commission) chose to prioritize not disrupting the broker-dealer business model over protecting investors.â\u0080\u009d Related: What is asset allocation? As Barseâ\u0080\u0099s business shows, the line between broker-dealers and advisers is becoming more blurry with time. â\u0080\u009cBrokers have evolved into advisors of sorts,â\u0080\u009d Roper told MarketWatch. â\u0080\u009cNo-one pays for brokerage services to have someone conduct the transaction. You can do that now with the click of a mouse.â\u0080\u009d Research shows that most retail investors â\u0080\u009cdonâ\u0080\u0099t understand the differences between broker and advisor, they donâ\u0080\u0099t have the financial sophistication to make their own decisions, that they are going to rely, almost without exception, on the advice of the professionals, and they canâ\u0080\u0099t begin to understand the web of toxic conflicts of interest that encourage brokers to make recommendations that are not actually in their best interest,â\u0080\u009d Roper said. â\u0080\u009cPeople donâ\u0080\u0099t know what they donâ\u0080\u0099t know,â\u0080\u009d said Jonathan Reuter, an associate professor of finance at Boston Collegeâ\u0080\u0099s Carroll School of Management. â\u0080\u009cThe sorts of people who need financial advice tend to be lower-income, younger, and less experienced. And if you donâ\u0080\u0099t understand financial markets and someone says hereâ\u0080\u0099s my standard contract, I donâ\u0080\u0099t know that thatâ\u0080\u0099s going to raise red flags or give you an understanding that there are alternatives.â\u0080\u009d One of the most concrete outcomes of Regulation Best Interest is that broker-dealers must now give clients a form that describes the services they offer and how they are paid for them, as well as any conflicts of interest or legal obligations they may have. Broker-dealers are also required, in the words of the SEC, to â\u0080\u009cidentify and mitigate any conflicts of interest associated with such recommendations that create an incentive for the broker-dealerâ\u0080\u0099s associated persons to place their interest or the interest of the broker-dealer ahead of the retail customerâ\u0080\u0099s interest,â\u0080\u009d but Roper argues that the agency never explicitly explains what mitigation should entail. Reuter, whose past research was one of the models for the defunct Fiduciary Rule, isnâ\u0080\u0099t a fan of Regulation Best Interest, either. â\u0080\u009cItâ\u0080\u0099s not saying the broker-dealers need to be held to a fiduciary standard or put clientsâ\u0080\u0099 interests first,â\u0080\u009d he said in an interview. â\u0080\u009cItâ\u0080\u0099s saying they canâ\u0080\u0099t put clientsâ\u0080\u0099 interest last.â\u0080\u009d But unlike Roper, he sees it as a positive first step. Even if the disclosures seem like useless make-work, he thinks some financial firms may at least start to take to heart some of the spirit of the regulation. And if firms actually develop their own disclosure forms, rather than relying on industry-standard boilerplate, thereâ\u0080\u0099s potential for industry observers to collect the information they contain, monitor it, and possibly even develop a grading system for broker-dealers. Read: Investing legend Burton Malkiel on day-trading millennials, the end of the 60/40 portfolio and more While the implementation of the new regulation means broker-dealers are under the spotlight, itâ\u0080\u0099s worth noting that many experts have qualms about registered investment advisers as well. â\u0080\u009cItâ\u0080\u0099s likely to be a better model for most people because itâ\u0080\u0099s not distorted by commissions,â\u0080\u009d Reuter said. But itâ\u0080\u0099s hard for many clients to assess RIA fees, he thinks. And thatâ\u0080\u0099s if theyâ\u0080\u0099re even able to get in the door: most RIAs will only work with clients who meet a certain threshold of assets. Roper thinks the key is for investors to seek out advisers who voluntarily hold themselves to a higher standard of accreditation. Those with certifications as an Accredited Investment Fiduciary, like Vance Barse, or from the organization called CEFEX (Centre for Fiduciary Excellence) have decided to commit themselves to serving their clients in a fiduciary capacity. For his part, even though Vance Barse is neither an RIA nor a broker-dealer, he has an affiliation with a large company, Commonwealth Financial Network, that provides the services of both spheres, so heâ\u0080\u0099s gotten very familiar with Regulation BI. Barse is hopeful itâ\u0080\u0099s a baby step in the right direction. â\u0080\u009cItâ\u0080\u0099s virtually impossible to eliminate all potential conflicts of interest,â\u0080\u009d he said. And he believes individual investors have a responsibility to educate themselves on what they want and what theyâ\u0080\u0099re getting. Still, the financial services industry has to meet them halfway, he said. â\u0080\u009cIn medicine, licensed doctors take the Hippocratic oath and Iâ\u0080\u0099m of the belief we should have the equivalent in financial services.â\u0080\u009d See: Are ETFs safe... for retail investors?"}]}