{"article": [{"url": "https://www.marketwatch.com/story/hurricane-sally-wallops-florida-alabama-coast-with-105-mph-winds-torrential-rain-2020-09-16", "published": 1600294280.0, "headline": "Hurricane Sally wallops Florida, Alabama coast with 105-mph winds, torrential rain", "body": "PENSACOLA, Fla. — Hurricane Sally lumbered ashore near the Florida-Alabama line Wednesday with 105-mph winds and rain measured in feet, not inches, killing at least one person, swamping homes and forcing the rescue of hundreds as it pushed inland for what could be a slow and disastrous drenching across the Deep South. The death happened in Orange Beach, Alabama, according to Mayor Tony Kennon, who also told The Associated Press that one person was missing. Kennon said he couldn’t immediately release details. Moving at an agonizing 3 mph, or about as fast as a person can walk, the storm made landfall at 4:45 a.m. close to Gulf Shores, Alabama, about 30 miles from Pensacola. It accelerated to a light jog as it battered the Pensacola and Mobile, Alabama, metropolitan areas encompassing nearly 1 million people. It cast boats onto land or sank them at the dock, flattened palm trees, peeled away roofs, blew down signs and knocked out power to more than a half-million homes and businesses. A replica of Christopher Columbus’ ship the Nina was missing from the Pensacola waterfront, police said. iframe.twitter-tweet { width: 100% !important; } Sally tore loose a barge-mounted construction crane, which then smashed into the new Three Mile Bridge over Pensacola Bay, causing a section of the year-old span to collapse, authorities said. The storm also ripped away a large section of a fishing pier at Alabama’s Gulf State Park on the very day a ribbon-cutting had been scheduled following a $2.4 million renovation. By the afternoon, authorities in Escambia County, which includes Pensacola, said at least 377 people had been rescued from flooded areas. More than 40 people trapped by high water were brought to safety within a single hour, including a family of four found in a tree, Sheriff David Morgan said. Authorities in Pensacola said 200 National Guard members would arrive Thursday to help. Officials also announced a three-day dusk-to-dawn curfew in the county, where the storm turned some Pensacola streets into white-capped rivers for a time. Sally turned some Pensacola streets into white-capped rivers early Wednesday. Sodden debris and flooded cars were left behind as the water receded. By early afternoon, Sally had weakened into a tropical storm. Its maximum sustained winds fell by Wednesday night to 45 mph and the National Weather Service said heavy rains were spreading to the north and east, into eastern Alabama and western Georgia. iframe.twitter-tweet { width: 100% !important; } At least eight waterways in south Alabama and the Florida Panhandle were expected to hit their major flood levels by Thursday. Some of the crests could break records, submerge bridges and flood some homes, the National Weather Service warned. Morgan, the Escambia County sheriff, estimated thousands more will need to flee rising waters in the coming days. County officials urged residents to rely on text messages for contacting family and friends to keep cellphone service open for 911 calls. “There are entire communities that we’re going to have to evacuate,” the sheriff said. “It’s going to be a tremendous operation over the next several days.” West of Pensacola, power poles leaned halfway over in Perdido Key, Florida, as Joe Mirable arrived at his real estate business to find the two-story building shattered, its contents scatted on the ground. Digging through the ruins, Mirable pointed out a binder labeled “Hurricane Action Plan.” “I think the professionals got this one wrong,” he said before the wind blew away his hat. More than 2 feet of rain was recorded near Naval Air Station Pensacola, and nearly 3 feet of water covered streets in downtown Pensacola, the National Weather Service reported. “It’s not common that you start measuring rainfall in feet,” said forecaster David Eversole. “Sally’s moving so slowly, so it just keeps pounding and pounding and pounding the area with tropical rain and just powerful winds. It’s just a nightmare.” It was the second hurricane to hit the Gulf Coast in less than three weeks and the latest blow in one of the busiest hurricane seasons ever recorded, so frenetic that forecasters have nearly run through the alphabet of storm names with 2 1/2 months still to go. At the start of the week, Sally was one of a record-tying five storms churning simultaneously in the Atlantic, strung out like charms on a bracelet. Like the wildfires raging on the West Coast, the onslaught of hurricanes has focused attention on climate change, which scientists say is causing slower, rainier, more powerful and more destructive storms. An emergency crew rescued two people on Dauphin Island, Alabama, after the hurricane ripped the roof off their home and the rest of the house began to crumble. “As things started to peel off and fall apart, they got scared and called for assistance,” Mayor Jeff Collier said. He said no one was injured. In Orange Beach, Alabama, the wind blew out the walls in one corner of a condominium building, exposing the interiors of condos on at least five floors, video posted online showed. At least 50 people were rescued from flooded homes and taken to shelters, Mayor Tony Kennon said. “We got a few people that we just haven’t been able to get to because the water is so high,” Kennon said. “But they are safe in their homes. As soon as the water recedes, we will rescue them.” In downtown Pensacola, water rushed down some streets like river rapids, forming whitecaps as it slapped against buildings and rose above the tires on cars. Before sunrise, water was up to the doors of Jordan Muse’s car outside the Pensacola hotel where her family took shelter after fleeing their mobile home. The power failed early in the morning, making it too stuffy to sleep. Her 8-year-old son played with toys underneath the hotel room desk as Muse peered out the window, watching rain fly by in sheets. “The power trucks are the only ones above water, and they’re the biggest,” Muse said. “I can’t believe it got so bad.” National Hurricane Center forecaster Stacy Stewart said the rain will be “catastrophic and life-threatening” over portions of the Gulf Coast. Forecasters predicted 10 to 20 inches of rain, with up to 35 inches in some spots. “Sally has a characteristic that isn’t often seen and that’s a slow forward speed, and that’s going to exacerbate the flooding,” said Ed Rappaport, deputy director of the hurricane center. He likened the storm’s plodding pace to that of Hurricane Harvey, which inundated Houston in 2017. Sally’s crawl made it hard to predict where it would strike. Just two days before landfall, the storm was forecast to hit New Orleans — 140 miles west of where it came ashore. So Robert Lambrisky and his husband were caught somewhat off guard when the hurricane shook their door before daybreak and forced rainwater inside their home in Sanders Beach near Pensacola. After sunrise, choppy seawater covered what is normally 50 feet of beach. “We had some warning, but this was just such a strange storm,” Lambrisky said. “So all of this preparing that you do, when you know the storm is coming, was something we only half did because we were convinced the storm wasn’t going to hit us.” Sally’s effects were felt all along the northern Gulf Coast. Low-lying properties in southeastern Louisiana were swamped by the surge. Water covered Mississippi beaches and parts of the highway that runs parallel to them. President Donald Trump issued emergency declarations for parts of Florida, Alabama, Mississippi and Louisiana. White House press secretary Kayleigh McEnany said on Fox News Channel that Trump was in contact with the states’ governors and ready to help “in every way possible.” Hurricane Laura pummeled southwestern Louisiana on Aug. 27. Thousands of people were still without power from that storm, and some were still in shelters. Meanwhile, far out in the Atlantic, Teddy became a hurricane Wednesday with winds of 100 mph. Forecasters said it could reach Category 4 strength before closing in on Bermuda, which took a direct hit from Hurricane Paulette only days ago."}]}