{"article": [{"url": "https://www.marketwatch.com/story/they-took-the-death-and-permanent-disability-part-out-of-there-which-is-nice-of-them-college-students-are-being-asked-to-sign-covid-19-liability-agreements-11597758794", "published": 1598015300.0, "headline": "Colleges are asking students to sign agreements about the dangers of COVID before returning to class â\u0080\u0094 but schools insist they arenâ\u0080\u0099t liability waivers", "body": "Penn State changed the compact it was asking students to sign to return to campus after controversy. (Photo: AP Photo/Matt Rourke, File) When Kyle Britten, a senior at Pennsylvania State University, learned that to log into his email account or sign up for courses he would have to acknowledge that he was assuming the risk of contracting COVID-19 by participating in school activities, he was taken aback. â\u0080\u009cI was honestly pretty pissed off,â\u0080\u009d he said.Â Britten, who has been following the science closely since the pandemic began, is planning to take the bulk of his classes online. He doesnâ\u0080\u0099t want to take the risk of exposing his mom, who he lives with, to the COVID-19, especially as Brittenâ\u0080\u0099s grandmother died from complications related to coronavirus earlier this summer.Â To Britten, the schoolâ\u0080\u0099s ask that he â\u0080\u009cacknowledge that exposure or infection may result in personal injury, illness, permanent disability or death,â\u0080\u009d was not â\u0080\u009ca very good look.â\u0080\u009d Apparently, Penn State officials agreed. After pressure, the school walked back that language.Â Now, before returning to campus, students can sign a compact instead that states, â\u0080\u009ceven with the mitigation steps taken by Penn State and my compliance with this Compact, I acknowledge that Penn State cannot prevent the risks of exposure to COVID-19 that may result from attending Penn State or participating in Penn State activities.â\u0080\u009dÂ Britten, who wasnâ\u0080\u0099t planning on signing the original agreement, signed the new one, saying the updated language made him feel, â\u0080\u009ca bit better.â\u0080\u009d â\u0080\u009cThey took the death and permanent disability part out of there, which is nice of them,â\u0080\u009d he said.Â The change came after some students â\u0080\u009cmisinterpretedâ\u0080\u009d the language of the compact as a waiver of studentsâ\u0080\u0099 rights, which was â\u0080\u009cneither the case, nor the intent,â\u0080\u009d Lisa Powers, a spokeswoman at the school, wrote in an email.Â Colleges are subtly trying to shift responsibility The controversy over Penn Stateâ\u0080\u0099s initial language is just one example of the ways in which concerns over so-called liability waivers have been a flashpoint for students, faculty and staff as some colleges across the country start to bring students back to campus for the fall semester amid a global pandemic. Asking students to sign these types of agreements are perhaps the most extreme example of the ways colleges and universities are trying to shift responsibility towards students to keep campus safe.Â But the back and forth over the compact also illustrates the more subtle ways colleges are working to make sure they wonâ\u0080\u0099t be blamed for a COVID outbreak and, instead, studentsâ\u0080\u0099 behavior will be held responsible, said Heidi Li Feldman, a professor at Georgetown Universityâ\u0080\u0099s Law Center.Â Stating clearly, as Penn State has done, that the compact is not a waiver of liability is â\u0080\u009cnot nothingâ\u0080\u009d she said, â\u0080\u009cbut it doesnâ\u0080\u0099t settle the larger issue about whether the university is prepared to take responsibility for its own carelessness should it act carelessly.â\u0080\u009dÂ â\u0080\u009cUniversities across the country have been aggressively moving on many different fronts to shield themselves from liability while also telling students itâ\u0080\u0099s a good idea to come back to campus,â\u0080\u009d she said.Â The ways colleges have been working to shield themselves from the pandemic generally fit into two categories, Feldman said. On the one hand, college-lobbying organizations have been asking the federal government for months to shield them from lawsuits as part of any coronavirus relief package.Â At the same time, some colleges are asking students to agree to intricate codes of conduct or behavioral compacts before participating in school activities. Even when these compacts donâ\u0080\u0099t require students to waive their right to sue the school, they create an environment that would make it difficult for students or families to sue over a COVID outbreak, Feldman said.Â At schools across the country, students may have to agree to abide by certain behavioral rules, like limiting the number of people in their space or wearing masks. In addition, these compacts may reference several sources of public-health information and ask that students be aware of them. Because plaintiffsâ\u0080\u0099 lawyers typically take cases on a contingency basis, this environment could make them hesitant to represent a student or family even if they have a meritorious claim, Feldman said.Acknowledging theyâ\u0080\u0099ve been given the required information At the University of Pittsburgh, officials are asking students to agree to participate in social distancing, mask wearing, contact tracing and other COVID-mitigation behaviorsÂ if they want to return to campus and participate in academic programming on and off campus. Though the university has said explicitly that it is not asking students to waive their right to sue the school, it is asking them to acknowledge that they have â\u0080\u009cbeen given all the information I may need to determine the risks associated with returning to the university and to make an informed assumption of those risksâ\u0080\u009d.Â Students also have to acknowledge that they are â\u0080\u009cassuming the risk that I may be exposed to or infected by COVID-19 and that such exposure or infection of COVID-19 is inherently dangerous.â\u0080\u009dÂ Rachel Coombs, a biology Ph.D candidate at the school, is scheduled to defend her dissertation three days after the deadline to sign the compact. Not signing it could put Coombsâ\u0080\u0099 ability to submit her dissertation at risk because she needs to use the schoolâ\u0080\u0099s information-technology infrastructure to do so. Still, Coombs, 39, said she doesnâ\u0080\u0099t plan to sign. â\u0080\u009cIâ\u0080\u0099m not going to be coerced into assuming risk that I donâ\u0080\u0099t think is my responsibility,â\u0080\u009d she said. “ â\u0080\u0098Iâ\u0080\u0099m not going to be coerced into assuming risk that I donâ\u0080\u0099t think is my responsibility.â\u0080\u0099 ” â\u0080\u0094 Rachel Coombs, a Ph.D candidate Coombs has already been working in her lab this summer and, overall, she has felt safe. The entrance to her lab is secure, so the number of people going in and out is limited. In addition, the other students, faculty and staff sheâ\u0080\u0099s seen in the halls have worn masks and respected social distancing.Â Rachel Coombs is a biology PhD candidate at the University of Pittsburgh. Still, Coombs is concerned about the fall. â\u0080\u009cIâ\u0080\u0099m very, very worried about students coming back,â\u0080\u009d she said. â\u0080\u009cThereâ\u0080\u0099s no way that they arenâ\u0080\u0099t going to have parties.Â Even under the best of circumstances the disease is going to be spread.â\u0080\u009d Though Coombs has been following school town halls and information sent to students, she said she still isnâ\u0080\u0099t clear on the steps the university is taking to prevent the spread of the disease.Â â\u0080\u009cItâ\u0080\u0099s unfair to tell us that weâ\u0080\u0099re responsible for assuming the risk when we donâ\u0080\u0099t have any control or information about how things are going to be safely maintained,â\u0080\u009d she said. â\u0080\u009cThe assumption is maybe theyâ\u0080\u0099ll do what theyâ\u0080\u0099re supposed to do, maybe they wonâ\u0080\u0099t, but itâ\u0080\u0099s your risk either way.â\u0080\u009d Kevin Zwick, a Pitt spokesman, wrote in an email that the schoolâ\u0080\u0099s return-to-campus student acknowledgment, the document Coombs expressed concerns about, asks students to agree that they understand and acknowledge the risks and behaviors necessary to keep campus safe.Â â\u0080\u009cStudents are not being asked to give up their right to sue the University or any other legal right,â\u0080\u009d he wrote.Â Higher education has become more litigious Higher education has become a more litigious environment over the past several years â\u0080\u0094 as illustrated by the dozens of lawsuits filed at the beginning of the pandemic seeking tuition refunds â\u0080\u0094 as college costs have grown.Â Â â\u0080\u009cNow itâ\u0080\u0099s viewed as a very significant investment,â\u0080\u009dsaid Kevin McClure, an associate professor of higher education at the University of North Carolina Wilmington. In the event that something happens to prevent students from finishing their degree or extends the length of time it takes to graduate, some students may feel like they have grounds to use the courts for redress, he added. The need to cover costs is part of the reason why schools feel pressure to bring students back. The evolution of this legal responsibility that colleges have to care for students has shifted in line with its cost, McClure said. Until the 1960s, universities were legally thought of acting in place of their studentsâ\u0080\u0099 parents while they were on campus. That designation allowed the schools to regulate studentsâ\u0080\u0099 behavior â\u0080\u0094 at risk of suspension or expulsion â\u0080\u0094 with curfews, and other â\u0080\u009ccharacter-building requirements,â\u0080\u009d including rules that forbid students from joining secret societies.Â The Civil Rights era ushered in a change to that approach as students who had been punished by their colleges for participating in activism were able to successfully challenge the schoolsâ\u0080\u0099 legal basis to dismiss them. Following a series of court decisions, universities began to provide students with more autonomy, similar to adults not on college campuses.Â But by the 1980s, courts began to rule that while universities couldnâ\u0080\u0099t police studentsâ\u0080\u0099 behavior, they had a duty to take reasonable steps to keep students safe. McClure ties that shift in part to increasing college costs.Â â\u0080\u009cWith the rise in tuition and treating students more like consumers, colleges started to take on once again a much higher level of responsibility to care for the well being of students,â\u0080\u009d he said.Â During the COVID-19 era, it appears that schools â\u0080\u009cwant it both ways,â\u0080\u009d McClure said. â\u0080\u009cThey donâ\u0080\u0099t want to have the duty of care and they want the tuition money.â\u0080\u009dÂ Students and the faculty are asked to police each other In some cases, students are being asked not just to behave appropriately, but to ensure their peers are following COVID protocols too. Karen Levy, an assistant professor at Cornell University, who studies surveillance, expressed concern in a recent New York Times op-ed about policies like health-ambassador programs, tip lines and other campaigns that ask students to police one another.Â What we know from other contexts indicates that these kinds of systems, particularly if theyâ\u0080\u0099re anonymous, can be weaponized and often impact different groups of people differently, Levy said. Colleges should be thinking critically about plans to ask students to report on one another, given that theyâ\u0080\u0099ll already be returning to campus in a high-stress, high-anxiety environment and weâ\u0080\u0099ve spent the summer watching confrontations around these issues and others, Levy said.Â Â Â â\u0080\u009cItâ\u0080\u0099s not to say that they shouldnâ\u0080\u0099t have these things,â\u0080\u009d she said, â\u0080\u009cbut they should be thinking about that the results are likely to be mixed.â\u0080\u009dÂ Itâ\u0080\u0099s not just students who are being asked to take responsibility for keeping campus safe. Faculty and staff are also expected to shoulder some of the burden. Case in point: A group of University of North Carolina employees is suing the UNC system over its decision to bring students back to campus, putting faculty and staff at risk of exposure.Â UNC Chapel Hill, the systemâ\u0080\u0099s flagship campus, announced Monday that it would be transitioning to remote classes after discovering four clusters of positive cases on and surrounding campus. As of yet, the rest of the system hasnâ\u0080\u0099t made the same transition.Â â\u0080\u009cThey are delegating a non-delegable duty to employees to keep themselves safe instead of embracing that, as an employer, they have a non-delegable duty to keep the employees safe,â\u0080\u009d said Gary Shipman, an attorney representing the group.Â The school system is asking faculty and staff to take steps to protect campus, including acting as â\u0080\u009cmask policeâ\u0080\u009d when they see a non-compliant student, Shipman said.Â â\u0080\u009cIn this politically active day and time, no faculty and staff member wants to be confrontational with students,â\u0080\u009d he said. â\u0080\u009cThey fear confrontation with students, thatâ\u0080\u0099s not part of their job description to be the mask police.â\u0080\u009d At the University System of Georgia, where faculty, staff and students hosted a â\u0080\u009cdie inâ\u0080\u009d earlier this month protesting the systemâ\u0080\u0099s reopening plans, instructors are being asked to act as â\u0080\u009cenforcers of public health,â\u0080\u009d including making sure that students are following the Center for Disease Control and Georgia Department of Health guidelines, said Bryant Barnes, a graduate student and teaching assistant at the University of Georgia.Â Bryant Barnes, a graduate student and teaching assistant at the University of Georgia. Kathryn Skeean/The Red & Black The systemâ\u0080\u0099s approach to the fall suggests that â\u0080\u009cthe risks that theyâ\u0080\u0099re most concerned with are the financial risks,â\u0080\u009d Barnes said. He said faculty and staff are required to go through an online training model and, at the end, acknowledge that theyâ\u0080\u0099re responsible for maintaining social-distancing guidelines, proper hygiene and other mitigation measures.Â â\u0080\u009cThat seems like they are trying to shift liability on to students, staff and faculty, but itâ\u0080\u0099s not entirely blatant,â\u0080\u009d he said.Â"}]}