{"article": [{"url": "https://www.marketwatch.com/story/could-a-watered-down-democratic-convention-in-milwaukee-still-put-biden-over-the-top-in-wisconsin-2020-08-18", "published": 1597767020.0, "headline": "Could a watered-down Democratic convention in Milwaukee still put Biden over the top in Wisconsin?", "body": "Was choosing Wisconsin to host the Democratic National Convention a surefire way for Joe Biden to flip the state back to blue? Not at all, according to experts and the historical record. And that looks even less likely in the wake of the Democratic challenger’s decision not to travel to Milwaukee for the convention, which has become a largely virtual event because of ongoing public health concerns. “There’s no evidence that holding the convention in a city or state has a decisive impact,” said Julia Anzari, a professor of political science at Marquette University, whose campus sits just blocks from the convention site in downtown Milwaukee, in an email to MarketWatch. Even though Biden and other top Democrats won’t be traveling to Milwaukee, Wisconsin’s biggest city still has a role in the proceedings. Democratic Wisconsin Gov. Tony Evers, Democratic Sen. Tammy Baldwin and other politicians from the state are slated to deliver their remarks in person at the Wisconsin Center. But Democrats have said they’re limiting in-person attendance “to only those necessary to orchestrate the event,” meaning personnel such as Wisconsin Center staff and convention organizers. Now read:Here’s how to watch the Democratic convention — plus who’s speaking, and when In the past 20 years, while Democrats and Republicans often have held their marquee quadrennial events in battleground states, their presidential candidates’ ensuing performances in those states have been mixed. President Donald Trump won Ohio in 2016 after the GOP convention was held in Cleveland, and Barack Obama won North Carolina in 2012 and Colorado in 2008 after Charlotte and Denver played hosts to his party’s shindigs. But Hillary Clinton lost Pennsylvania in 2016 after the Democratic convention in Philadelphia; Mitt Romney lost Florida in 2012, when Tampa hosted the Republican convention; and George W. Bush lost Pennsylvania in 2000, when Republican delegates convened in Philadelphia. This mixed record “shouldn’t be surprising, since convention host states tend to be battlegrounds that could go either way,” said Melissa K. Miller, a professor of political science at Bowling Green State University in Ohio. Also see:Michelle Obama rips Trump as ‘wrong president for our country’ in DNC speech. Miller also said parties choose their convention locations carefully “with the goal of tipping the state in their favor,” and the Republicans’ Cleveland convention in 2016 “may have helped generate enthusiasm among Ohio Republicans for the Trump ticket.” This year’s coronavirus backdrop, of course, casts new doubt on the anticipated impact. “In the absence of the pandemic, a Milwaukee convention would have undoubtedly inspired Wisconsin Democrats to staff phone banks, flood social media, stuff envelopes and go door-to-door on behalf of the Biden campaign and down-ballot Democrats,” said Miller. “The DNC didn’t foresee a global pandemic that would dictate a stripped down, Zoom-style ZM, +2.89% event with portions of the convention held in cities in other swing states. Any marginal effect that the Milwaukee convention might have had in a normal election year will doubtless be muted,” she said. Trump Today:Trump kicks off trips to 4 battleground states as Democrats open convention. Biden announced on Aug. 5 that he would not be making the trip to Milwaukee to accept the nomination at his party’s convention due to ongoing COVID-19 concerns. “The decision to have Biden accept the nomination from his home state of Delaware may have made sense COVID-wise, but it will certainly blunt the typical generation of on-the-ground enthusiasm parties count on when they choose a battleground state like Wisconsin as the site of their convention,” Miller said. “The Democrats had already scaled back the Milwaukee component of the convention so much that an outsized convention ‘bump’ in Wisconsin probably wasn’t in the cards. Having Biden accept the nomination in Delaware likely assures an outsized bump in Wisconsin won’t transpire,” she said. Milwaukee residents have expressed some frustration with how an event once expected to draw 50,000 people now is largely virtual, resulting in large part from a city order that limits gatherings in public venues to no more than 250 people. “I don’t think there will be anybody in town,” one local restaurant owner told the Milwaukee Journal Sentinel. Now see:Investors face a big risk heading into the election, strategist warns — and it’s not because Biden might win In a RealClearPolitics average of polls focused on Wisconsin, Biden has an advantage of 6.5 percentage points over Trump, who won the state in 2016. Anzari points to recent Marquette polling that shows the Republican incumbent struggling when it comes to some key issues for Wisconsinites. Trump has amassed disapproval ratings above 50% in areas such as his handling of protests over police killings of Black Americans and his approach to the coronavirus crisis. Democrats hope their candidate maintains his edge over the president in Wisconsin, and that even the drastically downsized convention in Milwaukee gives their side a boost in the Badger State. “The choice of a convention site in a given state is a clear sign that the party places a high priority on its Electoral College votes,” Miller said. Also read:Democratic National Convention audience shrinks 28% on opening night."}]}