{"article": [{"url": "https://www.marketwatch.com/story/a-first-look-at-the-2021-polestar-2-volvos-all-new-ev-2020-07-02", "published": 1593666740.0, "headline": "A first look at the 2021 Polestar 2, Volvo's all-new EV", "body": "Pros Expected range of 275 miles 408 horsepower 487 lb-ft of torque All-wheel drive Excellent safety features Optional Performance Package Cons Not as quick as Tesla TSLA, +1.89%  Model 3 Performance Tiny front trunk What's new this year? The Polestar 2 is an all-new, all-wheel-drive electric 5-seat hatchback It's the first full-electric vehicle from the Volvo Car Group Single-motor models may come later People also ask: Where is the Polestar 2 made? The Polestar 2 is made at the Geely plant in Luqiao, China. Incidentally, this factory also builds the Volvo XC40, another vehicle based on the company's Compact Modular Architecture (CMA) platform. How long does it take to recharge the Polestar 2? According to the manufacturer, the Polestar 2, using an 11-kilowatt charger, can be brought to a full charge in 8 to 10 hours, basically overnight. What is the max tow rating of the Polestar 2? The Polestar 2, equipped with an optional power-folding tow bar, has a maximum tow rating of 3,300 pounds. The Audi e-Tron, fitted with a tow package, is rated to 4,000 pounds. Is Polestar owned by Volvo? Polestar is an automotive brand owned jointly by the Volvo Car Group VLVLY, -0.48%  and Geely GELYF, +0.64%  its parent company in China. In 2017, Volvo announced that Polestar would build EVs to compete with the likes of Tesla.KBB editors' overview The Polestar 1, some may recall, is a premium plug-in-hybrid coupe with a steep Manufacturer's Suggested Retail Price (MSRP) of $156,500 (which includes a $1,500 destination fee). Only 100 are coming to the U.S. The new Polestar 2 is a totally different car, a pure-electric and much more affordable ($59,900) battery-powered sedan with a rear hatch. Check out: A first look at the futuristic Polestar Precept concept With the new 5-seat Polestar 2, company stylists have created a vehicle that looks part XC40 crossover-SUV, part S60 sedan. It looks good to our eye, and there's no doubt that the Polestar 2's main competition is the Tesla Model 3. The Polestar 2 is 3.5 inches shorter than the Model 3, with a roof that's 1.5 inches higher. Recently arrived and sold largely through Polestar.com, the all-wheel-drive (AWD) Polestar 2 is a good blend of performance and efficiency. Electric motors are used front and rear, powered by a 78-kWh lithium-ion battery mounted low in the chassis between the axles. The Polestar 2 has an expected range of 275 miles, and it hits 60 mph in a fleet 4.7 seconds. See: The 10 electric cars with the longest range As the EV world continues to grow, the new Polestar 2 competes with a wide variety of other electric vehicles besides the Tesla Model 3. Below it, there are the Chevrolet Bolt, Hyundai Kona Electric, and Kia Soul EV. Above it (in size and price), the Audi e-Tron and Jaguar I-Pace. And later this year, look for the Ford Mustang Mach-E. The Mach E, for the record, is about 5 inches longer than the Polestar 2.Driving the 2021 Polestar 2 We haven't driven a Polestar 2 yet. We plan to do so soon. We do know this: With a combined output of 408 horsepower and 487 lb-ft of torque, the Polestar 2 should be quick. And if it's like all other EVs we've driven, the power will be deliciously immediate. See: 8 new luxury SUVs for under $50,000Favorite features Google Services: The Polestar 2 is the first car with an Android infotainment system. As such, it offers Google GOOGL, +1.82%  Assistant (which understands voice commands in various languages), Google Maps (with real-time updates), and the Google Play Store (which has numerous apps). Polestar Gear Selector: Hollow and hexagonally shaped, the prominent gear selector commands attention with an illuminated Polestar symbol in its base. Aided by touch surfaces covered in a grippy matte finish, the Polestar 2's gear selector is said to be very responsive.2021 Polestar 2 interior In the 2021 Polestar 2, you sit a bit higher than in a typical sedan, because you are directly above the battery pack mounted in the floor of the chassis. The roof is a bit higher, too, to ensure plenty of headroom. Also see: These 3 EVs are the lowest cost to own over 5 years In Volvo tradition, the 5-seat interior of the Polestar 2 is blessed with a Scandinavian simplicity. Which is to say it doesn't look overloaded with controls and switches. Because it's not. Most controls, in fact, are located on the huge vertically oriented 11-inch touchscreen atop the center console, with a few additional switches on the thick-rim steering wheel. That prominent touchscreen is complemented by a digital cluster with gauges that are large and easy to read. The Polestar 2's heated front seats are covered in a vegan-friendly woven fabric, and large bolsters provide cornering support. In back, the heated bench has safety belts for three, but it's best if the center passenger is a small child. As a hatchback design, the Polestar 2 benefits from the 60/40-split back seat that folds forward to increase cargo capacity. Note: The Polestar has a front trunk as well, but it's a small one with less than 2 cubic feet of room. Volvo always has done interiors well, and the Polestar 2, with top-quality materials, is no exception. The Polestar 2. Polestar 2021 Polestar 2 exterior You've seen the pictures. You've seen the \"Thor's Hammer\" driving lights. You've noted the full-width blade-style taillights and the mildly fastback roof. Like us, you've probably deduced that the Polestar 2, with its sculpted body surfaces, looks like a member of the Volvo family. Maximilian Missoni, head of design at Polestar, provides some back story: \"We decided to bring something different to the segment. Our avant-garde design has evolved from Polestar 1 into an edgier, bolder statement. We have also designed a standard vegan interior with progressive textiles that will appeal to the forward-thinking audience who will subscribe to Polestar 2.\"2021 Polestar 2 standard features As you'd expect of the new Polestar 2, this AWD EV is equipped with lots of hardware beyond its AWD electric powertrain and generous safety suite. Additional standard equipment on the 2021 Polestar 2 includes 19-inch alloy wheels and a hands-free power tailgate. Other standard interior bits include four USB ports, heated front and rear seats, wireless smartphone charging, Sirius XM satellite radio, a 360-degree camera, and a heated steering wheel. Also, the Polestar 2 has one other neat feature - an acoustic warning system that helps pedestrians and cyclists take note of the vehicle when it's in motion. According to Polestar, the Acoustic Vehicle Alert System (AVAS) uses external speakers to make natural and subtle sounds that let pedestrians know the vehicle is coming. The Polestar 2 launch edition comes standard with the Plus Pack, which includes Pilot Assist, a huge sunroof, and a premium Haman Kardon sound system.2021 Polestar 2 options At this early point in the Polestar 2's life, the options list is delightfully brief. The $5,000 Performance Pack, aimed squarely at driving enthusiasts, includes Brembo brakes with gold mono-block calipers, sporty Ohlins shock absorbers, 20-inch forged alloy wheels, and gold-colored seat belts. Other options are a Nappa leather interior ($4,000), 20-inch alloy wheels ($1,200), and metallic paint colors ($1,200).2021 Polestar 2 powertrain The 2021 Polestar 2 uses two 204-horsepower electric motors, one at each axle. A 78-kWh lithium-ion battery mounts low in the chassis, between the front and rear axles. The battery is fully contained in an aluminum and steel case for safety reasons, and it automatically disconnects in the event of a collision. Also noteworthy: The Polestar 2 has two aluminum blocks on each side of its chassis, just aft of the front wheels. In a partial offset frontal collision, these reduce the chance of any object entering the passenger compartment and possibly damaging the battery.â\u0080¨â\u0080¨ AC synchronous electric motors front & rearâ\u0080¨ 78-kWh lithium-ion battery packâ\u0080¨ 408 horsepowerâ\u0080¨487 lb-ft of torqueâ\u0080¨ EPA-estimated range: 275 miles How much does the 2021 Polestar 2 cost? The 2021 Polestar 2, with deliveries expected this summer, has an MSRP of $59,900. As an EV, it's eligible for government rebates of approximately $2,000 in certain states and $7,500 at the federal level. Also see: The 10 best new car models of 2020 Equipped with all four options (the Performance Pack, a Nappa leather interior, 20-inch alloy wheels, and metallic paint), the 2021 Polestar 2 comes in at $71,300 (before government rebates). The destination charge for this all-wheel-drive 5-seat EV is $1,300. The $1 million question: How does the Polestar 2 compare to the Tesla Model 3? Briefly: The standard Model 3, with 220 miles of range, starts at $41,190. The Long-Range Model 3, with a range of 322 miles, starts at $50,190. The Performance Model 3, with 310 miles of range, comes in at $58,190. Note: All these Tesla prices include a destination charge of $1,200. Two other EVs to consider are considerably more expensive, and both lean more toward the SUV side of the spectrum. The Jaguar I-Pace, with a range of 234 miles, starts at $69,850. The Audi e-Tron, with a range of 204 miles, begins at $74,800. In a departure from most electric cars, the Polestar 2 will be sold in all 50 U.S. states exclusively via Polestar.com. Deposits of $1,000 are currently being taken. Don't miss: What it's like to drive a Tesla Model Y Later in 2020 though, some Polestar showrooms called \"Polestar Spaces\" are opening on the West Coast and in New York. There, noncommissioned Polestar specialists will help customers and arrange test drives. It's far too early to know Polestar 2 resale values. Similarly, it will be some time before we're able to establish a Kelley Blue Book Fair Purchase Price.Is it right for me? 2021 Polestar 2 has: Two electric motors (408 combined horsepower)â\u0080¨ All-wheel drive with 19-inch alloy wheelsâ\u0080¨ Adaptive cruise controlâ\u0080¨ Automatic emergency brakingâ\u0080¨ Android operating systemâ\u0080¨ Vegan-friendly interior 2021 Polestar 2 safety technology Forward-collision mitigation with automatic emergency braking-â\u0080¨Using cameras and radar, the Polestar 2 will sense an impending collision with a car, pedestrian, or large animal like a moose. When it does so, it will warn the driver and apply the brakes, if necessary, to prevent a collision. Commonly called automatic emergency braking. Blind-spot warning-â\u0080¨This system lets the Polestar 2 driver know when there's a car in the vehicle's rear three-quarter blind spot. If you try to change into an occupied lane, the Polestar 2 will steer itself gently back into its own lane. Rear cross-traffic alert-â\u0080¨Aided by radar sensors in its rear bumper, the Polestar 2 makes it safer to back out of tight parking spots. If the car senses any cross traffic, an audible warning will sound. If the driver does not respond, the brakes will be applied to prevent any possible collision. This story originally ran on KBB.com."}]}