{"article": [{"url": "https://www.marketwatch.com/story/unlimited-decks-of-cards-no-doubles-in-ping-pong-and-a-snitch-hotline-7-really-specific-rules-for-nba-players-at-disney-world-2020-06-17", "published": 1592737160.0, "headline": "Unlimited decks of cards, no doubles in ping-pong and a 'snitch' hotline: 7 really specific rules for NBA players at Disney World", "body": "The NBA is set to resume its season at the ESPN Wide World of Sports Complex in Disney World July 30. Not all teams will play out the rest of the season; 22 teams will vie for 16 playoff spots - and all games will be played at Disney World. Detailed rules for the NBA's proposed \"bubble\" in Orlando were sent to teams on Tuesday in a 100-plus-page document. Here are some of the really specific things about the NBA's bubble plan, according to people who have read it: 1) Players must throw away playing cards after each game NBA players are notorious card players. Whether it's on a plane or in a hotel room, card-playing has been a part of basketball players' down time for decades. The NBA is requiring all players to wear a mask while playing cards, and players must throw away the deck of cards when the game is over, according to ESPN. iframe.twitter-tweet { width: 100% !important; } \"Sufficient packs of cards will be available,\" according to the league. 2) Anyone who tests positive for COVID-19 must enter \"Isolation Housing\" The NBA has informed teams it will begin testing players for the coronavirus on June 23, and will continue testing every other day throughout the remainder of the season. Within the Disney DIS, +1.53%  bubble, anyone who tests positive will enter what the NBA is calling \"isolation housing.\" This will be a separate facility from the rest of the NBA campus. Those in isolation housing will be permitted to leave when they receive consecutive negative tests for the coronavirus, according to Shams Charania of The Athletic. 3) No pets allowed The handbook the NBA sent to teams claims the league is not contemplating allowing pets in the bubble, according to ESPN. iframe.twitter-tweet { width: 100% !important; } 4) Testing for recreational drugs will be suspended All testing for recreational drugs like marijuana will be suspended for the remainder of the 2020 season. Normally, players would be subject to fines and in some cases suspension for multiple positive drugs tests. The league will continue to conduct normal testing of performance-enhancing drugs and diuretics testing in Disney. 5) Players can wear 'smart rings' Players and staff will be provided with Oura smart rings that may help with early coronavirus detection as the rings monitor temperature, heart rate and respiration rate, according to The Athletic. iframe.twitter-tweet { width: 100% !important; } The rings will also feature an \"illness probability score\" that indicates if a player is at an increased risk of contracting the virus. While encouraged by the league, the wearing of the Oura ring is optional. 6) No playing of ping-pong doubles Among the amenities at the Disney complex will be pools, movie screenings, players-only lounges, video games and ping-pong. The NBA has gotten so specific about rules that it stipulated players can't play doubles, though. iframe.twitter-tweet { width: 100% !important; } 7) Players can call an anonymous hotline to \"snitch\" on others The NBA is setting up an anonymous hotline players can call to report any safety protocols within the Disney bubble being ignored, according to The Athletic. Whether it's not obeying the doubles rules in ping-pong, or not disposing of a deck of cards after a game, players will have the opportunity to \"snitch\" on one another, as Utah Jazz star Donovan Mitchell puts it. iframe.twitter-tweet { width: 100% !important; }"}]}