{"article": [{"url": "https://www.marketwatch.com/story/trump-is-openly-sabotaging-the-election-and-heres-how-you-can-stop-him-11597841132", "published": 1597833080.0, "headline": "Trump is openly sabotaging the election, and here's how you can stop him", "body": "To get around any possible delays by the U.S. Postal Service, you can drop off your ballot at officially designated locations. Joe Raedle/Getty Images  There's really no other way to say it: the president of the United States is trying to sabotage the U.S. election by denying the Postal Service money it needs to process voting by mail. It's not subtle, and it's not seriously disputed that he's trying to do this-in fact, President Donald Trump came right out and admitted what he's doing. It is welcome news that Postmaster General and Trump megadonor Louis DeJoy has announced that the Post Office \"will deliver the nation's election mail on time\" - but it is astounding that it was necessary to issue this statement. DeJoy's statement is essentially the equivalent of a bank telling customers it has enough money to meet any demands from depositors-it's the kind of thing that, one would think, would normally go without saying. The reason DeJoy felt compelled to issue this \"the sky is still blue\" statement is because voters have gotten concerned that they couldn't trust the Postal Service to carry out its normal function. These concerns did not materialize out of thin air: USPS had recently told 46 states and DC that it couldn't guarantee delivery of last-minute ballot requests in time for the election, and there were reports of delays in mail delivery. Sadly, it's worth updating and applying Ronald Reagan's old \"trust, but verify\" maxim to both DeJoy and Trump-although for this crew, we have to call it \"don't trust, but be absolutely sure to verify.\" Senators should hold DeJoy's feet to the fire if he testifies before the Homeland Security and Government Affairs committee this Friday. They should make sure they receive updates before the election in order to ensure that DeJoy fulfills his promise of on-time delivery in the context of the election. Senators should also gather information from rank-and-file postal employees in order to find out whether more changes are needed-for example, a reversal of DeJoy's \"bans on overtime and extra delivery trips.\" They should also make sure USPS has the money it needs to carry out its mission. Treasury Secretary Steven Mnuchin echoes his boss in saying aid supported by Democrats isn't necessary: senators should determine for themselves whether this is indeed the case. But we should also recognize that, even if DeJoy keeps to his word and the Postal Service has all the funding it needs, at least two other problems remain. First, damage to voter confidence may already have been done. Second, there is no indication that Trump has given up on his efforts to sabotage the election. It's clear that Trump's strategy has at least three related goals: 1) suppress the mail-in vote, which he believes will favor his opponent, Joe Biden; 2) allow Trump to claim victory on Nov. 3 if he's leading in the early returns while mail-in ballots remain to be counted; and 3) if none of that works and Biden wins anyway, baselessly plant enough doubt in the minds of his supporters that they will incorrectly believe the election was illegitimate. This perfidious effort to manipulate the election is nothing new and will come as no surprise to anyone who has been following Trump's twisted electoral strategy and, indeed, his political career. In 2016, Trump welcomed Russian assistance aimed at improving his chances in the election. When that episode was exposed, a number of Trump's associates were convicted of crimes. Breaking news: Trump campaign's contacts with Russia posed 'grave' risk in 2016, bipartisan Senate intelligence report concludes Last year, Trump tried to pressure Ukraine's president into illicitly tilting the electoral scales in Trump's favor by falsely smearing Joe Biden. When that plot was exposed, Trump was impeached. But Trump is resourceful when it comes to trying to stay in power, and impeachment didn't stop him from looking for ways to gain an underhanded advantage in the election (Sen. Susan Collins's hopes notwithstanding). People who have become attached to the notion of constitutional democracy can be forgiven if they are worried. But it's essential to take a deep breath, maintain perspective and not panic. Trump's actions reflect his desperation. He is trailing in the polls and knows he could use a boost-even an ill-gotten one. The fact that Trump is relying on a deeply immoral, possibly illegal scheme to shore up his chances at re-election does not guarantee he will succeed-far from it. One thing we have in our favor-those of us who feel strongly about free and fair elections-is that Trump's plan has been exposed with nearly three months to go before the election takes place. That means we have time to take a deep breath and make a plan for preserving our democracy against Trump's despicable efforts to take it away. Trump wants Biden voters to lose faith in the process and to incorrectly believe that there's no point to voting by mail. DeJoy's statement may help shore up some of that voter confidence-but, no matter what Trump, DeJoy or anyone else does, there are steps we can all take to make sure our vote is counted-no matter who we choose to vote for. Voting experts tell us there are concrete, specific actions all voters-no matter who they vote for-can take to make sure their vote counts (as Michelle Obama alluded to in her powerful speech last night). Here are a few important points to keep in mind, depending on the rules in your state (and please be sure to confirm information with your state and local election officials): If your state allows voting by mail and you need to request a mail ballot, don't wait-request it now. When you receive your ballot, again, don't wait-return it as soon as you can. One voting rights expert calls the strategy of moving promptly with mail-in ballots a good way to \"flatten the absentee ballot curve\". You can track your ballot online to receive confirmation that it was received and accepted. Alternatively, in some states you may be able to use a ballot drop box or you may be allowed to drop off your ballot at an election office or polling location, all of which can allow you to skip the mail process when you cast your ballot. In the 41 states that allow it, early voting can be another way to make sure your cote is counted. Some states begin early in person voting 45 days before the election and some have weekend voting options, meaning you don't have to wait until the last minute. As voting expert Michael McDonald says, \"You don't have to be afraid if your mail ballot does not arrive or [you decide you] don't want to vote [by mail]. You can always vote in-person. Election officials have safeguards to ensure no duplicate votes. You may need to bring your mail ballot (if you have it) or vote a provisional ballot.\" Trump has tried to scare voters out of using the mail by falsely making them think they may have to worry about their vote getting in on time. He knows this is naked deception-he's apparently using the mail himself to vote in Florida's primary, as he has in the past. Trump's actions are an act of desperation, the acts of an amoral man who knows he is trailing in the polls and will do whatever he can to try to gain an edge. Whether you use the mail or another available option (depending on where you live) you have the power here, not Trump. That's what it means to have a democracy-power resides in \"We the people\". It will require a little planning and now is certainly not a time to procrastinate when it comes to the most cherished right in a democracy. People in Belarus are risking and in some cases enduring torture to stand up for a free and fair election. Thankfully, we don't need the same level of courage to make our democracy work. If his efforts to undermine confidence in the Postal Service don't work, Trump will surely try something else-but he's running out of time. If we are careful, if we are responsible, and if we don't give in to Trump's scare tactics, we have all the tools we need to make sure our vote is counted-which is the last thing Trump wants, as his cartoon villain actions make clear. Chris Edelson is an assistant professor of government in American University's School of Public Affairs. He has written two books on presidential power. Follow him at @ChrisEdelson on Twitter."}]}