{"article": [{"url": "https://www.marketwatch.com/story/biden-to-call-for-2-trillion-in-clean-energy-spending-and-zero-power-plant-emissions-by-2035-2020-07-14", "published": 1594831280.0, "headline": "Biden calls for $2 trillion in clean-energy spending and zero power-plant emissions by 2035", "body": "Joe Biden on Tuesday proposed a plan to eliminate carbon pollution from power plants by 2035, while calling for spending $2 trillion over four years on clean energy projects. The presumptive Democratic presidential nominee detailed his plans in a speech in Wilmington, Del. It was the latest in a series of policy proposals to be rolled out by the former vice president, as the U.S. continues to battle the coronavirus pandemic. Investments in clean energy are a “win, win, win for this country,” Biden said, “creating jobs, cutting energy costs, protecting our climate.” The plan represents a more aggressive proposal from Biden, and comes after a task force that includes former primary rival Sen. Bernie Sanders recommended the 2035 target date. “We’re not just going to tinker around the edges,” Biden said Tuesday. “We’re going to make historic investments and seize the opportunity and meet this moment in history.” From the MarketWatch archives (January 2020):Microsoft aims to be ‘carbon negative’ by 2030 See also:The Biden-Sanders climate-change policy pact: 8 key features During the Democratic primary, Biden offered a $1.7 trillion plan with the goal of achieving net-zero emissions by 2050. With the pandemic expected to have a long-lasting effect on the U.S. economy, Biden says his plan is aimed at “creating the jobs we need to build a modern, sustainable infrastructure now and deliver an equitable clean energy future.” Biden, as he had earlier in his campaign, pitched in his Tuesday speech the need for a “second great railroad revolution” for both passenger and freight transport, including halving the duration of an Amtrak trip from New York to Washington and initiating or reinvigorating high-speed-rail projects in California, the South, the Midwest and elsewhere. The longtime daily Amtrak rider’s campaign site notes that the U.S. has fallen well behind such countries as France, Spain and China, among others, in high-speed passenger rail. Biden has pledged to reverse the 2017 Republican tax-code overhaul to pay for his policy proposals. Hogan Gidley, the Donald Trump re-election campaign’s national press secretary, likened the Biden plan to “a socialist manifesto,” telling the Washington Post that it “promises to massively raise taxes, eliminate jobs in the coal, oil or natural gas industries, and crush the middle class. He’s pushing extreme policies that would smother the economy just when it’s showing signs of roaring back.” Read on:Fact checking the Republican claim that Biden plans to defund the police, and Biden’s claim that Trump put brake on coronavirus tests"}]}