{"article": [{"url": "https://www.marketwatch.com/story/democrats-seek-more-safety-as-mcconnell-eyes-approval-process-for-scotus-nominee-11601933105", "published": 1601919200.0, "headline": "Democrats seek more safety as McConnell eyes approval process for SCOTUS nominee", "body": "President Donald Trump announces his U.S .Supreme Court nominee, Judge Amy Coney Barrett, at the White House on Sept. 26. (Getty Images) Senate Democratic Leader Chuck Schumer called on Republicans to put in place coronavirus testing for lawmakers if they intend to move ahead with the confirmation process of U.S. Supreme Court nominee Amy Coney Barrett. Schumer’s request, likely to fall on deaf ears, illustrates the hurdles Democrats face in trying to delay Barrett’s nomination procedurally, even after Senate Majority Leader Mitch McConnell postponed the Senate’s return to regular session this month by two weeks in the wake of several Republicans testing positive for the virus. “Instead of engaging in continuously more absurd and dangerous behavior, (Judiciary Committee) Chairman (Lindsey) Graham should halt this already illegitimate nomination process, and if he refuses, he must put into place a thorough testing procedure that is in accordance with CDC best practices before hearings can take place,” Schumer said Monday. “Every senator and relevant staff must have negative tests on two consecutive days and have completed the appropriate quarantining period, and there should be mandatory testing every day of the hearing,” he said. But McConnell late Monday said the Senate was “full steam ahead with the thorough and timely confirmation process that Judge Barrett, the Court and the nation deserve.” McConnell said Democratic objections were about delaying the vote, not safety. “This body will not cease to function just because Democrats are afraid they may lose a vote,” he said. Two GOP members of the Judiciary Committee, Sen. Mike Lee, from Utah, and Sen. Thom Tillis, of North Carolina, announced they have tested positive for the virus. Another Republican, Sen. Ron Johnson of Wisconsin, has also tested positive and several others have said they will quarantine after being exposed to the virus-laden senators. Still, none of that is expected to delay the hearings, which Graham said Saturday will take place over four days, beginning Oct. 12. The first day will be for opening statements, with questioning to start the next day and testimony from legal experts and people who know Barrett personally to follow afterwards. The hearings are expected to be a hybrid of in-person and virtual, over Democratic objections. The Judiciary Committee has held 21 hybrid hearings since the onset of the pandemic, and Democrats have regularly participated in them, though some have said a Supreme Court justice confirmation hearing should be in-person only. According to Judiciary Committee rules, any member can ask that a matter, bill, or nomination be delayed “until the next meeting of the Committee or for one week, whichever occurs later.” That, combined with the committee waiting for answers to written questions from senators, could add more time to the committee’s consideration. But the longer Barrett stays in committee, the closer Senate Republicans will be to a full complement, assuming none of the senators testing positive or isolating after exposure experiences any further trouble. Republicans need only 51 votes, which can include Vice President Mike Pence’s tie-breaking one if needed, to confirm Barrett on the Senate floor. Schumer said he asked for the testing Monday because of a report Republicans could allow senators to vote from the public gallery in the Senate, should they be recovering from or infectious with coronavirus. Johnson told a Denver radio station Monday “I’ll go in a moon suit” to the Senate floor if needed to vote for Barrett. Sen. Tom Cotton, an Arkansas Republican, said there was in both parties a history of ensuring even frail lawmakers vote when their votes could be decisive. “There is a long and venerable tradition of ill or medically infirm senators being wheeled in to cast critical votes on the Senate floor,” including deceased West Virginia Democrat Robert Byrd in 2009 with the Affordable Care Act, he said. “I’m confident that every senator will be in attendance when his or her vote is needed,” he said."}]}