{"article": [{"url": "https://www.marketwatch.com/story/wholesale-prices-drop-in-june-us-inflation-still-low-due-to-the-coronavirus-pandemic-2020-07-10", "published": 1594374680.0, "headline": "Wholesale prices drop in June, U.S. inflation very low due to the coronavirus pandemic", "body": "The numbers: The wholesale cost of U.S. goods and services fell in June, reflecting depressed demand in retail and other major parts of the economy caused by the coronavirus pandemic. The producer price index declined 0.2% last month, the government said Friday. Economists polled by MarketWatch had predicted a 0.4% increase. Wholesale inflation has fallen 0.8% in the past year, unchanged from May. By contrast, wholesale inflation was rising at a 1.6% pace just a year ago. Most companies have had to cut prices to drum up sales as reluctant customers worried about the pandemic hoarded their cash. That trend is likely to persist until the virus is contained. Another measure of wholesale costs known as core PPI — which excludes food, energy and trade margins — rose 0.3% last month. It was the biggest increase since January, but the spike is unlikely to last. The core rate is slightly negative in the past year. Read:Jobless claims fall to four-month low of 1.31 million in early July, but layoffs still high See: MarketWatch Economic Calendar What happened: Most of the increase in producer prices last month was tied to trade margins for wholesalers and retailers, a volatile category that often causes distortions in the underlying rate of inflation. As such economists tend to dismiss trade margins. The wholesale cost of goods, meanwhile, rose 0.2% mostly because of another increase in gasoline prices. The price of oil slumped earlier in the year, and while prices have rebounded, the cost of filling up is still very low with Americans driving less. Fewer people are going on vacation or driving far distances while the coronavirus is still very active. The cost of food went in the other direction. Price fell in 5.2% in June after a 6% increase in May. The cost of meat sank almost 28%. The viral outbreaks at meat-packing plants that triggered a surge in prices in May have been brought under control and the threat of shortages has receded. Read:Federal Reserve leaders see ‘bumpier’ recovery, slower decline in unemployment Big picture: Prices have fallen for many goods and services because of reduced demand. Millions of people are still out of work and businesses are unwilling to hire or invest until they get more clarity on the direction of the economy. Even with the Federal Reserve pumping huge sums of money into the economy, inflation is likely to remain low until the crisis is over. The central bank has dropped a key interest rate to near zero and plans to leave it there for the next year or more. What they are saying? “COVID caused global demand to collapse, which is ultimately deflationary, but it also caused all kinds of supply disruptions, which are momentarily inflationary,” said chief economist Chris Low of FHN Financial. “The result is generally falling prices amidst a great deal more price volatility than has become the norm in the past decade.” “PPI decline confirms inflation should be the least of our worries,” wrote Lydia Boussour and Gregory Daco of Oxford Economics. Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open lower in Friday trades."}]}