{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-dead-never-says-this-lifelong-resident-i-for-one-will-not-forsake-my-city-she-stole-my-heart-when-i-was-five-2020-08-19", "published": 1598370920.0, "headline": "â\u0080\u0098New York City, dead? Pshaw!â\u0080\u0099 says this lifelong resident. â\u0080\u0098I, for one, will not forsake my city. We roll up our sleeves and helpâ\u0080\u0099", "body": "NEW YORK â\u0080\u0094 I remember the Daily News headline: â\u0080\u009cFORD TO CITY: DROP DEAD.â\u0080\u009d It seemed preposterous. Gerald Ford had announced at the National Press Club the day before that he would veto any federal financial bailout for New York City. Also, he never actually used those words. Still, a president threatening the capital of the western world? Pshaw! I had known I would live in New York City since my earliest family excursions there as a tyke. As the family car would ascend the rise over Queens that revealed the skyline, I was filled with awe and wonder. I had to be there to know it. “ â\u0080\u0098New York City was alive in a way the suburbs couldnâ\u0080\u0099t touch: teeming with the creative expression and diversity that seemed stifled by neat green lawns.â\u0080\u0099 ” I had begun to regularly commute to the city by train or car from Long Island in my early teens. My lifelong fascination was becoming a full-blown love affair. New York City was alive in a way the suburbs couldnâ\u0080\u0099t touch: teeming with the creative expression and diversity that seemed stifled by neat green lawns and nice families. In 1975, I was devouring theatre on and off Broadway, the sprouting art scene in Soho, the cafes and jazz clubs of Greenwich Village and the concerts at Carnegie Hall, the Beacon Theatre and Lincoln Center and in Central Park. Gerald Ford didnâ\u0080\u0099t frighten me. I was already a New Yorker in my mind. Iâ\u0080\u0099ve lived here, in three different boroughs, since 1981. Itâ\u0080\u0099s sometimes said, â\u0080\u009cThis city is for the young and the rich.â\u0080\u009d Iâ\u0080\u0099ve been young in New York, and my life here has been more than rich. Iâ\u0080\u0099ve watched the Thanksgiving Day Parade from the Dakota and had gigs waiting tables and driving Rolls Royces. Iâ\u0080\u0099ve done carpentry and painting, and had too many sunrises legal proofreading. Iâ\u0080\u0099ve taken over restaurants in water-pistol fights with Andy Warhol, Jerry Hall and the artist Keith Haring; walked the avenue with Gregory Peck as he obliged Atticus fans by graciously kissing their babies. â\u0080\u0098The leaners are going to reject a NYC that isnâ\u0080\u0099t how theyâ\u0080\u0099ve decided itâ\u0080\u0099s supposed to remain. The lifters will look to care for and tend to the needs of the present,â\u0080\u0099 writes Matthew Conlon. (Photo: New York, April 2020 by Angela Weiss/AFP via Getty.) You canâ\u0080\u0099t put a â\u0080\u009cbest beforeâ\u0080\u009d tag on New York. Iâ\u0080\u0099ve had after-hours encounters with the legendary jazz bass player Jaco Pastorius and Sassy (Sarah Vaughan) in Harlem. They were the days when creativity, the feeling of possibility and, yes, crime, were high in New York. I was robbed at gunpoint and humbled in service for the homeless: Park Avenue to park bench! But it is an unfinished journey. And yet itâ\u0080\u0099s becoming a trend of late to pronounce New York dead. A recent Twitter TWTR, -0.23% Â retweet by President Trump said: â\u0080\u009cLeave Democrat cities. Let them rot.â\u0080\u009d A piece in MarketWatch this month quoted a financial author and â\u0080\u009cproudâ\u0080\u009d New Yorker who bemoaned the COVID-related loss of the commercial and residential real-estate frenzy, cultural gatherings and his favorite restaurants. He predicts a permanent flight from Gotham: â\u0080\u009cItâ\u0080\u0099s finished.â\u0080\u009d He said it wonâ\u0080\u0099t recover this time. â\u0080\u009cThis is different!â\u0080\u009d he said. Of course, itâ\u0080\u0099s different. Itâ\u0080\u0099s always different. No one had ever incinerated buildings with jetliners until 19 years ago. As I recall, all of these gloomy inevitabilities were looming post-9/11, as a city galvanized and girded, uniting against terror and dread. It was a wonder to behold. And this time is different from 9/11. Something that returns as different â\u0080\u0094 even vastly different â\u0080\u0094 is not dead. Recovery and redemption are not â\u0080\u009cdeadâ\u0080\u009d or â\u0080\u009cfinished.â\u0080\u009d There are things lost forever about the scrappy New York of the â\u0080\u009970s that I miss and there are things about the hyper-monetized New York of 2019 that I would gladly part with. But change isnâ\u0080\u0099t death. â\u0080\u0098Something that returns as different â\u0080\u0094 even vastly different â\u0080\u0094 is not dead,â\u0080\u0099 Matthew Conlon writes. â\u0080\u0098Recovery and redemption are not dead or finished.â\u0080\u0099 (Photo: New York Daily News cover on Oct. 29, 1975.) Dispatches from a Pandemic: New York is reminiscent of the Wild West ghost town of my youth â\u0080\u0094 our cityâ\u0080\u0099s future depends on our collective fortitude Doubtless, New York City is down and reeling: More than 32,000 souls perished in the dark months when New York state was the epicenter of the coronavirus pandemic. The loss and fear were traumatizing. There has been significant flight of businesses and residents, and a gutting of indoor gatherings in theaters, restaurants and the like. I, for one, will not forsake my city. She stole my heart when I was 5. I was working out of town in mid-March when my work was suspended. I have remained away in a bubble since quarantine to be available to my fragile, elderly parents on Long Island, and keep them in their home. My wife and I return to our apartment periodically and continue to pay rent and overhead on our city businesses. “ â\u0080\u0098The great metropolises â\u0080\u0094 Rome, Paris, London, Berlin â\u0080\u0094 have all been wracked by plagues and war and upheaval.â\u0080\u0099 ” Weâ\u0080\u0099re not bailing. New York is where we trained for and entered our professions. Itâ\u0080\u0099s where we met and fell in love and married. But more than that, New York is where we made a compact to commune with the entirety of humanity, not just the people like us. We live in a time fueled by grievance and entitlement. Sure, the narcissists of the world have always come to New York. But New York has also always been the destination for dreams and possibility. The bemoaning of a lost New York City of sensory indulgence ignores the wealth of history of the city I revere: the city of inclusion, of the great societal advances that followed the Triangle Shirtwaist Fire and the Great Depression. New York and New Yorkers donâ\u0080\u0099t kick her when sheâ\u0080\u0099s down. We roll up our sleeves and help. The loss of residents and businesses, of restaurants, bars and theaters, is terrible. The road back will be arduous, and no one can know what lies ahead. Itâ\u0080\u0099s the same the world over. As someone once said, â\u0080\u009cWeâ\u0080\u0099re in the hallway,â\u0080\u009d unsure of where it leads. Nobody likes the hallway. Not â\u0080\u009cknowingâ\u0080\u009d sucks. â\u0080\u0098The city I revere: the city of inclusion, of the great societal advances that followed the Triangle Shirtwaist Fire and the Great Depression.â\u0080\u0099 (Photo: New York, August 1979 by Frances M. Ginter/Getty.) To say New York is finished, however, gravely underestimates the human heart and spirit that have always infused her. The extraordinary capacity of New Yorkers was revealed in both the nightly celebration of health-care and essential workers, and in the humility and discipline that have made the city and state the model for how to quash and reopen in the midst of a novel coronavirus. Whatâ\u0080\u0099s more, not everyone can leave. My Brooklyn-born dad always spoke to me of â\u0080\u009clifters and leaners.â\u0080\u009d The â\u0080\u009cleanersâ\u0080\u009d are going to reject a New York that isnâ\u0080\u0099t how theyâ\u0080\u0099ve decided itâ\u0080\u0099s supposed to remain. The â\u0080\u009cliftersâ\u0080\u009d will look to care for and tend to the needs of the present. In many ways, the rampant income inequality and gentrification of the past 20 years were bound for a correction of some kind. They werenâ\u0080\u0099t sustainable. New York will become something itâ\u0080\u0099s never been before. Kinder and gentler? Weâ\u0080\u0099ll see. But finished? Pshaw! Tough times lay ahead. New York is not going to be â\u0080\u009cfinishedâ\u0080\u009d by a pandemic, though. The great metropolises â\u0080\u0094 Rome, Paris, London, Berlin â\u0080\u0094 have all been wracked by plagues and war and upheaval. And the throngs return, as they will to New York, a great metropolis. Death knell be damned. Go ahead â\u0080\u0094 kvetch. Leave! Get out of the way; thereâ\u0080\u0099s good work to be done. Matthew Conlon is an actor based in New York City. This essay is part of a MarketWatch series, â\u0080\u0098Dispatches from a pandemic.â\u0080\u0099 Matthew Conlon has called New York home for most of his adult life: â\u0080\u0098The loss of residents and businesses, of restaurants, bars and theatres, is terrible. The road back will be arduous, and no one can know what lies ahead.â\u0080\u0099 (Photo: Tom Kochie.)"}]}