{"article": [{"url": "https://www.marketwatch.com/story/ive-been-working-at-home-during-the-pandemic-do-i-qualify-for-any-tax-breaks-11602100997", "published": 1602226460.0, "headline": "Iâ\u0080\u0099ve been working at home during the pandemic â\u0080\u0094 do I qualify for home office tax deductions?", "body": "Working from home has become the norm for many, but only a few qualify for home office tax breaks. (Photo by OLI SCARFF / AFP) (Photo by OLI SCARFF/AFP via Getty Images) AFP via Getty Images Say youâ\u0080\u0099ve had to work from home during the COVID-19 crisis. Join the club. Like many others who are lucky enough to be able to do their jobs from home, you might now be wondering if you can claim a federal income tax deduction for home office expenses. As things currently stand, the answer is no unless youâ\u0080\u0099re self-employed. But the answer could change if Congress grants additional COVID-19-related tax relief. Hereâ\u0080\u0099s what you need to know about home office write-offs as things stand right now.Â No home office deductions for employees Before the Tax Cuts and Jobs Act (TCJA), an employee could potentially claim itemized deductions for unreimbursed employee business expenses â\u0080\u0094including home office expenses â\u0080\u0094if you used a home office for the convenience of your employer. In that case, you could lump the home office expenses together with other miscellaneous expenses â\u0080\u0094 such as fees for investment advice, tax advice, tax preparation, and union dues. If your total miscellaneous expenses exceeded 2% of your adjusted gross income (AGI), you could write off the excess â\u0080\u0094 as long as you itemized deductions.Â Â Unfortunately, that was then and this is now. For 2018-2025, the TCJA suspended write-offs for miscellaneous deductions that were formerly subject to the 2%-of-AGI rule. So, under current federal-income-tax law, an employeeâ\u0080\u0099s home office expenses are non-deductible. Period. That could change if Congress grants additional COVID-19 tax relief in future legislation. However, the idea of allowing home office deductions for employees during the COVID-19 mess does not seem to have gained any traction so far. But that could change and I hope it does. Stay tuned.Â Self-employed folks can still claim home office deductionsÂ If youâ\u0080\u0099re self-employed, you can still deduct home office expenses under the same federal income tax rules that applied before the TCJA. Specifically: Home office deductions are allowed if you use part of your residence during the tax year regularly and exclusively as: (1) a principal place of business or (2) a place to meet with customers or clients. For a separate structure such as a converted barn, pool house or detached garage, deductions are allowed if you simply use the space regularly and exclusively for any business purpose.Â A home office qualifies as your principal place of business if most of your income-earning activities occur there. It can also be your principal place of business if you use it to conduct administrative or management functions (like keeping the books and sending out invoices) and donâ\u0080\u0099t conduct those functions at any other fixed location.Â Â Â Key point: Exclusively means you use the office space only for business purposes for the entire year.Â The rest of this column is devoted to home office deduction issues for self-employed individuals. Here goes.Â Â Â Â Â Â Â Â Â Â You can deduct direct and indirect expensesÂ Expenses that are directly allocable to your self-employed home office space, such as repair and maintenance costs, are fully deductible as long as you donâ\u0080\u0099t run afoul of the business income limitation explained later. You can also deduct indirect home office expenses â\u0080\u0094 such as utilities, property taxes, casualty insurance premiums, homeowner association fees, security monitoring, depreciation for a residence that you own, rent for a rented residence, and so forth. A percentage of these expenses can be allocated to the home office space based on square footage or the number of rooms in the residence (assuming all the rooms are of similar size). These indirect expenses are also subject to the business income limitation.Â Key Point: You need not own your residence to claim self-employed home office deductions. You can deduct allowable expenses from a home that you rent (including a percentage of the rent), as long as you meet the aforementioned usage rules for the home office part of the residence.Â Special rule for inventory storage spaceÂ Self-employed expenses allocable to space in your residence that is regularly used for storing inventory or product samples for a retail or wholesale product sales business are deductible if the space is the sole fixed location of the business. In this scenario, exclusive use of the space is not required, but regular use is required. For example, itâ\u0080\u0099s OK if you use part of your den to store inventory.Â Special rule for daycare businessesÂ You can claim home office deductions for self-employed expenses allocable to space that is regularly used for your business of providing day care for children, folks who are age 65 or older, or people with physical or mental disabilities. In this scenario, exclusive use of the space is not required, but regular use is required. For example, itâ\u0080\u0099s OK if you use your kitchen, den, and bedrooms for a daycare business.Â Â Â Â Business income limitationÂ As a self-employed individual, your allowable home office deductions are limited to the gross income from your business activity reduced by: (1) other expenses for which deductions are allowed in the absence of business use (such as home mortgage interest and real estate taxes) and (2) business deductions that are not allocable to the use of the home (such as advertising and supplies). If some of your deductions are disallowed under this rule, the disallowed amount is carried forward to the following tax year, subject to the same limitation in that year.Simplified deduction is simple but skimpyÂ Â A few years ago, the IRS introduced a simplified method for calculating home office deductions. It allows you to annually deduct $5 per square foot of space that is used for business, limited to 300 square feet. The advantage of the simplified method is that you need not keep proof of your actual home office expenses. The disadvantage is that your maximum deduction is limited to only $1,500 ($5 x 300). Self-employed individuals who choose to use the simplified method must still satisfy all the home office deduction eligibility requirements explained earlier (regular use for business purposes, business income limitation, and so forth).Â Can self-employed individuals deduct costs to improve existing deductible home office space? Good question. The Coronavirus Aid, Relief, and Economic Security Act (CARES Act) included a retroactive technical correction that allows taxpayers to claim 100% first-year bonus depreciation or 15-year straight-line depreciation for the cost of qualified improvement property (QIP) thatâ\u0080\u0099s placed in service in 2018-2022. QIP is defined as an improvement to the interior portion of a nonresidential building that is placed in service after the date the nonresidential building was first placed in service. However, QIP does not include any improvement for which the expenditure is attributable to the enlargement of the building, any elevator or escalator, or the internal structural framework of the building.Â So, if you are a self-employed individual with an existing deductible home office, that space might qualify as a nonresidential building that youâ\u0080\u0099ve already placed in service for business purposes. Therefore, if you spend money to improve the office space, the improvements might meet the definition of QIP. If so, you could claim 100% first-year bonus depreciation or 15-year straight-line for the costs. Is any of this totally clear? No. Are we likely to see IRS guidance that provides some clarity? Donâ\u0080\u0099t hold your breath. Consult your tax advisor on this issue.Â Key point: The CARES Act technical correction has retroactive effect for QIP that was placed in service in 2018 and 2019. Before the correction, you generally had to treat QIP placed in service in those years as nonresidential real property that had to be depreciated over 39 years using the straight-line method. So, you may have filed a 2018 or 2019 return that treated home office expenditures that could potentially be classified as QIP in less-than-optimal fashion. If so, an amended return for one or both of those years may be in order. Once again, consult your tax advisor.Â Â Â Â Â Â The bottom line For a self-employed individual, federal income tax home office deductions can amount to thousands of dollars every year and be a major tax-saver. Employees are out of luck under the current rules. In most cases, the biggest hurdle for a self-employed person is meeting the regular-and-exclusive-business-use requirement for the office space. That requirement must be met for the whole year. The best way to prove regular and exclusive use is to take photos of your office space and keep them with your tax records. Having a couch, some chairs, a TV, a bathroom, and even a wet bar and bedroom will not disqualify you. After all, you can find all these things in offices of corporate executives.Â"}]}