{"article": [{"url": "https://www.marketwatch.com/story/this-is-one-trump-tax-cut-you-really-dont-want-2020-09-08", "published": 1599588140.0, "headline": "This is one Trump tax cut you really donâ\u0080\u0099t want", "body": "President Donald Trump wants to kill the payroll tax, which could potentially be devastating to Social Security and Medicare. Now obviously Trump canâ\u0080\u0099t come out in an election year and explicitly say he wants to hurt these established government programs â\u0080\u0094 not even Trump could be so dumb. So instead heâ\u0080\u0099s hidden his agenda in a giant Trojan Horse that looks, to the naive eye, like an innocuous tax cut. Sadly, most voters donâ\u0080\u0099t know that the payroll tax is how Social Security and Medicare are financed. So if they accept Trumpâ\u0080\u0099s â\u0080\u009cgiftâ\u0080\u009d â\u0080\u0094 killing the payroll tax and making it permanent â\u0080\u0094 (as he said on Aug. 8) â\u0080\u0094 it could, theoretically, hurt two key social safety net programs that almost 70 million Americans depend on. Yet many of Trumpâ\u0080\u0099s supporters â\u0080\u0094 who tend to skew older and rely on these programs themselves â\u0080\u0094 seem clueless about this. Of course, you can rest easy for the moment because Trumpâ\u0080\u0099s desires in this case are meaningless. It could never happen politically, because, for one, Democrats control the House and based on current analysis, could add to their present majority in November. And two, the odds are growing that Democrats could even take the Senate as well. Such a scenario in this era of infrequent ticket-splitting also implies that Joe Biden will take the White House. Even if Trump wins, the prospect of at least the House being controlled by the opposition is all but guaranteed. Read:Why you might not know that Trump is threatening your Social Security But â\u0080\u0094 and this is what I want you to focus on here â\u0080\u0094 Social Security is in trouble regardless of whoever is in the White House. It is now paying out more than it is taking in and by 2031, the nonpartisan Congressional Budget Office said this week, its current surplus of some $2.9 trillion is projected to be tapped out. This is a huge change. As recently as late April, the Social Security Trustees, led by chief Trustee Steven Mnuchin, said the surplus would last until 2035. So in just four months, Social Securityâ\u0080\u0099s day of reckoning has accelerated by four years. What happens then? The Trustees warned in April that when the surplus is exhausted, Social Security would then be able to pay just 76% of scheduled benefits â\u0080\u0094 based on whatever payroll taxes will be coming in then. So if you plan on being in your â\u0080\u009cgolden yearsâ\u0080\u009d a decade from now, you might consider that they might not be so golden. Why such a rapid erosion of Social Securityâ\u0080\u0099s finances? Several reasons. First, payroll taxes. Tens of millions of Americans have been either furloughed or flat-out laid off as a result of the coronavirus pandemic. Theyâ\u0080\u0099re not paying into the system, yet benefits continue to be paid out at pre-pandemic levels. Second, thereâ\u0080\u0099s evidence that many older Americans, low on cash and unable to find work, are opting to take Social Security as soon as they are eligible â\u0080\u0094 at age 62. Most financial advisers say itâ\u0080\u0099s best to delay taking Social Security as long as you can, because benefits will be bigger. But if you need cash now, waiting is not an option. Current U.S. demographic trends also threaten Social Security. While itâ\u0080\u0099s a blessing that U.S. life expectancy is gradually increasing, it means more Americans are living longer, and getting benefits longer. Look at these numbers: There are about 76 million baby boomers between the ages of 55 and 74, and some 25 million people are older than that. Within that group, there are 8 million to 10 million so-called â\u0080\u009csuper-seniorsâ\u0080\u009d who are 85 or older. In 2016, this group was about 1.9% of the U.S. population, according to the Census Bureau. In 2040, it will double to 3.8% of the population. Who will support these people? The U.S. birth rate is growing at its slowest rate in three decades, and yet the Trump administration wants to curtail even legal immigration, which would help boost the number of younger workers needed to keep the Social Security system healthy. Somethingâ\u0080\u0099s got to give. There are ways to shore up Social Security. All of them involve pain. The minimum retirement age could be gradually raised, for example â\u0080\u0094 say one month per year, meaning that in a dozen years, youâ\u0080\u0099d have to be 63 to be eligible for benefits. This is a de-facto benefit cut, of course. Taxes also could be raised. Currently the income cap on payroll taxes is $137,700. Since most Americans donâ\u0080\u0099t make anywhere near that kind of money, this move may be politically more viable for lawmakers. But doing the exact opposite and killing the payroll tax completely? Thatâ\u0080\u0099s a recipe for disaster. Trump thinks itâ\u0080\u0099s a great idea. Fortunately, most everyone else doesnâ\u0080\u0099t. Read: The Trump administration wants to discourage your 401(k) from including ESG investment options More: Todayâ\u0080\u0099s older workers may see the first cuts to Social Security benefits"}]}