{"article": [{"url": "https://www.marketwatch.com/story/arizona-hospitals-at-83-capacity-as-coronavirus-cases-surge-2020-06-10", "published": 1591820900.0, "headline": "Arizona hospitals at 83% capacity as coronavirus cases surge", "body": "GLENDALE, Ariz. — Arizona hospitals that are expected to be able to treat new cases of coronavirus without going into crisis mode were above 80% capacity, a milestone that should trigger an automatic stop to elective surgeries at affected hospitals as the state becomes a hotspot. The report showing statewide bed capacity of 83%, released Wednesday by the Department of Health Services, comes as the state deals with a surge in virus cases and hospitalizations that experts say is likely tied to Gov. Doug Ducey’s ending of statewide closure orders in mid-May. Ducey has been criticized for not adding requirements that could prevent a surge, and some say the time to put those measures in place has come. “If we don’t do some things right now we’re going to end up either at a stay-at-home order or over-capacity or both,” former state health director Will Humble said. “But the things that we can do now, they’re going to take time to work.” They include better infection control in nursing homes, masks in public and allowing cities to crack down on bar districts where social distancing has been ignored, Humble said. Ducey did none of those things when he lifted his orders last month. Halting elective surgeries would greatly affect patients, since surgical procedures affect their quality of life in measurable ways and are needed. And it would be a major financial blow for hospitals who get a major portion of their revenue from procedures. Many hospitals instituted furloughs, pay cuts or other savings measures during the first ban on elective surgeries. Health Services Department Director Dr. Cara Christ said her agency is looking at the bed use data supplied by hospitals and trying to determine if elective surgeries should stop. She declined to name the hospitals or hospital chains that concern her. “Hospitals will always get a chance to dispute our initial findings or provide data that may show us a different picture,” Christ said. “So we are going to be working with some of the hospitals on that.” None of the hospital chains contacted by The Associated Press said they were halting surgeries. Banner Health, the state’s largest system with about half the state’s beds, said it was below the threshold. But there are some hospitals that have acted, said Ann-Marie Alameddin, president and CEO of the Arizona Hospital and Healthcare Association. “I have heard of hospitals that have cancelled procedures to make sure they are preserving that extra capacity,” Alameddin said. “It’s a financial issue, but hospitals are going to manage their patient care appropriately to make sure they can meet the needs of the community if there is a patient surge.” Ducey halted elective surgeries on March 19 to preserve personal protective equipment like masks and gowns in the early part of the pandemic. The rules established under an executive order Ducey issued in April that allowed hospitals to resume elective surgeries are clear: Hospitals can only perform them if they have at least 20% of their beds available. Arizona hospitals were are 83% of capacity on Tuesday, up from 78% the previous day, according to state data. The state also exceeded 80% one day last week. The state has seen a major surge in virus patients that started about 10 days after Ducey’s stay-home order and other restrictions ended on May 15. That’s about the period of time it takes the virus to begin causing symptoms in patients. The state reported 1,556 new cases Wednesday and 25 new deaths. That brings the total cases to 29,852 and deaths to 1,095. For most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some — especially older adults and people with existing health problems — it can cause more severe illness, including pneumonia, and death. Dr. Marjorie Bessel, Banner’s chief clinical officer, has been urging the public to take steps to slow the spread of the virus. They include wearing masks, limiting exposure in public spaces, frequent hand-washing and more. “We do have an ability to mitigate the spread of this virus right now – it’s not necessarily the message that people always want to hear, but it is the message of what we know about the virus.” Not taking those steps will impact people needing care at hospitals and the staff, who will be overworked. And if Banner is forced to end elective surgeries, that’s a big deal, she said. “Elective surgeries – they’re a little bit of a misnomer,” Bessel said. “These are necessary surgeries – they’re medically necessary surgeries.” That means they are needed surgeries, just not so urgent that they need to be done immediately, “Anybody’s who’s had a surgery knows that,” she said. “If you need a surgery you need a surgery.” Dr. Rebecca Sunenshine, Maricopa County’s disease control director, said the county is now urging everyone to wear masks in public. That’s a reversal for Sunenshine, who early in the pandemic said there was no evidence they could help prevent the virus’ spread. “Now there is a mounting body of scientific evidence that shows that cloth face mask, a well-fitted cloth face mask, can prevent COVID-19 from spreading,” Sunenshine said Wednesday. She also noted a huge surge of cases in the county, the state’s most populous. A full 27% of the 15,200 cases have come in the past week."}]}