{"article": [{"url": "https://www.marketwatch.com/story/trump-to-author-bob-woodward-on-virus-i-wanted-to-always-play-it-down-11599678426", "published": 1599664520.0, "headline": "Trump to author Bob Woodward on virus: â\u0080\u0098I wanted to always play it downâ\u0080\u0099", "body": "WASHINGTON (AP) â\u0080\u0094 President Donald Trump seemed to understand the severity of the coronavirus threat even as he was telling the nation that the virus was no worse than the seasonal flu and insisting that the U.S. government had it totally under control, according to a new book by journalist Bob Woodward. â\u0080\u009cYou just breathe the air and thatâ\u0080\u0099s how itâ\u0080\u0099s passed,â\u0080\u009d Trump said in a Feb. 7 call with Woodward. â\u0080\u009cAnd so thatâ\u0080\u0099s a very tricky one. Thatâ\u0080\u0099s a very delicate one. Itâ\u0080\u0099s also more deadly than even your strenuous flu.â\u0080\u009d â\u0080\u009cThis is deadly stuff,â\u0080\u009d the president repeated for emphasis. Trump told Woodward on March 19 that he deliberately minimized the danger. â\u0080\u009cI wanted to always play it down,â\u0080\u009d the president said. The Washington Post, where Woodward serves as associate editor, reported excerpts of the book, â\u0080\u009cRageâ\u0080\u009d on Wednesday, as did CNN. The book also covers race relations, diplomacy with North Korea and a range of other issues that have arisen during the past two years. The book is based in part on 18 interviews that Woodward conducted with Trump between December and July. The book is an unwelcome return to focus on Trumpâ\u0080\u0099s handling of the pandemic just as he is trying to project the virus as under control and eager to see a return to normal activity leading up to the Nov. 3 presidential election. â\u0080\u009cTrump never did seem willing to fully mobilize the federal government and continually seemed to push problems off on the states,â\u0080\u009d Woodward writes. â\u0080\u009cThere was no real management theory of the case or how to organize a massive enterprise to deal with one of the most complex emergencies the United States had ever faced.â\u0080\u009d White House press secretary Kayleigh McEnany said the presidentâ\u0080\u0099s words to the public were designed to express confidence and calm at a time of insurmountable challenges. â\u0080\u009cThe president has never lied to the American public on COVID. The president was expressing calm and his actions reflect that,â\u0080\u009d McEnany said. McEnany took questions about the book during a briefing at the White House on Wednesday. She said his actions reflect that he took COVID-19 seriously. She noted that the president put in place travel restrictions with China on Jan. 31 and that some Democrats had criticized the move. House Speaker Nancy Pelosi, D-Calif., said the presidentâ\u0080\u0099s comments to Woodward connoted weakness and a disdain for science. â\u0080\u009cWhat he was actually saying is, â\u0080\u0098I donâ\u0080\u0099t want anybody to think anything like this happened on my watch so Iâ\u0080\u0099m not going to call any more attention to it,â\u0080\u009d Pelosi said during an interview on MSNBC. Woodwardâ\u0080\u0099s book is his second on the Trump White House. The first, published in 2018, portrayed Trump in an unflattering light, and the president fumed at staff that he was not interviewed for it, according to two former White House officials and Republicans close to the White House. They were not authorized to speak publicly about private conversations and discussed the matter on condition of anonymity. Trump was convinced that had he talked to Woodward, he could have led to a more favorable depiction in the book, according to the officials. Trump had always held Woodward in high regard â\u0080\u0094 he considered the journalist as the biggest star in the field â\u0080\u0094 and told aides that he insisted on being interviewed if Woodward were to write again, the officials said. Democratic presidential nominee Joe Biden seized on the bookâ\u0080\u0099s allegations that Trump played down the threat of the virus to the public but knew the dangers it posed. Biden called Trumpâ\u0080\u0099s handling of the pandemic â\u0080\u009cbeyond despicable.â\u0080\u009d â\u0080\u009cItâ\u0080\u0099s a dereliction of duty. Itâ\u0080\u0099s a disgrace,â\u0080\u009d Biden said."}]}