{"article": [{"url": "https://www.marketwatch.com/story/deadliest-fire-of-the-year-in-california-of-year-leaves-10-dead-11599839430", "published": 1599825680.0, "headline": "Deadliest fire of the year in California leaves 10 dead", "body": "Members of the Mormon Hot Shots from Arizona lay hose line down rugged terrain off Highway 39 near Crystal Lake in front of the Bobcat Fire, which has burned more than 23,000 acres, Thursday, Sept. 10, 2020. (David Crane/The Orange County Register via AP) AP GRIDLEY, Calif. (AP) — The terrible toll of California’s wildfires became more evident as a mother confirmed her 16-year-old son was among those killed when an inferno tore through several hamlets in the foothills of the Sierra Nevada this week. Jessica Williams, who earlier pleaded for her missing son Josiah to call her, told CBS13 Sacramento that DNA confirmed the teen’s death. “He was alone, terrified and ran for his life … my son was a good, smart, caring young boy that died alone and it kills me thinking about what he was going through,” the TV station reported Friday. It was not immediately clear if the teen was counted among the 10 wildfire deaths or 16 missing persons reported so far by local authorities. The North Complex fire near the small city of Oroville that exploded in wind-driven flames earlier in the week was advancing more slowly Friday after the winds eased and smoke from the blaze shaded the area and lowered the temperature, allowing firefighters to make progress, authorities said. However, the smoke made for poor visibility and fire helicopters couldn’t fly Thursday. Throughout the state, red flag warnings of extreme fire danger because of hot, dry weather or gusty winds were lifted. Only a day or two earlier, the North Complex fire tore through Sierra Nevada foothills so quickly that fire crews were nearly engulfed, locals fled for their lives to a pond, and the town of Berry Creek, population 525, and other communities were gutted. On Thursday, Butte County sheriff’s Capt. Derek Bell said seven bodies were discovered, boosting the death toll to 10 in two days. At least four people with critical burns were hospitalized. Deputies and detectives were searching for human remains as they made their way into devastated areas with a team of anthropologists from Chico State University, Bell said. Burned-out and overturned cars, downed power lines and the ruins of buildings littered Berry Creek and nearby areas, the Sacramento Bee reported. One hatchback found on a dirt road had three dead dogs in it, while a pickup truck had the remnants of a guitar case and melted CDs in the bed. More than 2,000 homes and other buildings burned in the fire, which began several weeks ago as a lightning-sparked collection of blazes 125 miles (201 kilometers) northeast of San Francisco. The final toll is expected to be much higher. Damage assessment teams planned to begin a methodical search of the burned areas on Friday. Among those unaccounted for were Sandy Butler and her husband, who had called their son to say they planned to escape the flames in a pond. “We’re still hoping and praying for good news,” said Jessica Fallon, who has two children with the Butler’s grandson and considers them her own grandparents. “Everything is replaceable, but not my grandparents’ lives. I’d rather lose everything than those two. They kind of held the family together.” Fallon said she’d been peppering hospitals with phone calls in search of her grandparents. There was no word about them late Thursday night. The speed and ferocity of the fire astonished observers, even those who remembered a blaze only two years earlier that killed some 85 people and devastated the town of Paradise, a few miles away from the current blaze. Residents jammed the main road out of town on Wednesday amid falling ash and red skies. Authorities lifted an evacuation warning for Paradise on Thursday but authorities urged people to remain alert. A crew fighting the fire was overrun by flames Wednesday when winds shifted and its members escaped with only minor injuries after they used the emergency shelters they carry with them. It was the second time in two days that firefighters in California had to take the rare last-ditch effort to save their lives. The blaze is among 29 major wildfires burning from the Oregon border to just north of Mexico. More than 4,800 square miles (12,500 square kilometers) have burned so far this year — more land than Rhode Island, Delaware and Washington, D.C., combined — and fall is typically the worst season for fires. Nineteen people have been killed and at least 4,000 buildings have burned across California. “It’s a historic season on top of a historic season that replaced a historic season. We just keep setting new precedents, and then we keep destroying them,” said Sean Norman, a battalion chief with the California Department of Forestry and Fire Protection. Smoke blew into vineyards in wine country north of San Francisco, and rose above scenic Big Sur on the Central Coast and in the foothills and mountains of Los Angeles, San Bernardino and San Diego counties in the southern part of the state. President Donald Trump spoke with Gov. Gavin Newsom “to express his condolences for the loss of life and reiterate the administration’s full support to help those on the front lines of the fires,” according to White House spokesman Judd Deere. Neighboring Oregon and Washington also have been beseiged. More than 1,400 square miles (3,625 square kilometers) have burned this week in Oregon, where hot, windy conditions continued. Authorities said more than 500,000 people — more than 10% of the state’s population — have been forced to evacuate. Wildfires have scorched nearly 937 square miles (2,426 kilometers) in Washington. Journalists have captured compelling images of wildfires burning in California, due in large part to a decades-old state law that guarantees press virtually unfettered access. That’s not the case everywhere as rules about media access vary by state, and even by government agency."}]}