{"article": [{"url": "https://www.marketwatch.com/story/consumer-sentiment-index-rises-to-789-in-september-2020-09-18-10103417", "published": 1600426640.0, "headline": "Consumer sentiment index rises to 78.9 in September, highest level since March", "body": "The numbers: The University of Michigan said the preliminary reading of its U.S. consumer sentiment index in September was 78.9, up from 74.1 in the prior month. Economists polled by MarketWatch expected a reading of 75.9. The sentiment indicator covers how consumers view their personal finances as well as business and buying conditions. What are they saying? The index hit its “best level since March,” but “longer-run inflation expectations ticked down to 2.6% while near-term inflation expectations slipped to 2.7%, the lowest since April,” said Neil Dutta, head of economics at Renaissance Macro Research, in a note. His team’s suspicion is that “as supply and capacity constraints ease, inflation will moderate along with expectations thereof,” Dutta added. The big picture: The amount of confidence Americans have in the economy and their own financial security has a good record of predicting the future. Until they feel more secure, the economy is unlikely to make a rapid recovery from the coronavirus recession. Related:The numbers tell us the economy is better, but millions of Americans aren’t feeling it What could help restore more confidence are further measures from the federal government to support the economy, but analysts have said it’s likely that a divided Washington won’t deliver another big coronavirus aid package before the Nov. 3 elections. While the University of Michigan’s consumer sentiment index has climbed to its highest level since March, it remains well below its February reading that was north of 100. Market reaction: The main U.S. stock gauges SPX, +0.87% DJIA, +0.56% COMP, +1.39% were trading mixed on Friday and staying on track for weekly gains, after closing lower on Thursday."}]}