{"article": [{"url": "https://www.marketwatch.com/story/a-record-high-for-the-nasdaq-would-all-come-crashing-down-says-trump-in-a-tweet-including-your-jobs-stocks-and-401ks-if-biden-wins-presidency-2020-08-03", "published": 1596561860.0, "headline": "A record high for the Nasdaq 'would all come crashing down,' says Trump in a tweet, 'including your jobs, stocks, and 401(k)s,' if Biden wins presidency", "body": "“ 'RECORD HIGH NASDAQ! It would all come crashing down, including your Jobs, Stocks, and 401k's, if Sleepy Joe ever became President. China and others would own us!!!' ” That is President Trump's latest stock-market commentary, touting a record high for the Nasdaq Composite Index and suggesting a rebound in the overall market from coronavirus-induced lows is in jeopardy if former Vice President Joe Biden, the presumptive Democratic presidential nominee, wins the 2020 election to be held on Nov. 3. The Nasdaq Composite had registered an intraday record earlier Monday. Trump has consistently taken credit for gains in U.S. financial markets, which have managed to rebound mightily since plunging in February and March in the face of the most severe pandemic in more than 100 years. It is unclear whether, or how, the president has keyed the market bounce in recent months, but his business-friendly initiatives at the start of his presidency had been viewed as a boon for stock-market bulls. The Nasdaq has reflected the leadership of some of the biggest technology and tech-related companies in those gains. Tech giants like Apple Inc. AAPL, +1.74%, Microsoft Corp. MSFT, +2.48%, Amazon. com AMZN, +3.01%, Google parent Alphabet Inc. GOOG, +1.97%  GOOGL, +1.82%,  Facebook FB, +0.26% and Netflix NFLX, +1.43% are among those viewed as more resilient to the economic harm wrought by the deadly viral outbreak. Because of their outsize valuations, they have helped to driver market-capitalization-weighted indexes rally, including the S&P 500 and the Nasdaq Composite. Indeed, the Nasdaq Composite has soared nearly 60% since hitting a March 23 low, while the S&P 500 index SPX, +0.87% has climbed a not-too-shabby 47% and the Dow Jones Industrial Average DJIA, +0.56%, which has a lower concentration of tech-related companies and is price-weighted, has climbed 43% over the same period. Meanwhile, recent national polls show Biden maintaining a lead over Trump. Biden leads Trump in the Real Clear Politics poll average by 7.4 percentage points, 49.4% to 42%. This isn't the first time Trump has claimed that Americans' investments and retirement savings are at risk with a Biden win. Earlier last month, he argued that the stock market would \"drop down to nothing\" if he is not re-elected. A Biden presidency had been viewed by some analysts as one that could put at risk the uptrend that has existed in markets, predominantly before the pandemic took hold in February and March. However, some may be warming to a Biden presidency, according to recent reports. Strategists at JPMorgan Chase & Co. JPM, -0.57% made the case that a win for former vice president would be a \"neutral to slight positive\" for stocks."}]}