{"article": [{"url": "https://www.marketwatch.com/story/eu-wont-recognize-lukashenko-as-belarus-president-opening-a-new-front-in-its-worsening-relationship-with-putins-russia-2020-09-24", "published": 1601012120.0, "headline": "EU wonâ\u0080\u0099t recognize Lukashenko as Belarus president, opening a new front in its worsening relationship with Putinâ\u0080\u0099s Russia", "body": "The European Union government said on Thursday that Alexander Lukashenko, who swore himself in as Belarus president in a secret ceremony earlier this week, â\u0080\u009clacks any democratic legitimacyâ\u0080\u009d after claiming victory in presidential elections in August that were â\u0080\u009cneither free nor fair.â\u0080\u009d - The statement by EU High Representative for Foreign Affairs and Security Policy Josep Borrell, in the name of all 27 EU foreign ministers, asks that the Belarus authorities â\u0080\u009crespond positively to the demand of the Belarusian people for new democratic elections.â\u0080\u009d - It also demands that the government â\u0080\u009crefrain from any further repression and violence directed against the Belarusian people and immediately and unconditionally release all those detained, including political prisoners.â\u0080\u009d Daily mass protests against Lukashenko are taking place in the capital Minsk. - Before the contested election, the EU had pledged to spend â\u0082¬135 million on various projects in Belarus, and â\u0082¬53 million more to help the country face the coronavirus pandemic. It now says it is â\u0080\u009creviewing its relationsâ\u0080\u009d with the country. - Russian President Vladimir Putin, a Lukashenko ally, said last week in a meeting between the two men that Moscow would extend a $1.5 billion loan to its cash-strapped neighbor, after indicating earlier that a Russian police force was ready to help the regime if protests got out of control. - European Commission President Ursula von der Leyen cautioned a week ago in her â\u0080\u009cstate of the unionâ\u0080\u009d address to the European Parliament that â\u0080\u009cthose that advocate closer ties with Russiaâ\u0080\u009d are wrong. â\u0080\u009cThe poisoning of Alexei Navalny with an advanced chemical agent is not a one off. We have seen the pattern in Georgia and Ukraine, Syria and Salisbury â\u0080\u0094 and in election meddling around the world. This pattern is not changing â\u0080\u0094 and no pipeline will change that,â\u0080\u009d she said. Read: EU offers â\u0080\u0098new trans-Atlantic agendaâ\u0080\u0099 to the U.S., whoever is next president The outlook: The EU is opening a new front in its worsening relationship with Putinâ\u0080\u0099s Russia. Lukashenkoâ\u0080\u0099s unapologetic, if secret, self-swearing-in has given an indication that he is not ready to engage with other governments to try to find a solution to the current crisis. For now, his election rival, Svetlana Tikhanovskaya, is urging the EU to direct its funds directly to those in Belarus who need them most â\u0080\u0094 like doctors and hospitals. And despite his protestation of support, Putin so far doesnâ\u0080\u0099t seem eager to send troops to Belarus, as he did in Ukraine in 2014. Risks that Germany might pull out of the Nord Stream 2 gas pipeline that von der Leyen alluded to may partly explain his reticence. Read: The U.S. behaved like a â\u0080\u0098gangsterâ\u0080\u0099 to â\u0080\u0098robâ\u0080\u0099 TikTok from China and Beijing has â\u0080\u0098no reasonâ\u0080\u0099 to approve the deal: Chinese media"}]}