{"article": [{"url": "https://www.marketwatch.com/story/a-message-hard-to-ignore-new-yorkers-paint-black-lives-matter-in-front-of-trump-tower-2020-07-09", "published": 1594334180.0, "headline": "A message hard to ignore: New Yorkers paint 'Black Lives Matter' in front of Trump Tower", "body": "New Yorkers on Thursday gave President Donald Trump a message that should be hard to ignore, painting \"Black Lives Matter\" on a block of Manhattan's Fifth Avenue in front of Trump Tower. The city closed off the street and painters stenciled in the massive block letters, filling them in with bright yellow paint. iframe.twitter-tweet { width: 100% !important; } Mayor Bill de Blasio, a vocal Trump critic, took part as well. \"President Trump said we would be denigrating the luxury of Fifth Avenue. Let me tell you: we're not denigrating anything, we are liberating Fifth Avenue, we are uplifting Fifth Avenue,\" he said, according to CNN. \"When we say 'Black Lives Matter' there is no more American statement, there's no more patriotic statement, because there is no America without Black America. We are acknowledging the truth in ourselves and in America. By saying 'Black lives matter' we are righting a wrong.\" iframe.twitter-tweet { width: 100% !important; } Last week, Trump tweeted that the mural denigrated Fifth Avenue, and claimed it was a \"symbol of hate.\" Trump used to live at the tower, though he has visited infrequently since becoming president and has changed his official residence to Florida. There were some tense moments Thursday, as some counterprotesters jeered de Blasio and the painters, with some chanting \"All Lives Matter.\" \"Black Lives Matter\" murals have been painted on streets in a number of cities, including Washington and Oakland, as well as elsewhere in New York, amid a national reckoning on race in the wake of massive protests set off by the killing of George Floyd by Minneapolis police. But activists say more needs to be done. Last month, the Washington chapter of the Black Lives Matter Global Network called the D.C. mural \"a performative distraction from real policy changes.\""}]}