{"article": [{"url": "https://www.marketwatch.com/story/zoom-video-backtracks-will-offer-end-to-end-encryption-to-all-users-2020-06-17", "published": 1592435900.0, "headline": "Zoom Video backtracks, will offer end-to-end encryption to all users", "body": "Zoom Video Communications Inc. reversed course Wednesday, announcing it would offer end-to-end encryption to all of its users, not just those on its premium tier. The videoconferencing company, which boomed to prominence early in the coronavirus shutdown, said in a blog post Wednesday that all users, including those on its free/basic tier, will soon receive end-to-end encryption as an optional feature, with a beta version launching in July. Zoom ZM, +2.89% launched end-to-end encryption in May, but only for subscribers who paid $14.99 a month for its premium tier. Video calls for free-tier users currently use less-secure transport encryption, which will still be the default setting. In April, Zoom was rocked by user complaints and a shareholder lawsuit that accused it of misleading customers by overstating its security measures, following a wave of so-called “Zoom bombers” who hacked into videoconferences. Shares plunged as a number of companies and local government agencies dropped the service. Earlier this month, Zoom said it could not offer the stronger end-to-end encryption to free-tier users in case it needed to comply with subpoenas from police or the FBI, a statement that angered more users, Bloomberg News reported. But in a blog post Wednesday, Zoom Chief Executive Eric Yuan said the company has “engaged with civil liberties organizations, our CISO council, child safety advocates, encryption experts, government representatives, our own users, and others to gather their feedback on this feature. “We are also pleased to share that we have identified a path forward that balances the legitimate right of all users to privacy and the safety of users on our platform. This will enable us to offer E2EE as an advanced add-on feature for all of our users around the globe — free and paid — while maintaining the ability to prevent and fight abuse on our platform.” To access the higher level of security, users will have to undergo a one-time verification process, such as through a text message. Consumer Reports praised Zoom’s decision late Wednesday, saying it could have a domino effect raising security standards for the wider marketplace. “It’s good to see Zoom reverse its decision to only allow paying customers to have their conversations safeguarded with end-to-end encryption,” Justin Brookman, director of privacy and technology policy for Consumer Reports, said in an emailed statement. “Security shouldn’t be a luxury just for those who can afford it. I hope others in the industry will follow the example of Zoom in giving all users the same ability to communicate privately and securely.” The Electronic Freedom Foundation also approved of the move. “Zoom has done the right thing, changed course, and taken a big step forward for privacy and security,” the organization said Wednesday. “We applaud Zoom’s decision to make privacy and security enhancements available to all of their hundreds of millions of users.” Both Consumer Reports and the EFF urged Zoom to take the further step of protecting the phone numbers provided for authentication from third-party marketers. They also called for enterprise services from rivals such as Cisco Systems Inc. CSCO, +0.15% , Slack Technologies Inc. WORK, +3.36% and Microsoft Corp. MSFT, +2.48% to follow suit and give the highest level of security to free users. Zoom Video shares hit an all-time high Tuesday, closing above $242 a share. Its stock slipped Wednesday, but is still up nearly 250% year to date, compared to the S&P 500’s SPX, +0.87% 3.6% decline this year."}]}