{"article": [{"url": "https://www.marketwatch.com/story/top-federal-prosecutor-quits-barr-ordered-durham-probe-into-origins-of-russia-trump-investigation-2020-09-13", "published": 1600072160.0, "headline": "Top federal prosecutor quits Barr-ordered Durham probe into origins of Russia-Trump investigation", "body": "WASHINGTON (AP) — A federal prosecutor who was helping to lead the investigation into the origins of the Trump-Russia probe has resigned from the Justice Department, a spokesman said. Nora Dannehy was a top prosecutor on a team led by U.S. Attorney John Durham of Connecticut, who was appointed last year to lead an investigation into how the FBI and other federal agencies set out to investigate Russian interference in the 2016 presidential election and whether the Trump campaign had coordinated with the Kremlin. From the archives (October 2019):Justice Department review of Russia probe now a criminal inquiry, raising worries of retribution bid Also see (April 2020):Contrary to DOJ’s findings, Barr claims Russia probe was started ‘without basis’ A spokesman for the U.S. attorney’s office in Connecticut on Friday confirmed Dannehy’s departure, which was first reported by the Hartford Courant, but the spokesman declined to comment further. Her departure could complicate the final stretch of an investigation already slowed by the coronavirus pandemic but eagerly anticipated by President Donald Trump and his supporters to uncover what they see as wrongdoing within the FBI during the Russia investigation. It leaves the investigative team without one of its veteran prosecutors as key decisions presumably await before the probe wraps up. Colleagues of Dannehy’s reportedly told the Hartford paper that she is not a Trump supporter and has grown concerned by what she as pressure from Attorney General William Barr, who appointed Durham, to produce a result before the election. Those colleagues, the paper reported, said she had considered resigning for a number of weeks, torn between loyalty to Durham and concern about the investigation’s politicization. Durham’s appointment by Barr was made public soon after the release of special counsel Robert Mueller’s report into Russian election interference. In the year and a half since, he has questioned former law-enforcement and intelligence officials — former CIA Director John Brennan among them — about decisions made during the course of the Russia probe. Dannehy had been a top leader on the team, present for interviews with such officials, including Brennan. The investigation has not yet produced the results that Trump supporters had been hoping for. There is also pressure to wrap up soon given that Justice Department policy frowns on investigative steps that could affect an election, though Barr has said that policy would not apply here since Democratic presidential nominee Joe Biden is not a target of the probe. It’s also not clear that Durham’s work would be permitted to continue if Trump loses in November and Democratic leadership assumes control at the Justice Department. Trump himself has indicated that he wants results soon, saying at a White House press conference on Thursday that Durham was a “very, very respected man” and that his work would involve a “report or maybe it’s much more than that.” The investigation has produced one criminal charge so far, against a former FBI lawyer accused of altering an email related to the surveillance of a former Trump campaign aide. But that prosecution did not allege a broader conspiracy within the FBI, and the conduct it involved had largely been laid out in a Justice Department inspector general report from last December. It is not clear if Durham will be able to conclude his work before the election, though Barr has not ruled out the possibility of additional criminal charges. In other developments related to the Russia investigation, lawyers connected to the case of former Trump administration national security adviser Michael Flynn were submitting arguments Friday about how the prosecution should proceed in light of an appeals court ruling last week. The court ruled that U.S. District Judge Emmet Sullivan did not have to dismiss the case just because the Justice Department wanted him to. The ruling opened the door for Sullivan to scrutinize the basis for the department’s unusual request, which came even though Flynn had twice pleaded guilty to lying to the FBI. John Gleeson, the retired federal judge who was appointed by Sullivan to argue against the Justice Department’s position, said in a filing that the case should not be dismissed and called the government’s motion to dismiss “plainly a corrupt political errand for the President.” “There is clear evidence that the Government’s Motion to Dismiss the case against Defendant Michael T. Flynn rests on pure pretext,” Gleeson wrote. “There is clear evidence that this motion reflects a corrupt and politically motivated favor unworthy of our justice system.” Flynn pleaded guilty as part of the Mueller probe to lying about conversations during the presidential transition in which he urged the then-Russian ambassador to not escalate tensions in response to sanctions that had just been imposed for interference in the 2016 election. At the time, the FBI was investigating whether the Trump campaign had coordinated with Russia to swing the election, and White House officials were stating publicly that Flynn and the diplomat had not discussed sanctions. See:Whether Trump knew Barr’s Justice Department would ask judge to dismiss criminal case against Flynn is a moot point The Justice Department sought to dismiss the case in May, arguing that the FBI didn’t have good reason to interview Flynn in the first place and that any false statements he may have made during questioning were not material to the probe into ties between the Trump campaign and Russia. Read on:Trump pressed Australian prime minister to help Barr probe origins of Mueller investigation MarketWatch contributed."}]}