{"article": [{"url": "https://www.marketwatch.com/story/kamala-harris-is-a-friend-not-foe-of-big-tech-2020-08-12", "published": 1597321520.0, "headline": "Kamala Harris is a friend, not foe, of Big Tech", "body": "An audible collective sigh of relief from Silicon Valley came shortly after Kamala Harris was named running mate of presumptive Democratic presidential nominee Joe Biden. Harris, D-Calif., views Big Tech as a partner rather than as a threat, and has struck a moderate tone toward the industry on several fronts. As a presidential candidate, Harris did not support breaking up Facebook Inc. FB, +0.26% , Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% and Amazon.com Inc. AMZN, +3.01% , as did Sens. Elizabeth Warren and Bernie Sanders, but instead was open to strengthening antitrust enforcement. Like Biden, she recently called for an increase on corporate taxes but stopped short of supporting a tax on the assets held by the wealthiest Americans. “The tech companies have got to be regulated in a way that we can ensure and the American consumer can be certain that their privacy is not being compromised,” Harris told the New York Times. She was evasive, though, when asked whether tech giants should be splintered. “Now that we have a candidate, and it is not a Bernie Sanders or Elizabeth Warren, tech donors are ready to support the ticket. They were looking for someone who won’t break up Big Tech but do believe antitrust needs to happen,” Cooper Teboe, a Democratic fundraiser in Silicon Valley, told MarketWatch in a phone interview. “In her defense, Harris was chummy in her role as [California Attorney General] in a state where the industry is so influential.” Teboe expects the Biden-Harris ticket to collect a windfall of donations from high-tech executives, venture capitalists, and others by the end of the month. Count Salesforce.com Inc. CRM, +2.21% Chief Executive Marc Benioff among Harris’s supporters: When she ran for president, he donated $2,700 to her campaign, according to a MarketWatch analysis of contributions from Jan. 1, 2019, to June 30, 2019, as reported to the FEC. A Salesforce spokesperson was not immediately available for comment. Read more: Here’s who America’s CEOs are backing in the Democratic presidential race Fundraisers for her presidential bid also included Reid Hoffman, co-founder of LinkedIn and former PayPal Holdings lnc. PYPL, +2.18% chief operating officer, and venture capital legend John Doerr. Harris is especially close to Facebook Chief Operating Officer Sheryl Sandberg. Sandberg’s support for Harris runs so deep, the tech exec supported Harris over ex-Facebook Chief Privacy Officer Chris Kelly in the race for California AG in 2010 and was a vital supporter in Harris’ successful bid for the U.S. Senate in 2016. Harris, in turn, helped Sandberg promote her best-selling book, Lean In (2013). Even venture capitalist Roger McNamee, a long-time nemesis of Sandberg and author of “Zucked: Waking Up to the Facebook Catastrophe,” is “extremely optimistic that Harris, like Lyndon Johnson and Richard Nixon before her, understands the duties of national leaders differ from state office holders,” he told MarketWatch. As a possible future vice president, he says, Harris will represent the interests of all Americans because the Biden-Harris ticket will “owe its election to the support of voters who were harmed by internet platforms.” Harris, who spent a large chunk of her early career in San Francisco as district attorney before going on to California attorney general and U.S. senator, is expected to fill a vacuum on tech policy. Biden has not made tech issues a priority during his campaign, though his group of advisers have plenty of roots in Silicon Valley. Harris’s office did not reply to an email seeking comment. Yet if the addition of Harris has heartened tech, it has raised alarms among some consumer advocates. “It was deeply troubling that as AG, she oversaw the growth of the biggest sector in America that dominates our privacy and our choices, and didn’t file a single case to take on that power. It would the equivalent of the New York AG not filing a single case against Wall Street,” says Jamie Court, president of Consumer Watchdog, a nonprofit that has aggressively pushed for antitrust actions against Google, Facebook and Amazon. Harris’s late endorsement of SESTA, the Stop Enabling Sex Traffickers Act, which made websites like Google and Facebook accountable for aiding sex trafficking, showed her willingness to “run interference” for tech, Court told MarketWatch. In 2016, Harris threatened Uber Technologies Inc. UBER, -0.18% with legal action if the company did not remove autonomous vehicles from California roads. When in Washington, however, she did not oppose legislation that would have overridden California’s tough rules on driverless cars. Harris has shown a willingness to call out tech executives, as when she pressed Twitter Inc. TWTR, -0.23% CEO Jack Dorsey to ban President Donald Trump from the platform. But her entreaty went nowhere, and the matter was dropped."}]}