{"article": [{"url": "https://www.marketwatch.com/story/cruel-and-bad-economics-are-what-this-economist-has-to-say-about-not-extending-the-extra-600-in-unemployment-benefits-2020-06-27", "published": 1593422660.0, "headline": "Ending extra $600 in unemployment benefits will impact 20 million Americans, says government agency", "body": "Since the $2.2 trillion stimulus package CARES Act passed in March, Americans who lost their jobs have been able to collect an additional $600 a week in unemployment benefits on top of what their states have distributed. That extra money is set to expire at the end of next month if lawmakers fail to act. Related: The extra $600 Americans get in weekly unemployment benefits ends next month — here’s what lawmakers are proposing to replace it The boost in unemployment benefits “was a really important thing to do when we were closing the economy back in March,” Labor Secretary Eugene Scalia said Wednesday on CNBC. “I don’t think that the $600 benefit is the answer going forward,” he added. Josh Bivens, director of research at the Economic Policy Institute, a left-leaning think tank, couldn’t disagree more. “ ‘Cutting off a policy support that helps households maintain spending is a terrible idea, both for these households’ welfare and for macroeconomic stabilization.’ ” — Josh Bivens, director of research at the Economic Policy Institute Given that approximately 10% to 15% of U.S. GDP is driven by consumption, allowing those benefits to expire will strip more than 20 million Americans of a total of nearly $842 billion to spend, according to data released by the Bureau of Economic Analysis, a U.S. government agency that provides official macroeconomic and industry statistics. “When the economy’s growth is demand-constrained, anything that keeps households from cutting back on spending actually supports growth,” he said. “Cutting off a policy support that helps households maintain spending is a terrible idea, both for these households’ welfare and for macroeconomic stabilization.” Don’t miss: ‘We are saving every penny we can’: What life could look like for this 66-year-old man when he loses all his unemployment benefits next month Keeping the supplemental $600 in place through the middle of next year “would provide an average quarterly boost to GDP of 3.7% and employment of 5.1 million workers,” Bivens predicted, using the Bureau of Economic Analysis data. That’s largely because Americans would have more money to spend which would in turn prevent retailers from having to layoff more workers, he said. Last month’s retail sales report, which documented a record 17.7% jump in retail sales, may support Bivens’ theory, given that nearly 2.7 million Americans who were temporarily laid off amid the coronavirus pandemic were rehired."}]}