{"article": [{"url": "https://www.marketwatch.com/story/feds-powell-tells-congress-its-up-to-them-to-provide-aid-to-some-troubled-companies-2020-09-21", "published": 1600766360.0, "headline": "Fedâ\u0080\u0099s Powell tells Congress itâ\u0080\u0099s up to them to provide aid to some troubled companies", "body": "If Congress is worried about the health of some American businesses, itâ\u0080\u0099s up to lawmakers to provide support directly, Federal Reserve Chairman Jerome Powell said ahead of a hearing later Tuesday. The Fed can only make loans, which isnâ\u0080\u0099t much of a life preserver for some companies, Powell said, in prepared remarks released ahead of a House Financial Services Committee hearing. For some companies, â\u0080\u009ca loan that could be difficult to repay might not be the answer. In these cases, direct fiscal support may be needed,â\u0080\u009d Powell said. Prospects that Congress will pass another rescue package have faded in recent weeks, and became even more remote after the death of Supreme Court Justice Ruth Bader Ginsburg last Friday. With Republicans and Democrats unwilling to compromise, members of Congress have been pressing the Fed to do more. The Fed has set up an emergency lending plan, the Main Street Lending Program, designed to help small- and medium-size businesses. But so far at least the program hasnâ\u0080\u0099t attracted many borrowers. Some analysts think focusing on the small amount lent so far is misplaced. They think the Fed lending program could be helpful later this year if more companies start to face possible bankruptcy. The Fed has been trying to tweak the terms of Main Street to make it more flexible but major changes must come from lawmakers and Treasury. In his remarks, Powell was upbeat about the outlook. He said many indicators have shown â\u0080\u009cmarked improvement.â\u0080\u009d â\u0080\u009cIn the labor market, roughly half of the 22 million payroll jobs that were lost in March and April have been regained as people return to work,â\u0080\u009d Powell said. He assured lawmakers that the economy â\u0080\u009cwill eventually recover from this difficult period.â\u0080\u009d Powell will testify at 10:30 a.m. Eastern along with Treasury Secretary Steven Mnuchin. In his prepared testimony, Mnuchin said the White House was open to negotiating a new coronavirus relief measure. â\u0080\u009cI believe a targeted package is still needed, and the Administration is ready to reach a bipartisan agreement,â\u0080\u009d Mnuchin said. Analysts said the prospects of another large coronavirus aid package are dead as the Senate turns its attention to confirming a replacement for Ginsburg on the Supreme Court. Read:Ginsburg replacement fight will take eyes of pandemic-relief bill Stock-index futures were mixed on Tuesday after the sharp sell off in the prior session where the Dow Jones Industrial Average DJIA, +0.56% dropped 509.72 points."}]}