{"article": [{"url": "https://www.marketwatch.com/story/companies-are-weighing-stock-splits-after-tesla-and-apples-announcements-expert-says-11597404072", "published": 1597586600.0, "headline": "Companies are weighing stock splits after Tesla and Appleâ\u0080\u0099s announcement, expert says", "body": "After Tesla and Apple announced plans to split their shares within weeks of each another, there has been a growing buzz that more companies with triple and quadruple-digit share prices will follow in their footsteps. â\u0080\u009cEverybodyâ\u0080\u0099s talking about it,â\u0080\u009d Howard Silverblatt, senior index analyst at S&P Dow Jones Indices, told MarketWatch in an interview on Thursday. â\u0080\u009cIâ\u0080\u0099m getting requests from companies looking for raw dataâ\u0080¦ asking, â\u0080\u0098Is there a reason I should split [my shares]?â\u0080\u0099 he said. Silverblatt said he thought boards of companies might indeed follow Tesla and Appleâ\u0080\u0099s lead at some point and split their shares in an effort to appeal to a wider retail audience, even if doing so is almost an entirely cosmetic exercise by a company and one that could be expensive. â\u0080\u009cWill, there be others that split? I have to say yes. Those [companies] canâ\u0080\u0099t be the only ones,â\u0080\u009d he said, referring to Apple and Tesla. Apple AAPL, +1.74% on July 30 announced a 4-for-1 stock split that will take effect on Aug. 31. At the time of its announcement, made after the close of regular trade, shares of the iPhone maker had closed at $384.76. They have gained nearly 20% since then to $460, as of Thursday. Earlier this week, Tesla TSLA, +1.89% said it would complete a 5-for-1 stock split by Aug. 31, that also sent the electric-vehicle makerâ\u0080\u0099s shares zooming higher. Stock splits were once a common occurrence on Wall Street, as companies attempted to make their share prices more enticing to average investors. Back in the late 1990s and early 2000s, amid the dot-com boom, stock splits were all the rage (see attached chart). Ally Invest, Bloomberg, S&P But such divisions, of companies creating more shares, are a rarity nowadays. Indeed, Tesla and Apple are the only stock splits thus far in 2020, even though the average share price among publicly traded companies is $149.32, compared with an average share price of $51.08 in 1997 when there were 102 stock splits, marking the greatest number of splits over the past three decades, S&P Dow Jones Indices data show . S&P Dow Jones Indices. The Wall Street Journal in a 2017 article titled the â\u0080\u009cSplit Decision: The Pros and Cons of Splitting Shares,â\u0080\u009d wrote that beyond appealing to retail investors, making a stock appear more liquid and less overvalued have been among some of the reasons that companies had opted to enact splits. MarketWatch columnist Mark Hulbert back during Appleâ\u0080\u0099s last announcement of a stock split in 2014 said that stock splits could also be read as a vote of confidence by a companyâ\u0080\u0099s management. â\u0080\u009cOf course, the stock split itself is simply a cosmetic accounting thing that brings the stock price down. The reason that itâ\u0080\u0099s bullish is that itâ\u0080\u0099s a signal of something that is good news on the fundamental side and that good news is confidence on the part of management that their stock price will not only stay at its current level but keep growing and for that reason they need to split it in order bring the stock price back to a sweet spot,â\u0080\u009d he explained. Talk of stock splits now come as mom-and-pop investors find themselves in a veritable golden age of trading, where commissions are at or near $0 and many brokerage platforms offer fractional share ownership of stocks, making purchasing small stakes in companies attainable and relatively low cost. On top of that, a recent spate of outperformance by retail investors, who have made aggressive and thus far successful bets on the comeback of a number of coronavirus-stricken industries, compared against professionals, has cast a spotlight on investing by a new, young cohort of stock buyers. That backdrop would presumably weaken the case for stock splits to drive retail ownership but proponents of the move say that fostering an environment that is pro-retail may be a long-term good for the stock market overall and companies. â\u0080\u009cRemember, the size of the price tag matters with this [young investing] crowdâ\u0080\u009d and â\u0080\u009cyou want this no-commission paying crowd in your stock,â\u0080\u009d CNBCâ\u0080\u0099s Jim Cramer said during â\u0080\u009cMad Moneyâ\u0080\u009d on Wednesday. â\u0080\u009cThis new cohort of investors, the ones who love low-dollar amount stocks, will start buying and holding these best-of-breed names rather than the darned penny stocks,â\u0080\u009d he said. Lindsey Bell, chief investment strategist at Ally Invest, wrote last week, after Appleâ\u0080\u0099s announcement that itâ\u0080\u0099s â\u0080\u009ctough to say if this is the start of a new stock split fad.â\u0080\u009d She noted only Netflix NFLX, +1.43% followed Appleâ\u0080\u0099s lead in 2014 when it completed a 7-for-1 stock split in July of 2015. That said, Bell says that â\u0080\u009ca little support from companies with expensive stocks could be a big win for those wanting a bite of the Apple (and other big tech/high priced stocks).â\u0080\u009d Silverblatt said that there are a number of high-priced companies who might fit the profile of those interested in slashing their share price by virtue of a split. His data show that there are 63 companies with a share price at or above $250, up from 44, as of Aug 12, 14 companies with stocks at $500 and over, up from 10 at the end of 2019; nine trading at or above $750 a share, up from six, and seven companies boasting a share price of $1,000 or greater, two more than the end of last year, and two issues that carry a price tag of $2,000 a share or better, when there were none at the end of 2019. CNBCâ\u0080\u0099s Cramer said that he favors a stock split for Amazon.com Inc. AMZN, +3.01%, Google parent Alphabet Inc GOOGL, +1.82%. , Chipotle Mexican Grill CMG, +0.01%, Netflix, Nvidia NVDA, -0.54%, Adobe ADBE, +2.30%, Costco Wholesale COST, +1.19%, Home Depot HD, +0.49%, Facebook Inc FB, +0.26%. and Microsoft Corp. MSFT, +2.48% Amazon, whose shares closed at around $3,161 on Thursday, hasnâ\u0080\u0099t split its stock since 1999. A Wall Street Journal article recently said administrative costs may serve as an additional deterrent to companies considering a stock split, citing anÂ academic paper that pegged the administrative cost of a stock split at around $800,000 for a large company. That cost for some megalith companies is relatively tiny, particularly if management thinks the long-term value of a split outweighs the expense. Hulbert, citing a study authored by David Ikenberry, a finance professor at the University of Colorado, says that the average stock undergoing a two-for-one stock split beat the market by 7.9% over the year after the announcement of the split â\u0080\u0094 and by 12.2% over the three years after that announcement. That said, he acknowledged recently that that split-effect has weakened in recent years. But it also bears noting that buying a company solely because of a planned split isnâ\u0080\u0099t likely to be a good long-term investing strategy, in any event."}]}