{"article": [{"url": "https://www.marketwatch.com/story/anthony-fauci-tells-marketwatch-i-would-not-get-on-a-plane-or-eat-inside-a-restaurant-2020-07-24", "published": 1596517340.0, "headline": "Dr. Fauci tells MarketWatch: I would not get on a plane or eat inside a restaurant", "body": "This is not the first public-health emergency Dr. Anthony Fauci says he has faced, but it’s up there with the worst of them — and it’s not close to being over yet. Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades, was on the front lines of the AIDS pandemic in the early 1980s, and has been dealing with crises ever since. America grappled with anthrax attacks, and dodged a bullet with Ebola and Zika. It did not dodge COVID-19. “This is probably a cut above all of those because this is very intense,” he says. If the speed and duration of the coronavirus pandemic is getting you down, spare a thought for Fauci. Are we there yet? How far are we on this journey through the pandemic? Near the finish line? Halfway? Or are we back where we started? “It’s a moving target,” he said. “I certainly don’t think we’re near the end of this if you look at what’s going on in the United States — that’s for sure.” President Trump restarted his daily briefings at the White House solo, but Fauci remains a member of the coronavirus task force and visits the White House almost every day. He said things need to change if we are to reduce the rate of up to 70,000 new COVID-19 infections each day. He lamented the lives lost to the virus, which totaled 693,968 including 155,471 in the U.S. as of Tuesday. Fauci’s father Steve ran a pharmacy in Dyker Heights, Brooklyn. His mother Eugenia and sister Denise worked in the store, and young Tony would make drug deliveries on his bicycle. He attended elementary Regis High School, a Jesuit School on Manhattan’s Upper East Side, and graduated from Cornell University Medical College first in his class with a Doctor of Medicine in 1966. At 79, an age by which most Americans have retired, Fauci has vowed to keep working, even if his message is sometimes at odds with that of Trump. The president has only recently embraced the policy of wearing a face mask, and went as far as to call it “patriotic.” For Fauci it came not a moment too soon. Did he watch the daily news briefing when Trump said, “I’m getting used to the mask”? Related: ‘Wrong!’ Trump and Fauci clash over the resurgence of COVID-19 cases, U.S. economy — and hydroxychloroquine‘We should try as best as we possibly can to open up the schools’ “I did not see this briefing, but I’m very pleased to hear that he’s now being pretty explicit about some of the things that we — namely his medical advisers have been telling him for some time,” Fauci said in a telephone interview. “I think he’s made a very good choice. He’s embracing masking, he’s embracing physical distancing, and that’s a very good thing.” Fauci holds out some, perhaps surprising, rays of hope. He is not against reopening schools, saying it’s not a one-size-fits-all solution. “It’s a complex issue,” Fauci said. “The fundamental default should be that we should try as best as we possibly can to open up the schools. But we have to remember, as a paramount consideration, the safety and the health of the children and teachers.” If September looks bad, with flu season approaching and the coronavirus still not under control, isn’t January likely to be as bad or even worse for students? Are parents and children facing the possibility of a full year with no in-person schooling? “It’s unpredictable. Things could change pretty rapidly. But it doesn’t look like we’ll be facing a full year with no in-person schooling,” Fauci said. The doctor discussed air travel and why he’s avoiding it; eating out and why he’s avoiding that; the price of a coronavirus vaccine and who should be first in line; the mixed success of mask mandates from Dublin, Ohio, to Dublin, Ireland (where this reporter is sequestering); and lessons from his first pandemic — the HIV/AIDS crisis that eventually killed more than 32 million people worldwide. Fauci’s role in the HIV/AIDS epidemic, in the early days, was fraught. But after a rocky start, Act Up activists were given seats at the table of the planning committee of the AIDS Clinical Trial Group. Larry Kramer, the playwright and activist who once called Fauci a “murderer” and an “incompetent idiot,” ended up a respected and even beloved friend of Fauci’s. On President Trump’s embrace of masks, Fauci says, ‘I’m very pleased to hear that he’s now being pretty explicit about some of the things that we — namely his medical advisers — have been telling him for some time.’ Source: MarketWatch photo illustration/Getty Images. Fauci is rated as the most trusted voice on COVID-19 in the U.S. And today? Fauci is consistently rated as the country’s most trusted voice on the coronavirus, although his support is notably split among political lines (51% of Republicans and 67% of independents). His dealing with the fire and passion of Kramer may have helped to give Fauci a tough skin to cope with the slings and arrows in recent weeks, particularly from the White House. His critics say the dramatic U-turn by the federal government and health authorities in April instructing the public to wear face masks could have been avoided — if they had simply erred on the side of caution. Fauci maintains that his position changed when the evidence showed asymptomatic transmission, and when there were enough medical-grade N95 masks for medical workers. He is eager to point out that millennials and young adults need to wear masks and practice social distancing, too. He has this message for them: “You don’t realize, probably innocently, that you are inadvertently propagating the outbreak. You are becoming part of the problem because, even if you get infected without any symptoms, it is likely that you are going to infect someone else.” Isn’t it hard to get children to socially distance in school, and young adults to follow the rules? “Yes, it is,” Fauci said. “Sooner or later, a vulnerable person gets infected and gets seriously ill. You should realize that it is your duty and your civic responsibility: You could be hurting someone else. That’s a tough message to get because some young people feel completely invulnerable.” MarketWatch spoke to Fauci a couple of hours before he threw out the first pitch before the Washington Nationals’ season opener against the New York Yankees at Nationals Park, with cardboard fan cutouts and canned crowd noise occupying an empty stadium. His pitch was wild, leading him to joke that, having been a shortstop in his youth, he thought he should throw to first. Aside from such moments of respite, he is rarely off the clock. Fauci, who has been accused by online conspiracy theorists of trying to undermine and outshine the president, will receive an enhanced security detail after receiving death threats. But he seems undaunted in the face of scrutiny, and focused on his message to the public: Be your own best protection against COVID-19. Also see:Letter from New York, the quiet epicenter of coronavirus: ‘The streets are virtually empty, but the birds go on singing’ Fauci says frontline workers, the elderly and those with underlying conditions should receive a vaccination first. He runs or power walks 3.5 miles every night to relax. ‘It is a very, very high-pressure job. It’s exhausting. But that’s my choice. I’ve been doing this for my entire career,’ he says. Source: Getty Images. Getty Images This conversation has been edited for style and space: MarketWatch: Greetings from Ireland, Dr. Fauci. Have you ever been here? Fauci: I have not. I have only been to the airport making a connection. I’ve never actually traveled around Ireland. How’s the weather? MarketWatch: Rainy and chilly. Fauci: It seems like it’s always that way there! MarketWatch: Just the way I like it. You know, I was actually thinking of you getting on my trans-Atlantic flight, and I wondered whether Dr. Fauci would get on a flight at the moment? Fauci: Well, the answer is “no” for the following reason: I am in a risk category. I don’t like to admit it, but I’m 79 years old. I can’t think of a reason to go trans-Atlantic. Right now, I’m very sequestered. I’m on a coronavirus task force. I go to the White House almost every day. I spend half a day in my office trying to develop a vaccine and drugs for COVID-19, and that’s really what I need to do. I don’t fancy seeing myself getting infected, which is a risk when you’re getting on a plane, particularly with the amount of infection that’s going on right now. “ ‘I’m not sure taking temperatures is all it’s cracked up to be.’ ” — Anthony Fauci MarketWatch: The airline did not take our temperatures as we were boarding, or getting off. In New York, they do it in the doctor’s and dentist’s office. Fauci: I’m not sure taking temperatures is all it’s cracked up to be, because there are a lot of false negatives and false positives. It’s best to just question people: “Do you have any symptoms? Have you been near someone who is infected?” The time spent asking a couple of simple questions is probably more effective than just taking temperatures, to be honest with you. MarketWatch:There appears to be a disconnect in how people are approaching this pandemic. In New York, almost everyone appears to be wearing a mask on the street. In Ireland, hardly anyone is wearing one on the street, and it’s hit-and-miss in the stores here. In other parts of the U.S., it’s anyone’s guess. What’s your take on that? Fauci: Yeah, that’s unfortunate because there really is an inconsistency in usage and an inconsistency in message. We’ve really got to make it very clear. If you want to pick three or four or five very simple tools that could have a major impact on turning around the outbreak, wearing a mask is definitely one of them, as is physical distancing, as is avoiding crowds, as is closing bars, as is washing your hands. I’m pleading with people to consider doing this consistently because, you’re right, if half of people don’t do it, it kind of negates the overall purpose. MarketWatch: Do you have any estimate on how much less likely people are to transmit coronavirus if they’re wearing a mask: 50%? 99%? Or …? Fauci: We don’t know exactly. There have been a number of meta analyses. One published in the Lancet on June 1 said masks and respirators reduced the risk of infection by anywhere from 78% to 85%. Your guess is as good as any: 50% to 75% or 80% is probably correct. Anthony Fauci: ‘This is a very, very high-pressure job. It’s exhausting. That’s my choice. I’ve been doing this for my entire career.’ Source: MarketWatch photo illustration/Getty Images, iStockphoto. ‘I am not going to restaurants right now’ MarketWatch: I presume you are not hanging out in restaurants or bars. Is it really more dangerous to eat indoors at a restaurant than outdoors? Fauci: Yes, absolutely. Indoors is much worse than outdoors. If you’re going to go to a restaurant, try as best as you can to have outdoor seating that is properly spaced between the tables. MarketWatch: So you’re not going to restaurants? You wouldn’t risk it? Fauci: I am not going to restaurants right now. MarketWatch: Looking ahead, President Trump wants schools to reopen. Denmark has done it successfully, it seems, while Israel has faltered. What’s your take on that? Fauci: So if you open up a school safely in a region where there’s not much infection, you probably don’t even have to make any changes. If you’re in a place where there’s considerable infection activity, there are a lot of options to mitigate the risk that you could do a hybrid model of part online, part in-person. You could physically separate the children at school, alternate days or morning/afternoon classes. It’s going to vary depending on the risk. MarketWatch: That all sounds like good advice for people returning to the workplace, too. Fauci: Yes, right. MarketWatch: What are the chances there will be one big long wave rather than a first and second wave? That’s how it’s starting to feel. Fauci: I’ve never bought into this issue. We are still in a pretty big first wave. You talk about the possibility of a second wave when you’ve gone down to baseline and there aren’t too many new infections. ‘With most vaccines, you tend to give a high priority to frontline workers’ MarketWatch: How concerned are you that the U.S. will face a flu season and a rise in coronavirus cases in the winter or fall? Fauci: If, in fact, and I hope it isn’t the case, we have significant COVID-19 activity as we go into the fall and winter season, that will be problematic and complicate things because that’s two respiratory infections circulating together, which is one of the reasons we’re telling people that, when the flu vaccine becomes available, make sure you get vaccinated so that you could at least blunt the effect of one of those two potential respiratory infections. MarketWatch: You’ve said you’re hopeful of a vaccine in the spring. Mike Ryan, executive director of the World Health Organization’s emergencies program, among other observers, have said that early next year is optimistic. Are you still saying early next year? Fauci: I stick by what I’ve been saying all along. I’m cautiously optimistic that we’ll have a vaccine by the end of this calendar year or the first month or two of 2021 is a reasonable projection. MarketWatch: Assuming there is a vaccine that works — which is not a given — who should receive it first? People in nursing homes? Frontline workers? Fauci: We’re going to put a group together of ethicists, clinicians, vaccinologists and community representatives, and make a prioritization of who should get it when the first doses become available. Generally, with most vaccines, you tend to give a high priority to frontline workers: hospital emergency-room people, those maintaining order in society, and people who are more vulnerable to the deleterious and serious effects associated with infections — the elderly and those with underlying conditions. MarketWatch:Do you think the $19.50 per dose price Pfizer PFE, -0.27% is charging the U.S. government for the first 100 million doses of its COVID-19 vaccine is reasonable? Fauci: I would hope that it’s at a price that makes it eminently affordable by anyone who needs it. MarketWatch: So you don’t have a problem with companies making a profit off this, as long as people can afford it? Fauci: Right. Related: ‘The 1918 Spanish flu’s second wave was even more devastating’: WHO advises caution to avoid ‘immediate second peak’ Anthony Fauci on who should be first in line if and/or when a vaccine becomes available: ‘Generally, with most vaccines, you tend to give a high priority to frontline workers.’ Source: MarketWatch photo illustration/Getty Images, iStockphoto. ‘You don’t really fully appreciate the ultimate magnitude’ MarketWatch: What was the biggest lesson you took from your experience with the AIDS pandemic in the 1980s and 1990s that you brought to this pandemic? Fauci: Oh, my goodness. There are so many lessons because I have spent such a large portion of my professional existence fighting HIV from the very first years, from 1981, onward. The first thing is how you tend to underestimate outbreaks. In the beginning, you don’t really fully appreciate the ultimate magnitude. That was certainly the case with HIV when it first presented in a relatively small group of gay men in the United States, even though there already had been worldwide spread, and we didn’t know about it. The same thing with coronavirus. It was felt to be just a virus that jumps species from an animal to a human, and we found out that was not the case, that it spread very easily from human to human. It rapidly exploded into a major global pandemic. There are a lot of differences, too. One is an insidious disease that accumulates over decades, and the other is a major explosion of cases in a period of less than six months. MarketWatch: Right, it happened in just six months — God. If it is necessary, how difficult would it be to get people to abide by stay-at-home orders again? Fauci: It would be difficult. That’s the reason that I think we can accomplish the goal of getting this surge of infections under control by first calling a pause, and maybe taking a step back, too. Some of the states jumped over some of the checkpoints. If you’re in Phase 2, maybe you want to drop back to Phase 1. If you’re in Phase 1, maybe you want to go back to gateway. There are different phases in trying to open America again.‘I tend to like to go out in the evening and run’ MarketWatch: What are the most surprising or helpful things medical professionals have learned about treating COVID-19 patients? Fauci: Well, it’s not helpful, it’s sobering that 20% to 45% of the people who were infected don’t have any symptoms at all, which makes it extremely difficult to do contact tracing. MarketWatch: And contact tracing has been an uphill struggle in the U.S. It’s a big country with one president and 50 governors, and they’re all doing their own thing. Fauci: Yes, including the fact that you generally get the results of the tests back in five, six, seven days, which is far too long a period of time. MarketWatch: It took 10 days to get mine back. It’s an awesome responsibility for laboratories, doctors and yourself, holding the health of a nation in your hands. People look to you as a trusted source. How do you deal with that in the quiet of night? Fauci: This is a very, very high-pressure job. It’s exhausting. But that’s my choice. I’ve been doing this for my entire career. MarketWatch: How did you feel about the criticism you recently received? The president’s comments that “mistakes” were made by you on masks, Peter Navarro’s op-ed in USA Today, and the White House list of criticisms sent to the Washington Post. There seemed to be a flurry of them over the course of just a few days. Fauci: That Navarro stuff is just a bunch of unfortunate noise. It does nothing but detract from the general purpose of what we’re trying to do. I tend to put that behind me because it was merely a distraction. I don’t know why that happened. I don’t know why people made those statements. It certainly isn’t helpful. It certainly is not the truth. That’s the most important thing. The Washington Post, on a point-by-point basis, refuted every one of those claims of my “errors” and “mistakes.” MarketWatch:What do you do to relax and decompress? Crossword puzzles, Pilates, push-ups? Fauci: [Laughs.] I tend to like to go out in the evening and run. I don’t run as much as I used to because I’m getting old. I do power walking. I walk or run at least 3.5 miles a day. MarketWatch: That’s more than I’m doing. You’re not eating junk food like most of us, I suppose. Fauci: Sometimes, I get so busy I don’t eat at all. My wife has to remind me it’s time to drink something or eat something. MarketWatch: It seems like you are living the advice that you’re giving people. Fauci: Well, I hope so."}]}