{"article": [{"url": "https://www.marketwatch.com/story/why-you-might-not-know-that-trump-is-threatening-your-social-security-2020-09-02", "published": 1599296960.0, "headline": "Why you mightÂ notÂ knowÂ that Trump is threateningÂ yourÂ Social Security", "body": "One way U.S. voters are being played during this presidential election campaign is the deceitful manner in which key issues are being framed for their consumption.Â Arguably the biggest and most important of these concerns the so-called â\u0080\u009cthird railâ\u0080\u009d of American politics: Social Security.Â President Donald Trump has vowed to kill funding for this critical, gargantuan program that nearly 70 million Americans depend on.Â What? You havenâ\u0080\u0099t heard Trump say he wants to kill Social Securityâ\u0080\u0099s funding? Actually, you have. Trump says he wants to kill the payroll tax â\u0080\u0094 which is how Social Security is funded.Â Perhaps like many Americans, youâ\u0080\u0099re unaware of how Social Security is financed. It comes from payroll taxes that are paid by you and your employer. The past four years have convinced me that there are many other things that Trumpâ\u0080\u0099s supporters donâ\u0080\u0099t seem to understand either (trade/tariffs, regulations, the stock market, etc.) but I digress. â\u0080\u009cIf victorious on November 3rd,â\u0080\u009d the president said on Aug. 8th, â\u0080\u009cI plan to forgive these taxes and make permanent cuts to the payroll tax.â\u0080\u009d He then added: â\u0080\u009cIâ\u0080\u0099m going to make them all permanent.â\u0080\u009d So when Trump talks of a â\u0080\u009cpayroll tax cut,â\u0080\u009d you might think that sounds great. A tax cut! But this is deceptive election year politics, designed to take advantage of voter ignorance. AnyoneÂ in the media thatâ\u0080\u0099s going along with Trumpâ\u0080\u0099s framing of this as a mere tax cut is also being played. Read: The assault on Social Security is under way Also see: Trump plan to scrap payroll tax would reduce benefits by 2021, top Social Security actuary says Trump seems to think that killing the payroll tax will save companies big bucks (His 2017 corporate tax cut wasn't enough?) while increasing the take home pay of American workers. Bigger take home pay? Tens of millions of Americans donâ\u0080\u0099t have pay â\u0080\u0094 period â\u0080\u0094 thanks to the economic collapse brought on by the COVID-19 pandemic.Â Important sidebar: Note that Trump said in late February, when the U.S. had just 15 coronavirus cases, that we would soon be down to none â\u0080\u0094 proof, he said, that he was an effective leader. â\u0080\u009cWhen you have 15 people, and the 15 within a couple of days is going to be down to close to zero, thatâ\u0080\u0099s a pretty good job weâ\u0080\u0099ve done,â\u0080\u009d Trump said at the time. Yet as of this writing, the U.S., with about 4% of the worldâ\u0080\u0099s population, has more than six million cases â\u0080\u0094 one of every four on the planet. Not that this and other gross miscalculations and bumbling has stopped Trump from believing â\u0080\u0094 and actually looking into â\u0080\u0094 how he could be added to Mount Rushmore, alongside Presidents Lincoln, Washington, Jefferson and Theodore Roosevelt. It doesnâ\u0080\u0099t get more delusional than this except, perhaps, for kooky Trump advisers like economist Stephen Moore, and even Treasury Secretary Steven Mnuchin, who has said that Social Security could always be paid for by moving trillions of dollars from the governmentâ\u0080\u0099s â\u0080\u009cgeneral fund to those trusts funds.â\u0080\u009d Trillions of dollars from the general fund?Â Â What trillions of dollars? The federal deficit for fiscal year 2019 that ended last Sept. 30 was $984 billion. It has nearly quadrupled this year to a staggering $3.7 trillion, and this will skyrocket even further if another round of pandemic aid gets passed. These sums â\u0080\u0094 so vast as to be nearly incomprehensible â\u0080\u0094 get added on to the national debt, which as of last week was $26.6 trillion, up 33.6% on Trumpâ\u0080\u0099s watch.Â Remember: Trump said he would eliminate the entire national debt â\u0080\u0094 not the deficit, the national debt itself â\u0080\u0094 in eight years, because of all the brilliant trade deals he would do. Here we are four years later and things are worse, far worse, than ever.Â Other White House advisers, seeing the political damage this kind of talk has inflicted in a tough election race, have walked back plans to kill Social Securityâ\u0080\u0099s funding. And yet Trumpâ\u0080\u0099s words speak for themselves.Â All this loose talk is an insult to the tens of millions of Americans who are heavily dependent on Social Security (and Medicare too). â\u0080\u009cHeavily dependentâ\u0080\u009d is not hyperbole. Consider some numbers: According to the Social Security Administration, the average monthly benefit for recipients this year is $1,503. As modest as this is, it represents just about everything â\u0080\u0094 â\u0080\u009c90% or moreâ\u0080\u009d of all income received by â\u0080\u009c21% of married couples and about 45% of unmarried persons.Â Itâ\u0080\u0099s probably difficult for wealthy men like Trump, Mnuchin (who moonlights as the chief trustee of the Social Security Trust Fund) and others to see, but there is a vast sea of poverty in the United States. Click here to read a recent MarketWatch column I wrote about seniors and poverty.Â Iâ\u0080\u0099m talking about men and women â\u0080\u0094 tens of millions of American workers â\u0080\u0094 who paid into the system over their entire working lives. They deserve more respect than the Trump administration is showing them â\u0080\u0094 and the assurance that the U.S. government will, without fail, honor the obligations it has made to them.Â Since Trumpâ\u0080\u0099s base skews older, itâ\u0080\u0099s reasonable to assume that many of them, too, are overly dependent on Social Security. They, and everyone else, must understand that when the president talks about a payroll tax cut, it doesnâ\u0080\u0099t mean what it seems. Â Â Read: Trumpâ\u0080\u0099s payroll-tax executive order could mean bigger paychecks this year â\u0080\u0094 but 2021 is a different story More: Trumpâ\u0080\u0099s election year gamble: Messing with Social Security and Medicare"}]}