{"article": [{"url": "https://www.marketwatch.com/story/investors-cheer-as-two-coronavirus-vaccine-candidates-report-t-cell-responses-but-findings-are-still-early-stage-2020-07-20", "published": 1595313200.0, "headline": "Investors cheer as two coronavirus vaccine candidates report T-cell responses, but findings are still early stage", "body": "At least two experimental COVID-19 vaccines produced a T-cell response in participants in early-stage clinical trials, which may indicate a more durable form of immunity than an antibody response. BioNTech BNTX, +1.23% and Pfizer Inc. PFE, -0.27% said early Monday morning that an ongoing early-stage clinical trial for their coronavirus vaccine candidate, BNT162b1, reported a T-cell response in participants, in addition to neutralizing antibody titers. BioNTech’s shares were up, by 1.8%, in afternoon trading, as were Pfizer shares, which gained 0.8%. “Importantly, today’s data includes the first evidence of the vaccine generating a T-cell response, which could be critical in order for patients to develop durable immunity to the novel coronavirus,” Vamil Divan, an analyst at Mizuho Securities, told investors on Monday. A Pfizer executive last week told Divan that a T-cell response may be a differentiating factor for their vaccine. Read: After months of speculation, investors get excited about Pfizer, BioNTech’s coronavirus vaccine candidate Then, in a highly anticipated study published in The Lancet published Monday morning, researchers at AstraZeneca AZN, +1.16% AZN, +0.63% and the University of Oxford said their investigational COVID-19 vaccine also produced a T-cell response, as well as antibody titers. However, it seems that investors were less pleased with AstraZeneca’s readout, with shares down 3.2% in afternoon trading. Bernstein’s Ronny Gal said this is likely due to the fact that while AZD1222 reported neutralizing antibody titers in all of the trial’s participants, they were lower than the sera of patients who have recovered from coronavirus infections. BioNTech, Pfizer, and Moderna Inc. MRNA, +0.09% have previously said their vaccine candidates had titers that were higher than the sera of recovered patients — though experts have cautioned against direct comparisons of the vaccine trials being conducted by different companies. Gal still said he thinks that AstraZeneca’s results are positive, with the data indicating AZD1222 should move into the next phase of research. “However, in the competitive context they fail to impress,” he wrote in a note to investors on Monday. See also: Abbott, J&J results buoyed by surprising June uptick in medical procedures even as coronavirus cases rise Inovio Pharmaceuticals Inc. INO, -1.36% and Moderna, which have both reported some early clinical data about their COVID-19 vaccine candidates, have not said their vaccines produced a T-cell response. In afternoon trading on Monday, Inovio’s stock was down 7.0% and shares of Moderna tumbled 14.1%. Also weighing on Moderna shares, J.P. Morgan downgraded Moderna to neutral from overweight over concerns about the company’s valuation, with the stock soaring nearly fivefold since the start of the year. That said analysts are still wary about the undetermined nature of immunity with such a novel virus. “What remains unknown is whether the antibody response translates into protection, the level of neutralizing antibodies required for durable protection, and the role of T-cell immunity in the process,” SVB Leerink analysts wrote on Monday. Monday’s vaccine news sent up the SPDR S&P Biotech Exchange-Traded Fund XBI, +0.92% by 0.9%, while the iShares Nasdaq Biotechnology ETF IBB, +0.81% rallied 1.1% in afternoon trading. The S&P 500 SPX, +0.87% is down 0.2% year-to-date."}]}