{"article": [{"url": "https://www.marketwatch.com/story/a-reminder-as-schools-reopen-federal-law-now-gives-some-parents-paid-time-off-to-help-their-kids-with-remote-learning-2020-09-10", "published": 1600576160.0, "headline": "Federal law now gives some parents paid time off to help their kids with remote learning", "body": "Last month, a recently-reopened school district near Atlanta, Ga. told more than 1,000 students and staffers they had to quarantine after a coronavirus outbreak. Earlier this month, approximately 450 students and employees in a central Florida school system needed to isolate after positive COVID-19 cases. Almost 2,000 miles away, around 100 teenagers and staff in a Denver-area school had to do the same because of cases in their school. Rocky school reopenings are already upending educators’ plans this fall — and they’re likely doing the same thing to the work schedules of many parents who, if they aren’t already working from home, may suddenly need to be there with their quarantined student. The good news is there’s a range of employee leave laws that could conceivably kick in to protect parents in this situation, separate and apart from an employer’s own paid time off policies. The tricky part, however, is that there’s a complicated mix of rules. And the worrying note, some say, is that the laws don’t do enough to help parents who are trying to make it all work right now. New federal laws temporarily expanded paid family leave During the early days of the pandemic, federal lawmakers passed the Families First Coronavirus Response Act (FFCRA). Though America is the only highly industrialized country without a federal paid family leave law, the FFCRA temporarily enabled paid leave for families pulled from work to quarantine, care for others with COVID-19, or care for children who are at home because of closed day cares and schools. The FFCRA has two important parts: one portion addressing emergency paid sick leave and another portion for expanded family and medical leave. When it comes to school and child care, the U.S. Department of Labor says covered workers can access up to two weeks (80 hours) of emergency paid sick leave at two-thirds pay. The cap on pay in this time period is $200 daily and $2,000 total, according to the Center for WorkLife Law within the University of California, Hastings College of the Law. A covered worker (they have to have been on the payroll for at least 30 days) can also tap the law’s expanded family and medical leave for an additional 10 weeks of pay at two-thirds their compensation. In that 10-week period, an employer pays a maximum of $200 a day and up to $10,000 total, the Center for WorkLife Law. Employers ultimately receive a dollar-for-dollar tax credit that covers them for paying the leave. The law applies to employers with fewer than 500 workers. A small business with fewer than 50 workers can apply for an exemption if it can show the absence of employees would jeopardize its operations and bottom line. The paid leave provisions are in effect from April 1, 2020, to Dec. 31, 2020. If a school closes for half a day, parents can get paid time off The Labor Department weighed in late last month on how the FFCRA fit in with the fall school year. “ If a student attends school some days but has distance learning on other days, parents can receive paid leave on the days their child is home. ” If a student physically attends school some days, but has distance learning on other days, the department said a parent can get paid leave on the days their child is home. That’s because the school is essentially “closed” to the student for the day in eyes of the law. (If a child is home under a quarantine order, that can justify the parent’s paid leave.) On the other hand, if a parent chooses all remote learning instead of in-person instruction, they cannot access paid leave under the federal law. The school is not “closed” in that context, the Labor Department said. If school administrators start the year remotely and say they’ll make a reopening decision at a later date, the school is still closed and the paid leave is still available. Likewise, a school might be open, albeit for a half day. The FFCRA allows workers to apply for paid leave in bite-sized pieces, like from 2:30 p.m. to 4 p.m. “You may take intermittent leave in any increment, provided that you and your employer agree,” a Labor Department questionnaire said. “The Department encourages employers and employees to collaborate to achieve flexibility and meet mutual needs.” State and local laws can support working parents too Now consider the fact that FFCRA isn’t the only paid leave law out there. As the pandemic continued, various states and cities have expanded their paid leave laws to incorporate things like school closures. Is it possible to stack the time off, so that a parent could pull paid leave from one law and then turn around and pull from another? “It depends on what law you are talking about and what the context is,” said Liz Morris, deputy director of the Center for WorkLife Law. “The bottom line is, it’s extremely complicated the way these laws all interact.” The center launched a helpline in April to assist workers navigating all the rules out there. “Anybody who has COVID-19 caregiving issues in the workplace can call,” Morris said. The center’s helpline is (415) 851-3308 and its email is: covid19helpline@worklifelaw.org. Morris’ team has talked to people trying to figure out the leave laws, pregnant women and new mothers who are concerned about being at work and others with health conditions who are worried about returning to work. There’s a range of federal and state laws, but Morris said they may not be good enough for everyone — especially if they’ve already used up their paid leave under the FFCRA. “ ‘We’re trying to rely on this patchwork... What we really need is a single comprehensive law that protects everyone.’ ” — Liz Morris, deputy director of the Center for WorkLife Law at University of California, Hastings College of the Law “We’re trying to rely on this patchwork of laws to bring together a set of legal rights for people so that they just have a job to return to when this is all over and need income … What we really need is a single comprehensive law that protects everyone.” Paid time off is important for parents juggling work and school right now, but it’s not everything, said Rich Fuerstenberg, senior partner in the Life, Absence and Disability practice at Mercer, a human resources consulting firm. For one thing, leave under the FFCRA “is a one-shot deal. Once it’s gone, it’s gone,” he noted. Going into the fall, Fuerstenberg said the companies he’s been working with have been thinking hard about their work schedule flexibility policies, how they can assist with child care costs and also looking at how much paid time off they are giving staff. Almost two-thirds (62%) of companies said they were allowing parents to change their work schedules so employees could manage their child’s new school routine this fall, according to a July-August Mercer survey of more than 800 employers."}]}