{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-vaccine-likely-to-be-unavailable-to-most-americans-until-well-into-2021-2020-09-16", "published": 1600278620.0, "headline": "Coronavirus vaccine likely to be unavailable to most Americans until well into 2021", "body": "WASHINGTON — The government outlined a sweeping plan Wednesday to make vaccines for COVID-19 available for free to all Americans when proven safe and effective, though a top public health official made clear that widespread vaccination of millions of Americans couldn’t come until well into next year. In a report to Congress and an accompanying “playbook” for states and localities, federal health agencies and the Defense Department sketched out complex plans for a vaccination campaign to begin gradually in January or even late this year, eventually ramping up to reach any American who wants a shot. President Donald Trump asserted Tuesday that a vaccine could be three to four weeks away. But the head of the Centers for Disease Control and Prevention told Congress Wednesday that it would take six to nine months after any shot’s approval to distribute it nationally. CDC Director Robert Redfield said any vaccine available in November or December would be in “very limited supply,” and reserved for first responders and people most vulnerable to COVID-19. The shot wouldn’t be broadly available until the spring or summer of 2021, he estimated. Redfield and other health officials testifying before the Senate Appropriations Committee also emphasized the effectiveness of masks in stopping the pandemic’s spread, given that no vaccine is 100% protective. The flu vaccine, for example, is generally about 40% to 60% effective against the annual viral strain. Redfield, masked in the hearing room, said, “I might even go so far as to say that this face mask is more guaranteed to protect me against COVID than when I take a COVID vaccine.” Trump has continued to downplay the effectiveness of masks in spite of the recommendations of his own health experts, mentioning Tuesday that waiters have struggled with their face coverings and do not like them. The entire vaccine enterprise faces continued skepticism. Only about half of Americans said they’d get vaccinated in an Associated Press-NORC poll taken in May. Since then, questions have only mounted about whether the government is trying to rush treatments and vaccines to help Trump’s reelection chances. The Health and Human Services Department announced Wednesday that political appointee Michael Caputo would take a leave of absence to “focus on his health and the well-being of his family.” The news followed revelations that Caputo had tried to gain editorial control over the CDC’s scientific publications on COVID-19, which he contended were hurting the Trump administration. Redfield said that the “scientific integrity” of his agency’s reports “has not been compromised and it will not be compromised under my watch.” He also rejected questions about whether the CDC’s timeline for states to be ready for a vaccine by Nov. 1 was politically motivated. “The worst thing that could happen is if we have a vaccine delivered and we’re still not ready to distribute,” Redfield told Senate lawmakers. “There was absolutely no political thinking about it.” Sen. Patty Murray of Washington, the committee’s top Democrat, said political interference from HHS had damaged public trust in the government’s health information. “The Trump administration needs to leave the science to the scientists immediately,” Murray said. Democratic presidential nominee Joe Biden said while campaigning that he trusts what scientists say about a potential vaccine — but not Trump. Biden has said he would take a vaccine “tomorrow” if it were available but he would want to “see what the scientists said” first. As for the planned vaccine campaign, Redfield said that his agency will be working with state health officials to implement the preparations in coming days. Among the highlights of the plan: — For most vaccines, people will need two doses, 21 to 28 days apart. Double-dose vaccines will have to come from the same drugmaker. There could be several vaccines from different manufacturers approved and available. — Vaccination of the U.S. population won’t be a sprint but a marathon. Initially there may be a limited supply of vaccines, and the focus will be on protecting health workers, other essential employees, and people in vulnerable groups. A second and third phase would expand vaccination to the entire population. — The vaccine itself will be free of charge, thanks to billions of dollars in taxpayer funding approved by Congress and allocated by the Trump administration. The goal is that patients won’t be separately charged for administration of their shots, and officials say they are working to ensure that’s the case for all Medicare recipients and uninsured people as well those covered by insurance at their jobs. — States and local communities will need to devise precise plans for receiving and locally distributing vaccines, some of which will require special handling such as refrigeration or freezing. States and cities have a month to submit plans. — A massive information technology effort will be needed to track who is getting which vaccines and when, and the key challenge involves getting multiple public and private databases to link with each other. Some of the broad components of the federal plan have already been discussed, but Wednesday’s reports attempt to put the key details into a comprehensive framework. Distribution is under the umbrella of Operation Warp Speed, a White House-backed initiative to have vaccines ready to ship in 24 hours from when a version is given emergency use approval by the Food and Drug Administration. However, public skepticism remains. Of the Americans who said in the May AP poll that they wouldn’t get vaccinated, the overwhelming majority said they were worried about safety. To effectively protect the nation from the coronavirus, experts say 70% to 90% of Americans must either be vaccinated or have their own immunity from fighting off COVID-19. As public confidence in health agencies has taken a beating, Trump administration officials have been forced to play defense. “We’re dealing in a world of great uncertainty,” said Paul Mango, a top HHS official working on the vaccine plan."}]}