{"article": [{"url": "https://www.marketwatch.com/story/beware-of-wall-street-analysts-predicting-how-a-president-biden-would-affect-stocks-and-sectors-2020-08-21", "published": 1598110700.0, "headline": "Beware of Wall Street analysts predicting how a President Biden would affect stocks and market sectors", "body": "Here are just some of the stock market forecasts emerging from Wall Street’s latest parlor game: predicting how different industries and sectors will fare after November’s presidential election. Some believe that if Joe Biden becomes the next U.S. president, investors in gold as well as shares of Chinese and clean energy companies will have reason to cheer. If President Donald Trump is re-elected, in contrast, those investments will be hurt but shares of oil, gas and coal companies should rally. Don’t believe all you hear. The analysts making them have rarely taken the trouble to actually test them. If they had done so in a rigorous way, they would have discovered that there is no statistical significance to the numerous correlations they claim to have found in the data. I know because I did the testing myself. I input into my PC’s statistical software the prices from the electronic betting markets of the futures contracts pegged to Trump or Biden winning this fall. (I obtained the data from Bonus.com, a website that aggregates the pricing history from Betfair, Betway, Smarkets and PredictIt.) I then searched for correlations between changes in the Trump or Biden contracts and those of more than three dozen industry- and sector ETFs. Try as I might, I came up empty at the 95% confidence level that statisticians frequently use when determining if a pattern is real. I measured correlations in day-to-day returns as well as weekly returns. I also measured correlations over three different periods: since March, since April when Democratic presidential candidate Bernie Sanders suspended his campaign, and since June when Biden formally acquired enough delegates to clinch the nomination. Read: The stock market would love a Democratic sweep in November This hasn’t prevented analysts who should know better from making breathless claims about the alleged correlations. Earlier this week, for example, one prominent Wall Street analyst wrote that “investors betting that Joe Biden will win the presidential election are buying up clean-energy stocks.” As an example, he pointed to the WilderHill Clean Energy Index, a compilation of green-power companies listed on U.S. exchanges, surging to a more than nine-year high earlier this week. I don’t doubt that this statement is literally true, since some of those investing in this ETF believe Biden will win. But I’m sure that others who are investing in this ETF believe Trump will win. In any case, the correlation that the analyst is suggesting simply doesn’t exist, as you can see from the chart below. So far this month, for example, while Biden’s odds of winning have fallen five percentage points, this ETF has gained 17%. Does the absence of any significant correlations mean that it doesn’t matter who wins in November? No. It means other factors have a far greater impact on stock prices than the winner on Election Day. We should be focusing on these other factors rather than playing Wall Street parlor games. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com More:Why stock-market investors are bracing for the ‘most litigated’ election in U.S. history Plus: Obama rebukes Trump by name in DNC speech, warns that our democracy is at risk"}]}