{"article": [{"url": "https://www.marketwatch.com/story/the-numbers-tell-us-the-economy-is-better-but-millions-of-americans-arent-feeling-it-2020-09-12", "published": 1599917960.0, "headline": "The numbers tell us the economy is better, but millions of Americans aren't feeling it", "body": "The U.S. economy has kept growing despite a summer spike in coronavirus cases and the end of massive federal aid, but millions of Americans are either being left out or in are danger of being left behind. With the fall approaching, the broader economy has performed better than expected. Hiring increased again in August, consumer spending has been steady, manufacturers are still on an upswing and demand for homes and new cars has been surprisingly strong. See: MarketWatch Economic Calendar The upcoming week's data is likely to show another robust increase in retail sales in August as well as improved production among manufacturers in September, suggesting a U.S. recovery is still ongoing even if it has tapered off. Yet a new divide has emerged between the haves and have-nots - with the have-nots the ones whose livelihoods has been most disrupted by the coronavirus pandemic. Consider a pair of industries: finance and hospitality. The unemployment rate among banks, insurers, Wall Street brokerages and other companies involved in the handling of money was just 4.2% in August. That's not much higher than the national rate of unemployment shortly before the pandemic struck in March. Read:U.S. consumer prices surge for third straight month as cost of used cars soar By contrast, the unemployment rate for companies involved in travel, hotels, dining out and other forms of leisure and hospitality stood at a stunning 21.3% last month. What's worse, these jobs tend to pay far less than professional work in fields such as finance and technology. Many of the key economic reports on the economy, however, tell us very little about this divide. Retail sales and consumer spending, for example, have been stronger than expected. What it most likely reflects is the habits of high-income earners with secure jobs who are working from home. They can afford to spend - and that's what they are doing. High demand among these individuals helps explain strong sales of homes and autos. And they have even more reason to spend given a massive rebound in the stock market that has pushed their net worth close to pre-pandemic levels. Steve Blitz, chief economist at TS Lombard, said it's long been an industry maxim that the 20% of wealthiest Americans account for up to 80% of all discretionary spending. If that's the case now, they are making the recovery look better than it is. The millions of Americans still out of work who are struggling to make ends meet have no such luxury, especially after the expiration of an extra $600 in federal unemployment benefits in July. \"It is a significant loss for the people who are no longer getting it,\" Blitz said. The loss of income for these Americans, and devastation caused to airlines, hotels, restaurants and retailers, could eventually filter into the broader economy and even hurt high-income earners and the stock market. Just this month, a hoard of major airlines, hotels, mall operators and others have announced they will permanently cut more jobs unless Washington provides additional aid. U.S. jobless benefit claims have risen for four straight weeks, potentially another warning sign of trouble ahead. Read:Jobless claims rise fourth straight week in sign of stalling labor market Also:U.S. jobless claims are rising again - and this state is a big reason for that The Federal Reserve, meeting this week to evaluate the economy, is still worried enough that top central bankers continue to plead for more financial relief from Congress. Normally very reticent to give lawmakers advice, the Fed has been surprisingly vocal because it worries the recovery will flag unless Congress puts more wind at its back. The wildfires in California, the state with the nation's largest economy, isn't helping. The fires have displaced many people and caused applications for unemployment benefits to spike. So far nothing's changed in Washington, though. Democrats blocked a \"skinny\" Republican bill last week that would have provided somewhat more aid for the economy. Democrats want a much larger spending bill that Republicans have resisted. With the pivotal 2020 election looming in November, the odds of another major financial-aid package appear to be diminishing by the day. Perhaps the only thing that will get Congress to act, analysts say, is a sudden downturn in the recovery. It didn't happen in August, however, and it doesn't look like the economy will suddenly peter out in September, either. \"As hard as it would have been to believe a few short weeks ago, it now seems entirely believable that we are headed into the election with no new measures,\" said chief economist Douglas Porter of BMO Capital Markets."}]}