{"article": [{"url": "https://www.marketwatch.com/story/us-budget-deficit-soars-to-record-864-billion-in-june-higher-than-all-of-last-year-2020-07-13", "published": 1594655600.0, "headline": "U.S. budget deficit soars to a record $864 billion in June on surge in coronavirus aid", "body": "The numbers: The federal government’s budget deficit soared to a monthly record of $864 billion in June, as Washington doled out huge sums of money to try to aid small businesses and unemployed workers amid the coronavirus pandemic. The increase last month pushed the budget gap for the current fiscal year to $2.7 trillion, compared to $747 billion in the same nine-month period last year, the U.S. Treasury Department said Monday. The government operates on annual budget that runs from Oct 1. to Sept. 30 instead of using the calendar year more common in the business world. The U.S. is on track to register a record $3.7 trillion deficit in fiscal 2020 owing to an unprecedented effort to prop up the economy. For all of last year the budget gap totaled almost $1 trillion. The last time the U.S. ran such huge deficits — measured as a percentage of the economy — was during World War II. Read:Coronavirus spike in the dog days of summer saps economy of momentum What happened: Washington spent $1.11 trillion last month, up from $572 billion in May. In the same month a year earlier, outlays were a much smaller $342 billion. The bulk of the increase in spending last month was tied to the so-called Paycheck Protection Plan, a small-business rescue package designed to offer forgivable loans to companies that keep workers on payrolls. Unemployment benefits totaled a whopping $116 billion, including $80.4 billion paid by the federal government. Read:Soaring demand for federal jobless benefits points to fresh fissures in the economy Washington has made millions of self-employed people who never used to qualify for jobless benefits eligible and the federal government also kicked in $600 bonus payments each week. The $600 bonus stops at the end of July and is unlikely to be extended, at least not at the current amount. A year earlier, the states and federal government spent only $2 billion in June for jobless benefits as the unemployment rate moved to a 50-year low of 3.5%. The unemployment rate now stands at 11.1% officially, though unofficially most economists think it’s several points higher. Tax and other revenue, meanwhile, totaled just $241 billion in June. A year earlier, the government took in $333 billion. Tax receipts have fallen because of an extended deadline for payment, along with a depressed economy. Deferments were pushed out to July from April for many tax filers. See: MarketWatch Coronavirus Recovery Tracker Big picture: Washington has already funneled huge sums of money into direct payments to households, extended unemployment benefits, small-business loans and bailouts of industries deemed critical such as airlines. Congress could also add more than $1 trillion in additional emergency-relief measures before the end of summer. The economy is likely to need lots of help at least through the end of the year with tax revenues down and so many people and companies in need of support Market reaction: The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% was flat at 0.64%. The Dow Jones Industrial Average DJIA, +0.56% was up, but the S&P 500 SPX, +0.87% fell."}]}