{"article": [{"url": "https://www.marketwatch.com/story/your-retirement-probably-wont-be-anything-like-your-parentsand-thats-not-good-news-11600707548", "published": 1601125460.0, "headline": "Your retirement probably wonâ\u0080\u0099t be anything like your parentsâ\u0080\u0099â\u0080¦and thatâ\u0080\u0099s not good news", "body": "Not a long-term care plan GERARD JULIEN/AFP via Getty Images When are we going to get real about the looming retirement and aging crisis in this country?Â If we donâ\u0080\u0099t do something itâ\u0080\u0099s going to make theÂ COVID-19Â crisis look like a walk in the park. The latest evidence that thereâ\u0080\u0099s an iceberg straight ahead comes courtesy of the Transamerica Center for Retirement Studies, which has just published its 20thÂ annual retirement survey of U.S. workers.Â They commissioned polling company Harris to survey about 5,300 workers. Oh, and most of the data were accumulated last fall and winterâ\u0080\u0094before the crisis struck and made things even worse.Â Among all the depressing data points, arguably none is more gloomy than the news that 48% of women, and 56% of men, have a serious, well-thought-out plan for dealing with their long-term care needs when they get old. The plan? â\u0080\u009cFamily and friends.â\u0080\u009d No, really. Amazingly, they say spouses are only half of that as well. Theyâ\u0080\u0099re genuinely relying on friends, and family members other than spouses, to pitchÂ in, too. Read: Hope to retire someday? See if you can answer these six simple questions Cue the sound of palms hitting foreheads in financial plannersâ\u0080\u0099 offices across the country. As someone who once helped provide long-term care to a family member for over a year, let me say: You really donâ\u0080\u0099t want to go there if you can possibly help it. A report commissioned by the U.S. Department of Health and Human Services found that about 70% of those who reach 65 are going to need long-term care at some point. Boston-based financial planner Sandra Gilpatrick warns, â\u0080\u009cYou shouldnâ\u0080\u0099t assume your family will live near you to make care easy. They may have their own financial or life struggles making it a major burden or impossible to give care later.â\u0080\u009d She adds: â\u0080\u009cSpouses close in age may think they can take care of each other when they have a conversation at 60. Fast forward to 85 and it is a tremendous physical strain to try to lift someone out of a chair. Giving care can rapidly deteriorate the healthier spouse as well.â\u0080\u009d Meanwhile, I donâ\u0080\u0099t want to give you the wrong impression. I donâ\u0080\u0099t want to suggest that the failure to prepare for long-term care needs is the only part of the survey that is alarming. It isnâ\u0080\u0099t. Among the men surveyed, the median household retirement savings wereâ\u0080¦$69,000. Heavens. A man of 65 with that amount of money can buy a lifetime annuity worth, oh, $330 a month according toÂ immediateannuities.com.Â Among the women surveyed, the median household retirement savings were less than half as much, a mere $28,000. Just under a third of the women surveyed had $10,000 or less set aside. To give you a flavor of how dismal this is, if you type â\u0080\u009c$28,000â\u0080\u009d into the â\u0080\u009cAmount to Investâ\u0080\u009d box at immediateannuities.com, to see how much of an annuity this will get you, it tells you that number is below their minimum threshold for calculations. Mmm. Good times. As usual, everyone is wringing their hands about the financial struggles of the poorÂ millennial generation, but the picture arguably looks even bleaker for Generation Xâ\u0080\u0094the largely overlooked cohort born between 1965 and 1980. Generation X men reported median retirement savings of $80,000 and Gen X women $46,000. For people who are already aged 40 to 55, with diminishing numbers of years left in which to accumulate wealth, these are alarmingly low numbers. (By contrast, baby boomer men reported median household retirement savings over $200,000.)Â More than a quarter of Gen X women said they had less than $10,000 set aside for retirement. Maybe itâ\u0080\u0099s no wonder. Gen Xers have dealt with three or four â\u0080\u009conce in a lifetimeâ\u0080\u009d economic collapses in their adult careers, including not only Covid but also the Great Recession and the worst housing collapse since the Great Depression, the stock market crash, economic slump and terrorism crisis of the early 2000s, and a really dismal economic slump of the early 1990s. They got little uplift from the stock market boom of the late 1990s, which came too early for them to have a lot to invest, but were around and pouring money into their 401(k)Â accountsÂ during the dismal decade that followed. Ouch. Meanwhile, the survey confirms that women are in a worse position for retirement than men. Thatâ\u0080\u0099s because of the infamous double whammy. On the one hand they are likely to accumulate fewer retirement savings in the first place, because they are apt to earn less and take more time out of full-time work. But on the other hand they actually need more than men because they tend to live longer. No wonder just over half of men and women polled said they planned to retire after age 65, if at all. And 38% of men, and 27% of women, say they plan to carry on working in â\u0080\u009cretirement.â\u0080\u009d The only thing we know for sure at this point? This wonâ\u0080\u0099t be your parentsâ\u0080\u0099 retirementâ\u0080\u0094for good or ill."}]}