{"article": [{"url": "https://www.marketwatch.com/story/a-thinly-veiled-political-lob-feds-accuse-yale-of-discriminating-against-white-and-asian-students-in-admissions-11597419949", "published": 1597406000.0, "headline": "Yale University accused of discriminating against white and Asian-American students in admissions", "body": "The Department of Justice accused Yale of illegally discriminating against certain groups of applicants. (AP Photo/Beth J. Harpaz, File) Published credit: Beth Harpaz/Associated Press Beth Harpaz/Associated Press The Department of Justice accused Yale University of discriminating against Asian-Americans and white applicants in its admissions process Thursday. The accusation is the latest flashpoint in a decades-long battle over the role of race in evaluating applicants for spots at top colleges, but it likely won’t immediately impact colleges’ approach to building their classes. It also comes amid years of pressure directed at top colleges to better serve Black, Hispanic and other students from underrepresented groups. The Department of Justice’s findings come two years after the agency opened an investigation into Yale’s admissions practices. In a four-page letter to the school, Eric Dreiband, an assistant attorney general in the Civil Rights Division, wrote that Yale “grants substantial, and often determinative, preferences based on race.” “Yale’s race discrimination imposes undue and unlawful penalties on racially-disfavored applicants, including in particular Asian American and White applicants,” the letter reads. The letter comes amid a slew of legal battles over the role of race in college admissions. Lawsuits against Harvard University and the University of North Carolina Chapel Hill over the schools’ admissions practices are winding their way through the court system and could make their way to the Supreme Court. California legislators voted earlier this summer to put the question to voters of whether to repeal the state’s ban on affirmative action in the hiring of public employees, awarding public contracts and admissions to public universities in the state. The DOJ’s findings are based on interpretations of earlier Supreme Court precedent and so they don’t change the landscape, at least not immediately, for how Yale or any other school will vet applicants, experts say. The letter is also in line with the Trump administration’s approach to the use of race in admissions; the DOJ filed a friend of the court brief earlier this year in support of the groups challenging Harvard’s admissions policies. If Yale and the agency can’t come to some sort of agreement in two weeks, the DOJ is prepared to file a lawsuit, the letter reads. “There’s a lot here that suggests this is a very thinly veiled political lob at a moment in time,” said Art Coleman, managing partner at Education Counsel, an education consulting firm. There’s not much evidence in the letter underlying the agency’s conclusion, Coleman, who worked in the Department of Education’s office of Civil Rights, said. Yale officials echoed that sentiment. The school’s President, Peter Salovey, called the agency’s allegation “baseless,” in a statement. He said that the school has been cooperating with DOJ, but that the agency “concluded its investigation before reviewing and receiving all the information it has requested.” “Given our university’s commitment to complying with federal law, I am dismayed that the DOJ inexplicably rushed to conclude its investigation without conducting a fully informed analysis, which would have shown that Yale’s practices absolutely comply with decades of Supreme Court precedent,” he said.Supreme Court set a precedent on the role of race in admissions That precedent allows colleges to consider race only as part of a broader goal of achieving educational diversity. In addition, schools can only weigh race as part of a holistic evaluation process that considers many factors — strategies such as quota systems are effectively banned. One result of that approach is that the college admissions process, particularly at top schools, is “very opaque,” said Richard Ralph Banks, a professor at Stanford Law School. “It’s difficult to tell why people got in or didn’t get in,” he said. Typically, we expect transparency from public or public facing institutions, he said, “but here the Supreme Court flips that.” Instead of allowing schools to assign points or other clear value to particular criteria, the law requires that schools evaluate candidates holistically and share little about the weight they place on various factors, he said. “It tells the people who are doing the thing that’s transparent you can’t do that and it tells the people who are doing the thing that’s opaque, that’s what you must do,” said Banks “It’s kind of odd, but that’s the law.” He said it’s possible that colleges’ general counsels may be going over their admissions’ practices in the wake of Thursday’s letter and documenting clearly that “what we’re doing is consistent with what the Court said we can do.” That way, “if the Justice Department as we have right now is hostile to affirmative action and would try to initiate some enforcement action, the university is in a pretty good space.”Letter offers a signal to legal strategy The agency’s letter does offer a signal that DOJ is using a legal strategy similar to other litigants who have challenged affirmative action, Coleman said. He points to this statement from the letter as an indication: “The likelihood of admission for Asian American and White applicants who have similar academic credentials is significantly lower than for African American and Hispanic applicants to Yale College.” That framing, Coleman said, concludes “as a premise for the litigation that test scores and grades equal merit and we know definitively that’s not true. The whole notion of holistic review is about contextualization and the intersection of factors to make judgement.” And indeed, the role of test scores and other more “traditional” admissions criteria, which often correspond with wealth and whiteness, has come under fire over the past several years as elite colleges face pressure to better serve Black, Hispanic and other students from groups that have historically been largely absent from these campuses. In Yale’s class of 2023, 20% of students receive a Pell grant, the money the government provides to low-income students to attend college. In that class, 11.8% of students are African-American, 25.9% are Asian-American and 49.3% are white. Roughly 12% of the class of 2023 — which had a 6.2% admissions rate — have a legacy affiliation. The college admissions scandal last year highlighted the advantages white, wealthy and well-connected students often have in the admissions process. Inequities in kindergarten through 12th grade schooling as well as a dearth of access to expensive test preparation courses and extracurricular activities have meant that well-resourced schools, like Yale, tend to serve a relatively small percentage of the nation’s poorest students. At the same time, schools that serve a wider swath of Black, Hispanic and low-income students, often have less money at their disposal to get these students to and through college. The DOJ’s findings are a “shallow attempt” at undermining access to higher education and the “strides that we have made,” in increasing access to college for groups that have historically been underrepresented on campuses, said Anthony Abraham Jack, an assistant professor at Harvard Graduate School of Education. “It’s despicable,” in the broader context of what the college admissions scandal revealed about the role of money in higher education, that the government would target the inclusion of race in the admissions process instead of addressing the impact of policies borne out of systemic racism, like redlining, on educational equity, Jack said. “You are going after really the one policy aimed at attempting to level the playing field, to give individuals whose SAT scores are not inflated by social class and other privileges that being rich and being white provide in America,” said Jack, the author of “The Privileged Poor: How Elite Colleges are Failing Disadvantaged Students.” The inequity among students and between colleges could be exacerbated by the coronavirus pandemic, as students without a safe home to study in, or with family members who have lost their jobs or health are at risk of having their progress towards a degree disrupted, while colleges worry about a drop off in enrollment — a metric that is key to their financial health. The debate over Yale’s admissions policy presents a sort of “counterpoint of that,” Banks said. The case “just kind of shows how sought after they are.”"}]}