{"article": [{"url": "https://www.marketwatch.com/story/zoom-makes-as-much-money-in-three-months-as-it-did-in-all-of-2019-stock-heads-toward-more-records-2020-08-31", "published": 1598944100.0, "headline": "Zoom made as much money in three months as it did in all of 2019; stock shoots 22% higher", "body": "Zoom Video Communications Inc. made as much money in May, June and July as it did in all of 2019, beating even the outsize expectations of Wall Street and sending its stock — already trading at record highs — more than 20% higher in after-hours trading. Zoom ZM, +2.89% has been one of the biggest tech beneficiaries of the COVID-19 pandemic, with its name becoming synonymous with videoconferencing at a time when the technology has become essential for businesses and families separated by shelter-in-place rules. The company reported blowout earnings three months ago, and the stock — which began trading less than a year before the pandemic started — has skyrocketed, gaining more than 360% so far this year as the S&P 500 Index SPX, +0.87% has gained 10%. That set up a tough task for Zoom in Monday’s earnings report, as expectations for another astounding financial update grew heated. Morgan Stanley analysts said ahead of the report that buy-side analysts expected Zoom to beat its own forecast by about 30%. Zoom’s sales exceeded expectations by more than 32% Monday, easily hitting that mark, and profit was more than double what was expected. The company reported second-quarter net income of $185.7 million, or 63 cents a share, on sales of $663.5 million, more than four times the $146 million reported a year earlier. In 2019, Zoom reported net income of $101.2 million on sales of $622.3 million. After adjusting for stock-based compensation and other effects, Zoom reported earnings of 92 cents a share, up from 8 cents a share. Analysts on average expected adjusted earnings of 45 cents a share on sales of $500.3 million, according to FactSet, after Zoom’s executive team guided for adjusted earnings of 44 cents to 46 cents a share on sales of $495 million to $500 million in their previous earnings report. For the third quarter, Zoom executives guided for adjusted earnings of 73 cents to 74 cents a share on revenue of $685 million to $690 million, and added roughly $600 million to its annual sales forecast and nearly doubling its guidance for full-year adjusted profit. Analysts on average had been modeling third-quarter adjusted earnings of 35 cents a share on sales of $491.8 million, according to FactSet. For more: Zoom expects to be a force even after workers go back to the office “Our ability to keep people around the world connected, coupled with our strong execution, led to revenue growth of 355% year-over-year in Q2 and enabled us to increase our revenue outlook to approximately $2.37 billion to $2.39 billion for FY21, or 281% to 284% increase year-over-year,” founder and Chief Executive Eric Yuan said in Monday’s news release. Zoom shares closed higher than $300 for the first time Monday, rising 8.6% to a record $325.10 ahead of the earnings. Following the release of the results, the stock jumped 22% in after-hours trading, at times topping $400 a share. While Zoom has become popular for all types of videoconferences, it makes most of its money from large deals with corporate clients, as most individual users stick with the free option. The company revealed Monday that the number of corporate clients with more than 10 employees had grown by more than 400% in the past year, to more than 370,000, and that Zoom added more than 200 clients who spent more than $100,000 in the past year signed on in the second quarter, for a total of 988 “upmarket” customers. In a conference call Monday afternoon, Yuan revealed that Zoom signed two large corporate customers in recent months, Exxon Mobil Corp. XOM, -1.47% and Activision Blizzard Inc. ATVI, +0.52% , and expanded within cloud-software giant ServiceNow Inc. NOW, +2.43% , which is now using Zoom’s cloud-phone offering as well. “For the quarter, the year-over-year growth in revenue was primarily due to subscriptions provided to new customers, which accounted for approximately 81% of the increase, while subscriptions provided to existing customers accounted for approximately 19% of the increase,” Chief Financial Officer Kelly Steckelberg said on the conference call. “This demand was broad-based across industry verticals, geographies and customer cohorts.” Landing those large customers gives Zoom and its investors confidence that the end of the COVID-19 pandemic would not be the end of the boom times for Zoom. The company said Monday that it had $1.42 billion in future revenue under contract, a total that has more than tripled since the same time last year."}]}