{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-rise-find-footing-as-dollar-weakens-11601297661", "published": 1601305580.0, "headline": "Gold prices settle higher as dollar weakens", "body": "Gold futures finished higher Monday as weakness in the U.S. dollar helped to fuel some buying in bullion despite a rally in stocks that would otherwise suggest waning appetite for assets perceived as havens. The dollar on Monday was down 0.4%, following a weekly gain of 1.8%, as measured by the ICE U.S. Dollar Index DXY, FactSet data show. Last week, gold and silver prices came under pressure due to the mini rally in bucks, which can make assets priced in the currency relatively more expensive to overseas buyers. “Traders and investors are less risk averse to start the trading week, but they know the next six weeks could be highly volatile for many markets,” with U.S. elections coming in early November, amid “concerns about a smooth transfer of power” if President Donald Trump losses the election, said Jim Wyckoff, senior analyst at Kitco.com. Meanwhile, COVID-19 cases are on the rise in many countries, “the Brexit issue is coming down to the wire with no deal between the U.K. and the EU, and high tensions continue between the U.S. and China,” said Wyckoff, in a daily note. “These are also worrisome elements to spice up the uncertainty mix in the market place at present.” On Monday, December gold GCZ20, +2.17% GOLD, +2.86% gained $16, or 0.9%, to settle at $1,882.30 an ounce, after booking a 4.9% weekly drop on Friday—the steepest for a most-active contract since the period ended March 13, FactSet data show. Meanwhile, December silver SIZ20, +5.96% SI00, +5.96% added 51 cents, or 2.2%, to reach $23.604 an ounce, following a weekly decline of a 14.9%, its sharpest weekly drop since the week ended March 13. “With the first U.S. presidential debate scheduled [for Tuesday], Brexit negotiations over the week and the non-farm payroll due on Friday, the markets are likely to remain very cautious and large-scale positioning is unlikely at least until the first debate is out of the way,” said Rhona O’Connell, head of market analysis, EMEA and Asia regions at StoneX, in a daily note. Moves for gold and silver also came as appetite for assets perceived as risky, like stocks, picked up to start the week. The S&P 500 SPX, +0.87% and Dow Jones Industrial Average DJIA, +0.56% climbed on Wall Street, following gains in Asian and European stock markets. Among other metals traded on Comex, December copper HGZ20, +1.38% HG00, +1.38% rose 0.6% to $2.99 a pound. October platinum PLV20, +3.99% PL00, +3.84% climbed 4.8% to $882.60 an ounce and December palladium PAZ20, +2.31% PA00, +2.31% settled at $2,271.50 an ounce, up 2.2%."}]}