{"article": [{"url": "https://www.marketwatch.com/story/online-used-car-seller-shift-to-go-public-in-q3-2020-06-29", "published": 1593417380.0, "headline": "Online used-car seller Shift to go public in Q3", "body": "Online used-car seller Shift Technologies Inc. plans to go public in the third quarter, looking to ride the momentum of rivals Carvana Co. and Vroom Inc., whose valuations have jumped as the pandemic propels them past traditional dealers. Shift, founded in 2013, said it would go public through a reverse merger, in which it will sell a minority stake to Insurance Acquisition Corp., a publicly traded special-purpose acquisition company. Insurance Acquisition, which has no operations of its own, will raise $185 million at the time of the merger through a private sale of its shares. The deal will give San Francisco-based Shift an enterprise value of $415 million. The coronavirus has boosted online car sales. As dealers shut down for the pandemic, more consumers who have grown accustomed to purchasing other products online moved to buy cars that way as well, said Ivan Drury, an analyst at Edmunds. Together, Carvana, Vroom and Shift sold fewer than 300,000 cars in 2019, less than 1% of the used-car market in the U.S., according to Mr. Drury. Investors are excited by the prospect of an entirely new market for online players to displace traditional sellers. Carvana's shares, which have climbed steadily since late March, have jumped eightfold since the company's 2017 initial public offering. Vroom shares have more than doubled since its IPO early this month. Shift needs money to compete with its far-larger and better-funded rivals. Going public through a reverse merger enables the company to raise more capital than in a traditional IPO and to get the capital more quickly, said George Arison, Shift's co-founder and co-chief executive. The merger marks a quick turnaround for Shift, which two months ago considered shutting down operations in Los Angeles, one of its major markets. April sales plunged 40% from February, as coronavirus-related lockdowns put sales into a tailspin, Mr. Arison said. The company was working on plans to consolidate operations to conserve cash. Shift was rescued by a $6 million loan from the federal government's Paycheck Protection Program, and sales in May recovered to February levels, Mr. Arison said. Shift, which is set to raise $300 million through the reverse merger and stock sale, plans to return the taxpayer money once it completes the transaction. Carvana and Vroom have also faced a volatile few months since the pandemic hit. Carvana sales in early April had dropped nearly 40% from the prior year, according to research firm YipitData. Growth has resumed, but the rate is below pre-Covid levels, Yipit estimates. Vroom's April sales increased slightly despite Covid-19 lockdowns, according to Yipit. It did so by cutting prices and selling off 70% of its inventory, the company said in its IPO filing. Now, even though markets are recovering, Yipit estimates that Vroom's sales are falling, since the company needs to buy up cars to restock its website. Shift projects its sales will double to $400 million in 2021 from $194 million this year. That growth is much speedier than this year's rate of 10% and last year's growth of 33%. Carvana is not only larger but also growing more quickly: Sales doubled in 2019 to $3.9 billion. Vroom's jumped 40% to $1.2 billion. All three companies are losing money, as they advertise aggressively to attract customers. Investors are betting that with so much potential market share to grab from traditional dealers, the companies will grow, and economies of scale will fatten their bottom lines. \"This isn't a winner-take-all market,\" Mr. Arison said. \"There will be several e-commerce players taking share from traditional dealers.\" Previously, Shift raised $215 million from investors including Threshold Ventures, Highland Capital Partners and Goldman Sachs Group Inc. Write to Rolfe Winkler at rolfe.winkler@wsj.com"}]}