{"article": [{"url": "https://www.marketwatch.com/story/gold-prices-extend-jump-above-1750-as-cases-of-covid-19-rise-2020-06-22", "published": 1592836100.0, "headline": "Gold futures climb to highest finish since mid-April as cases of COVID-19 rise", "body": "Gold futures notched their highest finish in nearly 10 weeks, as investors closely watched infections across the world pick up, boosting demand for the metal that is perceived as a haven. The World Health Organization announced the largest single-day increase in cases of COVID-19 on Sunday, more than 183,000, with much of that increase coming from the Americas; while South Korea on Monday declared its resurgence of the deadly virus a “second wave.” Worries about the rising number of COVID-19 cases “prompted some traders to seek out the safe haven assets such as gold,” said David Madden, market analyst at CMC Markets UK. Weakness in the dollar also contributed to gold’s price gain, he said in a note. The ICE U.S. Dollar Index DXY, -0.58% traded down by nearly 0.6% as gold futures settled. A weaker dollar can make assets priced in the currency more attractive to buyers using other monetary units. On Comex Monday, August gold US:GCQ20 rose $13.40, or 0.8%, to settle at $1,766.40 an ounce, after surging 1.3% on Friday to notch a 0.9% weekly gain. Prices based on the most-active contract settled at their highest since April 14, according to Dow Jones Market Data. It had traded as high as $1,779 during the session, and a finish around that level would have been the highest since 2012. July silver US:SIN20 advanced by a nickel, or 0.3%, to end at $17.902 an ounce, after booking a weekly rise of roughly 2.1% on Friday. “While gold is undoubtedly boosted by haven flows due to the economic damage caused by the pandemic as well as concerns over a second wave, there is little doubt that the metal is also finding good support from central-bank money flooding the financial markets,” said Fawad Razaqzada, market analyst at ThinkMarkets. Last week, the Bank of England became the latest central bank to expand quantitative easing while the Bank of Japan was “characteristically very dovish, echoing the sentiment of other major central banks,” including the European Central Bank and the Federal Reserve, said Razaqzada, in a market note. “With long-term interest rates likely to remain very low thanks to central bank stimulus, and concerns over a second wave of infections elevated, the fundamental outlook on safe-haven gold therefore looks positive,” he said. Among economic data released Monday, the Chicago Fed national activity index showed a rise to 2.61 in May from a revised of minus 17.89 in April. Gold prices modestly added to gains following the release. Prices then moved closer to the session’s high as May existing-home sales data revealed a decline of 9.7% in May to a seasonally adjusted annual pace of 3.91 million, before paring those price gains. In a research note dated Friday, Goldman Sachs raised its 12-month gold forecast by 11% to $2,000 an ounce citing low real interest rates and concerns over currency debasement. In other Comex trading, July copper US:HGN20 tacked on 1.6% to $2.6525 a pound. July platinum US:PLN20 rose 2% to $843.70 an ounce and September palladium US:PAU20 climbed by 1.8% to $1,942.10 an ounce."}]}