{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-drift-lower-as-wall-street-braces-for-big-trump-biden-showdown-11601379276", "published": 1601398460.0, "headline": "Dow ends 131 points lower, snapping three-day win streak ahead of Trump-Biden showdown", "body": "U.S. stocks finished lower Tuesday, after moving between small losses and gains throughout the session, ahead of the first presidential debate before the November election.How did stock indexes perform? The Dow Jones Industrial Average DJIA, +0.56% fell 131.40 points, or 0.5%, to end at 27,452.66; while the S&P 500 index SPX, +0.87% closed 16.13 points, or 0.5%, lower at 3,335.47, and Nasdaq Composite Index COMP, +1.39% slipped NQ00, +1.63% 32.28 points, or 0.3%, finishing at 11,085.25. All three major equity indexes snapped three sessions of gains. On Monday, the S&P 500 rose 53.14 points, or 1.6%, to end at 3,351.60. The Nasdaq climbed 203.96 points, or 1.9%, to close at 11,117.53. The Dow advanced 410.10 points, or 1.5%, finishing at 27,584.06, while booking its third session of gains in a row. What drove the market? After a positive start to kick off the final week of trading in September, major equity-indexes fell, with the global tally of COVID-19 deaths surpassing a milestone of one million. Read: Coronavirus tally: Global deaths of COVID-19 top 1 million, 33.4 million cases and U.S. counts more than 250,000 deaths The handling of the pandemic and plans for the U.S.’s economic recovery are topics on the roster for the presidential debate between Republican President Donald Trump and Democratic challenger, former Vice President Joe Biden in Cleveland Tuesday evening. The U.S. has the highest case tally at 7.1 million, and highest death toll at 205,085 of any country. Investors will be looking for further guidance on new policy measures from Trump and more signs that Biden is prepared to take the reins as commander-in-chief, should he prevail in the November contest. Overall, the debate which starts at 9 p.m. ET could help to set the tone for markets for the next 35 days until the Nov. 3 presidential election. “The first presidential debate is tonight and it should be very entertaining with lots of fireworks and gotchas,” wrote Paul Schatz, president of Heritage Capital in a recent blog post. That said, Schatz also thinks there’s a low probability that the debate dictates what markets do subsequently. “I don’t care what the market does tomorrow; it won’t be because of the debate, regardless of what the pundits and media say,” he wrote. Check out: Here’s how the stock market tends to perform after the first presidential debates Monday’s session marked two consecutive days of gains of greater than 1% for the three U.S. stock indexes and for investors. Peter Cardillo, chief market economist at Spartan Capital Securities, said that “after two days of a back-to-back rallies investors are not likely to over extend the climb, as this evening’s political event enhances a steady to mixed market session,” referring to the debates. Meanwhile, House Democrats released a $2.2 trillion bill for a coronavirus-relief package late Monday, but the prospects of getting additional funding appear to be dimming as the focus in Washington shifts to the fight over Trump’s Supreme Court nominee Amy Coney Barrett, who was named by the president on Saturday to fill the vacancy left by the death of Ruth Bader Ginsburg. Still, House Speaker Nancy Pelosi discussed the new fiscal aid proposal with U.S. Treasury Secretary Steven Mnuchin for the second time on Tuesday in less than 24 hours, in a last-ditch effort to revive those drawn-out negotiations. Read: COVID-19 stimulus talks could still get off the ground as end of runway nears Additional support from the government for businesses and the unemployed due to the COVID-19 pandemic has been viewed as central to helping support the next phase of the economic recovery from the pandemic. However, the proposed legislation from Democrats has been met with resistance from Republican Senators opposed to a large new round of deficit spending. In economic reports, U.S. trade deficit in goods rose 3.5% in August to $82.9 billion, advanced U.S. wholesale inventories increase 0.5% on that month, while U.S. retail inventories climbed 0.8% last month. Separately, U.S. home prices rose 4.8% in July, up from 4.3% in the prior period, according to a three-month average reading from Case-Shiller’s national price index, buttressed by superlow mortgage interest rates. And a reading of consumer confidence rebounded in September to a pandemic high of 101.8 this month from 86.3 in August, the Conference Board said Tuesday. The day also was marked by a stream of Fed speakers. Dallas Fed President Rob Kaplan said the U.S. economy won’t be back on track until late 2022 or sometime in 2023. Meanwhile, New York Fed President John Williams said that he doesn’t see any sign of high inflation. Which stocks were in focus? Shares of discount retailer Big Lots Inc. BIG, -0.72% fell 1.4% Tuesday, even after the company said it expects a big jump in third-quarter same-store sales and guided for per-share earnings that are well above the consensus. McCormick & Co. Inc. MKC, +0.91% posted better-than-expected earnings for its fiscal third quarter, resumed guidance and announced a 2-for-1 stock split, saying it is still benefiting from dining at home during the pandemic. Shares still declined 2.7%. United Natural Foods UNFI, -0.75% reported quarterly earnings of $1.06 per share, beating the 74 cents a share consensus estimate. Shares slid 14.2%. Tiffany TIF, +0.37% was countersued by France’s LVMH, which accused the jewelry retailer of mismanagement. Shares of Tiffany were off 0.2%. Walmart WMT, +1.00% shares held their ground as the retail behemoth was said to be in advanced talks to invest up to $25 billion in venture of Indian conglomerate Tata Group. Shares of Nio NIO, +0.14% rose 10.9% after a Deutsche Bank analyst said the Shanghai-based carmaker is on track to develop an autonomous vehicle in the next couple of years. How did other assets trade? The 10-year Treasury note yield slipped 1.7 basis points to 0.644%. Bond prices move inversely to yields. U.S. benchmark crude futures for November delivery fell $1.31 per barrel, or 3.2% to $39.29 a barrel on the New York Mercantile Exchange, slipping below the $40 mark after gaining 0.9% on Monday. Gold futures picked up $20.90 or 1.1%, to settle at $1,903.20 an ounce. In global equities, the Stoxx Europe 600 index SXXP, +0.55% slipped 0.5% and the U.K.’s FTSE 100 UKX, +0.64% retreated 0.5%. Meanwhile in Asia, Japan’s Nikkei NIK, -0.11% fell 0.1% and Hong Kong’s Hang Seng Index HSI, -0.30% booked a 0.9% loss, while China’s CSI 300 000300, +2.04% rose 0.2% and the Shanghai Composite Index SHCOMP, +1.67% also rose 0.2%. The ICE U.S. Dollar index DXY, -0.58%, a gauge of the greenback’s strength, was trading 0.4% lower on Tuesday and off 0.8% for the week."}]}