{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-case-tally-edges-toward-3-million-after-record-one-day-count-and-florida-intensive-care-units-are-filling-up-2020-07-08", "published": 1594223600.0, "headline": "Coronavirus update: U.S. case tally edges over 3 million after record one-day count and Florida intensive-care units are filling up", "body": "The number of U.S. cases of COVID-19 edged above 3 million on Wednesday, and intensive-care units in Florida were filling up, as the U.S. counted a record number of new infections of the deadly illness in a single day, in the latest sign that the virus is far from contained. Data aggregated by Johns Hopkins University show 60,000 new cases were recorded on Tuesday, with Texas alone counting more than 10,000 new infections. At least 52 ICUs in Florida said they had reached capacity on Tuesday, according to the Washington Post. Another 17 hospitals said their regular beds were also full, the paper reported. Florida Gov. Ron DeSantis told reporters at a briefing that the state had “abundant capacity,” and reiterated that many of the new cases are younger people who are less at risk of dying. As the U.S. case toll has continued to climb, the death rate has been falling, but Dr. Anthony Fauci, head of the National Institute for Allergies and Infectious Diseases, said that it’s a “false narrative” to focus on that data point alone and cautioned Americans that there are “many other things that are very dangerous and bad about this virus.” On a Facebook Live event, Fauci said the lower death rate is a reflection of an improvement in treatments, especially for patients with more severe forms of the disease, and the uptick in cases involving younger people. But young people can have horrifying symptoms and suffer long-term effects. A group of U.K. neurologists on Wednesday published details of more than 40 COVID-19 patients who suffered complications from the illness that included brain damage, including brain inflammation, delirium/psychosis and stroke. “The high incidence of acute disseminated encephalomyelitis, particularly with hemorrhagic change, is striking,” the neurologists wrote in a study published in the medical journal Brain. “This complication was not related to the severity of the respiratory COVID-19 disease.” Other recovered COVID-19 patients have been left with symptoms including breathlessness, fatigue, numbness, a loss of taste and smell, memory problems and even paranoia. “The death rate is lower, I admit that, because people in general who are young are healthier,” Fauci said. “But that doesn’t mean that you could not get seriously ill.” The news that the U.S. has informed the World Health Organization of its decision to leave the agency next year drew widespread criticism, coming in the midst of the pandemic. Joe Biden, President Donald Trump’s Democratic challenger in the November presidential race, said he would return the U.S. to the international body if elected. See now: Amid pandemic, U.S. officially withdraws from World Health Organization “Americans are safer when America is engaged in strengthening global health,” Biden tweeted. “On my first day as President, I will rejoin the @WHO and restore our leadership on the world stage.” Others lamented the move as certain to undermine the very entity tasked with leading vaccine development and drug trials to address the virus. “To call Trump’s response to COVID chaotic and incoherent doesn’t do it justice,” said New Jersey Sen. Bob Menendez, the top Democrat on the Senate Foreign Relations Committee. “This won’t protect American lives or interests — it leaves Americans sick and America alone.” Trump and Biden Take Different Approaches to Coronavirus Surge See now: Here’s how the U.S. could save 45,000 people from dying of COVID-19 by NovemberLatest tallies There are now 11.9 million confirmed cases of COVID-19 worldwide and at least 545,728 people have died, according to the Johns Hopkins data. At least 6.5 million people have recovered. The U.S. death toll has climbed to 131,857, the highest in the world. Within the U.S., infections have climbed in 38 states and regions over the past 14 days, with U.S. Virgin Islands, Montana and Idaho leading the pack, according to a New York Times tracker. Brazil is second to the U.S. with 1.67 million cases and 66,741 deaths. President Jair Bolsanaro tested positive for COVID-19 on Tuesday. India is third measured by cases at 742,417, followed by Russia with 699,749 and Peru with 309,278. The U.K. has 44,602 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 84,941 cases and 4,641 fatalities. See: Serbs storm parliament after new coronavirus lockdown announcedWhat’s the latest medical news? Becton Dickinson & Co. BDX, +0.46% will receive $42 million from the U.S. government to build out manufacturing capacity for vaccine injection devices, to be used during the pandemic, as MarketWatch’s Jaimy Lee reported. The Biomedical Advanced Research and Development Authority awarded the funding as part of “Operation Warp Speed,” a Trump administration program aimed at having 300 million doses of a COVID-19 vaccine in January. BD, which says it is the largest manufacturer of injection devices in the world, said the total cost of the capital project is $70 million. Walgreens Boots Alliance Inc. WBA, -1.96% will take a 30% stake in VillageMD as part of its plans to open up to 700 VillageMD primary care practices at Walgreens locations. Walgreens, which is expected to report earnings on Thursday, said it will invest $1 billion in equity and convertible debt in the privately held VillageMD over three years, including a $250 million equity investment. The move is part of a trend in which pharmacy chains including CVS Health Corp. CVS, -1.76% have invested in primary care services in recent years. Walmart Inc. WMT, +1.00% is another example; the retail giant opened some health centers at its stores, starting in 2019.What are companies saying? Brooks Brothers, the storied mens suit maker, became the latest victim of the pandemic, when it filed for bankruptcy early Wednesday, as The Wall Street Journal reported. The closely held company, which is owned by Italian businessman Claudio Del Vecchio, was one of the few brands to make clothes domestically, and warned in June that it could close its three U.S. factories. It operates roughly 250 North America stores. The company was already challenged before the outbreak of COVID-19 as companies had adopted more casual clothing requirements and fewer men were buying traditional suits. With stay-at-home orders in place, people were resorting to an even more casual style of dress, such as sweatpants and T-shirts. The company joins the likes of Neiman Marcus, J.Crew Group Inc. and J.C. Penney, all of which have filed for bankruptcy during the pandemic. Denim jeans maker Levi Strauss & Co. LEVI, -2.24% announced 700 job cuts, equal to 15% of its non-retail and nonmanufacturing jobs, in 2020. The company posted earnings showing a loss of $363.5 million and revenue that fell below estimates, hurt by store closures. “Although trends appear to be improving sequentially, the ultimate health and economic impact of the COVID-19 pandemic remains highly uncertain,” Levi said in a statement. “The company expects that its business and results of operations, including net revenues, earnings and cash flows, will continue to be significantly adversely impacted for at least the balance of 2020, and there remains the possibility of additional COVID-19 related inventory and other charges.” Elsewhere, companies continued to offer guidance for the coming earnings season, to raise capital to bolster liquidity positions and offer updates on the state of their businesses. Here’s the latest news about companies and COVID-19: • Alcoa Corp. AA, -1.65% provided preliminary second-quarter results that were above analyst expectations, citing productivity gains and cost savings amid challenges resulting from the pandemic. The company expects net losses to narrow to $205 million to $190 million, or $1.10 to $1.02 on a per-share basis, from a loss of $402 million, or $2.17 a share, in the year-ago period. Excluding nonrecurring items, the company expects an adjusted loss per share of 8 cents to breakeven, compared with the FactSet consensus for a loss of 58 cents per share. Revenue is expected to fall to $2.10 billion to $2.18 billion from $2.71 billion a year ago, but that’s above the FactSet consensus of $2.09 billion. Alcoa expects production to be up 5% at mining locations and up 2% at refining locations, compared with the first quarter of 2020, and primary aluminum production is expected to be up 3%. Alcoa said it expects cash balances to exceed $950 million, up from $829 million on March 31. • AMC Entertainment Holdings Inc. AMC, -2.17%, which owns the world’s largest movie theater chain, was nearing a restructuring deal that would stave off bankruptcy in the near term, according to a report in The Wall Street Journal. AMC will reportedly reject a financing offer from lenders including Apollo Global Management, in favor of a $200 million financing effort led by Silver Lake Group, coming on top of $200 million in financing from junior bondholders. AMC has seen its bottom line crushed as it had to shut more than 1,000 theaters worldwide due to the pandemic. Its U.S. theaters are now scheduled to reopen on July 30. In June, AMC warned of a first-quarter net loss of as much as $2.417 billion|. • Party City Holdco Inc. PRTY, +0.39% announced its shares had regained compliance with New York Stock Exchange listing standards. The retailer received a notice of noncompliance on April 9 and regained compliance on June 30. • Simply Good Foods Co. SMPL, -0.59%, the nutrition bars and ready-to-drink shakes company, reported fiscal third-quarter profit and sales that rose above expectations and provided an upbeat earnings outlook, with COVID-19-related pantry loading early in the quarter helping boost results. The company said after the early pantry-loading boost to sales, at-home confinement restrictions weighed on sales, until those restrictions started to ease in May and into June. For fiscal 2020, the company expects adjusted EPS of 86 cents to 90 cents, compared with the FactSet consensus of 79 cents, and expects sales of $790 million to $800 million, below current expectations of $810.4 million. • Instant messaging platform Slack Technologies Inc. WORK, +3.36% has acquired Rimeto, a provider of business directory services for an undisclosed sum. Rimeto “offers an enterprise wide, searchable directory, automatically integrating information from across your company to deliver rich profiles of every employee, their skills, experience, and current projects,” Slack said. It is not updating guidance for fiscal 2021 provided on June 4 as the acquisition is not expected to have a material impact on its results. • Taylor Morrison Home Corp. TMHC, +3.36% said June was its strongest sales month ever, with a 94% increase in net sales orders year-over-year for a total of 1,715 and a monthly record sales pace of 4.3. “While economic hardships caused by COVID-19 were felt most at the beginning of the quarter, Taylor Morrison finished the second quarter with net sales orders up approximately 23 percent year-over-year and a sales pace of 2.8,” the company said in a statement. Closings came to 3,212, up 24% from the same period a year ago. The company’s order backlog of homes under contract rose about 35% to 6,805 homes with a sales value of $3.2 billion at June 30, versus $2.4 billion a year ago. Separately, the company is planning an offering of $400 million of 10-year bonds, joining the many companies raising capital during the pandemic. Proceeds will used along with cash on hand to redeem about $222.4 million of its 6.00% senior notes due 2023 and about $277.6 million of its 5.875% senior notes due 2025."}]}