{"article": [{"url": "https://www.marketwatch.com/story/heres-how-paypal-hopes-to-turn-venmo-into-the-next-paypal-2020-07-31", "published": 1596280820.0, "headline": "Here's how PayPal hopes to turn Venmo into the next PayPal", "body": "PayPal Holdings Inc. has built itself into a financial juggernaut during the COVID-19 pandemic, and it's now worth more than Walt Disney Co., Netflix Inc. and every U.S. bank except JPMorgan Chase & Co. If PayPal PYPL, +2.18% can get bigger, it will likely depend on its own Venmo brand turning its popularity with younger consumers into actual revenue. Making Venmo a true money machine for PayPal will depend on its new general manager, Darrell Esch, a PayPal veteran who took over the role in March after the company cycled through leaders over the previous four years. PayPal acquired Venmo as part of its $800 million purchase of startup Braintree in 2013. \"This is our time and we're really going to seize the moment,\" Esch told MarketWatch this week in an exclusive post-earnings interview. Once primarily a way for friends to split the dinner check without paying fees, PayPal's Venmo service has increasingly become a tool that lets people pay artists for virtual concerts or tip service workers during the pandemic. Those types of payments can lead to more revenue for Venmo, as the service can charge the merchants on the other end of the transaction,much like core Paypal does, while continuing to allow users to send payments for free, and Esch hopes that Venmo can expand further into business payments. The company has been slowly plodding along with attempts to monetize Venmo over the past three-plus years, but now it plans to \"bring a lot of feature functions and capabilities to market over a relatively short period of time,\" Esch said. The company is in the process of introducing QR code payments and will launch its own credit card, adding to existing options like a debit card and an online checkout button. Venmo's prior general manager came from a Braintree background, focused on digital payments infrastructure to big tech companies like Uber Technologies Inc. UBER, -0.18%  and Dropbox Inc. DBX, +3.66%. He recently left for the world of venture capital. Esch, who's been with PayPal long enough to remember when its original peer-to-peer money-transfer service was simply called email payments, steps into the position as PayPal embarks on a new chapter in its corporate history. It's been just over five years since the company split from eBay Inc. EBAY, +6.47%, and now eBay is moving to manage payments on its own, relegating PayPal to a more minor role on the marketplace. With the potential for some lost eBay revenue, Venmo represents the next big growth avenue for PayPal, which just posted a record quarter as the COVID-19 crisis drove surging demand for e-commerce. The company is looking to capitalize on a ballooning user base: More than 60 million people used Venmo for a transaction in the 12 months through June, up from 52 million in the 12 months through December. \"The goal is to move beyond being an app for payment between friends,\" Esch said, and transform Venmo into a \"really ubiquitous digital wallet that lets consumers spend and pay\" at businesses as well.New features One of the company's new initiatives is business profiles, an attempt to get sole proprietors and other individuals to accept Venmo as payment and to establish a formal relationship with the service. The business accounts are currently in an invite-only phase and businesses can use them freely for now, but PayPal eventually plans to charge businesses 1.9% of the total plus 10 cents for each transaction made to one of these accounts. Of course, many sole proprietors already accept Venmo payments from their personal accounts without paying any fees, but Esch is optimistic that they'll gravitate over to business profiles in order to benefit from the social aspects of Venmo's network as well as new payment capabilities. \"Creating the business profile will be a way to expose the business to a massive and fast-growing base of customers,\" Esch said. PayPal has said that Venmo users routinely browse the service even when they aren't sending money, just to see who their friends are paying, and Venmo plans to apply special labels to businesses that are popular with customers or especially active on the service. The business accounts tie into PayPal's broader efforts to participate in the in-store payment landscape. The company has long tried to gain a foothold in physical stores, and it's now hoping to do so through QR codes given heightened interest in contactless payments due to the pandemic. Those small merchants running business profiles will be able to accept QR code payments, and PayPal announced earlier this week that CVS Health Corp. CVS, -1.76%  would begin accepting PayPal and Venmo QR codes at 8,200 stores by the end of the year in its first such partnership with a big chain. Esch said that his long tenure at PayPal shaped his approach to the effort, as Venmo will be able to leverage the same technology as core PayPal on QR codes. \"We're able to move faster when we move as one team,\" he said. QR codes are huge in China, but Bernstein analyst Harshita Rawat recently wrote that she doesn't except them to take off in developed markets quite like they did there. \"Rather we expect QR codes to emerge as one of the many ways to pay for small, everyday transactions in certain verticals,\" she said in a note to clients. They may prove more popular for the type of payments for which consumers typically rely on Venmo. Barclays analyst Ramsey El-Assal sounded more upbeat about PayPal's efforts, writing that QR codes could be a \"game-changer\" for the company, with the opportunity to leverage existing relationships with merchants and give the feature a big marketing push. Venmo more generally benefits from PayPal's existing relationships with more than 26 million merchants, as users can already make e-commerce purchases through a dedicated Venmo checkout button on merchant pages. Venmo competes with Square Inc.'s SQ, +2.06%  Cash App, among other mobile wallets. While PayPal's strategy with Venmo involves more deeply integrating the product into the merchant landscape, Square has pursued a slightly different strategy as it tries to grow the Cash App, including by adding bitcoin and equities trading.Gaining credit Another big focus for Venmo is the brand's first credit card, due out later this year. Even before taking over as general manager, Esch advised Venmo on its card rollout given his familiarity with all things credit and his experience working on Bank of America cards prior to joining PayPal. The world of credit cards is crowded, but Esch said that Venmo will aim to differentiate its card in part by creating a compelling in-app experience that captures the \"community\" essence of the service. \"It's going to feel very much like a Venmo product and not just another credit card,\" he said. The company already has a debit card that lets people use their Venmo accounts to buy things online and in stores, with the option to share those purchases on their feeds. The 'Holy Grail' Venmo is also going after direct deposits, which Bernstein analyst Lisa Ellis has argued could be the service's Holy Grail. The company allowed users to receive their stimulus payments in their Venmo accounts via direct deposit, and now the goal is to get people to send their regular paychecks to Venmo this way. With peer-to-peer payments, many users who receive money will opt to transfer that money over to their bank accounts, sometimes paying a small fee for the ability to do so instantly. (Some analysts estimate that this Instant Deposit feature is currently Venmo's biggest revenue source.) Direct deposit customers are appealing because they would be engaging in the opposite behavior, housing their money within Venmo and then engaging in revenue-generating activities when they make purchases through the service. \"Wherever your paycheck is going, that's your home base, and banks typically own that,\" Ellis told MarketWatch in June. She said that it's still unknown whether people will find enough value in the Venmo user interface to make that sort of shift worthwhile but suggested that one incentive might be a user-friendly bill-pay feature that lets users handle all such recurring payments in one place. PayPal Chief Executive Dan Schulman sounded more confident on the company's earnings call this week that Venmo can win these users. \"I would not underestimate how zealous the customers of Venmo are about living their financial life on the platform,\" he said. Schulman called Venmo \"a crown jewel\" for PayPal and said that Venmo benefits from various new habits that have emerged from the pandemic, including live-streamed exercise classes and online concerts. The company last disclosed a Venmo revenue run rate of $450 million back in January but declined to give an update on the latest call, only to say that Venmo revenue was up 60% from a year earlier during the first three weeks of July. The service's contributions are so far a drop in the bucket for PayPal, which is expected to generate more than $21 billion in revenue this year, but Wedbush analyst Moshe Katri said he \"wouldn't be surprised\" if the business gets to $1 billion in revenue in a year or two. \"What I think is really impressive is the fact that they're adding more and more solutions to the platform... that at this point will make this really sticky, or stickier,\" he said. He views the company as being in the process of \"mainstreaming\" Venmo by catering to a broader segment of the population beyond millennials. Paypal stock has gained 74% so far this year versus near flat performance for the S&P 500 SPX, +0.87%."}]}