{"article": [{"url": "https://www.marketwatch.com/story/chipotle-brings-back-carne-asada-for-a-limited-time-11600779420", "published": 1600861280.0, "headline": "Chipotle brings back carne asada for a limited time", "body": "Carne asada was previously a popular menu item at Chipotle Chipotle Chipotle Mexican Grill Inc.’s popular carne asada menu item is making a comeback in the U.S. and Canada for a limited time. The item is also making its European debut in France. Chipotle CMG, +0.01% previously had carne asada on U.S. menus starting in Sept. 2019 until early this year. Carne asada added 150 basis points to the average check, according to Chief Financial Officer John Hartung, while discussing the company’s earnings in February. “[O]ur supply chain team is exploring options to see if we can add this as a permanent menu item at some point in the future, contingent of course on us finding enough supply of high-quality ingredients that meet our ‘Food With Integrity’ standards,” said Chief Executive Brian Niccol at the time, according to a FactSet transcript of the earnings call. See: Beyond Meat downgraded at JPMorgan as Impossible Foods snaps up share Only 5% of beef meets Chipotle’s carne asada standards, including no antibiotics or hormones, according to the latest announcement. Chipotle’s 16 million Rewards members will have exclusive access to carne asada through the app and website on Tuesday and Wednesday. From Sept. 23 through Sept. 27, it will be a digital-only menu item. And on Sept. 28, it will be available through all digital channels and in restaurants. Truist Securities notes that carne asada is making a comeback at a higher price point. After checking 30 locations, analysts note a $1 premium for carne asada versus the existing steak option. Previously, the premium was 50 cents when carne asada was initially launched. That went up to 75 cents in Nov. 2019 through the end of its first run. Truist rates Chipotle shares buy with a $1,580 price target. Chipotle stock has rallied 51.8% for the year to date while the S&P 500 index SPX, +0.87% is up nearly 2% for the period."}]}