{"article": [{"url": "https://www.marketwatch.com/story/how-to-test-drive-a-used-car-2020-06-17", "published": 1592370680.0, "headline": "How to test drive a used car", "body": "You’re ready for a used car test drive. You’ve done your research, narrowed your list down and honed it to perhaps just a few cars. Now it’s time to take that car out for a spin. In addition to making sure you’re comfortable in the car and that it meets your financial requirements, there are a lot of things to pay close attention to. Most important, trust your gut. If something seems off about the car even before a used car test drive, it very well might be. Don’t be afraid to speak up to the seller or the selling dealer, and consider a pre-purchase inspection, especially on a fancier or more complicated car. In the grand scheme of things, an hour or two of a knowledgeable mechanic’s time could save you a small fortune. Trust your own judgment on the test drive. Here are five things to look at closely on a used car test drive:1. Listen closely Does the car make any sounds that seem out of the ordinary? Turn the radio and the climate control off, and roll up all the windows. Any car built within the last decade or two should emit little more than a gentle underhood rumble and a small amount of tire noise. See: Mileage vs. age: Which matters more when buying a used car? Whining noises often indicate either a faulty pulley or belt underhood, while grumbling might come from the engine or transmission. A gnashing sound — you’ll know it when you hear it — suggests an issue with the transmission, the driveline or one of the wheels. Odds are any sound that catches your attention will be costly to repair, and that’s where a mechanic’s opinion could prove valuable.2. Start with low speeds At low speeds, you’re looking to see that the steering returns to center quickly and predictably. If it’s slow, that’s an indication that there may be excessive suspension or tire wear. Listen and feel the suspension. You don’t want to hear clunks, and you definitely don’t want to feel them. Generally, suspension clunks aren’t as expensive to rectify as you might think, but replacing worn bushings and linkages can add up, and that work often requires special tools. Don’t miss: Now I totally get why my father was so frugal Next, hit the brakes. The pedal should feel linear and responsive, with a little bit of travel before a hard grab. Try braking both gently and then with vigor, and watch to make sure the car doesn’t pull to one side or the other.3. Now get up to speed Give the car a little gas to get to highway speeds. Depending on what’s underhood, it may move pretty quickly. Any modern car should have no issue keeping up with traffic. At speed, you’ll want to ensure the car tracks straight and doesn’t tug to one side or the other and that the steering wheel doesn’t shake around. A car that pulls to one side or vibrates through the steering wheel suggests alignment or balance issues. This is generally an easy fix, but it can indicate that the car has been wrecked or that its previous owner was careless about maintenance. Read:5 important facts about car insurance no one ever tells you Also listen closely for any unexpected noises — whine from the drivetrain, air around the windows or grumbling form underhood.4. Look around you It’s hard to determine engine wear unless you’ve had your mechanic dive deep into what’s underhood, but there are a few telltale signs of problems. When you’re accelerating, look in the rearview mirror. If you see smoke — no matter the color — that’s probably reason for concern. That said, cars that have sat for a while as well as turbocharged vehicles can often puff a little dark blue or black smoke under acceleration. This isn’t necessarily a red flag, though it’s worth talking to a mechanic well-versed in the brand of vehicle you’re testing out to see what constitutes as a normal amount of visible exhaust emissions.5. Test everything The test drive is the ideal opportunity to test every vehicle function. Roll the windows up and down from every switch, hit the door lock buttons, work the climate control to make sure that air is distributed as the dials or buttons indicate, feel if the air is cold or hot, try various radio functions — the list could go on forever. Also read: The pros and cons of buying a certified used car Nobody will be a better judge of what functions work and what functions don’t than you, so don’t be afraid to push every button. If a window is loud or notchy going up or down, for instance, that suggests that a regulator is in need of replacement, which can be an expensive job. Don’t miss: What it’s like to drive a Tesla Model Y This story originally ran on Autotrader.com."}]}