{"article": [{"url": "https://www.marketwatch.com/story/slow-the-testing-down-please-trump-tells-tulsa-audience-he-recommended-fewer-coronavirus-tests-2020-06-21", "published": 1592728220.0, "headline": "â\u0080\u0098Slow the testing down, pleaseâ\u0080\u0099: Trump tells Tulsa audience he recommended fewer coronavirus tests", "body": "TULSA, Okla. (AP) â\u0080\u0094 President Donald Trump said Saturday heâ\u0080\u0099s asked his administration to slow down coronavirus testing because robust testing turns up too many cases of COVID-19. Trump told supporters at his campaign rally in Tulsa that the U.S. has tested 25 million people, far more than any other country. The â\u0080\u009cbad part,â\u0080\u009d Trump said, is that widespread testing leads to logging more cases of the virus. â\u0080\u009cWhen you do testing to that extent, youâ\u0080\u0099re going to find more people, youâ\u0080\u0099re going to find more cases,â\u0080\u009d Trump said. â\u0080\u009cSo I said to my people, â\u0080\u0098Slow the testing down, please.â\u0080\u0099 They test and they test.â\u0080\u009d The campaign of likely Democratic presidential rival, Joe Biden, said Trump was putting politics ahead of the safety and health of Americans. Trump opted to hold his first rally in 110 days despite concerns from local health officials that it could lead to further spread of the virus in Tulsa. Most of those in attendance declined to wear a mask. â\u0080\u009cIn an outrageous moment that will be remembered long after tonightâ\u0080\u0099s debacle of a rally, President Trump just admitted that heâ\u0080\u0099s putting politics ahead of the safety and economic well-being of the American people â\u0080\u0094 even as we just recorded the highest number of new COVID-19 cases in almost two months and 20 million workers remain out of work,â\u0080\u009d according to the Biden campaignâ\u0080\u0099s statement. The outbreak has killed about 120,000 people in the U.S., and nearly a half-million worldwide, according to a count by Johns Hopkins University, though the real numbers are believed to be higher. The number of newly confirmed cases per day has risen from about 21,400 two weeks ago to 23,200, according to an Associated Press analysis. And in Florida, Georgia, Texas and Arizona â\u0080\u0094 states that loosened their stay-at-home restrictions early â\u0080\u0094 daily deaths have been quietly rising since early June. â\u0080\u009cThis virus has killed nearly 120,000 Americans and cost tens of millions their jobs, in large part because this president could not and would not mobilize testing as quickly as we needed it,â\u0080\u009d according to the Biden campaign statement. â\u0080\u009cTo hear him say tonight that he has ordered testing slowed â\u0080\u0094 a transparent attempt to make the numbers look better â\u0080\u0094 is appalling.â\u0080\u009d Rising case numbers can partially be explained by the wider availability of testing. Mild cases, previously undetected because of limits on who could be tested, are now showing up in the numbers."}]}