{"article": [{"url": "https://www.marketwatch.com/story/the-stock-markets-comeuppance-is-coming-heres-how-to-prepare-your-portfolio-now-2020-08-18", "published": 1598102780.0, "headline": "The stock marketâ\u0080\u0099s comeuppance is coming, as bullishness gets extreme", "body": "The U.S. stock marketâ\u0080\u0099s five-month rally is coming to an end. Of course I donâ\u0080\u0099t know when. Thatâ\u0080\u0099s important to acknowledge, since this spring I presented arguments for why the marketâ\u0080\u0099s March lows could be retested in mid-June or mid-August. As many of you have emailed me recently to remind me, neither scenario came to pass. Nevertheless, conditions are even stronger now for a correction. One big reason is that short-term market timers have become extremely bullish, which is not a good sign from a contrarian perspective. This is illustrated in the chart below, which plots the average recommended equity exposure among nearly 100 such timers that my firm monitors on a daily basis (which is the Hulbert Stock Newsletter Sentiment Index, or HSNSI). This average currently stands at 65.9% â\u0080\u0094 higher than 95% of all daily readings since 2000, when my firm began calculating this index. The chart also highlights those occasions over the last couple of years in which the HSNSI has risen to be within the top 10% of all past readingsâ\u0080\u0094thereby meeting the criterion for excessive bullishness as set by some contrarians. Youâ\u0080\u0099ll notice that the market has proceeded to struggle on those prior occasions when this criterion was met. To be sure, the chart only encompasses the last two years. But what is illustrated in the chart is confirmed by the full database back to 2000 â\u0080\u0094 as is clear in the table below. Russell 2000 over subsequent week Russell 2000 over subsequent month Russell 2000 over subsequent quarter Russell 2000 over subsequent 6 months Top decile of HSNSI readings since 2000 -0.3% -0.7% -2.8% -0.2% All days since 2000 that were not part of the top decile +0.2% +0.8% +2.4% +3.9% The lesson I draw from the data is that we should keep our enthusiasm in check. The stock market was surprisingly strong over the last five months, but â\u0080\u0094 as the famed British economist John Maynard Keynes liked to remind investors â\u0080\u0094 trees donâ\u0080\u0099t grow to the sky.Corrections are common prior to Election Day Another reason to expect at least some sort of pullback is that there is almost always a market decline over the three months prior to presidential elections. Thatâ\u0080\u0099s what I found upon examining the behavior of the Dow Jones Industrial Average DJIA, +0.56% Â between mid-August and Election Day in every election year since 1900. On average, the Dow at some point in that three-month period of those years was more than 5% lower than where it stood in mid-August. Read: Nasdaq sets a â\u0080\u0098momentumâ\u0080\u0099 record, which in the past has led to declines If the stock market experiences a similar pullback, that means that the Dow between now and early November will be 1,400 points lower than where it stands today. Thatâ\u0080\u0099s just the average. The worst correction in this mid-August-to-Election-Day period came in 2008, when the Dow dropped 30% from mid-August to its low prior to Election Day. Itâ\u0080\u0099s worth dwelling on that terrible experience. You may dismiss it as irrelevant to todayâ\u0080\u0099s market, but at the comparable point to today 12 years ago â\u0080\u0094 in August 2008 â\u0080\u0094 market timers were also quite upbeat. They had no idea that, in the subsequent 60 days, Lehman Brothers would collapse and almost bring down the entire global financial system. I keep a file of all the bullish forecasts that market timers were making in August 2008. That way I can readily retrieve them when clients become too confident about what the future has in store. The following proclamations were made in late August 2008 â\u0080\u0094 two weeks before Lehman Brothersâ\u0080\u0099 bankruptcy: â\u0080\u009cI am ready to be a bull again! â\u0080¦ The housing market is beginning to show serious signs of a bottomâ\u0080¦ Quietly, the financial sector has been slowly healing.â\u0080\u009d â\u0080\u009cFor the next few weeks at least, the sun seems destined to shine on the stock marketâ\u0080¦ [T]he credit crisis seems to be reaching a conclusionâ\u0080¦ [A]ll these factors have lessened the downside risk in stock prices, for now.â\u0080\u009d [Because of falling commodity prices] consumers areâ\u0080¦ going to get some much needed breathing room. This will allow the economy to regain its footing and begin a recovery.â\u0080\u009d [T]he sub-prime mess is largely behind usâ\u0080¦ I think a 75% invested posture is about right at this juncture.â\u0080\u009d The bottom line? Donâ\u0080\u0099t be surprised if the stock market suffers a nasty decline in coming weeks. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com Read:If history repeats, the stock market will hit a new high by the end of August More: Uh-oh: Investors predict â\u0080\u0098Dow 50,000â\u0080\u0099 â\u0080\u0094 in just five years"}]}