{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-rise-to-kick-off-holiday-shortened-week-even-as-coronavirus-cases-top-10-million-world-wide-2020-06-29", "published": 1593448880.0, "headline": "Dow surges 579 points, ending near session highs, on hope that shutdowns wonâ\u0080\u0099t be widespread as coronavirus cases top 10 million", "body": "The Dow booked its best one-day gain in about three weeks Monday, partly as upbeat economic data raised hopes, and also as Boeing shares surged. But investors also were watching the persistence of coronavirus in hot spots, including Florida, Texas and California, fueling concerns about the economic outlook. Financial markets in the U.S. will be closed on Friday in observance of the Fourth of July holiday.How did benchmarks perform? The Dow Jones Industrial AverageÂ DJIA, +0.56% gained 580.25 points, or 2.3%, closing near a session high of 25,595.80, its best one-day percentage climb since June 5, according to Dow Jones Market Data. The S&P 500 index SPX, +0.87% Â advanced 44.19 points, or 1.5%, to finish at 3,053.24, as the consumer discretionary and industrials sectors climbed. The technology-laden Nasdaq Composite Index COMP, +1.39% picked up 116.93 points, or 1.2%, to end at 9,874.15. On Friday, the Dow put the finishing touches on a weekly decline of 3.3%, falling 700-plus points on the day, while the S&P 500 notched a 2.9% weekly decline and the Nasdaq fell 1.9% for the week.What drove the market? Major U.S. stock indexes finished sharply higher Monday as economic data continued to surprise to the upside, even as several states with surging COVID-19 infections have been forced to reimpose limits on business activities and social gatherings. Markets scored an early boost after a report showed that pending home sales in May spiked 44.3% compared with April, according to the National Association of Realtors. That beat expectations of a 15% rise. Sales were still 5.1% lower compared against the same time last year. For owners who plan to use their residential properties as income, however, rents have been falling in many parts of the nation as millions of people remain out of work during the pandemic. â\u0080\u009cWe still have a lot of work to do, but certainly the economy has recovered faster than expected,â\u0080\u009d said Brent Schutte, chief investment strategist at Northwestern Mutual Wealth Management Co. in Wisconsin. â\u0080\u009cThe rising case count does raise some issues,â\u0080\u009d he told MarketWatch, but he also said he thinks â\u0080\u009cthe likelihood of a nationwide lockdowns appears remote.â\u0080\u009d Coronavirus cases worldwide surpassed 10 million, with more than a half-million deaths. A dozen states, including Florida, Texas, California and Arizona â\u0080\u0094 now hot spots in the U.S. â\u0080\u0094 reversed reopening plans and implemented tighter restrictions to prevent a further spread of the viral epidemic, the Wall Street Journal reported. New York Gov. Andrew Cuomo on Monday said he may slow New York Cityâ\u0080\u0099s broader Phase III reopening slated for next Monday, which would allow indoor dining at restaurants and more personal-care services and outdoor activities to resume. New Jerseyâ\u0080\u0099s governor said Monday the state would postponed indoor dining indefinitely. An inability to curtail the spread of COVID-19 would prove problematic for economic projections that factor in a sharp, V-shaped rebound, if business activity stalls or more closures are ordered to address the public health crisis. â\u0080\u009cFrom our perspective, the virus surging in the South simply underscores our long-held view that it is the virus, not monetary or fiscal policy, controlling the economyâ\u0080\u0099s recovery,â\u0080\u009d wrote TS Lombardâ\u0080\u0099s chief U.S. economist Steven Blitz and head of strategy Andrea Cicione, in a client note. â\u0080\u009cBecause of the virus, habits have changed, the willingness to re-engage has declined, and the arc of consumption growth will be flatter.â\u0080\u009d A survey of chief executive officers of the nationâ\u0080\u0099s biggest companies released on Monday showed they expect the business impact of the pandemic to linger until at least 2021, according to the Business Roundtableâ\u0080\u0099s second-quarter report. Meanwhile, in China, industrial profits in May were up 6% from a year earlier, representing the first increase in 2020, official statistics released over the weekend showed. Investors are expecting some turmoil due the holiday-shortened week and end-of-quarter activity among investment managers, including pensions and mutual funds. Check out:Barronâ\u0080\u0099s: The Job Biden portfolio â\u0080\u009cIn summary, with two days left before the quarter dies, window dressing is likely to increase volatility, with some sectors gaining over others,â\u0080\u009d wrote Peter Cardillo, chief market economist at Spartan Capital Securities. â\u0080\u009cHowever, the trend is likely to remain negative ahead of this weekâ\u0080\u0099s key macro indicators and the upcoming earnings season,â\u0080\u009d he said, referring to corporate quarterly results that kick of in earnest in the middle of July. Which stocks were in focus? Facebook FB, +0.26% Starbucks Corp. SBUX, +0.53% Unilever UN, +2.49% ULVR, +0.70% shares were in focus after announced Sunday that it is â\u0080\u009cpausingâ\u0080\u009d advertisements on all social-media platforms, two days after consumer-products conglomerate said it was halting U.S. advertising on Facebook and Twitter TWTR, -0.23% through year-end over ineffective policing of hate speech, leading to a sharp Friday selloff in both stocks. Shares of Facebook still rose 2.1%, while Twitterâ\u0080\u0099s stock advanced 1.5% Monday. Shares of Gilead Sciences Inc. GILD, +0.82% Â closed nearly flat Monday after the drugmaker disclosed that remdesivir, its experimental COVID-19 treatment, will cost $2,340 for a course of treatment. U.S. air-safety regulators resumed key flight tests of Boeing Co.â\u0080\u0098s BA, -0.39% 737 Max on Monday, with the aim of returning the planes to service around the end of the year. Boeingâ\u0080\u0099s shares surged 14.4%. Chesapeake Energy Corp. US:CHK said Sunday that it had filed for bankruptcy protection as an oil- and gas-price rout stoked by the coronavirus pandemic proved to be the final blow for a shale-drilling pioneer long hamstrung by debt. Its shares were halted. Shares of Coty Inc. COTY, -5.08% Â soared 13.4% after the cosmetics, fragrance and skin-care company announced a deal with Kim Kardashian West to develop a beauty business globally. Southwest Airlines Co LUV, +1.89% Â shares closed up 9.6% after a double upgrade from Goldman Sachs, amid hopes that testing could help travelers feel safer at airports even as record numbers of new coronavirus infections limit travel. Aurora Cannabis Inc. ACB, -1.37% Â said Monday that co-founder and former chief executive, Terry Booth, is retiring from its board.Its shares fell 0.9%. AMC Entertainment Holdings AMC, -2.17% Â said Monday it would delay the planned reopening of its theaters for about two weeks until July 30. Shares of the company gained 5.7%. How did other assets perform? West Texas Intermediate U.S. crude US:CLQ20 Â for August delivery rose $1.21 cents, or 3.1%, to close at $39.70 a barrel on the New York Mercantile Exchange. In precious metals, gold futures US:GCM20 closed modestly higher, up 90 cents, or 0.05%, to settle at $1,781.20 an ounce. The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was unchanged at 0.636%. Bond prices move inversely to yields. The greenback was up 0.1% against a basket of its major rivals, based on trading in the ICE U.S. Dollar Index DXY, -0.58% Â . In European equities, the Stoxx Europe 600 index SXXP, +0.55% Â finished 0.4% higher and Londonâ\u0080\u0099s FTSE 100 UKX, +0.64% advanced 1.1%. In Asian markets, the Japanese Nikkei NIK, -0.11% Â lost 2.3%, Hong Kongâ\u0080\u0099s Hang Seng HSI, -0.30% lost 1%, while South Koreaâ\u0080\u0099s Kospi declined 1.9%. Chinaâ\u0080\u0099s CSI 300 000300, +2.04% retreated 0.7%, while the Shanghai Composite Index SHCOMP, +1.67% declined 0.6%."}]}