{"article": [{"url": "https://www.marketwatch.com/story/was-covid-19-made-in-a-lab-will-a-vaccine-protect-you-forever-does-the-sun-help-coronavirus-myths-are-spreading-in-25-languages-here-are-the-most-popular-2020-08-11", "published": 1597721120.0, "headline": "Does sunshine kill coronavirus? Will antibiotics help? These are the most widely shared misconceptions about COVID-19", "body": "A woman wears a face mask and goggles walks at LAX airport in Los Angeles. A new study in the latest edition of the American Journal of Tropical Medicine and Hygiene identified 2,311 reports of rumors, stigma and conspiracy theories in 25 languages from 87 countries related to COVID-19. (Photo: AFP via Getty.) Does anyone know what’s real anymore? Six months into the coronavirus pandemic, some people are on edge, while others are just plain confused. Adding to the increasingly chaotic nature of the information superhighway in 2020, others are sharing misleading information and outright falsehoods across the internet and on television. Some outlandish rumors persist. To adherents of such beliefs, the coronavirus is a dastardly bioweapon designed to wreak economic armageddon on the West; a left-wing conspiracy to damage the re-election prospects of President Donald Trump; a virus that leaked from a laboratory in Wuhan, China. A new study in the latest edition of the American Journal of Tropical Medicine and Hygiene identified 2,311 reports of rumors, stigma and conspiracy theories in 25 languages from 87 countries related to COVID-19 across social media and, yes, online news media sites. Paranoia politicizes a public-health emergency and distracts from potentially life-saving measures. “Misinformation fueled by rumors, stigma, and conspiracy theories can have potentially serious implications on the individual and community if prioritized over evidence-based guidelines,” the study said.5 most widely shared misconceptions The five most oft-shared claims were related to the seriousness of the illness and transmission, and the fatality rate (collectively 24%); the effectiveness of control measures (21%); treatments and cures touted online (19%); and the origins of pandemic (15%). (About that last one: 30% of Americans say coronavirus was made in a lab, despite evidence to the contrary, a Pew Research Center survey found earlier this year.) “ Do you have to wear a mask outdoors? Only medical-grade N95 surgical masks with goggles work, right, so why bother wearing a homemade face covering? ” Of the 2,276 reports for which text ratings were available, 1,856 claims were false (82%). “Health agencies must track misinformation associated with the COVID-19 in real time, and engage local communities and government stakeholders to debunk misinformation,” the report found. There are, of course, many nuances and truths mixed in with some rumors. Among the evidence-supported statements by members of the scientific community: Like the influenza vaccines, any future vaccine will likely only last a number of years, and not give everyone 100% immunity. “We’re not going to be vaccinating our way out of this to eight-plus billion people in the world right now,” Michael Osterholm, a University of Minnesota epidemiologist who recognized the outbreak would become a pandemic as early as January, told MarketWatch earlier this month. “And if we don’t get durable immunity, we’re potentially looking at revaccination on a routine basis, if we can do that,” he added. “We’ve really got to come to grips with actually living with this virus, for at least my lifetime, and at the same time, it doesn’t mean we can’t do a lot about it.” “ Exposure to the sun or to temperatures higher than 77 Fahrenheit (25 Celsius) doesn’t prevent the COVID-19 virus or cure the disease, the Mayo Clinic says. ” 1. Do you have to wear a mask outdoors? Only medical-grade N95 surgical masks with goggles can help guarantee protection against the virus, so why bother wearing a homemade face covering? Health professionals and studies support the idea that face coverings can help stop the spread. They have helped reduce contagion by reducing droplets being sprayed into the air during flu season, and scientists say they can similarly help now, particularly with the high number of asymptomatic carriers. Maskless joggers can leave a droplet slipstream of 30 feet outdoors. What’s more, Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, earlier this month recommended wearing goggles as a “complete” method to help prevent contracting the coronavirus. 2. COVID-19 only affects older people, right? And it’s a few bad days or weeks in bed, and you’re back to normal? Incorrect, and no: Lung scarring and heart and kidney damage may result from COVID-19, and some younger COVID-19 patients who were otherwise healthy are suffering blood clots and strokes. A study of 60 COVID-19 patients published in the Lancet this month found that 55% of them were still displaying neurological symptoms during follow-up visits three months later, including confusion and difficulty concentrating, as well as headaches, loss of taste and/or smell, mood changes and insomnia. 3. Won’t the summer sun and heat help? “Exposure to the sun or to temperatures higher than 77 Fahrenheit (25 Celsius) doesn’t prevent the COVID-19 virus or cure COVID-19,” according to a myth-busting guide from the Mayo Clinic. “You can get the COVID-19 virus in sunny, hot and humid weather. Taking a hot bath also can’t prevent you from catching the COVID-19 virus,” the article warns. “Your normal body temperature remains the same, regardless of the temperature of your bath or shower.” Related:COVID-19 infections just hit 20 million worldwide — why the actual number of cases is likely much higher 4. Do these treatments help? Here are some other popular misconceptions derailed by the Mayo Clinic: Cold weather and snow do not kill COVID-19. Antibiotics kill bacteria, not viruses. Drinking alcohol doesn’t protect you from the virus. And spraying it on your body doesn’t help if you are infected. The supplement colloidal silver, which has been marketed as a treatment, is not considered safe or effective for treating any disease. “There’s no evidence that eating garlic protects against infection with the COVID-19 virus,” the Mayo Clinic added. (It doesn’t help with vampires either, because they don’t exist.) Another outlandish theory: “Avoiding exposure to or use of 5G networks doesn’t prevent infection with the COVID-19 virus. Viruses can’t travel on radio waves and mobile networks. The COVID-19 virus is spreading in many countries that lack 5G mobile networks,” the organization said. “ Cold weather and snow does not kill COVID-19. Radio waves and mobile networks don’t cure or spread the virus. Antibiotics only kill bacteria. ” Ultraviolet light and disinfectants can be used on surfaces, it added. But don’t use a UV lamp to sterilize your hands or other areas of your body. UV radiation can lead to skin irritation and bleach can burn you. 5. Who tends to believe falsehoods? People who get their news from social-media platforms like Facebook FB, +0.26% and Twitter TWTR, -0.23% are more likely to have misconceptions about COVID-19, according to a recent study led by researchers at McGill University in Montreal. “Those that consume more traditional news media have fewer misperceptions and are more likely to follow public health recommendations like social distancing,” concluded the paper, which was published in the latest issue of the Harvard Kennedy School Misinformation Review. “In the context of a crisis like COVID-19, however, there is good reason to be concerned about the role that the consumption of social media is playing in boosting misperceptions,” says co-author Aengus Bridgman, a Ph.D. candidate in political science at McGill University. Social-media platforms have been criticized for their failures to stop the spread of misinformation, especially concerning elections and the coronavirus pandemic, despite a number of new policies enacted since Russia used the platforms to interfere in the 2016 elections. In May, Twitter marked tweets by President Donald Trump with a fact-check warning label for the first time, after the president falsely claimed mail-in ballots are “substantially fraudulent.” (He has continued to make such claims on social media and elsewhere.) “ Paranoia politicizes a public-health emergency and distracts from potentially life-saving measures. ” Earlier this month, social-media sites attempted to quash a video pushing misleading information about hydroxychloroquine as a COVID-19 treatment — which led to Twitter’s partially suspending Donald Trump Jr.’s account. The video featured doctors calling hydroxychloroquine — a drug used to treat malaria, lupus and rheumatoid arthritis for decades — “a cure for COVID,” despite a growing body of scientific evidence indicating it is not an effective treatment for the coronavirus. In April, the president floated the idea of using ultraviolet light inside the body or a disinfectant by “injection” as a treatment for coronavirus: “I see the disinfectant where it knocks it out in a minute. One minute.” (The next day, Trump claimed he was not being serious.) Coronavirus update: COVID-19 has now killed at least 774,053 people worldwide, and the U.S. ranks 10th in the world for deaths per 100,000 people (51.5), Johns Hopkins University says. As of Tuesday, the U.S. has the world’s highest number of confirmed COVID-19 cases (5,438,325) and deaths (170,497). Worldwide, confirmed cases are now at 21,885,268. The Dow Jones Industrial Index DJIA, +0.56% lost ground on Monday, while the S&P 500 SPX, +0.87% edged upward and the Nasdaq Composite COMP, +1.39% notched a triple-digit gain as investors hope for progress on the vaccine front and a fresh round of unemployment benefits in Round 2 of Congress’s pandemic relief program. AstraZeneca AZN, +1.16%, in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those are currently working toward COVID-19 vaccines."}]}