{"article": [{"url": "https://www.marketwatch.com/story/european-stocks-log-modest-gains-as-the-quarter-kicks-off-boosted-by-china-data-2020-07-01", "published": 1593596600.0, "headline": "Mixed data weigh on European stocks, as well as U.S. virus worries", "body": "Mixed economic data weighed on European stocks at the start of the third quarter on Wednesday, with concerns about the U.S. battle to get its coronavirus outbreak under control also troubling investors. The Stoxx Europe 600 index SXXP, +0.55% fell 0.3% in choppy trade to 359.11, after a modestly higher close on Tuesday. The index logged a 12.5% gain for the second quarter, the best percentage gain since the first quarter of 2015. But that comes after an extremely weak first quarter, as the coronavirus pandemic emerged. The German DAX DAX, +0.06% fell 1%, with the French CAC 40 PX1, +0.71% down 0.7% each and the FTSE 100 UKX, +0.64% fell 0.5%. “Going into the third quarter, the markets face more uncertainty. There is the potential for a new wave of coronavirus to emerge, even though the first wave is far from over given the situations in the U.S. and Latin America,” said Fawad Razaqzada, market analyst at Think Markets, in a note to clients. “Stock investors will find out exactly how the lockdown hit company profits, with the second-quarter reporting season soon to kick off. Then there is the ongoing trade friction between the U.S. and China to deal with, not to mention other geopolitical risks. Meanwhile, the impact of vast stimulus programs announced by governments and central banks during the height of the pandemic will diminish,” he said. German unemployment data showed 627,000 people filed in May, a 48.5% gain on the year-ago period, as the Ifo Institute predicted a slow recovery for the economy. That comes amid news that pan-European aerospace giant Airbus AIR, -0.20% plans to ax 15,000 jobs. Elsewhere, the final eurozone manufacturing purchasing manager index (PMI) rose to 47.4 in June, from a previous estimate of 46.9 and a May level of 39.4. The data add further to signs that “the eurozone factories are seeing a strong initial recovery as the economy lifts from COVID-19 lockdowns,” said Chris Williamson, chief business economist at IHS, in a press release. Sentiment also rebounded sharply, but Williamson said production and sentiment remain below pre-pandemic peaks, and weak demand and social distancing will keep dragging on the recovery. And Italy and Spain’s economies, while improving, still came in below the key 50.0 level that indicates expansion. The Caixin China manufacturing PMI climbed to a six-month high of 51.2 in June from 50.7 in May. That data provide “further evidence that the world’s second-biggest economy has some serious momentum behind it,” said Naeem Aslam, chief market analyst at AvaTrade. Dow Jones Industrial Average futures YM00, +0.82% swung from losses to gains, a day after the Dow DJIA, +0.56% and the S&P 500 SPX, +0.87% closed out the second quarter with the best performance in more than 20 years. Caution was setting in ahead of a rush of U.S. data to be released before Friday’s July 4 holiday in the U.S. Wednesday’s ADP national employment data showed 2.37 million private-sector jobs were added in June, slightly below expectations. Economists expect Thursday’s jobs data to show an employment gain of 3 million, after a surprising 2.5 million increase in May. Among stocks on the move, oil companies were moving higher as U.S. crude oil US:CLQ20 and Brent crude prices UK:BRNQ20 climbed over 2%, after the American Petroleum Institute reported late on Tuesday that U.S. crude supplies fell by 8.2 million barrels for the week ended June 26, according to sources. Shares of BP BP, -0.74% BP, +0.56% rose 1.7% and Royal Dutch Shell Group RDS.A, +0.83% RDS.B, +0.51% rose 0.9%. Shares of Clariant CLN, -0.16% rose 7%, after the Swiss chemical group said it completed a $1.6 billion sale of its Masterbatches business to polymer materials maker PolyOne US:POL US:POL Shares of German insurer Allianz ALV, +0.26% fell 1.3%. French food giant Danone BN, +0.98% fell 1.6% and banking group BNP Paribas BNP, -0.89% dropped 1.3%."}]}