{"article": [{"url": "https://www.marketwatch.com/story/microsoft-diversity-pledge-draws-scrutiny-from-us-labor-dept-2020-10-06", "published": 1602015680.0, "headline": "Microsoft diversity pledge draws scrutiny from U.S. Labor Dept.", "body": "Microsoft says the U.S. Labor Department is scrutinizing its efforts to boost Black employment and leadership at the tech company. Microsoft MSFT, +2.48% disclosed in a blog post Tuesday that it received a letter from the agency last week asking about the company’s June pledge to double the number of Black and African American managers, senior individual contributors and senior leaders by 2025. “The letter asked us to prove that the actions we are taking to improve opportunities are not illegal race-based decisions,” said Dev Stahlkopf, Microsoft’s general counsel. “Emphatically, they are not.” CEO Satya Nadella made the June hiring commitment in response to Black Lives Matter protests around the country and as part of a broader message to employees about racial injustice and promoting a culture of inclusivity at the Redmond, Washington-based company. It’s not uncommon for tech companies to publicly tout efforts to increase staff diversity, given the industry’s longstanding dearth of Black, Latino and female workers in technical and leadership positions. But this time they are running into scrutiny by a Trump administration that has sought to intervene with universities and other institutions over their approach to race and discrimination. President Donald Trump signed an executive order last month “to combat offensive and anti-American race and sex stereotyping and scapegoating” in the federal workforce and among federal contractors. Microsoft is a major federal contractor, supplying its Office workplace software and cloud computing services to multiple government agencies. In a statement sent to The Associated Press, the Labor Department said it “appreciates Microsoft’s assurance on its website that it is not engaging in racial preferences or quotas in seeking to reach its affirmative action and outreach goals.” The agency added that it “looks forward to working with Microsoft to complete its inquiry.” The letter from the Labor Department gives Microsoft until Oct. 29 to explain how it plans to carry out its pledge regarding Black leadership. The Labor Department did not respond to a question about whether it has started similar inquiries into other companies with federal contracts. The Trump administration’s move contrasts with a flurry of efforts by private companies and institutions to increase racial diversity in the wake of the Black Lives Matters protests. There has been a particular emphasis on bringing more African Americans into leadership positions. More than 40 private and publicly traded companies have joined a pledge to add at least one Black member to their board of directors by 2021. Target last month pledged to increase the representation of its Black employees by 20% over the next three years. Goldman Sachs announced an initiative to recruit more bankers and traders from historically Black colleges. Other firms that have announced similar hiring or promotion goals include Salesforce, Mastercard and Accenture. Glassdoor, the jobs site that allows users to review their employers anonymously, added new feature to allow users to rate companies on their diversity and inclusion initiatives. The company said the feature was added partly in response to a 63% spike in reviews mention diversity over the summer, following protests over the police killing of George Floyd."}]}