{"article": [{"url": "https://www.marketwatch.com/story/paypal-ceo-i-dont-think-there-is-any-going-back-from-e-commerce-after-covid-19-2020-07-29", "published": 1596099380.0, "headline": "PayPal CEO: â\u0080\u0098I donâ\u0080\u0099t think there is any going backâ\u0080\u0099 from e-commerce after COVID-19", "body": "PayPal Holdings Inc shares are up 3.5% in premarket trading Wednesday after the digital payments company showed strong growth across its business stemming from increased usage of digital payments during the COVID-19 crisis. Read: PayPal tops earnings expectations as COVID-19 drives big e-commerce growth â\u0080\u009cThe world has moved to a digital-first economy and I donâ\u0080\u0099t think there is any going back,â\u0080\u009d Chief Executive Dan Schulman said in an interview with MarketWatch prior to the companyâ\u0080\u0099s earnings call. He said that the COVID-19 crisis has meant a â\u0080\u009ctipping pointâ\u0080\u009d for digital payments that, over the past three to five months, drove an acceleration in e-commerce penetration that could have otherwise taken three to five years to accomplish. Even as more stores began to reopen their physical locations toward the end of the second quarter, PayPal PYPL, +2.18% Â saw its highest year-over-year growth in total payment volume, or the value of transactions processed on the platform, during the month of June, according to Schulman. He called the period â\u0080\u009cthe strongest quarter in our history.â\u0080\u009d Overall, PayPal generated $222 billion in payment volume during the quarter, up from $172 billion a year earlier and ahead of the $210 billion that analysts surveyed by FactSet had been predicting. The companyâ\u0080\u0099s Venmo service processed about $37 billion in volume, up 52% from a year before. The company added 21.3 million net new active accounts during the quarter, with 1.7 million of those being merchant accounts. Schulman said that the merchant-account growth was three times what PayPal normally adds on a quarterly basis. PayPal said that it had 60 million active Venmo accounts as of the second quarter, which the company defines as accounts that have made a transaction through the service over a 12-mnth span. â\u0080\u009cVenmo is experiencing some of its strongest growth ever,â\u0080\u009d Schulman said, with a 60% year-over-year increase in revenue growth during the first three weeks of July. Analysts sounded upbeat following the report. â\u0080\u009cPayPal is acquiring new users who had not shopped online before, gaining new merchants (who have to digitize for existential reasons) and seeing new spend categories which were just very hard to move online pre-crisis,â\u0080\u009d wrote Bernsteinâ\u0080\u0099s Harshita Rawat, who rates the stock at outperform and boosted her price target to $200 from $190. The company posted second-quarter net income of $1.53 billion, or $1.29 cents a share, up from $823 million, or 69 cents a share, in the year-prior quarter. PayPalâ\u0080\u0099s adjusted earnings per share increased to $1.07 a share from 71 cents a year earlier, whereas analysts surveyed by FactSet were modeling 87 cents. That includes a 7-cent negative impact from credit-loss reserves. Revenue for the quarter climbed to $5.26 billion from $4.31 billion. The FactSet consensus called for $4.99 billion. Donâ\u0080\u0099t miss: Visa tops earnings expectations, but travel category remains slow to snap back Schulman said that PayPal is making progress with in-store payment adoption since announcing the availability of QR code technology for 28 markets back in May. The company announced in its release that it will be partnering with CVS Health Corp. CVS, -1.76% Â to roll out PayPal and Venmo QR codes at physical checkout points in 8,200 standalone stores by the end of the year. This is the first retail chain to partner with PayPal, according to the companyâ\u0080\u0099s release. For the third quarter, PayPal expects 30% growth in total payment volume, 25% growth in revenue on a currency-neutral basis, and 25% growth in adjusted earnings per share. The company also reinstated a 2020 forecast after pulling its prior one earlier in the year due to pandemic-related uncertainties. For the full year, the company expects high-20% growth in total payment volume, 22% growth in currency-neutral revenue and about 25% growth in adjusted EPS. â\u0080\u009cItâ\u0080\u0099s noteworthy that PayPalâ\u0080\u0099s new guidance is above the original guidance they shared pre-COVID,â\u0080\u009d wrote Susquehanna Financial Group analyst James Friedman. â\u0080\u009cThough intuitive, we see this as further evidence PayPal is a beneficiary of secular digital tailwinds which are being further accelerated by COVID. At the same time, they are playing offense, especially with in-person payments such as QR codes, which should benefit them should life ever return to â\u0080\u0098normal.â\u0080\u0099â\u0080\u009d Friedman has a positive rating on the stock and he boosted his price target to $220 from $190. Shares of PayPal have rallied 49% over the past three months as the S&P 500 SPX, +0.87% Â has gained 11%."}]}