{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-passes-austere-budget-that-shifts-1-billion-from-policing-to-education-and-social-services-2020-07-01", "published": 1593604820.0, "headline": "New York City passes austere budget that shifts $1 billion from policing to education and social services", "body": "NEW YORK (AP) — New York City lawmakers approved an austere budget early Wednesday that will shift $1 billion from policing to education and social services in the coming year, acknowledging protesters’ demands to cut police spending — but falling short of what activists sought. The vote by the City Council came at an extraordinary moment when the nation’s biggest city is grappling with a $9 billion revenue loss due to the coronavirus pandemic and simultaneously with pressure to cut back on policing and invest more in community and social programs. Protesters have been camped outside City Hall, insisting that the city slash $1 billion from the New York Police Department’s budget amid a nationwide campaign to “defund” police — a movement animated by outrage over the deaths of George Floyd and other Black Americans at the hands of police. Critics of the deal said the billion dollar cut wasn’t a billion dollar cut at all. Some of the funding reduction, they noted, was merely shifting police functions like school safety to the Department of Education. And they doubted the promised reduction in overtime would ever happen. Mayor Bill de Blasio supports the $88.2 billion spending plan. Council Speaker Corey Johnson said when the budget deal was announced Tuesday that it wasn’t what he had hoped for, and lamented he hadn’t been unable to negotiate a bigger police budget cut. “I am disappointed,” Johnson said at a news conference. “I did my best.” The proposal did little to assuage the demonstrators. Many said they intended to stay outside City Hall indefinitely. “We are being gaslit,” said activist Jawanza James Williams. “This movement is about so much more than the $1 billion, and this means they don’t understand what we’re saying.” Activists say the budget needs to make a substantial, not symbolic, difference in advancing racial justice and curbing the size and power of the nation’s largest police force. Five years ago, the City Council — then as now, overwhelmingly Democratic — added nearly 1,300 additional officers to the NYPD. Now, Johnson has said he was wrong to support the expansion. Council budget leaders said they needed to balance calls to cut policing with residents’ concerns about safety. “Many in my community have supported police and want police. They just want families and young people to be treated fairly,” said Councilwoman Vanessa Gibson, who represents a Bronx district where over half of residents are Hispanic and about 40% are Black. Gibson said she’d met Tuesday with relatives of a Bronx 17-year-old who was shot and killed Sunday, days after his high school graduation. “I don’t want anyone to misunderstand and think that we don’t care and that we have not been working our behinds off to get to a place of equity,” while ensuring communities “are not left behind with crime, violence, illegal guns in our communities, no programs, no activities, and no hope for a better tomorrow,” Gibson said. But some other members said the budget proposal didn’t dig deep enough into police spending. Councilman Brad Lander, who voted no, called it “more budget-dancing than meaningful reductions.” Cuts would come from canceling a nearly 1,200-person police recruiting class set for next month — though another class in October is scheduled to go forward — as well as halving overtime spending, redeploying officers from administrative functions to patrol and ending police responsibility for school crossing guards and homeless outreach. The police department also would give up control over public school security, which the NYPD took over from the Department of Education in 1998. The city has about 5,300 civilian school safety agents. De Blasio said details were being worked out, but the Education Department would train the agents. Money would go instead to education, social services in communities hit hard by the virus, and summer youth programs for over 100,000 people. Other cuts are being made to the NYPD’s capital budget, including cancelling plans to build a new police precinct in Queens and instead using the money to build a community center. “We all understand that we have to answer the concerns of this moment, that people want to see our society progress,” de Blasio, a Democrat, said at a news conference. He vowed the changes would not compromise public safety. Police officials didn’t comment Tuesday. Commissioner Dermot Shea has said he was open to giving up school safety and other cuts, as long as the amount of officers on patrol doesn’t shrink. The NYPD budget is now around $6 billion, plus several billion dollars more in shared city expenses such as pensions. The new plan calls for an ambitious, nearly $300 million cut in police overtime. The department paid out $115 million in overtime just during recent protests over Floyd’s May 25 death in Minneapolis. The city budget totaled nearly $93 billion when passed last June. Before the virus hit, de Blasio proposed a more than $95 billion spending plan for the budget year that starts Wednesday."}]}