{"article": [{"url": "https://www.marketwatch.com/story/career-prosecutor-set-to-tell-congress-that-trump-ally-roger-stone-got-special-treatment-from-the-justice-department-2020-06-23", "published": 1592988560.0, "headline": "Career prosecutor set to tell Congress that Trump ally Roger Stone got special treatment from the Justice Department", "body": "WASHINGTON (AP) — A federal prosecutor is prepared to tell Congress on Wednesday that Roger Stone, a close ally of President Donald Trump, was given special treatment ahead of his sentencing because of his relationship with the president. Aaron Zelinsky, a career Justice Department prosecutor who worked on cases as part of special counsel Robert Mueller’s investigation, including the case against Stone, will say he was told in no uncertain terms by supervisors that political considerations influenced the handling of the case, according to testimony released by the House Judiciary Committee. Zelinsky now works in the U.S. attorney’s office in Maryland. “What I heard — repeatedly — was that Roger Stone was being treated differently from any other defendant because of his relationship to the president,” Zelinsky says in the prepared testimony. The panel subpoenaed Zelinsky and John Elias, a career official in the department’s antitrust division, as part of its probe into the politicization of the department under Attorney General William Barr. The Democratic-led panel and Barr have been feuding since shortly after he took office in early 2019, when he declined to testify about Mueller’s report. See:Mueller said to have weighed possibility Trump lied in written responses to investigators The Democrats launched the investigation earlier this year over Barr’s handling of the Stone case, but have expanded their focus to several subsequent episodes in which they believe Barr is doing Trump’s bidding. That includes the department’s efforts to dismiss the criminal case against Gen. Michael Flynn and the firing last weekend of the the top prosecutor in New York’s Southern District. The prosecutor, Geoffrey Berman, has been investigating the president’s personal attorney Rudy Giuliani. House Judiciary Committee Chairman Jerrold Nadler, D-N.Y., has threatened to subpoena Barr himself for a hearing next week if he doesn’t agree to appear. The attorney general has never testified before the panel. Zelinsky, one of four lawyers who quit the Stone case after the department overruled their sentencing recommendation, plans to say Wednesday that the acting U.S. attorney at the time, Timothy Shea, was “receiving heavy pressures from the highest levels of the Department of Justice to give Stone a break.” He does not say who was doing the pressuring, but says there was “significant pressure” on line prosecutors to “obscure” the correct sentencing guidelines and “water down and in some cases outright distort” what happened at Stone’s trial and the events that resulted in his conviction. The Justice Department did not immediately comment Tuesday. Before Stone’s Feb. 20 sentencing, Justice Department leadership changed the sentencing recommendation just hours after Trump tweeted his displeasure at the recommendation of up to nine years in prison, saying it had been too harsh. Stone was later sentenced to serve more than three years in prison plus two years’ probation and a $20,000 fine. Barr has said the president’s tweet played no role in the change. He said he ordered the new filing hours before the president’s tweet because he was caught off guard by the initial sentencing recommendation and believed it was excessive based on the facts of the case. Filing a new one was a “righteous decision based on the merits,” he has told The Associated Press. According to his prepared testimony, Zelinsky will describe having learned from the media that the Justice Department planned to overrule the trial team’s sentencing recommendation, something he said he found unusual given the department’s conventional practice of not commenting on cases. Though the U.S. attorney’s office initially said the reports were false, the team was later told that a new sentencing memorandum would be issued that would see a lighter punishment for Stone. “We repeatedly asked to see that new memorandum prior to its filing. Our request was denied,” Zelinsky will say. “We were not informed about the content or substance of the proposed filing, or even who was writing it. We were told that one potential draft of the filing attacked us personally.” Zelinsky says he was also told that the acting U.S. attorney was giving Stone such unprecedentedly favorable treatment because he was “afraid of the President.” Stone was convicted on all seven counts of an indictment that accused him of lying to Congress, tampering with a witness and obstructing the House investigation into whether the Trump campaign coordinated with Russia to tip the 2016 election. On Tuesday, Stone filed a motion asking to extend his surrender date until September because of coronavirus concerns. He is scheduled to report to a federal prison in Georgia by June 30. In separate testimony released by the committee, Elias plans to detail antitrust investigations that he says were started over the objections of career staff. He says he asked the department’s inspector general to investigate “whether these matters constituted an abuse of authority, a gross waste of funds, and gross mismanagement.”"}]}