{"article": [{"url": "https://www.marketwatch.com/story/as-tables-turn-new-york-fears-visitors-from-out-of-state-could-cause-rise-in-infections-2020-06-15", "published": 1592246780.0, "headline": "As tables turn, New York fears visitors from out of state could cause rise in infections", "body": "As deaths from the coronavirus in New York fell to a new low on Sunday, the nation’s former epicenter now frets that outsiders could bring the virus with them from other states. The concern marks a stark reversal since the height of the crisis in March and April, when governors from Florida to Connecticut forced incoming New Yorkers to quarantine themselves for two weeks out of fear they’d brought the virus with them. Now, rising cases in 22 states and Puerto Rico potentially pose a threat to progress in New York, which currently has one of the lowest infection rates in the country, Gov. Andrew Cuomo said at a briefing on Monday. Only 1.1% of more than 56,000 COVID-19 tests came back positive on Sunday. “Talk about great irony. One of our concerns now in New York is that people from the other states that have a high rate of increase of COVID virus may start traveling to New York,” Cuomo said. As of Sunday, deaths fell to 27 on a three-day rolling average—the lowest loss of life since the pandemic started. Total hospitalizations statewide were also down to a new low, falling to roughly 1,600 on Sunday, down from a peak of more than 18,000 in early April, the governor said. Daily Infections have flared up from Arizona to Florida, where a rash of bars have had to close in the latter since the weekend, after customers tested positive for the virus. New cases hit an all-time high across a number of states, including Florida, Alabama, South Carolina, Texas and Arkansas, in recent days, according to data from Johns Hopkins University. “Remember when we started, other states were saying we don’t want people from New York coming to our state because we’re afraid they’ll bring the virus?” Cuomo said, adding that the federal government discussed blockading the state and preventing New Yorkers from leaving. Also read: The surge in coronavirus cases in some states isn’t part of a ‘second wave’ “Fast forward 106 days later,” Cuomo said, “we have the lowest infection rate, and my officials are saying we hope people from Florida don’t come here.” As states reopen and summer travel increases, some have suggested temperature checks at airports and other travel hubs. But Cuomo said the state hasn’t made any kind of decision on protective measures against potential spread from outside. “We’re not there yet,” he said. For the time being, the greatest risk of spread comes from within, as New Yorkers and businesses have been openly flouting social distancing guidelines, according to more than 25,000 complaints the state received over the weekend, the governor said. Images from the weekend showed crowds gathered outside bars and restaurants without masks, especially in parts of New York City, where eateries are still takeaway only. See: Some Americans are more likely to socially distance and wear face masks than others — here’s why “People are violating everything. No masks, no social distancing,” Cuomo said on Monday, reiterating that he would suspend businesses’ liquor licenses if they’re caught breaking reopening guidelines. On Sunday, he also threatened to roll back the phased reopenings of areas, particularly for Manhattan and the Hamptons, if social distancing rules continued to be ignored on a wide scale. He said the huge volume of calls indicates that people are scared of rising infections. “The people of the state know what they did. They know the sacrifice they made,” Cuomo said. “They don’t want anyone’s irresponsibility to jeopardize that.”Other developments in New York state: • The 2020 tennis U.S. Open will reportedly go ahead this year on its normal schedule from Aug. 31 to Sept. 13, but without fans. The decision still needs formal government approval, and it’s unclear how many athletes will opt to compete in the annual tennis championship, held each year at the Billie Jean King Tennis Center in Queens. • Western New York will enter Phase 3 on Tuesday, and the Capital Region will follow on Wednesday. Gatherings of 25 people will be allowed in Phase 3, raised from 10, Cuomo said on Monday."}]}