{"article": [{"url": "https://www.marketwatch.com/story/will-quadruple-witching-mark-the-start-of-a-rocky-stretch-for-us-stocks-it-may-already-have-2020-06-18", "published": 1592560400.0, "headline": "Will quadruple witching mark the start of a rocky stretch for U.S. stocks? It may already have", "body": "Quadruple witching, a pandemic, a recession, and a stock market that is looking for reasons to add to an epic recovery from the impact of the coronavirus. Could those factors make for a volatile cocktail for the stock market in coming days and weeks? Quadruple witching, occurs on the third Friday of the month of every quarter, in March, June, September, and December, and refers to the simultaneous expiration of single-stock options, single-stock futures, and stock-index options and stock-futures. Equities have already experienced a bout of renewed volatility last Thursday that may have cracked Wall Street’s bullish patina, with the Dow Jones Industrial Average DJIA, +0.56% tumbling 7% and the S&P 500 SPX, +0.87% tanking by 6%. However, Friday’s quad witching period, could mark the start of a further bumpy patch for the market, including the rebalancing of Russell indexes, which concludes on June 26, and the start of a new batch of quarterly corporate earnings reports in mid July. “Markets have become a battleground over the past week between the bulls and the bears,” Art Hogan, chief market strategist at National Securities Corporation, told MarketWatch. “Expirations tend to be volatile by their nature, and I would suspect this go around will likely be no exception,” Hogan said. Quad witching usually only results in higher than normal volumes, and those usually peak on Wednesday or Thursday of expiration week, Randy Frederick, vice president of trading and derivatives at Charles Schwab told MarketWatch. Frederick said that options volumes tend to be particularly elevated during quad-witching periods. However, he suspected that last week’s volatility shock might have resulted in oversize options volumes a week ahead of the expiration dates. “Option market volume on Thursday (6/11) was greater than 48 million,” Frederick said, marking the second-highest, single-day volume ever after Feb. 28, according to the Schwab expert. “While volumes have been fairly high this week, unless we encounter another sharp downturn today or tomorrow, we won’t see anything close to that; yesterday was just 25.6 million,” he explained. Charlie McElligott, cross-asset strategist at Nomura, warned that quad witching could result in a burst of turbulence in the markets but analysts notes also speculated that much of that has run its course given last week’s action. McElligott explained the spike last Thursday to MarketWatch’s Sunny Oh this way: Investors will buy put options to prevent losses or benefit from a market selloff, while banks and options dealers will sell the options, taking the other side of the trade. When stocks slump, the losses associated with these options will surge for the dealers who sold them, forcing them to sell stocks or stock-futures to hedge their losses. On top of that, dealers want to sell the options before they expire, usually at the end of the week. Traders have said have said options volume typically spikes around 3:30 p.m. Eastern Time on quadruple-witching days, but it remains to be seen on how that will play out in reality on Friday. Read: Stock-market legend who called 3 financial bubbles says this one is the ‘Real McCoy,’ this is ‘crazy stuff’ Fretting about a second wave of coronavirus infections in the U.S. and elsewhere in the world was part of the catalyst for last week’s volatility, serving as a reality check to beaten-down cyclical stocks which were playing catch-up since the start of June after earlier failing to share in Wall Street’s two month rally led by technology stocks. Frederick said that he’s expecting volatility to come from four areas as he looks ahead: Continued protesting and unrest related to George Floyd and other incidences The uptick in COVID-19 cases in the US, China and elsewhere, but also positive developments such as the Oxford steroid study Congressional testimony from Jerome Powell, and the start of the Federal Reserve’s corporate bond buying program Large upside and downside surprises in economic data; retail sales, housing data, etc. Hogan said fiscal and monetary policy stimulus coupled with better-than-feared U.S. economic data, and progress toward coronavirus remedies have helped make a case for the bulls. However, the unrelenting rally since late March has created more uncertainties about equity valuations in the face of corporate earnings that are certain to be weaker in the coming weeks and an economy that is unlikely to normalize until two or three years from now, by some estimates. “On the other side of that argument right now we have those market participants that believe that we have come too far too fast, and the recent uptick in new COVID-19 case discoveries in several states in the US in various countries is starting to push a second wave narrative, with fears have another forced shut down of the economy,” he said. Meanwhile, the rebalancing of the Russell stock indexes will impact some $9 trillion in assets that are pegged to those indexes. “Changes to the Russell US Indexes this year tell a very interesting story about the US equity market during a unique time in our history,” wrote Catherine Yoshimoto, director, product management at FTSE Russell, in a recent blog post. She noted that the biggest companies grew larger and the smaller companies shrank. “Although the total market cap of the Russell 3000 Index was down less than 1% from $31.7 trillion as of last year’s rebalance to $31.4 trillion as of this year’s rank day (May 8, 2020), the breakpoint between the large cap Russell 1000 and small cap Russell 2000 decreased 16.4% from $3.6 billion to $3.0 billion,” she wrote (see attached chart)."}]}