{"article": [{"url": "https://www.marketwatch.com/story/mass-evictions-the-next-crisis-that-could-hit-new-york-city-2020-07-17", "published": 1595000840.0, "headline": "Mass evictions: The next crisis that could hit New York City", "body": "An economic crisis caused by a global pandemic, an inconsistent government response and a precarious social safety net has culminated in the prospect, community groups say, of some 50,000 New Yorkers losing their homes. “This crisis existed before COVID-19,” said Cea Weaver, the campaign coordinator for Housing Justice for All, an advocacy organization in the city. “Millions of people who have lost income were already living in unaffordable apartments. Rent was already a struggle.” But the coronavirus has exacerbated the situation. An estimated 735,000 households in New York City have lost employment income as a result of COVID-19, according to the NYU Furman Center, a group that advances research and debate on housing and urban policy. Black and Hispanic households in the city have been particularly hard hit. Approximately 58% of Hispanic wage-earning households and 38% of Black wage-earning households worked in industries that were vulnerable to disruption from coronavirus, like hospitality, according to an analysis from the group. Community organizations say that as a result, an estimated 50,000 renters could face eviction proceedings when the housing courts fully reopen. Samuel Himmelstein, a partner at the law firm Himmelstein, McConnell, Gribben, Donoghue & Joseph, who focuses on tenants’ rights litigation, said that since March, his office has been inundated by New Yorkers who lost their jobs. “I and the firm have been overwhelmed with inquiries from people who are basically saying, ‘I can’t afford my rent, I’m running out of money. What are my options?’” Himmelstein said. “I’ve been practicing for 40 years and I’ve never seen anything like this.” Meanwhile, housing courts in New York City have reopened their brick-and-mortar locations for current litigants to drop off filings. They are also hearing cases virtually in which both the plaintiff and defendant have an attorney, and setting up remote conferences to move them forward or settle. Also read: New York culture creaks back to life, COVID-style Landlords can also begin new cases by mail, and some tenants have started getting served with those cases. How post-pandemic cases are going to be processed after they are initiated through mail, however, is unclear. There are still no required in-person appearances for those cases, and no trials taking place. “I personally can’t imagine the courts reopening physically until there’s either a cure or a vaccine,” Himmelstein said. “That court is a disease cesspool when it’s functioning normally...and I’m not saying that because of the people that are there, I’m saying that because of the facility,” he added, referring to the cramped quarters of Brooklyn Housing Court, originally a commercial building. All the while, Judith Goldiner, who runs the civil law reform unit for The Legal Aid Society, a social justice law firm, has taken part in around 10 virtual town halls to let people know their rights and what’s going on with housing. “People are pretty scared, pretty desperate,” Goldiner said. “We’re just going to be trying to hold the line until we can get some money from Congress.” Many are hoping that the proposed $3 trillion Heroes Act coronavirus relief bill, currently stalled in Congress, or some other aid will provide rent relief on a scale of magnitude that only the federal government can provide. See: Renters face financial cliff ahead as eviction moratorium ends July 25 “It’s almost unthinkable that there wouldn’t be some sort of intervention given where we are,” said Matthew Murphy, the executive director of the NYU Furman Center. “Otherwise, you’ll see consequences across the entire industry, both on the tenant side, additional eviction filings and nonpayment cases; and then on the landlord side, mortgage foreclosures, defaulting on loans, not paying property taxes.” On the local level, the state’s Tenant Safe Harbor Act, passed on June 30, extended certain protections, prohibiting courts from evicting residential tenants for nonpayment due to coronavirus, though a landlord can still try to get a money judgment against a tenant.. Also, Gov. Andrew Cuomo on Tuesday announced a new coronavirus rental assistance program. Successful applicants will receive a one-time subsidy, paid directly to their landlord that would cover the difference between the percentage of their gross income spent on rent on March 1, and whatever that percentage became during the following months. For example, if a household spent 35% of their gross income on rent on March 1, and are now spending 50% on rent, this program would cover the 15% difference. Applicants must be under a certain income threshold, pay more than 30% of their gross monthly income in rent, and must have lost income between April 1 and July 31. Renters can apply for assistance within a two-week period beginning Thursday, July 16. Related: More than 20 million Americans may be evicted by September There is a state executive order for 60 days starting June 20 that halts the enforcement of a foreclosure against owners of a commercial or residential property who are facing financial hardship as a result of the coronavirus. “When that moratorium is lifted, the moratorium on mortgage payments, that is when we’re going to see the real impact of this Covid situation, when the banks start becoming aggressive and trying to collect the mortgage payment,” said Richard St. Paul, the executive director of the New York Small Housing Association, a group for landlords who own between one and five rental units in a home. On a grassroots level, rent strikes and housing protests have sprung up around the city this summer to raise political awareness and keep people in their homes. Holden Taylor is on the organizing committee of the Crown Heights Tenant Union, a group made up of different tenant associations in the neighborhood. “We’re on the precipice of absolute crisis,” Taylor said. The organization is involved in rent strikes in 35 buildings, according to Taylor. They are reaching out to people who don’t have the money to pay their rent, and those who do but want to join the rent strike in solidarity. Taylor, along with about a quarter of tenants in his own building and the building next door, owned by the same landlord, are on a rent strike. Tenants have had a years-long troubled history with the landlord, and Taylor said that the courtyard of his building is currently filled with sewage. Even with the eviction moratorium for some tenants, renters will still be financially responsible for back rent when it comes due. “I do see a crisis coming, but I don’t think it’s going to happen overnight,” Himmelstein said. “It’s going to happen when the courts really start functioning normally again. At that point, I think there’s going to be a flood of new cases.”"}]}