{"article": [{"url": "https://www.marketwatch.com/story/failing-to-extend-the-extra-600-in-unemployment-benefits-would-be-the-economic-equivalent-of-reopening-the-economy-too-soon-one-policy-analyst-says-11595298347", "published": 1595498840.0, "headline": "The extra $600 in unemployment benefits â\u0080\u0098gave people a real lifeline,â\u0080\u0099 Trump says, so â\u0080\u0098weâ\u0080\u0099re doing it againâ\u0080\u0099 but in smaller increments", "body": "More than 25 million Americans have been receiving the extra $600 in unemployment benefits since April. It has helped bring back some of the 7.5 million jobs that were added last month, economists say. Getty Images Beneficiaries of the extra $600 in weekly benefits that unemployed Americans are receiving as part of the $2 trillion CARES Act may not be the only ones who lose out if lawmakers donâ\u0080\u0099t extend or replace the extra benefits by the July 31 deadline.Â Less money to spend in stores and online could translate into more layoffs on top of the nearly 30 million Americans who have been laid off amid the pandemic, some economists say.Â â\u0080\u009cLetting the $600 expire would be the economic equivalent of reopening the economy too soon,â\u0080\u009d said Michele Evermore, a senior policy analyst at the National Employment Law Project, an advocacy organization focused on workersâ\u0080\u0099 rights.Â â\u0080\u009cI really worry about what happens to people getting benefits now who might lose them, but also the person next door whoâ\u0080\u0099s been able to keep their hardware store open because of them.â\u0080\u009d President Donald Trump said Tuesday that those benefits wonâ\u0080\u0099t go away completely. He said he was against the original decision to offer an additional $600 in federal benefits to unemployed Americans on top of their state benefits, adding that â\u0080\u009cit still worked out well because it gave people a lifeline.â\u0080\u009d â\u0080\u009cNow weâ\u0080\u0099re doing it again,â\u0080\u009d he said. â\u0080\u009cTheyâ\u0080\u0099re thinking about doing 70% of the amount.â\u0080\u009d Itâ\u0080\u0099s unclear whether Trump meant extra benefits could drop to $420 extra a week on top of state unemployment benefits, or if the benefits would be equal to 70% of a personâ\u0080\u0099s prior income. If the $600 expires entirely, 5.1 million jobs could be lost by the end of 2021, according to Josh Bivensâ\u0080\u0099 calculations, an economist at the left-leaning Economic Policy Institute.Â A $300 reduction would result in half as many losses by 2021, Bivens told MarketWatch, but would still be â\u0080\u009ca disaster.â\u0080\u009d “ â\u0080\u0098I really worry about what happens to people getting benefits now who might lose them, but also the person next door whoâ\u0080\u0099s been able to keep their hardware store open because of themâ\u0080\u0099 ” â\u0080\u0094 Michele Evermore, a senior policy analyst at the National Employment Law Project â\u0080\u009cWe shouldnâ\u0080\u0099t assume weâ\u0080\u0099re on a glide path to recovery â\u0080\u0093 I strongly suspect weâ\u0080\u0099ll see job losses in July as the virus has resurged and people have reimposed social distancing in many places,â\u0080\u009d Bivens said. â\u0080\u009cTaking away or paring back [unemployment benefits] on the assumption that weâ\u0080\u0099re on a smooth path to recovery is hence really premature.â\u0080\u009dThe supplemental unemployment benefit has been a contentious issue amongst lawmakers Republicans hold that the additional $600 in unemployment benefits discourages people from returning to work, especially the two-thirds of Americans who now collect more money in unemployment benefits than they did from their jobs, according to economists from the University of Chicago.Â Â On top of which, last month the U.S. added 7.5 million jobs, which many Republican lawmakers view as a sign of economic recovery and therefore see no need to offer supplemental unemployment benefits. Related: The extra $600 Americans get in weekly unemployment benefits ends this month â\u0080\u0094 how lawmakers are proposing to replace it More recently Treasury Secretary Steven Mnuchin said that the Trump administration would consider tacking on supplemental unemployment benefits in the next stimulus package that are â\u0080\u009cno more than 100%â\u0080\u009d of a workersâ\u0080\u0099 prior wages.Â “ I strongly suspect weâ\u0080\u0099ll see job losses in July as the virus has resurged and people have reimposed social distancing in many places ” â\u0080\u0094 Josh Bivens, an economist at the Economic Policy Institute Democrats say that supplemental unemployment benefits are necessary to help millions of Americans pay for rent and other crucial expenses. It is unlikely that the Democratic-controlled House will sign off on a stimulus package that doesnâ\u0080\u0099t include supplemental unemployment benefits, policy experts say.Â Also see: Republicans will start work in Senate on $1 trillion coronavirus relief package, Mnuchin says The U.S. Chamber of Commerce, a lobbying group for businesses, thinks $600 a week is too generous. However, the group recognizes that the extra benefits have allowed many Americans to spend money, which supports jobs. The Chamber is pushing for a maximum of $400 in extra weekly jobless benefits.Â â\u0080\u009cWithdrawing the $600 risks significant individual hardship as well as a drop in consumption that holds back economic recovery,â\u0080\u009d Thomas Donohue, CEO of the U.S. Chamber of Commerce, said in a letter to McConnell and House Speaker Nancy Pelosi.Â Evermore, however, said $600 is just the right amount of supplemental benefits.Â â\u0080\u009cLower-income people are spending it all,â\u0080\u009d she said. It has also given them â\u0080\u009cthe ability to say no to taking dangerous jobs.â\u0080\u009d Mnuchin said he and White House Chief of Staff Mark Meadows will be meeting with Republican senators on Tuesday regarding a forthcoming stimulus package. Later in the day, they will be meeting with Pelosi and Senate Minority Leader Chuck Schumer."}]}