{"article": [{"url": "https://www.marketwatch.com/story/students-get-suspended-for-posting-pictures-of-schools-crowded-halls-now-several-people-have-been-infected-2020-08-09", "published": 1596999080.0, "headline": "â\u0080\u0098It was chaos!â\u0080\u0099 Students get suspended for posting pictures of packed halls â\u0080\u0094 now the high school is closing after 9 people were infected", "body": "Last week, pictures of maskless students crowding the hall of Georgiaâ\u0080\u0099s freshly reopened North Paulding High School went viral and raised questions all over the internet as to whether getting kids back to school while coronavirus cases are still on the rise is a good idea. These are the kinds of tweets that were being shared: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Two students involved with posting the images were suspended, including Hannah Watters, who said: â\u0080\u009cThere was no social distancing, a 10% mask use rate, it was chaos!â\u0080\u009d After a national outcry, the district reversed course and the kids were allowed to return. Watters raised her concerns after the district called mask-wearing a â\u0080\u009cpersonal choiceâ\u0080\u009d and acknowledged that social distancing â\u0080\u009cwill not be possible to enforceâ\u0080\u009d in most cases. One school nurse in the district resigned over concerns about virus safety. â\u0080\u009cI donâ\u0080\u0099t feel supported. I donâ\u0080\u0099t feel safe,â\u0080\u009d Amy Westmoreland told local news, adding that she made the decision even before the photos circulated. â\u0080\u009cI feel as though I need to take a stand so that these children who donâ\u0080\u0099t have a voice and are being discouraged from speaking have a voice.â\u0080\u009d Meanwhile, it turns out nine people at that school have already been infected. In a letter sent to parents Saturday and cited by ABC News, principal Gabe Carmona explained that six students and three staff members have since tested positive for the virus. â\u0080\u009cWe have anticipated that COVID-19 would impact us as it has nearly every community, and the district has worked in partnership with the Department of Public Health (DPH) to proactively implement safety precautions and response plans,â\u0080\u009d the letter reads. The school announced Sunday it will be closed for in-person classes on Monday and Tuesday. The tally of confirmed coronavirus cases in Paulding County, as of Saturday afternoon, reached 1,651, according to the Georgia Department of Public Health. There have been a total of 22 deaths and 123 hospitalizations in the area due to the virus since the pandemic started."}]}