{"article": [{"url": "https://www.marketwatch.com/story/4-useful-rules-for-booking-holiday-traveland-keeping-it-flexible-2020-09-02", "published": 1599196220.0, "headline": "4 useful rules for booking holiday travelâ\u0080\u0094and keeping it flexible", "body": "This article is reprinted by permission from NerdWallet. Itâ\u0080\u0099s time to start thinking about holiday travel. Or is it? The COVID-19 pandemic has thrown so many wrenches in so many plans that itâ\u0080\u0099s hard to know what will happen next month, never mind in December. That doesnâ\u0080\u0099t mean you should scuttle all travel plans for the holidays, necessarily. Rather, you can take extra precautions to book highly flexible travel so that if (and when) plans change, you wonâ\u0080\u0099t lose money. Here we outline four ways to book holiday travel without locking yourself in. Be aware that, just like everything else this year, the policies and ideas mentioned here could be totally different come fall. Make sure to check the current terms before hitting â\u0080\u009cbookâ\u0080\u009d on any travel.1. Avoid budget airlines As of Aug. 9, 2020, all the full-fare airlines in the U.S. are offering flexibleÂ change and cancellation policiesÂ for new bookings. In other words, these airlines are currently allowing some form of fee waivers on changes to newly booked itineraries: Alaska Airlines ALK, +0.15% Â American Airlines AAL, +0.34% Â Delta Air Lines DAL, +0.39% Â JetBlue Airways JBLU, -0.07% Â Southwest Airlines LUV, +1.89% Â United Airlines UAL, +0.32% Â (Southwest is generally considered a low-cost airline, but it offers an extraordinarily flexible change and cancellation policy even in normal times.) The other budget carriers, including Frontier, Spirit SAVE, +1.35% Â and Allegiant ALGT, +2.16% Â , have rolled back their flexible booking policies, offering limited flexibility on new bookings. That means you may pay slightly less in the short term for a Spirit flight in December, but youâ\u0080\u0099re more likely to eat a hefty fee if your plans change. Save yourself the headache and simply skip budget airlines this year. Even though the airlines in the list above are offering â\u0080\u009cchange fee waivers,â\u0080\u009d this doesnâ\u0080\u0099t mean youâ\u0080\u0099ll get your money back if you cancel a booked flight. Instead youâ\u0080\u0099ll likely receive a voucher with that airline to book future travel. Usually thatâ\u0080\u0099s no problem, but in these uncertain times it may mean losing the value of your initial ticket eventually. Before booking, ask yourself: â\u0080\u009cHow likely am I to take another equally expensive flight with this airline in 2021 or even 2022?â\u0080\u009d If the answer is â\u0080\u009cnot certain,â\u0080\u009d then you might want to reconsider booking in the first place.2. Choose your lodging carefully â\u0080\u009cI donâ\u0080\u0099t need a hotel, Iâ\u0080\u0099ll stay with my â\u0080¦ oh, right.â\u0080\u009d Whatever the holidays look like this year, theyâ\u0080\u0099re less likely to involve pullout sofas or sleeping in your childhood bedroom. You might need to book a hotel room or vacation rental. This is where things get more complicated. Currently, only a few hotels offer generous, blanketÂ change/cancellation policiesÂ for all travel through December: Hilton HLT, -1.26% Â Hyatt H, -2.69% Â Radisson You can book a room with one of these brands now and cancel within 24 hours of check-in to receive a full refund. Thatâ\u0080\u0099s hard to beat. Other hotel brands may offer flexible rates, but theyâ\u0080\u0099re often more expensive and require reading the fine print. See: Report card: Which hotel brands have adapted best to COVID-19? Vacation rental companies like Airbnb and Vrbo have been less generous with their cancellation policies, sometimes leaving it to the discretion of the property owner whether or not to allow cancellations. If youâ\u0080\u0099re at all worried about securing a room for the holidays, your best bet is to choose one of the hotel brands listed above, as they provide maximum flexibility.3. Donâ\u0080\u0099t rely on travel insurance Travel insuranceÂ is a good way to hedge against uncertainty â\u0080¦ in normal circumstances. However, whatever is happening with the pandemic in December is unlikely to qualify as an â\u0080\u009cunforeseeable event,â\u0080\u009d and therefore unlikely to be covered by a travel insurance policy. In other words, changing your mind about traveling isnâ\u0080\u0099t likely to be covered by your policy. You might still want to get coverage in case something else happens, but donâ\u0080\u0099t rely on travel insurance to bail you out if you decide to change your plans â\u0080\u0094 unless you purchase a stand-alone policy with aÂ cancel for any reasonÂ add-on (and even then you wonâ\u0080\u0099t get a 100% refund).4. Play the waiting game Last and most simply, you might not need to book holiday travel just yet. Usually, airfare prices creep up throughout the fall until they reach nearly absurd levels by November â\u0080\u0094 but 2020 is not â\u0080\u009cusually.â\u0080\u009d For example, here are the prices we found for a round-trip flight from New York to Los Angeles during the week of Christmas: Those prices are ridiculously low, indicating that the normal demand spike that drives high prices hasnâ\u0080\u0099t yet materialized (and is unlikely to). Even if air travel returned to 50% of normal rates by December, supply would still far outstrip demand, and prices may remain low. Donâ\u0080\u0099t miss: How the pandemic is upending business in wine country The takeaway: Thereâ\u0080\u0099s no rush. You might start tracking prices now, and if they start ticking up, you could book with one of the airlines with flexible change and cancellation policies. But prices could also drop â\u0080\u0094 nobody knows.The bottom line If youâ\u0080\u0099re a Type A planner, (1) this has probably been a rough year, and (2) you might be worrying about whether or not to book holiday travel at all. Thankfully, you have plenty of good options that afford maximum flexibility, including booking with a full-cost airline, picking your hotels wisely and even waiting a few more months.More from NerdWallet: Which Airlines Have Handled COVID-19 the Best? Which Hotels Have Handled COVID-19 the Best? Ask an Expert: Is Any Travel Safe? Sam Kemmis is a writer at NerdWallet. Email: skemmis@nerdwallet.com. Twitter: @samsambutdif."}]}