{"article": [{"url": "https://www.marketwatch.com/story/gold-edges-lower-thursday-as-investors-await-powells-jackson-hole-speech-2020-08-27", "published": 1598538200.0, "headline": "Gold ends lower in volatile session as Fed policy strategy change lacks element of surprise", "body": "Gold futures end lower Thursday after a volatile session that saw prices move in either direction by as much as 2%. Federal Reserve Chairman Jerome Powell announced changes to the central bank’s policy framework in a speech at the Jackson Hole economic symposium that were perceived as offering a more accommodative monetary policy, and bullish for bullion buyers in the long run. However, the policy change was largely expected and analysts said some investors resorted to profit taking in the wake of the speech. In a statement, the Fed said that it has adopted an “average inflation target” and recognizes the benefits for a strong labor market. The Fed’s strategy retains 2% annual inflation as a target but the Fed said it “seeks to achieve inflation that averages 2% over time.” Read:Fed unanimously adopts new strategy, widely seen as leading to easier policy “It is hard to overstate the benefits of sustaining a strong labor market, a key national goal,” Powell said in his prepared remarks discussing the policy shift. Gold traders already knew the speech would mention inflation, and gold prices initially moved higher, climbing by more than $30 an ounce, in the initial wake of the speech, Jim Wyckoff, senior analyst at Kitco.com, told MarketWatch. Prices then got pulled lower as traders “discounted” Powell’s speech since it wasn’t fresh news, he said. The important thing is that the “overall marketplace [is] shifting to more inflation,” said Wyckoff, which prices for many commodities moving higher. It’s a change in psychology “from one of price deflation being an issue in the past 10 years” to now one of persistent central bank monetary policy stimulus leading to potential problematic price inflation. “That’s what’s going to continue to lift precious metals prices.” Looking ahead to next week, Wyckoff expected to see “sideways to higher price action.” On Thursday, December gold GCZ20, +2.17% GC00, +2.17% fell $19.90, or 1%, to settle at $1,932.60 an ounce. Prices traded as low as $1,914.70, but also as high as $1,987 during the session. Prices rose 1.5% Wednesday to finish that day at around a one-week high. “Gold has had a nice move since the consolidation between April and June, so I think it’s healthy for it to pull back, digest, and consolidate further here,” said Adam Koos, president of Libertas Wealth Management Group. “ I would like gold ‘to see another 2 weeks of sideways movement, after which I expect it to head to new, all-time-highs by the end of the year.’ ” — Adam Koos, Libertas Wealth Management Group “While I’m out of the yellow metal for now, I’m watching it daily, and would like to see another 2 weeks of sideways movement, after which I expect it to head to new, all-time-highs by the end of the year,” he said. The most likely catalysts for that move higher would be further weakness in the U.S. dollar “and investors using the trade as a safe haven for the uncertainties that will arrive closer to (and after) the Presidential election.” September silver US:SIU20, meanwhile, lost 42 cents, or 1.5%, at $27.025 an ounce, after surging 4.4% on Wednesday, also marking its highest settlement in about a week. In the coming days, the market will be picking apart the Fed’s new strategy, and that “this is likely to continue to drive gold-price volatility,” Cailin Birch, global economist at The Economist Intelligence Unit, told MarketWatch. Meanwhile, traders parsed the latest economic data, with new applications for U.S. jobless benefits down again in late August to just above 1 million and resumed a downward trend, perhaps signaling the resumption of a gradual if painfully slow recovery in the U.S. labor market. Initial jobless claims, a rough gauge of layoffs, declined by 98,000 to 1 million from 1.1 million in the prior week, the Labor Department said Thursday. Meanwhile, a historic decline in U.S. 2nd-quarter gross domestic product was revised to 31.7% annual rate from 32.9%. Among other metals Thursday, December copper HGZ20, +1.38%, which is now the most active, settled at $2.9905 a pound, up 0.3%. October platinum PLV20, +3.99% lost 1.% to $928.10 an ounce, while the most-active December palladium contract PAZ20, +2.31% shed 1% to $2,190.50 an ounce."}]}