{"article": [{"url": "https://www.marketwatch.com/story/bidens-selection-of-harris-is-modestly-positive-for-cannabis-industry-but-negative-for-financial-stocks-analysts-say-2020-08-12", "published": 1597313360.0, "headline": "Biden's selection of Harris is 'modestly positive' for cannabis industry, but 'negative for financial stocks,' analysts say", "body": "In the wake of Joe Biden's selection of Kamala Harris as his running mate, Wall Street analysts are offering predictions on what the pick could mean for some key industries if the Democratic duo wins the November election. The choice by Biden as he aims to oust President Donald Trump from the White House is viewed as likely to affect the cannabis industry MJ, +0.26%  and the financial sector XLF, +0.11%, as well as potentially energy XLE, -1.59%  and Big Tech XLK, +1.52%  . The presumptive Democratic presidential nominee's decision on his vice president is \"modestly positive for cannabis as she is an advocate for legalization,\" said Jaret Seiberg, an analyst at Cowen Washington Research Group, in a note. Harris, California's junior senator, is a sponsor of legislation to decriminalize marijuana at the federal level - the Marijuana Opportunity Reinvestment and Expungement (MORE) Act, Seiberg added. The Democratic-controlled House Judiciary Committee passed the MORE Act in November, but the bill hasn't gotten anywhere in the Republican-run Senate. \"So she would be a voice for legalization within the Biden administration if he wins in November. That is positive, but Team Biden already was going to sign whatever legalization measure Congress could deliver,\" Seiberg wrote. The Cowen analyst said his shop also views Biden's pick of Harris as \"modestly negative for financials,\" noting she opposed a 2018 bank deregulation law. In addition, Seiberg said Harris is likely to advocate for increased enforcement actions by the Consumer Financial Protection Bureau, but a Biden administration already had been on track \"seek to boost CFPB enforcement.\" Related:Kamala Harris on student-loan forgiveness, Medicare, universal basic income, credit scores - and a tax on trading stocks KBW analyst Brian Gardner offered a similar take on what Biden's VP pick could mean for the financial sector. \"We see the selection of Sen. Harris as a negative for financial stocks,\" Gardner said in a note, but he added that his shop does not think overall that Biden's announcement \"will have a material impact on the markets - vice presidential candidates rarely impact the outcome of an election or a president's agenda.\" Opinion:Biden's pick of Harris won't make or break the 2020 election Even so, the analyst said that while Harris \"does not have the same history with the financial sector as Senator Elizabeth Warren,\" who is known for taking on the sector, KBW had been viewing the California lawmaker as \"among the more negative possible candidates for financial stocks.\" Gardner noted that while she was California's attorney general, Harris \"withdrew from national negotiations regarding the foreclosure crisis and later obtained a large settlement for California.\" He also cited her opposition to the 2018 bank deregulation law, and the fact that during her presidential campaign she \"proposed a financial transaction tax (FTT) to pay for her Medicare for All plan.\" \"The FTT is a concept that has gained traction among Democrats, and we expect that a Biden administration and congressional Democrats will push for some form of it if they win in November,\" Gardner wrote. Related:Here's how a Biden presidency could hurt financial stocks Other analysts see Harris potentially touching a range of industries. \"Harris has shown a real interest in civil rights issues as it relates to prisons, consumer finance, student lending, climate change, and housing, as well as big tech privacy issues. Those are issues Biden could be inclined to hand off to Harris, who would work in conjunction with an active executive branch,\" analysts at Beacon Policy Advisors said in a note. Read more:Kamala Harris is a friend, not foe, of Big Tech She counts as a \"relatively progressive pick on energy and environment,\" wrote analysts at Height Capital Markets. \"She was an original co-sponsor of the Green New Deal and has a heavy track record on energy and environmental justice dating back to her time as California's Attorney General. Importantly, Sen. Harris has said that she would end the use of the filibuster in order to pass the Green New Deal,\" Height's team said. Related:As vague as it is, the Green New Deal could have a real impact on Corporate America. Here's why The senator \"notably oscillated\" on health-care policy during the Democratic presidential primary, initially supporting \"Medicare for All\" before \"walking that support back,\" the Height analysts added. \"We do not believe a Harris Vice Presidency meaningfully changes Biden's health care XLV, +0.90%  agenda.\" Now read:Don't buy health-care stocks if Democrats sweep the November elections, these contrarian analysts say Also:What 'Medicare for All' would do to the health-care sector This story was first published on Aug. 12, 2020."}]}