{"article": [{"url": "https://www.marketwatch.com/story/uk-other-european-countries-caution-against-spain-travel-as-virus-rebounds-2020-07-26", "published": 1595765420.0, "headline": "U.K., other European countries caution against Spain travel as virus rebounds", "body": "BARCELONA, Spain (AP) — Nightclubs, bars and beaches — some of Spain’s most beloved summer venues — are facing new lockdown restrictions after turning into coronavirus hot spots, and some European nations are warning citizens not to visit the country. The northeast region of Catalonia now hosts two of the most worrying virus hotspots in Spain, prompting authorities to tighten restrictions in Barcelona and a rural area around Lleida that were relaxed only a month ago when Spain had its devastating outbreak in check. Britain put Spain back on its unsafe list beginning Sunday, announcing hours earlier that travelers arriving in the U.K. from Spain must now quarantine for 14 days. Norway also ordered a 10-day quarantine for those returning from the Iberian Peninsula. France and Belgium are recommending that travelers ditch plans to spend their summer vacations in Barcelona and its nearby beaches, which have seen crowds too massive to allow for social distancing. Police have had to step in and take measures to reduce the number of beach-goers. Travelers were caught off guard by Britain’s move — even U.K. Transport Minister Grant Shapps is reportedly on holiday in Spain. “I think that it is extreme. If you only come for one day, no way,” José González, a Spaniard heading to his home in London, said at Madrid’s airport. “We will have to see what happens next. We will have to respect it and that’s that. You can’t do anything else.” Spain reported over 900 new daily infections on Thursday and Friday as authorities warned that the country which lost at least 28,400 lives before getting its outbreak under control could be facing the start of a second major onslaught. Catalonia ordered all nightlife venues to close for 15 days and applied a midnight curfew on bars in and around Barcelona and Lleida late Friday, hours after French Prime Minister Jean Castex urged French citizens not to visit Catalonia due to the upticks in new infections. France is also struggling to stop a spike in new cases but it apparently sees a risk in importing new infections from Spain. “We know these measures are tough,” said Catalonia public health chief Josep Maria Argimon. “(But) if we see that the growth of contagion is exponential, then the only way to stop it is to limit free movement.” Catalonia’s regional government, run by separatists who had complained about Spain’s centralization of the health crisis from March to June, is struggling to tamp down on the growing clusters that have overwhelmed undermanned contact tracing teams. Tourism employs 2.6 million people in Spain and generates 12% of the country’s economic activity. Spain’s government, unions and industry leaders are heavily invested in promoting the message that Spain is a safe destination for foreigners to salvage the tourism season. That now looks more and more like wishful thinking, meaning the economic blow heading Spain’s way will likely be greater than the deep recession already forecast. Tui, the UK’s biggest tour operator, said Sunday it had cancelled all flights due to depart to Spain. “The season is practically lost now,” Martín Sarrate, president of Catalonia’s association of travel agencies, told Spain’s public broadcaster TVE. “This is an important setback. Who is going to travel to a country if you have to go into a 14-day quarantine?” France is recommending that vacationers cancel bookings in Catalonia but is saying there’s no need yet to shut their shared border. The U.K. and France sent a combined 4.2 million tourists to Spain in August 2019. “We have seen a wave of cancellations above all by foreign clients from France, Germany and England who were supposed to come next week, above all to Barcelona,” David Riba, president of the Federatur tourist apartments group, told Catalan broadcaster TV3. While families and the at-risk elderly in Spain are mostly complying with rules to wear face masks and maintain a 1.5-meter (5-foot) distance from others, teenagers and young adults in many cities have been flouting the health rules.. With Spain’s 19 regional governments back in charge of their health care systems, there’s been a variety of responses to the revival of the virus. But one shared initiative is to stop the rise of cases related to nightclubs and bars, which are supposed to be requiring social distancing and face masks. Many regions have reduced the occupancy of nightclubs and some have ordered them to put tables on the dance floors to discourage dancers from close contact. Recent outbreaks have been linked to a discotheque in the southern city of Cordoba and to bars in Murcia, in the southeast. In Pamplona, authorities have tested 1,000 residents aged 17 to 28 after monitoring an outbreak associated with young people socializing in a neighborhood that has since been put under medical surveillance. Officials in Madrid are considering similar restrictions. Two business associations for nightclubs and bars, however, say they will take the Catalan government to court to block a decision they say puts 35,000 jobs at risk. Despite the worrying trends, authorities tried to send a message of calm. “Spain is a safe country,” Foreign Minister Arancha González Laya said. “Spain has managed to control COVID-19 ... so that the rest of the country can get on with their lives and the economy can continue and tourists can continue to enjoy Spain.”"}]}