{"article": [{"url": "https://www.marketwatch.com/story/trump-suggests-north-carolina-residents-vote-twice-which-is-illegal-2020-09-02", "published": 1599136100.0, "headline": "Trump suggests North Carolina residents vote twice - which is illegal", "body": "President Donald Trump on Wednesday suggested North Carolina residents should try to vote twice - by mail and in person - in the November election, seemingly encouraging them to attempt to commit voter fraud in an effort to test the state's mail-in voting system. Trump made the comment during an interview with WECT News of Wilmington, N.C., when a reporter asked if he's confident in the state's voting system, which could see 600,000 absentee votes cast this fall. \"They will vote, and then they are going to have to check their vote by going to the poll and voting that way because, if it tabulates, then they won't be able to do that,\" Trump said. \"So let them send it in, and let them go vote. And if their system is as good as they say it is, then obviously they won't be able to vote. If it isn't tabulated, they will be able to vote. So that's the way it is, and that's what they should do.\" iframe.twitter-tweet { width: 100% !important; } Voting twice is illegal under both North Carolina and federal law. In North Carolina, it is also illegal \"to induce\" someone else to fraudulently cast a ballot. Trump has been a frequent and vocal critic of mail-in voting, claiming - without evidence - that it is susceptible to fraud. Trump himself has voted by mail a number of times. WECT said the way North Carolina's system is set up, it is \"clerically impossible for a person to vote twice,\" because once the mail-in ballot is received, the voter would not be allowed to cast a vote in person. When asked about Trump's suggestion Wednesday night on CNN, U.S. Attorney General William Barr said Trump was \"trying to make a point,\" but declined to say whether voting twice is illegal (it unequivocally is), telling host Wolf Blitzer \"I don't know what the law in the particular state says.\" iframe.twitter-tweet { width: 100% !important; } Separately, federal prosecutors in North Carolina charged 19 noncitizens with voter fraud Wednesday, accusing them of illegally casting ballots in 2016. Few details were disclosed, but one defendant's attorney told the Associated Press: \"These cases are clearly timed for partisan political purposes.\" Read on:A look at claims made by William Barr on mail-in voting, China and more in his Wolf Blitzer interview on CNN"}]}