{"article": [{"url": "https://www.marketwatch.com/story/wall-streets-road-warriors-have-spent-the-past-three-months-grounded-hows-that-working-out-2020-06-12", "published": 1595060420.0, "headline": "Wall Street's road warriors have spent the past three months grounded. How's that working out?", "body": "It's the well-known, but little-discussed, reality of a life in the financial markets: very little business actually takes place on Wall Street, or anywhere in New York for that matter. Even before coronavirus forced the world into an extended office hiatus, much of the financial services industry has been scattered around North America. Between visits to clients on their turf, conferences and marketing events in far-flung corners, and more, a career \"on The Street\" may just as easily have meant \"on the road.\" MarketWatch checked in with a few high-profile financial road warriors to see how they've handled having to hunker down, their overnight bags gathering dust. We asked what, if any, shifts in the way financial services operate might be here to stay when things get \"back to normal,\" if there is such a thing. These are not stories of hardship. Those interviewed know they're lucky to have jobs they can largely carry out on a laptop from anywhere, plus the luxury of time and money to make the most of this particular crisis. Still, all describe a certain dissonance. It's a strange turn of events when a million-miler has no plans to go anywhere. The conversations that follow have been edited for length and clarity. David Rosenberg, a long-time economist and strategist for wealth managers including Merrill Lynch and Toronto-based Gluskin Sheff, decided to strike out on his own in 2020. Rosenberg Research launched on Jan. 6; two months later, COVID-19 shuttered the global economy. Rosenberg is often known as a \"perma-bear,\" but as MarketWatch has frequently noted, that's not entirely accurate. He's had his bullish moments. Now is not one of them. \"Things aren't going back to normal for a long, long time,\" he said in early June. \"I don't want to burst anybody's bubble, but we're going to be living not just with this situation, but with the consequences for many years. [U.S.] GDP bottomed in 1933, but the Depression didn't end until 1942.\" The latest:U.S. states slowly reopen after coronavirus lockdowns - some now permit visits to nursing homes Rosenberg had expected that his travel schedule would be comparable to his time in previous roles. He was on the road about 25% of the time at Gluskin. As for Merrill, when he commuted back and forth between headquarters in New York and his home in Toronto, he says, \"I had to list my suitcase as an official residence.\" MarketWatch: How often did you used to travel, and what's your best anecdote from your time on the road? David Rosenberg: I'm platinum, gold or silver on five different airlines. One time I was flying from Albuquerque to Denver on a small six-seater jet and they couldn't land the plane. I didn't know what was going on. The guy made the approach at Denver and the next thing I knew he was pulling up. He had to make four attempts. My fingernails are still in that plane. I once sat next to Paul Giamatti going to Montreal when he was filming \"Barney's Version\" in 2008. I said, \"You know, we're both renowned for destroying an industry. You destroyed the merlot industry and I destroyed the asset management industry.\" [Rosenberg was known for predicting the subprime mortgage crisis, which eventually did in his employer, Merrill Lynch.] Economist David Rosenberg and his sons. David Rosenberg MarketWatch: What have you had to get used to during the lockdown? Rosenberg: The part of my job that I love is the social interaction - pressing the flesh - and the thrill of being on stage. That's a big change. The replacement of Zoom ZM, +2.89%  for the real thing, that has been the biggest change. So much of my business is research and writing and you can do that anywhere. But the non-written interactions, that's been the biggest adjustment. I'm managing a team now and we had a nice office in downtown Toronto and I think it's hard on them. It's nice when you're starting a business to be physically present, especially as a leader. There's a lesson to be learned here for policymakers, especially in the U.S. and Canada, that dug their heels in for this whole thing: a stitch in time saves nine. The planning and preparation for this pandemic gets a big fat \"F\". People are so glib about this, they don't realize that in a situation like this, being ahead of the curve by a week makes a difference. I'm sad about the lack of political leadership everywhere. “ 'It's nice when you're starting a business to be physically present, especially as a leader.' ” - David Rosenberg, Rosenberg Research MarketWatch: Is there a silver lining? Rosenberg: I'm home with my youngest son, Mikey, who's 20 and a fourth-year psychology student. He has been my bartender. He makes a mean Manhattan, dark and stormys, whiskey sours, brandy alexanders, margaritas. We've been playing a sh-t ton of Monopoly and they kick my ass. My middle son, Jacob, who's 24, said, \"Dad, I thought you were in finance.\" I said, \"Jacob, this isn't finance, this is real estate.\" But I feel really sad for the young people like my two boys who have had what could have been the best summer of their lives never come to fruition. I'm not wallowing in self pity, I feel sad for the young people. They are having memories robbed. I feel badly for that. The best-selling John Mauldin meets his readers pre-virus. Mauldin Economics John Mauldin has written his popular macroeconomics newsletter, Thoughts from the Frontline, for two decades, and is a best-selling author of several books about investing. His firm, Mauldin Economics, offers research and resources for all kinds of investors, and runs one of the most sought-after annual conferences in the investing world, with attendees ranging from Jeffrey Gundlach to Ian Bremmer. The Strategic Investment Conference was virtual this year, and Mauldin says he was both pleasantly surprised with its success, yet still convinced that nothing beats the real thing. He had recently relocated from Dallas to Puerto Rico, and while beach life has its perks, he misses getting together with a group of financial fellow travelers to try to solve the problems of the world over dinner. Mauldin has kept up a grueling travel schedule since the early 2000s, starting with years of 100,000 miles and expanding from there. MarketWatch: How often did you travel? John Mauldin: American Airlines AAL, +0.34%  called me last week and said, you're now part of this special group, you have 8 million miles. That's their tracking, not mine. But I'm used to traveling a lot. I've had a few years of 250,000 miles a year. I have traveled to 65 countries, (including) 15 in Africa, all 50 U.S. states and most of the Canadian provinces. I have no scheduled plans to get on a plane, which is kind of weird. I'm writing a book and I'm doing a lot of video. We do [our Strategic Investment Conference] every year - last year we had 750 people. This year it was exceptionally large and well-responded-to over a span of 10 days. It was easier to get speakers because they're all locked down, and we couldn't have ever gotten all these people together at a regular conference. But honestly I do miss sitting at meals, being in meetings with friends, and given how much I traveled, that was just a regular part of my life. That I do miss. And I miss my gym. “ 'I once went to Cyprus and had dozens of people come to see me including the minister of finance. I've been doing this for years and I still find that cool.' ” - John Mauldin, Mauldin Economics MarketWatch: What's your best work-travel anecdote? Mauldin: People coming up to you, holding up a book in an airport, saying would you autograph my book, or when you're walking around say, Rome, and people walk up wanting to take pictures. Those are kind of cool moments. You meet people that recognize you because your face is on your newsletter that goes out or they see you on TV. People sitting next to you and they're reading your newsletter and you look over and crack a joke, hey, I like that guy. I miss the dinner conversations, six to eight people in a room and you plow into stuff. I once went to Cyprus and had dozens of people come to see me including the minister of finance. I've been doing this for years and I still find that cool. MarketWatch: Is there a silver lining? Mauldin: The glass half full is more time to research and read. I'm finishing up a book that I've been trying to finish for years. [My wife] Shane and I do get more time together and that's good. We're like every other entrepreneur in the country, you scramble and try to figure out, okay, that was a curveball, what do I do now?\" I've got good partners and good teammates and so far, so good. But man, I've got lots of friends in the restaurant business and I thank God I'm not having to deal with some of the stuff they are. I really feel blessed. MarketWatch: When will you feel comfortable getting back on a plane? Mauldin: I've thought about that a lot. It's not the plane that's the problem. It's the airports and the security lines and everything getting to and from the plane. One of the conclusions is that we think that for a period of time - six months, nine months - everyone should wear a mask, to make everyone else feel safer. We really do need masks to make other people feel comfortable. John Mousseau before the lockdown, and during John Mousseau John Mousseau is president and CEO of Sarasota, Fla.-based Cumberland Advisors, a fee-based investment advisory firm with about $3 billion in assets. Before the lockdown, Mousseau regularly traveled about one-third of the time. From his home in Sarasota to Cumberland's office is about a two-minute drive, and Mousseau says he felt safer creating a \"command center\" for himself in the office, where he was all alone with multiple computer screens, televisions and phones. He's a bit rueful about being stuck at home during Lent, however. \"That's when I try to do something nice for someone every day, you know, just 'Can I give you a hand with that?' That fell by the wayside this year. The sad part is unless you're wearing a mask, that's something you won't do in the new normal. To the extent there was any chivalry at all, it's going to take a big hit.\" MarketWatch: What's it been like being homebound? John Mousseau: There's an upside to this: the solitariness isn't that bad because I spend most of the day on the phone. There's never any isolation. There's been good aspects: you're not out doing entertaining, being entertained, not eating donuts that people bring in. I've been swimming, working out, and while the gym was closed, I would go home and go on a run. I'm down 18 pounds. But I tell you, if I had been working at home, I would have been a Gloomy Gus. I'm sure my marriage would have taken a hit. The sad part is, we've seen domestic violence and child abuse statistics pick up markedly all over. I have learned just how important communication is. In March and early April, since we weren't going anywhere, I was probably doing 10-12 client calls a day, lined up like planes on an airstrip. People wanted to hear from us. What you find out in a panic, you find out a lot from clients who say, \"Oh, I have some money elsewhere,\" so we actually wound up with some accounts that way. MarketWatch: What's your best anecdote? Mousseau: A few months after 9/11, we went to Charlotte. We decided to catch an early flight back to Newark and were on standby. They're calling standby passengers and the gate agent called Mister Moussaoui. [MarketWatch note: Zacarias Moussaoui was arrested in late 2001 and pled guilty to being part of the 9/11 attacks.] Security guards were reaching for guns and people were cowering. As I went up to the desk, the gate attendants parted like the Red Sea. Of course, she took one look at my Irish-looking face and got on the intercom to say, \"I'm sorry, I meant Mousseau.\" That's a true story. I've lived a very Forrest Gump life. “ '...[A] as soon as a client gives me a green light to see them, I will be on a plane. I will be doing that not only because I want to see clients, break bread, and do business the old fashioned way, but because I think I can add value. ' ” - John Mousseau, Cumberland Advisors I think what you get out of this is that the country is probably going to get back to normal faster than people think, even if it's a new normal. All these people out, it tells you the American people have a thirst to be out there and to be with each other. To the extent that's a positive for markets, you're seeing it. There's an attitude on the part of a lot of Americans: damn the torpedoes, let's go. I can't tell you I don't feel the same way. MarketWatch: So what's the new normal, then? Mousseau: I don't expect it will ever go back to the way it was before. You would expect that the first normal you go back to is: people back in the office but not traveling. Step two, people may want to have visits, probably next spring. I will say this: people that say, well, my business model has now permanently changed and I'm going to be doing everything on Zoom and Microsoft Teams MSFT, +2.48%  and my travel and entertainment budget will be one quarter of what it was, I'm not thinking like that. I'm thinking as soon as a client gives me a green light to see them, I will be on a plane. I will be doing that not only because I want to see clients, break bread and do business the old fashioned way, but because I think I can add value. Don't miss:Some tech workers are slowly trickling back to the office now Barry Ritholtz is co-founder, chairman and chief investment office of Ritholtz Wealth Management, a New York-based investment advisory with about $1.3 billion in assets, but he may be better known for his outsized media presence. He was one of the first - and remains perhaps one of the most prolific - financial bloggers, starting \"The Big Picture\" in 2003. He also launched the wildly popular \"Masters in Business\" podcast at Bloomberg News in 2014. Ritholtz also writes regular columns for Bloomberg, tweets frequently, and regularly publishes suggested reading lists on markets, the economy, policy and more. He never spent as much time on long-haul travel as some of the other participants mentioned here - but may have had one of the longest regular commutes from Long Island to mid-town Manhattan. That may change, he's been thinking. And Ritholtz can't help but try to game out the various impacts of the COVID-19 hit: to the way we live, invest and more. MarketWatch: How often did you used to travel? Barry Ritholtz: I speak at a lot of conferences and New York is a terrible place to host a conference so we host them away from New York. I'm not one of those people who was a road warrior but I'm silver medallion on Delta DAL, +0.39%  . “ 'I love the concentration of intellectual capital. There's a reason cities have been the dominant economic engine for the past few hundred years. I'm not in the camp that thinks it's going away, but I do think offices have learned something.' ” - Barry Ritholtz, Ritholtz Wealth Management MarketWatch: What's it been like being stuck at home? Ritholtz: It's me, the wife and two dogs. I have jokingly said there are two types of people in lockdown: those who are having fun with it, and those who have small children. I'm happy that we live in suburbia. I miss going into the office in the city but dear lord, what a delight it is to be surrounded by greenery. If I'm in my office over the garage and my wife is on the other side of the house, we can't even hear each other. We have two big dogs that require a lot of exercise so every day there's a long walk either with them or just us walking. We also get in the car - we have a convertible - and drive for half an hour just to explore new areas. There's definitely cabin fever, but we have settled into a very nice routine. Around 5:30 p.m. I try and wrap up whatever I'm doing work-wise, and we have cocktail hour, we open a nice bottle of wine. And we have been cooking from scratch, stuff you never have time to do. I keep pulling out these gadgets that were wedding gifts or anniversary gifts all these years, I mean, who has time for an air fryer? But bacon and chicken wings in the air fryer are amazing. I am waiting to see which of our favorite restaurants don't make it. Barry Ritholtz doesn't mind this commute one bit. I don't miss fighting my way through TSA, through the airports, whatever. This has helped me discover how inefficient traveling to other places is. If you're going to give a keynote for 45 minutes to an hour, that requires 72-96 hours, not counting prep for the actual presentation... If you're doing a Zoom presentation, it takes less time to prepare than it would normally take me to pack. I do miss getting out to other cities, seeing clients. It's really nice having face time. MarketWatch: What will the new normal look like? Ritholtz: Our office is right on Bryant Park. I had been thinking about getting a second floor. And working from home has kind of made me think, gee maybe I don't need to [expand]. On any given day there's eight to 15 people, and I thought like 15 people were our ceiling. Now I think maybe 20-24 people are our ceiling if [work-from-home arrangements become more permanent, and people stagger their time in the office.] I love the concentration of intellectual capital. There's a reason cities have been the dominant economic engine for the past few hundred years. I'm not in the camp that thinks it's going away, but I do think offices have learned something. Read:Work-from-home productivity pickup has tech CEOs predicting many employees will never come back to the office MarketWatch: What's your best anecdote? Ritholtz: The Masters In Business podcast came about because of a layover. I was watching TV while waiting to make a connection from Vancouver to New York. I remember being infuriated watching an interview with, I think, Bill Ackman. It was the dumbest questions: what's your favorite stock, what's the Fed going to do. On the plane, I bumped into someone I knew and we swapped seats to sit next to each other to talk. I remember saying, I can't believe how dumb that was. This person said, well, what would you ask? I said: what are your favorite books, who are your mentors, if a college grad wanted to go into your field of business, what would your advice be. Maybe it wasn't Ackman. I can't remember. Maybe it was John Paulson. Barron's:How Can Businesses Help Limit the Spread of Coronavirus?"}]}