{"article": [{"url": "https://www.marketwatch.com/story/oil-pulls-back-after-closing-at-5-month-high-2020-08-06", "published": 1596727460.0, "headline": "Oil snaps 4-day winning streak as worries over fuel demand weigh", "body": "Oil futures ended a choppy trading session in negative territory Thursday, snapping a four-day winning streak, as investors weighed a surprising fall in U.S. weekly first-time jobless claims against worries about lackluster fuel demand. West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 lost 24 cents, or 0.6%, to close at $41.95 a barrel on the New York Mercantile Exchange. October Brent crude BRN.1, -0.07% UK:BRNV20, the global benchmark, fell 8 cents, or 0.2%, to settle at $45.09 a barrel on ICE Futures Europe. U.S. Initial jobless claims unexpectedly fell by 249,000 in early August to a still eye-watering 1.19 million, and touched the lowest level since the coronavirus pandemic began more than four months ago. “The U.S. economy seems to be headed in the right direction once again and that should do wonders for crude demand expectations,” said Edward Moya, senior market analyst at Oanda, in a note. “A broad decline in jobless claims should only improve as new virus cases continue to decline and it seems COVID-19 deaths might have peaked.” Meanwhile, Saudi Aramco on Thursday set its official selling price, or OSP, for Europe and Asia at 90 cents a barrel over the Oman/Dubai average, down 30 cents from August, according to Reuters. The reduction came as a relief to traders who had feared the Saudis would make a deeper cut in an effort to gain market share and also to punish countries like Nigeria, Angola and Iraq, who have appeared to pay little heed to OPEC+ production curbs, said Robert Yawger, director of energy trading at Mizuho Securities U.S.A. “The restrained Saudi OSP is a victory for the market bulls,” he said. WTI and Brent on Wednesday broke out of a longstanding trading range. Both posted their highest settlements since early March, but ended off session highs even though the Energy Information Administration said U.S. crude stocks fell by a much larger-than-expected 7.4 million barrels in the week ended July 31, while gasoline inventories unexpectedly rose 419,000 barrels. Distillate supplies increased by a much larger-than-expected 1.6 million barrels. Oil’s gains appear to have been driven by growing hopes Congress and the White House will agree on another round of coronavirus fiscal stimulus, the fall in crude inventories, and the slide in the U.S. dollar, which has traded at more than two-year lows based on the ICE U.S. Dollar Index DXY, -0.58%, said Warren Patterson, head of commodities strategy at ING, in a note. But the message sent by the rise in product inventories could dampen prospects for further gains, he said, noting that distillate stocks are slightly below 180 million barrels, which is more than 42 million barrels above levels seen this time last year. Meanwhile, implied demand for total products fell by 1.18 million barrels over the week. “It is difficult to get overly constructive towards the oil market with demand having stalled and this product overhang,” Patterson said. Natural-gas futures NG.1, +5.17% US:NGU20 fell 2.6 cents, or 1.2%, to end at $2.165 per million British thermal units after the EIA said the amount of natural gas in storage in the week ended July 31 rose by 33 billion cubic feet. Analysts surveyed by S&P Global Platts had looked for an injection of 27 billion cubic feet. September gasoline US:RBU20 rose 0.53 cent, or 0.4%, to settle at $1.2281 a gallon, while September heating oil US:HOU20 gave up 1.32 cents, or 1.1%, closing at $1.2499 a gallon."}]}