{"article": [{"url": "https://www.marketwatch.com/story/heres-washingtons-new-fight-over-the-small-business-coronavirus-bailout-what-to-do-with-leftover-cash-2020-06-10", "published": 1591802540.0, "headline": "Hereâ\u0080\u0099s Washingtonâ\u0080\u0099s new fight over the small-business coronavirus bailout: what to do with leftover cash", "body": "Congress just found more than $100 billion in extra cash in its Paycheck Protection Program and one Republican senator already has an idea how to spend it: fix up businesses damaged by the riots sparked by the killing of George Floyd by Minneapolis police. Sen. John Kennedy, a Louisiana Republican, raised the idea Wednesday with Treasury Secretary Steven Mnuchin at a Senate hearing. Through June 6, the program had 4.53 million loans outstanding, worth $511.4 billion. But the loan limit is capped at $659 billion and the authorization to make new loans expires at the end of this month, making it unlikely the total amount will be needed. â\u0080\u009cIâ\u0080\u0099m going to introduce a bill that I would like you and your very able, and I mean that sincerely, colleagues at the Treasury to look at to take some of that money and make it available to the businesses, mostly small businesses, but to the businesses that have been lost as a result of the burning and the looting and the felony rioting,â\u0080\u009d Kennedy said. â\u0080\u009cI think theyâ\u0080\u0099re going to need help.â\u0080\u009d Also read:Small businesses turn more optimistic, NFIB says, and expect â\u0080\u0098short-livedâ\u0080\u0099 recession. Mnuchin said lawmakers had given Treasury $60 billion more than it had asked for when the PPP authority was replenished in April. â\u0080\u009cSome component of this extra money we did not anticipate weâ\u0080\u0099d be able to put to work, but weâ\u0080\u0099d love to work with you on repurposing it,â\u0080\u009d Mnuchin said. Kennedy said he planned on including a provision in his bill that would require authorities to seek civil damages against looters to help offset the costs of the aid. Sen. Chris Coons, a Delaware Democrat, had his own ideas on what to do with the overage: allow businesses that had paid off one PPP loan to be able to take out another. Since mid-May, PPP lending has basically stalled at a little above $500 billion, as some businesses have repaid their loans, others have returned the money and new applications have stopped coming in. As of May 30, there was $510.2 billion outstanding from 4.48 million loans and May 16 there was $513.3 billion that had been loaned out. Now see:Some Americans who got laid off are going back to work â\u0080\u0094 hereâ\u0080\u0099s which sectors are rehiring. The flatlining of PPP lending has been a surprise, given the initial tranche of $350 billion was exhausted in 13 days, prompting Congress to top up lending authority with another $310 billion. While the loan program is an authorization, meaning thereâ\u0080\u0099s not actually cash that will still be available if the authorization is not renewed, the turnaround was a surprise to lawmakers and others who initially worried another replenishment might be needed eventually. The easing of loan conditions included in a new law signed last week by President Donald Trump may bring the loan numbers up a bit, but probably only marginally. Thomas Wade, director of financial services policy with the conservative American Action Forum, said he was â\u0080\u009cbaffledâ\u0080\u009d by lack of new lending. He said there were three potential reasons: businesses feared potential PR problems, as have been suffered by some publicly traded companies that took and later returned PPP loans; â\u0080\u009cfear and uncertaintyâ\u0080\u009d over terms of the loans that could make debt forgiveness less likely and hope that the businesses could qualify for the Federal Reserveâ\u0080\u0099s â\u0080\u009cMain Streetâ\u0080\u009d loan programs instead. While Wade said he thought it was unlikely demand for the program had been exhausted, a recent survey by the National Federation of Independent Business said a large majority of its members had already taken out loans. The survey, released June 2, said 77% of members surveyed had applied for a PPP loan, and of those, 93% had received their cash. About one-quarter, 24%, of respondents were still in the early stages of their loans, with the programâ\u0080\u0099s original eight-week loan period ending in July. Under the new law, businesses can now take up to 24 weeks to use the money. Also see:Who can get a loan through the Paycheck Protection Program?"}]}