{"article": [{"url": "https://www.marketwatch.com/story/microsofts-nadella-is-making-a-smart-bet-with-tiktok-theres-more-to-gain-than-some-realize-2020-08-07", "published": 1596878720.0, "headline": "Microsoftâ\u0080\u0099s Nadella is making a smart bet with TikTok â\u0080\u0094 thereâ\u0080\u0099s more to gain than some realize", "body": "This summer has been eventful for ByteDance, the owner of the rapidly growing social network TikTok. First, the Indian government banned the application from distribution in the country, due to concerns that the Chinese government might access user data. Then a number of U.S. companies warned employees to remove TikTok from their work phones. Most recently, President Trump threatened to ban TikTok in the U.S. Into this maelstrom has stepped Satya Nadella, the CEO of Microsoft, with an offer to purchase the U.S. business of TikTok. Nadella has earned a reputation as a savvy operator. He has restored Microsoftâ\u0080\u0099s MSFT, +2.48% Â growth with smart bets on business software, and a strong push to move the users of various applications, including the companyâ\u0080\u0099s lucrative Office products, onto the online Office365 version. Nadella has also remade the image of the swaggering giant as a kinder, gentler, more thoughtful company. Microsoftâ\u0080\u0099s purchase of TikTok would be Nadellaâ\u0080\u0099s riskiest bet to date. If the Chinese government does indeed view TikTok as a crucial asset for influencing U.S. political and social discourse, it could attempt to put backdoors into the software and service. Microsoft would need to work hard to extricate them, and they could result in TikTokâ\u0080\u0099s being shut down anyway. Also, with TikTok, Microsoft would enter the politically fraught world of social-content moderation. Microsoft has assiduously avoided political controversy, but TikTok would inevitably force Nadella to enter that arena in one way or another. For example, critics have loudly complained that TikTok censored videos of recent Hong Kong protests, citing that as evidence of Chinese government control. One can imagine similar discontent, due to slights real or perceived, arising among any number of causes, particularly at either extreme of the U.S. political spectrum. TikTokâ\u0080\u0099s price, which may be over $10 billion, has critics warning that Microsoft is about to overpay. That is one of many things that could halt the deal altogether. Valuation; government intervention; and fresh revelations of spying on users are just a few. Yet the logic of the acquisition is clear. TikTok is under threat of closure by the U.S. federal government; itâ\u0080\u0099s hard to imagine that Microsoft will pay its full valuation price. For ByteDance, this may offer a graceful exit from a business that it realizes will only create more problems. So Nadella may be making a smart bet â\u0080\u0094 one with less to lose and more to gain than others realize. Microsoft would increase its market presence by simultaneously acquiring both a social medium and an application popular with the younger crowd. Microsoft has long pined for more of the under-25 group, and TikTok may fulfill that aspiration most clearly and cleanly. Also, TikTok, a kinder, gentler social network than Facebook FB, +0.26% Â and Twitter TWTR, -0.23%, aligns culturally with Microsoftâ\u0080\u0099s carefully groomed image. The platform is designed to encourage discovery and consumption but not to fan the flames of extremism. That does entail algorithmically controlling content more carefully and spreading new content more slowly than Facebook and Twitter care to. To date, however, moderation has been a lesser problem on TikTok than on other platforms and, due to its design and mechanism, is likely to remain so. With TikTok would come a large and growing pool of user-generated video data for training Microsoftâ\u0080\u0099s artificial-intelligence engines. In theory, if Microsoft can continue to grow TikTokâ\u0080\u0099s user base, its advertising benefits to Microsoft may be enormous. Microsoftâ\u0080\u0099s cash flow would benefit by the added diversity of the advertising revenue and potentially of another rapidly growing source: social advertising. To put this into perspective, Amazonâ\u0080\u0099s fastest growing revenue stream of late has been advertising sales on its powerful e-commerce platform. The purchaseâ\u0080\u0099s major benefit to Microsoft and the U.S. public could be the ability of U.S. consumers to continue to use an innovative platform for free expression and creativity after rescuing it from the quicksand of politics. Yes, we must remain vigilant in limiting government spying (which â\u0080\u0094 letâ\u0080\u0099s be honest â\u0080\u0094 both sides engage in) and restrictive business practices (in which, yes, China is clearly the worst offender); but ultimately the potential of such a technology as TikTok is to soar above partisanship and divisiveness to let people connect and create. Certainly social networks have created their fair share of problems for society, and TikTok is not a perfect vessel; people will find ways to abuse its potential. For now, however, Microsoftâ\u0080\u0099s purchase of TikTok would, in a rare win-win in the world, benefit Microsoft, TikTokâ\u0080\u0099s users, and society. Vivek Wadhwa is a distinguished fellow at Harvard Law School. Alex Salkever is a consultant on product marketing. Their next book, â\u0080\u009cFrom Incremental to Exponential: How Large Companies Can See the Future and Rethink Innovation,â\u0080\u009d will be released in September."}]}