{"article": [{"url": "https://www.marketwatch.com/story/oil-pulls-back-but-on-track-for-big-weekly-gains-2020-09-18", "published": 1600442540.0, "headline": "Oil futures log biggest weekly gain since June", "body": "Oil futures split paths for the session on Friday, with U.S. prices up modestly and global prices slightly lower but both benchmarks logging their biggest weekly gain since June after major oil producers pledged their full commitment to output cuts. “So much for the OPEC+ JMMC being a ‘non-event’,” said Stephen Innes, global chief market strategist at AxiCorp. “A commitment to continued compliance/catch-up with quotas and pressure from Saudi concerning the need to comply appeared to strike a favorable chord with the market.” Read:OPEC+ committee’s power of words helps to lift oil prices The Organization of the Petroleum Exporting Countries and their allies, collectively known as OPEC+, held a Joint Ministerial Monitoring Committee meeting Thursday, extending the period during which countries that failed to limit production adequately in earlier months can make compensatory reductions. OPEC+ in August relaxed earlier output curbs to 7.7 million barrels per day in August, from a record 9.7 million barrels. “If these additional cuts are implemented, the feared production surplus on the oil market could be avoided and stocks reduced considerably,” said Eugen Weinberg, analyst at Commerzbank, in a note. During the meeting, Saudi Arabia’s energy minister, Prince Abdulaziz bin Salman stressed the need for all countries to stick to their production ceilings. Abdulaziz also had a warning for traders betting on a fall in crude prices. “Make my day,” he said in a news conference, according to news reports. West Texas Intermediate crude for October delivery CL.1, -1.62% US:CLV20 tacked on 14 cents, or 0.3%, to settle at $41.11 a barrel on the New York Mercantile Exchange. However, November Brent crude BRN.1, -0.07% BRN00, -0.07%, the global benchmark, lost 15 cents, or nearly 0.4% at $43.15 a barrel on ICE Futures Europe. For the week, WTI was up 10.1%, which marked the largest weekly rise for a front-month contract since the week ended June 5, according to Dow Jones Market Data. Brent added 8.3%, the strongest such rise since the week ended June 19. Prices for the U.S. benchmark ended below the session’s highs and spent some time during Friday’s session moving lower after Aljazeera reported that Libyan commander Khalifa Haftar announced a conditional lifting of a months-long blockage of oilfields and ports by the Libyan National Army. That fed expectations for higher global crude supplies. News reports on Monday had said that Haftar planned to halt the blockade. Energy traders will wait to see if Haftar’s confirmation to lift block on oil exports will be accepted by the country’s national oil company, said Edward Moya, senior market analyst at Oanda. “It seems unlikely that Libya will quickly be back to producing 1.1 million barrels per day. Meanwhile, Analysts noted that current oil-price levels are putting a strain on public finances for a number of major producers. “If prices move markedly lower, we think the sovereign producers would step in to safeguard their domestic finances. Current prices remain well below the fiscal break-even levels of the vast majority of OPEC+ producers and another extended stay in the $30s/barrel could imperil the political stability of several key petrostates,” said Helima Croft, head of global commodity strategy at RBC Capital Markets, in a note. She expects OPEC+, at a minimum, to put a hold on plans to reduce the cut to 5.8 million barrels a day, which would effectively put an additional 2 million barrels a day on the market, when the entire group meets again in December. “It will be worth watching whether the additional Saudi export volumes (which will be coming as domestic demand eases) put too much strain on the market and trigger an early adjustment, especially if the compliance challenged countries fail to make headway on compensatory cuts,” she said. In a note dated Thursday, analysts at Goldman Sachs said oil prices are rebounding, after having erased all of their summer gains in the first week of September, in part due to a slowdown in Chinese imports. Read:How a big decline in China’s oil imports may ‘test the resiliency of the market’ Still, “the announcement by Chinese policymakers last week that they would aim to replenish commodity inventories in 2021 is a new bullish catalyst,” they said, reiterating their year-end Brent forecast of $49. Back on Nymex, petroleum products saw mixed trading, with October gasoline up 1% at $1.2366 a gallon and October heating oil down nearly 0.1% at $1.159 a gallon. Gasoline futures marked a weekly rise of 12,9%, but heating oil was up by a more modest 6.4%. Natural-gas futures, meanwhile, ended with a modest gain Friday, after a 9.9% loss Thursday when U.S. government data revealed a larger than expected weekly rise in domestic supplies of the fuel. October natural gas US:NGV20 added 0.3% at $2.048 per million British thermal units. For the week, prices were down 9.7%. On Thursday, the National Oceanic and Atmospheric Administration released an update to their three-month temperature outlook, “which now predicts above-normal temperatures for the months of October, November, and December,” said Christin Redmond, commodity analyst at Schneider Electric, in a daily note. “It is the first indication of a possible mild winter, which would be bearish for natural gas prices.” Also see:Why soybeans may be headed for their highest price in 6 years"}]}