{"article": [{"url": "https://www.marketwatch.com/story/investing-legend-burton-malkiel-on-day-trading-millennials-the-end-of-the-6040-portfolio-and-more-2020-06-22", "published": 1594825160.0, "headline": "Investing legend Burton Malkiel on day-trading millennials, the end of the 60/40 portfolio and more", "body": "There aren’t many books about investing that remain relevant over 40 years after they were first published. Burton Malkiel’s A Random Walk Down Wall Street, first published in 1973 and now in its twelfth edition, is one. Malkiel’s observation — that short-term fluctuations in the markets make stocks unpredictable and that it’s thus usually wiser for individual investors to put most of their money in broad index funds — helped spark the decades-long boom in passive investing. With the coronavirus pandemic buffeting markets, Malkiel, who also serves as chief investment officer at robo-advisor Wealthfront, spoke with MarketWatch about a few of the big recent phenomena: the effects of the Federal Reserve’s massive stimulus, whether this time is different for the oft-anticipated “death of passive” investing and his thoughts on the rise of day-trading millennials. The interview below has been edited for clarity. MarketWatch: You’re most famous for writing A Random Walk Down Wall Street, in which you argue that investors are generally better off as buy-and-hold investors rather than trying to chase particular strategies or make short-term moves. How do you feel about seeing investors, mostly younger people, turning to speculative trading to replace other forms of entertainment during the coronavirus lockdowns? Malkiel: I believe that for many of these people, it is a substitute for sports gambling. You know, in a way I am sympathetic. I don’t think there is anybody who devotes a life to studying and working on the stock market who doesn’t have something of a gambling instinct. I am the first to admit that I have gone to the horse races, I have sat at the tables at Las Vegas and Atlantic City, so I do not think there is anything wrong with gambling for entertainment. The problem that I see is that this is the diametric opposite to investing. For me, investing means buy and hold, as you said. The thesis of Random Walk was that you are much better off not buying individual stocks, but buying an index fund. To go and day trade and think that you are investing, that’s what I think is absolutely wrong and is likely to be simply disastrous for people. All the evidence is that day traders in general lose money. It’s not that they can’t make money in gambling, I’ve actually won from time to time. But over the long run, this is a losing proposition. MarketWatch: There’s an idea out there that the big giants that helped popularize index investing — Vanguard, BlackRock, and State Street Global Advisors — are starting to have perhaps too much power, too much control over the market because of the sheer scale of the assets they hold. This has implications for how they will dominate voting shares of publicly-traded companies, for example. How do you think about that? Malkiel: One of the arguments is that they’ve got too much control, that they’re going to ruin the market and the market won’t be efficient anymore because unlike active managers that will go and do research on individual companies, index funds just buy everything, and they’re going to put more money into the companies with the biggest capitalization, so the money is going to go into Apple AAPL, +1.74% and Microsoft MSFT, +2.48% , irrespective of whether those are good companies, and that screws up capital allocation. That one is dead wrong. It’s dead wrong because even though in the mutual fund business, index funds are about half the total, there are plenty of active mangers, hedge funds [and] private equity buying individual stocks. Indexing is not affecting valuations in the market. If there’s too much money going into Apple and Microsoft and some of the neglected stocks are really too cheap, believe me, money is going to go into those. There will always be people who think they can beat the market. This is a very well-paid business. People will say, buy our actively-managed fund or our hedge fund because we’re going to root out the real values. Indexing could be a lot larger and the market would still function just fine. It is the case that there is no question that the index funds have enormous influence in voting. The three that you mentioned actually hold a significant amount of voting power on particular companies. I think one is correct to raise the issue of control. They are voting on things like compensation and whether to support management. They are looking at performance, but it’s relative performance. It’s whether United is doing better than Delta, it’s not that United is doing well. What that does is it puts a lot of responsibility on the index fund managers to vote their shares wisely and in a manner that’s helpful to the stockholders. In some sense, they need to put a greater effort into voting because if you’re an active manager and you don’t like what they’re doing, you just sell. The index manager can’t just sell. He has a greater incentive to monitor excessive compensation. I think there’s probably a reasonable argument that they, at least in the past, had not put the effort into voting that perhaps they should have. I think they do understand now what the responsibility is. Can they do an even better job? I think probably yes. Related:‘Hippocratic oath’ for financial advisers? The SEC’s new ‘Regulation Best Interest’ gets mixed reviews. MarketWatch: What do you think about the idea that the pandemic has caused so much disruption so quickly that this is going to be the moment when active managers really prove their worth and active management comes back into vogue? Malkiel: I always love that argument. It’s dead wrong. At the beginning of each year when you read the market commentary you always see, this is the year for active management. With the pandemic, this is now the time for active management. We’ve got very good data on this: every year Standard & Poor’s publishes a SPIVA report (S&P Indices Versus Active) and every year it actually comes out that more and more active managers are beaten by the index. Every year it’s about two-thirds to 70% of active managers get beaten. Those that win in one year aren’t the same ones that win the next year. There is no evidence that some years are going to be active years. There’s no evidence whatsoever that because of COVID-19 it’s time for active management. Related:More evidence that passive fund management beats active MarketWatch: How do you think about the presence of the Federal Reserve in the financial markets right now? Is the Fed’s massive intervention since the pandemic skewing the normal patterns of risk and reward? Malkiel: I don’t think there’s any question about that. A lot of people write about the disconnect between the real economy and the stock market because the stock market’s been going up and the real economy has been cratering. The answer is that the activities of not only the Federal Reserve but the European Central Bank, the Bank of Japan, they have been putting trillions of dollars of stimulus into the economy. There’s a significant amount of worldwide high-quality debt that sells at negative interest rates. Rates aren’t negative in the U.S. but the 10-year Treasury TMUBMUSD10Y, 0.777% has been stuck at [about 60-70 basis points.] Stocks don’t exist in a vacuum and that means that the stock market is going to be higher than it otherwise would be. Over the long haul, stocks have returned 10% and bonds produced 5% a year. Let’s say that’s the right risk premium. That will mean that if interest rates are zero, stock returns will be 5%. Future returns are going to be much lower. In terms of whether this is the right policy, I think given the unusual nature of this recession or, if you want to call it a depression, I don’t think the Federal Reserve had a choice. To prevent our economies from total collapse as the shutdown occurred, this was absolutely necessary to prevent even more suffering than we’re having now. But sure, it had a massive effect. MarketWatch: That’s a good segue into talking about bond yields and inflation. We knew we were in a lower-for-longer regime after the 2008 financial crisis. Are we in a lower-forever situation now? Malkiel: That’s going to be a very interesting question. Will it be possible, once we’re on the other side of the pandemic, to reverse course? The Federal Reserve was unwinding some of their balance sheet from after the 2008-2009 crisis very, very slowly and hadn’t done much before they had to stop. The question would be, after COVID-19, when we get a return to some kind of normal economic conditions, will they be able to reverse quickly enough? And is there a possibility with this massive amount of liquidity swishing around the world that our long period of benign inflation or even deflationary tendencies, like in Japan, whether that might be over. I don’t think any of us know the answer, but I would say that right now if you’re an investor looking at the long run and you all hear is ‘inflation is dead, there’s not going to be inflation ever again,’ I would be skeptical about that. With the amount of liquidity sloshing around the world, I think it’s certainly possible that we will get some inflationary pressures, certainly not in 2020 or 2021 and probably not in 2022, but I am not one who would argue we never have to argue about inflation again, it’s dead forever. MarketWatch: Alternately, that could be a sign we’re in a liquidity trap. Malkiel: We probably are in a liquidity trap. That’s Larry Summers’ argument, that the world is basically oversaving. That certainly has been the right model for today and is probably the right model for some time. But to say that is going to be the regime forever is more of a stretch. Remember that while there’s no question we have an excess of savings, we’ve just had $3 trillion of stimulus, and we’re talking about, you look at the headlines, another $1 trillion-2 trillion. Just remember that is dis-saving. The fiscal authorities are certainly doing their best to counteract the excessive savings. While that is absolutely what’s characterizing the world today, on the other side of this, if we start getting inflationary pressures, people can start spending quite quickly. I’m old enough to remember when we were worried about inflation. We ought to be very circumspect because we economists do a terrible job of predicting the economy over the long run. We can definitely get a regime change. MarketWatch: What does that mean for the traditional 60/40 portfolio of stocks and bonds? Malkiel: I don’t think there ought to be a 60/40 portfolio. I think there ought to be a broad diversification. What I have recommended in the new edition of my book is, maybe for retired people, the bond allocation might be a lot less. Not that you don’t need some safe assets or some income-producing assets, but there may be a better way to get them than through bonds. Basically, safe bonds now do not provide income and in the long run may have some real risk, because if we do get some inflation in the future, yields will rise and their prices will go down. What can you do? Let me suggest a couple of strategies that I talk about in the book. One is preferred stock. You can buy a very good quality preferred stock, say, in a company like JPMorgan Chase JPM, -0.57% or AT&T T, -1.01% . You’ll get a return of 5% and under current tax laws, the tax is less than the tax on bond interest (because of the dividend credit.) You can buy a preferred stock ETF and get a 5.5% dividend return. You could even think about buying high quality dividend-producing (common) stocks. Let’s say IBM IBM, -2.81% . It’s very well covered by cash flow, dividend yield is about 5.5%. Verizon VZ, +0.23% is 5%. The company had been in trouble but is coming back. MarketWatch: How have you been keeping busy during the lockdown? Malkiel: I’m writing a few things. I’m still on some boards. I’ve gotten very familiar with Zooming ZM, +2.89% . I’m actually watching more streaming movies on HBO or Turner Classic Movies. You get a chance to see “Casablanca” again that you haven’t seen since you were a kid. Related:Wall Street’s road warriors have spent the past three months grounded. How’s that working out?"}]}