{"article": [{"url": "https://www.marketwatch.com/story/ohio-republicans-say-theyre-seeing-suburban-support-for-trump-in-sharp-decline-statewide-2020-09-22", "published": 1600745000.0, "headline": "Ohio Republicans say theyâ\u0080\u0099re seeing suburban support for Trump in sharp decline statewide", "body": "COLUMBUS, Ohio (AP) â\u0080\u0094 Peggy Lehner, a Republican state senator in Ohio, doesnâ\u0080\u0099t sugarcoat what she has seen happen to support for President Donald Trump in her suburban Dayton district. â\u0080\u009cIt hasnâ\u0080\u0099t ebbed. Itâ\u0080\u0099s crashed,â\u0080\u009d said Lehner, who is not seeking re-election in the district of working-class and white-collar communities the president won comfortably four years ago. â\u0080\u009cHe is really doing poorly among independents.â\u0080\u009d Trumpâ\u0080\u0099s chances for a second term rest heavily on being able to maintain the margins he won by in 2016, particularly in suburban areas. He plans to campaign outside Toledo on Monday, as liberal Supreme Court Justice Ruth Bader Ginsburgâ\u0080\u0099s death stokes questions of whether the sudden court vacancy would energize more suburban voters who support abortion rights or social conservatives in small-town and rural areas who oppose them. Republican lawmakers and strategists in Ohio say they are seeing research that shows a near-uniform drop in support from his 2016 totals across every suburban region of the state. See:Ohio judge says Republican secretary of state acted arbitrarily and unreasonably in limiting ballot drop boxes to one per county They say that Trump, who won Ohio by eight percentage points in 2016, maintains a yawning advantage in more rural areas and small towns. Still, Republicans are concerned that if he is losing badly in suburban areas in Ohio, it is a signal that Trumpâ\u0080\u0099s hold on other states in the industrial heartland that delivered him the presidency may be in peril. â\u0080\u009cThe million-dollar question becomes, how does that translate in Wisconsin, Michigan and Pennsylvania?â\u0080\u009d said Corry Bliss, a Republican strategist who managed Ohio Sen. Rob Portmanâ\u0080\u0099s 2016 reelection campaign. â\u0080\u009cIt translates into probably not a very good night.â\u0080\u009d Ohio has long been a bellwether. No Republican has won the White House without carrying the state since the advent of the modern two-party system, and no Democrat has since 1960. Trump is faring worse than four years ago in communities in essentially all suburban areas around Ohio, from its major cities to its several midsize metro areas, more than a half-dozen Republican operatives tracking races across Ohio say. Trump has slipped in suburbs to the east and west of Cleveland, where he narrowly edged Democratic nominee Hillary Clinton in 2016, they say. In the blue-collar suburbs of Youngstown, where Trump won by double digits, the same appears to be true. In affluent suburbs, such as Dublin northwest of Columbus, 2012 GOP nominee Mitt Romney won by almost 20 percentage points. Four years later, Trump narrowly lost to Clinton. Less than two months before the 2020 election, Republicans were concerned about signs the trend in Dublin has continued, according to several GOP operatives following legislative and congressional races. There is debate among state Republican strategists about how many new voters there are left to lift Trump in rural and small town Ohio. Former Ohio Republican Party Chairman Kevin DeWine, a second-cousin to Gov. Mike DeWine, said, â\u0080\u009cI just donâ\u0080\u0099t see him getting more votes.â\u0080\u009d But veteran Ohio GOP strategist Doug Preisse countered, saying, â\u0080\u009cI perceive a commensurate intensification in the support for Trump in small towns.â\u0080\u009d There is less debate in other states. Pennsylvania Republicans say across the longtime GOP stronghold of Chester County west of Philadelphia, for instance, Trump has slipped as far as he has in Ohioâ\u0080\u0099s suburbs, though in more populous towns and in a state he carried by fewer than 45,000 votes. Former Pennsylvania Rep. Ryan Costello, a Republican, said that the suburban electorate is rapidly diversifying in ways that hurt Trump, especially among young families and among those concerned about the coronavirus. â\u0080\u009cI think Trump has proved to be the accelerant,â\u0080\u009d said Costello. Hillary Clinton carried Chester County by almost 10 percentage points, the first Democrat to win there since Lyndon Johnson in 1964. Chester is also steadily growing, with a population of about 525,000, the fourth largest in the state. â\u0080\u009cI think that there is a higher likelihood at this moment in time that Trump performs worse in the suburbs,â\u0080\u009d Costello said. â\u0080\u009cItâ\u0080\u0099s his tone. Itâ\u0080\u0099s the chaos. Perhaps a combination. But certainly the pandemic, the mismanagement of the pandemic.â\u0080\u009d But there are other more nuanced suburban concerns for Trump in Pennsylvania. Just west of the state capital, Harrisburg, Cumberland Countyâ\u0080\u0099s rapid development is diversifying the Capital Cityâ\u0080\u0099s longtime Republican-leaning suburbs. The combination of growth and declining support for Trump generally across suburbs has hurt the president in south-central Pennsylvaniaâ\u0080\u0099s competitive 10th Congressional District, where Trump won by nine percentage points in 2016, said Terry Madonna, director of the Center for Politics and Public Affairs at Franklin and Marshall College in Lancaster, Pa. A central question is whether Trump can, as his campaign predicts, spur even more support than in 2016 from rural voters in Pennsylvania, Michigan and Wisconsin. â\u0080\u009cTrump is leading in these areas but nowhere near by the percentage he won them by in 2016,â\u0080\u009d said Madonna, who has conducted polls in the state for more than three decades. Republicans have similar concerns about suburbs in Michigan, notably in Oakland County, Detroitâ\u0080\u0099s more upscale northwestern neighbor and Michiganâ\u0080\u0099s second-most populous county. Democrats have consistently carried it, though Republican George W. Bush came very close in 2000 and 2004, while Mitt Romney was competitive in 2012. Trump did worse there than any Republican in the past 20 years, with the exception of John McCain in 2008. But Trump appears less concerned about shoring up those losses, and is instead mining rural, small-town and working-class regions in all three states for more of the white conservative base that propelled him to office. Trump campaigned near Bay City, Mich., last week, a struggling former automotive manufacturing city on Lake Huron where he won in 2016, after Obama had carried Bay County twice. Likewise, Trump has lost support in the populous suburbs of southeast Wisconsin since 2016, according to the Marquette University Law School poll. And instead, he has been campaigning in blue-collar Oshkosh and the Wausau area, far north of the traditional Republican epicenter encircling Milwaukee. Wisconsin Republicans promoting legislative candidates in typically GOP-leaning suburbs of Ozaukee County north of Milwaukee and Waukesha County to the cityâ\u0080\u0099s west warned this month that â\u0080\u009cRepublicans should be worried because President Donald Trump is currently under-performing in the districts,â\u0080\u009d according to GOP website rightwisconsin.com. â\u0080\u009cItâ\u0080\u0099s a combination of blunting the departures in the suburbs and juicing the rural areas,â\u0080\u009d said John Selleck, who ran Romneyâ\u0080\u0099s 2012 Michigan campaign. â\u0080\u009cBut can he make up the lost suburban votes elsewhere?â\u0080\u009d That was his formula for winning Ohio four years ago. He received the highest or second-highest percent of Republican votes of any candidate since 1980 in 60 of Ohioâ\u0080\u0099s 88 counties, according to state voting data compiled by Mike Dawson, a public policy consultant and creator of ohioelectionresults.com. While GOP strategists say Trump can make up the suburban losses with new voters, Marquetteâ\u0080\u0099s polling director, Charles Franklin, sees no evidence in research tracking Trumpâ\u0080\u0099s support this year to suggest new voters are choosing him. â\u0080\u009cHe definitely needs to ramp it up and deliver on what the campaign is talking about, big increases of turnout of Trump voters in regions other than the suburbs,â\u0080\u009d Franklin said. â\u0080\u009cItâ\u0080\u0099s not in the polling now.â\u0080\u009d Read on: Big Ten reverses field and will play football this fall after all"}]}