{"article": [{"url": "https://www.marketwatch.com/story/3-ways-the-tax-code-amplifies-the-black-white-wealth-gap-2020-06-12", "published": 1592560940.0, "headline": "3 ways the tax code â\u0080\u0098amplifiesâ\u0080\u0099 the racial wealth gap", "body": "National protests after George Floydâ\u0080\u0099s videotaped killing in police custody are spotlighting disparities between the experiences of black Americans and white Americans that go beyond their treatment by law enforcement. Black people, who are twice as likely to be hospitalized for COVID-19, face especially unstable housing and job prospects. Black business owners can face an uphill battle securing financing and startup capital. Black taxpayers also face tax rules that, some observers say, keep the gap between black and white wealth wide. Median wealth for a black family is $17,000 and itâ\u0080\u0099s $171,000 for a white family, according to one estimate. Itâ\u0080\u0099s a matter of what gets taxed, at what rate, and â\u0080\u0094 equally important â\u0080\u0094 what doesnâ\u0080\u0099t get taxed, they note. “ â\u0080\u0098The tax code amplifies those disproportionate gaps that already exist, based on the way our economy works and the way our society treats African Americans.â\u0080\u0099 ” â\u0080\u0094 Wilton Hyman, a professor at New England Law Boston â\u0080\u009cThe tax code amplifies those disproportionate gaps that already exist, based on the way our economy works and the way our society treats African Americans,â\u0080\u009d said Wilton Hyman, a professor at New England Law Boston whoâ\u0080\u0099s studied the tax codeâ\u0080\u0099s uneven effects. Including federal and state taxes, the tax code likely â\u0080\u009cworsensâ\u0080\u009d the wealth gap, said Kim Rueben, senior fellow at the Tax Policy Center. Local taxes tend to be flatter, eating up more money from lower-earning households as a proportion of their income, she noted. Disparities are less clear when focusing on the federal code, she said. Higher earners pay higher income rates â\u0080\u0094 but they also have access to â\u0080\u009cspecial aspects of the tax code.â\u0080\u009d That includes the rules surrounding capital gains and inheritances, she noted. “ â\u0080\u0098For people starting with less assets, which on average Black and Hispanic households are, it is harder to access these benefit in the tax code.â\u0080\u0099 ” â\u0080\u0094 Kim Rueben, Tax Policy Center senior fellow â\u0080\u009cFor people starting with less assets, which on average black and Hispanic households are, it is harder to access these benefits in the tax code,â\u0080\u009d Rueben said. â\u0080\u009cThereâ\u0080\u0099s nothing in the way the federal income tax is written thatâ\u0080\u0099s explicit about race. But because of the demographics and characteristics of different taxpayers, it can have different effects,â\u0080\u009d she later added. Some critics say it might also have to do with the demographics of the tax codeâ\u0080\u0099s authors, who have traditionally been wealthy white men. This might explain various blind spots, like a double standard where plaintiffs in sexual-harassment settlements, who are typically women, can have their settlement money taxed, but not people getting workerâ\u0080\u0099s compensation money for workplace injuries, who tend to be men. Capital gains taxes are a good deal for people who invest in the stock market Ordinary income, like a wage, is taxed between 10% and 37% depending on the amount. Capital gains, such as stock sale proceeds, are taxed between 0% and 20% (with some exceptions). The lower rates are good deal for those playing the markets, and white investors are more common than black investors. Overall, 55% of Americans own stocks, according to a Gallup poll conducted in March and April. “ 64% of whites in one poll said they owned stock, compared to 42% of black poll participants. ” But 64% of white participants said they owned stock, compared to 42% of black and 28% of Hispanic poll participants. Income is taxed as you make it, but capital gains taxes kick in at the sale. That gives stock owners extra flexibility to sell when itâ\u0080\u0099s to their advantage or buy and hold for the next generation, Rueben said. Estate tax laws tend to favor white families Americans are poised to inherit almost $765 billion in 2020, according to one New York University Law School professorâ\u0080\u0099s estimate. But white families will benefit more, in terms of inheritance size and the tax laws surrounding them. White households have twice the chance of getting an inheritance compared to black families, Lily Batchelder, the NYU professor, wrote. A white householdâ\u0080\u0099s inheritance leads to a $104,000 increase in median wealth compared to $4,000 rise for black counterparts, she added. “ Estate tax exemptions were raised temporarily under the 2017 tax law changes. ” The Tax Cuts and Jobs Act of 2017 temporarily raised the threshold when estate taxes kick in, going from $5.49 million in 2017 to $11.1 million in 2018. The higher levels, adjusted for inflation, end in 2025. The higher thresholds are a blow to minority taxpayers who could benefit from that missed-out tax revenue, said David Newville, vice president of policy and research at Prosperity Now, a nonprofit promoting financial security in minority communities. Donâ\u0080\u0099t miss: This is how much American workers saved during the first year after Trump tax overhaul That money could underwrite government programs or fund expanded credits that do help low- and moderate-income taxpayers. â\u0080\u009cThe estate tax is not technically a wealth tax,â\u0080\u009d but it could function as one, he said. The super-wealthy are very aware of estate laws. More than 40% of billionaires over age 65 moved out of states with laws taxing inheritance, one study showed. In its current form, the federal estate tax law is â\u0080\u009crendered almost useless except for a handful of estates,â\u0080\u009d Newville said. Thereâ\u0080\u0099s a link between estate tax and rising inequality, he said. Federal estate taxes and related taxes are projected to raise $16 billion this year, Batchelder wrote. Thatâ\u0080\u0099s an effective tax rate of 2%, according to her calculations. People who claim the Earned Income Tax Credit are more likely to get audited This credit helps low- and moderate-income households. This tax year, the maximum credit ranges from $529 for a taxpayer with no qualifying children to $6,557 for those with three or more. The 45-year-old credit has been hailed by researchers as a powerful anti-poverty measure. In 2018, the earned income tax credit (EITC), combined with the child tax credit, kept 8.9 million people out of poverty, according to the U.S. Census Bureau. Black and Latinx taxpayers combined are 40% of all those who are eligible for the credit, according to the Brookings Institution. The IRS gives a closer look at returns claiming the EITC. In fiscal year 2018, the IRS audited 1.1 million returns. Thatâ\u0080\u0099s less than one percent (0.6%) of the total number of returns, according to the Tax Policy Center. But 1.4% of returns with an earned income tax credit were set aside for review, the think tank noted, citing IRS data. Thatâ\u0080\u0099s slightly down from the EITC audit rate of 1.7% in fiscal year 2015 but it still outpaced the 0.8% audit rate overall that year. “ â\u0080\u0098We are not necessarily maximizing the amount of money we get with current federal audit priorities and that means you end up having more black and brown households getting audited than what you would expect.â\u0080\u0099 ” â\u0080\u0094 Kim Rueben â\u0080\u009cWe are not necessarily maximizing the amount of money we get with current federal audit priorities and that means you end up having more black and brown households getting audited than what you would expect,â\u0080\u009d said Rueben. While EITC audit rates are roughly steady, audit rates for high earners have been slipping. For example, 8.4% of returns making between $1 million and $5 million were audited in fiscal year 2015, according to IRS data. Three years later, the audit rate for the same group was 2.2%. Last month, a Treasury Department watchdog said the IRS, between 2014 and 2016 didnâ\u0080\u0099t dig into approximately 370,000 cases from high-net worth non-filers. They owed almost $25 billion dollars in estimated taxes, according to the Treasury Inspector General for Tax Administration. In a reply to the report, the IRS noted itâ\u0080\u0099s lost roughly a one-third of its enforcement staff since fiscal year 2010. But since 2018, itâ\u0080\u0099s put more resources on the non-filer issue and has been recouping more money."}]}