{"article": [{"url": "https://www.marketwatch.com/story/fauci-warns-that-covid-19-vaccine-protection-may-be-finite-2020-07-07", "published": 1594098440.0, "headline": "Fauci warns that COVID-19 vaccine protection may be â\u0080\u0098finiteâ\u0080\u0099", "body": "What the world desperately wants and needs is a COVID-19 vaccine, but it may not be the home run that everyone is hoping for. That is according to Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, who was asked how long a person would be shielded from the virus via a vaccine. “ â\u0080\u009cItâ\u0080\u0099s not going to be like a measles vaccine.â\u0080\u009d ” â\u0080\u0094 Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases â\u0080\u009cWe do not know the answer to that,â\u0080\u009d Fauci said on a live-streamed videoconference hosted by the Dr. Francis Collins, director of National Institutes of Health. â\u0080\u009cYou can assume, that youâ\u0080\u0099re going to get protection at least to take us at least through this cycle.â\u0080\u009d â\u0080\u009cWhen you look at natural infection itâ\u0080\u0099s anywhere from six months to a year. However, with this spike protein thatâ\u0080\u0099s being presented in the way that we do it, with primes and in some cases boosts, weâ\u0080\u0099re going to assume that thereâ\u0080\u0099s a degree of protection, but we have to assume that itâ\u0080\u0099s going to be finite,â\u0080\u009d said Fauci. â\u0080\u009cItâ\u0080\u0099s not going to be like a measles vaccine. So thereâ\u0080\u0099s going to be follow-up in those cases to see if we might need a boost. We might need a boost to continue the protection, but right now we do not know how long it lasts,â\u0080\u009d he said. Vaccinations for measles, mumps, rubella, chicken pox, human papillomavirus and even influenza all require boosters to remain effective. Several drugmakers are currently developing COVID-19 vaccine candidates including AstraZeneca AZN, +1.16% Â and the University of Oxford, Inovio Pharmaceuticals INO, -1.36% Â and Moderna MRNA, +0.09%. The pandemic has claimed 538,190 lives and infected 11,626,759, with the U.S. in the grips of fresh outbreaks that have set records in several states over recent days. An eventual return to economic normalcy largely hinges on vaccines that can prevent infections from the coronavirus. â\u0080\u009cThere is no guarantee...that we will have a safe and effective vaccine, but we are cautiously optimistic,â\u0080\u009d Fauci testified during a Senate hearing last month. Read:Hereâ\u0080\u0099s one â\u0080\u0098remarkableâ\u0080\u0099 difference between COVID-19 and the 1918 Spanish flu"}]}