{"article": [{"url": "https://www.marketwatch.com/story/us-services-and-manufacturing-pmis-both-hit-4-month-highs-in-june-2020-06-23", "published": 1592911340.0, "headline": "U.S. economic downturn losing steam, flash PMI data show", "body": "The numbers: The flash U.S. service sector purchasing managers index rose to a 4-month high of 46.7 in June from 37.5 in the previous month, IHS Markit said Tuesday. The flash manufacturing sector purchasing managers index rose to a 4-month high of 49.6 from 39.8 in May. Though an improvement, the readings remain slightly below 50 which indicates worsening conditions. The flash estimate is typically based on approximately 85%-90% of total survey responses each month. The composite index rose to 46.8 in June from 37 in the prior month. What happened: U.S. firms reported a slower contraction in June as businesses began to reopen on a larger scale after the lockdowns imposed to combat the coronavirus pandemic. Still some businesses reported that renewals and requests for new business were muted. There were further cuts in workforce numbers. Firms also reported higher prices for the first time since February. Separate readings from the eurozone showed that their economies are no longer collapsing. The big picture: There has been a wide range of indicators suggesting economic activity has picked up recently, but economists are loathe to read too much into the rebound. There is still a sense that the economy could struggle later in the year. What IHS Markit said: “The flash PMI data showed the U.S. economic downturn abating markedly in June. The improvement will fuel hopes the economy can return to growth in the third quarter,” said Chris Williamson, chief business economist at IHS Markit. He warned that any return to growth will be prone to lose momentum as the pandemic remains a threat. What outside economists said: “Overall, the V-shaped recovery provides further evidence that activity is now recovery fairly quickly,” said Andrew Hunter, senior U.S. economist at Capital Economics. The stronger gain in the factory sector compared with services industries suggests that manufacturing is recovery relatively more quickly. This runs counter to the hard data that showed retails sales rebounding much more strongly than industrial output, he noted. Market reaction: Stocks opened higher on Tuesday as President Donald Trump said the U.S.-China trade deal was “intact.” The Dow Jones Industrial Average DJIA, +0.56% was up 171 points in early trading."}]}