{"article": [{"url": "https://www.marketwatch.com/story/how-ai-is-being-used-to-socially-distance-audiences-and-why-netflix-is-no-threat-according-to-this-movie-theater-chain-boss-11599051393", "published": 1599048140.0, "headline": "How AI is being used to socially distance audiences at â\u0080\u0098Tenetâ\u0080\u0099 and why Netflix is no threat, according to this movie theater chain boss", "body": "Elizabeth Debicki, left, and John David Washington in a scene from director Christopher Nolan's \"Tenet.\" Melinda Sue Gordon/Associated Press Sophisticated algorithms are being used by one of Europeâ\u0080\u0099s biggest movie theater chains to help with social distancing. Vue International, which has around 230 cinemas in the U.K., Germany, Taiwan, Italy, Poland and other European countries, has been using artificial intelligence to optimize screening times and isÂ making adjustmentsÂ to control the flow of audiences into auditoriums. Tim Richards, who founded privately owned Vue cinemasÂ aroundÂ 20 years ago, said 10 yearsâ\u0080\u0099 worth of data had been fed in computers pre-COVID to decide on the timing and frequency for screening movies. This has now been adapted to control the flow of customers into the cinemas by staggering screening times. It is being linked withÂ seating softwareÂ thatÂ cocoonsÂ customers within their family bubbles, or on their own, a safe distance away from other customers. Read: Hereâ\u0080\u0099s an overlooked way to play the â\u0080\u0098stuck-at-homeâ\u0080\u0099 trend in the stock market Richards, speaking at a press briefing on Monday evening,Â said: â\u0080\u009cIt took me 17 years to build the group up to 230 cinemas. What happened just a few months ago was apocalyptic. â\u0080\u009cWe have planned for crises such as a cinema being shut and blockbusters tanking,Â but not all the cinemas being down. Our big [cost] exposures are studios, people, and rent â\u0080\u0094 we were quickly focused on our burn rate and liquidity.â\u0080\u009d Last month it was reported that Vue was lining up Â£100 million ($133 million) in additional debt financing. The firm is owned by Alberta Investment Management Corporation and pension fund Omers. Richards and other managers hold a 27% stake. Vue has been slowly reopening its cinemas around Europe over the past few weeks. â\u0080\u009cWe have been using AI to help determine what is played,Â at what screen,Â and at which cinemasÂ [to optimize revenues],â\u0080\u009d he said. â\u0080\u009cOur operating systems have been tweaked to social distance customers. It recognizes if you are with family and it will cocoon you. At the moment we are probably able to use 50% of cinemasâ\u0080\u0099Â capacities. â\u0080\u009cWe can control the number of people in the foyer at any one time. Crowds would not be conducive to helping customersÂ feel comfortableÂ coming back. Every member of staff went through two days of safety training.â\u0080\u009d Richards said when he did reopen his movie theaters there was pent-up demand from customers but no new movies to screen. â\u0080\u009cWe still managed at 50% run rate with classic movies that were not onlyÂ already availableÂ on streaming services but on terrestrial televisionÂ as well. PeopleÂ justÂ wanted to get out of their homes and have some kind of normalcy.â\u0080\u009d Christopher Nolanâ\u0080\u0099s complex thriller â\u0080\u009cTenetâ\u0080\u009d is the first major new film to be released and Richards said: â\u0080\u009cWe are seeing â\u0080\u0098Tenetâ\u0080\u0099 performing at the same levels as â\u0080\u0098Inceptionâ\u0080\u0099 and â\u0080\u0098Interstellarâ\u0080\u0099 did which has been amazing.Â â\u0080\u009cIt will be a bumpy road in some areas but we expect a return to normalcy in six months â\u0080\u0094 it will take a couple of months to get people comfortable again with their positions.â\u0080\u009d He said entertainment giant Disney DIS, +1.53% has a strong line up of movie theater releases, despite placing â\u0080\u009cMulanâ\u0080\u009d direct to its streaming channel. Fears that streaming service Netflix NFLX, +1.43% is a threat to the industry,Â as movie lovers become used to watching films at home,Â are unfounded, he said. Opinion:Â Is â\u0080\u0098Mulanâ\u0080\u0099 worth $30? The answer, and other streaming picks for September 2020 â\u0080\u009cNetflix has been disruptive for everything in the home,â\u0080\u009d he said. â\u0080\u009cWe are out ofÂ theÂ home,Â so Netflix is complementary to us because most people who like film like film on all formats. â\u0080\u009cIâ\u0080\u0099ve seen the demise of the industry predicted definitely five or six times. We have been counter cyclical during downturns â\u0080\u0094 we are reasonably priced so people come out and enjoy what we have to offer.â\u0080\u009d"}]}