{"article": [{"url": "https://www.marketwatch.com/story/no-1-tennis-player-in-the-world-novak-djokovic-has-the-coronavirus-hes-the-fourth-player-to-test-positive-after-playing-in-a-tournament-he-organized-2020-06-23", "published": 1592903840.0, "headline": "No. 1 tennis player in the world Novak Djokovic has the coronavirus -  he's the fourth person to test positive after playing in a tournament he organized", "body": "BELGRADE, Serbia (AP) - Novak Djokovic tested positive for the coronavirus on Tuesday after taking part in a tennis exhibition series he organized in Serbia and Croatia. The top-ranked Serb is the fourth player to test positive for the virus after first playing in Belgrade and then again last weekend in Zadar, Croatia. His wife also tested positive. \"The moment we arrived in Belgrade we went to be tested. My result is positive, just as Jelena's, while the results of our children are negative,\" Djokovic said in a statement. Djokovic has been criticized for organizing the tournament and bringing in players from other countries amid the coronavirus pandemic. Viktor Troicki said Tuesday that he and his pregnant wife have both been diagnosed with the virus, while Grigor Dimitrov, a three-time Grand Slam semifinalist from Bulgaria, said Sunday he tested positive. Borna Coric played Dimitrov on Saturday in Zadar and said Monday he has also tested positive. There were no social distancing measures observed at the matches in either country and Djokovic and other players were seen hugging each other and partying in night clubs and restaurants after the matches. \"Everything we did in the past month, we did with a pure heart and sincere intentions,\" Djokovic said. \"Our tournament meant to unite and share a message of solidarity and compassion throughout the region.\" Djokovic, who has previously said he was against taking a vaccine for the virus even if it became mandatory to travel, was the face behind the Adria Tour, a series of exhibition events that started in the Serbian capital and then moved to Zadar. He left Croatia after the final was canceled and was tested in Belgrade. The statement said Djokovic was showing no symptoms. iframe.twitter-tweet { width: 100% !important; } Despite the positive test, Djokovic defended the exhibition series. \"It was all born with a philanthropic idea, to direct all raised funds towards people in need and it warmed my heart to see how everybody strongly responded to this,\" Djokovic said. \"We organized the tournament at the moment when the virus has weakened, believing that the conditions for hosting the Tour had been met. \"Unfortunately, this virus is still present, and it is a new reality that we are still learning to cope and live with.\" Djokovic said he will remain in self-isolation for 14 days and also apologized to anyone who became infected as a result of the series. Organizers of the Adria Tour said the third stage of the event, scheduled to held next week in Bosnia, has been canceled."}]}