{"article": [{"url": "https://www.marketwatch.com/story/opec-move-to-taper-output-cuts-look-to-keep-a-floor-under-prices-2020-07-15", "published": 1594825700.0, "headline": "OPEC+ move to taper output cuts may â\u0080\u0098keep a floorâ\u0080\u0099 under prices", "body": "The Organization of the Petroleum Exporting Countries and their allies will taper oil production cuts starting in August, effectively raising output â\u0080\u0094 but not by as much as it seems. The group of oil producers, collectively known as OPEC+, will allow record production cuts of 9.7 million barrels per day to decrease to 7.7 million barrels per day starting August, in line with a previous OPEC+ agreement to gradually taper the reductions. However, countries that did not meet their quota limits in May and June are expected to reduce production even more starting in August to compensate for their overproduction. At a press conference, following a meeting of the groupâ\u0080\u0099s on Wednesday, Saudi Arabiaâ\u0080\u0099s Minister of Energy Prince Abdulaziz bin Salman said actual cuts, including the reductions from countries compensating for that overproduction, will be at roughly 8.1 million to 8.2 million barrels per day, pending data from June. In a response to a question about the ceiling for the cuts in August, the minister said the 8.1 million-barrel per day reduction is probably the floor, with the ceiling for the cuts at roughly 8.34 million barrels. â\u0080\u009cThe overall net increase of about 1 million [barrels per day], after adjusting for extra cuts from past non-compliance, signals OPEC+ desires to keep the market somewhat tight...but not push prices too far or give up market share as non-OPEC shut ins return,â\u0080\u009d said Shin Kim, head of supply and production analytics, S&P Global Platts. Referring back to the 2 million-barrel per day reduction in the cuts, Prince Abdulaziz said that a â\u0080\u009cgood chunkâ\u0080\u009d of that 2 million increment will be domestically used or attended to by the countries compensating for overproduction and the \"unlocking of,â\u0080\u009d or further lifting of pandemic-related lockdowns in, global economies. In a press release, the JMMC said it â\u0080\u009cobserved that there were encouraging signs of improvement as economies around the world open up.â\u0080\u009d The committee also pegged the overall conformity level for participating OPEC+ countries with the output cuts in June at 107%. On Wednesday, oil futures prices logged their highest finish in more than four months, in part due to data from the U.S. government, which revealed a 7.5 million-barrel decline in domestic crude supplies for the week ended July 10. That was the largest weekly decline so far this year. The front-month August West Texas Intermediate crude US:CLQ20 climbed by 91 cents, or 2.3%, to settle at $41.20 a barrel on the New York Mercantile Exchange. Global benchmark Brent crude saw its September contract UK:BRNU20 Â climb by 89 cents, or 2.1%, to $43.79 a barrel on the ICE Futures Europe exchange. The Saudi and Russian energy ministers pointed out that their increased output will be consumed domestically and that likely means that exports will be unchanged, said Marshall Steeves, energy markets analyst at IHS Markit. â\u0080\u009cThere is also the issue of that made-up production cuts from Iraq and others, so they are seeking to keep a floor under prices,â\u0080\u009d he told MarketWatch. Still, uncertainty surrounding the recovering in the global economy could continue to hurt energy demand. â\u0080\u009cThe uneven economic recovery persists and may even lead to a retrenchment in demand growth,â\u0080\u009d said Steeves. “ â\u0080\u0098We are mindful of the fact that we still have a virus that we need to attend to.â\u0080\u0099 ” â\u0080\u0094 Prince Abdulaziz bin Salman, Saudi energy minister In response to media questions, Prince Abdulaziz said that if the market sees â\u0080\u009cserious lockdownsâ\u0080\u009d for a lengthy amount of time that may impact â\u0080\u009ca serious chunk of world economy,â\u0080\u009d then it would be warranted to see the possibility of an emergency OPEC+ meeting. â\u0080\u009cWe are mindful of the fact that we still have a virus that we need to attend to,â\u0080\u009d he said, adding that OPEC+ intends to use â\u0080\u009cevery tool in our kitâ\u0080\u009d to mitigate any issues that may emerge. The next meetings of the Joint Technical Committee and Joint Ministerial Monitoring Committee will be held on August 17 and 18, respectively. The next OPEC meeting is scheduled for Nov. 30."}]}