{"article": [{"url": "https://www.marketwatch.com/story/the-supreme-courts-obamacare-case-was-high-stakes-before-ruth-bader-ginsburgs-death-heres-why-its-even-more-important-now-2020-09-22", "published": 1601714000.0, "headline": "The Supreme Court's Obamacare case was high stakes before Amy Coney Barrett's nomination. Here's why it's even more important now", "body": "President Donald Trump's chance to fill Justice Ruth Bader Ginsburg's seat could shape the Supreme Court's jurisprudence for years to come, but a newly-appointed judge could affect 20 million Americans' health care - and how much they pay for it - a lot sooner. One week after Election Day, the high court is scheduled to hear arguments Nov. 10 on whether the Affordable Care Act (ACA), also known as \"Obamacare,\" is null and void. The Trump administration and 18 Republican-leaning states argue the whole law must go. After federal lawmakers in 2017 zeroed out the individual mandate's penalty for lacking health insurance, the entire Affordable Care Act must fall with it, they contend. There's no reason the whole law has to collapse and deprive an estimated 20 million people of health insurance, say more than 20 Democrat-leaning states and the Democrat-controlled House of Representatives. Even before Ginsburg's death at 87, those were thorny questions. Now there's a question of whether Amy Coney Barrett will be a ninth, potentially tie-breaking judge - and what that means for a decision at a moment when millions of people have lost their health insurance as the economy staggers under the coronavirus pandemic. On Saturday, President Trump announced that Judge Amy Coney Barrett, who currently sits on the Seventh Circuit Court of Appeals, was his choice to replace Ginsburg. The president has said he wants to fill the vacancy \"without delay.\" Back in 2012, Ginsburg was part of the 5-4 majority that decided the individual mandate withstood judicial scrutiny because it was a tax. In 2015, she was part of the 6-3 majority for a ruling related to tax credits and the ACA.The court's ruling could determine health insurance access for millions during a pandemic The Supreme Court's ruling on the Affordable Care Act would have fairly immediate ramifications for many Americans who have lost their employer-sponsored insurance amid layoffs triggered by the coronavirus pandemic. “ More than 6 million workers lost access to worker-provided health insurance since the pandemic's onset, according to one estimate. ” A recent report from the Economic Policy Institute, a nonprofit, non-partisan think tank, estimated that around 6.2 million workers lost access to health insurance they got through their employers as a result of being let go since the onset of the coronavirus pandemic. That figure takes into account workers who were originally laid off but have since found new employment. In many cases, these workers' health-care plans also covered their spouses, partners and dependents. Altogether, the rise in unemployment has cost some 12 million people their health-insurance coverage. Because of the expansion of health-insurance options created by the Affordable Care Act, though, most of these workers are eligible for government-subsidized health insurance. “ 'Some people will fall outside the reach of the ACA, particularly in January 2021 when [unemployment insurance] benefits cease for many and some adults fall into the Medicaid coverage gap due to state decisions not to expand coverage under the ACA.' ” - Kaiser Family Foundation researchers A separate study from the Kaiser Family Foundation found that nearly half of people who became uninsured after job loss were eligible for Medicaid. And roughly a quarter of those people who lost their employer-sponsored plans could qualify for subsidized insurance purchased through the insurance marketplaces set up by Obamacare. \"Some people will fall outside the reach of the ACA, particularly in January 2021 when [unemployment insurance] benefits cease for many and some adults fall into the Medicaid coverage gap due to state decisions not to expand coverage under the ACA,\" the researchers wrote. All told, millions of Americans had health insurance coverage that was made possible by Obamacare before the coronavirus pandemic began. Around 11.4 million people across the country enrolled in health-insurance plans through the insurance exchanges, according to data from the Centers for Medicare and Medicaid Services. And as of January 2020, 70.7 million individuals were enrolled in Medicaid or the Children's Health Insurance Program (CHIP), up from 14.2 million in 2013. Another factor in Obamacare's expanded coverage that's also of significant concern for many Americans in the COVID era: The requirement for insurers to provide coverage to people with pre-existing conditions. Prior to the passage of Obamacare, health insurers could deny coverage, limit payouts or charge higher premiums to people with pre-existing medical conditions. If the Supreme Court were to eliminate the Affordable Care Act, those protections would likely go away - Republicans have said they would ensure coverage for those with pre-existing conditions, but have not provided specific policy proposals to that end. Thus far, around 6.82 million Americans are confirmed to have been infected with the virus that causes COVID-19. So far, 2.59 million of those people have recovered. But all of them could be denied health-care coverage if Obamacare is struck down. That's because COVID-19 could be considered a pre-existing condition, especially for individuals with lingering symptoms. Furthermore, if the pandemic is not resolved before the Supreme Court rules in this case, the return of pre-existing conditions as a consideration for health insurers could make getting access to insurance more difficult. That in turn could complicate public-health officials efforts' to control the pandemic if many Americans skip testing or treatment for fear of incurring high medical costs.Can the Supreme Court pause arguments on the Obamacare case for now? Yes, but it's an unusual move, according to Andrew Koppelman, a constitutional law professor at Northwestern University Pritzker School of Law. At least five justices would have to decide to push the case to the next term, which Koppelman said would start in October 2021. “ Traditionally, if a justice isn't confirmed before oral arguments in a particular case, he or she doesn't have a vote in that matter, one Supreme Court expert said. ” If that doesn't happen, Trump and Senate Republicans have a very tight timeframe to put a ninth judge on the bench to hear the case. Traditionally, if a Supreme Court Justice isn't confirmed before oral arguments in a particular case, he or she doesn't have a vote in that matter, Koppelman said. But if Barrett is confirmed ahead of oral arguments, there's no easing into the job. \"If Judge Barrett is confirmed on Nov. 9., Judge Barrett is expected to spend the evening reading the briefs so she can ask questions the next day,\" sais Koppelman, the author of \"The Tough Luck Constitution and the Assault on Health Care Reform.\" A 4-4 tie means the lower court decision is affirmed though not precedentially binding. Here, that's a 2-1 Fifth Circuit Court of Appeals vote which said the individual mandate was unconstitutional and remanded the case for a district court judge to take a deeper look on whether the rest of the Affordable Care Act had to fall with it. How would a new Trump appointee affect the case decision? “ 'If a new justice is seated before the election, it would seem likely that the mandate will be struck down, potentially dismantling the ACA.' ” - Thomas McLoughlin and Eric Potoker, of UBS Global Wealth Management, in a client note. The judge could build a Supreme Court majority that would strike down some or all of the Affordable Care Act, some observers say. \"If a new justice is seated before the election, it would seem likely that the mandate will be struck down, potentially dismantling the ACA,\" Thomas McLoughlin and Eric Potoker at UBS Global Wealth Management wrote in a note last week prior to Barrett's nomination. Democrats have already warned that Barrett's nomination to the court could mean the end of the Affordable Care Act. Barrett has written in the past criticizing Chief Justice John Robert's decision in the 2012 case, even going so far as to say that the legislation should be called \"SCOTUScare.\" \"It's no mystery about what's happening here. President Trump was trying to throw out the Affordable Care Act. He's been trying to do it for the last four years,\" Democratic presidential candidate Joe Biden said in a speech Sunday in Wilmington, Del. But Ryan Owens, a political science professor and director of the University of Wisconsin-Madison's Tommy G. Thompson Center on Public Leadership, isn't so sure. “ \"Most observers, right or wrong, don't give this case a whole lot of a chance ... You're playing the long game. You want somebody in the court that has a consistent philosophy and one with which you agree.' ” - Ryan Owens, a political science professor and director of the University of Wisconsin-Madison's Tommy G. Thompson Center on Public Leadership \"Most observers, right or wrong, don't give this case a whole lot of a chance,\" Owens said. So it's unclear how much effort the Trump administration is putting into ensuring a win on one case. \"You're playing the long game. You want somebody in the court that has a consistent philosophy and one with which you agree.\" Supposing oral arguments still proceed on schedule, there's a whole range of Congressional actions that can happen between now and a decision in late spring or early summer, Timothy Jost, a Washington and Lee University School of Law emeritus professor, wrote for The Commonwealth Fund, a private foundation promoting better healthcare access. For one thing, he wrote, lawmakers can turn the lawsuit into a moot issue by putting a tiny tax back on the individual mandate. \"For the time being, however, the ACA is more at risk than it was just days ago,\" he said. This story was updated on Sept. 28, 2020."}]}