{"article": [{"url": "https://www.marketwatch.com/story/germany-investing-in-coronavirus-vaccine-maker-that-it-accused-the-trump-administration-of-trying-to-poach-2020-06-15", "published": 1592221520.0, "headline": "Germany investing in coronavirus vaccine maker that it accused the Trump administration of trying to poach", "body": "The German government has taken a stake in privately held biotech group CureVac — the company it accused the U.S. of trying to lure away as the coronavirus pandemic was starting to spread in Europe and the U.S. earlier this year. Germany’s federal minister for economic affairs and energy, Peter Altmaier, and Dietmar Hopp, co-founder of software group SAP SE and of the investment company dievini Hopp BioTech holding GmbH & Co. KG, jointly announced the government would invest €300 million ($337 million) in CureVac, according to the company website. The investment will be made by the state-owned development bank Kreditanstalt für Wiederaufbau (KfW). Funds will partly be used to further develop the company’s drug pipeline, including its COVID-vaccine. Under the agreement, KfW will end up with a 23% stake in CureVac. In mid-March, a political storm broke out over a report in German newspaper Welt am Sonntag, which claimed the administration of President Donald Trump was trying to secure CureVac’s vaccine exclusively for the U.S. via a large financial donation. German officials said at the time the government was entering talks with CureVac to fed off any U.S. move, the Wall Street Journal reported. The company, however, denied at the time the U.S. had made any overture, while the U.S.’s then–ambassador to Germany, Richard Grenell, also said the German newspaper report had been incorrect, Reuters reported. Relocating CureVac to the U.S. would have put the company outside Germany’s jurisdiction. In the statement, Altmaier said the government was investing in CureVac to help accelerate development programs and gain more independence when it comes to vaccines, something many countries have been aiming for as the outbreak of a new coronavirus developed into a global pandemic. “This is also of high importance for industrial policy as we in Germany and Europe need these essential research results and technologies. At the same time, today’s move is a first and important implementation of the comprehensive Corona Economic Stimulus and Future Technologies Package,” enacted by the government on June 3, said Altmaier. A handful of vaccine candidates developed by companies including Sinovac Biotech Ltd., Moderna Inc. MRNA, +0.09% and BioNTech BNTX, +1.23% and Pfizer Inc. have moved into clinical trials, and many of the world’s leading vaccine makers, including AstraZeneca AZN, +1.16%, AZN, +0.63%, Johnson & Johnson JNJ, +1.39% and Sanofi SNY, +0.89% SAN, +1.20%, are planning to develop and test COVID-19 vaccines in clinical studies. In the U.S., the government is funding studies for some experimental vaccines. In the U.K., human trials of one potential COVID-19 vaccine, which, it’s hoped, could protect the population from the disease for £3 per person, are reportedly due to begin this week."}]}