{"article": [{"url": "https://www.marketwatch.com/story/chipotle-earnings-preview-chipotle-digital-menu-exclusives-could-give-sales-a-boost-2020-07-20", "published": 1595418800.0, "headline": "Chipotle earnings preview: Digital menu exclusives could give sales a boost", "body": "Chipotle Mexican Grill Inc. could launch digital-only menu items that give sales a boost, according to UBS analysts. Chipotle’s CMG, +0.01% digital sales rose 81% in the first quarter. The company has been focused on enhancing its online business, like installing Chipotlanes that allow for quick digital order pickup, despite the coronavirus pandemic. Chipotle announced last week that it is hiring 10,000 workers to manage the new digital business. The company has also continued efforts to enhance its menu, starting a cauliflower rice test last week in 55 restaurants. “We also anticipate the launch of digital-only menu items, including quesadillas, offers the potential for incremental gains, and ultimately broader launch beyond just digital,” wrote analysts led by Dennis Geiger. “We expect potential additional proteins, beverages and other items could provide traffic and average check tailwinds.” Read:Domino’s Pizza could snap up market share with ‘improved’ chicken wings UBS ultimately thinks Chipotle will come out of the coronavirus pandemic in a better position than when it went in, “with market share gains possible, greater real estate opportunities, and potential margin benefits.” UBS rates Chipotle shares neutral with a $1,200 price target, up from $850. Upbeat analysts have raised their price targets on Chipotle stock ahead of the fast-casual chain’s second-quarter earnings announcement. SunTrust Robinson Humphrey moved its price target to $1,336 from $946. Analysts say digital sales at Chipotle rose to 70% of total sales the week of April 19, and the company has made improvements to its app, added GrubHub Inc. GRUB, +0.83% as a third-party delivery provider and made other advancements. And the company will benefit from restaurant reopenings and new restaurant launches. “In the face of the COVID crisis, Chipotle has indicated increasing demand from developers, deals for high-quality sites being abandoned by competitors, greater flexibility by landlords to accommodate ‘Chipotlanes’ and strong human capital to staff the stores,” analysts said. SunTrust rates Chipotle stock buy. Also:Online food prices jump as food companies struggle to meet demand Here are other items to watch for when Chipotle reports: Earnings: FactSet is guiding for earnings per share of 35 cents, down from $3.99 per share last year. Estimize, which crowdsources estimates from sell-side and buy-side analysts, hedge-fund managers, executives, academics and others, is forecasting 37 cents per share. Chipotle has beat the FactSet earnings consensus the last 10 quarters. Revenue: FactSet and Estimize forecast revenue of $1.34 billion, down from $1.43 billion last year. Chipotle has exceeded the FactSet revenue consensus five out of the last six quarters. Stock price: Chipotle shares have rallied 40.2% for 2020 so far, and are up 33% over the past three months. The S&P 500 index SPX, +0.87% has edged up 1.1% for the year to date. And:Red Robin Gourmet Burgers cut 55 menu items due to coronavirus and doesn’t plan to bring them back Other items: -Chipotle has something in common with quick-service restaurants like McDonald’s Corp. MCD, -0.43% , says KeyBanc Capital Markets. “Like traditional fast food chains, Chipotle is likely benefiting from an abnormal competitive environment that has seen fewer discounts, limited competition, reduced marketing investment, and aggressive government stimulus,” analysts said. KeyBanc rates Chipotle stock overweight with a price target of $1,250, up from $1,125. -Quo Vadis analysts think Chipotle’s earnings are poised to soar. “As we review consensus forecasts, it seems reasonable to believe that comps could return to growth by the fourth quarter and the company might be able to generate EPS in the neighborhood of $19 in 2021,” wrote John Zolidis, president of Quo Vadis. The FactSet consensus is for 2021 EPS of $19.52. Watch:How to pick sectors to invest in amid a COVID-19 resurgence -Chipotle’s Rewards membership has climbed during the pandemic. SunTrust says Chipotle had 12 million to 13 million members in mid-June compared with about 11.5 million members in April."}]}