{"article": [{"url": "https://www.marketwatch.com/story/heres-what-president-trumps-coronavirus-diagnosis-means-for-stock-market-volatilityso-far-11601663253", "published": 1601714540.0, "headline": "Here's what President Trump's coronavirus diagnosis means for stock-market volatility - so far", "body": "Talk about an October surprise. As if 2020 couldn't get any more dramatic for investors, the news that President Trump and his wife have contracted COVID-19 has injected a fresh dose of uncertainty into the U.S. stock market. What the president's diagnosis portends for equities remains to be seen but in early market action Friday, U.S. and global stocks retreated after the initial reports on the president's health. However, European stock markets finished higher Friday with the Stoxx Europe 600 SXXP, +0.55% up 0.3% higher and the U.K.'s FTSE 100 UKX, +0.64% up 0.4% after both indexes were lower in early trade. U.S. stocks, meanwhile, were well off their opening lows Friday afternoon, with the Dow Jones Industrial Average DJIA, +0.56% momentarily trading in positive territory after losing over 400 points near the start of the session. The S&P 500 index SPX, +0.87% was 0.5% lower at 3,364, but off its intraday low at 3,323, at last check, while the Nasdaq Composite Index COMP, +1.39% was down 1.8% at 11,126, but had hit a Friday nadir at 11,082. Relatively muted moves in gold prices GOLD, +2.86%, which were off 0.5%, and the 10-year bond market TMUBMUSD10Y, 0.777% implies that investors are thus far still parsing the wide-ranging implications of Trump's coronavirus infection on the trajectory for the race for the White House, now 32 days away, and as well as for the overall economy. \" The largest hurdle is likely the election,\" wrote Lindsey Bell, chief investment strategist at Ally Invest, in a Friday report. She suggested that Trump's diagnosis could result in a delay of the Nov. 3 election, though that is unlikely, but reflects a number of uncertainties created by Trump testing positive so close to the election. \"There is no precedent in place if the incumbent nominee were to become incapacitated prior to the election,\" she wrote. \"Given the lack of clarity on the procedures to move forward, market volatility is likely to persist, if not increase, as the situation unfolds over the next several weeks,\" she added. Currently, Trump is showing only \"mild symptoms\" from the illness, according to the president's doctor, but even in the best case scenario it will erase at least two weeks of crucial campaign time in his battle against former Vice President Joe Biden. Biden currently leads Trump by 7.2 percentage points in a national average of polls by RealClearPolitics. Trump's age, 74, and his body-mass index, or BMI, have been cited as factors that could result in the illness being more severe for the president. Market participants had already been bracing for the possibility that the Biden-Trump race could lead to a contested outcome, where the loser opts not to concede defeat, and the lack of a more pronounced reaction in so-called safe-haven assets may account for that, experts said. In fact, some have speculate that the news about Trump's health could actually be a good thing for the market in the end. That might seem like an odd statement, considering that Trump is viewed as the business-friendly incumbent while Biden is viewed as newcomer who might tighten regulations and raise taxes, both political stances that investors view as bearish in the short-term for equities. Jefferies analyst Sean Darby said that investors should not be panicking about Trump's diagnosis and believes some of the selling in the stock market, which was staging a mini recovery at midday Friday, is overdone. \"In our view investors should not panic over the news that US President Donald Trump has tested positive for COVID-19,\" wrote Darby in a Friday research report. \"It was a tail risk since other global leaders have contracted the virus, such as U.K. PM Boris Johnson, but the forthcoming US election should not be delayed in any way,\" he wrote. Indeed, in testing positive for the coronavirus, Trump, who is 74, follows U.K. Prime Minister Johnson, 56, and Brazilian President Jair Bolsonaro, 65. Both survived their experiences though Johnson was hospitalized for some time. Matt Gertken, geopolitical strategist at BCA Research, outlined a number of ways in which getting coronavirus could be \"good news for Trump's election odds\" with the important caveat being that he survives the illness. \"As long as he recovers, this is good news for Trump's election odds,\" Gertken speculated. \"It distracts from his first debate performance and gets him at least some sympathy regarding the pandemic,\" he wrote. \"This also puts the spotlight on Joe Biden's campaign during the quarantine period. Trump would emerge with a new lease on life in mid-October,\" assuming he's only out of commission for two weeks. But he also foresees a positive outcome for the Republican party and for markets, if the disease worsens for Trump. In the event Trump is incapacitated, the 25th Amendment to the constitution allows the temporary transfer of power to Vice President Pence. \"If it gets to a more serious point, Vice President Pence does have a chance. He represents GOP nationalism and economic reflation without Trump's unpredictable protectionism,\" he added. \"This is a more stock market positive version of GOP victory scenario. The Vice-Presidential debate now matters-with two elderly candidates the nation needs to think beyond Trump and Biden,\" he said. The sole VP debates between California Sen. Kamala Harris and Pence are set for Oct. 7 in Utah. Other analysts argue that the Trump development could increase the prospects for a fresh round of fiscal stimulus measures and for Republicans and Democrats to further compromise on measures to get a deal struck soon. Talks have been stalled and the outlook dimmed on Thursday when the House Democrats symbolically voted in favor of a $2.2 trillion package with the assumption that it would be rejected by Republicans in the Senate. House Speaker Nancy Pelosi in a statement on Friday asked airlines to hold off on furloughs and layoffs as Congress works on an aid package for that industry. \"Job growth has slowed in recent months as stimulus has faded and COVID-19 cases rise, strengthening the case for more fiscal stimulus,\" said Jeff Buhbinder, equity strategist at LPL Financial, in a note.\" It will be very interesting to see what impact President Trump's COVID-19 diagnosis has on those negotiations, the pace of re-openings, and the jobs recovery.\" It is entirely unclear how this all shakes out but one thing is sure, uncertainty and perhaps market volatility is the name of the game for investors in the near future. \"Trump's positive COVID test brings about a whole new wave of uncertainty on how he will govern over the next couple weeks, and all his campaigning and debates are at risk of not happening,\" noted Edward Moya, senior market analyst at Oanda in a note. So should investors be selling first and asking questions later? Most market participants agree that it adds a new variable to the mix of questions heading into the end of a tumultuous 2020. \"Trump's diagnosis absolutely shows that COVID is still the No. 1 story in the market right now,\" JJ Kinahan told MarketWatch in an interview.  But Michael Pompian, an expert on behavioral finance at Sunpointe Investment, notes that investors should resist the urge to change their tactics due to politics because it rarely has a long-term impact on their returns. \"Many investors feared a Trump win in 2016-only to see the market rally after he was elected,\" he has said, even before the Trump news."}]}