{"article": [{"url": "https://www.marketwatch.com/story/brooks-brothers-files-for-bankruptcy-as-its-take-on-office-gear-falls-out-of-step-with-more-casual-trends-2020-07-08", "published": 1594457720.0, "headline": "Brooks Brothers files for bankruptcy as its take on office gear falls out of step with more casual trends", "body": "Even if workers could head to the office right now, chances are they wouldn’t be wearing a Brooks Brothers suit. The 200-plus-year-old retailer best known for what would now be considered formal office attire has filed for bankruptcy, falling victim to the COVID-19 outbreak, which has shuttered stores and stymied retail, and changing styles. Brooks Brothers had fallen on rough times even before the pandemic, announcing last year that it would explore its strategic options. It now has a $75 million debtor-in-possession loan and there is interest from a potential buyer, Barneys New York owner Authentic Brands LLC, according to The Wall Street Journal. Watch: How closing this gap could save the global economy $1 trillion Brooks Brothers has tried to inject some freshness and a more laid-back vibe into its fashions, with “cool & casual” styles currently featured on its e-commerce homepage. However, the “casualization” of the workplace has outpaced the change at the iconic brand. “[W]hen it comes to tastes and style, Brooks Brothers has been swimming against the tide,” wrote Neil Saunders, managing director at GlobalData Retail. “Its formal, old-school approach found favor among mature and more traditional demographics, but it has become increasingly out of step with a new generation of consumers who are looking for a more edgy approach to smart casual.” Moreover, lockdowns to prevent the spread of coronavirus have made athleisure gear like sweats and yoga pants the items people most want to wear. GlobalData numbers show a 74% decline in year-over-year sales of men’s formal wear during April, May and June. Men’s “smart casual” saw a 62% decrease. Among the issues retailers now face are bloated inventory, pressure in the wholesale channel that could last into next year and soaring COVID-19 infection rates in U.S. states that had begun to reopen, according to Wells Fargo. Analysts say global athletic brands like Nike Inc. NKE, +0.97% and Adidas AG ADS, +1.87% “are among the most attractive names in our universe.” Read:Nike’s COVID-19-related sales decline is a bump on the path to long-term growth, analysts say In the long term, Wells Fargo favors the off-price channel, which includes TJX Cos. TJX, -0.18% and Burlington Stores Inc. BURL, +0.22% See:TJX results show shoppers will head back to stores if the price is right, analysts say “Warmer weather is spanning much of the country, allowing consumers to extend their mostly homebound routines to the outdoors, and expanding their apparel needs beyond comfort and above-the-keyboard dressing,” said Maria Rugolo, apparel industry analyst at The NPD Group, in a recent report. Activewear snapped up 28% of apparel dollars spent for the 12 months leading into May 2020, according to NPD data. And before the coronavirus pandemic, nearly half of consumers who worked from home (48%) would wear the same thing for work, working out and on the weekend. Even with the inclusion of more casual items, Brooks Brothers still has a large collection of $1,000 suits and dresses priced $200 to $400 on its website. “With the current work-from-home situation, many shoppers are now even more relaxed in their attire – even executives are wearing T-shirts and polos on conference calls,” said Hilding Anderson, head of retail strategy at business consultancy Publicis Sapient. “We see this as a sustained shift in expectations – the days of formal attire five days a week – or even one – are fading.” Anderson suggests Brooks Brothers needs a transformation, including its merchandise and marketing. Don’t miss:Lululemon acquisition Mirror could generate $700 million and reach 600,000 subscribers by 2023: Bank of America A change like that will require a mighty effort and a big investment from a buyer. “The brand has a solid foundation on which a new owner can build, and it has a good digital business that has the potential for future growth,” wrote GlobalData’s Saunders. “[T]he process of reinvention will not be easy; it will take time, capital and effort to reconfigure Brooks Brothers into a retailer ready to serve the needs of modern consumers.”"}]}