{"article": [{"url": "https://www.marketwatch.com/story/why-wall-street-is-doing-great-while-main-street-is-still-closed-11601990995", "published": 1601978000.0, "headline": "Why Wall Street is doing great while Main Street is still closed", "body": "AFP via Getty Images CAMBRIDGE, Mass. (Project Syndicate)—Why are stock-market valuations soaring when the real economy remains so fragile? One factor has become increasingly clear: The crisis has disproportionately affected small businesses and low-income service workers. They are essential for the real economy, but not so much for equity markets. True, there are other explanations for today’s lofty valuations, but each has its limitations.Alternative explanations For example, because stock markets SPX, +0.87% DJIA, +0.56% GDOW, +0.39% are forward-looking, current stock prices may reflect optimism about the imminent arrival of effective COVID-19 vaccines and radically improved testing and treatment options, which would allow for a more limited and nuanced approach to lockdowns. Breaking news: Trump White House blocks FDA’s new guidelines for vaccine approval This outlook may be justified, or it may be that markets are underestimating the likelihood of a severe second wave this winter, and overestimating the efficacy and impact of the first-generation vaccines. Breaking news: Second coronavirus wave could delay Europe’s recovery: ECB President Lagarde A second, and perhaps more convincing, explanation for today’s stock market performance is that central banks have pushed interest rates down to near zero. With markets convinced that there is little chance that rates will rise in the foreseeable future, prices of long-lived assets such as houses, art, gold, GOLD, +2.86% and even bitcoin BTCUSD, +3.24% have all been driven upward. And because tech firms’ revenue streams are tilted far into the future, they COMP, +1.39% have benefited disproportionately from low interest rates TMUBMUSD10Y, 0.777%. “ The best explanation for why stock markets remain so bullish despite a massive recession is that major publicly traded companies have not borne the brunt of the pandemic’s economic fallout. But having been spared by the virus, they could soon find themselves squarely in the sights of a populist backlash. ” But, again, it is not clear that markets are correct in anticipating a never-ending continuation of low interest rates. After all, the long-term adverse supply effects, particularly from deglobalization, may linger long after global demand has recovered. A third explanation is that in addition to providing ultralow interest rates, central banks have directly backed private bond markets—representing an unprecedented intervention in the case of the Federal Reserve. These private bond purchases should not be thought of as monetary policy in a conventional sense. Rather, they resemble a quasi-fiscal policy, with the central bank acting as an agent for the Treasury in an emergency situation. As such, this particular intervention is likely to be temporary, even though central banks have not yet succeeded in telegraphing that fact to markets. Despite sharply elevated macroeconomic volatility and a rising supply of corporate debt, interest-rate spreads over government debt have actually narrowed in many markets, and the number of major corporate bankruptcies to date remains remarkably low considering the magnitude of the recession. At some point, markets will be disabused of the notion that taxpayers will cover everything indefinitely. Central banks are ultimately constrained in the amount of risk they are allowed to assume, and the belief that they still have an appetite for taking on more could be challenged if a severe second wave arrives this winter.Missing piece of puzzle While these three explanations offer some insights into why stock prices are rising at a time when the real economy is heading south, they tend to miss a big piece of the puzzle: the economic pain inflicted by COVID-19 isn’t being borne by publicly traded companies. It is falling on small businesses and individual service proprietors—from dry cleaners to restaurants to entertainment providers—that aren’t listed on the stock market (which leans more toward manufacturing). “ Until lofty stock-market valuations are underpinned by a broad-based recovery in both health and economic outcomes, investors should not get too comfortable with their outsize pandemic profits. ” These smaller players simply do not have the capital needed to survive a shock of this duration and magnitude. And government programs that have helped keep them afloat for a while are beginning to lapse, raising the risk of a snowball effect in the event of a second wave. Some small-business failures will be seen as part and parcel of the broader economic restructuring that the pandemic has triggered. But plenty of otherwise viable businesses also will fail, leaving large publicly traded companies with an even stronger market position than they already had. In fact, that is yet another reason for the market euphoria. (True, some large businesses have filed for bankruptcy protection, but most—not least bricks-and-mortar retailers—were already in trouble before the pandemic). Further underscoring the unequal impact of the pandemic, government tax revenues have not fallen by nearly as much as one might expect, given the magnitude of the recession and record postwar unemployment levels (or, in Europe’s case, the massive outlays to pay furloughed workers). The reason, of course, is that the job losses have been concentrated among low-income individuals who pay less in taxes.The backlash will come But today’s elevated stock markets face risks that aren’t only economic, including but not limited to the significant possibility of an unprecedented political crisis following the U.S. presidential election this November. After the 2008 financial crisis, there was a widespread backlash over policies that seemed to favor Wall Street over Main Street. This time, Wall Street will again be vilified, but populist wrath also will be directed toward Silicon Valley. One likely outcome, especially if the ongoing process of deglobalization makes it more difficult for corporations to shift their operations to low-tax countries, will be a reversal of the trend decline in corporate tax rates. That will not be good for stock prices, and it would be a mistake to think the populist response would stop there. Until lofty stock-market valuations are underpinned by a broad-based recovery in both health and economic outcomes, investors should not get too comfortable with their outsize pandemic profits. What goes up can also come down. Kenneth Rogoff, a former chief economist of the International Monetary Fund, is professor of economics and public policy at Harvard University. This article was published with permission of Project Syndicate—The Stock-Market Disconnect."}]}