{"article": [{"url": "https://www.marketwatch.com/story/biden-trump-mark-9-11-in-pennsylvania-as-polls-for-swing-states-continue-to-favor-democratic-challenger-11599846264", "published": 1599836300.0, "headline": "U.S. will always 'fight back'  - Trump marks 9/11 in Pennsylvania, as Biden also visits the swing state", "body": "Democratic presidential nominee Joe Biden, a former two-term vice president, and Vice President Mike Pence greet each other Friday during a memorial service at the National September 11 Memorial and Museum in New York City. Getty Images President Donald Trump and Democratic challenger Joe Biden on Friday both observed the anniversary of the Sept. 11, 2001, terrorist attacks by visiting a memorial in the key swing state of Pennsylvania, and Biden and Vice President Mike Pence also took part in a remembrance ceremony in New York City. Biden spent Friday morning in New York at the National September 11 Memorial & Museum's commemoration ceremony, where he briefly spoke with Pence. The Democratic presidential nominee then traveled to Shanksville, Pa., where he laid a wreath at the Flight 93 National Memorial. That plane crashed into a field after passengers and crew fought back against hijackers. Biden told reporters on Friday morning that his campaign had paused advertising for the day. \"I'm not going to talk about anything other than 9/11,\" he said. \"It's a solemn day. That's how we're going to keep it.\" Trump was at the memorial in Shanksville on Friday morning and left before Biden arrived. \"The heroes of Flight 93 are an everlasting reminder that no matter the danger, no matter the threat, no matter the odds, America will always rise up, stand tall and fight back,\" Trump said in a speech at the memorial. The president also noted that U.S. troops killed Islamic State leader Abu Bakr al-Baghdadi less than a year ago, adding that \"soon after\" they took out Gen. Qassem Soleimani, labeling the latter, who commanded Iran's Quds Force, \"the world's top terrorist.\" Polling average for top swing states Source: RealClearPolitics loadCSS('https://asset.wsj.net/wsjnewsgraphics/dice/rcp-battleground-polls-table-6792bad1-a2b9-469a-bbf6-c995b1ea4be5/app.min.css'); loadJs('https://asset.wsj.net/wsjnewsgraphics/dice/rcp-battleground-polls-table-6792bad1-a2b9-469a-bbf6-c995b1ea4be5/app.min.js'); Biden's and Trump's remarks come 53 days before the Nov. 3 election, and as the Democratic challenger has an edge of almost 4 percentage points over the Republican incumbent in a RealClearPolitics moving average of polls focused on top swing states that are likely to decide the White House race. Biden's advantage in Pennsylvania is 4.3 points. Trump and his campaign have said pollsters are getting the race wrong. Betting markets are giving the former vice president a 53% chance of winning vs. Trump's 46.2%. Back in Washington, D.C., on Friday afternoon, Trump announced a deal normalizing relations between Israel and Bahrain. The main U.S. stock gauges SPX, +0.87% DJIA, +0.56% recently traded mixed on Friday, staying on track for sizable weekly losses."}]}