{"article": [{"url": "https://www.marketwatch.com/story/big-pharma-is-taking-big-money-from-us-taxpayers-to-find-a-coronavirus-vaccine-and-charge-whatever-they-want-for-it-2020-06-24", "published": 1593017660.0, "headline": "Big pharma is taking big money from U.S. taxpayers to find a coronavirus vaccine â\u0080\u0094 and charge whatever they want for it", "body": "“ Americans need to have full confidence that decision-makers at the highest levels of government are acting in the interest of their health and well-being. ” Since the start of the race for a COVID-19 vaccine, the U.S. government has funneled more than Â $10 billion in taxpayer dollarsÂ to pharmaceutical companies through contracts for the expedited innovation of a vaccine. So far, the governmentâ\u0080\u0099s investment has been made with no strings attached,Â not even a guaranteeÂ that any vaccines and treatments will be affordable to the people who need them.Â In June, White House leaders announced â\u0080\u009cOperation Warp Speed,â\u0080\u009d which gives away even more tax dollars and technical support to companies developingÂ five experimental COVID-19 vaccinesÂ to be fast-tracked through testing and then mass-produced soon after.Â The announcement came with a lot of speculation about whatÂ the companies will charge, but, again, with no assurance that the vaccine needed to beat COVID-19 will be affordable.Â Â While the Trump administration is rushing the nationâ\u0080\u0099s return to normal andÂ coronavirus cases are surgingÂ in more than half of the states, thereâ\u0080\u0099s been little action in Congress on the one thing that actually could get things back to normal: ensuring an affordable COVID-19 vaccine that could curtail the spread of the disease. The first step is obviously the investment weâ\u0080\u0099re already seeing to create the vaccine, but the second step is just as important: regulation and accountability to ensure that medicines weâ\u0080\u0099re paying to develop are accessible to all. With so many lives at stake, Americans need to have full confidence that decision-makers at the highest levels of government are acting in the interest of their health and well-being. But instead, weâ\u0080\u0099re seeing business as usual from an administration stacked withÂ former pharma executives and a leader of the governmentâ\u0080\u0099s COVID-19 task force who says itâ\u0080\u0099sÂ counterproductive to set price limitsÂ on vaccines.Â Despite decades of evidence that drug companiesÂ price-gougeÂ patients to maximize profits, the Trump administration plans to hand them monopoly control over the price of a COVID-19 vaccine. This is a case study on who really benefits when the U.S. government hands over exclusive licensing deals with no stipulations for pricing. The industry gets richer while Americans are forced to tighten their budgets, ration medicine or go without drugs they depend on. Thatâ\u0080\u0099s been the reality of giving corporations control over prices. Itâ\u0080\u0099s a myth that high prices reflect the hard work involved in the research and development of new drugs. Time and again weâ\u0080\u0099ve seen drug companies jack up the cost of insulin, cancer treatments, opioids, and HIV/AIDS treatments â\u0080\u0094 all drugs developed with significant taxpayer investments â\u0080\u0094 making drug prices are the biggest driver inÂ health care costs in the U.S.Â and making the drug industry theÂ most profitableÂ in the nation.Â Now this cycle is repeating in the development of a COVID-19 vaccine. Beating COVID-19 is a big job, but the administrationâ\u0080\u0099s refusal to guarantee affordable medicines to all citizens declares defeat before we even try. Leaving equitable access to lifesaving medicines up to the corporations violates common sense and basic responsibility. Congress has to step in and stop the pharmaceutical industry from using another public health crisis to line their pockets andÂ increase their stock prices.Â Congress must act now to ensure that COVID-19 vaccines and treatments are available to all. It can start with theÂ MMAPPP Act (Make Medications Affordable by Preventing Pandemic Pricegouging), which would put a check on Big Pharmaâ\u0080\u0099s monopoly control over prices by requiring drugs developed using taxpayer dollars be made affordable. Congress can also support the TRACK Act, which would require transparency around how taxpayer money is being spent on COVID-19 drug development and clarify what the government has requested in exchange for this investment.Â Thereâ\u0080\u0099s a long road ahead before COVID-19 recedes from our everyday lives. That timeline will be longer if vaccines are not affordable. To end the crisis, Congress must rein in monopoly control of drug prices â\u0080\u0094 once and, quite literally, for all. Margarida Jorge is the national campaign director for Lower Drug Prices Now, a coalition of social, racial and economic justice organizations working to ensure access to affordable medicines. More: How the coronavirus could worsen racial and income inequality in higher education Plus: Fauci says COVID-19 has one characteristic heâ\u0080\u0099s never seen before"}]}