{"article": [{"url": "https://www.marketwatch.com/story/a-letter-from-chennai-india-tops-2-million-covid-19-cases-in-the-midst-of-so-much-death-despair-and-depression-life-does-go-on-11597052163", "published": 1599467780.0, "headline": "India now has the world's second-highest number of COVID-19 cases after U.S. 'Alternative medicines have sprouted like mushrooms'", "body": "A boy covers his face with his mother's scarf as they walk along the road after the government eased a nationwide COVID-19 lockdown in Chennai. (Photo: Arun Sankar/Agence France-Presse/Getty.) CHENNAI, India - Kamalammal, 65, strains her ears to catch the TV news from the adjoining hut. She is anxiously awaiting the reopening of Marina Beach in India's southernmost state, Tamil Nadu, where she used to earn Rs. 300 ($4) a day serving hot-from-the-oven snacks to visitors. With the beaches closed down and all congregations banned, starvation stares her in the face. Even after a series of lockdowns from mid-March for the country's 1.3 billion citizens, there is no sign of the oft-promised opening up of the economy. Bulletins put out by the government say that things are near normal, all those who lost income have been taken care of, and none in the state remain hungry. The reality, however, is far different. The lockdown in March and the subsequent economic effects of the pandemic have hit the poorest Indians the hardest. Most Tamil Nadu temples remain closed and religious congregations are forbidden, with many of the priests living on meager past savings. Paradoxically, shops of the state-owned liquor dealership do a roaring business, with little concern for social distancing or mask-wearing. Industrial and commercial establishments have been permitted to function - but many are unable to find staff, most of whom were migrant laborers from distant states like Uttar Pradesh and Bihar, who have gone home after the lockdown after a struggle to stay alive and to find transport. Now that they are there, they are unable to find employment and are keen to return to their former workplaces; however, travel restrictions between states make this difficult. Even locally in Chennai, industries have started up, but local staff - other than those owning two-wheelers - find it difficult to get to work. All public transport is shut down and none can afford Uber UBER, -0.18% or Ola rides on their average monthly salaries of Rs. 20,000 ($266).  As of Labor Day, the total number of people confirmed to have contracted COVID-19 in India was 4,204,613, surpassing Brazil (with 4,137,521) as the country with the second highest number of coronavirus cases in the world. The U.S. still has the most cases of any country with 6,277,902. India has a rate of COVID-related death per 100,000 people of 5.3 and a case-fatality rate of 1.7%. In contrast, the U.S. has a fatality rate of 57.7 per 100,000 people and a case-fatality rate of 3%.'People's irresponsibility appears to know no bounds' Chennai continues to be a hotspot, though one wouldn't think so from people's cavalier attitude toward mask-wearing and the absolute absence of social distancing, especially in crowded fish markets like Kasimedu. Few people appear to have learned any lesson from the huge cluster of cases that erupted in wholesale vegetable markets at Koyambedu. While the young, both educated and unlettered, appear supremely confident that this infection is not for them, many old people have a fatalistic attitude: \"If it is to affect me, it will, irrespective of whether I protect myself or not.\" From the huge number of vehicles seized during the curfews, one can discern people's callousness in safeguarding themselves and others. Some take a ride merely to see what the usually packed NSC Bose Road looks like during curfew. 'A silver lining is that a substantial number of the infected do go home fully recovered,' writes Sadagopa Iyengar. Photo: Krishnan Sadagopan Contact tracing, which was originally being done by the civic authorities religiously, has flagged - resulting in even the co-residents of a COVID-positive patient remaining untested. The enormity of the exercise, too, has something to do with the dwindling progress. And some people who test positive furnish false addresses and mobile numbers, happily escaping the Chennai Corporation's efforts to isolate them and prevent the virus's spread. People's irresponsibility appears to know no bounds, with infected people merrily going about with little concern for the huge numbers they are likely to infect, among whom may be elders with co-morbidities. A silver lining is that a substantial number of the infected do go home fully recovered. Initial underreporting of deaths also falsely painted a less-alarming picture. While government hospitals groan under the burden of increasing cases and inadequate infrastructure, private hospitals make a killing, charging patients anywhere between Rs. 300,000 ($4,000) to Rs. 500,000 ($6,600) for a five-day stay in the hospital. In a recent extreme case, a middle-class patient was charged Rs. 1,800,000 ($24,000) by one of the premier private health-care institutions. Even if one survived COVID-19 and its long-term effects, it would be difficult for most people to endure even one more financial setback. Doctors, nurses and other health-care workers, hailed as front-line warriors, face problems too. Imprisoned in their suffocating plastic suits for hours, they are overworked and underpaid, laying themselves open at every moment to the risk of infection. However, when one such doctor died of COVID-19, an aggressive crowd prevented his burial at the local burial ground. The family had to rush to court to get an order for interment with police protection.An 'egalitarian' virus Mallika (name changed to protect her identity) said she was heartbroken when COVID-19 claimed her husband, Ramaswamy, but her grief multiplied manifold when she was not even able to see her husband of 30 years, nor speak to him during his final moments. Whatever unsaid final messages Ramaswamy may have had for his wife were interred with him in a mass grave for COVID-19 victims. In the midst of so much death, despair and depression, life does go on. Marriages continue to be celebrated, of course without the usual pomp, splendor and hordes of invitees. Children continue to be born, and death occurs without the coronavirus too, bereft of many of the funeral rites that follow the death of a Hindu. In the early weeks of COVID-19, crematoria were closed or overcrowded, making even the departed stand in a queue for their turn. Whether or not a vaccine is around the corner, alternative medicines have sprouted like mushrooms after rain, claiming to build immunity against COVID-19. Joining the bandwagon are manufacturers of toothpastes, popular health drinks and proprietary formulations, all vociferous in their anti-COVID claims. One thing about COVID-19: It is egalitarian, even if access to the same medical care for everyone is not. Former Indian president Pranab Mukherjee on Monday tweeted that he tested positive for coronavirus after going to the hospital for a separate procedure. The virus affects 70-year-old Kala, a chronic diabetic, and 25 year-old Pazhani, a bodybuilder who boasts of robust health. It affects slum-dweller Kamalakannan as it does Amitabh Bachchan, the billionaire matinee idol of yesteryear who still commands attention on the small screen. It has affected Amit Shah, the de facto No. 2 in the Indian government, and daily wage earner Kuppusamy. The authorities are doing their best within the existing constraints, with much of the government machinery working with unusual alacrity. There are of course the confirmed laggards, the corrupt ones and the grave robbers who stop at nothing to make a fast buck - but, by and large, an honest effort is being made. Overall, there is an overwhelming despair, especially among the elderly here, as to when all of this will end. Sadagopa Iyengar is a writer and editor of the spiritual journal Sri Nrisimhapriya, a retired banker, and the author of eight books on Vaishnavite philosophy. He also teaches Hindu scripture."}]}