{"article": [{"url": "https://www.marketwatch.com/story/new-york-city-rapidly-expands-testing-and-tracing-2020-06-16", "published": 1592326820.0, "headline": "New York City rapidly expands testing and tracing", "body": "New York City’s Test and Trace Corps—the biggest containment operation in the country—has monitored more than 4,300 people potentially exposed to the coronavirus since launching on June 1, Mayor Bill de Blasio said in his daily news conference on Tuesday morning. And that’s the tip of the iceberg for the city’s new army of contact tracers, which will be able to keep track of a quarter-million New Yorkers once the program is at full speed by the end of August, de Blasio said. Between city-sponsored testing and independent providers, 50,000 New Yorkers a day will be receiving COVID-19 tests by early July, the mayor added, a figure that would put the city “way ahead of schedule.” “We now have a whole new reality with our Test & Trace Corps,” de Blasio said. “Testing is finally starting to reach the kind of numbers we want to see.” Also see: More lockdown measures in Beijing as fresh coronavirus outbreak grows Patients being monitored by the city are being encouraged to isolate or quarantine to prevent further spread of the virus, said Dr. Ted Long, executive director of Test & Trace Corps at a briefing on Tuesday. They are also being paired as needed with resource navigators to get them food, medication, or anything else needed to safely navigate the virus. So far, the program has placed 40 people in hotel rooms who couldn’t safely quarantine at home. Other indicators in the city remain positive. As of Sunday, 52 patients were admitted to the hospital, 334 patients remained in critical care, and the rate of positive tests across the city is at 2%, all of which are considered encouraging metrics, the mayor said. The city may still delay the next phase of reopening by a few days or even until July, de Blasio reiterated on Tuesday. The mayor warned that while Phase 2 of reopening could begin as early as June 22, “I think it’s probably going to take a little longer than that just to make sure we’re absolutely certain. If folks act prematurely and that causes the disease to start spreading again, that will undermine our ability to get to Phase 2 and stay in Phase 2,” de Blasio said. See: Is America’s masked city losing its grip on safety? Phase 2 will have a much more significant impact on the day-to-day lives of city residents than Phase 1, and will include outdoor dining, reopening of more retail stores, and the reopening of barbershops and hair salons with limited services. After footage circulated of mask-less New Yorkers crowding St. Mark’s Place in the East Village late last week, Gov. Andrew Cuomo warned that “there is a very real possibility that we would roll back the reopening” in areas where “local governments are not monitoring policing, doing the compliance.” So far New York City has recorded the most severe outbreaks in the U.S., where more than 200,000 people have been diagnosed and more than 17,400 have died. (That figure rises to more than 22,000 if “probable” deaths are included.) Also see: Breaking down this ‘miracle’ COVID-19 survivor’s $1.1 million hospital bill Cuomo also addressed privacy concerns around contact tracing, saying that “demographic data” such as gender, ethnicity and ZIP Code would be shared, but other identifying information will be limited. “Other items that are under health care privacy are fully protected,” Cuomo said. “No information shared with any federal immigration agency or anything like that.”More New York developments: In his Tuesday morning news conference, Gov. Cuomo announced that 21.6% of New York City residents in a recent study tested positive for COVID-19 antibodies, an increase of 1.6% since May 1. Statewide, 13.4% of the latest sample tested positive for antibodies. Three million COVID-19 tests have been performed statewide, Cuomo said, more than any other state in the U.S., and more than any other country per capita. Statewide, 24 residents died from the coronavirus on Monday, the lowest number since the pandemic first hit the area in early March. Visitation will now be allowed in New York hospitals at each facility’s discretion, with guests required to wear personal protective equipment. Visitation is still off-limits at nursing homes, Cuomo said, but will be allowed at group homes for residents with developmental disabilities. More than 100,000 New Yorkers have called into the city’s virus hotline, 844-NYC-4NYC, to be connected to a clinician or to find a hotel room to safely quarantine in, de Blasio said."}]}