{"article": [{"url": "https://www.marketwatch.com/story/white-house-weighs-options-to-prevent-massive-job-cuts-by-airlines-2020-08-26", "published": 1598471840.0, "headline": "White House weighs options to prevent massive job cuts by airlines", "body": "The White House is considering whether it can take action to prevent thousands of job losses in the airline industry a month before the election if it cannot reach a deal with Congress on a broader package of additional pandemic relief. President Donald Trump’s chief of staff, Mark Meadows, said Wednesday that “if Congress is not going to work, this president is going to get to work and solve some problems. So hopefully we can help out the airlines and keep some of those employees from being furloughed.” This week, American Airlines AAL, +0.34% said that it will furlough 17,500 union employees, including flight attendants and pilots, and lay off 1,500 management and support staff in October. It said it will make the cuts unless Washington provides another $25 billion to help passenger airlines cover payroll costs through next March. Delta DAL, +0.39% said it will furlough 1,941 pilots unless their union agrees to cost-cutting measures. The airlines and their unions are putting pressure on Congress and the White House to approve more taxpayer help for their industry. Earlier this year, Congress and Trump agreed on a $2.2 trillion package of pandemic relief that contained $50 billion in grants and loans for passenger airlines, including the payroll money. The airlines were prohibited from terminating employees while taking the grants, but the cash and the ban on furloughs end Sept. 30. Airlines and their labor unions have lined up support from bipartisan majorities in the House and Senate. However, the fate of the proposal is uncertain because negotiations between the White House and congressional Democrats over a larger virus-relief package have stalled. Meadows said Trump has spoken with people at American Airlines, United Airlines UAL, +0.32% and Delta Air Lines. Sara Nelson, the president of the Association of Flight Attendants, said Meadows’ remarks indicate that the lobbying by airline unions is working. She said, however, that “executive orders will not save our jobs,” and that approval by Congress is still needed. When Washington first approved airline aid, it was designed to help the carriers survive until air travel and ticket sales improved. While there was a pickup in late spring, the recovery stalled in July and August. More ominously, the industry’s global trade group, the International Air Transport Association, predicts that air travel won’t return to 2019 levels until 2024. That could set the stage for many more rounds of lobbying for additional aid."}]}