{"article": [{"url": "https://www.marketwatch.com/story/disney-in-the-age-of-covid-19-for-now-disney-may-be-the-only-plus-2020-04-07", "published": 1596528200.0, "headline": "Disney+ was the only plus for Disney as coronavirus slammed other businesses", "body": "This article is part of a series tracking the effects of the COVID-19 pandemic on major businesses, and will be updated. It was originally published on April 7. Perhaps no company has endured a greater existential financial crisis in the age of COVID-19 than Walt Disney Co., a legendary company built on social interaction that has leaned heavily on its newest business for relief. This was brutally clear in May, when Disney DIS, +1.53% said earnings plummeted more than 90% in its fiscal second quarter. “While the COVID-19 pandemic has had an appreciable financial impact on a number of our businesses, we are confident in our ability to withstand this disruption and emerge from it in a strong position,” said Bob Chapek, who took over as chief executive of Disney from Robert Iger during the quarter. Read more: Disney earnings plummet more than 90% as coronavirus wipes out more than $1 billion The Mouse House faces adversity in its three core business units. The theme-park business faces the most negative impact as the signature Disneyland amusement park in California, which first opened in July 1955, is shut down for only for the fourth time in its history. Disney World in Florida reopened under strict rules on July 11 after it was shuttered nearly four months. Disney Cruises is docked. Parks, experiences and products is Disney’s largest business segment, ringing up $26.2 billion in sales last year. Business in the age of COVID-19: Read how other large companies will be affected by the coronavirus All live-action film production stopped in the company’s movie division, and the Aug. 21 premiere of the big-budget remake of “Mulan” has been delayed indefinitely as most theaters remain dark across the country. Disney-produced movies, not including Searchlight Pictures or 20th Century, hauled in $1.54 billion in North American sales last year. The TV side, where Disney’s media networks generated $24.8 billion in revenue last year, is equally vexing. While the company’s TV properties continue to air, major sports like baseball (July 23) and the NBA (July 30) have returned to Disney-owned ESPN. The status of Major League Baseball’s truncated 60-game season teeters on collapse with the outbreak of COVID-19 among players and staff of the Miami Marlins. If that isn’t enough to unnerve jittery investors, there is the matter of Robert Iger. In February, Iger announced he was immediately stepping down as CEO after 15 years and sliding over to head creative development. Bob Chapek, who steered parks, experiences and products, was anointed Iger’s successor. That division, the company’s biggest, brought in $26.2 billion last year. See also: Disney CEO Robert Iger steps down; company veteran Bob Chapek takes reins While the entertainment empire wobbles, Disney’s newest business and underlying diverse businesses offer short- and long-term hope. Streaming service Disney+ has flourished with an infusion of fresh content, led by the megahit “Hamilton,” and more people forced to stay at home. The movie version of Lin-Manuel Miranda’s Pulitzer Prize- and Tony Award-winning musical of the founding father’s life premiered over the July 4 weekend, and was downloaded 752,451 times globally on the Disney+ app, including 458,796 times in the U.S., according to analytics firm Apptopia. As of early May, the service had 54.5 million subscribers world-wide just six months after its launch. It costs $6.99 a month or $69.99 a year in the U.S. Disney+ takes on greater significance because the company has stopped production on live-action movies or postponed their release at the same time major theater chains like AMC Entertainment Holding Inc. AMC, -2.17% offer limited seating or nothing at all. “Mulan,” for example, was expected to bring in between $80 million and $100 million during its original opening weekend in theaters back in late March. Disney is pushing movies that were already released to theaters to the streaming service faster than it normally would have, as it seeks to drive Disney+ subscriptions. In addition to “Hamilton,” “Frozen II,” which racked up $1.45 billion at the box office, was made available on Disney+ three months earlier than planned. Disney also is adding a new Muppets series, “Muppets Now” (July 31), and premiered movies like “The Mighty Ducks” (July 3). Disney+ premieres in Europe on Sept. 15 and in Latin America in the second half of 2020. Disney rivals Netflix Inc. NFLX, +1.43% , Apple Inc. AAPL, +1.74% , and Amazon.com Inc. AMZN, +3.01% have ratcheted up content the past few months to draw new customers. Meanwhile, Comcast Corp.’s CMCSA, -0.99% Peacock (July 15) and AT&T Inc.’s T, -1.01% HBO Max (May 27) debuted. See also: Disney+ may be the only plus for Disney as coronavirus slams other businessesHow the numbers are changing Revenue: Average analyst expectations were $19.56 billion at the end of 2019, but have declined to $12.39 billion as of Aug. 4. Estimates for each of the business segments — media networks ($6.94 billion to $6.3 billion). Parks, experiences and consumer products ($6.58 billion) and studio entertainment ($2.97 billion) were not broken out by FactSet, reflecting their dormant status for Q3. Earnings: Average analyst expectations were $1.20 per share at the end of 2019, but have declined to a loss of 64 cents a share as of Aug. 4. Disney is scheduled to report its fiscal third-quarter results after-hours. Stock movement: Shares of Disney have slumped 20.5% in 2020. Through the first half of March, Disney lost more than $85 billion in market value and its stock price slipped below $100 for the first time since October 2017, prompting one hyperventilating analyst to suggest it could be an acquisition target of Apple. What the company is saying July 23: The company announced “Mulan” — scheduled for release Aug. 21, and expected to be a summer blockbuster — has been delayed indefinitely because of theater closures and production shutdowns caused by the pandemic. Additionally, Disney delayed releases of Star Wars and Avatar movies by a year. “Over the last few months, it’s become clear that nothing can be set in stone when it comes to how we release films during this global health crisis, and today that means pausing our release plans for ‘Mulan’ as we assess how we can most effectively bring this film to audiences around the world,” a Walt Disney Studios spokesperson said in a statement. The company kept the release dates of “Black Widow” (Nov. 6) and “The King’s Man” (Sept. 18) intact, so “Mulan” could still get released theatrically in the U.S. sometime in the fall. July 11: Disney World in Orlando, Fla., reopens after nearly four months with new rules to help prevent the spread of coronavirus. Epcot and Disney’s Hollywood Studios follow four days later. The reopening, however, comes amid a huge surge of COVID-19 cases in Florida that now top 430,000. May 9: Disney reported a fiscal second-quarter profit of $460 million, or 26 cents a share, on sales of $18.01 billion, up from $14.9 billion in the year-ago quarter, which included only a few days of results from Disney’s $71 billion acquisition of Fox assets. April 2: The company announced employees would be furloughed as of April 19 due to the COVID-19 pandemic. “With no clear indication of when we can restart our businesses, we’re forced to make the difficult decision to take the next step and furlough employees whose jobs aren’t necessary at this time,” according to a statement emailed to MarketWatch. See also: Disney to furlough employees later this month March 19: In an SEC filing, Disney acknowledged COVID-19 has impacted so many of its business segments that it’s becoming more challenging for the company to estimate its future performance. Disney reported it could lose $280 million in revenues due to park closures in Shanghai and Hong Kong alone. Coronavirus “makes it more challenging for management to estimate future performance of our businesses, particularly over the near to medium term,” Disney disclosed. “We have closed our theme parks; suspended our cruises and theatrical shows; delayed theatrical distribution of films both domestically and internationally; and experienced supply chain disruption and ad sales impacts,” the company said. “In addition there has been a disruption in creation and availability of content we rely on for our various distribution paths, including most significantly the cancellation of certain sports events and the shutting down of production of most film and television content,” the company said. What analysts are saying • “While the continued delay of theatrical films remains an uncertainty for DIS shares, we maintain our positive view given the reopening of theme parks, the return of at least some sports and content production, and continued rollout of Disney+, all of which should drive outperformance ahead.” — J.P. Morgan analyst Alexia Quadrani, who retained an overweight rating, and a price target of $135 on July 24. • “Because many of DIS’s other business segments are paused during COVID-19 (ie, theme parks, cruise ships, film releases, etc.) we believe DIS is the biggest beneficiary of live sports returning to TV. Also, many sportswriters talk about the ‘Big 3’ (ie, NFL, MLB and NBA). Their disproportionate importance is demonstrated in Table 1 as $4B, (ie 70%) of DIS’s media rights fees are paid to the Big 3 leagues, out of the 13 total sports leagues that DIS paid in 2019.” — Needham analyst Laura Martin, who maintained a hold rating on Disney but does not list a price target, on July 21. • “With the spread of COVID-19 having accelerated in the U.S., we expect a prolonged impact to Disney’s parks and film businesses... We had previously assumed that the spread of COVID-19 would be relatively halted, with social distancing requirements significantly lessened, by late 2020. We have now extended that timeline out to at least mid-2021; the situation remains very fluid and we do not rule out the possibility that the impact could last even longer.” — Cowen analyst Doug Creutz, who downgraded Disney to market perform from outperform, and whittled his price target to $97 from $101 on July 16. • “We believe the market is undervaluing its [direct-to-consumer] segment by >50%, based on our outlook for Disney+ reach to 150mn subs by 2025 and to achieve profitability by F2021 (consensus F2023). We also expect that DIS’s Parks and Studios segments will fully recover post-COVID, and that synergies with DTC are underappreciated.” — Goldman Sachs analyst Brett Feldman, who initiated a buy rating, and a price target of $137 on July 13."}]}