{"article": [{"url": "https://www.marketwatch.com/story/silver-trades-at-levels-not-seen-since-2014-and-is-up-more-than-80-from-2020s-low-2020-07-21", "published": 1595341340.0, "headline": "Silver logs highest finish since 2014, up more than 80% from 2020â\u0080\u0099s low", "body": "Silver rallied Tuesday to finish at its highest level since 2014, up by more than 80% from the yearâ\u0080\u0099s low, benefiting as both a precious and industrial metal as it looks to catch up with goldâ\u0080\u0099s impressive year-to-date performance. â\u0080\u009cSilver was long due for a catch-up with gold,â\u0080\u009d said Peter Grosskopf, chief executive officer at Sprott Inc. â\u0080\u009cAs a much smaller market, once investor interest enters in size, its supply side gets swamped.â\u0080\u009d As some parts of the global economy start to improve after COVID-19 shutdowns, silverâ\u0080\u0099s â\u0080\u009cindustrial supply and demand side have balanced,â\u0080\u009d Grosskopf told MarketWatch. â\u0080\u009cThat creates a window for the wave of investment demand to push the price much higher.â\u0080\u009d In Tuesday trading, September silver contract US:SIU20 Â rose $1.37, or 6.8%, to settle at $21.557 an ounce on Comex. Prices based on the most-active contracts marked their highest settlement since March 2014, according to Dow Jones Market Data. They trade 83% above the year-to-date low of $11.772 seen on March 18, which was the lowest since January 2009. Silver prices had settled early last week, and again on Monday, at the highest since September 2016. Read:Why silver is trading at a nearly 4-year high Gains for silver compare with a climb in gold futures to their highest price in nearly nine years. On Tuesday, August gold US:GCQ20 Â rose $26.50, or 1.5%, to settle at $1,843.90 an ounce. Year to date, most-active gold futures trade about 21% higher, while silver is up by roughly 20%. Silver has seen the â\u0080\u009cbest of both worlds,â\u0080\u009d with its precious metal side boosted by safe-haven demand, as economies in China and the U.S. improve, proving the metal a lift as an industrial metal, said Jim Wyckoff, senior analyst at Kitco.com. Silver trades in the lower half of its historical trading range, and has â\u0080\u009cmuch more upside potential,â\u0080\u009d he told MarketWatch. Gold is not far from its all-time high, but silver still has long way to go before it nears its record high, making silver look â\u0080\u009cundervaluedâ\u0080\u009d to investors, he said. “ The all-time high for silver; in the coming years is not out of reach, and maybe much sooner than anybody thinks.â\u0080\u0099 ” â\u0080\u0094 Jim Wyckoff, Kitco.com The record settlement level for most-active gold futures stands at $1,891.90 from August 22, 2011. Silver futuresâ\u0080\u0099 all-time settlement high was at $48.599 in April 2011, according to FactSet data. Ross Norman, chief executive officer of precious metals news and information provider Metals Daily, said now that silver has rallied, â\u0080\u009cthis frees gold up to continue what has already been an impressive rally,â\u0080\u009d and both metals are â\u0080\u009cbetter aligned.â\u0080\u009d â\u0080\u009cSilver has seen very strong inflows into both the [exchange-traded funds] and in the futures market on Comex, prompting a breakout on the charts,â\u0080\u009d he told MarketWatch. Given that, Metals Daily has adjusted its second-half 2020 forecast on the metal to $25, up from a previous forecast of $23. â\u0080\u009cGlobal macro events are positive precious metals and even though silver is partly an industrial metal, it is a case of a rising tide lifting all boats,â\u0080\u009d said Norman. As for how high silver prices may go from here, Grosskopf said silver has â\u0080\u009cmore torqueâ\u0080\u009d to move up than gold, and â\u0080\u009cintermediate chartsâ\u0080\u009d point to $30 an ounce. Wyckoff, meanwhile, would only say that the all-time high for silver â\u0080\u009cin the coming years is not out of reach, and maybe much sooner than anybody thinks.â\u0080\u009d"}]}