{"article": [{"url": "https://www.marketwatch.com/story/extending-tax-cuts-and-lowering-rates-on-long-term-capital-gains-what-a-second-term-for-donald-trump-could-mean-for-your-taxes-11599646067", "published": 1600170440.0, "headline": "Possible payroll tax cuts and lowering rates on long-term capital gains - what a win for Donald Trump could mean for your taxes", "body": "Tax Guy presents the federal income tax changes that President Donald Trump has said he would like to see if he wins reelection. (Photo: MarketWatch photo illustration/Getty Images, iStockphoto) The presidential campaigns of President Donald Trump and former Vice President Joe Biden are gaining momentum. One important issue will be taxes. One potential move that has received a lot of attention in recent weeks: possible cuts to the payroll tax. Payroll taxes are taxes paid on the wages and salaries of staff, and are used to finance social-insurance programs, including Social Security and Medicare. See also: Biden's 401(k) plan: Changing tax incentive for retirement is a great idea According to recent research by the Tax Foundation, a Washington, D.C.-based think tank, \"These social insurance taxes make up 23.05% of combined federal, state, and local government revenue - the second largest source of government revenue in the United States.\" \"Social Security is in trouble regardless of whoever is in the White House,\" MarketWatch columnist Paul Brandus wrote this month. \"It is now paying out more than it is taking in and by 2031, the nonpartisan Congressional Budget Office said this week, its current surplus of some $2.9 trillion is projected to be tapped out.\" \"This is a huge change. As recently as late April, the Social Security Trustees, led by chief Trustee Steven Mnuchin, said the surplus would last until 2035. So in just four months, Social Security's day of reckoning has accelerated by four years,\" he added. Last month, Trump also said that his administration might reduce taxes on capital gains. White House economic adviser Larry Kudlow has long been an advocate for the indexing of capital gains. \"An actual cut of the rate (currently 20%) would require the support of Congress, although an executive order allowing the indexing of capital gains to inflation might be a realizable objective,\" Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets, said in a note. Here are the federal income tax changes that President Trump would like to see if he wins reelection, according to the Tax Foundation, a right-leaning think tank focused on tax policy. Extend existing individual tax rate cuts beyond 2025 The Tax Cuts and Jobs Act (TCJA) lowered five of the seven individual federal income tax rates for 2018-2025. Those rates are now 10%, 12%, 22%, 24%, 32%, 35%, and 37%. After 2025, rates are scheduled to revert to the seven pre-TCJA percentages, with inflation adjustments to the bracket thresholds. If that happens, the rates for 2026 and beyond would be 10%, 15%, 25%, 28%, 33%, 35%, and 39.6%. At a minimum, Trump would extend the existing TCJA rate regime beyond 2025. He has also floated the idea of a middle-class tax cut but has not provided specifics.  Cut maximum tax rate on individual long-term capital gains The TCJA retained the three pre-existing federal income-tax rates on net long-term capital gains and qualified dividends: 0% for individuals with modest incomes, 15% for most individuals, and 20% for individuals with really high incomes. The Trump tax plan would reduce the maximum rate to 15%. After adding on the 3.8% net investment income tax (NIIT), the maximum effective rate would be reduced from the current 23.8% (the advertised 20% top rate plus the unadvertised 3.8% for the NIIT) to 18.8% (15% plus 3.8%).  Trump has also talked about the idea of making annual inflation adjustments to the rate brackets for net long-term capital gains and qualified dividends. Extend the increased child tax credit The TCJA allows parents to collect a larger credit of up to $2,000 for each under-age-13 qualifying child for 2018-2025. Trump would extend the larger credit beyond 2025.What about other TCJA individual tax provisions? Beyond the individual rate cuts and the increased child tax credit, other important TCJA provisions affecting individual taxpayers are scheduled to disappear after 2025. These include greatly increased standard deduction amounts; more favorable alternative minimum tax rules; the deduction for up to 20% of qualified business income (QBI) from sole proprietorships, LLCs, partnerships, and S corporations; disallowed personal and dependent exemption deductions; and limitations on itemized deductions for home mortgage interest and state and local taxes. The White House budget document for the government's 2021 fiscal year (which starts on 10/1/20) indicates support for extending these other TCJA individual tax provisions beyond 2025.New tax breaks to spur business activity and create jobs Without providing specifics, President Trump has called for a new \"Made in America\" tax credit. He has said he would also continue the existing Opportunity Zone program, which is intended to encourage investment in economically distressed census tracts by providing capital gains tax relief for individuals and businesses that make qualified investments in those areas. Trump has said he would establish a new tax credit for companies that bring back jobs from China, but has not explained the details of that idea. He has said he would also allow 100% first-year expensing for certain industries, including pharmaceuticals and robotics, that bring manufacturing back to the United States. Details are lacking. Possible payroll tax relief and cuts President Trump has called for forgiveness for federal payroll taxes that are temporarily deferred by his Executive Order for 9/1/20 through 12/31/20. He has also mentioned permanent payroll tax cuts, without providing details.  Unanswered questions After 2022, the 100% first-year bonus depreciation break for qualified business expenditures will begin to phase out under current tax law. After 2022, research and development costs must be amortized over five years rather than deducted in Year One unless things change. Several COVID-19 federal tax relief measures for businesses will also disappear unless things change. The White House budget document for the government's 2021 fiscal year (which starts on 10/1/20) does not address expiring business tax breaks.The bottom line    This column summarizes discernable tax positions that President Trump is expected to advocate if he is reelected to a second term. Specifics are mostly lacking, and any post-election tax changes would have to get through both the House and the Senate. Unless the Republicans regain control of the House and retain control of the Senate, any tax cut proposals would likely face tough sledding through at least 2022 when the next midterm election will take place. While we may or may not see any tax cuts in 2021-2022, we probably won't see many tax increases in those years if President Trump is reelected. Finally, Trump's tax positions may become more detailed as his campaign unfolds over the next few weeks. Stay tuned.          "}]}