{"article": [{"url": "https://www.marketwatch.com/story/we-have-polls-that-show-me-leading-in-almost-every-swing-state-trump-says-2020-07-27", "published": 1595869040.0, "headline": "â\u0080\u0098We have polls that show me leading in almost every swing state,â\u0080\u0099 Trump says", "body": "President Donald Trump on Monday sounded upbeat about the state of his re-election campaign, as he talked up his teamâ\u0080\u0099s internal polls and dismissed surveys that put Democratic challenger Joe Biden ahead of him. â\u0080\u009cWe have polls that show me leading in almost every swing state and substantially in other states by even more than I won in â\u0080\u009916,â\u0080\u009d Trump said during a news conference in North Carolina. The presidentâ\u0080\u0099s comments during a trip to the Fujifilm Diosynth Biotechnologies Innovation Center in Morrisville, N.C., are similar to what his new campaign manager, Bill Stepien, said on Friday. Stepien said pollsters â\u0080\u009ckeep getting it wrongâ\u0080\u009d as he projected confidence about the state of the White House race. In a RealClearPolitics average of polls focused on top swing states, Biden leads Trump by 6.2 percentage points as of Monday. â\u0080\u009cThereâ\u0080\u0099s more spirit now than thereâ\u0080\u0099s ever been for my campaign, and that includes 2016,â\u0080\u009d the president also said on Monday. â\u0080\u009cThereâ\u0080\u0099s more today because what weâ\u0080\u0099ve done nobodyâ\u0080\u0099s ever done before.â\u0080\u009d Trump cited accomplishments such as cuts to taxes and regulations, the creation of the Space Force and â\u0080\u009csaving tens of millions of jobs in energy XLE, -1.59%. â\u0080\u009d But meanwhile, a poll out Monday has found that more Americans say the country is heading in the wrong direction than at any previous point in Trumpâ\u0080\u0099s presidency. Approval for his handling of the COVID-19 pandemic has fallen to a new low, too. During his remarks, Trump talked up progress on possible coronavirus vaccines, including Moderna Inc.â\u0080\u0099s MRNA, +0.09% Â candidate that has started Phase 3 trials. He said: â\u0080\u009cThis is the fastest a vaccine for a novel pathogen has ever gone.â\u0080\u009d"}]}