{"article": [{"url": "https://www.marketwatch.com/story/ive-had-to-work-hard-for-everything-i-have-in-life-i-hate-that-my-friends-still-get-help-from-their-parents-and-were-born-into-money-2020-06-24", "published": 1594565060.0, "headline": "I hate that my friends still get help from their parents and were born into money. I want to stop comparing. How can I do this?", "body": "Dear Moneyist, I am an avid reader of your column and have realized a pattern in myself that I am less than proud of. I am in my early 30s, and my partner is in her late 20s. We do well for ourselves, we travel, we aren’t struggling. I own a nice home in a town a few hours away that I rent out because I recently moved to the city. We are renting in the city now to save money. We have a roommate, and I feel that some friends judge us for this. Our friends are successful and all around our age. They are building extravagant homes, making what I believe to be more money than us, and I can’t help but be green with envy and always comparing what they have to what we don’t. Dispatches from a pandemic: Letter from New York: ‘New Yorkers wear colorful homemade masks, while nurses wear garbage bags’ I hate that my friends still get help from their parents and were born into money. They have no student-loan debt, one friend is a lawyer and her parents paid for that degree. One couple got their land for their home paid off by their family. I have had to work hard for everything I have in life, as well as my partner, and it’s just hard seeing them get ahead while we feel like we’re stagnant. I want to be happy for them and stop comparing. How can I do this? Feeling Green Dear Green, Your feelings about your friends are as real as your feeling that they’re judging you for having a roommate. They are as real as you believe them to be. While you reflect upon your own relatively modest circumstances, I would bet that your lodger is the last thing on their minds. We all belong to infinitesimally small social groups: our family, friends, coworkers, neighbors, school friends and/or college alumni. Regaining perspective on your life and your finances is sometimes a more difficult task than it sounds. Do we look beyond our neighborhood, social group, country or need to fly to the moon? It’s better to look inward than beyond the garden gate. The Green-Eyed Monster likely resides somewhere in your past. On an intellectual level, you know that this has zero to do with how you feel about your friends: You clearly wish them well. Nor does it have anything to do with how they feel about you: They likely admire you for reasons you have never considered. This has everything to do with how you feel about yourself. “ Regaining perspective on your life is sometimes a more difficult task than it sounds. Do we look beyond our neighborhood, social group, country or need to fly to the moon? ” Each one of these groups can make us feel “high status” or “low status.” That’s an exercise I learned as a kid in drama school. We’d each take turns being the snooty shopkeeper and nervous customer. But this scenario plays out in real life, too. Here’s the weird part: We can read about Hollywood actors or people who have valiantly survived some terrible calamity, and feel curiously numb. Movie stars may have a $20 million Beverly Hills home, but they make up a constellation of Greek gods, right? We are merely orbiting their firmament. Why on earth would we or they feel wanton? Surely, they don’t have real problems. And people who earn less in a month than some Americans do in an hour ? They’re a world away from our experiences, aren’t they? Don’t miss:‘We will not have a vaccine by next winter.’ Like the 1918 Spanish flu, CDC says second wave of coronavirus could be worse. So what happens now? The more we have, the more we feel like we don’t have enough. And we’re all chasing something. That’s why they call it a rat race. Rats are not the most delicate of creatures, but they sure know how to run. “Our sense of an appropriate limit to anything — for example, to wealth and esteem — is never decided independently,” the philosopher Alain de Botton writes in his book “Status Anxiety.” That treatise chops, dices and vacuum packs the age-old malady of consumerism, and how we all compare ourselves to others. “It is decided by comparing our condition with that of a reference group, with that of people we consider to be our equals. We cannot appreciate what we have in isolation, nor judged against the lives of our medieval forbearers,” Botton adds. “ This status consciousness starts with our siblings getting a bigger dollop of ice cream or the largest dinner plate, and ends up with us grumbling about the annex on our neighbor’s house. ” “If we have a pleasant home and comfortable job, however, but learn through ill-advised attendance at a school reunion that some of our old friends (there is no stronger reference group) are now living in houses larger than our own, bought on the proceeds of more enticing occupations, we are likely to return home nursing a violent sense of misfortune,” he writes. “It is the feeling that we might be something other than what we are — a feeling transmitted by the superior achievements of those we take to be our equals — that generates anxiety and resentment,” he adds. “If we are small and live among people who are all of own height, we will not be unduly troubled by questions of size.” What do I do to right-size myself? When I lived in London in my 20s, I visited the National Portrait Gallery when I was feeling blue. I would gaze at people who lived hundreds of years ago: Peasants, royalty, aristocrats or, perhaps, a portrait of a young man sitting wistfully in a window contemplating nothing but the day. It always put my own trials and tribulations in perspective. I felt grateful to have leisure time that a textile worker during the Industrial Revolution could only dream of. Time is the most valuable commodity we have. It’s a brutal wake-up call, and a useful reminder that this “compare and despair” does not always change along with our improved circumstances. This status consciousness starts with our siblings getting a bigger dollop of ice cream or the largest dinner plate, and ends up with us grumbling about the annex on our neighbor’s house. Call up one of your wealthy friends, and ask them how they’re doing. And then call up another friend who has far less than you. You may be surprised to discover that they have a lot in common. The Moneyist: My son is staying with me, yet my financially irresponsible ex-husband received his $500 stimulus check. Is my ex right to keep it? You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com. Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% group where we look for answers to life’s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}