{"article": [{"url": "https://www.marketwatch.com/story/my-husband-and-i-are-worth-37-million-but-im-afraid-ill-spend-my-way-into-the-poor-house-if-he-dies-before-me-before-we-married-i-bounced-checks-what-can-i-do-2020-08-20", "published": 1598844620.0, "headline": "My husband and I are worth $3.7 million, but I'm afraid I'll spend my way into the poor house if he dies. When I was single, I bounced checks. What can I do?", "body": "Dear Moneyist, I am a 65-year-old woman married to a great guy for decades. We have no children. He earns all the money and handles all our finances. During my entire life I have not been a good money manager. I love to spend money and have a head-in-the-sand approach to money problems. Before our marriage, I bounced checks often. My fear is that I will outlive my husband, and then have no one to check my spending impulses. We owe less than $200,000 on our home, which is valued at over $2.5 million. We have another $1.2 million in retirement funds. He has a $1 million life-insurance policy. We intend to retire within three years, sell this home, and relocate within California to a smaller home costing around $450,000. So, should he predecease me, I will have possibly a huge sum of money at my disposal. At the moment, we have a family trust and living wills. Is there something we could set up to make sure I don't spend myself into the poor house? Spendthrift in California The Moneyist: 'I'm astounded that I have NOT received my payment': When will I receive my stimulus check? Dear Spendthrift, Your husband could set up a trust for you that gives you a monthly income, with provisions for emergencies, and you can talk to a financial planner about all of those options. That continues the model you have both set up for yourselves now: He manages the money, you go along with his decisions, and he oversees how you spend and manage your money. You can only learn how to manage a household budget, prioritize bills, refrain from making impulsive purchases and put something aside for a rainy day if you actually do it. The best time to start is now, not when your husband passes away, assuming he predeceases you. This column is about money, but it's also about relationships, and chief among those is the relationship we have with ourselves. Starting today, you can learn about income and expenditure, and/or having an account for an emergency fund in case you get sick or require a new car or a roof on your home. Your husband can help you, of course, but I suggest taking a money-management class in an effort to build your confidence and become more independent. You don't want a trust to replace your husband. The Moneyist: My mother's will says her boyfriend can live in her home after she dies. Can I still kick him out if the deed is transferred to me? We all have things that we put off in life - that one thing that we hold onto that holds us back. It could be related to finance or romance. Or, in this case, both. The key is to ask yourself why you do it and why you are comfortable with your husband taking care of all of your needs, even though you know your Jiminy Cricket is tapping you on the shoulder to say, \"This is not 100% healthy for you.\" A financial therapist or counselor can help you with that too. The biggest lie we tell ourselves is that all the money decisions we made in life were based on our \"adulting\" or being a grown up, or taking decisive action and empowering ourselves. Every decision, whether it's buying a new pair of shoes, selling or buying stocks, or even purchasing a house, is on some level an emotional one. Why do you allow your husband to take care of the finances, even though you know it may leave you at a disadvantage if he predeceases you? Why do you like having those boundaries around spending set by others rather than yourself? It may be familiar territory to you. It could make you feel safe and protected and cared for, even if it doesn't make the adult in you feel good about yourself. In many ways, embarking on this journey is exciting. It's a gift you are giving yourself. Learning more about your motivations and behavior will be invaluable, especially if your husband passes away and you are left to deal with life alone. Every time you make a smart decision, you can say, \"My husband would be proud.\" But you can also say, \"I am proud of myself. I did this alone. I'm doing OK.\" You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26%  group where we look for answers to life's thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns. Coronavirus update: As of Monday, COVID-19 has infected over 25 million people worldwide, which mostly does not account for asymptomatic cases, and killed 846,436. The U.S. still has the world's highest number of COVID-19 cases (5,997,163), followed by Brazil (3,862,311), India (3,621,245) and Russia (987,470), according to data aggregated by Johns Hopkins University. In the meantime, cases keep rising in the U.S. with California becoming the first state in the country to surpass 700,000 confirmed cases; infections there hit 705,951 as of Monday with 12,937 COVID-related deaths. New York has recorded 434,100 infections and the highest number of deaths in the U.S. (32,951). COVID has killed 183,069 people in the U.S. AstraZeneca AZN, +1.16%, in combination with Oxford University; BioNTech SE BNTX, +1.23% and partner Pfizer PFE, -0.27% ; GlaxoSmithKline GSK, +1.10% Johnson & Johnson JNJ, +1.39% ; Merck & Co. MERK, +1.59% ; Moderna MRNA, +0.09% ; and Sanofi SAN, -1.48% are among those currently working toward COVID-19 vaccines. The Dow Jones Industrial Index DJIA, +0.56%, S&P 500 SPX, +0.87% and Nasdaq Composite COMP, +1.39% ended higher Friday, framed largely by a speech from Federal Reserve Chairman Jerome Powell that likely ushered in an era of looser monetary policy after the central bank dropped its longstanding practice of preemptively lifting rates to head off higher inflation."}]}