{"article": [{"url": "https://www.marketwatch.com/story/better-than-expected-jobs-report-will-further-complicate-negotiations-on-next-coronavirus-relief-package-analysts-say-2020-08-07", "published": 1596875240.0, "headline": "Next coronavirus aid package probably won't become reality this month after better-than-expected July jobs report, analyst says", "body": "Friday's jobs report isn't helping the talks on Capitol Hill over another big coronavirus relief package, according to some analysts. The report showed the U.S. economy regained 1.8 million jobs in July as unemployment fell 10.2%. Economists polled by MarketWatch had expected a gain of 1.7 million jobs and an unemployment rate of 10.6%. See:U.S. adds 1.8 million jobs in July as hiring slows after fresh coronavirus outbreak Also read:Here's 'the real surprise' in the July jobs report as economists react to the data \"The better-than-expected outcome will further complicate negotiations on the next fiscal stimulus package that have entered a difficult phase amid gridlock on UI, state-and-local spending and election funding and recriminations,\" said Evercore ISI analysts Krishna Guha and Ernie Tedeschi in a note. UI refers to unemployment insurance, which had been enhanced by $600 by March's CARES Act but the extra benefit has now expired. Republican lawmakers are \"likely to perceive that the jobs report gives them some more leverage,\" the Evercore analysts added. Henrietta Treyz, director of economic policy research at Veda Partners, said she now views an agreement in August as unlikely, after earlier this week saying there was a 65% to 75% chance for that deal this month. \"In the wake of today's jobs numbers and extensive conversations with staff on Capitol Hill and other advisors that make it clear there is almost no urgency at this point from either Democrats or Republicans to meet in the middle, we are revising our odds downward from 65%-75% that a deal will be reached in August, to now 65-75% this deal will be reached in September,\" she wrote in a note. \"There is a very slim chance that a deal could still be resuscitated from here and pass next week (25-35%), but that is no longer our base case.\" James Knightley, chief international economist at ING, also was sounding more downbeat on a deal being reached. \"While today's report is certainly better than expected, from a medium-term perspective it is possibly the worst outcome,\" he wrote. \"It doesn't intensify the pressure on politicians in Washington to compromise on a new fiscal deal, which means that the US$600/week unemployment benefit that ended last weekend will not be replaced with anything for at least another week, so 31 million people will continue to experience a considerable drop in their incomes at a time when job availability is becoming more scarce.\" U.S. stock indexes SPX, +0.87%  DJIA, +0.56%  recently were trading slightly lower in the wake of the jobs report. Now read:Pelosi, McConnell trade blame as coronavirus deal standoff continues"}]}