{"article": [{"url": "https://www.marketwatch.com/story/sanders-to-blast-trumps-stance-on-transfer-of-power-as-dangerous-as-romney-says-its-unacceptable-11600966422", "published": 1600952480.0, "headline": "Sanders blasts Trump's stance on transfer of power as 'dangerous,' as Romney says it's 'unacceptable'", "body": "\"There won’t be a transfer frankly,\" Trump said Wednesday. \"There’ll be a continuation.\" MarketWatch photo illustration/Getty Images|, iStockphoto If President Donald Trump loses the election, don't expect him to hand over his keys to the Oval Office to the winning candidate. That's the message Trump conveyed on Wednesday in response to a reporter's question regarding whether he'd commit to a peaceful transfer of power. \"We're going to have to see what happens,\" Trump said. \"You know that I've been complaining very strongly about the ballots, and the ballots are a disaster.\" \"You'll have a very peaceful - there won't be a transfer frankly,\" Trump added. \"There'll be a continuation.\" White House Press Secretary Kayleigh McEnany said Thursday that Trump \"will accept the results of a free and fair election.\" But Trump's own refusal to commit to a peaceful transfer of power has ignited rage across the political spectrum. \"The winner of the November 3rd election will be inaugurated on January 20th,\" Senate Majority Leader Mitch McConnell, R-Ky., tweeted on Thursday. \"There will be an orderly transition just as there has been every four years since 1792.\" Sen. Mitt Romney, a Republican from Utah and former presidential nominee in 2008, said that peaceful transition of power is \"fundamental to democracy.\" \"Without that, there is Belarus,\" Romney added referring to the country's newly sworn-in president, Alexander Lukashenko. The European Union does not recognize him as the legitimate president of the country after he held a secretive ceremony earlier this week. \"Any suggestion that a president might not respect this Constitutional guarantee is both unthinkable and unacceptable,\" Romney said in his tweet posted on Wednesday. \"I'm absolutely confident there will be a peaceful transition if there's a new president or, if not, we'll have a continuation,\" Romney told reporters on Thursday. Sen. Bernie Sanders, an Independent from Vermont who dropped out of the presidential race in April, labeled Trump's comments as \"authoritarian.\" He added that they are \"dangerous\" to our democracy and \"something that in my wildest dreams I never thought I would be discussing.\" \"I am not in the habit of quoting former President Ronald Reagan,\" Sanders said at an event in Washington, D.C., on Thursday. He went on to read an excerpt from the January 1981 inaugural speech Reagan made: \"The orderly transfer of authority as called for in the Constitution routinely takes place as it has for almost two centuries and few of us stop to think how unique we really are. In the eyes of many in the world, this every 4-year ceremony we accept as normal is nothing less than a miracle.\" \"Too many people have fought and died to defend American democracy, and you [Trump] are not going to destroy it,\" Sanders said. \"The American people will not allow that to happen.\" House Speaker Nancy Pelosi agreed with Romney that a peaceful transition would occur, but said it was sad the question even had to be asked, blaming Trump. \"I remind him - you are not in North Korea, you are not in Turkey, you are not in Russia, Mr. President,\" she said. \"You are in the United States of America. It is a democracy. So why don't you try for a moment to honor your oath of office to the Constitution?\" Trump's Democratic challenger Joe Biden responded to his comments on Wednesday asking, \"What country are we in?\" \"Look, he says the most irrational things. I don't know what to say,\" Biden added."}]}