{"article": [{"url": "https://www.marketwatch.com/story/go-play-football-trump-says-urging-schools-to-reopen-in-fall-11597276365", "published": 1597262420.0, "headline": "â\u0080\u0098Go play football,â\u0080\u0099 Trump says, urging schools to reopen in fall", "body": "President Donald Trump said the government would be providing \"up to 125 million reusable masks\" to schools across the country that reopen. AFP/Getty Images President Donald Trump on Wednesday unveiled six new recommendations for schools that reopen this fall. Encouraging widespread use of face masks and â\u0080\u009cminimizing large indoor gatheringsâ\u0080\u009d were two of those recommendations. Throughout the course of the pandemic, Trump has strongly advocated for schools to reopen across the country. At one point he even threatened to cut funding to schools that donâ\u0080\u0099t hold in-person learning. â\u0080\u009cWe cannot indefinitely stop 50 million American children from going to school and harming their mental, physical, emotional and academic development and inflicting long-term, lasting damage,â\u0080\u009d he said during a briefing held Wednesday. â\u0080\u009cAll families should be empowered to make the decision that is right for their own circumstances,â\u0080\u009d Trump said. â\u0080\u009cThis is especially important if a child has underlying health conditions or lives with a parent or grandparent who is at a high risk. â\u0080\u009c â\u0080\u009cWeâ\u0080\u0099re looking for that responsible path forward to shelter those at highest risk while allowing those at lower risk to resume work in school and play football. Go play football,â\u0080\u009d Trump said. He announced that â\u0080\u009cup to 125 million reusable masksâ\u0080\u009d would be provided to schools across the country. â\u0080\u009cMy administration also stands ready to deploy CDC teams to support schools that are opening,â\u0080\u009d he added. He said that a total of $13 billion has been set aside from the CARES Act stimulus package to help school reopen. His administration, he said, is looking at ways to implement a direct payment to parents â\u0080\u009cso that if a school is closed, the family can go to another school.â\u0080\u009d Ahead of Trumpâ\u0080\u0099s briefing, former Vice President Joe Biden, the presumptive Democratic presidential nominee, made his first public appearance with Sen. Kamala Harris, his newly announced running mate Trump said he didnâ\u0080\u0099t watch it but saw â\u0080\u009cjust a momentâ\u0080\u009d of it. The S&P 500 SPX, +0.87% closed six points below what wouldâ\u0080\u0099ve been an all-time high for the index on Wednesday. The Dow Jones Industrial Average DJIA, +0.56% closed nearly 300 points higher. Trump said the stock marketâ\u0080\u0099s performance â\u0080\u009csignals a V-shaped recoveryâ\u0080\u009d for the U.S. economy."}]}