{"article": [{"url": "https://www.marketwatch.com/story/oil-prices-lifted-by-saudi-aramcos-demand-optimism-china-data-2020-08-10", "published": 1597074320.0, "headline": "Oil ends higher, lifted by Saudi Aramcoâ\u0080\u0099s demand optimism, China data", "body": "Oil futures ended higher Monday, getting a lift from optimistic remarks about demand from the chief executive of the worldâ\u0080\u0099s largest oil company and positive data out of China. West Texas Intermediate crude for September delivery CL.1, -1.62% US:CLU20 Â rose 72 cents, or 1.8%, to close at $41.94 a barrel on the New York Mercantile Exchange, while the global benchmark, October Brent crude UK:BRNV20, gained 59 cents, or 1.3%, to finish at $44.99 a barrel on ICE Futures Europe. Saudi Aramco Chief Executive Amin Nasser over the weekend said there had been a â\u0080\u009cpartial recoveryâ\u0080\u009d in demand, and lauded a strong rebound in crude appetite in major markets, including what he described as a return to nearly pre-COVID-19 levels of demand for gasoline and diesel fuel in China, the worldâ\u0080\u0099s biggest energy consumer, news reports said. The majority state-owned companyâ\u0080\u0099s net income plunged by 50% in the first half of the year. â\u0080\u009cThe rosy demand outlook, combined with Iraq saying it will cut production by a further 40,000 barrels a day to compensate overproduction over the past three months are overshadowing the stimulus deadlock in Washington, at least for now,â\u0080\u009d said Fiona Cincotta, analyst at City Index, in a note. After the White House and Democratic lawmakers failed last week to come to an agreement on a new round of coronavirus aid, Trump on Saturday signed executive orders to pause the collection of payroll taxes, provide help on rent, assist with student-loan payments and extend a portion of additional unemployment benefits that had lapsed at the end of last month. The measures are almost certain to face legal challenges and logistical hurdles, but are seen potentially pushing negotiators back to the table. Both House Speaker Nancy Pelosi, D-California, and Treasury Secretary Steven Mnuchin said they were willing to resume talks. Meanwhile, Chinaâ\u0080\u0099s consumer-price index in July rose 2.7% from a year earlier, compared with Juneâ\u0080\u0099s 2.5% increase, as recent pork price increases and floods in southern China drove up food prices. The rise was in line with forecasts. Producer prices dropped 2.4% in July from a year earlier, after a 3% decline in June, the National Bureau of Statistics. Economists polled The Wall Street Journal had predicted the gauge of industrial prices would drop 2.6%. In other energy trading, September gasoline US:RBU20 Â gained 2.17 cents, or 1.8%, to finish at $1.2293 a gallon, while September heating oil US:HOU20 Â rose 1.7 cents, or 1.4%, ending at $1.2369 a gallon. Natural gas for September delivery US:NGU20 Â dropped 8.5 cents, or 3.8%, to settle at $2.1530 per million British thermal units."}]}