{"article": [{"url": "https://www.marketwatch.com/story/value-stocks-are-poised-to-crush-growth-stocks-after-the-presidential-election-2020-10-09", "published": 1602240620.0, "headline": "Value stocks are poised to crush growth stocks after the presidential election", "body": "Value investing, which has been maligned for years, is about to come back in style. Why would there be a return to favor after underperforming for so long? Because elections have a long track record of doing wonders for value stocks, whose prices are deemed low compared with business prospects. (I highlight, below, 20 value companies that may benefit as a result.) Value stocks outperformed growth for half a year after every presidential election since 1980, according to research by Larry McDonald and his team at the Bear Traps Report. Why is that? Refreshingly, in this overly politicized world, it has nothing to do politics. Value tends to outperform growth after elections, regardless of which party wins. Instead, it’s all about the law-making momentum enjoyed by the fresh faces in Washington, D.C., when they first get to town. Here’s what this means. Historically, the party that wins the White House also takes the Senate. Since the Senate is the typical blocking vehicle in the legislative process, this gives victorious presidents with a mandate to legislate the ability to get laws passed. That’s true at least in the first two years before the Senate can change hands. What do they do with this power? Politicians being politicians, they spend money! New administrations often pass a lot of spending bills that rev up the economy. Value stocks typically outperform when growth picks up. One reason is that when there’s more growth around, investors no longer pay up for what was once a narrower swath of growth plays. Inflation and value stocks But growth also produces inflation. And value stocks are the darlings of inflation, for three reasons. 1. The first reason comes straight out of business school. Investors’ perceived value of stocks derives from the present value of future cash flows, which ramp up faster at growth companies than at value companies. When inflation rises, those future cash flows get discounted back to the present at a higher discount rate. This dings the perceived value of growth stocks more than value stocks, points out McDonald. 2. Inflation drives investors out of bonds and into perceived inflation trades, such as value stocks and commodities. McDonald thinks 10-year Treasury yields will rise to 1.5% by the end of next summer. That would be quite a move. This is an out-of-consensus call, so if he is right, a lot of money will move into inflation trades. He estimates about $10 trillion in wealth will make the trip. “Bonds will be destroyed, and money will be forced into alternatives,” he says. 3. Inflation naturally singles out sectors that are the big constituents of value: financials, energy, materials and industrials, says Todd Lowenstein, an equity strategist at The Private Bank at Union Bank. Banks do better when the yield curve steepens, a consequence inflation and economic growth. Inflation typically benefits energy, materials and industrial companies because their pricing power — and the price of what they sell — goes up. “If you are a copper or steel maker in a reflationary environment, your ability to raise prices is really good,” says Lowenstein. And a lot better than at a tech company. Big picture, all of these groups are cyclicals, which means they do better during economic growth. Here’s another possible explanation for the post-election joy ride of value stocks: Seasonality. Value stocks naturally do well in November and December for the following reason, says Brian Barish, a value investor at Cambiar Investors: Most mutual funds have an Oct. 31 deadline for tax-loss selling. They dump losers in September and October. Then, when this selling stops, value stocks rebound. That’s because the losers tend to be value stocks. “Just because a stock is down does not mean it is value. But it is more likely,” says Barish. List of value stocks Here are 20 favored value stocks that may enjoy a post-election romp.Sysco The “other Cisco CSCO, +0.15%, ” Sysco SYY, +0.20% distributes everything from plastic straws and chicken breasts to hot sauce, to restaurants, universities and schools. That makes this a “reopening play.” As vaccines come on line over the next six to 12 months and the economy moves back toward normal from a coronavirus-led lockdown, Sysco’s business will pick up. “We operate under the assumption there will be a vaccine sometime between Thanksgiving and Easter,” says Barish, who manages the Cambiar Opportunity Large Cap Value Fund CAMOX, +0.72%. “People will be very quickly going back to restaurants.” As Sysco’s business normalizes, so will its valuation. That suggests a move up into the mid-$80s range from recent prices of around $66, says Barish. I think he’s worth listening to because his fund has a great record. It outperforms its large-cap value competitors by 4.3 and 2.6 percentage points annualized, over the past three and five years, says Morningstar. Raytheon Technologies Raytheon RTX, -1.46% is another reopening play because it sells airplane engines out of its Pratt & Whitney division. “By the time we get to the middle of next year, with a vaccine we will see air travel recover,” predicts Barish. That will revive airplane purchases and increase demand for airplane engines, especially fuel-efficient models sold by Raytheon. As Raytheon recaptures its historical forward price-to-earnings multiple, the stock could go up around 50%, meaning it will likely outperform the S&P 500, the Dow Jones Industrial Average and Nasdaq.Applied Materials For years, “Moore’s law” defined the rapid growth in chip-processing power (doubling of transistors per chip every two years). But now it’s all about “Moore’s law stress” — meaning chip makers have to work a lot harder to get there. They’re turning more and more sophisticated chip-equipment makers such as Applied Materials AMAT, +1.10% to keep up. As faster economic growth increases demand for products using chips — and gives chip makers the confidence to spring for more equipment, Applied Materials will get a lift, possibly pushing its stock up 50% from current levels, as it all plays out. Energy and materials McDonald, at Bear Traps Report, favors energy and materials — classic value sectors — for a post-election boost and beyond. One reason: Commodity and energy prices tend to rise when growth and inflation kick in. That will help Mosiac MOS, -0.05%, which sells phosphate and potash crop fertilizers, and Teck Resources TECK, -0.07% in steelmaking coal, copper and zinc. It will also benefit out-of-favor energy names including BP BP, -0.74%, Royal Dutch Shell RDS.A, +0.83%, Exxon Mobil XOM, -1.47%, Chevron CVX, -1.62% and Schlumberger SLB, -1.21%. “Our capitulation model is giving a screaming ‘buy’ signal for energy,” says McDonald. “Energy is going to crush in a reflation trade.” Here’s another driver for those companies, says McDonald. They are capital-intensive. They have to buy a lot of equipment. So they have a lot of debt. Many have taken advantage of the low-rate environment to raise cash, refinance debt at lower rates and push out debt maturities. That makes investors more comfortable owning them because it lowers bankruptcy risk. “It increases the optionality of the equity,” says McDonald.‘Quality’ value stocks Citing value stocks’ typical outperformance coming out of the past 14 recessions, and a likely reversion-to-the-mean bounce for value out of its extreme discount to momentum, Bank of America Global Research recently suggested 29 “quality” value names to clients. The list included: Alaska Air Group ALK, +0.15%, AT&T T, -1.01%, Citigroup C, +0.47%, Comcast CMCSA, -0.99%, Cracker Barrel CBRL, +0.54%, Goldman Sachs GS, -0.21%, Kimco Realty KIM, -3.32%, Medtronic MDT, +0.81%, Molson Coors TAP, -1.87% and Restaurant Brands QSR, -0.60%. Michael Brush is a columnist for MarketWatch. At the time of publication, he had no positions in any stocks mentioned in this column. Brush has suggested AMAT, MOS, BP, RDS.A, XOM, CVX, SLB, T, C, GS, and MDT in his stock newsletter, Brush Up on Stocks. Follow him on Twitter @mbrushstocks."}]}