{"article": [{"url": "https://www.marketwatch.com/story/world-food-program-wins-2020-nobel-peace-prize-01602234802", "published": 1602220880.0, "headline": "World Food Program wins 2020 Nobel Peace Prize", "body": "n this file photo taken on April 18, 2020 employees of the World Food Programme (WFP) spray the hands of a displaced Yemeni man with disinfectant as prevention from the novel coronavirus, in the capital Sanaa. essa ahmed/Agence France-Presse/Getty Images OSLO (AP) — The World Food Program has won the 2020 Nobel Peace Prize for its efforts to combat hunger and food insecurity around the globe. The announcement was made Friday in Oslo by Berit Reiss-Andersen, the chair of the Nobel Committee. iframe.twitter-tweet { width: 100% !important; } The Nobel Committee said that the coronavirus pandemic has added to the hunger faced by millions of people around the world and called on governments to ensure that WFP and other aid organizations receive the financial support necessary to feed them. There was no shortage of causes or candidates on this year’s list, with 211 individuals and 107 organizations nominated ahead of the Feb. 1 deadline. However, the Norwegian Nobel Committee maintains absolute secrecy about whom it favors for arguably the world’s most prestigious prize. The award comes with a 10-milion krona ($1.1 million) cash prize and a gold medal to be handed out at a ceremony in Oslo, Norway, on Dec. 10, the anniversary of prize founder Alfred Nobel’s death. This year’s ceremony will be scaled down due to the pandemic. On Monday, the Nobel Committee awarded the prize for physiology and medicine for discovering the liver-ravaging hepatitis C virus. Tuesday’s prize for physics honored breakthroughs in understanding the mysteries of cosmic black holes, and the chemistry prize on Wednesday went to scientists behind a powerful gene-editing tool. The literature prize was awarded to American poet Louise Glück on Thursday for her “candid and uncompromising” work. Still to come next week is the prize for outstanding work in the field of economics."}]}