{"article": [{"url": "https://www.marketwatch.com/story/nikola-shares-soar-20-premarket-on-news-of-gm-partnership-gm-to-receive-2-billion-in-nikola-stock-2020-09-08", "published": 1599567680.0, "headline": "UPDATE: Nikola shares soar 39% on news of GM partnership; GM to receive $2 billion in Nikola stock", "body": "General Motors Co. GM, -0.15% and Nikola Corp. NKLA, -1.36% said Tuesday they are entering a strategic partnership that will start with the Nikola Badger, the company's planned fully-electric and hydrogen fuel cell electric pickup truck, and include cost reductions for other models. As part of the agreement, Nikola will use GM's Ultium battery system and Hydrotec fuel cell technology. Nikola will exchange $2 billion in new stock for in-kind services and access to GM's parts and components. GM will have 11% ownership of Nikola and the right to nominate one director to its board. GM will engineer and manufacture the Nikola Badger, which is expected to enter production by the end of 2022. Nikola expects to achieve $4 billion in savings on battery and powertrain costs over 10 years and another $1 billion in engineering and validation costs. GM expects to receive more than $4 billion in benefits between the equity value of the shares, contract manufacturing of the Badger, supply contracts for batteries and fuel cells and EV credits. GM will be exclusive supplier of fuel cells globally to Nikola for Class 7/8 trucks. Wedbush analyst Dan Ives said the news is a big deal for Nikola. \"This news is a huge shot in the arm for Nikola and cements credibility not just for its Badger production slated to begin by the end of 2022 but for its hydrogen fuel cell ambitions and semi truck vision going forward,\" Ives wrote in a note to clients. \"There have been many skeptics around Nikola and its founder Trevor Milton's ambitions over the coming years, which now get thrown out the window with stalwart GM making a major strategic bet on Nikola for the next decade on the EV and fuel cell front.\" Nikola shares jumped 39% on the news, while GM was up 10%."}]}