{"article": [{"url": "https://www.marketwatch.com/story/heres-everything-coming-to-hbo-max-in-august-2020-and-whats-leaving-2020-07-20", "published": 1595680100.0, "headline": "Hereâ\u0080\u0099s everything coming to HBO Max in August 2020, and whatâ\u0080\u0099s leaving", "body": "HBO Max will welcome Batman in August 2020, while it says goodbye to Harry Potter. The streaming service, owned by AT&T Inc. T, -1.01% Â , will lose all eight Harry Potter movies on Aug. 25 as their licensing contract expires, but will add six Batman movies, including the 1989 Michael Keaton version and Christopher Nolanâ\u0080\u0099s â\u0080\u009cThe Dark Knight.â\u0080\u009d For originals, the highlight of the month appears to be HBOâ\u0080\u0099s â\u0080\u009cLovecraft Countryâ\u0080\u009d (Aug. 16), the series adaptation of the acclaimed novel about a young Black man who travels across the country in Jim Crow-era America to track down his missing father, facing terrors both human and supernatural. Jonathan Majors, Jurnee Smollett, Michael K. Williams and Courtney B. Vance star. div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } HBO Max originals include â\u0080\u009cAn American Pickleâ\u0080\u009d (Aug. 6), starring Seth Rogen as an immigrant laborer who gets pickled in 1919 and wakes up in modern-day Brooklyn; â\u0080\u009cSelena & Chefâ\u0080\u009d (date TBA), a cooking show with Selena Gomez; and the four-part documentary â\u0080\u009cRavi Patelâ\u0080\u0099s Pursuit of Happinessâ\u0080\u009d (Aug 27). div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Other August additions include HBOâ\u0080\u0099s political documentary â\u0080\u009cThe Swampâ\u0080\u009d (Aug. 4), the season premiere of HBOâ\u0080\u0099s NFL docuseries â\u0080\u009cHard Knocks: Los Angelesâ\u0080\u009d (Aug. 11), a new batch of Looney Tunes cartoons (Aug. 18) and movies such as â\u0080\u009cJojo Rabbitâ\u0080\u009d (Aug. 1), â\u0080\u009cBirds of Prey (And the Fantabulous Emancipation of One Harley Quinn)â\u0080\u009d (Aug. 18), â\u0080\u009cQueen & Slimâ\u0080\u009d (Aug. 22), and â\u0080\u009cThe Way Backâ\u0080\u009d (Aug. 29). Hereâ\u0080\u0099s a full list of whatâ\u0080\u0099s on tap, as of July 20 (release dates are subject to change):Whatâ\u0080\u0099s coming in August Aug. 1 10,000 BC, 2008 All the Presidentâ\u0080\u0099s Men, 1976 Altered States, 1980 Awkwafina is Nora from Queens, Season 1 Bad Influence, 1990 (HBO) Barefoot in the Park, 1967 Barkleys of Broadway, 1949 Batman, 1989 Batman & Robin, 1997 Batman Begins, 2005 Batman Forever, 1995 Batman Returns, 1992 The Bear, 1989 (HBO) Bee Season, 2005 (HBO) Before Sunrise, 1995 (HBO) Before Sunset, 2004 (HBO) Biloxi Blues, 1988 (HBO) Blade Runner: The Final Cut, 2007 Blue Crush, 2002 (HBO) The Candidate, 1972 Carefree, 1938 The Change-Up (unrated version), 2011 (HBO) Chariots of Fire, 1981 Contact, 1997 The Dark Knight, 2008 The Dishwasher, 2020 (HBO) Driving Miss Daisy, 1989 Elf, 2003 The First Grader, 2011 (HBO) The First Wives Club, 1996 Flipper, 1996 (HBO) Flying Down to Rio, 1933 Flying Leathernecks, 1951 Foolâ\u0080\u0099s Gold, 2008 Fracture, 2007 The Fugitive, 1993 The Gay Divorcee, 1934 Get on Up, 2014 (HBO) Go Tell It on the Mountain, 2004 (HBO) Grace Unplugged, 2013 (HBO) Hard to Kill, 1990 Harley Quinn, Seasons 1 & 2 Highlander: The Final Dimension, 1995 (HBO) Highlander IV: Endgame, 2000 (HBO) The Hindenburg, 1975 (HBO) Hours, 2013 (HBO) House of Wax, 2005 House Party, 1990 House Party 2, 1991 House Party: Tonightâ\u0080\u0099s the Night, 2013 How to Be a Player, 1997 (HBO) Idiocracy (extended version), 2006 (HBO) Interview with the Vampire, 1994 Jeremiah Johnson, 1972 Jim Thorpe: All-American, 1951 Jojo Rabbit, 2019 (HBO) div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Kung Fu Panda, 2008 Kung Fu Panda 2, 2011 Leprechaun, 1993 (HBO) Leprechaun 2, 1994 (HBO) Leprechaun 3, 1995 (HBO) Leprechaun 4: In Space, 1997 (HBO) Leprechaun: Origins, 2014 (HBO) The Long Kiss Goodnight, 1996 The Lost Boys: The Thirst, 2020 (HBO) The Lost Boys: The Tribe (unrated version), 2020 (HBO) Love Field, 1992 (HBO) Lovelace, 2013 (HBO) Lying And Stealing, 2019 (HBO) The Marine (unrated version), 2006 (HBO) Martha Marcy May Marlene, 2011 (HBO) Marvinâ\u0080\u0099s Room, 1996 (HBO) Maverick, 1994 Monkeybone, 2001 (HBO) Mr. Magoriumâ\u0080\u0099s Wonder Emporium, 2007 (HBO) Murder at 1600, 1997 The Mustang, 2019 (HBO) My Blue Heaven, 1990 My Sisterâ\u0080\u0099s Keeper, 2009 Nell, 1994 (HBO) New Yearâ\u0080\u0099s Eve, 2011 (HBO) Oceanâ\u0080\u0099s Eleven, 2001 On Dangerous Ground, 1952 On Golden Pond, 1981 (HBO) Phantom, 2013 (HBO) Pi, 1998 (HBO) Raise the Titanic, 1980 (HBO) Roberta, 1935 Romeo Must Die, 2000 Savages (unrated version), 2012 (HBO) Say It Isnâ\u0080\u0099t So, 2001 (HBO) Serendipity, 2001 Skyline, 2010 (HBO) South Central, 1992 Spy Game, 2001 (HBO) Steven Universe Movie, (2019) The Story of Vernon and Irene Castle, 1939 Striptease, 1996 Swing Time, 1936 They Live by Night, 1949 Things Never Said, 2020 (HBO) Three Days of the Condor, 1975 Time Bandits, 1981 (HBO) Top Hat, 1935 Two Minutes of Fame, 2020 (HBO) Walk the Line (extended version), 2005 (HBO) Wedding Crashers, 2005 Without Limits, 1998 Yes Man, 2008 Aug. 3 HBO Asiaâ\u0080\u0099s Invisible Stories Aug. 4 Mob Psycho, Season 1 Promised Neverland, Season 1 Puella Magi Madoka Magica The Swamp, Documentary Premiere (HBO) div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } Aug. 6 An American Pickle, Film Premiere Esme & Roy, Season 2B On The Trail: Inside the 2020 Primaries, Documentary Premiere (CNN) Aug. 7 Habla Now, 2020 (HBO) Aug. 8 Richard Jewell, 2019 (HBO) Aug. 11 Hard Knocks â\u0080\u009920: Los Angeles, Series Premiere (HBO) Aug. 12 Yusuf Hawkins: Storm Over Brooklyn (HBO) Aug. 13 Infinity Train, Season 3 Premiere Aug. 14 Carmen Y Lola (aka Carmen And Lola), 2020 (HBO) Aug. 15 Birds Of Prey (And the Fantabulous Emancipation of One Harley Quinn), 2020 (HBO) Aug. 16 Lovecraft Country, Series Premiere (HBO) Aug. 18 Looney Tunes, Batch 3 Smurfs, Season 2 Aug. 20 The Fungies, Season 1A Singletown, Season 1 Aug. 21 No Quiero Ser Tu Hermano (aka I Donâ\u0080\u0099t Want to Be Your Brother), 2020 (HBO) Aug. 22 Queen & Slim, 2019 (HBO) Aug. 23 Miaâ\u0080\u0099s Magic Playground Aug. 27 Ravi Patelâ\u0080\u0099s Pursuit of Happiness, Docuseries Premiere Aug. 28 Seneca, 2019 (HBO) Steven Universe Future, Season 6 Aug. 29 The Way Back, 2020 (HBO)Whatâ\u0080\u0099s leaving in August Aug. 25 Harry Potter and the Chamber of Secrets Harry Potter and the Deathly Hallows: Part 1, 2010 Harry Potter and the Deathly Hallows: Part 2, 2011 Harry Potter and the Goblet of Fire, 2005 Harry Potter and the Half-Blood Prince, 2009 Harry Potter and the Order of the Phoenix, 2007 Harry Potter and the Prisoner of Azkaban, 2004 Harry Potter and the Sorcererâ\u0080\u0099s Stone, 2001 Aug. 28 Mr. & Mrs. Smith (Directorâ\u0080\u0099s Cut), 2005 (HBO) Aug. 31 42nd Street, 1933 A Perfect World, 1993 Adamâ\u0080\u0099s Rib, 1949 Along Came Polly, 2004 (HBO) Cabaret, 1972 Dumb & Dumber, 1994 Full Metal Jacket, 1987 Good Will Hunting, 1997 How to Lose a Guy in 10 Days, 2003 (HBO) John Wick: Chapter 3 â\u0080\u0093 Parabellum, 2019 (HBO) Kill Bill: Volume 1, 2003 Kill Bill: Volume 2, 2004 Love Actually, 2003 (HBO) Magic Mike, 2012 Megamind, 2010 Misery, 1990 Monsters vs. Aliens, 2009 Mystic River, 2003 National Lampoonâ\u0080\u0099s Christmas Vacation, 1989 Pee-weeâ\u0080\u0099s Big Adventure, 1985 Sesame Street Presents: Follow That Bird, 1985 The Adjustment Bureau, 2011 (HBO) The Spongebob Squarepants Movie, 2004 (HBO) Tim Burtonâ\u0080\u0099s Corpse Bride, 2005 Unforgiven, 1992 Veronica Mars, 2014 Youâ\u0080\u0099ve Got Mail, 1998"}]}