{"article": [{"url": "https://www.marketwatch.com/story/experts-call-portland-force-deployment-a-constitutional-red-flag-while-trump-eyes-federal-actions-on-chicago-streets-2020-07-20", "published": 1595275700.0, "headline": "Legal experts call Portland force deployment a constitutional 'red flag,' while Trump eyes federal actions on Chicago streets", "body": "PORTLAND, Ore. (AP) - Federal law-enforcement officers' actions at protests in Oregon's largest city, undertaken without local authorities' consent, are raising the prospect of a constitutional crisis - one that could escalate as weeks of demonstrations find renewed focus in clashes with camouflaged, unidentified agents outside Portland's U.S. courthouse. State and local authorities, who did not ask for federal help, are awaiting a ruling in a federal lawsuit filed late last week by Oregon's attorney general, Ellen Rosenblum. She said in court papers that masked federal officers have arrested people off the street, far from the courthouse, with no probable cause - and whisked them away in unmarked cars. See:Oregon sues Trump administration as unrest and clashes continue in Portland Constitutional-law experts said Monday the federal officers' actions are a \"red flag\" in what could become a test case of states' rights as the Trump administration expands its federal policing into other cities. \"The idea that there's a threat to a federal courthouse and the federal authorities are going to swoop in and do whatever they want to do without any cooperation and coordination with state and local authorities is extraordinary outside the context of a civil war,\" said Michael Dorf, a professor of constitutional law at Cornell University. \"It is a standard move of authoritarians to use the pretext of quelling violence to bring in force, thereby prompting a violent response and then bootstrapping the initial use of force in the first place,\" Dorf said. “ 'Federal law enforcement is not a political prop.' ” - Steve Vladeck, University of Texas President Donald Trump says he plans to send federal agents to other cities as well. The Chicago Tribune, citing anonymous sources, reported Monday that Trump planned to deploy 150 federal agents to Chicago. The ACLU of Oregon has sued in federal court over the agents' presence in Portland, and the organization's Chicago branch said it would similarly oppose a federal presence. Zolan Kanno-Youngs, a homeland-security reporter at the New York Times, said he'd confirmed the Tribune report, tweeting that the Trump administration was set to deploy 150 Homeland Security investigations agents to Chicago for 60 days to combat \"gang violence,\" with other federal agents also expected to be deployed. iframe.twitter-tweet { width: 100% !important; } \"We're going to have more federal law enforcement, that I can tell you,\" Trump had said earlier Monday. \"In Portland, they've done a fantastic job. They've been there three days and they really have done a fantastic job in a very short period of time.\" An official White House communication, via Twitter, said that \"Democrat mayors of Portland, Chicago, and New York are letting their cities fall to violence and chaos\": iframe.twitter-tweet { width: 100% !important; } Top leaders in the U.S. House said Sunday they were \"alarmed\" by the Trump administration's tactics in Portland and beyond. They've called on federal inspectors general to investigate. See:Top House Democrats 'alarmed' by federal tactics against Portland protesters Trump, who called the protesters \"anarchists and agitators\" in a Sunday tweet, said the agents, with the U.S. Department of Homeland Security and the Justice Department, are on hand to help Portland and restore order at the Mark O. Hatfield Federal Courthouse. The actions run counter to the usual philosophies of American conservatives, who typically treat state and local rights with great sanctity and have long been deeply wary of the federal government - particularly its armed agents - interceding in most situations. But Trump, a Republican, has shown during his time in office that his actions do not always reflect traditional conservatism - particularly when politics, and in this case an impending election, are in play. Militarized federal agents deployed by the president to Portland, Ore., fired tear gas against protesters overnight Friday as the city's mayor demanded that the agents be removed and as the state's attorney general vowed to seek a restraining order against them. The Oregonian via AP One prominent Republican, Sen. Rand Paul of Kentucky, who is from the libertarian-leaning flank of the party, came out publicly against the federal agents. \"We cannot give up liberty for security. Local law enforcement can and should be handling these situations in our cities but there is no place for federal troops or unidentified federal agents rounding people up at will,\" Paul said in a tweet Monday. The protests now gaining nationwide attention have roiled Portland for 52 nights, ever since George Floyd died after being pinned by the neck for nearly eight minutes by a white Minneapolis police officer. Many rallies have attracted thousands and been largely peaceful. But smaller groups of up to several hundred people have focused on federal property and local law enforcement buildings, at times setting fires to police precincts, smashing windows and clashing violently with local police. The Portland Police Bureau used tear gas on multiple occasions until a federal court order banned its officers from doing so without declaring a riot. Now, concern is growing that the tear gas is being used against demonstrators by federal officers instead. Anger at the federal presence escalated on July 11, when a protester who was hospitalized with critical injuries after a U.S. Marshals Service officer struck him in the head with a non-lethal round. Video of the incident shows the man, identified as Donavan LaBella, standing across the street from the officers holding a speaker over his head with both hands when he was struck. Affidavits filed in federal court in cases against recently arrested protesters also show that federal officers have posted lookouts on the upper stories of the courthouse and have plainclothes officers circulating in the crowd. Court papers in one case - against a man arrested on federal charges for shining a green laser in the eyes of Federal Protective Service agents - show that Portland police turned him over to federal authorities after federal officers identified him, in part with the testimony of their undercover officers. Mayor Ted Wheeler, who himself has been under fire locally for his handling of the protests, said Sunday on national TV talk shows that the demonstrations that dominated Portland headlines for more than seven weeks were dwindling before federal officers engaged. \"They are sharply escalating the situation. Their presence here is actually leading to more violence and more vandalism. And it's not helping the situation at all,\" Wheeler said Sunday on CNN's \"State of the Union.\" \"They're not wanted here. We haven't asked them here,\" Wheeler said. \"In fact, we want them to leave.\" Indeed, crowds of demonstrators had begun to dwindle a week ago, and some people in notoriously liberal Portland - including Black community leaders - had begun to call for the nightly demonstrations to end. But by the weekend, the presence of federal troops and Trump's repeated references to Portland as a hotbed of \"anarchists\" seemed to give a new life and renewed focus to the nightly demonstrations - and to attract a broader base. On Sunday night, a crowd estimated at more than 500 people gathered outside the courthouse and included dozens of self-described \"moms\" who linked arms in a line in front of a chain link fence in front of the courthouse. The demonstration continued into Monday morning. \"It seems clear that there were at least some federal crimes committed here,\" said Steve Vladeck, a constitutional-law professor at the University of Texas. \"But the notion that a handful of federal crimes justifies a substantial deployment of federal law enforcement officers â\u0080¦ to show force on the streets is, to my mind, unprecedented.\" \"Federal law enforcement,\" Vladeck said, \"is not a political prop.\""}]}