{"article": [{"url": "https://www.marketwatch.com/story/why-trumps-moves-to-limit-immigration-hurts-us-companies-and-american-jobs-2020-07-23", "published": 1595679320.0, "headline": "Why Trumpâ\u0080\u0099s moves to limit immigration hurts U.S. companies and American jobs", "body": "“ There has never been a point in U.S. history when immigration did not translate to economic growth. ” The Trump administration, at the urging of many U.S. states and universities, has rescinded its plan to strip foreign students of their U.S. visas. This was not the first time the president has taken shortsighted action against immigrants in an effort to â\u0080\u009cprotect American jobsâ\u0080\u009d â\u0080\u0094 and it likely wonâ\u0080\u0099t be the last. This administration, along with the large swath of Americans who support protectionist policies, need to recognize that international students and H-1B workers are vital for the U.S. to remain competitive in the global economy.Â Many H-1B visa recipients become long-term contributors to the U.S., leading research, building communities, and growing companies. At my own firm, GlobalWonks, Co-Founder and CEO Cenk Sidar came to the U.S. from Turkey as an international student and went on to build a tech tool to help businesses navigate volatile markets. There are countless stories just like ours â\u0080\u0094 companies built by immigrants that employ Americans and propel the country forward.Â Immigrants offer significant advantages to their companies. In our modern, globalized economy, business is borderless â\u0080\u0094 new markets open up to U.S. industries every year. As a result, U.S.-based businesses such as GlobalWonks benefit from workers who are globally minded, understand other cultures and economies, and have pre-existing relationships in other countries. Such diversity has been an enormous boon to American companies, leading to better reputations and higher profits. Without highly-skilled, qualified immigrants, American businesses would suffer. American companies have to contend with a growing number of foreign technology firms; if the U.S. restricts access to top talent, we are effectively asking American firms to continue the fight with one hand tied behind their back. Nearly half of all international students are studying STEM, and research has shown that H-1B workers fill employment gaps in many STEM occupations and expand job opportunities for all. In our modern economy, STEM graduates are essential â\u0080\u0094 they fuel technological innovation and cross-sector growth.Â Read: Canadaâ\u0080\u0099s appeal to tech startups grows in wake of Trump suspending H-1B visas Also: What I learned as an immigrant CEO in the Deep South These powerful arguments â\u0080\u0094 which are made too infrequently and too subtly â\u0080\u0094 are often overpowered by a narrow, â\u0080\u009cAmerica Firstâ\u0080\u009d perspective. In reality, the U.S. benefits from the fees that foreign students pay and the contributions they later make as employees, from taxes to intellectual property. Whatâ\u0080\u0099s more, America needs the diplomatic currency that robust immigration creates. Research shows positive selection into the U.S. can strengthen democratic institutions abroad and build social, political, and cultural relations between the U.S. and reverse migrantsâ\u0080\u0099 home countries. Consequently, crucial geopolitical alliances, trade relationships, and international markets have been shaped by CEOs, diplomats, and investors who quite literally were made in America.Â “ A society is strengthened by diversity, not weakened by it. ” Such narrowness and derisive language about immigrants plagues the U.S. While living along the U.S.-Mexico border for two years where my wife, a U.S. diplomat, was stationed, I saw firsthand that these claims verged on being baseless. But I understand the fears that motivate short-sighted policy changes and attitudes. We are in the midst of a global pandemic, one that has led to record-high unemployment rates and crippled the U.S. economy. The worry is that the more people we allow in, the less likely our families, friends, and neighbors are to get high-paying jobs that assure them a higher quality of life. To those who make such claims, I would say this: There has never been a point in U.S. history when immigration did not translate to economic growth. Openness is America's heritage. As a country built by immigrants, the U.S. has an opportunity and an obligation to elevate its citizens and prepare them to lead the world, rather than closing itself off. To millions of people around the world, including myself, America is a beacon, representing some of the best jobs and academic opportunities in the world. That is something to own and celebrate. The U.S. needs to promote cohesion among people of all backgrounds and recognize that a society is strengthened by diversity, not weakened by it. The research on this fact is resolute. Itâ\u0080\u0099s vital that Americans reverse this insular trend before it is too late. Over the last few years, we have seen applications for early voluntary departure among international students and workers skyrocket, while international applications to U.S. undergraduate and graduate programs have declined. Without these vital, skilled individuals, American companies and its economy will both suffer.Â Bilal Baloch is co-founder and COO of GlobalWonks. He is a non-resident fellow at the Johns Hopkins SAIS Foreign Policy Institute. Follow him on Twitter. More: Trumpâ\u0080\u0099s visa restrictions are already pushing American jobs overseas Plus: Â The U.S. will suffer a generational loss of talent and expertise if it sends foreign students home"}]}