{"article": [{"url": "https://www.marketwatch.com/story/dont-miss-out-on-this-generational-opportunity-in-the-stock-market-hedge-fund-manager-says-11602183237", "published": 1602192140.0, "headline": "Don't miss out on this 'generational opportunity' in the stock market, hedge-fund manager says", "body": "Thomas Hayes of Great Hill Capital was asked this week whether he's been putting his clients' money to work amid the volatility and uncertainty the pandemic has created in the market. His answer: Yes. In fact, \"aggressively.\" But he's not following the herd year by loading up on the notable tech names like Alphabet GOOG, +1.97%, Amazon AMZN, +3.01%, Tesla TSLA, +1.89%, Facebook FB, +0.26%, Apple AAPL, +1.74%, etc. The big gains going forward, he said, lie elsewhere. \"This is a generational opportunity for some of the laggard sectors that have been left behind during the 'Stay at Home' period of COVID,\" he wrote in a post on his Hedge Fund Tips blog. \"Now that we are beginning the 'Re-Opening' period of the COVID crisis, opportunities to position ahead of continued treatment improvements and vaccines abound.\" Hayes pointed out that cyclicals - industrials, materials, transports and financials - have all outperformed technology, in a shift that he fully expects to continue as he trims his portfolio of \"over-owned\" pockets of tech stocks. \"This recovery will be led by housing/cyclicals (as 85M millennials are at the age of housing formation and COVID has accelerated the pace),\" he wrote. \"On top of that, low rates are helping with financing and urban exodus is accelerating the trend. This trend is just beginning.\" So, after loading up on home builders back in March and April in anticipation of this shift, Hayes says his fund has been buying up banks in recent months. \"You cannot have a sustainable recovery without credit expansion,\" he said, adding that Wells Fargo WFC, is his top pick. Here's the path he's looking at for his stake in Wells Fargo, which he claims is \"the most hated stock\" in the entire S&P 500 index: His rotation, he said, is in line with earnings estimates for the S&P 500. \"Most cyclical sectors will grow earnings at a FASTER pace than the S&P 500, while Tech will grow earnings at HALF the pace of the S&P 500,\" he said. Energy and industrials, in particular, should shine, he said. As for where the market goes short term, Hayes is mostly bullish, tech-aside, on the prospects of stocks as they enter the \"reopening\" phase thanks to the $4.4 trillion cash on the sidelines. \"We will continue to take advantage on any short-term weakness - as when the reopening trade flips on in earnest - it will be abrupt and meaningful for those who are correctly positioned,\" Hayes said. It wasn't exactly \"abrupt,\" but some of that cash trickled into the stock market on Thursday, with the Dow Jones Industrial Average DJIA, +0.56% closing up triple digits. The tech-heavy Nasdaq Composite COMP, +1.39% and the S&P 500 SPX, +0.87% also ended higher."}]}