{"article": [{"url": "https://www.marketwatch.com/story/what-going-cashless-means-for-the-14-million-unbanked-americans-11596664581", "published": 1596779300.0, "headline": "Going cashless during the COVID pandemic makes life even more difficult for the 14 million unbanked Americans", "body": "Cashless transactions have dramatically increased since the onset of the coronavirus pandemic. Stephanie Keith/Getty Images Even though there have been many advancements in financial technology over the past decade, many Americans still prefer to pay in cash. In fact, cash was the most popular form of payment until 2019, when debit cards rose to the top of the ranks in the San Francisco Federal Reserve’s annual survey. Cash remains king, however, when it comes to payments under $10. But the coronavirus pandemic has caused people to shift away from cash transactions for fear of coming in contact with coronavirus on the surface of dollar bills and coins they receive in change. Out of an abundance of caution, some stores have stopped accepting cash and some have been asking customers to provide exact change, mainly because of the coin shortage in the U.S. There is scant evidence that coronavirus is transmitted from dollar bills and coins. In general, the virus is believed to be transmitted mainly via person-to-person contact and not from touching surfaces. If you have a debit or credit card, one of the downsides to shifting to cashless transactions is a lack of privacy. Whereas if you were to pay for something with cash, there is virtually no record of the transaction. If you don’t have a debit or credit card, things get a bit more complicated and a lot more expensive. That applies to roughly 14.1 million adults and 6.4 million children who were unbanked, meaning they do not have a bank account, as of 2017, the last time the Federal Deposit Insurance Corporation conducted a study on America’s unbanked. While 3% of white households in the U.S were unbanked, some 17% of Black and 14% of Hispanic households were unbanked, the FDIC found. “Alarm bells go off in my head because the impact of going cashless is highly unequal,” said Martin Chorzempa, a research fellow at the Peterson Institute for International Economics, a non-partisan think tank. “Eliminating the ability to use cash means you have to pay more fees to pay for reloadable cards, and low-income people already find it expensive to live as is.” “I worry about this more than the risk of spreading coronavirus from cash,” Chorzempa told MarketWatch. Some cities including New York, San Francisco , and Philadelphia have tried to ban cashless stores because they’re seen as discriminating against unbanked people. Reloadable debit cards are one option for people who don’t have bank accounts, but some charge a fee to load money onto them. Many also have inactivity fees, meaning if you don’t use the card for a period of time, you will get charged. Some of these cards expire entirely. “Many retailers have gone cashless for hygienic reasons, which can shut some consumers out,” said Sarah Rathner, a credit card expert at the personal-finance website NerdWallet. “A debit card linked to a checking account, or a prepaid debit card, is an alternative for anyone who can’t have, or doesn’t want, a credit card. Depending on the card you choose, you could also tap to pay, or even add your card to a digital wallet like Apple AAPL Pay.” Another cashless option is to use a payment app such as Venmo, Zelle, Cash App (which is owned by Square SQ, +2.06% ) or Google GOOGL, +1.82% Pay. Venmo, which is owned by PayPal PYPL, +2.18%, is known for its no-fee bill-splitting service. Prior to the pandemic, PayPal had also made its way into brick-and-mortar stores including Home Depot HD, +0.49%, JCPenny and Barnes and Noble. Until recently, when PayPal announced that it had struck a deal with CVS CVS, -1.76% to implement no-fee QR code checkouts using Venmo at more than 8,000 stores by the end of the year, Venmo had not been an accepted form of payment at any national retailer. Darrell Esch, general manager at PayPal, previously told MarketWatch that the company plans to roll out more QR Venmo and PayPal checkouts at more retailers this year. Don’t miss: Here’s how PayPal hopes to turn Venmo into the next PayPal While cash will still be accepted in CVS stores, for the time being, the announcement “reflects our continued focus on innovation and finding new ways to help maintain the safety of our customers and employees,” Jon Roberts, executive vice president and COO of CVS Health, said in a statement. However, it is currently not possible to load physical cash into a Venmo account, Tom Hunter, a PayPal spokesman confirmed. That’s an obstacle for lower-income people who often are paid in cash, said Aaron Klein, a fellow at the Brookings Institution, a left-leaning policy think tank, who served in the Treasury Department during the Obama administration. It is however possible to load cash onto a PayPal account at Walmart WMT, +1.00% stores, as well as at select CVS, 7-Eleven 3382, +4.60% and Rite Aid RAD, -2.04% stores, Hunter said. PayPal account holders will be able to complete purchases at CVS by also scanning contactless QR codes. Klein, unlike Chorzempa, is less worried about the shift to cashless transactions at brick and mortar stores though. The increase in popularity of online-only shopping that requires digital payments is also a big factor, he said. “This will make life even more expensive to those who don’t have easy and cheap access to electronic payments.” Before coronavirus, he said there was not much of a move to a cashless society. “Instead what you see are new forms of digital payments replacing older forms of non-cash payment.” “A cashless future is more hype than reality,” Klein told MarketWatch, “and more a reality for the wealthy than the middle or working class.”"}]}