{"article": [{"url": "https://www.marketwatch.com/story/sturgis-motorcycle-rally-in-south-dakota-in-august-linked-to-more-than-250000-coronavirus-cases-study-finds-2020-09-08", "published": 1599720740.0, "headline": "Sturgis motorcycle rally in South Dakota in August linked to more than 250,000 coronavirus cases, study finds", "body": "The 10-day Sturgis Motorcycle Rally in South Dakota in August, which drew more than 400,000 people, has now been linked to more than 250,000 coronavirus cases, according to a study by the IZA Institute of Labor Economics. Using anonymized cellphone data from the rally, researchers from the University of Colorado Denver, Bentley University, University of California San Diego and San Diego State University found the bikers, who were filmed and photographed in crowded bars, restaurants and outdoor venues mostly without face masks, allowed for many of the “worst-case scenarios” for “superspreading.” The event “was prolonged, included individuals packed closely together, involved a large out-of-town population, and had low compliance with recommended infection countermeasures such as the use of masks,” the researchers wrote. The event will cost an estimated $12.2 billion in health-care costs, they wrote. See:Coronavirus update: Global case tally tops 27.3 million, and U.S. accounts for a quarter, as 9 drug manufacturer CEOs pledge to ‘stand with science’ in developing vaccine The cellphone data showed foot traffic at restaurants, bars, hotels and shops in census block groups where the events took place rose by up to 90% during the event. At the same time, stay-at-home behavior declined among residents of Meade County with an up to 10.9% decline in median hours spent at home. Data from the Centers for Disease Control and Prevention found cases spread both locally and in the home counties of those who attended and then traveled home. “In counties with the largest relative inflow to the event, the per 1,000 case rate increased by 10.7 percent after 24 days following the onset of Sturgis Pre-Rally Events,” the researchers wrote. “Multiplying the percent case increases for the high, moderate-high and moderate inflow counties by each county’s respective pre-rally cumulative COVID-19 cases and aggregating, yields a total of 263,708 additional cases in these locations due to the Sturgis Motorcycle Rally. “Adding the number of new cases due to the Rally in South Dakota estimated by synthetic control (3.6 per 1,000 population, scaled by the South Dakota population of approximately 858,000) brings the total number of cases to 266,796 or 19 percent of 1.4 million new cases of COVID-19 in the United States between August 2nd 2020 and September 2nd 2020,” said the report. The researchers obtained the cellphone data from SafeGraph Inc., a San Francisco–based data company. The state’s Republican governor, Kristi Noem, who encouraged the convening of the Sturgis event without significant public health adjustments, on Tuesday called the IZA report “fiction.” iframe.twitter-tweet { width: 100% !important; } Last week, the Washington Post reported the first COVID-19 death from the event, a Minnesota biker in his 60s. Read on:9 drug-company CEOs pledge to make sure COVID-19 vaccine follows full regulatory path"}]}