{"article": [{"url": "https://www.marketwatch.com/story/trump-reportedly-paid-just-750-in-federal-taxes-in-2016-and-2017-and-nothing-in-10-of-past-15-years-11601244528", "published": 1601279300.0, "headline": "Trump reportedly paid just $750 in federal taxes in 2016 and 2017 â\u0080\u0094 and nothing in 10 of past 15 years", "body": "President Donald Trump speaks as he departs the White House on Saturday. Getty Images Donald Trump paid no federal income tax in 10 of the past 15 years due to massive business losses, and just $750 in federal taxes in 2016 and 2017, the New York Times reported Sunday. The Times said it had acquired more than two decadesâ\u0080\u0099 worth of tax-return data from Trump and his business organization, though it does not include his personal tax returns for 2018 and 2019. The Times said more findings from his taxes will be published in the coming weeks. The Times also reported that Trump has hundreds of millions of dollars in debt coming due, and is still engaged in a decade-long dispute with the Internal Revenue Service over a $72.9 million tax refund that he claimed after reporting business losses. Trump reportedly could be on the hook for more than $100 million if he loses that claim. Trump actually paid more taxes to foreign governments than the U.S. in 2017, the Times reported, with tax payments of Â $15,598 that he or his companies paid to Panama, $145,400 to India and $156,824 to the Philippines. Also: 5 key takeaways from the report on Trumpâ\u0080\u0099s tax returns Trump in 2016 said avoiding paying taxes â\u0080\u009cmakes me smart.â\u0080\u009d The returns show that â\u0080\u009che is simply pouring more money into many businesses than he is taking out,â\u0080\u009d the Times said, with most of his core U.S. properties losing millions or even tens of millions of dollars a year. Trump has long defied presidential tradition by refusing to release his tax returns. The Times has previously acquired fragments of Trumpâ\u0080\u0099s tax-return information and published stories about them, but this appears to be the most detailed collection of data about his finances. The Times said all the records were legally obtained. The trove of financial data reportedly shows vast tax write-offs because of business losses and a financially struggling property empire. â\u0080\u009cUltimately, Mr. Trump has been more successful playing a business mogul than being one in real life,â\u0080\u009d the Times wrote. See: Ocasio-Cortez, Pelosi and others tear into Trump over report on his taxes The Times said the records do not reveal the full extent of Trumpâ\u0080\u0099s wealth, nor do they reveal any previously unreported ties with Russia. A Trump Organization lawyer told the Times that â\u0080\u009cmost, if not all, of the facts appear to be inaccurate,â\u0080\u009d and specifically took issue with the amount of taxes Trump paid. â\u0080\u009cItâ\u0080\u0099s fake news,â\u0080\u009d Trump said at a White House news conference Sunday. â\u0080\u009cItâ\u0080\u0099s totally fake news. Made up. Fake.â\u0080\u009d More: â\u0080\u0098I paid tax,â\u0080\u0099 Trump says, but doesnâ\u0080\u0099t say how much"}]}