{"article": [{"url": "https://www.marketwatch.com/story/serbs-storm-parliament-after-new-coronavirus-lockdown-announced-2020-07-07", "published": 1594162460.0, "headline": "Serbs storm parliament after new coronavirus lockdown announced", "body": "BELGRADE, Serbia — Thousands of protesters fought running battles with police and tried to storm the parliament building in Belgrade on Tuesday after the Serbian president announced that a coronavirus lockdown will be reintroduced in the Balkan country. Police fired several rounds of tear gas at the protesters, some chanting “Resignation! Resignation!” as they gathered in front of the downtown parliament building in the Serbian capital. Some of the protesters briefly managed to enter the parliament by force, but were pushed back by riot police. The protesters responded by hurling flares, stones, bottles and eggs at the police. Several clashes erupted between some of the most extremist rioters apparently belonging to far-right groups and the baton-wielding police. Protesters also clashed with police in front of the state TV building. The broadcaster is accused by the opposition of having a pro-government bias. A number of police vehicles were set on fire. Serbian police director Vladimir Rebic told the state television that a number of demonstrators have been detained and police officers injured, but did not specify how many. He said smaller protests were also held in other Serbian cities. “I appeal to the citizens ... to help ease the tensions,” Rebic said. “I’m certain police will respond adequately and prevent any form of hooligan behavior.” Earlier, President Aleksandar Vucic called the virus situation in Belgrade “alarming” and “critical” as the city’s hospitals neared their capacity limits after health officials reported highest single-day death toll from the coronavirus on Tuesday. Vucic said the government would reimpose a curfew as of Friday. He said it will “probably” last from 6 p.m. on Friday till 5 a.m. on Monday. He also said the groups of no more than five people will be allowed together. Many blame the autocratic Serbian president for lifting the previous lockdown measures just so he would cement his grip on power after parliamentary elections. He has denied those claims. Soccer and tennis matches were played in packed stands and the election was held on June 21 despite warnings from experts that the mass gatherings without social distancing could lead to a new coronavirus wave. Serbian Prime Minister Ana Brnabic denounced the protest, saying the state will protect law and order and accused opposition politicians of being behind the storming of parliament. “I strongly condemn the vandalism of politicians who are behind the violent break into the Serbian Parliament at the moment when the state and the health system face the toughest blow from the coronavirus since the start of the pandemic,” Brnabic said. The country’s Health Ministry said Tuesday that 13 people had died in 24 hours in Serbia and 299 new COVID-19 cases were confirmed. That brought the total to 16,719 confirmed cases and 330 virus-related deaths since the start of the pandemic in Serbia, which went from having one of Europe’s strictest lockdowns to a near-complete reopening at the beginning of May."}]}