{"article": [{"url": "https://www.marketwatch.com/story/your-guide-to-the-tricky-tax-rules-of-retirement-2020-10-05", "published": 1601893160.0, "headline": "Your guide to the tricky tax rules of retirement", "body": "This article is reprinted by permission from NextAvenue.org. When you’re doing your retirement planning, it’s easy to ignore one vital topic: How much taxes will I owe on my retirement income? Frankly, it’s a hornet’s nest. But the topic of taxes and your retirement income is vitally important for your retirement planning. Anqi Chen and Alicia H. Munnell of the Center for Retirement Research at Boston College analyzed data from the federal Health and Retirement Study, on 3,419 recently retired people where at least one earner claimed Social Security benefits from 2010-2018. Their bottom line: When people evaluate their retirement resources, they may forget that a portion will be taxed.How much of retirees’ income goes to taxes Chen and Munnell presented their findings in a preliminary paper, “How Much Taxes Will Retirees Owe on Their Retirement Income” at the virtual 2020 Retirement and Disability Research Consortium Annual Meeting. (I attended it so you didn’t have to.) “Households in the aggregate will have to pay roughly 6% of their income in federal income taxes,” they authors wrote. But the percentage varies greatly, depending on the size of their retirement income. According to the paper: “Those in the bottom three quintiles [quintiles divide the population study in fifths] pay close to zero, but the rate rises to 1.5% for the fourth quintile and to more than 10.5% for the top quintile, 15.4% for the top 5%, and 20.9% for the top 1%.” Also see: When it comes to Social Security, these strategies can pay off for married couples The top quintile includes married couples with average combined Social Security benefits of $33,130; 401(k)/IRA balances of $180,790 and financial wealth of $87,500.The tax rules for retirees Income taxes can be your largest outlay in retirement. You’ll pay income tax on any pension and on withdrawals from any tax-deferred accounts —such as traditional IRAs, 401(k)s, 403(b)s and similar retirement plans as well as tax-deferred annuities — in the year you withdraw the funds. (Roth IRA distributions are tax-free.) And, by law, you must make required minimum distributions (or RMDs) from your retirement plans starting at 72. If you have investments outside of a retirement plan, such as stocks or bond funds (other than municipal bond funds), you’ll typically pay taxes on their dividends and interest and potentially pay capital-gains tax when you sell them. Some retirees may be surprised to learn that a portion of their Social Security benefits could be subject to federal income taxes. The rules are extraordinarily complicated. But about 40% of people who get Social Security have to pay income taxes on their benefits and the higher your income, the more you will pay. Also see: Thinking about moving to a state with lower taxes? These are the mistakes to avoid If you’re single and have what’s known as “combined income” over $34,000 in 2020, up to 85% of your Social Security benefits is subject to tax. For married couples filing jointly, the threshold is $44,000. Combined income includes adjusted gross income from your federal tax return plus half of your Social Security benefits plus any tax-exempt interest earned on municipal bonds. And, as Munnell wrote in a recent MarketWatch column, since those thresholds aren’t indexed for inflation, “a rising portion of households will be required to include 85% of their benefits when calculating their federal income taxes.”Taxes and Social Security benefits “Taxation of Social Security benefits falls mainly on higher-income households, says journalist Mark Miller, who writes the RetirementRevised blog. “But many people are surprised to learn their benefits will be taxed at all — and it can have the effect of pushing you into a higher bracket.” Some states also tax Social Security, he notes, although not always mirroring the federal policy. Miller says strategies for avoiding the Social Security benefits tax are limited. But, he notes, you might be able to manage the timing on drawing income from your tax-deferred accounts if that will help you stay below the tax thresholds for a few years. There’s another twist in the Social Security rules that can throw retirees who work part-time.The Social Security earnings test These retirees “are often surprised and dismayed to learn that they may forfeit Social Security benefits —at least temporarily — if they claim them before Full Retirement Age [now between 66 and 67] while they continue to work,” says Mary Beth Franklin, a Certified Financial Planner and a Social Security expert and columnist for Investment News. That’s because claiming before Full Retirement Age means your benefits are subject to Social Security earnings limits — the maximum people who claim Social Security early can make from work without triggering a benefit reduction. Social Security withholds $1 in benefits for every $2 of earnings above the annual earnings limitation cap. For people attaining Full Retirement Age after 2020, that’s $18,240. For those attaining it in 2020, the annual exempt amount is $48,600. Pensions, investment income and other government benefits, such as unemployment compensation, do not count toward the earnings test. Check out: Now you can screen for humidity and more on MarketWatch’s upgraded ‘Where should I retire?’ tool If you have Social Security benefits withheld due to claiming them before reaching Full Retirement Age, you can recoup the lost money in the future. Once you hit Full Retirement Age, Social Security bumps up your monthly benefit to make up, over time, for the withholding. “I generally tell people that if they plan to keep working, it generally makes no sense to claim Social Security before their Full Retirement Age,” Franklin says. “However, the COVID-19 pandemic has forced some older workers to reconsider their retirement plans either because they lost their job, or they are afraid to return to work due to health concerns.” Kerry Hannon is the author of “Great Pajama Jobs: Your Complete Guide to Working From Home.” She has covered personal finance, retirement and careers for the New York Times, Forbes, Money, U.S. News & World Report and USA Today, among others. She is the author of more than a dozen books. Her website is kerryhannon.com. Follow her on Twitter @kerryhannon. This article is reprinted by permission from NextAvenue.org, © 2020 Twin Cities Public Television, Inc. All rights reserved."}]}