{"article": [{"url": "https://www.marketwatch.com/story/trump-was-being-tongue-in-cheek-when-he-said-the-us-should-slow-the-testing-down-white-house-adviser-peter-navarro-says-2020-06-21", "published": 1592738300.0, "headline": "Trump was being â\u0080\u0098tongue in cheekâ\u0080\u0099 when he said the U.S. should â\u0080\u0098slow the testing down,â\u0080\u0099 White House adviser Peter Navarro says", "body": "President Donald Trump told thousands of supporters on Saturday night that high rates of testing for the coronavirus in the U.S. explain why the country has the highest number of cases in the world. â\u0080\u009cWhen you do testing to that extent, youâ\u0080\u0099re going to find more people youâ\u0080\u0099re going to find more cases. So I said to my people, â\u0080\u0098Slow the testing down, please,â\u0080\u0099 â\u0080\u009d Trump said at the rally, held in Tulsa, Okla. Those comments, said Peter Navarro, were â\u0080\u009ctongue in cheekâ\u0080\u009d and â\u0080\u009ca lighthearted moment for [Trump].â\u0080\u009d â\u0080\u009cI donâ\u0080\u0099t know if it was [tongue in cheek],â\u0080\u009d responded CNNâ\u0080\u0099s Jake Tapper on CNNâ\u0080\u0099s â\u0080\u009cState of the Unionâ\u0080\u009d on Sunday morning. Responded Navarro, the White House trade adviser: â\u0080\u009cThirty million people are unemployed, and weâ\u0080\u0099ve seen over 100,000 people die because of the China, Wuhan virus,â\u0080\u009d Navarro said, using terms for the virus popular among some Trump backers. â\u0080\u009cLetâ\u0080\u0099s talk about some serious issues, Jake.â\u0080\u009d â\u0080\u009cI think testing is a very serious issue,â\u0080\u009d said Tapper. â\u0080\u009cIâ\u0080\u0099m not the one making jokes about it.â\u0080\u009d The U.S. has tested more than 26 million people as of June 19, according to the Centers for Disease Control and Prevention, with 10% of those tests, or 2.6 million, resulting in confirmed positives for the presence of the coronavirus. When Navarro was asked about Trump supporters at the rally disregarding the CDCâ\u0080\u0099s advice for social distancing, avoiding large gatherings and wearing face coverings in public â\u0080\u0094 a lawsuit seeking to force compliance at the Tulsa rally was rejected Friday by the state supreme court â\u0080\u0094 Navarro replied that â\u0080\u009cthis is not my lane.â\u0080\u009d â\u0080\u009cIâ\u0080\u0099m the trade adviser,â\u0080\u009d said Navarro, who reportedly wrote White House memos as early as January forecasting grave potential coronavirus effects, adding that he is helping prepare for a predicted second wave of the coronavirus in the fall by â\u0080\u009cfilling the stockpiles.â\u0080\u009d See: White House economic adviser Larry Kudlow downplays concern about second coronavirus wave â\u0080\u009cWeâ\u0080\u0099re a lot more prepared under this president than we were when China hoisted this on us to begin with,â\u0080\u009d Navarro said. â\u0080\u009cLetâ\u0080\u0099s not forget that China created this pandemic. They hid the virus, they created that virus, and they sent over hundreds of thousands of Chinese citizens here to spread out around, and around the world.â\u0080\u009d Navarroâ\u0080\u0099s comments echoed Trump. A day earlier, in Tulsa, the president said that said â\u0080\u009cChina sent us the plague,â\u0080\u009d going on to use a term widely considered racist for the virus, which, further, incorrectly calls it a flu. Before the rally Saturday night, six campaign staffers tested positive for the coronavirus and are reportedly quarantining in Tulsa."}]}