{"article": [{"url": "https://www.marketwatch.com/story/night-and-day-new-york-imagines-a-post-covid-future-2020-06-12", "published": 1592133320.0, "headline": "Night and day, New York imagines a post-COVID future", "body": "The obvious things are obvious: Staggered shifts in the office. Spaced-out tables in restaurants. Hand sanitizer everywhere. But as American businesses sketch out a post-COVID future, dozens of other changes are almost certainly on the way. And many of them are being quietly imagined now in New York City. Why wouldn’t they be? New York doesn’t only have America’s largest urban economy. With 209,000 confirmed coronavirus infections and more than 17,100 deaths, no city has a deeper hole to climb out of. Yes, the lingering threat of a deadly pandemic really does change everything, morning, noon and night. When it comes to New York night life, size suddenly matters in ways it never has before. “The big nightclubs will have the toughest road back,” said David Rabin, the New York night-life pioneer behind such era-defining venues as the Meatpacking District’s Lotus and Double Seven. “The whole point of a big club is a large number of people packed together. That’s a very hard sell right now.” The post-COVID future belongs to smaller, neighborhood venues, especially restaurants, bars and lounges with a rooftop or an outdoor garden, in locations people can get to without a taxi or subway ride, Rabin said. City Hall is already promising looser permitting for sidewalk cafes. But no one knows yet how the neighbors will respond. See:Yes, America needs to brace itself for a second wave of coronavirus “In recent years, New Yorkers have gotten used to a much quieter city,” said Rabin, whose current portfolio of Manhattan establishments include the Lambs Club, Cafe Clover, American Bar, The Skylark and Jimmy’s on the roof of SoHo’s James Hotel, all of which are currently closed. “What happens when, suddenly, the sidewalks are crowded with outdoor cafes and people are below my window, chatting into the night?” But New York isn’t San Diego. By late October, outdoor dining revenues will fall as sharply as the temperatures. The survive-or-not issue, according to Rabin, is how flexible commercial landlords are prepared to be. “Landlords keep telling bar and restaurant owners, ‘My mortgage documents say I need to get X-dollars a square foot.’ Some landlords are hiding behind that, but it’s a conversation that has to go all the way up the line. I don’t believe the bank really wants to inherit a portfolio of office buildings with four or five retail spaces empty.” The only workable answer may be setting rents as a percentage of revenues, at least temporarily. Eight percent is a figure being thrown around. “Otherwise,” Rabin said, “the city stays boarded up the way it’s boarded up now. Nobody wants that.” Check out the Coronavirus Economic Recovery Tracker At the same time the threat of infection is defining New York after dark, the coronavirus has also delivered wrenching new challenges into the realm of family care, as people struggle to look after their elderly, sick and disabled loved ones. “Caregiving was in crisis before COVID,” said Lindsay Jurist-Rosner, CEO of Wellthy, a workplace-benefits company in the Flatiron District that contracts with employers and advises employees on family-care issues. “But people are really struggling now.” Said Jurist-Rosner: “What we are hearing is, ‘I am fine, but this is impacting my parents, my grandparents, my uncle with dementia, my sister with cancer or my kid who can’t go to camp this summer. I need help managing that. And once I return to the office, what’s the risk to my loved ones with chronic conditions? If they get exposed, what’s next?’” These situations aren’t close to rare in a nation where half the people have one or more chronic conditions such as diabetes, cancer or heart disease and where more people than ever live into their 80s, 90s and beyond. With nearly 40% of COVID-19 deaths traced to nursing homes, assisted-living centers and long-term care facilities, many families are trying to juggle these issues at home. But that raises a whole new set of questions: How do you keep mom safe and socially engaged? Who can you hire to look after dad? What safety measures are required at home? How will the aides, sitters and nurses commute back and forth? Oh, and who will pay for all this care? Are health insurance companies providing the benefits they should? Yikes! “It’s a lot,” Jurist-Rosner said. See: The coronavirus is devastating U.S. hospitals, which will lose $200 billion in revenue by the end of June Under Wellthy’s model, each client is assigned a “care consultant,” a social worker or nurse who helps manage these details. The cost is covered by employers, a workplace benefit that joins health insurance, family-leave time and 401(k)s in helping to retain valuable workers. But these are early days in the care-benefits world, and no one can say how these models might change. This much is certain as long as a global pandemic continues to ravage American life: Whatever the issues were before, they are a whole lot tougher now. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}