{"article": [{"url": "https://www.marketwatch.com/story/unilever-and-daimler-lead-european-stocks-higher-despite-u-s-china-tensions-11595497152", "published": 1595483240.0, "headline": "Unilever and Daimler lead European stocks higher despite U.S.-China tensions", "body": "Mercedes-Benz owner Daimler reported the first signs of a sales recovery following the coronavirus pandemic thomas kienzle/Agence France-Presse/Getty Images European stocks edged higher on Thursday but gave back earlier gains as rising tensions between the U.S. and China and American jobs data concerned investors. The pan-European Stoxx 600 SXXP, +0.55% rose 0.1%, while Germany’s DAX DAX, +0.06% traded flat having been 0.6% up earlier in the day. The French CAC PX1, +0.71% fell 0.1%. The early positive mood came despite tensions between the U.S. and China threatening to escalate further. Beijing said its consulate in Houston was ordered shut and warned it would “react firm countermeasures” unless the Trump administration reversed the decision. However, President Donald Trump said closing more Chinese consulates in the U.S. was “always possible.” Secretary of State Mike Pompeo is set to give a policy speech on China later on Thursday. “While the pandemic has been a short, intense headache for economies and markets, two other factors have stuck around like a lingering migraine for the last few years. These are the growing tensions between China and the U.S. and the risk of the U.K. not securing a trade deal with the EU,” AJ Bell investment director Russ Mould said. “For the time being, investors seem to move in whenever there is a drop-off in stock markets,” he added. U.S. jobless claims rose last week by 109,000 to 1.416 million for the first time since March, the U.S. Labor Department said Thursday. The data shifted the mood and ensured European stocks gave back earlier gains. The euro EURUSD, +0.60% continued its rise against the U.S. dollar, which started after European Union leaders agreed a €1.8 trillion ($2.1 trillion) budget and coronavirus relief plan earlier this week, holding steady at $1.158 at near-two-year highs. German consumer confidence rose sharply heading into August, according to data from market research group GfK, which said it was driven by a temporary cut to value-added tax and a government stimulus package. Stocks in focus Unilever ULVR, +0.70% surged 7.9%, after the consumer goods giant reported a rise in profit in the first half of the year. The Ben & Jerry’s ice cream and Dove soap maker made a net profit of €3.28 billion, up from €3.01 billion the previous year, despite the challenges posed by the coronavirus pandemic. The company also announced plans to demerge its tea business, which includes Lipton and PG Tips brands, following a strategic review. Daimler DAI, -1.31% stock climbed 4.3% despite widening losses, as the Mercedes-Benz owner reported seeing the “first signs of a sales recovery” from the pandemic. The auto maker expected to make a profit in 2020, provided the economic recovery continues and there is no second wave impacting sales."}]}