{"article": [{"url": "https://www.marketwatch.com/story/trump-coronavirus-symptoms-resolving-and-improving-doctor-says-2020-10-03", "published": 1601728760.0, "headline": "Trump coronavirus symptoms 'resolving and improving,' doctor says", "body": "President Donald Trump's symptoms are \"resolving and improving\", his physician said Saturday, and he said doctors were \"extremely happy\" with the president's progress, after news early Friday that Trump had COVID-19. \"The team and I are extremely happy with the progress the president has made,\" said Dr. Sean Conley at Walter Reed Medical Center in Bethesda, Md., where the president is staying. \"He had a mild cough and nasal congestion and fatigue, all of which are now resolving and improving,\" said Conley. Conley said that Trump had no fever for 24 hours and that the president was not currently on oxygen. But he did not say whether Trump had ever been on oxygen despite reporters' repeated questions. Trump said early Friday that he and first lady Melania Trump had tested positive. Yet Conley's briefing raised questions about when the diagnosis was known and disclosed. Doctors said it had been 72 hours since Trump's diagnosis. U.S. stocks DJIA, +0.56%  SPX, +0.87%  COMP, +1.39%  ended lower Friday in choppy trade as investors reacted to the Trump news and a weaker-than-expected September jobs report. Trump tweeted late Friday, \"Going well, I think!\" The president's diagnosis immediately scrambled the White House presidential campaign, with about a month remaining until Election Day. Trump's campaign manager Bill Stepien got a positive COVID-19 diagnosis Friday night. See:Trump campaign manager Stepien, ex-aide Conway are latest in president's orbit to test positive for coronavirus. Others in Trump's circle, including ex-aide Kellyanne Conway, tested positive after attending a Sept. 26 Rose Garden ceremony for Supreme Court nominee Amy Coney Barrett. Several others who attended the event have also tested positive, including Sens. Mike Lee and Thom Tillis."}]}