{"article": [{"url": "https://www.marketwatch.com/story/what-could-save-the-hotel-industry-amid-the-pandemic-a-hub-for-work-and-play-2020-08-25", "published": 1598529020.0, "headline": "What could save the hotel industry amid the pandemic â\u0080\u0094 a hub for work and play", "body": "Like so many industries upended by COVID-19, hospitality is undergoing a massive transformation. U.S. hotels are losing $400 million a day in room revenue, adding up to over $46 billion so far in 2020. The staggering loss has accelerated trends, forcing change faster than anyone could have ever anticipated. Weâ\u0080\u0099re witnessing what I call a â\u0080\u009cgreat rethinkingâ\u0080\u009d of everything, a mini-revolution of sorts in hotel management, as it is now painfully clear that running a hotel â\u0080\u0094 a big, expensive box full of space and full of staff â\u0080\u0094 canâ\u0080\u0099t rely on a single driver of demand: The traveler staying the night.Offices are dead The transformation orbits around the usage of space and expanding traditional revenue management beyond the standard 4 p.m. check-in/10 a.m. checkout. The future of hotels lies in maximizing and optimizing hotelsâ\u0080\u0099 real estate assets in new and novel ways. It starts with rethinking the word â\u0080\u009cguest.â\u0080\u009d Todayâ\u0080\u0099s guests arenâ\u0080\u0099t just the international travelers and overnight guests that the industry has traditionally relied on. Rather, thereâ\u0080\u0099s been a dramatic expansion of the industryâ\u0080\u0099s addressable market, offering new revenue opportunities to not just plug gaps but to actually build stronger and more resilient businesses by optimizing the usage of hotel assets 24/7. The great rethinking sits at the confluence of two other major spatial trends: the mainstreaming of remote work and the focus on hyperlocal travel. Remote work: In the COVID era, the mainstreaming of remote work is reshaping cities. Executives at outdoor retailer REI have been â\u0080\u009csurprised by how productive remote work has been.â\u0080\u009d The company now plans to sell its marquee headquarters in Seattle before staff even moved in. And co-working companies are struggling to adjust to a reality where people avoid offices and spend more time working from home. Marquee coworking brands are retreating fast and forced to close locations in urban centers. This leaves building owners with not just empty space but also fewer potential tenants; demand for centralized offices may permanently shift as more companies reduce their office footprints and expand remote work. Even so, the â\u0080\u009cend of the officeâ\u0080\u009d is overblown. Facebook FB, +0.26% Â even expanded its square footage in New York City. But at the same time, it announced a longer-term focus on remote work. With more companies warming to remote work, the satellite office is already emerging as a real estate hotspot. And what are hotels? Evenly distributed satellite offices, all with reliable WiFi, safety and cleanliness standards, natural social distancing and space to spread out. And many have amenities to replace the perks cushy offices: concierge, pool, spa, hot tub, gym, restaurants on-site, full conferencing facilities and in-house AV teams. Hotels are well-suited to becoming hubs of remote work. Hyperlocal: Just like Airbnb unlocked tremendous value for homeowners that had unused space in their homes, COVID is forcing hotels to unlock underutilized spaces too. What do property owners and hotel management companies do in a world where international travel dips up to 80% in 2020? They narrow focus and target locals, a cohort thatâ\u0080\u0099s actually far more numerous than international travelers in most regions. As people travel closer to home, hotels actually have a bigger addressable market than could have been reasonably expected prior to COVID. The funny thing about remote work and hyperlocal travel is that there has been a vocal minority of digital nomads living this truth for years. Working from a hotel is nothing new. And day passes for pools are a major business in certain locales, such as Las Vegas. But just like everything else, COVID has accelerated existing trends and brought fringe ideas directly into the mainstream. Hotels can now seize new revenue opportunities by catering to cooped-up remote workers eager to swap work-from-home with work-from-hotel â\u0080\u0094 even if only for one day of super-productivity per week. Itâ\u0080\u0099s a quick transition that has meaningful long-term implications for hotel managers and asset owners.Unlocking flex spaces Hereâ\u0080\u0099s our view of whatâ\u0080\u0099s next: More flexible experiences tailored to the hyperlocal guest and a much more nuanced focus on ancillary revenue that takes cues from airlines and retail. The most successful hotels will unlock revenue opportunities across their properties by targeting new audiences beyond the 1.5 billion international arrivals. They will intelligently monetize every single corner of their space to diversify and stop betting the house solely on travelers staying the night. And â\u0080\u009cwork from hotelâ\u0080\u009d is just one of the emerging revenue management and asset optimization tactics for hotel owners and managers. It all comes down to unlock the real estate asset for flexible use and new revenue streams. Pools: Plenty of guests would be happy to pay to lounge by the pool â\u0080\u0094 and spend more money on food and beverages too, as most people who spend the day by the pool order a drink and something to eat. This also further differentiates hotels against Airbnb, as a hotel provides more day activities than an apartment. Gyms: How about creating monthly passes for the person that is satisfied with casual exercise in just a bit of weights and elliptical machines? As a matter of fact, according to a 2018 research from the International Health, Racquet and Sportsclub Association, the health industry is serving about 72 million Americans of which only 18% go to the gym regularly. Priced correctly, everyone else would happily be served by an unimposing hotel gym that could offer affordable rates and a wide network of convenient locations. Parking: Well, you know where Iâ\u0080\u0099m going here. And again, the hotel has an advantage over parking companies: It has a director of revenue on payroll that is trained to keep track of all major local events in order to price out rooms correctly. Mr. Hotelier, how about surge pricing for parking along with your rooms? Subscriptions: Recurring revenue is the Holy Grail of business. Subscriptions help even out any unexpected dips of demand and can provide a solid financial base for any hotel operation. Up until now, hotels really only leveraged subscriptions through complicated devices like timeshares. With this renewed focus on asset optimization, hotels can build subscription packages around certain levels of access to the property. This could be a coworking membership, with access to a certain number of workrooms during each month, a swim club membership or a traditional gym membership. What the future holds In this vision of the near future, hotels all over the world will become hubs for leisure and work, widely distributed near remote workersâ\u0080\u0099 homes, as they serve in more locations than solely major metropolitan areas. Theyâ\u0080\u0099ll offset their widely fluctuating performance-based room night rates into recurrent membership-based monthly rents, which can combine access to other amenities into a variety of tiers that allow for modern merchandising and 1:1 personalized marketing. Hoteliers will go through some operational and architectural reorganization to satisfy this new market. Some floors may be converted to â\u0080\u009cwork-from-hotelâ\u0080\u009d and some rooms converted into premium private offices. Hotels can use the COVID-19 downtime to replace traditional thinking about the hotel asset class with an agile network of well-distributed multi-use properties with multiple revenue streams. Things are tough right now but hotels are flexible and adaptable. Hotels have an unprecedented opportunity to rethink operations and expand offerings to become hubs for work and play â\u0080\u0094 and to become tomorrowâ\u0080\u0099s red-hot asset class in the process. Yannis Moati is the chief executive officer of HotelsByDay, a booking platform for day-use hotel rooms."}]}