{"article": [{"url": "https://www.marketwatch.com/story/vivint-smart-homes-undiscovered-growth-stock-jumps-after-jp-morgan-calls-it-a-home-run-2020-08-13", "published": 1597391600.0, "headline": "Vivint Smart Home's 'undiscovered growth stock' jumps after J.P. Morgan calls it a 'home run'", "body": "Shares of Vivint Smart Home Inc. rallied to a five-month high Thursday, after Wall Street's most-bullish analyst got even more bullish, saying the smart-home security services company was for investors \"looking for a home run.\" J.P. Morgan analyst Paul Coster already had the highest stock price target on Wall Street at $22, but he raised it even higher to $30, which is about 58% above current levels. He reiterated the overweight rating he's had on the stock, which is also his \"top pick\" within the applied technology sector and is on J.P. Morgan's \"Analyst Focus List.\" His target is now 50% above the second-highest target of $20 of Evercore ISI's Amit Daryanani, according to FactSet. Vivint stock VVNT, +0.10%  rose 7.9% to $18.96, the highest close since March 13. It has run up 63.2% over the past three months, while the S&P 500 index SPX, +0.87%  has gained 19.6%. \"We know the price target is a bit of an outlier, but we're looking for a home run here,\" Coster wrote in a note to clients. He said his more bullish outlook on the \"somewhat undiscovered growth stock\" comes after a \"fireside chat\" with Vivint Chief Executive Todd Pedersen. And Coster's past calls suggest when he speaks, investors should pay attention. \"We believe growth momentum, revenue visibility, expanding margins, improved cash flow and optionality warrant a close look at this leader in smart home solutions by tech investors, by GARP investors, and a re-rating could be spurred on by branding events and improved stock liquidity,\" Coster wrote. GARP stands for growth at a reasonable price. With 95% of its revenue recurring and 1.6 million subscribers, and growing at a compounded annual growth rate (CAGR) of 15%, Coster said \"there's a lot to like here.\" Vivint holds a \"meaningful\" leadership position in the professionally installed, smart home/home security market at a time when homeowners are making significant investments in their homes, he said. While Vivint's success has come without broad awareness of the brand, Coster said CEO Pedersen has committed to fixing that. Investors can expect Vivint's brand profile to improve in the coming quarters, which should help drive up sales and investor interest, Coster said. Vivint went public in January via a reverse merger valued at $4.2 billion with special purpose acquisition company, or \"blank check\" company, Mosaic Acquisition Corp. The company started trading under its current name and ticker symbol on Jan. 21. Coster has changed his view on Vivint many times since the company went public, but has been spot-on with his moves. He started coverage of the stock with an overweight rating and $15 stock price target the day after the stock closed at $11.72 on Jan. 24. He lowered his rating to neutral on Jan. 31 after the stock nearly doubled since it went public. FactSet, MarketWatch Coster then turned bearish, downgrading the stock to underweight, after the stock closed at $25.65 on March 10. After the stock plunged to close at $11.55 on March 16, amid concerns over the impact of the COVID-19 pandemic, he upgraded the stock to neutral. With the stock pulling back to $15.32, about a month after a recovery rally that took the stock up to $17.98 on June 22, Coster upgraded Vivint to overweight, saying the 14% retracement, while the S&P 500 rose nearly 4%, provided an \"opportunity to accumulate shares\" at a reasonable price. After Vivint reported a narrower-than-expected second-quarter loss and revenue topped expectations, after the stock closed at $17.04 on Aug. 6, he added Vivint to the \"Analyst Focus List\" as a high conviction growth idea. His price target increase on Thursday comes after the stock closed at $17.58 on Wednesday. \"In our view, the stock looks attractively valued here, and ready for discovery for a broader range of investors as the company transitions into sustainable positive cash flow, enabling the paying down of debt and a potential re-rating,\" Coster wrote."}]}