{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-global-confirmed-case-tally-climbs-above-19-million-us-death-toll-moves-above-160000-after-11-days-of-more-than-1000-2020-08-07", "published": 1596806540.0, "headline": "Coronavirus update: Global case tally climbs above 19 million; U.S. death toll moves above 160,000 after 11 straight days with 1,000-plus fatalities", "body": "The number of confirmed cases of the coronavirus illness COVID-19 climbed above 19 million worldwide on Friday, according to data aggregated by Johns Hopkins University, and the death toll rose above 715,000, with more than 160,000 of those deaths in the U.S., which has suffered 11 straight days with 1,000 or more fatalities. The U.S. now has almost 5 million confirmed cases of COVID-19, and at least 160,111 people have died. And while case numbers are coming down in some places that were recently seeing spikes, confusion over how some localities are reporting their infections has raised speculation that the publicly available numbers are not offering a true picture. California state officials said Thursday they have identified a bug in the electronic system used for collecting infectious-disease data, creating confusion just as public health, education and business leaders are trying to plan for an uncertain future, the San Francisco Chronicle reported. The problem may have led to underreporting of COVID-19 cases in many if not all counties, the paper reported. Gov. Gavin Newsom has been using those numbers to reassure Californians that their numbers were coming down. News on Thursday that Ohio Gov. Mike DeWine tested positive for COVID-19, only to test negative hours later using a different kind of test, highlights the problem facing states grappling with unreliable test kits. DeWine was first tested using an antigen test, which is faster but understood to be less accurate than a polymerase chain-reaction test, which delivered the later negative result. The governor was being tested ahead of planned meeting with President Donald Trump. The news caps a week in which testing has been a major area of concern for experts, who say the U.S. is still not conducting enough tests, or following through with contact tracing and isolation. A group of governors combined forces earlier this week to order millions of tests in an effort to reduce the backlog. Read now:Coronavirus testing in the U.S. is dropping, even as deaths mount A Pew Research Center survey published Thursday found most Americans — 69% of those polled — believe state governments moved too quickly to lift restrictions on movement, creating the current wave that is moving fast across the South, West and even Midwest regions that previously had few cases. The survey of 11,001 adults conducted July 27 to Aug. 2 found about six in 10 Americans believe the U.S. response to the outbreak has been less effective than those of other wealthy nations. The U.S. has about 4% of the global population but accounts for roughly a quarter of global cases and deaths. Nearly half of Americans, or 48%, rate President Donald Trump’s response to the pandemic “poor,” up 16 points since March. “Positive views of the performance of public health officials also have declined significantly: 63% now say public health officials, such as those with the CDC, are doing an excellent or good job in responding to the coronavirus outbreak, down from 79% in March,” the survey found. Latest tallies There are now 19.1 million confirmed cases of COVID-19 worldwide, the Johns Hopkins data shows, and 715,802 people have died. At least 11.6 million people are confirmed to have recovered from the illness. Brazil is second to the U.S. with 2.9 million cases and 98,493 deaths. India is third measured by cases that rose above 2 million on Thursday, followed by Russia with 875,378 and South Africa with 538,184. Mexico has 462,690 cases and 50,517 deaths, the third highest in the world. The U.K. has 309,796 cases and 46,498 fatalities, the highest in Europe and fourth highest in the world. China, where the illness was first reported late last year, has 88,460 cases, and 4,680 fatalities.|What’s the latest medical news? Pfizer Inc. PFE, -0.27% will help manufacture Gilead Sciences Inc.’s GILD, +0.82% COVID-19 treatment remdesivir as part of a multiyear agreement, MarketWatch’s Jaimy Lee reported. The news marks a rare manufacturing deal between two of the world’s largest drug makers and reflects the urgency in developing treatments and therapies for the deadly illness. “Together, we are more powerful than alone,” Pfizer CEO Albert Bourla said in a news release. Remdesivir, which has received an emergency-use authorization from the Food and Drug Administration as a treatment for severely ill COVID-19 patients, has not been formally approved by the regulator. Separately, the National Institutes of Health will conduct a randomized, controlled clinical trial testing a combination of remdesivir with Merck KGaA’s MRK, +0.46% interferon beta-1a as a treatment for COVID-19 patients. The study plans to enroll 1,000 people who have been hospitalized because of a COVID-19 infection. The federal agency said it expects to have preliminary results in the fall. The trial is one of several that have been initiated to pair the investigational therapy with other drugs to see if the combination can better treat severely ill COVID-19 patients. The list includes an NIH trial pairing remdesivir with Eli Lilly & Co. LLY, +2.20% and Incyte Corp.’s INCY, +3.19% Olumiant. Roche Holding AG ROG, +1.80% has also said it will test its rheumatoid arthritis drug in combination with remdesivir. What’s the economy saying? The torrid pace of U.S. employment growth in the late spring gave way in July to a sharp slowdown in hiring, underscoring the fragile nature of a recovery with the coronavirus still running rampant in many states, MarketWatch’s Jeffry Bartash reported. The economy recaptured 1.76 million jobs last month, just one-third of the revised 4.79 million gain in June. The official unemployment rate, meanwhile, fell for the third month in a row to 10.2% from 11.1%, the government said Friday. The increase in new jobs was slightly above the 1.68 million anticipated by a MarketWatch-compiled forecast. The smaller increase in job creation took place against the backdrop of surge in coronavirus cases in a number of states, including California, Texas and Florida. Some restrictions on businesses were reimposed, and Americans showed more caution in where they went and what they did. See also: MarketWatch’s Coronavirus Recovery Tracker The U.S. shed more than 22 million jobs at the height of the pandemic. So far it’s restored about 9.3 million, leaving well more than half of the Americans who lost their jobs in the lurch. “The economic outlook deteriorated markedly from the middle to the end of July as consumers became less willing to spend money, and businesses grew increasingly uncertain about the demand for their goods,” said economist John Leer at Morning Consult. “As a result, the current employment situation is likely weaker than these numbers indicate.” Read:Consumers hold the key to an economic recovery and right now they’re very anxiousWhat are companies saying? Disney Loses Nearly $5 Billion Amid Pandemic • Datadog Inc. DDOG, +8.89%, a cloud monitoring software company, reported second-quarter adjusted earnings and sales above Wall Street expectations and said its customers are under “business pressures” due to the pandemic. “While the current macro environment has caused business pressures for our customers, we expect it to accelerate digital transformation and cloud migration over the long-term,” Chief Executive Olivier Pomel said in a statement. “We continue to execute on our strategic priorities to position for the long-term, including rapid product innovation and expansion of our go-to-market.” Datadog, which had an initial public offering in August 2019, said it expects third-quarter revenue between $143 million and $145 million, and an adjusted EPS between break-even and 1 cent. For the full year, the company called for revenue between $566 million and $572 million, and adjusted EPS between 11 cents and 13 cents. • Designer Brands Inc. DBI, -1.28%, owner of shoe retailers including DSW Designer Shoe Warehouse, is taking steps to bolster liquidity, including replacing a $400 million revolving credit facility with an equally-sized, asset-based revolving credit facility, as well as a $250 million privately placed senior secured term loan. “Since confronted with the challenges posed by COVID-19, we have acted decisively to prioritize the health and safety of our associates and customers and protect the long-term sustainability of our business,” Chief Executive Roger Rawlins said in a statement. “Today’s announcement represents another critical step that increases our financial flexibility and total liquidity.” The company reorganized and cut staff in July impacting more than 1,000 positions, or about 8% of its North American work force.. • Dish Network Corp. DISH, -0.90% posted better-than-expected second-quarter earnings estimates. Dish TV net subscribers fell by about 40,000 in the quarter, while Sling TV subscribers fell about 56,000. “The COVID-19 pandemic has caused significant disruption in certain commercial segments served by DISH, including the hospitality and airline industries,” the company said. Dish paused service on about 250,000 commercial accounts in the first quarter and removed them from its subscriber count. In the second quarter, about 45,000 of those accounts resumed normal service. The company ended the quarter with 11.27 pay-TV subscribers, including 9.02 million Dish TV subscribers and 2.25 million Sling TV subscribers. •Dropbox Inc. DBX, +3.66% reported second-quarter revenue that was in line with Wall Street estimates, underscoring the need for Dropbox’s technology among millions of Americans working from home during the pandemic. Dropbox reported net income of $17.5 million, or 4 cents a share, compared with a loss of $21.4 million, or 5 cents a share, in the year-ago quarter. Adjusting for stock-based compensation and other factors, Dropbox reported net income of 22 cents a share, compared with 10 cents a year ago. Revenue improved 16% to $476.4 million from $401.5 million a year ago. Analysts surveyed by FactSet had expected adjusted net income of 17 cents a share on sales of $465 million. • Eventbrite Inc. EB, -0.09%, the event-management services company posted second-quarter earnings that beat Wall Street estimates but a sharp decline in revenue, reflecting the devastating impact coronavirus has had on live entertainment. The company’s expense reduction plan, announced in April, “remains on track to yield at least $100 million in annualized expense savings by the fourth quarter of this year.” • Illumina Inc. ILMN, +1.57% reported second-quarter results that were shy of Wall Street expectations, saying that many of its research clients remained closed due to the pandemic. “As expected, the second quarter was significantly impacted by pandemic-related disruption in our customers’ operations and was particularly challenging for many of our research customers who remain closed or operating at limited scale,” Chief Executive Francis DeSouza said in a statement. Illumina said it continues to forgo fiscal 2020 guidance “due to the uncertainties around the severity and duration of the COVID-19 pandemic.” It ended the quarter with free cash flow of $202 million, compared with $96 million in the second quarter of 2019. • Trade Desk Inc. TTD, +1.24%, an advertising technology company, reported results and provided an outlook that exceeded Wall Street expectations. “While the advertising industry hit the pause button early in the second quarter due to uncertainty around the COVID-19 pandemic, we saw substantial improvement in ad spend as the quarter progressed,” said Jeff Green, Trade Desk chief executive, in a statement. Trade Desk expects third-quarter revenue of $177 million to $181 million, while analysts had forecast revenue of $158.7 million. • Uber Technologies Inc. UBER, -0.18% posted another quarterly loss of more than $1 billion Thursday as the COVID-19 crisis took a toll on its core ride-hailing business, which was actually surpassed by Uber’s food-delivery business. The company’s results fell short of Wall Street’s expectations on the bottom line, but revenue actually held up better than analysts projected. Uber’s ride-hailing business has taken a huge hit. Gross bookings fell 35% to $10.2 billion, but bookings within the “mobility” segment fell more steeply at 73%, and ride-hailing revenue plunged 67% from last year to $790 million. Chief Executive Dara Khosrowshahi described the ride-hailing business as “a tale of 10,000 cities” in a conference call, saying that cities in Asia and Europe are bouncing back while the U.S. is struggling. “Our Mobility recovery is clearly dependent on the public health situation in any given area,” he said. See also:Uber, Lyft drivers in limbo as judge hears arguments in case brought by California • Zillow Group Inc. Z, -0.74% reported second-quarter revenue that was well above Wall Street expectations and said work-from-home trends during the pandemic have led more people to think about moving. “Zillow’s second-quarter results are even better than we had hoped, and firm up our belief that powerful tailwinds in both real estate and technology are rapidly converging, with Zillow at the nexus,” Chief Executive Rich Barton said in a statement. The pandemic and work-from-home policies “are inspiring people to rethink their homes and consider moving,” he said. Zillow said it ended the quarter with the highest cash balance in its history, or cash and investments growing to $3.5 billion from $2.6 billion at the end of first quarter. Its home buying and selling business started the quarter with home acquisitions temporarily paused due to market uncertainty, but it has resumed buying and selling homes, ending the quarter with 440 homes in inventory, the company said. “Zillow Offers is now actively purchasing homes in all 24 markets where it previously operated,” it said."}]}