{"article": [{"url": "https://www.marketwatch.com/story/why-an-approved-coronavirus-vaccine-may-not-end-the-pandemic-quickly-11599648279", "published": 1599642020.0, "headline": "Why an approved coronavirus vaccine may not end the pandemic quickly", "body": "Workers pack syringes at the Hindustan Syringes factory in Faridabad, India, on September 2, 2020. sajjad hussain/Agence France-Presse/Getty Images Tesla Chief Executive Elon Musk did warn you. In May, when the electric vehicle’s stock was less than half its current value (adjusted for the split), Musk famously tweeted that his company was overvalued. Investors finally shared that view on Tuesday when the stock dropped 21%, its worst-ever decline, after S&P Dow Jones Indices didn’t allow Tesla TSLA, +1.89% into the S&P 500. Since Sept. 2, the worst Nasdaq-100 performers have been Tesla, electronic-signature provider DocuSign DOCU, +2.36%, semiconductor manufacturing company KLA KLAC, +2.10%, Zoom Video Communications ZM, +2.89%, and computer graphics chipmaker Nvidia NVDA, -0.54% — all except KLA have at least doubled in price this year. While the timing perhaps came out of the blue, the actual declines can be explained away as a correction to irrational exuberance, for the technology sector in particular. Also read: Here’s the silver lining — stocks have done well after similar Nasdaq corrections But one reason for the market’s swagger, at least until September, was the work from multiple companies on a coronavirus vaccine. Evercore ISI hosted a call on this subject, and the takeaway was sobering. Speaking before the news that AstraZeneca halted its COVID-19 trial because of an illness, analyst Josh Schimmer pointed out that in most vaccines, pharmaceutical companies settle for lower rates of immunity in exchange for better tolerability. Now, he said, companies are pushing the protective profile to go for maximum effect, knowing it may come with more side effects. He put greater than 50/50 odds that the first vaccines will work well — which he defined as either 90% reduction in event rates, or a strong benefit for severe cases. AstraZeneca AZN, +0.63%, along with the vaccines created by the Pfizer PFE, -0.27% /BioNTech BNTX, +1.23% collaboration and Moderna MRNA, +0.09%, were seen as the most likely to complete the late-stage trial by October. The Novavax NVAX, +0.18% vaccine, which many investors see as their favorite according to Schimmer, is expected to complete Phase 3 in December. But the next most likely scenario is they work but not great, like the flu vaccine, in which case, the impact on alleviating the pandemic would be limited. “I don’t know if a 60% efficacy COVID vaccine gets us out of this mess quickly,” he said. (The minimum effectiveness is 50%). In that scenario, the hope would be that the second wave of vaccines work better, to “switch vaccine horses midstream if better ones come along.” There is a lower chance the vaccines don’t work, or make infections worse, or have problematic side effects, he added. More positively, analyst Vijay Kumar said newly approved rapid, point-of-care antigen tests will be helpful in reopening the economy and alleviate the testing constraints. He said by the first half of next year, anyone who wants a test can go get tested. The buzz AstraZeneca AZN, +1.16% said it “voluntarily paused vaccination to allow review of safety data by an independent committee,” and described the pause as “routine.” the New York Times reported a volunteer in the U.K. trial had received a diagnosis of transverse myelitis, an inflammatory syndrome that affects the spinal cord and is often sparked by viral infections. LVMH Moet Hennessy MC, +1.15% said it will not be able to complete the previously announced $16.2 billion takeover of Tiffany TIF, +0.37%. sending the stock of the U.S. luxury-goods retailer sharply lower in premarket and prompting a lawsuit to enforce the acquisition. Slack WORK, +3.36% may see pressure after the maker of office-communications software topped analyst expectations on its earnings and outlook, but not by as much as Zoom Video Communications. Athletic apparel maker Lululemon Athletica LULU, +2.52% reported stronger-than-forecast earnings and revenue. It is a pretty quiet day on the economics front, highlighted by a Bank of Canada interest-rate decision and U.S. job openings data. Former Vice President Joe Biden proposed a new offshoring tax penalty as well as a proposal to double the minimum tax on foreign earnings. The market After the 4.1% nosedive for the Nasdaq Composite COMP, +1.39% and 2.8% tumble for the S&P 500 SPX, +0.87%, futures action ES00, +1.13% pointed to more of an upbeat start, particularly for the Nasdaq-100 NQ00, +1.63%. Crude-oil CL.1, -1.62% futures rose, while gold fell. The yield on the 10-year Treasury TMUBMUSD10Y, 0.777% edged up to 0.69%. The chart Citi reports that the easing of social distancing in the global economy continued for two weeks since late August. Global mobility improved to -14.4% from -16.5%, and to -17.4% in the U.S. after hovering around -19% for two months. Random reads The first 3,200-megapixel digital photo was taken — it would take 378 4K ultra-high-definition TV screens to display. A compilation of love songs made by English singer Ed Sheeran at age 13 was sold at auction for £50,000 ($65,000). Robot dogs joined a U.S. Air Force exercise, in a trial to see whether they can be added to “the kill chain.” Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}