{"article": [{"url": "https://www.marketwatch.com/story/boeing-earnings-preview-can-the-company-meet-even-low-expectations-2020-07-24", "published": 1595933600.0, "headline": "Boeing earnings preview: Can the company meet even low expectations?", "body": "Boeing Co. is slated to report second-quarter results Wednesday before the bell, giving investors a clearer picture of the coronavirus pandemic’s impact on a company already beset with problems of its own making. Boeing BA, -0.39% is scheduled to hold a call with analysts after the results. The company has a low bar to clear in the second quarter as “investor expectations remain low,” analysts at Goldman Sachs said in a recent note. The quarter’s cash burn likely will be high, but Boeing likely will be able to say that it is at a peak, the analysts said. Production rate revisions are possible, but largely already anticipated by investors, they said. Expect investors to be keen on any updates about the company’s 737 Max aircraft. Boeing’s 737 Max jets have been grounded world-wide since March 2019, following two deadly accidents less than five months apart believed to be due to a faulty antistall system. The fixes are still under regulator review, and the jet’s return to service has been postponed repeatedly. The company has set a 2020 return to service. The Wall Street Journal recently reported, however, that new snags are likely to delay that to early 2021 at the soonest, as the Federal Aviation Administration has decided to ask for public comment before completing Boeing’s software and hardware changes. Related:Airbus to cut workforce in bid to weather its ‘gravest crisis’ That would postpone an overseas return to the skies as well, as other regulators would take weeks to follow the FAA. Here’s what to expect: Earnings: Consensus from 27 Wall Street analysts polled by FactSet calls for a GAAP loss of $1.86 a share for Boeing, which would compare with a GAAP loss of $5.21 a share in the second quarter of 2019. The analysts expect an adjusted loss of $2.57 a share, which would compare with an adjusted loss of $5.82 a share a year ago. The second quarter of last year was the first full quarter after the 737 Max groundings. Estimize, a crowdsourcing platform that gathers estimates from Wall Street analysts as well as buy-side analysts, fund managers, company executives, academics and others, is expecting an adjusted loss of $2.24 a share. Revenue: The analysts surveyed by FactSet expect sales of $12.95 billion for Boeing, down from $15.75 billion a year ago. Estimize sees revenue of $13.32 billion for the company. Stock movement: So far this year, Boeing shares have lost 48%, compared with losses around 7% for the Dow Jones Industrial Average DJIA, +0.56% and breakeven for the S&P 500 index SPX, +0.87% in the same period. Boeing is a Dow component. What else to expect: Analysts at Cowen earlier this month were concerned that the consensus expectations for Boeing looked too high, making the quarter “a wild card.” Second quarter “will be a mess,” they said, with the EPS expected loss looking “optimistic given sharply lower commercial delivery/service sales and hefty severance & MAX compensation payments,” they said. Spiking COVID-19 cases in the U.S. and renewed tensions with China are additional headwinds. Several airlines, plagued by steep declines in revenue thanks to the near standstill of business and leisure travel, already announced early retirement of some of their Boeing planes and postponed or canceled their orders altogether. Earlier this month, Boeing reported that it delivered 70 aircraft this year through June, a 71% decline year-on-year. See also: Boeing’s Q2 commercial airplane deliveries drop 78% from last year as COVID-19 weighs “More importantly, cancellations continue to eat away at the backlog,” analysts at RBC said in a note. On the brighter side, June could have been the peak of bad news on the sales front, the analysts said. “Though the near-term operating environment remains bleak, we view June deliveries (down 73% year-on-year and 150% month-on-month) as indication that the worst of the production headwinds associated with the Max grounding and COVID-19 are likely behind us,” they said."}]}