{"article": [{"url": "https://www.marketwatch.com/story/this-unappreciated-climate-change-risk-lurks-in-many-portfolios-according-to-blackrock-2020-07-27", "published": 1595869640.0, "headline": "This unappreciated climate-change risk lurks in many portfolios according to BlackRock", "body": "Water stress — when demand for H20 exceeds supply — is an underappreciated investing risk that cuts across regions, asset classes and sectors, the world’s largest fund firm BlackRock warns. The hardship threatens public health, production facilities and global supply chains and should be given as much attention as growing climate-related risks such as hurricanes, wildfires and flooding, said the firm, with some $7 trillion under management, in a report. The analysts included a map that glares red in the most at-risk regions. Large cities will need to strengthen their water infrastructure, BlackRock says, citing World Resources Institute findings. World Resources Institute/BlackRock Within a decade, much of the world will lie in regions of high water stress, projections by the World Resources Institute show. Northern Africa is one high-risk zone, as seen by the red tones in the chart above. The risks also have geopolitical dimensions, as highlighted by a recent spat over a large hydroelectric project in Ethiopia that neighbors Egypt and Sudan fear could reduce water availability. Read:For first time ever, majority of shareholders push oil giant Chevron to align with Paris climate pact Finding the companies that recognize this issue and, especially, those that can solve for it, will be key to investing in the coming years. BlackRock CEO Larry Fink to kick off 2020 declared addressing climate change an investing mandate. “In the near future — and sooner than most anticipate — there will be a significant reallocation of capital” driven by climate factors, Fink said in January. BlackRock analysts said in their latest update that combining climate modeling with the geolocation of physical assets can help investors get a better handle on the risks to companies and their human capital. Companies in water-stressed locations may need to spend more to source water, to raise water efficiency and to meet more stringent environmental regulations. Already, a recent European Central Bank report included water stress among the physical climate risks it may require financial institutions to manage and disclose. Read:BlackRock uses shareholder meeting to insist it follows version of ‘corporate purpose’ framework, push environmental priorities The causes of water stress are varied. Population growth and urbanization increase demand for water and strain resources. At the same time, climate change is shifting the distribution of water supply by disrupting precipitation patterns. Sector distinction matters. The agricultural, textile, energy, industrials, chemicals, pharmaceutical and mining industries account for around 70% of freshwater usage globally, according to the Carbon Disclosure Project’s 2018 global water report. The risks from water stress are most acute in water-intensive industries. In the agricultural sector, for instance, reduced water availability for irrigation can lower crop yields. In electric utilities, water is critical for cooling thermal power plants. In real estate, climate-related risks such as water stress could accelerate a tenant preference for “green” buildings. And the creditworthiness of some countries, states and municipalities facing water shortages could come under threat due to rising costs to fortify water resources. Read:We can restock the oceans by 2050, netting $10 for every $1 spent on conservation — here’s how “We believe many of the risks are not yet priced in by financial markets,” the analysts said, adding that “a strategic tilt toward assets that score highly on sustainability may mitigate the risks, helping provide real resilience in portfolios.” And opportunities can be found. “Better understanding and quantifying the risks can help investors mitigate exposures and potentially exploit any mispricing,” BlackRock said. “Investors today have more options than ever before to integrate sustainability into portfolios. This includes thematic investing that targets specific sustainability trends — and new benchmarks that offer broad market exposures while providing a tilt to sustainability.”"}]}