{"article": [{"url": "https://www.marketwatch.com/story/he-went-from-billionaire-to-relatively-broke-and-living-in-a-small-apartment-just-like-he-planned-11600282985", "published": 1601145200.0, "headline": "He went from multibillionaire to relatively broke and living in a small apartment - just like he planned", "body": "Chuck Feeney Atlantic Philanthropies “ 'I believe strongly in giving while living. I see little reason to delay giving when so much good can be achieved through supporting worthwhile causes today. Besides, it's a lot more fun to give while you live than to give while you are dead.' ” That's the attitude of Chuck Feeney, the one-time billionaire who has spent several decades doing his best to give away his fortune. Just as he was wildly successful as the co-founder of retail giant Duty Free Shoppers, he was also accomplished in meeting his charitable goal. This week, Feeney closed his 38-year-old Atlantic Philanthropies, having donated all his cash to such lofty endeavors as bringing peace to Northern Ireland and modernizing Vietnam's health care system. More recently, he spent $350 million to turn New York city's Roosevelt Island into a technology hub, Forbes reported. His donations include a total of $3.7 billion to education and another $870 million to fight for human rights and social change, like $62 million toward abolishing the death penalty in the United States and $76 million to back the passage of Obamacare. \"We learned a lot. We would do some things differently, but I am very satisfied. I feel very good about completing this on my watch,\" Feeney, now 89, told Forbes. \"My thanks to all who joined us on this journey. And to those wondering about Giving While Living: Try it, you'll like it.\" Feeney years ago said he would set aside about $2 million to fund his and his wife's retirement. Dubbed the \"James Bond of Philanthropy\" by Forbes, Feeney now lives in a small apartment in San Francisco that \" has the austerity of a freshman dorm room. \" Hear more from the man himself: div.youtube { height:0; position:relative; padding-bottom:56.25%; } div.youtube > iframe { position: absolute; left: 0; top: 0; width: 100%; height: 100%; } While he didn't trumpet all his accomplishments along the way, Feeney was still incredibly influential, with both Berkshire Hathaway's BRK.A, +0.06% Warren Buffett and Microsoft MSFT, +2.48% co-founder Bill Gates cheering his work. \"Chuck's been the model for us all,\" Buffett told Forbes when asked for comment. \"If you have the right heroes in life, you're 90% of the way home. Chuck Feeney is a good hero to have.\" At the closing of Atlantic Philanthropies, which was done over Zoom, Gates and former California Gov. Jerry Brown both sent video messages praising Feeney's work. Also, Speaker of the House Nancy Pelosi sent an official letter from the U.S. Congress thanking him. Feeney was definitely feeling the love: iframe.twitter-tweet { width: 100% !important; } \"I'm not here to tell anyone what to do with their money,\" Feeney once said. \"You make your money, you do what you want with it. But I think there is an obligation, certainly for the haves, to reach out and to see what they can do.\""}]}