{"article": [{"url": "https://www.marketwatch.com/story/european-commission-cuts-economic-forecast-2020-07-07", "published": 1594100720.0, "headline": "European Commission cuts economic forecast", "body": "The eurozone's economic contraction will be larger than initially expected this year as lockdowns intended to contain the spread of the novel coronavirus are eased more gradually than anticipated, the European Commission said Tuesday. In the latest of four reports on the economic outlook that are published each year, the Commission said the combined economic output of the 19 countries that share the euro will fall by 8.7% in 2020, a deeper decline than the 7.7% forecast three months ago. The European Union's executive arm highlighted widening divergences between the eurozone's members, and said shared action is needed to limit the fallout for the currency area as a whole. The Commission said it now expects Italy's economy will contract by 11.2% this year, having previously forecast a decline in gross domestic product of 9.5%. By contrast, it lowered its forecast for the decline in Germany's GDP to 6.3% from 6.5%. \"The policy response across Europe has helped to cushion the blow for our citizens, yet this remains a story of increasing divergence, inequality and insecurity,\" said Paolo Gentiloni, the top Commission official with responsibility for economic policy. The Commission has proposed an economic recovery plan that would see it take the unprecedented step of borrowing hundreds of billions of euros from the markets to hand out to the worst-affected member states. But EU leaders have yet to sign off on that proposal. The Commission said the eurozone's economy likely shrank by 13.6% during the three months through June, when strict lockdowns were widespread across the currency area. That would be the largest drop in output during a single quarter since the EU's predecessor organization was established in the 1950s. The Commission said the rebound in 2021 will likely be slower than it had expected three months ago, lowering its growth forecast for the year to 6.1% from 6.3%. Write to Paul Hannon at paul.hannon@wsj.com."}]}