{"article": [{"url": "https://www.marketwatch.com/story/what-is-a-poll-watcher-and-who-gets-to-be-one-on-election-day-and-what-hipaa-does-and-doesnt-protect-2020-10-09", "published": 1602268100.0, "headline": "What is a â\u0080\u0098poll watcherâ\u0080\u0099 and who gets to be one on Election Day? and what HIPAA does (and doesnâ\u0080\u0099t) protect", "body": "TGIF, MarketWatchers. Donâ\u0080\u0099t miss these top stories:Personal Financeâ\u0080\u0098HIPAA does not give you a get-out-of-jail-free cardâ\u0080\u0099: What the health-privacy law does (and doesnâ\u0080\u0099t) protect Because President Donald Trump is receiving health care from a 'covered entity,' his information would be protected under the law, experts said.Pierce Brosnan just listed his Malibu retreat for a whopping $100 million Pierce Brosnan and his wife, Keely Brosnan, have listed their luxe Malibu property for an eye-popping $100 million. I signed my home over to my daughter temporarily to protect it during my divorce. Now Iâ\u0080\u0099m 69 and living in an RV. Can I file for elder abuse? â\u0080\u0098Itâ\u0080\u0099s Shakespearean, in a Mrs. Lear kind of way.â\u0080\u0099Weekend reads: Best new money ideas Also, Harvardâ\u0080\u0099s investing lesson and a better way to apply to selective colleges.Broadway wonâ\u0080\u0099t reopen until June 2021 because of the pandemic â\u0080\u0094 3 reasons why theaters will be closed for so long â\u0080\u0098Our audience has to be safe no matter what age they are,â\u0080\u0099 said Charlotte St. Martin, president of the Broadway League, but she acknowledges social distancing will be difficult.â\u0080\u0098Worldâ\u0080\u0099s best barâ\u0080\u0099 now offers its award-winning cocktails in canned form Annual global sales for canned cocktails stand at $20 billion and are expected to rise to $146 billion in the next 10 years, according to one industry report.Harris-Pence debate put spotlight on 54 million Americans with pre-existing conditions â\u0080\u0094 and how they would be covered if Obamacare falls Vice President Mike Pence said the Trump administration will protect people with pre-existing conditions, but didnâ\u0080\u0099t get specific.How to wear high-end labels without high-end prices Here are some tips forÂ saving on sought-after labels with different price points and levels of brand prestige.6 things you should add to your pandemic travel kit Besides your mask and hand sanitizer, here are several less obvious items you may want to bring.What is a â\u0080\u0098poll watcherâ\u0080\u0099 and who gets to be one on Election Day? President Donald Trump says he wants his supporters â\u0080\u009cto go into the polls and watch very carefully.â\u0080\u009d Elsewhere on MarketWatchWhen are the confirmation hearings for Supreme Court nominee Amy Coney Barrett? Confirmation hearings for President Donald Trumpâ\u0080\u0099s Supreme Court nominee Amy Coney Barrett are set to kick off Monday, in what promises to be an intense Washington spectacle just three weeks before Election Day. Trump does â\u0080\u0098radio rallyâ\u0080\u0099 with Rush Limbaugh, while Biden campaigns in Nevada With 25 days to go till the election, President Donald Trump is taking part Friday in a radio rally with conservative host Rush Limbaugh, while Democratic challenger Joe Biden campaigns in Nevada.On again: Pelosi, Mnuchin talk again about big fiscal stimulus, but no deal After House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin talked by phone, the provisions on coronavirus testing remained a sticking point.Gilead Sciences agrees to sell to Europe up to 500,000 courses of remdesivir Deal with European Commission comes amid a surge in COVID-19 cases across Europe.As number of COVID infections keeps rising, hereâ\u0080\u0099s what governments have to do this winter Spain, France and the U.K. are fast moving toward the kind of tough COVID-19 lockdown measures in place earlier this year."}]}