{"article": [{"url": "https://www.marketwatch.com/story/minutes-of-feds-meeting-show-unease-among-officials-over-new-interest-rate-strategy-11602096667", "published": 1602082760.0, "headline": "Minutes of Fed's meeting show unease among officials over new interest-rate strategy", "body": "Federal Reserve Chair Jerome Powell arrives to speak at a \"Fed Listens\" event last year eric baradat/Agence France-Presse/Getty Images Federal Reserve Chairman Jerome Powell and his allies on the central bank faced skepticism and opposition in trying to guide markets about the future path of interest rates, minutes of their September meeting released Wednesday reveal. After their meeting, he Federal Open Market Committee released a statement vowing to keep interest rate near zero until inflation is on track to moderately exceed the central bank's 2% target for some time. Fed officials also released projections showing they expected rates would stay near zero until the end of 2023 at least. There were two dissents from the new forward guidance from the ten voting members of the committee. It wasn't known until the minutes were published Wednesday that unease about the new policy was fairly broad among the remaining seven officials who didn't vote. According to the minutes, \"several\" of these Fed officials balked at the strategy, in part because the guidance could limit the central bank's flexibility. They also argued that by influencing the market's view about the future path of short-term interest rates, \"such guidance could contribute to a buildup of financial imbalances that would make it more difficult for the FOMC to achieve its objectives in the future.\" A \"couple\" of Fed officials argued against the strategy for different reasons. They wanted the Fed commitment to keep interest rates near zero to be even stronger and less qualified. They wanted the Fed to say that the policy rate would remain near zero until inflation had moved above 2% for some time. In what might cause confusion to investors, Fed officials stressed the new strategy was not \"an unconditional commitment\" to a particular path of interest rates. Information pointing to a stronger economic recovery in the wake of the coronavirus pandemic would tend to lead to expectations for a shorter period of rates being kept near zero and vice versa, the Fed said. Many market observers tend to talk about the Fed \"promising\" to keep rates at zero until 2024. Stocks were sharply higher on Wednesday, with the Dow Jones Industrial Average DJIA, +0.56% up over 500 points in afternoon trading."}]}