{"article": [{"url": "https://www.marketwatch.com/story/jobless-claims-climb-back-above-1-million-2020-08-20", "published": 1597920680.0, "headline": "Jobless claims climb back above 1 million as recovery in U.S. labor market slows", "body": "The numbers: Initial weekly jobless benefit claims rose in mid-August and topped 1 million again, potentially pointing to an increase in layoffs after a summer surge in the coronavirus epidemic or perhaps to more people applying for benefits after President Trump temporarily added $300 in extra federal payouts. New applications for unemployment benefits, a rough gauge of layoffs, climbed to 1.11 million from 971,000 in the prior week, the Labor Department said Thursday. Economists polled by MarketWatch had forecast 910,000 new claims in the seven days ended Aug. 15. These seasonally adjusted figures reflect applications filed the traditional way through state unemployment offices. The increase in new claims wasn’t as bad as it seemed, however, based on actual or unadjusted figures. They rose a much smaller 52,776 to 891,510 and remained below 1 million for the third straight week. Customers walk into the 5th Avenue Apple store as it re-opens for appointments in Manhattan. The U.S. economy is slowly coming back to life, but millions of Americans are still jobless. Getty Images MarketWatch is reporting select jobless claims data using unadjusted figures to give a clearer picture of unemployment. The seasonally adjusted estimates typically expected by Wall Street have become distorted by the pandemic and appear to overstate new claims at times. “It is not entirely clear to me what is happening here,” said chief economist Stephen Stanley of Amherst Pierpont Securities. “My bottom line is that these data remain extremely noisy and not especially helpful for gauging the health of the labor market.” Unemployment is still extremely high by any measure, however. Jobless claims are almost five times higher now than they were before the pandemic struck. Earlier in the year they were running in the low 200,000s per week and stood near a 50-year low. The number of people receiving traditional jobless benefits through the states, meanwhile, fell by a seasonally adjusted 636,000 in the week ended Aug. 8 to a new pandemic low of 14.84 million. These so-called continuing claims are reported with a one-week lag. The unadjusted total was somewhat lower. Read:Google searches on how to ‘file for unemployment’ is a crystal ball for jobless claims Read: Did the expired $600 federal jobless benefit keep people from going back to work? What happened: New claims rose slightly to an unadjusted 1.43 million last week if workers eligible under a separate federal program are counted. Some 542,797 freelance writers, self-employed people and gig workers like Uber drivers also applied for benefits last week. Although the federal government is longer adding $600 to a person’s weekly state benefits, the law that expanded eligibility for benefits goes to the end of the year. President Trump has since ordered reduced federal payments of $300 after a divided Congress failed to agree on another bailout package. Some states began offering the extra federal cash last week, possibly inducing more people to apply. Altogether, 28.06 million people were still receiving benefits through eight state and federal assistance programs as of Aug. 1, the latest data available. That’s down from unadjusted 28.26 million in the prior week. Some analysts suspect the number is inflated by double counting and other problems at overburdened state employment offices handling a record increase in claims. The government’s monthly survey of households report showed a much smaller 16.3 million people were unemployed as of July. Big picture: The economy sprang back to life in the second quarter after states allowed businesses to reopen in the wake of the coronavirus pandemic, but progress in the months ahead is likely to be more uneven. The coronavirus is still rampant even as new case numbers decline and worries are growing about a big spike in the fall. Many businesses, schools and other organizations, meanwhile, are struggling to figure out how to adapt, adding to a complicated process of getting the economy back up to full speed. A recent survey of consumer sentiment shows Americans think a full recovery will take years. Read: Americans worry the economy will suffer for a long time even as they keep spending What they are saying? “The amount of unemployment in the U.S. economy is gradually falling, but is still very high and the pace of improvement is slowing,” said Gus Faucher, chief economist of PNC Financial Services. “It is too soon to tell if the expiration of bonus unemployment insurance payments of $600 per week at the end of July has had any impact on the labor market.” Market reaction: The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% were set to open lower in Thursday trades."}]}