{"article": [{"url": "https://www.marketwatch.com/story/the-market-collapsed-under-its-own-weight-says-nomura-quant-guru-to-explain-wall-streets-violent-selloff-on-thursday-2020-06-12", "published": 1592037560.0, "headline": "â\u0080\u0098The market collapsed under its own weight,â\u0080\u0099  says Nomura quant guru to explain Wall Streetâ\u0080\u0099s violent selloff on Thursday", "body": "After Wall Street stocks on Thursday were convulsed by the biggest selloff since March, dazed analysts scrambled for answers, pointing the finger at the euphoria-driven buying seen among retail investors. But Charlie McElligott, cross-asset strategist at Nomura, says a bigger culprit for why the S&P 500 index experienced a near 6% drop on Thursday was trading by options dealers that had to sell regardless of where they thought equities were headed. On Thursday, the S&P 500 SPX, +0.87%, Dow Jones Industrial Average DJIA, +0.56% Â and Nasdaq Composite COMP, +1.39% Â all booked their biggest daily loss since March 16. McElligott told MarketWatch that worries about a revival of coronavirus infections in some U.S. states created a trigger for the slump in risk assets, but doesnâ\u0080\u0099t explain why stocks sold off so violently. The worries about a second wave of the coronvirus epidemic was a reality check for investors in beaten-down cyclical stocks which were playing catch-up since last week after earlier failing to share in Wall Streetâ\u0080\u0099s two month rally led by technology stocks. Investors had recently seen significant gains among companies with fragile balance sheets and even by those that had filed for bankruptcy. See: In latest market rally, even companies filing for bankruptcy get love In McElligottâ\u0080\u0099s telling, investors had reassessed their gains from these growth-sensitive stocks, with some selling their holdings to realize profits. This, in turn, led to margin calls among retail investors that were trading these shares with borrowed money. â\u0080\u009cNobody believes in their heart of hearts that weâ\u0080\u0099re entering a new secular regime of higher inflation and growth,â\u0080\u009d he said, characterizing the recent rally in these cyclical stocks as more of a rebalancing than an outright rotation away from growth and defensive stocks which had benefited in the past couple of months while cyclical stocks suffered from depressed earnings. But the selloff started to accelerate, especially towards the end of Thursdayâ\u0080\u0099s close, once banks and dealers prominent in options trading started to drive the market. â\u0080\u009cThatâ\u0080\u0099s how you get these crazy exponential-looking moves,â\u0080\u009d said McElligott. It works like this. Investors will buy put options to prevent losses or benefit from a market selloff, while banks and options dealers will sell the options, taking the other side of the trade. When stocks slump, the losses associated with these options will surge for the dealers who sold them, forcing them to sell stocks or stock-futures to hedge their losses. On top of that, dealers want to sell the options before they expire, usually at the end of the week. Thatâ\u0080\u0099s what happened on Thursday, said McElligott, who says there was also price-insensitive selling from commodity trading advisors and other volatility-targeting traders who had to reduce their risk as market volatility surged. â\u0080\u009cTo a certain extent, this risk-on pro-cyclical rally collapsed under its own weight,â\u0080\u009d he said. McElligott says low interest rates and enormous monetary stimulus deployed by central banks has created the tendency for stocks to steadily trend higher before crashing down violently. The suppression of long-term interest rates tends to push investors out of low yielding government bonds into riskier assets, often bought with borrowed money, adding fuel to the equities rally. Meanwhile other traders sell derivatives that generate income if volatility remains low but who then need to hedge when stocks become volatile. Eventually, these short-volatility strategies become so large that when the pendulum swings the other way, they add fuel to sharp market reversals. â\u0080\u009cThis is how you get these Minsky moment blowups. We have a pennies in front of steamrollers dynamic,â\u0080\u009d he said, referring to the onset of a market crash driven by bullish speculators taking profits combined with options sellers unwinding positions. The term Minsky Moment was popularized in 1998 by Paul McCulley of PIMCO fame while referring to the Asian and Russian debt crisis of 1997-1198, after economist Hyman Minsky described the tendency of markets to collapse when speculative activity has been fueled by excessive leverage. Still, McElligott said there is a positive side. Much of the need to sell by these options desks and volatility-targeting investors had been washed out Thursday, allowing the U.S. stock market to stabilize on Friday. Indeed, the S&P 500 and Dow are trading tentatively higher, with both up more than 1% as they look to claw back the previous sessionâ\u0080\u0099s losses. Read: Hereâ\u0080\u0099s how the stock market tends to trade after brutal selloffs like Thursdayâ\u0080\u0099s"}]}