{"article": [{"url": "https://www.marketwatch.com/story/more-americans-are-worried-about-retirement-now-and-their-plans-have-changed-11594745719", "published": 1594731800.0, "headline": "More Americans are worried about retirement now â\u0080\u0094 and their plans have changed", "body": "A global pandemic, record levels of unemployment and uncertainty about the near or distant future has Americans worried about their retirement.Â A greater percentage of Americans (62%) said they are more concerned about retirement today than they were in May, when that figure was 56%, according to the July 2020 Retirement Confidence Index from SimplyWise, a financial technology firm. In total, 70% of people in their 50s, or those closest to retirement age, said they were more worried about retirement now.Â Respondentsâ\u0080\u0099 current finances are suffering as well â\u0080\u0094 35% said they couldnâ\u0080\u0099t last more than a month on their savings. That reality is even worse for black respondents (48% of whom said this was the case) and Hispanic respondents (43%). A third of white survey respondents said they could survive less than a month with their current savings. SimplyWise conducted its survey of more than 1,100 Americans 18 and older online during the first week of July.Â In response, nearly three-quarters of these survey participants said they plan to work in their retirement years and another 20% said they intend to delay their Social Security benefits. More than half of the respondents said they are earning what they had prior to the coronavirus pandemic â\u0080\u0094 broken down, 50% of Hispanic Americans said that was their current situation, 45% of black Americans and 67% of white Americans. Three in 10 Americans who were fired or furloughed said theyâ\u0080\u0099ll hold off on taking their Social Security retirement benefits.Â See: We have $190,000 in retirement savings and want to use the COVID-related distribution rules to pay off $40,000 in debt â\u0080\u0094 should we?Â Prolonging a career is one way to build up a nest egg fit for retirement, but it isnâ\u0080\u0099t for everyone. Not all workers can stay in their jobs or their fields into their retirement years, because some careers are too physically demanding. Others may have unexpected emergencies that deter them from working into their old age, such as an illness or injury. Delaying Social Security benefits allows that monthly payment to be higher when it comes time to claiming, but not everyone can afford to wait.Â In some cases, the coronavirus crisis may push older workers into retirement sooner than they anticipated. Millions of Americans have lost their jobs, and finding a new one is difficult â\u0080\u0094 especially for older workers. The unemployment rate for Americans 55 and older was 11.8% in May, up from 2.6% in January, according to the U.S. Bureau of Labor Statistics.Â Still, those looking to work at least partly in their retirement should consider a few factors, such as if their employee offers a phased retirement program or schedule or where they could find that job flexibility. They should also come up with income goals, including how much they expect to live off of every month plus a cushion, and what they want their retirement to look like in an ideal situation."}]}