{"article": [{"url": "https://www.marketwatch.com/story/is-suze-orman-right-is-a-traditional-ira-really-the-wrong-way-to-invest-for-retirement-2020-06-19", "published": 1592837180.0, "headline": "Is Suze Orman right? Is a traditional IRA really the wrong way to invest for retirement?", "body": "Personal finance celebrity Suze Orman says retirement savers should steer clear of traditional accounts in lieu of Roth accounts, especially during this global pandemic. But like everything else in personal finance, that advice largely depends on the individual. During a conversation on the “Pivot” podcast, Orman said savers should weigh the tax consequences of sticking with a traditional-style account, such as a 401(k), 403(b) or individual retirement account. Traditional accounts are funded with pretax dollars, whereas Roth accounts use after-tax dollars. Investors with traditional accounts pay taxes at the time of distribution, while withdrawals from Roth accounts are tax-free. What's the difference between a 401(k) and a Roth 401(k)? “Do you really think that tax brackets aren’t going to have to go up five, 10, 15 years from now in order to pay for all the debt that we’re carrying? Of course they’re going to have to,” she said during her chat. People should flock to Roth accounts to take advantage of “the lowest tax brackets” Americans will see for a while, she said. Orman’s advice occasionally appears controversial, such as the time she suggested people should cut out to-go coffee if they ever want to comfortably retire. The problem with this particular piece of advice is that it’s too general, said Monica Dwyer, vice president at Harvest Financial Advisors. “I think that Suze is concerned that future taxes will be much higher because we cannot continue on the spending parade that we have been on, our deficit is ballooning and, just like someone with a lot of credit card debt, this debt will have crushing consequences at some point,” she said. “Does that mean her advice is good? Not necessarily. It just depends on the person.” See: Suze Orman wants you to stop ‘peeing $1 million down the drain’ Giving blanket advice on finances is always tricky, said Dennis Nolte, vice president of Seacoast Investment Services. Different accounts serve various purposes and usually fit within larger retirement savings and spending strategies. Generally, younger people benefit from Roth accounts as they are typically in low tax brackets while starting their careers and middle-aged people in their peak earning years benefit from traditional accounts, he said. It’s also hard to tell what the future holds, even with the best intentions and plans. “With perfect information about our career trajectory, future earnings and future tax rates, we’d simply be able to model whether contributing to our 401(k) on a pretax or Roth basis was best,” said Roger Ma, a financial adviser at lifelaidout. “Unfortunately, we don’t know any of that information.” Financial advisers weighed in on the pros and cons of using Roth accounts over traditional accounts, and what people should consider when deciding between the two. Going for a Roth account People who are in low tax brackets today and expect their earnings to increase in the next few decades would get the most out of a Roth account, Ma said. They would be paying the tax on their contributions today at that low rate and withdrawing the money tax-free when they could potentially be in a higher bracket. Roth accounts are usually best for younger investors, who have not yet reached their peak earning years. “Folks just starting out might have almost 40 years of tax-free growth,” said Thomas Scanlon, an adviser at Raymond James. “What a great way to build wealth.” The only people who could really take the advice of choosing a Roth account over a traditional account more seriously are those who are just beginning their careers, those pursuing an early retirement and older retirees who have more than enough money saved for their lifetimes, said Malcolm Ethridge, executive vice president and a financial adviser at CIC Wealth. “Other than that, you really have to dig into that person’s individual financial situation to know whether they would truly reap the benefits of the Roth or if they’d be better served going with a traditional,” he said. Investors can also dip into their Roth IRAs more easily than a traditional account. Roth account holders are allowed to withdraw from their contributions — not the earnings in those accounts — at any time because they’ve already paid the taxes on that money. There are separate, more complex, rules around distributions regarding investment earnings, which depend on how many years the account has been opened and the age of the investor at the time of withdrawal. Don’t miss: I’m so confused: How do I treat withdrawals from a Roth IRA? Orman is right in that these tax rates are a deal right now. “The tax code today is about as favorable as it’s ever been and the likelihood of that changing (to be higher) in the future is pretty good,” said Mark Beaver, a financial adviser at Keeler and Nadler. “Because of that, we look to add to Roths directly or do things like backdoor Roth contributions or conversions where it makes sense.” Still, using Roth accounts at first depends on each individual situation, and there are times when someone might want to opt for a traditional account in the present day and consider a Roth conversion later on. Sticking with the traditional account Someone who is in a high tax bracket today and expects to be in a lower tax bracket at retirement would get the most out of a traditional account, since the tax rate at the time of withdrawal would be lower, Ma said. Traditional accounts also allow more money to grow over time with compound interest. “Going from a traditional to Roth is giving up a lot of assets and income,” said Chris Chen, a financial adviser at Insight Financial Strategists. “The name of the game is not to pay no taxes on distribution, but to minimize taxes over a lifetime.” A Roth IRA also isn’t tax-free, as many Roth advocates tout, it’s just taxed differently, he said. Also see: I’m a 32-year-old stay-at-home mom, and my husband earns $150,000 a year. Will I ever be able to enjoy a retirement? These accounts come with their own sets of advantages. Traditional accounts allow for tax deductions, depending on income, while Roth accounts do not. Therefore, contributions can lower the amount of earnings that are taxable each year. “Pretax contributions are one of the few tax reduction strategies many workers have available,” said David Jackson, a financial adviser at Modern Horizons Wealth Advisors. “Especially now, since fewer are able to itemize because of the increased standard deduction.” Not all plans allow for a Roth option, said Jennifer Weber, vice president of financial planning at Weber Asset Management. “It’s important to understand the following: what your company offers, does your company offer a match on retirement contributions and are you eligible to contribute directly to a Roth IRA (based on income limits),” she said. Congress could also potentially change the rules around Roth retirement accounts, Dwyer said. The Secure Act, passed in December, had sweeping changes to the retirement industry, and included tweaks about how accounts were taxed and when, such as the stretch IRA. “Congress can get pretty creative about where they are going to collect taxes from and there is no guarantee that they won’t someday go after Roths,” she said. When possible, savers might want to try to have it all — the traditional type of accounts, the Roth ones and even other taxable investment accounts. Diversification is important, not just in the assets held within these portfolios, but in their taxation. Having various types of accounts to fall back on allows investors to draw down their portfolios at different times depending on their future circumstances, and the tax implications of those scenarios. “Being diversified is good and can help you effectively manage tax rates in retirement,” said Devin Pope, a partner with Albion Financial Group. “Have some in taxable accounts, tax-deferred and tax-free.”"}]}