{"article": [{"url": "https://www.marketwatch.com/story/opec-expects-oil-to-hold-ground-as-the-worlds-fuel-of-choice-through-2045-11602178715", "published": 1602166400.0, "headline": "OPEC expects oil to hold ground as the world's fuel of choice through 2045", "body": "Efforts to contain the spread of COVID-19 prompted a significant drop in 2020 global oil demand. alex halada/Agence France-Presse/Getty Images Oil is expected to retain its hold as the world's fuel of choice over the next 25 years, according to the Organization of the Petroleum Exporting Countries World Oil Outlook report released Thursday. The report from the group of major producers said global oil demand is expected to see healthy growth in the next few years, as it recovers from one of the most \"turbulent\" years in the oil industry's history. The COVID-19 pandemic in 2020 \"precipitated an unprecedented health crisis and pushed the global economy into a deep recession,\" as public health measures were put in place to contain the virus, the report said. As a result, \"the oil market experienced a historic shock that was sudden, extreme and global in scale.\" U.S. benchmark oil futures settled below zero dollars per barrel for the first time ever on the New York Mercantile Exchange, at a negative $37.63 a barrel on April 20. On Thursday, the front-month November West Texas Intermediate contract CLX20, -1.62% CL.1, -1.62% was trading above $40 a barrel. There are \"signs of the market rebalancing after the colossal 23 [million barrel per day] contraction in oil demand in April 2020,\" the OPEC report said. However, \"with the massive and rapid build in stocks due to world-wide shutdowns, there is still a long way to go to eliminate huge stock overhang and for the markets to return to balance and stability.\" World oil demand was down by an estimated 9 million barrels per day in 2020 to 90.7 million barrels a day from a year earlier, but it's expected to rise by 7 million barrels in 2021 and see increases each year to 2025, with demand that year forecast at 103.7 million barrels a day, the report said. World oil demand is expected to increase each year from 2020-2025, according to OPEC's World Oil Outlook report. 2020 OPEC World Oil Outlook report Annual forecast increases are relatively high during 2022 and 2023, in part due to a catch up in demand in sectors most affected by administrative restrictions during the COVID-19 crisis, it said, including aviation, road transport and industry. Oil demand growth will be driven by countries that are not part of the Organization for Economic Cooperation and Development (OECD), including Latin America, China, and India. Meanwhile, OECD countries, which include the U.S., will \"shift from positive growth to a negative trajectory within the next few years.\" The report also said it expects oil to \"remain the fuel with the largest share of the global energy mix\" until 2045, accounting for 27.5% of energy demand that year, though that would be down from 31.5% in 2019. \"Oil is expected to remain the dominant fuel, but with a lower share and still ahead of gas and coal.\" Oil will continue to be the most dominant fuel in the world's energy mix to 2045, according to OPEC's World's Oil Outlook report. 2020 OPEC World Oil Outlook report Still, natural gas will be the \"fastest-growing fossil fuel\" between 2019 and 2045, OPEC said. Global demand for the fuel is expected to rise to 91 million barrels of oil equivalent per day in 2045, from nearly 67 mboe/d in 2019. Meanwhile, coal is the only fuel expected to see a decline in demand between 2019 and 2045, the report said, attributing the fall to the shutdown and replacement of coal-fired power plants in the OECD and introduction of \"more energy-efficient technology in other regions to reduce the carbon footprint.\" It's share of the energy mix is expected to decline to 19.7% in 2045, from 26.7% in 2019. Looking further ahead, past 2025, the OPEC report said oil demand is likely to enter a \"relatively long period of plateauing.\" It estimated world oil demand at 109.1 million barrels per day in 2045, up from 103.7 million barrels per day in 2025, but up much more modestly from 108.9 million barrels per day in 2035."}]}