{"article": [{"url": "https://www.marketwatch.com/story/iea-oil-demand-set-for-record-bounce-next-year-2020-06-16-4485149", "published": 1592280560.0, "headline": "IEA: Oil demand set for record bounce next year", "body": "LONDON--The coronavirus pandemic will hammer global growth and oil demand this year but supply cuts from producers and a record rebound in demand in next year will help rebalance the oil market, the International Energy Agency said Tuesday. In its closely observed monthly oil market report, the IEA said that while the world's demand for crude will drop by 8.1 million barrels a day this year--slightly less than forecast in last month's report--demand in 2021 will bounce back by a record-breaking 5.7 million barrels a day. The emergence in recent weeks of parts of the global economy from coronavirus lockdowns has spurred a recovery in crude demand. Chinese oil demand in April was almost back at levels seen a year previously and Indian demand climbed in May. If that resurgence persists, and oil-producing nations stick to their plans to constrict global oil supply, \"the market will be on a more stable footing by the end of the second half [of 2020],\" the IEA said in its report. While the decision of the Organization of the Petroleum Exporting Countries and its allies to extend production cuts through July will help speed up the oil market's rebalancing, \"we should not underestimate the enormous uncertainties\" the market still faces, the agency said. Brent crude oil was last up 0.7% at $39.96 a barrel and front-month West Texas Intermediate futures were up 0.4% at $37.27 a barrel. Both Brent and WTI are up more than 20% over the past month but remain sharply lower for the year-to-date. The agency adjusted its June report to account for the forecast of its parent organization, the Organization for Economic Co-operation and Development, which estimated a 6% global hit to GDP in 2020 and a rebound of 5.2% in 2021. The pace and success with which different nations will reopen their economies is still highly uncertain, the agency added. With the worst effects of lockdown now behind many major economies, the IEA cited French Observatory of Economic Conjunctures data showing a 27% drop in global value-added transport during lockdown, which normally accounts for half of global oil demand. Manufacturing--comprising almost a quarter of the world's energy demand--took a 30% hit, the OECD said. While better-than-expected demand during lockdown prompted the IEA to reduce its forecast fall in annual demand by 500,000 barrels a day from last month's estimate, the nascent recovery underway for oil and oil products has been uneven and will likely remain that way, the agency said. A drop-off in air travel demand means that after falling 3 million barrels during 2020, the IEA expects demand for jet fuel and kerosene to only recover by 1 million barrels a day in 2021, leaving it well below pre-crisis levels. That lopsided rally and a huge glut in inventory has caused a headache for refiners, with margins in freefall in May, and throughputs expected to fall by 5.4 million barrels a day in 2020. However, the agency expects the sector to recoup most of that fall next year. Refiners aren't the only sector of the energy market that have a huge overabundance in supply to burn through. The IEA said OECD oil stocks rose 4.9 million barrels a day in April to 3.1 billion barrels, an amount that will have added to the 'incredible' 90 days of forward demand coverage the agency cited in its report last month. In addition, U.S. inventories remained at record highs in early June, having built by a million barrels a day so far this year. Still, the amount of oil being stored on tankers at sea--a costly last resort during the oil-price plunge in April-- began to fall in May, although it remained a few million barrels off its record highs. Data collected by the IEA show the global oil storage build that accelerated through the first months of the year is expected to go into reverse in June. Cuts from the 'OPEC plus' group--which cut 9.4 million barrels of supply between April and May--and projections that U.S. production will fall by 900,000 barrels a day this year and 300,000 barrels a day next year will help that drawdown, the IEA said. Write to David Hodari at david.hodari@wsj.com"}]}