{"article": [{"url": "https://www.marketwatch.com/story/disney-to-release-mulan-on-disney-launch-new-streaming-offering-2020-08-04", "published": 1596560660.0, "headline": "Disney to release 'Mulan' on Disney+, launch new streaming offering", "body": "Walt Disney Co. DIS, +1.53% plans to sell access to its long delayed \"Mulan\" live-action movie through Disney+ for $29.99, a new approach to that streaming service, and will launch a new international streaming offering under the Star brand. After the stock languished in after-hours trading following the release of third-quarter earnings, shares jumped to gains of nearly 5% after the twin announcements. Chief Executive Bob Chapek announced the new approaches in a conference call Tuesday afternoon related to Disney's fiscal third-quarter earnings report, which showed a loss of nearly $5 billion due to the COVID-19 pandemic. Disney+ has been used as a subscription service that consumers pay for monthly, but Disney plans to offer a pay-per-view version of \"Mulan\" through the service as of Sept. 4 in most territories that have access to Disney+. Disney will charge $29.99 to view the movie in the U.S., but that price could vary slightly in other countries, and Disney will launch the movie in theaters where they are open, Chapek said. Chapek also said Disney will launch a new streaming service under the Star brand after the success of Disney+, which has surpassed 60 million subscribers. \"Mirroring the strategy we successfully pursued with Disney+, the offering will be rooted in content we own from the prolific and critically acclaimed production engines and libraries of ABC Studios, Fox television, FX, freeform, 20th Century studios and Searchlight,\" Chapek said. \"In many markets, the offering will be fully integrated into our established Disney+ platform from both a marketing and a technology perspective and it will be distributed under the Star brand which has been successfully utilized by the company for other general entertainment platform launches, particularly with Disney+ Hotstar in India.\""}]}