{"article": [{"url": "https://www.marketwatch.com/story/if-youre-ever-going-to-tap-into-a-retirement-fund-now-is-the-time-2020-08-27", "published": 1598700740.0, "headline": "Do you have to tap into your retirement funds? Here's the right way to do it", "body": "What if you can't pay the rent, there's nothing in the fridge-and the only money you have is what's in your 401(k) or IRA? It's not a rhetorical question. Millions of Americans have been hammered by the pandemic-induced economic crash. GDP collapsed at a still-hard-to-believe 33% rate in the second quarter. Tens of millions of jobs have been lost. Up to 40 million Americans are at risk of eviction. Meanwhile, nearly 20% of households with kids report being unable to afford to give their children enough food. So what to do? One option for people lucky enough to have a 401(k) and/or an individual retirement account (IRA) could be to tap into them on a short-term basis, says Sally Brandon, senior vice president at Rebalance, an investment and retirement advisory firm. In the old days-as in before the pandemic changed everything-financial advisers like Brandon were pretty much unanimous in their view that you should only take an early withdrawal from your 401(k) or IRA account as a last resort. Not only were there stiff penalties and taxes, but you'd lose time for that money to compound. But now, Brandon acknowledges that \"Your retirement savings may be the only lifeline you have\" and that \"some people might not have a choice-they may have to take money out right now.\" Fortunately, the federal government has eased its strict rules on early withdrawals from retirement accounts. The Coronavirus Aid, Relief, and Economic Security (CARES) Act was passed by Congress with overwhelming, and bipartisan support and signed into law by President Trump in March; among other things, it eliminates the 10% early withdrawal penalty if you're younger than 59½. The money is treated as income, but you're allowed to spread the tax burden over 2020, 2021 and 2022 (the IRS also gives you the option of including the entire distribution in your income for the year of the distribution). If you absolutely must tap your retirement accounts, Brandon offers some useful advice here. Don't take out big sums of cash. \"Just because you can doesn't mean you should,\" she says. \"Consider taking out only a little bit at a time, and keep as much invested as you can.\" Read: I'm a 57-year-old nurse with no savings and I want to retire in 7 years. What can I do? At the risk of stating the obvious, make sure that you have strict priorities for whatever you withdraw. Work with your mortgage company or landlord if necessary to ensure that you can stay in your home. Here's some advice on vital topics like mortgage forbearance and renter protections. Don't skimp on medical care for yourself or your children-staying as healthy as you can now could prevent bigger and more costlier problems down the road. Here's some good advice on a variety of medical matters from Johns Hopkins Medicine, one of the nation's most prestigious health care providers. Maintain your internet, utility and phone accounts-vital lifelines-and again, don't be afraid to contact whoever provides these services to work out more reasonable payment plans if needed. Here are two important resources: the federal Low Income Home Energy Assistance Program and the federal Lifeline Support for Affordable Communications Program. Finally, reliable transportation remains a must. Make sure you can get from A to B as efficiently as possible. Work with friends and neighbors to share resources to save money. For example, if you are going to the drugstore, can you pick up a prescription for someone? And vice versa. Being a good neighbor is always a good idea, particularly at a time like this. Read: This eye-opening experience has me rethinking how Social Security figures into my retirement planning It's also important to remember that in difficult and uncertain times, scams can proliferate. Here are five things you can do to avoid being the victim of a coronavirus scam. There's one thing that all of the above bits of advice have in common: Keep calm and try and avoid getting emotional about your situation. I certainly empathize with what you may be going through, but it's more important than ever to think with a clear head. No one can say when this storm will pass, but pass it shall. Read: How do you know when you're old? From a financial standpoint, your goal should be to focus on the above priorities as we move through this short-term period-while keeping as much of your long-term financial plan intact as possible. Easier said than done, I know. If you have any specific questions about your situation-anything concerning the above-let me know. I'll try and answer a few of your emails in a future column. My email: RetireBetterMarketWatch@gmail.com."}]}