{"article": [{"url": "https://www.marketwatch.com/story/zoom-could-play-an-outsize-role-in-campaign-with-trump-sidelined-by-covid-19-2020-10-02", "published": 1601721260.0, "headline": "Zoom could play an outsize role in campaign with Trump sidelined by COVID-19", "body": "Shares of Zoom Video Communications Inc. were up sharply in trading Friday as the political world began to consider what role the videoconferencing platform will play in coming presidential debates, campaigning, and possibly the appointment of a Supreme Court justice. President Donald Trump’s positive test for COVID-19 not only will sideline him at least two weeks, but also could turn the 2020 race into a virtual-only event over the next month. On Friday, his campaign said the president will hold a virtual campaign rally Friday night. Political pundits and the White House have floated the idea of two planned presidential debates on Oct. 15 and Oct. 29, as well as other events being broadcast via Zoom ZM, +2.89% , Cisco Systems Inc.’s CSCO, +0.15% Webex, Alphabet Inc.’s GOOGL, +1.82% GOOG, +1.97% YouTube, and Microsoft Corp.’s MSFT, +2.48% Skype in lieu of in-person meetings. The Oct. 15 debate is supposed to be a town hall-style session, where voters would pose questions to the candidates. People with the coronavirus are supposed to isolate for 14 days. (Biden has campaigned for the most part in a virtual setting. What public events he has held have been small gatherings with masks and social distancing — which Trump has mocked.) A vice presidential debate, scheduled Oct. 7, will go on as planned. The president and First Lady tested positive before he was to hold a public rally in Florida on Friday and Wisconsin over the weekend. Trump won the swing states four years ago but now trails Joseph R. Biden in both. He may be pressed to hold makeshift virtual events — as Alphabet Inc.’s GOOGL, +1.82% GOOG, +1.97% Google, Microsoft, VMware Inc. VMW, +0.81% , and Facebook Inc. FB, +0.26% have in recent days to introduce products — as a way to reach supporters. Trump might consider the same approach in fundraising; he traveled to New Jersey on Thursday despite knowledge that aide Hope Hicks had tested positive. Most intriguing, Supreme Court nominee Amy Coney Barrett has been on Capitol Hill this week with Vice President Mike Pence and White House Chief of Staff Mark Meadows, where she met with Senate Majority Leader Mitch McConnell, R-Ky., among others. A quarantine could impact her confirmation schedule: Senate Judiciary Committee hearings are supposed to start Oct. 12, and Trump is anxious to have her seated on the court by Nov. 3 election day. A move to Zoom or similar digital format to broadcast events would require some nimble infrastructure work as well as diminish its potential audience. High-speed broadband access remains unavailable for many Americans, a focus of both Trump and Biden’s tech policy. Read more: Here’s where Biden and Trump stand on antitrust, social media and other tech issues"}]}