{"article": [{"url": "https://www.marketwatch.com/story/sum-up-your-retirement-motto-in-just-7-letters-11594912293", "published": 1594898360.0, "headline": "Try summing up your retirement motto in just 7 letters", "body": "Getty Images I saw it as I was returning to our retirement cabin after a mountain biking ride. “How appropriate”, I thought. I loved it immediately. So…I decided to write about it. I was tired. It had been a brutal mountain bike ride in the heavy heat of a Georgia summer; 2 1/2 hours of pounding the hills, burning 1,791 calories in the process (if my FitBit is to be believed). I had a nasty tumble on a steep descent down from the mountain top. My leg was bleeding, but my mind was clear. Crystal clear. I was tired, but content. There’s nothing better than linking up with a reader and doing something I love, and I enjoyed meeting up with David for our mountain bike climb up to Boyd Gap Overlook, where we celebrated by having a passerby take our picture. Just another day in the life of retirement. Never bored. Outside, active, social. And sweaty. I seem to be sweaty a lot these days. It goes with an active life during a Southern summer, and I’m good with that. It’s the path I’ve charted for my retirement. It’s the life I’ve chosen. As I was returning to our cabin from the trail, I slowed for the (one) stop sign in our small mountain community. It was then that I noticed the Jeep in front of me and smiled… Fritz Gilbert NVRBORD I sounded it out in my mind … Never Bored. I loved it immediately. Thoughts of my book came to mind, where I encouraged the reader to rephrase “retire” into “Re-Tire”, or the act of putting new tires on whatever type of vehicle you choose to become in retirement. For the first time in our lives, we’re free to decide what type of vehicle we’d like to become. I even mention that I’d become a Jeep with big “mudder” tires, the better to explore our mountain surroundings. I meant what I wrote, and I followed it up by buying myself an old Jeep as a celebration when my book hit No. 1 on Amazon. But I left something out. Seeing the Jeep in front of me led to a realization. How could I have missed it? Not only should we choose the vehicle and the tires we’d like to become in retirement, but we need to symbolically “personalize our plates”. The owner of that Jeep was genius, and his “NVRBORD” plate was a perfect symbol of an intentional life. Never bored. 7 short letters, but they told me all I needed to know. That person, whoever they were, lived life. I’ve never been a big fan of personalized plates, but they make perfect sense in Re-Tirement. I would argue that “personalizing our plates” is an essential act in planning our retirement. Redefining who we are is critical as we move away from what we “were”, and move toward what we are “becoming”. I’ve always encouraged Re-tirees to have a quick “elevator speech” prepared on who they are in Re-Tirement. Me? I’m an author. I’m a traveler. I’m an outdoorsman. But could I condense an elevator speech down to 7 letters? Challenge Accepted.What’s Your Re-Tirement Plate? Since NVRBORD is taken, I’ll have to find something else. The challenge has become personal for me, as I hope it will become for you. I had fun brainstorming ideas for this post. Here’s what I came up with, along with my “winning” entry. In reverse order, here are the 10 best ideas I could come up with for my personalized Re-Tirement plates: 10. RETIRED — Seems a bit predictable, and doesn’t say enough about LIFE in retirement. 9. EMTNEST –– Better, but still only one facet of the reality of our life. 8. NOOFICE — I don’t miss going to the office, and I suspect I never will. 7. CYAWORK — See ya later, working days. Hello, Freedom! 6. 1FUNDAY — A weekly habit my wife and I recently started, a potential future post… 5. HAVNFUN — Because, well, I can. 4. WONNDUN — We won the game, we’ve crossed The Starting Line. But…I’m far from done. 3. LUVDOGZ — With 4 dogs in our life, this one fits pretty well. 2. OLDNFIT — I’m more fit at 57 than I was at 50, hoping to stay that way til I’m old. And the winner is… IN2LIFE – I’ve decided that Re-Tirement is all about living life, and living it fully. Only seven characters, but they say a lot about how I’ve chosen to live my life in retirement. I’m 100% into life, and I’m living it abundantly. I savor every moment, and I cherish each and every day I’m given. Isn’t that what all of us should be pursuing in Re-Tirement? With every sunset, there’s one less day to enjoy and soon they will be no more. With no more work contaminating my freedom, I’m finally able to be into life every day, in whatever way works for me. What better way to summarize it than those short 7 characters, IN2LIFE? They say, in a statement short enough to fit on a license plate, what my life is about now that I’m Re-Tired. I’m Into Life. Re-Tirement is a time to decide who you want to be. Not only the vehicle you’d like to become, and not only the type of tires you’d like to roll on. Your chosen Re-Tirement vehicle deserves your own set of personalized plates. Take the challenge. How would you summarize what you want your retirement to be, in 7 short characters? Mine? IN2LIFE What’s yours? Fritz Gilbert blogs about retirement at The Retirement Manifesto, where this was first published — NVRBORD. It is republished with permission. Follow him on Twitter @retiremanifesto."}]}