{"article": [{"url": "https://www.marketwatch.com/story/here-are-five-value-stock-picks-that-set-up-your-portfolio-for-a-pandemic-recovery-2020-07-29", "published": 1596293300.0, "headline": "Here are five value-stock picks that set up your portfolio for a pandemic recovery", "body": "If you really want to call yourself a contrarian investor, it’s time for a hard look at what hasn’t worked so far this year — value stocks and dividend stocks. Value stocks have greatly underperformed growth stocks (especially Tesla Inc. TSLA, +1.89% and the hottest tech names) amid the economic slowdown caused by the COVID-19 pandemic. As you can see on the list of dominant tech companies below, most have excellent sales growth even while the recession has hurt so many other companies. This year’s action has exacerbated the long-term trend, setting up a broad recovery play for value stocks and dividend stocks, according to Bill McMahon, the chief investment officer for active trading strategies at Charles Schwab Corp. McMahon was promoted to his current position in November. He was formerly investment chief of ThomasPartners, which runs the largest of the active Charles Schwab Investment Management strategies he is now responsible for. (McMahon joined ThomasPartners when it was established in 2001. That firm was acquired by Schwab in 2012.) During an interview, McMahon said the spread between value stock and growth stock valuations was “wide, historically,” and that “if you were inclined to nibble at value, this is not a bad time to do it.” “Over the long term, you benefit from holding companies that pay dividends, but over the short term it hasn’t worked that way,” he said. This year’s divergence in growth and value performance is outlined below, where McMahon also comments about the super-hot FAANG stocks and the big-tech name he currently favors.Five value-stock picks McMahon discussed five stocks he believes “represent good value,” with an emphasis on attractive and safe dividends for several of them. • Shares of Raytheon Technologies Corp. RTX, -1.46% are down 30% this year. (All returns in this article assume dividends are reinvested.) “The business is split between defense, which is stable with long-term contracts, and commercial aerospace, which is not,” McMahon said. The shutdown of most passenger air travel during the pandemic has been an obvious problem. But McMahon believes over the long term the stock will recover and that the dividend is safe. The yield is 3.11%, which is nothing to sneeze at when 10-year Treasury bonds TMUBMUSD10Y, 0.777% are yielding only 0.59%. • PPG Industries Inc. PPG, +0.65% makes paints and coatings used in various industries. The stock has a dividend yield of 1.96%. It is down 17% this year because of “a lot of economic sensitivity,” especially to auto sales and aircraft production, McMahon said. He likes the company because of its “really strong management team and good balance sheet,” and believes the stock “will have a lot of upside” for long-term investors who can wait for the post-pandemic economic recovery. • Coca-Cola Co. KO, +0.69% made headlines with a 28% decline in second-quarter revenue, but indicated the worst was over, as sales improved during May and June. McMahon said the company’s management is “very committed to the dividend.” The yield is 3.38%. He is also pleased with Coca-Cola’s plan to “get rid of smaller brands.” The stock is down 11% this year, but McMahon expects a resurgence ”when activity resumes and people go to restaurants and ball parks again.” • Home Depot Inc. HD, +0.49% seems always to be in a sweet spot. When the housing market is strong, it helps the company. When the housing market is weak, people do more renovations, which helps the company. McMahon called the business “fairly immune to online competition.” The stock is up 24% this year and has a dividend yield of 2.44%. McMahon expects “good dynamics” for the housing market to continue, as city residents look to the suburbs and the affluent look to coastal areas for summer homes. • Abbott Laboratories ABT, +1.02% has the lowest dividend yield among the stocks McMahon named: 1.44%. He pointed to the company’s “good growth characteristics,” especially through its Freestyle Libre glucose-monitoring system and Ensure nutrition products. McMahon added that Abbott has “been very good with M&A in the past.”The growth-over-value trend speeds up Here are two charts showing the movement of trailing and forward price-to-earnings ratios for the iShares Russell 1000 Growth ETF IWF, +1.52% and the iShares Russell 1000 Value ETF IWD, +0.17% over the past five years: FactSet FactSet We have included charts based on trailing 12-months’ earnings results, as well as consensus earnings estimates over the next 12 months, because the current forward estimates are suspect for many sectors — we cannot know how long the U.S. economic recovery will take. The trailing P/E valuation for the Russell 1000 Growth Index RLG, +1.50% has soared this year, while the valuation for the Russell 1000 Value Index RLV, +0.19% has been flat. On the forward P/E chart, the value group’s P/E has risen considerably this year because of a sharp decline in earnings estimates, but the spread between indexes’ valuations has widened. McMahon pointed to the incredible performance of Tesla TSLA, +1.89%, which was up 268% for 2020 through July 27. “Tesla has become the poster child” for investors’ love of momentum trades, he said. “The performance of the stock has been dizzying,” with investors clamoring to buy “without much regard for the long-term fundamentals or valuation for the business.” The asset inflation brought about in great part by the Federal Reserve’s necessary steps to shore up the U.S. economy has also pushed up valuations for the biggest tech names. The S&P 500 information technology sector is up 17.5% this year, compared with a 1.4% return for the full S&P 500 SPX, +0.87%. FAANGs plus Microsoft The FAANG stocks (Facebook Inc. FB, +0.26%, Apple Inc. AAPL, +1.74%, Amazon.com Inc. AMZN, +3.01%, Netflix Inc. NFLX, +1.43% and Google holding company Alphabet Inc. GOOG, +1.97% GOOGL, +1.82% ) have also had an excellent run. We can add Microsoft Corp. MSFT, +2.48% to that list: Company Ticker Total return - 2020 Quarterly sales growth Trailing P/E Forward P/E Facebook Inc. Class A FB, +0.26% 13.8% 17.6% 32.1 31.1 Apple Inc. AAPL, +1.74% 29.8% 0.7% 29.5 28.2 Amazon.com Inc. AMZN, +3.01% 65.3% 26.4% 145.9 134.9 Netflix Inc. NFLX, +1.43% 53.2% 24.9% 83.0 65.8 Alphabet Inc. Class C GOOG, +1.97% 14.4% 13.6% 30.7 34.3 Alphabet Inc. Class A GOOGL, +1.82% 14.2% 13.6% 30.7 34.4 Microsoft Corp. MSFT, +2.48% 30.0% 13.1% 35.4 31.6 Source: FactSet These six companies have a combined market capitalization equal to 24% of the entire S&P 500 Index SPX, +0.87%. That is quite a concentration of risk. Among the six, the only one McMahon favors right now is Microsoft. Microsoft “has a very strong cloud business and we think their focus on enterprise customers is the right one,” McMahon said. He also pointed to the risk of regulatory actions against Facebook, Alphabet and Amazon.com, because of concern over anticompetitive practices, dominance in online advertising and consumer privacy. “Microsoft has mostly stayed away from those areas, which is a feather in its cap,” he said."}]}