{"article": [{"url": "https://www.marketwatch.com/story/coronavirus-update-us-death-toll-edges-closer-to-15000-and-white-house-task-force-says-21-states-are-in-the-red-zone-2020-07-29", "published": 1596040400.0, "headline": "Coronavirus update: U.S. death toll climbs  above 150,000, and White House task force says 21 states are in the 'red zone'", "body": "The U.S. death toll from the coronavirus illness COVID-19 climbed above 150,000 late Wednesday, and the White House task force created to manage the pandemic said 21 states are now in the \"red zone.\" In a new report, the task force said Alabama, Arizona, Arkansas, California, Florida, Georgia, Idaho, Iowa, Kansas, Louisiana, Mississippi, Missouri, Nevada, North Carolina, North Dakota, Oklahoma, South Carolina, Tennessee, Texas, Utah and Wisconsin each had recorded more than 100 new cases per 100,000 people in the last seven days. The report advises those states to continue or enforce face-mask mandates; to close places where social distancing and mask use cannot occur, such as bars; to move to outdoor dining; to limit the number of people allowed to gather in one place; and to scale up testing, contract tracing and isolating, measures health experts have long said are needed to contain the spread. President Donald Trump at a Tuesday briefing asked Americans to socially distance, wear a face mask when appropriate and avoid indoor and large gatherings. But he also claimed that large parts of the US. are coronavirus-free and again waded into a controversy relating to a video he shared on Twitter late Monday, which has since been removed from social-media sites for promoting COVID-19 misinformation. For more, see: Twitter, Facebook and YouTube are taking down that hydroxychloroquine video, and now Donald Trump Jr. can't tweet for 12 hours \"I think they're very respected doctors,\" he said, referring to the people in the video touting the use of the antimalarial drug hydroxychloroquine on COVID-19 patients. \"There was a woman who was spectacular in her statements about it,\" he told reporters. When a reporter noted that the woman he referred to, Dr. Stella Immanuel, has reportedly made outlandish comments, including that alien DNA is used in medicine, Trump said, \"I thought her voice was an important voice, but I know nothing about her,\" before abruptly ending the briefing. Public health experts are increasingly calling for the U.S. to adopt a more stringent approach to the crisis. Dr. Michael Osterholm, director of the University of Minnesota's Center for Infectious Disease Research and Policy, has repeatedly said the U.S. needs to shut down and start again from scratch. An open letter to America's leaders presented to Trump and governors last week has now been signed by more than 1,000 health professionals, according to U.S. PIRG, the federation of state Public Interest Research Groups, a consumer advocacy group. \"From epidemiologists to emergency-room physicians to mental-health professionals, clearly a lot - and a wide variety - of health workers agree that our ongoing response to the coronavirus is not working,\" said Matt Wellington, U.S. PIRG's public health campaigns director. \"We need to listen to these experts and do what they've been calling for since COVID-19 started spreading across the U.S. in March - stay at home, increase testing and tracing, and make sure all our essential workers have personal protective equipment.\" At the very least, experts would like a federal mandate on wearing face masks in indoor settings, and lament that the topic has become politicized, part of a broader culture war that has polarized the U.S. for the past several years. Video clips tweeted by Trump included an anti-mask message. Read: Donald Trump likes to say we're making 'tremendous progress' - one look at this chart tells a different story An Axios-Ipsos poll released Tuesday found public trust in public health agencies and officials remains high. The Centers for Disease Control and Prevention had a 70% approval rating, though it's worth noting that's down 15 percentage points from early April. State governments had a 57% approval rate, also down about 15 points since April. The least trusted are the federal government, at 35%, and the White House, at 31%, the poll found.Latest tallies There are now 16.8 million confirmed cases of COVID-19 worldwide, according to data aggregated by Johns Hopkins University, and 662,297 people have died. At least 9.8 million people have recovered, the data show. Brazil is second to the U.S. with 2.5 million cases and 88,539 deaths. India is third measured by cases at 1.5 million, followed by Russia with 827,509 and South Africa with 459,761. The U.K. has 303,092 cases and 46,046 fatalities, the highest in Europe and third highest in the world. China, where the illness was first reported late last year, has 87,108 cases, and 4,658 fatalities.What's the latest medical news? There was disappointing news from Swiss drug company Roche AG ROG, +1.80%, which said its rheumatoid arthritis drug Actemra failed in a late-stage clinical trial as a treatment for hospitalized COVID-19 patients, MarketWatch's Jaimy Lee reported. The therapy did not meet the study's primary or secondary endpoints. There was no difference in the number of patients who died by Week 4 among those taking Actemra or placebo, though the company said Actemra may speed up recovery times for hospitalized patients, a finding that needs further analysis. \"We are disappointed that [the study] did not demonstrate a benefit for patients in either clinical status or mortality [by the fourth week],\" Dr. Levi Garraway, Roche's chief medical officer, said in a statement. The global, randomized, double-blind, placebo-controlled Phase 3 trial was conducted with the Biomedical Advanced Research and Development Authority. Earlier this year there was hope that rheumatoid-arthritis drugs could serve as possible treatments for COVID-19 patients; however, Regeneron Pharmaceuticals Inc.'s REGN, +0.36% and Sanofi's SNY, +0.89% SAN, +1.20%  rheumatoid arthritis drug Kevzara also had limitations treating these patients in a recent midstage COVID-19 trial. What are companies saying? The earnings season continued with reports from Dow Jones Industrial Average components Visa Inc. V, +1.80%  and Boeing Co., with the latter reporting a predictably weak quarter with travel grounded around the world and airlines canceling or deferring plane orders. Boeing's loss was far wider than expected, amid a big miss in commercial-airplane revenues and the continued grounding of its 737 Max following two deadly accidents. Visa managed to beat analyst estimates for its quarter, but it said the pandemic is still driving mixed spending trends, with growth in e-commerce spending being offset by sustained weakness in travel-related transactions. In the semiconductor sector, Advanced Micro Devices Inc.'s stock AMD, -3.94%  surged to fresh records after a blowout quarter despite the effects of the pandemic, and outlook that analysts said put it on track to capitalize on weakness last week from Dow component Intel Corp. INTC, -1.03%, which disappointed investors with news of a delay in next-generation chips. Susquehanna Financial analyst Christopher Rolland upgraded AMD to a positive rating from neutral because the company was \"capitalizing on Intel's 7-nm faceplant.\" Rolland also hiked his price target to $85 from $64. See also:AMD stock surges to record after outlook contrasts with Intel's 'faceplant' Related:AMD is set up for blockbuster second half, but it isn't guaranteed Starbucks Corp. SBUX, +0.53% estimated it lost more than $3 billion in sales because of the pandemic and said it plans to offer curbside pickup at more of its stores. The coffee chain swung to a loss and revenue tumbled 38% as same-store sales fell 40%. Two theme-park operators, Six Flags Inc. and SeaWorld Entertainment Inc. SEAS, +3.04%, offered updates that showed the catastrophic effect of closures on their numbers in a sign of what may be expected from Walt Disney Co.'s DIS, +1.53%  parks division. Six Flags said revenue and attendance fell 96% in the second quarter, with reopenings at the end of the period barely moving the needle. SeaWorld updated guidance with the grim news that it expects second-quarter revenue to fall to $18 million from $406 million a year ago. Attendance is expected to total 300,000 guests, which would be 6.2 million fewer than the same period a year ago. Here's the latest news about companies and COVID-19: â\u0080¢ AMC Entertainment Holdings Inc. AMC, -2.17% and Universal Filmed Entertainment Group, a division of Comcast Corp. CMCSA, -0.99%, announced a multiyear agreement in which Universal movies will be shown at AMC Theatres for 2½ weeks before they go online. Under the deal, the so-called theatrical window will be shortened to 17 days from the current 75. For consumers, that means instead of waiting 2½ months to watch a new movie at home, they will be able to see at least some titles just 2½ weeks after they premiere in theaters. The deal settles a dispute between the companies over how soon new films should be allowed to appear on digital platforms. â\u0080¢ Amgen Inc. AMGN, -1.41% reported second-quarter profit that beat estimates and said the pandemic led to delays in treatments. Sales rose 6% to $6.2 billion, thanks to higher unit demand, offset partially by lower net selling prices. \"The pandemic interrupted many physician-patient interactions, which led to delays in diagnosis and treatment with varying degrees of impact across our portfolio,\" the company said. Amgen said it had $2.7 billion in free cash flow in the second quarter, compared with $1.3 billion in the second quarter of 2019, an increase driven primarily by the timing of tax payments, Amgen said. The company reaffirmed its guidance of total 2020 revenue between $25 billion and $25.6 billion, and revised its EPS guidance for the year to between $10.73 a share and $11.43, and revised its adjusted EPS guidance to between $15.10 share and $15.75 a share. â\u0080¢ Blue Apron Holdings Inc. APRN, +1.60% posted better-than-expected earnings for the second quarter, after local stay-at-home orders during the pandemic boosted demand for its meal kits. \"Throughout the second quarter of 2020, Blue Apron experienced a significant increase in demand for its meal kits largely as a result of changes to consumer behavior in response to the COVID-19 pandemic,\" the company said. As a result, it took steps to expand capacity at its fulfillment centers, hiring new employees and boosting wages for frontline workers. The company added 20,000 new customers in the quarter and average revenue per customer rose 25% to $331. Marketing expenses came to $11.6 million, or 8.8% as a percentage of net revenue. Blue Apron is now expecting third-quarter revenue of $112 million and expects a net loss of no more than $18 million. â\u0080¢ Boeing Co. BA, -0.39% reported a much wider-than-expected loss, amid a big miss in commercial-airplanes revenue, but reported free cash flow that was much less negative than forecast. Results were \"significantly impacted\" by the pandemic and 737 Max grounding. Revenue fell 25% to $11.81 billion, below the FactSet consensus of $12.95 billion. Among Boeing's business segments, commercial-airplanes revenue tumbled 65% to $1.63 billion, below the FactSet consensus of $2.91 billion; defense, space and security revenue was little changed at $6.59 billion, just shy of expectations of $6.62 billion; and global services revenue dropped 23% to $3.49 billion, below expectations of $3.68 billion. Free cash flow was negative $5.63 billion, to beat the FactSet consensus of negative $6.67 billion. â\u0080¢ Boston Scientific Corp. BSX, +1.60% reported a loss and sales decline for its second quarter but performed well ahead of estimates. Sales fell at each of the company's divisions, with medical surgical sales down 29.6%, rhythm and neuro down 33.2% and cardiovascular sales down 18.7%. â\u0080¢ Denbury Resources Inc. US:DNR has filed for Chapter 11 bankruptcy protection under a prepackaged plan with its creditors that will enable it to eliminate $2.1 billion of bond debt. The Plano, Texas-based oil and natural-gas company expects to operate as normal during the Chapter 11 process and has a debtor-in-possession revolving loan that will roll into an exit facility of up to $615 million. \"Recently our entire industry has been highly impacted by the global oil demand destruction caused by the COVID-19 pandemic, driving record low oil prices and rapid changes in energy market conditions,\" Chief Executive Chris Kendall said in a statement. Denbury has taken many steps to preserve liquidity, reducing capital spending and general and administrative costs and optimizing operations, he said. â\u0080¢ General Electric Co. GE, +2.85% reported a wider-than-expected second-quarter loss but revenue and free cash flow that beat forecasts. Among GE's business segments, power revenue fell 11% to $4.16 billion, above the FactSet consensus of $3.84 billion; renewable-energy revenue fell 3% to $3.51 billion to beat expectations of $3.44 billion; aviation revenue tumbled 44% to $4.38 billion, below expectations of $4.62 billion; and health-care revenue dropped 21% to $3.89 billion to top expectations of $3.82 billion. \"We're working through a still-difficult COVID-19 environment, and while it's too early to predict the trajectory for the recovery of commercial aviation, we continue to plan for a prolonged return to prior levels of activity,\" said Chief Executive Larry Culp. Separately, GE said it's launching a program to fully monetize its ownership position in oil-services company Baker Hughes Co. BKR, -1.34%  over about three years. â\u0080¢ Norwegian Cruise Line Holdings Ltd. NCLH, +2.91% is extending the suspension of cruises for its three cruise brands to include those embarking between Oct. 1 and Oct. 31. The company said it plans to provide at the end of each month the status of its cruise suspensions in an effort to be transparent. â\u0080¢ SeaWorld Entertainment Inc. is offering $400 million of second-priority senior secured notes that mature in 2025. Proceeds will be used to repay a revolving credit facility, and for working capital and other general corporate purposes. The theme-parks operator joins the many companies issuing record levels of debt during the pandemic. â\u0080¢ Scotts Miracle-Gro shares SMG, +4.65%  headed toward a record after the lawn- and garden-care company reported a third-fiscal-quarter profit that was well above expectations, raised its full-year sales outlook and announced a special dividend. Revenue grew 28% to $1.49 billion to beat the FactSet consensus of $1.31 billion, as U.S. consumer revenue rose 21% to $1.08 billion and Hawthorne sales jumped 72% to $302.9 million. For fiscal 2020, the company expects sales growth of 26% to 28%, while the FactSet current consensus of $3.66 billion implies 16% growth. Separately, the company said it will pay a special dividend of $5 a share, and increased its quarterly dividend to 62 cents a share from 58 cents. Both dividends will be payable Sept. 10 to shareholders of record on Aug. 27. â\u0080¢ Six Flags Entertainment Corp. SIX, -0.32% swung to a second-quarter loss, after revenue tumbled 96%, as its parks were closed during the pandemic. Attendance was also down 96% to 433,000 guests. Total guest spending per capita was down 15% to $35.77. North American park operations stopped on March 13 due to the pandemic. Partial operations of many parks resumed on a staggered basis and with limited attendance towards the end of the quarter. As of June 30, Six Flags had $296 million cash on hand and $460 million available under its revolving credit facility. â\u0080¢ Steve Madden Ltd. SHOO, -2.09% reported a net loss of $16.6 million, or 21 cents per share, after net income of $36.6 million, or 44 cents per share, last year. Adjusted losses of 19 cents per share were better than the expected 27-cents-per-share loss consensus of FactSet analysts. Revenue of $142.8 million was down 68% from $449.6 million last year. The FactSet consensus was for $180 million. Online revenue rose 88%, but the wholesale business was down 72.5% to $100 million. The shoe and accessories company said the wholesale revenue decline was driven by order cancellations. â\u0080¢ Tupperware Brands Corp. shares TUP, -2.46% rose after the maker of food-storage products beat sales estimates for its second quarter. The company, which is in the midst of a turnaround effort, posted a higher profit, driven by cost cuts and gains on the retirement of debt and noncore assets, which were partially offset by restructuring costs. \"Our performance reflects progress made to right size our cost structure and improve liquidity,\" Chief Executive Miguel Fernandez said in a statement. \"We are now increasing our efforts to contemporize Tupperware and become a global leader in sustainable consumer solutions while leveraging the consumer influence of our iconic brand.\" In the second half, the company will focus on improving liquidity, addressing near-term debt obligations and building a stronger balance sheet, while dealing with the effects of the pandemic. â\u0080¢Wingstop Inc. WING, +0.70% reported second-quarter earnings and revenue that beat expectations. Domestic same-restaurant sales jumped 31.9%, well ahead of the 23% FactSet consensus. Wingstop approved a 27% dividend increase to 14 cents per share, payable to shareholders of record as Aug. 28, 2020 on Sept. 11, 2020."}]}