{"article": [{"url": "https://www.marketwatch.com/story/indoor-dining-is-coming-back-to-nyc-heres-why-you-might-want-to-think-twice-about-it-11599758215", "published": 1600074860.0, "headline": "People who tested positive for COVID-19 were twice as likely to have recently eaten at a restaurant: CDC", "body": "Since mid-March New York City restaurants have not been allowed to serve customers indoors. On Wednesday, New York Gov. Andrew Cuomo said restaurants could begin to serve indoors beginning on Sept. 30. (Photo by JOHANNES EISELE/AFP via Getty Images) AFP via Getty Images As New York and other cities loosen restrictions on restaurant dining, here’s some food for thought: people who tested positive for COVID-19 were approximately twice as likely to have reported eating recently at a restaurant compared to people who tested negative, according to a new report released by the U.S. Centers for Disease Control. The report’s findings were based on an investigation of symptomatic patients at 11 U.S. health care facilities. It found that having close contact with people known to have COVID-19 or visiting establishments that offered “on-site eating or drinking options were associated with COVID-19 positivity.” The investigation compared two groups, one made up of people who had tested positive, and another of symptomatic patients who had tested negative. The people who had tested positive were more likely to report dining at a restaurant, including indoor, patio and outdoor seating in the two weeks before the onset of their illness, the CDC said. “Exposures and activities where mask use and social distancing are difficult to maintain, including going to places that offer on-site eating or drinking, might be important risk factors for acquiring COVID-19,” the authors wrote. However, the authors noted several limitations to the findings in the report. One was that researchers didn’t ask patients to distinguish between indoor and outdoor dining when they asked them about eating at restaurants. The CDC report comes as restaurant diners in New York City — who’ve been eating on tables set up in the street — will soon be allowed back inside. Health experts say it’s best to proceed with caution. After a six-month ban, restaurants in the city will be allowed to serve guests indoors at 25% of their usual capacity starting Sept. 30, Gov. Andrew Cuomo said. Unlike restaurants in other regions of the state, New York City restaurants had only been allowed to serve patrons outside. Related: Shake Shack will benefit most from resumed NYC indoor dining: Truist Securities Health experts say indoor dining still poses major risks even though restaurants will be required to follow health guidelines including temperature checks, spacing tables at least six feet apart, and closing at midnight. In a July interview with MarketWatch, Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases for three decades, said he would not dine out at any restaurant, be it inside or outside. “ ‘If you’re going to go to a restaurant, try as best as you can to have outdoor seating that is properly spaced between the tables’ ” — Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases He acknowledged, however, that indoor dining is “much worse” than outdoors. “If you’re going to go to a restaurant, try as best as you can to have outdoor seating that is properly spaced between the tables,” Fauci said. Other health experts have echoed Fauci’s advice. Although diners in New York City will be required to be seated six feet apart — the distance people have been told to maintain to avoid potentially coming in contact with respiratory droplets that can transmit coronavirus — there’s evidence that these droplets have the ability to travel well beyond six feet. “There’s nothing magical about six feet,” Ryan Malosh, an infectious disease epidemiologist at the University of Michigan School of Public Health, told MarketWatch in late July. “That’s about that average distance respiratory droplets can travel, so being further apart from people is always better.” On top of that, air circulation is generally better outdoors than indoors because particles have more room to be dispersed, Malosh said. “Outdoors, a light breeze can disperse particles with no constraint on the distance they can then travel.” That’s important because diners don’t tend to wear masks outdoors. “ ‘Outdoors, a light breeze can disperse particles with no constraint on the distance they can then travel’ ” — Ryan Malosh, an infectious disease epidemiologist at the University of Michigan School of Public Health If people wear masks indoors, however, it can significantly lower the chances of dispersing virus-containing particles, said Thomas Russo, chief of the division of infectious disease at the University at Buffalo. “Whenever there’s a scenario where everyone can wear masks at all times the risk is lower,” Russo said. “When eating you physically can’t wear a mask but you can minimize that risk by popping it back on between bites.” As of Thursday, COVID-19, the disease caused by the virus SARS-CoV-2, had infected 27.9 million people globally and 6.4 million in the U.S. It had killed more than 900,000 people worldwide and at least 191,168 in the U.S., according to Johns Hopkins University."}]}