{"article": [{"url": "https://www.marketwatch.com/story/feds-evans-says-low-inflation-may-require-more-monetary-easing-2020-06-24", "published": 1593008180.0, "headline": "Fedâ\u0080\u0099s Evans says low inflation may require more monetary easing", "body": "The U.S. economy may require more monetary stimulus, especially with inflation so low and at risk of further weakness, Chicago Fed President Charles Evans said on Wednesday. In a speech delivered virtually to a luncheon sponsored by the Corridor Business Journal, a newspaper in Cedar Rapids, Iowa, Evans sounded more worried about the outlook for inflation than some of his colleagues, saying that it has â\u0080\u009cmoved down significantlyâ\u0080\u009d with risks tilted toward further weakness. â\u0080\u009cI think we are going to get to a point before too long where we have to look at our inflation objectives and how the economy is going and make a judgement as to whether additional monetary policy support will be needed,â\u0080\u009d Evans said. Even before the coronavirus pandemic, the Fed was having trouble reaching its 2% inflation target. Since the pandemic hit in March the Fed has cut its benchmark interest rate to zero and purchased more than $2 trillion in Treasurys and asset backed mortgage securities to boost the economy and repair damaged financial markets. Evans didnâ\u0080\u0099t say what policy tool he might favor to use, but said he would be surprised if the Fed cut its benchmark rate into negative territory. Evans was downbeat about the outlook. â\u0080\u009cWhile I hope for a quick rebound in the economy I expect a broad recovery will take some time,â\u0080\u009d Evans said. He said the central bank was in â\u0080\u009cuncharted territory,â\u0080\u009d with the future more uncertain now than anytime in his professional career. The improvement in economic activity seen in the May economic data could simply be timing, he said. Because of the sharp declines in the second quarter â\u0080\u009cwe almost have to see improvement,â\u0080\u009d in the July-September quarter, Evans said. But Evans cautioned it was going to take a while to get back to the economic level of December 2019 before the outbreak of the disease. â\u0080\u009cMy forecast has real GDP returning to its pre-pandemic 2019 fourth quarter level sometime later in 2022,â\u0080\u009d Evans said, but that doesnâ\u0080\u0099t even take into account the steady growth that had been penciled in for 2020. â\u0080\u009cSome previously expected trend growth has been permanently lost,â\u0080\u009d he noted. Evans said the crisis is like none ever experienced. â\u0080\u009cIt is really unusual. Itâ\u0080\u0099s a public health shock weâ\u0080\u0099re trying to respond to. Thatâ\u0080\u0099s just a very different challenge,â\u0080\u009d Evans said. â\u0080\u009cThe first real step on the way back is to make people comfortable with the state of public health, he said."}]}