{"article": [{"url": "https://www.marketwatch.com/story/minneapolis-police-chief-calls-george-floyds-death-a-murder-2020-06-23", "published": 1592937500.0, "headline": "Minneapolis police chief calls George Floydâ\u0080\u0099s death a murder", "body": "MINNEAPOLIS (AP) â\u0080\u0094 The Minneapolis police chief says the death of George Floyd was â\u0080\u009cmurderâ\u0080\u009d and that the officer who pressed his knee into Floydâ\u0080\u0099s neck knew what he was doing because he had taken specific training on the dangers of positional asphyxiation. It appears to be the first time chief Medaria Arradondo has used the word â\u0080\u009cmurderâ\u0080\u009d to describe the death. Floyd, a Black handcuffed man, died May 25 after Derek Chauvin, a white officer, pressed his knee into his neck for nearly 8 minutes and held it there even after Floyd said he couldnâ\u0080\u0099t breathe and stopped moving. Chauvin is charged with second-degree murder, third-degree murder and manslaughter. Three other officers â\u0080\u0094 J. Kueng, Tou Thao and Thomas Lane â\u0080\u0094 are charged with aiding and abetting both second-degree murder and manslaughter. All four officers were fired. In response to questions and a data request from the Star Tribune, Arradondo issued a statement Monday night saying: â\u0080\u009cMr. George Floydâ\u0080\u0099s tragic death was not due to a lack of training â\u0080\u0094 the training was there. Chauvin knew what he was doing.â\u0080\u009d Arradondo went on to say: â\u0080\u009cThe officers knew what was happening â\u0080\u0094 one intentionally caused it and the others failed to prevent it. This was murder â\u0080\u0094 it wasnâ\u0080\u0099t a lack of training.â\u0080\u009d Attorneys for Chauvin, Thao and Kueng had no comment. A message left for Laneâ\u0080\u0099s attorney wasnâ\u0080\u0099t immediately returned to The Associated Press. Arradondo said in his statement, first reported by the Star Tribune and also provided to the AP, that both Chauvin and Thao took training on the dangers of positional asphyxiation in 2014. The training, which covered how to get an arrestee from a prone position into a recovery or seated position, was required after a 2013 settlement with the family of David Cornelius Smith, a handcuffed Black man who died in 2010 after police pinned him face down. Arradondo said the department also changed its policy in June 2014 to explicitly require moving an arrestee from a prone position to a recovery position when the highest degree of restraint is used, and to require continuous monitoring of the personâ\u0080\u0099s condition. He also said trainees continue to discuss the risks of in-custody deaths, and thereâ\u0080\u0099s â\u0080\u009csimply no way that any competent officerâ\u0080\u009d would be unaware of the need to move an arrestee so he or she can breathe freely. Separately, leaders of the Minneapolis police union acknowledged Tuesday that bystander video of the police encounter with Floyd was â\u0080\u009chorrificâ\u0080\u009d but said theyâ\u0080\u0099ve been denied the chance to look at body camera video that could shed more light on what happened. The unionâ\u0080\u0099s president, Lt. Bob Kroll, issued a statement soon after Floyd died cautioning the public not to rush to judgment and saying the union would provide its â\u0080\u009cfull supportâ\u0080\u009d to the officers. On Tuesday, he told â\u0080\u009cCBS This Morningâ\u0080\u009d that he thinks union members are being scapegoated for incompetent department leadership. Kroll acknowledged that widely seen cellphone video of Floydâ\u0080\u0099s death is â\u0080\u009chorrific,â\u0080\u009d but that the union was left â\u0080\u009cblindsidedâ\u0080\u009d by being denied the right to review officer body camera video. â\u0080\u009cRight now we cannot make an informed decision regarding the other officers that do not appear on camera,â\u0080\u009d he said. Union director Rich Walker said â\u0080\u009cany human beingâ\u0080\u009d that watches the bystander video knows that Floydâ\u0080\u0099s arrest â\u0080\u009cshould not have ended the way it did.â\u0080\u009d But Walker questioned statements that Floyd didnâ\u0080\u0099t resist officers because the union hasnâ\u0080\u0099t seen footage of the minutes leading up to what the bystander video showed."}]}