{"article": [{"url": "https://www.marketwatch.com/story/dow-futures-see-subdued-action-but-tech-stocks-look-ready-to-extend-run-up-to-start-september-trade-2020-09-01", "published": 1598978480.0, "headline": "Nasdaq, S&P 500 close at record highs as big tech and working-from-home shares drive gains", "body": "Major U.S. stock indexes closed higher Tuesday, ending near or above prior all-time records, as upbeat economic reports and dovish tones from the Fed helped feed the buying momentum on Wall Street. The ascent for stocks comes despite expectations for a seasonally challenging month for equities, following the best August returns in more than 30 years. How did stock benchmarks perform? The Dow Jones Industrial Average DJIA, +0.56% rose 215.61 points to end at 28,645.66, or 0.8% higher, the S&P 500 index SPX, +0.87% added 26.34 points to close at a record 3,526.65, a gain of 0.8%, after setting an intraday record of 3,528.03; while the Nasdaq Composite Index COMP, +1.39% advanced 165.21 points to a record 11,939.67 finish, a rise of 1.1%, after touching a new intraday all-time high of 11,945.72. On Monday, the Dow shed 223.82 points, or 0.8%, to end at 28,430.05. The S&P 500 fell 7.70 points, or 0.2%, ending at 3,500.31. The Nasdaq rose 79.82 points, 0.7%, to end at a record 11,775.46, its 41st record close of 2020. The S&P 500 clinched its best August return since 1986 and the Dow its best return for that month since 1984, while the Nasdaq recorded its strongest August since 2000.What drove the market? The winners of the past few months are looking to lead the next one, as September kicks off with further buying of large-capitalization growth and technology stocks, a major trading theme since March when the coronavirus pandemic took hold. Gains in Apple AAPL, +1.74% , Walmart WMT, +1.00% , Zoom Video ZM, +2.89% , Amazon.com AMZN, +3.01% and Facebook Inc. FB, +0.26% underscored that theme Tuesday, with shares in those popular plays carving out fresh gains in the new month. “I prefer to call them stay-at-home stocks, because really they are the COVID winners,” said Stephen Dover, head of equities at Franklin Templeton, in an interview with MarketWatch. “Those are all beating the reopening stocks, including the airlines,” he said, pointing to the recent decision by major carriers to drop their fees on most tickets changes for domestic flights. “In essence, they can take that straight off their bottom line,” Dover said. U.S. stocks initially got off to a choppy start Tuesday, but gained steam throughout the session, including after Federal Reserve Governor Lael Brainard said the central bank should “pivot” to provide more support for U.S. economic growth, presumably meaning the Fed could purchase more assets, such as U.S. Treasurys or privately issued debt. RelatedU.S. corporate debt soars to record $10.5 trillion The jolt higher comes against a backdrop of elevated stock valuations, worries about a potential pullback in risk asset prices, but also with the Fed implying it will keep interest rates ultra-low, even if inflation pressures begin to percolate. Read: The stock market is on a tear, but now comes September, the worst month of the year Lindsey Bell, chief investment strategist at Ally Invest, called the Fed’s ongoing stimulus “a key backstop going forward,” particularly as communities and local governments work to gain more confidence around how to operate safely “in this new normal.” “I think the stay-at-home trade is still intact,” Bell told MarketWatch. But she also views plans by schools to at least partially reopen for in-person lessons, as well as areas of the economy hard-hit by the pandemic coming back to life, as positive signs for reopening stocks. In a last-minute decision on Tuesday, New York City opted to delay in-person classes at public schools until September 21, with remote learning also delayed until mid-month, amid a threat of a teacher strike. Mark Meadows, the White House chief of staff, said Tuesday that Senate Republicans are aiming to unveil a new, targeted coronavirus aid bill next week once lawmakers return from a break, echoing comments from Sen. John Barrasso, a Wyoming Republican who also said the focus is on “getting people back to work, getting kids back to school.” In economic data, American manufacturers for August showed a fourth straight monthly rise. The Institute for Supply Management said its manufacturing index rose to 56% in August from 54.2% in July. Readings over 50% indicate growth. Economists surveyed by MarketWatch had forecast the index to total 54.9%. The report followed a comparable reading from IHS Markit, which showed that manufacturing purchasing managers’ index rose to 53.1 in a final reading for August, down slightly from the previously released ‘flash’ estimate of 53.6, but up from 50.9 at the start of the third quarter to post the fastest expansion since January 2019.” Internationally, the overnight eurozone IHS manufacturing purchasing managers index pointed to improving conditions in August, as the region’s recovery from the coronavirus pandemic continued, while in China the Caixin purchasing managers index, which is weighted toward small, private manufacturers, rose to 53.1 in August from 52.8 in July. Which stocks were in focus? Shares of Tesla Inc. TSLA, +1.89% fell 4.7% after it announced a $5 billion offering, which deflated its momentum after its stock split on Monday. Zoom Video Communications Inc. ZM, +2.89% shares rocketed 40.8% Tuesday, after the company made as much money in May, June and July as it did in all of 2019, beating even the outsize expectations of Wall Street, based on quarterly results reported on Monday. DocuSign DOCU, +2.36%, which enables electronic signatures on legal documents and is due to report its own results after Thursday’s closing bell, saw shares gain 20.5% as the category of software-as-a service companies benefit from Zoom’s powerful quarterly results. Shares of Eastman Kodak Co. KODK, +12.98% rose 22.1% Tuesday after the company disclosed that D.E. Shaw & Co. has taken a 5.2% stake in the company. Airline shares closed mixed Tuesday, a day after Delta Air Lines DAL, +0.39% and American Airlines Group AAL, +0.34% said they are dropping the fee on most tickets changes for domestic flights, copying an earlier move by United Airlines UAL, +0.32%. Chipotle Mexican Grill Inc CMG, +0.01% shares shot up 4.7% to a sixth-straight record close Tuesday, after Wedbush analyst Nick Setyan boosted his price target to $1,600 from $1,320, or enough to make him Wall Street’s most bullish analyst. J.C. Penney Company Inc. JCP, -2.53% shares fell 9.7%, as the embattled retailer said negotiations with its would-be buyers have hit a standstill, and that the retailer’s creditors are now preparing an independent bid. How did other assets trade? In Asia, China’s CSI 300 000300, +2.04% rose 0.5% and Hong Kong’s Hang Seng HSI, -0.30% finished virtually unchanged but in positive territory on the session. The Stoxx Europe 600 SXXP, +0.55% closed 0.4% lower, while U.K.’s FTSE 100 benchmark UKX, +0.64% tumbled 1.7% Tuesday. The yield on the 10-year Treasury note TMUBMUSD10Y, 0.777% shed 2.3 basis points at 0.672%, after adding 15.9 basis points during August. Bond prices move inversely to yields. Gold GCZ20, +2.17% closed 30 cents higher, or 0.02%, at $1,978.90 an ounce, its highest settlement in about two weeks. West Texas Intermediate crude for October delivery CL.1, -1.62% closed 15 cents higher, or 0.4%, at $45.58 a barrel on the New York Mercantile Exchange. The ICE U.S. Dollar Index DXY, -0.58%, which tracks the currency versus a basket of six major rivals, rose 0.2% after trading down earlier in the session."}]}