{"article": [{"url": "https://www.marketwatch.com/story/pence-says-democrats-went-negative-at-convention-previews-a-law-and-order-thrust-at-republican-gathering-2020-08-21", "published": 1598010440.0, "headline": "Pence says Democrats went â\u0080\u0098negativeâ\u0080\u0099 at convention, previews a law-and-order thrust at Republican gathering", "body": "WASHINGTON (AP) â\u0080\u0094 Previewing themes for next weekâ\u0080\u0099s Republican Party convention, Vice President Mike Pence promised a heavy focus on GOP support for law and order as he drew a contrast with Democrats for a â\u0080\u009cnegativeâ\u0080\u009d tone at their gathering and failure to acknowledge violence plaguing some U.S. cities. â\u0080\u009cWeâ\u0080\u0099re going to make sure that the American people see the choice here,â\u0080\u009d Pence said. President Donald Trump and Pence have blamed outbreaks of violence on a radical left, which they have sought to associate with Democratic presidential nominee Joe Biden and his running mate, California Sen. Kamala Harris, as emblematic of the type of agenda they would pursue if elected. Trump made clear after the death of George Floyd, a Black man in Minneapolis, and the protests that sprang up around the country calling for changes to policing that he sides with law enforcement. Trump also has called himself a â\u0080\u009claw and order president.â\u0080\u009d â\u0080\u009cWe donâ\u0080\u0099t have to make a choice between supporting law enforcement and supporting our African American families,â\u0080\u009d Pence argued Friday. â\u0080\u009cWe have done both from the beginning of this administration. Weâ\u0080\u0099re going to continue to do both.â\u0080\u009d He said that support would be prominently featured next week. â\u0080\u009cWeâ\u0080\u0099re going to talk about how weâ\u0080\u0099re going to support law and order, support the men and women of law enforcement, and get ready to hear a lot about that next week,â\u0080\u009d Pence said. Pence appeared on morning TV talk shows to counter Democrats and promote the Republican viewpoint hours after Democrats wrapped their four-day convention. He fielded a number of questions about the Trump administrationâ\u0080\u0099s handling of the coronavirus pandemic, including efforts to play down its potential severity: iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } iframe.twitter-tweet { width: 100% !important; } Pence also appeared to attempt to contain damage of Trumpâ\u0080\u0099s seeming embrace of support from adherents of the QAnon conspiracy theory, which the FBI has characterized as a domestic terrorism threat: iframe.twitter-tweet { width: 100% !important; } Biden and Harris accepted the Democratic Party nominations for president and vice president, respectively, on successive nights, culminating in Bidenâ\u0080\u0099s acceptance speech late Thursday, in which he pledged that, if elected on Nov. 3, he would serve as president of all Americans, including those who have voted against him. Republicans plan to nominate Trump and Pence at their four-day celebration. Pence promised a â\u0080\u009cgreat lineup of leadersâ\u0080\u009d next week along with a â\u0080\u009cgreat number of voices from all across the country to talk about what this president has done.â\u0080\u009d Among known speakers are Trump, Pence and first lady Melania Trump. The vice president said he was turned off by the negativity shown by Democrats, who argued Trump is unfit to lead the country for another four years. Former President Barack Obama, a frequent target of Trumpâ\u0080\u0099s broadsides, warned that democracy itself is at risk under Trump. â\u0080\u009cI didnâ\u0080\u0099t watch much of it and, frankly, I couldnâ\u0080\u0099t watch much of it,â\u0080\u009d Pence said. â\u0080\u009cThere was so much negativity, nothing but ad hominem attacks.â\u0080\u009d Pence appeared Friday on Fox News Channel, Fox Business Network, ABC, CBS and CNN. iframe.twitter-tweet { width: 100% !important; } MarketWatch contributed."}]}