{"article": [{"url": "https://www.marketwatch.com/story/chris-wallace-on-whether-candidates-should-have-mute-buttons-during-debates-and-his-advice-for-the-next-moderator-2020-10-01", "published": 1601575520.0, "headline": "Chris Wallace on whether candidates should have mute buttons during debates â\u0080\u0094 and his advice for the next moderator", "body": "As the first presidential debate between Donald Trump and Joe Biden devolved into an interruption-ridden debacle, many viewers mused on social media that moderator Chris Wallace needed a mute button. But Wallace himself disagrees. In a pair of interviews with the New York Times and the Los Angeles Times following Tuesday nightâ\u0080\u0099s debate, the embattled moderator and Fox News anchor reveals that muting the candidates still doesnâ\u0080\u0099t sit well with him at all, even as he agrees that the debate was â\u0080\u009ca terrible missed opportunityâ\u0080\u009d and â\u0080\u009cIâ\u0080\u0099m just sad with the way [it] turned out.â\u0080\u009d â\u0080\u009cAs a practical matter, even if the presidentâ\u0080\u0099s microphone had been shut, he still could have continued to interrupt, and it might well have been picked up on Bidenâ\u0080\u0099s microphone, and it still would have disrupted the proceedings in the hall,â\u0080\u009d Wallace, 72, told the New York Times. Read more:Next debates will have â\u0080\u0098additional structure,â\u0080\u0099 commission says after first Trump-Biden face-off And he told the Los Angeles Times that cutting the microphones, which the Commission on Presidential Debates has suggested as part of its plan to introduce additional structure to future debates, â\u0080\u009cjust strikes me as a bridge too far.â\u0080\u009d “ â\u0080\u0098The idea that youâ\u0080\u0099re going to cut off their microphone â\u0080\u0094 thatâ\u0080\u0099s a pretty tough call. I certainly wouldnâ\u0080\u0099t have wanted to make it.â\u0080\u0099 ” â\u0080\u0094 Chris Wallace Fox News Media congratulated Wallace and the debate team on how theyâ\u0080\u0099d handled the â\u0080\u009cextraordinaryâ\u0080\u009d face-off between President Trump and former Vice President Biden. â\u0080\u009cWe are extremely proud of his professionalism, skill and fortitude in a unique situation while doing everything possible to hold both candidates accountable,â\u0080\u009d it said in a statement. â\u0080\u009cNo moderator could have managed a debate of that magnitude better than Chris.â\u0080\u009d Related:First Trump-Biden debate: Fox Newsâ\u0080\u0099 Chris Wallace, the moderator, criticized after chaotic clash in Cleveland The Commission on Presidential Debates also praised Wallace for the â\u0080\u009cprofessionalism and skill he brought to last nightâ\u0080\u0099s debate.â\u0080\u009d And Wallace revealed to the Los Angeles Times that Biden came up to him after the debate and whispered, â\u0080\u009cI bet you didnâ\u0080\u0099t think you were signing up for a boxing match.â\u0080\u009d Trump nodded at Wallace, but saved his own feelings about the moderator for Twitter TWTR, -0.23%, sharing an image suggesting that Wallace had sided with Biden against him: iframe.twitter-tweet { width: 100% !important; } But even Wallace is disappointed with the way things turned out, and took some responsibility for it. He explained that he let the interjections go, at first, because he wanted to be as invisible as possible, and let the candidates talk. â\u0080\u009cI never dreamt that it would go off the tracks the way it did,â\u0080\u009d he told the New York Times. â\u0080\u009cIâ\u0080\u0099m a pro. Iâ\u0080\u0099ve never been through anything like this.â\u0080\u009d And he struggled with when and how to step in. â\u0080\u009cIâ\u0080\u0099ve read some of the reviews. I know people think, Well, gee, I didnâ\u0080\u0099t jump in soon enough,â\u0080\u009d Wallace said. â\u0080\u009cI guess I didnâ\u0080\u0099t realize ... that this was going to be the presidentâ\u0080\u0099s strategy, not just for the beginning of the debate but the entire debate.â\u0080\u009d Related:Hillary Clinton admits she wanted to tell Donald Trump to â\u0080\u0098shut upâ\u0080\u0099 during presidential debate C-SPANâ\u0080\u0099s Steve Scully and NBC Newsâ\u0080\u0099 Kristen Walker are set to moderate the next two debates. And Wallace has some advice for them: â\u0080\u009cIf either man goes down this road, I hope youâ\u0080\u0099ll be quicker to realize whatâ\u0080\u0099s going on than I was,â\u0080\u009d he told the New York Times. â\u0080\u009cI didnâ\u0080\u0099t have that advance warning.â\u0080\u009d But Wallace said the biggest losers of the night were the American voters. â\u0080\u009cIâ\u0080\u0099m just disappointed with the results. For me, but much more importantly, Iâ\u0080\u0099m disappointed for the country, because it could have been a much more useful evening than it turned out to be.â\u0080\u009d"}]}