{"article": [{"url": "https://www.marketwatch.com/story/3-things-to-know-about-teslas-battery-day-2020-09-17", "published": 1600710740.0, "headline": "3 things to know about Tesla's 'battery day'", "body": "Tesla Inc. is set to showcase its battery capabilities on Tuesday, at an event the company has dubbed Battery Day. The event will follow Tesla's annual shareholder meeting, at which shareholders are expected to re-elect the Tesla TSLA, +1.89%  board's chairwoman despite some opposition, including a \"no\" recommendation from the two leading independent proxy advisers. Both events are to be webcast starting at 4:30 p.m. Eastern. Chief Executive Elon Musk late Monday sought to tone down expectations somewhat. He tweeted that the product or products set to be revealed Tuesday \"will not reach serious high-volume production until 2022.\" iframe.twitter-tweet { width: 100% !important; } Wall Street seems to expect nothing less than the unveiling of technological advances that would cement Tesla's position as the leading electric vehicle-battery maker, showing strides toward lower prices and higher volumes of the costly and fundamental EV vehicle component. Here are three things to know about Battery Day:Another boost for the stock? Battery Day is frequently cited as the \"next catalyst\" for Tesla's skyrocketing stock. The stock was one of a few ending Monday in the black, although it turned lower in the extended session with losses accelerating after Musk's tweet. At last check, the shares fell nearly 4% in the after hours. Earlier this week, Deutsche Bank analyst Emmanuel Rosner boosted his price target on the stock by 33% to $400, citing the event. Rosner, who kept his rating on the shares at hold, said Tesla could unveil \"a new insourced manufacturing system\" to ramp up its battery capacity, improved cell chemistry, and \"fast-declining\" battery costs at the much-anticipated day. On Friday, Piper Sandler analyst Alex Potter became the second-most bullish on the Street on Tesla, raising his price target to $515 from $480 and reiterating his overweight rating he's had on the stock for at least the past three years. Potter said he now expects Tesla's energy business to eventually exceed $200 billion a year in revenue. Tesla shares have gained more than 400% this year, compared with gains of around 3% for the S&P 500 index. SPX, +0.87%  The company conducted a 5-for-1 stock split on Aug. 31. Battery Day is taking a page from a 2019 self-driving event In April 2019, Tesla held an event dedicated to its in-house driverless-car hardware and highlight the path toward fully autonomous vehicles that it promised to morph into a fleet of \"robotaxis.\" At the event, Tesla forecast that the robotaxis could be on the road in some locations as early as this year, one of many bold promises made that day by Musk. Owners of Tesla vehicles could choose to add their vehicles to the future, app-managed fleet to defray car-ownership expenses, with Tesla taking a cut. So far, that has not materialized. Musk may promise things that are far away Tesla is no stranger to lofty goals that are not always realized. \"We caution investors against diving head-first into any claims that are 'years' away,\" Chris McNally at Evercore ISI said in a note this week, noting that it has been about four years since Musk made the first full self-driving claims, including a yet-to-be-started cross-country trip. Instead, the focus should be on near-term performance metrics such as battery density, efficiency, and cost, which could impress Wall Street and keep Tesla at the forefront of EV battery technology, McNally said. Tesla could also reveal more about its plans for mining the metals needed for EV batteries. At a call with analysts following Tesla's second-quarter earnings in July, Musk urged more mining companies to mine for nickel, one of the metals used in batteries. Tesla could also lift the veil on one of its most recent acquisitions, which it has said little about. The company bought Maxwell Technologies Inc. in February 2019. The all-stock deal valued Maxwell at $218 million, and it was a first for Tesla after a long hiatus: the company had previously completed an acquisition in November 2017, when it bought privately held Perbix Machine Co., a Minnesota-based maker of factory automation equipment, for an undisclosed amount. The company said at the time it wanted to \"build the machine that makes the machine.\""}]}