{"article": [{"url": "https://www.marketwatch.com/story/heres-the-stock-sector-you-want-to-be-in-if-the-democrats-sweep-the-november-elections-2020-07-27", "published": 1596286640.0, "headline": "Hereâ\u0080\u0099s the stock sector you want to be in if the Democrats sweep the November elections", "body": "People â\u0080\u0094 and investors â\u0080\u0094 can become very emotional as a presidential election heats up, and this time around, feelings are obviously running high. According to the polls, President Trump is likely to be shown the door and Joe Biden will have his party control both houses of Congress. Does this excite you? Does it fill you with dismay? Maybe the best thing for you to do as an investor is put your emotions aside and think rationally about which companies are likely to benefit from a Democratic sweep. Ed Clissold, chief U.S. strategist at Ned Davis Research, a company that provides research to institutional investors, believes the managed health-care industry is ripe for strong performance in the event of a â\u0080\u009cclean sweepâ\u0080\u009d by the Democrats. He said the health-care sector tends to come under pressure heading into an election because â\u0080\u009cboth parties, but especially the Democrats, have talked about more regulation.â\u0080\u009d But in an interview, he went on to say that following an election, health care tends to outperform the broad market â\u0080\u009cbecause the regulation isnâ\u0080\u0099t as bad as expected.â\u0080\u009d Clissold believes â\u0080\u009cMedicare for All,â\u0080\u009d supported by many Democratic presidential candidates during the primaries, â\u0080\u009cwill never be the case.â\u0080\u009d And even if Biden saying is able to add a â\u0080\u009cpublic optionâ\u0080\u009d to the insurance exchanges that use managed-care companies under the Affordable Care Act, he would expect the new program â\u0080\u009cwould still be run through the big managed-care companies, just like the Medicare Advantage programs.â\u0080\u009d In other words, more revenue for the managed-care companies.Managed care has outperformed under Trump Here are two charts showing how the S&P 500 managed health-care industry group has performed against the entire S&P 500 index SPX, +0.87%, with dividends reinvested. First, total returns since Trumpâ\u0080\u0099s election on November 8, 2016: FactSet Here are total returns since Trump took office on Jan. 20 2017: FactSet Under Trump, with the Republicans controlling both houses of Congress for the first two years of his term, the S&P 500 managed-care industry group greatly outperformed the broad U.S. stock market.Wall Street agrees Clissold declined to name specific managed health-care companies for investment. However, there are only five industry players included in the S&P 500. This table, sorted by market capitalization, includes them plus CVS Health Corp. CVS, -1.76%, which acquired Aetna in November 2018: Company Ticker Market cap. ($bil) Revenue - 2019 ($bil) Total return - 2020 UnitedHealth Group Inc. UNH, +1.68% $285 $110.6 3.2% CVS Health Corp. CVS, -1.76% $83 $123.1 -12.8% Anthem, Inc. ANTM, +0.38% $68 $104.3 -9.8% Cigna Corp. CI, -0.82% $67 $29.1 -11.5% Humana Inc. HUM, +1.43% $52 $39.1 7.4% Centene Corp. CNC, -0.74% $39 $8.7 7.4% Â You can click the tickers for more about each company. More on CVS: The company reported $63.1 billion in premium revenue during 2019. That exceeds total revenue for Cigna Corp. CI, -0.82%, Humana Inc. HUM, +1.43% Â Centine Corp. CNC, -0.74%. Sell-side analysts have mostly positive opinions about the group: Company Ticker Share 'buy' ratings Closing price - July 24 Consensus price target Implied 12-month upside potential UnitedHealth Group Inc. UNH, +1.68% 81% $300.79 $343.00 14% CVS Health Corp. CVS, -1.76% 73% $63.34 $79.42 25% Anthem, Inc. ANTM, +0.38% 76% $270.49 $332.00 23% Cigna Corp. CI, -0.82% 88% $181.02 $246.32 36% Humana Inc. HUM, +1.43% 75% $392.14 $433.04 10% Centene Corp. CNC, -0.74% 95% $67.51 $84.78 26% Source: FactSet There are no â\u0080\u009csellâ\u0080\u009d or equivalent ratings among any of the analysts polled by FactSet.Yes, itâ\u0080\u0099s still early and polls can get it wrong There are 99 days to go before Election Day on Nov. 3. At RealClear Politics, the national polls all show Biden ahead of Trump in the popular vote, with an average lead of 9.1%. Biden also leads most polls for battleground states, including Michigan, Pennsylvania, Wisconsin, Ohio and Florida, all of which were critically important for Trumpâ\u0080\u0099s Electoral-College win in 2016. Then again, most polls were also running against Trump before his surprise win in 2016. The Electoral College map at RealClear Politics shows Biden in the lead, but also has 201 â\u0080\u009ctoss upsâ\u0080\u009d out of 538 electoral votes. Read:Trump is losing big to Biden in voter polls. Hereâ\u0080\u0099s how this will likely play out on Election Day â\u0080\u009cThe question is whether or not voters blame Trumpâ\u0080\u009d for the economic severe recession and the scope of the COVID-19 pandemic, Clissold said. â\u0080\u009cPre-pandemic, one of the areas he received the highest marks on was the economy,â\u0080\u009d he added. â\u0080\u009cIf Trump is going to get re-elected, it will be because he can convince the electorate that he is the better candidate for the economy going forward. History is not on the incumbentâ\u0080\u0099s side in this situation,â\u0080\u009d Clissold said. The Democrats are expected to maintain control over the House of Representatives. In the Senate, the Republicans have a 53-47 majority. The Republicans are defending 23 seats on Election Day, while the Democrats will be defending only 12 seats. The RealClear Politics Senate Map shows 47 Senate seats solidly Republican, with 46 Democratic and seven toss ups. But the â\u0080\u009cSenate No Toss Upsâ\u0080\u009d map shows the Senate switching to a 52-48 Democrat majority. Regardless of your emotional or financial investment in the outcome of the election, the overwhelming trend has been for the stock market to rally following a presidential election, no matter who wins. Related:These 6 health-care stocks are â\u0080\u0098buysâ\u0080\u0099 because they can thrive under either Trump or Biden"}]}