{"article": [{"url": "https://www.marketwatch.com/story/trumps-call-for-higher-numbers-for-fiscal-stimulus-meets-mixed-reactions-from-senate-gop-11600280704", "published": 1600278020.0, "headline": "Trumpâ\u0080\u0099s call for â\u0080\u0098higher numbersâ\u0080\u0099 for fiscal stimulus meets with mixed reactions from Senate GOP", "body": "President Donald Trump speaks in Londonderry, New Hampshire, on Aug. 28. (Getty Images) Senate Republicans, in a show of unity, voted last week for another coronavirus financial-aid bill almost half as expensive as the White House had been proposing and about one-fourth the cost of what House Democrats want. On Wednesday, President Donald Trump said Republicans needed to go higher. In a mid-morning tweet, Trump said Democrats were heartless and didnâ\u0080\u0099t want to see Americans get another round of fiscal stimulus payments by demanding too much in COVID-19 aid talks. â\u0080\u009cGo for the much higher numbers, Republicans, it all comes back to the USA anyway (one way or another!).â\u0080\u009d Trump tweeted. iframe.twitter-tweet { width: 100% !important; } But after weeks of saying Democrats were wanting too much with their $2.2 trillion offer, and being unable to coalesce around the administrationâ\u0080\u0099s $1.3 trillion counteroffer, as well as voting for a reportedly $650 billion bill last week, some Senate Republicans were not inclined to take Trumpâ\u0080\u0099s advice on Wednesday. â\u0080\u009cSo the president has his opinion, we have ours,â\u0080\u009d said Sen. Ron Johnson, a Wisconsin Republican who has been among the most adamant in his party about not spending much more money on relief. He said Republicans had done the right thing in voting for the narrower bill last week, which was blocked from advancing by Senate Democrats, and claimed House Speaker Nancy Pelosi was not serious about negotiating. â\u0080\u009cWe offered them a half-trillion dollars package â\u0080\u0094 real targeted relief for people that really needed it, the unemployed, small-business education, vaccines, testing, all these things, and she wonâ\u0080\u0099t take â\u0080\u0098yesâ\u0080\u0099 for an answer. That tells you sheâ\u0080\u0099s not serious about really doing a deal,â\u0080\u009d he said. Read more: Fiscal stimulus prospects at dead end after Senate vote, a top Republican says â\u0080\u009cWhy didnâ\u0080\u0099t he just endorse the Problem Solvers bill?â\u0080\u009d asked Sen. John Cornyn, a Texas Republican, when asked about Trumpâ\u0080\u0099s tweet. A bipartisan group of 50 House lawmakers â\u0080\u0094 25 from each party â\u0080\u0094 unveiled a $1.5 trillion plan on Tuesday that Pelosi dismissed as inadequately funded. Sen. Mike Braun, a Republican from Indiana, said Trump would need to convince his fellow Republicans, all but one of whom voted for the smaller package last week. And if the bigger number ended up close to $1 trillion, it would be a difficult sale, he said. â\u0080\u009cI donâ\u0080\u0099t think youâ\u0080\u0099d get hardly any Republicans. And youâ\u0080\u0099d lose a bunch of fiscal conservatives, if you did anything other than what we voted on for last week,â\u0080\u009d he said. Not all the reaction was negative. Sen. Lindsey Graham, a South Carolina Republican up for reelection this year, said he agreed with Trump on the need to go big and was in â\u0080\u009cthe camp of trying to get something done.â\u0080\u009d â\u0080\u009cSeems to me that we shouldnâ\u0080\u0099t leave this issue unattended, that we should all make this a national priority. People are going to start gettingÂ kicked out of their apartments and houses foreclosed on, because there are some people just canâ\u0080\u0099t get back to work, our economy is still shut down in certain areas,â\u0080\u009d he said. At a White House press briefing. spokeswoman Kayleigh McEnany said Trump meant Republicans should add a second round of direct payments to the bill Senate Republicans voted for last week. Across the party aisle, Pelosi and Senate Democratic leader Chuck Schumer pounced on the Trump tweet, issuing a joint statement saying they were â\u0080\u009cencouragedâ\u0080\u009d by it but refusing to cut the size of their offer. â\u0080\u009cWe look forward to hearing from the presidentâ\u0080\u0099s negotiators that they will finally meet us halfway with a bill that is equal to the massive health and economic crises gripping our nation,â\u0080\u009d the pair wrote. Late in the day, a spokesman for Pelosi said she and Treasury Secretary Steven Mnuchin spoke by phone about a stopgap spending bill, and she reiterated the points in the joint statement to him. Read more: Pelosi threatens to keep House in session until fiscal stimulus deal done House Republican leader Kevin McCarthy sounded skeptical that the tweet would change much for Republicans. Asked if Republicans could go as high as $1.5 trillion, McCarthy said, â\u0080\u009cWeâ\u0080\u0099d have to see whatâ\u0080\u0099s in it, but I think itâ\u0080\u0099s difficult,â\u0080\u009d he said. Steny Hoyer, the second-ranking House Democrat, said he was encouraged by Trumpâ\u0080\u0099s tweet. â\u0080\u009cHeâ\u0080\u0099s right on that. This is money for Americans who are struggling who need money. Itâ\u0080\u0099s not giving it away to somebody else,â\u0080\u009d he said. The tweet came as many Republicans felt Pelosi was under growing pressure from party moderates and members in tough races to reach a deal. Asked about that Wednesday morning in an interview in MSNBC, Pelosi said, â\u0080\u009cWelcome to my world.â\u0080\u009d"}]}