{"article": [{"url": "https://www.marketwatch.com/story/if-a-financial-adviser-cant-say-yes-to-these-2-revealing-questions-save-your-money-for-one-who-can-2020-06-29", "published": 1593855320.0, "headline": "If a financial adviser can't say 'yes' to these 2 revealing questions, save your money for one who can", "body": "“ Reg BI doesn't dramatically transform the way brokers do business. ” Maybe you've been watching the value of your investment accounts rise and fall like a yo-yo since the COVID-19 crisis began and can't stomach the gyrations anymore. But you don't have the knowledge or confidence to make critical investment decisions on your own. So you decide to look to a financial professional for help. Until recently, it was relatively easy to distinguish between the two main categories of financial advisers. Fee-only investment advisers and financial planners are paid directly by you and work only for you. They're legally required to always act in your best interests - known as the fiduciary standard. The second category are registered representatives, or brokers, who make their living earning commissions on stock trades and for selling you mutual funds and insurance. In the past, brokers have not been required to act as fiduciaries. Why not? Because their investment-sales model makes it impossible for them to act with undivided loyalty to their clients. In June 2019, the SEC enacted Regulation Best Interest (Reg BI), which was supposed to require all financial advisers to act as fiduciaries when giving investment and financial advice. This new rule goes into effect on June 30. For fee-only advisers, this new best interest rule only affirms what they are doing already as fiduciaries. Unfortunately, Reg BI doesn't dramatically transform the way brokers do business. After a year's worth of resistance from the biggest broker-dealers, the real-world implementation of Reg BI has fallen far short of its lofty expectations. Much of it remains a work in progress. Why is Reg BI essentially toothless and unlikely to be upgraded? Let's start with its nebulous definition of fiduciary responsibility. Reg BI was never intended to turn brokers into full-time fiduciaries. It's only supposed to require brokers to act in their clients' best interests when they are making investment recommendations and managing their accounts. Yet this doesn't prevent them from making a boatload of commissions convincing a retiree to move their 401(k) plan assets into their firm's Rollover IRA or an annuity. But even this lukewarm level of fiduciary commitment has since been watered down. Instead of forcefully requiring brokers to act even as quasi-fiduciaries, Reg BI simply requires brokers to disclose any potential conflicts of interest that could keep them from acting with undivided loyalties to their clients. They can still earn big commissions as long as they tell people that they're receiving them, but it's unlikely you'll get details of what the commissions cost every year. Reg BI also requires all advisers to provide clients and prospects with a confusing document known as Form CRS. In addition to requiring advisers to describe their qualifications, industry licenses and disciplinary histories, Form CRS must also disclose, in user-friendly language, the adviser's services, fees and any conflicts of interests that prevent them from acting in their clients' best interests.  “ Conflicts of interest in retirement advice cost American families an estimated $17 billion a year. ” But here's the problem. Brokers won't have to tell clients how much they personally receive in commissions and bonuses since these payouts vary by product. And just because brokers disclose these conflicts doesn't mean that their clients will understand how they influence their recommendations. According to the Department of Labor, conflicts of interest in retirement advice cost American families an estimated $17 billion a year. To compound the problem, the SEC and FINRA, the regulatory body overseeing brokers, haven't created standardized templates that advisers can use to create their own Form CRS documents. Given the current environment, it's unlikely that regulators will review these documents unless an adviser or firm gets into legal hot water. Only if Reg BI is updated with language that closes these legal loopholes and explicitly requires that all financial advisers act solely in their clients' best interests all of the time - and require them to document this in writing - will it offer meaningful protections for consumers. Given the current political environment, this is unlikely to happen anytime soon. Read: A 'Hippocratic oath' for financial advisers? The SEC's new 'Regulation Best Interest' gets mixed reviews If you're thinking about working with a broker, the onus is on you to slog through all the fine print and ask all the right questions to help you decide if you can really trust this person to make your financial needs their highest priority. But why put yourself through this opaque process? There's a much easier way to make sure your adviser serves as a real fiduciary, all of the time: Hire an independent fee-only fiduciary investment adviser or financial planner who has been independently vetted. There are a handful of adviser associations and non-profit organizations, such as National Association of Fee Only Planners (NAPFA) and Alliance of Comprehensive Planners (ACP), that provide lists of fee-only advisers. These resources offer a good starting point, and then investors need to continue the vetting process. These advisers, too, are required to comply with all the requirements of Reg BI. But since they're already fiduciaries, you won't need to hunt for loopholes that excuse them from fully acting in your best interests. That's why, whether you're looking for a new adviser or already have one, it's important for you to understand where this professional legally and ethically stands on these critical issues. Rather than wading through reams of incomprehensible documents, ask any prospective adviser to honestly and comprehensively answer three simple questions: 1. Are you legally held to the fiduciary standard? 2. Will you always act only in my best interests all of the time when offering financial advice or managing my investments and put that in writing? 3. If your answer to question 1 or 2 is \"No,\" please explain why you're unable or unwilling to fully act in my best interests. Bonus question: Try to convince me why I should still trust you for reasons other than \"look at the returns I've generated for my clients.\" If you're not satisfied with their responses, don't settle. Keep looking until you find a fee-only fiduciary adviser you can fully trust to help you deal with life's ever-changing financial challenges. Pam Krueger is the creator and host of the award-winning MoneyTrack investor-education television series seen nationally on PBS. She is also the founder and CEO of Wealthramp.com, a free online service that matches consumers with qualified, fee-only financial advisers. More:Why your first five years of retirement are critical Also read: New Labor Department rule changes default retirement plan disclosure from paper to electronic"}]}