{"article": [{"url": "https://www.marketwatch.com/story/u-s-treasury-yields-inch-higher-with-fiscal-stimulus-talks-still-in-focus-11602247477", "published": 1602259460.0, "headline": "10-year Treasury yield logs biggest weekly jump since August with fiscal stimulus talks still in focus", "body": "Chip Somodevilla/Getty Images U.S. Treasury yields edged higher on Friday, extending a weeklong rise as investors held to hopes that a fiscal stimulus deal will be forthcoming this year after all from Congress. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 1.1 basis points to 0.775%, extending an 8.1 basis point weekly increase, its largest such jump in six weeks. Meanwhile, the 2-year note rate TMUBMUSD02Y, 0.156% edged 0.8 basis point higher to 0.153%, leaving it up 2.2 basis points higher this week. The 30-year bond yield TMUBMUSD30Y, 1.576% added 0.7 basis point to 1.573%, contributing to a 9.3 basis points weekly rise.What’s driving Treasurys? Washington politics continued to dominate the attention of traders who are still looking for Democratic and Republican lawmakers to strike an agreement on a new coronavirus aid relief package despite intermittent negotiations since August. The White House said it was open to a broader stimulus package only days after President Donald Trump said he was willing to do standalone fiscal measures only. House Speaker Nancy Pelosi, however, said any aid to airlines as requested by Trump would have to be embedded in a larger stimulus bill. Trump later said to talk show radio host Rush Limbaugh that he wanted an even bigger package than either Congressional Republicans and Democrats were proposing. Analysts have called for new fiscal stimulus without which the economic recovery could turn increasingly rocky towards the end of this year, as U.S. households can no longer depend on additional federal unemployment benefits. See: On again: Pelosi, Mnuchin talk again about big fiscal stimulus, but no deal What did market participants’ say? “Focus has been on further U.S. fiscal stimulus efforts, with a strong ebb and flow on whether negotiations are on and the scope of any package that may be agreed to,” said Simon Deeley, a rates strategist at RBC Capital Markets, in a note."}]}