{"article": [{"url": "https://www.marketwatch.com/story/whats-the-biggest-threat-that-retirees-face-2020-10-02", "published": 1601721440.0, "headline": "What's the biggest threat that retirees face?", "body": "Today's investment pop quiz focuses on stock market volatility: How much does the stock market in a typical year deviate from its long-term average? I'm willing to bet that your answer was way off, since virtually everyone gets it wrong. And that's disturbing, since the incorrect answer leads to major retirement portfolio mistakes. Underestimate stocks' volatility and you most likely will be led to make your retirement portfolio too risky. Overestimate it and you will be scared away from equities. Read: Half of Americans over 55 may retire poor To understand the answer to my quiz, consider that in the 123 calendar years since the Dow Jones Industrial Average DJIA, +0.56%  was created in the late 1800s, it has produced an average price-only gain of 7.7%. On average, each individual year's Dow return has been 16.3 percentage points above or below this 7.7%. Last year came close to this, for example. The Dow in 2019 gained 22.3%, which was 14.6 percentage points above the historical mean. Believe it or not, the typical investor believes stocks' annual volatility is more than twice as high, according to recent research from the Center for Retirement Research at Boston College. The author, Wenliang Hou, a research economist at the Center, discovered this after analyzing the data contained in the most recent Health and Retirement Study (HRS) from the University of Michigan. The HRS, which is conducted every two years, is perhaps the most comprehensive examination available of attitudes toward retirement; it is based on a survey of around 20,000 Americans over the age of 50. Read: What are Medicare Advantage plans, and are they worth the risk? To compare perception and reality when it comes to stock market volatility, Hou focused on a statistic known as the standard deviation. It uses a different formula than the one I used to come up with average annual deviation of 16.3 percentage points, but the two approaches are conceptually similar. The stock market's actual standard deviation that Hou reports is 15.7 percentage points; he says that the average investor believes it to be 37.2 percentage points. This difference is huge. As you may remember from Statistics 101, 95% of actual yearly returns should fall within a range that is two standard deviations above or below the average. A standard deviation of 37.2 percentage points therefore means that investors believe that 95% of the time the stock market's annual returns will fall in a range that is 74.4 percentage points above or below the average-a range of 148.8 percentage points. Read: Is it safe to retire to a college town in the pandemic? No wonder the typical retiree or soon-to-be retiree is so scared of the stock market. How much would you allocate to equities if you weren't exaggerating stock market volatility? One answer comes from the stock allocations of the various retirement target funds maintained by Vanguard; these funds follow an empirically-based guide path that reduces equity allocation as you get older. The table bellows shows the equity allocation of these funds based on your year of retirement: Year of retirement Equity allocation 2010 or before 30% 2015 35% 2020 50% 2025 60% 2030 67% 2035 75% If your equity allocation is markedly less than what's indicated in this table, you should take a careful look at whether you are acting out of an exaggerated sense of stocks' volatility. What should retirees worry most about? Given this new research, it won't come as a surprise that retirees consider stock market risk to be the biggest threat to meeting their retirement goals. But what, in fact, is their biggest threat? To answer this question, Hou calculated what our retirement portfolio would look like if our subjective assessments of risk were based on historical fact. In that event, according to his calculations, our biggest risk would be longevity risk-outlasting our money. The second biggest would be health risk-unexpectedly large health care costs. Stock market volatility would be in third place. Retirees make the mistake of downplaying longevity and health risks because they \"are pessimistic about their survival probabilities and often underestimate their health costs in late life,\" as Hou concludes. Among the investment implications he mentions is to give serious consideration to annuities, which address both the longevity and market risks that trip up so many retirees. In general, though, this new research emphasizes the importance of becoming better educated about stock market history and the other risks that you will face in retirement. Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com."}]}