{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-jump-to-start-week-amid-hopes-for-new-fiscal-package-11601900328", "published": 1601915420.0, "headline": "10-year, 30-year Treasury rates hit nearly 4-month high to start week amid fears of increased deficit spending", "body": "Long-dated U.S. Treasurys rose to their highest level since June on Monday, amid hope that lawmakers in Washington may reach a deal on a new fiscal stimulus bill to reinvigorate the U.S. economy, easing demand for safe-haven assets. Investors also pointed to the increase chance of the Democrats achieving an election clean-sweep that would put a more aggressive spending package on the agenda.What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% rose 6.6 basis points to a nearly four-month high of 0.760%, its biggest one-day jump in a month. The 30-year bond yield TMUBMUSD30Y, 1.576% climbed 8.5 basis points to a four-month high of 1.565%. Bond prices move inversely to yields. Both long-date bonds hit their highest yields since June 9, according to Dow Jones Market Data. Meanwhile, the 2-year note rate BX:TMUBMUSD02Y was up 1.4 basis points to a one-month high of 0.145%. What’s driving Treasurys? Investors cited hopes that President Donald Trump may leave the hospital soon and push for a fiscal stimulus package. Trump later issued a tweet saying he would return to the hospital on Monday, saying he felt “really good.” His physician Sean Conley said he had met the discharge criteria. Stocks traded sharply higher as appetite for assets perceived as safe waned, with longer-dated bonds taking the brunt of the hit. The spread between shorter-term and longer-term bond yields widened on Monday, a sign that investors may be anticipating a breakthrough on new government spending. Analysts worry that the U.S. recovery is at risk of stalling without additional stimulus. Analysts also cited betting odds and polling results showing that Democrat candidate Joe Biden was increasing his lead over Trump. A landslide victory could see Democrat lawmakers push and pass bigger government spending measures. Economic data showed the U.S. services sector was resilient, with the Institute for Supply Management’s index of nonmanufacturing companies rising to 57.8% last month from 56.9% in August. A number above 50 indicates growth in economic activity.What did market participants’ say? “As Biden’s election odds drift higher, so too do the prospects for a Democratic sweep of both chambers of Congress and the White House, opening the door to aggressive fiscal stimulus and deeper deficits. To see the back-end underperform follows intuitively,” said Jon Hill, a rates strategist at BMO Capital Markets."}]}