{"article": [{"url": "https://www.marketwatch.com/story/visa-tops-earnings-expectations-but-travel-category-remains-slow-to-snap-back-2020-07-28", "published": 1596003680.0, "headline": "Visa tops earnings expectations, but travel category remains slow to snap back", "body": "Visa Inc. topped fiscal third-quarter earnings and revenue expectations Tuesday, but the COVID-19 crisis continues to drive mixed spending trends, with strong growth in e-commerce but sustained weakness in travel-related transactions. Payment volume at Visa V, +1.80% dropped 10% in the latest period, though cross-border payment volume, or the value of transactions made between shoppers and merchants originating in different countries, dropped 37%. Visa said that cross-border volume fell 47% when excluding transactions between European countries, where international travel has snapped back more quickly. Shares were off 1.6% in after-hours trading. In the U.S., Visa saw “steady improvement” in in-person spending during the June quarter, but that recovery stalled moving into July amid a more cautious approach to reopening the economy due to a spike in COVID-19 cases. Chief Financial Officer Vasant Prabhu said that the recovery in in-person spending, known as card-present volume, has been fairly similar among different states. Wedbush analyst Moshe Katri told MarketWatch in an email that the July trends reflected “20+ states reversing business reopening plans and the benefits of stimulus checks winding down,” though in his view the company’s overall e-commerce strength helped outweigh weaknesses in other areas, like travel spending. The company has also seen U.S. card-not-present volume, or the value of online transactions, increase by more than 25% each week since the beginning of April, which is two times the rate of growth from before the COVID-19 outbreak began. Don’t miss: Visa sees ‘massive’ digital acceleration with millions trying e-commerce for the first time Some U.S. spending categories, including home improvement and food stores, have seen overall growth above their pre-pandemic levels during each week since mid-Aprill, Prabhu said, while others, including retail services and health care, saw volume declines of between 10% and 50% in April but are now showing positive growth relative to a year ago. Entertainment, fuel and restaurant spending are still down, with some improvements since their 50%-plus declines in April, but the travel category remains off more than 50% in the U.S. Executives sounded confident that while the pandemic was pressuring some spending categories in the near-term, it was also accelerating the adoption of payment habits that could benefit Visa in the long run. In the U.S., the number of Visa credentials involved in e-commerce purchases was up 12% in June relative to January, and trends were significantly more pronounced in countries like Argentina and Romania, where online shopping had been less prominent before the crisis. Read: Visa says COVID-19 crisis could help drive $100 billion annual shift to debit cards over time Visa also added more than 80 million new contactless cards in the U.S. in the first six months of 2020, with Chief Executive Al Kelly noting that a number of the company’s partner financial-institutions sped up their plans for contactless issuance. Visa expects tap payments to gain further momentum in the U.S. due to a heightened awareness of germ spread, and Kelly said that once people begin to return to their offices, they may increasingly use contactless payment methods for food and drink purchases as well as public-transit fares. The company had been pushing to grow contactless adoption in the U.S. even before the COVID-19 crisis struck, with the expectation that tap payments like contactless credit cards and mobile wallets on smartphones could help convince people to use their cards for smaller transactions that they might have ordinarily handled with cash. Visa posted net income for the quarter of $2.4 billion, or $1.07 a share, down from $3.1 billion, or $1.37 a share, in the year-prior quarter. Adjusted earnings came in at $1.06 a share, whereas analysts surveyed by FactSet were expecting $1.03 a share. The company’s revenue fell to $4.84 billion from $5.84 billion, while the FactSet consensus called for $4.82 billion. The company did not provide an outlook for the full fiscal year given the uncertainties around COVID-19. Barclays analyst Ramsey El-Assal wrote that Visa’s earnings beat was driven by greater cost savings as the company was able to reduce advertising, marketing and promotional spending by 39% from a year earlier, “likely helped by the Summer Olympics postponement.” Visa kicked off a busy week of payments earnings, with PayPal Holdings Inc. PYPL, +2.18% set to report after Wednesday’s closing bell and Mastercard Inc. MA, +2.09% following on Thursday morning. Shares of Visa have gained 15% over the past three months as the Dow Jones Industrial Average DJIA, +0.56% , of which Visa is a component, has risen about 9%."}]}