{"article": [{"url": "https://www.marketwatch.com/story/his-short-position-just-got-obliterated-but-this-tesla-bear-isnt-giving-up-11598976511", "published": 1598979980.0, "headline": "His short position just got 'obliterated,' but this Tesla bear isn't giving up", "body": "It's hard out there for a Tesla short. Getty Images Any investor in the painful position of being caught on the short side of the Tesla juggernaut would certainly be forgiven for keeping a low profile, considering the stock's incredible run. But Stanphyl Capital's Mark Spiegel, in a recent letter to investors highlighted on the ValueWalk blog, reiterated the anti-Tesla thesis that he's been spouting for years, while acknowledging the carnage that his short position has caused to his broader portfolio. \"Year-to-date, Tesla (the biggest bubble in modern stock market history) is up an astounding 495%â\u0080¦ and that hurt us significantly,\" he wrote. \"So our short positions have obliterated the profits from our long positions, and yet when this bubble pops we'll be glad we have them.\" From there, he touched on the bullet points as to why he believes he will ultimately profit from Tesla's demise, including the lack of a moat and a return to red ink once emission credit sales expire. He also tore into CEO Elon Musk, who he's been consistently been painting as a fraud. “ 'Need I say more about what an insane bubble  this stock is? Okay, I'll say moreâ\u0080¦' ” - Mark Spiegel \"Superior competition\" will also be a huge factor going forward, Spiegel explained, with growing electric lineups from Audi, BMW, Mercedes, Volvo and Volkswagen, to name just a few. \"For those who still think 'Tesla is years ahead of the competition,' the most competitive EV region in the world is Europe, and Tesla's EV market share there has now declined from over 30% to a year-end estimate of single digits,\" he wrote, pointing to this chart: iframe.twitter-tweet { width: 100% !important; } Meanwhile, Tesla shares TSLA, +1.89% took a hit on Tuesday, after the company took advantage of the stock's best monthly performance in seven years to raise more capital. Before the offering was disclosed, the stock was up as much as 7.9% premarket. The broader stock market, however, finished in the green, with the Dow Jones Industrial Average DJIA, +0.56%, S&P 500 SPX, +0.87% and tech-heavy Nasdaq Composite COMP, +1.39% all firmly in positive territory."}]}