{"article": [{"url": "https://www.marketwatch.com/story/the-official-return-of-mens-tennis-the-citi-open-has-been-canceled-2020-07-21", "published": 1595341400.0, "headline": "The official return of menâ\u0080\u0099s tennis â\u0080\u0094 the Citi Open â\u0080\u0094 has been canceled", "body": "WASHINGTON (AP) â\u0080\u0094 The hard-court tournament in the nationâ\u0080\u0099s capital that was supposed to mark the official return of menâ\u0080\u0099s professional tennis amid the pandemic was scrapped Tuesday â\u0080\u0094 but the group in charge of the U.S. Open immediately said the tuneupâ\u0080\u0099s cancellation â\u0080\u009cin no way impactsâ\u0080\u009d its Grand Slam event. The Citi Open, scheduled to start with Aug. 13 qualifying, was called off because of what tournament manager Mark Ein said are â\u0080\u009ctoo many unresolved external issues, including various international travel restrictions as well as troubling health and safety trends.â\u0080\u009d The number of coronavirus cases has been spiking in spots throughout the United States. Calling the cancellation of the Washington tournament â\u0080\u009cdisappointing,â\u0080\u009d ATP Chairman Andrea Gaudenzi said: â\u0080\u009cUnfortunately for the moment, there are still large factors at play, which are outside of our control.â\u0080\u009d The menâ\u0080\u0099s and womenâ\u0080\u0099s pro tours both have been suspended since March because of the COVID-19 outbreak and have been eyeing a return to action next month. The first event on the most recently announced version of the sportâ\u0080\u0099s 2020 slate is a womenâ\u0080\u0099s clay-court tournament in Palermo, Italy, starting Aug. 3, and WTA spokeswoman Amy Binder said Tuesday that tourâ\u0080\u0099s â\u0080\u009cprovisional calendar remains on course to proceed at this time.â\u0080\u009d â\u0080\u009cOur current approach to the season is to provide opportunities where possible irrespective of travel restrictions,â\u0080\u009d Binder wrote in an email, â\u0080\u009cso that as many players that do have the ability and desire to travel can compete during this unique and difficult time.â\u0080\u009d As of now, the week of Aug. 10 includes womenâ\u0080\u0099s tournaments in Lexington, Kentucky â\u0080\u0094 where 23-time Grand Slam singles champion Serena Williams is among the announced entrants â\u0080\u0094 and the Czech Republic. But no official menâ\u0080\u0099s competition. With Washingtonâ\u0080\u0099s ATP stop, where Nick Kyrgios was the champion last year, now gone, the first chance for men to play sanctioned matches will be the Masters-level event usually played in Cincinnati that was moved to the site of the U.S. Open in Flushing Meadows, starting Aug. 22. That is to be followed by the U.S. Open, where main-draw play is due to begin Aug. 31 without any spectators. The next Grand Slam tournament will be the clay-court French Open, which postponed its start from late May to late September because of the pandemic. After the ATP and Citi Open announced the decision to abandon plans to play this year, the U.S. Tennis Association put out a statement saying it â\u0080\u009cunderstands the rationaleâ\u0080\u009d behind that cancellation. The USTAâ\u0080\u0099s statement continued: â\u0080\u009cThis decision in no way impacts the U.S. Open or the Western & Southern Open. The USTA will create a safe and controlled environment for players and everyone else involved in both tournaments that mitigates health risks.â\u0080\u009d A cautionary note was sounded for the USTAâ\u0080\u0099s grand plans for a â\u0080\u009cbubbleâ\u0080\u009d to keep players and others safe during its two-week Grand Slam tournament: An American tennis player, Danielle Collins, was kicked out of World TeamTennis for breaking the leagueâ\u0080\u0099s COVID-19 protocols. WTT CEO Carlos Silva said Collins, a 26-year-old who was a semifinalist at the 2019 Australian Open, left the resort hosting all of the matches during the leagueâ\u0080\u0099s three-week season and exited the state of West Virginia. â\u0080\u009cThe protocols have been put in place and communicated numerous times to protect the health and safety of our players, coaches and staff,â\u0080\u009d Silva said. Collins was playing for the Orlando Storm in WTT, which took all nine of its teams and put them in one place for the season that began July 12 and ends Aug. 2. The WTT is not affiliated with the WTA or ATP professional tours, so it was able to hold its season while they were on hiatus. Thatâ\u0080\u0099s also why smaller, independent exhibition events have been able to be staged, including a series run by Williamsâ\u0080\u0099 coach, Patrick Mouratoglou, called the Ultimate Tennis Showdown and played at his academy in France. UTS announced plans Tuesday for matches over the next two weekends."}]}