{"article": [{"url": "https://www.marketwatch.com/story/dont-miss-out-on-this-generational-opportunity-in-the-stock-market-hedge-fund-manager-says-2020-10-08", "published": 1602176900.0, "headline": "Donâ\u0080\u0099t miss out on this â\u0080\u0098generational opportunityâ\u0080\u0099 in the stock market, hedge-fund manager says", "body": "MARKETWATCH FRONT PAGE Thomas Hayes of Great Hill Capital was asked this week whether he's been putting his clients' money to work even all the volatility and uncertainty that pandemic has created in the stock market. His answer: Yes. \"Aggressively.\" See full story.Trump raised 5 times as much money from Americaâ\u0080\u0099s top CEOs as Biden As the Nov. 3 election sparks record spending, hereâ\u0080\u0099s how the CEOs of S&P 500 companies are helping to fund the war chests of President Donald Trump and challenger Joe Biden, while also contributing to other Republican and Democratic politicians. See full story. Trumpâ\u0080\u0099s vaccine czar says the first vaccine should be submitted for emergency authorization around Thanksgiving Moncef Slaoui, an immunologist by training and a longtime pharmaceutical executive, is running the Trump administrationâ\u0080\u0099s Operation Warp Speed program to spur development of vaccines on the fastest ever timetable. See full story.Why Sen. Kamala Harrisâ\u0080\u0099s telling Vice President Mike Pence, â\u0080\u0098I am speaking,â\u0080\u0099 is resonating with so many women online Pence interrupted Harris twice as often during the VP debate. And research finds men interrupt women â\u0080\u0094 a lot. See full story.Pelosi rejects idea of a stand-alone fiscal stimulus measures Hopes for a restart of talks over a large scale economic stimulus package, or even more targeted aid for the troubled airline industry, took a big hit Thursday after House Speaker Nancy Pelosi said she still wanted a bigger bargain. See full story.MARKETWATCH PERSONAL FINANCE â\u0080\u009cSex and the Cityâ\u0080\u009d star Kim Cattrall is letting go of her serene retreat in East Hampton, NY. Sheâ\u0080\u0099s asking $3.25 million for the bayfront home. See full story."}]}