{"article": [{"url": "https://www.marketwatch.com/story/scientists-examine-speed-and-distance-of-coronavirus-transmission-when-people-cough-sneeze-speak-and-run-2020-06-23", "published": 1593874640.0, "headline": "Scientists estimate the speed and distance of coronavirus transmission when people cough, sneeze, speak - and run", "body": "There's a lot scientists know - and a lot they don't. In \"Coughs and Sneezes: Their Role in Transmission of Respiratory Viral Infections, Including SARS-CoV-2,\" released Tuesday, researchers describe the various types and sizes of virus-containing droplets present in sneezes and coughs, and how some medical procedures and devices may spread these droplets. \"Coughs and sneezes create respiratory droplets of variable size that spread respiratory viral infections,\" according to the article, which was published online in the American Thoracic Society's American Journal of Respiratory and Critical Care Medicine. “ 'While most respiratory droplets are filtered by the nose or deposit in the oropharynx, the smaller droplet nuclei become suspended in room air and individuals farther away from the patient may inhale them.' ” \"Because these droplets are forcefully expelled, they are dispersed in the environment and can be exhaled by a susceptible host. While most respiratory droplets are filtered by the nose or deposit in the oropharynx, the smaller droplet nuclei become suspended in room air and individuals farther away from the patient may inhale them,\" said Rajiv Dhand, professor and chair of the Department of Medicine and associate dean of clinical affairs at University of Tennessee Graduate School of Medicine, and co-author of the paper. Among the researchers' recommendations: \"Health care providers should stay six feet away from infected patients, especially when the patient is coughing or sneezing. For spontaneously breathing patients, placing a surgical mask on the patient's face or using tissue to cover his or her mouth, especially during coughing, sneezing or talking, may reduce the dispersion distance or viral load. While ideally, infected patients should be in single rooms to prevent droplet dispersion, it is acceptable for two patients with the same infection that is spread by respiratory droplets to be in the same room.\" Florida reported 11,458 new cases Saturday, the highest number of daily cases since the pandemic began, only second to the daily peak of 11,571 in New York last April. It confirmed nearly 190,052 cases, up from 178,594 cases the day before, which do not account include those who are asymptomatic or pre-symptomatic, and 3,702, up from 3,684 the day before, deaths from the virus. Unlike officials in California and Texas, however, Florida Gov. Ron DeSantis, a Republican, has said the state will not delay its reopening plans, and said the rise is mostly due to young people.The contagiousness of speech droplets \"Speech droplets generated by asymptomatic carriers of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) are increasingly considered to be a likely mode of disease transmission,\" a separate study published in the latest edition of the peer-reviewed Proceedings of the National Academy of Sciences, the official journal of the National Academy of Sciences, found. \"Highly sensitive laser light scattering observations have revealed that loud speech can emit thousands of oral fluid droplets per second.\" In a closed, stagnant-air environment, droplets disappear from view after eight to 14 minutes, \"which corresponds to droplet nuclei of ca. 4um diameter, or 12um to 21um droplets prior to dehydration,\" the researchers wrote. One micrometer, um, is equivalent to one millionth of a meter. The coronavirus is 0.125 um. The scientists said that, while it's long been recognized that respiratory viruses such as coronavirus can be transmitted via droplets generated by coughing or sneezing, it's less widely known that normal speaking does too. High viral loads of SARS-CoV-2 have been detected in oral fluids of COVID-19â\u0088\u0092positive patients, including asymptomatic ones. Related:5 critical mistakes that created the biggest public-health crisis in a generationHow far coronavirus droplets can travel Social distancing has been defined for people that are standing still. \"It does not take into account the potential aerodynamic effects introduced by person movement, such as walking fast, running and cycling,\" researchers wrote in another study titled, \"Towards aerodynamically equivalent COVID-19, 1.5 meters social distancing for walking and running.\" Bert Blocken, a professor of civil engineering at Eindhoven University of Technology in the Netherlands and Katholieke Universiteit Leuven in Flanders, Belgium, and his co-authors recommend that people avoid walking or running in the slipstream of a walker or runner in the park and street. \"In the absence of head wind, tail wind and cross-wind, for walking fast at 4 kilometers per hour, this distance is about 5 meters (16 feet) and for running at 14.4 kilometers per hour, this distance is about 10 meters (32 feet),\" the study, which has not been peer reviewed, found. The smaller the distance between the runners, the larger the fraction of droplets to which the trailing runner is exposed.\" If people wish to run behind and/or overtake other walkers and runners with regard for social distance, \"they can do so by moving outside the slipstream into staggered formation,\" it added. Letter from New York:'When I hear an ambulance, I wonder if there's a coronavirus patient inside. Are there more 911 calls, or do I notice every distant siren?'Factors indoor contributing to contagion Factors affecting whether the virus remains \"stable\" and contributing to transmission: Humidity and temperature of the room, air-conditioning, whether or not there are open windows, general air quality, size of the room and, of course, how many people are present and how close they are to each other. \"In contrast to SARS-CoV-1, most secondary cases of the new SARS-CoV-2 transmission appear to be occurring in community settings rather than health-care settings,\" a recent study published in the New England Journal of Medicine found. If travelers come to the Garden State, they shouldn't plan on eating inside a restaurant any time soon. Indoor dining was supposed to start Thursday, but after coronavirus spikes \"in other states driven by, in part, the return of indoor dining, we have decided to postpone indoor dining indefinitely. New York City Mayor Bill DeBlasio tweeted TWTR, -0.23%  Monday that he was reconsidering opening up indoor dining in the city. Fauci has said he was hopeful that a coronavirus vaccine could be developed by early 2021. Thus far, New York has had the most deaths from COVID-19 in the U.S. (32,137), followed by New Jersey (15,164), Massachusetts (8,149), Illinois (7,005), Pennsylvania (6,746), California (6,318) and Michigan (6,215). Texas has reported 2,592 deaths from the virus. The COVID-19 pandemic, which was first identified in Wuhan, China in December, had infected 11,124,651 people globally and 2,808,003 in the U.S. as of Saturday. It had claimed at least 526,003 lives worldwide, 129,476 of which were in the U.S., according to Johns Hopkins University's Center for Systems Science and Engineering. The Dow Jones Industrial Index DJIA, +0.56%  and the S&P 500 SPX, +0.87%  ended up at week's end, after better-than-expected unemployment numbers amid a surge of coronavirus in states that have loosened restrictions. How COVID-19 is transmitted"}]}