{"article": [{"url": "https://www.marketwatch.com/story/surging-us-coronavirus-cases-raise-fear-that-progress-is-slipping-away-2020-06-22", "published": 1592868260.0, "headline": "Surging U.S. coronavirus cases raise fear that progress is slipping away", "body": "ST. PETERSBURG, Fla. — Alarming surges in coronavirus cases across the U.S. South and West raised fears Monday that the outbreak is spiraling out of control and that hard-won progress against the scourge is slipping away because of resistance among many Americans to wearing masks and keeping their distance from others. Confirming predictions that the easing of state lockdowns over the past month and a half would lead to a comeback by the virus, cases surpassed 100,000 in Florida, hospitalizations are rising dramatically in Houston and Georgia, and a startling 1 in 5 of those tested in Arizona are proving to be infected. Over the weekend, the virus seemed to be everywhere at once: Several campaign staff members who helped set up President Donald Trump’s rally in Tulsa, Oklahoma, tested positive, as did 23 Clemson University football players in South Carolina. At least 30 members of the Louisiana State University team were isolated after becoming infected or coming into contact with someone who was. Meatpacking plants were also hit with outbreaks. “It is snowballing. We will most certainly see more people die as a result of this spike,” said Dr. Marc Boom, CEO and president of Houston Methodist Hospital, noting that the number of COVID-19 hospital admissions has tripled since Memorial Day to more than 1,400 across eight hospital systems in the Houston metropolitan area. He warned that hospitals could be overwhelmed in three weeks, and he pleaded with people to cover their faces and practice social distancing. “It is possible to open up at a judicious pace and coexist with the virus, but it requires millions and millions of people to do the right thing,” Boom said. Texas is among a number of states — including Arizona, Alabama, Florida and South Carolina — whose governors have resisted statewide mask requirements, leaving the matter to local authorities. The number of new coronavirus cases across the country per day has reached more than 26,000, up from about 21,000 two weeks ago, according to an Associated Press analysis of data compiled by Johns Hopkins University. Over 120,000 deaths in the U.S. have been blamed on the virus, the highest toll in the world. In Georgia, the number of people hospitalized because of COVID-19 rose to 1,000, erasing a month’s worth of progress. Infections are at their highest level since the outbreak began, nearly two months after Georgia began lifting restrictions on businesses. Gov. Brian Kemp has required face coverings by waiters, barbers and others working face-to-face with customers but has largely let businesses decide whether customers must wear masks. In Orlando, 152 coronavirus cases were linked to one bar near the University of Central Florida campus, said Dr. Raul Pino, a state health officer in the tourism city. “A lot of transmission happened there,” Pino said. “People are very close. People are not wearing masks. People are drinking, shouting, dancing, sweating, kissing and hugging, all the things that happen in bars. And all those things that happen are not good for COVID-19.” Although he asked health officials to renew calls for people to wear masks and keep their distance, Gov. Ron DeSantis has not signaled he will retreat from reopening the state after three months of shutdowns that have damaged the economy. Texas Gov. Greg Abbott said reimposing lockdown orders would be a last resort and reemphasized, but stopped short of mandating, people wear masks to curtail sobering trends. Monday marked the 11th consecutive day Texas set a new high for COVID-19 hospitalizations. In Louisiana, however, Gov. John Bel Edwards extended restrictions on businesses because of a troubling uptick in cases, following the example set by Utah and Oregon last week. Louisiana has recorded more than 3,000 deaths. “There are a lot of people out there saying they are done with this virus. Well, the virus isn’t done with us,” Edwards said. Countries such as Brazil, India and Pakistan are also seeing surging cases. Dr. Michael Ryan, the World Health Organization’s emergencies chief, said the outbreak is “definitely accelerating” in the U.S. and a number of other countries, dismissing the notion that the record-breaking daily levels of new cases simply reflect more testing. He noted that numerous countries have seen marked increases in hospital admissions and deaths. “The epidemic is now peaking or moving towards a peak in a number of large countries,” he warned. In the U.S., Arizona, in particular, is seeing disturbing trends in several benchmarks, including the percentage of tests that prove positive for the virus. Arizona’s is the highest in the nation. The state’s positive test rate is at a seven-day average of over 20%, well above the national average of 8.4% and the 10% level that public health officials say is a problem. When the positive test rate rises, it means that an outbreak is worsening — not just that more people are getting tested. At Maryland’s Fort Washington Medical Center on the outskirts of the nation’s capital, workers described a scramble to find beds, heartbreaking encounters with family members of critically ill patients and frustration with Americans who do not believe the coronavirus threat is real. “Everybody is out lounging on the beaches. Just thinking that it’s over. And it’s not,” respiratory therapist Kevin Cole said. “It’s far from being over. And unfortunately, it’s those people that will keep this pandemic going.” Meanwhile, New York City, once the most lethal hot spot in the U.S., lifted more of its restrictions, moving a big step closer to normal. Restaurants can serve diners outdoors, customers can browse through stores and get a haircut, and children can return to playgrounds. Eve Gonzalez, a 27-year-old food industry worker in New York whose job had not yet resumed, said it is too soon: “I’m dying to go out, but people’s health is more important.” Worldwide, over 9 million people have been confirmed infected by the virus and more than 470,000 have died, according to Johns Hopkins. Experts say the true numbers are much higher because of limited testing and cases in which patients had no symptoms. Amid the global surge, the head of the World Health Organization warned that world leaders must not politicize the outbreak but unite to fight it. Tedros Adhanom Ghebreyesus, who has faced criticism from U.S. President Donald Trump, said during a videoconference for the Dubai-based World Government Summit that it took over three months for the world to see 1 million confirmed infections, but just eight days to see the most recent 1 million cases. Tedros did not mention Trump by name but warned: “The greatest threat we face now is not the virus itself; it’s the lack of global solidarity and global leadership.” Trump has criticized the WHO over its early response to the outbreak and what he considers its excessive praise of China, where the outbreak began. He has threatened to pull the U.S. out of the agency. Brazil, with over 50,000 deaths, the second-highest toll in the world, registered a record 54,000 new coronavirus cases in its latest single-day count. And nearly 1 in 3 people tested overall have turned up positive, according to the WHO’s Ryan, who said the startlingly high number suggests cases are going either unreported or undetected because of a low rate of testing. Saudi Arabia said this year’s pilgrimage, or hajj, to Islam’s holy sites will not be canceled, but only “very limited numbers” of people will be allowed to take part. The hajj traditionally draws around 2 million Muslims from around the world for five intense days of worship and rituals in Mecca. India’s health care system has been slammed by the virus, with the caseload in the country of more than 1.3 billion people climbing by nearly 15,000 Monday to over 425,000. The number of deaths climbed past 13,000. In Pakistan, infections are accelerating and hospitals turning away patients, with new cases up to 6,800 a day. The government has relaxed its coronavirus restrictions, hoping to salvage a near-collapsed economy in the country of 220 million people."}]}