{"article": [{"url": "https://www.marketwatch.com/story/estee-lauder-shares-fall-after-wider-than-expected-losses-2020-08-20", "published": 1597909400.0, "headline": "Estee Lauder shares fall after wider-than-expected losses", "body": "Estee Lauder Cos. EL, +0.17% stock fell 5.3% in Thursday premarket trading after the beauty company reported fiscal fourth-quarter losses that were wider than expected and gave weak guidance. Net losses totaled $462 million, or $1.28 per share, after net income of $157 million, or 43 cents per share, last year. Adjusted losses were 53 cents per share, well below the 16-cents-per-share loss FactSet forecast. Sales of $2.43 billion were down from $3.59 billion last year and missed the $2.45 billion FactSet consensus. Office closures, the lack of parties and other gatherings and store closures due to COVID-19 have impacted the company, though Estee Lauder says the haircare and skincare side of the business has been \"more resilient.\" Skin care was up 13% to $7.38 billion for the year, while all other business categories declined. And the Asia/Pacific region was up 15% for the year to $4.24 billion while the Americas and EMEA fell. The company has repaid the money it borrowed under its credit facilities in two installments of $750 million each in June and August. It has declared a dividend of 48 cents per share, payable on September 15 to stockholders of record as of August 31. Estee Lauder announced a post-COVID-19 Business Acceleration Program that will include closing stores across North America, Europe, the Middle East and Africa while ramping up digital investment; a \"realignment\" of the distribution network to reflect department store closures, shuttering unproductive beauty counters and its own store closures; and a headcount reduction of 1,500 to 2,000 workers, about 3% of the workforce, around the world, primarily store associates and support staff. The company plans to close 10% to 15% of all its locations internationally. Estee Lauder expects to take a restructuring charge between $400 million and $500 million before taxes. For the fiscal first quarter, Estee Lauder expects net sales to decrease by 12% to 13% year-over-year, EPS between 77 cents and 83 cents and adjusted EPS between 80 cents and 85 cents. The FactSet consensus is for sales of $3.45 billion, which suggests an 11.4% year-over-year decline, and EPS of $1.26. Estee Lauder stock has gained nearly 3% for the year to date while the S&P 500 index SPX, +0.87% is up 4.5% for the period."}]}