{"article": [{"url": "https://www.marketwatch.com/story/uber-and-lyft-ordered-to-classify-workers-as-employees-in-california-11597095698", "published": 1597220000.0, "headline": "Uber and Lyft must make drivers employees because California law has 'overwhelming' edge, judge says", "body": "Uber drivers in Southern California sought enforcement of the new California law in an April protest so that they may qualify for unemployment insurance amid the COVID-19 pandemic. Getty Images A California judge ruled Monday that Uber Technologies Inc. and Lyft Inc. must classify their drivers as employees due to a new state law, a decision that threatens the business models of the ride-hailing giants and other gig-economy companies. California Attorney General Xavier Becerra and the city attorneys of San Francisco, Los Angeles and San Diego sued the companies earlier this year, asking a judge for a mandatory injunction ordering the companies to comply immediately with a new state law over worker classification, which became effective Jan. 1. Uber UBER, -0.18% is challenging the constitutionality of the law, known as Assembly Bill 5, or AB 5, and in a hearing last week argued against an immediate injunction pending a trial in that lawsuit, which may not happen for months. The two San Francisco-based ride-hailing rivals have built their multibillion-dollar companies on treating drivers as independent contractors instead of employees, pitching themselves as online platforms that simply connect drivers and riders. A 2018 California Supreme Court ruling adopted a new standard for employee classification in the state, which was codified by AB 5 and cited by the judge Monday to force a big change on ride-hailing companies that operate in California. Judge Ethan Schulman of the California Superior Court in San Francisco struck at the heart of the gig economy in granting the injunction, calling the drivers \"central, not tangential\" to the ride-hailing giants' business. Schulman also alluded to the companies' ability to avoid such a ruling as they grew rapidly and faced several legal challenges in recent years. \"Defendants are not entitled to an indefinite postponement of their day of reckoning,\" he wrote. Schulman gave Uber and Lyft 10 days before having to make the change, pending an appeal that Uber and Lyft LYFT representatives said the companies plan to file. \"The court's ruling is stayed for a minimum of 10 days, and we plan to file an immediate emergency appeal on behalf of California drivers,\" an Uber spokesman told MarketWatch in an email. Uber and Lyft argued in Thursday's hearing that an injunction would be unprecedented and affect hundreds of thousands of drivers. \"Drivers do not want to be employees, full stop,\" a Lyft spokesman wrote. \"We'll immediately appeal this ruling and continue to fight for their independence. Ultimately, we believe this issue will be decided by California voters and that they will side with drivers.\" Driver organizer Nicole Moore of Rideshare Drivers United in Los Angeles disagreed in an interview Monday \"This is absolutely the best-case scenario,\" she said. \"It shows that the state of California is behind drivers.\" Legal experts said Monday afternoon the companies are likely to ask for an extension to the 10-day period, but that the appeal could be a longshot. \"I would think the companies have a big mountain to climb,\" said William Gould, emeritus professor at Stanford Law School and a former chief of the National Labor Relations Board. \"Their sky-will-fall arguments are more appropriately addressed to the legislature than the judiciary.\" Uber, Lyft and other gig-economy companies see another road to success. They placed an initiative on the state ballot in November that offers worker concessions but would exempt the companies from having to comply with the new California law. Uber, Lyft and other gig companies say 76,000 drivers support Prop. 22, and often tout the flexibility they offer drivers and delivery workers as a reason for not wanting to classify them as employees. That argument \"presents a false choice,\" Gould said, maintaining that gig companies can choose to employ drivers and delivery workers as part-timers, for example. \"Employees can be flexible -much of the last quarter-century has been given over to making employees more flexible in deciding how and when work is done in manufacturing.\" U.S. Rep. Ro Khanna, D-Calif., who has tried to push the Essential Workers Bill of Rights through Congress during the COVID-19 pandemic, feels the same way. \"Classifying workers rightfully as employees does not prevent flexible and on-demand hours for gig workers,\" he said in an emailed statement. The worker-classification issue has long been controversial. In 2018, a California Supreme Court decision, called Dynamex, established a new \"ABC test\" for when a worker can be classified an independent contractor: if A: They control their work; B: If their duties fall outside the scope of a company's normal business; and C: If they are \"engaged in an independently established trade, occupation or business.\" Schulman wrote that the gig-economy companies cannot pass the second prong of that law, and therefore \"the likelihood that the People will prevail on their claim that Defendants have misclassified their drivers is overwhelming.\" Uber has made changes to its app that it says meet the ABC test because they give drivers some semblance of control over their work, such as in setting rates for rides. Labor and legal experts said that type of change is unlikely to fly under the new law, and that only reclassification will work. \"The court's ruling today finally forces Uber and Lyft to comply with employment law that has required them to treat their drivers as employees since the California Supreme Court ruled nearly two and a half years ago that gig economy drivers are employees, not independent contractors,\" said Catherine Fisk, law professor at UC Berkeley, in an email. \"The judge's opinion reveals the court's frustration with the companies' delaying tactics and their legal arguments that border on frivolous. The judge made clear the costs that drivers have borne.\" \"The court has weighed in and agreed: Uber and Lyft need to put a stop to unlawful misclassification of their drivers while our litigation continues,\" Becerra said in a statement Monday. \"While this fight still has a long way to go, we're pushing ahead to make sure the people of California get the workplace protections they deserve.\" The judge's decision on Monday coincided with Uber CEO Dara Khosrowshahi's op-ed in the New York Times, which addressed concerns about driver benefits that have intensified during the COVID-19 pandemic. Uber and other gig companies do not pay into state unemployment funds that some of their workers have tapped into - if their applications were approved - as ride-hailing drivers saw demand for their services decimated during widespread lockdowns in the past few months. Khosrowshahi proposed that gig companies establish benefit funds for drivers and delivery workers, who can use them for health insurance or paid time off. Lyft's co-founders have also expressed support for these so-called portable benefits in the past. As Uber and Lyft prepare their appeals after Monday's ruling, they are also facing a separate lawsuit filed last week by California's labor commissioner, accusing the companies of wage theft and failure to provide their drivers benefits such as health insurance and overtime pay. Neither Uber nor Lyft have lived up to their 2019 IPO valuations: Uber has declined 18.3% since then and Lyft has fallen 49.1%"}]}