{"article": [{"url": "https://www.marketwatch.com/story/azek-is-going-public-5-things-to-know-about-the-maker-of-decking-patio-and-other-outdoor-products-2020-06-11", "published": 1592204000.0, "headline": "Azek IPO: 5 things to know about the maker of decking, patio and other outdoor products", "body": "Azek Co. Inc. shares closed up 18% Friday in their trading debut, after the company upsized and priced its initial public offering above its price range. The company raised about $765 million in the biggest initial public offering of the week. Late Thursday, the company priced its IPO at $23 a share, above its expected range of $19 to $21 each, offering 33.25 million shares to raise $764.8 million. The maker of low-maintenance but sustainable building materials for outdoor living is listed on the New York Stock Exchange under the ticker symbol “AZEK.” There were 14 underwriters on the deal, led by Barclays. The Chicago-based company AZEK, +1.24%, which used to be called CPG, says it will use proceeds to redeem debt and for general corporate purposes. “We are an industry-leading designer and manufacturer of beautiful, low-maintenance and environmentally sustainable products focused on the highly attractive, fast-growing outdoor living market,” the company says in its prospectus. That category includes decks, rail, trim, wood and wood-look siding, porches, pavers, outdoor furniture, outdoor cabinetry and outdoor lighting. The company operates two divisions, TimberTech and Azek Exteriors. The former has a portfolio of capped polymer and capped composite decking, along with railing, porch, lighting and paver products. Azek Exteriors makes trim and moulding. The company has been around for 30 years and has manufacturing plants in Ohio and Pennsylvania and owns Minneapolis-based Ultralox railing systems. See:Coronavirus update: U.S. case tally passes 2 million mark and 21 states are still seeing increases in infections Azek serves the residential outdoor market and the commercial segment with bathroom partitions and lockers. “We are well known in the industry, and, according to data provided by Principia, we generally hold one of the top two market-share positions by revenue in our product categories,” says the prospectus. Principia is a research and consulting firm. In the residential segment, the company sells products through a network of more than 4,000 dealers and more than 35 distributors and home-improvement retailers in the U.S. and Canada. The company’s slogan supports its core values, of “always do the right thing,” according to the prospectus, one that might — in addition to recalling Google’s former motto — appeal to a key target market. “As more members of the millennial generation purchase first homes in the United States, we expect the demand for outdoor living spaces will rise, and the appeal of low- to no-maintenance features to gain further momentum,” says the prospectus. “We believe that consumers are increasingly environmentally conscious in their purchasing behaviors, and that our sustainable manufacturing practices and the high recycled content of our products address evolving consumer preferences.” The prospectus acknowledges the challenges being posed by the coronavirus pandemic and says it has cut staff and tapped credit lines to tide it over. It also concedes that it has a heavy debt load at $1.2 billion. Read:Lowe’s benefited from delayed DIY projects done during coronavirus lockdowns, while Home Depot saw professional jobs put on hold Upon the deal’s completion, the company is set to be 37.6% owned by private-equity firm Ares Management Corp. and 37.6% owned by Ontario Teachers’ Pension Plan Board. That makes it a controlled company, limiting individual shareholders’ say in how it is managed. Here are 5 things to know about Azek:It’s loss-making, but peers are making money Azek posted a net loss of $5.8 million for the first six months of fiscal 2020 through March 31. That was narrower than the $20.8 million loss posted in the year-earlier period. Sales rose to $411.6 million from $357.4 million. Azek’s main rival is Trex Inc. TREX, +2.47%, according to Renaissance Capital, a provider of institutional research and IPO ETFs. Trex posted net income of $42.4 million in the first quarter on sales of $200 million. That was up from net income of $31.6 million a year ago on sales of $179.6 million. Trex’s stock has held up through the pandemic, and is up 30% in the year to date, outperforming benchmark indexes. Winchester, Va.–based Trex has been publicly traded since 1999.Azek’s financial profile is not strong Azek faces high default risk and poor core health, according to RapidRatings, a data and analytics company that assesses the financial health of private and public companies. An analysis of the company’s financials assigned it a financial health rating, or FHR, of 35 on a scale of 1 to 100, for the four quarters ending Sept. 30, 2019. The FHR measures short-term resiliency and default risk. That puts Azek in the top half of RapidRatings’ High Risk group, with an estimated probability of default of 1.59% over the next 12 months. “This FHR and the default risk level are the result of Poor Core Health and current weakness in leverage and earnings performance,” said RapidRatings. Azek’s Core Health Score, which measures medium-term risk and company efficiency, came to 24 out of 100, which “suggests low levels of efficiency and a performance which is not sustainable over the long-term.” The rating fell in the four-quarter period, “reflecting deterioration in the company’s performance in net profitability and cost structure efficiency. Operating profitability, net profitability and capital structure efficiency are at low levels relative to the global data set.”Azek is highly leveraged Azek has $1.2 billion in debt, which is equal to 64% of total assets, according to RapidRatings. The company’s interest coverage was 0.71 times in 2019, meaning the company was unable to fully meet its interest obligations with operating profit. Interest expense rose to $83.2 million from $68.7 million. The prospectus acknowledges the risks the company would face if it is unable to generate sufficient cash to service its debt. “Our inability to generate sufficient cash flows to satisfy our debt obligations, or to refinance our indebtedness on commercially reasonable terms or at all, would have a material adverse effect on our financial condition and results of operations. “If we cannot make scheduled payments on our debt, we will be in default, and the lenders under the Senior Secured Credit Facilities could terminate their commitments to loan money, the lenders could foreclose against the assets securing their borrowings and we could be forced into bankruptcy or liquidation. Any of these events could result in you losing all or a portion of your investment in the Class A common stock.” James Gellert, chief executive of RapidRatings, noted the intended use of proceeds from the IPO is to pay down the company’s 8% notes. “This should have a positive impact when they lower debt, but is an interesting item to note,” he said. “It’s not unheard of for companies to use IPO proceeds to pay down debt, but It’s less common with the IPOs you’ve seen in recent years, where many are tech companies that are using new capital principally for growth and, frankly, to fund losses for years to come.”Azek has material weaknesses in internal control of financial reporting “As of September 30, 2019, we determined that we have three material weaknesses in our internal control over financial reporting,” says the prospectus. The first is related to maintaining an effective control environment, it explains, which is due to a lack of resources. “This material weakness contributed to an additional material weakness relating to the design and maintenance of formal accounting policies, procedures and controls,” it says. The third material weakness “relates to the design and maintenance of effective controls over certain information technology general controls,” it says. It defines material weakness as “a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of a company’s annual or interim financial statements will not be prevented or detected on a timely basis.” The company has taken steps to address the issue, hiring a new chief financial officer and a chief accounting officer, among other measures. Azek is going public in a highly uncertain environment For a business that relies on discretionary spending, Azek is going public at a highly uncertain time, with more than 40 million Americans out of work during the coronavirus pandemic. The company includes a detailed description of the risks stemming from COVID-19 in its risk factors. “The COVID-19 pandemic, and the reactions of governmental and other authorities to contain, mitigate or combat the pandemic, which have severely restricted the level of economic activity around the world, have impacted, and are expected to continue to impact, our operations, and the nature, extent and duration of the impact of COVID-19 or any future disease or adverse health condition is highly uncertain and beyond our control,” says the prospectus. The impact of the crisis is expected to be felt through the balance of fiscal 2020. The company is working with distributors to monitor market demand and ensure supply and inventory levels are appropriate. It expects that dealers, homeowners and industrial and commercial customers may delay new projects until the virus is contained. On a brighter note, the deal is coming at a time when the IPO market has been performing strongly. Deals that have hit the market this week and last, including Warner Music Group Corp. WMG, +0.54%, the biggest deal of the year so far, and online used-car site Vroom Inc. VRM, -0.26%, have chalked up strong gains. The Renaissance IPO ETF exchange-traded fund IPO, +1.98% has gained 19% in the year to date, easily outperforming the S&P 500, which is down 7% after Thursday’s market rout. The ETF has been buoyed by the inclusion in the index of recent IPOs of digital companies and others that are benefiting from working-from-home products and services, such as Zoom Video Communications Inc. ZM, +2.89% and Slack Technologies Inc. WORK, +3.36%, and the biotech company Moderna Inc. MRNA, +0.09%, which is working on a COVID-19 vaccine. Read now:Vroom IPO: 5 things to know about the online used-car seller"}]}