{"article": [{"url": "https://www.marketwatch.com/story/sp-500-earnings-have-been-as-bad-as-feared-even-as-the-beat-rate-has-improved-2020-07-24", "published": 1595834840.0, "headline": "S&P 500 earnings have been as bad as feared, even as the beat rate has improved", "body": "Companies are beating expectations at a relatively good pace, but investors shouldn’t take that to mean earnings season has been better-than-feared, with the year-over-year decline in profit and sales roughly the same as it was before the season kicked off. That is with 128 companies in the S&P 500 SPX, +0.87% , or about 25%, having reported results through Friday. The outlook for the earnings season could take a turn in either direction after the coming week, in which 184, or about 36% of the index, reports results. That includes three of the four largest U.S. companies by market capitalization — Apple Inc. AAPL, +1.74%, Amazon.com Inc. AMZN, +3.01% and Google parent Alphabet Inc. GOOGL, +1.82% — all reporting after the July 30 close. A lower bar set by the COVID-19 pandemic has allowed more than 80% of the companies reporting so far to beat earnings-per-share estimates, according to JPMorgan Chase & Co. equity strategist Mislav Matejka, which compares with the 65% companies that topped expectations in the first quarter. The average beat rate over the past five years has been about 72%, FactSet senior earning analyst John Butters said in a recent research note. Don’t miss: S&P 500 earnings set to plunge as the coronavirus batters all sectors -- with Wall Street counting on a bounce that may not come. The stock market has been pretty forgiving of the earnings decline, as results have been overwhelmingly influenced by the COVID-19 crisis, as the S&P 500 index has gained 1.5% since earnings season unofficially kicked off on July 14. For individual stocks, however, investors have cheered beats, and jeered misses, less than usual. According to Credit Suisse analyst Jonathan Golub, the stocks of companies beating both bottom line and top line expectations have outperformed the market by an average of 1.2%, compared with the historical average of 1.6%. And those missing on both have seen their stocks underperform by 0.7%, compared with a historical underperformance of 3.1%, Golub said. Here are the overall numbers for the quarterly earnings and sales performance of the S&P 500 companies so far, and the outlook for the third quarter: • The current blended year-over-year growth estimate for earnings per share, which includes results that have already been reported and the average analyst estimates of coming results, is negative 42.4% through Friday, according to FactSet. That includes a 42.8% drop in already reported results. The decline is on track to be the biggest since the fourth quarter of 2008, in the midst of the financial crisis. While the earnings growth rate usually improves as earnings seasons progress, the current pace is below the five-year average of improvement of about 4.7 percentage points, FactSet’s Butters said. • Of the 11 S&P 500 sectors, 10 are showing negative earnings growth rates, which compares to all 11 sectors showing declines before the start of the reporting season. Energy XLE, -1.59% has been the worst performer, with a current blended estimate of negative 156.4% according to FactSet, worse than the pre-earnings estimate of 152.6%. The blended estimate for the consumer discretionary XLY, +1.04%, which includes Amazon, is a negative 116.5%, slightly better than the pre-earnings estimate of 118.0%. Only 4 of 26 energy companies and 13 of 60 consumer discretionary companies have already reported results. The utilities sector XLU, -0.01% is now showing blended estimate growth of 1.3%, compared with a pre-earnings estimate of down 1.8%. Of the 2 utilities that have reported, FirstEnergy Corp. FE, -0.19% reported a 4.7% earnings drop and NextEra Energy Inc. NEE, +0.62% reported an 11.4% increase, according to FactSet. • The blended estimate for sales is for a 10.3% decline, compared with a pre-earnings estimate of down 11.0%. The beat rate for sales has been about 69%, according to I/B/E/S data from Refinitiv. • The outlook for the third-quarter is for negative earnings growth of 23.9%, very similar to the pre-earnings estimate of a 24.4% drop, according to FactSet data. Sales are now expected to fall 5.1%, versus previous expectations of a 5.5% decline."}]}