{"article": [{"url": "https://www.marketwatch.com/story/there-is-a-right-thing-to-do-when-the-market-tanks-11593443419", "published": 1593525920.0, "headline": "There is a 'right thing' to do when the market tanks", "body": "I came across a statistic so surprising it was hard to believe: During the recent market downturn, according to Fidelity Investments, approximately 15% of investors sold all of their stock holdings. And among investors age 65 and older, nearly a third sold all their stock market investments. It was a discouraging figure, meaning that large numbers of people had picked exactly the wrong time to abandon their investments. Fortunately, the figures were corrected a few days later. The actual numbers turned out to be far smaller. That's good news since the stock market recovery, like the downturn itself, was the fastest on record. Still, some people did give up on the market while it was down. On The Wall Street Journal's website, where these figures were reported, the article sparked a furious debate, with some readers still vehement that selling stocks was the right thing to do. One wrote that, \"I simply don't understand the logic why almost all financial advisors say to ride this out.\" Another put it in more colorful terms: \"The marketeers say to stay the course. Do not ask a butcher about the merits of a vegetarian dietâ\u0080¦.\" Many took the opposite view, arguing that it would be a mistake to sell out of stocks. One reader wrote, \"Have fun in 20 years when inflation has destroyed the purchasing power of your 'safe' cash and CDs. I believe in the U.S. and in the miracle of our economyâ\u0080¦. I'm all stocks and always will be!\" Others didn't necessarily weigh in on either side. Instead, they just offered their own personal prescriptions: \"10% cash, 45% six year or less duration bond fund and 45% in an SPX, +0.87% fund is all you need.\" In all, there were more than 300 reader comments on the article. What struck me, though, is that people were largely talking past each other. It sounded more like a political debate than a financial one. But unlike a political debate, there is a right answer to this question. The numbers, as you might guess, tell us the best strategy is to stay the course. According to a review by Vanguard Group, no fewer than nine different studies going back to the 1960s have confirmed this. But I can understand why some people still sell during market downturns. Every market downturn is different and scary in its own way-and this one was no exception. Canada's Financial Post captured it well. In a mid-March article titled \"This Time Is Different,\" one economist explained why he saw this crisis as even worse than 2008, which was itself terrible: \"In the [2008] financial crisis, air travel didn't come to a halt, borders weren't being closed, we weren't talking about quarantines and self-isolationâ\u0080¦. [P]eople weren't scared to leave their homesâ\u0080¦. The reality is the [2008] financial crisis did not come with a mortality rate.\" In my conversations with investors over the past few months, I've heard these same sentiments. This pandemic is scary and there is no real parallel or precedent. Yes, there was the 1918 flu. But the economy and our health care system were so different then that it's hard to compare. In fact, according to a Federal Reserve paper, economic data from that era are so limited that it may be impossible to make comparisons. What's an investor to do? Sure, the data might say it's a mistake to sell, but historical data points are, by definition, backward-looking. If the current crisis, or one in the future, looks different enough and scary enough, what use is the data? Why shouldn't people sell out when a crisis hits? I understand this conundrum and offer two possible answers. My first answer will sound like circular reasoning, but stick with me. The reason you shouldn't worry when the next crisis looks different and unprecedented is because all crises are different and unprecedented. If you think about it, our country has been through numerous traumas before-some much worse-and has always survived and gone on to prosper. Amid 2008's financial panic, Berkshire Hathaway Chairman Warren Buffett articulated this point, as I mentioned last week: \"The American miracle, the American magic has always prevailed, and it will do so again.\" I'm a little superstitious, so I won't list the various types of crises that might occur down the road. But the fact is, some number of bad things will inevitably happen. That's the unfortunate reality. As an investor, if you can accept that, I think you'll have the right mindset to ride out those crises with greater equanimity. That brings me to my second answer. Try to gain a deeper understanding of what drives stock prices. Should you simply take it on faith that the market will go up in the future just because it always has in the past? Definitely not. Instead, I'll again defer to Buffett, who has done a good job articulating exactly why you should believe that the market will go up over time. In short, economic growth is a function of birth rates, immigration and gains in productivity, including new inventions. As long as the U.S. is an attractive place to live, and we gain our fair share of smart and driven new citizens, and as a whole we're industrious and productive, that gives me confidence that our economy-and thus our stock market-will continue to grow. If you were unnerved by this year's market downturn, I don't blame you. I would be kidding you if I said I wasn't also unnerved. And I know there are those who believe we could see another decline. That might well be the case-but if you can keep in mind these two ideas, I think you'll be able to ride things out with greater peace of mind. This column originally ran on Humble Dollar. It was republished with permission. Adam M. Grossman's previous articles include Think Like a Winner, Looking for an Edge and Divvying Up Dollars.  Adam is the founder of Mayport Wealth Management, a fixed-fee financial planning firm in Boston. He's an advocate of evidence-based investing and is on a mission to lower the cost of investment advice for consumers. Follow Adam on Twitter @AdamMGrossman."}]}