{"article": [{"url": "https://www.marketwatch.com/story/papa-johns-ceo-highlights-resiliency-of-the-pizza-business-as-revenue-reaches-record-level-2020-08-07", "published": 1597044200.0, "headline": "Papa John's CEO highlights 'resiliency' of the pizza business as revenue reaches record level", "body": "While many businesses are struggling to climb back from COVID-19-driven lows, Rob Lynch, chief executive of Papa John's International Inc., says the pizza business can withstand the pandemic and lots of other economic trials. Papa John's PZZA, -1.18%  reported second-quarter revenue that reached a record $460.6 million on Thursday, and North American same-store sales soared 28%. \"Pizza has always been really resilient in the face of economic challenges,\" Lynch told MarketWatch after the company's earnings call. \"Recession can be a time of prosperity for pizza.\" One reason is value. Lynch notes that for $15, a family of four can enjoy a pizza dinner. With the unemployment rate at 10.2%, more diners will be thinking about the cost of everyday items. Read:U.S. adds 1.76 million jobs in July as hiring slows after fresh coronavirus outbreak \"We have an inherent value proposition that is designed to work well through challenging economic times,\" he said. \"I think there will be people who trade down to pizza.\" Lynch notes that a fast-food meal at that price is hard to find. Noting the need to make food more affordable, Wendy's Co. WEN, +2.20%  announced this week that it would be launching a Spicy Chicken Value Sandwich next week, and putting it on the \"4 for $4\" menu. \"We also believe that value is going to play a key role for customers during this challenging time,\" said Wendy's Chief Executive Todd Penegor on the earnings call, according to FactSet. Papa John's Lynch says there's room on his company's menu for items other than pizza. The company launched Papadia flatbreads with exceptional sales. \"Papadias opened our eyes to the potential\" of other items, Lynch said. See:Chipotle customers are spending more to dine on queso and steak UBS analysts think Papa John's has same-store sales momentum. \"With Papa John's attributing just about half of the 28% 2Q North American same-store sales to favorable COVID impacts and the rest to progress against strategic initiatives, underlying comp outperformance appears sustainable,\" analysts led by Dennis Geiger wrote. UBS rates Papa John's stock neutral with a $100 price target, up from $78. \"The strength of the pizza segment remains largely unmatched by Papa John's and its direct peers (although a limited number of other concepts have also been beneficiaries of a convenience and contactless trend),\" wrote MKM Partners' Brett Levy. MKM also judges the health of the business by its growth plans. On the earnings call, Lynch said North American franchises closed the lowest number of locations in 10 years, thanks to strong sales and profitability. New store development has been paused due to the coronavirus, but Papa John's looks forward to \"attractive real estate opportunities in the months ahead,\" Lynch said on the call, according to a FactSet transcript. Chipotle Mexican Grill Inc. CMG, +0.01%  , which beat its most recent earnings expectations, is also anticipating the choice real estate opportunities available in the near future. MKM rates Papa John's stock neutral with an $84 price target, up from $82. Papa John's shares have rallied 55% for the year to date. The S&P 500 index SPX, +0.87%  has gained 3.7% for 2020 so far."}]}