{"article": [{"url": "https://www.marketwatch.com/story/wells-fargo-blames-covid-19-and-fed-rules-but-also-itself-for-disappointing-results-2020-07-14", "published": 1594798220.0, "headline": "Wells Fargo blames COVID-19 and Fed rules, but also itself for disappointing results", "body": "Shares of Wells Fargo & Co. closed Tuesday down nearly 5%, but well off the day’s worst levels, after the bank reported a wider-than-expected second-quarter loss and said it was cutting its quarterly dividend by 80%. Wells Chief Executive Charles Scharf said on the post-earnings conference call with Wall Street analysts that the effect of the COVID-19 pandemic on consumers and the overall economy “substantially impacted” results, as it led to the bank adding $8.4 billion to the allowance for credit losses. Scharf said the asset cap placed on the bank by the Federal Reserve also hurt, as the bank couldn’t grow its balance sheet to offset the lower interest rate environment, which led to a 13% drop in net interest income. But for that, Scharf acknowledged that the bank couldn’t blame anything but itself. “[W]e are responsible for the position we’re in,” Scharf said, according to a FactSet transcript of the conference call. “ “The balance sheet cap exists because leadership failed to both oversee and build the appropriate infrastructure of the company and our financial underperformance is because leadership didn’t make the difficult decisions necessary.” ” — Wells Fargo Chief Executive Charles Scharf The Fed put the growth restrictions on Wells in response to sales practice scandals uncovered nearly four years ago, which led to billions of dollars in fines, the build out of new risk control models, and management and director house cleaning. That included the resignation in March 2019 of CEO Tim Sloan and the naming of Scharf as CEO last September. Also read: Fed says Wells Fargo isn’t allowed to grow after wave of scandals. Don’t miss: New Wells Fargo CEO says the bank’s issues won’t be fixed until 2021. And Scharf seemed determined not to make the same mistakes of his predecessors. “As I’ve said and I’ll say it again, we will not do anything that will impact the work we have under way to build out our risk and control environment,” Scharf said. The stock WFC, was down as much as 8.2% at Tuesday’s intraday low of $23.33, before bouncing to close down 4.6% at $24.25. It underperformed its large-capitalization peers and the broader stock market by wide margins, as the SPDR S&P Bank exchange-traded fund KBE, -0.69% slipped 1.6% and the S&P 500 index SPX, +0.87% gained 1.3%. Also weighing on the stock, besides just the bank’s disappointing second-quarter results, was that Wells cut its quarterly dividend by 80% to 10 cents a share, from 51 cents a share, following the results of the Fed’s annual stress tests of large U.S. banks. Read more: Opinion: Are the dividends from your bank stocks safe? Stress test results put pressure on future payouts. Based on Tuesday’s closing stock prices, the dividend cut reduces the implied dividend yield from 8.41% to 1.65%. That would knock Wells down from being the highest yielder among the SPDR bank ETF’s components to 80th out of 87. In comparison, the yield for the bank ETF is 3.51% and the implied yield for the S&P 500 is 1.79%, according to FactSet. Scharf also warned that while the Fed’s dividend payout limitation applies to the third quarter, the Fed reserves the right to extend the limitations as it learns more about the evolution of the COVID-19 pandemic and its impact on bank balance sheets.The disappointing numbers Before Tuesday’s open, Wells reported that it swung to a second-quarter net loss of $2.69 billion, or 66 cents a share, from net income of $5.85 billion, or $1.30 a share, in the same period a year ago. The FactSet consensus was for a much narrower loss of 16 cents a share. Total revenue fell 17% to $17.84 billion, with net interest income dropping 18% to $9.9 billion to miss the FactSet consensus of $10.3 billion, and non-interest income declining 16% to $8.0 billion to miss expectations of $8.1 billion. Net interest margin fell to 2.25% from 2.82%, below the FactSet consensus of 2.33%. “We are extremely disappointed in both our second quarter results and our intent to reduce our dividend,” Scharf said in a statement. “Our view of the length and severity of the economic downturn has deteriorated considerably from the assumptions used last quarter, which drove the $8.4 billion addition to our credit loss reserve in the second quarter.” The stock has tumbled 19.7% over the past three months, making it the worst performer among the SPDR bank ETF’s components over that time period. Meanwhile, the bank ETF has gained 2.8% over the past three months and the S&P 500 has climbed 12.4%."}]}