{"article": [{"url": "https://www.marketwatch.com/story/gold-edges-higher-ahead-of-fed-decision-2020-07-29", "published": 1596033860.0, "headline": "Gold logs record close, up a ninth straight session, then climbs after Fedâ\u0080\u0099s policy statement", "body": "Gold futures tallied a ninth gain in a row on Wednesday to settle at another record, then moved even higher after the Federal Open Market Committee reiterated plans to keep interest rates near zero until the economy sees further improvement. In its statement after two days of talks, the Fed noted economic activity and jobs â\u0080\u009chave picked up somewhat in recent monthsâ\u0080\u009d while pledging again to use its full range of tools to support further improvement. â\u0080\u009cThe Fed came out with no surprises, and basically told the market it would be business as usual going forward â\u0080\u0094 or unusual as the case may be,â\u0080\u009d said Brien Lundin, editor of Gold Newsletter. â\u0080\u009cWith this one, small element of uncertainty removed, gold responded well and resumed its rally.â\u0080\u009d Against this backdrop, gold for August delivery GC00, +2.17% Â US:GCQ20 Â was at $1,958.40 an ounce in electronic trading shortly after the Fed statement. It posted a gain of $8.80, or nearly 0.5%, Wednesday to settle at a record of $1,953.40 an ounce on Comex ahead of the Fed news. Gold had also ended at a record $1,944.60 an ounce on Tuesday. The stretch of ninth session gains is the longest such streak since the 10-session climb ended in January. The statement came ahead of Fed Chairman Jerome Powellâ\u0080\u0099s news conference Wednesday. Investors didnâ\u0080\u0099t expect any major tweaks to policy, but look for Powell to maintain a dovish tone, signaling the central bank is committed to maintaining monetary loose policy and is prepared to do more if needed to avert a further downturn. Read: The Fed wonâ\u0080\u0099t be happy with how the economy is performing, but isnâ\u0080\u0099t perturbed enough to take aggressive action The central bank Wednesday said it would keep interest rates near zero until employment recovers and inflation picks up. â\u0080\u009cThe recent spike in coronavirus cases have prompted re-imposition of restrictionsâ\u0080\u009d and the number of new claimants for unemployment benefits is at over one million, said Sanjeeban Sarkar, commodities editor at The Economist Intelligence Unit. â\u0080\u009cThese factors bode well for the precious metals marketâ\u0080\u009d and spot gold prices going forward, he told MarketWatch. â\u0080\u009cLow interest rates boost gold purchases.â\u0080\u009d However, with the Fedâ\u0080\u0099s hand tied at the moment, â\u0080\u009cthe decision to leave rates unchanged is mostly priced in.â\u0080\u009d The U.S. dollar extended its decline against currency rivals in the wake of the Fed statement, with the ICE U.S. Dollar DXY, -0.58% Â down 0.4% in Wednesday dealings, providing further support for dollar-denominated gold prices. Meanwhile, September silver US:SIU20 Â added 2 cents, or 0.09%, at $24.321 an ounce. Prices, which settled Monday at their highest since April 2013, trade roughly 25% higher year to date. Silver has rallied â\u0080\u009cfor many of the reasons that gold is, in that they are both precious metals that are sought as a refuge in times of economic uncertainty and financial market volatility,â\u0080\u009d said Jordan Eliseo, manager, listed products and investment research at The Perth Mint. â\u0080\u009cUnlike gold which is seen more as a monetary metal by the market, silver is also widely used in industry, which is one of the reasons why price movements (both to the upside and downside) can often be more volatile than the movements seen in gold itself,â\u0080\u009d he told MarketWatch. Looking ahead, â\u0080\u009cthere are no guarantees history will repeat itself, but a growing number of investors are positioning their portfolios to benefit should silver outperform gold in the years to come, as it has over the past three months,â\u0080\u009d said Eliseo. Among other metals traded on Comex Wednesday, September copper US:HGU20 Â edged up by 0.05% to $2.919 a pound. October platinum PLV20, +3.99% Â lost 2.8% to $958.50 an ounce and September palladium US:PAU20 Â fell 4.4% to $2,261.20 an ounce."}]}