{"article": [{"url": "https://www.marketwatch.com/story/going-down-to-zero-the-new-york-way-2020-07-14", "published": 1594732760.0, "headline": "Going down to zero, the New York way", "body": "Welcome to New York, America’s Good-Behavior City. While Florida sets infection records, while California locks down again, while Texas backpedals on Botox sessions and shutters the saloons, New Yorkers find themselves in a place they haven’t often been before: taking bows for their tidy behavior. Mayor Bill de Blasio sounded somewhere between giddy and incredulous when he declared on Monday: “For the first time in months, we have a 24-hour period where no one in this city died from the coronavirus.” No one. In a city that not so long ago was America’s undisputed COVID death capital, where the five-borough fatality count peaked in April at 800 a day. From there to zero. “Let’s have many more days like that,” the mayor was quick to add. “ “Do what I do, wear a mask.” ” — Amazon delivery man Manuel Acevedo No one really expects the perfect zero to hold. In fact, it already hasn’t. There are still thousands of coronavirus patients in the city’s public and private hospitals, many of them aged and otherwise infirm. They won’t all make it. But it’s still a remarkable turnaround at a time when America desperately needs some good pandemic news and other parts of the country, in the south and west especially, are struggling to spark their own life-or-death reversals. So how did New Yorkers do it? Don’t ask me. Ask them. “Do what I do,” Amazon AMZN, +3.01% delivery man Manuel Acevedo said through his cotton face mask. “Wear a mask.” “Stay inside as much as you possibly can,” said 73-year-old Robin Kantor. “The drugstore. The supermarket. That’s enough. Where else do you need to go?” “Wash your hands a lot,” said 4-year-old Aisha Hassan. “Yes, exactly,” her mother, Afrah Hassan, agreed. Really, it’s all so obvious. It’s all the things the public-health experts have been saying for months now. Over and over again. You just have to do them. That’s the secret that New Yorkers have learned and many others have somehow overlooked. You just have to do them. Lest anyone think New Yorkers lack understanding, it’s worth recalling just how far this change has come. The city’s first COVID-19 death was recorded on March 13, an 82-year-old woman at Wyckoff Heights Medical Center on the Brooklyn-Queens line, and the fatalities shot up from there. From April 5 to April 13, the COVID deaths topped 500 every, single day. Not only were the hospitals bursting, the morgues were too. So many people were dying so quickly, bodies were stacked in refrigerator trucks until the grieving relatives could arrive — and start the difficult search for a funeral home with any remaining capacity. Now those stories are datelined Miami, Houston, Phoenix and L.A. — or soon will be. That’s another immutable lesson from New York’s painful experience: First come the infections, then the hospitalizations, then the deaths. New Yorkers, it turned out, didn’t have any secret weapons against the deadly virus unless you count political leaders who believe in science and citizens who can follow instructions when their lives depend on it. It wasn’t too much to ask. See: New York Gov. Cuomo says President Trump has put politics above public health throughout pandemic New Yorkers did suffer and are suffering in many ways. Indoor dining isn’t back yet. Most offices are still empty. Subway ridership is still way down. Too many people are still out of work. But all that pain and all that effort means that normalcy is actually in reach again. Schools will open on a modified schedule in September, Gov. Andrew Cuomo said, as long as the infection rate stays below 5% by the first week of August. They can remain open unless that number reaches 9%. Science, not opinion polls, will decide. There is one parallel in this city of surprises, another time New York went from the beast to the least in modern memory. That’s what happened with violent crime. In 1990, New York had a record 2,262 murders. Last year, the number was 319, a jaw-dropping murder reduction of nearly 86%. Unfortunately, nothing similar happened with condo prices or apartment rents. But no one ever expected New York to become the safest big city in America, and here we are. Crime has been inching up the past few months as the mayor and the police unions squabble over racial issues, street protests, reform calls, budget cuts and what role the cops should play in enforcing coronavirus restrictions. But it’s a wisp of what crime was 30 years ago, and that’s just a fact. Also see: Closed attractions and travel restrictions put New York City’s $70 billion tourism industry on hold indefinitely There’s no shortage of politicians willing to take credit for the crime triumph. There will be no shortage prepared to take credit for the coronavirus reversal, assuming it holds. But once before, when no one really expected it, New Yorkers decided to quit killing each other. Now, it seems, they’ve made the same decision again. Ellis Henican is an author based in New York City and a former newspaper columnist."}]}