{"article": [{"url": "https://www.marketwatch.com/story/fiscal-stimulus-talks-look-dead-after-trump-says-hes-pulling-out-of-bargaining-until-after-election-11602014853", "published": 1602018740.0, "headline": "Amid ruins of stimulus talks, Trump, Pelosi and McConnell trade blame", "body": "President Donald Trump walks from Marine One after a landing last week on the South Lawn of the White House. The coronavirus aid bill talks ended Tuesday, and the finger pointing began. After President Donald Trump’s late-day tweets announcing his decision to pull the plug on the bargaining until after the election, Capitol Hill leaders were quick to state who deserved the blame for the apparent end of widely supported efforts to give the economy a second big boost since the onset of the COVID-19 pandemic. In a series of tweets a little more than an hour before the U.S stock markets closed, Trump accused House Speaker Nancy Pelosi of not negotiating in good faith and Democrats of wanting too much money for the package. “I am rejecting their … request, and looking to the future of our Country. I have instructed my representatives to stop negotiating until after the election when, immediately after I win, we will pass a major Stimulus Bill that focuses on hardworking Americans and Small Business,” he wrote. iframe.twitter-tweet { width: 100% !important; } Trump said he was instructing Senate Majority Leader Mitch McConnell to focus instead on getting Amy Coney Barrett, Trump’s pick for the U.S. Supreme Court, confirmed quickly. “When you say. ‘what is the president thinking?’ you may be using that term ‘thinking’ loosely,” Pelosi said during a remote video chat sponsored by New York City’s 92nd Street Y. “He said ‘I want to have the Senate fully focused on the confirmation.’ So has placed the overturning of the Affordable Care Act in front of what we need to do for America’s working families, to crush the virus, reward our heroes, save our democracy,” she said. Trump’s move hit Wall Street, where traders had held out hope for a deal, despite weeks of on-again, off-again talks in Washington. The Dow Jones Industrial Average DJIA fell to session lows before bouncing back slightly. It still ended the day off more than 375 points, or 1.34%. Read more: Dow finishes down more than 1% as Trump calls end to fiscal stimulus talks until after election Pelosi accused Trump of backing out because he would not budge on tax provisions Democrats sought and didn’t want more direct payments to households unless his name could appear on the checks. Pelosi’s counterpart in the Senate, Senate Majority Leader Mitch McConnell, said he supported Trump’s decision to end the talks. “I think his view was that they were not going to produce a result and we needed to concentrate on what’s achievable,” McConnell told reporters at the Capitol. “This has been going on for two months. We re-engaged in July. The Speaker never made a reasonable offer,” McConnell said on Fox News later. “They didn’t want to get a deal this soon.” The talks ended with a public difference of several hundred billion dollars but possibly more unresolvable disagreements over policy. House Democrats forced a $2.2 trillion bill through the chamber last week as their latest offer while Treasury Secretary Steven Mnuchin had said the administration was offering a deal worth “in the neighborhood” between $1.5 trillion and $2.2 trillion. (The House in May had passed the $3 trillion HEROES Act pandemic relief bill, but McConnell failed to acknowledge it in the Senate.) Whether a deal of the magnitude referenced by Mnuchin could have made it through McConnell’s Senate, though, was always unclear. Liam Donovan, principal with Bracewell LLP’s Policy Resolution Group, said the White House’s lack of focus helped sink the talks. “The apathy and ambivalence from the White House made for a leadership vacuum that sent GOP members scattering in every direction depending on their individual political calculations. Republicans didn’t exactly cover themselves in glory here, but in the end Donald Trump owns this failure because he had everything to gain, and nothing to lose, ideologically or otherwise. In that sense, the tweet was a fitting coda,” he said in an email. There’s still a possibility that the talks could be restarted, and there is broad public and financial markets support for major provisions of any new package, including more $1,200 direct payments and revivals of small-business lending and federal unemployment-benefit enhancements. The bipartisan, evenly divided 50-member House Problem Solvers Caucus, which had put together a $1.5 trillion plan, called for more talks. “Inaction is not an option,” the group said. iframe.twitter-tweet { width: 100% !important; } Both McConnell and Pelosi said they anticipate taking the issue up after the elections. McConnell said another economic package is needed and Pelosi said Democrats may try to attach stimulus provisions to a second temporary government funding bill that will be needed by Dec. 11. “We’ll win the election and in the lame duck we’ll have to pass the stimulus. Or we’ll have to put provisions in the appropriations bill to keep government open,” she said. Even if talks remain dormant until after the election, it’s uncertain there could be a deal to be made even then, Donovan said, depending on the election outcome. “A clean sweep [by Democrats] may convince [Republicans] they should deal while they still have some leverage, but Democrats may prefer to wait for reinforcements; if Republicans hold serve in the Senate, they may not want to give a President Biden a running start,” he said. “The only way to get a sizable lame-duck package may be the big Trump victory his tweet envisions, or some external factors we’d hope to avoid –e.g. worsening economic or public health data.” Earlier Tuesday, Federal Reserve Chairman Jerome Powell had again urged Congress to approve more stimulus money soon, warning the failure to do so could lead to “tragic” economic consequences. Read more: Powell says U.S. economy needs more fiscal support “Too little support would lead to a weak recovery, creating unnecessary hardship for households and businesses,” Powell said in a speech to the National Association for Business Economics. The last monthly jobs report out before the election showed disappointing jobs growth in September but an unemployment rate moving below 8% after shooting to almost 15% in April. The third-quarter gross domestic product report due out only a few days before the election is expected to show bounce-back growth."}]}