{"article": [{"url": "https://www.marketwatch.com/story/heres-why-college-towns-consistently-rank-among-the-most-economically-resilient-places-in-the-country-2020-08-03", "published": 1596814820.0, "headline": "Here's why college towns are among the most economically resilient places in the country", "body": "College towns tend to weather economic downturns fairly well for a number of reasons. The university helps insulate the town as students fill up rental units, restaurants and bars, and spend money at local stores. Plus time-honored traditions - like parents' weekends, graduations and football games - bring an influx of visitors to town, reliably pumping money into the local economy. But nowhere is entirely pandemic-proof. Not even university towns. College towns' economic shields came down when universities were forced to close their physical campuses due to COVID-19 and in the middle of the spring semester, shifting to distance learning. \"COVID is a much different downturn, not only because of its removal of students from communities and the economic impact they generate, but also the likely classification of university staff as nonessential,\" explains Drew Repp from Emsi, a labor analytics firm. While faculty remain employed, lecturing over Zoom ZM, +2.89%  , many other university jobs, say, the dining hall workers, weren't deemed essential (depending on the state), Repp explains. In fact, according to an Emsi analysis, communities with the highest share of nonessential workers were dominated by college towns. Still, while many college towns don't have industry diversity, a sampling of their unemployment rates weren't any higher than the national unemployment rate in April. \"In that sense, you could say college towns appear to be weathering the COVID downturn as well as could be hoped,\" Repp says. Plus, as universities reopen in the fall - some experimenting with hybrid models with more classes offered online - college towns should rebound. Also see: The top 10 college towns in the U.S. Here's a look at five college towns across the country that are among the top of the class when it comes to industry diversity, which helps them rebound from economic woes.1. Corvallis, Ore. Corvallis, Oregon iStock/Getty Images Not only is the Willamette Valley known as an emerging wine region, but its soil and climate has made the area a leader in seed and specialty crops as well as Christmas trees. Plus, more than 25 software companies call Corvallis home, and Hewlett Packard has a 2.3 million-square-foot research campus here. Thanks to the presence of Oregon State University, and the high volume of engineers the school graduates, Corvallis is among the highest educated workforces in the Northwest. Weekends here are for exploring the great outdoors: Corvallis is surrounded by more than 60 miles of multiuse trails, and offers easy access to wine country and the Oregon Coast.2. Madison, Wis. Madison, Wisconsin Getty Images for IRONMAN When it comes to economic diversity, Madison - home to the University of Wisconsin - is No. 1. The medical industry is an economic engine, with Epic, UW Hospitals and Meriter and Dean Healthcare providing plenty of jobs. Plus, American Family Insurance, Lands' End LE, -1.71%  and American Girl have operations in the state capitol. Built on an isthmus, Madison is between lakes Mendota and Monona, and residents here love outdoor recreation (as well as the farmers market and good craft beer paired with cheese, of course). Those are just some of the reasons that Madison was named one our best cities for recent college graduates. Oh, and a fun piece of collegiate trivia? Rodney Dangerfield's \"Back to School\" is set in Madison, featuring famous landmarks like the State Capitol Building and Lake Mendota. Also read: I want to retire in a college town with warm weather and lower taxes - where should I go?3. Flagstaff, Ariz. Mountains. Desert. Ponderosa pine forests. Residents enjoy the trifecta in Flagstaff. Plus, let the night sky dazzle you; Flagstaff is one of the best places to stargaze, with longstanding ordinances designed to preserve dark skies. Home to the University of Northern Arizona, Flagstaff also has a diverse economy outside of higher education that includes advanced manufacturing, astronomy (it's home to Lowell Observatory, one of the oldest observatories in the country), health care, craft brewing, bioscience and e-commerce.4. Rochester, N.Y. With only 12,000 students, the University of Rochester is small for a top research university and boasts institutes for everything from music leadership to optics. Situated on the shores of Lake Ontario, Rochester is also home to Rochester Institute of Technology. Companies benefit from the tech-savvy, highly educated workforce, and key industries include optics, photonics and imaging, biotech, energy innovation, software and IT services. Rochester residents can enjoy plenty of festivals that celebrate everything from lilacs to jazz to the Erie Canal. Affordability is also a huge draw in Rochester, with average home prices under the $100,000 mark. See: Six reasons a college town is the perfect place to retire5. Fort Collins, Colo. Some well-known companies like Hewlett Packard HPQ, -0.15%  , Otterbox and Noosa have operations in Fort Collins, a college town in Northern Colorado. But the city also has an entrepreneurial spirit, thanks in part to Colorado State University's College of Business and the Institute for Entrepreneurship. Innosphere Ventures is a high-tech incubator helping startups in fields like AI, health innovation, hardware and software, life sciences and fintech secure funding. Lazing at Horsetooth Reservoir, white-water rafting along the Poudre River and playing one of the community pianos (there's 65 scattered about town!) make days off in Fort Collins fun. Plus, you might notice that Old Town feels magical: Disneyland's DIS, +1.53%  Main Street USA was modeled after Fort Collins. These are the Top 100 Best Places to Live in America in 2019 Read the original article on Livability."}]}