{"article": [{"url": "https://www.marketwatch.com/story/trump-claims-he-has-authority-to-issue-executive-order-on-mail-in-ballots-2020-08-03", "published": 1596485240.0, "headline": "Trump claims he has authority to issue executive order on mail-in ballots", "body": "WASHINGTON — President Donald Trump claimed Monday that he has the authority to issue an executive order on mail-in ballots, whose increasing use, he argues, could increase election fraud and uncertainty, though it is is unclear what he could do to curtail the practice. “I have the right to do it,” Trump told reporters at a White House press conference. “We haven’t gotten there yet, we’ll see what happens.” Trump added that Republicans are planning to file suit as soon as Tuesday to try to block Nevada’s expansion of mail-in voting. Nearly all election procedures are governed on a state-by-state basis, with the remainder set by Congress or enshrined in the Constitution. There is no precedent or apparent authority for Trump to try to curtail the use of mail-in ballots by executive order, though he could use a document to formalize his opposition to the practice. Trump’s claimed authority comes days after he publicly floated a delay to the Nov. 3 presidential election, a notion was met with swift bipartisan blowback. Trump has increasingly sought to cast doubt on November’s election and the expected pandemic-induced surge in mail-in and absentee voting — particularly as he has found himself trailing in public and private polling. Trump has called remote voting options the “biggest risk” to his reelection. His campaign and the Republican Party have sued to combat the practice, which was once a significant advantage for the GOP. There is no evidence of widespread voter fraud through mail-in voting and the states that use it exclusively say they have necessary safeguards in place to ensure that a hostile foreign actor doesn’t disrupt the vote. Election security experts say voter fraud is rare in all forms of balloting, including by mail. In addition to his claims of fraud, Trump argued that voting by mail would delay the determination of the election’s victor, noting that the winner of a New York Democratic congressional primary vote conducted by mail weeks ago remains undeclared. Trump said he believes that race would need to be “rerun.” Trump claimed the challenge would be greater in a presidential election, where the Electoral College could come down to just one state, and some states allow mail-in ballots to be received up to a week after Election Day. “You’ll never know who won that state,” Trump said Monday of Nevada’s expansion of mail voting."}]}