{"article": [{"url": "https://www.marketwatch.com/story/consumer-sentiment-backslides-in-july-as-new-coronavirus-outbreak-alarms-americans-2020-07-17", "published": 1594985180.0, "headline": "Consumer sentiment backslides in July as new coronavirus outbreak alarms Americans", "body": "The numbers: The fresh surge in coronavirus cases sapped the confidence of Americans in early July, pointing to a potentially slower economic recovery from the pandemic or even a longer recession, according to a closely followed survey of consumer sentiment. The early reading of the consumer-sentiment survey in July fell to 73.2 from 78.1 last month, the University of Michigan said Friday. Final results for July will be released in two weeks. The index has fallen close to a pandemic low, erasing almost all the gains in the prior two months. Read:Soaring demand for federal jobless benefits points to fresh fissures in the economy What happened: The reopening of the U.S. economy helped buoy spirits in May and early June, but the recent rise in cases could be a big setback. California this week shut down large parts of its economy again. An index that measures how consumers feel about the economy right now slid to 84.2 from 87.1. Another part of the survey that looks six months ahead slipped to 66.2 from 72.3. That’s just slightly above April’s 65.9 reading during the height of the pandemic. “Unfortunately, declines are more likely in the months ahead as the coronavirus spreads and causes continued economic harm, social disruptions, and permanent scarring,” said Richard Curtin, the chief economist of the sentiment survey. See:Marketwatch’s Coronavirus Economic Recovery Tracker. Big picture: The influx of new coronavirus cases in California, Texas, Florida and other states threatens to derail a recovery and rob the economy of the momentum it built up in May and June as the U.S. loosened restrictions on businesses and consumers. The expiration of extra federal jobless benefits at the end of July may also be weighing on the minds of consumers. Congress is likely approve more relief measures, but a temporary $600-a-week unemployment benefit might be reduced. While the reopening of New York, New Jersey and other hard-hit states where the virus is slowing will help limit the damage, it may not be enough to prevent the U.S. economy from sinking back into a malaise. The virus has to be brought under control, economists says, before a sustained recovery can take place. Read:Jobless claims fall again, but layoffs might rise soon amid new coronavirus wave What they are saying? “Recent signs are not good, and until there is strong, coherent leadership from every level of government that is based on science and facts, and individuals take steps to prevent spread of the virus (wearing a mask when out in public being the most important), the outlook is perilous,” said chief economist Joshua Shapiro of MFR Inc. in a note to clients. Market reaction:The Dow Jones Industrial Average DJIA, +0.56% and S&P 500 SPX, +0.87% turned lower in Friday trades after the decline in consumer sentiment."}]}