{"article": [{"url": "https://www.marketwatch.com/story/these-states-are-loosening-economic-shut-down-orders-texas-expected-to-announce-new-rules-soon-2020-04-23", "published": 1591885100.0, "headline": "U.S. states slowly reopen after coronavirus lockdowns - some now permit visits to nursing homes", "body": "Some U.S. states are beginning to once again allow visits to nursing home residents, around three months after they were halted to stop the spread of the coronavirus pandemic, but the visits are often outside and always with social distancing. West Virginia on Wednesday said visitation by appointment can begin June 17, if the nursing home has had no cases of COVID-19 for at least the past 14 days. Massachusetts and Indiana, for example, already allow visits, only outside, and Ohio this week began allowing visits in assisted-living and intermediate-care facilities. In many other states, families often resort to visits through windows. Reopening hard-hit nursing homes is one of the biggest challenges facing health officials, along with reopening schools in the fall. At least a quarter of the country's coronavirus death toll is nursing home residents, according to data compiled by the Centers for Medicare and Medicaid Services and the Centers for Disease Control and Prevention. Some 60,000 cases of illness have been reported, and nearly 26,000 of those residents died. Read:Why some nursing homes did better in protecting residents from coronavirus States otherwise have generally allowed many businesses to reopen, each at their own pace. The New York area, the part of the U.S. hardest hit by the coronavirus outbreak, has been among the slowest, but even there, many more will be open within the next week. In New York state, all but New York City is now in the state's \"phase 2,\" where offices, outdoor dining, in-store retail, barbershops and hair salons, among other businesses, are allowed to resume. In New York City, restaurants can only offer takeout and delivery In New Jersey, outdoor dining and in-store shopping will be allowed on June 15, with restrictions. Already, outdoor gatherings of 100 people are now allowed; indoor gatherings can be 50 people if that equals no more than 25% of a building's capacity. Connecticut will allow indoor dining and recreation, personal services like nail salons, hotels and amusement parks, among other businesses, to reopen on June 17, also with restrictions. Gov. Ned Lamont says about 95% of the state's economy will then be in business. Read:Fauci calls pandemic his 'worst nightmare,' warns 'it isn't over yet' That puts even more focus on how quickly consumers will resume their old lives - or whether they remain restrained in their spending. Read:See how quickly the coronavirus can spread in a restaurant in this stomach-churning black light video Delta Air Lines DAL, +0.39%  said it has added 100 flights to its domestic schedule in June, and plans to add more in September. Data from the Transportation Security Administration show the number of people flying continues to rise, but the recent high of 430,414 is well below early June levels of last year that topped 2.6 million on some days. Gap GPS, -0.10%  said reopened stores are already generating 70% or more of last year's sales. Planet Fitness PLNT, +2.61% has said that among gyms that are back in business, membership levels and visits are consistent with last year. But CBL & Associates Properties, which owns 63 malls, warned of \"substantial doubt that it will continue to operate as a going concern.\" Movie theater operator AMC Entertainment Holdings AMC, -2.17% warned Wednesday that \"substantial doubt exists about our ability to continue as a going concern for a reasonable period.\" Among theme parks, SeaWorld Entertainment SEAS, +3.04% has said it will reopen two Tampa-area theme parks on June 11. Universal has already reopened in Orlando. Read:How to deal with coronavirus risks in a public bathroom See:More consumers are willing to head back to stores than to dine out at restaurants, S&P Global finds Also:Restaurant bookings have fully recovered in Germany in a sign that activity rebounds quickly as lockdowns ease As has been the case since reopening measures began more than a month ago, states are developing their own rules on everything from what can open and under what capacity constraints to the size of gatherings to when face coverings are required. Both Maine and Alaska are waiving its 14-day quarantine rule for visitors if they can show they have been tested for coronavirus. Read:How to stay safe from coronavirus in a public bathroom With other states much further along in easing restrictions than New York's tri-state area, some of the millions of people laid off since mid-March have been rehired, although the unemployment rate remains in double digits. The U.S. reported an unexpected drop in the unemployment rate for May, the first full month in which states began reopening their economies. Amid other signs that the economy is starting to dig itself out of a deep hole, the Institute for Supply Management's services-focused survey of nonmanufacturing companies rose to 45.4% in May from 41.8% in April and a separate report showed faint signs of revival for manufacturing. Read:Idaho could offer $1,500 bonus to people who return to work Still unclear is how schools will reopen in the fall. Here's what some states have announced: New York: Almost all of the state is now in \"phase 2,\" where outdoor dining, in-store retail, barbershops and hair salons can reopen; Long Island is the latest, doing so on June 10. Only New York City is in \"phase 1,\" where \"low-risk\" businesses like construction and manufacturing could reopen on June 8. Retailers can offer curbside pickup. New York City may reach \"phase 2\" in early July, its mayor says. Dentists across the state were allowed to reopen on June 1. Summer day camps can reopen statewide on June 29. Ohio: Zoos, outdoor playgrounds, museums and indoor movie theaters, among other businesses, will reopen June 10. Amusement parks and casinos reopen June 19. Indoor dining in restaurants was allowed to resume May 21, with restrictions, less than a week after restaurants and bars were allowed to reopen outside. Offices, warehouses, manufacturers and construction companies reopened May 4. Retailers and service businesses could reopen on May 12. Hair and nail salons reopened on May 15. California: Counties can allow wineries, movie theaters, gyms, hotels, campground and some other businesses to reopen beginning June 12 as part of \"stage 3\" in its reopening plan. Hair salons and dine-in restaurants are already open in some parts of the state. In \"stage 2,\" retails businesses, offices and child care, among others, were allowed to reopen with restrictions Maine: The state is moving up the reopening for bars and tasting rooms in 13 rural counties to June 12, from July 1, though they are limited to outdoor service. Gyms also can reopen then. This does not include the three southernmost counties where most people live. Barber shops, hair salons and pet groomers reopened as of May 1, as well as drive-in movie theaters, car dealers and outdoor recreation. Limited drive-in, stay-in-your-vehicle religious services are allowed. Retailers and restaurants in more rural, counties began reopening on May 8, and the three southern counties followed on June 1. Campsites opened to Maine residents for Memorial Day weekend. All those coming to the state must quarantine for 14 days. Indiana: Most of the state is moving to \"phase 4\" of its reopening plan on June 12, two days ahead of schedule. Bars, amusement parks, movie theaters, museums and large venues, among other businesses, can open with restrictions, and offices can be staffed at full capacity. Gatherings of up to 250 people will be allowed, up from 100 people beginning May 22, when the state moved to the next phase of its reopening plan in all but three counties. Capacity limits on retail stores, which had begun to reopen on May 4, will be lifted on June 12. Restaurants, gyms, swimming pools and campgrounds have already opened with restrictions. Recreational sports practices can begin. Michigan: Hair and nail salons, barber shops, tattoo parlors and other personal-care businesses can begin reopening June 15. Nonessential medical procedures resumed May 29. Retailers, including those inside malls, could begin reopening on May 26 by appointment only. Bars and restaurants in Northern Michigan and the Upper Peninsula regions - 7.5% of the state's population - could reopen May 22 at 50% capacity and with other restrictions. Manufacturers were allowed to reopen on May 11 after certain safety measures have been put in place. Real-estate showings have resumed. Boating and golf also are allowed. Gyms and movie theaters remain closed. New Jersey:Outdoor bar seating has been added to businesses that can reopen on June 15. The list already includes outdoor dining and indoor shopping at nonessential retail stores, with restrictions (curbside pickup was allowed as of May 18). Child-care services have already been allowed to reopen that day. Salons and barber shops can follow on June 22. Pools also can open then. Outdoor sports practice will be allowed as on June 22, and day camps can reopen on July 6. Amusement parks and arcades remain closed. Outdoor gatherings can now be 100 people, indoor gatherings can be 25 people, and the stay-at-home order has been lifted. The Jersey Shore beaches reopened on May 22, with local governments deciding how many people are allowed at a time. iframe.twitter-tweet { width: 100% !important; } Connecticut: The state's \"phase 2\" takes effect June 17 and will mean 95% of the economy is open, according to the governor. Indoor dining and shopping will be allowed with restrictions, and hotels can reopen, among other businesses. Outdoor restaurant seating resumed on May 20, with limits. Offices and retailers also could reopen then, as could campsites plus outdoor areas in zoos and museums. Summer camps will reopen June 29. State campgrounds open July 8. Anyone traveling to the state should continue to self-quarantine for 14 days. Minnesota: The state moved into its \"phase 3\" on June 10. Restaurants and bars could open for indoor service with restrictions, and movie theaters, gyms and pools also were allowed to open. Massachusetts: In-store shopping and outdoor restaurant dining were allowed to resume on June 8 as the state moved to \"phase 2\" of its reopening plan. Child-care facilities and day camps and pools, among other businesses, were also allowed to open with restrictions. Nursing home visits were allowed beginning June 3. Boston office spaces were allowed to open on June 1. Manufacturing, construction, houses of worship and some medical treatments were allowed to reopen on May 18 with restrictions. On May 25, hair salons, curbside pickup for retailers, office spaces outside Boston and some recreation, including beaches, could resume. Washington: Seattle-area restaurants could begin offering limited indoor dining on June 5. Retailers, hair and nail saloons, tattoo parlors and some other businesses also were allowed to reopen with restrictions in what is called a \"modified phase 1\". The state moved to reopening on a county-by-county basis on June 1, and 34 of 39 counties have permission to reopen in some way. Dentists reopened on May 18. Elective medical procedures also are allowed. Read:Here's why you should still wear a face mask in church Texas: The state moved into its \"phase 3\" on June 3, which allowed more businesses to operate at 50% capacity and allowed some amusement parks to open. Restaurants, which were first allowed to offer indoor searing on May 1, can move up to 75% capacity on June 12. Bowling alleys, bingo halls, rodeos and some other recreational options were allowed to reopen on May 22.Child care, tattoo parlors, gyms, offices and some other businesses were allowed to reopen May 18. Day camps, overnight youth camps and pro sports minus the fans could start up on May 31. All retail stores, malls, movie theaters, libraries and museums reopened on May 1, and hair and nail salons were allowed to reopen May 8. Florida:Indoor bars, movie theaters, concert halls and arcades could open on June 5 at 50% capacity and with other restrictions across most of the state (Miami-Dade, Broward and Palm Beach counties, the state's most populous and where the most coronavirus cases have been reported are not included). Tattoo parlors and tanning salons also can reopen, and capacity limits will be lifted on other businesses, including restaurants and retailers. Theme parks are beginning to reopen; Universal Orlando is the first major one to open its doors. The Florida Keys lifted checkpoints keeping out visitors on June 1, and hotels there are now allowed to open at 50% capacity. Florida continues to require those coming from New York, New Jersey and Connecticut to self-isolate or self-quarantine for 14 days. Read:What Disneyland and Walt Disney World could be like when they reopen after coronavirus shutdowns Pennsylvania: The Philadelphia area moved into the state's \"yellow phase\" on June 5, the same day even more counties moved into the \"green phase.\" Philadelphia and nine other counties now allow offices, manufacturing and retail to open then. The state's \"yellow\" rules have allowed retail stores and child-care facilities to reopen and in-person church services to resume. Indoor restaurants and bars as well as hair and nail salons, among other businesses, are allowed to open in the green phase with some restrictions, which now covers 34 counties. Gatherings of up to 250 people are allowed, rather than just 25. Virginia: Most of the state moved to \"Phase 2\" on June 5 (with northern Virginia and Richmond remaining in Phase 1). The new rules will allow indoor dining. Pools, indoor gyms and museums also can reopen with restrictions. Group gatherings of up to 50 people will be allowed. The state already allows nonessential retail businesses to open at 50% capacity and restaurants to offer outdoor dining, also with restrictions, beginning May 15. Religious services could resume at 50% capacity, as well. . Louisiana: Most of the state moved to its \"Phase 2\" on June 5 - but New Orleans will not. Bars and tattoo parlors can reopen; restaurants will be allowed to operate at 50% capacity instead of 25%. Nonessential retail businesses, casinos and some other were allowed to open in May. Amusement parks are among the businesses that remain closed. Kentucky: Museums, outdoor attractions, distilleries and libraries could reopen on June 8, with limits. State park campgrounds follow on June 11, and child-care facilities and day camps can reopen on June 15. Bars are expected to reopen on June 29. In May, government offices, indoor and outdoor dining, hair and nail salons, tanning salons and retailers, among other businesses were allowed to reopen with restrictions under the state's reopening plan. Movie theaters, fitness centers and yet more businesses could reopen on June 1. Illinois: Chicago followed the rest of the state on June 3 in allowing outdoor restaurant seating in the state's third phrase of reopening on May 29. Hotels and retailers also reopened there. Nonessential businesses (including barbers and hair salons) and manufacturers as well as state parks reopened in most of the state on May 29 as part of that third phase. Elective surgeries have resumed. Also see: Track all of MarketWatch's latest coronavirus news here Nevada: Casinos could reopen June 4. Bars, gyms and other nonessential businesses could reopen May 29, with restrictions. Restaurants and retailers could reopen at 50% capacity on May 9, and hair and nail salons were allowed to reopen with restrictions. Events with live audiences, strip clubs and brothels remain closed. Indoor gatherings are limited to 50 people, and in-person religious services have resumed. Rhode Island: Indoor dining and bars resumed June 1 at 50% capacity and with other restrictions (outdoor dining was allowed on May 18) as the state entered its \"phase 2\" of reopening. Hair salons, barber shops, tattoo shops and massage therapy are also allowed with restrictions. Gyms and malls could reopen, and stores, which were allowed to reopen on May 9, can allow in more customers. Indoor services of worship can resume at 25% capacity. were allowed to reopen. Youth sports can resume. Offices can bring back one-third of their employees. People can socialize in groups of 15, up from five. Quarantines of 14 days are now only required for those coming from places with stay-at-home orders. Nebraska: Bars in 89 of 93 counties reopened on June 1, with restrictions. Rodeos resumed June 1 statewide, and some sports practices can too. Competitions can resume June 18. Concerts of up to 3,000 people also are allowed, but only with approvals. Restaurants, hair and nail salons, tattoo parlors, dentists and other businesses were allowed to reopen in May.. Vermont: Gyms, nail salons, spas and other \"interior maintenance\" businesses could reopen on June 1, and the size of social gatherings can increase to 25 from 10. Hair stylists and barbers could reopen May 29, with restrictions. An announcement about indoor dining is expected in the next week; outdoor dining with restrictions has been allowed since May 22. Hotels, B&Bs and campgrounds also were allowed to reopen on May 22 with restrictions. But out-of-state visitors must still self-quarantine for 14 days. Retail stores were allowed to reopen on May 18 after operating with curbside pickup and delivery services since late April. Crews of no more than two were allowed to resume outdoor work and construction in unoccupied buildings beginning April 20. Read:NYC's Phase 1 reopening could send up to 400,000 employees back to work Maryland: The final two counties moved into \"phase one\" of the state's reopening on June 1, which allowed hair salons, some retailers and other nonessential businesses to reopen. In other parts of the state, restaurants could offer outdoor dining with restrictions on May 29 as the state moves into the second phase of its reopening. Pools and day camps also can open. Retailers and other nonessential businesses were allowed to reopen at 50% capacity on May 15, as were places of worship. Hair salons are open by appointment only. Hospitals and other health-care providers were allowed to resume elective and nonemergency procedures on May 7. Read:Is your hair salon or barbershop reopening? Be ready to pay COVID-19 fees, wash your own hair and skip the chitchat with your stylist Iowa: Casinos and amusement parks could reopen on June 1, and live outdoor performances can resume then as well, all with restrictions. Bars were allowed to reopen with restrictions on May 28. Local governments vary widely in their reopening plans. Restaurants, stores and shopping malls as well as some other businesses were allowed to reopen in 77 of the state's 99 counties beginning May 1 but at no more than 50% capacity. Among the counties that didn't immediately reopen are those home to the state's largest cities, including Des Moines, Cedar Rapids, Davenport, Sioux City and Iowa City. Montana: The state entered the second phase of its reopening on June 1, allowing retail stores, restaurants and bars to operate at 75% capacity with social distancing. Gyms and pools also will be open with the same restrictions. Concert halls also will be able to open with restrictions. The 14-day self-quarantine rule for out-of-state visitors also will disappear then. The state reopening began on April 26 with churches, followed by retail stores a day later. Dine-in restaurants and bars were allowed to reopen on May 4 with 50% capacity. Idaho: Almost all remaining businesses, including bars and movie theaters, could reopen on May 30. Retail stores and houses of worship were allowed to open May 1. Day cares and youth events could restart as well. Bars, restaurant dining rooms, hair salons and indoor gyms were allowed to reopen on May 16. Colorado: Indoor dining resumed on May 27, with restrictions, and summer day camps can open June 1. Bars that don't serve food remain closed. Business across much of the state, including hair and nail salons as well as dental and other elective medical services, reopened on May 1 under certain conditions, and Denver followed on May 8. Real-estate agents were allowed to start showing homes again on April 27, though open houses are not allowed. Offices could reopen on May 4 with 50% of staff and with social distancing, although Gov. Jared Polis said people should continue working from home if possible. Read:Health official quits after being pushed to reopen Colorado county and hot-spot meat plant Kansas: Gov. Laura Kelly says county health officials can now decide when to allow more businesses to open and how large gatherings can be. Movie theaters and non-tribal casinos are among the businesses that could reopen on May 22, while bars and swimming pools stayed closed. Dine-in restaurant service resumed on May 4 with tables of no more than 10 people and distancing between tables. Houses of worship will be allowed to hold services with more than 10 people, but with social distancing. Child-care facilities and libraries can operate. Alaska: All businesses could fully reopen on May 23 as the state simultaneously implements its third and fourth phases. The state had taken the first moves toward reopening in late April. The state will exempt travelers who have been tested for coronavirus from its 14-day quarantine rule. North Carolina: Restaurants, hair and nail salons, tattoo parlors and other personal-care businesses could reopen at 50% capacity as of May 22, with restrictions. Pools and camps also can reopen. Bars, gyms and indoor entertainment venues remain closed. The state will now suggest no more than 25 people at outdoor gatherings and only 10 when indoors. Houses of worship are exempt from the guidance. Some nonessential businesses were allowed to reopen on May 8 at 50% capacity. Read:The future of successful coronavirus response: Mass testing at work and in church and self-administered tests West Virginia: The state moved into its \"Week 4\" reopenings on May 21 and will start allowing indoor restaurant seating at 50% capacity. Large retailers will be allowed to open. Rentals of kayaks, boats, bicycles and other outdoor recreation equipment can resume then too. Outdoor guided fishing and rock climbing is allowed as of May 15. Hair and nail salons have already been allowed to reopen. Low-contact youth sports can return on June 8. Indiana: Gatherings of up to 100 people are allowed beginning May 22, when the state moved to the next phase of its reopening plan in all but three counties. Capacity limits on retail stores, which had begun to reopen on May 4, can operate at 75% capacity. Gyms, swimming pools, campgrounds and movie theaters also can reopen with restrictions. Recreational sports practices can begin. Bars remain closed. Marion County, where Indianapolis is based, Lake County in northwest Indiana and Cass County, where a meatpacking facility is based, loosen on June 1. Gov. Eric Holcomb has said he aims for businesses to be fully open on July 4 and conventions, sports events, fairs, festivals and the state fair to be allowed, all with social distancing. Face coverings would be optional. Hawaii: The state has allowed \"low-risk\" businesses to open and aims to gradually allow medium-risk businesses such as churches, gyms, museums, theaters, restaurants and hair salons to begin operations in June. No dates have been set. Gov. David Ige has said the 14-day quarantine for travelers from outside the state will extend beyond June 30. Wisconsin: The state's Supreme Court struck down the state's stay-at-home rule late on May 13, essentially reopening businesses in the state immediately and lifting limits on the size of gatherings. Local governments can still impose their own rules, and schools remain closed, but the move catapulted the state into the ranks of the most open in the country. Oregon: Bars, restaurants, malls, salons and gyms have been allowed to reopen in most counties on May 15 but with restrictions. Arizona: Casinos began reopening on May 15, bookending a week in which restaurants began opening for dine-in service on May 11. Elective surgeries resumed May 1, while retailers could offer curbside service as of May 4 and open stores to customers on May 8. Barbershops and salons were allowed to reopen on May 8 as well. The state's stay-at-home order will expire on May 15. Major-league sports could resume May 16, but without fans. The state no longer mandates two-week self-quarantines for all those who arrive from an area with substantial community spread, including but not limited to New York, New Jersey and Connecticut. Read:Treating a typical coronavirus infection is four times the cost of a case of the flu South Carolina: Restaurants were allowed to reopen with limited indoor seating on May 11. Boating restrictions were also lifted. The state was one of the first to loosen restrictions. Stores selling furniture, clothing, sporting goods, books and flowers, among other retail categories, as well as department stores and flea markets, were allowed to reopen on April 20 at no more than 20% capacity and with social distancing. Beaches began reopening on April 21. Missouri:Businesses were allowed to reopen on May 4, though metro areas can impose stricter rules. There also will be no limit on the size of gatherings. With live events allowed, shows in Branson, a resort town in the southwest part of the state, will be back in business, although the state says social distancing is expected between families or individuals. New Hampshire: The state has issued guidelines for allowing outdoor weddings and summer camps. Restaurants could begin offering outdoor dining on May 18 with restrictions; seated indoor dining won't be allowed.Elective medical procedures gradually resumed on May 4. Retailers were allowed to reopen May 11 at 50% capacity. Hair salons and barber shops also could reopen then, with certain restrictions. The same goes for golf courses. Read:Your genes could determine whether coronavirus puts you in the hospital - and we're starting to unravel which ones matter Tennessee:Most businesses reopened May 1. Restaurants were able to open for dine-in services at half-capacity starting April 27. Retail stores could open on April 29. Capacity restrictions were lifted on May 22. Larger attractions may be allowed to reopen then, but social gatherings are still limited to no more than 10 people. Counties with their own health departments, which include those that are home to Memphis, Nashville and Knoxville, plan their own reopen strategies. Read:Coronavirus survives longer airborne and travels further in these public spaces - here's where to be extra careful Alabama: All retail businesses were allowed to reopen at 50% capacity beginning May 1. Restaurants, gyms, hair salons and churches reopened on May 11 with some restrictions. Bars face some added restrictions. Elective medical procedures can resume. Beaches are open. Oklahoma: Weddings, funerals and organized sports were allowed to resume on May 15 under the second phase of the state's reopen plan, and bars were allowed to reopen. The plan aims to allow summer camps to open on June 1. Sit-down restaurants, movie theaters, sporting venues and gyms were allowed to reopen on May 1 with social distancing. Places of worship can reopen for in-person services if they leave every other row or pew open. Hair salons, barber shops, nail salons, pet groomers and spas were allowed to reopen earlier with social distancing, if they aren't in communities with their own restrictions in place. State parks and outdoor recreation areas also can reopen. Read: Companies reveal their plans for what work will look like when America returns to the office Georgia: Gyms, hair salons, bowling alleys and tattoo parlors were allowed to reopen on April 24 with social-distancing and hygiene requirements. Hospitals can resume elective surgeries. On April 27, movie theaters were allowed to reopen, and restaurants can offer limited dine-in service. Mississippi:Retail stores were allowed to reopen on April 27 with limits on the number of customers, and gyms, hair salons and restaurants were allowed to reopen on May 11. Casinos reopened May 22. Read:Coronavirus is 'a silent disaster' for rural Southern states Also:'These kids have been isolated socially and educationally': Will kids across America have to cancel camp this summer?"}]}