{"article": [{"url": "https://www.marketwatch.com/story/half-of-americans-over-55-may-retire-poor-2020-10-01", "published": 1601905400.0, "headline": "Half of Americans over 55 may retire poor", "body": "How badly is COVID-19 hurting Americans on the cusp of retirement? Maybe worse than we thought. In an interview, economist Teresa Ghilarducci, a professor at The New School in New York City and one of the nation’s leading experts on retirement, told me that half—that’s right, half—of Americans aged 55 and up will retire in poverty or near poverty. Read: Should you change your investments because it’s an election year? “Our data is showing that, because of the COVID recession, about 50% of workers over the age of 55 will be poor or near-poor adults when they reach 65,” she said. 80% of older Americans can't afford to retire - COVID-19 isn't helping How poor is that? “A person who’s 65 will be near-poor or poor if they’re living on less than $20,000 a year,” she told me. “I think we could all agree that means chronic deprivation for the rest of your life.” This is shocking and although I’ve viewed the retirement situation in the United States as more of a chronic illness than a crisis, this would make it a crisis for millions of Americans. It also would reverse decades of progress toward eliminating poverty among the elderly, from the Social Security Act of 1935 through Medicare in 1965 and beyond. As more people turn 65 and face poverty-stricken retirements, the fiscal and political implications could be enormous. Read: Social Security missteps could push millions of Americans into poverty What’s behind this? People losing their jobs and health insurance because of COVID-19? Or losing the employer match on their 401(k) contributions? Or having to tap into retirement savings to cover daily expenses? “All of the above,” said Ghilarducci. But it starts with job losses. “Older workers are losing their jobs at a faster rate, relative to younger people and relative to where they had been before than they were in the Great Recession,” she told me. Read: Hope to retire someday? See if you can answer these 6 simple questions Unfortunately, many of those job losses will be permanent, she fears. A report done by the New School Retirement Equity Lab found that over half of older unemployed workers may be forced into involuntary retirement. Nearly three million older workers have left the labor force since March and if the economic disruptions caused by COVID-19 continue, another million could join them soon. “A total of four million people potentially pushed into retirement before they are ready will increase old-age poverty and exacerbate the recession,” Ghilarducci and her colleagues wrote. Read: Today’s older workers may see the first cuts to Social Security For older workers, job losses can have cascading effects on their personal finances. “When older workers lose their jobs, they lose access to savings. They lose their employer’s contribution, and they face the temptation of drawing down their retirement assets,” she told me. And while we’re on the subject of employer contributions, guess what? “Employers have changed their behavior,” she said. “In 2009, 20% of employers stopped contributing to the 401(k). But now over 50% of employers have stopped contributing to the 401(k). They learned they could get away with it.” Read: Employers start to suspend the 401(k) match That’s a big blow to employees who count on those contributions to help them build their retirement nest eggs. Some studies have shown employer matches induced more employees to contribute to their 401(k) plans. Without those matches, they might not contribute at all. “We’re inferring from these practices and past behavior that people have stopped saving for their retirement,” Ghilarducci told me. Even worse, they may feel compelled to tap into their retirement savings to pay the bills. Until now that number has been pretty small—2% of people with retirement accounts at Vanguard and 3% at Fidelity withdrew money from those accounts through June. And the CARES Act removed the 10% penalty on withdrawals up to $100,000 from those accounts for people under 59½. It also allows them to pay back the money over a three-year period without having their withdrawals recognized as income for tax purposes. Read: The simplest way to cut your tax bill — even if your name isn’t Trump But if a new wave of COVID-19 prompts a new wave of layoffs, more people may draw down those savings, meeting their present needs at the expense, perhaps, of their future retirement security. Most vulnerable now: people in their late 50s suffering permanent job losses but too young to collect Social Security or Medicare. Millions of people could fall between the cracks. Ghilarducci recommends if you’re working now, to build up a six-month emergency fund—pronto. “Make sure that the money piling up in your checking account isn’t there for pent-up demand for your car or your clothes,” she said. If an employer dropped its 401(k) match, she recommends you cover it anyway, if you can. And “don’t quit your job. If you’re older and you’re afraid of the virus, get a hazmat suit,” she said. Has it really come to this—people being forced to choose between their physical and financial health? That’s what the virus and the reaction to it have wrought, and millions of people may have to live with the financial aftershocks for years to come."}]}