{"article": [{"url": "https://www.marketwatch.com/story/i-didnt-get-my-stimulus-check-because-i-owe-back-child-support-its-not-fair-my-stepchildren-rely-on-me-what-can-i-do-2020-07-16", "published": 1595105720.0, "headline": "I didnâ\u0080\u0099t get my stimulus check because I owe back child support. Itâ\u0080\u0099s not fair. My stepchildren rely on me â\u0080\u0094 what can I do?", "body": "Dear Moneyist, Stimulus checks should not be taken for back child support. Not all people who donâ\u0080\u0099t pay or are behind on child support are deadbeat parents. Sometimes sâ\u0080\u0094 happens in life and we are forced to miss payments due to various reasons: losing a job, family emergencies, health reasons, etc. There are legitimate reasons why some parents canâ\u0080\u0099t pay. Everyoneâ\u0080\u0099s situation is different. I was unemployed for a year. Up until that happened, I paid on time every month for six years. As soon as I got back to work, I started paying again. So I got back on track and continued to make payments for three years consecutively, and I was on time every month. I switched jobs and missed several months. Once I got back on track, the payments started. Iâ\u0080\u0099m currently making payments and Iâ\u0080\u0099m current for the last year. I went to court to address the back support; we agreed I would pay an extra $50 a month until the $16,000 in back support is paid. Related: â\u0080\u0098Iâ\u0080\u0099m astounded that I have NOT received my paymentâ\u0080\u0099: When will I receive my stimulus check? Out of 11 years of paying child support, Iâ\u0080\u0099ve missed 1.5 years. So I feel like it is unfair for the government to take my stimulus check. My girlfriend of seven years is a dialysis patient and on disability; she has two kids from a previous marriage. They call me Dad and I take care of them. Sheâ\u0080\u0099s not working because of health reasons, so Iâ\u0080\u0099m the one supporting us. Luckily, Iâ\u0080\u0099m still working and my job is considered â\u0080\u009dessential.â\u0080\u009d I was really counting on that to help us out. Iâ\u0080\u0099m doing the right thing. I am trying to get back into the black. After all, something is better then nothing. Whatâ\u0080\u0099s your take on this situation? I know there must be a lot of people who are really upset like me and were really counting on the $1,200 stimulus payment to provide for their families. I sure hope that I will receive the next stimulus check if one gets approved. Fed Up and Sick of the Bureaucracy Dear Fed Up and Sick, Life isnâ\u0080\u0099t fair. Once we accept that salient fact, the rest should â\u0080\u0094 in theory â\u0080\u0094 be a doddle. The pandemic isnâ\u0080\u0099t fair. Millions of hardworking people losing their jobs because of a pandemic that started thousands of miles away, in a food market in Wuhan, China is not fair. Your former wife and children not receiving their child support is not fair. Your receiving no stimulus check because you lost your job, let's assume, is not fair. Your stepchildren doing without is not fair. And the 583,450 people who died alone from COVID-19? That too is not fair. None of this is fair. So how does one assess your situation? You shoulder a lot of responsibility. Your girlfriend is on dialysis, and you have been on top of your child support when you were working full time. I donâ\u0080\u0099t know whether you could have set money aside every week. I assume you did the best you could. To answer your question, I only need to shift the perspective. Take a moment to sit in your former wifeâ\u0080\u0099s chair at her kitchen table, or step into your childrenâ\u0080\u0099s shoes. I imagine they donâ\u0080\u0099t think itâ\u0080\u0099s fair that your child support payments never arrived when they were supposed to. Related:I told my family I boycott Chick-fil-A over its support of anti-LGBTQ causes â\u0080\u0094 now they â\u0080\u0098likeâ\u0080\u0099 it on Facebook and go there for lunch The pandemic presents an opportunity for you to take responsibility for the unpaid child support and to help your biological children. They too probably had to do without lots of things while you were out of work. This $1,200 is an obvious way for you to make some progress in paying off this debt. Your biological children are your No. 1 financial priority as a father. At least, they should be. Whether or not you agree, the law ensures that you must pay them first. If you truly believe this situation isnâ\u0080\u0099t fair on you, it makes me wonder: Who is the adult in this situation â\u0080\u0094 and who is the child? Child support is a very emotive issue, so I want to be 100% clear. I am not saying you are a deadbeat dad. You can be a father and carer of your partnerâ\u0080\u0099s children who falls behind on payments, and be a good guy who does his best to keep the show on the road. All of those things can be true. However, it would have been more heartening to read an acknowledgment that your children too are missing out when those child-support checks stop coming. They too are living through a pandemic. In the meantime, I wish you and your family â\u0080\u0094 all of your family â\u0080\u0094 the very best of everything. You can email The Moneyist with any financial and ethical questions related to coronavirus at qfottrell@marketwatch.com Want to read more?Follow Quentin Fottrell on Twitterand read more of his columns here Would you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link. Hello there, MarketWatchers. Check out the Moneyist private Facebook FB, +0.26% Â group where we look for answers to lifeâ\u0080\u0099s thorniest money issues. Readers write in to me with all sorts of dilemmas. Post your questions, tell me what you want to know more about, or weigh in on the latest Moneyist columns."}]}