{"article": [{"url": "https://www.marketwatch.com/story/california-set-to-approve-new-rules-forcing-automakers-to-sell-more-electric-trucks-2020-06-25", "published": 1593115400.0, "headline": "California approves first-of-its-kind rules forcing auto makers to sell more electric trucks", "body": "SACRAMENTO, Calif. — California regulators approved new rules on Thursday that would force automakers to sell more electric work trucks and delivery vans, a first-of-its-kind rule aimed at helping the nation’s most populous state clean up its worst-in-the-nation air quality. The rules require a certain percentage of work truck sales each year to be zero emission vehicles. By the time its fully implemented in 2035, the board estimates at least 20% of the 1.2 million trucks on the road would run on electricity and that it would create thousands of new jobs. Over 100 people called into the California Air Resources Board’s meeting Thursday, mostly offering their support during hours-long public comment. Dozens said their neighborhoods were choking on air pollution from diesel fuel, particularly threatening the lung health of poor and minority communities, which has gained more prominence amid the coronavirus pandemic. Supporters included a group representing environmental agencies from eight states in the Northeast, from New York to Maine, whose officials said it would create a road map for reducing emissions on trucking routes and propel the market toward electrification. “It’s the only way we think we can make significant progress on the most stubborn air pollution problems,” said Mary Nichols, chair of the board. “This will have a really transformational impact not just in our state but around the world when people see that it can be done.” Regulators said they were determined to quickly address fears electric trucks would go unsold, aiming to establish rules next year that would require companies to purchase zero emission trucks from manufacturers, meant to ensure there is demand for the supply. The Truck and Engine Manufacturers Association argued the new rule would eventually “collapse” because there are not enough charging stations. “They cost more than traditional fuel trucks, because there’s no charging infrastructure and developing one is very expensive,” Jed Mandel, president of the association, said during public testimony. “And there is inadequate incentive funding available.” Meanwhile, a representative for Tesla TSLA, +1.89% , which is preparing electric pickup truck and semitruck models for production in 2021, endorsed the measure. “Charging infrastructure can and will be built,” said Andy Schwartz, a policy advisor at Tesla. Work trucks and delivery vans, while just a small fraction of all vehicles on the road, are some of the largest sources of air pollution in the transportation sector. They travel many more miles than passenger vehicles and often have diesel engines, which are more powerful but produce more pollution than gasoline engines. California has lots of these trucks on the road because it is home to two of the largest ports in the world at Los Angeles and Long Beach, where heavy duty trucks are constantly hauling freight to and from warehouses in the Inland Empire while spewing harmful pollutants into the air. The American Lung Association’s State of the Air report for 2020 said seven of the 10 most ozone-polluted cities in the U.S. are in California, with 98% of its residents living in counties with poor air quality. The rules, which would not take effect until 2024, will require at least 40% of all tractor trailers sold in California to be zero emission by 2035. For smaller trucks, including models like the Ford F, -1.36% F-250, 55% of all sales would be zero emission by 2035. The standard is the toughest for delivery trucks and vans, with 75% of sales required to be zero emission by 2035. California already has similar rules in place for passenger vehicle sales. But no one has yet imposed rules like these for work trucks, which unlike passenger vehicles are purchased with the intent of returning a profit. Critics argue requiring the industry to sell more electric trucks won’t succeed without first requiring companies to buy more of them. Staff for the board said work on such rules is ongoing and added that demand already exists for bulk orders of electric trucks. Nichols said the board plans to adopt rules next year requiring fleets to have a certain percentage of electric trucks. “First you have to make sure the engines and the trucks are going to be available, then you have to ensure there is a market for them,” she said. “We’re proceeding methodically to make that happen.”"}]}