{"article": [{"url": "https://www.marketwatch.com/story/unity-software-ipo-5-things-to-know-about-the-videogame-engine-company-11599838918", "published": 1600373300.0, "headline": "Unity Software IPO: 5 things to know about the videogame-engine company", "body": "Some applications that use Unity's software. Unity Software Unity Software Inc. is known for making software to create videogames, but the company hopes to make the world more like a videogame by pushing its platform to designers from nongaming fields. Founded in 2004, Unity’s main business is its gaming engine, which competes with Epic Games Inc.’s Unreal Engine. Five years ago, however, the company realized its 3-D tools could be used for other applications outside of gaming. “We’re a company born from gaming,” Unity chief executive John Riccitiello said in a filing with the Securities and Exchange Commission. “But we see so much more.” Late Thursday, Unity U, +8.43% priced its initial public offering at $52 a share, according to a person familiar with the matter, after the company on Wednesday raised its price range to $44 to $48 a share from last week’s expectation of $34 to $42 apiece. With 25 million shares in the offering, and options to underwriters for another 3.8 million shares to cover overallotments, Unity stands to raise at least $1.3 billion. Underwriters include Goldman Sachs, Credit Suisse, BofA Securities, and Barclays. Unity will have up to 267.2 million shares outstanding after the offering, including overallotment options, giving Unity a valuation of $13.7 billion, which would more than double the company’s valuation from July 2019 of about $6 billion. The company will have a single class of common stock, but the board reserves the right to issue up to 100 million shares of stock to fight off a hostile takeover. So far in 2020, it has been a good year for IPOs. The Renaissance IPO ETF IPO, +1.98% is up 54%, compared with a 22% gain in the tech-heavy Nasdaq Composite Index COMP, +1.39% and a 4% advance in the S&P 500 index SPX, +0.87%. Unity’s IPO is expected to arrive at the end of a wave of software IPOs, with Snowflake Inc. SNOW, -0.91%, JFrog Inc. FROG, +0.85% and Sumo Logic Inc. SUMO, +0.33% already going public earlier in the week. For more: Red-hot IPO market sends Snowflake surging and JFrog leaping Unity is expected to price its IPO Thursday evening and begin trading Friday morning on the New York Stock Exchange. Here’s what you need to know about the company.Gaming-as-a-service is a new videogame standard, and Unity helps developers make and maintain those games During an age in which everything related to technology is offered “as-a-service,” the videogame industry is also being structured as such, Chris Gardner, Forrester research director, told MarketWatch. Most people consume their movies, TV and music through a subscription service, and videogames are following that trend — They are no longer pieces of software bought in a box, but rather streamed, dynamic and easily updated pieces of software that are downloaded or accessed through a subscription across multiple platforms with in-app purchases. Smaller developers hoping to make games that fit those trends can turn to Unity or Epic Games, which is also known for its popular “Fortnite” game. Unity has offered its gaming engine — a software system that provides a framework in which developers can build their games without having to reinvent the wheel — for free and only starts charging a licensing fee after a certain revenue milestone has been crossed, Gardner said. “Unity is very attractive to independent developers,” Gardner said. Unity estimates that its gaming engine was in 53% of the top 1,000 mobile games on Apple Inc.’s AAPL, +1.74% App Store and Alphabet Inc.’s GOOG, +1.97% GOOGL, +1.82% Google Play in 2019, and that more than 50% of mobile games, PC games and console games combined were made with its engine. The company also notes that 93 of the top 100 game-development studios by global revenue in 2019 were Unity customers. Unity and Epic compete with their gaming engines and bolt-on services for game developers, but Epic, unlike Unity, has its own line of games and game store. Unity brought in $541.8 million in revenue for a $163.2 million loss in 2019, compared with $380.8 million revenue for a $131.6 million loss in 2018. Epic’s annual revenue in 2019 was estimated at $4.2 billion, according to Forrester.IPO timing just happens to coincide with Epic Games kerfuffle Epic Games was dropped from Apple and Google’s app stores when the company loudly disputed how much of a cut the tech giants should get from carrying games like “Fortnite” on Aug. 13. Unity filed its original S-1 with the SEC nine days later. After Apple blocked access to Epic’s Unreal Engine, a judge forced the company to continue allowing access. While there is no “significant threat” to the average game developer from Apple and Google for using Epic’s engine in their games, “it does spook them,” Forrester’s Gardner said. That, in itself, could sway smaller developers to Unity from Epic, he said.Unity’s growth is tied to adoption in nongaming markets In its S-1, Unity said it believes it addresses a total market of about $29 billion “across both gaming and other industries.” “Today, Fortune and Global 500 companies in industries such as architecture, engineering, construction, automotive, transportation, manufacturing, film, television and retail are using Unity across many new use cases, including automobile and building design, online and augmented reality product configurators, autonomous driving simulation, and augmented reality workplace safety training,” Unity said in its S-1. Forrester analyst William McKeon-White pointed out that graphics engines like Unity and Epic’s are already being used in nongaming applications, such as building real-time virtual sets on giant LED-screens in Walt Disney Co.’s DIS, +1.53% “Star Wars” television show “The Mandalorian.” “That’s going to become increasingly common in the future,” McKeon-White said. Both Unity and Epic Games are targeting real-world applications of graphics rendering in areas outside of videogames. VC firms are positioned to be the big winners After the offering, early investors and VC firms combined will own a more than a 50% stake in the company. Sequoia Capital will have a 21.8% stake, Silver Lake with 16.4%, JA Technologies with 7.2%, and D1 Capital Partners with 4.8%. Sequoia was first in with a $5.5 million investment in 2009, while Silver Lake came later with a $250 million investment in 2017. Then, last year, D1 Capital Partners, Sequoia, and Silver Lake, and others bought $525 million in stock from shareholders who were mostly employees. Unity is not shy about acquiring companies Since it was founded in 2004, Unity has acquired more than a dozen companies, with five of those mergers arriving in a recent two-year stretch. In January 2019, Unity bought cross-platform voice and text communication tools provider Vivox for $123.4 million. In September 2019, it bought analytics, messaging and ad campaign management tools company deltaDNA for $53.1 million, followed by a December acquisition of AI and machine learning company Artomatix for $48.8 million. Then in April, Unity bought developer applications company Finger Food Studios Inc. for $46.8 million. Not listed in the S-1 was Unity’s Aug. 20 acquisition of software configuration management company Códice Software for an undisclosed price. Unity said in its SEC filings that it may use some proceeds from the offering to fund acquisitions “that complement and expand the functionality of our platform, add to our technology expertise and bolster our leadership position by providing access to new customers or markets.”"}]}