{"article": [{"url": "https://www.marketwatch.com/story/no-rubbing-elbows-on-wall-street-for-the-foreseeable-future-even-as-firms-start-navigating-back-to-office-2020-06-26", "published": 1593273440.0, "headline": "Hereâ\u0080\u0099s a snapshot of what Wall Streetâ\u0080\u0099s coronavirus protocols look like for returning to work", "body": "There wonâ\u0080\u0099t be much rubbing of elbows on Wall Street this summer. Thatâ\u0080\u0099s the whole point, as major investment banks test-run plans over the summer to bring more employees back to Manhattan offices that emptied out in March as the coronavirus pandemic bore down on New York City and forced New Yorkers to take a historic pause. The city this week hit another milestone with its Phase 2 reopening, following a near three-month lockdown to contain skyrocketing daily COVID-19 cases, hospitalizations and deaths. Restaurants equipped with outdoor seating cooked meals once again for guests. Drinks could be had at sidewalk bars, haircuts booked at salons and barbershops. The real-estate industry got the green light to resume showing apartments. Wall Street, a major source of New York City revenue and jobs, also started to bring a limited number of workers back to the office, albeit under new public health and social measures that aim to prevent a resurgence of deadly COVID-19 infections, which now grip Arizona, Texas and other U.S. states. Read:Texas becomes the first state to reimpose restrictions after lifting stay-at-home order on April 30 Also see: Travelers from high-risk states to New York must self-quarantine; violators could be subject to $2,000 fine Hereâ\u0080\u0099s a snapshot of what Wall Streetâ\u0080\u0099s return-to-work protocols look like. Face coverings, daily wellness checks, staggered elevators and desks, spaced at least 6 feet apart, are part of the reworked landscape. A few firms think cubicles and plexiglass will help, at least on trading and sales floors where staffers for decades have worked shoulder-to-shoulder. For its part, SL Green Realty SLG, -2.92%, a major Manhattan office landlord and the owner of Credit Suisse Group AGâ\u0080\u0099s CS, -0.94% Â North American headquarters at Eleven Madison Avenue, highlighted a host of technologies it might adopt to help smooth the path for its returning tenants, during a second quarter earnings call in April. Overhead thermal scanners, antibody testing stations, and hands-free turnstile features have been explored, so have futuristic ultraviolet light and vapor systems designed to keep commercial spaces free of COVID-19 or other pathogens. â\u0080\u009cThere is not a single thing that we havenâ\u0080\u0099t looked at,â\u0080\u009d said Edward Piccinich, SL Greenâ\u0080\u0099s chief operating officer, during the earnings call. Credit Suisse and other investment banks have studied the issue of offering free antibody tests to employees globally to screen for prior COVID-19 exposure, as part of their new safety plans, the Financial Times reported this week. â\u0080\u009cI think that over the next couple of months, weâ\u0080\u0099re in this collective experience, where landlords are willingly embracing technologies and processes to help get people safely back into buildings,â\u0080\u009d said Nima Wedlake, a principal at Thomvest, a venture-capital firm, where he focuses on early-stage investments in technology and real estate startups. Wedlake also said that before COVID-19, companies were relying more on satellite offices in less expensive cities as a way to cut overhead costs. Wall Street firms said they also are studying their existing suburban footprints to see if it makes sense to shift workers away from densely populated urban cities where infections have rapidly spread. â\u0080\u009cThe question will be, will there be a true dispersion of employees across the country or across the world?â\u0080\u009d Wedlake said. The near-term plan at several Wall Street firms is to keep only about 15% to 20% of their staff on hand in Manhattan over the summer, and to recall more employees after Labor Day, which this year falls on Sept. 7. That gives time for companies to test out staggered shifts and new technologies when Manhattan habitually thins out over the summer. JP Morgan Chase & Co. JPM, -0.57% Â told staff this week it expects â\u0080\u009cemployees will return slowly in waves,â\u0080\u009d to Manhattan and that the firmwide approach is for everyone to follow â\u0080\u009ctheir own returnâ\u0080\u009d to the office. A notice earlier in June to employees said its properties likely would be staffed at 50% or less for the â\u0080\u009cforeseeable future.â\u0080\u009d Thatâ\u0080\u0099s an increasingly common forecast, with a survey released this week by real-estate investment and management firm Jones Lang LaSalle Inc. JLL, -0.77% Â showing that companies globally were looking to avoid exceeding 50% occupancy in buildings in major cities until a vaccine is successfully implemented or local guidelines are relaxed. See: Welcome to New York! See you in two weeks! Dr. Anthony Fauci, a top U.S. infectious disease expert told members of Congress this week that he is optimistic that a vaccine for COVID-19 could be ready by the end of the year or early 2021. On Friday, major U.S. stock indexes tumbled again, capping a volatile week in which the U.S. set a record for cases and Arizona and Texas backtracked on reopening their economies. The Dow Jones Industrial Average DJIA, +0.56% Â ended the session 730 points lower, off 3.3% for the week. While the mood of the market always can change, the pandemic already forced hard-charging Wall Street firms to adapt, shift on a dime, and embrace remote work like never before. As one bankâ\u0080\u0099s chief executive put it: The trend of working from home is here to stay. Related: Fed caps bank dividend payments and suspends share-buybacks for third quarter after stress tests"}]}