{"article": [{"url": "https://www.marketwatch.com/story/trump-asked-chinas-xi-to-buy-us-farm-products-to-help-him-win-re-election-bolton-book-says-2020-06-17", "published": 1592411060.0, "headline": "Trump asked Chinaâ\u0080\u0099s Xi to buy U.S. farm products to help him win re-election, Bolton book says", "body": "President Donald Trump asked Chinese President Xi Jinping to buy U.S. farm products in order to help him win agricultural states in the November election, according to a new book by former national-security adviser John Bolton. In an excerpt published by the Wall Street Journal of Boltonâ\u0080\u0099s forthcoming book, Bolton recounts a meeting between Trump and Xi, writing that the U.S. president â\u0080\u009cturned the conversation to the coming U.S. presidential election, alluding to Chinaâ\u0080\u0099s economic capability and pleading with Xi to ensure heâ\u0080\u0099d win.â\u0080\u009d Bolton continues that Trump â\u0080\u009cstressed the importance of farmers and increased Chinese purchases of soybeans and wheat in the electoral outcome.â\u0080\u009d The Trump administration sued Bolton on Tuesday to delay the publication of the book, titled â\u0080\u009cThe Room Where It Happened: A White House Memoir.â\u0080\u009d The White House claimed the book contains classified information. Advance copies were already in the hands of journalists and book reviewers. Read:Trump administration sues to delay release of John Bolton book. In a recent op-ed published in the Wall Street Journal, Bolton lawyer Charles Cooper accused the White House of using the pre-publication review process to delay the bookâ\u0080\u0099s publishing and to protect the president. He said he sent Boltonâ\u0080\u0099s manuscript to classification specialist Ellen Knight on Dec. 30, 2019. The New York Times reported Bolton also writes that the House of Representatives in its impeachment inquiry should have probed Trump not just for pressuring Ukraine to incriminate his domestic foes, but for a variety of instances when he sought to intervene in law-enforcement matters for political reasons. The Times reported that Bolton writes in the book of episodes in which Trump expressed willingness to halt criminal investigations â\u0080\u009cto, in effect, give personal favors to dictators he liked,â\u0080\u009d citing cases involving major companies in China and Turkey. The White House declined to comment for MarketWatch on Wednesday. Also read:Trump warns Bolton could face criminal charges if his book is released. Bolton was forced out of the White House in January after repeated disagreements on national-security matters. Key Words (January 2020):â\u0080\u0098I believe John Bolton,â\u0080\u0099 says Trumpâ\u0080\u0099s former Chief of Staff Kelly"}]}