{"article": [{"url": "https://www.marketwatch.com/story/55-of-coronavirus-patients-still-have-neurological-problems-three-months-later-study-2020-08-07", "published": 1596964760.0, "headline": "55% of coronavirus patients still have neurological problems three months later: study", "body": "Could the coronavirus lead to chronic illness? While lung scarring, heart and kidney damage may result from COVID-19, doctors and researchers are starting to clock the potential long-term impact of the virus on the brain also. Younger COVID-19 patients who were otherwise healthy are suffering blood clots and strokes. And many “long-haulers,” or COVID-19 patients who have continued showing symptoms for months after the initial infection passed, report neurological problems such as confusion and difficulty concentrating (or brain fog), as well as headaches, extreme fatigue, mood changes, insomnia and loss of taste and/or smell. Indeed, the CDC recently warned that it takes longer to recover from COVID-19 than the 10- to 14-day quarantine window that has been touted throughout the pandemic. In fact, one in five young adults under 34 was not back to their usual health up to three weeks after testing positive. And 35% of surveyed U.S. adults overall had not returned to their normal state of health when interviewed two to three weeks after testing. Now a study of 60 COVID-19 patients published in Lancet this week finds that 55% of them were still displaying such neurological symptoms during follow-up visits three months later. And when doctors compared brain scans of these 60 COVID patients with those of a control group who had not been infected, they found that the brains of the COVID patients showed structural changes that correlated with memory loss and smell loss. Related:Dr. Osterholm: Americans will be living with the coronavirus for decades And that’s not exclusive to adults. A case study published in JAMA Neurology in June highlighted four U.K. children with multisystem inflammatory syndrome, a severe and potentially fatal condition that appears to be linked to COVID-19. These children developed neurological manifestations such as headaches, muscle weakness, confusion and disorientation. While two of the kids recovered, the other two continued to show symptoms, including muscle weakness so severe that they needed a wheelchair. Scientists are only just beginning to understand the ways in which the novel coronavirus that has infected more than 19 million people globally and killed 715,000 and counting attacks the body. Indeed, the most severe illness and complications appear to stem from the body’s immune response to the viral invader, as opposed to the virus itself causing damage. And some preliminary studies suggest that this immune response could damage the nervous system. Related:‘Will the public be ready for a vaccine?’ Many Americans say they won’t get the coronavirus vaccine if one is developed The University College of London warned about a potential brain damage “epidemic” caused by COVID-19 in the journal Brain last month. The study examined 43 COVID patients treated in London in April and May, and found 10 cases of “temporary brain dysfunction” and delirium; 12 cases of brain inflammation; eight cases of strokes; and eight cases of nerve damage. “We should be vigilant and look out for these complications in people who have had COVID-19,” said joint senior author Dr. Michael Zandi in a statement. “Whether we will see an epidemic on a large scale of brain damage linked to the pandemic — perhaps similar to the encephalitis lethargica outbreak in the 1920s and 1930s after the 1918 influenza pandemic — remains to be seen.” There is some precedent for a pandemic creating a wave of neurological health problems. Svenn-Erik Mamelund, a social scientist who has studied the demography of epidemic diseases for more than 20 years, told Yahoo that there was a jump in reports of neurological and psychiatric problems worldwide for years after the 1918 flu pandemic. Survivors complained of trouble sleeping, dizziness, depression and difficulties at work. And many people reported similar neurological symptoms after the 1889 Russian flu and the 2009 H1N1 pandemic. “ “Despite their illness being ‘over,’ they are having a lot of trouble returning to normal life.” ” — Dr. Zijian Chen Dr. Zijian Chen, the medical director of Mount Sinai’s Center for Post-COVID Care in New York, told MarketWatch that he has also been seeing patients with extreme fatigue and difficulty concentrating for several weeks to months after they purportedly recovered from the virus. “And this is important because, despite their illness being ‘over,’ they are having a lot of trouble returning to normal life,” he said. While it’s too soon to say whether such post-COVID conditions will be chronic, Chen is worried about recovered patients being able to return to work and school. “Patients are going to be somewhat debilitated, so their ability to work, their contribution to the workforce, to the domestic product, is going to be reduced,” he said. “It will affect society on many levels if the rates [of infection and long-term illness] persist to be this great.” Indeed, some of these long-term symptoms are akin to myalgic encephalomyelitis, also known as chronic fatigue syndrome (or ME/CFS), which is a neuroimmune syndrome marked by brain fog and extreme fatigue. And ME/CFS already has an estimated $17 billion to $24 billion impact on the U.S. economy based on medical bills and lost income from many patients being unable to work, according to the CDC. Related:Is COVID-19 considered a disability? Are you entitled to take time off without losing your job? Here’s what you should know In fact, CNN’s Chris Cuomo, who was diagnosed with COVID-19 in March, revealed on his show last month that he still hadn’t fully recovered. And ME/CFS has been suggested to him as a reason why. “I’ve got an onset of clinical depression, which is not sadness. People keep saying to me, ‘Don’t be sad.’ I’m not sad. I’m depressed. It’s different. I can’t control it,” he said. iframe.twitter-tweet { width: 100% !important; } A number of studies are underway to better understand how and why COVID-19 affects the brain. Some early theories, as listed by Johns Hopkins University, include severe cases of infection attacking the brain or spinal cord, as some cases reported in China and Japan found the virus’s genetic material in spinal fluid, and a Florida case found viral particles in brain cells. Alternatively, the overaggressive immune system response to the viral infection could lead the body to inadvertently attack itself. Some other effects of the virus, such as fevers or organ failure in worst-case scenarios, could also cause brain dysfunction. “So much of the focus right now still is how many people are getting sick and how many people are dying,” Dr. Chen said — which is natural considering the country remains in a protracted first wave of infections, including 11 straight days with 1,000-plus fatalities. “But it’s not just black and white, about getting better or dying,” he said. “There’s a whole gray spectrum of illness that can happen after COVID-19 that we haven’t even fully learned about yet.” Follow more of MarketWatch’s coronavirus coverage here."}]}