{"article": [{"url": "https://www.marketwatch.com/story/why-the-u-s-economy-could-approach-stall-speed-after-stimulus-talks-collapse-11602066946", "published": 1602061340.0, "headline": "Why the U.S. economy could approach â\u0080\u0098stall speedâ\u0080\u0099 after stimulus talks collapse", "body": "The danger with flying too low to the ground… AFP via Getty Images Another tweet sent the markets into upheaval. This time it was the announcement from President Donald Trump that his side will end negotiations on fiscal stimulus. Granted, it wasnâ\u0080\u0099t clear that idea ever had much support in the Republican-controlled U.S. Senate in the first place. The Dow Jones Industrial Average DJIA, +0.56% ended 375 points lower on Tuesday, and the Nasdaq Composite COMP, +1.39% dropped to 7% below its record close. Gregory Daco, chief U.S. economist at Oxford Economics, said the move could be a watershed moment for the worldâ\u0080\u0099s largest economy. Yes, consumer spending held up after the expiration of the $600 weekly federal unemployment benefits at the end of July. But that is because of the savings that had been built up during the spring and summer, thanks in part to those benefits, as well as the inability to go out to shops and spend. The end of the five-week Lost Wages Supplemental Payment Assistance program â\u0080\u0094 thatâ\u0080\u0099s Trumpâ\u0080\u0099s executive order giving $300 a week in extra aid, when states match it with $100 â\u0080\u0094 will create an income â\u0080\u009ccliffâ\u0080\u009d valued at roughly $600 billion annualized, Daco says. â\u0080\u009cWithout faster job growth â\u0080\u0094 unlikely at this stage of the recovery â\u0080\u0094 or increased fiscal aid, households, businesses and state and local governments will be increasingly susceptible to a deterioration of the health situation,â\u0080\u009d he says. The drag to gross domestic product, when coupled with the lack of support to businesses, and state and local governments, will be 1.5%, with the fourth quarter approaching â\u0080\u009cstall speed,â\u0080\u009d he says. That is perilous on the eve of flu and election season. Morgan Stanleyâ\u0080\u0099s global economics team is more upbeat, saying the world economic recovery will continue, if moderate, through the winter. The team bluntly notes the unemployment during the pandemic has been focused on low-wage industries. At the peak in April, 68% of all employment losses were concentrated in low-wage industries, which accounted for only 43% of pre-COVID payrolls in February. It also says that the hit from the pandemic to state and local government finances hasnâ\u0080\u0099t been as severe as anticipated. â\u0080\u009cStates have not shifted into full-on austerity mode for now because they are able to use reserve funds, and they are still deploying federal aid that was provided under the [Coronavirus Aid, Relief, and Economic Security Act],â\u0080\u009d the Morgan Stanley team notes. What does that mean for the market? Julian Emanuel, chief equity and derivatives strategist at BTIG, said Tuesdayâ\u0080\u0099s events open up the potential for downside to the S&P 500â\u0080\u0099s 200-day moving average of 3,113 (which would be a 7% drop). â\u0080\u009cWhile weakness between now and Inauguration Day (1/20/21) is likely a buying opportunity â\u0080\u0094 with low rates, eventual further stimulus and medical progress on the virus supportive elements for 2021 â\u0080\u0094 we are reminded that in a period of elevated volatility and uncertainty that the long run is made up of a series of short runs which are frequently gut-wrenching,â\u0080\u009d he said. The buzz Trump pitched the idea of stand-alone bills for stimulus and aid to airlines and small businesses. The House Judiciary committee report on technology giants was unveiled, saying Apple AAPL, +1.74%, Amazon AMZN, +3.01%, Facebook FB, +0.26% and Alphabet GOOG, +1.97% unit Google â\u0080\u009cnot only wield tremendous power, but they also abuse it by charging exorbitant fees, imposing oppressive contract terms, and extracting valuable data from the people and businesses that rely on them.â\u0080\u009d It recommended â\u0080\u009cstructural separations and line of business restrictions,â\u0080\u009d and creating a presumption that any future merger is anticompetitive until proven in the publicâ\u0080\u0099s interest. It is a possible blueprint for action if Democrats sweep to power in the November elections. The Supreme Court on Wednesday will hear from lawyers of Google and Oracle ORCL, +0.42% over their long-running copyright case over Android code. The minutes of the last Federal Reserve interest-rate-setting meeting are due. The future plans for quantitative easing are unclear, so any discussion of that topic could be market moving. New York Fed President John Williams and Chicago Fed President Charles Evans both are due to speak after the minutes are published, and consumer credit data will be published. Wednesday night, after stock markets have closed, will feature the debate between Vice President Mike Pence and Democratic vice-presidential nominee Kamala Harris. Levi Strauss LEVI, -2.24% jumped 11% after the jeans maker recorded a surprise profit in its fiscal third quarter. Sirius XM SIRI, -2.01% rose in premarket trade after Bloomberg News reported the satellite radio provider is close to re-signing Howard Stern to a $120 million per year contract. The markets Not too bad. Stock futures rose, with futures on the Dow industrials YM00, +0.82% up 225 points. The yield on the 10-year Treasury TMUBMUSD10Y, 0.777% rose to 0.78%. The dollar DXY, -0.58% was steady. Random reads A womenâ\u0080\u0099s doubles tennis match at the French Open is being investigated for possible match fixing, after several hundred thousand euros were wagered on a single game for the server to lose. RIP Eddie Van Halen. Hereâ\u0080\u0099s a ranking of the eponymous rock groupâ\u0080\u0099s songs, from worst to best. Speaking of lists â\u0080\u0094 scientists have identified 24 planets with conditions that are better for life than Earth. Need to Know starts early and is updated until the opening bell, butÂ sign up hereÂ to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern."}]}