{"article": [{"url": "https://www.marketwatch.com/story/black-tech-workers-hope-nationwide-protests-will-force-industry-to-be-more-inclusive-2020-06-09", "published": 1592203820.0, "headline": "Black tech workers hope nationwide protests will force industry to be more inclusive", "body": "With the country entering its third week of protests over social and racial justice, the spotlight has been cast again on the state of blacks in the workforce — in particular, the glacial progress of diversity in tech. It’s a topic that has flickered for decades, with fitful attempts at heightened hiring, training, representation at the C-level and on boards, and venture funding. And not much has changed. Tiffani Ashley Bell put the problem in stark terms in a Medium post published June 4: “Are we willing to reckon with the role the technology sector played in the moment we find ourselves? Are we willing to reckon with the founder of a company that draws an extraordinary amount of revenue from cities (aka tax dollars) holding fundraisers for a president who sends asylum seekers to their deaths? Are we willing to reckon with investors who think investing in black entrepreneurs is an act of charity―and thus, offer embarrassing, token amounts? Are we willing to stop sponsoring and attending technology conferences with mostly white male speaker lineups? What are we willing to do differently to dismantle white supremacy in the technology sector and because of technology’s pervasive influence, dismantle white supremacy in society?” “I haven’t seen dramatic growth or any sustained effort — not that they haven’t tried,” Bell, executive director at social venture The Human Utility, told MarketWatch in a phone interview. “Through my social networks, I see good things happening at Salesforce CRM, +2.21% , but I couldn’t tell you of anywhere else.” Read: Many tech employees are more ‘woke,’ but changing monolith companies is not easy The confluence of civil unrest, a pandemic and a deep recession has prompted several black members of the tech community to speak out about ongoing inequities in the industry. “Silicon Valley speaks of meritocracy… but I’ve been turned down by at least 300 VCs there,” Anita Gardyne, CEO of Oneva Inc., an Oakland, Calif.-based developer of apps that let employers offer elder, infant and child care. She said Oneva hasn’t “gotten a penny” from the white VC community during its six years of existence, though Microsoft Corp. MSFT, +2.48% is among its five enterprise customers, it landed a contract with a national distributor and it recently won a technology award from TechCrunch. “I can go from story to story — from a prominent white female VC who told me in a bar in Houston that, ‘I cannot invest in you people’” to “a young Asian man in San Francisco who told me I was too old.” (His investment went to a similar company founded by a former Google employee.) Gardyne said she “scrapped and scrambled” to raise $2.7 million through tech executives. For 25 years, Deanna Ransom has worked in tech, where she has learned to develop a thick skin and work tirelessly, all while making less money. “You’re not wanted, but if you produce twice as much, you are tolerated,” Ransom, head of marketing for Televerde, a sales and marketing technology company, told MarketWatch in a phone call. “It sometimes felt like a million paper cuts to the soul.” Ransom said she has felt tempted to push back, but hasn’t out of fear of being blackballed and hurting her family. A widow of 11 years, Ransom has three children. But with demonstrators full-throated in their demand for transformative change, she said she’s more willing to speak up. “I work at an organization that truly values diversity,” Ransom says. Cries for diversity from the nation’s streets are finding their way to Silicon Valley and other major tech hubs, rekindling a generational debate. Despite yearslong efforts by companies to diversify their tech workforces, there is little to show. Black people accounted for 9% of workers in core information-technology occupations in the U.S. last year, compared with 8% in 2015 and 7% in 2010, according to U.S. Bureau of Labor Statistics. Blacks represent 13.4% of the U.S. population, according to the most recent government estimates. What’s more, just four Fortune 500 CEOs are black, compared with a peak of six in 2012, according to Fortune magazine. U.S. and United Kingdom executive teams were 13% ethnic minorities in 2019, up from 7% in 2014, even though nearly 40% of the U.S. is nonwhite, according to McKinsey. Women accounted for 20% of executive teams in 2019, up from 15% in 2014. “There is a lot of activity in the PR of it, but not a ton of movement,” Sherrell Dorsey, a data journalist and founder of The Plug, a digital media company reporting on the black innovation economy, told MarketWatch. “[Workforce] representation hasn’t changed much despite grandiose gestures.” For starters, she said, “There are systemic challenges to hiring democratization.” There are exceptions, such as Microsoft Chairman John Thompson, the former CEO of Symantec Corp. who is now a venture capitalist; TaskRabbit President Sarah Rose; and LightSpeed CEO Dax Dasilva. Last month, Zoom Video Communications Inc. ZM, +2.89% named Damien Hooper-Campbell as its first chief diversity officer. Stefania Pomponi, founder and president of influencer marketing agency Clever, based in Palo Alto, Calif., is looking to recruit a black chief financial officer after its former CFO, a white man, resigned. “We always thought we were casting a wide net of diversity, but we have failed to do so,” said Pomponi, who is Asian American. “There is a new sense of urgency for us, to change our C-suite — and I hope others follow.” But the composition of tech workforces remain largely the same, with white and Asian males dominating the scene. Coupled with the high price of living in the San Francisco Bay Area, some blacks have moved to Atlanta, where job opportunities and funding are more readily available. And, with large tech companies open to hiring work-at-home employees regardless of their zip code, the migration to Atlanta and other large cities outside of California may accelerate, Bell said. In the interim, an unlikely quilt of corporations are speaking up and taking action. Walt Disney Co. DIS, +1.53% ($5 million), McDonald’s Corp. MCD, -0.43% , Apple Inc. AAPL, +1.74% , Amazon.com Inc. AMZN, +3.01% ($10 million), Starbucks Corp. SBUX, +0.53% , Cisco Systems Inc. CSCO, +0.15% ($5 million), Intel Corp. INTC, -1.03% ($1 million), Facebook Inc. FB, +0.26% ($10 million), Twitter Inc. TWTR, -0.23% ($3 million), Google parent Alphabet Inc. GOOGL, +1.82% GOOG, +1.97% ($12 million), Verizon Communications Inc. VZ, +0.23% ($10 million) and others have all vowed to pledge to nonprofit social-justice organizations. “It is a very tense time and a very upsetting time for a lot of people,” Slack Technologies Inc. WORK, +3.36% CEO Stewart Butterfield told MarketWatch, after opening the company’s earnings call Thursday with a statement on the nationwide demonstrations. “It was important to acknowledge what is happening. It would be strange not to say anything about it.” He added that Slack is considering broader action, but declined to share more. Butterfield and his partner, Away co-founder Jen Rubio, pledged to make a $700,000 donation plus match $300,000 to Black Lives Matter, the NAACP Legal Defense and Educational Fund, and several other organizations. On Monday, Coupa Software Inc. COUP, +4.45% CEO Rob Bernshteyn opened his company’s quarterly results call with comments on the protests. “I can’t understand why anyone wouldn’t comment on such an important topic,” he told MarketWatch in a phone interview. Times and attitudes could be changing. On Friday, Reddit Inc. co-founder Alexis Ohanian stepped down from the board to make room for a black candidate. Several hours later, Facebook Chief Executive Mark Zuckerberg, in a note to employees, addressed protests touched off by the death of George Floyd, a black man in Minneapolis whose neck was pinned under the knee of a white police officer. “To members of our black community: I stand with you. Your lives matter. Black lives matter,” Zuckerberg wrote. He also vowed to review company policies concerning the state’s use of force, voter suppression and content moderation as the company faces backlash from many of its own workers over its inaction on controversial posts by President Donald Trump. At about the same time, NFL Commissioner Roger Goodell, who for years has been reluctant to address racial issues, issued a strong video message. “We, the National Football League, condemn racism and the systematic oppression of black people,” Goodell said. “We, the National Football League, admit we were wrong for not listening to NFL players earlier and encourage all players to speak out and peacefully protest. We, the National Football League, believe that black lives matter.” See also: Companies are speaking out against racial injustice after the killing of George Floyd, but they have to back it up with action Encouraging words, yes, but there is an element of been-there-seen-that-before among skeptical observers who point to persistent unconscious bias in the hiring, training and promotion of black workers in tech. “This presents an opportunity for change, but it remains to be seen if companies take action,” said Melinda Briana Epler, CEO of Change Catalyst, which works with the tech industry on diversity and inclusion. If organizations like police departments can be reshaped, the same can happen at tech companies, she added. “Companies could change because of employee culture,” she said, in a nod to efforts that companies like Facebook and Alphabet have made to alter corporate culture and policies. “I’m always hopeful,” adds Gardyne. “I have never seen a movement like this. Maybe it changes things. I remain hopeful.”"}]}