{"article": [{"url": "https://www.marketwatch.com/story/kraft-heinz-to-cut-2-billion-in-costs-2020-09-15", "published": 1600156340.0, "headline": "Kraft Heinz to cut $2 billion in costs", "body": "Kraft Heinz Co. said it plans to cut $2 billion in costs over five years, returning to the strategy that drove the company's formation in a merger five years ago. Chief Executive Miguel Patricio said in an interview that the company would make cuts more strategically than during the tenure of his predecessors, when the company's brands lost billions of dollars in value. Mr. Patricio, who became CEO last year, said he plans to use some of the savings to re-energize sales of certain brands, increasing marketing spending by 30% overall. He said the company would detail plans for the cuts and for brands it will target for further investment in an investor presentation Tuesday. \"In the past, we made decisions that were too short term,\" Mr. Patricio said. \"We are changing that mind-set.\" During the coronavirus pandemic, Kraft Heinz's brands such as Oscar Mayer deli meat and Kraft macaroni and cheese have benefited along with those of other food makers from consumers stockpiling groceries. Kraft Heinz has logged stronger sales growth in the past six months than it has in years. Still, the company has lost market share in some categories. Analysts have said Kraft Heinz is losing shoppers to lower-priced store brands of cheese, deli meat and coffee. That is hurting sales of Kraft Heinz products including its century-old Maxwell House brand. Kraft Heinz recorded in July $2.9 billion in impairment charges, which resulted in the company swinging to a loss in the second quarter. The hit came after it had reduced the value of its assets by nearly $17 billion last year. Kraft Heinz said at the time that consumers had gravitated toward niche brands often viewed as healthier or more innovative. The competition drove pricing lower and pressured the company's margins. Mr. Patricio has previously said that some brands could no longer generate profit margins as high as they once did. But the company as a whole won't have to sacrifice profitability for sales growth, he said in the interview. \"Do we need to reduce margins to grow brands? The answer is no.\" After the company was created in 2015 from the merger of Kraft Foods Group Inc. and H.J. Heinz Co., executives spent several years removing some $1.7 billion in annual costs through job reductions, lower administrative costs, procurement savings and other measures. Mr. Patricio said he is reorganizing the company to be more focused on fulfilling the needs of contemporary consumers. He has brought in executives from other companies, including Carlos Abrams-Rivera from Campbell Soup Co. to lead its U.S. business, and leaders from J.M. Smucker Co. and Mike's Hard Lemonade. Write to Annie Gasparro at annie.gasparro@wsj.com"}]}