{"article": [{"url": "https://www.marketwatch.com/story/treasury-yields-follow-stocks-higher-amid-hopes-of-eu-fiscal-stimulus-package-2020-06-19", "published": 1592586200.0, "headline": "Treasury yields virtually unchanged as coronavirus worries anchors bond market", "body": "U.S. Treasury yields came off their highs Friday, ending where they started the week, amid renewed worries that the path of the U.S. economic recovery in the face of rising COVID-19 cases. What are Treasurys doing? The 10-year Treasury note yield TMUBMUSD10Y, 0.777% was virtually unchanged at 0.696%, and flat for the week. The 2-year note rate TMUBMUSD02Y, 0.156% fell 0.7 basis point to 0.186%, and down 0.5 basis point this week. The 30-year bond yield TMUBMUSD30Y, 1.576% rose 0.8 basis point to 1.469%, contributing to a weekly rise of 2.1 basis points. What’s driving Treasurys? An initial rally in equities helped to sap appetite for government bonds, before dissipating by the end of the session as fears around the coronavirus resurfaced. The World Health Organization signaled that the pandemic is entering a new phase.And Apple said it would re-close nearly a dozen stores in some U.S. states due to rising cases of COVID-19. Earlier the market had reacted to a report that U.S. Secretary of State Michael Pompeo and China’s high-ranking foreign policy official Yang Jiechi had agreed to honor all the commitments made under the phase one deal signed in January. His comments come as analysts note China’s buying of farm goods are on pace to fall short of its promised amount. Still, tensions between the two countries continue to rattle investors amid worries that both the Trump administration and the Democrat Presidential candidate Joe Biden will take a tough stance on China. In Europe, European Central Bank President Christine Lagarde warned EU leaders to move forward with a recovery plan or risk a turn in market sentiment, lifted by hopes that European government would agree on a fiscal stimulus package for the 27-member economic bloc. The EU council are meeting on Friday to discuss the recovery package, though few expect an agreement to be reached this week. As for the Federal Reserve, Boston Fed President Eric Rosengren said the U.S. economy isn’t likely to have a fast recovery and more support will likely be needed from the Fed and Congress. While Fed Vice Chairman for Supervision Randal Quarles said “there’s probably never been more uncertainty about the economic outlook.”What did market participants’ say? “Apple’s decision to re-close stores in Arizona, Florida, North Carolina and South Carolina demonstrates that businesses are also sensitive to virus development and will respond to protect their employees and customers,” wrote Aneta Markowska, chief financial economist at Jefferies, in a note."}]}