{"article": [{"url": "https://www.marketwatch.com/story/trump-biden-blast-each-other-on-economy-coronavirus-in-fiery-first-debate-2020-09-29", "published": 1601423360.0, "headline": "Trump, Biden blast each other on economy, coronavirus in fiery first debate", "body": "President Donald Trump and Joe Biden blasted each other over the economy, handling of the coronavirus and the Supreme Court on Tuesday night, in a fiery and at-times personal first presidential debate. Read: Trump, Biden face off in first presidential debate: live blog Frequently talking over each other in their first of three debates, Trump and Biden sparred first over the Supreme Court and the president’s nomination of Amy Coney Barrett to fill the seat of the late Justice Ruth Bader Ginsburg. Biden warned that the Affordable Care Act could be overturned by the high court, and charged that Trump “has no plan” for health care. Trump defended his nomination of Barrett by saying, “We won the election and therefore we have the right to choose her.” On stage at Case Western Reserve University in Cleveland, Trump charged that Biden would “close down the whole country” to halt the spread of the coronavirus and claimed that his administration had built the “greatest economy in history.” Trump again blamed the damage to the U.S. economy from the virus on China, as he frequently has in recent months. The virus first appeared in the Chinese city of Wuhan in late 2019. Now read:U.S. September job report is going to show economy entering a weaker phase. The first debate came as the number of confirmed cases of the coronavirus that causes COVID-19 rose to 33.4 million, a day after the global death toll reached 1 million. The U.S. continues to lead in case numbers and fatalities, with 7.2 million confirmed cases and 205,091 deaths, a fifth of the global total. Coronavirus update:Global case tally 33.4 million, death toll above 1 million, and that’s likely an underestimate, says WHO expert. Trump also charged that the death toll under Biden would have been in the “millions,” as Biden attacked him for his handling of the pandemic. “It is what it is because you are who you are,” Biden said. The first face-off between the two was marked by occasional personal barbs, such as Trump saying “There’s nothing smart about you, Joe,” and Biden telling Trump, “Will you shut up, man?” U.S. stock futures YM00, +0.82% rose slightly during the debate, after a day in which stocks DJIA, +0.56% SPX, +0.87% COMP, +1.39% dropped across the board. Now read:Here’s how the stock market tends to perform after the first presidential debates. In addition to the economy and other issues, Trump and Biden clashed over ballot fraud and the outcome of the election. Trump said he was “counting” on the Supreme Court to “look at the ballots,” after he again charged that there is fraud in mail-in voting. Biden said Trump is “just afraid of counting the votes.” Experts have said fraudulent ballots are rare. The debate also focused on racial injustice in the U.S., as the country reckons with the deaths of Black people at the hands of police. Biden said there are “bad apples” among police officers but that most of them are “honorable men and women.” Trump told his opponent, “we believe in law and order,” and said Biden couldn’t utter those words because if he did, “you’re going to lose all of your radical supporters.”"}]}