{"article": [{"url": "https://www.marketwatch.com/story/uk-signs-deals-with-biontech-pfizer-and-valneva-for-covid-19-vaccines-2020-07-20", "published": 1595222360.0, "headline": "U.K. signs deals with BioNTech, Pfizer, and Valneva for COVID-19 vaccines", "body": "The U.K. Government said on Monday that it has secured early access to 90 million vaccine doses of two possible COVID-19 vaccines being developed by a partnership between Germany’s BioNTech and U.S. drugmaker Pfizer, as well as one by French group Valneva. The business ministry said it had signed an agreement with the BioNTech/Pfizer alliance PFE, -0.27% for 30 million doses. Delivery of an initial 10 million doses is expected to start by the fourth quarter 2020, subject to clinical success and regulatory approval, with a further 20 million doses to be delivered in 2021. Listed on Nasdaq, BioNTech BNTX, +1.23% is one of 17 firms worldwide that has started human trials on a vaccine against COVID-19. It uses synthetic messenger RNA (mRNA) technology to develop a vaccine, a process that is faster than traditional methods. The government also said it had agreed a deal with Valneva for 60 million doses, with the option to acquire a further 40 million If the vaccine is proven to be “safe, effective and suitable.” The vaccine candidate will be manufactured at Valneva’s facilities in Livingston, Scotland, with the government expected to contribute to U.K. clinical studies costs. “This new partnership with some of the world’s foremost pharmaceutical and vaccine companies will ensure the U.K. has the best chance possible of securing a vaccine that protects those most at risk,” Business Secretary Alok Sharma said in a statement. However, it is still not certain which of these experimental vaccines may work. Kate Bingham, chair of the Vaccine Taskforce, said the U.K. was investing in a diverse portfolio of vaccine candidates to maximize the chances of finding a vaccine quickly that meets the U.K.’s rigorous regulatory and safety standards. But she cautioned against being complacent or over optimistic. “The fact remains we may never get a vaccine and if we do get one, we have to be prepared that it may not be a vaccine which prevents getting the virus, but rather one that reduces symptoms,” Bingham said. The announcement came as GlaxoSmithKline GSK, +1.52% said on Monday that it was taking a stake in German vaccines maker CureVac, the latest move by a major drugmaker to boost capabilities to fight pandemics. Glaxo said CureVac’s mRNA technology would complement its own capabilities. The U.K. government had previously announced a deal with AstraZeneca AZN, +1.16% for the drugmaker to produce 100 million doses of its potential vaccine being developed in partnership with the University of Oxford. On Monday, the business ministry also said it had secured treatments containing COVID-19-neutralizing antibodies from AstraZeneca to protect people who can’t be vaccinated. Read:AstraZeneca made a bet on Moderna in 2013. Here’s what it’s worth now The government is aiming to get 500,000 volunteers to sign up to join studies by October through a new National Health Service vaccine research registry website."}]}